[
  {
    "serial_number": "281880",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: الفرق والردود الكتاب : الموفي بمعرفة التصوف والصوفي المؤلف : كمال الدين أبو الفضل جعفر بن ثعلب الأدفوي المصري ( 685 - 748 هـ ) حققه وقدم له وعلق عليه : الدكتور محمد عيسى صالحية [ ت 1431 هـ ] الناشر : مكتبة دار العروبة للنشر والتوزيع - الكويت الطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nالكتاب : الموفي بمعرفة التصوف والصوفي المؤلف : كمال الدين أبو الفضل جعفر بن ثعلب الأدفوي المصري ( 685 - 748 هـ ) حققه وقدم له وعلق عليه : الدكتور محمد عيسى صالحية [ ت 1431 هـ ] الناشر : مكتبة دار العروبة للنشر والتوزيع - الكويت الطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nالمؤلف : كمال الدين أبو الفضل جعفر بن ثعلب الأدفوي المصري ( 685 - 748 هـ ) حققه وقدم له وعلق عليه : الدكتور محمد عيسى صالحية [ ت 1431 هـ ] الناشر : مكتبة دار العروبة للنشر والتوزيع - الكويت الطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nحققه وقدم له وعلق عليه : الدكتور محمد عيسى صالحية [ ت 1431 هـ ] الناشر : مكتبة دار العروبة للنشر والتوزيع - الكويت الطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nالناشر : مكتبة دار العروبة للنشر والتوزيع - الكويت الطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nالطبعة : الأولى ، 1408 هـ - 1988 م عدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nعدد الصفحات : 80 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 19 ربيع الأول 1442\nتاريخ النشر بالشاملة : 19 ربيع الأول 1442",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 1
  },
  {
    "serial_number": "281881",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 1,
    "volume_number": 1,
    "text": "كتاب نادر في نقد الصوفية الموفى بمعرفة التصوف والصوفي تأليف الإمام كمال الدين أبي الفضل جعفر بن ثعلب الأدفوي المصري (685 - 748 هـ) حققه وقدم له وعلق عليه الدكتور محمد عيسى صالحية مكتبة دار العروبة للنشر والتوزيع الكويت",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 2
  },
  {
    "serial_number": "281882",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 3,
    "volume_number": 1,
    "text": "جميع الحقوق محفوظة الطبعة الأولى 1408 هـ - 1988 م مكتبة دار العروبة للنشر والتوزيع ص ب: 26223/ الصفاة الرمز البريدي: 13123 الكويت",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 3
  },
  {
    "serial_number": "281883",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 5,
    "volume_number": 1,
    "text": "بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ  تمهيد شهد القرن الثاني الهجري ظهور الحركة الصوفية، حين بدأ إعراضُ النَّاس عن السبيل السويّ من مراقبةِ اللَّه وخشيته وذكره في السِّرّ والعلَن والزهد في الدُّنيا. فقد هالَ جماعةَ الصالحين تكالبُ النَّاس على الدُّنيا. واستباقهم للانهماكِ في الملذّاتِ والملاهي، فانتحوا جانبًا متجهين إلى الحقِّ سبحانَه، متبتِّلينَ، يتلُونَ كتاب اللَّه، ويقومونَ الليلَ تهجدًا وتهليلًا بالسرِّ والعلَن. وأخذَ جماعةٌ من هؤلاءِ على أَنفسهم تبيين السلوك العملي للصوفيّة، فوصف المحاسبي في كتابه \"الرعاية لحقوق اللَّه تعالى\" سلوك الصوفية بأسلوب علمي. وكانت مسالك الصوفية حتَّى القرن السادس الهجري بصورة عامةٌ قريبةٌ إلى الزهد، مع ما خَالَطَها في بعض الأحيان من ابتعادٍ عن جادة الصواب. غير أن الأحداثَ الجسامَ التي تعاقبت على الدولة الإسلامية منذ أواخر القرن السادس الهجري وأوائل القرن السابع الهجري، أَوجدت ردة فعل معاكسة، فانصرف بعضهم عن الحياة وشؤونها ومالوا إلى التواكل، وغدا الزهد في أعرافهم نوعًا من اللامبالاة يصل لدرجة الخنوع.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 4
  },
  {
    "serial_number": "281884",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 6,
    "volume_number": 1,
    "text": "لقد كانت البداية حين عقد الأيوبيون العزمَ على التصدّي لتيار الفكر الشيعي إثر انهيار الدولة الفاطمية؛ إذ أنشأ الأيوبيون العديد من المدارس ودور الحديث في مصر والشام واستدعي علماء وفقهاء السُّنَّة ليقوموا بدورهم في تلك المؤسسات، فأصبحت مدن إسلامية كثيرة مثل الإسكندرية، والقاهرة، وقوص، وأسيوط، والقدس، وحلب، ودمشق، وطرابلس، مراكزَ نابضة لعلوم السنَّة والفكر السنِّي. ثم جاءت الهجمة الصليبية الشرسة لتُضيف أعباءً أُخرى، حيث ألقت بكاهلها على صلاح الدِّين، فعمل على تثبيت عروبية وإسلامية البلاد التي كانت مطمع الغزاة الجدد، فأقام الخوانق والرُّبط والزوايا والتكايا، إضافة إلى المساجد والمدارس ودور الحديث والبيمارستانات، وكان هدف صلاح الدِّين من وراء ذلك النهوض بالشعور الديني عند المسلمين، ورفع استعدادات الأمة الإسلامية لمقاومة الأخطار التي تتهددها. واحتل جماعة من الناس تلك الأماكن، امتهنوا الذكر وقراءة القرآن. وسلكوا السبيل القويم، وكانوا نماذج خيرة للأتقياء والعبَّاد. ولكن تلك الأماكن ما لبثت أن أصبحت ملجأً وملاذًا لكل طالبة راحة، حيث يجد فيها ضالته من الطعام واللباس والشراب دون عناء يذكر، وتلا ذلك ازدياد أعداد المنتظمين في سلك الصوفية، لا سيما بعد تضخم عدد الخانقات والرُّبط والزوايا والتكايا، ومبالغة الناس في حبس الأوقاف عليها، وتباري السلاطين والأمراء والأغنياء في تقديم الأموال والهدايا لمرتاديها. فسهلت حياة المتصوفة ونعموا بعيشة مترفة باذخة، قادت إلى تفشي البدع فيما بعد. وإزاء ذلك فقد كثر ادّعاء التصوف، بقصد التعيش، فأمّ العديدون الخانقات، ولبسوا الصوف، وحلقوا الرؤوس، ولكنهم لم يتخلقوا بأخلاق",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 5
  },
  {
    "serial_number": "281885",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 7,
    "volume_number": 1,
    "text": "الزهاد أو الصوفية، وغدا الصوفي على الأغلب، رجلًا أكولًا، كثير الفضول، يُضرب بتطفُّله المثل، فقالوا: \"نعوذ باللَّه من النَّار، ومن الصوفي إذا عرف باب الدار\". وفي وصفٍ آخر لحالهم بأنهم \"أكلة، بطلة، سطلة، لا شغل لهم ولا مشغلة\". وعرَّف كثير من الفقهاء جماعة المتصوفة \"بأنهم رجال يظهرون الإسلام، ويبطنون فاسد العقيدة، في أرجلهم جماجم وعذباتهم من قدام\" (1) . ومما زاد في تكالب جماعات من النَّاس على الانضواء في سلك الصوفية، وقوع الهجمة التترية المغولية المدمرة على العالم الإسلامي، وما أورثته في النفوس من شعور بالمرارة وخيبة الأمل، وما أتصف به ذلك العصر من شظف في العيش نتيجة القحط والجدب فاستدامت المجاعات، وانتشرت الأمراض السارية كالطاعون والجُدري وغير ذلك من الأمراض الفتاكة. ووجد هؤلاء في الخانقات بسطةً في العيش، وسَعة في الحال، بل وترفًا في المأكل والمشرب والملبس، ذلك أن العديد من المصالح والمنشآت، كالبساتين والدكاكين والحمامات والأسواق قد وقفت على الصوفية، فخانقاه سعيد السعداء بمصر التي أنشئت سنة 569 هـ = 1173 م، أوقفت عليها جملة من المصالح لينفق من ريعها على فقراء الصوفية، من جملتها بستان الحبانية وقيسارية شراب، وكان يخصص لكل صوفي فيها ثلاثة أرغفة زنتها ثلث رطل في مرق، ويعمل لصوفيتها الحلو كل شهر، ويفرق عليهم الصابون (2) . أما صوفية خانقاه ركن الدِّين بيبرس، فقد أُلحق بها مطبخ، يوزع منه على المجاورين اللَّحم والطعام وثلاثة أرغفة كل يوم إضافة إلى",
    "foot_note": "1. سلام: الأدب في العصر المملوكي، 1/ 202، ووردت الأوصاف في الرسالة، 7 أ. \n2. المقريزي: المواعظ، 2/ 416.",
    "book_id": "97",
    "new_page_number": 6
  },
  {
    "serial_number": "281886",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 8,
    "volume_number": 1,
    "text": "الحلوى، ولصوفية خانقاه شيخو علاوة على ما ذكر، الزيت والصابون (1) . أما صوفية خانقاه سرياقوس فلهم كل سنة ثمن كسوة وتوسعة في كل رمضان والعيدين والمواسم، فوق ما كان لهم من طعام شهي وخبز نقي إضافة إلى الحلوى وزيت الزيتون والصابون وثمن الفواكه، هذا عدا ما في الخانقاه من سكر وألوان من الشراب وأنواع الأدوية. كما أُلحق بالخوانق الحمامات والمطابخ والمدافن، ومدت أرضيتها بالفرش وآلات النحاس والكتب والقناديل وغيرها من الأدوات النفيسة، التي لا يقتنيها إلا الملوك والأمراء. إنَّ من يطلع على وقفيات الخوانق والزوايا والأربطة يدرك مدى العبء الاقتصادي الذي عاناه المجتمع بسبب ضيق القاعدة التي تستفيد من المصالح الاقتصادية المحبوسة على الصوفية دون غيرهم من شرائح المجتمع. وكدليل على حياة البذخ والترف التي نعم بها الصوفيون، نقدّم أنموذجين السماعين عقدا في مصر والشام سنة 659 هـ = 1261 م. \"قال المولي قطب الدِّين رحمه الله: حكى لي بعض الناصرية، قال: لما دخلنا الدِّيار المصرية، اتفق أن بعض أكابر الأمراء عمل سماعًا، وحضر بنفسه إلى الأمير جمال الدِّين ودعاه، فوعده بالمضي إليه والحضور عنده، فلما كان عشاء الآخرة، مضي ونحن معه -جماعة من مماليكه وخواصه- إلى دار ذلك الأمير، فلما دخل وجد جماعةً من الأمراء جلوسًا في إيوان الدار، وجماعةً من الفقراء في وسط الدار، فوقف، ولم يدخل، وقال لصاحب الدار: أخطأتم فيما فعلتم، كان ينبغي أن يقعد الفقراء فوق وأنتم",
    "foot_note": "1. المرجع السابق، 1/ 283.",
    "book_id": "97",
    "new_page_number": 7
  },
  {
    "serial_number": "281887",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 9,
    "volume_number": 1,
    "text": "في أرض الدار، ولم يجلس حتى تحول الفقراء إلى مكان الأمراء، والأمراء إلى مكان الفقراء، وقعد هو ونحن بين الأمراء، فلما غنّى المغني، قام أحدهم والدف بيده يستعطي، وهذه كانت عادة المغاني في الدِّيار المصرية، فلما رآه الأمير جمال الدِّين انتهره، وقال: والك\". وتمضي الرواية في شرح حال الصوفية وهم يرقصون ويجمعون النقود من الذهب والفضة من الأمراء، ثم أكلهم ما لذ وطاب من المطعم والمشرب (1) . وإنصرافهم فرحين جذلين. كما أورد قطب الدِّين اليونيني في \"ذيله\" على \"مرآة الزمان\" لسبط ابن الجوزي عرضًا دقيقًا، وصف فيه إحدى تلك الليالي الراقصة، جاءت في ترجمة لاجين بن عبد اللَّه الأمير حسام الدِّين الجوكنداري (ت 662 هـ/ 63 - 1264 م). حيث قال: \". . . وكان له في الفقر والصالحين عقيدة حسنة، ويكثر من الإحسان إليهم والبر بهم، وافتقادهم بالنفقة والكسوة وغير ذلك، وكان يعمل لهم السماعات، ويحضر فيها من المآكل والمشاريب والأرابيح الطيبة والشموع ما يبهر العقل ويتجاوز الحد، فكان يقدر ما يغرمه على السماع الواحد تقريبًا ثمانية آلاف درهم (2) . . . إلخ. ويمضي اليونيني في وصف ليلة سماع حضرها هو بنفسه في دارة لاجين الكائنة بالعُقَيبة بدمشق أواخر سنة 659 هـ، ذلك أن الدار أضيئت",
    "foot_note": "1. حبيب الزيات: ليلة رقص وسماع أميرية للفقراء، مجلة المشرق العدد 43 سنة 1939 م، نقلًا عن الدر المنتخب في تكملة تاريخ حلب - مخطوط بالمكتبة الأحمدية بحلب المحفوظة الآن بمكتبة الأسد بدمشق رقم 1214، الأوراق من 270 - 271 من الجزء الأول. \n2. اليونيني: \"ذيل مرآة الزمان\" خ أكسفورد POC.OR.132 الأوراق 112 - 113.",
    "book_id": "97",
    "new_page_number": 8
  },
  {
    "serial_number": "281888",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 10,
    "volume_number": 1,
    "text": "بالشموع الكافورية في أنوار (شمعدانات) الفضة، والمطعمة بصنوف الجواهر والأحجار الكريمة. حتى إذا قضيت صلاة المغرب مدَّ للفقراء سماطًا اشتمل على قريب مئة زبدية عادلية، في كل زبدية خروف صحيح رضعي، وحوالي ثلاث مئة زبدية في كل واحدة ثلاثة طيور دجاج وغير ذلك من أنواع الطعام، وبعد العشاء وإتمام الصلاة شرع الحاضرون في الغناء والرقص، حتى إذا ما تعبوا مَدَّ سماطًا من الحلوى والقطائف الرطبة والمقلوة المصنوعة بالسكر المصري والفستق والمسك ثم رقصوا وغنوا جميعًا، ومن ثم مُد سماطًا عظيمًا من الفواكه النادرة في غير موسمها من سفرجل وتفاح وكمثرى ورمان وبطيخ، وبعدها عادوا إلى الرقص والغناء، ومن ثم مَدَّ سماطًا من المكسرات على أنواعها من قصب عراقي وفستق وبندق وزبيب، والكعك المحشو والخشكنان (أقراص من الدقيق والحلوى)، والبقسماط وغيرها، وكان شرابهم مصنوعًا بالثلج والسكر وعاء الخلافه (نوع من الصفصاف المصري المستقطر)، وماء الورد، إضافة إلى المباخر المعمرة بالند والعنبر والعود الهندي حتى إذا كان وقت السحر دخلوا حمامًا مجاورًا لدار لاجين، فاستحمّوا وأُلبسوا القمصان والثياب الجدد، وبعد الحمام عادوا إلى الدار فأُشربوا الأشربة التي تناسب الحمام، ومن ثم مد لهم سماطًا من الحلوى الساخنة، وبعدها ينصرفون. والتقدير حالة الناس آنذاك، فقد علّق اليونيني على وقوع هذا السماع، بأنه أقيم، والناس في ضنك، فغرارة القمح بدمشقي ثمنها ثلاث مئة درهم، ورطل اللحم بالدمشقي ثمنه سبعة دراهم، والدجاجة ثمنها ثلاثة دراهم. وجميع الأشياء غالية جدًا. فانظر أي ترف ورخاء، عاش فيه صوفية ذلك العصر؟",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 9
  },
  {
    "serial_number": "281889",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 11,
    "volume_number": 1,
    "text": "ولم يقتصر دور الصوفية على التخريب الاقتصادي، بل تعداه إلى التأثير في الأحداث السياسية والاجتماعية، وذلك من خلال تغلغل الحركة في أوساط العامة والخاصة، ومن ثم فإنَّ الدولة اعترفت بمؤسسات الصوفية وقربت مشايخ الصوفية، حتى إن السلاطين كانوا يفاخرون ببناء الأربطة والخوانق والزوايا لجماعة الصوفية، لاعتقادهم أن بإمكان الفقراء المتصوفة الإتيان بالخوارق، وكشف الضّرّ عن السلاطين، والادعاء بالمكاشفة ومشاهدة الحق (1) . ولذا فإن فقراء الصوفية كثيرًا ما دعوا ليرفعوا الضَّرر عن مصاب، أو ليدعوا بالعافية لمريض (2) . وقد بلغ من تأثير شيخ شيوخ خانقاه سعيد السعداء أن نجح في إبعاد ابن تيمية عن مصر إلى الشام سنة 707 هـ = 1307 م، حيث حُبس في الشام، بدعوى تكلمه على مشايخ الطريقة، وكان شيخ سعيد السعداء قد جمع فوق خمس مئة صوفي من صوفية الخانقاه وسار بهم في تظاهرة إلى القلعة، وكانت جماعات غفيرة من العامة قد انضمت إلى المظاهرة، وفي القلعة، شكوا للسلطان ابن تيمية، الذي أحالهم بدوره إلى القاضي الشافعي فدفعهم عنه إلى تقي الدِّين علي بن الزواوي المالكي، والذي أصدر بدوره الحكم الذي أشرنا إليه (3) . وفي دمشق أيضًا عُنِّف ابنُ رمضان الشاهد، لأنه تكلم في حق الفقراء (4) . وضُرِب حتى طلبة التوبة والاستغفار. بل إن الصوفية كثيرًا ما قاموا بإراقة الخمور والبوزة لأنها محرمة على",
    "foot_note": "1. الكلاباذي: التعرف لمذهب أهل التصوف، 16. \n2. الصقاعي: تالي وفيات الأعيان، 151. \n3. ابن طولون: مفاكهة الخلان، ج 1 ص 21. \n4. المرجع السابق ج 1 ص 9، 7، حوادث سنة 885 هـ.",
    "book_id": "97",
    "new_page_number": 10
  },
  {
    "serial_number": "281890",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 12,
    "volume_number": 1,
    "text": "غيرهم، وقد يخرجون إلى الشوارع لإطلاق سراح أحدهم من السجن، وأمورًا أخرى كثيرة. وسدر الصوفية في مفاسدهم، حتى إن بعضهم أفتى بحرام الكسب إِلَّا عند الضرورة، لأن الكسب في عرفهم ينفي التوكل على اللَّه أو ينقص منه، وقد أمرهم اللَّه بالتوكل، ورزقهم في السماء وما يوعدون (1) . ثم إن بعض الصوفية كانوا لا يقيمون الصلاة أبدًا، مدعين أنهم لا يقومون بأدائها إِلَّا في الأماكن المقدسة فقط (2) . لقد عمَّ الفساد حياة الصوفية في عادتهم وأخلاقهم ورسومهم وسننهم وملابسهم وأزيائهم ومشاربهم ومآكلهم، واشتهر المتفقرون من المتصوفة بالجشع في الأكل والشرب، والولع بالرقص والتهافت على السماع والغناء. حتى قال فيهم الشاعر الطاهر: [الوافر] أرى جيلَ التصوف شرَّ جيلِ … فقل لهمُ وأَهونُ بالحلولِ أَقالَ اللَّهُ حين عبدتموه … كلوا أكل البهائم وارقصوا لي (3) وعليه فإن أبرز مظاهر الفساد في حياة المتصوفة علاوة على ما ذكر، يمكن إيجازها بما يلي:",
    "foot_note": "1. الشيباني: الكسب، 37 العيني: عقد الجمان، ج 33/ 38 أ، الكلاباذي: التعرف، 102. \n2. الشعراني: اليواقيت والجواهر، 1/ 125. \n3. وردت الأبيات في النص المنشور من رسالة ابن القارع، علي منصور الحلبي، الذي كان معاصرًا لأبي العلاء المعري، والتي جاءت رسالة الغفران ردًا على رسالة ابن القارح لأبي العلاء، وقد جاء في الشطر الأول من البيت الثاني: أقال اللَّه حين عشقتموه ولعله الأصوبه، لأن الصوفية تعشق بينما العبادة لكل البشر، انظر: أبو العلاء المعري: رسالة الغفران، ومعها نص محقق من رسالة ابن القارح، تحقيق د. بنت الشاطئ، ط. السادسة، دار المعارف، 1977 ص 36 - 37، بنت الشاطئ: جديد في رسالة الغفران، ط. بيروت 1972، ص 51.",
    "book_id": "97",
    "new_page_number": 11
  },
  {
    "serial_number": "281891",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 13,
    "volume_number": 1,
    "text": " مظاهر الفساد في حياة المتصوفة -  السماع والرقص: والسماع عند الصوفية، لياليَ تعقد، فيها ينشدون ويرقصون، وفي تعرفهم أن السماع يولد حالة في القلب تسمّى بالوجد، وهذا بدوره يحرك أعضاء البدن، فإن كانت الحركات غير موزونة كانت اضطرابات، وإن كانت موزونة فحينئذ تكون تصفيقًا ورقصًا (1) ، ويبدو أن نوعا من الهوى والغلبة قد سيطرا على الصوفي، فإن سمع غناء أو إيقاعا بقضيب، تواجد وصفق وربما مزَّق ثيابه ورماها (2) . وقد أنكر عليهم جماعة من العلماء مثل هذا السلوك الشائن، وصنفوا الكتب، ووضعوا القصائد في ذم سلوكهم، فالإمام موفق الدِّين، عبد اللَّه بن أحمد بن محمد بن قُدامة المقدسي وضع رسالة في ذم ما عليه مدَّعو التصوف من الغناء والرقص والتواجد وضرب الدُّف وسماع المزامير، ورفع الأصوات المنكرة بما يسمونه ذكرًا وتهليلًا، بدعوى أنها من أنواع القرب إلى اللَّه تعالى. وهجاهم كثيرٌ من الشعراء مثل شدَّاد بن إبراهيم الملقب بالطاهر الجزري، والعميد أبو محمد، عبد اللَّه، أحمد بن إبراهيم الزواوي الكاتب، وظهير الدِّين قاضي السَّلاميَّة ت 610 هـ = 1213 م (3) ، الذي هجا مكي شيخ زاوية الفقراء بالبوازيج، البليدة القريبة من السَّلَّامية، فقال: [المتقارب] أَلا قُلْ لِمَكّي قَوْلَ النَّصُوحِ … فَحقُّ النصيحة أن تُستَمَعْ متى سمع النَّاسُ في دِينِهم … بأَنَّ الغِنَا سُنّةٌ تُتَّبعْ؟",
    "foot_note": "1. الغزالي: إحياء علوم الدين، 2/ 236، ابن الجوزي: تلبيس إبليس 267 (نقد مسلك الصوفية في الغناء والسماع، الهروردي: عوارف المعارف، باب 24 \"القول والسماع\"). \n2. ابن الجوزي: تلبيس إبليس، 247، 250، 260. \n3. هو أبو إسحاق، إبراهيم بن نصر بن عسكر، انظر ابن خلكان: وفيات الأعيان 7/ 37 - 38.",
    "book_id": "97",
    "new_page_number": 12
  },
  {
    "serial_number": "281892",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 14,
    "volume_number": 1,
    "text": "وَأَنْ يَأْكُلَ المَرْءُ أَكلَ البَعِيْرِ … وَيَرْقُصَ في الجَمْع حتَّى يَقَعْ وَلَوْ كَانَ طاوي الحَشَا جائعًا … لما دار من طَرَبٍ واسْتَمعْ وقالوا سَكِرْنا بحبِّ الإِلهِ … وَمَا أسْكَرَ القَوْمَ إِلا القِصَعْ كذاك الحميرُ إذَا أخصْبتْ … يُنَقّزها ريُّها وَالشَبَعْ -  مصاحبة المرد والأحداث: استحل بعض الصوفية كل المحرمات والكبائر، وتظاهروا بالفسق والفجور والمخازي، فليلة الماشوش تتم علانية عند متصوفة شيراز (1) . وقد روى خبرها التنوخي في مشوار المحاضرة (2) ، ذلك أن ابن خفيف البغدادي، شيخ متصوفة شيراز، وقد مات رجل صوفي من أصحابه، وخلف زوجة صوفية، فاجتمع النساء الصوفيات يعزينها، حتَّى إذا انتهت مراسيم الدفن، وصل ابن خفيف الدار وأخذ يعزي المرأة بكلام من كلام الصوفية إلى أن قال: أعزبت. قال لها: هاهنا غير (3) . فقالت: لا غير (4) . فقال: فما معنى التزام النفوس آفات الهموم وتعذيبها بعذاب الغموم؟ ولأي معنى تترك الامتزاج (5) لتلتقي الأنوار (6) وتصفو الأرواح وتقع",
    "foot_note": "1. انظر الزيات (حبيب): كتابة الديارات في الجزء الأول من مسالك الأبصار لابن فضل اللَّه العمري، مجلة المشرق 42: 1948، 297. \n2. التنوخي: نشوار المحاضرة، مجلة المجمع العربي بدمشق، العدد 17 ص 261 - 262. \n3. أي هل يوجد هنا غير موافق في المذهب. \n4. أي ليس من يخالف. \n5. كناية عن الوطء. \n6. أي النور الإلهي.",
    "book_id": "97",
    "new_page_number": 13
  },
  {
    "serial_number": "281893",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 15,
    "volume_number": 1,
    "text": "الاختلافات وتنزل البركات. فقالت النساء: إذا شئت. فاختلط جماعة الرجال بجماعة النساء طول ليلتهم، فلما كان سحرًا خرجوا، ويبدو أن ذلك الحادث قد وقع في اليوم الأول من الصوم، أو الأحد الأول من الصوم حسب رواية الشابشتي في الديارات (1) ، وأصبح ذلك اليوم احتفالًا لهم يختلط فيه الرجال بالنساء. وقد أشار ابن الجوزي إلى أن صوفية عصره قد سدُّوا على أنفسهم باب النظر إلى النساء الأجانب، لبعدهم عن مصاحبتهن وامتناعهم عن مخالطتهن، واشتغلوا بالتعبد عن النكاح. واتفقت لهم صحبة الأحداث على وجه الإرادة وقصد الزهادة (2) . ويقرر ابن الجوزي بأن آفة الصوفية في عصره في صحبة الأحداث ومعاشرة الأضداد (3) ، ولم يقف البلاء عند هذا الحد، بل تعداه لإِضفاء مشروعية ذلك للمتصوفة، فقد صنف أبو الفضل، محمد بن طاهر، المعروف بابن القيسراني الشيباني ت 507 هـ = 1113 م رسالة في إباحة السماع والنظر إلى المرد (4) . واشتهر من المتصوفة بالتهتك والاستباحة خضر الكردي شيخ الملك الظاهر بيبرس، والشيخ أبي الحسن الحريري، وسليمان بن المولّه المجذوبه. وكان علي الحريري أكثرَ المتصوفة تهتكًا في معاشرة الأحداث \"فكان",
    "foot_note": "1. وردت عند الحديث عن دير الخوات ص 93، وانظر ابن فضل اللَّه العمري: مسالك الأبصار، 1/ 280 - 282 (تحقيق أحمد زكي باشا). \n2. ابن الجوزي: تلبيس إبليس، 265. \n3. المرجع السابق، 276. \n4. الشعراني: الطبقات الكبرى، 2/ 129.",
    "book_id": "97",
    "new_page_number": 14
  },
  {
    "serial_number": "281894",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 16,
    "volume_number": 1,
    "text": "من وقع نظره عليه من الأحداث وأولاد الجند والأمراء وغيرهم يحسن ظنه فيه، ويميل إليه، ولا يعود ينتفع به أهله، بل يلازمه ويقيم عنده، اعتقادًا فيه وميلًا إليه\" (1) . ومع أن ظاهرة مصاحبة المُرد والأحداث والمخنثين كانت واضحة في العصور العباسية المتأخرة، فقد اشتدت في عصر المماليك، وذلك إثر قدوم طائفة من الأوبراتية التترية (2) ، المشهورين بالجمال سنة 695 هـ = 1295 م، وانتشارهم في مصر والشام، ومن ثم دخولهم في خدمة الأمراء المماليك، وتنافس أمراء المماليك في اقتناء صبيانهم وبناتهم، ومن تبقى من هؤلاء الأويراتية بعد ذلك انخرط في الجيش، وتفرقوا في الممالك لتنتشر معهم المفاسد، ووجدته جماعات من الصوفية فيهم ضالتهم، فبالغوا في إضفاء مشروعية صوفية على فعلتهم النكراء، وقد أورد لنا الشعراني -أحد كبار متصوفة القرن العاشر الهجري- خبر الصالح محمد بن عراقي، الذي كان لا يمكِّن ابنه عليًا من الخروج إلى السوق، حين كان أمرد، إلّا أن يُبَرقَع خوفًا عليه من السوء والفتنة (3) . ولم يقف الأمر على المرد والأحداث بل تعداه إلى سواه من البهائم والحيوانات، فقد كان الشيخ الصوفي علي وحيش (ت 917 هـ/ 1511 م) كثير الاعتداء على البهائم والأتن (4) . لقد كان هذا الضرب من التصوف استهزاءً بالأديان، وبعدًا عن جادة الزهد والعبادة، وتهتكًا، حتَّى استحق صوفية القرون التالية للقرن السادس",
    "foot_note": "1. الدلجي: الفلاكة، 72، ابن الفوطي: الحوادث الجامعة، 325. \n2. قبائل مغولية سكنت الجزء الأعلى من خط نهر Venessei بأواسط آسيا. \n3. الشعراني: لواقح الأنوار، 2/ 257، زكي مبارك: التصوف، 1/ 257. \n4. الشعراني: الطبقات الكبرى، 2/ 129 - 130.",
    "book_id": "97",
    "new_page_number": 15
  },
  {
    "serial_number": "281895",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 17,
    "volume_number": 1,
    "text": "هجري، لقبَ \"الفقراء المخربين\"، لأنهم يناقضون السنن والعادات ويخرجون عن الآداب والشرائع (1) . -  تعاطي الحشيش: دأب عدد من الصوفية على تعاطي الحشيشة، بدعوى أنها تذهب الهموم الكثيفة عن قلوبهم، وتجلو بفعلها أفكارهم الشريفة. وليس بين أيدينا نص موثوق حول كيفية دخولها إلى العالم الإسلامي، فقد تعددت الروايات حولها، فبعض الروايات تنسبها إلى الهندي بيرزطن الذي حملها معه من الهند إلى فارس في القرن الأول الهجري، ومن ثم انتقلت بواسطة جماعة القلندرية الذين كانوا ينتظمون في سلك الصوفية، وقد حلقوا الرؤوس والحواجب والشوارب (2) . ورواية أخرى تنسب كشفها إلى الشيخ حيدر ت 618 هـ = 1221 م، والذي جعلها وقفًا على رفاقه من متصوفة خراسان، وأوصى أن يزرعوها على قبره بعد وفاته، ومن ثم انتقلت إلى بغداد فالشام ومصر، ومن الجدير بالذكر أن جماعة الحيدرية قدموا إلى دمشق بعد سنة 655 هـ = 1257 م، وعلى رؤوسهم طراطير، ولحاهم مقصوصة، وشواربهم بغير قص، وبنوا لهم زاوية خارج دمشق، ومنها وصلوا إلى مصر (3) . وقد تغنّى شعراء الصوفية بمحاسن الحشيشة، وأطلقوا عليها عدة أسماء مثل حشيشة الفقراء، ومدامة حيدر، والقلندرية. وكان شاعرهم محمد بن علي بن الأعمى، أكثر الشعراء لهجًا بمزايا الحشيشة، فقال: [الطويل].",
    "foot_note": "1. الزيات: الفقراء المخربون، مجلة المشرق، مجلد 43 سنة 1949، 511 - 515. \n2. ابن شاكر الكتبي: فوات الوفيات، 2/ 112. \n3. المقريزي: السلوك، ج 1 ق 1 ص 407.",
    "book_id": "97",
    "new_page_number": 16
  },
  {
    "serial_number": "281896",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 18,
    "volume_number": 1,
    "text": "دع الخمر واشرب من مدامة حيدر … معنبرة خضراء مثل الزبرجد يعاطيكَها ظبي من الترك أغيد … يميسُ على غصنٍ من البانِ أملدِ فتحسبها في كفِّه إذ يديرها … كرقم عذار فوق خدِّ مورَّد يرنحها أَدنى نَسيم تنسَّمت … فتهفو إلى بردِ النَّسيم المرود وتشدو على أغصانها الوُرقُ في الضحى … فيطربها سجع الحمامِ المغرّدِ هي البِكْرُ لَمْ تُنْكَح بماءِ سحابةٍ … ولا عُصرتْ يومًا برجلٍ ولا يدِ ولا عبثَ القسيس يومًا بكَأْسها … ولا قرَّبوا مِنْ دنّها كلَّ مقعدِ ولَا نصَّ في تحريمها عندَ مالكٍ … ولا [هي] عند الشافعيّ وأحمدِ ولا أثبت النُّعمانُ تنجيسَ عينهِا … فخُذْها بحدّ المشرفي المهنَّدِ وكف أكف الهمّ بالكيفِ واسترحْ … ولا تطرحن يومَ السرورِ إلى غدِ (1) لقد أدخل الصوفية الحشيشة إلى العالم الإسلامي منذ القرن السادس الهجري، ولا زالت أمتنا تعاني من آثار هذا المرض الاجتماعي حتَّى اليوم. -  الإدعاء بالإتيان بالخوارق والكرامات: عمَّ بين الصوفية اعتقاد بأن الإنسان إذا ارتاض وجاهد في العبادة، فإنه قد يلتحق بالملائكة الكرام حتّى يطير في الهواء ويمشي على الماء، فبالرياضية حسب اعتقادهم، ينسلخ الصوفي بالكليَّة عن الحظوظ البشرية، وهذا الاعتقاد في أساسه، اعتقاد البراهمة (2) ، ولكنه شاع عند الصوفية، وكانوا يحرصون على نشر الأخبار التي تروي طيران أحدهم في الهواء، فالشيخ أبو يوسف، صفي الدِّين، الحسين بن جمال الدِّين الأنصاري الخزرجي \"ارتفع بجلسته إلى العلو قدر قامتين، ودار وسع المجلس الذي كان الصوفية فيه، ثم نزل إلى موضعه! ! \" (3) .",
    "foot_note": "1. المقريزي: الخطط، 3/ 40. \n2. الغزي: لطف السمر، 1/ 363. \n3. صفي الدين الخزرجي: سير الأولياء، 30، تحقيق مأمون محمود ياسين وعفت وصال، ط. بيروت.",
    "book_id": "97",
    "new_page_number": 17
  },
  {
    "serial_number": "281897",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 19,
    "volume_number": 1,
    "text": "وقد أنكر ابن تيميَّة على صوفية الأحمدية ما يفعلونه من دخولهم في النيران المشتعلة، وأكلهم الحيَّات، ولبسهم الأطواق الحديد في أعناقهم، وتقلدهم بالسلاسل على مناكبهم، وعمل الأساور الحديد في أيديهم (1) وغيرها من الخوارق. لقد حفلت القرون من السابع الهجري إلى العاشر الهجري بأخبار كرامات وخوارق هؤلاء الصوفية حتّى غدت أمرًا مصدوقًا، يتعرض من كذَّبه إلى التعزير والإيذاء، وانسحبت آثار ذلك على العصور التالية، وخاصة في العهد العثماني، حين أصبحت الطرق الصوفية واسعة الانتشار، كثيرة الأتباع. كانت الصوفية في ذلك العصر شرًّا أصاب المجتمع، وإفسادًا للقيم والآداب، وتخريبًا للشرائع والسنن، وقد عبر كلُّ من فتح الدِّين ابن سيد الناس، وصلاح الدِّين الصفدي عن حال الصوفية بعبارات مقنعة، تعكس واقع حال المتصوفة، فالشيخ فتح الدِّين محمد بن محمد بن سيد الناس، يقول فيهم: [الخفيف] ما شروط الصوفي في عصرنا اليو … م سوى ستة بغير زيادة وهي. . . (2) العلوق والسكر والسطْ … ـلة والرقص والغنا والقياده وإذا ما هذى وأبدي اتّحادًا … وحلولًا من جهله وأعاده وأتى المنكراتِ عقلًا وشرعًا … فهو شيخُ الشُّيوخ ذو السِّجَّادَة (3) كما وصف الصفدي هيئة أحد رجال الصوفية، فقال: \"شيخ مسن فقير، حرفوش، مكشوف الرأس، منفوش الشعر، عليه",
    "foot_note": "1. المقريزي: السلوك، ج 2 ق 1 ص 16. \n2. كلمة فاحشة بذيئة. \n3. المقريزي: الخطط، 2/ 424، ابن شاكر الكتبي: فوات الوفيات 3/ 287.",
    "book_id": "97",
    "new_page_number": 18
  },
  {
    "serial_number": "281898",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 20,
    "volume_number": 1,
    "text": "دلق رقيق، بالي الخلقة رقيق، قد تمكن منه الوسخ ونبت فيه ورسخ، قد جمعه من عدة رقاع، له مدفأة يستدفئ بنارها\" (1) .  تحليل مادة الرسالة التي ننشرها: ناقشت الرسالة، مسألة اقتصادية مهمة، وهي، هل يصح الوقف والوصية للصوفية أم لا؟ ذلك أن عددًا كبيرًا من مصالح البلدان، كالدكاكين والحمامات والأسواق والبساتين والقرى الفلاحية والطواحين والمعاصر وغيرها، كانت توقف على صوفية خانقاه أو يوصي بإنفاق ريعها على جماعة صوفية معينة، وبالتالي فإنه لا يستفيد من هذه المصالح إلا حفنةٌ من المجتمع حظيتْ بخيراتهِ وهباتِهِ، بل وأثرت في مجرى الأحداث السياسية والاجتماعية في الأمة، فغدت هي المتنفذة المقربة من أُولي الأمر، بل إن أُولي الأمر أنفسَهم باتوا يخشونهم، فتزلفوا لهم بالمبالغة في إكرامهم وإغداق الأموال عليهم. لقد شكل هؤلاء الصوفية عبئًا ثقيلًا على اقتصاد المجتمع، وأُرْهِقَ الأهالي والفلاحون بتوفير احتياجاتهم طمعًا في إرضائهم ونيل دعواتهم، وانعكست الأهداف وغرق الصوفية في المفاسد والإِفساد، وسيروا الحياة الاجتماعية وفق ما يرغبون، وطغي هيلمانهم، واستفحل تأثيرهيم، فقام جماعة من العلماء، وأخذوا على عاتقهم تنبيه المجتمع لحالة التردي التي وصلت إليها حركة الصوفية، وذلك من خلال إيقاظ الأحاسيس بأصول الصوفية الحقة، فأعاد هذا النفر من العلماء، البحث في التصوف، وحقيقة الصوفي من حيث المبادئ والأهداف، والقصد من ذلك إثارة المسألة عند الناس، ليقارنوا بين حال الصوفية في عصرهم، وما يجب أن يكونوا عليه. وكان مؤلف رسالتنا جعفر بن ثعلب الأدفوي أحد هؤلاء العلماء الذين",
    "foot_note": "1. سلام: الأدب في العصر المملوكي، ج 1 ص 203.",
    "book_id": "97",
    "new_page_number": 19
  },
  {
    "serial_number": "281899",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 21,
    "volume_number": 1,
    "text": "صنفوا في باب الصوفية، وعقد أبوابًا في رسالتنا للبحث في مبادئ الصوفية حيث اتكأ على \"الرسالة القشيرية\" واقتبس منها عشرة آراء لكبار فقهاء الصوفية عرضها بشكل ميسر بسيط. وحول حقيقة الصوفي والكلام فيه، فقد تناول مؤلفنا، النسبة إلى التصوف، وبيان من تصدق عليه النسبة، وقرَّر بأن البدع واختلاف الفرق الإسلامية بعد سنة 200 هـ، هي التي أخرجت التصوف عن أُصوله ومعناه (1) . وحتَّى ينجح في إقناع قارئ الرسالة أو مسامعها، فقد استشهد بأكثر من عشرين رأيًا لفقهاء من الصوفية من أهل الطريق وأصحاب العلم والتحقيق (2) ، وملخص ما انتهى إليه، أن الصوفي في العرف العام، هو من اتصف بالصفات المحمودة في الشرع، وتخلق بالأخلاق الممدوحة، وإن بَعُد فيها الطبع، معرض عن الدُّنيا، مقبلٌ على الآخرة، سالك الطريق التي هي أولى بالمرء\". وأما في العرف الخاص، فإن الصوفي من يلبس لبسة مخصوصة من دلق (3) أو فرجيه (4) ، وله عمامة، يرخي منها عذبة قصيرة من قدامه، ويحضر",
    "foot_note": "1. انظر الرسالة، 4 ب. \n2. الرسالة، 6 أ. \n3. الدلق: نوع من اللباس يجعل تحت العباءة الفوقانية، وقد يكون كالمعطف واسعًا بدون فتحة، سوى فتحة الكتفين، ويُحاك من حرير الطرح الأزرق اللون أو من الصوف الأسود، انظر، محمد عيسى صالحية: من وثائق الحرم القدسي الشريف، ص 27، دوزي: معجم، 183، ماير: الملابس المملوكية، 90. \n4. فرجية: ثوب فضفاض، له كمان واسعان، يتجاوزان قليلًا أطراف الأصابع، وقد يكون لها ذيل يرخى من فوق الرأس. انظر دوزي: معجم الملابس، 167 (النص المترجم المنشور في مجلة اللسان العربي م 10 ج 3).",
    "book_id": "97",
    "new_page_number": 20
  },
  {
    "serial_number": "281900",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 22,
    "volume_number": 1,
    "text": "في الخانقاه بعد العصر ليحضر القراءة والذكر، وغير متعاط للحرف الدنيئة كالحياكة أو الحجامة أو القمامة، وغير موصوف بالثروة. وكأن الأُدفوي أراد القول، إن شروط الانتظام في سلك الصوفية في عصره هي: - التزيّي بأزياء معينة. - مداومة الحضور إلى الخانقاه بعد العصر للقراءة والذكر. - عدم تعاطي الحرفة الدنيئة كالحياكة والحجامة والقمامة. - غير معروفة بالثراء. وما عداها من الزهد والعبادة والبعد عن زخرف الدُّنيا فغدت شيئًا مهملًا. لقد مهَّد الأدفوي بالبابين السابقين ليصل إلى الباب الثالث، وهو \"من يستحق الوقف والوصية من الصوفية\"، وهذا الباب هو جوهر الرسالة، والمقصد الأساسي لتصنيفها، ويدخل هذا الباب في نظريات الإلزام والالتزام من فقه القانون المدني. في حيثيات \"العُرف\". والمادة القانونية التي يطرحها هي، أن العرف محكّم وفاصل في النزاع إذا كان منضبطًا، ولا خلاف عليه في بلد معين، فإذا اضطرب العرف في ذلك البلد، وجب البيان حينئذٍ، أي أن الحكم يربط بالأسباب. فالوقف لا يصح على الصوفية، لعدم ضبط معنى الصوفية ووقوفه عند حدٍ. وقد أفاض مؤلف الرسالة في الاستشهاد بما في المذاهب الأربعة جواز الوقف من عدمه، فالشافعية لا تجيزه، وكذا بعض علماء الحنفية، وأما",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 21
  },
  {
    "serial_number": "281901",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 23,
    "volume_number": 1,
    "text": "الحنابلة، فأجازوا الوقف على المنقطعين للعبادة، وتصفية النفس من الأخلاق المذمومة (1) . ثم ناقش مؤلفنا رأي الغزالي في الوقف على الصوفية، والذي أورده في كتاب \"إحياء علوم الدِّين\" (2) ، حيث ذهب الغزالي إلى أنَّ الصوفي هو من اتصف بما يلي: - الصلاح. - الفقر. - لبس زي الصوفية. - ألا يكون مشتغلًا بحرفة. - أن يكون مخالطة للصوفية بطريق المساكنة والخلطة (3) . وقد تناول مؤلف رسالتنا هذه القضايا، وناقشها، وفنَّدها بندًا بندًا، واستشهد بأقوال كبار رجال الزهد والتصوف لإِثبات حجته، وإبطال حجج الغزالي، وقد استند مؤلفنا في ردّه على الغزالي، على الأمور التالية: - أن الغزالي فيما أورده لم يجرِ على القواعد الفقهية. - أن الغزالي استند على رسوم الصوفية المحدثة. - اعتراف الغزالي بأن لا دليلَ لديه عما يقوله إلا العادات والأعراف الخاصة. - العرف الخاص لا اعتبار له عند أهل الفتوى (4) . - قدم الأُدفوي جملة من الشواهد التاريخية تبطل الادعاء بالزي، وتنفي شرط المساكنة والخِلطة، وحتى الفقر والاشتغال بحرفة دون أخرى، وأما الصلاح،",
    "foot_note": "1. الرسالة، 8 أ. \n2. الغزالي: إحياء علوم الدين، 2/ 153. \n3. الرسالة، 9 أ. \n4. الرسالة، 9 ب.",
    "book_id": "97",
    "new_page_number": 22
  },
  {
    "serial_number": "281902",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 24,
    "volume_number": 1,
    "text": "فبيَّن مؤلف رسالتنا، بأن الصلاح محصور في الاقتداء بسنَّة الرسول صلى الله عليه وسلم، وأن مسالك الصوفية لا بد أن تكون وفق القرآن والسُّنَّة (1) ، وأتى بشواهد عديدة من أقوال أئمة التصوفة المشهورين بالصلاح والتحقيق. ويلاحظ بأن مؤلفنا كان ينقم على الغزالي طرح تلك الآراء، بل ويقابلها بالاستهجان، فحين عرض الغزالي لنزول الخانقاه، قال مؤلف رسالتنا \"وهذا الذي ذكره الغزالي لا يناسب تحقيقه\" (2) ، وفي موضع آخر قال: \". . . وهو لم يبينه قبل، وأحال عليه، فهو عجيب منه\" (3) ، وفي معرض نقده لكتاب \"الإِحياء\" قال: \"لأن كتاب الإِحياء ليس موضوعًا للتحقيق على طريقة الفقه، وأكثره وكثير منه، مبني على كلام صوفي\" (4) ومجمل ما انتهى إليه مؤلف رسالتنا، أن المنتسبين إلى التصوف ثلاثة أقسام: - قسم اتبعوا ما جاء في الشرع، ووقفوا مع ما قاله علماء السُّنَّة، فهم يستحقون التعظيم ويستوجبون التبجيل والتكريم (5) . - قسم حصل لهم غلوٌ في التصوف فابتدعوا طرقًا واخترعوا عقائدَ، ووقفوا مع ألفاظ مزخرفة جمعوها، فيدخلون في جملة الكفار، ويستحقون النار. - قسم غلب عليهم الجهل، ووقفوا مع ما أُحدث من رسوم وتركوا النظر في المعارف والعوارف والعلوم. واحتفلوا بالرقص والسماع والشهوات، وهؤلاء",
    "foot_note": "1. الرسالة 12 ب -15 أ. \n2. الرسالة، 8 ب. \n3. الرسالة، 8 ب. \n4. الرسالة، 8 ب. \n5. لم يذكر الوقف كاستحقاقٍ لهؤلاء، وإنما اكتفى بأستحقاقهم التعظيم والتبجيل والتكريم.",
    "book_id": "97",
    "new_page_number": 23
  },
  {
    "serial_number": "281903",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 25,
    "volume_number": 1,
    "text": "الأخسرون أعمالًا في الدُّنيا والآخرة (1) . أما الوقف على صوفية عصره، فلا يُقره  مؤلف الرسالة للأسباب الشرعية التي أشرنا إليها. وفي ذلك قطع لمصدر ارتزاق لفئة كسولة خاملة، استنامت في عيشها إلى السهولة واليسر، واستطابت الراحة. وكان خطأ المجتمع أن وفَّرَ لها سُبل الحياة بدون تعب، فملأ الواحد منهم بطنه بلذيذ الطعام، ونام نومًا عميقًا، في انتظار الطعام الألذ، والمتعة السهلة المنال. وصدق من قال: نعوذ باللَّه من النار، ومن الصوفي إذا عرف باب الدار. مؤلف الرسالة: هو جعفر بن ثعلب بن جعفر الأُدفُوي، أبو الفضل، كمال الدِّين ولد في بلدة أُدْفُو (2) سنة 685 هـ = 1286 م، وبها نشأ. ثم درس بمدرسة قُوص، التي كانت بها مدرسة تضارع مدارس القاهرة، ثم انتقل إلى القاهرة، ودرس على جملة من أساتذة العصر، منهم أبو حيَّان، محمد بن علي بن يوسف الأندلسي، أثير الدِّين، وابن دقيق العيد، وتاج الدِّين الدشناوي، وأحمد بن محمد بن أحمد، محيي الدِّين القرطبي وسواهم. وقد وُصِفَ المؤلف بأنه مؤرخ، وله علم بالأدب والفقه والفرائض والموسيقا، وكان ينعى على علماء عصره ما وَصَلَ إليه العلم في عصره، فقال: [الكامل] إن الدروس بمصرنا في عصرنا … طبعت على غلط وفرط عياط ومباحث لا تنتهي لنهاية … جدلًا ونقل ظاهر الأغلاط ومدرس يبدي مباحث كلها … نشأت عن التخليط والأخلاط",
    "foot_note": "1. انظر الرسالة، ص 17. \n2. وهي بلدة بصعيد مصر الأعلى بين أُسْوَان وقُوص. انظر \"معجم البلدان\" (1/ 126) و\"شذرات الذهب\" (6/ 153) طبعة القدسي (م).",
    "book_id": "97",
    "new_page_number": 24
  },
  {
    "serial_number": "281904",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 26,
    "volume_number": 1,
    "text": "ومُحدِّث قد صار غاية علمه … أجزاء يرويها عن الدمياطي وفلانة تروي حديثًا عاليًا … وفلان يروي ذاك عن أسباط والفرق بين عزيزهم وغريرهم … وأفصح عن الخياط والحناط والفاضل النحرير فيهم دأبه … قول (أرسطاليس) أو بقراط وعلوم دين اللَّه نادت جهرة … هذا زمان فيه طُيَّ بساطي (1)  مؤلفاته: من أهم مؤلفاته التي عرفناها: -  الطالع السعيد الجامع أسماء نجباء الصعيد: وقد ألفه بإشارة من شيخه أبي حيان، وقد ترجم فيه لأعلام عصره من إقليم قوص، وأعماله ومدنه، وقد جعل تراجمه على حروف المعجم، وشملت 594 ترجمة، من ضمنها ترجمة الأربع نساء. وقد طبع الكتاب سنة 1966، بتحقيق سعد محمد حسن. -  الإمتاع في أحكام السماع: ويبحث في ضروب الغناء من حيث جوازه وتحريمه، وفيه فوائد موسيقية عن آلات العزف والضرب، ومنه نسخ بدار الكتب والوثائق القومية، وثانية بالمكتبة الأزهرية بالقاهرة وثالثة بمتحف الطوب قابي، خزانة أحمد الثالث رقم  A.1430  ورابعة في مكتبة جستربيتي، وانظر بروكلمان، الذيل 2/ 27 (2) . -  البدر السافر وتحفة المسافر: ترجم فيه لبعض شعراء القرن السابع، ويقع في مجلدين:",
    "foot_note": "1. الشوكاني: البدر الطالع، 1/ 182 - 183، ابن حجر: الدرر الكامنة، 1/ 536 ط. بيروت. د. ت. \n2. انظر أيضًا كتاب الإِمتاع والانتفاع في مسألة سماع السماع للأُدفوي، خزانة مدريد الوطنية رقم 246، حبيبه الزيات: لغة الحضارة، مجلة المشرق عدد 63 ج 4، 5، تموز - آب 1965 ص 67 - 68.",
    "book_id": "97",
    "new_page_number": 25
  },
  {
    "serial_number": "281905",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 27,
    "volume_number": 1,
    "text": "الأول في الفاتيكان رقم  Mus.Borg.L.F.Araba،168 والثاني في مكتبة الفاتح بإستانبول رقم 4201. ونسخة في فيينا ناقصة. -  فرائد الفوائد ومقاصد القواعد في علم الفرائض: منه نسخة في مكتبة غوتا بألمانيا الديمقراطية. -  كتاب الإِسعاف: وقد ورد ذكره في الرسالة التي نشرها (1) . -  كتاب الموفي بمعرفة التصوف والصوفي، وهو الذي نقوم بنشره لأول مرة . ومن الجدير بالذكر أن كمال الدِّين الأدفوي قد عاش في القاهرة، واتخذ المدرسة الصالحية سكنًا يتردد عليه الأشياخ (2) فيها. وقد وصفه الإسنوي بأنه: \"كان مشاركًا في علوم متعددة، أديبًا شاعرًا ذكيًّا كريمًا، طارحًا للتكلف، ذا مروءة\". وقد توفي بالقاهرة بعد عودته من الحج عام 748 هـ = 1347 م (3) .  وصف النسخ: تحتفظ خزانة الفاتح بالمكتبة السليمانية في أستانبول - بتركيا بنسخة وحيدة من الرسالة مسجلة تحت رقم 2876 ولا علم لكاتب السطور بنسخة",
    "foot_note": "1. انظر الرسالة ق 6 ب. \n2. الأدفوي: الطالع السعيد، المقدمة، ش. \n3. ابن العماد الحنبلي: شذرات الذهب، 6/ 153 من طبعة القدسي، الشوكاني: البدر الطالع، 1/ 182، المقريزي: السلوك ج 2 ق 3 ص 793، والسيوطي: حسن المحاضرة، 1/ 255، ابن تغري بردي: النجوم الزاهرة، 10/ 237، الأدفوي: الطالع السعيد أ - ت (مقدمة).",
    "book_id": "97",
    "new_page_number": 26
  },
  {
    "serial_number": "281906",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 28,
    "volume_number": 1,
    "text": "أخرى في المكتبات العربية والأجنبية سواها، وقد جاء على صفحة عنوانها: كتاب الموفي بمعرفة التصوف والصوفي. تأليف جعفر بن ثعلب الأدفوي الشافعي. وبالإضافة إلى السماع المسجل على صفحة العنوان، والذي سنشير إليه مع السماعات الأخرى المسجلة في نهاية الرسالة، فقد وردت عبارات تفيد بأن الأدفوي كان تلميذًا لأبي حيَّان، بخط المؤلف ثم حول كلمة القيمري عبارة، قلعة بين الموصل وخلاط (لب اللباب). وكذا إشارة إلى أن الرسالة قد روجعت من قبل أبي حيَّان الأندلسي نفسه.  السماعات الموجودة على الرسالة:  أولًا: على صفحة العنوان: 1 - \" سمع جميع هذا الكتاب من لفظ مؤلفه الشيخ الإمام العلَّامة كمال الدِّين، أبي الفضل، جعفر بن ثعلب الشافعي الأدفوي نفع اللَّه به بحضور سيدنا وشيخنا الأستاذ الإمام العلَّامة وحيد دهره وفريد عصره، ونسيج وحده، أعجوبة الزمان أثير الدِّين، أبي حيَّان، محمد بن علي بن يوسف بن حيان، فسح اللَّه في مدته، صالحٌ بن عبد اللَّه بن عبد اللَّه الدمشقي القيمري، وذا خطه وصح ذلك يوم الاثنين، ثامن عشر صفر سنة إحدى وأربعين وسبعماية بمنزل شيخنا أبي حيَّان بالمدرسة الصالحية بين القصرين بالقاهرة المحروسة، وأجاز إليَّ جميع ما يجوز لهما روايته، والحمد للَّه رب العالمين وصلى اللَّه على سيدنا محمد وسلم\". ويستفاد من السماع أن الذي سجله هو صالح بن عبد اللَّه بن عبد اللَّه الدمشقي القيمري، وكان ذلك بتاريخ 18 صفر سنة 741 هـ، وبمنزل أبي حيَّان بالقاهرة، وأن صالحًا هذا قد أُجيز بالرواية من قبل الأدفوي وأبي حيَّان.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 27
  },
  {
    "serial_number": "281907",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 29,
    "volume_number": 1,
    "text": " ثانيًا: على الورقة 18 أو 18 ب وجدت السماعات التالية: 1 - سمعها أجمع على مؤلفها إليخ الإمام العلَّامة كمال الدِّين، أبي الفضل الأدفوي أحسن اللَّه إليه، بقراءة. . . إلخ المُحَدِّث الرّحال، عز الدِّين بن حمزة بن أحمد الهكاري. . . إلخ، برهان الدِّين، إبراهيم بن أحمد بن أبي بكر الفدي -كذا- المرشدي وعبد العزيز بن محمد المؤذن البغدادي وذا خطه، وصحَّ وثبت بدار الحديث الكاملية (1) من القاهرة، يوم الخميس ثامن عشر رمضان سنة أربعين وسبعماية، وصلى اللَّه على سيدنا محمد النَّبيِّ وآله وصحبه وسلم. ويستفاد من السماع أنه تم في دار الحديث الكاملية التي أنشأها السلطان الملك الكامل ناصر الدّين محمله بن الملك العادل أبي بكر بن أيوب سنة 622 هـ = 1225 م، وهي ثاني مدرسة عملت للحديث، ووقفها على المشتغلين بالحديث، وكانت بخط بين القصرين، وقد سمعها ثلاثة من العلماء، وسجل السماع بخط عبد العزيز بن محمد المؤذن البغدادي، وكان تاريخه قبل السماع المسجل على صفحة العنوان: 2 - على الصفحة 18 ب ما يفيد قراءة الرسالة من قبل عبد العزيز بن محمد بن خلف النوري، وقد سمعها منه عبد الواحد بن سعيد الغازازي والشيخ محمد السمودي وكان ذلك بالمدرسة الصالحية بالقاهرة المعزية في ثامن عشر شهر المحرم الحرام، افتتاح شهور سنة 743\". وكتبه جعفر بن ثعلب بن جعفر بن علي بن مطهر بن وائل الأُدفوي، حامدًا للَّه ومصليًا على نبيه، وحسبنا اللَّه ونعم الوكيل.",
    "foot_note": "1. حول دار الحديث الكاملية، انظر، المقريزي: الخطط، 2/ 375، أحمد فكري: مساجد القاهرة ومدارسها، 2/ 55.",
    "book_id": "97",
    "new_page_number": 28
  },
  {
    "serial_number": "281908",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 30,
    "volume_number": 1,
    "text": "ويستفاد من السماع أن المؤلف قد أجاز لعبد العزيز النوري الرواية، وحضر القراءة بالتاريخ المشار إليه. وكذا على الصفحة نفسها ما يفيد نقلها من قبل يحيى الجعفري. كتب المخطوط بخط نسخ جميل وبالمداد الأسود والمداد الأحمر، وكانت العناوين مكتوبة بالمداد الأحمر، ويخط أكبر حجمًا، كما خُط بالمداد الأحمر تحت العبارات المهمة في الرسالة. عدد الأوراق: 18 ق. عدد الأسطر: 15 س. المقياس: 19.7 × 14 سم. عدد الكلمات في السطر من (7 - 11) كلمة. ولم يذكر اسم الناسخ أو تاريخه، ويبدو أن النسخة قد رُوجعت من قبل أحدهم، وعليها تمليكات، وكذا وقف باسم السلطان الغازي محمود خان. وقبل أن أختم كلامي أتوجه بالشكر الجزيل إلى الأستاذ الدكتور خالد عبد الكريم جمعة الذي كان له فضل ظهور الكتاب ضمن مطبوعات مكتبة دار العروبة الغراء. وإلى الأستاذ محمود الأرناؤوط الذي تولى تخريج الأحاديث الواردة في الكتاب. الكويت في 27/ رجب/ 1408 هـ الموافق 15/ مارس/ 1988 م د. محمد عيسى صالحية * * *",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 29
  },
  {
    "serial_number": "281909",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 31,
    "volume_number": 1,
    "text": "كتاب نادر في نقد الصوفية الموفى بمعرفة التصوف والصوفي تأليف الإمام كمال الدين أبي الفضل جعفر بن ثعلب الأدفوي المصري (685 - 748 هـ) حققه وقدم له وعلق عليه الدكتور محمد عيسى صالحية مكتبة دار العروبة للنشر والتوزيع الكويت",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 30
  },
  {
    "serial_number": "281910",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 33,
    "volume_number": 1,
    "text": "الموفي بمعرفة التصوف والصوفي سَمِعَ جَميع هذا الكِتابِ مِنْ لَفْظِ مؤَلِّفهِ الشَّيْخِ الإِمام العَلَّامَةِ كَمالِ الدّينِ، أبي الفَضْل، جَعْفَرَ بنْ ثَعْلَب الشَّافِعِيّ الأُدْفَويِّ نَفَعَ اللَّهُ به، بحُضور سَيّدنا وشَيْخنا الأُستاذِ الإمامِ العَلّامَة وحَيد دَهْرهِ، وَفرَيد عَصْرِهِ، وَنَسيجِ وَحْدِهِ، أُعُجوَبة الزّمان، أَثير الدّين، أبي حيّان، مُحمّد بن عليّ بن يوسف بن حيَّان (1) ، فسح اللَّه في مُدَّته صالحُ بن عبد اللَّه بن عبد اللَّه الدّمشقيّ القَيْمرِي (2) ، وذا خطّه وصحّ ذلك، يَوْمَ الاثنين ثامن عشر صفر سنة إحدى وأربعين وسبعماية، بمنزلِ شَيْخِنِا أبي حيّان بالمدرسةِ الصالحيةِ (3) بين",
    "foot_note": "1. انظر ترجمته في، ابن حجر: الدرر الكامنة، 4/ 302، المَقَّري: نفح الطيب، 1/ 625، ابن خلدون: العبر، 6/ 144، السيوطي: بغية الوعاة، 121، ابن حزم: جمهرة الأنساب، 464، الأدفوي: الطالع السعيد، المقدمة من (و - ي). \n2. قال ابن حجر: (هو أحد طلبة الحديث المكثرين، أعتنى بالطلب، ودار على الشيوخ من بعد سنة (30) فأكثر بمصر والإسكندرية ودمشق، انظر \"الدرر الكامنة\" (1/ 202) و\"ذيل العبر\" للحسيني ص (271). \n3. المدرسة الصالحية: بخط بين القصرين، بناها الملك نجم الدين أيوب، حيث ابتدأ في بنائها في 13 ذي الحجة سنة 639 هـ، ورتب فيها دروس لفقهاء المذاهب الأربعة سنة 641 هـ، وذكر الأدفوي في الطالع السعيد في حوادث سنة 724 هـ، أن أبا حيان كان يسكنها بتاريخ 11 صفر سنة 724 هـ، وقد ورد اسمها خطأ في الأصل، حيث ذكرها \"الصلاحية\"، انظر حولها، المقريزي: الخطط، 2/ 347، السيوطي: حسن =",
    "book_id": "97",
    "new_page_number": 31
  },
  {
    "serial_number": "281911",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 34,
    "volume_number": 1,
    "text": "القَصْرَيْن بالقاهِرةِ المَحْروسَة، وأجازا لي جَميعَ ما يَجوزُ لهما رِوايَتُهُ، والحمدُ اللَّه ربِّ العالمين وصلّى على سيّدنا محمّدٍ وسلّمَ. * * * بسم الله الرحمن الرحيم الحمدُ للَّه العالم بما تُكنُّه الضمائرُ، المُطّلعِ على ما تُبْديهِ الألسنَةُ وما تُخْفيهِ السرائرُ، المُنعم بتنوّعِ الطاعات، ليأتيَ كلُّ أمْرٍ منها بما هوَ عليهِ قادرٌ، فَمنْ فاتَهُ نوعٌ منها، فهو على نَوْعٍ آخرَ مُثابر. بَعَثَ مُحمدًا من أكرمِ القبائلِ وأشرفِ العناصرِ، وجَعَلَهُ مُقدّمًا في الفضل وإن كانَ وجُوْدُهُ في الزمن الآخر، وخصّه بأصحابٍ هم كالنجومِ الزّواهرِ، صَفّوَة الخَلْقِ، والقائِمونَ بالحقِّ فعليهم تُعْقدُ الخناصرُ، فهمْ أهلُ الصفاءِ، وأربابُ الوفاء، وأكابرُ السّادات، وساداتُ الأكابر، فصلّى اللَّهُ عليه وعلى آلهِ وصحبه، صلاةً يَحْصُلُ بها الأَجرُ الجزيلُ الوافرُ، وتكسو بأحْسَنِ الملابسِ وأفخرِ المفاخر. وَبَعْدُ: فإنهُ وَقعَ البحثُ في اسم التَصوُّفِ وحقيقةِ الصوفيِّ، ومَنْ يَسْتَحقُّ رَيْعَ ما وُقِفَ أو وُصّي به للصوفية فهذِهِ ثلاثةُ مطالب. المطلب الأول: التَّصَوُّف: وهو عبارةٌ عن قصدِ طريقِ طائفةٍ مخصوصةٍ سُمُّوا بالصُّوفيَّة، يُتَلَبَّسُ بها فَقيلَ فيه: إنه من باب تَفَّعُّل، إذا دخَلَ في الفِعْلِ كَقَولِكَ: تَقَّمَصَ، إذا لبِسَ القميصَ. قالَ الإِمامُ الأُستاذُ أبو القاسم، عبدُ الكَريمِ بنُ هَوَازن القُشَيرْي (1)",
    "foot_note": "1. = المحاضرة، 2/ 144، تاريخ الخلفاء، 307، ابن حبيب: تذكرة النبيه، 1/ 342، الأُدفوي: الطالع السعيد، 106. \n1. هو عبد الكريم بن هوازن بن عبد الملك بن طلحة النيسابوري القشيري =",
    "book_id": "97",
    "new_page_number": 32
  },
  {
    "serial_number": "281912",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 35,
    "volume_number": 1,
    "text": "-المُتَوصّلُ إلى طريقهم-: \"يُقالُ له مُتَصوّف، والجَمَاعةُ مُتَصَوِّفة\" (1) . قال: وليس لهذا الاسمِ من جهةِ العَرَبِيَّة قياسٌ ولا اشتقاق، ولا ظهرَ فيه أثرٌ، فهو لَقَبٌ (2) . فهذا الكلام عليه من حيث الوَضْعُ العُرْفيُّ، المصطلحُ عليه. وأمَّا أقْوالُ الناسِ في ذلِكَ، فَفيهِ مقالات: قال أبو عثمان، سَعيدُ بنُ إسماعيلَ (3) -أحدُ أكابرِ هذِهِ الطّائفةِ-: التَصَوُّفُ: الصُّحْبةُ مع اللَّه بحُسن الأدّبِ ودَوَام الهَيْبَبةِ والمُراقَبةِ، والصُّحْبَة مع رسول اللَّه باتَّباعِ سُنَّته ولُزومِ ظاهِرِ العِلْمِ (4)",
    "foot_note": "1. = (ت 145 هـ)، من بني قشير بن كعب، أستاذ المتصوفة في وقته، من فقهاء الشافعية، محدث، مفسر، لغوي، شُهر برسالته في التصوف انظر، البغدادي (الخطيب)، تاريخ بغداد 11/ 83، ابن خلكان: وفيات، 2/ 375، 3/ 205 (إحسان عباس). أبو الفيض: جمهرة الأولياء (أعلام الصوفية)، 2/ 146 ابن عساكر، تبيين كذب المفتري، 271، السبكي: طبقات الشافعية، 5/ 153، ابن خلدون: الجبر، 3/ 259، ابن العماد الحنبلي: شذرات، 3/ 319 طبعة القدسي. \n1. وردت في الرسالة القشيرية، 2/ 550. \n2. وردت في الرسالة القشيرية، 2/ 550 ولكن العبارة كانت \". . . والأظهر فيه أنه لقب\". \n3. هو أبو عثمان، سعيد بن إسماعيل بن سعيد بن منصور الحيري (وفي بعض المصادر الجبري والأول هو الأصح) ت 298 هـ، من الري، أقام بنيسابور، ونشر التصوف في خراسان، انظر ترجمته في، السَّلَمي: طبقات الصوفية، 1/ 170، أبو نُعيم: حلية الأولياء، 10/ 244، ابن الجوزي: المنتظم، 6/ 106، ابن خلكان: وفيات الأعيان، 2/ 369، البغدادي (الخطيب): تاريخ بغداد، 9/ 99، القُشيري: الرسالة 1/ 136، الكلاباذي: التعرف، 46، الشعراني: الطبقات 1/ 86، ابن العماد: شذرات، 2/ 230 طبعة القدسي. \n4. وردت في الرسالة القشيرية، 1/ 138 - 139.",
    "book_id": "97",
    "new_page_number": 33
  },
  {
    "serial_number": "281913",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 36,
    "volume_number": 1,
    "text": "وقال أبو الحُسين، أحمْدُ بن مُحمدٍ النُّوري (1) -شيَخُ الطَّريقةِ-: التَّصوَّفُ تَرْكُ كلِّ حَظ للنَّفْسِ (2) : وقال أبو عَمْرو إسماعيل بن نُجيد (3) : التّصوف، الصّبر تحت الأَمْرِ والنَّهي (4) . وقال أبو محمدَ الجُريْري (5) : التَّصَوّفُ، الدّخولُ في كلّ خلقٍ سَنِيّ والخُروجُ من كُلِّ خُلقٍ دنيّ (6) .",
    "foot_note": "1. أبو الحسين، أحمد بن محمد بن عبد الصمد النوري ت 295 هـ: بغدادي المولد والمنشأ، بغوي الأصل، خراساني من أقران الجنيد، قال عنه الخطيب البغدادي: \"هو أعلم العراقيين بلطائف القوم\"، انظر، الخطيب البغدادي: تاريخ بغداد، 5/ 130، أبو نُعيم: حلية الأولياء، 10/ 249 - 255، ابن الجوزي: المنتظم، 6/ 77، السُّلَمي: طبقات الصوفية، 164، القشيري: الرسالة 1/ 140 الكلاباذي: التعرف، 42، الشعراني: طبقات، 1/ 87. \n2. وردت في الرسالة القشيرية، 1/ 140 (ط. مصر)، التعرفة لمذهب أهل التصوف، 34 وطبقات الصوفية، 166. \n3. هو أبو عمرو، إسماعيل بن نُجيْد بن أحمد بن يوسف بن خالد السُّلَمي (ت 366 هـ)، صوفي كبير الشأن آخر من مات من أصحاب أبي عثمان، سعيد بن إسماعيل، انظر ترجمته، القشيري: الرسالة، 1/ 210، الحنبلي (ابن العماد): شذرات الذهب، 3/ 5، الشعراني: الطبقات، 1/ 120، ابن الجوزي: المنتظم، 7/ 84، السلمي: طبقات الصوفية، 454 - 457. \n4. وردت في الرسالة القشيرية، 1/ 210. \n5. هو أحمد بن محمد بن الحسين الجريري (ت 311 هـ)، من كبار أصحاب الجنيد، أقعده الجنيد في مجلسه بوصية منه انظر، القشيري: الرسالة، 1/ 166، السلمي: طبقات الصوفية، 259، أبو نُعيم: حلية الأولياء، 10/ 347، البغدادي (الخطيب): تاريخ بغداد، 4/ 430، الشعراني: الطبقات، 1/ 94. \n6. وردت في الرسالة القشيرية، 2/ 551، واللمع للطوسي، 45 وفيه مسندة عن محمد ابن أحمد بن يحيى الصوفي عن عبد اللَّه بن علي التميمي عن أبي محمد الجُريري (سماعًا).",
    "book_id": "97",
    "new_page_number": 34
  },
  {
    "serial_number": "281914",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 37,
    "volume_number": 1,
    "text": "وقال محمد بنُ علي (1) -أحَدُ المشايخِ-: التَّصوُّف أخلاقٌ كَريمةٌ (2) . وقال أستاذُ الطائفةِ الجُنَيْدُ بنُ محمدٍ الفَقَيه (3) : التصَوّفُ ذِكرٌ معَ اجتماعٍ، وَوَجْدُ مع اسْتماعٍ، وعَمَلٌ مع أتَّباعٍ (4) .  المطلب الثاني: في حقيقةِ الصُّوفيِّ ، والكلامِ فيه في مَقامَين: أحدُهما: في النِّسبةِ. والثاني: في بَيانِ من تَصْدُقُ عَلَيْهِ النِّسبَةُ.  المقام الأول: النِّسبةُ . قَالَ الأستاذُ القُشَيْريُّ: كانَ الناسُ بَعْدَ النبيِّ يُسَمَّوْنَ بالصحَّابَةِ؛ إذْ لا فَضيلةَ فَوْقَها، ثم من أدْرَك الصحَّابَةَ يُسمَّوْن تابِعين، ثم أتباعُ التَّابعين، ثم",
    "foot_note": "1. هو محمد بن علي القصاب، أستاذ الجُنيد في التصوف، انظر الطوسي: اللمع، 45 الرسالة القشيرية، 2/ 553. \n2. وردت في الرسالة القشيرية 2/ 552 وتتمتها \"ظهرت في زمان كريم، من رجل كريم، مع قوام كريم\". \n3. هو الجنيد بن محمد الفقيه، البغدادي، أبو القاسم الخراز، ت 297 هـ، سيد الطائفة وإمام الصوفية في عصره، منشؤه ومولده بالعراق، أصله من نهاوند، كان على مذهب أبي ثور، إبراهيم بن خالد بن اليمان، الكلبي، لقب والده بالقواريري لاشتغاله ببيع الزجاج، حول ترجمته انظر، أبو نُعيم، حلية الأولياء، 10/ 255 - 287، ابن الجوزي: المنتظم 6/ 105، ابن خلكان: وفيات، 1/ 146، السبكي: طبقات، 2/ 28، الكلاباذي: التعرف، 1/ 132 - 136 الشعراني: طبقات، 1/ 84، البغدادي (الخطيب): تاريخ بغداد، 7/ 241 - 249، القشيري: الرسالة، 1/ 33 (ط. مصر)، ابن خلكان: وفيات الأعيان، 1/ 373، ابن الأثير: البداية، 8/ 62. \n4. وردت في الرسالة القشيرية، 2/ 553.",
    "book_id": "97",
    "new_page_number": 35
  },
  {
    "serial_number": "281915",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 38,
    "volume_number": 1,
    "text": "اخَتَلفَ الناسُ وتَبايَنَت المراتِبُ، فسُمِّي خواصُّ الناسِ مِمَنْ لهم شِدَّةُ عنايةٍ بأَمرِ الدِّين، الزُّهادَ والعُبَّادَ. ثم ظهرت البِدَعُ وحَصَلَ التَّداعِي بَيْنَ الفِرَق، فَانْفردَ خَواصُّ أهَلِ السُّنَّة، المُراعونَ أنفسهُمْ مع اللَّه، الحافِظونَ قُلوبهم من طَوارقِ الغَفْلَةِ باسمِ التَّصوُّفِ. قال: واشْتُهِرَ هذا الاسم لهم قَبْلَ المئتين مِنَ الهجرة (1) . قَالَ: وكان أحمدُ بنُ حَنْبلٍ رحمه الله يقولُ لأبي حَمْزَةَ البَزّاز البَغْدادِي (2) : ما تَقَولُ في هذه المسألَةِ يا صُوفيّ. وكانَ فقيهًا عالمًا بالقراءات (3) . ثمّ اختَلَف النّاسُ في أنّ هذه نِسبةٌ إلى ماذا؟ فقالَ بَعْضُهمُ: نسبةً إلى الصَّفاء، لمّا صَفَتْ قُلوبُهُم، وتَنَقّتْ مِن الكدوراتِ جُعلَتْ لَهمْ هذه النِسبةُ (4) . قَالَ القُشَيْريُّ: وهذا بَعيدٌ من جهةِ اللُّغةِ. وَكَأَنَّهُ استَبْعَدَ من حيث أَنَّ النّسبَة إلى الصّفاء، صَفَويٌّ، ولكن يجوزُ أنْ يكونَ أصْلُهُ صَفويًّا، ثم حَصَلَ التَّغْييرُ من مُتداوِلي اللَّفْظِ.",
    "foot_note": "1. وردت في نقد العلم والعلماء \"تلبيس إبليس لابن الجوزي\"، 173، الرسالة القشيرية، 2/ 61 - 62. \n2. أبو حمزة البزاز البغدادي، من أولاد عيسي بن أبان، كان عالمًا بالقراءات، من أصحاب الجنيد، ولكنه مات قبل المجنيد، لا نعرف سنة وفاته بالضبط، انظر البغدادي (الخطيب): تاريخ بغداد، 1/ 390، السّلمي: طبقاته، 295، القشيري: الرسالة، 1/ 173، الشعراني: الطبقات 1/ 99. \n3. وردت في الرسالة القشيرية، 1/ 173. \n4. وردت في التعرف لمذهب أهل التصوف، 28.",
    "book_id": "97",
    "new_page_number": 36
  },
  {
    "serial_number": "281916",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 39,
    "volume_number": 1,
    "text": "وقَالَ بَعْضُهُم: نِسبَةٌ إلى الصُّفَّة، وذلكَ أنّهُم كانوا مُجرّدينَ من الحُظوظِ الدّنيويَّةِ، شابَهوا في حالِهمْ حالَ أهل الصُّفَّةِ (1) ، فَحَصلَت لهم هذه النّسبةُ. واعتُرِضَ على هذا بأنّ النّسبة إلى الصُّفَّة، صَفِّيّ لا صوفيّ، ويُجابُ عنه بما أُجِيبَ به عن الأوَّل (2) . وَقَالَ بَعْضُهم: نِسبةٌ إلى الصَّف، فَكأنهم بما تَعاطوه من الحِرْصِ على الفضلِ والأعْمالِ المُقرِّبة وَطَلب التَّقَدُمِ إلى رضوان اللَّه ويعترض بما أعتُرِض وَيجابُ بِمِثِل ما أُجِيِبَ بِهِ (3) .",
    "foot_note": "1. أهل الصّفة: جماعة من الفقراء كانوا يقيمون في صفة مسجد رسول اللَّه صلى الله عليه وسلم، التي جعلت لزهاد المسلمين، رغبوا عن عروض الدنيا. من أهم المصادر التي أرختهم: كتاب تاريخ أهل الصفة، لأبي عبد الرحمن السلمي (ت 412 هـ)، وكتاب التحفة في الكلام على أهل الصفة، لتقي الدين السُّبكي (ت 412 هـ)، وقد أفرد عبد الرحمن بدوي فصلًا لهم في كتابه: تاريخ التصوف الإسلامي، ط. الكويت، 1975 ص 127. وقد وردت أخبارهم في الطبقات لابن سعد ج 2 ق 2 ص 13 نشرة سخاو، ومسند أحمد بن حنبل، وصحيح البخاري، ومسلم وسنن الترمذي، وسنن ابن ماجه، وكتاب اللمع، لأبي نصر السراج الطوسي (132 - 134)، وكتاب التعرف، للكلابادي، الباب الأول ص 5، ط. مصر، وحلية الأولياء لأبي نُعيم، 1/ 337، 2/ 1 - 34) ط. مصر، وكشف المحجوب، للهجويري 97 - 99 (نشر زوكوفسكي) وإحياء علوم الدين، للغزالي، 3/ 167 ط. القاهرة 1289 هـ، وتلبيس إبليس، لابن الجوزي، 176 ط. القاهرة، 1928 م، أبو الفيض: جمهرة الأولياء، أهل الصفة، 131، قاسم غني: تاريخ التصوف، 60. \n2. وردت في الرسالة القشيرية، 1/ 173، جمهرة الأولياء، وأعيان التصوف، لأبي الفيض، 153. \n3. حول التعريفات انظر أيضًا. القشيري: الرسالة القشيرية (ط. مصر)، 2/ 550 - 551، الكلاباذي: التعرف لمذهب أهل التصوف، 28، ابن الجوزي: تلبيس إبليس، 162.",
    "book_id": "97",
    "new_page_number": 37
  },
  {
    "serial_number": "281917",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 40,
    "volume_number": 1,
    "text": "وَقَال بعَضُهُم: نِسْبةٌ إلى لِبْسِ الصوّف (1) ، وهذا صحَيحٌ من حَيْثُ اللَّغَة، وَاعْتَرَضَ القُشَّيريُّ عَلَيه، بأنَّ القَوْمَ لم يَخَتصُّوا بِلِبس الصّوفِ. وَيُجابُ بأنّهُ الغالِب عَلَى مَنْ طلبَ خُشَونَةَ العَيْشِ والتَّقَلُّلِ مِنَ الدُّنْيا. والتَّقَشفِ فيها. من تركَ الناعمَ من الثيابِ، ويَقنَعُ بالخَشِن منها. ولبس الصوفِ والقطنِ غالبٌ في هذه الحالةِ. والصوفُ أغلبُ لعمومِ وجودهِ، وخشونتُه أكثر من خشونةِ القطنِ. وفي الحديث الصحيح من حديث أَبي بردة، قالَ: أخرجتْ لنا عائشةُ كساءً غليظًا وإزارًا غليظًا، فقالت: قُبِضَ [رُوْحُ] رسولُ اللَّه في هذين (2) . وأَخرجَ الترمذيّ من حديثِ عبدِ اللَّه بنِ مسعودٍ عن النبيّ قالَ: \"كانَ على موسى يومَ كلَّمه ربَّه كساءُ صوفٍ وجبة صوفٍ، وكمةُ صوفٍ وسراويلُ صوفٍ (3) ولذلك أيضًا منْ يأخذُ نفسَه بالإِعراض عن الأمور الدنيوية من الأمم الماضية، يتَّصفون بلبسِ الصُّوفِ كالرهبانِ وأشباههم حتّى لا يكادوا ينفَكُّونَ عنه. وقالَ بعضهم: هو نسبةٌ إلى المصافَاةِ. قال الشاعرُ: صافَي فَصُوفِيَ حتى لُقِّبَ الصوفي (4) .",
    "foot_note": "1. انظر الكلاباذي: التعرف، 29، 30. \n2. رواه البخاري رقم 5817 في اللباس: باب الأكسية والخمائص، وفي الجهاد: باب ما ذكر من درع النبي صلى الله عليه وسلم وعصاه وسيفه، ومسلم رقم (2080) في اللباس: باب التواضع في اللباس، وانظر \"زاد المعاد\" لابن قيم الجوزية (1/ 141). (م). \n3. رواه الترمذي رقم (1734) في اللباس: باب ما جاء في لبس الصوف، وهو حديث ضعيف، وانظر \"جامع الأصول\" لابن الأثير بتحقيق والدي الشيخ عبد القادر الأرناؤوط (م). \n4. انظر السبكي: معيد النعم، 173 وفيه: =",
    "book_id": "97",
    "new_page_number": 38
  },
  {
    "serial_number": "281918",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 41,
    "volume_number": 1,
    "text": "فهو مصافٍ لمولاه بالخدمة والامتثالِ والإِقبالِ على ما يُرضيهِ، والإِعراض عن ما سواه، ومصافٍ للخلقِ باطِّراحِ ما في أيديهم، وتركِ الالتفاتِ إلى ما هو محبوب عندهُم، فهوَ مصافٍ لهم، وهم مصافُونَ لَه، وهذا كما قيلَ في عصفورةِ الجنّة (1) . إنّها لمّا اجتَنبت بُرَّهم اجتَلَبَت بِرَّهم، أَو اجتنبَت حَبَّهم فاجتلبَت حُبَّهُم. وكذلك لمّا صافُوا الخَلقَ بتركِ ما في أيديهِمْ وعدم مزاحمتِهِمْ في أغراضهم وأعراضهم صافُوهم بمحبَّتِهِم وإجلالهم وتعظيمهم وإكرامِهِمْ. وقيلَ، نسبةً إلى صوفانة، وهي بقلةٌ تنبت بالصَّحراءِ، فنُسبُوا إليها لأنهم اجتزأُوا باليَسيرِ وبما يُلتفَتُ إليه، قانعينَ ببقلة مُجتزِئين بِها (2) . وقيل: نسبةً إلى صوفَة، وهي قبيلةٌ كانت تجيرُ الحاجّ في الدّهرِ الأولِ، يُقالُ: أَجيري صوفَةَ (3) ، فكانُوا ساداتِ النّاس ومنقذِيهِمْ، والمقتدى",
    "foot_note": "1. = تنازع الناس في الصوفيّ واختلفوا \n…. قدما وظنّوه مشتقًا من الصّوفِ ولست أمنح هذا الاسم غير فتًى \n…. صافي فصوفي حتى سمّي الصوفي \n1. وردت في حياة الحيوان \"عصفور الجنة\" وتعني الخطاف، أوزوار الهند، وهو من الطيور التي تقطع المسافات البعيدة، رغبة في القرب من الناس، وسمي بعصفور الجنة؛ لأنه زهد بما في أيدي الناس من الأقوات، فلا يأكل البر أو الحب، وإنما يقتات بالذباب والبعوض، وقد ورد في الشعر: كن زاهدًا فيما حوته يد الورى \n…. تضحي إلى كلّ الأنام حبيبا أوّ ما ترى الخطاف حرم زادهُم \n…. أضحى مقيمًا في البيوت ربيبا انظر الدميري: حياة الحيوان، 1/ 293، الجاحظ: الحيوان، 3/ 332. \n2. انظر، ابن الجوزي: تلبيس إبليس، 163 وفيه أنها بقلة رغباء قصيرة، فنسبوا إليها لاجتزائهم بنبات الصحراء\". وانظر أيضًا، الدمياطي: معجم أسماء النبات، 89. \n3. بنو صوفة: بطن من مضر من العدنانية، وهم بنو الغوث بن مر، كانوا يخدمون الكعبة =",
    "book_id": "97",
    "new_page_number": 39
  },
  {
    "serial_number": "281919",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 42,
    "volume_number": 1,
    "text": "بِهم، فلمَّا حصلَتْ لهذهِ الطائفةِ هذه الرُّتْبَةُ، نُسبُوا إلى تلكَ القبيلةِ لمشاركتِهِمْ في التّقدُّمِ والاقتداءِ بفعلِهِمْ، ذكرَه أبُو نُعَيمٍ وغيرُه.  المقام الثاني: في بيان من ينطلق عليه هذه النسبة . وهي تطلقُ باعتبارَيْن: أحدُهما، العرفُ، في لسانِ أهلِ الطريقةِ الأقدَمِينَ، الثاني، في العرفِ الخَاصُ في زمانِنا وما يقرُبُ منْهُ فأمّا الأقدَمُون، فاختلَفتْ عباراتُهم في ذلك، والمعنى واحدٌ أو متقارِبٌ. سُئلَ النُّوري عن الصُّوفي، فقالَ: من سمعَ السَّماعَ وآثَرَ تَرْكَ الأسبابِ. وسُئل ابنُ الجلَّاءِ (1) عنهُ، فقالَ: لا نعرِفُهُ في شرطِ العِلْمِ، ولكنَّهُ فَقِيرٌ مجرَّدٌ من الأَسبابِ، وكانَ مع اللَّه بِلَا مَكان\" (2) .",
    "foot_note": "1. = في الجاهلية ويفيضون بالحجاج من مزدلفة إلى منى، فلا يجوز أحد حتى يجوزوا، وكان أجيزي صوفة، ثم انقرضوا، أنظر، ابن الجوزي: تلبيس إبليس، 161. القلقشندي: نهاية الأرب، 317، ابن منظور، لسان العرب، 11/ 103، ابن خلدون: العبر، 2/ 319، النويري: نهاية الأرب، 2/ 344. \n1. ابن الجلاء (أحمد بن يحيى الجلاء، أبو عبد اللَّه) ت 306 هـ، بغدادي الأصل، أقام بالرملة ودمشق، من أئمة التصوف الثلاثة بالإضافة إلى الجنيد في بغداد، وأبي عثمان في نيسابور، ولقب بالجلاء لأنه \"إذا تكلم جلا القلوب، وإذا وعظ أتى بالمطلوب\"، انظر، أبو نعيم: حلية الأولياء، 10/ 314، ابن الجوزي: المنتظم، 6/ 148، الخطيب البغدادي: تاريخ بغداد، 5/ 213، السلمي: طبقات، 176، الشعراني: طبقات، 1/ 87، المناوي: الكواكب الدرية، 2/ 15 القشيري: الرسالة، 1/ 142 - 143. \n2. وردت العبارة في الرسالة القشيرية 2/ 556. وفيه \"سمعت أبا حاتم السجستاني، سمعت أبا نصر السراج يقول، سئل ابن الجلاء، ما معنى قولهم صوفي؟ =",
    "book_id": "97",
    "new_page_number": 40
  },
  {
    "serial_number": "281920",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 43,
    "volume_number": 1,
    "text": "وقال شيخُ دهرِه وفريدُ عصره، أبو الحسن ابنُ الصَّبّاغِ القُوصيّ؛ الصُّوفي (1) ؛ الذي يُقيِلُ العثْرةَ، ويستُرُ الزلَّةَ ويسُدُّ الخلَّة (2) . وذكر أبو محمد، عبدُ اللَّطيف، بنُ أبي طاهر الترسي البغدادي المعروف بالمُطَجِّن (3) في كتابه \"الدليل في الطريق\"؛ أنَّه سألَ جَماعةً منْ أهلِ العِلْم والتصوُّف عنِ الصُّوفي، فذَكَرَ كلٌّ منْهُم مقالًا. قالَ الشيخُ أحمدُ الرِّفَاعي (4) -وكانَ فَقِيهًا شافِعيَّ المذْهبِ-: مَنْ وفَّى جميعَ المَطْلُوباتِ وَصَفِيَ مِنْ جميعِ الكَدَراتِ.",
    "foot_note": "1. = فقال: ليس نعرفه في شرط العلم، ولكن نعرف أن من كان فقيرًا مجردًا من الأسباب، وكان مع اللَّه تعالى بلا مكان ولا يمنعه الحق سبحانه عن علم كل مكان يسمى صوفيًا. \n1. هو علي بن حميد بن إسماعيل بن يوسف، الشيخ أبو الحسن بن الصباغ القوصي ت 612 هـ، أو 613 هـ، شيخ الدهر في التصوف، باتفاق جميع المراجع التي ترجمت له، نوبي على الأغلب، صحب الشيخ عبد الرحيم بن أحمد بن حجون المغربي، شهر أمره في صعيد مصر، نشأ في بيته وسط المحال، تصدى للتدريس والإملاء، برع في الفقه، وانتهت إليه رئاسة المتصوفة، توفي بقنا من صعيد مصر الأعلى ودفن برباطه بها، أنظر، الأُدفوي: الطالع السعيد، 383، الشطنوفي: بهجة الأسرار ومعدن الأنوار، 221، ط: مصر سنة 1304 هـ، السيوطي: حصن المحاضرة، 1/ 220، ابن العماد الحنبلي: شذرات الذهب، 5/ 52، ابن تغري بردي: النجوم الزاهرة، 6/ 215، اليافعي: مرآة الجنان، 4/ 24 على صافي حسين: الأدب الصوفي في مصر، ابن الصباغ القوصي، ط. دار لمعارفة بمصر سنة 1971 م المنذري: التكملة لوفيات النقلة، تحقيق د. بشار عواد ط. مؤسسة الرسالة، 2/ 340. \n2. وردت العبارة في الطالع السعيد، 383. \n3. هو أبو محمد، عبد اللطيف بن أبي طاهر أحمد بن محمد بن هبة اللَّه الهاشمي البغدادي (ت بإشبيلية بعد سنة 615 هـ) انظر، إسماعيل البغدادي: إيضاح المكنون، 3/ 479 هـ. \n4. هو أحمد بن علي بن يحيى الرفاعي الحسيني، أبو العباس (ت 578 هـ)، ولد في قرية حسن من أعمال واسط بالعراق، وتفقه بها وتصوف، كان يسكن قرية أم عبيدة =",
    "book_id": "97",
    "new_page_number": 41
  },
  {
    "serial_number": "281921",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 44,
    "volume_number": 1,
    "text": "وقالَ الشَّيخُ ابنُ الخطيبِ: الصُّوفي؛ هوَ من قلبُهُ بالمحَبَّةِ مملوءٌ ولسانُهُ بالمعْرِفَةِ يَتْلُو. وقالَ الشيخُ محمدُ بنُ الباقلاني (1) : هو منْ يبذُلُ الطَّعامَ، ويكونُ عذبَ الطَّعامِ، ويَصُومُ النَّهارَ ويتهجَّدُ باللَّيلِ والناسٌ نِيَام. وقالَ الشيخُ عليُّ بنُ البُوقيّ: هوَ منْ يقِفُ مع الشَّرعِ، ويَوْهَدُ في الطَّبع. وقالَ الشيخُ رمضانُ الكُرديّ: هوَ منْ صَفَا سِرُّه مع الحَقِّ، وحَسُنَتْ علانِيَتُه معَ الخَلْقِ. وقالَ الشيخُ أحمدُ البَقْلِيُّ: هوَ منْ قلبُه خالٍ منَ الإراداتِ، وجوارِحُهُ مُشتغلَةٌ بالعِباداتِ، فانٍ في اللَّهِ عنْ جميعِ الموجوداتِ، سليمٌ من الهَفَواتِ.",
    "foot_note": "1. = بأرض البطائح (بين واسط والبصرة)، وأسس الطريقة الرفاعيَّة، له رحيق الكوثر (رسالة في أقواله) انظر، ابن خلكان، وفيات: 1/ 55، الشعراني: الطبقات 1/ 14، الزركلي: الأعلام، 1/ 174، ابن كثير: البداية والنهاية 12/ 312، ابن العماد الحنبلي: شذرات الذهب، 4/ 259. \n1. محمد بن الطيب بن محمد بن جعفر الباقلاني، أبو جعفر ت 403 هـ ولد في البصرة وتوفي في بغداد، من علماء الكلام، انتهت إليه رئاسة الأشاعرة، كانت له مناظرات في القسطنطينية مع علماء النصرانية حين وجهه عضد الدولة سفيرًا إلى ملك الروم، من كتبه \"إعجاز القرآن والإنصاف ومناقب الأئمة\" وغيرها، حول ترجمته انظر، ابن خلكان: وفيات الأعيان، 1/ 481، الخطيب البغدادي: تاريخ بغداد، 5/ 379، الزركلي: الأعلام، 6/ 177. الباقلاني: كتاب البيان عن الفرق، تحقيق رتشرد مكارثي، ط. المكتبة الشرقية، 1958 (المقدمة).",
    "book_id": "97",
    "new_page_number": 42
  },
  {
    "serial_number": "281922",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 45,
    "volume_number": 1,
    "text": "وقالَ الشيخُ حسنُ الفارِسي (1) : هوَ من يلاحِظُ أسرارَ القُرآنِ، ويُعادي الشيطانَ، ويكفُّ لسانَهُ عن الكَلامِ، ويرجعُ على نفْسِهِ بالمَلَاِم، ويتهجَّدُ باللَّيلِ، والناسُ نِيام. وقالَ صاحبُ الكَراماتِ عبدُ الملكِ العطَّار: هوَ منْ طَلَبَ الحَلالَ، وصحِبَ الرِّجالَ، وكفَّ لسانَهُ عنِ المقالِ، فتخبِر عنهُ الحَالُ. وقالَ أبو الفضلِ، ابنُ أبي سعيد: هوَ منْ يجودُ بالموجوداتِ ولا يَخطُر بِبَالِه شيءٌ مفقودٌ، ولا يكونُ في حق الإخوان بالحَقُودِ، وهوَلَهُم خدومٌ وَدودٌ، وإذا تركَ الدُّنيَا فإليْهَا لَا يَعود. وقالَ الحافِظُ، أَبو الفرجِ عبدُ الرحمن بنُ الجوزيّ الفقيهِ (2) : هو مَن زهدَ في الإراداتِ، وتركَ الشَّهواتِ، واستدركَ من عُمرِه ما فاتَ، وأَحيا منهُ ما ماتَ، وصانَ خاطِرَهٌ من الشَّتاتِ، واتَّقى ربَّهُ إلى المَمَاتِ.",
    "foot_note": "1. هو الحسن بن الخطير بن أبي الحسين النعماني الفارسي (ت 589 هـ)، ينسب إلى النعمانية، قرية بين بغداد وواسط، وإلى جده النعمان بن المنذر، ويقال له الفارسي؛ لأنه تفقه بشيراز على مذهب أبي حنيفة، كان مبرزًا في النحو والعروض والقوافي والشعر والأخبار، عالمًا بتفسير القرآن والفقه وعلم الكلام والحساب والمنطق والهيئة والطب، انظر، السيوطي: بغية الوعاة، 1/ 502. \n2. ابن الجوزي: (عبد الرحمن بن علي بن محمد (ت 579 هـ)، حنبلي، محدّث، حافظ، مفسر، فقيه، مؤرخ، معروف، أديب، انظر، ابن رجب: ذيل طبقات الحنابلة، 1/ 399، الذهبي: سير أعلام النبلاء 20/ 365، ابن تغري بردي: النجوم الزاهرة، 6/ 174، السيوطي طبقات المفسرين، 17، ابن الأثير: الكامل، 12/ 71، ابن خلكان: وفيات، 3/ 140، ابن خلدون: العبر، 4/ 297.",
    "book_id": "97",
    "new_page_number": 43
  },
  {
    "serial_number": "281923",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 46,
    "volume_number": 1,
    "text": "وقالَ الشريفُ أبو الفُتوحِ الصُّوفي (1) : من لَازَم في سائر أوقاتِهِ التَّقَوى وصبرَ على البَلْوى، واستوى وقتُه معَ اللَّهِ في السّرِّ والنَّجوى. وقالَ الشيخُ الموفَّقُ البغْدادي الحافِظُ: هو مَنْ يكونُ في حركاتِهِ السّهلُ السَّفُّوح، وعنْ زلّاتِ إخوانِهِ الصّفوحُ، وعلى دينه يبكي ويَنُوحُ. وقالَ الشيخُ مهذَّبُ الدّين أبو المظفَّر الدُّوري (2) : هو مَنْ بالشَّرع تأدَّب، وبالطَّريقةِ تهذَّب، ونفسَهُ بالمُجاهَدَةِ عذَّبَ، واشتغلَ بِذكرِ الحَقّ عن الأُمّ والأَب. فهذِه أَقوالُ أهل الطَّريقِ وأصحاب العلم والتَّحقيقِ، ومدارُها كلُّها على أن الصّوفيَّ هوَ مَنْ اتَّصفَ بالصِّفاتِ المحمُودةِ في الشَّرعِ، وتخلّقَ بالأَخلاق الممدوحةِ، وإنْ بَعُدَ مِنها الطَّبعُ، مُعرِضٌ عنِ الدُّنيا، مَقبِلٌ على الأُخرى، سالكٌ الطّريقَ التي هي أولى بالمَرِء وأحرى. وأما: العرف الخاصُّ، فهو ما رسمتُهُ في كتاب \"الإسعاف\" وأكثرُ",
    "foot_note": "1. أبو الفتوح الصوفي: هو السيد أبو الفتوح المرتضى بن الحسن بن خليفة الحسن الصوفي، من أهالي الري، خادم رباط باختيار الصوفي وختنه، سمع بأصبهان أبا علي الحسن بن أحمد الحداد، سمع منه عبد الكريم السمعاني انظر، السمعاني: التحبير في المعجم الكبير، 2/ 293، معجم الشيوخ، ورقة 259 أ، نسخة أحمد الثالث - إستانبول رقم 2953، منه ميكروفلم في معهد إحياء المخطوطات بالقاهرة رقم 164. \n2. هو محمد بن علي بن نصر البّل الدوري (ت 598 هـ)، أبو المظفر، واعظ، ولد بالدور (أي دور الوزير إبن هبيرة) بدُجيل سنة 516 هـ، أو 517 هـ، ونشأ بها، قدم بغداد في شبيبته: اشتهر بالوعظ حتى صار يضاهي أبا الفرج بن الجوزي ويزاحمه، وكان يعظ عند تربة أم الخليفة الناصر سنة 589 هـ، انظر البغدادي (عبد الرحمن بن أحمد)، ابن رجب: الذيل على طبقات الحنابلة، 4/ 74 - 76.",
    "book_id": "97",
    "new_page_number": 44
  },
  {
    "serial_number": "281924",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 47,
    "volume_number": 1,
    "text": "ما يطلقُ على منْ يَلبَسُ لِبْسةً مخْصوصةً منْ دَلِقٍ (1) أو فُرْجِيَّة (2) أو (جلنك) (3) ، ولَهُ عِمامَةً لَطيفَةٌ يُرخي مِنْهَا عَذْبَةً (4) قصيرَةً منْ قُدّامِهِ، ويحضُرُ في الخَانقَاه بَعدَ العصْرِ ليحضُرَ القِراءَة والذِّكرَ، غيرُ متعاطٍ للحِرَفٍ الدَّنِيئَةِ منَ الحِياكَةِ والحِجَامةِ وشِبْهِهَا، غَيرُ موصوفٍ بالثَّروةِ.  المطلب الثالث: من يستحقُّ من الوقفِ والوصيةِ للصُّوفية: إذا صحَّحْنَا ذلك، فإنَّه من الفُقَهاءِ مَنْ قالَ: لا يَصِحُّ لِعَدَمِ ضَبْطِهِ ووقوفه عندَ حَدٍّ، ولا شَكَّ أنَّ هذا هوَ الظّاهِرُ، إذا جعلَنا التصوفَ راجعًا إلى الأخلاق وصِفَاتِ النَّفسِ المحمودَةِ، فإنّا لا مطلَعَ لَنا على البَوَاطِنِ والظواهِرِ التي تدلُّ على ذلكَ، قد تكونُ مطابِقَةً لمَا في الباطِنِ، وقد لَا تكونُ، كما قالَ: \"إنَّ الرّجلَ ليعملُ بعملِ أهلِ الجنَّةِ فيما يبدُو للنَّاسِ، وهو منْ أهلِ النّارِ\" (5) .",
    "foot_note": "1. الدلق: سبق شرحه في ص 21 حاشية (3). \n2. فرجيه: ثوب فضفاض، له كمان واسعان طويلان يتجاوزان قليلًا أطراف الأصابع، وقد يكون لها ذيل يُرخى من فوق الرأس. انظر دوزي: الملابس، المنشور في اللسان العربي، ص 166 - 169، ماير: الملابس المملوكية، 930، ابن الفرات: تاريخ، ج 9 ص 460. \n3. كلمة غير مقروءة ورسمها \"حلنك\" ولعلها \"جلباب\" أو حلتك، ويكون عادة من صوف الخرفان. \n4. عذبة أي طرف تسترسل على الملابس، انظر السيوطي: حسن المحاضرة، 2/ 218. \n5. قطعة من حديث طويل رواه البخاري رقم (3208) في بدء الخلق: باب ذكر الملائكة، ومسلم رقم (2643) في القدر: باب كيفية التخلق الآدمي في بطن أمه، وانظر تتمة تخريجه والتعليق عليه في كتابي \"شرح الأربعين النووية\" طبع دار ابن كثير بدمشق ص (23 - 25) (م).",
    "book_id": "97",
    "new_page_number": 45
  },
  {
    "serial_number": "281925",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 48,
    "volume_number": 1,
    "text": "ولم يَرِدْ لَنَا من الشَّرعِ في ذلك حتّى نُنيطَ الحُكَم بالأسباب الظَّاهِرَةِ، وقد بينَّا أنَّ اسمَ الصّوفِيّةِ حادثٌ بعدَ النبيّ والصَّحابةِ والتَّابعينَ وأتباعِ التَّابعين، والأصل في الأحكام الشّرعيّةِ أن تُنَاط بأمرٍ منضَبِط، وإنَّما يخرجُ عنْ هذا حيثُ طلبَ الشرعُ منَّا فِعلًا ووجدناهُ لا يرتبِطُ بأمرٍ مضبوطٍ، فننيطُ الحكمَ بأمرٍ يدلُّ على ذلك دلالةً طيِّبةً لأجلِ طلبِ الشّارعِ، ولم يَرِدْ في الشرعِ الوقفُ على الصُّوفيةِ ولا الوصيَّةُ لهُم. ولعلَّه حدثَ بعد انقراضِ الأعصارِ المبارَكةِ، وذهابِ أئمَّةِ الاجتهادِ، فلَا وقفتُ عليهِ لأحدٍ قبلَ الأربعِ مئة. ثم إنَّ ما نربِطُه بهِ منَ الظَّاهرِ لا يرفَعُ التَّنازُع والاختلافَ لاضطرابِهِ، فبعضُهُم يقولُ: هذا القدرُ كافٍ، وبعضُهْم يقولُ: لا يكفي، بل لا بدَّ من اعتبار أمورٍ، وذلكَ مبطلٌ، كما إذا اضطربَ العُرفُ في مسائلِ الإِجارة والمساقاةِ، فإنَّه يجبُ البيانُ وإلّا بَطُلَ. ومنْ ذلكَ مسألةُ الحبرِ، هلْ هُوَ على النَّاسخِ أم لَا؟ وشَبَهُه. ومن صحَّ في غالبِ الأوقاتِ، هل المرادُ اللَّيلُ أو النهارُ، أو الليلُ والنهارُ، والجزمُ بواحدٍ منها يحتاجُ إلى تحريرٍ، وهذا سببٌ يقتضي البُطلَانَ، فإنَّ القولَ بالبطلانِ متَّجهٌ (1) ، وَهُو اختيارُ الشيخِ أبي محمّد الجُوَيني (2) وبعضِ الحنفيَّةِ. وبعض الحنفيَّةِ أيضًا يقولُ: إنَّ الأوصافَ التي ينطبِقُ علَيْها اسمُ",
    "foot_note": "1. متجه أي له وجه. \n2. أبو محمد الجويني: هو عبد اللَّه بن يوسف بن عبد اللَّه الجويني (ت 438 هـ)، والد إمام الحرمين، ولد في جوين، له معرفة بالأصول والنحو والفقه والتفسير والأدب، انظر، السبكي: طبقات، 5/ 73، ابن خلكان: وفيات، 2/ 250، الأشعري: تبيين كذب، 257، ابن كثير: البداية والنهاية 2/ 55.",
    "book_id": "97",
    "new_page_number": 46
  },
  {
    "serial_number": "281926",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 49,
    "volume_number": 1,
    "text": "الصوفي في عُرفهِم، لَا يصحُّ الوقفُ على المتَّصِف بها، ومثلُ هذا محكيٌّ عَنِ الشَّافعي، رحمه الله، رأيتُ في جزءٍ من كلام المُزَنيّ (1) أنَّ الشافعيَّ سُئِلَ عنِ الصُّوفي، فقالَ: رجُلٌ أكولٌ جَهولٌ، كَثيرُ الفُضُولِ، وفي بعض طُرُقِهِ نؤوم. وقدْ ساقَ مثلَهُ الحافظُ، أبو عبدِ اللَّه بنُ النَّجّارِ (2) عن الشَّافعيّ: \". . . والوقفُ على المتَّصفِ بهذه الصِّفات والوصيَّةُ لَهُ لا تَصحّ\". وأمَّا منْ قال يصحّ، فاختَلَفتْ آراؤُهم في المُستحِقّ. فقالَ القاضي الحسينُ الشافعي في \"تعليقته\" (3) ، إذا وُقفَ على الصُّوفيَّة صحَّ، ويصرف إلى المشتغل بالعبادَةِ في غالبِ الأوقَاتِ، فأمَّا منْ يشتغلُ بالأكلِ والسَّماعِ والرَّقصِ فَلَا. وتبعَهُ على ذلك أبو سعيدٍ المتَولّي (4)",
    "foot_note": "1. المزني هو إسماعيل بن يحيى، أبو إبراهيم ت 264 هـ، له مختصر المزني في فروع الشافعية طبع بهامش كتاب الأم للشافعي سنة 1321 هـ/ 1913، بالمطبعة الميرية الكبرى ببولاق انظر، ابن خلكان: وفيات، 2/ 217 (ترجمة 93)، الحسيني، أبو بكر هداية اللَّه، طبقات الشافعية، 20. \n2. هو الحافظ، محب الدين، أبو عبد اللَّه، محمد بن محمود بن الحسن، المعروف بابن النجار البغدادي ت 643 هـ، انظر ترجمته في، الذهبي: تذكرة الحفاظ، 4/ 212 (ط. حيدر أباد)، ابن العماد الحنبلي: شذرات الذهب، 5/ 226، ابن الفوطي: الحوادث الجامعية، 205، الكتبي: فوات الوفيات، 2/ 522 (ط، القاهرة). \n3. القاضي الحسين: هو أبو علي، الحسين بن محمد بن أحمل المروروذي (ت 462 هـ)، من كبار أصحاب القفال، يلقب بحبر الأمة، ومن كبار فقهاء الشافعية، له التعليقة المشهورة في الفقه، انظر، السبكي: طبقات 3/ 155، ابن العماد الحنبلي: شذرات الذهب، 3/ 310، ابن خلكان: وفيات الأعيان، 2/ 134، ابن خلدون: العبر، 3/ 249. \n4. هو أبو سعيد، عبد الرحمن بن مأمون بن علي بن إبراهيم النيسابوري (المتولي) =",
    "book_id": "97",
    "new_page_number": 47
  },
  {
    "serial_number": "281927",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 50,
    "volume_number": 1,
    "text": "وزاد، فقالَ: يُصرفُ إلى كلّ منْ كانَ مشتغِلًا بالعباداتِ في غَالبِ أحوالهِ، ويكونُ معرِضًا عنْ أُمورِ الدُّنيا، وتبعَهُ الرَّافعي (1) . وقَالَ قاضي القضاةِ، أبو محمَّدٍ الحارثي الحنبليّ الحافظ (2) ، في \"شرح المقنع\": \"يصحُّ الوقفُ على الصُّوفيَّة، وهمْ المنقَطِعونَ للعبادةِ وتصفِيَةِ النَّفسِ من الأخلاقِ المذمُومةِ، ولم يعتبرْ هؤلاءِ الفقرَ والزي ولبسَ الخرقةِ منْ يدِ شيخٍ، ولا مخالطةَ الصوفيَّةِ في مساكنهِم في الخانقَاه، بل اقتصروا على ذكرِ ما ذَكرتُ، بل صرَّحَ الحارِثي فيهم، أنّ الغِنى والزيّ ولبس الخرقةِ من يدِ الشيخِ لا تُعْتَبر\". وقالَ بعضُ الحنفيَّةِ: \"يصحُّ الوقفُ، ويُصرفُ إلى مَنْ لا يملِكُ نصابَ الزَّكاةِ\".",
    "foot_note": "1. = ت 478 هـ، فقيه، مناظر، عالم بالأصول، درس بالنظامية، صنف في الفوائد ومسائل الخلاف، وله التتمة، انظر، ابن العماد الحنبلي: شذرات الذهب، 3/ 358، السبكي: طبقات، 5/ 106. ابن خلكان: وفيات، 3/ 133، الحسيني: طبقات الشافعية 176، ابن الجوزي: المنتظم، 9/ 18. \n1. الإمام الرافعي: هو شيخ الإسلام، عبد الكريم بن محمد بن الفضل القزويني (ت 624 هـ)، من كبار فقهاء الشافعية، مفسر، محدث، له فتح العزيز في شرح الوجيز وشرح مسند الشافعي وغيرها انظر، ابن العماد: شذرات، 5/ 108، السبكي: طبقات، 5/ 119، ابن شاكر الكتبي: فوات الوفيات، 2/ 7، الحسيني: طبقات، 218 - 220. \n2. هو مسعود بن أحمد بن مسعود بن زيد بن عياش الحارثي، الحافظ، قاضي القضاة، أبو محمد (ت 711 هـ) ولد سنة 653 هـ، سمع من البرهان الحراني والرضى ابن البرهان، وجماعة من أصحاب الجوهري، شرح سنن أبي داود، وشرح قطعة من المقنع، والحارثي: نسبة إلى قرية الحارثية الواقعة غربي بغداد، انظر الأدفوي: الطالع السعيد، 113، ابن رجب: طبقات الحنابلة، 4/ 262 - 264، والمقنع هو كتاب المقنع في الفقه للمحاملي (أحمد بن محمد بن أحمد الضبي) (ت 415 هـ)، =",
    "book_id": "97",
    "new_page_number": 48
  },
  {
    "serial_number": "281928",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 51,
    "volume_number": 1,
    "text": "وقالَ الغزالي في الإحياء (1) : \"التصوُّف أمر باطنٌ، لا يُطَّلَعُ عليهِ، فلا يمكنُ ربطُ الحُكْمِ بهِ، بل بأُمورٍ ظاهرةٍ يعولُ عليْها أهلُ العرفِ في إطلاقِ اسمِ الصُّوفيّ. قالَ: \"والضابطُ الكلِّي أن كل من هو بصفة إذا نزلَ الخانقاه التي للصُّوفيَّةِ. لَم يكنْ نزولُهُ فيها واختلاطُه بِهمْ منكرًا عندَهم، فهوَ داخلٌ في غِمارِهم\" (2) ، وهذا الذي ذكرَهُ الغزالي لا يُناسِبُ تحقيقَهُ، لأنَّ كتاب الإحياءِ ليس موضوعًا للتحقيق على طريقَةِ الفقهِ، وأكثرُهُ أو كثيرٌ منهُ مبنيٌّ على كلام صوفي، وتصنيفُه في الفقه بعدَ ذلك، وقد أَحالَ في كتبِهِ الفقهية على أشياءَ ذكرَها في الإحياء، فقوله، أنه يُعدّ منكرًا عندَهُم، والكلامُ في أنّ الصوفيّ منْ هُوَ حتّى إذا عرفْنَاه اعتبرنَا إنكاره، وهوَ لم يبيّنْهُ قبلُ، وأحالَ عليهِ، فهوَ عجيبٌ منهُ\". قالَ: \"وأمّا من حيثُ التفصيلُ فيُلاحظُ فيه خمسُ صفاتٍ: الصلاحُ والفقرُ وزيُّ الصوفيَّةِ، وأنْ لَا يكونَ مشتغِلًا بحرقَةٍ، وأنْ يكونَ مخالِطًا لهم بطريقِ المساكنَةِ في الخانقاه\" (3) . قال: \"ثم بعضُ هذهِ الصفاتِ مِنْها (4) يوجِبُ زوالُها زوالَ الاسمِ، ومنها ما ينجبرُ بعضُه بالبعضِ، فالفسقُ يمنعُ الاستحقاقَ، فإنَّ الصوفي في",
    "foot_note": "1. = السيوطي: حسن المحاضرة، 1/ 358، ابن العماد: الحنبلي: شذرات، 6/ 28. \n1. الغزالي: هو محمد بن محمد، أبو حامد (ت 505 هـ)، فيلسوف، متصوف، معروف، والإحياء هو كتاب إحياء علوم الدين، انظر، ابن العماد الحنبلي: 4/ 10 - 13، الأشعري: تبيين: 291 - 306، الصفدي: الوافي بالوفيات، 4/ 101 - 182، الحسيني: طبقات الشافعية، 192. \n2. وردت في إحياء علوم الدين، 2/ 153. \n3. المرجع السابق نفس الصفحة. \n4. في الإحياء \"مما يوجب\".",
    "book_id": "97",
    "new_page_number": 49
  },
  {
    "serial_number": "281929",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 52,
    "volume_number": 1,
    "text": "الجملةِ عبارةٌ عنْ رجلٍ منْ أهلِ الصّلَاحِ بصفةٍ مخصوصةٍ، فالذي يظهرُ فسقُه، وإنْ كانَ على زيِّهِمْ لا يستحقُّ ما وُصِّي بهِ للصُّوفيةِ، ولسنَا نعتبرُ فيهِ الصَّغائرَ. وأمّا الحرفةُ والاشتغالُ بالكتبِ فيمنعُ الاستحقاق، فالدهقانُ والعاملُ والتاجرُ والصايغُ (1) في حانوتهِ أو دارِهِ، والأجيرُ الذي يخدمُ بأجرهِ، كلُّ هؤلاءِ لا يستحقُّونَ من الموقوفِ على الصوفيَّةِ وَلا ينجَبِرُون بالزيّ والمخالَطَةِ. وأمَّا الوراقهُ والخياطةُ وما يقربُ منهُمَا ممَّا يَلِيقُ بالصُّوفيَّةِ تعاطيهَا، فإذا تعاطَاها لا في حانوتٍ ولا على جهةِ اكتسابٍ وحرفةٍ، فذلكَ لا يمنعُ الاستحقاقَ وينجبرُ بالمساكنَةِ معَ الاتِّصافِ ببقيةِ الصفاتِ، والقدرةِ علَيها منْ غير مباشَرَةٍ لا تَمنَع. وأمَّا الوعظُ والتدريسُ، فَلا يُنافي اسمَ التصوُّفِ إذا وُجِدَت بقيَّةُ الأوصافِ منَ الزِّيّ والمساكَنَةِ والفَقرِ، إذ لَا يتناقَضُ صوفيٌّ مُقْرِئٌ، واعظٌ، عالمٌ، مدرِّسٌ (2) ، كلُّ هذا لا يتناقَضُ، ويتناقَضُ أن يُقَالَ دهقانٌ أو تاجِرٌ أو عامِلٌ. وأما الفَقْرُ، فإنْ زالَ بِغِنًى مفرطٍ يُنسبُ الرجلُ بهِ إلى الثَّروةِ الظَّاهِرَةِ، فَيُمْنَعُ الاستحقاق وإنْ كانَ لَهُ مالٌ، ولكنْ لا يفي دخلُهُ بخرجِهِ، أو لَهُ مالٌ قاصِرٌ عن وجوبِ الزَّكاةِ. وإنْ لم يَكُنْ لَه خرجٌ لمْ يُمْنَع الاستِحقَاق. قالَ: وهذهِ أُمورٌ لَا دليلَ علَيْهَا إلَّا العَادَاتُ (3) .",
    "foot_note": "1. في الإحياء \"الصانع\". \n2. في الإحياء 2/ 153 \"وصوفي واعظ وصوفي عالم أو صوفي مدرس\". \n3. الإحياء 2/ 153.",
    "book_id": "97",
    "new_page_number": 50
  },
  {
    "serial_number": "281930",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 53,
    "volume_number": 1,
    "text": "وأمَّا المُخالَطَةُ والمُساكَنَةُ فَلَهُ أثرٌ، ولكنْ منَ لَا يُخالِطهم وهوَ في دارِهِ أو في مسجدٍ وَهَو على زيِّهم ومتخلِّقٌ بأخلاقِهِمْ فهوَ شَريكٌ لهُمْ فِي الاستحقاقِ، وكانَ تركُ المخالطةِ يجبرُهُ (مُلازَمَةَ) (1) الزيّ، فإنْ لمْ يَكُنْ على زَيِّهم، ووُجِدَتْ بقيةُ الصِّفْات فَلَا يستحِقُّ إِلَّا أن يكون يُساكِنُهُم في الرُّبط فينسحبُ عليهِ حكمُهُم بالتَّبَعِيَّةِ. قال: وأما لبس المرقَّعِ منْ يدِ شيخٍ منْ مَشَايِخِهمْ فليسَ شرطًا في الاستحقاقِ وعدمهِ لَا يضرُّ مع وجود بقيَّةِ الشرائط المذكُورة. والسهروردي (2) أيضًا قال: الغزالي جعل لبس الخرقَةِ من شيخٍ وعدمِهِ سيَّان ثمَّ قالَ الغزالي: وأما المتأَهِّلُ المتَردّدُ بين الرباطِ والمسكنِ فَلا يخرجُ عن جُملَتِهم (3) . قال: وللفقيه أن ينزلَ عندَهُم إذا كان على زيِّهم وأخلاقهِمْ، وليسَ الجهلُ شرطًا في التَّصوُّفِ عندَ مَنْ يعرِفُ التَّصوُّفَ. قال: ولا يُلتَفَتُ إلى خُرافاتِ بعضِ الحمْقى، إنَّ العلمَ حجابٌ، فالجَهلُ هوَ الحِجابُ\" (4) . -هذا تمامُ كلامِ الغَزَالِيّ-.",
    "foot_note": "1. الإضافة من الإحياء، 2/ 153. \n2. هو عبد القاهر بن عبد اللَّه بن محمد البكري الصدّيقي، أبو النجيب السهروردي (ت 563 هـ)، فقيه شافعي، واعظ، متصوّف، سكن بغداد وبنيت له عدة ربط فيها، وتوفي بغداد، له آداب المريدين، عوارف المعارف، انظر ابن خلكان: وفيات الأعيان، 1/ 294، السبكي: طبقات الشافعية، 4/ 356، الشعراني: طبقات، 1/ 140، حاجي خليفة: كشف الظنون، 1/ 43، الذهبي: العبر، 4/ 181، ابن العماد الحنبلي: الشذرات، 4/ 208. \n3. انظر إحياء علوم الدِّين، 3/ 154. \n4. المرجع السابق، الصفحة نفسها.",
    "book_id": "97",
    "new_page_number": 51
  },
  {
    "serial_number": "281931",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 54,
    "volume_number": 1,
    "text": "وهوَ في كثيرٍ منهُ لمْ يَجْرِ على القواعد الفِقهيَّة، وإنَّما مشى فيهِ على الرسوم المُحدَثةِ للصوفيَّةِ، وقد اعترفَ أنَّه لا دليلَ عليه إِلَّا العاداتُ، فإن ادعى أنَّ ذلك عادةٌ مطَّرِدَةٌ في الأَزمِنَةِ والأَمكِنَةِ فلَا دَليلَ عليْهَا، وما قالَهُ غيرُ مسلَّمٍ به، وإنِ ادَّعى عادةَ خاصَّةَ بزمانٍ أو مكانٍ فهوَ عرفٌ خاصٌّ، والعرفُ الخاصُّ لَا اعتبارَ بهِ عندَ أهلِ الفَتْوى. أَلا تَرى أنَّ المساقاةَ عندَ أصحابنَا محمولةُ على العُرفِ، وجعلُوا البقرَ على المالكِ اعتبارًا بالعُرْفِ العامِ في استِقْرَائِهِم. ثم إنَّ عُرفَ بلادِنا قاطبةً أنَّها على العاملِ، ولم يَلتفِتْ إلى هذا الخاص، بل نَصُّوا على أَنَّها إذَا شُرِطَت على العاملِ بَطُلَ العقد، وأشباهُ ذلكَ كثيرٌ في أبوابٍ متَفرِّقَة. ثم إنَّ العرفَ إذا وُجِدَ إنَّما يُعتَبَرُ حيثُ كانَ موافِقًا لِمَا دلَّت الأدِلَّةُ على اعتبارهِ، وينتفي المعارِضُ عنهُ من شرعٍ أو لغةٍ، ويكون عامًّا عندَ تلكَ الطَّائفةِ، وما ذكرهُ حادثٌ بعد الأربعِ مئة، وبعدَ مُضِيّ أهلِ الحقائقِ منْ هذِه الطَّائفةِ الصُّوفيَّةِ، وأرباب الرُّسوم المرعيَّةِ، ولا اعتبارَ بمن حَدَث فَأَحدث حدثًا، ونحن نَتكلَّمُ على تفاصيلِ ما ذكرهُ وفصَّلهُ وقرَّرهُ وأصَّلَهُ، فقولُه: إنَّه يعتبرُ الزيَّ، لا أصل لهُ من الشَّرع ولم يقل ذلك، ولا نقلَ عن الأقدَمِين المعتَبَرِينَ، بل الاقتصارُ عليهِ مخالفٌ، لما كانَ عليه وأصحابُه، فقدْ لبِسَ جبَّةً ضيِّقَةَ الكُمَّيْنِ، ولبسَ حُلَّةً، وكانَ يتعمَّم بعِمَامةٍ ويُرخي طَرفَهَا بينَ كَتِفَيْه، وتَحنّكَ أيضًا بالعِمامةِ، ولبِسَ عِمَامةٌ سوداءَ، وتردَّى بِرِداء. وكذلك الصَّحابة لبِسُوا أنواعًا مُختلِفَةً وتَطَيْلَسَ منهُم جماعةٌ، منهُم،",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 52
  },
  {
    "serial_number": "281932",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 55,
    "volume_number": 1,
    "text": "جابرُ بنُ عبدِ اللَّه (1) وجُبيرُ بنُ مُطعمِ (2) . وذكرَ الحافظُ أبو عُمرَ النمري (3) أنَّ بعض الصَّحابة كانَ يَتَطَيْلَسُ بِطَيْلَسَانٍ (4) أخضرَ، ووردَ التَّقنُّعُ أيضًا، وهو جعلُ الرِّداءِ على الرَّأْسِ. وأخرج التّرمذيُّ في \"جامعِهِ\" عن جُبير بن مُطْعِم، أنَّه قَالَ: \"ركبتُ الحمارَ، ولبِستُ الشَّملَةَ (5) وحلبْتُ الشاةَ\". بلْ قَالَ: قالَ رسولُ اللَّه من فعلَ هذا، فليسَ فيه منَ الكِبْرِ شيءٌ\" (6) . وقالَ: حديثٌ حسنٌ. وقال السُّهرَوَرديُّ: ومن النَّاسِ منْ لا يَقْصِدُ لُبْسَ ثوبٍ بعَيْنهِ لا لِخُشونةٍ",
    "foot_note": "1. هو جابر بن عبد اللَّه بن عمرو بن حرام بن ثعلبة الأنصاري، من أهل بيعة الرضوان (ت 77 هـ أو 78 هـ). انظر، خليفة بن خياط: الطبقات ترجمة 623، ابن الأثير: أسد الغابة، 1/ 256، الذهبي: سير أعلام النبلاء، 3/ 489. \n2. جبير بن مطعم بن عدي بن نوفل بن عبد مناف بن قصي، شيخ قريش في زمانه، من الطلقاء الذين حسن إسلامهم (ت 58 هـ أو 59 هـ)، انظر ابن حبيب: المحبر، 67، 69. ابن الأثير: أسد الغابة، 1/ 323، الذهبي: سير أعلام النبلاء، 3/ 95. \n3. هو ابن عبد البَرّ النمري: يوسف بن عبد اللَّه بن محمد بن عبد البر بن عاصم النمري القرطبي، أبو عمر (ت 463 هـ) من كبار حفاظ الحديث، مؤرخ، أديب، بحاثة، له الاستيعاب، وبهجة المجالس، وغيرها، انظر ابن خلكان: وفيات، 7/ 66، الضبي: بغية الملتمس، 474، الزركلي: الأعلام، 8/ 240، الذهبي: العبر، 3/ 255، ابن العماد الحنبلي: شذرات الذهب، 3/ 314. \n4. الطيلسان: قطعة قماش تلبس على الكتفين وتتدلى على شكل ذؤابتين وتكون طويلة، انظر دوزي: معجم الملابس - مادة طيلسان، ياقوت: معجم الأدباء، 1/ 373، 5/ 261. \n5. الشملة: مثل الكساء، تلف حول الجسم كالإزار، وتكون طويلة أو قصيرة، انظر ابن منظور: لسان - مادة شمل، أبو الفرج الأصفهاني: الأغاني، 4/ 83. \n6. قطعة من حديث رواه الترمذي رقم (2002) في البرِّ والصلة: باب ما جاء في الكِبْر، وقال: هذا حديث حسن صحيح غريب، وقال والدي حفظه اللَّه عقب تخريجه في \"جامع الأصول\" (10/ 623): وهو كما قال. (م).",
    "book_id": "97",
    "new_page_number": 53
  },
  {
    "serial_number": "281933",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 56,
    "volume_number": 1,
    "text": "وَلا لنعُومةٍ، بل يلبَسُ ما يدخلُ عليهِ الحقُّ ويكونُ بحُكمِ الوقتِ، وَهذا حَسَنٌ (1) . قال: وكانَ شيخُنَا أبو النّجيبِ يلبَسُ ما اتَّفقَ، ولَا يتقيَّدُ بهيئةٍ من الملبُوسِ وكانَ يلبَسُ العمامة بعشرة دنانيرٍ، ويلبس العِمامةَ بقليلٍ. قال: وكانَ الشيخُ عبدُ القادرِ (2) يلبَس هيئةَ مَخْصوصةً ويَتَطَيْلَسُ. قال: وكان الشيخُ أبو السعودِ (3) يُساقُ إليه ثوبٌ ناعمٌ فَيلبَسهُ، فيُقالُ: ربَّما يُنكَرُ علَيكَ، فيقولُ: لا نَلْقى إِلَّا أحد رَجلَيْنِ، رجلٍ يطالِبُنا بظاهِرِ الشَّرعِ، فَنَقولُ لَهُ: هل تَرى الشَّرعَ يكرهُ هذا، ورجلٍ يُطالِبُنا بحقائقِ القَومِ، فنَقولُ لهُ: هلْ ترى لَنا فيمَا لَبِسْنَا اخْتيارًا (4) فالاقتصارُ على زيٍّ واحدٍ لا يفعلُ غَيرُهُ فعلَ مَردودٍ على فاعِلِهِ محكومٍ ببُطلانِ أواخرِهِ وأوائِلِهِ، وليسَ فيهِ قُربَةً حتّى يُعتَبَرَ في الوقفِ على الجهةِ العامةِ. وإمّا اشتراطُهُ الخِلطَةَ والمُساكنةَ، فأَيُّ شيءٍ دلَّ علَيْهِ؟ فإِنَّ",
    "foot_note": "1. وردت في عوارف المعارف، 356. \n2. هو عبد القادر بن موسى بن عبد اللَّه بن جنكي دوست الحسني، محيي الدِّين الجيلاني (ت 561 هـ)، مؤسس الطريقة القادرية، زاهد، متصوف، ولد في جيلان -طبرستان- انتقل إلى بغداد، برع في الوعظ، انظر، ابن تغري بردي: النجوم الزاهرة، 5/ 371، الشعراني: الطبقات، 1/ 126، الكتبي: فوات الوفيات، 2/ 2، ابن العماد الحنبلي: شذرات، 4/ 198. \n3. المقصود الشيخ، أبو السعود بن أبي العشائر بن شعبان بن الطيب الباذيني (ت 644 هـ)، من واسط بالعراق - انتقل إلى مصر، وكان من أجلاء صوفية مصر، انظر الشعراني: طبقات، 1/ 162. السيوطي: من المحاضرة، 1/ 297، ابن الملقن: طبقات الأولياء، 406. \n4. وردت في عوارف المعارف 357 \"ولكن بتصرف عند الأُدفوي\".",
    "book_id": "97",
    "new_page_number": 54
  },
  {
    "serial_number": "281934",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 57,
    "volume_number": 1,
    "text": "اسمَ التصوُّفِ والصُّوفيّ صادقُ بدونِ ذلكَ، وَلَا يَقُل (1) إنَّ الأَقدَمِينَ اتَّصَفُوا بِها. أمَّا المُساكنَةُ فلم تكُنْ ثَمَّ خانْقات (2) ولا رُبُطٌ للصُّوفيَّة، وإنَّما حدثَ ذلكَ بعدَ الأربعِ مئة وأمَّا المخالَطَةُ، فالسَّلَفُ اختلَفُوا في أنَّ العُزلةَ أفضَلُ أم لَا؟ . قال أبو سعيد الخُدْريّ: سُئِلَ رسولُ اللَّه، أيُّ النَّاس أفضلُ؟ قالَ: \"رجلٌ مجاهدٌ في سبيل اللَّه\". قالُوا: ثُمَّ. قالَ: \"ثُمَّ رجلٌ مؤمنٌ في شُعَبٍ مِنَ الشِّعاب يَشْقَى بِهِ، ويدَعُ النَّاسَ من شرِّه\" (حديث صحيح) (3) . ومنْ رجَّحَ مخالطَةَ النَّاسِ، لم يَقصُرْهُ على طائفةٍ مخصوصَةٍ، بلْ لا شكَّ أنَّ العُزلَةَ أرجحُ من مخالَطَةِ مَنْ أحدَثَ رُسُومًا، وجعلَهَا شَرعًا، وأيُّ شاهدٍ اعتبارُ منْ يلبسُ جُمجُمًا (4) في رجلَيْهِ ويُصَيِّرُ عذَبتَهُ بين يديه أو لَهُ طَرطُورٌ طَويلٌ كأنَّهُ زَلُّومَةُ فيلٍ. وقد ثبت في \"صحيحِ مسلمٍ\" أنَّ رسُولَ اللَّهِ، قال: \"إنَّ اللَّهَ لَا ينظُرُ إلى صورِكُم وأموالِكُمْ ولكِنْ ينظُرُ إلى قُلوبِكُم وأعمالِكُم\" (5) . فَشَيءٌ لا ينظرُ اللَّه إليه لا يكونُ شرطًا لاستحقاقِ ما يُتَقَرَّبُ بِهِ إليهِ.",
    "foot_note": "1. المرجع السابق ونفس الصفحة. \n2. الأصح \"خوانق\". \n3. رواه الإمام أحمد في \"المسند\" (3/ 56) وقد ذكره المؤلف بالمعنى وباختصار، وهو حديث ضعيف. (م) \n4. الجمجم: ضرب من المكاييل، انظر اللسان -مادة- جمجم. \n5. رواه مسلم رقم (2564) في البر والصلة: باب تحريم الظن والتجسس والتنافس من حديث أبي هريرة. (م).",
    "book_id": "97",
    "new_page_number": 55
  },
  {
    "serial_number": "281935",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 58,
    "volume_number": 1,
    "text": "ثم إنَّ الزيَّ مختلِفٌ، قومٌ منهمْ لَهُمْ زيٌّ، وآخرون زيٌّ. وهكذا دائمًا في أماكِنَ مُختلِفَةٍ، فأَيُّها المُعتَبرُ. وإذا اعتبرنا كلَّ إقليمٍ بِزِيِّهِ، فإذا وردَ أهلُ ذاكَ الإِقليمِ إلى إقليمٍ آخرَ، هل يُلْزَمُون باتِّباعِ إقليمِهِمْ أو بالإقليمِ الذي انتَقَلُوا إليهِ؟ ويتسلسلُ، وكلُّ ذلكَ دليلٌ عليهِ. وأمَّا اشتِراطُ الفقرِ، فاللَّفظُ لا دلالَةَ لَهُ عَلَيْهِ، ولكِنَّ العُرْفَ مُشعِرٌ بهِ، فيخرُجُ على ما إذا وَصّى للأيْتَامِ. وقد قالَ الماوردي (1) : \"والرِّواياتُ فيهِ أنّه إنْ وصَى لأيتامِ قَبيلةٍ معيَّنةٍ ولا يَشْترِطُ الفقرَ في أيتامِ تلكَ القبيلةِ، وإلّا فوجهانِ، يُنْظَرُ في أحَدِهِما إلى اللَّفظِ، والآخرُ إلى العُرْفِ. فإنَّ العادةَ جاريةٌ في أنَّ الإِنسانَ لا يُوصي للأيتامِ الَّذينَ لهمْ ثَروةٌ. وكذلكَ إذَا وَصَّى لأرامل قبيلةٍ، فَفِيهِ ما ذكرنَاهُ. وكذلكَ الوصيَّةُ للزَّمْنَى، وقطعَ بَعضُهُم بأنَّه لا يشترِطُ الفَقْرَ، ومنهمْ منْ أجرى الخِلَافَ. وإنْ جعلْنا الصوفيةَ منسوبِينَ إلى أهلِ الصُّفَةِ لمُشابَهَتِهم لَهُمْ في الأفعالِ والأحوالِ. واشتراطُ الفقْرِ ظاهرًا، مُرادُهُ، كانَ حالَ أهلِ الصُّفةِ الفَقْرُ، وكَذا إذَا جَعلْنَاهُم منسوبينَ إلى لُبسِ الصُّوفِ، فإنَّ لُبسَ الصُّوفِ في الغالبِ كانَ لأهلِ الفاقَةِ والمُتَقلِّلِينَ من الدُّنيا، الراغِبينَ عَنْها.",
    "foot_note": "1. الماوردي: (أبو الحسن علي بن محمد بن حبيب ت 450 هـ)، ولد بالبصرة وتفقه بها، نبغ في الفقه بعد ارتحاله إلى بغداد، كان قاضي القضاة سنة 429 هـ، كان موضع ثقة ملوك بني بوية حول مسيرته انظر: ابن الجوزي: المنتظم، 8/ 151، ابن الأثير: اللباب في تهذيب الأنساب، 3/ 90. البغدادي: تاريخ بغداد، 12/ 102، السبكي: طبقات 5/ 267، ابن كثير: البداية، 11/ 80. ياقوت: معجم البلدان 5/ 406، الاسنوي: طبقات الشافعية (تحقيق عبد اللَّه الجبوري، ط. بغداد سنة 1971 م).",
    "book_id": "97",
    "new_page_number": 56
  },
  {
    "serial_number": "281936",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 59,
    "volume_number": 1,
    "text": "وأَمَّا الفُقَهاءُ والمُحدِّثونَ والمقرِئُونَ وغيرُهم ممَّا هوَ في مَعناهُمْ، فلا يشترطُ الفقر فيهِم، إذ لَا نعرفُ فيهِ خِلافًا، بل يُعطى مَنْ شملَهُ الاسمُ، فالصُّوفيُّ حقيقةً، أنَّه مُتَخلِّقٌ بأَخلاقٍ نفسانِيّةٍ. والغَزاليُّ وافقَ على ذلكَ، ولتلكَ الأخلاقِ أشياءٌ في الظَّاهرِ تدلُّ عليْها، والفقرُ لَا يدلُّ عليهَا ولَا داخِلًا في حقيقَتِها العُرْفِيّةِ. وهذهِ الطائِفةُ قد استندتْ في طريقِها إلى عليِّ بن أبي طالبٍ رضي الله عنه، وقَدْ ذكر الحافِظُ أبو محمّدِ بنِ حزمٍ (1) ، أَنَّهُ كان غنيًّا، وأنَّه ما ماتَ إلّا عن ثروةٍ. وآخرُ شيوخِ الطَّائفةِ، الإِمامُ أَبو حفْصٍ، عمرُ السُّهروَردي (2) . وقد ذكرَ النَّاسُ، أَنَّهُ كانَ منْ أهلِ الثَّروةِ، وأنفقَ أموالًا في وجوهِ البِرّ، وتولَّى مواضِعَ، وأرسلَ رسولًا عنِ الخِلَافةِ وغيرَ ذلكَ، ولكنَّ العُرْفَ مُخَصَّصٌ، وَظاهِرُ الوقفِ عليهِم، فَضْلَةُ الفقرِ. وأَمَّا الحِرَفُ والاكتِسابُ، فالحِرَفُ مختلِفَةٌ، مِنْها ما هُوَ ممدوحٌ، كالتَّدريسِ وأشباهِهِ، فلا يُخْتَلَفُ في أنَّ هذا لا يمنعُ الاتِّصافُ بهِ الاستِحقَاقَ، ومنهَا ما يُنسَبُ مُتَعاطِيهِ في العُرْفِ إلى دناءَةٍ كالحجَّامِ والقَمَّامِ، وهذا قد يُقالُ في الصُّوفيّ: إنَّ اختيارَهُ حِرفةً دنيئةً يُنافي التصوُّفَ، وقد اعتبرَ",
    "foot_note": "1. هو علي بن أحمد بن سعيد بن حزم الأندلسي، أبو محمد ت 456 هـ، فقيه، أديب، أصولي، محدث، حافظ، متكلم، أديب مشارك في التاريخ والأنساب والنحو واللغة والشعر والطب والمنطق والفلسفة، معروف مشهور، انظر، ياقوت: معجم الأدباء، 12/ 235، كحالة: معجم المؤلفين، 7/ 16، الذهبي: سير أعلام النبلاء، 8/ 184، القفطي: تاريخ الحكماء 232، ابن خلكان: وفيات الأعيان، 3/ 325. \n2. هو شهاب الدين، أبو حفص عمر بن محمد بن عموية السهروردي ت 632 هـ، شافعي المذهب، تخرج عليه خلق كثير من الصوفية، صحب أبا النجيب السهروردي (عمه) والشيخ عبد القادر الجيلاني، صاحب عوارف المعارف، انظر، أبو الفيض: جمهرة الأولياء 2/ 200، الأسنوي: طبقات الشافعية 2/ 63.",
    "book_id": "97",
    "new_page_number": 57
  },
  {
    "serial_number": "281937",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 60,
    "volume_number": 1,
    "text": "الفقهاءُ ذلكَ في الشهادةِ؛ فقد رجَّح جماعةٌ منهُم قبولَ شَهادَةِ منْ يتعاطَى حرفةً دنيئةً، وفيهِ وُجوهٌ وتفاصيلُ، مذكورةٌ في كتب الفقهِ. ومنهَا ما هوَ مُتوسِّطٌ بينهُما كالوِرَاقةِ والخِيَاطَةِ وشَبَهِهِمَا، ولكنَّ القيامَ بِها من فروضِ الكِفايةِ، وليسَ تَعاطِيها دَناءَةً، فالمُتَّصِفُ بِها لا يَخلو مِنْ أمرَيْن: إمَّا أَن يكونَ مستغنيًا عنْها بأَنْ يكونَ لَهُ غِنًى أو معلومٌ في الخانقاه، أو في وظائفِ، العلمِ تُغنِيهِ عنْ تعاطيها أو يكونَ محتاجًا إليها للقيامِ بنفسه إنْ كانَ منفرِدًا أو بِعيالِهِ، فإنْ كانَ مستغنيًا فتعاطِيها في الحَانُوتِ أو الكسبِ بها يُؤَثِّر في منعِ الاستِحقاقِ لأنَّ فيهِ طلبًا لِزيادَةِ مالٍ، والتصوُّفُ مبناهُ على التَّقلُّل منَ الدُّنيا، وقد قالَ: \"اللَّهُمَّ اجعلْ رزقَ آلِ محمدٍ قوتًا\" (1) ، وقال: \"يدخُلُ الفقراءُ قبلَ الأغنياءِ الجنةَ بخمسِ مئة عامٍ\" (2) . وإنْ كانَ محتاجًا إليهَا، فالشَّرعُ طلبَ منهُ الاكتسابَ، وقالَ: \"لأنْ يأخُذَ أحدُكُمْ حبلةً عَلى عَاتِقِهِ فَيحتَطِبَ خيرٌ لهُ\" (3) -الحديث-. وَقالَ: \"كفى المرءَ إثمًا أن يُضيِّعَ من يَقُوتُ\" (4) . وفي لفظٍ: \"من",
    "foot_note": "1. رواه البخاري (11/ 250) في الرقاق: باب كيف كان عيش النبي صلى الله عليه وسلم، ومسلم رقم (1055) في الزهد، وانظر تتمة تخريجه في \"جامع الأصول\" (4/ 671). (م). \n2. رواه الترمذي رقم (2354) في الزهد: باب ما جاء أن فقراء المهاجرين يدخلون الجنة قبل أغنيائهم، وهو حديث حسن، وانظر \"جامع الأصول\" (4/ 673). (م). \n3. رواه البخاري رقم (1470) في الزكاة: باب الاستعفاف عن المسألة، و (1480) باب قول اللَّه تعالى: {لَا يَسْأَلُونَ النَّاسَ إِلْحَافًا} [البقرة: 273] و (2074) في البيوع: باب كسب الرجل وعمله بيده، و (2374) في المساقاة: باب بيع الحطب والكلا، ومسلم رقم (1042) في الزكاة: باب كراهة مسألة الناس. (م). \n4. حديث صحيح رواه مسلم رقم (996) في الزكاة: باب فضل النفقة على العيال، وأبو داود رقم (1692) في الزكاة: باب صلة الرحم. ورواه أحمد في \"المسند\" (2/ 160 =",
    "book_id": "97",
    "new_page_number": 58
  },
  {
    "serial_number": "281938",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 61,
    "volume_number": 1,
    "text": "يعول\" (1) . وقالَ: \"خيرُ ما أكلَ المرءُ من كسبِ يدهِ\" (2) . فهذا عامٌّ في الكسبِ فَلَا يتَّجِهُ منعُهُ منَ الاستِحقَاقِ بذلكَ، وَكذَا قوله في الأجير إنَّه يُمنَعُ الاسِتحقَاقَ، كلامٌ ساقِطٌ إذَا كان محتاجًا إلى ذلك. كيفَ وَقَدْ أَجَّرَ موسى نَفسَهُ، والنبيُّ قال، إنَّهُ كانَ يرعى لأهلِ مكة على قراريطَ قبلَ النُّبُوَّةِ، وعليٌّ أجّر نفسَهُ. وذكرَ القُشَيريُّ عن كَبيرِ الطَّائفةِ، إبراهيمَ بنِ أدهمَ (3) ، أنَّهُ كانَ يأكلُ من عملِ يدهِ من الحصَادِ وحفظِ البَساتين (4) .",
    "foot_note": "1. = و 193 و 194 و 195) والبيهقي في \"السنن الكبرى\" (7/ 467) والحاكم في \"المستدرك\" (1/ 415) من حديث عبد اللَّه بن عمرو بن العاص رضي الله عنهما. ورواه البيهقي في \"السنن الكبرى\" (9/ 25) من حديث جابر بن عبد اللَّه رضي الله عنه. ورواه الطبراني في \"المعجم الكبير\" من حديث عبد اللَّه بن عمر رضي الله عنه كما في \"مجمع الزوائد\" والنسائي في \"عِشرة النساء\" من \"السنن الكبرى\" رقم (295) المطبوع في القاهرة. (م). \n1. رواه بهذا اللفظ النسائي في \"عشرة النساء\" من \"السنن الكبرى\" رقم (294) المطبوع في القاهرة، والحاكم في \"المستدرك\" (4/ 500) من حديث عبد اللَّه بن عمرو بن العاص رضي الله عنه (م). \n2. رواه ابن ماجه رقم (2138) في: التجارات: باب الحث على المكاسب من حديث المقدام بن معدي كرب الزّبيدي رضي الله عنه ولفظه عنده: \"ما كسب الرجل كسبًا أطيب من عمل يده. . . \" الحديث وقد ذكره المؤلف بالمعنى. (م). \n3. إبراهيم بن أدهم بن منصور، من كورة بلخ، رحل في العراق والشام والحجاز (من كبار الصوفية)، القشيري: الرسالة، 1/ 63، الكلاباذي: التعرف، 37، الشعراني: الطبقات، 1/ 69، أبو نعيم: حلية الأولياء، 7/ 367 - 395، ابن العماد الحنبلي: شذرات، 1/ 255، الكتبي، فوات الوفيات، 1/ 3، السُّلمي: طبقات الصوفية، 30. \n4. وردت في الرسالة القشيرية، 1/ 64.",
    "book_id": "97",
    "new_page_number": 59
  },
  {
    "serial_number": "281939",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 62,
    "volume_number": 1,
    "text": "وقالَ السُّهروردي عن هذه الطَّائِفَةِ: إنَّ منهمْ منْ كانَ يكتسِبُ، ومنهمْ منْ كانَ يسألُ، وجعلَ ذلكَ بحسبِ الحالِ، واستقصاءُ ذلكَ يطولُ. فهذا الكلامُ على تفصيلِ ما فصَّلَ، وقدْ بينَّا بُطلانَهُ منْ جهةِ الاستدلالِ من حيثُ النَّقلُ فهوَ مخالِفٌ لِمَا في كُتبِ الأحكامِ لطَوائفِ فُقَهَاء الحُكَّامِ، الذينَ نَصُّوا على المسألةِ والسَّلام. وقدْ استَدَلَّ بعضُهم على أَنَّ الغنيَّ لا يمنع، فحديثُ الأغنياء حَيْثُ جاءَ الفُقَراءُ إلى رسولِ اللَّهِ فقالَ: \"ذَهَب أهلُ الدُّثورِ بالأُجورَ والدَّرجَاتِ العُلى والنَّعيمِ المقيمِ\" (1) . -الحديث- فقالَ المُستَدِلّ: الغني يحصُلُ الثَّوابُ والفَضْلُ ونحوُه ممَّا ذُكِرَ، واستدلالُهُ غيرُ متَّجِهٍ كأَنَّه ليسَ الكلامَ في أَنّ الغني يحصُلُ بهِ الخيرُ أم لَا؟ ولا أَنَّهُ نَقْصَ في الشخصِ ولَا أَنَّ غيرَهُ أفضلُ منهُ. وإنّما الكلامُ، أَن هذا الاسمَ الذي هو التصوفُ يُنافِيهِ الغِنى أم لَا؟ . فإن الوقفَ على الصُّوفيّ يُشعِرُ بالفَقْرِ من حيثُ العُرفُ. فإنَّه يقصِدُ بالوقوف على الصُّوفِيَّةِ إعانتَهُمْ على التَخلِّي لِلعبادةِ، فيكفيهم المُؤُونةَ المحوجةَ إلى الكسب، وتعاطي الأسبابِ، ولا يمنعُ أن يكونَ غَيرُهم أعلمَ وأفضلَ وأكثرَ ثوابًا وأجزلَ، فَلَو وقفَ شخصٌ على الفُقَهاءِ صُرِفَ إلى مسلمِ بنِ خالدٍ الزّنجي (2) والحجاجِ بنِ أرطاةَ (3) ، ولا يُصرفُ",
    "foot_note": "1. رواه مسلم رقم (1006) في الزكاة: باب بيان أن اسم الصدقة يقع على كل نوع من المعروف، وهو عند غيره من الأئمة أيضًا بألفاظ وروايات مختلفة، انظرها مع تخريجها في \"جامع الأصول\" (9/ 218 - 221). (م). \n2. هو مسلم بن خالد بن سعيد بن جُرْجةِ، من أهل الشام، وهو مولى لآل سفيان بن عبدِ الأسد المخزومي، فقيه، عابد، ت بمكة سنة 180 هـ، في خلافة هارون الرشيد، انظر، ابن سعد: الطبقات، 5/ 499، 2/ 307. \n3. الحجاج بن أرطاة بن ثور بن شراحيل بن كعب مفتي الكوفة، من بحور العلم، وولي =",
    "book_id": "97",
    "new_page_number": 60
  },
  {
    "serial_number": "281940",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 63,
    "volume_number": 1,
    "text": "لبعضِ مَن أُدرِجَ في الصَّحابةِ ممَّنْ لَا فِقْهَ لهُ، وإنْ كانَ أكثرَ فضلًا وفخرًا وأكبرَ ذِكرًا وقدرًا. وكذلك لَو وَصَّى للشافعيَّة، صُرِفَ إلى ابنِ الأنصاري (1) وَلا يُصرفُ للطَّحاوِي (2) وأَبي يَعلى الفرّاء (3) وأمثالِ ذلك. ثُمَ إنَّ المال مَطيَّة الطغيان والافْتِتَانِ، وسببُ يُتَوَصَّلُ بهِ إلى العصيان. قال اللَّهُ تعالى {كَلَّا إِنَّ الْإِنْسَانَ لَيَطْغَى (6) أَنْ رَآهُ اسْتَغْنَى} (4) . وقالَ تَعالى: {إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ} (5) .",
    "foot_note": "1. = قضاء البصرة (ت 149 هـ)، الذهبي: سير أعلام النبلاء، 7/ 68، ابن سعد: الطبقات، 6/ 359، ابن خلكان: وفيات الأعيان، 2/ 54 - 56. \n1. سلمان بن ناصر الأنصاري: أبو القاسم (ت 512 هـ)، تلميذ إمام الحرمين، كان فقيهًا في علم الكلام والتفسير، زاهدًا ورعًا، راسخًا في علم التصوف، شرح الإرشاد لإمام الحرمين، له تصانيف في الفقه، انظر، السبكي: طبقات الشافعية، 4/ 222، ابن العماد الحنبلي: شذرات الذهب، 4/ 34. \n2. المقصود أبو جعفر الطحاوي (ت 321 هـ) هو أحمد بن محمد ابن سلامة بن سلمة الأزدي الطحاوي، فقيه انتهت إليه رئاسة الحنفية بمصر، ابن أُخت المُزني، كان شافعيًا ثم تحول إلى الحنفية، انظر، ابن حجر: لسان الميزان، 1/ 274 - 282، ابن العماد الحنبلي: شذرات، 2/ 306. اليافعي: مرآة الجنان، 2/ 289، ابن الأثير: اللباب، 2/ 17. \n3. هو محمد بن الحسين بن محمد بن خلف بن الفراء، أبو يعلى (ت 458 هـ)، عالم في الأصول والفروع وأنواع الفنون بغدادي، ولاه القائم دار الخلافة والحريم، من تصانيفه، الأحكام السلطانية، الإيمان وغيرها، كان شيخ الحنابلة، انظر، ابن أبي يعلى: طبقات الحنابلة، 2/ 193، الخطيب البغدادي: تاريخ بغداد، 2/ 256، الكتبي: الوافي بالوفيات، 3/ 7. \n4. سورة العلق، آية: 6. \n5. سورة التغابن، آية: 15.",
    "book_id": "97",
    "new_page_number": 61
  },
  {
    "serial_number": "281941",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 64,
    "volume_number": 1,
    "text": "وفي \"الصحيحين\": أنه لَمَّا قَدِمَ أبو عبيدةَ بمالِ البحرينِ، فسمعتْ الأنصارُ، فَوَافُوا صلاةَ الفجرِ - الحديث. وفيه: أنَّ النبيّ، قالَ: \"ما أخشَى عليكُم الفقرَ، ولكنْ أخشى عليكُم أنْ تُبْسَطَ الدُّنيَا عليكُم كمَا بُسِطَتْ على مَنْ كانَ قبلَكُم، فتنافَسُوها كما تَنافَسوها فَتُهلكُكُمْ كَما أهلَكَتهُم (1) \". وفي رواية: \"فتلهيكُم كما أَلهتهُم\" (2) . وفي حديث كعبة بن عياض: (سمِعتُ رَسُولَ اللَّه، يقولُ: \"إِنَّ لِكلِّ أُمَّةٍ فتنَةً، وفتنةُ أُمّتي المالُ\" (أخرجه الترمذي)، وقالَ: حسن صحيح (3) . وفي \"صحيح البُخاري\": أنَّ النبيَّ، لمَّا رأَى على بابِ فاطِمةَ سترًا موشِيًّا، ورَجَعَ -الحديث- وفيهِ قالَ: \"مَالي ولِلدُّنيا\" (4) . وفي حَديثِ أبي أُمامة: أنَّ النبيَّ، قالَ: \"يا بنَ آدمَ، إِنَّكَ إنْ تَبذُلِ الفضلَ",
    "foot_note": "1. قطعة من حديث رواه البخاري رقم (3157) في الجزية: باب الجزية والموادعة مع أهل الذمة والحرب، و (4015) في المغازي: باب رقم (12)، ومسلم رقم (2961) في الزهد والرقائق، في فاتحته، والترمذي رقم (2462) في صفة القيامة: باب رقم (28)، وابن ماجه رقم (3997) في الفتن: باب فتنة المال، وأحمد في \"المسند\" (4/ 137 و 327) من حديث المِسْوَر بن مخرمة رضي الله عنه. (م). \n2. قطعة من حديث رواه البخاري رقم (6425) في الرقاق، باب ما يُحذر من زهرة الدنيا والتنافس فيها، ومسلم رقم (2962) (. . .) في الزهد والرقائق، في فاتحته. \n3. رواه الترمذي رقم (2336) في الزهد: باب ما جاء أن فتنة هذه الأُمة في المال، وقال: هذا حديث حسن صحيح غريب إنما نعرفه من حديث معاوية بن صالح. قلت: ومعاوية بن صالح، هو معاوية بن صالح بن حُدَير الحضرمي أبو عمرو وأبو عبد الرحمن الحمصي قاضي الأندلس، صدوق له أوهام كما قال الحافظ ابن حجر في \"تقريب التهذيب\" ص (538). ورواه أيضًا أحمد في \"المسند\" (4/ 160)، والحاكم في \"المستدرك\" (4/ 318). وصححه ووافقه الذهبي. (م). \n4. رواه البخاري رقم (2613) في الهبة: باب هدية ما يُكرَهُ لُبسُها، وقد أورده المؤلف مختصرًا وبالمعنى، من حديث عبد اللَّه بن عمر بن الخطاب رضي الله عنهما. (م).",
    "book_id": "97",
    "new_page_number": 62
  },
  {
    "serial_number": "281942",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 65,
    "volume_number": 1,
    "text": "خيرٌ لكَ، وإنْ تُمسِكهُ شَرٌّ لكَ، وَلَا تُلامُ علَى كفافٍ، وابدأْ بمَنْ تعولُ (1) . (أخرجه الترمذي، وقال: حسن صحيح). وأَخرجَ أبو نُعَيم الحافظ بسندِهِ: أنهُ قيلَ (لأَبي بكرٍ الصِّدِّيق: يا خَليفَةَ رسولِ اللَّه، أَلَا تَستعمِل أهلَ بدرٍ؟ قَالَ: \"إني أرى مكانَهُم، ولكني أكرهُ أن أُدنَّسهُم بالدُّنيا\" (2) . وَلَا شَكَ أنَّ التَّقلُّلَ منَ الدُّنيا شعارُ الصَّالحينَ وَمُنتمى الزُّهادِ والعَارِفينَ. فالوقفُ والوصيةُ للصوفيّ مشعرٌ بالفقرِ لَا محالةٌ، ولكنْ هُنا فَرعٌ، وهوَ أنَّا إذا شرطنَا الفقرَ، فهلْ يَقبلُ الذي يدَّعي التَّصوُّفَ، أنَّه صوفيّ؟. لا شكَّ أنَّ الوقفَ والوصيَّةَ على الفقهاءِ لا يقبلُ فيهِ منْ يدَّعي الفقهَ، وكذا الحديث وأشباه ذلك وإذا وقفَ على الأغنياءِ فلا بدَّ من إثباتِ ذلك. وإذا أُوقِفَ على الفقراءِ قُبِلَ قولَ مدَّعي الفَقرِ. والصُّوفيُّ مُتَردِّدٌ بينَ ذلك، فإنْ جعلنَا التَّصوُّفَ عبارةً عن الصفاتِ النَّفسانيَّةِ فلا شكَّ أنّه يُقبلُ قولَه، كما إذا قالَ لزوجتهِ: إن حضتِ فأنتِ طالقٌ، يقبل قولها، بل ذلك أولى بالقَبولِ، فإنَّ الحيضَ يمكنُ إقامةُ البيِّنةِ عليهِ، وعلمُ الزوجِ له وبالرؤيةِ والقرائنِ، وكذا إذا قُلنا: الصوفيُّ المشتغلُ بالعباداتِ في الغالبِ فإنا لا نُريدُ بالعباداتِ إلّا ما زادَ على",
    "foot_note": "1. رواه الترمذي رقم (2343) في الزهد: باب رقم (32) وهو عند الإمام مسلم رقم (1036) في الزكاة: باب بيان أن اليد العليا خير من اليد السفلى، وأحمد في \"المسند\" (5/ 262) من حديث أبي أُمامة رضي الله عنه. (م). \n2. ذكره أبو نُعَيم في \"حلية الأولياء\" (1/ 37) في أواخر ترجمة أبي بكرٍ الصِّدِّيق رضي الله عنه. وبه تم تخريجنا لأحاديث هذا الكتاب النافع في غرة شهر رجب المعظم من عام (1408) هـ، والحمد للَّه الذي بنعمته تتم الصالحات، وأسأل اللَّه عز وجل أن يجزي مؤلفه ومحققه وناشره خير الجزاء. (م).",
    "book_id": "97",
    "new_page_number": 63
  },
  {
    "serial_number": "281943",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 66,
    "volume_number": 1,
    "text": "المفروضاتِ، وأكثرُها مما نُدبَ الشرعُ إلى إخفائهِ. كما في النوافل حيثُ طلبَ فِعلَها في البيتِ وأشباهِها، ولا تقولُ بظهرها ليُقيمَ البيِّنة عليْها، فإنَّه ضِدُّ المُرجَّحِ في نظرِ الشَّارعِ. وكذَا منْ قالَ: الوقفُ على الصوفِيّةِ، يُصرفُ للفَقيرِ، يُقبَلُ قولُه، حيثُ يُقبلُ قولُ الفَقيرِ. وأمّا على طَريقةِ الغَزالي في الزيّ والخِلطَةَ والمساكنةِ، فَهذا يظهرُ فيهِ أنَّه لا بدَّ من البيِّنَةِ، فإنَّه لا يشُقُّ ولا يَعسُرُ إقامةُ البيِّنَةِ عليهِ، وهوَ من الأفعالِ الظاهرةِ، فأُلْحِقَ بما هو في معناه. هذا تمامُ ما لخَّصتُهُ وآخرُ ما حرَّرتُه بحسبِ علمي ومنتهى فهمي. ونختمهُ بخاتمةٍ، فأقولُ: خاتمة: اشتُهِرَ بين المتأَخِّرين الذينَ أدرجُوا أنفسَهُمْ في الصوفيَّةِ أنَّ طريقَهم مبايِنَةُ لطريقِ الفُقَهاءِ قولًا وفعلًا، فوقعَ بسبب ذلك تَنافرُ أوجبَ كلامَ بعضِهِمْ في بعض، ونحنُ نذكرُ من كلامِ أئمتِهمْ والقدوَةِ عندَهُم، ما يُعرِّفُكَ أنَّ التصوُّفَ اتِّباعُ السنَةِ التي الفُقَهاءُ يتَّصِفُونَ بِها، فذكرَ الأستاذُ أبو القاسم القُشيري -أحدُ شيوخهِم الأعيانِ، والمُقتَدى بهِ في هذا الشأنِ- جملةً من مقالاتِهمْ في التَّوحيدِ، وأُصولِ العقائدِ في رسالَتهِ. وقالَ: إنَّه إنَّما ذكرَهَا ليُعْلَمَ أنَّ عقائِدَهم على وفقِ الكِتابِ والسنَّةِ، فلا نُطوِّلُ الكلامَ بِذكرِها (1) . وذكرَ منْ أقوالِهم ما نذكرُ بعضَه ليكونَ حجةً عليهِم، فإنهم قُدوتُهم وأولُ راضٍ سيرةً من سيرها [*]. فحكى أولًا عن أبي عبد اللَّه بنِ",
    "foot_note": "1. انظر الرسالة القشيرية، 1/ 32 - 55. [*] قال مُعِدُّ الكتاب للشاملة: من شاهد مشهور لشعراء الهذليين، وهو قول خالد بن زهير لخاله أبي ذؤيب: فَلَا تَجْزَعَنْ مِن سنّة أَنتَ سِرْتَهَا \n…. فَأَوَّلُ رَاضٍ سنّة مَنْ يَسِيرُهَا يقول: أنت جعلتها سائرة في الناس [لسان العرب 4/ 390]",
    "book_id": "97",
    "new_page_number": 64
  },
  {
    "serial_number": "281944",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 67,
    "volume_number": 1,
    "text": "خفيفٍ (1) ، أنَّه قالَ: اقتَدُوا بخمسةٍ من شُيوخِنَا، وسلِّمُوا للبّاقي في أحوالِهم، فذكرَ الحارثَ بنَ أسدٍ المحُاسبيّ (2) والجُنيدَ بنَ محمدٍ، وأبا محمدِ رُوَيم (3) وأبا العبّاسِ بنَ عطاء (4) وعمرَو بنَ عثمانَ المكيّ (5) .",
    "foot_note": "1. هو محمد بن خفيف الشيرازي، أبو عبد اللَّه (ت 371 هـ)، كان من الأمراء، أقام بشيراز، تصوف وغدا شيخ الشيوخ، انظر، القشيري: الرسالة، 1/ 212 - 213، الشعراني: الطبقات، 1/ 120 السلمي: طبقات الصوفية، 462، أبو نُعيم: حلية الأولياء، 10/ 385، ابن العماد الحنبلي: شذرات الذهب، 3/ 76. \n2. الحارث بن أسد المحاسبي (ت 243 هـ)، أبو عبد اللَّه، أول متصوف سني تتضح من مؤلفاته ثقافة كلامية متكاملة (معروف مشهور) حول سيرته انظر ابن النديم: الفهرست، 184 القشيري: الرسالة، 1/ 89، الكلاباذي: التعرف، 45، الشعراني: الطبقات، 1/ 75، أبو نعيم: حلية الأولياء، 10/ 73، السلمي: طبقات، 56، ابن خلكان: وفيات، 1/ 157، ابن العماد الحنبلي: شذرات، 2/ 102، الخطيب البغدادي: تاريخ بغداد، 8/ 211. \n3. أبو محمد، رويم بن أحمد (ت 303 هـ)، بغدادي من أجِلَّة المشايخ، كان مقرئًا وفقيهًا، على مذهب داود الظاهري انظر، القشيري: الرسالة، 1/ 144، الكلاباذي: التعرف، 43 الشعراني: الطبقات، 1/ 88، السلمي: طبقات الصوفية، 180، أبو نُعيم: حلية الأولياء 10/ 296، ابن الجوزي: المنتظم، 6/ 136. الخطيب البغدادي: تاريخ بغداد، 8/ 130، ابن كثير: البداية والنهاية، 11/ 125. \n4. أبو العباس أحمد بن محمد بن سهل بن عطاء الآدمي (نسبة لبيع الأدم، الجلد) ت 309 هـ، من كبار مشايخ الصوفية انظر، القشيري: الرسالة، 1/ 168، الشعراني: الطبقات، 1/ 95، الكلاباذي: التعرف، 43، ابن الجوزي: المنتظم، 6/ 160، أبو نعيم: حلية الأولياء، 10/ 302، ابن العماد الحنبلي: شذرات، 2/ 257. \n5. عمرو بن عثمان المكي (أبو عبد اللَّه) ت 291 هـ، شيخ القوم إمام الطائفة في الأصول والطريقة، مات ببغداد، انظر، القشيري: الرسالة، 1/ 150، الكلاباذي: التعرف، 43، الشعراني: الطبقات، 1/ 89، السلمي: طبقات الصوفية، 202، أبو نعيم: حلية، 1/ 291، الخطيب البغدادي: تاريخ بغداد، 12/ 223، ابن العماد الحنبلي: شذرات الذهب، 2/ 225.",
    "book_id": "97",
    "new_page_number": 65
  },
  {
    "serial_number": "281945",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 68,
    "volume_number": 1,
    "text": "قال: فهؤلاءِ يُقْتدى بهم لأنهم جَمَعوا بينَ العلم والحَقائقِ. وقال أبو يزيد البسطامِيّ (1) : عملتُ في المجاهدة ثلاثينَ سنةً، فما وجدتُ شيئًا أشدَّ عليَّ من العلمِ ومتابعتهِ، ولَولا اختلافُ العلماءِ لأفتَيْتُ، واختلافُ العلماءِ رحمةٌ إِلَّا في التَّوحيدِ (2) . وقال: إذا نظرتُم إلى رجلٍ أُعطيَ منَ الكَراماتِ حتَّى يتربّع في الهواءِ فلا تغتَرُّوا به حتّى تنظُروا كيفَ تجدونَهُ عندَ الأمرِ والنهيِّ وحفظِ الحدودِ واداء الشريعةِ (3) . وقالَ: أبو حفصٍ عمرُ الحدادُ (4) : منْ لمْ يزنْ أحوالَهُ وأفعالَهُ في كُلِّ وَقتٍ بالكِتابِ والسنَّةِ فَلَا يُعدُّ في ديوانِ الرّجالِ.",
    "foot_note": "1. أبو يزيد بن طيفور بن عيسى البسطامي (ت 261 هـ)، من كبار المتصوفة، انظر القشيري: الرسالة، 1/ 100، الكلاباذي: التعرف، 1 ع، الشعراني الطبقات، 1/ 76، السلمي: طبقات الصوفية، 67، أبو نُعيم: حلية الأولياء، 10/ 33، ابن خلكان: وفيات الأعيان، 2/ 531، ابن العماد الحنبلي: شذرات، 2/ 143، المناوي: الكواكب (الطبقات)، 1/ 244. \n2. في الرسالة القشيرية 1/ 100 ورد \"عملت في المجاهدة ثلاثين سنة، فما وجدت شيئًا أشد عليَّ من العلم ومتابعته، ولولا اختلاف العلماء لفتيت واختلاف العلماء رحمة إلا في \"تجريد التوحيد\". \n3. المراد بالنص الحث على اتباع الكتاب والسنة، وعدم الخروج عن السنن. \n4. أبو حفص، عمر بن سلمة الحداد (ت 260 هـ ونيف)، من قرية كورد أباذ على باب مدينة نيسابور على طريق خراسان، أول من أظهر التصوف هنالك، انظر، القشيري: الرسالة، 1/ 118 - 119، الكلاباذي: التعرف 41، الشعراني: الطبقات، 1/ 82، أبو نعيم: حلية الأولياء: 10/ 229، ابن العماد الحنبلي: شذرات الذهب، 2/ 150، السلمي: طبقات الصوفية، 1/ 115 - 122.",
    "book_id": "97",
    "new_page_number": 66
  },
  {
    "serial_number": "281946",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 69,
    "volume_number": 1,
    "text": "وقال أُستاذ الطائفةِ الجُنيدُ: الطُّرق كلُّها مسدودةٌ عن الخلقِ إِلَّا من اقتَفى أثرَ الرَّسولِ (1) . . . . وقال أيضًا: من لمْ يقرأ القُرآنَ ولمَ يكتبِ الحديثَ لا يُقتدى بهِ (2) في هذا الأمر، لأن علمَنا قصيرٌ بالكتابِ والسنَّةِ. وقال أيضًا: عِلمُنا هذا مسندٌ (3) بحديثِ رسولِ اللَّهِ. وقال أبو عثمانَ، سعيدُ بنُ إسماعيلَ: منْ أمَّرَ السنَّةَ على نفسهِ قولًا وفعلًا نطقَ بالحكمةِ، ومن أمَّر الهوى نطقَ بالبِدعَةِ (4) . وَقالَ أبو الحسين النُّوريّ: من رأيتَهُ يدَّعي مع اللَّهِ حالًا تُخرجُهُ عن حدِّ العلمِ الشرعيّ فَلا تَفِرَّ منهُ. وقال أبو حمزةَ البغدادي: لا دليلَ على الطَّريق إلى اللَّه إِلَّا مُتَابعةُ الرَّسولِ في الأحوالِ والأفعالِ (5) . وقالَ أبو القاسمِ، إبراهيمُ بنُ محمدٍ النَّصرأبادي (6) شيخُ خُراسانَ في وقتهِ:",
    "foot_note": "1. وردت في الرسالة القشيرية، 1/ 134. \n2. في الأصل \"بهم\". \n3. في الرسالة القشيرية 1/ 135 \"مشيد\". \n4. وردت في الرسالة القشيرية، 1/ 139، أبو نصر السراج الطوسي: اللمع، 144. \n5. وردت في الرسالة القشيرية، 1/ 173. \n6. إبراهيم بن محمد، أبو القاسم النصرأبادي (ت 369 هـ)، من أئمة المتصوفة، شيخ خراسان في وقته، يرجع إليه في أنواع العلوم من حفظ السنن وجمعها، كثير الرواية انظر المناوي: الكواكب الدرية، 2/ 6، القشيري: الرسالة، 1/ 222، الشعراني: الطبقات، 1/ 122، ابن العماد الحنبلي: شذرات الذهب، 3/ 58، ابن الجوزي: المنتظم، 484، السلمي: طبقات، 484، الصفدي: الوافي، 6/ 117.",
    "book_id": "97",
    "new_page_number": 67
  },
  {
    "serial_number": "281947",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 70,
    "volume_number": 1,
    "text": "أصلُ التَّصوَّف ملازمةُ الكتابِ والسُنَّةِ، وَتركُ الأهواءِ والبدعِ، وتركُ ارتكابِ الرُّخَص والتَّأويلاتِ (1) . وقال السّهرَوَرْديّ: كُلُّ حقيقةٍ مُباينةٍ للشريعةِ فهي زندقةٌ. فهذا كلامُ مشايخِ الطريقةِ، ومن تُنسبُ إليهم المعرفةُ والحقيقةُ والمتمثلُ قولهم عند الخليقة. وفي الكتابِ العزيزِ والسنةِ النبويةِ من تعظيم العلمِ الشرعيِّ وحَمَلَتِهِ ما لا يخفى عن ذوي الألباب ولا يجحُدُه إِلَّا أهل الحِجابِ، والمنتسبونَ إلى التصوفِ أقسام: قسم اتبعوا ما جاء في الشرعِ، وَوَقفوا مع ما قالَه علماءُ السنة من أهل الأصل وأرباب الفرع، فهمُ الذين يستحقون التعظيمَ ويستوجبون التبجيلَ والتكريمَ. وقسمٌ حصل لهم غُلوُّ في طريق ابتدعوها وعقائدَ اخترعوها، ووقفوا مع ألفاظ مزخرفةٍ جمعوها، فأُدخلوا في جُملة الكفار وحكم عليهم باستحقاق النار. وقد ذكر القاضي عياض (2) . في الشفا وغيره: وقسم غلب عليهم",
    "foot_note": "1. وردت عند الأدفوي بصورة مختصرة، أما في طبقات الصوفية للسلمي 488، والكواكب الدرية، للمناوي 2/ 6 فكانت \"بعد البدع\" وتعظيم حرمات المشايخ، ورؤية أعذار الخلق - وحسن صحبة الرفقاء والقيام بخدمتهم واستعمال الأخلاق الجميلة والمداومة على الأوراد وترك الرخص والتأويلات. \n2. القاضي عياض: عياض بن موسي بن عياض بن عمرون اليحصيبي ت 544 هـ، عالم المغرب وإمام أهل الحديث في وقته، عليم بكلام العرب وأنسابهم، مشهور معروف، من تصانيفه، الشفا، انظر، ابن خلكان: وفيات، 1/ 392 الضبي: بغية الملتمس 425، الحُميدي: جذوة المقتبس، 377، الذهبي: سير أعلام النبلاء، 2/ 212، =",
    "book_id": "97",
    "new_page_number": 68
  },
  {
    "serial_number": "281948",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 71,
    "volume_number": 1,
    "text": "الجهلُ، والوقوف مع ما أحدث من رسوم، وتركوا النظرَ في المعارفِ والعوارفِ والعلومِ. فاستحوذَ عليهم الشيطانُ، وغلبَ عليهمُ الطغيانُ والعصيانُ. فاحتفلوا بالرقصِ والسماعِ والشهواتِ التي تثيرُها الطباعُ لا يقتفون شرعًا، ولا يجتنبون أمرًا بِدْعًا، فهم الأخسرون أعمالًا، {الَّذِينَ ضَلَّ سَعْيُهُمْ فِي الْحَيَاةِ الدُّنْيَا وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا} (1) . وقالَ أبو حفص الحدّادُ: إذا رأيتَ المُريدَ يُحِبُّ السماعَ، فاعلَمْ أنَّ فيهِ بقيَّةً لِلبَطالَة (2) ، وسُئِلَ أبو عليّ الرُّوذبارِي (3) ، الإِمامُ العالمُ المحقِّقُ عمّن يسمعُ المَلاهي، ويقولُ هيّ لي حلالٌ، لأني قد وصلتُ إلى درجةٍ لا تؤثِّرُ فيهِ (4) اختلافُ الأحوالِ. فقالَ أبو عليٍّ: نَعَمْ وصلَ إلى سقَر. نسأَلُ اللَّه العافيةَ والسلامةَ والحمدُ للَّه الذي والى علينَا إنعامَهُ. والصلاةُ على المخصوصِ بِالمَقامِ المحمودِ يومَ القيامةِ. حسبُنَا اللَّهُ ونعمَ الوكيلُ.",
    "foot_note": "1. = ابن الأثير: تهذيب، 2/ 43، ابن كثير، البداية: 12/ 225. \n1. سورة الكهف، آية 104. \n2. انظر الرسالة القشيرية، 1/ 185، السهروردي: عوارف، 187. \n3. هو أبو علي، أحمد بن محمد الروذباري ت 322 هـ، بغدادي أقام بمصر، صحب الجُنيد والنوري وابن الجلاء، انظر، القشيري: الرسالة 1/ 185، الكلاباذي: التعرف، 44، الشعراني: الطبقات، 106. \n4. في الرسالة \"في\" وهو الأصح.",
    "book_id": "97",
    "new_page_number": 69
  },
  {
    "serial_number": "281949",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 73,
    "volume_number": 1,
    "text": " مصادر ومراجع التحقيق - ابن أبي يعلى (محمد بن محمد): طبقات الحنابلة، وقف على طبعه محمد حامد الفقي، ط. القاهرة 1952 م. - ابن الأثير الجزري (علي بن محمد): أسد الغابة في معرفة الصحابة، ط. بيروت 1328 هـ. - الكامل في التاريخ، ط. بيروت 1966. - اللباب في تهذيب الأنساب، تحقيق مصطفى عبد الواحد، ط. القاهرة 1971 م. - الأدفوي (جعفر بن ثعلب)، الطالع السعيد المجامع أسماء نجباء الصعيد، تحقيق سعد محمد حسن، ط. مصر 1966 م. - الأسنوي (عبد الرحمن بن الحسن): طبقات الشافعية، تحقيق عبد اللَّه الجبوري، ط. بغداد 1971 م. - الأصبهاني، أبو الفرج (علي بن الحسيني): الأغاني، ط. مصر 1969 م. - الباقلاني (محمد بن الطيب): كتاب البيان عن الفرق، تحقيق رتشرد مكارثي، ط. بيروت 1958 م. - بدوي (عبد الرحمن): تاريخ التصوف الإسلامي، ط. الكويت، 1975 م. - البغدادي (أحمد بن علي): تاريخ بغداد أو مدينة السلام، ط، بيروت، د. ت. - البغدادي (إسماعيل بن محمد): إيضاح المكنون في الذيل على كشف الظنون، ط. طهران 1947 م، ط. بالأوفست (المكتبة الإسلامية، 1967 م). - هدية العارفين في أسماء المؤلفين وآثار المصنفين، ط. طهران، 1947 م. - ابن تغري بردي (يوسف بن عبد اللَّه): النجوم الزاهرة في أخبار مصر والقاهرة، ط. القاهرة. د. ت.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 70
  },
  {
    "serial_number": "281950",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 74,
    "volume_number": 1,
    "text": "- التنوخي (علي بن المحسن): نشوار المحاضرة، نشرته مجلة المجمع العلمي بدمشق، العدد 17، سنة 1948 م. - الجاحظ (عمرو بن بحر): الحيوان، تحقيق، عبد السلام محمد هارون، ط. القاهرة. - ابن الجوزي (عبد الرحمن بن علي): تلبيس إبليس، ط. بيروت، 1368 هـ، المنتظم في تاريخ الملوك والأمم، ط. حيدر أباد، 1358 هـ. - ابن حبيب (الحسن بن عمر): تذكرة النبيه في أيام المنصور وبنيه، تحقيق محمد محمد أمين، ط. مصر، ج 1 - 1976، ج 2 - 1982 م. - ابن حبيب (محمد بن حبيب): المحبر، ط. بيروت بالأوفست عن ط. حيدر أباد، سنة 1942 م. - ابن حجر (أحمد بن علي): الدرر الكامنة في أعيان المئة الثامنة، ط. القاهرة، 1929 م. - لسان الميزان، ط، بيروت، 1971 م. - ابن حزم (علي بن أحمد): جمهرة أنساب العرب، تحقيق عبد السلام محمد هارون، ط. الرابعة، مصر، 1977 م. - الحموي (ياقوت بن عبد اللَّه): معجم الأدباء، نشره مرجليوث، ط. القاهرة، 1936 م - 1938 م. - ابن حنبل (أحمد بن محمد): مسند الإمام أحمد بن حنبل، ط. القاهرة، 1948 م. - حسين (علي صافي): الأدب الصوفي في مصر (ابن الصباغ القوصي)، ط. مصر، 1971 م. - ابن خلدون (عبد الرحمن بن محمد): كتاب العبر، ط. بيروت، 1971 م. - ابن خلكان (أحمد بن محمد): وفيات الأعيان وأنباء أبناء الزمان، تحقيق إحسان عباس، ط. بيروت، 1974 م - 1977 م، ط. مكتبة النهضة بمصر، 1948 م (تحقيق محمد محيي الدين عبد الحميد). - خليفة (حاجي): كشف الظنون عن أسامي الكتب والفنون، ط. طهران، 1947 م. - الدلجي (أحمد بن علي): الفلاكة والمفلكون، ط. بغداد، 1385 هـ. - الدمياطي (محمود مصطفى): معجم أسماء النبات، ط. مصر، 1965 م.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 71
  },
  {
    "serial_number": "281951",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 75,
    "volume_number": 1,
    "text": "- الدميري (كمال الدين): حياة الحيوان، ط. بيروت، د. ت. - دوزي (رينهارتا): المعجم المفصل بأسماء الملابس عند العرب، ترجمة أكرم فاضل، النص المنشور في مجلة اللسان العربي، المجلد الثامن، الجزء الثالث، والمجلد التاسع، الجزء الثاني، والمجلد العاشر، الجزء الثالث. - الذهبي (محمد بن أحمد): تذكرة الحفاظ، ط. المثنى بالأوفست، بغداد، 1966 م. - سير أعلام النبلاء (الأجزاء 1 - 22)، ط. مؤسسة الرسالة، بيروت، 1985 م. - معجم الشيوخ، مخطوط في مكتبة أحمد الثالث، رقم 22953، منه ميكروفيلم في معهد المخطوطات العربية القاهرة، رقم 164 ف). - ابن رجب (عبد الرحمن بن أحمد): الذيل على طبقات الحنابلة، باعتناء محمد حامد الفقي، ط. القاهرة، 1952 م. - الزركلي (خير الدين): الأعلام، بيروت، 1979 م. - الزيات (حبيب الزيات الدمشقي): ليلة رقص وسماع أميرية للفقراء، مجلة المشرق، العدد 43، سنة 1939، نقلًا عن الدر المنتخب في تكملة تاريخ حلب، المخطوط المحفوظ في المكتبة الأحمدية بحلب، رقم 1214، الجزء الأول. الفقراء المخربون، مجلة المشرقي، المجلد 43، 1949 م. - السُبكي (عبد الوهاب بن علي): طبقات الشافعية، تحقيق الطناحي والحلو، ط. القاهرة، سنة 1388 هـ. - معيد النعم ومبيد النقم، ط. بيروت، 1983 م. -السخاوي (محمد بن عبد الرحمن): الضوء اللامع لأهل القرن التاسع، ط. بيروت، د. ت. - ابن سعد (محمد بن سعد): الطبقات الكبرى، ط. بيروت، 1968 م. - سلام (محمد زغلول): الأدب في العصر المملوكي، ط، مصر، 1971 م. - السُّلمي (محمد بن الحسيني): طبقات الصوفية، ط. القاهرة، 1969 م. - السمعاني (عبد الكريم بن محمد): التحبير في المعجم الكبير، تحقيق منيرة ناجي، ط، بغداد، 1975 م. - السهروردي (عمر بن محمد، أبو حفص): عوارف المعارف، ط. بيروت، 1966 م.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 72
  },
  {
    "serial_number": "281952",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 76,
    "volume_number": 1,
    "text": "- السيوطي (عبد الرحمن بن أبي بكر): بغية الوعاة في طبقات اللغويين والنحاة، تحقيق محمد أبو الفضلي إبراهيم - ط. القاهرة، 1964. - تاريخ الخلفاء، تحقيق محمد محيي الدين عبد الحميد، ط. مصر، 1953 م. - حسن المحاضرة في تاريخ مصر والقاهرة، ط. مصر، 1967 م. - طبقات المفسرين، ط. القاهرة، 1976 م. - ابن شاكر الكتبي (محمد بن شاكر): فوات الوفيات، تحقيق إحسان عباس، ط. بيروت، 1973 م، تحقيق محمد محيي الدين عبد الحميد، ط. القاهرة، 1951 م. - الشطنوفي (علي بن يوسف): بهجة الأسرار ومعدن الأنوار، ط، مصر، 1304 هـ. - الشعراني (عبد الوهاب بن محمد): الطبقات الكبرى (لواقح الأنوار في طبقاته الأخيار) ط. القاهرة، 1965 م. - اليواقيت والجواهر في بيان عقائد الأكابر، ط. القاهرة، 1932 م. - الشيباني (محمد بن الحسن): الكسب، تحقيق سهيل زكار، ط. دمشق، 1980 م. - صالحية (محمد عيسى): من وثائق الحرم القدسي الشريف، ط. الكويت، 1984 م. - الصفدي (خليل بن أيبك): الوافي بالوفيات، الجزء الثالث، باعتناء س. ديدرينغ قسبادن، 1974 م. - صفي الدين الخزرجي (الحسين بن جمال الدين): سير الأولياء في القرن السابع الهجري، تحقيق مأمون محمود ياسين، وعفت وصال حمزة، ط، بيروت، د. ت. - الصقاعي (فضل اللَّه بن فخر): تالي وفيات الأعيان، تحقيق جاكلين سوبله، ط. بيروت، 1974 م. - ابن طولون الدمشقي (محمد بن علي): مفاكهة الخلان في حوادث الزمان، تحقيق محمد مصطفى زيادة، ط. القاهرة، 1962، 1964 م. - الضبي (أحمد بن يحيى): بغية الملتمس في تاريخ رجال أهل الأندلس، ط. القاهرة، 1967 م.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 73
  },
  {
    "serial_number": "281953",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 77,
    "volume_number": 1,
    "text": "- ابن عساكر (علي بن الحسن بن هبة اللَّه): تبيين كذب المفتري فيما نسب إلى الإمام أَبي الحسن الأشعري، ط. دمشق، 1347 هـ. - أبو العلاء المعري: رسالة الغفران، ومعها نص محقق من رسالة ابن القارح، تحقيق بنت الشاطئ، ط. السادسة، مصر، 1977 م. جديد في رسالة الغفران، ط. بيروت، 1972 م. - ابن العماد الحنبلي (عبد الحي بن أحمد): شذرات الذهب في أخبار من ذهب، ط. بيروت، 1970 م. - العمري (أحمد بن يحيى): مسالك الأبصار، تحقيق أحمد زكي، ط. القاهرة، 1924 م. - العيني (بدر الدين، محمود بن أحمد): عقد الجمان في تاريخ أهل الزمان، مخطوط في مكتبة سليم آغا - تركيا، رقم 834 تاريخ، الجزء الثالث والثلاثون. - الغزالي (محمد بن محمد، أبو حامد): إحياء علوم الدين، ط. بيروت، د. ت. - الغزالي (محمد بن محمد، نجم الدين): لطف السمر وقطف الثمر، تحقيق محمود الشيخ، ط. دمشق، 1981، 1982 م. - ابن الفرات (محمد بن عبد الرحيم): تاريخ الدول والملوك، تحقيق قسطنطين زريق، ط. بيروت، 1938 م - 1942 م. - فكري (أحمد): مساجد القاهرة ومدارسها، ط. مصر، 1965 م. - ابن الفَوَطي (عبد الرزاق بن محمد): الحوادث الجامعة والتجارب النافعة في المائة السابعة، تحقيق مصطفى جواد، ط. بغداد، 1932 م. - أبو الفيض (محمود أبو الفيض المنوفي): جمهرة الأولياء (أعلام الصوفية) ط. القاهرة، 1967 م. - القشيري (عبد الكريم بن هوازن): الرسالة القشيرية، ط، بيروت، د. ت. - القلقشندي (أحمد بن علي): نهاية الأرب في معرفة أنساب العرب، تحقيق إبراهيم الأبياري، ط. مصر، 1980 م. - القفطي (علي بن يوسف): تاريخ الحكماء، تحقيق جوليوس ليبرت، ط. بغداد ومصر، سنة 1903 (بالأوفست). - ابن كثير (إسماعيل بن عمر): البداية والنهاية، ط: بيروت، 1966 م. - كحالة (عمر رضا): معجم المؤلفين، ط. بيروت، 1957 م. - الكلاباذي (محمد بن إبراهيم): التعرف لمذهب أهل التصوف، تحقيق",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 74
  },
  {
    "serial_number": "281954",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 78,
    "volume_number": 1,
    "text": "عبد الحليم محمود، وطه عبد الباقي، ط. القاهرة، 1960 م. - المقري: نفح الطيب في غصن الأندلس الرطيب، ط. بيروت، 1949 م. - ماير (ل.): الملابس المملوكية، ترجمة صالح الشيني، ط. القاهرة، 1972 م. - مبارك (زكي): التصوف الإسلامي في الأدب والأخلاق، ط. بيروت، د. ت. - المقريزي (أحمد بن علي): السلوك لمعرفة دول الملوك، نشره محمد مصطفى زيادة 1942، 1958 م. المواعظ والاعتبار، ط. بولاق 1270 هـ/ 1853 م. - المناوي (عبد الرؤوف محمد بن تاج العارفين): الكواكب الدرية في تراجم السادة الصوفية، نشره محمود حسن ربيع، ط. القاهرة، 1938. - المنذري (محمد عبد العظيم بن عبد القوي): الترغيب والترهيب في الحديث الشريف، ط. القاهرة، 1954 م. - التكملة لوفيات النقلة، تحقيق د. بشار عواد معروف، ط. مؤسسة الرسالة، بيروت، 1981 م. - ابن منظور (محمد بن مكرم): لسان العرب، ط. بيروت، د. ت. - أبو نصر السراج الطوسي (عبد اللَّه بن علي): اللمع، حققه عبد الحليم محمود وطه. عبد الباقي، ط. مصر وبغداد، 1960 م. - أبو نُعيم الأصبهاني (أحمد بن عبد اللَّه): حلية الأولياء وطبقات الأصفياء، ط، بيروت، 1967 م. - النويري (أحمد بن عبد الوهاب): نهاية الأرب في فنون الأدب، ط. القاهرة، 1976 م. - اليافعي (عبد اللَّه بن أسعد): مرآة الجنان وعبرة اليقظان في معرفة ما يعتبر من حوادث الزمان، ط، بيروت، 1970 م. - اليونيني (قطب الدين، موسى بن محمد): ذيل مرآة الزمان، مخطوط أكسفورد رقم  OR.POC.132 * * *",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 75
  },
  {
    "serial_number": "281955",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 79,
    "volume_number": 1,
    "text": " مصادر ومراجع تخريج الأحاديث • تحفة الأشراف بمعرفة الأطراف، للحافظ المِزِّي، تحقيق الشيخ عبد الصمد شرف الدِّين، مصورة المكتب الإِسلامي عن طبعة الدار القيمة بالهند، بيروت 1403 هـ. • جامع الأصول في أحاديث الرسول صلى الله عليه وسلم، للإِمام ابن الأثير، تحقيق الشيخ عبد القادر الأرناؤوط، مكتبة الحلواني، مطبعة الملاح، مكتبة دار البيان، دمشق 1389 هـ. • حلية الأولياء، لأبي نُعيم الأصبهاني، مصورة دار الكتاب العربي، بيروت 1405 هـ. • زاد المعاد في هدي خير العباد، لابن قيم الجوزية، تحقيق الشيخين شعيب الأرناؤوط وعبد القادر الأرناؤوط، مؤسسة الرسالة بيروت ومكتبة المنار الإسلامية في الكويت 1399 هـ. • سنن ابن ماجه، تحقيق الأستاذ محمد فؤاد عبد الباقي، مصورة دار إحياء التراث العربي، بيروت 1395 هـ. • سنن الترمذي، تحقيق الشيخ أحمد محمد شاكر، والأستاذ محمد فؤاد عبد الباقي، والشيخ إبراهيم عطوة عوض. • السنن الكبرى للبيهقي، مصورة دار الفكر، بيروت بدون تاريخ. • شرح الأربعين النووية في الأحاديث الصحيحة النبوية، صنفه محمود الأرناؤوط، راجعه الشيخ عبد القادر الأرناؤوط، دار ابن كثير، دمشق - بيروت 1406 هـ. • صحيح مسلم، تحقيق الأستاذ محمد فؤاد عبد الباقي، دار إحياء التراث العربي، بيروت بدون تاريخ.",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 76
  },
  {
    "serial_number": "281956",
    "category_id": "2",
    "category": "الفرق والردود",
    "book_title": "الموفي بمعرفة التصوف والصوفي",
    "edition": "الأولى، 1408 هـ - 1988 م",
    "publisher": "مكتبة دار العروبة للنشر والتوزيع - الكويت",
    "page_number": 80,
    "volume_number": 1,
    "text": "• فتح الباري بشرح صحيح البخاري، لابن حجر، بإشراف العلّامة الشيخ عبد العزيز بن باز، المكتبة السلفية بالقاهرة 1393 هـ. • كتاب عشرة النساء (من السنن الكبرى) للنسائي، تحقيق الأستاذ عمرو علي عمر، مكتبة السُّنَّة، القاهرة 1408 هـ. • المستدرك على الصحيحين، للحاكم، مصورة دار الكتاب العربي، بيروت بدون تاريخ. • مسند الإِمام أحمد بن حنبل، مصورة المكتب الإِسلامي، ودار صادر، بيروت 1389 هـ. • المعجم المفهرس لألفاظ الحديث النبوي، د. ونسنك، بريل 1356 هـ. * * *",
    "foot_note": "None",
    "book_id": "97",
    "new_page_number": 77
  }
]