[
  {
    "text": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420\n\nSection: Sects and Refutations\nBook: Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nBook: Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nDate of publication in Shamela: 8 Ramadan 1440",
    "foot_note": "None",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "category_id": "2",
    "category": "Sects and Refutations",
    "new_page_number": 1
  },
  {
    "text": "sn: 879\nbook_title: الرد على التعقيب الحثيث للشيخ عبد الله الحبشي\nbook_link: https://shamela.ws/book/151039\nbook_id: 151039\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مطبعة الترقي، دمشق - سوريا\nedition: عام النشر: 1377 هـ - 1958 م\npages: 66\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفرق والردود\ncategory_id: 2\n\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah who bestowed His favor upon us and guided us to Islam, and granted us success in following the Sunnah of His Prophet, peace and blessings be upon him, supporting it, defending its sanctuary, and refuting those who oppose it or deviate from it. Blessings and peace be upon His Messenger who said: 'Adhere to my Sunnah and the Sunnah of the Rightly Guided Caliphs, hold fast to it,' and upon his family, his companions, and those who follow them in adopting it and preferring it over everything that opposes it.\nTo proceed: This is a concise treatise in refutation of the treatise of the virtuous Sheikh Abdullah Al-Habashi, which he named 'Al-Ta'aqub Al-Hathith 'ala man Ta'ana fi ma Sahha min al-Hadith' (The Intensive Commentary on He Who Impugned What is Authentic of Hadith) or 'Tahqiq al-Bayan fi Ithbat Subhat Ahl al-Iman' (Verification of the Clarification in Proving the Prayer Beads of the People of Faith)! In it, he commented - according to his claim - on three Hadiths I had discussed in some of my articles published successively in the flourishing 'Al-Tamaddun Al-Islami' magazine, under the title 'Weak and Fabricated Hadiths and Their Negative Impact on the Ummah.' In those articles, I judged the Hadith 'What a good reminder is the Subha (prayer beads)' to be fabricated, and the chains of the Hadiths of Safiyyah and Sa'd (may Allah be pleased with them) regarding glorifying Allah (Tasbih) using pebbles or date stones to be weak. The Sheikh claimed that the first Hadith is weak but not fabricated, and that the other two Hadiths are authentic! Based on that, he established the legitimacy of counting Dhikr (remembrance) with beads and carrying them, even making it a slogan of the people of faith!\nHad his eminence held the view he did without attacking us with arguments that contradict the science of Hadith and the terminologies established by the scholars, we would not have allowed ourselves to refute him, for he has the right to hold whatever view he wishes as long as he believes it to be legitimate, and refuting such opinions could be endless! However, since the Sheikh deviated in his refutation from those rules and contradicted them clearly, and even attributed to us what we did not say and do not believe before Allah, I saw that it was necessary to refute him and clarify his errors so that those who possess no knowledge are not deceived by them, and attribute to us what we did not say.",
    "foot_note": "None",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "category_id": "2",
    "category": "Sects and Refutations",
    "new_page_number": 2
  },
  {
    "serial_number": "301767",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 2,
    "volume_number": 0,
    "text": "We had published this refutation of ours in the aforementioned magazine in a series of articles, then we collected them in this treatise to facilitate reviewing them when needed, and so that whoever wishes may read them from those who did not see them in the magazine; may Allah reward those in charge of it with good. My hope is that the noble readers find in it a just refutation that does not compromise with anyone, nor attacks anyone unjustly, because the intention is to clarify the truth and facilitate the path to it, so that he whom Allah wills to guide may be guided. As for the one who turns away, refuses, is stubborn, and distances himself, there is no way to convince him even if you brought him every proof!\nThe readers will find in it - if Allah Almighty wills - a wonderful example of the practical method in applying branches to principles, whether in the principles of Hadith or Fiqh, and an explanation of our methodology in weakening Hadiths, and a verification of some Hadith rules that many of those occupied with the Sunnah, let alone others, have neglected! And a reminder of some fundamental rules that must be recalled and adopted by anyone who wishes to deem something good that did not exist before!\nWe have included in it some traditions (Athar) warning against innovation in religion, and we have drawn attention to some innovations that afflict those who have no knowledge of the Sunnah! And other benefits that the noble reader will encounter, if Allah Almighty wills.\nI ask Allah, the Blessed and Exalted, to benefit my Muslim brothers with it, and to store its reward for us in the Hereafter. Praise be to Allah, and that is sufficient, and peace be upon His servants whom He has chosen.\nDamascus: 22/11/1377\nAbu Abdur-Rahman Muhammad Nasir al-Din al-Albani",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 3
  },
  {
    "serial_number": "301768",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sects and Refutations\nBook: Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nBook: Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nAuthor: Muhammad Nasir al-Din al-Albani\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nYear of Publication: 1377 AH - 1958 AD\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nPrepared for Shamela by: Muhammad Al-Mansour m_almansour@yahoo.com\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Ramadan 1440\n\nDate of publication in Shamela: 8 Ramadan 1440",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 4
  },
  {
    "serial_number": "301769",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 1,
    "volume_number": 1,
    "text": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi\nIt is a collection of articles published successively in the illustrious magazine Al-Tamaddun Al-Islami\nBy Muhammad Nasir al-Din al-Albani, Servant of the Sunnah\n1377 AH - 1958 AD\n\nIn the name of Allah, the Most Gracious, the Most Merciful\n\nPreface:\nDamascus knew its greatest Muhaddith (scholar of Hadith), the erudite Sheikh Badr al-Din al-Hasani. When Allah took his soul, the lands became devoid of an Imam to whom eyes turned in the sciences of Hadith. However, an Albanian youth - (who grew up in an environment of knowledge and piety, and had a share of his name [Nasir al-Din = Supporter of Religion], Professor Muhammad Nasir al-Din) - became known among the youth for his service to Hadith and its sciences. He gathered the youth around him, became famous among them, and was able, through the eloquence of his Arabic tongue, the sweetness of his speech, and the quality of his debate, to attract an elite group that learned from him and became his students.\nSince Hadith is the second source of Islamic jurisprudence after the Book of Allah, and relying on what is authentic according to the scholars of Hadith was a school of thought for the jurists, some supporters of Sheikh Nasir became famous for abandoning jurisprudential rulings in which they knew of a proven authentic Hadith [to the contrary], and some of them would stir up controversy. Hence, those who rallied against the Professor did so.\nFinally, Sheikh Abdullah bin Muhammad from the family of Shaybah (custodians of the Kaaba) descended upon Damascus (he was born in Harar, Ethiopia, in the third generation of his family's migration). He memorizes ten thousand Hadiths of the Messenger of Allah, peace and blessings be upon him, with their chains of transmission, and has a plentiful share of Shafi'i jurisprudence. His arrival in Damascus was to pursue books of Hadith and collect Quranic readings and similar services to the Sharia and its sciences.\nA group of people of religion and knowledge saw in him a successor to Sheikh Badr al-Din, may Allah have mercy on him, so they sought his support against Sheikh Muhammad Nasir al-Din. A discussion took place between them in an atmosphere preceded by propaganda between the two parties, which caused Sheikh Abdullah to cut off the discussion before reaching the end of the round. Until, when Professor Al-Shaybi saw subsequent researches published by our magazine for Sheikh Muhammad Nasir al-Din regarding weak and fabricated Hadiths, he tracked what differed from his view regarding the Hadith of the 'Subha' (prayer beads), and sent us an article about that which we intended to publish. But soon after, he published a treatise titled 'Al-Ta'aqub Al-Hathith 'ala man Ta'ana fi ma Sahha min al-Hadith' (The Intensive Commentary on He Who Impugned What is Authentic of Hadith).",
    "foot_note": "None\n\nNone",
    "book_id": "151039",
    "new_page_number": 5
  },
  {
    "serial_number": "301771",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 2,
    "volume_number": 1,
    "text": "Since the policy of the magazine is to pave the way for spreading the truth and avoid, as much as possible, the field of futile give-and-take, and because we usually combine different viewpoints by presenting the arguments of both differing parties together, we presented this treatise to Sheikh Muhammad Nasir al-Din. He summarized what Professor Al-Shaybi brought, clarified the points of disagreement, and expounded during that on the rules of 'Jarh and Ta'dil' (Disparagement and Validation) with solid discussion that doubles the benefit for the readers. This is what the noble reader will see, and our goal is for the truth to become manifest for those who seek it, and Allah is behind the intention, and He guides the way.\n* * *\nProfessor Sheikh Muhammad Nasir al-Din al-Albani said:\n\nThe Point of Disagreement Between Me and the Sheikh:\nThe disagreement between me and the virtuous Sheikh Abdullah revolves around three Hadiths:\nFirst: (What a good reminder is the Subha [prayer beads]).\nSecond: From Sa'd bin Abi Waqqas that he entered with the Messenger of Allah, peace and blessings be upon him, upon a woman, and in front of her were date stones or pebbles with which she was glorifying Allah (Tasbih). So the Prophet, peace and blessings be upon him, said: (Shall I tell you what is easier for you than this or better?) He said: (Glory be to Allah as many times as what He created in the heaven... the Hadith).\nThird: From Safiyyah, she said: The Messenger of Allah, peace and blessings be upon him, entered upon me while in front of me were four thousand date stones with which I was glorifying Allah... the Hadith, similar to the one before it.\nIn an article published by this noble magazine in parts (9 and 10, Year 22), I held the view that the first Hadith is weak in chain and fabricated in text; and that the other two Hadiths have weak chains, and that the mention of pebbles in the second one is Munkar (denounced) because it contradicts the authentic Hadith of Juwayriyah in Muslim which does not contain the mention of pebbles. (1)\nAs for his eminence the Sheikh, he held the view in his aforementioned treatise that the first Hadith is only weak and that the other two are authentic. In order for the intelligent reader to clarify the correct view from this disagreement, I must mention the principles upon which the Sheikh based his weakening and authentication, then return to answer them with what Allah, Glory be to Him and Exalted is He, facilitates.",
    "foot_note": "1. (1) The article was printed with other articles on page (1/110/117).",
    "book_id": "151039",
    "new_page_number": 6
  },
  {
    "serial_number": "301772",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 3,
    "volume_number": 1,
    "text": "The Principles Upon Which the Sheikh Based Weakening the Hadith Only:\nThe virtuous Sheikh established (p. 5 - 9) principles regarding the first Hadith:\nFirst: That a Hadith is not judged as fabricated merely because the narrator is 'Munkar al-Hadith' (narrates denounced reports) or 'Majhul' (unknown); rather, both matters are causes of intermediate weakness.\nSecond: Nor is it judged as such merely because the narrator lies.\nThird: Acting upon a severely weak Hadith is prevented - except the fabricated one - and it is that which is narrated uniquely by a liar or one accused of lying or one whose mistakes are excessive (p. 38).\nFourth: Among the indicators by which a fabricated Hadith is recognized is what is taken from the state of the narrated text, such as being contradictory to the text of the Quran, the Mutawatir Sunnah, the definitive Consensus, or explicit reason, where none of that accepts interpretation, as he quoted from Sheikh Ali al-Qari (p. 9).\n\nThe Answer to These Principles:\nI say in answer to these principles in the previous order:\n1 - This principle is correct and does not apply to me, because I did not judge the first Hadith as fabricated merely because there is an unknown narrator or one who narrates denounced reports among its narrators. Rather, it is because added to that is the fact that the Subha (prayer beads) is an innovation and contradicts the Sunnah of counting on the fingertips. My words in the 'referred article' are explicit in that, because I said after speaking about the men of the Hadith's chain (p. 201): 'So it is proven that it is a weak chain that cannot be used as proof.' The completion of this statement is: 'Then the Hadith, in terms of its meaning, is false to me for several reasons,' and the Sheikh quoted this (p. 12) without what came before it! But the Sheikh - may Allah forgive him - when he quoted my words in his treatise (p. 3 - 4) to refute them, quoted them abbreviating this important sentence from my speech, so he built his refutation against me without looking at it, falling into this exposed error due to which he attributed me (p. 5) to opposing the people of Hadith!\nHis eminence was not satisfied with blackening four pages on this principle about which there is no disagreement, but he returned at the end of the treatise (p. 29) and convened another chapter stating that anonymity and denouncement (Nakara) do not necessitate fabrication, then blackened another five pages to explain that. He would have been spared wasting time writing them had he contemplated my previous sentence...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 7
  },
  {
    "serial_number": "301773",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 4,
    "volume_number": 1,
    "text": "...which explicitly states that the chain of the Hadith is weak! Had he done that, he would not have accused me by saying in this chapter (p. 41): 'In it is evidence to refute what this man claimed, that a narrator narrating denounced reports is proof that a Hadith is fabricated...'\nI did not say this at all, O Sheikh, nor do I believe it. Rather, I believe the opposite. Here is the article in the 'Respected Magazine,' so on which page is this that you attribute to me?! By the grace of Allah Almighty, nearly twenty years have passed for me in studying the science of Noble Hadith, its principles and branches, while verifying it practically by returning branches to principles. So may my mother be bereft of me if I had claimed what you attribute to me! So a little deliberation and fairness, O virtuous Sheikh!\n\n2 - The Sheikh's Error in Saying: 'A Hadith is Not Judged as Fabricated Due to the Lying of the Narrator'!\nThis principle is refuted by the saying of Al-Hafiz Ibn Hajar in 'Sharh al-Nukhbah': 'Then the impugnment is either due to the lying of the narrator, or his being accused of it, or the excessiveness of his mistake or his negligence... The first: The Fabricated (Mawdu') - (Sheikh Ali al-Qari said in his commentary (p. 122 - 123): It is the impugnment due to the lying of the narrator) - and the judgment of it as fabrication is by way of dominant conjecture, not certainty. The second: The Discarded (Matruk),' Al-Qari said (p. 130): 'It is what is due to the narrator being accused of lying' - and the third: The Denounced (Munkar) according to one opinion.'\nYou see that Al-Hafiz made the description of the narrator as lying the highest level of disparagement, and made the Hadith of one in this rank 'Fabricated.' He made the one accused of lying in the second rank of disparagement, and made his Hadith 'Discarded,' which is the severely weak.\nLook how his eminence the Sheikh confused the two ranks, making them one rank, and made the Hadith of the Liar (Fabricated) and the Accused of Lying (Discarded) in one rank, which is severe weakness!\nWhat indicates his delusion is the saying of Imam Al-San'ani in 'Tawdih al-Afkar li Ma'ani Tanqih al-Anzar' (Vol 2, p 272) after mentioning the ranks of disparagement, including the first two ranks mentioned in Al-Hafiz's speech: 'And you do not say regarding the liar, i.e., the one they described as such, that he is accused of lying, because the first implies he is known for it, and the second implies negating that and that there is only a mere accusation against him.'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 8
  },
  {
    "serial_number": "301774",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 5,
    "volume_number": 1,
    "text": "The Summary: The narration of a liar regarding a specific Hadith is sufficient to judge it as fabricated concerning this specific chain. This is the practice of critics in judging a Hadith as fabricated due to the narration of one of the liars, as Ibn al-Jawzi did in 'Al-Mawdu'at' and Al-Suyuti in his 'Dhayl' and 'La'ali' and others.\nThis does not contradict what the author quoted (p. 9) from Al-Hafiz Al-Iraqi that 'the absolute lying of a narrator does not indicate fabrication,' because he means it does not indicate fabrication definitively (qatan) due to the possibility of his truthfulness [in that specific instance] and others following him. However, this does not negate judging it as fabricated by way of dominant conjecture (1) as previously quoted from Al-Hafiz Ibn Hajar. Thus his statement aligns with the statement of his teacher Al-Hafiz Al-Iraqi. Dominant conjecture is what most Sharia rulings are based upon, including what we are discussing. It is not permissible to abandon it except with a stronger proof, such as if a trustworthy man other than the liar narrates the Hadith narrated by the liar. In that case, this Hadith is used as proof, and we say that the truthfulness of this liar in this Hadith has become apparent to us due to his agreement with the trustworthy narrator, as indicated by his saying, peace and blessings be upon him, in the Hadith of the Jinn: 'He told you the truth though he is a liar'! However, in the absence of this trustworthy witness, the Hadith of the liar is fabricated without doubt. It has become clear to the reader from the foregoing who has 'opposed the science of Hadith'?!\n\n3 - His Departure from the Method of Muhaddithin: regarding his statement that severely weak Hadith is what is uniquely narrated by a liar!\nI do not know of anyone who preceded the author in describing the severely weak Hadith - (which has not reached the rank of 'Fabricated') - as that which is uniquely narrated by a liar! Rather, anyone who has smelled the scent of the science of Hadith does not doubt the (fabrication) of what is uniquely narrated by a liar. What prevents some from asserting its fabrication is the possibility that it has another path better than his path. But regarding the discussion of what is uniquely narrated by a liar, there is no doubt in its fabrication from the perspective of the terminology of Muhaddithin. The speech of Al-Hafiz Ibn Hajar presented earlier is one of the clearest proofs of that. The discussion on the invalidity of this statement of the Sheikh is long, so we will not lengthen the article by mentioning it. It suffices in clarifying his error in that to say he equates the Hadith of one who is a liar with the Hadith of one who is truthful but makes excessive mistakes. This is something no one other than the Sheikh says! What scholars believe is that the Hadith of the liar is fabricated, and the Hadith of the one making excessive mistakes is very weak, as preceded. My prevailing thought is that the Sheikh came to this from what Al-Suyuti quoted in 'Al-Tadrib' (p. 108) from...",
    "foot_note": "1. (1) See Sharh Nukhbat al-Fikar by Ali al-Qari (p. 123 - 124).",
    "book_id": "151039",
    "new_page_number": 9
  },
  {
    "serial_number": "301775",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 6,
    "volume_number": 1,
    "text": "Al-Hafiz that he mentioned 'three conditions' for working with weak Hadith in virtuous deeds: 'First: That the weakness is not severe, thus excluding what is uniquely narrated by liars, those accused of lying, and those whose mistakes are excessive.' This is something accepted and known, while what the Sheikh mentioned is unknown and rejected.\n\n4 - Verifying the Saying Regarding Indicators by Which the Fabricated is Recognized:\nI say: These indicators which the Sheikh quoted from Al-Hafiz Ibn Hajar are accepted. However, there is a subtlety in Al-Hafiz's speech here that must be noted, which is that his speech is not intended for the Hadith whose chain contains an accused person. Rather, it is specific to what has an apparently authentic chain that necessitates acting upon it, so it is then rejected by the contradiction mentioned in Al-Hafiz's speech. It cannot be applied to the Hadith narrated by a liar for reasons including:\nFirst: That being from the narration of a liar drops it, and there is no need then to reject it by contradiction.\nSecond: Interpretation (Ta'wil) is a branch of authentication (Tashih). If the chain is fabricated, it spares us the burden of interpretation, as is not hidden. So it appears that Al-Hafiz's speech does not intend the Hadith whose chain cannot be used as proof.\nThe purpose of this is that I say the weak-chained Hadith is judged as fabricated by other indicators that may be lesser in strength than those mentioned previously. Among them is being contrary to the authentic Sunnah, even if it is not Mutawatir (consecutive). Supporting me in this is the saying of Al-Hafiz Ibn Kathir in 'Ikhtisar Ulum al-Hadith' (p. 85) regarding mentioning the evidences of a fabricated Hadith: 'And from that is the weakness of its wording, the corruption of its meaning, or excessive exaggeration, or its contradiction to what is established in the Book and the authentic Sunnah.' Reflect on how he generalized the authentic Sunnah and did not restrict it to 'Mutawatir,' because his speech is more general than Al-Hafiz's speech, as appeared in this explanation.\n\nThe Fall of the Sheikh's Criticism of My Judgment of the Hadith as Fabricated:\nSince our opinion regarding the four rules established by the virtuous Sheikh has become clear, and what is correct among them according to the Muhaddithin and what is not has been known, his criticism of me in my judgment of the Subha Hadith as fabricated remains invalid for two reasons:",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 10
  },
  {
    "serial_number": "301776",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 7,
    "volume_number": 1,
    "text": "First: That I weakened its chain, and the Sheikh agreed with me on weakening it from this aspect, and I did not judge it as fabricated because of it [the chain]. So his argument against me using the first rule falls.\nSecond: That I judged it as fabricated because the Subha is an innovation (Bid'ah), and because counting on it is contrary to the practical Sunnah, as I explained in the 'Article'. Thus, the Sheikh's saying (p. 13) falls, after quoting my speech judging it invalid: 'This invalidation of yours is invalid, for where does this apply to what they said regarding recognizing the fabricated? Which is what we presented from Al-Hafiz Ibn Hajar that the report contradicts explicit reason.'\nThe reason for its fall is that Al-Hafiz's speech is focused on the authentic-chained Hadith if it is assumed to contradict explicit reason, as previously explained. Our Hadith here is not like that; rather it is weak. So judging it invalid is easier than judging an authentic-chained Hadith invalid, without doubt. And it is not a condition that it contradicts explicit reason; rather, it suffices that it contradicts the authentic Sunnah, for example, as indicated by Ibn Kathir's previous speech.\n\nThe Subha is an Innovation and Contrary to the Sunnah:\nI had demonstrated in the 'Article' to which the Sheikh responded that the Subha is an innovation, and that glorifying Allah with it contradicts his guidance, peace and blessings be upon him, in glorifying with fingertips. I made these two matters indicators proving the invalidity and fabrication of the Hadith, but the Sheikh was not satisfied with that.\nAs for the first indicator, he rejected it with an exposed fallacy, which is his saying (p. 10): 'I wish I knew what intellect deems the existence of the Subha in the era of the Messenger, peace and blessings be upon him, definitively impossible.'\nThe face of the fallacy is that I did not claim the impossibility of the Subha's existence in that blessed era - rationally - because that is not among 'what is inconceivable in the mind to exist' definitively. The Subha is not among the theoretical issues whose possibility or impossibility is judged by reason. Rather, it is among the issues related to history, existence, and non-existence. If it is established among scholars that the Subha did not exist in his era, peace and blessings be upon him, but rather originated in the second century, then it is valid to denounce this Hadith considering that it encourages the Companions to something they do not know. This - meaning the encouragement - is irrational to emanate from him, peace and blessings be upon him, given the non-existence of the Subha. This indicates the fabrication of the Hadith and the fabricator's ignorance of the history of the Subha.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 11
  },
  {
    "serial_number": "301777",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 8,
    "volume_number": 1,
    "text": "This is the basis of our judgment on the Hadith as invalid, not what the Sheikh portrayed as rational impossibility! It seems the virtuous Sheikh noticed this correct perspective, and therefore tried to answer it by saying (p. 10): 'Even if we assume its non-existence in that era, there is no rational impossibility in the Prophet, peace and blessings be upon him, encouraging his companions to something not known to them so they may act upon it when it exists...'.\nThen he brought two examples for that:\nFirst: The Hadith of Nabit al-Ashja'i raised [to the Prophet]: (Indeed, the most beloved of my nation to me are a people who come after me, believing in me while having not seen me, acting upon what is in the hanging pages) narrated by Ibn Asakir. The Sheikh mentioned a witness for it in the commentary from the Hadith of Umar via the narration of Al-Hakim.\nSecond: 'The Hadith of Abu Dawood from Al-Nawwas bin Sam'an: 'Jesus son of Mary will descend at the white minaret east of Damascus.'\n\nThe Weakness of the First Hadith and the Sheikh's Shortcoming in Referencing the Second! And an Explanation of their Lack of Indication for His Purpose!\nThe answer to the first example is from two aspects:\nFirst: Not conceding its authenticity. For in the Hadith of Ibn Asakir there is a liar and another weak narrator. And in Al-Hakim's chain is a very weak narrator about whom Al-Bukhari said: 'Munkar al-Hadith' (Denounced in Hadith) (1), and Al-Nasa'i said: 'Not trustworthy.' Therefore, Al-Dhahabi rejected Al-Hakim's authentication of it. The Hadith has a third path better than the first two, but it is also weak. Detailed discussion on it will come, Allah willing, in the articles of 'Weak Hadiths' which clarify the weakness of many Hadiths thought to be authentic by some of the elite, let alone the general public!\nThe Second Aspect: That the Hadith, if authentic, is explicit that the 'hanging pages' - which is a metonymy for the Mus-hafs and books - were not in his era, peace and blessings be upon him. For he, peace and blessings be upon him, praises those who are not...",
    "foot_note": "1. (1) Meaning it is not permissible to narrate from him, as Al-Suyuti mentioned in 'Al-Tadrib' (p. 127), noting that this is Al-Bukhari's intent with this phrase, and he accepted the validity of that from Al-Bukhari. As for the virtuous Sheikh, he indicated his view of its lack of validity by saying (p. 8): 'If true,' implying he did not trust Al-Suyuti's transmission. What is the reason for that, given that he was not alone in reporting it, but Al-Dhahabi preceded him in 'Al-Mizan' (1/5) quoting Ibn al-Qattan, and Al-Dhahabi relied upon it in his treatise 'Al-Muqizah'!!",
    "book_id": "151039",
    "new_page_number": 12
  },
  {
    "serial_number": "301778",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 9,
    "volume_number": 1,
    "text": "...his companions for their acting upon something that occurred after him, peace and blessings be upon him, believing in him in the unseen because of these Mus-hafs which they read and know his truthfulness, peace and blessings be upon him, through them. So there is not in the Hadith - if authentic - any encouragement for the Companions to act upon what they do not know. How could that be when they believe in him, memorize his Book, and know his biography?! This is contrary to the Hadith: (What a good reminder is the Subha), for there is not the slightest indication in it that he, peace and blessings be upon him, is encouraging his companions to something that will occur. Rather, what immediately comes to mind from it is only that he is encouraging them to use it while it is known to them. So the difference between it and the Hadith of (the Hanging Pages) appears (1), and thus the Sheikh's attempt to invalidate our judgment of the Hadith's invalidity falls.\n\nInvalidating the Sheikh's Statement: 'The Companions Did Not Know the (Minaret)'!\nAs for the second example, which is the Hadith of the Minaret, the answer is: The author's use of it as evidence that he encouraged the Companions to act upon what they did not know in the present is one of the most amazing things in my view! This is for several reasons:\nFirst: That the utmost the Hadith contains is information about the descent of Jesus, peace be upon him, at the Minaret, so there is no encouragement regarding it.\nSecond: From where does the author get that the meaning of 'Minaret' (Manara) in the Hadith is: The Muezzin's tower (Mi'dhanah) upon which the call to prayer is made, when there is nothing in the Hadith indicating that in the slightest? 'Al-Manara' in the language has other meanings: In 'Al-Qamus': 'Al-Manara is the place of light, like the lighthouse, the lamp-stand, and the minaret.' In 'Lisan al-Arab': 'Al-Manar is the plural of Manara, which is the sign placed between two boundaries.' So as long as 'Al-Manara' has multiple meanings, it is not permissible for us to specify one meaning from them except with evidence, which is missing here. Perhaps the Sheikh thinks this Minaret is the one east of the Umayyad Mosque which the common people call the Minaret of Jesus, peace be upon him! So the Sheikh restricted the Hadith to their understanding! This is rejected against him, especially since Al-Nawawi said in 'Sharh Muslim': 'This Minaret exists today east of Damascus.'",
    "foot_note": "1. (1) Clarifying this difference is that everyone who reads or hears the Hadith (What a good reminder is the Subha) does not entertain in his mind anything but that he, peace and blessings be upon him, intends a Subha known in his era, not a Subha that will occur after him, unlike the Hadith of (the Hanging Pages). Since it is established that it did not exist in his era, peace and blessings be upon him, that indicates the invalidity of the Hadith, and this is a clear matter, and praise be to Allah for His success.",
    "book_id": "151039",
    "new_page_number": 13
  },
  {
    "serial_number": "301779",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 10,
    "volume_number": 1,
    "text": "He says: 'East of Damascus.' Had he understood the Hadith as the common people understand it, he would have said: 'East of the Umayyad Mosque.'\nThird: Suppose the Hadith meant the 'Minaret' (Mi'dhanah), from where does the author get that the Companions did not know the Minaret?! Even though it is an Arabic word with a meaning understood by them?! He said in 'Al-Qamus': 'Al-Mi'dhanah is the place of Adhan, or the Manara (lighthouse/tower) and the Sawma'ah (hermitage).' This text from this Imam in explaining (Al-Mi'dhanah) implies that it also has multiple meanings, not a single meaning, so the objection we raised against the author regarding 'Al-Manara' applies here. If the first meaning is chosen for 'Al-Mi'dhanah', which is the place of Adhan, then this is something known to them, so it is not permissible to say they did not know it. If development has entered upon the Minaret in terms of construction, this does not remove it from its name which the Companions naturally knew. Since the Hadith informs about an unseen matter, it is not permissible for us to restrict the Minaret with attributes from ourselves without proof or evidence, then attribute to the Companions lack of knowledge of the Minaret!\nThe summary of the speech, O virtuous Sheikh, is that the Companions knew the Minaret well, but naturally they did not know the Minaret whose image formed in your mind, this image regarding which you can never say the Messenger, peace and blessings be upon him, intended in the Hadith. Based on this, your statement (p. 12): 'The Companions did not know the Minaret' is invalid.\nIf what we presented of these matters is established, the collapse of the author's deduction from the Hadith that he, peace and blessings be upon him, encouraged the Companions to act upon what they did not know becomes clear to the noble reader! And our statement that 'it is irrational for the Messenger, upon him be blessings and peace, to encourage his companions to a matter they do not know' remains free from opposition. Consequently, the first indicator of the invalidity of the Subha Hadith remains standing and correct (1).\n\nRefuting the Sheikh's Saying that There is No Contradiction to the Sunnah in Glorifying with the Subha! And Detailed Speech on What counts as Opposition and What Does Not:\nAs for the second indicator, which is that glorifying with the Subha contradicts his guidance, peace and blessings be upon him, in glorifying with the fingertips, the virtuous Sheikh answered it by saying (p. 14 - 15):",
    "foot_note": "1. (1) Furthermore, I must not miss on this occasion to point out an error the Sheikh fell into, which is that he attributed the aforementioned Minaret Hadith to Abu Dawood only, even though it is in Sahih Muslim (Vol 8 / 197 - 198)!",
    "book_id": "151039",
    "new_page_number": 14
  },
  {
    "serial_number": "301780",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 11,
    "volume_number": 1,
    "text": "\"'It is said to you: Using beads instead of fingertips for Tasbih does not necessarily mean the doer opposes the guidance of the Prophet, peace and blessings be upon him. Rather, the utmost implies that he left the better option, which is counting with the right hand because it is what was reported from his action, peace and blessings be upon him, and his saying.'\nThen his eminence prolonged his speech mentioning analogues to this issue. If we wanted to track him in every example he cited, the article would become very long, and we would burden the magazine and the readers alike. But 'what cannot be completely grasped should not be completely left,' therefore I will say a comprehensive word regarding those examples:\nThe examples referred to are divided into two categories:\nThe first: Where the text indicates the permissibility of both matters and their virtue, and that one is better than the other. This is like what the Sheikh cited regarding praying voluntary prayers in mosques and homes. The text is his saying, peace and blessings be upon him: (The best prayer of a man is in his house except the obligatory prayer) narrated by Al-Bukhari and Muslim. A text from his action, peace and blessings be upon him, may stand in its place, which does not appear to the jurist to be better than his other action.\nThe other category: What the practical text from him, peace and blessings be upon him, came defining for an act of worship or restricting it with a description; then nothing came to indicate that opposing it is legitimate and has merit inferior to what he, peace and blessings be upon him, legislated by his action. Like performing Wudu with a Mudd and Ghusl with a Sa', for there is nothing in the Law indicating the legitimacy of exceeding it.\nWhat we see and believe before Allah is: What falls into the first category, we prefer what he, peace and blessings be upon him, preferred, and we permit the other matter because the Prophet, peace and blessings be upon him, permitted it and assigned a virtue to it inferior to the virtue of the first matter, like praying voluntary prayers in mosques - not because we 'see people praying all Sunnah prayers in the mosque'!\nAs for what falls into the second category, we answer the Sheikh frankly: 'Yes, we denounce him just as we denounce the Subha due to his leaving what is reported from him, peace and blessings be upon him.' Imam Al-Bukhari said in the Book of Wudu from his Sahih (1/188 see Fath al-Bari): 'The people of knowledge disliked extravagance in it, and exceeding the action of the Prophet, peace and blessings be upon him.' It is not hidden that there is no difference between exceeding the number three or the amount of water, for all of it is exceeding the action of the Prophet, peace and blessings be upon him. Supporting this is his saying, peace and blessings be upon him:",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 15
  },
  {
    "serial_number": "301781",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 12,
    "volume_number": 1,
    "text": "(There will be in this nation a people who transgress in purification and supplication) (1). Transgression is not permissible in Sharia, so it is proven that exceeding the amount of water defined by the Messenger, peace and blessings be upon him, in Wudu and Ghusl is not permissible. Thus falls from consideration the Sheikh's disapproving question in his saying: 'And most people today take for their Wudu much more than this amount, so do we make everyone who does not limit himself in his Wudu to a Mudd and in his Ghusl to a Sa' an opposer of his guidance, peace and blessings be upon him?!'!\nHow can one who exceeds his guidance, peace and blessings be upon him, not be an opposer, when there is nothing beyond his guidance, upon him be blessings and peace, except error? Therefore, the Shafi'is and others went to censuring extravagance in water in Wudu and Ghusl, and what Al-Bukhari quoted from the people of knowledge regarding the dislike of that has preceded. Indeed, some Shafi'is like Al-Baghawi and others went so far as to say it is forbidden (Haram) (2). This is closer to the apparent meaning of the Hadith of transgression in purification mentioned just now.\nIf these two categories of his worship, upon him be blessings and peace, have become clear to the noble readers, it is time to ask: Does glorifying with fingertips fall into the first category or the second? As for us, there is no doubt it is from the second category, 'because it is what was reported from his action, peace and blessings be upon him, and his saying,' as the virtuous Sheikh himself said! And nothing came from him, peace and blessings be upon him, indicating the legitimacy of opposing it and its virtue such that acting upon it would be permissible while leaving the best. The Sheikh's statement which we are refuting is explicit that glorifying with the Subha has virtue but glorifying with fingertips is better. Therefore, we demand from him the legal evidence for this virtue, and he has nothing but this Hadith (What a good reminder is the Subha), which is fabricated according to me, and weak according to the Sheikh, so it is not permissible to use it as proof in any case. As for analogizing the Subha to glorifying with pebbles, it is an analogy with a discrepancy, because the corruptions that usually arise from using the Subha, such as showing off (Riya') and being occupied by it from returning Salam as we pointed out in the 'Article', do not occur in glorifying with pebbles. Thus the measured and the measured upon differ. This is assuming the correctness of glorifying with pebbles from him, peace and blessings be upon him, which is not correct as we explained in the referred 'Article', and we will explain it further here, Allah willing.\nIt is strange of the Sheikh that he declares (p. 15) that counting with the right hand is 'what was reported from his action, peace and blessings be upon him, and his saying,' pointing by 'his saying' to the Hadith of Yusayrah raised [to the Prophet]:",
    "foot_note": "1. (1) It is an authentic Hadith as stated by Al-Hakim, Al-Nawawi, and Ibn Hajar.\n2. Al-Nawawi mentioned it in 'Al-Majmu' Sharh al-Muhadhdhab' (2/190).",
    "book_id": "151039",
    "new_page_number": 16
  },
  {
    "serial_number": "301782",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 13,
    "volume_number": 1,
    "text": "(Hold fast to Tasbih, Tahlil, and Taqdis, and do not be negligent lest you forget Monotheism (Tawhid) - (and in a narration: Mercy) -, and count with the fingertips, for indeed they will be questioned and made to speak) (1).\nThis is a command to count with the fingertips, justified by the fact that they are (questioned and made to speak). So how does the Sheikh permit for himself, and for people, opposing this explicit command justified by this reason which dictates that nothing can take the place of counting, such as counting with beads or pebbles, due to the absence of the reason (Illah) in them!!\nFrom the foregoing, it becomes clear to the insightful person that the Sheikh was unable to weaken the significance of the two previous indicators which I made evidences for the invalidity of the 'Subha' Hadith. Thus, they are safe from criticism and establish their indication most perfectly.\n\nA Third Indicator of the Invalidity of the Subha Hadith:\nFurthermore, I believe that what has passed is sufficient to convince the Sheikh of the invalidity of this Hadith in terms of its meaning. Nevertheless, I add to what preceded another indicator of invalidity, so I say:\nIt came in 'Lisan al-Arab' the following text: 'And (Al-Subha) are the beads with which the glorifier counts his Tasbih, and it is a post-classical (Muwallada) word.'\nAnd in Sharh al-Qamus by Al-Zabidi: 'It is a post-classical word, said Al-Azhari. And our Sheikh said: It is not from the language in anything, and the Arabs did not know it. It only occurred in the first generation as an aid to Dhikr, a reminder, and an activation.'\nIt is established in the sciences of language and its literature that 'Al-Muwallad' is what was created by the Muwalladin whose words are not used as proof, and they are those who existed after the first generation (2). This indicates clearly that this Hadith (What a good reminder is the Subha) is fabricated after the first era because the word 'Subha' is not from his language, peace and blessings be upon him, nor from the language of his companions by the testimony of the people of...",
    "foot_note": "1. (1) It is an authentic Hadith according to the Sheikh as indicated by his arguing with it, especially since Al-Hakim and Al-Dhahabi authenticated it and Al-Nawawi and Al-Asqalani graded it Hasan, and he cannot oppose them as indicated by his action in this treatise.\n2. See 'Al-Muzhir fi Ulum al-Lugha wa Anwa'iha' by Al-Suyuti (1/304) and 'Khizanat al-Adab' (1/4).",
    "book_id": "151039",
    "new_page_number": 17
  },
  {
    "serial_number": "301783",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 14,
    "volume_number": 1,
    "text": "...knowledge of language. This is among the indicators Al-Hafiz pointed to by his saying: 'And among the indicators by which the Fabricated is recognized is what is taken from the state of the narrated text.' So it becomes clear that the 'Subha' is invented in essence and name, and that indicates the fabrication of this Hadith definitely, and Allah is the Granter of success.\n\nIdentifying the Fabricator of the Hadith:\nIf it is said: Then who is the fabricator of this Hadith? I say: I had mentioned in the 'Article' wherein I verified the saying regarding the fabrication of this Hadith the possibility that its flaw is Abdul-Samad bin Musa Al-Hashimi the weak one. Then it became clear to me now that the one accused of it is 'Muhammad bin Harun bin Isa bin Al-Mansur Al-Hashimi,' for he used to fabricate Hadith as will come. However, I had mentioned there that he is 'Muhammad bin Harun bin Al-Abbas bin Abi Ja'far Al-Mansur' and that he is of the people of cover and virtue, relying on the appearance of his lineage like this in Al-Khatib's biography of him, and I overlooked the biography after it which matches the lineage of the translator as appeared in the chain of the Hadith. Al-Khatib said: 'Muhammad bin Harun bin Isa bin Ibrahim bin Isa bin Abi Ja'far Al-Mansur, nicknamed Abu Ishaq and known as Ibn Buraynah... And in his Hadith are many denounced reports (Manakir), and Al-Daraqutni said: He is nothing.'\nYou see that the grandfather of Muhammad bin Harun the narrator of this Hadith is named 'Isa', and so he is in this biography, so it is him. As for the first biography, his grandfather's name is Al-Abbas, which contradicts his name in the Hadith's chain, so it is not him. Rather, it is this impugned one. Ibn Asakir accused him, saying as in 'Al-Lisan': 'He fabricates Hadith,' then he cited a Hadith for him and said! 'This is from his fabrications' (1). Likewise, Al-Khatib accused him, saying after the Hadith referred to (7/403):",
    "foot_note": "1. (1) However, Al-Hafiz disputed Ibn Asakir that the referred Hadith is from the fabrications of this Al-Hashimi, because he was followed up on it. Then Al-Hafiz accused someone else of it. But the witness from Ibn Asakir's speech stands in any case due to his declaration that 'he fabricates Hadith' and that he has fabrications other than this.",
    "book_id": "151039",
    "new_page_number": 18
  },
  {
    "serial_number": "301784",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 15,
    "volume_number": 1,
    "text": "\"'And Al-Hashimi is known as Ibn Burayyah, his Hadith is gone (Dhahib al-Hadith), accused of fabrication.' So the suspicion of fabricating the Hadith is confined to him, and the responsibility of Abdul-Samad bin Musa is cleared of it despite his weakness and narration of denounced reports. The credit for my noticing this reality goes back to an old article of mine discussing this Hadith. So praise be to Allah for His success.\n\nThe Principles Upon Which the Sheikh Based the Authenticity of the Two Pebble Hadiths\nAfter finishing establishing the principles upon which the Sheikh based his judgment of the Hadith as weak, and answering them with what returns upon him with refutation, I return to mention the principles upon which the Sheikh based his authentication of the two Hadiths, then I attack him with refutation, saying:\nThe Sheikh mentioned:\n1 - 'The weakness of a text is not necessarily implied by the weakness of a chain, due to the possibility that it has another authentic chain, unless a Hafiz researches and his research leads to the judgment that nothing exists for it except this weak one. Then, the Hadith is judged weak due to the weakness of its chain' (p. 20).\n2 - That an unknown narrator (Majhul), if one of the Imams of disparagement and validation validates him (Zakkah) along with the narration of one person from him, is accepted (p. 23), even if this validator is Ibn Hibban (p. 26).\n3 - 'Gharabah (Strangeness) according to Al-Tirmidhi applies to several meanings that may coexist with correctness (Sahhah) as explained in the conclusion of Al-Jami' p. 27.'\n\nThe Answer to These Principles\nAnswering these three principles, I say:\n1 - This rule is accepted if the Sheikh does not intend by it more than what he quoted from Al-Nawawi p. 21, which is his saying: 'If you see a Hadith with a weak chain, you have the right to say it is weak with this chain, but do not say it is weak in text merely due to the weakness of that chain unless an Imam says it was not narrated through an authentic path, or that it is weak while explaining its weakness.'\nClearer than that is the saying of Al-Hafiz Al-Iraqi in the explanation of his Alfiyyah (1)",
    "foot_note": "1. (1) His eminence the Sheikh quoted it in his handwritten treatise (p. 3) which is summarized from his printed treatise and contains few additions. I came across it after the Sheikh had printed its original and published it to the people! That is why I made my refutation on it because the handwritten one is part of it.",
    "book_id": "151039",
    "new_page_number": 19
  },
  {
    "serial_number": "301785",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 16,
    "volume_number": 1,
    "text": "\"'If you find a Hadith with a weak chain, you may say: This is weak, meaning the chain. You may not mean by that its absolute weakness based on the weakness of that path, for perhaps it has another authentic chain by which the Hadith is established. Rather, the permissibility of declaring its absolute weakness depends on the judgment of an Imam among the Imams of Hadith that it has no chain by which it is established, with that Imam describing the explanation of the aspect of weakness explicitly.'\nAdded to the above is the statement of Al-Hafiz Ibn Hajar which the Sheikh cited following Al-Nawawi's previous statement: 'Likewise, if the statement of an Imam among the Imams of Hadith is found asserting that so-and-so was unique in narrating it, and the later scholar knows that the mentioned so-and-so has been weakened, then what prevents judging it as weak?!'\n\nPermissibility of Weakening a Hadith restrictively or absolutely\nWe have benefited two things from these texts:\nFirst: The permissibility of weakening a Hadith whose chain is weak, a weakening restricted to this chain, not absolutely, due to the possibility mentioned in Al-Iraqi's speech.\nSecond: It is permissible for the likes of us among the later scholars to weaken the Hadith absolutely based on the assertion of an Imam that one of the narrators was unique in it, and we have known his weakness.\nIf the noble reader contemplates these benefits, the prejudice of his eminence the Sheikh against me becomes clearly evident when he attributed to me (p. 20) opposing this rule and 'following personal desire'! While I never opposed the rule at all in all that I write of these 'Articles'; rather, my weakening of Hadiths revolves around it.\nAs for the first matter, it is apparent, and all scholars have proceeded upon this in their referencing (Takhrij) of Hadiths. If they find a Hadith with a weak chain, they say: 'Its chain is weak' or 'This is a weak Hadith' meaning its weakness regarding this specific chain. The possibility that it has another chain does not prevent them from that, because this possibility is not incumbent upon a person except from a theoretical perspective. As for the practical perspective, the Hadith with a weak chain is like the absolutely weak Hadith which scholars have declared weak and lacking another path.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 20
  },
  {
    "serial_number": "301786",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 17,
    "volume_number": 1,
    "text": "Clarifying this for you is that his eminence the Sheikh stated - as preceded - that the Hadith 'What a good reminder is the Subha': 'is weak with this chain.' So we ask him: Do you treat this Hadith as an absolutely weak Hadith, so you do not permit using it as proof or asserting its attribution to the Prophet, peace and blessings be upon him, or not? My predominant thought is that his answer will be affirmative, and that he treats it only as absolutely weak. Based on this, we ask him the second question: Is it possible that it has another chain or not? Predominant thought also suggests the answer will be affirmative. Then we say: Just as this possibility did not affect the weakness of your Hadith here, likewise it does not affect the weakness of the Hadiths I weaken due to the weakness of their chains. It would only affect that if you demonstrate my error in weakening them or my overlooking some of their authentic paths. But as for applying the mentioned possibility to them, no. Because it is impossible to imagine a Hadith weakened due to its chain without the mentioned possibility being applicable to it. If it were said that this possibility should be counted and considered a barrier to weakening the Hadith, reliance and trust in the sayings of scholars in weakening Hadiths would fall, and even in their authenticating authentic Hadiths, because it is possible, as some said, that some of their narrators erred or intentionally lied and this did not appear to the Muhaddithin! The corruption of this (saying) is not hidden from the intelligent observer.\nAs for the second matter, the absence of my opposition to the mentioned rule is clearer and more apparent, because our weakening in this case is based on the foundation of singularity (Tafarrud) asserted by some Imams. The two Hadiths we are discussing are among those Al-Tirmidhi declared some narrators were unique in narrating.\nAs for the first Hadith, which is the Hadith of Sa'd, Al-Tirmidhi said about it (4/278 Sharh al-Tuhfa): 'This is a Hasan Gharib Hadith from the Hadith of Sa'd.' This means it has no other chain from Sa'd. Al-Hafiz Ibn Kathir said in 'Ikhtisar Ulum al-Hadith' in 'Knowledge of the Gharib' (p. 187): 'The Gharib is what is uniquely narrated by one person; he may be trustworthy, or he may be weak, and each has its ruling.'\nI say: This Hadith is from the 'Weak' section because its narrator (Khuzaimah) is unknown (Majhul) as I mentioned there in the 'Article', and further explanation for it will come here.\nAs for the second Hadith, which is the Hadith of Safiyyah, Al-Tirmidhi also said (4/274):",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 21
  },
  {
    "serial_number": "301787",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 18,
    "volume_number": 1,
    "text": "\"'We do not know it except from this aspect...' This is more explicit in indicating the uniqueness of one of its narrators in reporting it than his previous statement regarding the first Hadith, as is apparent. It is from the 'Weak' section as well due to the uniqueness of Hashim bin Sa'id Al-Kufi in narrating it, and he is weak as I mentioned there also. Al-Tirmidhi also weakened it by saying 'Gharib' and by saying: 'And its chain is not known (Ma'ruf).' So it is proven from this that my weakening of the two Hadiths is based on the rule of Hadith, not outside of it. Thus, what his eminence the Sheikh hummed about regarding it falls!\n\nMy Methodology in Weakening Hadiths:\nFurthermore, when I weaken a Hadith, I do not restrict myself to weakening it merely because I saw this weak path for it. Rather, I pursue for that purpose everything my hand can reach of printed or manuscript [sources], seeking help in that from what the Imams and Hafizs said, all out of fear that it might have a path by which the proof is established, so I would fall into error by not being aware of it. I believe this methodology has been sensed by the noble readers in my articles 'Weak and Fabricated Hadiths,' for they often see in a single article of them repeated Hadiths with one meaning, each Hadith mentioned separately from the other with a serial number. This is only to apply this methodology and discuss the chain of each one of them in terms of weakening and disparagement, such that it is rare for anyone to correct me on a path I did not include! I do not believe Allah Almighty tasks us with more than this. Error is something no human is safe from, but he must exhaust his effort to reach the truth. If he hits the mark he has two rewards, and if he errs he has one reward. And Allah the Great spoke the truth: {Allah does not charge a soul except [with that within] its capacity}.\n\nIbn Hibban's Authentication of the Unknown is Not Accepted:\n2 - We quoted in the previous article the Sheikh's second rule, which is accepting the unknown narrator if one of the Imams of disparagement validates him. I say: This rule is not absolute; rather, it is restricted according to the verifying Muhaddithin to when the validator is not lenient in validation, like Imam Ahmad, Al-Bukhari, Abu Hatim, and others. But if he is known for leniency in that based on a rule of his in validation in which he opposed the Imams, then his validation of the unknown is not accepted, and the unknown does not exit anonymity by it! Among those lenient ones is Ibn Hibban Al-Busti, the author of 'Kitab al-Thiqat' (Book of Trustworthy Narrators).",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 22
  },
  {
    "serial_number": "301788",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 19,
    "volume_number": 1,
    "text": "For his school of thought in it is: 'That a man, if the anonymity of his person (Jahalat al-Ayn) is removed by the narration of one person from him, is just (Adl) until disparagement becomes apparent.' This is contrary to what is established in 'Mustalah al-Hadith' that his probity is not established by that, nor even by the narration of two just people from him. Therefore, Al-Nawawi said that 'his narration is not accepted according to the masses' (1). Al-Hafiz Ibn Hajar said in the introduction to 'Lisan al-Mizan' (p. 14) after relating Ibn Hibban's mentioned school: 'This is a strange school, and the majority are against it. This is Ibn Hibban's path in 'Kitab al-Thiqat' which he authored, for he mentions a multitude of those whom Abu Hatim and others explicitly stated were 'unknown'!' Then Al-Hafiz mentioned Al-Khatib's saying: 'Probity is not established by the narration of two.' Whoever wishes may verify it there.\nThis rule of Ibn Hibban is rarely noticed by those occupied with Hadith. Therefore, you see many of them validating a man merely due to Ibn Hibban's validation of him! While someone else might have explicitly stated his anonymity! As preceded from Al-Hafiz. Then these people build upon that the authentication of this validated person's Hadith! Thus appears the danger of ignorance regarding the basis of this rule and that it is rejected! Therefore, the verifiers among the scholars drew attention to it and warned against it. Al-Hafiz Muhammad bin Abdul-Hadi said in 'Al-Sarim al-Munaki' (p. 93): 'It is known that Ibn Hibban mentioned in this book which he compiled on trustworthy narrators a large number and a great multitude of unknown narrators whose conditions neither he nor anyone else knows! Ibn Hibban explicitly stated this in more than one place in this book. He said in the third layer:\n1 - Sahl, narrates from Shaddad bin Al-Had, Abu Ya'qub narrated from him, and I do not know him, nor do I know who his father is!' Thus he mentioned this man in 'Kitab al-Thiqat' and stated explicitly that he does not know him.\nHe also said:\n2 - 'Hanzalah, a sheikh who narrates Mursal reports, I do not know who he is, Ibn al-Mubarak narrated from him from Ibrahim bin Hanzalah from his father.'",
    "foot_note": "1. (1) Tadrib al-Rawi (p. 115).",
    "book_id": "151039",
    "new_page_number": 23
  },
  {
    "serial_number": "301789",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 20,
    "volume_number": 1,
    "text": "3 - 'Al-Hasan Abu Abdullah, a sheikh who narrates Mursal reports, Ayyub Al-Najjar narrated from him, I do not know who he is nor whose son he is'!\nHe also said:\n4 - Jamil, a sheikh who narrates from Abu Al-Malih bin Usama, Abdullah bin Awf narrated from him, I do not know who he is nor whose son he is.'\nIbn Hibban mentioned in this book a large multitude of this type. His method in it is that he mentions whoever he does not know with disparagement, even if he is unknown and his condition is not known. One should be aware of this, and know that Ibn Hibban's validation of a man merely by mentioning him in this book is of the lowest degrees of validation.'\nTherefore, we see the verifiers among the scholars not validating those whom Ibn Hibban was unique in validating. Rather, they explicitly state their anonymity. Al-Dhahabi said in 'Al-Mizan': 'Ayyub from his father, from him Ka'b bin Sur, unknown.' Al-Hafiz said in 'Al-Lisan': 'And Ibn Hibban mentioned him in 'Al-Thiqat' and said: \"Mahdi bin Maymun narrated from him, I do not know who he is, nor whose son he is\"! This statement from Ibn Hibban supports what we went to, that he mentions in 'Kitab al-Thiqat' every unknown person from whom a trustworthy person narrated and who was not disparaged...'.\nFor this reason, we find hundreds of biographies in the book 'Tahdhib al-Tahdhib' by Al-Hafiz Ibn Hajar where he mentioned that Ibn Hibban validated them, yet Al-Hafiz did not rely on him in his book 'Al-Taqrib'; rather, he said regarding each of them that he is unknown. Here are some of them for example:\n1 - Aban bin Tariq Al-Qaysi.\n2 - Bujayr bin Abi Yahya.\n3 - Hatim bin Abi Nasr Al-Qinnasrini.\n4 - Dubarah bin Abdullah Al-Hadrami.\n5 - Tariq bin Abi Al-Hasna'.\n6 - Abdullah bin Abi Bakr bin Zayd bin Al-Muhajir.\n7 - Muhammad bin Habib Al-Jarmi.\n8 - Al-Nu'man bin Ma'bad bin Hawdha Al-Ansari.\n9 - Hisham bin Harun Al-Ansari.\n10 - Yahya bin Abi Salih Al-Madani.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 24
  },
  {
    "serial_number": "301790",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 21,
    "volume_number": 1,
    "text": "All of these and their likes in the hundreds, Al-Hafiz said in the biography of each of them 'Unknown' despite Ibn Hibban's validating them! These are decisive proofs that Ibn Hibban's validation is not relied upon by scholars, and that this rule mentioned by the virtuous Sheikh is not absolute even according to Al-Hafiz Ibn Hajar, to whom the Sheikh attributed its correctness! Let this be memorized, for it is very useful in the context of dispute, especially in what comes of our detailed refutation of the Sheikh.\n\nGharabah (Strangeness) according to Al-Tirmidhi does not coexist with correctness if he explicitly states weakness:\n3 - We quoted from the Sheikh previously that Gharabah according to Al-Tirmidhi... may coexist with correctness. I say: This rule is also not correct absolutely; rather, it is restricted by constraints, the most important of which is if Al-Tirmidhi did not explicitly state the weakness of the Hadith he described as Gharib. Otherwise, in this case, it never coexists with correctness. Here are some examples from his Sunan:\n1 - 'Gabriel came to me and said: O Muhammad, if you perform ablution, then sprinkle [water].' Al-Tirmidhi said (1/71): 'This is a Gharib Hadith, and I heard Muhammad (meaning Al-Bukhari) say Al-Hasan bin Ali Al-Hashimi is Munkar al-Hadith.'\n2 - From Mu'adh bin Jabal who said: I saw the Prophet, peace and blessings be upon him, when he performed ablution, wiping his face with the edge of his garment. Al-Tirmidhi said (1/76): 'This is a Gharib Hadith, and its chain is weak.'\n3 - From Ubayy bin Ka'b raised [to the Prophet]: 'Indeed, there is a devil for ablution called: Al-Walhan, so beware the whispering of water.' Al-Tirmidhi said (1/85): 'A Gharib Hadith and its chain is not strong.'\n4 - From Ibn Abbas raised [to the Prophet]: 'Whoever calls the Adhan for seven years seeking reward, immunity from the Fire is written for him.' Al-Tirmidhi said (1/401):",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 25
  },
  {
    "serial_number": "301791",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 22,
    "volume_number": 1,
    "text": "\"'A Gharib Hadith, and Jabir Al-Ju'fi (meaning the one in its chain) they weakened; Yahya ibn Sa'id and Abdul-Rahman bin Mahdi abandoned him.'\n5 - From Ali bin Abi Talib raised [to the Prophet]: '...do not squat (Iq'a) between the two prostrations.' Al-Tirmidhi said (2/73): 'Gharib, we do not know it except from the Hadith of Abu Ishaq from Al-Harith from Ali, and the people of knowledge have weakened Al-Harith Al-A'war' (1).\nExamples like this are very numerous in Sunan Al-Tirmidhi, and this amount suffices. From them, it becomes clear to the noble reader that the Gharabah mentioned in these five Hadiths and their likes cannot coexist with correctness at all due to Al-Tirmidhi's explicit statement in them of what contradicts correctness as preceded. Rather, Gharabah can coexist with correctness according to Al-Tirmidhi in some Hadiths which Al-Tirmidhi termed Gharib without explicitly stating their weakness or the weakness of their chains, such as the Hadith about which he said (2/57-58): 'Qutaybah narrated to us: Abdullah bin Nafi' narrated to us from Muhammad bin Abdullah bin Hasan from Abu Al-Zinad from Al-A'raj from Abu Hurayrah that the Prophet, peace and blessings be upon him, said: \"When one of you goes to [prostrate], let him kneel in his prayer like the kneeling of a camel.\"' Al-Tirmidhi said: A Gharib Hadith, we do not know it from the Hadith of Abu Al-Zinad except from this aspect.\nI say: This Hadith is authentic because its chain is authentic, its men are all trustworthy men of Muslim except...",
    "foot_note": "1. (1) I say: Rather, it is very weak, for Al-Sha'bi, Ibn al-Madini and others called him a liar. What indicates the falsehood of his Hadith is the affirmation of the Iq'a (squatting) mentioned in it from the Prophet, peace and blessings be upon him, in Sahih Muslim and others. So the supporters of the Sunnah and those who love it should do it sometimes in their prayer.",
    "book_id": "151039",
    "new_page_number": 26
  },
  {
    "serial_number": "301792",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 23,
    "volume_number": 1,
    "text": "Muhammad bin Abdullah bin Hasan, who is known as Al-Nafs Al-Zakiyyah Al-Alawi, and he is trustworthy as Al-Hafiz and others said (1). This example is what can fall under the Sheikh's previous saying: 'Gharabah according to Al-Tirmidhi applies to several meanings that may coexist with correctness.' As for the aforementioned examples and what resembles them, they cannot be included in it. Thus the Sheikh's error appears in his absolute statement firstly, and in his usage and application of it to what is of the type of the five aforementioned examples secondly. An explanation of that will come, Allah willing, shortly.\n\nConfronting the Three Principles with the Sheikh's Speech and Refuting It in Detail\nTo proceed, we have finished discussing the three principles upon which the virtuous Sheikh based his judgment of the authenticity of the two Hadiths of glorifying with pebbles. We have investigated the discussion on them and clarified our opinion regarding them sufficiently, if Allah Almighty wills, to reveal the truth. It is appropriate for us now to return to the two referred Hadiths and debate his eminence the Sheikh regarding what he held onto in authenticating them. So I say:\n\nThe Sheikh's Doubts in Authenticating Sa'd's Hadith and Their Refutation\nAs for Sa'd's Hadith, I had weakened it for two reasons:\nFirst: The anonymity of one of its narrators: 'Khuzaimah', and I quoted it from Al-Dhahabi and Al-Hafiz Ibn Hajar.\nSecond: The confusion (Ikhtilat) of Sa'id bin Abi Hilal', and I quoted it from Imam Ahmad.",
    "foot_note": "1. (1) Benefit: The Hadith has been authenticated with a more complete wording from which it becomes clear that the 'kneeling of a camel' mentioned in it is what most worshippers do when going down for prostration! Which is placing their knees before their hands! For he, peace and blessings be upon him, said: 'If one of you prostrates, let him not kneel as the camel kneels, and let him place his hands before his knees.' Narrated by Abu Dawood, Al-Nasa'i, Al-Darimi, Al-Tahawi in his two books, Al-Daraqutni, and Al-Bayhaqi. Likewise Ahmad and Ibn Hazm, and its chain, Al-Nawawi and Al-Zarqani said is 'Good' (Jayyid). I have discussed the meaning of the Hadith briefly in my book: 'The Prophet's Prayer Described' Second Edition (p. 100 - 101). So the revivers of the Sunnah should love this Sunnah as well and not be deceived by what most people are upon!",
    "book_id": "151039",
    "new_page_number": 27
  },
  {
    "serial_number": "301793",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Sheikh rejected the first matter (p. 19 - 20) saying that Khuzaimah was mentioned by Ibn Hibban in 'Al-Thiqat' (The Trustworthy). He said: 'So he is trustworthy according to him.' And he rejected the second matter (p. 20) by saying: 'It suffices that the Six [Books] narrated from Ibn Abi Hilal'!\nThe answer to his first rejection is that Ibn Hibban's validation is not considered by scholars, as previously explained from scholars in the discussion on the second rule. Therefore, no one other than Ibn Hibban validated this Khuzaimah; rather Al-Dhahabi and Ibn Hajar said about him: 'Not known,' as I mentioned repeatedly. Thus this rejection of the Sheikh falls and collapses. It seems his eminence felt the weakness of his adherence to this validation, and therefore he said: 'So he is trustworthy according to him,' meaning according to Ibn Hibban. For this restriction 'according to him' has an implication if we consider it, so the Sheikh's phrase then implies that Khuzaimah is not trustworthy according to the Sheikh! But it appears he did not intend this implication, evidenced by his reliance on Ibn Hibban's validation and his rejection of my judgment on the anonymity of Kinanah, whose mention will come in the Hadith of Safiyyah; because Ibn Hibban validated him also as will come. Based on this, the Sheikh's saying: 'according to him' is meaningless speech! At that point I ask the virtuous Sheikh: How was it permissible for you to turn away from the speech of verifying scholars who clarified the weakness of Ibn Hibban's validation, such as Al-Dhahabi, Ibn Abdul-Hadi, Al-Asqalani, and others, and you remained holding onto Ibn Hibban's validation as if it were a considered validation?! If you have no knowledge of that, how was that hidden from you while you are in the process of supporting Hadith and its people?! And if it was not hidden from you, with what proof did you oppose these Imams? Then how is this hidden from you, while it appears you follow what I write in this noble magazine regarding clarifying weak Hadiths and my method in that, and I have mentioned repeatedly, sometimes in detail and sometimes briefly, my lack of reliance on Ibn Hibban's validation. So it was befitting of you, having known this opinion of mine, not to refute me with something that is neither from my school nor from the school of scholars before me. Rather, the duty which...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 28
  },
  {
    "serial_number": "301794",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 25,
    "volume_number": 1,
    "text": "...scientific research requires is that you first clarify the corruption of this school which the referred scholars adhered to and which I followed them in, then build upon that the correctness of relying on Ibn Hibban's validation. If you did that, it would then be permissible for you to refute my judgment of a narrator's anonymity, following in that the critical scholars by your adherence to Ibn Hibban's validation of him. But you did not do that, and you will not find a way to do so!\nAs for the answer to his rejection of our weakening the Hadith due to the confusion of Ibn Abi Hilal by his previous saying: 'It suffices that the Six [Books] narrated from him...' I say: The answer is in two parts:\nFirst: Concerning the authors of the four Sunan narrating from him. This is absolutely no proof, because it is known among those occupied with the science of Hadith that the four do not restrict themselves in these books of theirs to narrating from trustworthy narrators only. Rather, they also narrate from the weak, and from the discarded, and some of them from some liars as well! I do not think the Sheikh disputes this, so I will not prolong the speech on it.\nSecond: The Two Sheikhs [Bukhari and Muslim] narrating from him. This appears to be proof for the Sheikh, but it is not so for two reasons:\n1 - It is possible that they narrated from him without being aware of what Imam Ahmad was aware of regarding his confusion. They are excused, indeed rewarded, for narrating from him. But this does not oblige us to turn away from Imam Ahmad's judgment of his confusion, for two reasons established in the science of principles (Usul): First: He who knows is a proof against he who does not know. Second: Disparagement takes precedence over validation. These rules, along with Ahmad's previous saying, all led me to weaken the Hadith due to Ibn Abi Hilal as well, even though I know he is among the men of the Two Sheikhs.\n2 - It is possible that they narrated from him with knowledge of his confusion, and in that case, the presumption regarding them is that they did not narrate from him except what they knew was from his Hadith before his confusion. For among the confused narrators is a group whose Hadith before confusion the meticulous scholars of Hadith were able to distinguish from their Hadith after confusion. Perhaps this is understood by the Two Sheikhs. Ibn Al-Salah said in the Introduction to the Sciences of Hadith regarding knowing those trustworthy narrators who became confused at the end of their lives (p. 391 Aleppo Edition):",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 29
  },
  {
    "serial_number": "301795",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 26,
    "volume_number": 1,
    "text": "\"'The ruling on them is that the Hadith of whoever took from them before confusion is accepted, and the Hadith of whoever took from them after confusion is not accepted, or if his matter is ambiguous and it is not known whether he took from him before confusion or after.' Then he said (p. 412): 'Know that whoever is of this category and his narration is relied upon in the Two Sahihs or one of them, we know in general that this is of what was distinguished and taken before confusion.' Al-Hafiz Burhan al-Din al-Halabi quoted it from him in the introduction to his treatise 'Al-Ightibat bi Ma'rifat man Rumiya bi al-Ikhtilat' then said (p. 3): 'And this is from the goodness of thought regarding them.' In the speech of these two Imams is clarification that among the men of the Two Sahihs is more than one of the confused narrators. So it is not permissible to exonerate them from confusion merely because they are among their men, just as it is not permissible to use their Hadith as proof except after verifying that it is from their Hadith before confusion. Look, O noble reader, how far the speech of his eminence the Sheikh is from correctness. He rejects my claim of Ibn Abi Hilal's confusion merely because he is among the men of the Two Sheikhs, while scholars say that among their men is more than one of the confused narrators! After establishing the confusion of this Ibn Abi Hilal and the lack of clarity regarding whether he narrated this Hadith before confusion, my weakening of this Hadith due to him remains standing, and the Sheikh's rejection of it is flimsy, indeed invalid.\n\nThe Sheikh's Distortion of Scholars' Speech and Accusing Me of Opposing Them!\nThen the virtuous Sheikh - may Allah preserve him - wanted to supply us from his sciences, so he said in his treatise (p. 21) the following text: 'Then I increase you regarding the status of Sa'd's Hadith upon Al-Tirmidhi's grading of Hasan, the authentication of another besides him, namely Al-Hafiz Ibn Hajar (Original: Bin Hajar - without the connecting Alif - and how many errors are in it despite its small size!)...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 30
  },
  {
    "serial_number": "301796",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 27,
    "volume_number": 1,
    "text": "in 'Amali al-Adhkar' and he mentioned that Ibn Hibban mentioned Khuzaimah in 'Al-Thiqat'. He said as in the commentary of Ibn Allan Al-Siddiqi after mentioning its extractors: A Sahih (authentic) Hadith.'\nI say: It saddens me greatly to say: In this quotation from Al-Hafiz Ibn Hajar there is much manipulation and disruptive abbreviation; which resembles Tadlis (deception) that drops its doer from the rank of those relied upon in what they narrate and quote. That is because everyone who comes across this speech quoted from Al-Hafiz, nothing comes to his mind except that the Hadith of Sa'd which contains the mention of date stones or pebbles is according to Al-Hafiz:\n1 - Authentic in itself (Sahih li-Dhatihi).\n2 - Authentic in its entirety, including the glorification with pebbles or date stones.\n3 - That Khuzaimah who is in its chain is trustworthy according to him.\nAll of this is not implied by Al-Hafiz's speech at all when the noble reader stands upon it in its complete text as Ibn Allan mentioned it. He said in his 'Commentary on Al-Adhkar' the following text: 'Al-Hafiz said after mentioning who was mentioned among those who extracted it: A Sahih Hadith, and its men are men of the Sahih, except Khuzaimah, for his lineage and condition are not known, and no one narrated from him except Sa'id, meaning Ibn Abi Hilal. Ibn Hibban mentioned him in 'Al-Thiqat' as is his habit regarding one who was not disparaged and did not bring a denounced report. Al-Hakim authenticated it. The Hadith has a witness from the Hadith of Abu Umamah Al-Bahili that the Prophet, peace and blessings be upon him, passed by him while he was moving his lips. He said: What are you saying O Abu Umamah? He said: I am remembering my Lord. He said: Shall I not tell you of what is more and better than that, night with day, and day with night? You say: Glory be to Allah the number of what Allah created, Glory be to Allah the fill of what Allah created, Glory be to Allah the number of what is in the earth and in the heaven, Glory be to Allah the number of what His Book recorded, Glory be to Allah the fill of what His Book recorded, Glory be to Allah the number of everything, Glory be to Allah the fill of everything, and you say: Praise be to Allah likewise. This is a Hasan Hadith, narrated by Al-Nasa'i in 'Al-Kubra'...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 31
  },
  {
    "serial_number": "301797",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 28,
    "volume_number": 1,
    "text": "...and Ibn Hibban in 'Al-Du'a' from Al-Tabarani from two other aspects from Abu Umamah. End quote' (1).\nThis is the text of Al-Hafiz Ibn Hajar's speech, may Allah Almighty have mercy on him, which the virtuous Sheikh disrupted in his abbreviation, creating an illusion for the reader of what Al-Hafiz did not intend regarding the three issues mentioned shortly before. Rather, what his speech, may Allah Almighty have mercy on him, implies is the opposite. Namely:\n1 - That the Hadith is only authentic due to others (Sahih li-Ghayrihi), not in itself. The difference between the two matters is clear because the Hadith authentic in itself is what is narrated by a precise just person from his like and the connection reaches the Prophet, peace and blessings be upon him, and is not anomalous (Shadh) nor defective (Mu'allal). As for the Hadith authentic due to others, that is not required in it; rather, it is that which has a non-severe weakness in its chain, and has a witness like it or more that did not intensify in weakness. It may be Hasan in itself and rise to the degree of Sahih by a considered witness. This Hadith of Sa'd is only authentic due to others according to Ibn Hajar as implied by his previous speech. That is because after mentioning that it is an authentic Hadith and that its men are men of the Sahih, he excepted Khuzaimah from them and described him as one whose condition is not known, and no one narrated from him except Sa'id bin Abi Hilal. This is exactly what I said in my previous article explaining the weakness of this Hadith quoting Al-Dhahabi in 'Al-Mizan': 'Khuzaimah is not known, Sa'id bin Abi Hilal was unique in narrating from him.' Then I supported it with the statement of Al-Hafiz himself in 'Al-Taqrib': 'Not known.' So a Hadith containing one who is not known is inevitably weak, and it is inconceivable that a beginner in this science, let alone an Imam in it like Al-Hafiz Ibn Hajar, would authenticate its chain in itself. Thus it becomes clear that the Hadith according to him has a weak chain. If this is known, his saying 'the Hadith is authentic' means authentic due to others, and that is because of the witness he cited from the Hadith of Abu Umamah. It is a strong witness without doubt, but does it contain what witnesses to glorifying with pebbles which is the point of disagreement between me and the Sheikh? This is what you will see explained in the second issue, which is:",
    "foot_note": "1. 1 I say: I have come across two paths for it, one narrated by Al-Jurjani in 'Al-Fawa'id' (Folio 166/1), and the other narrated by Abu Mansur Al-Sawwaq the trustworthy in a portion of 'His Hadith' (Folio 2/1), and there is no mention in them either of counting with pebbles or date stones!",
    "book_id": "151039",
    "new_page_number": 32
  },
  {
    "serial_number": "301798",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 29,
    "volume_number": 1,
    "text": "2 - It is not authentic in its entirety. You have learned from the foregoing that the Hadith's chain is not authentic according to Al-Hafiz, so the Hadith is consequently weak, unless a witness is found for it that attests to all the meanings and rulings contained within it. If you reconsider the witness with which Al-Hafiz strengthened the Hadith, you will not find in it glorifying with pebbles or date stones, namely the Hadith of Abu Umamah. Then it becomes clear to you that the Hadith is authentic regarding the multiplication of reward with such words mentioned in it. This is something I do not deny; rather, I indicated acknowledging it when I cited in the article referred to previously the authentic Hadith of Juwayriyah containing: 'Glory be to Allah and His praise, the number of His creation...' (1). Therefore, I did not include the original Hadith of Sa'd nor the Hadith of Safiyyah in 'Weak Hadiths' due to my belief in the reward mentioned in them in general. Rather, I cited them on the occasion of discussing the fabricated Hadith: 'What a good reminder is the Subha' and the connection existing between it and them regarding the mention of pebbles only. So I drew attention on this occasion to the weakness of their chains and the denouncement (Nakara) in one of them so that no one would use them as proof as the Sheikh did. The intention was not to direct towards clarifying the authenticity of the reward mentioned in them, especially since we mentioned there what suffices instead of them in this regard, namely the Hadith of Juwayriyah.\nThe summary of the speech on this issue is that the Hadith of Abu Umamah does not contain glorifying with pebbles or date stones, as is the case in the weak Hadith of Sa'd. Based on that, it should remain upon its weakness in this aspect due to its being devoid of a witness to mend its mentioned weakness. This is clear and not hidden from anyone with two eyes!\n3 - Al-Hafiz's previous speech implied that Khuzaimah who is in the chain of Sa'd's Hadith is not trustworthy according to him, but unknown (Majhul) not known; even if Ibn Hibban validated him. I mentioned previously in the first issue what supports this from the speech of Al-Dhahabi, and indeed from the speech of Al-Hafiz himself in another source from his books, which is his book in which he stated that he judges the narrator with the most correct thing said about him...",
    "foot_note": "1. (1) Perhaps this is what is meant by Al-Tirmidhi grading the Hadith Hasan, and Al-Hakim and others authenticating it, i.e., improving/validating what came in it of the mentioned multiplication. In that case, there is no disagreement between me and them, so it is not valid then to object to me with their words. Reflect fairly.",
    "book_id": "151039",
    "new_page_number": 33
  },
  {
    "serial_number": "301799",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 30,
    "volume_number": 1,
    "text": "...which is 'Al-Taqrib', specifically when described with expressions of varying ranks by the Imams of disparagement and validation, and he did not look in it to Ibn Hibban's mention in 'Al-Thiqat'. Thus the virtuous Sheikh said in his treatise (p. 20) while discussing the weakening of another man whom we might discuss when the occasion arises, Allah willing. Then he ignored all this regarding this Khuzaimah and did not pay attention to Ibn Hajar declaring him unknown in the mentioned book: 'Al-Taqrib' for a purpose in himself not hidden from the intelligent reader. He uses Ibn Hajar's judgment on a narrator as proof if it agrees with his opinion, and does not use it if it contradicts him! Would that this were due to Ijtihad from him and following the rules of Hadith, then we would have excused him, and said he is rewarded in any case. But he only does that following desire and partisanship for his opinion as witnessed by more than one place in this treatise. From that is his saying in it (p. 23): 'If it is said: What is the interpretation of Al-Hafiz Ibn Hajar's authentication of Sa'd's Hadith in Al-Takhrij? I say: It is as if due to Ibn Hibban's validation of Khuzaimah along with narrating his Hadith in his Sahih, the anonymity of person and anonymity of condition were lifted from him according to him.'\nI say: This interpretation is false, and its falsehood is not hidden from the Sheikh himself if he has an atom of knowledge. For how is it permissible for a knowledgeable person to interpret the scholar's speech with an interpretation that contradicts his explicit words? The mentioned interpretation means: That Khuzaimah is trustworthy according to Al-Hafiz, even though he explicitly stated that he is not known as I quoted from him repeatedly. If the Sheikh did not know this saying of Al-Hafiz, we might have excused him as well. But what does the fair person say about him knowing that the Sheikh has seen this saying evidenced by his quoting it from me in his treatise (p. 18 line 1) but he did not address it with an answer at all, as is his habit with every saying that is proof against him!\nHe is like some of those who claim reform in this era among the pseudo-jurists who view the schools of thought (and I do not say only the four) as multiple laws, taking from them what suits their various desires, or what solves their many problems according to their claim, without looking at the saying they chose from the perspective of legal evidence, but from the perspective of alleged interest only! And how can they know...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 34
  },
  {
    "serial_number": "301800",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 31,
    "volume_number": 1,
    "text": "...interest and estimate it according to its proper value if they cannot distinguish between correct sayings and weak ones? Therefore, you see them agreeing with the Sunnah at times, and opposing it at other times, until they sometimes establish what no Muslim before them has said!\nLikewise, we see the virtuous Sheikh selecting from the sayings of scholars, even a single scholar, what achieves his purpose which is refuting me! If he sees in some sayings of this scholar what contains proof for me, and a refutation of him (he turns away from it and distances himself)! As for looking at these sayings through the lens of rules established by scholars, accepting what agrees with them and leaving what contradicts them whether for him or against him, this is what he does not do; because he cannot. This is the assumption about him, and it is the lighter of the two matters! Otherwise, tell me by your Lord how does the Sheikh accept Al-Hafiz's saying in weakening a man and not accept it in weakening another man, were it not for desire or ignorance, may Allah protect us from both!\nA line of poetry just came to mind suitable for the situation, but I saw it more appropriate not to mention it to maintain the scientific style in my refutation of the Sheikh, and to be polite with him, even if he has departed from this style in more than one place in this treatise and others (!) as is not hidden from one who reads it.\nThe summary of the speech on this issue is that Khuzaimah who is in the chain of the Pebble Hadith from the narration of Sa'd is unknown according to scholars, including Al-Hafiz Ibn Hajar himself. Ibn Hibban's validation of him is not considered by them. Therefore, the mentioned Al-Hafiz did not rely on it. I have detailed the reason for scholars not considering Ibn Hibban's validation repeatedly, the last of which was in some previous articles of this refutation, so let whoever wishes refer to it.\nHere is another thing that should be noted, which is that the Sheikh's interpretation of Ibn Hajar's authentication of the Hadith with the interpretation previously quoted from him, and whose invalidity we showed, is another proof from his eminence that he intended by quoting Al-Hafiz's speech in a disruptive abbreviated manner to delude the reader that Al-Hafiz authenticated the Hadith in itself, while he only authenticated it due to others. The difference between the two matters has been explained in the first issue, just as I clarified the fruit of this difference in the second issue, which is that the mention of pebbles and date stones in Sa'd's Hadith is weak.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 35
  },
  {
    "serial_number": "301801",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 32,
    "volume_number": 1,
    "text": "Thus it becomes clear to the noble reader that Al-Hafiz's speech is for us, not against us, and that the virtuous Sheikh returned from it empty-handed! And Allah is the Granter of success, there is no god but Him.\nWith this verification, the truthfulness of the Sheikh in the first half of the judgment he pronounced on himself becomes clear to the intelligent reader by his saying (p. 21) after a useless discussion: 'This is explicit that someone like me and you does not have the function of authentication and weakening.' He was correct in his judgment on himself that he is not qualified for authentication and weakening, because a man knows himself better than others, and Allah the Great spoke the truth when He says {Rather, man, against himself, will be a witness}. In reality, his researches in this treatise and others (!) clearly indicate the correctness of this judgment he issued on himself! This alone is sufficient to eliminate what he went to regarding the authenticity of the Hadith containing Dhikr with pebbles or date stones, because by his own admission he is not qualified for authentication, so it is not accepted from him. If he argues with someone else's authentication of it, the answer is from two aspects:\nFirst: That we have not found until now anyone who authenticated the chain of either of the two Hadiths, such that it would be valid to use all rulings contained in it as proof.\nSecond: That no one explicitly stated the establishment of the mention of pebbles in the Hadith, even a non-intrinsic establishment, meaning valid due to others. This is what we have not seen narrated from anyone whose authentication is trusted.\nAs for his judgment on others that they do not have the function of authentication and weakening, this is something the decision regarding it does not return to him, but to the people of knowledge specialized in this noble science! So this judgment has no importance!\nFrom what preceded, the Sheikh's fallacy appears to the rational person in his saying (p. 22): 'So your opposition to Al-Tirmidhi's grading of Hasan, and Al-Hafiz Ibn Hajar's authentication of it has become clear, and that your speech regarding it has no place of consideration by the judgment of the rules of the science of Hadith.'\nThe matter may need clarification, so I say, apologizing to the virtuous readers for the length:",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 36
  },
  {
    "serial_number": "301802",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 33,
    "volume_number": 1,
    "text": "As for the Sheikh's claim of my opposing Al-Hafiz Ibn Hajar regarding Sa'd's Hadith, it is a false claim, because Ibn Hajar did not authenticate its chain but weakened it. He only authenticated the text of the Hadith due to the witness he mentioned from the Hadith of Abu Umamah, and it does not contain counting with pebbles which the Sheikh authenticates. So this portion of it remained upon its weakness. Detailed discussion on that has preceded, so there is no need to prolong it, the intention is only to alert. So where is their alleged opposition to Al-Hafiz Ibn Hajar?!\nAs for my opposing Al-Tirmidhi's grading of Hasan, the answer is from two aspects:\nFirst: That there is no harm on me if I oppose Al-Tirmidhi in some of his Hasan gradings, indeed in some of his authentications. That is because Al-Tirmidhi is known among scholars for his leniency in that, until Al-Hafiz Al-Dhahabi said: 'Therefore, scholars do not rely on Al-Tirmidhi's authentication.' What Al-Dhahabi said is sensed by the researcher in the sayings of scholars regarding the Hadiths they differed over. I have previously mentioned in my articles 'Weak and Fabricated Hadiths' many Hadiths that Al-Tirmidhi graded Hasan or Sahih while they are weak according to scholars due to the establishment of what scratches their establishment according to them, and that was hidden from Al-Tirmidhi {and above every person of knowledge is one more knowing}. So my opposing him, if established, is nothing except to one who knows the truth by men! Contrary to what is established among scholars that men are known by the truth, so know the truth and you will know the men.\nSecond: That the Sheikh's accusing me of opposing Al-Tirmidhi's grading of Hasan would only be valid if Al-Tirmidhi meant by his saying: 'Hasan Hadith' that its chain is Hasan in itself. Establishing this is like stripping thorns [impossible]. For Al-Tirmidhi defined the Hadith about which he says 'Hasan Hadith' in the conclusion of his book 'Al-Sunan' with what essentially means its chain is not Hasan in itself according to him, but...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 37
  },
  {
    "serial_number": "301803",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 34,
    "volume_number": 1,
    "text": "...Hasan according to him due to its coming from another aspect (1). The text of his words regarding that was quoted by the virtuous Sheikh from some of my comments on page (19) of his treatise. So let his eminence reconsider it if he wishes to verify what we say, and it will appear to him clearly that he is quick to accuse, bold in doing so without right!\nIf this becomes clear to the noble reader, it appears to him that Al-Tirmidhi agrees with me that the Hadith's chain is weak. What remains is looking into Al-Tirmidhi's intent by his saying: 'Hasan Hadith'; does he mean that it is Hasan in all its meanings and the rulings contained in it? Or does he mean some of that? If he meant this second one, then there is absolutely no difference between me and him either, because I say the Hadith is authentic except for counting with pebbles as previously mentioned repeatedly. This is what is preponderant to me; because Al-Tirmidhi cited the Hadith in 'Chapter on the Prophet's Supplication (peace and blessings be upon him) and his seeking refuge at the end of every prayer'. Had he intended the first, he would have convened another chapter for it, as some later scholars did, such as 'Chapter on the Permissibility of Counting Tasbih with Date Stones and Similar Things', or at least he would have cited it in 'Chapter on What Came Regarding Counting Tasbih with the Hand' which he convened in his Sunan, and he would have pointed to it in the chapter by his saying: 'And counting it with date stones and similar things' as that aforementioned group did. But he did nothing of this at all. Rather, he limited himself to citing it in the previous chapter, and I do not oppose him in that as preceded. So whoever claims that counting with pebbles is established according to Al-Tirmidhi, the burden of proof is upon him. It is not permissible to cling to his saying: 'Hasan Hadith' during a dispute, due to the possibility that he does not mean by that...",
    "foot_note": "1. (1) Al-Suyuti said in 'Al-Tadrib' (p. 50): 'Sheikh Al-Islam (meaning Ibn Hajar) said: Al-Tirmidhi distinguished the Hasan Hadith from the Sahih by two things: First, that its narrator falls short of the degree of the narrator of Sahih, indeed even the narrator of Hasan in itself, which is that he is not accused of lying. This includes the covered (Mastur) and unknown (Majhul) (I say: like this Hadith of Sa'd) and similar ones. The narrator of Sahih must be trustworthy, and the narrator of Hasan in itself must be described with precision, and being not accused is not sufficient. He said: Al-Tirmidhi did not deviate from saying 'Thiqat' (trustworthy ones), which is one word, to what he said except to intend the falling short of its narrator from the description of Trustworthy, as is the habit of the eloquent. Second: Its coming from more than one aspect.'",
    "book_id": "151039",
    "new_page_number": 38
  },
  {
    "serial_number": "301804",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 35,
    "volume_number": 1,
    "text": "...the Hadith in its entirety, but rather the portion of it related to the chapter, as previously explained. Supporting this also is Al-Tirmidhi's saying in completing his definition of the Hasan Hadith according to him: 'And it is narrated from other than one aspect similar to that (Nahwa dhalik), so it is according to us a Hasan Hadith.' His saying: 'Similar to that' is like a text stating that he does not mean it agrees with it in all its meanings, otherwise he would have said 'Like that' (Mithla dhalik). The difference between the two expressions is not hidden from a scholar, especially if he has knowledge of this noble science. Thus, what the Sheikh claimed of my opposing Al-Tirmidhi's grading of Hasan and Al-Hafiz Ibn Hajar's authentication of Sa'd's Hadith falls by this verification. It is proven that each of them preceded me in stating the weakness of the Hadith's chain, the first implicitly and the other explicitly, and that the first's grading of Hasan and the other's authentication intended the text of the Hadith in general, not the chain, and that I do not oppose what is in that. And that the mention of date stones or pebbles in it is weak, due to the lack of what witnesses for it, except the Hadith of Safiyyah which is Munkar (denounced) as previously explained when discussing the first Hadith: 'What a good reminder is the Subha.' We increase it in clarification here, saying:\n\nThe Third Hadith\nThen the virtuous Sheikh said (p. 23 - 24):\n'Then you said the following text: Second: From Safiyyah, she said: The Messenger of Allah, peace and blessings be upon him, entered upon me while in front of me were four thousand date stones with which I was glorifying Allah. He said: O daughter of Huyayy, what is this? I said: I am glorifying with them. He said: I have glorified since I stood over your head more than this... Say: Glory be to Allah the number of what Allah created of things. Narrated by Al-Tirmidhi (1) and Al-Hakim via the path of Hashim...",
    "foot_note": "1. (1) The Sheikh said here in a comment: 'Your attributing this wording to Al-Tirmidhi is incorrect, for Al-Tirmidhi's wording is Glory be to Allah the number of His creation, so whoever wishes verification let him browse the original.' I say: I attributed the Hadith to Al-Hakim also as you see, and the wording belongs to him. Such commentary with what has no benefit, rather indicates the Sheikh's rush to criticize merely for the sake of criticism and rioting, not for benefit. Otherwise, what I did is what the practice of Muhaddithin proceeded upon, and were it not for lengthening, I would have brought dozens of examples for that. The alert person suffices with a signal.",
    "book_id": "151039",
    "new_page_number": 39
  },
  {
    "serial_number": "301805",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 36,
    "volume_number": 1,
    "text": "...bin Sa'id from Kinanah the freed slave of Safiyyah from her. Al-Tirmidhi weakened it by his saying: (This is a Gharib Hadith, we do not know it except from this aspect from the Hadith of Hashim bin Sa'id Al-Kufi, and its chain is not known. In the chapter is [a narration] from Ibn Abbas. As for Al-Hakim, he said: Authentic chain, and Al-Dhahabi agreed with him etc. End quote.\nI say: The answer to this grading of Gharib by Al-Tirmidhi which appears to be weakening is that Al-Hafiz Ibn Hajar (1) said in Takhrij al-Adhkar as in Ibn Allan's commentary (p. 45) (2) after referencing it via the path of Al-Tabarani 'A Hasan Hadith'. Al-Tirmidhi narrated it from Muhammad bin Bashar bin Bundar (3) from Abdul-Samad bin Abdul-Warith from Hashim bin Sa'id from Kinanah from Safiyyah, may Allah be pleased with her, and he is Madinan, five people narrated from him, and Ibn Hibban mentioned him in Al-Thiqat. End quote.\nDo you have anything left to cling to after Al-Hafiz became aware of another path for it and graded it Hasan because of it, not because of Al-Tirmidhi's path?'",
    "foot_note": "1. (1) Thus in the original dropping the connecting Hamza from 'Ibn'. A similar instance preceded for the Sheikh as I pointed out in my previous article, indicating it is not a typographical error the Sheikh neglected to correct!\n2. Thus in the Sheikh's treatise, and this is an error from him not the printer because he repeated it as will come shortly. The correct is (1/245).\n3. Thus in the Sheikh's treatise: 'bin Bundar', which is a clear error because 'Bundar' is not the grandfather of Muhammad bin Bashar but rather a nickname for him, and he is known by that among those who have knowledge of this noble science. Do not think, O reader, that this is a typographical error in the Sheikh's treatise - and how many like it are in it! - rather it is an error that occurred in 'Ibn Allan's Commentary' from which the virtuous Sheikh quoted this speech, so he fell into the error as well imitating the printer without knowing! This indicates to us that the Sheikh has no knowledge of the names of narrators and their nicknames. Another example supporting what I mentioned will come.",
    "book_id": "151039",
    "new_page_number": 40
  },
  {
    "serial_number": "301806",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 37,
    "volume_number": 1,
    "text": "I say this is an admission by the Sheikh of the weakness of Al-Tirmidhi's chain for the Hadith, so that spares us the burden of researching it again. It also absolves us from answering what he quoted from Al-Hafiz regarding 'Kinanah, freed slave of Safiyyah' which creates the illusion that Kinanah is trustworthy according to Al-Hafiz. That is not the case; rather he is 'Maqbul' (Acceptable) according to him as I mentioned previously and the virtuous Sheikh in his treatise (p. 26). If he understands from this word 'Maqbul' meaning 'Trustworthy' or similar, then he is definitely mistaken. But we will not debate him on it nor on what he blackened page (25) of his treatise with speech regarding what I quoted from Al-Hafiz concerning the weakening of Hashim bin Sa'id. I say I will not debate him on all this now because it is futile after the Sheikh's admission of the weakness of the Hadith's chain which I weakened following Al-Tirmidhi. Let us look then at the other path for which Al-Hafiz Ibn Hajar graded this Hadith Hasan.\nThe Sheikh said (p. 25) following what I quoted from him just now of Al-Hafiz's speech: 'Then he referenced it from the narration of Khudayj (1) bin Mu'awiyah from Kinanah from Safiyyah similarly and said in it \"And it contained (Original: in it and was!) four thousand date stones; when she prayed the morning prayer she brought them and glorified after that.\" He said: And he narrated it in Al-Du'a from another aspect from Safiyyah. The rest of Al-Tirmidhi's men are men of the Sahih as in Sharh al-Adhkar by Ibn Allan (p. 45) (2).'\nI say: In this speech of Al-Hafiz are two benefits:\nFirst: That Hudayj bin Mu'awiyah followed up Hashim bin Sa'id the weak one, so the suspicion of...",
    "foot_note": "1. (1) Thus in the Sheikh's treatise, which is one of his errors in which he imitated the printer of Sharh al-Adhkar by Ibn Allan! For this word appeared in it as the Sheikh quoted it 'Khudayj' and this is a misspelling (Tashif). The correct is 'Hudayj' with a Damma on the un-dotted Ha and Fatha on the un-dotted Dal then Jim. See the previous comment (p. 515). Hudayj is not used as proof; Ibn Ma'in, Al-Nasa'i and others weakened him.\n2. This is from the Sheikh's writing errors. The correct is (1/245). See the comment on page (512).",
    "book_id": "151039",
    "new_page_number": 41
  },
  {
    "serial_number": "301807",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 38,
    "volume_number": 1,
    "text": "...his uniqueness is removed. I say: But the other defect remains in it, which is 'Kinanah'. You have known his condition from what we cited of scholars' sayings when discussing this Hadith in the context of explaining the fabrication of the Hadith 'What a good reminder is the Subha,' so refer to it if you wish.\nSecond: That the Hadith has another path from Safiyyah.\nThis benefit is what the Sheikh clung to when he boasted with his previous saying: 'Do we have anything left to cling to... etc.'\nIn answer to this I say: Yes, I still adhere to what I held regarding weakening the Hadith's chain; because the proof of its weakness still stands, and it is not permissible to leave it and turn away from it merely for the illusion of an imaginer! What you quoted from Al-Hafiz Ibn Hajar does not imply more than that the Hadith is Hasan due to others. We have explained to you the difference between a Hadith being Hasan in itself and being Hasan due to others in what passed of the discussion on Sa'd's Hadith, so we will not repeat the speech on it. Also, I mentioned repeatedly that I do not deny the virtue of Dhikr mentioned in the Hadith because it appears in Juwayriyah's Hadith in Sahih Muslim. Rather, I denied and still deny counting Dhikr with pebbles or date stones due to its lack of establishment in the Hadith, and due to its contradicting the authentic Sunnah established from him, peace and blessings be upon him, of counting with fingertips. This other path which Al-Hafiz mentioned, he did not mention that the mention of pebbles or date stones occurred in it. It is possible that it is in it, and the opposite is possible. It is known that probability invalidates deduction in places of dispute and argument. So it is proven that you have no proof in the speech of Al-Hafiz Ibn Hajar, may Allah Almighty have mercy on him.\nThe summary of speech on this Hadith is that the Sheikh agrees with me on weakening it from the first path, but he argues for its strengthening by other paths imitating Al-Hafiz Ibn Hajar. But the latter did not mention that the Hadith contains mention of pebbles. So it is not permissible to use his previous general speech as proof for this detailed matter. The Sheikh must - if he wishes - search for the wording of this path and see if this counting is in it. If it is established in it, and is free from what scratches the validity of using it as proof as is the apparent meaning of Al-Hafiz's speech, his claim is proven. Otherwise, without that is stripping thorns.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 42
  },
  {
    "serial_number": "301808",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 39,
    "volume_number": 1,
    "text": "I clarified previously that the virtuous Sheikh Al-Habashi was unable to prove the correctness of the mention of pebbles or date stones in the Hadith of Sa'd and Safiyyah, and that the most he did was prove the correctness of the two Hadiths in general. I mentioned that there is no dispute regarding this amount due to the correctness of that in Juwayriyah's Hadith in Muslim.\nBased on that, I say: My previous judgment that the woman in the story is Juwayriyah and that the mention of date stones in it is denounced (Munkar) still stands, due to the necessity of the non-establishment of the mention of pebbles therein and that regarding the story of Safiyyah. The words the Sheikh blackened in his treatise (p. 26 - 28) do not weaken this judgment, for it is futile speech, because it is based on what he imagined of the correctness of the mention of pebbles or date stones in the Hadith. Since this is incorrect, it is self-evident that his referred speech falls in its entirety.\n\nAttributing to Al-Hafiz What He Did Not Say!\nHowever, in the context of the Sheikh's referred speech came a sentence in which he attributed to Al-Hafiz Ibn Hajar what he did not say. He objected to my previous judgment that it is 'based on unifying the two Hadiths, while Al-Hafiz established their difference.'\nIn answer to this I say: What you attributed to Al-Hafiz, you did not mention the source you relied upon for it. I am certain that this is an understanding from you based on what you imagined that Al-Hafiz's grading the Hadith Hasan means his improving/validating every sentence, indeed every word that appeared in it. The matter is not so, as previously explained with convincing proof. Supporting this is what Ibn Allan mentioned in 'Sharh al-Adhkar' under the aforementioned Hadith of Sa'd with the wording: That he entered with the Messenger of Allah, peace and blessings be upon him, upon a woman and in front of her were date stones or pebbles. The Hadith. Ibn Allan said (1/245): 'The author of Al-Silah said: It is possible that the vague woman in the Hadith is Safiyyah... Al-Hafiz Ibn Hajar said: And it is possible that she is Juwayriyah.'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 43
  },
  {
    "serial_number": "301809",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 40,
    "volume_number": 1,
    "text": "I say: This is a text from Al-Hafiz Ibn Hajar, may Allah have mercy on him, invalidating what the virtuous Sheikh attributed to him of the difference of the two Hadiths. If the matter were as the Sheikh narrated from him, Al-Hafiz would have asserted that the vague woman in Sa'd's Hadith is Safiyyah as explicitly stated in their two Hadiths - as preceded at the beginning of this refutation - due to the similarity of their Hadiths, Al-Hafiz strengthening them both, and the appearance of the mention of date stones in them. He would not have mentioned the possibility of her being Juwayriyah; because her Hadith does not contain the mention of date stones, and it is different from Safiyyah's Hadith in the Sheikh's opinion and in what he attributed to Al-Hafiz due to his misunderstanding!\nThe truth is that Al-Hafiz's statement of the mentioned possibility strongly supports what I went to in the previous article that it does not follow from Al-Hafiz's grading Safiyyah's Hadith Hasan that he validates everything mentioned in it of sentences and words. The same is said regarding his authenticating Sa'd's Hadith. Do you not see that had the matter been contrary to what I held and in accordance with what his eminence the Sheikh imagined, Al-Hafiz would have asserted or at least preferred that the woman is Safiyyah and not Juwayriyah, because the Hadith which Al-Hafiz graded Hasan contains the explicit statement that she is Safiyyah. So Al-Hafiz's refraining from asserting this to mentioning the possibility of her being Juwayriyah is clear evidence from him that he does not rely on every phrase or word appearing in a Hadith that is Hasan due to others. The reason for this was mentioned in the previous article, so let whoever wishes refer to it if he is forgetful.\nThe summary of speech is that if it was permissible for Al-Hafiz not to use as proof some of what came in Safiyyah's Hadith whose chain he graded Hasan, is it not permissible for me not to trust anything else that appeared in it which has nothing in others to strengthen it? Especially since in the authentic Sunnah is what contradicts it, and in the tradition of Ibn Mas'ud is what rejects it as previously explained.\n\nThe Sheikh's Ignorance of Narrator Biographies:\nIt seems the virtuous Sheikh did not want to limit his refutation of me to the Hadith only, but loved to extend it to refuting me regarding the tradition of Ibn Mas'ud referred to earlier. I consider that among...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 44
  },
  {
    "serial_number": "301810",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 41,
    "volume_number": 1,
    "text": "...Allah's subtle plans, so that the realities of souls and their scientific values appear! His eminence said (p. 13): 'And how did he use Ibn Mas'ud's tradition as evidence; with a chain containing Al-Salt who is unknown.'\nI say: This Al-Salt is Ibn Bahram as explicitly stated in the chain of the tradition itself, and the Sheikh himself quoted it from me in his treatise (p. 12). So the Sheikh's judgment of him as unknown is one of the wonders that never cease! That is because it is a statement no one absolutely preceded him in. The man is trustworthy by agreement. Ibn Abi Hatim included his biography in 'Al-Jarh wa al-Ta'dil' (2/1/438) and narrated his authentication from Ahmad and Ibn Ma'in, and from Ibn Uyaynah that he said about him: 'The most truthful of the people of Kufa.' Others also authenticated him like Al-Bukhari and others. So whoever wishes to verify that, let him consult 'Lisan al-Mizan' by Al-Hafiz Ibn Hajar (3/194).\nThis error from the virtuous Sheikh is an example of the many examples that his eminence's knowledge is not to be trusted at all in the science of Hadith and narrator biographies. Righteousness and piety are not sufficient in it as some gullible people might think! Rather, there must be along with that alertness, intelligence, and lack of negligence. For every person occupied with this noble science is aware of what the Muhaddithin said regarding some righteous people! Ibn Adi said: 'I heard Ahmad bin Khalid say: Wahb bin Hafs was among the righteous, he stayed twenty years not speaking to anyone (!) Abu Arubah said: He used to lie excessively. And from Yahya bin Sa'id Al-Qattan who said: \"I have not seen lying in anyone more than in those attributed to goodness and asceticism\"' (1).\nI say: That is due to their excessive negligence and good opinion of everyone who narrates to them or quotes for them from books. I fear the Sheikh has fallen into something like this, for I have learned that he tasks some students who have no knowledge of Hadith and biographies to review some books for him in public libraries...",
    "foot_note": "1. (1) Al-La'ali Al-Masnu'ah by Al-Suyuti (2/470).",
    "book_id": "151039",
    "new_page_number": 45
  },
  {
    "serial_number": "301811",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 42,
    "volume_number": 1,
    "text": "...then he relies on the quotations they present to him, which I hope the motive for error in them is not sectarian hostility and personal hatred, but rather ignorance and negligence only!\nFurthermore, although this Al-Salt is trustworthy, he did not meet Ibn Mas'ud as I had indicated there in the article of the Hadith 'What a good reminder is the Subha.' But this indication did not please the virtuous Sheikh, so he said (p. 13 - 14): 'And what benefit does your saying (regarding Al-Salt being from the followers of the Tabi'in) provide?'\nI say: I do not know how the benefit of this statement is hidden from the Sheikh while he claims knowledge of Hadith and its rules, to the point that he deluded his followers that he is the unique one of his time in this science and others! For they described him as: The scholar, the very learned, the perfect role model, gatherer of the scattered virtues, the great Muhaddith, the skilled Faqih...' And he himself approved these words in some of his treatises, despite his knowledge of his saying, peace and blessings be upon him: 'Throw dust in the faces of praisers'!\nAs for the benefit of my saying this, it is not hidden from a beginner in this science, which is pointing out that the chain is disconnected between Al-Salt and Ibn Mas'ud. Because if Al-Salt is from the followers of the Tabi'in, it implies he did not hear from Ibn Mas'ud. Were it not for my saying this, I would be concealing knowledge, and giving people the illusion of the authenticity of the tradition, and this is not permissible according to us. Even if it were a proof for me, ignoring it would not occur to me.\n\nThe Sheikh's Lack of Fairness:\nThis is what I did regarding this tradition, pointing to its weakness. Yet despite that, his eminence the Sheikh takes me to task for not explicitly stating its weakness as I explicitly stated the weakness of the tradition of Al-Hasan which I mentioned after it there. He says in his treatise (p. 14) this context of my explicit speech in weakening Al-Hasan's tradition:",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 46
  },
  {
    "serial_number": "301812",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 43,
    "volume_number": 1,
    "text": "\"'So what does it profit you, when you have admitted the weakness of its chain? And why did you not disclose the chain of the one before it?'\nAs for my not disclosing the previous tradition and limiting myself to indicating its weakness, it is because there is no weakened man in its chain; rather all its narrators are trustworthy. It only contains the disconnection which was explained just now. So I sufficed with explaining its disconnection alongside the trustworthiness of its men; because some scholars use the disconnected and Mursal as proof if the one sending it (Mursil) is trustworthy, as is the case in this tradition. Among these scholars are the Hanafis, some of whom adopted the Subha as if it were a Sunnah! And this great Companion denies what is less than it!\nAs for the benefit of my citing these two traditions while weakening their chains, it is from two aspects:\nFirst: My using them for support regarding the denial of the Subha.\nSecond: Establishing the proof against the Hanafis with the tradition of Ibn Mas'ud because it is authentic according to their rules, and it is established in the Sharia that it is good to speak to people according to what they understand! Furthermore, Ibn Mas'ud's denial of counting with pebbles is established from him according to us definitively as will be explained. The Sheikh's denial of it only benefits him in revealing the reality of his knowledge of traditions! Accordingly, this tradition from Ibn Mas'ud is authentic due to others according to the Hanafis, Shafi'is, and others, because it is supported by other paths. Perhaps the benefit of this tradition has appeared to the virtuous Sheikh!\nIt was hoped from the Sheikh's fairness that he would appreciate our weakening of these two traditions even though they are proof for us, and that he would announce that in his treatise. And that what is between him and me of disagreement would not prevent him from that, in admission of the truth, and acting upon His saying, Exalted is He: {And do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness}. Because he may know that few people today and before today explicitly state the weakness of their evidence which they cite, and that the concern of most is to argue with what supports their opinions of Hadiths and traditions, whether their chains are established or not. I will not take the reader far in giving examples of what I mentioned. Here is the virtuous criticizing Sheikh himself citing in his treatise (p. 11) the Hadith of Nabit Al-Ashja'i and the Hadith of Umar regarding the hanging pages, using them as evidence that the Prophet, peace and blessings be upon him, encouraged the Companions to act upon what they did not know! Even though they are two Hadiths...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 47
  },
  {
    "serial_number": "301813",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 44,
    "volume_number": 1,
    "text": "...very weak as I explained in the beginning of this refutation. Then here he is arguing to prove that the Subha was known in the era of Umar by saying (p. 10): 'Al-Suyuti extracted in \"Al-Jami' Al-Kabir\" Umar's approval, may Allah be pleased with him, for some who used it.'\nI do not think but that the virtuous Sheikh knows that Al-Suyuti's 'Al-Jami' Al-Kabir' contains authentic narrations, weak ones, and some fabricated. So of what type is this tradition in it, O respected Sheikh? And how was it permissible for you to remain silent about it?! 'And why did you not disclose its chain?!' So when you used this tradition as evidence, you are between two matters with no third: Either you do not know its lack of establishment, or you know. In the first case, how did you use it as evidence while being ignorant of its authenticity? In the second, how was it permissible for you to remain silent about it and not explain its weakness, creating the illusion for readers by your silence that it is established! While you deny my use of Ibn Mas'ud's tradition and others despite my explanation of its weakness?! So which of us is more deserving that he be denied? The one who conceals knowledge or the one who publishes it? This disparity between us suffices you... and every vessel exudes what is in it.\n\nThe Sheikh's Ignorance of the Companions' Traditions:\nI had mentioned in the article where I verified the saying regarding the fabrication of the Hadith 'What a good reminder is the Subha' that the mention of pebbles in Safiyyah's Hadith is Munkar (denounced). Then I said: 'Supporting this is Abdullah bin Mas'ud's denial, may Allah be pleased with him, upon those he saw counting with pebbles. That came from him via paths, one of which preceded. Had that been something approved by him, peace and blessings be upon him, it would not have been hidden from Ibn Mas'ud, if Allah wills.'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 48
  },
  {
    "serial_number": "301814",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 45,
    "volume_number": 1,
    "text": "The virtuous Sheikh acknowledged this deduction of mine based on the mentioned denial of Ibn Mas'ud, but apparently he has no knowledge of this denial. For he said in his treatise (p. 28) after quoting the first part of my previous statement: 'It is said to you: With which chain do you establish this denial from Abdullah bin Mas'ud?'\nI say: With a chain like a mountain in firmness and establishment. The obscurity of such a thing to him shows the rational person the extent of the Sheikh's knowledge of traditions! For this tradition which his eminence points to denying was reported via three paths from Ibn Mas'ud, in three books of Hadith known to its people! But the Muhaddith today is the one who studied the Six Books only or memorized them! Let the virtuous Sheikh check if he wishes verification: 'Kitab al-Zuhd' by Imam Ahmad (p. 358), 'Sunan al-Darimi' (1/68 Damascus edition), 'Hilyat al-Awliya' (4/380 - 381). To complete the benefit, I mention here the most authentic of these paths in chain and the most complete in text, which is in Al-Darimi via the path of Umarah bin Abi Hasan Al-Mazini who said: 'We used to sit at the door of Abdullah bin Mas'ud before the morning prayer. When he came out, we would walk with him to the mosque. Abu Musa Al-Ash'ari came to us and said: Has Abu Abdur-Rahman come out to you yet? (He is Ibn Mas'ud). We said: No. So he sat with us until he came out. When he came out, we stood up to him (1)...",
    "foot_note": "1. (1) Note: It should be known that his saying: 'We stood up to him' (Qumna ilayhi) is not of the type of standing for another out of honor and glorification. There is a big difference between a speaker saying: 'I stood to him' (Qumtu ilayhi) and his saying: 'I stood for him' (Qumtu lahu). The first implies going to him either to receive him or to help him or for other good legitimate purposes. As for saying: 'I stood for him,' it implies standing to glorify and honor him and nothing else. This is not legitimate; rather it is disliked by the Prophet, peace and blessings be upon him. Anas bin Malik, may Allah be pleased with him, said: There was no person more beloved to them than the Messenger of Allah, peace and blessings be upon him, yet they would not stand up for him because they knew of his dislike for that. Narrated by Ahmad and Al-Bukhari in 'Al-Adab Al-Mufrad' and others with an authentic chain upon the condition of...",
    "book_id": "151039",
    "new_page_number": 49
  },
  {
    "serial_number": "301815",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 46,
    "volume_number": 1,
    "text": "...all together. Abu Musa said to him: O Abu Abdur-Rahman, I saw in the mosque just now a matter that I denounced, yet I did not see - praise be to Allah - anything but good. He said: What is it? He said: If you live, you will see it. He said: I saw in the mosque people in circles sitting waiting for the prayer. In every circle was a man, and in their hands were pebbles. He says: Say Takbir one hundred times, so they say Takbir one hundred times. He says: Say Tahlil one hundred times, so they say Tahlil one hundred times. He says: Say Tasbih one hundred times, so they say Tasbih one hundred times. He said: So what did you say to them? He said: I did not say anything to them, waiting for your view or waiting for your command. He said: Would you not have ordered them to count their evil deeds and guaranteed them that nothing of their good deeds would be lost? Then he went on and we went with him until he came to one of those circles and stood over them. He said: What is this that I see you doing?! They said: O Abu Abdur-Rahman, pebbles with which we count the Takbir, Tahlil, and Tasbih. He said: Then count your evil deeds, for I guarantee that nothing of your good deeds will be lost. Woe to you, O Ummah of Muhammad! How fast is your destruction! These are the companions of your Prophet, peace and blessings be upon him, available in abundance. And these are his clothes not yet worn out, and his vessels not yet broken. By the One in Whose Hand is my soul, you are either upon a religion that is more guided than the religion of Muhammad, or you are openers of a door of misguidance! They said: By Allah, O Abu Abdur-Rahman, we intended nothing but good. He said: And how many intenders of good do not reach it! Indeed...",
    "foot_note": "1. = Muslim. So his saying in this narration: 'We stood to him' means going to him. Many scholars, old and new, have neglected this difference between the two expressions. We still hear many arguing for the permissibility of standing for glorification with the likes of his saying, peace and blessings be upon him: 'Stand to your master' (Qumu ila sayyidikum), narrated by Al-Bukhari and others. Indeed, some of them narrate the Hadith with the wording: 'For your master' (Li sayyidikum)! While it is in the Sahih as I mentioned to you: 'To your master,' meaning go to him to help him and bring him down from his mount as indicated by the cause of the Hadith's occurrence. Supporting it and cutting off dispute in it is Ahmad's narration of the Hadith with the wording 'Stand to your master and bring him down,' and its chain is strong. This is a decisive text that standing is not merely for glorification and honor but to bring him down from his mount. This is a benefit I loved not to miss explaining since its occasion arose.",
    "book_id": "151039",
    "new_page_number": 50
  },
  {
    "serial_number": "301816",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 47,
    "volume_number": 1,
    "text": "...the Messenger of Allah, peace and blessings be upon him, told us: 'Indeed, a people will recite the Quran but it will not pass their collarbones.' By Allah, I do not know, perhaps most of them are from you. Then he turned away from them. Amr bin Salama said: We saw the generality of those people attacking us on the day of Nahrawan with the Kharijites.'\nI say: Its chain is authentic; its men are all trustworthy men of Al-Bukhari in his Sahih except Umarah, and he is trustworthy.\nI believe this explanation is sufficient to convince the Sheikh of his error in denying what I attributed to Ibn Mas'ud of his denial of counting with pebbles. After that, he must concede to me using it as evidence for the non-establishment of counting with pebbles in the Hadith of Sa'd and Safiyyah due to what was mentioned shortly before.\nFurthermore, this authentic tradition from Ibn Mas'ud supports my saying which I had said in the 'Article': 'Mentioning Allah Almighty with a specific number not brought by the Wise Lawgiver is an innovation.'\n\nRefuting the Sheikh regarding his Permitting the Restriction of Absolute Texts by his Opinion!\nThe virtuous Sheikh rejected this with a strange evidence I did not imagine would issue from the likes of him! He said (p. 28 - 29): 'I say: Your saying is refuted by the fact that encouragement to increase Dhikr has been authenticated, like the Hadith \"Increase (1) saying La hawla wa la quwwata illa billah\" without restriction to a specific limit. Al-Hafiz Al-Haythami said in \"Majma' al-Zawa'id\" (10/87) from Abu Said Al-Khudri from the Prophet, peace and blessings be upon him, who said: \"Increase in the enduring righteous deeds (Al-Baqiyat Al-Salihat). It was said: And what are they, O Messenger? He said: Takbir, Tahlil, Tahmid, Tasbih, and La hawla wa la quwwata illa billah.\" Narrated by Ahmad and Abu Ya'la, and their chain is Hasan.'\nThe Answer: This Hadith, if authentic - contains nothing but encouragement to increase Dhikr. This is a matter no two people differ on. So where is the proof in it that it is permissible for a Muslim to come to a Dhikr the Lawgiver did not restrict with a number, and restrict it himself?! Is this not legislation from himself which Allah the Blessed and Exalted did not authorize?\nIt is established in the science of Usul al-Fiqh that it is not permissible to restrict what the Lawgiver left absolute, just as it is not permissible to make absolute what He restricted; there is no difference. The absolute runs upon its absoluteness, and the restricted remains upon its restriction. Therefore, the investigating Imam Abu Ishaq Al-Shatibi said in his great book 'Al-I'tisam' (2/94):",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 51
  },
  {
    "serial_number": "301817",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 48,
    "volume_number": 1,
    "text": "\"'Restriction in absolute matters whose restriction is not established by a legal proof is opinion in legislation.'\nHe also said (2/140): 'Chapter: Among the additional innovations (Al-Bida' Al-Idafiyyah) that approach the true (innovation) is that the origin of the worship is legitimate, except that it exits from the origin of its legitimacy [by restricting it] without evidence, under the illusion that it remains upon its absoluteness under the requirement of the evidence. That is by restricting its absoluteness by opinion or releasing its restriction.' Then he brought many useful examples to clarify that, so let whoever wishes to expand on this important research refer to them.\nHe also said in the Fourth Chapter on the Approach of the People of Innovation in Deduction (p. 334):\n'And among them is distorting evidences from their places by taking evidence for a specific context and diverting it to another matter, creating the illusion that the two contexts are one. The explanation of that is that if the legal evidence requires a matter generally related to acts of worship - for example - and the legally responsible person performs it generally as well, such as remembering Allah, supplication, voluntary recommended acts, and similar things where it is known the Lawgiver allowed latitude, the evidence supports his action from two sides: from the side of its meaning and from the side of the righteous Salaf's action upon it. But if the legally responsible person performs that matter with a specific quality, specific time, specific place, or associated with a specific worship, and adheres to that such that it becomes imagined that the quality or time is intended legally without the evidence indicating it, while the evidence is isolated from that meaning used as proof; so if the Law recommended remembering Allah, for example, and a group adhered to gathering for it with one tongue and [one] voice or at a specific known time distinct from other times, there is nothing in the recommendation of the Law indicating this adhered specificity. Rather, there is in it what indicates the opposite. Because adherence to matters not binding legally implies understanding legislation, especially with one who is followed in public gatherings like mosques. If they are manifested this manifestation and placed in mosques like other rituals the Messenger of Allah, peace and blessings be upon him, placed in mosques and similar things like Adhan... they are understood without doubt as Sunnahs if not understood as obligations. So it is more appropriate that the evidence used does not cover them, so they became from this perspective innovations invented thereby.'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 52
  },
  {
    "serial_number": "301818",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 49,
    "volume_number": 1,
    "text": "Therefore, the Jurist Ibn Abidin said in 'Al-Hashiyah' (1/778): 'Specifying Dhikr to a time not brought by the Law is not legitimate.'\nThere is no doubt that there is no difference between specifying Dhikr to a time not reported, and specifying it to a number not reported, for it is all from one category. Whoever does not permit that does not permit this, and vice versa, like his eminence the Sheikh, for his speech is explicit in the permissibility of restricting the absolute number. For he said later (p. 29): 'And is there any harm legally in a person persisting on a specific number of these Dhikrs not decreasing it every day...' So whoever says this, says by the permissibility of specifying these Dhikrs also to a time the Wise Lawgiver did not specify them to. This is a great negligence of what preceded from Imam Al-Shatibi and the Jurist Ibn Abidin. People's ignorance of this rule caused them to fall into many innovations, clinging to generalities into which they introduced by their opinions restrictions and forms for which Allah sent down no authority. I see fit to mention some examples of that from what scholars alerted to as innovations, as a warning to the negligent and a reminder to the believers.\n\nExamples of Innovations the Sheikh is Obliged to Say are Legitimate Contrary to Scholars:\n1 - Adhan for the two Eids.\n2 - Prostration after the Salam of prayer for other than forgetfulness. 'Al-Ba'ith 'ala Inkar al-Bida' wa al-Hawadith' (p. 42), 'Al-Iqtida' by Ibn Taymiyyah (p. 140), 'Hashiyat Ibn Abidin' (1/731).\n3 - Shaking hands after prayers. 'Hashiyat Ibn Abidin' (5/336), 'Al-Madkhal' (2/219).\n4 - Supplication upon completing the Quran in congregation. 'Al-Fatawa al-Hindiyyah' (5/280).\n5 - Gathering of people reciting one Surah, meaning with one voice. 'Al-Ba'ith 'ala Inkar al-Bida' wa al-Hawadith' (p. 58), 'Al-I'tisam' (1/34), 'Al-Muwafaqat' (3/72).",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 53
  },
  {
    "serial_number": "301819",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 50,
    "volume_number": 1,
    "text": "6 - Sending blessings on the Prophet, peace and blessings be upon him, upon amazement. 'Muwafaqat' (3/215), 'Al-Madkhal' (4/100).\n7 - Washing (Ghusl) for the Eclipse prayer and Tawaf and similar things. 'Al-Ibda' fi Madarr al-Ibtida'' (p. 22).\n8 - Adopting a specific vessel for Wudu. 'Sharh al-Tariqah al-Muhammadiyyah' (4/278).\n9 - Adopting specific clothes for entering the toilet. 'Sharh al-Tariqah' (4/260 - 261).\n10 - Specifying the month of Rajab with fasting. 'Al-Ba'ith' (34 - 36).\n11 - Adhering to fasting the middle day of Sha'ban and standing its night. 'Al-I'tisam' (1/34).\nThis is a drop in the ocean of what scholars judged as innovations which are not permissible to worship by. As you see, each one of them falls under a general text, like encouragement to remember Allah Almighty, supplication, sending blessings on the Prophet, peace and blessings be upon him, and similar acts of obedience. Yet, they exited from being obedience to innovation due to the restriction and specification that adhered to them without a legal text.\nThe summary of speech is that these examples and what resembles them, it is not possible for a scholar to say they are legitimate. So if the virtuous Sheikh sees claiming their approval as implied by his previous speech related to the permissibility of Dhikr with a specific unreported number, he has strayed far from correctness, and opposed the sayings of trustworthy scholars. Foremost among them is the Companion of the Messenger of Allah, peace and blessings be upon him, Abdullah bin Mas'ud who denied restricting absolute Dhikr to an unreported number, just as he denied counting with pebbles as preceded.\nFinally, I direct a question to his eminence, the answer to which from him will be the decisive factor in this issue. I say:\nIs it permissible, O virtuous Sheikh, to pray the regular Sunnah prayers in mosques in congregation? If you say: It is not permissible - and this is what is thought of you - then say: Why is it not permissible when it falls under general texts like his saying, peace and blessings be upon him: 'Allah's Hand is upon the congregation'? If you say: Because...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 54
  },
  {
    "serial_number": "301820",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 51,
    "volume_number": 1,
    "text": "...the Messenger of Allah, peace and blessings be upon him, did not do it, we say: You spoke the truth. So it is binding upon you not to permit Dhikr with a specific number that was not reported; because the Messenger of Allah, peace and blessings be upon him, did not do it even if it enters into the absolute text. The absolute text here does not include Dhikr described with a description that was not reported, just as the generality of his saying: 'Allah's Hand is with the congregation' did not include the congregation of Sunnah prayers due to being characterized by a description that was not reported. If you differentiate between the two matters, you are contradictory, and this is what we do not want for you nor for any Muslim.\nI hope that in what preceded is what clarifies for you the path that facilitates for you returning to correctness, Allah willing, and He is the Guide.\n\nWeakness of the Previous Hadith:\nBefore I finish this research, I must point out that the Hadith of Abu Said Al-Khudri whose chain the Sheikh quoted as Hasan from Al-Haythami - as preceded - is not Hasan; because it is in Al-Musnad and others from the narration of Darraj Abu Al-Samh from Abu Al-Haytham from Abu Said Al-Khudri. Darraj narrates many denounced reports (Manakir) as Al-Dhahabi said. Al-Hafiz Ibn Hajar said: 'Truthful (Saduq), in his Hadith from Abu Al-Haytham there is weakness.'\nI say: And this is from it as you see. My familiarity with the Sheikh is that he imitates Al-Hafiz Ibn Hajar in disparagement and validation. So this is proof against him in his grading as Hasan a chain containing a weak narrator by Al-Hafiz's admission. But the Sheikh has no concern with verification. Rather, whenever he found a Hadith containing what refutes his opponent according to his claim, he clung to it even if it was very weak as preceded in the Hadith of the Hanging Pages. So how could he not cling to the likes of this if some graded it Hasan as in this Hadith?!\nThis Darraj is the owner of the Hadith 'Increase the remembrance of Allah until they say: Madman.' Discussion on it will come, Allah Almighty willing, in the articles of 'Weak Hadiths'.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 55
  },
  {
    "serial_number": "301821",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 52,
    "volume_number": 1,
    "text": "Adherence of Some Sheikhs to the Subha Instead of Counting with Fingertips!\nThen the Sheikh denied my saying: 'If there were no bad thing in the Subha except one, which is that it eliminated the Sunnah of counting with fingers or nearly did, [it would suffice in rejecting it].' He claimed it is contrary to reality. He said (p. 30): 'We still see people, most of them glorify after prayers with fingers...'\nI say: If this is true, the credit for that goes to the callers to the Sunnah who encourage people to maintain it and turn away from everything that opposes it, even if some people call it a good innovation! However, this denial of the Sheikh does not apply to me because I did not intend by this statement all people, and there is nothing in my speech indicating that. Rather, I intended those whom people think are the most eager of creation for virtues, namely the Sheikhs and their likes. The proof for that is the completion of my statement which the Sheikh quoted truncated: 'For I rarely see a Sheikh counting Tasbih with fingertips.'\nBut the Sheikh - may Allah heal him and forgive him - proceeded in his refutation of me to take from my speech the amount that suits him so his refutation of me is valid, and turns away from the complete speech which, if the reader stood upon it, it would appear to him immediately that the Sheikh's refutation of me is invalid.\nSo does the Sheikh say regarding this statement of mine after quoting it completely with clarification of the intended meaning; that it is contrary to reality also? If he says that, he has been stubborn. For it is unfortunate to say: The common people believe righteousness lies in the carriers of prayer beads, due to their belief that the Subha is a manifestation of perfection. How not, when this virtuous Sheikh authors this treatise in refutation of me, one of its names (and multiplicity of names indicates the honor of the named!): 'Verification of the Clarification in Proving the Prayer Beads of the People of Faith.' Even though he was unable to prove the root which is glorifying with date stones and pebbles, so how can he not be unable to prove the branch, which is glorifying with the Subha?! Can the shadow be straight when the stick is crooked?!\nFurthermore, if the virtuous Sheikh says: Most people glorify with fingertips, it is an admission from him that fewer people glorify with the Subha. So I say: Are there not among these many of the elite who...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 56
  },
  {
    "serial_number": "301822",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 53,
    "volume_number": 1,
    "text": "...undertake guiding people and directing them. So why are these keen on the Subha despite containing 'leaving the better option which is counting with fingertips' as the Sheikh admitted in his treatise (p. 15). If his eminence authors a treatise supporting the Subha while it is by his admission less preferable (Mafdulah), why does he not address in it a word to those keen ones - and how do I know, perhaps the Sheikh himself is among them! - calling them to turn away from it, and advising them to hold fast to what is better, which is counting with fingertips? Or is the purpose of authoring it - as some talk about - supporting some Sheikhs who carry prayer beads by refuting Nasir al-Din who calls to reviving the Sunnah and killing innovation! I hope this is not the Sheikh's purpose in authoring it, although we insist on holding him accountable for omitting that word and advice, because the treatise without it gives a result the Sheikh does not approve - I think - which is those people continuing on the less preferable and abandoning the preferable, and this is not permissible without disagreement that I know.\nThen the Sheikh said: 'And do you know anyone of the Salaf who opposed the Subha with your opposition, reaching you with an authentic chain?'\nI say yes, namely Ibn Mas'ud, may Allah be pleased with him. He opposed what is less than the Subha, which is counting with pebbles, and considered the doers holding onto the tail of misguidance! As we presented with an authentic chain from him. {So is there any who will remember?}?\nAmong the Tabi'in are those who went to the extreme in denying the Subha to the degree that they considered twisting the string for the Subha a generic evil! Is there in this what is more eloquent in denying the Subha itself?! Imam Ibn Abi Shaybah narrated in 'Al-Musannaf' (2/89/2): Hamid bin Abdul-Rahman narrated to us from Hasan from Ibrahim bin Al-Muhajir from Ibrahim who used to forbid his daughter from helping women in twisting the strings of Tasbih with which one glorifies!\nI say: This is a good (Jayyid) chain, its men are all trustworthy men of Muslim. Hasan is Ibn Salih bin Salih bin Hayy Al-Thawri, and Ibrahim is Ibn Yazid Al-Nakha'i the famous Jurist graduated from the school of Imam Abu Hanifa, may Allah Almighty have mercy on him. If this was the opinion of the mentioned Imam regarding twisting the strings of the Subha, what would be his opinion regarding the Subha itself? No doubt it is a recognized evil (Munkar), indeed the severest denial.\nThen he said: 'So if you do not find that, then with whom are you?'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 57
  },
  {
    "serial_number": "301823",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 54,
    "volume_number": 1,
    "text": "I say: We have found that for you from more than one of the Salaf contrary to what you hoped. Does that convince you? Then suppose I do not know anyone from the Salaf who opposed the Subha, what is the value of that if I oppose it only because it opposes the Sunnah, and the best guidance is the guidance of Muhammad, peace and blessings be upon him, and it is invented by agreement. Is it a condition according to the people of knowledge and reason in denying individual innovations that we have a transmission (with an authentic chain) from one of the Salaf denying them innovation by innovation? This is something no one who has smelled the scent of knowledge says! Thus the last sentence of your speech related to the Subha in your treatise falls.\nTo Allah is the complaint regarding wasting time and blackening paper about it, while the Sheikh agrees with us that the best is counting with fingertips as preceded repeatedly. So come, O virtuous Sheikh, let us call people to what we agreed upon, and excuse one another in what we differed on, provided the goal of everyone is eagerness to revive the Sunnah and kill innovation. May Allah have mercy on he who said:\nAnd the best of religious matters is what was Sunnah... And the worst of matters are the newly invented innovations.\n\nConclusion Regarding Who is Permitted to Authenticate and Weaken:\nThen the virtuous Sheikh convened a 'Conclusion' regarding 'Who has the right of authentication and weakening in Hadith, and who does not; and who is the Hafiz.' He claimed that 'Authentication and weakening are the function of the Hafiz and his specialty, no one else.' Then he quoted some words defining the Hafiz. Although these words differ and do not give a comprehensive exclusive definition of 'Al-Hafiz' - rather their difference indicates the matter is broad - what the Sheikh quoted from Al-Hafiz Al-Mizzi supports that. He said: It returns in that to the people of custom (Urf). Had there been a definition agreed upon among them, Al-Hafiz would not have referred to the people of custom, especially since they are few by his admission. Similar is the saying of Ibn Sayyid al-Nas: 'As for what is narrated from some of the early scholars saying: \"We did not consider anyone a scholar of Hadith who did not write twenty thousand Hadiths from dictation,\" that was according to their time.'",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 58
  },
  {
    "serial_number": "301824",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 55,
    "volume_number": 1,
    "text": "In it is an indication that these definitions are specific to their times and that it is not binding on those after them to adhere to them. Whatever the case, those words agree in general that the degree of 'Al-Hafiz' is among the highest degrees specific to the Muhaddith. Therefore, it became rare among the later scholars for anyone to reach it. Sheikh Ahmad Muhammad Shakir said in 'Al-Ba'ith Al-Hathith' (p. 179): 'As for Hifz (Memorization), its trace was cut off and ended with Al-Hafiz Ibn Hajar Al-Asqalani, may Allah have mercy on him. Then Al-Sakhawi and Al-Suyuti approached being Hafizs, then no one remained after them. Who knows: perhaps the Islamic nations will regain their glory, and return to their religion and sciences. No one knows the unseen except Allah. The Messenger of Allah, peace and blessings be upon him, spoke the truth: Islam began as a stranger and will return as a stranger as it began.'\nI say: But this does not prevent those specialized in the science of Sunnah from filling this deficiency by seeking help from the writings of the Hafizs themselves and their collections, especially if he gathers their sayings and researches regarding a single Hadith and the paths they mentioned for it. By that, he compensates for what he missed of memorization which used to help the early ones among the Hafizs in verification and precision. Indeed, he might even correct some of them by that. As we see in the researches of some investigators of the present era like Sheikh Ahmad Shakir the Egyptian and others like the scholars of India, may Allah bless them... However, there is nothing in those words indicating that authentication and weakening are the function of the Hafiz only.\nAs for the Sheikh's using as proof what he quoted (p. 36) from Al-Bulqini that he said: 'Since the Hasan is intermediate between the Sahih and the Weak according to the observer, it was something that strikes in the soul of the Hafiz...' The Sheikh said: 'In it, as you see, is the condition of Hifz (being a Hafiz) in grading Hasan and that it is from the characteristics of the Hafiz.'\nI say: Understanding conditionality from this phrase is something we do not envy the Sheikh for; because the mention of 'Al-Hafiz' in it is not a restrictive constraint, evidenced by the fact that it may strike in the soul of one who...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 59
  },
  {
    "serial_number": "301825",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 56,
    "volume_number": 1,
    "text": "...is below the Hafiz, like 'Al-Muhaddith' for example, and he is among those who have the right to speak on defects, death dates, and chains as Al-Subki said (1). Supporting it is that none of the scholars explicitly stated the conditionality of 'Al-Hafiz' in 'Authentication' as the Sheikh claimed. All they conditioned in that is knowledge and competence, which is what the Sheikh himself quoted from Al-Nawawi, may Allah have mercy on him, that he said regarding 'Authentication': 'The most apparent to me is its permissibility for one who is enabled and whose knowledge is strong.' Similar is the saying of Al-Suyuti in the treatise 'Al-Tanqih fi Mas'alat al-Tashih': 'Sheikh Ibn Al-Salah mentioned that the door of authentication was closed in these times. Al-Nawawi opposed him, and everyone who came after him from the Hafizs up to Al-Hafiz Ibn Hajar. They objected to Ibn Al-Salah in his article, and permitted authentication, and that it is not cut off nor prevented for one who has the competence for that. Then some of them refuted Ibn Al-Salah's speech saying he has no predecessor in what he said. Some refuted it saying it is based on the saying of the permissibility of the era being devoid of a Mujtahid, which is a fallen rejected saying. Some refuted it saying the people of Hadith in Ibn Al-Salah's era and after him continued on authentication. They authenticated Hadiths no one preceded them in authenticating, such as Abu Al-Hasan Ibn Al-Qattan, Al-Diya' Al-Maqdisi, Ibn Al-Mawwaq, Al-Mundhiri, Al-Dimyati, Al-Mizzi, Taqi Al-Subki, and others. Ibn Hajar prolonged the discussion in his Nukat with Ibn Al-Salah regarding that.'\nAl-Hafiz Ibn Kathir said in 'Ikhtisar Ulum al-Hadith' (p. 29) essentially: 'It is permissible for the one deeply versed in this affair to proceed to judge the authenticity of much of what appeared in the Musnads, Mu'jams, Fawa'id, and Juz's of Hadith, even if a Hafiz before him did not state its authenticity, in agreement with Sheikh Al-Nawawi and contrary to Sheikh Abu Amr' (meaning Ibn Al-Salah).\nSheikh Ahmad Shakir commented on it saying:",
    "foot_note": "1. (1) See Al-Tadrib (p. 6), and supporting it is the saying of Ibn al-Jawzi in it (p. 99).",
    "book_id": "151039",
    "new_page_number": 60
  },
  {
    "serial_number": "301826",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 57,
    "volume_number": 1,
    "text": "\"'Al-Iraqi and others refuted this statement of Ibn Al-Salah and permitted whoever is enabled and whose knowledge is strong to judge authenticity or weakness on a Hadith after examining its chain and defects, and this is the correct view. What I see is that Ibn Al-Salah went to what he went to based on the saying of preventing Ijtihad after the Imams. Just as they prohibited Ijtihad in Fiqh, Ibn Al-Salah wanted to prevent Ijtihad in Hadith. Far from it! For the saying preventing Ijtihad is a false saying; there is no proof for it from the Book or Sunnah, nor will you find a semblance of evidence for it.'\nI say: The words of all these Imams agreed that the only condition for one who authenticates and weakens is to be enabled in the science of Hadith, knowing its defects and men. None of them addressed - even by hint - the condition claimed by the Sheikh. That indicates it is a fallen condition of no consideration, and that the Sheikh claims things that have nothing to do with 'Mustalah', and would that he sufficed with that, but he attaches them to the science of Mustalah and accuses his opponent of ignorance.'\nWhat indicates to the rational person the invalidity of this condition and that no one said it before the Sheikh is the practice of scholars in all Islamic lands contrary to it, like Ibn Iraq the author of 'Tanzih al-Shari'ah al-Marfu'ah 'an al-Ahadith al-Shani'ah al-Mawdu'ah', Abdul-Ra'uf al-Munawi the author of 'Fayd al-Qadir Sharh al-Jami' al-Saghir', Abu al-Hasanat al-Lucknawi the Indian the author of many useful books, Sheikh Anwar al-Kashmiri the author of 'Fayd al-Bari 'ala Sahih al-Bukhari', Al-San'ani, Al-Shawkani, and many others in every region and city whom counting cannot encompass. Imam Al-San'ani explicitly stated what we hold in his treatise 'Irshad al-Ibad ila Taysir al-Ijtihad' saying (p. 21): 'It has been established for you by what we cited and clarified for you by what we verified that the observer in these ages has the right to authenticate, weaken, and grade Hasan, as the great Imams before him did. For the giving of your Lord was not restricted, and His extended favor is not limited to the predecessor...'.\nThis Al-San'ani is from the scholars of the twelfth century, and I do not think the Sheikh believes Hifz (Hafiz status) for anyone...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 61
  },
  {
    "serial_number": "301827",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 58,
    "volume_number": 1,
    "text": "...after Al-Hafiz Ibn Hajar except perhaps his student Al-Sakhawi or Al-Suyuti. So if Al-San'ani permitted for those in his era authentication and weakening, while there was no Hafiz in it by everyone's admission, his speech is clear evidence of the invalidity of the Sheikh's condition. Thus the desired point is proven. So may Allah have mercy on him who leaves argument and persistence.\nFurthermore, if the permissibility of authentication is established for the enabled one, then weakening is also permissible for him consequently, there is no difference. Rather, perhaps this is more appropriate, for authentication necessitates knowledge of the absence of all defects explained in the Mustalah, while for weakening, standing upon a damaging defect suffices. Therefore, the one who prevented authentication permitted it, namely Abu Amr Ibn Al-Salah. He said in 'Al-Muqaddimah' (p. 18) after mentioning the leniency of Al-Hakim in his Mustadrak: 'So the best is to take a middle path regarding him, so we say: What he judged as authentic and we did not find that in it for other Imams, if it is not of the category of Sahih, it is of the category of Hasan which is used as proof and acted upon, unless a defect appears in it necessitating its weakness.'\nAl-Hafiz Al-Iraqi said in his explanation: 'Badr al-Din Ibn Jama'ah commented on it saying: \"He should track it and judge it with what is befitting for it of Hasan, Sahih, or Weak,\" and this is the correct view.'\nThis shows that weakening is a matter agreed upon between Ibn Al-Salah and his opponents in his opinion on 'Authentication'. So it is permissible to weaken a Hadith based on the weakness of the chain. This does not contradict what the Sheikh quoted from Al-Nawawi and others (p. 37) of preventing affirming (Jazm) the weakness of a Hadith relying on the weakness of its chain, due to the possibility that it has another authentic chain. Because this only prevents affirming, due to the mentioned possibility. But if the researcher does not affirm weakness but says it based on dominant conjecture, or affirms it after repelling the mentioned possibility either by quoting a Hafiz Imam regarding the uniqueness of the weak narrator in it or after exhausting effort in investigating paths from the books of collecting Hafizs, then this is something there is no objection to. I do not imagine a rational person who has smelled the scent of...",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 62
  },
  {
    "serial_number": "301828",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 59,
    "volume_number": 1,
    "text": "...the science of Hadith saying contrary to this. Thus falls the Sheikh's saying (p. 37) following Al-Nawawi's mentioned statement: 'This is explicit in repelling what this writer did of proceeding to weaken the mentioned Hadiths without having a predecessor in that who stated it...'.\nThen this speech is based on two matters, both fallen: First: Understanding Al-Nawawi's speech of preventing affirmation as meaning prevention even based on dominant conjecture, and this is an error because conjecture is below affirmation. Second: That he imitated Ibn Al-Salah in that. We have proven his error in that by explicit quotations from scholars, and whatever is built on error is error.\nAmong the Sheikh's oddities is that he contradicts his own words! For he said following his mentioned speech: 'What the rules of Hadith give is that the Hadith (What a good reminder is the Subha) is weak with this chain.' So he weakened the Hadith without mentioning a predecessor for him in it! So what is the difference between me in what I weaken of Hadiths and him in this, were it not for rioting?\nAs for the other two Hadiths regarding which the Sheikh points out that I have no predecessor in weakening, it is an accusation among his many accusations that have no reality. One of them, the Hadith of Sa'd bin Abi Waqqas, Al-Hafiz Ibn Hajar preceded me in weakening it. As for the other, the Hadith of Safiyyah, Al-Tirmidhi weakened it by saying 'Gharib... and its chain is not known.' All of that has been explained previously, so I was not alone in weakening them. I say this to clarify the reality. Otherwise, I do not see this condition which the Sheikh leans on in rejecting our verifications regarding weak and fabricated Hadiths - which is that we must have a predecessor in weakening - for it contradicts what the previous words of the Imams implied. Rather, I see that this condition involves suspending knowledge and freezing thought. Otherwise, what is the benefit of reading all these sciences, including the science of Mustalah al-Hadith, if the one knowing it is not permitted to judge except with what he was preceded in of correctness or weakness? Is this not contrary to what appeared in the 'Mustalah' itself?! Al-Nawawi, may Allah have mercy on him, said in 'Al-Taqrib' (p. 30):",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 63
  },
  {
    "serial_number": "301829",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 60,
    "volume_number": 1,
    "text": "'Chapter: It is not befitting to limit oneself to hearing it and writing it without knowing and understanding it. Let him identify its correctness and weakness, its jurisprudence, meanings, language, grammar, and names of its men, verifying all that...'\nThe truth is that the goal of the science of Hadith is knowing the Authentic from other than it, as Izz al-Din Ibn Jama'ah said. The text of his words is: 'The science of Hadith is a science of laws by which the conditions of the chain and text are known. Its subject is the chain and the text, and its goal is knowing the Authentic from other than it' (1).\nThe condition invented by the Sheikh destroys this supreme goal. For the researcher in the books of Sunnah comes across very many Hadiths for which he finds no one who spoke about them with authentication or weakening. So stopping then from authentication and weakening by one knowing this noble science leads to suspending the goal of the science of Hadith, as is clear and not hidden. The likeness of one who says this is only the likeness of one who claims that it is not permissible for one knowing the science of Usul al-Fiqh to give a fatwa in a new occurrence with a fatwa for which he has no predecessor! In this saying is the elimination of the goal of the science of Usul al-Fiqh, just as in the Sheikh's saying is the elimination of the goal of the science of Hadith; there is no difference.\nThe summary of the speech is that the condition in 'Authentication and Weakening' is only competence. As for Hifz (being a Hafiz), that is something else; if found, it is light upon light, otherwise it is not a condition as the previous words of the Imams indicated. And Allah is the Granter of success, there is no Lord but Him.",
    "foot_note": "1. (1) Qawa'id al-Tahdith by Al-Qasimi (51).",
    "book_id": "151039",
    "new_page_number": 64
  },
  {
    "serial_number": "301830",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 61,
    "volume_number": 1,
    "text": "Conclusion of the Refutation:\nI wanted to end the refutation of the virtuous Sheikh Al-Habashi in his treatise 'Al-Ta'aqub Al-Hathith' with the previous article. However, his eminence permitted the publisher of the treatise to write a word he made as a conclusion to it. Since his eminence approved him in it, he bears its moral responsibility like the rest of the treatise. So it was necessary to state our opinion regarding that word. I say:\nThey said: 'Benefit: Al-Suyuti mentioned in his treatise \"Al-Minhah fi al-Subhah\" a group who adopted the Subha or what is in its meaning.'\nI say: Then they mentioned a group of them: Safiyyah, Abu Safiyyah the freed slave of the Prophet, peace and blessings be upon him, Sa'd bin Abi Waqqas, Fatimah bint Al-Husayn, Abu Hurayrah, and others.\nOur answer to that is from two aspects:\nFirst: That none of the chains of these traditions are authentic, and there is no great benefit in prolonging the research by discussing all their individual items. It suffices us to verify the speech regarding the narrations of those whose names we quoted as examples. Otherwise, duty dictates that the Sheikh undertakes investigating the speech on them - if he could - because he is the one who used them as proof. The principle of Usul says: 'If you are quoting, then accuracy; or claiming, then evidence'! But how can the Sheikh quote only the authentic while he is ignorant of it! He declared in his treatise (p. 21) that he does not have the function of authentication. Then he exploits this ignorance, arguing with denounced Hadiths and weak traditions, while the duty upon him is to stop arguing with any of them until someone is destined for him who informs him of the authentic thereof from the weak! Therefore, our speech on some of these traditions is by way of volunteering, not obligation. So I say:\n1 - Safiyyah, may Allah be pleased with her. They point by that to her previous Hadith. The publisher repeated the discussion on it. We have explained previously that the chain of her Hadith is weak, and that Al-Tirmidhi weakened it. Likewise, the chain of Sa'd bin Abi Waqqas's Hadith is weak even according to Al-Hafiz Ibn Hajar, as the verification of all that preceded. Their saying:",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 65
  },
  {
    "serial_number": "301831",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 62,
    "volume_number": 1,
    "text": "\"'We present in this treatise the authentication of the Hadith from Al-Hafiz Ibn Hajar.'\nIts answer is that Al-Hafiz only authenticated the Hadith and did not authenticate the chain. The authentication of the first does not necessitate the authentication of the Hadith's text with everything in it, like counting with pebbles, based on what we verified previously, so review it for it is a subtle matter.\n2 - Abu Safiyyah: In the chain to him is the mother of Yunus bin Ubayd, and there is no mention of her in any of the biographical books. Likewise, Al-Baghawi narrated it, and via his path Ibn Shahin in 'Al-Fawa'id' (114/2), and Abu Abdullah Al-Husayn bin Yahya Al-Qattan narrated it in a portion of 'His Hadith' (170/1) from Abu Lu'bah (1) from his grandfather Baqiyyah from Abu Safiyyah. I did not know Abu Lu'bah and his grandfather Baqiyyah.\n3 - Sa'd bin Abi Waqqas: The chain to him is disconnected or unknown. Ibn Sa'd narrated it in 'Al-Tabaqat Al-Kubra' (3/143) via the path of Hakim bin Al-Daylami from him. Hakim did not meet Sa'd, and Al-Hafiz mentioned him in the sixth layer, which is the one whose members are not proven to have met any of the Companions. Supporting the disconnection is that Ibn Abi Shaybah narrated it in 'Al-Musannaf' (2/89/2) from Hakim Al-Daylami from a freed maid of Sa'd from Sa'd. This maid was not named, so she is unknown.\n4 - Abu Hurayrah: In the chain to him in Ibn Abi Shaybah (2/189/1) is a man from Al-Tafawah who was not named, so he is unknown.\n5 - Fatimah bint Al-Husayn: The chain to her is very weak. Ibn Sa'd narrated it (8/474) from Jabir - who is Al-Ju'fi, accused of lying and used to believe in the return (Raj'ah) of Ali! - from a woman who was not named, so she is unknown.",
    "foot_note": "1. (1) In 'Al-Isabah' by Ibn Hajar and 'Al-Minhah' by Al-Suyuti it is 'Ubayy bin Ka'b', and I did not know him either, and he is definitely not the Ansari, the great Companion.",
    "book_id": "151039",
    "new_page_number": 66
  },
  {
    "serial_number": "301832",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 63,
    "volume_number": 1,
    "text": "Reflect, how far the Sheikh is from scientific verification when he attributes to such virtuous people opposition to the Sunnah in our opinion, and opposition to what is best in his opinion, with such flimsy chains!\nSecond Aspect: Even if these traditions or some of them were authentic, we oppose them with what is authentic from Ibn Mas'ud of his denial of counting with pebbles. Its referencing and the clarification of its source, indeed its many sources which the Sheikh was ignorant of, preceded - as I explained previously. So suffice us now reminding of it, and of what is established from Imam Ibrahim Al-Nakha'i of his denial of twisting thread for the sake of the Subha, and his considering that helping in evil!\nAdded to that is what I came across recently from Abu Bakr bin Hafs who said: I asked Ibn Umar about glorifying with pebbles? He said: 'Does he count upon Allah?! (1) Allah counts!' Narrated by Imam Abu Zur'ah Al-Razi in his history with an authentic chain from this Abu Bakr, who is Abdullah bin Hafs bin Umar bin Sa'd bin Abi Waqqas, and he is trustworthy and a proof.\nThese, Abdullah bin Mas'ud and Abdullah bin Umar, are more knowledgeable (Faqih) and learned than all those Companions from whom counting with pebbles was narrated. Likewise, Ibrahim Al-Nakha'i is more knowledgeable than Fatimah bint Al-Husayn, may Allah be pleased with them. With the great difference, which is that from these denial of counting is established, and from those counting is not established!\nWe can join to the two 'Abd's (Ibn Mas'ud and Ibn Umar) the lady Aisha, may Allah be pleased with them, but upon the Sheikh's method of arguing with what is not established! Ibn Abi Shaybah extracted in 'Al-Musannaf' from a woman of Banu Kulayb who said: 'Aisha saw me glorifying with Tasbihs (beads) I had. She said: Where are the witnesses?! Meaning the fingers.'\nBut God forbid that we argue with what is not authentic to us, even if others permitted that! With knowledge or ignorance! For this woman from Banu Kulayb I did not know.\nFrom these authentic traditions, the error of what the Sheikh quoted following those flimsy traditions becomes clear to the noble readers:",
    "foot_note": "1. (1) Original 'Ahsa'.",
    "book_id": "151039",
    "new_page_number": 67
  },
  {
    "serial_number": "301833",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 64,
    "volume_number": 1,
    "text": "\"'And prohibition of the permissibility of counting Dhikr with the Subha has not been reported from anyone of the Salaf nor the Khalaf...'.\nFor it is self-evident to everyone that whoever denies counting with pebbles denies counting with the Subha as well, because they are equal according to the Sheikh and others. According to us, denying it is more appropriate, because in the Subha are evils not found in counting with pebbles, as preceded pointing to that.\nAs for what they quoted from Ibn Hajar - who is Al-Haythami the Jurist, not Al-Asqalani the Muhaddith, contrary to what they insinuated! - 'That the previous Hadith of Sa'd is a correct basis for permitting the Subha.'\nI say: Prove the throne then engrave! We have proven previously the weakness of the chain of Sa'd's Hadith as well as Safiyyah's Hadith. Even if the Hadith were established, it is not correct in our view to take the Subha as a basis because it is from the slogans of the Christians. We still see them until today hanging them on their waists with the cross on them. Added to that is that it is often a tool for showing off, reputation, and pretending righteousness and piety, like the one who hangs it on his neck, or winds it on his hand. As I said in the first treatise of 'Tasdid al-Isabah ila man Za'ama Nusrat al-Khulafa' al-Rashidin wa al-Sahabah' (1).\nThen they said, following others: 'Using the Subha in large numbers of Dhikr where being occupied with it [counting] distracts from directing oneself to the Dhikr is better than counting with fingertips.'",
    "foot_note": "1. (1) This is a new book of ours which we were compelled to author to refute the fabrications and errors of a group who colluded to author a treatise against us called 'Al-Isabah fi Nusrat al-Khulafa' al-Rashidin wa al-Sahabah'. Among the participants in authoring it was the virtuous Sheikh Al-Habashi! Our book consists of six treatises, of which three have been issued so far: The first in clarifying their fabrications and errors, the second in 'Salat al-Tarawih' which is a book collecting - or almost - what appeared in the Sunnah related to this prayer in the size of our book 'The Prophet's Prayer Described', and the third in 'Eid Prayer in the Musalla is the Sunnah'.",
    "book_id": "151039",
    "new_page_number": 68
  },
  {
    "serial_number": "301834",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 65,
    "volume_number": 1,
    "text": "I say: There is no large number in the Sunnah where being occupied with counting it distracts from directing oneself to the Dhikr! What drives the Sheikh and his likes to this claim, i.e., preferring the Subha in large numbers, is their adherence to what was not reported in the Sunnah of large numbers, like the adherence of some of them to the famous number in some formulas of innovated prayers! That is as previously alerted to.\nI believe that being occupied with counting the Dhikr whose counting and enumeration is legitimate is a matter intended by the Wise Lawgiver just like the Dhikr itself. Were it not so, being occupied with counting would be futile, and this is something the Wise Sharia is above. Accordingly, it is not permissible for a rational Muslim to consider being occupied with counting the legitimate Dhikr, whatever its number, by the legitimate means as distracting from directing oneself to the Dhikr, because counting itself is a legitimate act of worship at the same time. What drives saying the contrary to this is adherence to invented numbers that cannot be enumerated except by an innovated means!\nO Allah, make us among the supporters of Your Prophet's Sunnah, warriors against what people invented in Your religion.\n* * *\nScarcely had the first and second articles of this blessed refutation, Allah willing, been published when the virtuous Sheikh Al-Habashi came out upon us with another response in another treatise with more talk than the first! He named it 'Nusrat al-Ta'aqub al-Hathith' (Support of the Intensive Commentary)! I had pointed to it more than once in the folds of our verification in some previous articles. When I saw it like its predecessor in misunderstanding my speech, fallacy in research, and exiting the proper path in debating with what is better; indeed, I found it more excessive than the first in attacking, insulting, and fabricating, which scholars rise above no matter how their views differ. Reflect for example on his saying regarding my person in the footnote (p. 3): 'He misguides Sheikh Badr al-Din in his using the Subha'!",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 69
  },
  {
    "serial_number": "301835",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Refutation of the 'Intensive Commentary' of Sheikh Abdullah Al-Habashi",
    "edition": "None",
    "publisher": "Al-Taraqqi Press, Damascus - Syria",
    "page_number": 66,
    "volume_number": 1,
    "text": "This is pure lie and mere fabrication. Would that he sufficed with this, but he followed it with his saying: 'And how can Nasir catch up with the dust of Sheikh Badr al-Din's sandal, may Allah have mercy on him, in knowledge and action...!' And his saying (p. 64): 'O his shame on that Day and O his scandal! This is if he dies a Muslim, otherwise he will be punished, and refuge is sought in Allah, with a bad ending'!\nWhen I saw this and other things, I became certain that the Sheikh - may Allah forgive us and him - does not deserve being replied to. Time is too tight and precious to be spent in clarifying his ignorances and errors which almost never end!\nIn conclusion, I say: Despite all this that the Sheikh did, I hold him in utmost respect and veneration; because I think righteousness in him which is often exploited by some biased people for other than the righteous person's benefit if he were alert to that! Therefore, I initiate greeting him whenever I meet him, even though he, in responding - returning the greeting of course! - almost does not appear either!\nI ask Allah, the Blessed and Exalted, to grant us and him success to follow His Book, track the traces of His Prophet, and avoid what the innovators invented in his religion. Indeed, He is Hearing and Responsive.\nGlory be to You O Allah and with Your praise, I testify that there is no god but You, I seek Your forgiveness and repent to You. And may Allah send blessings upon our Master Muhammad the Unlettered Prophet and upon his family and companions and send peace. And praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "151039",
    "new_page_number": 70
  }
]