[
  {
    "text": "The Egyptian Epistle (Al-Risalah Al-Masriyyah)\nAuthor: أبو الصلت أمية بن عبد العزيز الأندلسى\nYear: 528",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Egyptian Epistle (Al-Risalah Al-Masriyyah)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6883\nbook_title: الرسالة المصرية [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/957\nbook_id: 957\nauthor_name: أبو الصلت أمية بن عبد العزيز الأندلسى\nauthor_year: 528\nnickname: أبو الصلت\nauthor_link: https://shamela.ws/author/1089\nauthor_ID: 1089\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Egyptian Epistle (Al-Risalah Al-Masriyyah)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6271018",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle (Al-Risalah Al-Masriyyah)",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Travels\nBook: The Egyptian Epistle [Printed within the book \"Rarities of Manuscripts\" (Nawadir al-Makhtutat)]\nAuthor: Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi (470 - 528 AH)\nInvestigation: Abd al-Salam Harun\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\nBook: The Egyptian Epistle [Printed within the book \"Rarities of Manuscripts\"]\nAuthor: Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi (470 - 528 AH)\nInvestigation: Abd al-Salam Harun\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Printed within the book \"Rarities of Manuscripts\"]\nAuthor: Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi (470 - 528 AH)\nInvestigation: Abd al-Salam Harun\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\nAuthor: Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi (470 - 528 AH)\nInvestigation: Abd al-Salam Harun\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\nInvestigation: Abd al-Salam Harun\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\n[Book numbering matches the printed edition]\nDate of publication in Shamela: 5 Muharram 1444\n\nDate of publication in Shamela: 5 Muharram 1444",
    "foot_note": "None",
    "book_id": "957",
    "new_page_number": 3
  },
  {
    "serial_number": "6271019",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 5,
    "volume_number": 1,
    "text": "The Egyptian Epistle\nBy Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi\n470 - 528 AH",
    "foot_note": "None",
    "book_id": "957",
    "new_page_number": 4
  },
  {
    "serial_number": "6271020",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 6,
    "volume_number": 1,
    "text": "Introduction\n\nMany men from Andalusia migrated to the East seeking knowledge, wealth, status, or desiring to perform the Hajj pilgrimage. Among those immigrants to Egypt was a man who combined literature with wisdom (philosophy), and medicine with astrology, music, mathematics, and proficiency in the science of mechanics. This man is Abu al-Salt Umayyah bin Abd al-Aziz bin Abi al-Salt, born in the city of Dénia, in Andalusia, in the year 470 AH.\n\nAbu al-Salt arrived in Alexandria accompanied by his mother - according to Ibn Khallikan - in the year 487 AH. That is, during the days of the Fatimid Caliph Al-Mustansir Billah Abu Tamim Ma'ad bin Al-Zahir Billah Ali bin Al-Hakim bi-Amr Allah; and his vizier at that time, who was managing the affairs of his state, was Al-Afdal Shahanshah, son of the Commander of the Armies Badr al-Jamali the Armenian.\n\nFrom this journey, Abu al-Salt hoped for an abundance of living and wealth, as he indicated at the beginning of his epistle. It seems that he remained obscure for a long time, waiting for opportunities, until he was able to contact one of those close to the Vizier Al-Afdal (1), during the days of the Caliph Al-Amir (2). That man was Taj al-Ma'ali Mukhtar (3). He served him with the crafts of medicine",
    "foot_note": "1. Al-Afdal's vizierate for the Fatimid Al-Mustansir began in 487 after the death of his father Badr al-Jamali, then he was vizier for Al-Musta'li Billah Ahmad in 488, then for Al-Amir bi-Ahkam Allah in 496. He tyrannized over all these Caliphs until Al-Amir managed to overpower him and plotted his killing, so he was killed in 515. Al-Nujum al-Zahirah (5: 222).\n2. He is Al-Amir bi-Ahkam Allah Mansur bin Al-Musta'li Billah Ahmad bin Al-Mustansir Billah. He was born in 490 and became Caliph when he was five years old, and it is said in 524. See Al-Nujum al-Zahirah (5: 17) and Al-Khitat al-Maqriziyyah regarding the mention of \"Al-Aqmar Mosque.\"\n3. Mu'jam al-Udaba (7: 54).",
    "book_id": "957",
    "new_page_number": 5
  },
  {
    "serial_number": "6271021",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 7,
    "volume_number": 1,
    "text": "and astrology, so he admired him, described him in the presence of Al-Afdal, and praised him. However, Al-Afdal's scribe envied him for that and feared the power of Taj al-Ma'ali. It happened that Taj al-Ma'ali's missteps followed one another, leading Al-Afdal to arrest and imprison him. Al-Afdal's scribe found the opportunity ripe to eliminate Abu al-Salt, so he fabricated things against him that drove Al-Afdal to throw him into the Ma'una Prison (1) in Cairo for a period of three years and a month (2), despite the panegyrics and poetry he had composed for him (3).\n\nIbn Abi Usaibia narrates in *Tabaqat al-Atibba* (Classes of Physicians) that Abu al-Salt's entry into Egypt was around the year 510 AH, and that he was imprisoned in Alexandria during the caliphate of Al-Amir bi-Ahkam Allah and the vizierate of Al-Afdal (4). If this narrative is correct, it would be evidence that Abu al-Salt arrived a second time after the death of his benefactor Abu al-Tahir Yahya bin Tamim bin Al-Muizz bin Badis (5), who died in the year 509, which is the year of his departure from Egypt.",
    "foot_note": "1. Al-Maqrizi mentioned this prison when mentioning the Ma'muniyya House attributed to Al-Ma'mun Al-Bata'ihi. He said: \"Next to the Ma'muniyya House was the Ma'una Prison.\" Then he said: \"This place remained a prison during the Fatimid state and the Ayyubid state, until King Mansur Qalawun built a caravanserai (Qaysariyya) there and housed amber dealers in it in the year 680.\" He said: \"This Ma'una Prison was where criminals were held... as for princes and notables, they were imprisoned in Khazanat al-Bunud.\" The Ma'muniyya House is what is known as the Suyufiyya Madrasa.\n2. Al-Maqqari narrated in Nafh al-Tib (1: 530 Leiden) a strange account: that Abu al-Salt's age was 60 years; 20 in Seville, 20 in Ifriqiya (Tunisia) with its Zirid kings, and 20 in Egypt imprisoned in the Library.\n3. See some of it in Ibn Abi Usaibia (2: 53, 56).\n4. Ibn Abi Usaibia mentioned the reason for his imprisonment in Alexandria: Al-Afdal asked him to devise a trick (mechanism) to raise a ship sunk in the sea. Abu al-Salt strove, but when he neared success, his luck betrayed him, and the ship sank to the bottom of the sea, after costing the state heavy losses, so Al-Afdal imprisoned him for that.\n5. Abu al-Tahir Yahya bin Tamim became king of the Maghreb in 501 and remained stable in his rule until he died in 509. See History of Tripoli by Ibn Ghalbun (pp. 39-40).",
    "book_id": "957",
    "new_page_number": 6
  },
  {
    "serial_number": "6271022",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 8,
    "volume_number": 1,
    "text": "Abu al-Salt became fed up with Egypt and the disappointment and hardship he encountered there. Al-Qifti said (1): \"He entered Egypt in the days of its 'Afdal' (Best - pun on the Vizier's name) but received no favor from him, and he intended it for the 'Nile' (Nile/Obtaining) but found no attainment with him.\" Thus, he packed his bags for the Maghreb in the year 506 and restored his connection with the presence of Abu al-Tahir Yahya bin Tamim bin Badis, for whom he composed this \"Egyptian Epistle.\"\nIn it, he describes what he witnessed in Egypt and what he suffered. He addressed in this valuable epistle:\n1 - Geographical description of the Egyptian lands and its Nile.\n2 - Then he began depicting the beauty of its quarters and dwellings, sometimes in poetry and other times in prose.\n3 - He followed that by speaking about its inhabitants, their races, sects, morals, and beliefs, from the time of the Pharaohs to the advent of Islam.\n4 - He then spoke about the wondrous monuments it contains, such as the two pyramids and the temples (Barabi).\n5 - He mentioned the capitals of Egypt in ancient and modern times.\n6 - The ancient scholars among the Greeks and Romans, digressing to the scarcity of those occupied with science, wisdom (philosophy), and medicine whom he met in Egypt.\n7 - He marveled at the ignorance of the doctors he met there, while noting the merit of some skilled doctors.\n8 - He spoke of the Egyptians' fondness for astrology and their frequent use of it, citing anecdotes and witticisms regarding that.\n9 - He then turned to mentioning the men of letters and wits whom he met there.\n\nThis epistle connects to various sciences and arts, and is considered today, as it was considered",
    "foot_note": "1. See Akhbar al-Ulama by Al-Qifti (p. 57), Sa'ada edition.",
    "book_id": "957",
    "new_page_number": 7
  },
  {
    "serial_number": "6271023",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 9,
    "volume_number": 1,
    "text": "yesterday, a document referred to by the geographer, historian, archaeologist, sociologist, philosopher, doctor, astrologer, and man of letters.\nThis small-sized but high-value epistle was known and circulated among great scholars and historians, then became rare and unknown, until the late scholar Ahmed Timur Pasha - may Allah rest his soul - was able to acquire it in his private library, under number 601 Literature. Upon this unique copy in the world - as becomes clear from checking Brockelmann's indexes (1) - I rely in publishing this unique epistle, parts of which were cited by Yaqut in *Irshad al-Arib*, Al-Imad in *Al-Kharidah*, Al-Qifti in *Ikhbar al-Ulama*, Ibn Abi Usaibia in *Uyun al-Anba*, Al-As'ad bin Mammati in *Qawanin al-Dawlah*, Al-Maqqari in *Nafh al-Tib*, Al-Maqrizi in *Al-Khitat*, Al-Adfuwi in *Al-Tali' al-Sa'id*, and Al-Suyuti in *Husn al-Muhadarah*, as will become clear to you upon the verification of its texts.\n\nAbu al-Salt has works other than the Egyptian Epistle, such as *Kitab al-Hadiqa* (The Garden) in the style of *Yatimat al-Dahr* by Al-Tha'alibi, from which Al-Imad quoted in *Al-Kharidah*. He also has *Al-Adwiyah al-Mufrada* (Simple Drugs) preserved in the Bodleian Library; a *Treatise on Working with the Astrolabe* in Berlin, Leiden, and Bodleian; *Taqwim al-Dhihn* (Rectification of the Mind) in Logic at the Escorial Library; *Papers from a Book on Astronomy* at the Escorial; *Book on the Different Meanings of the Word 'Point'* in the Leiden Library; and a *Qasida* (Poem) in the Berlin Library.",
    "foot_note": "1. See Brockelmann (1: 486 - 487) and his first supplement (p. 889). However, I later found a fragment of the Egyptian Epistle in the Egyptian National Library under number 354 History, and I will indicate its beginning and end in the footnotes.",
    "book_id": "957",
    "new_page_number": 8
  },
  {
    "serial_number": "6271024",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 10,
    "volume_number": 1,
    "text": "He authored most of these books while imprisoned by Al-Afdal in Egypt, as stated by Ibn Khallikan.\nAbu al-Salt's days ended in Mahdia. Historians have differed regarding the year of his death; it was said 520 and said 528 (1).\nHere is the Epistle:",
    "foot_note": "1. See his biography in Yaqut (7: 52), Ibn Khallikan (1: 80), Al-Qifti (57), Al-Maqqari (1: 520), and Ibn Abi Usaibia (2: 52).",
    "book_id": "957",
    "new_page_number": 9
  },
  {
    "serial_number": "6271025",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 11,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nThe Sheikh Abu al-Salt Umayyah bin Abd al-Aziz bin Abi al-Salt, may Allah Almighty have mercy on him, said:\n\nI was, during the prime of youth, splendid, and the branch of boyhood was leafy.\n*When my side-locks were black... and the water of my face had luster* (1)\nAmong those whom Time favored with one of its oversights, and overlooked during one of its naps, so he lived with a safe flock, pleasant drink, not vacating from literature whose gardens he grazed and whose pools he visited, except to entertainment whose arena he populated ???, dragging his tails and sleeves (in pride).\n\nThen it (Time) changed color and turned the back of its shield to me, and gave me the dregs of its jar to drink. It rectified what it had neglected, and reclaimed what it had bestowed. I was compelled to leave the homeland, and depart from the resting place. I held back out of fear of leaving the first land my skin touched its soil, and upon which amulets were tied on me (2).\n\nMatters came that were unbearable and great. When staying was no longer possible, and nothing remained but flight, I said: I have nothing left but to cast myself into every destination, and throw it into every place.\n*To achieve an excuse or attain a desire... and a soul reaching its excuse is like a successful one* (3)\nAnd I took comfort in the famous verse:",
    "foot_note": "1. He borrowed it from the saying of Abu al-Tayyib al-Mutanabbi and modified it: 'And I wept over youth while my side-locks... were black and the water of my face had luster.'\n2. Borrowed from the saying of Riqa' bin Qays al-Asadi: 'A land where amulets were tied on me... and the first land whose soil my skin touched.' Al-Lisan (Nawata) and Amali al-Qali (1: 83).\n3. He also borrowed it from the saying of Urwah bin al-Ward, and Abu Tammam narrated it in Al-Hamasa (1: 188): 'And whoever is like me, possessing dependents and poor... of money, throws himself into every place. To reach an excuse or hit a desire... and a soul reaching its excuse is like a successful one.'",
    "book_id": "957",
    "new_page_number": 10
  },
  {
    "serial_number": "6271026",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 12,
    "volume_number": 1,
    "text": "*You will find in every land, if you settle in it... family for family and homelands for homelands* (1)\nEven though the common people say: There is no lineage between one land and another; the best land is that which carries you.\n\nSo I began surveying the lands to aim for the most suitable for residence, and the most helpful in battling the days. Egypt was among what my choice fell upon, and I believed my good opinion before testing it. I traveled intending it, traversing the unknown deserts and wastelands, wading through perils and places of destruction.\nSometimes I mount every black-hided vessel (2), black-robed, steady like the dye of youth, its field widened, and its reins placed in the palm of the wind, so it ran the run of a recalcitrant horse, and surpassed the range of the ambitious glance.\nAnd sometimes [I mount] every camel with callous flanks, like wolves (3), with long lips and curly hair, shod with cornelian or the split brother. If it ascends, you say an ostrich dyeing (its feathers), and if it descends, you say a piercing meteor. It connects gentle trotting with quick pacing (4), and the lowlands and highlands wore them out.\nHow many valley bends I traversed, and night robes I wore. How many lands I pierced their outlets and passes, and seas I split their crests and waves. I have no destination other than Egypt, nor a way beyond it, nor a quest for wealth short of it.\n*And there are many lands on earth but... upon you, for my misery, my choice fell.*\n\nWhen my mounts were submerged in the Nile, and sheltered in the shadow of Al-Muqattam, I threw down the staff of travel (settled), and the destination stabilized me. Their backs were lightened of saddles, and I rested them from solving and traveling. I said: My sought-after stray, and my intended desire; here I stay and reside,",
    "foot_note": "1. The verse is from verses in Al-Hamasa (1: 98). Before it: 'Let not the ease of living in comfort prevent you... from the soul's longing for family and homelands.'\n2. Meaning the ship.\n3. Its flanks became callous only from continuous walking. Naqab here means: blistering of the skin. Hayatil: plural of Haytal, which is the wolf; the horse is likened to it in intensity of running. In the original: 'naqb al-ayatil kahayatil'.\n4. The heard source of Wakhada is Wakhd and Wakhdan.",
    "book_id": "957",
    "new_page_number": 11
  },
  {
    "serial_number": "6271027",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 13,
    "volume_number": 1,
    "text": "so I do not leave nor depart, «with a good land and a forgiving Lord». Where I turned, there was a garden and a brook, a Khawarnaq and a Sadir (palaces), a shading shade, and a gentle breeze.\n*How I wished to meet within it someone... who consoles from worry or aids against calamities* (1)\n*But I found only people who, if they spoke truth... their promises were like a mirage in lying* (2)\n*And I had a means I thought I would... benefit from, but behold, my disease was from the means*\n*So nothing clips my nails but my pen... nor are the battalions of my enemies anything but my books* (3)\n\nThe duration of stay did not lengthen until I realized, by what I witnessed, that I am therein of diminished merchandise, degenerate craft, singled out for insult and waste; and that its easy life is restricted to the scoundrel, and its bitter punishment is reserved for the free man. Had I advanced and known that, my vehicle would have lightened from it (4) and I would have turned the face of my quest to other than it. I would have had a vast scope in the earth, and a wide resort. But I was hindered, until I was entangled, until I was treated as those of crimes and sins are treated, and I gulped from humiliation a full bucket.\nThis is despite what I composed of panegyrics that became famous as the morning, blew like the winds, and the camel-driver and sailor became fond of (5).\n*So he who does not walk briskly traveled with them... and he who does not sing chirping sang with them*\nExcept that Allah, exalted be His blessings and holy be His names, rectified with His mercy, so He removed that ordeal with a gift, and abrogated that vengeance with a blessing, and concluded with the arrival at the presence of the Grand King Abu al-Tahir Yahya bin Tamim bin al-Muizz bin Badis, whose presence never ceased to be the destination",
    "foot_note": "1. In the original: 'min al-nub' (from calamities), its correction is in Yaqut (7: 80), Al-Qifti (57), and Ibn Abi Usaibia (2: 60). He borrowed these verses from old poetry of his, as understood from Ibn Abi Usaibia's narration.\n2. In the original: 'ka-al-alf' (like the thousand), its correction is in Yaqut, Al-Qifti, and Ibn Abi Usaibia.\n3. In the original 'kata'ib a'wani' (battalions of my helpers), and the correction is from the references.\n4. In the original: 'fakhaffa' (so it lightened).\n5. See his praise for Al-Afdal in Ibn Abi Usaibia (2: 56).",
    "book_id": "957",
    "new_page_number": 12
  },
  {
    "serial_number": "6271028",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 14,
    "volume_number": 1,
    "text": "of captives (1), the desire of seekers, the gathering place of virtues, the resort of the virtuous, the watering place of generosity, and the ritual site of delegations.\nWhen I hid under his wing, and sought support in his benevolence, he sweetened for me the fruit of Time with his generosity, and apologized to me for what it (Time) had committed. He held back its palm from me, and diverted its vicissitudes from me.\n*A generous one whom I rejected people when I reached him... as if they were what lightened from a traveler's provision*\nSo I was, in what I went through, and what my state turned to, of shining after setting, and leafing after withering, like a blade whose matter was neglected due to ignorance of its worth. When it fell to the one expert in it, he maintained its blade alone, and ornamented its straps and sheath, then stored it among what is stored and prepared. If he unsheathed it one day, he approved of it; if he stripped it, he praised it; and if he shook it, its cutting in the struck object pleased him.\nBut Allah refused that merit belongs except to one who grew up in its planting grounds, rose in its origins, was raised in its bosom, and was fed by its full moon.\n*So I did not find palatable except his dew, so there was not... to equal in my eyes this precinct, any precinct*\n*For not every favor is light to bear... even if white clouds rained from it upon me* (2)\n*But the most glorious deed is what its owner came with... and no door or veil came before it*\n*I wished only to guide those blaming me... that my opinion in loving you is correct* (3)\n*And I teach a people who opposed me so they went east... and I went west, that I have succeeded and they failed*\n\nIt is better that I turn away from what has passed, leave what preceded, and take to what I have proceeded towards and intended, aimed for and relied upon, of what the High Presence (4) - may Allah prolong its height - preferred, of describing what I suffered of the land of Egypt and witnessed, and restricting to what I saw rather than what I narrated. For he who says: 'I knew this by way of knowledge and hearing' is not like one who says: 'I verified it by witnessing and observation.' For the honest person of intellect is not deceived by impossibility, nor pleased with plagiarism.\nI begin by mentioning these lands, their location in the inhabited world, the course of the Nile in them, and its sufficiency therein. I append to that a summary of mentioning the conditions of its people regarding their morals, biographies, and customs, and what connects to that, is dragged along with it, comes because of it, and enters into its folds.\nHere I am beginning that, seeking help from Allah, and upon Him is reliance. (1)",
    "foot_note": "1. Masad: Place of hunting. 'Anah: Plural of 'Anin, meaning captive/prisoner.\n2. Rabab: Clouds that ride upon one another, singular Rababa. In original: 'lada wa la minhu alayya', corrected from Yaqut (7: 59), and its rhyme there is 'sahab'.\n3. The verse and the one following it are by Al-Mutanabbi in his Diwan (1: 127) narrated by Al-Ukbari.\n4. In the original: 'Al-Shamiyya' (The Levantine).",
    "book_id": "957",
    "new_page_number": 13
  },
  {
    "serial_number": "6271029",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 15,
    "volume_number": 1,
    "text": "The entire land of Egypt is located in the inhabited world within the sections of the Second Clime and the Third Clime, mostly in the Third. Those concerned with its news and histories recounted that its boundary in longitude (2) is from the city of Barqa, which is in the south of the Roman Sea (Mediterranean), to Ayla on the coast of the gulf issuing from the Sea of Abyssinia, Zanj, India, and China (Red Sea). The distance of that is nearly forty days.\nThey said: Its boundary in latitude is from the city of Aswan and what aligns with it of Upper Egypt adjacent to the land of Nubia, to Rashid (Rosetta) (3) and what aligns with it of the Nile's outlets into the Roman Sea. The distance of that is nearly thirty days.\nIt is bordered from its beginning in latitude to its end by two mountains [one on the eastern bank of the Nile, which is Al-Muqattam, and the other on the western bank of it. The Nile flows between them. They are (4)] barren, not lofty, approaching each other",
    "foot_note": "1. The speech from here to the word 'straightness' was quoted by Al-Maqrizi in (1: 15-16).\n2. This is a historical geographic record of what Egypt's borders were in his era.\n3. In the original: 'to the land of Sham and Rashid', corrected from Al-Khitat.\n4. Completion from Al-Khitat.",
    "book_id": "957",
    "new_page_number": 14
  },
  {
    "serial_number": "6271030",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 16,
    "volume_number": 1,
    "text": "very closely in their positions, from the city of Aswan until it ends at Fustat. There, the distance between them widens and they separate slightly. Al-Muqattam takes an eastern direction and the other a western one, diverging in their paths (1) and separating (2) in their courses. So the land of Egypt widens from Fustat to the coast of the Roman Sea upon which are Al-Farama (3), Tinnis, Damietta, Rashid, and Alexandria. There it ends in its latitude, which is the distance [between] its furthest point in the south and [its furthest] in the west and north.\nIf measured by the demonstrative method in the path of this distance [in miles (4)], it does not reach thirty miles (5), rather it falls short of it by a negligible amount. That is because the difference between the latitude of Aswan, which is its furthest point in the south, and the latitude of the city of Tinnis, which is its furthest point in the north, is nine degrees and about a sixth of a degree of the degrees by which the Great Circle encompasses, [which are (6)] three hundred and sixty degrees. There is no difference between their longitudes that causes a significant amount in this calculation. If we multiply this number by what pertains to one degree of aligning that in miles, which is fifty-six miles and two-thirds of a mile according to what the proof indicated, that would be (7) about five hundred and twenty miles approximately. That is a distance of a twenty-day march or close to that (8). In this duration of time, the traveler always traverses what is between these two towns at a moderate pace in a little more than that, due to the winding of the road and lack of straightness (9).",
    "foot_note": "1. In Al-Khitat: 'ma'khadahuma' (their taking points).\n2. In the original: 'wa ta'rij' (and winding), corrected in Al-Khitat.\n3. In the original: 'Al-Haraman' (The Two Pyramids), corrected from Al-Khitat.\n4. This completion and the one before it are from Al-Khitat.\n5. In the original: 'yawman' (day), and its explanation is what I established from Al-Khitat.\n6. Not in the original.\n7. In the original: 'min dhalik' (from that).\n8. Quoted in Al-Nujum al-Zahirah (1: 36) that it is thirty days.\n9. Here ends Al-Maqrizi's quotation.",
    "book_id": "957",
    "new_page_number": 15
  },
  {
    "serial_number": "6271031",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 17,
    "volume_number": 1,
    "text": "The land of Egypt does not contain, after Fustat which is the seat of the King and the throne of the State, cities of significance in number or grandeur. However, its greatest and most proud cities are: in the northern direction from Fustat, Alexandria, Tinnis, and Damietta; and in the southern direction to the furthest Upper Egypt, Qus and Qift. This is the description of the land of Egypt in general. (1)\nAs for the Nile, its source is beyond the Equator, from a mountain there known as the Mountain of the Moon (Jabal al-Qamar). It begins to increase in the month of Abib (2), which is July (3) in Roman. The Egyptians say: \"If Abib enters, the water has a creep (dabib).\" Upon its beginning to increase (4), all its qualities change and spoil. The reason necessitating this is its passing through stagnant pools of water (5) which it mixes with, pulls, and extracts with it, accompanying them, among other possibilities (6).\nIt becomes like the state described by Prince Tamim bin Al-Muizz li-Din Allah:\n*Do you not see the thunder cried and complained... and the lightning flashed and laughed?* (7)\n*So drink upon a cloud like the dye of darkness... that made the face of the earth laugh when it cried* (8)\n*[The Oud imitated the moan of passion... but it excelled in what it imitated]* (9)",
    "foot_note": "1. From here begins another quotation by Al-Maqrizi in (1: 59).\n2. In Al-Khitat: 'Al-Tazayud'. 'Al-Tazayyud' and 'Al-Tazayud' have the same meaning.\n3. What follows 'Abib' is not in Al-Khitat. In the original: 'Qawliyah'.\n4. In Al-Khitat: 'Al-Tazayud'.\n5. In the original: 'bi-naqa' ma'a miyah ajinah', correction in Al-Khitat.\n6. The speech and poetry after this were not cited by Al-Maqrizi.\n7. In the original: 'The atmosphere from its darkness has complained', and the meter does not fit, as it is from Al-Sari'. I established what is in Diwan Tamim Folio (120) from the photocopy of Dar al-Kutub number (16025 Z). This version is what Al-Tha'alibi mentioned in Yatimat al-Dahr (1: 349) First Edition.\n8. In the original: 'yushbih al-tahqiq ka-subh' corruption, I established what is in the Diwan and Yatimat al-Dahr.\n9. Proof of this verse from Diwan Tamim.",
    "book_id": "957",
    "new_page_number": 16
  },
  {
    "serial_number": "6271032",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 18,
    "volume_number": 1,
    "text": "*And look at the Nile water in its rise... as if it were sandalwood or musk*\nOr as another of the contemporaries said, from a poem describing the land of Egypt:\n*And to God belongs the flow of the Nile in it when the East Wind... showed us in its passage a dragged army* (1)\n*So a bank shaking the Samhari (spears) withered... and a wave shaking the white (swords) of India turning to gold*\n*When it rises it mimics the rose fresh, and if it clears... it mimics its water in color but does not surpass it in scent* (2)\nThis is similar to what Abdullah bin Sariya recited to me of his own:\n*The river pleased me with purity... after my longing for its purity*\n*It was like the rose fresh... then it became like its water*\nAnd by Abu Bakr Al-Sanawbari (3) in a similar meaning:\n*I was moved by the Euphra... tes with every possessor of generosity and glory*\n*And the sun at its setting... is yellow, gilding the sword-sheen*\n*And the water, its two edges... are green from myrtle and rand* (4)\n*The hands of the wind gift it if... they blow from near and far*\n*With novelties of silver... and novelties of lapis lazuli*\n*And the ships like birds darted... in the air in pairs and singles*\n*Until when the Euphra... tes ebbed, it passed and followed it with a flow* (5)",
    "foot_note": "1. A great army is called 'Majr', due to its weight and bulk.\n2. Mimicked its water, meaning resembled rose water in color. In the original: 'haka ma'uhu naflam' corruption.\n3. He is Abu Bakr Ahmed bin Muhammad bin Al-Hasan bin Al-Marrar, known as Al-Sanawbari Al-Halabi. Al-Sam'ani said in Folio (355): attributed to pine (Sanawbar). See another explanation in Mukhtasar Tarikh Dimashq (1: 456). His death was in 334 AH as in Shadharat al-Dhahab. See Fawat al-Wafiyat (1: 77).\n4. Rand: A tree of the desert trees with a good scent, and myrtle is called 'Rand'. In the original: 'wurud' (roses), which has no basis.\n5. In the original: 'bi-ward' (with rose), and the explanation is what I established.",
    "book_id": "957",
    "new_page_number": 17
  },
  {
    "serial_number": "6271033",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 19,
    "volume_number": 1,
    "text": "*I saw it as if... a robe of roses was thrown upon it*\n*Restless like the lover... whose beloved announced rejection*\n*As if in its bowels is what... is in my bowels of anxiety and passion*\nAnd Tamim Al-Muizz said, and improved the comparison (1):\n*A day for us by the Nile short... and every day of joy is short*\n*The ships ascend like horses with us... therein, and the army of water descends*\n*As if its waves are chambers... and as if its eddies are beds*\nAnd Muhammad bin Al-Hasan said:\n*The river is clothed in flowers... an elegant garment like a robe... running with musk or melted gold* (2)\n*If it straightens you see the flat of a blade... and if it rounds you see the curve of a bracelet*\nAnd Abu al-Hasan Muhammad bin al-Wazir said, regarding the gradual increase of the water finger by finger, and the benefit of that graduation:\n*I see always much from little... and a full moon in reality from a crescent*\n*So do not wonder, for every little water... in Egypt is a cause for a gulf of money*\n*An increase of a finger every day... is an increase of cubits in good condition*\nWhen it reaches sixteen cubits and increases by one finger from the sixteenth, the Canal (Khalij) is broken (3). Its breaking has a counted day, a witnessed occasion, and a crowded gathering attended by the common and the elite. When it is broken, the canals (Tura') - which are the mouths of the gulfs - are opened, so the water overflows",
    "foot_note": "1. I did not find the following verses in Diwan Tamim.\n2. In the original: 'yajri li-sakk dhawb nudar'.\n3. In the original: 'nafa'at naf'an 'aziman' (benefited greatly), and I established what is in Al-Maqrizi (1: 59).",
    "book_id": "957",
    "new_page_number": 18
  },
  {
    "serial_number": "6271034",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 20,
    "volume_number": 1,
    "text": "and spreads, covering the fields and plains (1). People retreat to their highest dwellings of estates and houses, which are on hills and mounds that the water does not reach, nor does the flood dominate. At that point, the land of Egypt entirely becomes a submerging sea between its two mountains bordering it. It remains in this state until it reaches the limited bound, by the will of the Worshipped Lord. Most of that hovers around eighteen cubits. Then it begins returning to its outlet, to the course of the Nile [and its path, so it recedes first from what was (2)] of the land overlooking and high, and becomes in what was low of it (3), leaving every depression like a dirham, and abandoning every hillock like a striped garment.\nAt this time of the year, the land of Egypt is the most beautiful thing to behold, especially its famous parks and frequented monasteries, like Al-Jazirah, Birkat al-Habash (4), and similar places frequented by people of leisure, and visited by people of literature and mirth.\nIt happened that we went out in such a time to Birkat al-Habash. We spread from its flowers the best carpet, and shaded ourselves from its trees with the fullest canopy. Suns rose upon us from the glass of cups in the robes of full moons, and stars (5) illuminated with purity, until the gold of the afternoon flowed onto the silver of the water, and the fire of twilight clung to the coal of darkness. So one of us (6) said regarding that:",
    "foot_note": "1. In Al-Khitat: 'and submerged the bottoms and plains'.\n2. The place of this completion which I established from Al-Khitat is blank in the original.\n3. Instead of this sentence in the original: '... mutahaffiz ... nistamiyan', and its completion and correction from Al-Khitat.\n4. It was outside the city of Fustat to its south between the Nile and the Mountain. It was named Birkat al-Habash (Abyssinians' Lake) after Qatadah bin Qays bin Habashi al-Sadafi, who witnessed the conquest of Egypt, and had gardens next to this lake known as Al-Habash, so the lake was attributed to it. The location of this lake today is the agricultural land area belonging to the village of Deir al-Tin, and a great part of the agricultural lands belonging to the village of Al-Basatin. See Al-Khitat (2: 152) and Al-Nujum al-Zahirah (5: 14).\n5. In the original: 'wujum' (sulkiness).\n6. Meaning himself. It states in Al-Khitat (2: 155): \"Ibn Saeed said in the book Al-Maghrib: 'I went out once where Birkat al-Habash is, about which Abu al-Salt Umayyah bin Abd al-Aziz al-Andalusi - may Allah pardon him - says'.\" And he recited the following verses. It states in (2: 160): \"Bir Abi Salamah, known as Bir al-Ghanam, is south of Al-Nubiyya, and its location is the best spot in the lake, and it is what Abu al-Salt Umayyah bin Abd al-Aziz meant by his saying.\" And he recited the verses, and Yaqut narrated them in Umayyah's biography attributed to him.",
    "book_id": "957",
    "new_page_number": 19
  },
  {
    "serial_number": "6271035",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 21,
    "volume_number": 1,
    "text": "*By God, my day at Birkat al-Habash... while the horizon was between light and dusk*\n*And the Nile under the winds was agitated... like a sharp sword in the right hand of a trembling one*\n*The hand of the clouds wove it for us... so we are upon carpets from its weaving*\n*And we are in a garden adorned... rain embroidered its sides and embellished* (1)\n*So hand me the wine, for the leaver of it... is not revived from the assault of worry*\n*And water me with large cups filled... for they are most quenching for severe thirst* (2)\n*The heaviest of all people is a man... whom the caller of youth called but he did not fly (with joy)* (3)\nHe also said:\n*Distract your heart with pleasures and mirth... and hurry to the wine with goals and select drinks*\n*Do you not see the lush Lake wearing... embroidery of lights woven by the hand of clouds*\n*And it became, from fresh plants, in robes... rain revealed from it every hidden thing*\n*From lilies whose eyes choked with dew... and chamomile desiring dark lips and coolness*\n*And look at the rose mimicking the cheek of a modest one... from narcissus remaining to show the glance of a watcher*\n*And jasmine has exceeded pearls... and the wine is pearls floating on gold*\n*How many times we cured our burning thirst in it... with a blazing coal from the mouth of the pitcher* (4)\n*A sun of wine greeted us by a moon... overlooking a branch shaking nearby*\n*He loosened his side-locks, and swayed bending... like the spear shaft, with black hair ends*\n*So rejoice and take it, drink, for the motives of fun and mirth have called... upon youthfulness*\nAnd among what relates to describing the Nile are verses he wrote to Al-Afdal on the night of the Mahrajan (Festival):",
    "foot_note": "1. In the original: 'dhabaha bi-l-qatr' (slaughtered with rain), corrected from Al-Khitat and Mu'jam al-Udaba.\n2. In the original: 'la'alla arwa' (perhaps most quenching). In Mu'jam al-Udaba: 'fahunna ashfa' (for they are most healing).\n3. In the original: 'yad'uhu da'i al-siba' (the caller of youth calls him), I established what is in Al-Khitat and Mu'jam al-Udaba.\n4. In the original: 'illatina' (our illness) with 'Ain.",
    "book_id": "957",
    "new_page_number": 20
  },
  {
    "serial_number": "6271036",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 22,
    "volume_number": 1,
    "text": "*You invented for people a wondrous sight... may you continue to revive joy and mirth*\n*You reconciled opposites capably... so he who saw the water saw it mixing with flame*\n*As if the Nile and the candles upon it... were the horizon of a sky shining with meteors*\n*It was of silver then became a sky... and you think the fire upon it is gold*\nPoets have taken turns ..... rays on a morning [*]. Among the pleasant things said in that is the saying of some of the contemporaries, Abu al-Hasan Ali bin Abi al-Bishr the Scribe:\n*We drank at sunset a sun... diluted until the time of rising*\n*And the light of candles upon the Nile appearing... like the tips of spears in shields*\nAbu Mansur Al-Tha'alibi recited (in Yatimat al-Dahr) by Mansur bin Kayghalagh (1):\n*The boy stood circulating it in his palm... so I thought the full moon was carrying a star*\n*And the moon tends towards setting as if... a gilded sword was drawn over the bank* (2)\nAnd he recited in it (3) by Judge Abu al-Qasim Ali bin Ibrahim bin Abi al-Fahm Al-Tanukhi:\n*How beautiful is the Tigris while darkness pours down... and the moon in the horizon of the sky is setting*\n*As if it is therein a blue carpet... and as if there is upon it a gilded embroidery* (4)\nAnd Ibn Waki' Al-Tinnisi said:\n*A pool whose waves are folded by... the blowing of the North wind and the passing of the East wind*\n*When the sun shines from above it... you imagine it a gilded breastplate*",
    "foot_note": "1. In Part One of Yatimat al-Dahr (p. 65). Before the two verses: 'Time returned with whom I loved so he blamed... O my two friends, give me drink and drink. How many nights I conversed with its moon... above the Tigris before he absented.'\n2. In the original: 'fawq al-lahz' (above the glance), and in Al-Yatimah: 'fawq al-ma'' (above the water). See what follows in the poetry of Ibn al-Tammar al-Wasiti.\n3. i.e., in this meaning or in the book Yatimat al-Dahr. See Al-Yatimah (1:65).\n4. In the original: 'wa ka'annahu fihi tiraz', the explanation is what I established from Al-Yatimah. [*] (Shamela Comment): The complete phrase as it appeared in Al-Kharidah: 'Poets have taken turns describing the falling of rays on the surface of the water.' [Noted in the Addendum]",
    "book_id": "957",
    "new_page_number": 21
  },
  {
    "serial_number": "6271037",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 23,
    "volume_number": 1,
    "text": "And some of the contemporaries said in a poem:\n*Bati' Nahr Kana Al-Ra... while the silver in it melted* (1)\n*If the East wind scratched it you saw it... as if it were a gilded chainmail* [*]\nAbu Ubadah Al-Buhturi said describing a pool:\n*If the East wind rises over it, it reveals in it ripples... like breastplates with polished edges* (2)\n*If the stars appear in its sides... at night you think a sky was installed in it*\nAbdullah bin al-Mu'tazz excelled in his saying:\n*And a watery (river) appeared to them in Najaf... clear of pools, glued (cold)* (3)\n*When a pearl of sun faced it... you thought jewelry was broken upon it* (4)\nIbn al-Tammar al-Wasiti said describing the moonlight on the Tigris:\n*Stand and take justice from the vicissitudes of Time and calamities... and gather with your cup the union of fun and mirth*\n*Do you not see the night, its armies have turned away... defeated, and the armies of fun are in pursuit*\n*And the moon in the western horizon you think... has extended a bridge over the two banks of gold*\nMuhammad bin Abdullah Al-Salami said:\n*And a river where waves frolic... the frolicking of horses in the dust of battle*\n*When the sun turns yellow upon it we imagine... the fresh water is mixed with wine*\n***\nAs for the inhabitants of the land of Egypt, they are mixtures of people of different categories (5): Copts, Romans, Arabs, Berbers, Kurds, Daylam, Abyssinians, Armenians (6), and others of",
    "foot_note": "1. Thus the two verses appeared with their corruption.\n2. The two verses are from a poem praising Al-Mutawakkil and describing his pool. Diwan 319.\n3. Al-Ghari: Cold. It is said 'Ghariya al-ghadir': its water became cold.\n4. In Diwan Ibn al-Mu'tazz 61: 'fa-idha dahakat-hu' (if it laughed at it).\n5. In Al-Khitat (1:48): 'mukhtalifu al-asnaf' (different in categories).\n6. This word is not in Al-Khitat. [*] (Shamela Comment): The two verses as in Al-Kharidah: 'By the bank of a river as if glass... and the purity of silver in it melted. If the East wind scratched it in the forenoon... you imagined it a gilded chainmail.' See p. 116 of Nawadir al-Makhtutat. [Noted in the Addendum]",
    "book_id": "957",
    "new_page_number": 22
  },
  {
    "serial_number": "6271038",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 24,
    "volume_number": 1,
    "text": "categories and races according to their differences. They said: The reason for their difference, and the cause of their mixing, is the mixing of those who owned it and conquered it, from the Amalekites, Greeks, Romans, Arabs, and others. For this reason, their lineages mixed, so they contented themselves in identifying themselves by attributing to their places (1), and belonging to their birthplaces and locations.\nA group of historians recounted that in past times they were idol worshippers and managers of temples, until the religion of Christianity appeared and prevailed over the land of Egypt, so they became Christians. They remained so until the Muslims conquered it in the days of Umar bin Al-Khattab, may Allah be pleased with him. Some of them became Muslim and some remained on the religion of Christianity, and their sect is the Jacobite sect.\nAs for their morals, predominant among them is following desires, indulging in pleasures, busying themselves with trifles, believing impossibilities, and weakness of resolve and determination, among other things that Abu al-Hussein Ali bin Ridwan recounted and narrated, citing natural causes for it (2). He suffices as a fair judge and a just witness.\nAl-Wasifi recounted in his book which he authored on the news of Egypt that its people in former times believed that this world, which is the world of generation and corruption, remained for a period of time empty of the human species, inhabited by other species than humans. And that those species were different in singular creations (3) and odd forms. Then the human species occurred and disputed with those species, overcame them, seized control, exterminated most of them by killing, and chased the remainder to the wastelands. Those chased ones are the Ghouls and Succubi (Si'lat) and others, among what he recounted of their impossible beliefs, corrupt conceptions, and repulsive delusions. However, it appears from",
    "foot_note": "1. In Al-Khitat: 'by pointing to their places'.\n2. The word appeared thus.\n3. Al-Fadhdha: Singular/Unique. In the Hadith: 'This singular verse', meaning unique in its meaning.",
    "book_id": "957",
    "new_page_number": 23
  },
  {
    "serial_number": "6271039",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 25,
    "volume_number": 1,
    "text": "their affair that there was a group among them possessing knowledge and sciences, especially the science of Geometry and Astronomy (1). Evidence for that is what they left behind of wondrous miraculous works (2), like the Pyramids and Temples (Barabi), for they are among the monuments that bewildered the [penetrating] minds (3) [and incapacitated weighing thoughts], and left them busy wondering at them and thinking about them. Regarding such things, Abu al-Ala Ahmed bin Suleiman Al-Ma'arri says in his poem eulogizing his father (4):\n*The tombs mislead the minds regarding their guidance... nor is the upright opinion safe from error*\n*The masters of eloquence whenever... they saw beauty counted it as the work of Jinn*\nWhat is more amazing and strange, after the capabilities and creations of Allah, than the ability to build a [colossal (5)] body from the greatest stones, square in base, conical in shape, the height of its pillar being three hundred and about seventeen cubits (6), surrounded by four triangular surfaces with equal sides, the length of each side being four hundred and sixty cubits (7). Despite this magnitude (8), and the precision of craftsmanship and perfection (9), it is in the utmost good estimation such that it has not been affected (10) until now and so forth (11) by the blowing of winds, the pouring of clouds,",
    "foot_note": "1. In Al-Khitat (1: 118): 'and especially the science of Geometry and Astronomy'.\n2. In Al-Khitat: 'of crafts'.\n3. In the original: 'The monuments far from minds', corrected from Al-Khitat.\n4. In Saqt al-Zand (1: 196) with Al-Tanwir commentary.\n5. This is from Al-Khitat.\n6. In Al-Khitat: 'nineteen cubits'. Cubit (Dhra') can be masculine or feminine.\n7. In Al-Nujum al-Zahirah (1: 98) quoting Abu al-Salt: 'and seventy cubits'.\n8. In the original: 'with this length of it' and written next to it: 'in magnitude' instead of 'length of it'. I established what is in Al-Khitat.\n9. Instead in Al-Khitat: 'and perfection of geometry (Hindam)'.\n10. In the original: 'and it is not affected', I established what is in Al-Khitat.\n11. Thus appeared in the Original and Al-Khitat. Perhaps: 'to this day and so forth'.",
    "book_id": "957",
    "new_page_number": 24
  },
  {
    "serial_number": "6271040",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 26,
    "volume_number": 1,
    "text": "and the shaking of earthquakes. This is the description of each of the two pyramids adjacent to Fustat on the western side, according to what we witnessed of them (1). Some said, mentioning the wonders of Egypt: \"There is no structure on the face of the earth except that I pity it from the night and day, except the two pyramids, for I pity the night and day from them.\"\nThese two pyramids (2) have an overlooking upon the land of Egypt, a towering [over] its plains, and an ascension to its peaks. They are what Abu al-Tayyib al-Mutanabbi meant by his saying:\n*Where is the one whose building the pyramids are... What is his people, what is his day, what is the death spot* (3)\n*We used to think his abodes filled... with gold, but he died and every house is a wasteland* (4)\n*Monuments remain behind their lords... for a time, then ruin overtakes them and they follow* (5)\nIt happened that we went out one day to them. When we circled them and turned around them, our wonder at them increased, so we exchanged words about them. One of us said (6):\n*By your life, have you seen a more amazing sight... throughout what you have seen than the two pyramids of Egypt* (7)\n*[They towered reaching for the sky and overlooked... the atmosphere like the overlooking of Arcturus or Vega (8)*",
    "foot_note": "1. In the original: 'minha' (of it), corrected in Al-Khitat.\n2. In the original: 'I pity the night and day from them upon and these two pyramids are among the greatest of them.' I established the correction from Al-Khitat.\n3. From a poem in his Diwan (1: 405) with Al-Ukbari's commentary, eulogizing Abu Shuja' Fatik.\n4. This verse was not cited by Al-Maqrizi, and it is here out of its natural place. Its place in the Diwan is after a verse following the third here; because the pronoun of 'his abodes' refers to Abu Shuja' in the referenced verse, which is: 'A limit did not satisfy the heart of Abu Shuja'... before death and no place contained him.'\n5. In Al-Khitat: 'behind their inhabitants'. In the Diwan: 'behind their owners'.\n6. In Bada'i' al-Bada'ah 136, the one who said the poetry is Abu al-Salt himself.\n7. After this in the original is a blank space of about two pages. I managed to fill this gap from what Al-Maqrizi quoted in Al-Khitat (1: 118-119): I placed this missing part between completion brackets: [. . . . .].\n8. In Bada'i' al-Bada'ah: 'They towered in the sides of the sky'.",
    "book_id": "957",
    "new_page_number": 25
  },
  {
    "serial_number": "6271041",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 27,
    "volume_number": 1,
    "text": "*And they fulfilled a high prominence from the earth... as if they were two breasts rising on a chest]* (1)\nA group claimed that the pyramids are tombs of great kings, who preferred to be distinguished by them from other kings after their death, just as they were distinguished from them in their lives, and intended for their memory to remain because of them over the passage of eras and the lapse of ages.\nWhen Caliph Al-Ma'mun arrived in Egypt (2), he ordered them breached. One of the two pyramids adjacent to Fustat was breached after severe effort and long trouble. They found inside it pits and ascents whose matter was terrifying and passage difficult. They found at its top a cubic room, the length of each of its sides about eight cubits, and in its center a marble basin covered. When its lid was removed, they found nothing in it but a decayed corpse, upon which bygone eras had passed. Thereupon Al-Ma'mun ordered to desist from breaching the other. It is said: The expense on breaching it was great, and the cost severe.\nAmong people are those who claimed that Hermes the First, called the Triply-Blessed with Prophecy, Kingship, and Wisdom - who is the one the Hebrews call Enoch son of Jared son of Mahalalel son of Kenan son of Enos son of Seth son of Adam, peace be upon him, and he is Idris peace be upon him - deduced from the conditions of the stars that the Flood would cover the earth. So he increased the building of pyramids, and depositing wealth and sheets of knowledge in them, and what he feared would be lost and erased, to preserve them and protect them.\nIt is said: The one who built them was a king named Surid bin Sahluq bin Siryaq. Others said: The one who built the two pyramids adjacent to Fustat was Shaddad bin Ad, due to a vision he saw. The Copts deny the entry of the Amalekites into the land of Egypt,",
    "foot_note": "1. After it in Bada'i' al-Bada'ah: 'Abu Mansur Zafir al-Haddad composed: Contemplate the shape of the two pyramids and look... and between them is the wondrous Sphinx. Like two camel-litters on a journey... with two lovers and between them a watcher. And the overflow of the sea between them is tears... and the sound of the wind between them is weeping. And outward looks Joseph's prison is like a lover... left behind, so he is sad and depressed.'\n2. That was in the year 217 as in history books.",
    "book_id": "957",
    "new_page_number": 26
  },
  {
    "serial_number": "6271042",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 28,
    "volume_number": 1,
    "text": "and verify that their builder was Surid (1), for a vision he saw, which was that a calamity would descend from the sky, which is the Flood. They said he built them in a period of six months, and covered them with colored silk brocade, and wrote on them: \"We built them in six months. Tell him who comes after us to demolish them in six hundred years; for demolishing is easier than building. And we covered them in colored silk, so let him cover them in mats, for mats are easier than silk.\"\nWe saw the surfaces of each of these two pyramids inscribed from top to bottom with tight parallel lines, from the writing of their builder; their letters are not known today, nor are their meanings understood.\nIn summary, the matter regarding them is amazing, such that the utmost description of them and exaggeration in expression falls short of the reality of the described, unlike what [Ali (2)] bin al-Abbas al-Rumi said, even if the described objects are far apart and the intentions different, when he says:\n*If you describe a person to a person... do not exaggerate in his description and be moderate*\n*For if you exaggerate, you drive suspicio... ns regarding him to the furthest purpose*\n*So he becomes small where you magnified him... due to the merit of the absent over the witnessed*\nThe same applies to the Temples (Barabi), such as the Temple of Akhmim, the Temple of Samanoud (3), and the Temple of Dendera (4). For in them is precision, quality of form, and beauty of imagery, which indicates that their builders",
    "foot_note": "1. In Al-Nujum al-Zahirah: 'Suwayrid and said Suwayd'.\n2. Here ends the gap I noted in Footnote 7 of page 26.\n3. In the original: 'Samandu', corrected from Al-Maqrizi when mentioning the Barabi. Yaqut said: 'The Samanudi district had a Barba which was one of the wonders. Al-Quda'i said: It was mentioned from Abu Amr al-Kindi that he said: I saw it while some of its workers stored acacia leaves (Qaraz) in it. I saw the camel when it approached its door and wanted to enter, every crawling insect in the Qaraz fell, and nothing entered the Barba. Then it was ruined around three hundred and fifty.'\n4. In the original: 'Didar', but it is 'Dendera', or 'Dandara', or 'Andara' as in Mu'jam al-Buldan. Regarding the Temple of Dendera, Al-Maqrizi says: 'It is a wondrous temple, having one hundred and eighty windows; the sun enters every day from one window, then the second until it reaches the last, then returns to the place of its start.' Yaqut recited in the opening of verses: 'If a judge in Dendera... said two lines he wrote.'",
    "book_id": "957",
    "new_page_number": 27
  },
  {
    "serial_number": "6271043",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 29,
    "volume_number": 1,
    "text": "were possessors of weighing minds, and that they had extreme care for Wisdom (philosophy/science), especially the crafts of Geometry and Astronomy.\nSome of those concerned with the news of nations and their histories said: There were in Egypt after the Flood scholars in types of Wisdom, of Mathematical, Natural, and Divine sciences, and verifiers in the science of Burning Mirrors, Talismans, Magic (Niranjiyat), and other things.\nKingship in Egypt from ancient times was in the city of Memphis, which is to the west of the Nile, at a distance of twelve miles from Fustat. When Alexander built the city of (Alexandria) about one thousand four hundred and forty years ago, people desired to inhabit it (1), and it was the abode of science and the seat of wisdom, until the Muslims conquered it in the caliphate of Umar bin Al-Khattab, may Allah be pleased with him. Amr bin Al-Aas laid out his city known as (Fustat), so the people of Egypt and others from Arabs and non-Arabs flowed to inhabit it, so it became the capital of the lands of Egypt and its center to this time of ours.\nIt is said that among the ancient people of science in it was Hermes the Third (2). He was a philosopher roaming the lands, touring cities, knowledgeable of their configuration (3), their horoscopes, and the natures of their people. He has majestic useful writings in arts of wisdom.\nAmong them is Diophantus (4), author of the treatises set down in the science of Number and its properties by way of Algebra and Muqabala.",
    "foot_note": "1. In the original: 'and marveled at building it', corrected from Al-Maqrizi (1: 135).\n2. In the original: 'Hermes the Second', corrected as established from Uyun al-Anba by Ibn Abi Usaibia (1: 17) where he mentioned the three Hermes, and said regarding this Hermes: 'As for Hermes the Third, he lived in the city of Egypt, and was after the Flood.' As for Hermes the Second, he was Chaldean from the people of Babylon. Hermes the First was Egyptian before the Flood, and he is Idris peace be upon him to the Arabs.\n3. In the original: 'bi-nasbiha' (its fraud/erection), and in Uyun al-Anba: 'knowledgeable of the configuration (nasbah) of cities and their natures'.\n4. Ibn Abi Usaibia mentioned him in (1: 245) during the biography of 'Qusta bin Luqa', saying: 'Book on translating Diophantus in Algebra and Muqabala': He also mentioned him incidentally in the biography of Ibn al-Haytham (2: 98).",
    "book_id": "957",
    "new_page_number": 28
  },
  {
    "serial_number": "6271044",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 30,
    "volume_number": 1,
    "text": "Among them is Al-Iskandarani (The Alexandrian) (1), author of the Book of Spheres and the Book of Canon in the Almanac of Stars.\nAmong them is Rosim (2), author of classifications in Alchemy.\nAmong them is Anqilaus the Alexandrian (3) and his companions, who summarized Galen's books in the craft of Medicine, and composed them by way of question and answer; their good summarization indicates their abundant knowledge and excess of understanding.\nAmong them is Valens (4), author of the book known as the Roman Bridge (Al-Baridj), classified in Nativities and what precedes them of Introduction to the science of Astrology judgments. It is said that he is the one who extracted, through long investigation (5) and continuous effort, the horoscopes of the Egyptians.\nThese are the famous people of Wisdom in Egypt in that time. As for this time of ours, every science in it has been obliterated, its trace erased, and its name ignored. Nothing remains but riffraff, scum, ignorant masses, and blind commoners. Most of them are people of foolishness (6), having experience in cunning and plotting,",
    "foot_note": "1. Perhaps 'Oktemon the Alexandrian'. Al-Qifti said in Akhbar al-Hukama (50): 'He was knowledgeable in mathematics, verifier of observations, expert in making their instruments.' He and Meton gathered for observation in the city of Alexandria in Egypt, observed and recorded what they verified, and scholars circulated it after them until the time of Ptolemy Claudius the Observer in Alexandria. 'Their time was five hundred and seventy-one years before his time.'\n2. Al-Qifti mentioned him on p. 127, as 'Rosham'. He said: 'Rosham the Egyptian, this man was in Egypt before Islam, and is an expert in the sciences of Alchemy, its origins, details, and precision of its composition... and he has majestic books on that famous among scholars of this type who compete to acquire and obtain them.'\n3. Al-Qifti wrote his biography in (51-52) and Ibn Abi Usaibia in (5: 103-104). [Note: Likely referencing Nicolaus or Onkelos/Anqilaus].\n4. Al-Qifti mentioned him in (172) saying: 'Valens the Egyptian, and perhaps called Valens the Roman, was a virtuous sage in ancient times in mathematical sciences and astrology judgments. He has beautiful compositions containing majestic purposes of this type. He is the author of the famous book among the people of this craft, called the Roman Bridge.'\n5. In the original: 'Experiment'.\n6. The known form in this source is: Ra'n and Ru'una.",
    "book_id": "957",
    "new_page_number": 29
  },
  {
    "serial_number": "6271045",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 31,
    "volume_number": 1,
    "text": "and they have by nature power over it, subtlety in it, and guidance to it, due to what is in their morals of flattery and politics (1) in which they exceeded everyone before and after, and were singled out for excess in it to the exclusion of all nations, until their affair in that became famous, and proverbs were coined about them. Regarding their malice and cunning, Abu Nuwas (2) says:\n*I gave you pure advice, O people of Egypt... So take a share from an advisor* (3)\n*The Commander of the Faithful cast at you a snake... eater of the snakes of the land, drinker*\n*[Do not leap the leap of the foolish and ride... upon the edge of] the sanctuary of the back, unridden* (4)\n*If a remnant of Pharaoh's lie is in you... then the Staff of Moses is in the hand of Khasib*\nAs for the state of those attributed to science among them, I mention what I stood upon and revealed by testing. I was, in my first sitting there, intensely concerned with the books of Galen and Hippocrates, researching their problems, examining their obscurities. I strove every striving and exerted every effort to find among the people of this craft one from whom I could benefit, increase by his discussion, and spark my mind by his negotiation. I found nothing but people upon whose hearts Allah has set a seal, blinded their sights, obliterated their understandings, and placed a barrier between Wisdom and them. They were, with me, as the poet said:\n*A people, if you sit with them... minds rust by their proximity*\n*They do not make me understand their speech... and what I say is too fine for them*\n*They are many to me just as... I am few in their gathering*",
    "foot_note": "1. In Al-Khitat (1: 49): 'Flattery and ugliness'.\n2. The four verses are in his Diwan (103-104) praising Al-Khasib, Emir of Egypt.\n3. In the Diwan: 'I granted you, O people of Egypt'.\n4. Completion from the Diwan (103), its place is blank in the original. Hami al-Zahr (Protector of the Back): is the camel whose back was protected so it is left alone, not used for anything nor prevented from water or pasture. In the original: 'Mani al-Zahr', corrected from the Diwan. The verse did not appear in Al-Khitat.",
    "book_id": "957",
    "new_page_number": 30
  },
  {
    "serial_number": "6271046",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 32,
    "volume_number": 1,
    "text": "They have adopted characters of abundant disagreement, little fairness, and adhered to slander, obstinacy, rioting, and arrogance. (Due to) their ignorance of the craft of books and their lack of its tools, their lack of its equipment and instruments, their neglect of its conditions, their overlooking of its requirements, the shortness of their minds from grasping its subtleties, and the distance of their intellects from imagining its realities. They did not know that the doctor needs things to aid him in his craft, open its locks for him, clarify its problems, explain its ambiguities, show him its obscurities, give him a taste of the coolness of certainty (1), and clear the darkness of doubts and conjectures from the eye of his insight. These are the Natural Sciences that teach him its principles and beginnings, give him its elements and components (2), and the Syllogistic Laws that guide his mind towards correctness in what he seeks to know and understand, teaching him how to refer (3) its requirements to it, build his measurements upon it, how to proceed from its obvious to its hidden, infer its absent from its apparent, secure against error and the occurrence of nonsense and defect, and verify causes and reasons.\nOne who wants to be a complete doctor and a virtuous sage must look into Mathematical Sciences, especially Astronomical and Musical ones. The most deserving of people to be of this quality are the doctors of the Brilliant Follower King, who only uses the doctor and astrologer for the sake of support, not for the sake of need and necessity. How so, when his view is the highest, his arrow the winning one, his share the lion's share, and his reach the furthest? One who is like him - and there is no like to him in hitting the joints and hitting the mark - is worthy to choose and not be chosen, and to be independent and not seek aid.",
    "foot_note": "1. In the original: 'coolness of the soul', corrected as established.\n2. Al-Ustuquss (Element), also said Ustaquss, is the simple thing from which a compound is composed, like stones, bricks, and trunks from which a palace is composed, and like letters from which speech is composed, and like the one from which number is composed. The four elements are Fire, Air, Water, and Earth. See Mafatih al-Ulum by Al-Khwarizmi (82).\n3. In the original: 'yuhallil' (analyze).",
    "book_id": "957",
    "new_page_number": 31
  },
  {
    "serial_number": "6271047",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 33,
    "volume_number": 1,
    "text": "*Far be it that Time brings his like... Indeed Time is stingy with his like*\nWhen they [did not] task themselves with mastery of what was previously listed, but rather found it long, considered the goal distant, and saw that their purpose from the craft of medicine - which according to them and their opinion is earning - is achieved by what is closer to reach than what the ancients stipulated, and easier to desire, they did not memorize (1) anything but names of a few drugs they dispense in treating every disease without employing their thought in the reality of its type, cause, requirement, and necessity.\nGalen criticized, among the three sects of medicine, the Methodist sect (2), for removing all requirements of the medical craft, and restricting treatment to looking at the disease: is it of the type of evacuation so it is countered by retention, or of the type of retention so it is countered by evacuation, without examining the matter of temperament, age, nature, country, habit, and essence.\nWhat do you think of Galen if he witnessed these people who do not stick to a creed, nor attribute themselves to a sect? If a patient is cured at their hands, his cure is by way of coincidence, and if he perishes, it is by necessity and desert. They are as the poet said about their likes:\n*And an experienced doctor who has no mind... succeeded in everything he tries by habit*\n*He passed one day by a sick man so we said... Cool your eye (be happy), you have been granted martyrdom*\nAnd as another said about some of our sages famous among the commoners for skill and precedence:\n*Say to the plague: You and Ibn Zuhr... have exceeded the limit and the end*\n*Be gentle with creation a little... one of you is enough*\nOr as some contemporary said about them:\n*And a juggler doctor... mixes medicine with incantations*",
    "foot_note": "1. In the original: 'So they did not memorize'.\n2. In the original: 'The Mountain Sects' (Al-Firaq Al-Jabaliyya), likely a corruption of 'Al-Hilah' (Methodist) or referring to empiricists.",
    "book_id": "957",
    "new_page_number": 32
  },
  {
    "serial_number": "6271048",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 34,
    "volume_number": 1,
    "text": "*We never saw him treat... a patient and succeed*\n*Rather lack of health in... body and heart and survival*\n*Possessor of attributes that leave the... body from what it met*\n*Lacking movement and... sense and lightness and purity* (1)\n*He watered him death with it... and did not know what he watered*\nAnd another said:\n*Pulse never crossed his mind... a day nor does he know what is the water (urine)* (2)\n*Rather he thought medicine is a Durra'ah (robe)... and a beard white like cotton* (3) [*]\n***\nAmong the amusing things I heard is that there was recently in Egypt a man attached to the Maristan (Hospital) who was summoned to patients just as doctors are summoned. He would enter upon the patient and tell him funny stories and amusing myths, and make funny faces for him. He was, with that, gentle in his humor, expert in it, and capable of it. If the patient's chest expanded and his strength returned, he left him and departed. If he needed to return to the patient, he visited him until he recovered, or whatever Allah willed happened.\nWould that the doctors of this age of ours were all capable of such treatment which has no harm and no disaster; rather, its matter is easy on the sick, and its benefit is apparent and clear. How not, when it enlivens the soul, spreads the instinctive heat, strengthens natural powers, and strengthens the body to repel bad harmful humors and wastes, while preserving the principles.\nMost of its prominent (4) doctors are Christians and Jews. Regarding that, some of them said:",
    "foot_note": "1. The place of this word is blank in the original.\n2. Meaning testing the patient's water, i.e., urine.\n3. Durra'ah: A jubbah slit in the front.\n4. In the original: 'Al-Muzabarqin' (The decorated/fake). [*] (Shamela Comment): The two verses were narrated by Al-Imad in Al-Kharidah 2:120 attributed to Al-Ayni Al-Masri, then he said: 'I found these two verses in Abu al-Salt's epistle attributed to Zafir al-Haddad.' [Noted in the Addendum]",
    "book_id": "957",
    "new_page_number": 33
  },
  {
    "serial_number": "6271049",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 35,
    "volume_number": 1,
    "text": "*I say to Muslims all... do you seek fame in our medicine* (1)\n*Far from it! You attempted an impossibility... be then Jews or Christians* (2)\nThe most similar of those I saw among them whom I include in the count of doctors is a Jewish man called Abu al-Khayr Salamah bin Rahmun. He met Abu al-Wafa (3) Al-Mubashir bin Fatik (4), and took from him something of the craft of Logic by which he specialized and distinguished himself from his peers. He caught up with Abu Kathir bin Al-Zaffan (5), the student of Abu al-Hasan Ali bin Ridwan (6), and read some of Galen's books to him. Then he set himself up to teach all books of Logic, and all books of Natural and Divine Philosophy. He explained, interpreted, and summarized according to his claim, but he was not all that (7) in his attainment and verification, and his investigation of the subtle and precise knowledge. Rather, he multiplied (8) his speech and erred, and hastened his answer and slipped.\nI asked him in my first meeting and gathering with him about issues with which I opened his discussion (9), which can be understood by one whose span in knowledge has not yet extended, and whose depth and breadth have not increased. He answered them with what revealed his shortcoming, spoke of his inability, and expressed his poor",
    "foot_note": "1. In the original: 'tibbiha' (its medicine).\n2. The following text was quoted by Al-Qifti in Ikhbar al-Ulama (142-143), and also Ibn Abi Usaibia (2: 106).\n3. After this begins the fragment preserved in Dar al-Kutub No. 354 History of the Egyptian Epistle, and I will refer to it in comments with the symbol 'Q'.\n4. Al-Qifti wrote his biography (176-177) and said: 'This man is originally from Damascus and his home is Egypt. He is one of the exemplary sages in the science of the ancients... He had a daughter who lived long after him and narrated Prophetic traditions in Alexandria. He was at the end of the fifth century AH.'\n5. In Al-Qifti: 'Al-Kathir Al-Barqani', corruption. Abu Kathir is a kunya and his name is Ephraim bin Al-Zaffan. Ibn Abi Usaibia said in (2: 105): 'Of Israelite religion, and he is one of the famous doctors in the lands of Egypt.' Al-Afdal bin Amir al-Juyush bought ten thousand volumes of his books from him, which some Iraqis had bargained for.\n6. See his biography in Ibn Abi Usaibia (2: 99).\n7. Q and Ibn Abi Usaibia: 'wa lam yakun hunaka' (he was not there/not up to par). In Al-Qifti: 'wa lam yakun hunalik'.\n8. In the original: 'tarahu yukthir' (you see him multiply), I established what is in other sources.\n9. In the original: 'istaqbahtu mabahithahu biha' (I found his discussions of them ugly), corrected in other sources.",
    "book_id": "957",
    "new_page_number": 34
  },
  {
    "serial_number": "6271050",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 36,
    "volume_number": 1,
    "text": "conceptualization and understanding. His likeness in the greatness of his claims and his falling short of the easiest of what he undertakes (1) is like the poet's saying:\n*He tucks up his leg for the deep sea... while the wave submerges him on the shore*\nOr as another said:\n*You wished for two hundred knights... but one knight turned you back* (2)\nThere was (3) in Egypt a doctor from Antioch named \"Georges\", nicknamed the Philosopher, in the manner of what is said about the crow: Father of White, and about the stung: Salim (safe). He devoted himself to teasing [Abu al-Khayr Salamah bin Rahmun the Jewish Egyptian doctor (4)] and disparaging him. He used to forge medical and philosophical chapters, presenting them in the guise of the people's expressions, while they were absurd with no meaning, and empty with no benefit. Then he would send them (5) to him asking about their meanings, and seeking clarification of their purposes. So he would speak on them and explain them according to his claim without vigilance (6) or (7) reservation; rather, with looseness and haste, lack of concern and poor attention. So there would be taken from him (8) what causes laughter and expands the chest.\n[I was recited (9)] by this Georges about him, and it is among the best I heard in satirizing an ominous (10) doctor, and I suspect him of it:",
    "foot_note": "1. In the original: 'nashr ma huwa muta'atihi', corrected in other sources.\n2. Here ends Al-Qifti's quotation in 142-143. See Al-Bayan (1: 249).\n3. The following text was quoted by Al-Qifti in 109 and Ibn Abi Usaibia in (2: 106-107).\n4. Completion from Al-Qifti, and instead in Ibn Abi Usaibia: 'Ibn Rahmun'.\n5. Q only: 'then he sends with them'.\n6. Q only: 'Tayaqqun' (certainty).\n7. From Al-Qifti and Ibn Abi Usaibia.\n8. Al-Qifti and Ibn Abi Usaibia: 'so there is found in it from him'.\n9. From Q, Al-Qifti, and Ibn Abi Usaibia.\n10. The word 'ominous' and what follows is missing from Q. In the original copy: 'And among the best said in dispraising the ignorant doctor'.",
    "book_id": "957",
    "new_page_number": 35
  },
  {
    "serial_number": "6271051",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 37,
    "volume_number": 1,
    "text": "*Indeed Abu al-Khayr despite his ignorance... the virtuous is light in his scale*\n*His poor patient because of his bad omen... is in a sea of destruction having no shore*\n*Three enter in one batch... his face, the coffin, and the washer*\nAnd by some of them:\n*Abu al-Khayr in treat... ment has a hand that falls not short*\n*Everyone who seeks his medicine... after two days is buried*\n*And that which was absent from you... and we witnessed is more* (1)\nAnd among what was said about him:\n*The madness of Abu al-Khayr is madness itself... and every madness is to him the height of reason*\n*Take him and shackle him and tighten his bond... for he is not sane who underestimates a deranged person*\n*He used to harm people with words alone... now he has become harming people with words and deeds* [*]\n***\nAs for the astrologers now in Egypt, they and their doctors are as the lace is cut from the leather, rather as the shoe is sized by the shoe (identical). The best of them does not relate to the science of stars by more than a horoscope (Zaija) he draws (2) and centers he calculates. As for diving deep and navigating in knowing causes and reasons (3), and first principles,",
    "foot_note": "1. In the original copy: 'wa sami'na bi-wasfihi' (and we heard of his description). I established what is in Q and Ibn Abi Usaibia. Al-Qifti did not narrate these verses.\n2. It came in \"Mafatih al-Ulum\" by Al-Khwarizmi 127: \"The Zaija is a square or circular image made for the positions of stars in the sphere to look into for judgment for a birth or otherwise. Its derivation in Persian is from Za'ish, meaning birth, then the word was Arabized and used for birth and otherwise.\" It came in Steingass dictionary (608): \"Zaija - astronomical tables\". In the original copy: \"Zairaja\", I established what is in Q. Zairaja is - as Ibn Khaldun mentioned in the Muqaddimah - a branch of the science of Simia (letter magic), by which answers can be extracted from questions by a connection between words. From the poetic Zairaja, answers can be known by special methods and calculation involving addition, subtraction, and multiplication. There is another similar word, which is Zij, plural Azjaj. The Zij: a mathematical craft with numerical laws by which months, days, and past and future dates can be known, and it is the constitution for what astronomers call the Almanac. \n3. This is what is in Q. In the original copy: 'and knowing causes and reasons' (repetition). [*] (Shamela Comment): This speech appeared in Ikhbar al-Ulama bi-Akhbar al-Hukama by Al-Qifti p. 159. [Noted in the Addendum]",
    "book_id": "957",
    "new_page_number": 36
  },
  {
    "serial_number": "6271052",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 38,
    "volume_number": 1,
    "text": "there is none among them who ascends to this degree, or rises to this rank, or flies in this atmosphere, or seeks light from this light (1) except Abu al-Hasan Ali bin al-Nadr (2) known as Al-Adib (The Man of Letters), may Allah be pleased with him, from the people of Upper Egypt. He was among the [notable (3)] virtuous ones, counted among the good things of this time (4). We will mention him in what we resume, Allah Almighty willing.\nAs for the imitating sect whose share of knowledge is husks without kernels (5), appearances without interiors, and bodies without spirits, the best among them now is a man known as Rizq Allah al-Nahhas (6). He has in the branches of this craft some training and experience, and with its experimentations (7) some expertise. He is the greatest of astrologers there and their elder who taught them, and their prince in whom they seek refuge (8). All of them are attributed to him, written in his register, acknowledging his merit, and scooping from his sea (9). He is a man of natural wit who jokes and acts dissolute (10).\nAmong his amusing stories about himself, he said: An Egyptian woman asked me to look for her into a camel matter (Jmaliyya) concerning her. So I took the altitude of the sun for the time, verified the degree of the ascendant, the twelve houses, and the centers of the planets. I drew all that before me",
    "foot_note": "1. In the original: 'la yuhalliq' and 'la yastadi'', I established what is in Q (without 'la' - negation).\n2. In the original: 'Ibn al-Nasr' with un-dotted Sad. I established what is in Q.\n3. From Q.\n4. Q: 'min hasanat al-zaman'.\n5. In Al-Lisan: 'Lubb of walnut and almond etc.: what is in its cavity, plural Lubub'. Q: 'Al-Lubab'. What I established from the original is more fitting.\n6. In the original: 'Bin al-Nahhas', corrected in Q and Al-Qifti 127.\n7. In the original: 'and with its particulars', I established what is in Q. In Al-Qifti: 'and with its experiments'.\n8. Q: 'who praised them and presented them'. In Al-Qifti: 'and their elder who taught them magic' only.\n9. In the original: 'and from his knowledge', I established what is in Q.\n10. Yatakhal'a: Shows Khala'a (dissoluteness/shamelessness). In the original: 'Yatakhalaq', corrected in Q.",
    "book_id": "957",
    "new_page_number": 37
  },
  {
    "serial_number": "6271053",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 39,
    "volume_number": 1,
    "text": "on the calculation board (1), and began speaking about each house of them as usual, while I was during that sensing her matter (2) and she was silent not uttering a word. I was baffled by that and a great languor overtook me, and she had thrown a dirham to me (3). He said: So I resumed speaking and said: I see upon you a loss in the house of your wealth (4), so preserve and beware! She said: Now you have hit the mark and spoken the truth. By God, it was as you mentioned. I said: And did you lose anything? She said: Yes, the dirham I threw to you! And she left me and departed.\nEgyptians are the people who use astrology judgments most, believe in them, rely on them, are fond of them, and rest in them. It has reached such an extent in their affair that not one of them makes a movement of the partial movements whose arts cannot be counted nor its parts and directions obtained, nor its directions controlled, nor its ends restricted (5), nor its types numbered except in horoscopes they choose, [and configurations they rely upon (6)].\nI witnessed one day a man from the stokers in the bathhouse furnace (7) asking the mentioned Rizq Allah about a praiseworthy hour to cut his nails. I marveled at the height of his ambition despite the lowness of his status (8) and the baseness of his profession.\nAmong the amazing stories regarding their excessive use of astrology judgments and care for them,",
    "foot_note": "1. This is in Q, in the original: 'in the board'.\n2. Q: 'sensing for her'.\n3. Al-Qifti: 'and she had thrown a dirham to me'.\n4. This is in Q and Al-Qifti, in the original: 'loss of the house of your wealth'.\n5. Q: 'nor its styles estimated'.\n6. From Q.\n7. Q: 'furnace of a bathhouse'.\n8. Q: 'with the lowness of his status'.",
    "book_id": "957",
    "new_page_number": 38
  },
  {
    "serial_number": "6271054",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 40,
    "volume_number": 1,
    "text": "is what I witnessed in Upper Egypt. A governor imprisoned a man from [some of (1)] the people of that area who used to look into the science of stars. Someone dear to him interceded (2) for him, so he accepted the intercession and ordered his release. He was in the prison in constant torment and exhausting fatigue. When they came to him and said: Go to your affair (3), he took out an astrolabe from his sleeve and looked into it, then took the ascendant of the time and looked into it. He found it blameworthy, so he asked them to leave him in his place (4) until a time agreed upon suitable for leaving the prison. They returned to the governor and told him his news (5). He laughed at him and marveled at his ignorance and corruption of his mind, and granted his request, left him in his state, and prolonged the duration of his detention.\nIn what I cited of the news of doctors and astrologers now in Egypt is sufficiency and communication, until I stand for it a second standing, and say in it a healing saying.\nNow, I mention conditionally those whom I met of its men of letters and wits, and its virtuous ones in literature and its scholars.\nThe most deserving of precedence, and most worthy of the fullest share of glorification is \"Judge Abu al-Hasan Ali Ibn al-Nadr (6)\" known as Al-Adib. Possessor of abundant literature, vast knowledge, and brilliant virtue. He has in all parts of Wisdom the long hand (mastery) and the first rank.\nHe had come to Fustat seeking from its Vizier nicknamed Al-Afdal employment and service, but his hope was disappointed in him,",
    "foot_note": "1. From Q.\n2. Q: 'so he interceded'.\n3. Q: 'to your path'.\n4. In the original: 'to be patient with him', I established what is in Q.\n5. In the original: 'his news', I established what is in Q (telling him his news).\n6. In the original: 'Al-Nasr' with un-dotted Sad, corruption corrected in Q and Al-Kharidah (2: 195) from Dar al-Kutub manuscript No (10098 Z) and Al-Tali' al-Sa'id by Al-Adfuwi. Where he mentioned he was one of the workers of the Egyptian lands in the time of Al-Afdal Shahanshah.",
    "book_id": "957",
    "new_page_number": 39
  },
  {
    "serial_number": "6271055",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 41,
    "volume_number": 1,
    "text": "his hope was lost, and his endeavor failed. So he said from a poem in which he blames Time, and complains of disappointment and deprivation:\n*Between pride and humiliation is a path... whose lighthouse is apparent to the eye of every successful one*\n*So walk it in all places and avoid... the arrogance of the proud and the humiliation of the flatterer*\n*I have brought of merchandise the best... to the most majestic chosen one and most generous pious one* (1)\n*And I hoped for ease of life under his canopy... inevitably whether I sold (my wares) or did not sell* (2)\n*A thought resembling certainty and I did not imagine... that Time, with what it watered me, would make me choke*\n*And to my blamer for greed is a clear saying... if you had seen a cloud you would not have slept* (3)\n*I did not seek except the best seeking and I did not... connect hope with a rope other than the most trustworthy* (4)\n*And if Destiny refuses provision to a man... the trick of the seeker of provision does not avail him*\n*By the life of the hostility of calamities, even if it threw... my gathering with an arrow, it scattered and dispersed* (5)\n*I will fight Time defending my chivalry... and I am forbidden the glory of victory if I am not truthful* (6)\nAnd he has regarding this trip of his (7), when his despair of reaching his hope and attaining his desire became strong, and he resolved to return (8) from Fustat to his residence, urging asceticism, encouraging contentment,",
    "foot_note": "1. In the original: 'I have brought of merchandise the bulk... from every chosen one and most generous of what is selected' [I established what is in Q, Al-Kharidah and Al-Tali' al-Sa'id. However, the last word in Al-Tali' al-Sa'id is: 'Muwathaq'.\n2. Q: 'And I found'. The word 'Riwaqihi' (canopy) is in the original: 'Zilalihi' (shadows), I established what is in Q and Al-Kharidah. In Al-Tali' al-Sa'id: 'under his robe', corruption.\n3. In the original: 'wa li-'a'ini' corrected in Q. In Al-Kharidah: 'wa li-'atibi'.\n4. Q: 'Bi-ghayr habl al-awthaq', in Al-Kharidah: 'Bi-habl ghayr muwathaq'.\n5. In the original: 'ramat hazzi' (threw my luck), corrected in Q and Al-Kharidah.\n6. In the original: 'la-asiranna al-ya's' (I will become despair), corrected in Q and Al-Kharidah.\n7. In the original: 'And he has from a poem other than this', I established what is in Q and Al-Kharidah.\n8. Q: 'Al-Sudur', both are correct.",
    "book_id": "957",
    "new_page_number": 40
  },
  {
    "serial_number": "6271056",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 42,
    "volume_number": 1,
    "text": "condemning humbleness, and regretting the humiliation of his cheek and the spilling of his face's water (dignity):\n*My sorrow for a kingdom of contentment, had I... enjoyed in it his possession, the possessor*\n*And for a treasure of despair I had acquired... if calamities had not wreaked havoc in it and destroyed*\n*I swore to make the water of my face after it... like blood spilled by pilgrims at a rite*\n*And a brother of beautiful patience whom I cut off... in obedience to the hope that was not attained*\n*O may Allah fight Necessity as a state... which path has it not taken the youth through* (1)\n*How often I spent the night complained to [it stripped... my rings knocking] with the palm of a restrainer* (2)\n*And a mouth on a foot it threw, and eyes... whose sockets were kohl-ed with the tread of a hoof* (3)\n*And clothed in patience and piety, she called... so he turned away from her in the exhibition of the ascetic* (4)\n*She kept turning him like the turning of the stick... the head of the camel to a kneeling place from a kneeling place*\nAnd he has to a chief whom he used to task with visiting him but he sat back from that out of grandeur and arrogance:\n*Did you consider yourself too great to walk a coincidence... and you imposed it on me, you have tasked me with excess* (5)\n*Do not lie, for we would not have obliged a... right while you see it has dropped from you*\n*If I sold you the soul a sale you would own it... by, justice would be a stipulated condition upon you* (6)\n*So is there a way that you do not contact me... and do not task the likes of me with these plans* (7)\n*Perhaps the page of what is between me and you might... be folded and not include other than what has passed* (8)",
    "foot_note": "1. This is in Q and Al-Kharidah, in the original: 'O may Allah fight Necessity, for it... walked paths with the youth he did not walk'.\n2. In the original: 'lam ya'ti' (did not come), the correction of the verse and its completion from Q and Al-Kharidah.\n3. This verse is missing from the original.\n4. In the original: 'clothed in victory', corrected in Q and Al-Kharidah.\n5. In the original and Al-Kharidah: 'Musarafatan' (exchanging) with Ra', I established what is in Q (Musadafatan - coincidence/meeting).\n6. Q and Al-Kharidah: 'by it upon me, justice would be'.\n7. In the original: 'and do not task the likes of me with roads and plans', corrected in Q and Al-Kharidah.\n8. In the original: 'and what has passed of our affair', corrected in Q and Al-Kharidah.",
    "book_id": "957",
    "new_page_number": 41
  },
  {
    "serial_number": "6271057",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 43,
    "volume_number": 1,
    "text": "And he (1) has in the opening of a letter:\n*Your letter came out of anger so it comforted me... with what it contained of the comfort of the eye with sleep* (2)\n*I read it so its meanings flowed in every limb... of mine as water flows in the branch* (3)\n*I do not say you sent the soul in it to... my heart, but you sent the soul into my body*\nAnd he has regarding the severity of his affliction:\n*O Answerer of the prayer of the one seeking refuge in Him... and O Reliever of the night of dark distress*\n*The doors have been locked against us and prevented... and Your door is above prevention and locking*\n*We fear Your justice that the decree runs by it... and we hope in You, so be for the fearful, the Hope* (4)\nAmong its famous poets is Abu al-Tahir bin Ismail bin Muhammad known as Ibn Miknasa (5). He is a poet of much versatility, little affectation, mastering the embroidery (6) of serious poetry and humorous, and having a share in its delicate and robust styles. In the prime of his youth and the beginning of his novelty, he loved a boy from the sons of the Egyptian military called Izz al-Dawla Fa'iq. He is now in Egypt one of the counted men of its state and its prominent elders. He remained residing on his love for him and infatuation with him until hair erased his beauties and time changed his features. This Mu'izz al-Dawla (7) remained committed to him, benevolent to him, encompassing him, until Time separated them.\nHe was in the days of the Commander of the Armies Badr al-Jamali attached to an official of the Christians known as Abu Malih,",
    "foot_note": "1. After this word in the original is a blank space of about two pages from the original. I was able to fill this gap from Q and Al-Kharidah. The common part between Q and Al-Kharidah ends at the word 'Al-Raji' (the Hope), the conclusion of the following Jim-rhymed verses, then 'Q' is unique in completing the deficiency which I will note the end of.\n2. In Al-Kharidah: 'fa-ab'asani' (so it made me miserable), corruption corrected in Q and Al-Tali' al-Sa'id. Its opening in Al-Tali' al-Sa'id (222): 'Wafa kitabuka' (Your letter arrived).\n3. In Al-Tali' al-Sa'id: 'Nafakhta al-ruh' (You breathed the soul).\n4. Here ends the common part of the completion between Q and Al-Kharidah, then 'Q' continues alone.\n5. Ibn Shakir wrote his biography in Al-Fawat (1: 26) and said: 'He died around the year five hundred.'\n6. In the original: 'Wa'y' (consciousness).\n7. Previously mentioned as 'Izz al-Dawla Fa'iq' and thus they appeared in the original.",
    "book_id": "957",
    "new_page_number": 42
  },
  {
    "serial_number": "6271058",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 44,
    "volume_number": 1,
    "text": "and most of his poems were about him. When the command transferred to Al-Afdal, he attempted to praise him, but he did not accept him nor turn to him. The reason for his deprivation was what preceded for Abu Malih and his elegies for him when dead, especially his saying:\n*The sky of hono... rs was folded and the sun of praise was wrapped up*\n*He was not of the weak, vile... of men nor the stingy*\n*The Christians disbelieved after they... tied the religion of the Messiah to him*\nIzz al-Dawla bin Fa'iq sponsored him and took care of his condition until he died.\nAl-Afdal did not turn to any of the poets as he turned to a man from the people of Ma'arrat al-Nu'man (1) called Abu al-Hasan Ali bin Ja'far bin al-Nun (2). He poured upon him the clouds of his beneficence, and made flow for him the milk of his favor, titled him Amin [Al-Mulk (3)], brought him close, and singled him out. His poetry was not there (up to par) (4), rather it was affected and arbitrary. I do not know anyone from the people of those lands who narrates a single verse or more of his, due to the aversion of natures to his speech and the repulsion of ears from his method.\nAl-Afdal ordered him one day to describe a gathering in which fruits and basils were arranged. So he said from his Muzdawijah (couplet poem) (5) describing the fingered citron (Utrujj Musabba'):\n*As if its fingered citron... is hands of criminals cut from wrists*\nHe erred and did not realize, and behaved badly and did not feel; because he intended to praise the citron but made the King's soul disgusted by it and turned it away from it. Had he intended to disparage it, he would not have added to what he described of hands cut from their wrists. The skillful eloquent one is he who, if he describes something, gives it its due, fulfills its condition, and describes it with what",
    "foot_note": "1. Here ends the omission I noted at the beginning of the previous page.\n2. Q: 'Al-Nuwayn'.\n3. From Q.\n4. In the original: 'hunaka bi-l-jayyid' (there in good quality), corrected in Q, and the word 'bi-l-jayyid' is inserted.\n5. In the original: 'Muzdawijat', corrected in Q.",
    "book_id": "957",
    "new_page_number": 43
  },
  {
    "serial_number": "6271059",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 45,
    "volume_number": 1,
    "text": "suits it in both states of praise and blame, and puts everything in its place in his prose and verse (1). Where is this poet in his etiquette, skill in the craft (2), and intelligence, compared to Abu Ali al-Hasan Ibn Rashiq, when Al-Muizz bin Badis ordered him to describe a [fingered (3)] citron that was before him (4), so he said improvising on the spot:\n*A citron with smooth tips, soft... meeting the eyes with beauty not diminished (5)*\n*As if it spread a palm to its Creator... praying for long life for Ibn Badis*\nIf Ibn al-Rumi intended to praise the rose by his saying:\n*O praiser of the rose, his mistake never ceases (6)... did you not contemplate it in the palm of its picker*\n*Like the anus of a mule when he exposes it... during defecation while the rest of the dung is in its center*\nHe would have been mistaken, ignorant, or heedless. But he said that when he intended to blame it and wanted to demean it. Look at this comparison, the likes of which in wonder has not been heard. So may Allah curse his devil (7)!\nLikewise Abdullah bin al-Mu'tazz in his saying describing the moon in verses:\n*It spent the night as it pleased its enviers... when it sought nearness to sleep it deviated (8)*\n*The larvae of mosquitoes provoke it... in a moon like the back of a rat (9)*\nAnd the saying of Ibn al-Mu'tazz about the moon in verses:\n*O thief of lights from the morning sun... O bereaver of my good sleep and my disturber*",
    "foot_note": "1. Q: 'of his prose and verse'.\n2. Q: 'and his knowledge of the craft'.\n3. From Q.\n4. In the original: 'in his hand', I established what is in Q.\n5. Mabkhus: Diminished. In the original 'Manhus' (ominous), corrected in Q.\n6. This is in Q. In the original: 'min ghalat'.\n7. This is in Q. In the original: 'May Allah curse that'.\n8. In Diwan Ibn al-Mu'tazz (2: 116): 'As it pleased its enemies'.\n9. In the original: 'fa-min qamar', corrected from the Diwan.",
    "book_id": "957",
    "new_page_number": 44
  },
  {
    "serial_number": "6271060",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 46,
    "volume_number": 1,
    "text": "*As for the sun's light in you, it is decreasing... and I see the heat of its fire has not decreased*\n*The comparison in you did not succeed with anything useful... peeling off vitiligo like the skin of a leper* (1)\nThis is a chapter that if we investigated thoroughly would lengthen and widen (2), so let us leave it and connect of our rope what was cut (3).\nIsmail bin Miknasa (4) said in a poem:\n*O blamer, winds of blame did not blow... on the fire of my passion except it increased in burning*\n*So leave me to an eye that if its water dries... sees it a right of love to shed blood*\n*How many tears gave their rein to my passion... in the evening when they drove the bridled riding camels*\n*And an eye protected by the memory of days spent in Al-Hima... from sleep visiting it*\n*And by God, a heart whose worries struck it... so no edge remained of it except it was notched* (5)\nAnd he has from another:\n*The knots of his waist became thin as if they... were derived from his promise and my endurance* (6)\n*And his temples curled as if they... were stolen from his curly character* (7)\n[And from it (8)]:",
    "foot_note": "1. In the Diwan: 'minka bi-ta'il' (from you with anything useful). In the original: 'bi-maslakh', corrected in Q. In the Diwan: 'Muslakh'.\n2. This is in Q. In the original: 'If I investigated it, it would widen'.\n3. This is in Q. In the original: 'of our purpose what was cut'.\n4. Q: 'Abu al-Tahir bin Miknasa', both are correct.\n5. In the original: 'mithlama', I established what is in Q and Al-Kharidah (2: 301).\n6. In the original: 'min qaddihi' (from his stature), corrected in Q. In Al-Kharidah (2: 299) 'min tihihi' (from his pride), which is not correct.\n7. In the original: 'min sha'rihi' (from his hair), I established what is in Q and Al-Kharidah.\n8. From Q.",
    "book_id": "957",
    "new_page_number": 45
  },
  {
    "serial_number": "6271061",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 47,
    "volume_number": 1,
    "text": "*Why does he act harshly while people claimed... that dew (generosity) is specific to the moist (generous) face* (1)\n*Do not let a reddened cheek deceive you... that became thin, for in the ruby is the nature of the rock*\nAnd he has from a poem:\n*And a soldier always wherever... you meet him meets you with all weapons*\n*His eyebrow is a bow and his eyelids... are arrows and his sides are the bending of spears*\n*[He went and the wine did to him as... the breeze of winds does to the branch (2)*\nHe raided in this last verse upon Khalid al-Katib in his saying:\n*My eye saw two sights in him as it saw... the sun and the illuminating moon on earth* (3)\n*In the evening when he greeted me with roses as if... cheeks added some to some* (4)\n*[And handed me a cup as if its mixture... was my tears when sleep turned away from my eye (5)]*\n*He went and the wine did in his movements... like the action of the breeze of wind in the tender branch*\nAs for the verse before it (6), poets have circulated it.\nAmong the pleasant things that occurred in it is the saying of some of the contemporaries:\n*I have from the Sons of the Yellow (Romans) a gazelle who threw... at my heart with the arrow of the hitting Houris*\n*An arrow of the glance he threw at me... from near, a bow of the eyebrow*\n*As if his eye in the bowels... is the sword of Ali bin Abi Talib*\nAnd he has regarding paper gifted to him:",
    "foot_note": "1. The word 'yajfu' (act harshly) is missing from the original. Established from Q and Al-Kharidah.\n2. The verse is missing from the original, established from Q and Al-Kharidah (2: 301).\n3. In the original: 'Ka-annama huwa al-shams' (as if he is the sun), I established what is in Q and Al-Kharidah.\n4. In the original: 'ala ba'd', I established what is in Q.\n5. This is from Al-Kharidah only.\n6. Meaning his saying: His eyebrow is a bow and his eyelids... are arrows and his sides are the bending of spears.",
    "book_id": "957",
    "new_page_number": 46
  },
  {
    "serial_number": "6271062",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 48,
    "volume_number": 1,
    "text": "*He gifted us paper thin... ner than the impossible drink in creation*\n*The lines tear it... as if it is the honor of the miser*\n*Neither colored nor polished... nor wide nor long*\n*Except whiteness you thought... leprosy on a skinny body* (1)\nSome of the contemporaries exhausted this meaning, saying mentioning a bundle of paper brought out to him from the Sultan's treasury, used in the Diwan of Correspondence. Some writers of the Diwan used to steal paper, but that bundle was safe from him due to its ugliness and low price:\n*And paper that resembles our states... in every meaning and mimics them*\n*A form was made generic for handwriting in it... nothing in ugliness approaches it* (2)\n*Whatever our pens draw in it... penetrates through its page*\n*We deposit our hidden secrets in it... and it reveals them to the glances*\n*Different parts, rough... the palm touches it and it makes it bleed*\n*Like the skin of a leper in its color... describing according to truth and resemblance*\n*If it were a character/creation it would be repugnant... or if it were a creation it would be a deformation*\n*It stumbles the pens until you see... their sharp edges blunted in it* (3)\n*It leaves them, their ends resembling... their tops in lack of sharpening* (4)\n*After its sharpener imitated with its tips... the tips of the brown spears of handwriting* (5)",
    "foot_note": "1. This verse is missing from Q.\n2. In the original: 'fiha ma yudaniha', corrected from Q.\n3. In the original: 'yughayyir al-aqlam' (changes the pens), I established what is in Q.\n4. The first word is missing from the original, as is the word 'al-bara' (sharpening) and half the word after it, completion from Q. In Q: 'fi qidam al-bara', and the explanation is what I established from the original. Hawadiha means its beginnings, i.e., heads.\n5. The verse appeared in the original truncated, ending with the word 'atraf' (tips), completion from Q.",
    "book_id": "957",
    "new_page_number": 47
  },
  {
    "serial_number": "6271063",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 49,
    "volume_number": 1,
    "text": "*And the fingertips do in running over it... like lightning ... it* (1)\n*And how many have come to steal it striving... who would ransom it with their soul*\n*He who sees its layers says... may the hand that packed it be paralyzed*\n*The weevil has messed with its middles... and the mouse has gnawed its edges* (2)\n*If his bundle were offered you would not find... a buyer among creation to buy it*\n*If he offered a penny for it mistakenly... it would be the widest waste and foolishness* (3)\n*The thief does not take from it nor... does anyone assassinate it by a trick in it* (4)\n*The pebbles are counted fully... before its faults are counted* (5)\n*Whoever blamed a possessor of deficiency or baseness... he means it by that blame* (6)\nAbu al-Tahir (7) said:\n*I said when coquetry curled... the hair on his cheek*\n*This is a sign by which... beauty appeared and spread*\n*Never before his temple was seen... a scorpion solving (settling in) the moon* (8)\nThis is a pleasant meaning but he stole it from two verses recited to me in Egypt by a man named Abu Muhammad Al-Takriti, one of Abu Hamid Al-Ghazali's students, attributed to Abu Hamid, and I did not hear them from anyone else:",
    "foot_note": "1. Thus the verse appeared in the original, and it is missing from Q.\n2. In the original: 'bi-atrafiha' (its tips), the correction is what I established from Q.\n3. Tadyi'an (waste) appeared thus.\n4. In the original: 'na'ba laha' corrected in Q. And 'min hilah' is in the original and Q: 'fi hilah'.\n5. 'Mustawfiyan 'addahu', its place is blank in the original, establishment from Q.\n6. The word 'wa dha khissah' (and possessor of baseness) place is white in the original, establishment from Q.\n7. He is Abu al-Tahir Ismail bin Muhammad, known as Ibn Miknasa, his name was noted previously on p. 43.\n8. In Al-Kharidah (2: 302): 'Never was seen at all before this'.",
    "book_id": "957",
    "new_page_number": 48
  },
  {
    "serial_number": "6271064",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 50,
    "volume_number": 1,
    "text": "*The scorpions of his temple settled in his cheek... a moon, so he became too majestic by it for comparison* (1)\n*And we have known it (Scorpio) settling in its constellation... so among the wonders is how it settled in it (the moon)*\nAbu al-Tahir also said from a poem, when some Emirs resolved upon him to go out (2) with him to Sham to fight the Ghuzz (3), beginning:\n*Not disobeying you is the straightening of my stick... so decrease my blame or increase* (4)\n*Say to my master when he called me to a matter... in which I stood for him the station of slaves*\n*My trick is weak and my utility is little... and my end is near and my new is worn out* (5)\n*What do I have to do with Sham when I... see the fire of its war kindled*\n*A land whose Jinns are the demons of the Ghuzz... and a land whose beasts are lions* (6)\n*And the pits (Jifar) that say whenever... it is said: Are you not full?: Is there any more?* (7)\n*And it is as if I see myself on a camel... the last of people in the crowd of crowds* (8)\n*Black-faced looking into matters... dilemmas of accidents, black*",
    "foot_note": "1. Thus narrated in Wafiyat al-A'yan, in the biography of Abu Hamid Al-Ghazali. In Al-Kharidah and Q: 'wa yajillu bihi 'an al-tashabbuh'. Ibn Khallikan said: 'And I saw these two verses in another place attributed to someone else.'\n2. Q: 'fi al-masir' (in marching).\n3. In Al-Lisan and Al-Qamus 'Al-Ghuzz' is a race of Turks. See Ibn Al-Athir (9: 141-147).\n4. In the original: 'ghayr 'adin', corrected from Al-Kharidah (2: 308). In Q: 'Aasin' (hard/difficult), it is said 'asa' if it became hard.\n5. Al-Ghana', with Fath: Benefit/Utility. In the original: 'ana'i' (my suffering), corrected in Q and Al-Kharidah (2: 308).\n6. In the original: 'hannah', corrected in Q and Al-Kharidah. Al-Afariyah with Ya before the end: plural of 'Ifriyah, which is Ifrit. In the original: 'afaribah', and in Q and Al-Kharidah: 'afarituh', their correction is what I established. See Al-Lisan (Afar 263).\n7. Al-Jifar: plural of Jufrah with Damma, which is a wide round pit. In the original and Q: 'alladhi yaqul' (which says), corrected in Al-Kharidah. In Al-Kharidah: 'qila imtala'ti hal mazid', and in Q: 'qul hal imtala'ti', and the meter does not fit with either. The correct is what I established.\n8. In the original: 'wa ka-anni ala', I established what is in Q and Al-Kharidah.",
    "book_id": "957",
    "new_page_number": 49
  },
  {
    "serial_number": "6271065",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 51,
    "volume_number": 1,
    "text": "*And if it is said tomorrow the people meet... do not forget, for it is the verse of the poem (the main point)*\n*Where no eye of mine sees him sharp... when the glitter of iron appears to him*\n*Where my tongue is not feared nor... the rein of the raider turned away from me by my recitation* (1)\n*Indeed my opinion when the arrow of an archer... is aimed towards me is other than a sound opinion* (2)\n*So if I am killed I would be worthy... of my entering Hellfire and my eternity*\n*So forgive me its stumble and remain for glory... and suppression of enemies and rage of the envier* (3)\nAnd he said from a poem in the style of Abu al-Shammaqmaq (4):\n*I am the one Abu al-Shammaqmaq... spoke to you about*\n*And he said about me that I... was the drinking companion of Al-Muttaqi*\n*And I was was was was... of the shooters of the hazelnut*\n*Until when will I be found like this... a billy goat with a long neck* (5)\n*With a flowing beard... and a shaved mustache* (6)\n*[Would that it had been created... from the face of an anal (Halqi) sheikh (7)]*\nHe said (8) from another:\n*I lived fifty, rather increasing... a fool as you see*",
    "foot_note": "1. Q: 'ra's al-ba'ir anni' (head of the camel from me), in Al-Kharidah: 'zimam al-ba'ir' (rein of the camel).\n2. Q and Al-Kharidah: 'idha tasaddada nahwi', it is said saddadahu fa-tasaddada.\n3. Q and Al-Kharidah: 'wa abqa li-l-hamd' (remain for praise).\n4. Q: 'Abu al-Raqa'maq', who is another poet and not intended. As for Abu al-Shammaqmaq, he is Marwan bin Muhammad and was a contemporary of Bashar and Abu Nuwas. His biography is in \"Tarikh Baghdad\" 7128 and Ibn Khallikan within the biography of Yazid bin Mazyad. He did not have a separate biography. As for Abu al-Raqa'maq, he is Abu Hamid Ahmed bin Muhammad Al-Antaki, Al-Tha'alibi wrote his biography in Al-Yatimah (1: 238) and Ibn Khallikan in Al-Wafiyat (1: 41).\n5. Q and Al-Kharidah: 'Hatta mata abqa' (Until when will I remain).\n6. In Al-Lisan: 'sabala sabil' (let down/flowing). In Al-Kharidah: 'bi-lihyatin musbalah'.\n7. The verse is from Q and Al-Kharidah. Halqi: The passive homosexual, and it came in its original: 'halq' corrupted.\n8. In the original: 'wa qawluhu', corrected in Q.",
    "book_id": "957",
    "new_page_number": 50
  },
  {
    "serial_number": "6271066",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 52,
    "volume_number": 1,
    "text": "*I think the doum fruit (Muql) is hazelnuts... and likewise salt is sugar* (1)\n*And I think the tall of... everything is round*\n*I have aged aged aged aged... and my mind goes backwards*\n*Wonder how everything... I see changing*\n*I do not see eggs being... eaten except peeled*\n*And if glass is hit with stones... it breaks*\n*And if a dead person dies... he does not smell ambergris* (2)\nAmong the poets of the Egyptians in this time of ours is one who says - he is Abu Musharraf Al-Dajarjawi (3), attributed to Dajarja, which is a village (4) in Upper Egypt:\n*A judge who, when two opponents separate, returns them... to dispute with a non-decisive judgment*\n*He shows asceticism in the world and its glitter... openly, and secretly accepts a camel's dung*\nAmong them is one who says, he is Abu al-Hasan Ali bin al-Barqi, from the people of Qus:\n*Time threw me with every arrow of its... and surprised me with separation after separation* (5)\n*And gathered in my heart every sadness... and separated between my loved ones and me*\n*So in my heart is the heat of every heart... and in my eye are the tears of every eye*\nAnd he has from verses:\n*I have a slumber, I knew not what is the slumber of sleep... as if my eyelids are my ears and sleep is the censure* (6)",
    "foot_note": "1. Al-Muql: Fruit of the Doum palm. In the original: 'Al-Baql' (herbs), in Q and Al-Kharidah: 'Al-Masl' (whey), the correct is what I established. In the original: 'sukran. wa ahsib al-milh sukran', corrected in Q and Al-Kharidah.\n2. The verse is missing from Q and Al-Kharidah. In the original: 'la yasman' (does not get fat), corruption.\n3. Yaqut said, when discussing Dajarja: 'A late poet known to Egyptians came out of it called (Abu) Al-Musharraf. He has good poetry.' In the original: 'Al-Dajarjaray' corrected in Q and Al-Kharidah.\n4. In the original: 'to his village Dajarjara which is', corrected in Q.\n5. In Q the beginning of this verse was combined with the end of the next one becoming one verse. Thus it came in Al-Tali' al-Sa'id by Al-Adfuwi 219.\n6. In the original: 'wa bayna jafwati', corrected in Q, Al-Kharidah and Al-Tali' al-Sa'id. The last word of the verse is missing from the original and established from the three copies.",
    "book_id": "957",
    "new_page_number": 51
  },
  {
    "serial_number": "6271067",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 53,
    "volume_number": 1,
    "text": "Among them is one who says, he is Abu Muhammad Abdullah bin al-Tabbakh the Scribe, satirizing a short-necked man (Awqas). I recited them to Abu al-Hasan [Ali bin (1)] Al-Sufi Al-Hanbali (2):\n*His neck veins shortened and his occiput sank... as if he expects to be slapped* (3)\n*As if he had tasted the first strike... and sensed a second one so he gathered himself*\nAmong them is one who says, he is Abu Abdullah Muhammad bin Muslim the Scribe:\n*The camel-driver forced her through the wilderness and she abandoned... and the fifth (day of thirst) passed over her followed by the tenth* (4)\n*The heat of midday made her lean as if it... is passion, and it is a heart harmed by abandonment*\nAmong them is one who says, and I do not verify his name, regarding a man nicknamed Al-Rashid (5):\n*What a difference between Al-Rashi... d and Harun Al-Rashid*\n*This one chastises with ski... ns (whips) and that one strengthens with soldiers* (6)\nAmong them is one who says, he is Mahmoud bin Nasir Al-Iskandari (7), scribe of Judge Ibn Hadid, regarding a harelip doctor with deformed creation:\n*Our friend the doctor is a rarity... the eyes of people have taken from him* (8)\n*Fangs of a ghoul and lip of a camel... and head of a mule and chin of a Nisnas (monkey)*\nAmong them is one who says, he is Abu Nasr Zafir bin Qasim known as Al-Haddad (9) from the people of Alexandria, and he wrote to me with it in a letter:",
    "foot_note": "1. From Q.\n2. Q: 'Al-Jabali'.\n3. In the original: 'wa ghaba qadhaluhu' (and his occiput disappeared), I established what is in Q.\n4. In the original: 'ta'ashshaqaha' (fell in love with her), corrected in Q.\n5. In the original: 'named Harun Al-Rashid', I established what is in Q.\n6. Ta'zir: Beating for discipline less than the Hadd punishment. This is the correct placement of the verse as in the original. It came reversed in Q which is incorrect: 'This one strengthens with soldiers... and that one chastises with skins'.\n7. Q: 'Al-Iskandarani'.\n8. In the original: 'have taken it from the eyes of people', corrected in Q and Al-Kharidah.\n9. Ibn Khallikan wrote his biography in \"Wafiyat al-A'yan\", and Yaqut in \"Irshad al-Arib\" and mentioned he died in 529.",
    "book_id": "957",
    "new_page_number": 52
  },
  {
    "serial_number": "6271068",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 54,
    "volume_number": 1,
    "text": "*And no bird whose wing Time clipped... so it deprived it of a nest and lost it a mate*\n*Remembering fluff among the branches of a thicket... hidden wings that do not fly due to weakness*\n*When it wraps itself in darkness it confides its worries... to the modulation of a melody almost hidden from thinness* (1)\n*Is more longing than me when distance obeyed regarding you... air and water racing the glance*\n*It turned away having from you what if I measure it... with what it is in, it would be fuller in merit* (2)\nHe also said:\n*They departed, and were it not that I... hope for meeting I would have died* (3)\n*By God I did not part from you... but I parted from my heart* (4)\nAmong them is one who says, he is Abu al-Qasim bin Rushd (5) Al-Masri:\n*How many say to me travel to... the lands of Iraq, you will fall into Rakha' (prosperity)* (6)\n*By my life they told the truth, I have fallen... into the middle of Rakha' with the Kha' brought forward (Khara' - filth)*\nAmong them is one who says - he is Al-Naji Al-Masri - satirizing a bathhouse:\n*Indeed our bathhouse which we are in... is in need of a bath*\n*We entered it while we were children of Sam (Shem)... and exited while we were children of Ham*\nSome contemporaries said in this meaning:\n*Our bathhouse is in more dire need... than he who settles in it for a bath*\n*Colors of people whiten in others... but this one lends them clothes of soot*\n*I was from Sam so when I entered it... for the misery of my luck it turned me from Ham* (7)\nAmong them is one who says, he is Abu al-Hasan Marwan bin Uthman:\n*Sickness has enabled itself of me until as if I am... an imagined meaning in a hidden question*",
    "foot_note": "1. Q: 'min diqqah' (from fineness).\n2. Q: 'kan fi wasfihi wa fi'.\n3. Q: 'arju al-iyab qadaytu nahbi' (hope for return I would have died).\n4. Q: 'By God I did not part from them'.\n5. In the original: 'Bin Zubayd', I established what is in Q.\n6. Q: 'Al-Rakha' shortened, and likewise 'Kha' shortened in the next verse.\n7. In the original: 'dakhaltuha' (I entered her), corrected in Q and Al-Kharidah (2: 305).",
    "book_id": "957",
    "new_page_number": 53
  },
  {
    "serial_number": "6271069",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 55,
    "volume_number": 1,
    "text": "*[And if his eyes permitted my eyes in sleep... my imagination would be more obscure than the phantom of imagination (1)]*\n*I was generous with my soul while it is dear to me... and generous with my heart while it is precious to me*\n*And I feared that my death would be decreed upon me... and I would not fulfill my desires with a day of union* (2)\n*And the easiest of what I encounter of passion is that it is... avoidance of coquetry not avoidance of boredom*\n*If that avoidance from him was boredom... I would have tightened the mounts of my saddles away from the world* (3)\nThis is from the saying of Abbas bin al-Ahnaf:\n*If you were blaming, my anguish would calm... I would hope for your satisfaction and visit without (4) [watcher*\n*But you turned away so I had no trick... the turning away of the bored is different from the turning away of the blaming]*\nAnd by Marwan:\n*What is the matter with your heart submitting... is there passion in it or madness* (5)\n*The hidden was revealed by what you hide, so certainty removed doubt*\n*Until when between the ribs and sides is a buried love*\n*And until when is the heart of the enthralled a hostage in the hand of calamity*\n*O procrastinator of my heart's debts... it is time that debts be paid*\n*Eyes stared at him regarding you... and thoughts were divided regarding you*\n*And you stole the minds of people... with glances containing temptation*\n*And a stature of garden branches... and where do branches reach you*\n*Beauty in branches is... an art and in this it is arts*",
    "foot_note": "1. The verse is from Al-Kharidah (2: 203).\n2. In the original: 'munyah' (wish), I established what is in Q and Al-Kharidah.\n3. This verse is missing from Q.\n4. After this is a blank space in the original of about two pages, I completed it from Q and Al-Kharidah (2: 204). The common part between them in the completion is the last line only of what is placed between brackets, and the rest of the completion is from Al-Kharidah only.\n5. Its rhyme allows for silence and movement.",
    "book_id": "957",
    "new_page_number": 54
  },
  {
    "serial_number": "6271070",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Egyptian Epistle",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 56,
    "volume_number": 1,
    "text": "*From where do branches have that... coquetry and clear magic*\n*Or that rose gathered... on his cheek and the jasmine*\nAmong them is one who says, he is Abu Ishaq Ibrahim bin al-Ash'ath]:\n*If Mahmoud settles in a land, he... bursts in it a spring from the dew of his palm* (1)\n*So it grows flowers resembling his gifts... some seen as silver (Wariq) and some seen as gold ('Ayn)* (2)\nAnd he has regarding a beautiful dark-skinned boy:\n*O you who spends his money... in the love of this surpassing gazelle* (3)\n*What is silent gold considering it much... to make it go for the speaking gold* (4)\nAmong them is one who says about a beloved of his who stammers, he is Mahmoud bin Ismail bin Hamid Al-Damyati:\n*A stammer (Tam-tamah) my love was completed (Temma) by it... and an obstacle that exposed me to sickness*\n*And abundant hair my worry by it is abundant (Wafir)... and an eyebrow (Hajib) that blocked (Hajaba) sleep from me* (5)\nAnd he has from verses describing wine:\n*And I spent my night seeing the fire to which... the Magians prostrated, prostrating to me from the pitcher*\n\nThis - may Allah prolong the remaining of the High Presence - is what the mind dictated to the hand, in a time close at both ends, narrow between the two edges. If time allows, I will make up for what was missed (6) and append the deficient, Allah Almighty willing.\nCompleted on Tuesday the nineteenth of Dhu al-Qi'dah in the year 1091 in Edirne.",
    "foot_note": "1. In the original: 'ghaythan' (rain), corrected in Q and Al-Kharidah. 'Ayn in this is the flowing spring.\n2. In the original 'ghaythan', corrected in Q and Al-Kharidah. Wariq: Silver, said with Fath of Ra' and Kasra, and Fath here is more fitting for the craft. 'Ayn in this verse means gold. In Q and Al-Kharidah: 'yura wariqan ba'dan wa ba'dan yura 'ayna' and 'yura' is read in this narration as present tense of 'ara' (to show/think).\n3. Q: 'The surpassing dark-skinned one'.\n4. In Al-Kharidah: 'mustankiran' (denying/disapproving), in the original: 'dhihabahu' (its going), I established what is in Q and Al-Kharidah (2: 205).\n5. In the original: 'Al-Malam' (blame), corrected in Q.\n6. In the original: 'Al-Fa'iq' (the surpassing), corrected in Q.",
    "book_id": "957",
    "new_page_number": 55
  }
]