[
  {
    "text": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 1
  },
  {
    "text": "sn: 3250\nbook_title: نقد «نصوص حديثية في الثقافة العامة» جمع وتصنيف محمد المنتصر الكتاني أستاذ الحديث\nbook_link: https://shamela.ws/book/133363\nbook_id: 133363\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مطبعة الترقي - دمشق\nedition: Null\npages: 58\nvolumes: Null\npagination: [ترقيم صفحات الكتاب موافق للمطبوع]\ncategory: التخريج والأطراف\ncategory_id: 8",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 2
  },
  {
    "serial_number": "3283068",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Graduation and Extremities. Book: Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith. Author: Muhammad Nasir al-Din al-Albani. Publisher: Al-Taraqqi Printing Press - Damascus. Number of Pages: 58. Prepared for Shamela by: Muhammad Al-Mansour [Page numbering of the book matches the printed version]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nBook: Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith. Author: Muhammad Nasir al-Din al-Albani. Publisher: Al-Taraqqi Printing Press - Damascus. Number of Pages: 58. Prepared for Shamela by: Muhammad Al-Mansour [Page numbering of the book matches the printed version]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nAuthor: Muhammad Nasir al-Din al-Albani. Publisher: Al-Taraqqi Printing Press - Damascus. Number of Pages: 58. Prepared for Shamela by: Muhammad Al-Mansour [Page numbering of the book matches the printed version]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nPrepared for Shamela by: Muhammad Al-Mansour [Page numbering of the book matches the printed version]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\n[Page numbering of the book matches the printed version]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nDate of publication in Shamela: 2 Rabi' al-Awwal 1440",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 3
  },
  {
    "serial_number": "3283069",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 1,
    "volume_number": 1,
    "text": "Critique of «Hadith Texts in General Culture collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith» by the pen of Muhammad Nasir al-Din al-Albani. Published in the magazine Al-Tamaddun Al-Islami, Volume (33 and 34), Al-Taraqqi Press in Damascus",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 4
  },
  {
    "serial_number": "3283070",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. Indeed, all praise is due to Allah; we praise Him, we seek His help, and we seek His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, there is no misguider for him, and whomever He leaves astray, there is no guide for him. I bear witness that there is no deity but Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger. As for what follows: These are scientific hadith researches, criticizing a book written by some professors of the Syrian University for the students of the Faculty of Sharia. I hope they find in it a good model for honest scientific criticism, based on research and adherence to correct scientific rules. Perhaps this will increase their care for studying the noble Hadith, a practical study, and by that, they revive what has almost been obliterated of this great science, due to teachers and professors limiting themselves to teaching it as a purely theoretical study, and issuing their writings based on that, which they author for their students or others, without observing the simplest of those scientific rules, such as choosing authentic texts and established Hadiths from trusted sources and approved references, along with attributing them and graduating (Takhrij) them with a precise scientific graduation. You see one of them—who is a professor of this subject: Hadith—citing a Prophetic Hadith, or a report related to his biography, upon him be peace and blessings, or his morals, saying in its graduation: «Narrated by Abu Dawood» or «Narrated by Ibn Hisham in the Sirah»! And he thinks that by doing so he has fulfilled the scientific trust placed around his neck, and that he has advised his students! Far from it, far from it! For adhering to the scientific method referred to in Hadith studies requires him, before this brief graduation, to study the chain of transmission of that Hadith or report, track its men (narrators), identify its defects, and the statements of the specialists regarding it, then judge it according to what this study requires of authenticity or weakness,",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 5
  },
  {
    "serial_number": "3283071",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 4,
    "volume_number": 1,
    "text": "then present its summary to his students along with the mentioned graduation. Otherwise, such a truncated graduation which the indicated professor practiced is something that none of the students themselves are incapable of, if Allah the Exalted wills. The purpose of presenting these researches is not to criticize the professor's book in itself, because the book is like any book written by a professor of his subject; if he leaves his position, his book follows him and becomes a thing forgotten! Rather, the purpose is to present to the students and others some practical examples of scientific verification and honest criticism, perhaps by that we may perform some of the duty of clarification and advice to the Muslims. I published it in five articles in the esteemed magazine Al-Tamaddun Al-Islami (Volume 33 and 34), so I saw fit to collect them in this booklet to generalize the benefit. Hoping from the Master, Glory be to Him and Exalted, that He benefits [people] through it, and stores its reward for me; indeed He is the best One asked, and with Him is success. (1) Damascus 17 Dhu al-Hijjah, year 1387. Muhammad Nasir al-Din al-Albani.",
    "foot_note": "1. (1) Then I came across the book \"Fiqh As-Sirah\" by the virtuous professor Dr. Muhammad Sa'id Ramadan Al-Buti, and I saw that he followed the path of Professor Al-Kattani in it. He cited in it many weak and denounced Hadiths, and even what has no basis at all, but he exceeded him by stating in the introduction that he relied in it on what is authentic of Hadiths and reports! But my study of the book revealed that this is a mere claim, and that the bulk of his reliance was on the book of his eminence Sheikh Muhammad Al-Ghazali: \"Fiqh As-Sirah\". The Doctor did not limit himself to taking its name only, but exceeded that by benefiting from many of its researches, texts, and even its titles! He also benefited from my graduation of it which is printed with it, with a defective abbreviation, to cover up what he had done! He criticized me in three places in it; I wished—Allah bears witness—that he was correct even in one of them, but he was on the contrary of that. He revealed by all of this that these high certificates and what they call (Doctorates) do not give their holder knowledge, verification, or manners. I surely hope that the opportunity will be available to me to be able to explain this summary. And Allah is the One whose help is sought.",
    "book_id": "133363",
    "new_page_number": 6
  },
  {
    "serial_number": "3283072",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 5,
    "volume_number": 1,
    "text": "Hadith Texts in General Culture: Collected and classified for the first-year students of the Faculty of Sharia at the University of Damascus by Professor Sheikh Muhammad Al-Kattani, Professor of Hadith at the mentioned Faculty. The book consists of (70) pages. The book pleased me greatly when I read its title, for its subject meets the need of the educated youth, especially the students of the Faculty of Sharia, for authentic Prophetic Hadiths, graduated according to the scientific rules of terminology, selected for various comprehensive occasions, showing the comprehensiveness of the Prophetic Sunnah for aspects of religion and worldly life, its treatment of numerous matters of the individual and society, and its guiding of those who act upon it with a rational and sound guidance. I browsed the book and important observations appeared to me, which I saw as incumbent upon me to clarify after a preface about two issues, and the truth is more worthy to be said and followed: First: Professor Al-Kattani said in the introduction of his book about these texts: «I selected them from the Six Books: Sahih Al-Bukhari, Sahih Muslim, Muwatta Malik, and the four Sunan of Abu Dawood, Al-Tirmidhi, An-Nasa'i, and Ibn Majah». It is known that \"Al-Muwatta\" is not among the Six Books in terminology, and they have become seven as the Professor listed them. Was this due to an oversight, or does the Professor have an explanation for that? Second: I missed in the book the explicit scientific method for selecting Hadiths and graduating them, and applying the rules of the science of terminology to them. A Sharia student must study a practical scientific study, not a purely theoretical study as is the case in most faculties. Following his theoretical study, he graduates and hardly feels the fruit of the difference between",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 7
  },
  {
    "serial_number": "3283073",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 6,
    "volume_number": 1,
    "text": "one term and another, such as the statement of a Hadith scholar «Narrated by Al-Bukhari» and his statement «Narrated by Al-Bukhari in a suspended manner (Ta'liq)» (1). A graduator might author a book or write a thesis, citing whatever Hadiths he wishes, many of which are weak, denounced (Munkar), or fabricated, which are not permissible to narrate except with an explanation of their status. Then he suffices in all of that by saying in the graduation «Narrated by Abu Dawood and so-and-so» or «Narrated by An-Nasa'i and so-and-so» without referring to its chain of transmission and studying the conditions of its men (narrators) and what defect might be in it that impugns its establishment, such as disconnection, obfuscation (Tadlis), sending (Irsaal), and the like. It is strange that Professor Al-Kattani did this very thing in his book, while he knows that he is a professor who is emulated, and he should teach his students precise caution in narrating the Hadith of the Messenger of Allah, may Allah bless him and grant him peace, evidenced by his saying, peace be upon him: «It is sufficient lying for a man to speak of everything he hears», narrated by Muslim in the introduction to the \"Sahih\" with an authentic chain. * * * I return now to the core of the subject, and I present the most important observations in broad lines: 1 - Professor Al-Kattani cited many flimsy Hadiths about which he remained silent and did not explain their weakness, and thus students imagine they are authentic, whereas some of them were weakened by the very source to which he attributed the Hadith. This is as far as can be from the purpose of the science of Hadith, and in a Faculty of Sharia. 2 - He applied absolute attribution to Al-Bukhari in some Hadiths, saying \"Narrated by Al-Bukhari\", while they are suspended (Mu'allaq) according to him [Al-Bukhari], and some of them have chains that are not authentic. Thus, readers imagine they are authentic according to Al-Bukhari's condition in the \"Sahih\", while the case is not so. He did the reverse in others, saying «Narrated by Al-Bukhari in a suspended manner» while it is connected (Mawsul) according to him!",
    "foot_note": "1. (1) The first graduation means the Hadith is authentic (Sahih), and the other graduation means it might be authentic, might be good (Hasan), or might be weak and not used as proof.",
    "book_id": "133363",
    "new_page_number": 8
  },
  {
    "serial_number": "3283074",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 7,
    "volume_number": 1,
    "text": "It is established in the science of Hadith that the Hadiths of \"Sahih Al-Bukhari\" are divided into two parts: The First: Those which Al-Bukhari connects to the Prophet, may Allah bless him and grant him peace, meaning he cites their chains connected from him to the Prophet, may Allah bless him and grant him peace. This entire section is authentic according to scholars except for very few letters where some narrators erred. The Other: Those which he mentions without a connected chain to the Prophet, may Allah bless him and grant him peace, and it has many forms which there is no room to mention now. This section is called the Suspended (Mu'allaq) Hadith. They agreed that it contains the Authentic (Sahih), the Good (Hasan), and the Weak. It is not possible to know the rank of this section merely by Al-Bukhari citing it in his \"Sahih\", unlike the first section, unless he starts the Suspended Hadith with a format of certainty (Jazm) such as «He said, He narrated, He mentioned» and the like, for it indicates that it is authentic according to him. If he starts it with a format of sickness (Tamrid), such as «It was narrated» and «It was mentioned» and the like, it indicates its weakness according to him. However, this is not consistent with him; he often starts it with a format of certainty while it is weak, and he may start it with a format of sickness while it is authentic according to him for reasons there is no room to mention now. Al-Hafiz Ibn Hajar Al-Asqalani mentioned them in the \"Introduction to Fath Al-Bari\", so whoever wishes to view them may refer to it. The only way to know that is to refer to the chain of the Hadith which Al-Bukhari suspended, in other books of Sunnah like the Sunan and others, study its chain, and then give it the rank it deserves. If we know this, many people who have no knowledge of this detail in Al-Bukhari's Hadiths imagine that every Hadith in it is authentic. Based on that, they quote some Suspended Hadiths from it, then attribute them to him with absolute attribution, thus deluding people into what they themselves imagined, that the Hadith is authentic, while it may be weak, so they err and become a cause for the error of others. For this reason, the scholars of Hadith agreed that they",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 9
  },
  {
    "serial_number": "3283075",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 8,
    "volume_number": 1,
    "text": "if they quote a Hadith from the second section of Sahih Al-Bukhari, it should be indicated by saying something like «Narrated by Al-Bukhari in a suspended manner», or «Al-Bukhari mentioned it without a chain», in order not to delude people that the Hadith is from the first, authentic section! Many authors have failed in this, especially the later ones among them, such as the author of the book \"Al-Jami' li al-Usul al-Khamsah\"; we often saw him say in his graduation of some Hadiths «Narrated by Al-Bukhari», while they are suspended according to him! Sheikh Al-Kattani followed his pattern, so it was necessary to alert to them, while mentioning the authentic and the weak among them. 3 - He attributed Hadiths to some of the \"Four Sunan\" while they appeared in the \"Two Sahihs\" or in one of them as connected, not suspended. This is not permissible, because attribution to the Sunan does not imply authenticity, unlike attribution to the \"Two Sahihs\" or one of them. In leaving the attribution to them in favor of attribution to others, there is an implication that they did not extract it, in addition to causing doubt in the students regarding the authenticity of the Hadith, because the Sunan contain the authentic and the weak as is known. 4 - He attributed Hadiths to the \"Two Sahihs\" and others of the Six, while they are not in them, contrary to what he did in the previous chapter. He attributed to those who are not of the \"Six\" nor are they among the Imams, despite the Hadith being with some of the Six Imams. He attributed another Hadith to a Companion while it belongs to another! He cited an addition in an authentic Hadith that has no known origin, and the source to which he attributed it is not trusted! 5 - He translated titles for many Hadiths with what they do not indicate. 6 - He cited many Hadiths that do not result in great benefit today; rather, they are what some people of desires and innovations exploit, even though most of those Hadiths are specific to the Messenger, may Allah bless him and grant him peace, so it is not correct to analogize any of the Sheikhs with him. If the purpose of the Professor, the author of the book, in citing them was merely to make them known and the extent of the noble Companions' veneration of the Messenger of Allah, may Allah bless him and grant him peace, then it would have been part of the completeness of authorship to alert to that.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 10
  },
  {
    "serial_number": "3283076",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 9,
    "volume_number": 1,
    "text": "1 - The Weak Hadiths: The First Hadith: He said (p. 4): «From Jarir bin Abdullah, may Allah be pleased with him, that the Prophet, may Allah bless him and grant him peace, said: Allah the Exalted revealed to me: Whichever of these three you descend upon, it is the abode of your migration: Medina, or Bahrain, or Qinnasrin». I say: This is a Denounced (Munkar) Hadith weakened by the graduator himself, who is Al-Tirmidhi. He extracted it in «Al-Manaqib» via the path of Isa bin Ubaid from Ghaylan bin Abdullah Al-Amiri from Abu Zur'ah from Amr bin Jarir from Jarir bin Abdullah, and said: «This is a Gharib (strange) Hadith». I say: Meaning weak, as is his terminology when he singles out a Hadith with this description: «Gharib», unlike when he says «Authentic Gharib Hadith» or «Good Gharib Hadith» as is known among the people of knowledge. Its defect is this Ghaylan; Al-Dhahabi listed him in \"Mizan al-I'tidal fi Naqd al-Rijal\" and said: «I do not know anyone who narrated from him other than Isa bin Ubaid Al-Kindi; his Hadith is Denounced (Munkar). Al-Tirmidhi did not dare to classify it as Good (Hasan), rather he said «Gharib», and it is from Abu Zur'ah...». I say: Then he mentioned this Hadith. It is regrettable that the Denounced Hadith which Al-Tirmidhi weakened is the first Hadith in Sheikh Al-Kattani's book with which he heads it!",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 11
  },
  {
    "serial_number": "3283077",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Second Hadith: «From Abu Nadra Al-Abdi (The Original (1) says Al-Abawi!) said: A Sheikh from Tufawa told me: I stayed as a guest (Thawaytu) with Abu Huraira in Medina... He said: While I was with him one day and he was on a bed of his, and with him was a bag containing pebbles or date stones, and below him was a black slave girl of his, and he was glorifying Allah (making Tasbih) with them, until when he exhausted what was in the bag he threw it to her, so she returned them into the bag, then she handed it to him... The Hadith. He said: Abu Dawood extracted it». I say: It has two defects: First: The anonymity of the Tufawi Sheikh, for he was not named and it is not known who he is. The other: Its narrator in Abu Dawood in «Al-Nikah» is Al-Jurayri, and his name is Sa'id bin Iyas. He is trustworthy, but he became confused (mixed up) three years before his death as Al-Hafiz said in \"Al-Taqrib\", and it is not known whether he narrated this Hadith before the confusion or after it? Whatever is like this is not used as proof as is established among the Hadith scholars in the discussion of Confusion (Ikhtilat) and those who became confused. Perhaps the author, by mentioning this Hadith, wanted to present to some of the Dervishes among the followers of Sufi orders a proof for what they innovated of restricting Dhikr, Tasbih, and prayer upon the Prophet, may Allah bless him and grant him peace, to a number that the Messenger of Allah, may Allah bless him and grant him peace, did not legislate! It is a very flimsy proof for two fundamental reasons: First: The weakness of the chain to Abu Huraira, may Allah be pleased with him.",
    "foot_note": "1. (1) I mean by it Al-Kattani's book, and it is the intended meaning whenever I mention this word «The Original».",
    "book_id": "133363",
    "new_page_number": 12
  },
  {
    "serial_number": "3283078",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 11,
    "volume_number": 1,
    "text": "Second: That it was denied by one of the Companions who is older in companionship and higher in station in Fiqh and knowledge than him, namely Abdullah bin Mas'ud, may Allah be pleased with him, in the famous story about him, narrated through paths some of which have an authentic chain. In it is Ibn Mas'ud's denial upon those who sat in circles counting Dhikr with pebbles; he denied that upon them with the severest denial, and said to them: Is it upon Allah that you count?! Or is it upon Allah that you enumerate?! Count your bad deeds and I guarantee that nothing of your good deeds will be lost! Woe to you, O nation of Muhammad, how fast is your destruction... etc., the story. In the end of it, [it mentions] that the members of those circles later became among the Kharijites whom the Rightly Guided Caliph Ali bin Abi Talib fought. So let whoever wishes refer to it in \"Sunan Al-Darimi\" or in our treatise \"The Response to the Urgent Comment\". Yes, what came in the end of the Hadith regarding etiquette in intercourse, and regarding the perfume of men and women is established in other Hadiths. The Third Hadith: (p. 13) «From Zaid bin Aslam, may Allah be pleased with him, «that a man confessed against himself of adultery during the time of the Messenger of Allah, may Allah bless him and grant him peace. So the Messenger of Allah, may Allah bless him and grant him peace, called for a whip, and was brought a broken whip. He said: Above this. So he was brought a new whip whose knot had not been cut. He said: Below this. So he was brought a whip that had been used for riding and had become soft. He ordered regarding him and he was flogged. Then he said: O people, it is time for you to refrain from the limits of Allah. Whoever commits anything of these filths (The original says: 'from these filths', the correct is: 'whoever commits anything of these filths') let him conceal himself with the concealment of Allah, for whoever reveals his page (face/deed) to us, we establish upon him the Book of Allah». I say: This chain is weak due to its being Sent (Irsaal), because Zaid bin Aslam, who is the client of Umar, is a well-known Tabi'i. Perhaps the Sheikh imagined he was a Companion (Sahabi), and therefore said 'may Allah be pleased with him' about him!",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 13
  },
  {
    "serial_number": "3283079",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 12,
    "volume_number": 1,
    "text": "The custom among scholars ran to restrict 'May Allah be pleased with him' to the Companions, and 'May Allah have mercy on him' to those after them, to prevent such delusion. So the Hadith from a Tabi'i is Mursal (Sent/Disconnected) and weak, but by saying 'May Allah be pleased with him' about him, it becomes—to the common people affected by that custom—Musnad (Supported/Connected) and Mawsul (Connected). So the custom should be observed to prevent delusion. I said: «Perhaps» and did not assert that imagination, because I saw the Sheikh had said 'May Allah be pleased with him' about more than one of the other Tabi'in; see the coming Hadiths (4, 7, 10, 23, 25, 28) and others. The Fourth Hadith: (p. 17) «And from Abu Ayyub Al-Ansari, may Allah be pleased with him, who said: The Messenger of Allah, may Allah bless him and grant him peace, said: Henna, Perfuming, Siwak, and Marriage are from the Sunan (ways) of the Messengers. Abu Dawood extracted it». Then he repeated it on the following page from the same Companion and the same graduator but with the wording «Four are from the Sunan of the Messengers: Modesty (Al-Haya'), Perfuming, Marriage, and Siwak». I say: First: The Hadith has a weak chain and a disturbed text. It contains Al-Hajjaj, who is Ibn Artat; Al-Hafiz said in \"Al-Taqrib\": «Truthful, makes many mistakes and obfuscates (Mudallis)». I say: And he narrated it with 'an (saying 'from'). As for the disturbance in the text, refer to it in \"Fayd al-Qadir\" by Al-Munawi. Second: The Hadith is in Al-Tirmidhi at the beginning of «Al-Nikah» with the second wording, with some advancement and delay which will be explained. As for the first wording, it has no origin in Al-Tirmidhi, nor in others who extracted the Hadith like Ahmad in his \"Musnad\" (5/ 421), so how did the author attribute it to Al-Tirmidhi?! And from where did he transfer it?!",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 14
  },
  {
    "serial_number": "3283080",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 13,
    "volume_number": 1,
    "text": "He mentioned in the introduction of the book that he selected his Hadiths from the Six Books, and this Hadith serves as a witness that the selection was not from the Six Books directly; rather, he selected some from them, and the others from other books that quote from the Six Books and others. Otherwise, how can we convince ourselves that the author transferred them all from the Six Books directly, when this Hadith with its first wording has no origin in any of them! What supports what I mentioned is that the second wording itself is different in its context from its context in Al-Tirmidhi as previously indicated, for it is therein with the wording: «and Siwak and Marriage». And the wording of the author puts Marriage before Siwak! Also, he mentioned (p. 19) the Hadith «There are no three in a village, where prayer is not established among them, except that Satan has overcome them. So hold to the congregation, for the wolf only eats from the stray sheep». Abu Dawood and An-Nasa'i extracted it. I say: This context contradicts what is in them in two places: First: They added after his saying: «a village»: «nor Bedouins». The other: They do not have «from the sheep»; rather it is in Al-Hakim. If the author had transferred this Hadith from «Abu Dawood and An-Nasa'i» directly, he would have mentioned it with their text as scientific trust requires, without addition or decrease. If he added an addition from another source, he should have alerted to it as is the method of the people of knowledge. There will come with us other examples confirming that the transfer was not from the \"Six\" directly, so wait.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 15
  },
  {
    "serial_number": "3283081",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Fifth Hadith: «From Yahya bin Abdur-Rahman bin Hatib that slaves belonging to Hatib stole a she-camel belonging to a man from Muzaynah and slaughtered it. That was brought up to Umar bin Al-Khattab, so Umar ordered Kathir bin Al-Salt to cut off their hands. Then Umar said: I see you are starving them. Then Umar said: By Allah, I will fine you a fine that will be hard on you. Then he said to the Muzani: How much is the price of your she-camel? The Muzani said: I used to, by Allah, forbid it for four hundred dirhams. Umar said: Give him eight hundred dirhams. Extracted in Al-Muwatta». I say: This, along with not being a Hadith raised (Marfu') to the Prophet, may Allah bless him and grant him peace, does not hold true from Umar due to the disconnection between him and Yahya bin Abdur-Rahman bin Hatib, for he was born during the Caliphate of Uthman, may Allah be pleased with him, as Abu Hatim Al-Razi said. Moreover, Malik himself said following it: «And the practice is not according to this with us regarding doubling the value»! So the report has a weak chain, and furthermore, practice is not upon it, so what is its value?! The Sixth Hadith: «From Abdullah bin Umar bin Al-Khattab, may Allah be pleased with them both, that he was in a detachment of the detachments of the Messenger of Allah, peace be upon him. He said: The people fled a fleeing... When he came out, we stood up to him and said: We are the ones who fled (Al-Farrarun). He turned to us and said: No, rather you are the ones who return to fight (Al-Akkarun). He said: So we drew near and kissed his hand. He said: I am the party (Fi'ah) of the Muslims. Abu Dawood and Al-Tirmidhi extracted it».",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 16
  },
  {
    "serial_number": "3283082",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 15,
    "volume_number": 1,
    "text": "I say: In its chain according to them is Yazid bin Abi Ziyad, who is the Hashimi their client, the Kufan. Al-Hafiz said: «Weak, he aged and changed, so he started to accept prompting, and he was a Shiite». A group of others narrated it from his path; I mentioned them in my book \"Irwa al-Ghalil fi Takhrij Ahadith Manar al-Sabil\" number (1189), may Allah facilitate its completion. The Seventh Hadith: (p. 23) «And from Safwan bin Assal (The original says Abbad!) may Allah be pleased with him, who said: Some Jews said to their companion: Let us go to this Prophet... So we came to the Messenger of Allah, may Allah bless him and grant him peace... So they kissed his hand and his foot... Al-Tirmidhi and An-Nasa'i extracted it». I say: There is a view regarding the authenticity of its chain, even if Al-Tirmidhi said: «Good Authentic Hadith», for he is lenient in authentication; therefore scholars do not rely on his authentication as Al-Hafiz Al-Dhahabi said. It is from the narration of Abdullah bin Salama from Safwan. This Abdullah, along with not being famous—such that Ahmad said: I do not know anyone who narrated from him other than Abu Ishaq Al-Sabi'i and Amr bin Murrah—yet they spoke regarding his memory. Al-Dhahabi listed him in \"Al-Du'afa\" (The Weak) and said: «An-Nasa'i said: He is known and denied». Al-Hafiz said in \"Al-Taqrib\": «Truthful, his memory changed». Furthermore, the context of the Hadith belongs to An-Nasa'i, but it contradicts in some letters what is in his book. He extracted it in «Prohibition of Blood» with the wording: «So they kissed his hands and his feet», and likewise it is in Al-Tirmidhi in «Al-Tafsir» except that he said: «So they kissed [dual]» and reversed that in «Al-Isti'dhan» saying: «So they kissed [plural] his hand and his foot».",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 17
  },
  {
    "serial_number": "3283083",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Eighth Hadith: (p. 23) «From Aisha, may Allah be pleased with her, she said: Zaid bin Haritha came to Medina while the Messenger of Allah, may Allah bless him and grant him peace, was in my house. He knocked on the door, so the Messenger of Allah, may Allah bless him and grant him peace, stood up to him naked [i.e., not fully dressed], dragging his garment. By Allah, I did not see him naked before it nor after it. He embraced him and kissed him. Al-Tirmidhi extracted it». I say: And he said: «A Good Gharib (Strange) Hadith, we do not know it except from this mode». I say: It is criticized, for he narrates it via the path of Ibrahim bin Yahya bin Muhammad bin Abbad Al-Madani, my father Yahya told me from Muhammad bin Ishaq from Al-Zuhri. Ibn Ishaq is a Mudallis (obfuscator), and he narrated it with 'an (saying 'from'). Ibrahim bin Yahya and his father are weak. Al-Hafiz said about the first of them «Lenient in Hadith». He said about his father: «Weak, he was blind and accepted prompting». Al-Dhahabi said: «This is a Denounced (Munkar) Hadith, Ibrahim was unique in it from his father». The Ninth Hadith: (26) «From Bakr bin Mubashir Al-Ansari, may Allah be pleased with him, who said: I used to go out with the Companions of the Messenger of Allah, may Allah bless him and grant him peace, to the Musalla (prayer place) on the Day of Fitr and the Day of Adha. We would traverse the interior of Buthan until we came to the Musalla, so we would pray with the Messenger of Allah, may Allah bless him and grant him peace, then we would return from Buthan to our houses. Abu Dawood extracted it». I say: The Hadith appeared like this with him «from Buthan», and the correct is «from the interior of Buthan (Batn Buthan)», as it is in Abu Dawood (1158) and others.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 18
  },
  {
    "serial_number": "3283084",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 17,
    "volume_number": 1,
    "text": "Its chain is weak; it contains Is-haq bin Salim. Al-Dhahabi said: «Not known». Al-Hafiz said: «Unknown (Majhul)». Moreover, its apparent meaning contradicts what is established in the \"Two Sahihs\" and others, that the Sunnah is to go to the Musalla from one path and return from another path. The author translated for this Hadith with «Eid Prayer in the Musalla not in the Mosque». In the chapter, there is what is authentically reported from him, may Allah bless him and grant him peace, that suffices instead of it, such as the Hadith of Abu Sa'id Al-Khudri who said: «The Prophet, may Allah bless him and grant him peace, used to go out on the Day of Fitr and Adha to the Musalla...» The Hadith. Al-Bukhari and others extracted it. Al-Bukhari titled it with «Chapter of Going out to the Musalla». If the author had mentioned it instead of this one, he would have been correct. The Tenth Hadith: (p. 28) «From Abu Al-Aswad Al-Du'ali, may Allah have mercy on him, who said: Mu'adh was brought the inheritance of a Jew, so he gave inheritance to a Muslim son of his, and said: The Messenger of Allah, may Allah bless him and grant him peace, said: Islam rises (is superior) and is not superseded, and it increases and does not decrease. Abu Dawood extracted it». I say: There are two matters in this: First: Its chain is weak and disconnected as Al-Bayhaqi explained in \"Al-Sunan Al-Kubra\" (6/ 295) and Al-Hafiz in \"Al-Fath\", and I increased the clarification in \"Silsilat Al-Ahadith Al-Da'ifah wal-Mawdu'ah\" number (1123). I mentioned there that some Hadith scholars extracted the Hadith from another weak path from Shu'bah with it, except that he said: «Faith rises and is not superseded» instead of «increases and decreases». The Other Matter: That the phrase «Islam rises and is not superseded» is not in the Hadith in Abu Dawood nor in others whom",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 19
  },
  {
    "serial_number": "3283085",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 18,
    "volume_number": 1,
    "text": "we mentioned; rather, this is another Hadith which Abu Dawood did not extract nor did others of the Six, and it was only narrated from other than Mu'adh (1), except for what I indicated just now that some of the weak narrators narrated it from Shu'bah in this Hadith. So the author was confused about the matter and made the two Hadiths into one Hadith, then attributed it to Abu Dawood, and there is no basis for that with him. Indeed, the Hadith which Abu Dawood narrated without the addition contradicts the context of the author in some letters, such as his saying: «so he gave inheritance to a son of his», and this is not found in Abu Dawood, so where did the author bring it from?! Does this witness to his statement in the introduction that he selected them from the Six Books?! The Eleventh Hadith: (p. 32) «From Suraqa bin Malik bin Ju'shum, may Allah be pleased with him, that the Messenger of Allah, may Allah bless him and grant him peace, addressed us and said: The best of you is the one who defends his clan as long as he does not commit a sin. Abu Dawood extracted it». I say: Its chain is weak, and among those who weakened it is Abu Dawood himself, for he said following it «Ayyub bin Suwayd (meaning the one in its chain) is weak». The Twelfth Hadith: (p. 32) «From Wathila bin Al-Asqa', may Allah be pleased with him, who said: I said, O Messenger of Allah, what is partisanship (Asabiyyah)? He said: That you assist your people in injustice. Abu Dawood extracted it». I say: It is with him (5119) following the previous Hadith via the path of Salama bin Bishr Al-Dimashqi from the daughter of Wathila bin Al-Asqa' that she heard her father say: so he mentioned it. This is an unknown chain. Salama bin Bishr and the daughter of Wathila—her name is Jamila and it is said Khasila—were not authenticated by anyone whose authentication is trusted. Therefore, Al-Hafiz said about them: \"Maqbul\" (Acceptable), meaning in the case of",
    "foot_note": "1. (1) He is 'A'idh ibn Amr, and I graduated his Hadith in \"Al-Irwa\" (1255) classifying it as Hasan.",
    "book_id": "133363",
    "new_page_number": 20
  },
  {
    "serial_number": "3283086",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 19,
    "volume_number": 1,
    "text": "corroboration, otherwise leniency of Hadith [applies] when solitary, as is the case here. Al-Dhahabi accused Salama of Tadlis (obfuscation), saying: «He narrated the Hadith of Khasila bint Wathila, and obfuscated it». It is as if he means that between them is Abbad bin Kathir Al-Filastini, who is weak. And Allah knows best. The Thirteenth Hadith: (p. 38) «From Abu Usaid Malik bin Rabi'ah Al-Sa'idi, may Allah be pleased with him, who said: While we were sitting with the Messenger of Allah, may Allah bless him and grant him peace, a man from Bani Salama came to him and said: O Messenger of Allah, is there anything left of kindness to my parents that I can show them after their death? He said: Yes, praying for them, seeking forgiveness for them, fulfilling their covenant after them, maintaining the ties of kinship that are not maintained except through them, and honoring their friend. Abu Dawood extracted it». I say: Its chain is weak; it contains Ali bin Ubaid Al-Ansari. Al-Dhahabi said «Not known». The Fourteenth Hadith: (p. 41) «From Awf bin Malik Al-Ashja'i, may Allah be pleased with him, that the Messenger of Allah, may Allah bless him and grant him peace, said: I and a woman with dark spots on the cheeks [from toil] are like these two on the Day of Resurrection—and he gestured with his hand (1) indicating the middle and index fingers—a woman who was widowed (2) [and stayed] with her husband['s children], possessing status and beauty, who confined herself to her orphans until they separated or died. Abu Dawood extracted it». I say: Its chain is weak; it contains Al-Nahhas bin Fahm who is weak as Al-Hafiz said in \"Al-Taqrib\". Al-Dhahabi listed him in \"Al-Du'afa\" and said: «Al-Qattan abandoned him, and An-Nasa'i weakened him».",
    "foot_note": "1. (1) Thus is the Original, and the wording «with his hand» has no basis in Abu Dawood!\n2. Thus in the Printed Original, and it is a mistake. The correct in \"Sunan Abu Dawood\": «A woman who was widowed from her husband». [Prepared for the Shamela Library program]",
    "book_id": "133363",
    "new_page_number": 21
  },
  {
    "serial_number": "3283087",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 20,
    "volume_number": 1,
    "text": "The Fifteenth Hadith: (p. 42) «From Hushraj bin Ziyad, may Allah have mercy on him, from his grandmother the mother of his father, that she went out with the Messenger of Allah, may Allah bless him and grant him peace... The Hadith. Abu Dawood extracted it». I say: This Hushraj is not known as Al-Dhahabi said, so the chain is weak. The Sixteenth Hadith: (p. 43) «From Abdul-Khabir (1) bin Thabit bin Qais bin Shammas from his father from his grandfather who said: A woman came to the Messenger of Allah, may Allah bless him and grant him peace, called Umm Khallad, and she was veiled (wearing niqab)... So the Messenger of Allah, may Allah bless him and grant him peace, said to her: Your son has the reward of two martyrs. She said: Why? He said: Because the People of the Book killed him. Abu Dawood extracted it». I say: This is a weak chain. Its defect is from this Abdul-Khabir and the narrator from him, Faraj bin Fadalah. The Imam of Imams, Al-Bukhari, weakened this Hadith of theirs, saying: «Abdul-Khabir, Faraj bin Fadalah narrated from him; his Hadith is not upright. Faraj has denounced things (Manakir)». If you wish for more, refer to \"Mukhtasar Al-Sunan\" by Al-Hafiz Al-Mundhiri (3/ 359) and \"Hijab Al-Mar'ah Al-Muslimah\" (p. 33) first edition, from our works. The Seventeenth Hadith: (p. 28) «From Sa'id bin Al-Aas, may Allah be pleased with him, that the Messenger of Allah, may Allah bless him and grant him peace, said: No parent has given a child a gift better than good manners. Al-Tirmidhi extracted it». I say: In it, along with its weakness, are two errors:",
    "foot_note": "1. (1) The Original says «Abdul-Jabir»!",
    "book_id": "133363",
    "new_page_number": 22
  },
  {
    "serial_number": "3283088",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 21,
    "volume_number": 1,
    "text": "The First: His deletion of Al-Tirmidhi's speech indicating its weakness! For he said following it: «A Gharib Hadith, we do not know it except from the Hadith of Ammar bin Abi Amir Al-Khazzaz, and Ayyub bin Musa is Ibn Amr bin Sa'id bin Al-Aas, and this according to me is a Mursal (Sent) Hadith». His saying: «Gharib» means that it is weak as previously alerted to in the First Hadith. This was confirmed here by his saying in this one «Mursal Hadith», for the Mursal is one of the categories of weak Hadith according to the Hadith scholars. The Other: That he made it from the Musnad of Sa'id bin Al-Aas the Companion, and he has no entry in it; rather, it is from the Musnad of his son Amr, who is the grandfather of Ayyub as indicated by Al-Tirmidhi's previous speech, and he is a Tabi'i. Therefore, he found it defective due to Irsaal. Al-Dhahabi also found it defective, and added another defect to it, which is that this Al-Khazzaz is flimsy. It has a third defect according to me, which is the anonymity of Musa bin Amr, the father of Ayyub. This is not the place to detail that, and its place is in \"Silsilat Al-Ahadith Al-Da'ifah\" number 1121. The Eighteenth Hadith (p. 51) «From Aisha, may Allah be pleased with her, she said: The Messenger of Allah, may Allah bless him and grant him peace, said: Announce this marriage, make it in the mosques, and beat the Duff (drums) for it. Al-Tirmidhi extracted it». I say: Its chain is weak; it contains Isa bin Maymun Al-Ansari. Al-Tirmidhi himself weakened him in this Hadith, as did Al-Bayhaqi. He was unique in saying: «and make it in the mosques», so it is Denounced (Munkar), due to the weak narrator being unique in it. Add to that, it is Denounced in terms of meaning, for its meaning in the context of the Hadith is that beating Duff in the mosque is permissible for announcement, and that is not permissible, without any disagreement I know of. It was",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 23
  },
  {
    "serial_number": "3283089",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 22,
    "volume_number": 1,
    "text": "The author could have avoided this Hadith due to its weakness and its giving the illusion of what is not religiously permissible, [turning instead] to other authentic Hadiths in the chapter he titled «The Duff and Singing in Wedding Parties». I have cited a group of them in my book \"Adab al-Zafaf\" (pp. 101 - 105), so let whoever wishes refer to them. Hadith Nineteen (p. 52): «From Uthman bin Affan, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: The son of Adam has no right in other than these characteristics: A house to live in, a garment to cover his nakedness, and a crust of bread and water. Narrated by Al-Tirmidhi.» I say: This is a Hadith with a weak chain (Isnad) and a denounced (Munkar) text (Matn). Harith bin Al-Sa'ib was solitary in raising it [to the Prophet], and he is disputed over. He narrated it from Al-Hasan from Humran from Uthman with it. The trustworthy narrator opposed him, for Ahmad said regarding this Harith: «He narrated a denounced Hadith from Al-Hasan from Humran from Uthman, meaning this one, and he mentioned that Qatadah opposed him, saying: From Al-Hasan from Humran from a man from the People of the Book. Ahmad said: Rawh told us, Sa'id—meaning from Qatadah—told us with it.» I say: So the Hadith returned to being from the Isra'iliyyat (Biblical traditions), which resemble the softeners (Raqa'iq) of the Sufis. And where is it in comparison to the saying of Allah, Blessed and Exalted, in some of the decisive verses: {Say, \"Who has forbidden the adornment of Allah which He has produced for His servants and the good things of provision?\" Say, \"They are for those who believe during the worldly life [but] exclusively for them on the Day of Resurrection.\"} [7:32]. For our Lord, Blessed and Exalted, has bestowed upon His believing servants, making it a right for them to wear and adorn themselves with whatever they wish of types of clothing and adornment from what He permitted for them, just as He made it a right for them to enjoy whatever they wish of the good things of provision, and He did not restrict them in anything of that at all, contrary to this Israelite Hadith! Indeed, the practical biography (Sunnah) of the Messenger, may Allah's peace and blessings be upon him, established from him, contradicts it most severely; rather, it",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 24
  },
  {
    "serial_number": "3283090",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 23,
    "volume_number": 1,
    "text": "to prove its invalidity. For he, may Allah bless him and grant him peace, used to eat good things, drink good things, and wear of good clothes whatever was available to him. How could he not, when he is the one who said on a similar occasion: «Indeed Allah is Beautiful and He loves beauty». Narrated by Muslim in his «Sahih». The Twentieth Hadith (pp. 53 - 54) «From Abdullah bin Hassan Al-Anbari, who said: My two grandmothers (1) Safiyyah and Duhaibah, the daughters of Ulaybah—and they were the step-daughters of Qilah bint Makhramah, and she was the grandmother of their father—told me that she informed them, saying: We came to the Messenger of Allah, may Allah bless him and grant him peace... (The Hadith, and in it): The Muslim is the brother of the Muslim; water and trees accommodate them both, and they cooperate against the tempter (Al-Fattan). Abu Dawood extracted it». I say: Its chain contains anonymity (Jahalah). Al-Tirmidhi, despite his leniency, did not classify it as Hasan (Good); rather he said following it (2/ 133): «We do not know it except from the hadith of Abdullah bin Hassan». I say: No one authenticated him, not even Ibn Hibban! So he is of unknown status (Majhul Al-Hal). Al-Hafiz weakened him by his saying: «Maqbul» (Acceptable [only if supported])! Know that in the chapter there is that which suffices instead of this hadith, such as his saying, may Allah bless him and grant him peace: «The Muslims are partners in three things: in pasture, water, and fire». The author cited it one hadith after this one. (Benefit): This is the wording of the hadith: (The Muslims). It has become famous today and circulated by writers, lecturers, and others with the wording (The People...), which is Shadh (anomalous) and incorrect, as I clarified in \"Irwa al-Ghalil\" Hadith number (1550). The Twenty-First Hadith (p. 54) «From Abyad bin Hammal «that he came as a delegation to the Messenger of Allah, may Allah bless him and grant him peace, and asked him to allot him the salt",
    "foot_note": "1. (1)",
    "book_id": "133363",
    "new_page_number": 25
  },
  {
    "serial_number": "3283091",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 24,
    "volume_number": 1,
    "text": "which is in Ma'rib. So he allotted it to him. When he turned away, a man from the gathering said: Do you know what you allotted to him, O Messenger of Allah? You only allotted to him the inexhaustible water (Al-Ma' Al-'Idd). So he took it back from him. He said: And I asked him about what is protected of the Arak trees? He said: That which the hoofs of camels do not reach». Abu Dawood and Al-Tirmidhi extracted it». I say: Al-Tirmidhi himself weakened it by his saying: «A Gharib (Strange) Hadith»! I say: It has two defects: First: Sumayy bin Qays, who is Unknown (Majhul). The Other: Muhammad bin Yahya bin Qays Al-Ma'ribi, who is Lenient in hadith (Layyin al-Hadith) as Al-Hafiz said in \"Al-Taqrib\". Al-Dhahabi listed him in \"Al-Mizan\" and cited for him a hadith from the narration of Khattab bin Umar Al-Saffar from him, and said: «This is false (Batil), I do not know who fabricated it? Khattab or his Sheikh». I say: He is, therefore, in a position of accusation! The Twenty-Second Hadith (p. 56) «From Abu Hurairah, may Allah be pleased with him, who said: The Messenger of Allah, may Allah bless him and grant him peace, said: «Jihad is obligatory with every commander, whether he is pious or wicked...» The Hadith. Abu Dawood extracted it». I say: Its chain is weak. It contains Makhul from Abu Hurairah, and he did not hear from him. And from Makhul [narrated] Al-Ala' bin Al-Harith, and he had become mixed up (confused) as Al-Hafiz said in \"Al-Taqrib\". The Twenty-Third Hadith (p. 60) «From Abu Al-Malih from his father, may Allah be pleased with him, who said: The Messenger of Allah, may Allah bless him and grant him peace, said",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 26
  },
  {
    "serial_number": "3283092",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 25,
    "volume_number": 1,
    "text": "«Wear turbans, you will increase in forbearance. And Ali said: Turbans are the crowns of the Arabs». Abu Dawood extracted it». I say: This attribution to Abu Dawood is false. It is one of many proofs—previously indicated—that the author did not collect the hadiths of his book from the Six Books directly; otherwise, he would not have fallen into such a gross attribution error. The hadith has no mention in any of the mother books of Hadith printed at all. Rather, Abu Abdullah Al-Dabbi extracted it in «The Sixty-First Session» of \"Al-Amali\" (Folio 2/ 2) with the wording that is in the book. And Ibn Adi extracted it in \"Al-Kamil\" (Folio 333/ 2) without mentioning Ali in it, so the second half became raised (Marfu' - attributed to the Prophet) as well. Its chain is very weak; it revolves around Ubaidullah bin Abi Humayd. Al-Hafiz Ibn Hajar said in \"Al-Taqrib\": «Abandoned in Hadith (Matruk al-Hadith)». Al-Bukhari said of him: «He narrates wonders from Abu Al-Malih»! I say: Is this not one of them? The Twenty-Fourth Hadith (p. 63) «From Abu Hurairah, may Allah be pleased with him, raising it [to the Prophet]: Indeed Allah, Mighty and Majestic, says: I am the third of the two partners as long as one of them does not betray his companion. If he betrays him, I depart from between them. Abu Dawood extracted it». I say: Its chain is weak, and it has two defects: First: The anonymity (Jahalah) of Abu Hayyan Al-Tamimi, one of its narrators. Al-Dhahabi said: «He is hardly known, and the hadith has a defect». I say: It is:",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 27
  },
  {
    "serial_number": "3283093",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 26,
    "volume_number": 1,
    "text": "The other [issue]: It is the disagreement regarding Abu Hayyan concerning its connection (Wasl) and disconnection (Irsal), and Al-Daraqutni preferred its disconnection. Its explanation is in \"Irwa al-Ghalil\" (1461). Hadith Twenty-Five (p. 64): «From Hudhayfah and Ibn Masud, may Allah be pleased with them both, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: Let not one of you be an 'Imma'ah' (a blind follower), saying: 'I am with the people; if the people do good, I do good, and if they do evil, I do evil.' Rather, discipline yourselves: if the people do good, do good, and if they do evil, do not oppress.' Narrated by Al-Tirmidhi.» I say: There are three criticisms against it: First: It is not in Al-Tirmidhi except from the narration of Hudhayfah alone! Second: It is not found with him with the mentioned wording; rather, it is with the wording: «Do not be an 'Imma'ah', saying: 'If the people do good, we do good, and if they are unjust, we are unjust.' Rather, discipline yourselves...» etc. Third: Its chain of narration is weak, and Al-Tirmidhi's statement: «A Hasan Gharib Hadith, we do not know it except from this route,» is from his leniency which we have previously discussed. It contains two defects: First: Al-Walid bin Abdullah bin Jami', who is disputed over; Al-Dhahabi included him in \"Al-Du'afa\" (The Weak Narrators), and Al-Hafiz said in \"Al-Taqrib\": «Truthful (Saduq) but hallucinates.» The other: Abu Hisham Muhammad bin Yazid; Al-Hafiz said: «He is not strong, and Al-Bukhari said: I saw them agreeing on his weakness.» Al-Dhahabi included him in \"Al-Du'afa\". It is known from Ibn Masud as a Mawquf (stopped at the Companion) narration in abbreviated form with the wording:",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 28
  },
  {
    "serial_number": "3283094",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 27,
    "volume_number": 1,
    "text": "«Become a scholar or a student, and do not become an 'Imma'ah' between that.» Narrated by Ibn Abd al-Barr in \"Jami' al-Ilm\" (2/112) with a Hasan chain from him. Hadith Twenty-Six (p. 64): «From Rafi' bin Makith, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: Good ownership [of slaves/animals] is increase [in wealth], and bad character is an ill omen. Narrated by Abu Dawood.» I say: Its chain is weak; it contains Uthman bin Zufar who is unknown (Majhul), and there is identifying confusion in its chain, and there is no space to explain it now; its place is in \"Al-Ahadith Al-Da'ifah wal-Mawdu'ah\" number (794). Hadith Twenty-Seven (p. 67): «From Abu Umamah Al-Shaybani (thus in the original!) (1) - and his name is Muhammad (thus in the original!) - a Levantine, who said: I asked Abu Tha'labah Al-Khushani, may Allah be pleased with him, saying: I said: O Abu Tha'labah, what do you say regarding this verse (5:105) {Upon you is [responsibility for] yourselves}? He said: By Allah, you have asked one who is informed about it; I asked the Messenger of Allah, may Allah's peace and blessings be upon him, about it, and he said: Enjoin the good and forbid the evil, until you see stinginess obeyed, desires followed, the worldly life preferred, and everyone with an opinion impressed by his own opinion. Then take care of yourself, and leave the common people alone, for indeed ahead of you are days wherein patience is like holding onto hot coals; for the one acting in them is the reward of fifty men working like your work. Narrated by Abu Dawood and Al-Tirmidhi.» I say: Al-Tirmidhi said: «A Hasan Gharib Hadith.» And I say: Its chain is weak, for it is from the narration of Utbah bin Abi Hakim, who said Amr bin Jariyah Al-Lakhmi told us, from Abu Umayyah Al-Sha'bani with it.",
    "foot_note": "1. (1) The correct reading in both places is «Abu Umayyah Al-Sha'bani and his name is (Yuhmid)» with a Dammah on the Ya and a Kasrah on the Mim.",
    "book_id": "133363",
    "new_page_number": 29
  },
  {
    "serial_number": "3283095",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 28,
    "volume_number": 1,
    "text": "And this is a chain sequential with defects. First: Abu Umayyah Al-Sha'bani, no one authenticated him except Ibn Hibban, and he is lenient in authentication; therefore, Al-Hafiz did not authenticate him but said: Acceptable (Maqbul), meaning soft in Hadith when narrating alone, as is the case in this Hadith. Second: Amr bin Jariyah, and the verdict on him is like what we said about his Sheikh. Third: Utbah bin Abi Hakim, weak due to poor memory, and Al-Hafiz said in \"Al-Taqrib\": «Truthful (Saduq), errs a lot.» I say: Al-Tirmidhi mentioned from Ibn Al-Mubarak that someone other than Utbah bin Abi Hakim narrated this Hadith to him, but he did not name him, so that we could look into whether he can be used as supporting evidence or not. Hadith Twenty-Eight (p. 70): «From Abdullah bin Masud, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, used to teach them from the supplication after the Tashahhud: 'O Allah, reconcile our hearts upon good, and mend our social relations...' etc., the supplication. Narrated by Abu Dawood.» I say there are two criticisms regarding it: First: Abu Dawood does not have this wording, nor does it contain the explicit mention that the supplication is after the Tashahhud. The explanation: Abu Dawood narrated it in the «Chapter of Tashahhud» via Sharik from Abu Ishaq from Abu Al-Ahwas from Abdullah who said: «We did not know what to say when we sat in prayer, and the Messenger of Allah, may Allah's peace and blessings be upon him, had been taught... so he mentioned similar to it.»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 30
  },
  {
    "serial_number": "3283096",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 29,
    "volume_number": 1,
    "text": "I say: Meaning similar to another Hadith before it via another path from Ibn Masud containing the Tashahhud formula known by him. Then Sharik said: And Jami' - meaning Ibn Shaddad - told us from Abu Wa'il from Abdullah with similar to it, and he said: And he used to teach us words, and he would not teach them to us as he taught us the Tashahhud: «O Allah, reconcile our hearts, and mend our social relations...» etc. The other [criticism]: Its chain is weak because of this Sharik, who is Ibn Abdullah the Judge. Al-Hafiz said: «Truthful, errs a lot, his memory changed since he took the judgeship in Kufa.» Hadith Twenty-Nine (p. 6): «From Jami' bin Umayr Al-Taymi, may Allah have mercy on him, who said: I entered with my paternal aunt upon Aisha, and she was asked: Which of the people was most beloved to the Messenger of Allah, may Allah's peace and blessings be upon him? She said: Fatima. It was said: From the men? She said: Her husband; indeed he was one who fasted and stood [in prayer] often. Narrated by Al-Tirmidhi.» I say: Its chain is weak. Al-Tirmidhi said in «Al-Manaqib»: Husayn bin Yazid Al-Kufi told us: Abd al-Salam bin Harb told us from Abu al-Jahhaf from Jami' bin Umayr with it. I say: It has two defects: First: This Jami', Al-Hafiz said about him in \"Al-Taqrib\": «Truthful, errs, and practices Shi'ism.» Al-Dhahabi included him in \"Al-Du'afa\" and said: «A famous Tabi'i, accused of lying.»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 31
  },
  {
    "serial_number": "3283097",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 30,
    "volume_number": 1,
    "text": "I say: The likes of him are not used as proof, and no dignity [is intended], especially since he is a Shi'i narrating regarding the virtue of Ali, may Allah be pleased with him. The other: Husayn bin Yazid Al-Kufi; Al-Hafiz said: «Soft in Hadith.» Al-Tirmidhi also narrated it via Ja'far Al-Ahmar from Abdullah bin Ata from Ibn Buraydah from his father who said: The most beloved of women to the Messenger of Allah, may Allah's peace and blessings be upon him, was Fatima, and from the men was Ali.» This is also weak in chain, and its defect is from Abdullah bin Ata, for despite being one who errs, he used to practice Tadlis (concealing defects), as in \"Al-Taqrib\", and he used the 'An'anah (saying 'from'). And Ja'far Al-Ahmar is Ibn Ziyad, a Kufan who is Truthful (Saduq) but practices Shi'ism! I see that the Hadith from Aisha is false (Batil), and from other than her is denounced (Munkar), due to its contradiction with what is established from a group of Companions, including Lady Aisha herself, may Allah be pleased with her. Ahmad narrated (6/241) from Abdullah bin Shaqiq who said: I said to Aisha: Which of the people was most beloved to the Messenger of Allah, may Allah's peace and blessings be upon him? She said: Aisha. I said: Then from the men? She said: Her father. I say: Its chain is authentic. The Prophet, may Allah's peace and blessings be upon him, himself was asked this question, and he answered with the same answer as Aisha, which indicates that she did not say that by opinion, but by instruction (Tawqifan). It is in the \"Sahihayn\" from the Hadith of Amr bin Al-Aas, may Allah be pleased with him. It has a supporting evidence from the Hadith of Anas in Ibn Majah (101) with an authentic chain according to the condition of the two Sheikhs. All of this indicates the falsehood of the Tirmidhi Hadith, for how is it conceivable that Lady Aisha would answer...",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 32
  },
  {
    "serial_number": "3283098",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 31,
    "volume_number": 1,
    "text": "...with an answer contradicting her established answer, and contradicting the answer of the Messenger of Allah, may Allah's peace and blessings be upon him, himself?! After writing what preceded, I saw Al-Dhahabi saying in \"Talkhis Al-Mustadrak\" (3/154), critiquing Al-Hakim's authentication of the Hadith: «I say: Jami' is accused, and Aisha did not say this at all!» Hadith Thirty (p. 8): «From Buraydah, may Allah have mercy on him, who said: I heard the Messenger of Allah, may Allah's peace and blessings be upon him, saying: 'Indeed, in some eloquence is magic, in some knowledge is ignorance, in some poetry is wisdom, and in some speech is a burden.' Narrated by Abu Dawood.» I say: Its chain is weak, because he narrates it via Abu Ja'far Al-Nahwi Abdullah bin Thabit who said: Sakhr bin Abdullah bin Buraydah told me from his father from his grandfather. It has two defects: First: This Sakhr is soft in Hadith as in \"Al-Taqrib\". The other: Abdullah bin Thabit, Al-Hafiz said: «Unknown (Majhul).» Only the first and third sentences are proven from the Hadith; Abu Dawood and others narrated them from Ibn Abbas with a Hasan chain, and Al-Bukhari has the first of them from the Hadith of Ibn Umar, and the other from the Hadith of Ubayy. Hadith Thirty-One (p. 35): «From Al-Abbas bin Abd al-Muttalib, may Allah be pleased with him, who said: I said: O Messenger of Allah, Quraysh sat recalling their lineages among themselves, and they made the likeness of that like a date palm...",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 33
  },
  {
    "serial_number": "3283099",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 32,
    "volume_number": 1,
    "text": "...in a mound of earth. So the Messenger of Allah, may Allah's peace and blessings be upon him, said: Indeed Allah created the creation and made me from the best of their divisions, and the best of the two parties, then the best of the tribes, so He made me in the best tribe, then He chose (Original: best!) the houses and made me from the best of their houses, so I am the best of them in self and the best of them in house. Narrated by Al-Tirmidhi.» I say: Its chain is weak; it contains Yazid bin Abi Ziyad, who is the Hashimi, their client, the Kufan. Al-Hafiz said: «Weak, he aged and changed, and became one who accepts prompting.» The author titled it: «The Arabs are the choice of Allah from His creation»! It would have been correct to cite the Hadith of Muslim from Wathilah bin Al-Asqa', for it suffices in the chapter, and its wording is: «Indeed Allah chose Kinanah from the children of Ismail, and chose Quraysh from Kinanah, and chose from Quraysh Banu Hashim, and chose me from Banu Hashim.» However, the mentioned title is not free from objection which will be explained later, Allah willing. Hadith Thirty-Two (p. 60): «From Ismail bin Abdullah bin Al-Harith, may Allah be pleased with him, who said: 'The Messenger of Allah, may Allah's peace and blessings be upon him, bought a garment for some twenty young camels and gifted it to Dhu Yazan.' Narrated by Abu Dawood.» I say: Its chain is weak. He narrated it in «Al-Libas» via Ali bin Zayd from Ishaq bin Abdullah bin Al-Harith that the Messenger of Allah, may Allah's peace and blessings be upon him... the Hadith. From this, it becomes clear that the chain was inverted for the author, so he said: «Ismail» instead of «Ishaq»! This Ishaq is a Tabi'i as in \"Al-Taqrib\", so the Hadith is Mursal. The author saying 'may Allah be pleased with him' implies he is a Companion, and that gives the illusion that the Hadith is connected (Mawsul)!! The Hadith has another defect, which is the weakness of Ali bin Zayd, who is Ibn Jud'an. Al-Hafiz said: «Weak.»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 34
  },
  {
    "serial_number": "3283100",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 33,
    "volume_number": 1,
    "text": "Abu Dawood has another Hadith from Anas: «That the King of Dhu Yazan gifted to the Messenger of Allah, may Allah's peace and blessings be upon him, a garment which he took for thirty-three camels, or thirty-three she-camels, so he accepted it.» Its chain is also weak. Hadith Thirty-Three (p. 63): «From Abu Sa'id Al-Khudri, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: 'Two traits do not gather in a believer: Miserliness and bad character.' Narrated by Al-Tirmidhi.» I say: Al-Tirmidhi, despite his leniency, did not grade it Hasan, but rather weakened it by saying: «A Gharib Hadith, we do not know it except from the Hadith of Sadaqah bin Musa.» Al-Munawi said in \"Fayd al-Qadir\": «Al-Dhahabi said: And Sadaqah is weak, Ibn Ma'in and others weakened him. And Al-Mundhiri said: Weak.» Al-Hafiz said: «Truthful (Saduq) but has delusions.» Hadith Thirty-Four (p. 69): «From Thawban, may Allah be pleased with him, that the Prophet, may Allah's peace and blessings be upon him, said: Whoever says when he reaches evening: 'I am pleased with Allah as a Lord, with Islam as a religion, and with Muhammad as a Prophet,' it is a right upon Allah to please him. Narrated by Al-Tirmidhi.» I say: Its chain is weak; it contains Sa'id bin Al-Marzuban. Al-Hafiz said: «Weak, a Mudallis.» I say: And he used 'An'anah! I have discussed the Hadith in my commentary on \"Al-Kalim Al-Tayyib\" (p. 33-34, Islamic Office edition). Hadith Thirty-Five (p. 69): «From Abu Darda, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: It was from the supplication of David that he would say: O Allah, I ask You for Your love and the love of those who love You, and the deed",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 35
  },
  {
    "serial_number": "3283101",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 34,
    "volume_number": 1,
    "text": "that conveys me to Your love. O Allah, make Your love more beloved to me than myself, my wealth, my family, and cold water. He said: And the Messenger of Allah, may Allah's peace and blessings be upon him, when he mentioned David, would narrate about him and say (Original: and says!) he was the most devoted worshiper of humans. Narrated by Al-Tirmidhi.» I say: Its chain is weak; it contains Abdullah bin Rabi'ah Al-Dimashqi. Al-Hafiz said: «Unknown (Majhul).» 2 - What he attributed to Al-Bukhari absolutely while it is suspended (Mu'allaq) in his collection: Hadith One: «From Zayd bin Thabit, may Allah be pleased with him, who said: 'The Messenger of Allah, may Allah's peace and blessings be upon him, commanded me, so I learned for him the Book of the Jews - and in a narration: Syriac - and he said: Indeed, by Allah, I do not trust the Jews with my book. So half a month did not pass for me until I learned it and mastered it. I used to write for him to them, and read for him their books.' Narrated by Al-Bukhari, Abu Dawood, and Al-Tirmidhi.» I say: It is suspended (Mu'allaq) and not connected (Ghayr Mawsul) in Al-Bukhari. He said in «The Book of Judgments»: Kharijah bin Zayd bin Thabit said from Zayd bin Thabit with similar to it. Al-Hafiz Ibn Hajar said in his \"Sharh\" (13/161): «This suspension is among the Hadiths that Al-Bukhari did not narrate except as suspended. He connected it at length in \"The Book of History\"... And Abu Dawood and Al-Tirmidhi narrated it, and he [Tirmidhi] said: A Hasan Sahih Hadith... And Ahmad and Ishaq narrated it in their \"Musnads\"...» Hadith Two (p. 15): «From Al-Sharid bin Suwayd Al-Thaqafi, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: 'Delaying [payment] by the rich allows his honor and punishment.' Narrated by Al-Bukhari, Abu Dawood, and Al-Nasa'i.» I say: Al-Bukhari narrated it suspended with the passive voice (Sighat al-Tamrid), saying in «Al-Istiqrad»: «And it is mentioned from the Prophet, may Allah's peace and blessings be upon him...» and he mentioned it. Al-Hafiz said in his \"Sharh\" (5/46): «Ahmad and Ishaq connected it in their \"Musnads\", as did Abu Dawood and Al-Nasa'i... and... and its chain is Hasan.» I have explained the aspect of its goodness in \"Irwa al-Ghalil\" (1424).",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 36
  },
  {
    "serial_number": "3283102",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 35,
    "volume_number": 1,
    "text": "Hadith Three (p. 17): «From Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: 'Whoever breaks the fast one day in Ramadan without a concession or illness, fasting for an eternity will not make up for it, even if he fasted it.' Narrated by Al-Bukhari, Abu Dawood, and Al-Tirmidhi.» I say: Al-Bukhari suspended it with the passive voice, saying: «And it is mentioned from Abu Hurayrah raising it [to the Prophet]...» and he mentioned it. The authors of the Sunan and others connected it via Habib bin Abi Thabit: Abu Al-Mattus told us from his father from Abu Hurayrah. This is a weak chain, and Al-Tirmidhi, despite his leniency, did not grade it Hasan. It has three defects: Discrepancy (Idtirab), ignorance of the status of Abu Al-Mattus, and doubt regarding his father's hearing from Abu Hurayrah. Refer to the details in \"Al-Fath\" (4/139). Therefore, a group of Imams weakened the Hadith, including Al-Baghawi, Al-Qurtubi, Al-Dhahabi, and Al-Damiri. Refer to \"Fayd al-Qadir\" by Al-Munawi. Furthermore, among the oddities of the author is that while he absolutely attributed the preceding Hadiths to Al-Bukhari, giving students the illusion of their authenticity—while they contain what is weak as we explained—he did the opposite in some instances, attributing them to him as suspended while they are connected with him! Thus, giving the illusion to one who knows the difference between the two categories—as previously explained—that it is weak! While it is authentic and connected with Al-Bukhari! The author said (p. 8): «From Abdullah bin Abbas, may Allah be pleased with them both, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: Indeed, the most deserving thing you take a wage for is the Book of Allah. Narrated by Al-Bukhari as a suspension.» Al-Bukhari said in «Al-Tibb» of his \"Sahih\" (4/61 - Europe edition): Sidan bin Mudarib Abu Muhammad Al-Bahili told me: Abu Ma'shar Yusuf bin",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 37
  },
  {
    "serial_number": "3283103",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 36,
    "volume_number": 1,
    "text": "Yazid Al-Bara' told us: Ubaydullah bin Al-Akhnas Abu Malik told me from Ibn Abi Mulaykah from Ibn Abbas with it. And it contains a story. Yes, Al-Bukhari suspended it in two places in it [the Sahih]: the first in «Al-Ijarah» and the other in «Al-Tibb» as well, in the chapter preceding the chapter of this connected narration. This is one of the many proofs that the author did not copy the Hadiths of his book directly from the Six Books; otherwise, he would have seen this Hadith connected in Al-Bukhari while it is a few lines after the suspended one with him! Al-Daraqutni also connected the Hadith and authenticated it, as did Al-Bayhaqi, and I have extracted it in \"Al-Irwa\" (1489). 3 - His attribution of the Hadith to some of the \"Sunan\" while it is in the \"Sahihayn\" or one of them, and here are the examples: Hadith One: «From Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: 'No people gather in a house from the houses of Allah, Blessed and Exalted, reciting the Book of Allah, Mighty and Majestic, and studying it among themselves, except that tranquility descends upon them, mercy covers them, the angels surround them, and Allah mentions them among those with Him.' Narrated by Abu Dawood.» I say: It is in \"Sahih Muslim\" in «The Book of Dhikr» (8/71) word for word! Hadith Two (p. 18): «From Abu Hurayrah, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said one day: 'Do you know what backbiting is? They said: Allah and His Messenger know best. He said: Mentioning your brother",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 38
  },
  {
    "serial_number": "3283104",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 37,
    "volume_number": 1,
    "text": "with what he dislikes. A man said: What if what I say is in my brother? He said: If what you say is in him, you have backbitten him, and if what you say is not in him, you have slandered him.' Narrated by Abu Dawood and Al-Tirmidhi.» I say: It is in \"Sahih Muslim\" in «Al-Birr wal-Silah wal-Adab» (7/21) via Al-Ala' bin Abd al-Rahman bin Yaqub from his father from Abu Hurayrah with it. Malik narrated it in \"Al-Muwatta\" (2/987/10 - checked by Muhammad Fuad Abd al-Baqi) from Al-Muttalib bin Abdullah bin Hantab Al-Makhzumi as Mursal. On this occasion, it is necessary to alert to a gross error committed by the mentioned checker in his extraction of a narration mentioned by Imam Malik in the chapter preceding the chapter of this Hadith. It stated: «Malik, that it reached him that Jesus, son of Mary, used to say: Do not speak much without the remembrance of Allah, lest your hearts harden, for the hard heart is far from Allah...» etc. Under it, in the referenced extraction, came the text: «Mursal. And Al-Ala' bin Abd al-Rahman bin Yaqub connected it from his father from Abu Hurayrah. Muslim narrated it in: 45 - Book of Birr, Silah, and Adab, 20 - Chapter of Prohibition of Backbiting, Hadith 70.» When I returned to the Hadith he pointed to and the chapter, it became clear that he meant this Hadith of Abu Hurayrah regarding backbiting, and it has absolutely no connection to the saying of Jesus, peace be upon him, which Malik, may Allah have mercy on him, mentioned as a report (Balaghan). So how did this error occur? It seems - and Allah knows best - that the checker Muhammad Fuad Abd al-Baqi, may Allah have mercy on him, had attached the paper of this extraction to the Hadith of Al-Muttalib which Malik narrated from him as Mursal as we mentioned, so it would be printed under it. But the printer made a mistake and printed it under the saying of Jesus, peace be upon him. Then this passed by the proofreader, and I do not rule out",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 39
  },
  {
    "serial_number": "3283105",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 38,
    "volume_number": 1,
    "text": "that he was the checker himself, because he is not among the scholars of Hadith, nor does he possess memorization in it, nor does he have concern for it. He is merely an indexer, and not everyone who says \"So-and-so narrated\" or \"So-and-so reported\" becomes a person of Hadith! As for the reason for discovering this error, it has a funny yet tearful story, which is worth mentioning for the lesson in it: A few years ago, a preacher from some of the mosques of Damascus and one of the itinerant preachers came to me. He mentioned to me that he authored a book in which he selected Hadiths from the books of Sunnah, and that he asked some wealthy benefactors to help him print the book. He said: That benefactor said to him: If Professor Nasir al-Din al-Albani agrees to print it, I will help you with that. Then he asked for my approval, so I refused until I saw the book, so he sent it to me. When I browsed it, I found strange and denounced things in it. Among them was that he attributed this saying of Jesus, peace be upon him, which Malik narrated as a report, to Sahih Muslim from the Hadith of Abu Hurayrah raised to the Prophet, may Allah's peace and blessings be upon him, saying: Jesus said... !! When I saw this, I was astonished at him to the utmost because of my certainty that such a Hadith has no basis in \"Sahih Muslim\", nor in other than it from the Six Books, except for the first sentence of it, for it is with Al-Tirmidhi from the Hadith of Ibn Umar with a weak chain as I explained in \"Silsilat al-Ahadith al-Da'ifah\" number (924) or after it. So I contacted him by phone and mentioned to him my opinion on the book and the criticisms and errors in it, the most severe being this attribution. Then I said to him: Where did you get this from? He remained silent for a while, then said: Wait a little until I bring the book. Then he phoned me",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 40
  },
  {
    "serial_number": "3283106",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 39,
    "volume_number": 1,
    "text": "saying - and oh the horror of what he said -: Imam Malik is the one who attributed the Hadith to Muslim in the Book of Birr and Silah... etc.!! I said: What is this, O Sheikh! Do you not know that between Muslim and Malik are vast deserts [of time], and that Muslim is later than Malik? For among Muslim's Sheikhs is Imam Ahmad, and among this Imam's Sheikhs is Al-Shafi'i, and among Al-Shafi'i's Sheikhs is Malik. So how can Malik attribute the Hadith to Muslim when he died years before him?! Then he fell silent, confused, and spoke words from which I understood that Malik said that in his book \"Al-Muwatta\"! I said: This is impossible, and I will study the subject and clarify the truth to you, Allah willing. So I returned to the Zahiriyyah Library and checked \"Al-Muwatta\" authenticated by Muhammad Fuad Abd al-Baqi, and that was the cause for discovering that gross error which sprouted even grosser ones, due to people's ignorance of Hadith and their lack of care for it even in Sharia schools and colleges. And Allah is the One sought for help. Hadith Three (p. 31): «From Abu Musa Al-Ash'ari, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: If two Muslims face each other with their swords and one of them kills his companion, then both are in the Fire... Narrated by Al-Nasa'i.» I say: The two Sheikhs [Bukhari and Muslim] narrated it from the Hadith of Abu Bakrah, may Allah be pleased with him, so it was obligatory to attribute to them and mention it with their wording, which is close to this. Especially since it is with Al-Nasa'i in «Prohibition of Blood» via paths from Al-Hasan from Abu Musa. Al-Hasan is Al-Basri, and he is a Mudallis from the Companions, and he used 'An'anah in",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 41
  },
  {
    "serial_number": "3283107",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 40,
    "volume_number": 1,
    "text": "all paths from him. Rather, Al-Bazzar said, having mentioned a group of Companions from whom Al-Hasan narrated but did not hear: «And he narrated from Abu Musa Al-Ash'ari, and Abu Musa was only in Basra during the days of Umar, so I do not reckon he heard from him.» As for the two Sheikhs: They narrated it via paths from Al-Hasan also from Al-Ahnaf bin Qays from Abu Bakrah. And Rib'i bin Hirash followed him from Abu Bakrah in Muslim and Al-Nasa'i. So reflect on how the author preferred the strange, defective path and turned away from the authentic path free of defect, with the corroboration, and the two Sheikhs' narration of it!! Hadith Four: (p. 32) «From Abdullah bin Umar, may Allah be pleased with them both, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: 'Do not return after me as disbelievers, striking the necks of one another.' Narrated by Abu Dawood and Al-Nasa'i.» I say: This is in Al-Bukhari and Muslim from the Hadith of Jarir bin Abdullah Al-Bajali and from the Hadith of Ibn Umar as well. It is strange that the author cited it after this in the Farewell Sermon attributing it to them [Bukhari and Muslim]! Al-Bukhari also narrated it from the Hadith of Ibn Abbas and Abu Bakrah Al-Thaqafi. Hadith Five: (p. 68) «The Hour will not be established until the land of the Arabs returns to being meadows and rivers, and until a rider travels between Iraq and Makkah fearing nothing but losing the way, and until Harj increases. They said: And what is Harj, O Messenger of Allah? He said: Killing, killing. Narrated by Ahmad in \"Al-Musnad\" and Al-Hakim in \"Al-Mustadrak\".»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 42
  },
  {
    "serial_number": "3283108",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 41,
    "volume_number": 1,
    "text": "I say: Thus it appeared in the original; he did not mention the Companion of the Hadith, who is Abu Hurayrah, may Allah be pleased with him. The wording of the Hadith belongs to Ahmad (2/370-371), and Al-Hakim has nothing of it except the first sentence, and he said (4/477) «Authentic according to the condition of Muslim, and they did not narrate it,» and Al-Dhahabi agreed with him. Al-Hakim erred, then Al-Dhahabi, in his addition to Muslim, and the author erred even more severely. For if he deemed it permissible to attribute the whole Hadith to Al-Hakim as well, while he has nothing of it except what we mentioned, then it was incumbent to attribute it to Muslim as well; rather, he is more deserving of that according to his [the author's] method! For Muslim narrated the first part of it in «Zakat» (3/84) and its wording is: «The Hour will not be established until wealth increases and overflows, until a man goes out with the Zakat of his wealth and finds no one to accept it, and until the land of the Arabs returns to being meadows and rivers.» And he narrated the last part of it in «Al-Fitan» (8/170-171): «The Hour will not be established until Harj increases. They said...». Both Hadiths are in Muslim from the same path that is in Ahmad and Al-Hakim, from Suhayl bin Abi Salih from his father from Abu Hurayrah. The first Hadith in Muslim is like this: «Qutaybah bin Sa'id told us, Yaqub—who is Ibn Abd al-Rahman Al-Qari—told us from Suhayl» with it. And with this very chain he narrated the second Hadith. Imam Ahmad combined them in one context with the mentioned chain of Muslim and made the second the completion of the first, saying (2/417): «Qutaybah bin Sa'id told us...» and he mentioned it. If you know what preceded, the correct way to extract the Hadith is to say for example: Imam Ahmad narrated it in its entirety, and Muslim without the middle sentence, and Al-Hakim added the first sentence to him [Muslim] but erred!",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 43
  },
  {
    "serial_number": "3283109",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 42,
    "volume_number": 1,
    "text": "Hadith Six: (p. 11) «From Qays bin Abbad, may Allah be pleased with him, who said: I and Al-Ashtar set out to Ali bin Abi Talib and we said to him: Did the Messenger of Allah, may Allah's peace and blessings be upon him, entrust you with anything he did not entrust to the people in general? He said: No, except what is in this. Then he brought out a document from the sheath of his sword, and behold in it was... Narrated by Abu Dawood and Al-Nasa'i.» I say: This Hadith is in the \"Sahihayn\" and others via paths from Ali, may Allah be pleased with him, with different wordings and abundant benefits, some exceeding others. The author titled it «Recording Hadith in the Prophetic Era», and this portion of it indicating this meaning is extracted in \"Sahih Muslim\" from two paths: First: From Abu Al-Tufayl who said: «Ali was asked: Did the Messenger of Allah, may Allah's peace and blessings be upon him, single you out with anything? He said: The Messenger of Allah, may Allah's peace and blessings be upon him, did not single us out with anything he did not generalize to the people as a whole, except what is in the sheath of this sword of mine. Then he brought out a scroll written in it: Allah cursed the one who sacrifices to other than Allah, Allah cursed...». He narrated it in «Sacrifices». The other: From Ibrahim Al-Tamimi from his father who said: «Ali bin Abi Talib addressed us and said: Whoever claims that we have anything we read except the Book of Allah and this scroll (he said: and a scroll hanging in the sheath of his sword) has lied. In it are the ages of camels, and things regarding wounds, and in it the Prophet, may Allah's peace and blessings be upon him, said: Madinah is a sanctuary between 'Ayr and Thawr, so whoever introduces an innovation in it...» the Hadith.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 44
  },
  {
    "serial_number": "3283110",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 43,
    "volume_number": 1,
    "text": "He narrated it in «Manumission». It is also in Al-Bukhari in «Inheritance» but it does not mention the sheath, though the point of evidence from it is present with him as well. Hadith Seven: (p. 64): «From Anas bin Malik, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: The likeness of the believer who reads the Quran is like the citron (Utrujjah)... and the likeness of the believer who does not read the Quran is like the date... and the likeness of the sinner who reads the Quran is like the basil... and the likeness of the sinner who does not read the Quran is like the colocynth (Hanzalah)... and the likeness of the righteous companion is like the owner of musk... and the likeness of the evil companion is like the owner of the bellows... Narrated by Abu Dawood.» I say: This is in the \"Sahihayn\" from the Hadith of Abu Musa Al-Ash'ari, may Allah be pleased with him, separately. The four examples related to reading the Quran are in a Hadith in Al-Bukhari in «Foods», «Virtues of the Quran», and «Tawhid», and in Muslim in «Travelers»; both from the path of Qatadah who said: Anas told us from Abu Musa. It is as if the mention of Abu Musa was dropped from Abu Dawood's narration, for it is with him from this route: Qatadah from Anas. He also narrated it in another version like the narration of the two Sheikhs. The other two examples are in another Hadith, and from another path from Abu Musa. Al-Bukhari narrated it in «Sales» and «Slaughters», and Muslim in «Birr and Silah». Hadith Eight: (p. 69) «From Buraydah, may Allah be pleased with him, that the Prophet, may Allah's peace and blessings be upon him, said:",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 45
  },
  {
    "serial_number": "3283111",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 44,
    "volume_number": 1,
    "text": "'Whoever says when he reaches morning or when he reaches evening: O Allah, You are my Lord, there is no god but You, You created me...' he enters Paradise. Narrated by Abu Dawood.» I say: This is in \"Sahih Al-Bukhari\" from the Hadith of Shaddad bin Aws raised [to the Prophet] with it, and he added at the beginning of the supplication: «The Master of Seeking Forgiveness: O Allah...». If the author had preferred it, he would have been correct twice: First because it is more authentic, and second because it contains the addition! 4 - His attribution of the Hadith to other than its extractor, and to one whose extraction is less primary than the Six, and to other than its Companion, and attaching an addition to it from an unreliable source; these are four criticisms: Example of the first: (p. 22): «From Aisha, may Allah be pleased with her, who said: I did not see anyone more resembling the Messenger of Allah, may Allah's peace and blessings be upon him, in manner, dignified bearing, and guidance in his standing and sitting than Fatima, daughter of the Messenger of Allah, may Allah's peace and blessings be upon him. She said: And she used to, when she entered upon the Prophet, may Allah's peace and blessings be upon him, he would stand to her, kiss her, and seat her in his place. And the Prophet, may Allah's peace and blessings be upon him, used to, when he entered upon her, she would stand from her sitting place, kiss him, and seat him in her place. When the Prophet, may Allah's peace and blessings be upon him, became ill, Fatima entered and leaned over him, kissed him, then raised her head and cried, then leaned over him, then raised her head and laughed. So I said: I used to think this one was of the wisest of our women, but behold she is just one of the women. When the Messenger of Allah, may Allah's peace and blessings be upon him, passed away, I said to her: Tell me about when you leaned over the Messenger of Allah, may Allah's peace and blessings be upon him, raised your head and cried, then leaned over him, raised your head and laughed, what compelled you to that? She said: I would then be spreading secrets. He informed me that he was dying from this pain of his, so I cried. Then he informed me that I",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 46
  },
  {
    "serial_number": "3283112",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 45,
    "volume_number": 1,
    "text": "would be the quickest of his family to join him, so that was when I laughed. Narrated by Al-Bukhari, Muslim, Abu Dawood, and Al-Tirmidhi.» I say: This Hadith cannot be correctly attributed except to Al-Tirmidhi alone, for he is the one who narrated it with this completeness in «Al-Manaqib» and said: «A Hasan Gharib Hadith.» As for Abu Dawood, he only narrated from it the story of standing and kissing. This is what the two Sheikhs did not narrate at all; rather, they narrated with another chain the end of it regarding Fatima's crying and laughing, peace be upon her. There is another example, a Hadith he attributed to Abu Dawood which has no basis with him and is very weak, which preceded in the first chapter (Hadith Twenty-Three). A third example is his saying (p. 44): «From Aisha, may Allah be pleased with her, that a young woman entered upon her and said: My father married me to his brother's son to elevate his low status, and I am unwilling. She said: Sit until the Messenger of Allah, may Allah's peace and blessings be upon him, comes. So the Messenger of Allah, may Allah's peace and blessings be upon him, came, and she informed him. He sent for her father, called him, and placed the matter in her hands. She said: O Messenger of Allah, I have allowed what my father did, but I wanted to teach the women that fathers have no say in the matter. Narrated by Al-Nasa'i.» I say: The Hadith is with Al-Nasa'i in «The Book of Marriage» (2/78) with this context except for the last sentence of it, which is worded: «But I wanted to teach that women have a say in the matter.» Ahmad (6/136) and Al-Daraqutni (386) narrated it with the wording of the book, as did Ibn Majah (1874), except that he made it from the Hadith of Buraydah. Al-Daraqutni (386) and Al-Bayhaqi (7/118) narrated it with Al-Nasa'i's wording and added at its end: «Or not?».",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 47
  },
  {
    "serial_number": "3283113",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 46,
    "volume_number": 1,
    "text": "Furthermore, the Hadith has a weak chain, because it is from the narration of Kahmas bin Al-Hasan from Abdullah bin Buraydah from Aisha. Al-Daraqutni and Al-Bayhaqi said following it: «And this is Mursal; Ibn Buraydah did not hear from Aisha, may Allah be pleased with her.» All narrators from Kahmas said: From Abdullah bin Buraydah from Aisha, except Waki', who said: From Ibn Buraydah from his father who said: then he mentioned it. Ibn Majah narrated it saying: Hannad bin Al-Sari told us, Waki' told us with it. This is a mistake from Hannad, for Imam Ahmad said: Waki' told us, Kahmas told us from Abdullah bin Buraydah from Aisha. And this is the correct view: That the Hadith is from Aisha, agreeing with this narration from Waki' to the narration of the group from Kahmas. Example of the second criticism: (p. 16) «From Mu'adh bin Jabal, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: Whoever gives the Zakat of his wealth seeking reward, he has its reward. And whoever withholds it, we are taking it and half of his wealth, a determination from the determinations of our Lord; the family of Muhammad has no right to any of it. Narrated by Razin.» I say: He is Razin bin Mu'awiyah Abu Al-Hasan Al-Abdari Al-Andalusi Al-Saraqusti, died in the year (535), authored \"Tajrid al-Sihah wal-Sunan\", and he is the one intended when attributing the Hadith to him. He is not known today [meaning his book is not widely available], but the author and others attribute to him via another book, such as \"Jami' al-Usul\" by Ibn Al-Athir and \"Al-Mishkat\" and others. It appears from what scholars quote from him that many Hadiths and additions to texts occurred in his book which have no basis with any of the Imams of Hadith, let alone the Six Books. Among that is the Hadith of Salat al-Ragha'ib, and another Hadith on the virtue of the Faqih, the fabrication of which I explained in my commentary on \"Al-Mishkat\" (1/84/251), so refer to it if you wish.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 48
  },
  {
    "serial_number": "3283114",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 47,
    "volume_number": 1,
    "text": "Because of that, there is no benefit or utility in attributing the Hadith to Razin, especially if the Hadith attributed to him is in some of the Six Sources, like this Hadith. For Abu Dawood, Al-Nasa'i, as well as Al-Darimi, Al-Hakim, Ahmad, and others narrated it from the Hadith of Bahz bin Hakim from his father from his grandfather Mu'awiyah bin Haydah. Its chain is Hasan, and Al-Hakim and Al-Dhahabi authenticated it. Making it from the Hadith of Mu'adh bin Jabal is an illusion by the author or Razin. This serves as another example of the many examples that the author did not collect these Hadiths from the Six Books, but from others that quote from them! Example of the third criticism, which is attributing the Hadith to other than its Companion, is his saying: «From Anas bin Malik, may Allah be pleased with him, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: No one greets me except that Allah, Blessed and Exalted, returns my soul to me until I return the greeting to him. Narrated by Abu Dawood.» I say: This is with Abu Dawood at the end of the Book of «Hajj» from the Hadith of Abu Hurayrah, not from the Hadith of Anas! And it has no basis from him as far as we know. There is disagreement regarding the provenance of the Hadith, and the preferred view with us is that it has a Hasan chain. And Allah knows best. Example of the fourth criticism is his saying (p. 50): «From Buraydah, may Allah be pleased with him, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, went out on one of his expeditions. When he returned, a black young woman came and said: I had vowed that if Allah returned you safely, I would beat the Duff (drum) before you and sing. He said to her: If you have vowed, then beat it, otherwise do not. She said: I have vowed. So she began to beat it (Razin added: and say: 'The full moon rose upon us from the valley of Wada', gratitude is obligatory upon us... as long as a caller calls to Allah'",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 49
  },
  {
    "serial_number": "3283115",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 48,
    "volume_number": 1,
    "text": "then they agreed) So Abu Bakr entered while she was beating... Narrated by Al-Tirmidhi. I say: Razin was unique in mentioning this addition in this Hadith, and it has no basis in any of the paths of the Hadith as far as we know. Al-Tirmidhi narrated it without them as you learned, and likewise Ahmad and others narrated it from Buraydah with a good (Jayyid) chain. It has a witness from the Hadith of Amr bin Shu'ayb from his father from his grandfather without this addition and without what follows it. Abu Dawood narrated it, and the author mentioned it after this. You have known something of Razin's condition in the example of the second criticism. Yes, this addition was narrated in another Hadith, having no relation to this story, with the wording: «When the Messenger of Allah, may Allah's peace and blessings be upon him, arrived in Madinah, the women, children, and boys began to say: The full moon rose upon us...». Abu Al-Hasan Al-Khila'i narrated it in \"Al-Fawa'id\" (59/2). However, its chain is perplexing (Mu'dal) and incorrect, and there is objection to its meaning. This is not the place to explain that; rather, it is in \"Silsilat al-Ahadith al-Da'ifah\" number (590) and will be published in the magazine \"Al-Tamaddun Al-Islami\" in some issues of the coming year, Allah willing. It is among the wonders that some Sheikhs use it as evidence for the permissibility of the Duff in gatherings of Dhikr (1), even though it contains no mention of the Duff at all, nor is it regarding Dhikr; rather, it is regarding permissible amusement, were the Hadith authentic! 5 - His translation [titling] of the Hadith with what it does not indicate. First - He said (p. 7): «The Companions are the choice of Allah from the people». Then he mentioned the Hadith «The best of people is my generation...». I say: The Hadith is more specific than the claim, and the title is more general, such that Prophets would enter into it, for they are from the people. Are the Companions better than them according to the author?! Or is it stuttering and inadequacy in expression?!",
    "foot_note": "1. (1) See the book titled \"Rudud ala Abatil\" (p. 55-56 and 71-72).",
    "book_id": "133363",
    "new_page_number": 50
  },
  {
    "serial_number": "3283116",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 49,
    "volume_number": 1,
    "text": "Second - He said (p. 8): «Wage for Teaching». Then he mentioned the Hadith «Indeed, the most deserving thing you take a wage for is the Book of Allah». I say: The correct view regarding the Hadith is that it is about taking a wage for Ruqyah (incantation) with the Quran, as held by the Hanafis, not for its recitation, nor for its teaching, due to two matters: First: That the Prophet, may Allah's peace and blessings be upon him, said the Hadith on the occasion of the group who took a sheep for Ruqyah, then disliked that, so he, peace be upon him, said this Hadith to them. Had the author cited the Hadith as it appeared in its context/cause, he would have been correct. So I append that for him and say: Ibn Abbas said: A group of the Companions of the Prophet, may Allah's peace and blessings be upon him, passed by a water source where there was a stung or bitten person. A man from the people of the water presented himself to them and said: Is there a Raqi (healer) among you? In the water area is a stung or bitten man. So a man from them went and recited the Opening of the Book (Al-Fatihah) over a sheep [as payment condition], so he was cured. He brought the sheep to his companions, but they disliked that and said: You took a wage for the Book of Allah. Until they arrived in Madinah, and they said: O Messenger of Allah, he took a wage for the Book of Allah. So the Messenger of Allah, may Allah's peace and blessings be upon him, said: Indeed the most deserving...» the Hadith. The other: There are numerous authentic Hadiths contradicting what the author titled the Hadith with. If it is not interpreted as Ruqyah, it conflicts with those Hadiths, and this is not permissible according to the people of knowledge. I have collected a good group of these Hadiths and extracted them in \"Silsilat al-Ahadith al-Sahihah\" under number (256-260), so I suffice here by mentioning two of them with brevity in extraction, saying: First: From Abu Darda that the Messenger of Allah, may Allah's peace and blessings be upon him, said: «Whoever takes a bow for teaching the Quran, Allah will hang upon him a bow of fire on the Day of Resurrection.»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 51
  },
  {
    "serial_number": "3283117",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 50,
    "volume_number": 1,
    "text": "Narrated by Abu Muhammad Al-Makhladi in \"Al-Fawa'id\" and Al-Bayhaqi with a good (Jayyid) chain as said by Ibn Al-Turkmani. Hadith Two: From Abd al-Rahman bin Shibl Al-Ansari who said: I heard the Messenger of Allah, may Allah's peace and blessings be upon him, saying: «Read the Quran, and do not eat by it, do not seek increase by it, do not turn away from it, and do not go to extremes in it.» Narrated by Ahmad, Al-Tahawi, and others with a strong chain as said by Al-Hafiz in \"Al-Fath\". Third - He said (p. 12): «The sin whose punishment is multiplied is death». Then he mentioned the Hadith of Al-Bara' regarding striking the neck of the one who married his father's wife. The statement on this is like the statement on the first example, for the title is more general than the Hadith, and it gives the illusion that everyone who commits a multiplied sin receives the death penalty. For example, it is authentic from the Prophet, may Allah's peace and blessings be upon him, that he said: «For a man to commit adultery with ten women is lighter upon him than to commit adultery with his neighbor's wife.» Does the author say that the adulterer with his neighbor's wife receives the death penalty even if he is not married (Muhsan)?! Similar to it: Fourth - He said (p. 17): «The Haram is not a cure, but it is a disease». Then he mentioned the Hadith of Khamr (alcohol): «It is not a cure, but it is a disease.» This, as you see, is specific to Khamr, so it is not permissible to extend it to all prohibited medicines like anesthetic (Banj) for example. Fifth - He said (p. 22): «The Messenger of Allah, may Allah's peace and blessings be upon him, used to, when Fatima entered upon him, stand for her and kiss her». Then he cited the Hadith of Aisha «that Fatima used to, when she entered upon the Prophet, he would stand to her, kiss her, and seat her in his place, and the Prophet, may Allah's peace and blessings be upon him, used to, when he entered upon her...» so he mentioned similar to it, and it passed in its entirety on p. 44 from the narration of Al-Tirmidhi.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 52
  },
  {
    "serial_number": "3283118",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 51,
    "volume_number": 1,
    "text": "I say: This title is an error as appears with the slightest reflection. This is because the Hadith says: «stood to her» (Qama ilayha), and did not say: «stood for her» (Qama laha) as in the title. Standing *to* a person means going to them and ending up at them, contrary to «standing *for* him», for this does not necessitate anything but standing. The narration of Abu Dawood is more explicit in indicating this meaning, and its wording is: «She used to, when she entered upon him, he stood to her, took her hand, kissed her, and seated her in his place. And he used to, when he entered upon her, she stood to him, took his hand, kissed him, and seated him in her place.» This is explicit that the standing from him, may Allah's peace and blessings be upon him, to her, was only going to her to receive her, evidenced by his taking her hand and his kissing her, may Allah be pleased with her. Standing for reception is legislated and there is no dispute about it due to this Hadith and others with its meaning. This is contrary to the standing that people are accustomed to today, for it is disliked (Makruh) evidenced by the saying of Anas, may Allah be pleased with him: «There was no person more beloved to them than the Messenger of Allah, may Allah's peace and blessings be upon him, yet they would not stand for him, because they knew of his dislike for that.» Narrated by Al-Bukhari in \"Al-Adab Al-Mufrad\" with an authentic chain according to the condition of Muslim. So what Lady Fatima used to do for him, may Allah's peace and blessings be upon him, which is standing *to* him, may Allah's peace and blessings be upon him, is different from what he, may Allah's peace and blessings be upon him, used to dislike, which is standing *for* him, as is apparent. So there is no contradiction between the two Hadiths, and praise be to Allah. If this is known, it becomes clear that there is also no contradiction between this Hadith of Anas and his saying, may Allah's peace and blessings be upon him, in the Hadith of Al-Bukhari: «Stand to your master», because it is not a command for the disliked standing; rather, it is a command to stand *to* the master and go to him. So it is like Fatima's standing *to* him, may Allah's peace and blessings be upon him. Moreover, the explicit mention of that came in this Hadith in a proven narration with the wording «Stand to your master and bring him down.» See if you wish the discussion on it in \"Silsilat al-Ahadith al-Sahihah\" (number 66).",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 53
  },
  {
    "serial_number": "3283119",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 52,
    "volume_number": 1,
    "text": "The summary of the speech is that the author's translation [titling] of the Hadith that the Messenger, may Allah's peace and blessings be upon him, used to stand *for* Fatima when she entered upon him is a clear error, resulting from a lack of reflection on the text and its context, and from a lack of attention to the difference between «stood for so-and-so» and «stood to so-and-so» in the Arabic style, and a lack of recalling the Hadiths reported in the chapter which help the researcher avoid such an error. And infallibility belongs to Allah alone. Sixth - He said (p. 24): «The texts have encompassed every ruling until the Day of Resurrection». Then he cited under it the Hadith of Abu Sa'id Al-Khudri who said: «The Messenger of Allah, may Allah's peace and blessings be upon him, led us in the Asr prayer one day by day, then stood addressing us, and he did not leave anything that will happen until the establishment of the Hour except that he informed us of it...». And he mentioned other Hadiths with its meaning. I say: I do not know how the author understands from this Hadith and those with its meaning this wide, comprehensive meaning, from such Hadiths which are specific to the Signs of the Hour and what will happen of great events until the Day of Resurrection. Is it conceivable that the Prophet, may Allah's peace and blessings be upon him, would mention all the texts of Sharia encompassing every ruling in one sitting, no matter how long this sitting was? And if it is said that this is possible by way of breaking the norm for him, may Allah's peace and blessings be upon him, is it possible for a human mind to encompass all of that and retain it?! Seventh - He said (p. 27): «For the worker in the state is a wife, a servant, and a dwelling...». Then he mentioned under it the Hadith «Whoever is a worker for us, let him acquire a wife, and if he does not have a servant, let him acquire a servant...». I say: It appears the author intended by (the worker in the state) the employee in it, whatever employee he is. And (the Worker - Al-Amil) with this meaning is something we do not know in the language; rather, it came in it with three meanings:",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 54
  },
  {
    "serial_number": "3283120",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 53,
    "volume_number": 1,
    "text": "First: The Caliph, as in the Hadith «I have not left behind [anything except] the expenditure of my family and the provision of my worker (Amil) as charity.» It says in \"Al-Nihayah\" and \"Al-Lisan\": «He intended by (my worker) the Caliph after him.» Second: The one who manages a man's affairs regarding his wealth, property, and work. From it, the one who extracts Zakat is called: Amil. He is the one meant in the verse of charities {and those working to collect it} (Al-Amilina Alayha), and they are the collectors (Jubah). Third: The governor (Wali) whom the Sultan appoints over some lands. It came in \"Al-Lisan\": «So-and-so was employed (ista'mala) meaning he was given charge of a work from the works of the Sultan.» The intended meaning of the Hadith is the second meaning, as appears from Abu Dawood's categorization of it with his saying «Chapter on the Sustenance of Workers (Amilin)» and the Hadiths he listed in it like this Hadith. And the Hadith of Buraydah raised [to the Prophet] with the wording «Whoever we employ on a job and provide him with sustenance, then whatever he takes after that is betrayal (Ghalul).» Imam Al-Khattabi proceeded on this meaning in his explanation of the Hadith in his book \"Ma'alim al-Sunan\" (4/201), so whoever wishes may refer to it. I say: It is as if in the Hadith of Buraydah there is an indication of the secret behind specifying this ruling to the workers whose job is collecting charities from their owners, which is to enrich them beyond needing what they might need of a wife and servant, and to help them perform what is in their hands of wealth fully and completely. And Allah knows best. Eighth - Then he said (p. 50): «Beating the Duff and singing before the Messenger of Allah». Then he mentioned the Hadith of Buraydah in which we discussed the addition added by Razin previously (p. 47), and in it is the permission of the Messenger, may Allah's peace and blessings be upon him, to the woman who had vowed that if Allah returned His Prophet safely, she would beat the Duff before him and sing, so he, peace be upon him, permitted her.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 55
  },
  {
    "serial_number": "3283121",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 54,
    "volume_number": 1,
    "text": "This is specific to beating the Duff and singing in this situation which will not recur, and the title is more general, so it is feared that some people of desires will cling to it, using it as evidence for general permissibility, and thus go astray. Refer to \"Ma'alim al-Sunan\" (4/382). Ninth - He said (p. 52): «Surplus wealth is the right of others». And he mentioned under it the Hadith «The son of Adam has no right in other than these characteristics...». Besides being a denounced (Munkar) Hadith with a weak chain as previously explained (p. 25), it does not indicate that what is other than the mentioned characteristics in it of wealth is a right for others that is obligatory for them. Al-Qadi said: «He intended by 'right' what is due to him from Allah without consequence in the Hereafter nor questioning about it, because these characteristics are among the rights that the self cannot do without, and whatever is other than them is from the fortunes about which one is questioned.» If his eminence the Sheikh sees what he titled the Hadith with as correct, has he himself undertaken fulfilling this right for others?! Tenth - Then he said (p. 53): «None of us has a right to surplus wealth». Then he mentioned the Hadith of Abu Sa'id «While we were on a journey, behold a man on a mount of his, he said: He began turning his gaze right and left, so the Messenger of Allah, may Allah's peace and blessings be upon him, said: Whoever has a surplus mount, let him return it to the one who has no mount, and whoever has surplus provision, let him return it to the one who has no provision. And he mentioned of the categories of wealth what he mentioned, until we saw that none of us had a right to any surplus.» Narrated by Muslim and Abu Dawood. I say: This does not indicate what he titled it for; rather, [the title] is more general than it. It only indicates that he has no right to surplus wealth if there is someone in dire need of it, so it becomes obligatory then to give out from this surplus to him. This is among the rights of wealth that become obligatory due to an occurrence, like his saying, may Allah's peace and blessings be upon him: «Free the captive, and feed the hungry.»",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 56
  },
  {
    "serial_number": "3283122",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 55,
    "volume_number": 1,
    "text": "Narrated by Al-Bukhari. It does not mean that no one has a right to surplus wealth absolutely; otherwise, that would contradict the definitive texts regarding the inviolability of wealth and its prohibition to others except with the willing heart of its owner. And how could it be so when senior Companions died having much surplus wealth, as is known from the condition of Uthman, Abd al-Rahman bin Awf, and others from the Companions, may Allah be pleased with them, and the Messenger of Allah, may Allah's peace and blessings be upon him, approved them on that and did not obligate them to exit from it!! Eleventh - He said (p. 67): «The Petroleum of Iraq». And he mentioned under it the Hadith of Abu Hurayrah from his saying, may Allah's peace and blessings be upon him: «The Hour will not be established until the Euphrates uncovers a mountain of gold, over which people will fight, so ninety-nine out of every hundred will be killed...». Al-Bukhari and Muslim. I say: There is no mention of petroleum in the Hadith at all, neither explicitly nor implicitly. Perhaps when the Professor Author saw people today agreeing to call petroleum \"Black Gold\", it occurred to him to interpret the Hadith with it, imagining that by doing so he presents to people a new scientific proof of the greatness of Islam and its miraculous nature! He missed that it is not permissible in the Sharia to interpret its texts with modern terminologies. For example, it is not permissible to interpret His saying, Exalted is He, {All that - its evil was ever hateful to your Lord} meaning not prohibited (Ghayr Muharram) because it is an interpretation by terminology [where Makruh means disliked but not Haram in Fiqh terminology]. Nor his saying, may Allah's peace and blessings be upon him, in the Hadith «Six whom Allah cursed... and the one who abandons my Sunnah» meaning the one who abandons the Sunnah which is below the Fard (Obligatory), as I had explained in my book \"Tahdhir al-Sajid\" (p. 37-38). Furthermore, the mentioned terminology did not apply the name Gold to petroleum absolutely, but restricted it as Black. So if it were permissible to interpret the Hadith with modern terminologies",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 57
  },
  {
    "serial_number": "3283123",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 56,
    "volume_number": 1,
    "text": "- and this is false - this interpretation would not be permissible here because Gold is absolute [unrestricted] in the Hadith, and the absolute runs upon its absoluteness as is the rule with the scholars. Then, did what he, peace be upon him, informed of occur according to this interpretation? Meaning, did people fight over it such that ninety-nine out of every hundred were killed?! If it is said: It is not necessary that it has happened, but it will definitely happen, we say: Yes, so why then do we not leave the Hadith as every Arab who has not been influenced by modern terminologies understands it, and say that what the Messenger, may Allah's peace and blessings be upon him, informed of will definitely happen? By that, we dispense with such interpretation which is the essence of negating (Ta'til) the Hadith meanings, agreeing with the methods of the Batiniyyah! It is strange that the author repeated this title after three Hadiths, and listed under it the Hadith of Ubayy bin Ka'b with the meaning of Abu Hurayrah's Hadith! 6 - His listing of Hadiths the knowledge of which entails no great benefit today, under the following titles: (p. 21): «Seeking blessings (Tabarruk) from the traces of the Messenger of Allah, may Allah's peace and blessings be upon him, by his command». And he mentioned in it the Hadith of Ali bin Abi Talib, containing his command, may Allah's peace and blessings be upon him, to him and another to drink from a vessel he, may Allah's peace and blessings be upon him, had rinsed his mouth in and to pour it on their faces. Then he said: «The Companions seeking blessings from the traces of the Messenger of Allah, may Allah's peace and blessings be upon him». Then he listed in it the Hadith of Talq bin Ali, containing that he, may Allah's peace and blessings be upon him, performed ablution and rinsed his mouth then poured it into a vessel of theirs. Then he repeated the same title and mentioned under it a third Hadith regarding Asma seeking blessings from the Jubbah (cloak) of the Messenger of Allah, may Allah's peace and blessings be upon him. Then he repeated the title for the fourth time and listed in it a Hadith regarding Umm Salamah seeking blessings from the hair of the Messenger of Allah, may Allah's peace and blessings be upon him. So what is the benefit of repeating these titles and headings at a time when it is impossible today to seek blessings from his traces, may Allah's peace and blessings be upon him, due to their non-existence?! And what they do in some lands of seeking blessings on some occasions from a hair preserved in a glass bottle is something that has no basis in the Sharia, nor is that proven by an authentic path.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 58
  },
  {
    "serial_number": "3283124",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 57,
    "volume_number": 1,
    "text": "Yes, only some Sheikhs of the Tariqahs [Sufi orders] benefit from these titles as previously mentioned in the introduction. Perhaps the author placed these titles as assistance from him to them in enslaving their disciples and subjecting them to themselves in the name of seeking blessings from them! And Allah is the One sought for help. Then he said (p. 23): «Kissing the hand of the Messenger and his feet»! Then he cited a Hadith in which two Jews kissed his hand, may Allah's peace and blessings be upon him, and his foot! I say: Even though the validity of the Hadith is questionable as previously explained in its place (p. 14), does the Sheikh intend by that to legislate for people that the disciple should kiss the foot of his Sheikh as well, relying on the action of the two Jews?! If it is said: But the Messenger, may Allah's peace and blessings be upon him, approved them on that, it is said: Establish the throne then engrave [prove the basis then argue the details], for the Hadith is not proven as we mentioned. And even if it were proven, it is not permissible to analogize the Muslim with the Jew, because honor belongs to Allah, His Messenger, and the believers. So if he, may Allah's peace and blessings be upon him, approved the two Jews kissing his foot, it does not necessitate approving the Muslim on the likes of it, because he [the Muslim] is honorable and that one is humiliated and abased. So what analogy on the face of the earth is more corrupt than this, that the Muslim is analogized with the Disbeliever, and the honorable with the humiliated?! And even if it were permissible, it is not permissible for any Sheikh to analogize himself with the Messenger, may Allah's peace and blessings be upon him, permitting for himself what was permissible for him, may Allah's peace and blessings be upon him! Because it is from the category of analogizing blacksmiths with angels! Or it is at least an analogy with a discrepancy (Qiyas ma'a al-Fariq)! Then he said (p. 42): «Manumission of slave girls then marrying them». And he mentioned under it an authentic Hadith. Then he said: «Let the owner say 'my boy' and 'my girl'». And he mentioned under it an authentic Hadith. Then he said (p. 49): «Whoever slaps a slave, his expiation is freeing him». Then he mentioned under it an authentic Hadith.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 59
  },
  {
    "serial_number": "3283125",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Critique of «Hadith Texts in General Culture» collected and classified by Muhammad Al-Muntasir Al-Kattani, Professor of Hadith",
    "edition": "None",
    "publisher": "Al-Taraqqi Printing Press - Damascus",
    "page_number": 58,
    "volume_number": 1,
    "text": "Then he said (p. 56): «Jihad is obligatory with every righteous and sinner». And he mentioned under it the Hadith «Jihad is obligatory with every commander...». I say: Even though the Hadith has a weak chain as previously explained in its place (p. 24), where is Jihad today - regrettably - so that students are reminded of the obligation of Jihad with every commander even if he is a sinner, or is the intention of the title to indicate that Jihad is obligatory with every commander, even if he is the one who commanded himself by himself and was a sinner ruling by other than what Allah revealed, and seeing in his rule clear disbelief (Kufr Bawah)?! Then where are the slaves and slave girls taken by a legitimate method so that we apply those Hadiths to them?! Or is the intent of those repeated titles to justify the enslavement present today in some lands which the Noble Sharia does not allow? This is the last of what was facilitated for us to mention and alert upon in this haste, hoping from Allah Almighty that He benefits the Muslims generally, and the students specifically with it, and that He makes our deeds purely for His Face, and in agreement with the guidance of His Prophet, may Allah's peace and blessings be upon him. Indeed, He is the best One asked.",
    "foot_note": "None",
    "book_id": "133363",
    "new_page_number": 60
  }
]