[
  {
    "text": "Quranic Objectives in Surah (Qaf)\nAuthor: حماد بن محمد يوسف\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1426\nbook_title: المقاصد القرآنية في سورة (ق)\nbook_link: https://shamela.ws/book/255\nbook_id: 255\nauthor_name: حماد بن محمد يوسف\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/585\nauthor_ID: 585\neditor: Null\npublisher: مجلة تدبر، السنة الرابعة (العدد الثامن، رجب ١٤٤١ هـ - مارس ٢٠٢٠ م). مجلة تدبر: مجلة علمية سعودية محكّمة تعنى بمجال تدبر القرآن الكريم بدأت في محرم ١٤٣٨ هـ وتصدر مرتين سنويا\nedition: Null\npages: 57\nvolumes: Null\npagination: [ترقيم البحث موافق للمجلة، ورقم الجزء هو رقم العدد]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1067017",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Quranic Sciences and Principles of Exegesis. Book: Quranic Objectives in Surah (Qaf). Author: Hammad bin Muhammad Yusuf. Research published in: Tadabbur Journal, Fourth Year (Issue Eight, Rajab 1441 AH - March 2020 CE). Tadabbur Journal: A Saudi scientific peer-reviewed journal concerned with the field of reflecting upon the Holy Quran, started in Muharram 1438 AH and is published twice a year. Number of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nBook: Quranic Objectives in Surah (Qaf). Author: Hammad bin Muhammad Yusuf. Research published in: Tadabbur Journal, Fourth Year (Issue Eight, Rajab 1441 AH - March 2020 CE). Tadabbur Journal: A Saudi scientific peer-reviewed journal concerned with the field of reflecting upon the Holy Quran, started in Muharram 1438 AH and is published twice a year. Number of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nAuthor: Hammad bin Muhammad Yusuf. Research published in: Tadabbur Journal, Fourth Year (Issue Eight, Rajab 1441 AH - March 2020 CE). Tadabbur Journal: A Saudi scientific peer-reviewed journal concerned with the field of reflecting upon the Holy Quran, started in Muharram 1438 AH and is published twice a year. Number of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nResearch published in: Tadabbur Journal, Fourth Year (Issue Eight, Rajab 1441 AH - March 2020 CE). Tadabbur Journal: A Saudi scientific peer-reviewed journal concerned with the field of reflecting upon the Holy Quran, started in Muharram 1438 AH and is published twice a year. Number of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nTadabbur Journal: A Saudi scientific peer-reviewed journal concerned with the field of reflecting upon the Holy Quran, started in Muharram 1438 AH and is published twice a year. Number of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nNumber of pages: 57 [Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\n[Research pagination matches the journal, and the volume number is the issue number]. Shamela publication date: 26 Ramadan 1442.\nShamela publication date: 26 Ramadan 1442",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 3
  },
  {
    "serial_number": "1067018",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Research Abstract: This research is concerned with studying: (Quranic Objectives in Surah 'Qaf'), relying on the inductive and deductive method. Its importance lies in the virtue of Surah (Qaf) and its great status among the Quranic chapters. Yet, it has not received its due share in studies addressing Quranic objectives, despite its importance in understanding and reflecting upon the Quran. The research aims to derive the Quranic objectives from Surah (Qaf), identify the core issues addressed by the Surah, and understand the secret behind the Prophet's (peace be upon him) recitation of this Surah in large gatherings. This research consists of an introduction, three sections, and a conclusion: The first section is dedicated to defining the science of Quranic Objectives and explaining its importance. The second section is an introductory preface to Surah (Qaf), mentioning aspects that help reveal the Quranic objectives. The third section (which is the core of the research) mentions the objective of the Surah in general with supporting evidence, then its sub-themes, followed by a detailed objective-based reflection (Tadabbur) on the Surah's verses. The research concluded that Surah (Qaf) addressed several main topics regarding Islamic creed; establishing the fundamentals of religion such as belief in Allah, His angels, His books, His messengers, the Last Day, and Destiny, and providing a complete conception of human life,",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 4
  },
  {
    "serial_number": "1067019",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "and other important Quranic objectives. Therefore, the Prophet (peace be upon him) used to recite it in large gatherings. The research recommends the necessity of paying attention to Surah (Qaf) through recitation and reflection, reviving the Sunnah of the Messenger of Allah (peace be upon him) in reading it during the Friday sermon and Eid prayer, and studying the Quranic objectives in the Surahs, especially those Surahs that the Prophet (peace be upon him) used to recite regularly. Keywords: Quranic Objectives - Objective-based Reflection (Tadabbur) - Exegesis (Tafsir) - Surah Qaf - Meccan Surahs - Al-Mufassal. * * *",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 5
  },
  {
    "serial_number": "1067020",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "The Qur'anic Purposes of Sura Qaf Prepared by: Hammad Mohammed Yusuf Email: mdhammadyusuf 1@gmail.com Summary: This piece of research explores the Quranic objectives in the Chapter of Q?f، depending on the deductive and inductive methods. Its significance lies in the merit of this chapter and its great position among the Quranic chapters، and yet the studies that dealt with the Quranic objectives did not examine it adequately despite its being instrumental in understanding and meditating on the Qur'an. The research aims to extract the Quranic objectives from the chapter of Q?f، highlight the key issues that it tackles and find out why the Prophet (Peace be upon him) used to recite it at his major assemblies. This research includes an introduction، three sections، and a conclusion. The first section defines the study of the Quranic objectives and clarifies its importance. As for the second section، it presents an introduction to the chapter of Q?f which sheds light on what helps to draw the Quranic objectives. The third section (which is also the crux of",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 6
  },
  {
    "serial_number": "1067021",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "the research) discusses the general meaning of the chapter in question، together with its supporting evidence، its sub-themes and the meditative consideration of its verses. Main Findings: The research concludes that the chapter of Q?f deals with several primary issues related to the Islamic faith، confirming certain religious fundamentals، including belief in Allah (Exalted be He)، His angels، His sacred books، His prophets، the Doomsday، and predestination and gives a complete picture of man's life. That's why the Prophet (Peace be upon him) was always keen on reciting it on formal occasions. Primary Recommendations: - Special attention should be given to the chapter of Q?f in terms of recitation and meditation. - It should be recited during the Friday Sermon and the Eid prayer to revive the Prophet's established tradition. - The Quranic objectives of the various chapters should be studied، particularly those chapters which the Prophet (Peace be upon Him) recited regularly. Key Words: Quranic objectives- meditative consideration-interpretation -the chapter of Qaf- the Meccan chapters-al-mufassal.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 7
  },
  {
    "serial_number": "1067022",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction: Praise be to Allah, Lord of the Worlds, and peace and blessings be upon the most noble of prophets and messengers. To proceed: The Holy Quran is the clear light, the evident truth, Allah's firm rope, and His straight path. Allah sent it down to His servants to be a methodology for life and a beacon for guidance. He commanded them to adhere to it, understand it, reflect upon it, extract its treasures, stir up its buried gems, reveal its truths, and stand upon its noble goals that guarantee the interests of the servants in their livelihood and their hereafter, and lead them to the path of righteousness. From this standpoint came this research titled: (Quranic Objectives in Surah Qaf), to aid the reader in reflecting upon the words of Allah Almighty. Importance of the Research: • First, the importance of the research stems from the virtue of the Surah dealt with in the research. The Prophet (peace be upon him) used to recite Surah (Qaf) in great gatherings and persisted in doing so as a reminder of the fundamentals of faith and creed it contains, acting upon the saying of Allah Almighty: {So remind by the Qur'an whoever fears My threat}. • Second, the research derives its value from the importance of the science of Quranic Objectives and its role in understanding and reflecting upon the Quran in the optimal way.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 8
  },
  {
    "serial_number": "1067023",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "• Finally: The importance of the research increases due to the lack of independent research and studies on Quranic objectives in this specific Surah, and the scarcity of writing in the field of Quranic objectives in general, despite the scientific awakening in the field of the science of Maqasid (Objectives). Research Objectives: The research aims to care for Quranic guidance and what the Quran was revealed for, to derive the Quranic objectives contained in Surah (Qaf), to know the core issues addressed by the Surah, and to understand the secret behind the Prophet's (peace be upon him) recitation of this Surah in large gatherings. The research also aims to highlight the eloquence and inimitability of the Holy Quran through the study of Quranic objectives, understanding their importance, and contributing to their development. Previous Studies: • Ancient and modern books of Tafsir (exegesis) are not devoid of Quranic objectives, though they vary in the extent and significance of their attention to them; however, they are mostly scattered in various places in their books. Ibn al-Qayyim has precious words about Surah (Qaf) with which he opened his book: (Al-Fawaid), and I singled him out for mention because it is not in a place one would typically look for exegesis. • Some academic papers and theses have been written on Quranic objectives in general or on a specific Surah (other than Surah Qaf), including: • Quranic Objectives: A Methodological Study, Dr. Muhammad bin Abdullah Al-Rabiah, Journal of Imam Al-Shatibi Institute for Quranic Studies, Issue 27, (pp. 207-262). The research addressed the subject of Quranic objectives from both theoretical and practical aspects,",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 9
  },
  {
    "serial_number": "1067024",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "and I benefited from it in revealing the objectives and methods of formulating them, especially in the 'Objective-based Reflection on Verses' (1). • Quranic Objectives in Surah Sad, Shaimaa Ghaniyah, Master's Thesis. • Quranic Objectives in Surah Al-Muzzammil: An Analytical Study, Akram Al-Omar, Master's Thesis. • Some academic theses addressed certain aspects of Surah (Qaf), such as the thematic and linguistic aspects, etc. Among those studies are (2): • Surah (Qaf): An Analytical Thematic Study, Abdullah Saadawi, Master's Thesis. He mentions the topics addressed by Surah (Qaf) - as is apparent from his title - and does not address what we are concerned with - meaning: Quranic Objectives. • Analytical Study of the Objectives and Goals of the 52nd Hizb of the Holy Quran (Surah Al-Fath - Al-Hujurat - Qaf - Al-Dhariyat), Nasr Samir Rashid, Master's Thesis. The researcher mentioned introductory prefaces on objectives and Surah (Qaf) at the beginning of the thesis. Then she dealt with Surah (Qaf) in the third chapter titled: (Analytical Study of the Objectives and Goals of Surah Qaf), dividing the chapter into three sections, and each section into several demands. In each demand, she dealt with some verses, explaining meanings of words, correlations, general meaning, and the objectives and goals of the Quranic text. However, it appeared to me that the researcher's method is more akin to Tafsir (exegesis) than to Quranic Objectives; as she mentioned benefits derived from the verses under the title:",
    "foot_note": "1. See (Demand Four: Objective-based Reflection on Verses) from the third section. \n2. See details of university theses in the list of sources and references.",
    "book_id": "255",
    "new_page_number": 10
  },
  {
    "serial_number": "1067025",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "(Objectives and Goals of the Quranic Text), then proceeded to explain this derived benefit by mentioning verses and Prophetic Hadiths, which does not have a direct connection to Objectives, and she neglected looking at the direct intent of the verse. There is no doubt that Objectives are different from Tafsir. Objectives are concerned with mentioning the general purpose of the Surah, linking the sections of the Surah to one another, then the Objective-based Reflection on the verses by mentioning the direct intent of the verse, aided by the objective of the Surah, then expressing the verse in an objective-oriented style, then mentioning the guidance of the verses; which is the most important intent, as pointed out by Dr. Muhammad Al-Rabiah (1). This research is but an attempt to apply this methodology, hoping it will benefit researchers and those working in the field of Quranic Objectives, which still suffers from ambiguity of concept and instability of methodology. Although this research shares some issues and details with previous studies, it differs from them in terms of its subject or the method of addressing Quranic objectives, as this research deals with Quranic objectives in Surah (Qaf) specifically, and using the methodology mentioned earlier. I ask Allah to grant me success in what He loves and is pleased with, and to grant us sincerity in word and deed. Research Methodology: The research relied on the inductive and deductive method, by tracking the words of scholars in their likely places in books of Tafsir and Maqasid, and deriving Quranic objectives from them.",
    "foot_note": "1. See: Quranic Objectives: A Methodological Study, Dr. Muhammad bin Abdullah Al-Rabiah, p. 251.",
    "book_id": "255",
    "new_page_number": 11
  },
  {
    "serial_number": "1067026",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Research Plan: I divided the research into an introduction, three sections, and a conclusion: 1 - Introduction: Included the importance of the research, its objectives, methodology, plan, and previous studies. 2 - Section One: The Science of Quranic Objectives, containing two demands: First Demand: Definition of Quranic Objectives. Second Demand: Importance of Quranic Objectives. 3 - Section Two: Introduction to Surah (Qaf), containing four demands: First Demand: The Surah's name, number of verses, and stage of revelation. Second Demand: The virtue of Surah (Qaf). Third Demand: The Surah's order in the Mushaf and in Revelation. Fourth Demand: Correlations (Munisabat) in Surah (Qaf). 4 - Section Three: Objective-based Reflection on Surah (Qaf), containing four demands: First Demand: The Objective of the Surah. Second Demand: Topics of the Surah. Third Demand: Segments of the Surah. Fourth Demand: Objective-based Reflection on the Verses. 5 - Conclusion: Contains the most important results and recommendations. I ask Allah to make our deeds purely for His Generous Face, to grant us success in serving His Noble Book, to grant us understanding of it, and may peace and blessings be upon our Prophet Muhammad, his family, and all his companions.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 12
  },
  {
    "serial_number": "1067027",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Section One: The Science of Quranic Objectives. First Demand: Definition of Quranic Objectives. • First: Defining it as a descriptive compound: 1 - Maqasid (Objectives) linguistically: Plural of 'Maqsad', which is a mim-infinitive derived from the verb (Qasada). Ibn Faris (d. 395 AH) said: \"The Qaf, Sad, and Dal are three origins: One indicates coming to something and aiming for it; the other indicates filling/packing into something. The origin is: 'Qasadtu-hu qasdan wa maqsadan' (I aimed for it). From this root: 'Aqsada-hu al-sahm' (The arrow hit him directly), meaning it hit him and killed him on the spot, as if it was said because it did not swerve from him... And from it: 'Aqsadat-hu hayyah' (A snake killed him). The other origin: 'Qasadtu al-shay'' (I broke the thing). And 'Al-Qasdah' is a piece of something when it is broken, plural 'Qasad'. [And from it 'Qasad'] of spears. And 'Rumh qasid', and it has 'inqasad' (broken). The third origin: 'Al-Naqah al-Qasid': The camel packed and filled with meat... Therefore, the poem (Qasidah) was named Qasidah because of the perfection/trimming of its verses, and its verses are only of complete structures\" (1). In the language, it has multiple meanings: including straightness of the road, justice, reliance and aiming, coming to a thing, moderation/middle course, and breaking (2). \"Ibn Jinni said: The origin of the material (Q S D) and its occurrences in the speech of the Arabs is: determination, orientation, rising, and moving towards a thing, whether with moderation or deviation\" (3).",
    "foot_note": "1. Mu'jam Maqayis al-Lugha, by Ibn Faris (5/95), entry (Qasada). \n2. See: Lisan al-Arab, by Ibn Manzur (3/353-357) entry (Qasada). \n3. See: Al-Muhkam wa al-Muhit al-A'zam, by Ibn Sidah, (6/187). Al-Zubaidi attributed it in Taj al-Arus (9/36) to Sirr al-Sina'ah by Ibn Jinni, but I did not find it there.",
    "book_id": "255",
    "new_page_number": 13
  },
  {
    "serial_number": "1067028",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "And the intent (Maqsad) of speech: It is that the speech and utterance are directed towards a specific meaning or end that the speaker desires (1). 2 - And the Quran linguistically: A source like 'Ghufran' from 'Qara'a': 1 - Meaning (Tala - recited), in the sense of a passive participle; i.e., meaning recited. 2 - Or meaning (Jama'a - gathered). According to the first meaning (recited), it is a verbal noun (Masdar). According to the second meaning (gathered), it is a verbal noun with the meaning of an active participle; i.e., meaning 'Gatherer'; because it gathers news and rulings (2). In Sharia: It is \"The miraculous speech revealed to the Prophet (peace be upon him), written in the Mushafs, transmitted via Tawatur (successive narration), whose recitation is an act of worship\" (3). • Second: Defining it as a proper name for a specific art: Quranic Objectives: These are the ends that Allah Almighty intended in His Book, or it is (The intent of Allah Almighty from His speech) (4). Dr. Abdul Karim Hamidi defined them as: \"The ends for which the Quran was revealed to achieve the interests of the servants\" (5). Quranic Objectives can be defined as \"The original meanings for whose explanation and realization the Quran was revealed,\" and we can express non-objectives as secondary meanings. Asserting that this is Allah's intent from His speech - despite its difficulty or impossibility - might be thought of as containing some bad manners with Allah Almighty, and Allah knows best. In any case, \"Quranic Objectives\" is a modern term for a science that crystallized over",
    "foot_note": "1. Theory of Objectives according to Al-Shatibi, by Al-Raysuni (p. 19). \n2. See: Usul fi al-Tafsir, by Ibn Uthaymeen (p. 6). \n3. Manahil al-Irfan, by Muhammad Abdul Azim al-Zarqani (1/21). \n4. See: \"Quranic Objectives: A Methodological Study\", Dr. Muhammad Al-Rabiah (p. 212). \n5. Maqasid al-Quran, by Al-Hamidi (p. 29). See also: Al-Muwafaqat, by Al-Shatibi (4/218).",
    "book_id": "255",
    "new_page_number": 14
  },
  {
    "serial_number": "1067029",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "centuries, its knowledge accumulated, and it is still growing and developing, and its features are forming. Therefore, this science has not received a comprehensive, exclusive definition; because it is still in the stage of formation (1). Second Demand: Importance of Quranic Objectives. The importance of Quranic Objectives is highlighted by the fact that they are the key to Tadabbur (reflection), and reflection is the intended goal of revealing the Quran. Allah Almighty said: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses} [Sad: 29]. Allah Almighty condemned the polytheists who do not reflect upon the Quran nor understand it; Allah Almighty said: {So what is [the matter] with those people that they can hardly understand any statement?} [An-Nisa: 78], and He said: {Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?} [Muhammad: 24]. The Imam of Maqasid, Al-Shatibi, may Allah have mercy on him (d. 790 AH), decided that this condemnation is because they do not understand Allah's intent from the address, not that they do not understand the speech itself; because that is impossible, for they are Arabs, and the Quran was revealed in their tongue, so they know the speech according to their Arabic nature. But there is a difference between the apparent meaning and the intent behind it. Then he said: \"So reflection is only for one who turns to the objectives, and that is apparent in that they turned away from the objectives of the Quran; so reflection did not occur from them\" (2). End quote. The science of Quranic Objectives is capable of regulating the methodology of dealing with the Quran as a text revealed for a specific purpose, so its topics are understood in its light; because knowing the speaker's objective affects the understanding of the text of the speech. regulating this universal objective has its effect",
    "foot_note": "1. See: Centrality of Objectives according to Muhammad Al-Ghazali: An Approach in Concept, Terminology, and Necessity, Prof. Dr. Muhammad Zarman (p. 10, 11). \n2. See: Al-Muwafaqat, by Al-Shatibi (4/208-209).",
    "book_id": "255",
    "new_page_number": 15
  },
  {
    "serial_number": "1067030",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "in interpretation (Ta'wil), understanding verses, directing them to the most likely interpretation, understanding many thorny issues in exegesis, and protecting the Quran from distortion, [false] interpretation, arbitrariness in exegesis, and twisting the meanings of texts like those who take the Quran as a source for sciences it was not revealed to explain, and burden themselves in deducing evidence for their theories and intellectual opinions from the Holy Quran (1). Al-Shatibi (d. 790 AH) said: \"Whoever understands the interior of what he is addressed with will not resort to tricks regarding Allah's rulings to tamper with them by alteration and change. And whoever stops at the mere exterior without turning to the intended meaning; plunges into these far-off mazes... So everyone who deviated and swerved from the straight path; it is to the extent of what he missed of the interior of the Quran in understanding and knowledge. And everyone who hit the truth and encountered correctness; it is to the extent of what he obtained of understanding its interior\" (2). * * *",
    "foot_note": "1. Approaches to \"Objectives of the Holy Quran\": A Historical Study, Abdul Rahman Hallal (p. 228). \n2. Al-Muwafaqat, by Al-Shatibi (4/221-223).",
    "book_id": "255",
    "new_page_number": 16
  },
  {
    "serial_number": "1067031",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Section Two: Introduction to Surah 'Qaf'. First Demand: The Surah's Name, Number of Verses, and Stage of Revelation. * First Issue: The Name of the Surah (1): It was named Surah (Qaf) in the era of the Companions; because it opens with the spelling letter (Qaf), like Surah (Ta-Ha), (Ya-Sin), and (Sad). It is a Tawqifi name (divinely ordained); because established Hadiths and traditions have been reported regarding that (2). Among them is what Ubaidullah bin Abdullah bin Utbah bin Masoud narrated: That Umar bin Al-Khattab asked Abu Waqid Al-Laithi: What did the Messenger of Allah (peace be upon him) use to recite in [Eid] Al-Adha and Al-Fitr? He said: He used to recite in them {Qaf. By the honored Qur'an} and {The Hour has come near, and the moon has split} [Al-Qamar: 1], [Narrated by Muslim] (3). It was also named Surah (Al-Basiqat), because of its mention in His saying: {And tall [basiqat] palm trees having fruit arranged in layers} [Qaf: 10], and this is an Ijtihadi name (based on reasoning); because it was not reported in a Hadith or tradition, but rather it is from the naming of some exegetes (4). * Second Issue: Number of its verses, words, and letters (5): Scholars agreed that the number of its verses is forty-five (45) verses, wherein (Qaf) is not counted as an independent",
    "foot_note": "1. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/273), and Asma' al-Suwar wa Fada'iluha, by Munira Al-Dosari (pp. 396-399). \n2. The Hadiths will be mentioned in the Second Demand: Virtue of Surah 'Qaf'. \n3. Narrated by Muslim in the Book of Eid Prayers (Hadith 891) (3/21). \n4. See: Jamal al-Qurra', by Al-Sakhawi (1/37), Al-Itqan fi Ulum al-Quran, by Al-Suyuti (2/362), Zad al-Masir, by Ibn al-Jawzi (8/3), and Nazm al-Durar, by Al-Biqa'i (18/396). \n5. See: Al-Bayan fi 'Add Ayi al-Quran, by Abu Amr Al-Dani (p. 231).",
    "book_id": "255",
    "new_page_number": 17
  },
  {
    "serial_number": "1067032",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "verse. As for its words, they are three hundred and seventy-five (375) words, and its letters are one thousand four hundred and seventy-four (1474) letters. * Third Issue: Stage of Revelation (Meccan or Medinan): It is a Meccan Surah according to most exegetes, and Ibn Hazm and Ibn Atiyyah (1) reported consensus on that. Al-Suyuti (2) excluded from it His saying: {And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness} [Qaf: 38], and Al-Qurtubi attributed this to Ibn Abbas and Qatadah (3). That is because Al-Hakim and others reported that it was revealed in response to the Jews regarding their saying: That Allah rested on the seventh day, which is Saturday (4). Meaning: The statement of the Jews was heard in Medina, and appended to this Surah due to the suitability of its location; but Ibn Ashour weakened this view and considered it pretentious (5). Second Demand: Virtue of Surah 'Qaf'. Surah (Qaf) is \"The beginning of the Mufassal section [of the Quran] - according to the correct view -\" (6), and \"It included",
    "foot_note": "1. See: Al-Nasikh wa al-Mansukh, by Ibn Hazm (p. 57), Al-Muharrar al-Wajiz, by Ibn Atiyyah (5/155). \n2. See: Al-Itqan fi Ulum al-Quran, by Al-Suyuti (1/102). \n3. See: Al-Jami' li-Ahkam al-Quran, by Al-Qurtubi (19/424). \n4. Al-Mustadrak ala al-Sahihayn, by Al-Hakim Al-Naysaburi (4/391), (H 3728), and (5/7) (H 4045). It contains Abu Sa'd Sa'id bin Al-Marzuban: weak and a mudallis (concealer). Ibn Ma'in said: His hadith is not written. Al-Dhahabi said in \"Al-Talkhis\": Narrated by Abdul Razzaq, from Ibn Uyainah, from Abu Sa'd as Mursal, omitting Ibn Abbas. End quote. Thus, the Hadith is weak. \n5. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/274, 325). \n6. Tafsir Ibn Kathir (13/177). See: Masa'id al-Nazar, by Al-Biqa'i (3/17).",
    "book_id": "255",
    "new_page_number": 18
  },
  {
    "serial_number": "1067033",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "fundamentals of faith that necessitated the Prophet (peace be upon him) reciting it in great gatherings; he would recite it in the Friday sermon, and in the Eid prayer, and due to the frequency of his recitation of it, he would read it in the Morning Prayer (Fajr), and all of that is established and authentic\" (1): • From Umm Hisham bint Haritha bin An-Nu'man, she said: Our oven (tannur) and the oven of the Messenger of Allah (peace be upon him) were one, for two years or a year and some of a year, and I did not take {Qaf. By the honored Qur'an} except from the tongue of the Messenger of Allah (peace be upon him) reciting it every Friday on the pulpit when he addressed the people. [Narrated by Muslim] (2). • From Jabir bin Samura, he said: The Prophet (peace be upon him) used to recite in Fajr {Qaf. By the honored Qur'an} and his prayer afterward was light. [Narrated by Muslim] (3). • From Qutbah bin Malik: He said: I prayed and the Messenger of Allah (peace be upon him) led us in prayer, so he recited: {Qaf. By the honored Qur'an} until he read: {And tall palm trees} [Qaf: 10]. He said: So I started repeating it, and I did not know what he said. [Narrated by Muslim] (4). • From Ubaidullah bin Abdullah bin Utbah bin Masoud: That Umar bin Al-Khattab asked Abu Waqid Al-Laithi: What did the Messenger of Allah (peace be upon him) use to recite in [Eid] Al-Adha and Al-Fitr? He said: He used to recite in them {Qaf. By the honored Qur'an} and {The Hour has come near, and the moon has split} [Al-Qamar: 1]. [Narrated by Muslim] (5). Fakhr Al-Razi (d. 606 AH) said regarding the appropriateness of reciting Surah (Qaf) in Eid prayer: \"Because of Allah's saying in it: {That is the Day of coming out} [Qaf: 42], and His saying: {Thus is the coming out} [Qaf: 11],",
    "foot_note": "1. Dar' Ta'arud al-'Aql wa al-Naql, by Ibn Taymiyyah (7/65). \n2. Narrated by Muslim in Al-Jumu'ah (H 873: 52) (3/13). \n3. Narrated by Muslim in Al-Salah (H 458) (2/40). \n4. Narrated by Muslim in Al-Salah (H 457) (2/39). \n5. Narrated by Muslim in the Book of Eid Prayers (H 891) (3/21).",
    "book_id": "255",
    "new_page_number": 19
  },
  {
    "serial_number": "1067034",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "and His saying: {That is a gathering easy for Us} [Qaf: 44]; for Eid is a day of adornment, so a person should not forget his exit to the plains of accounting, and should not be exultant and boastful on that day, nor commit immorality or debauchery\" (1). Third Demand: Order in Mushaf and Order of Revelation. Surah (Qaf) is the fiftieth Surah in the Mushaf's order, preceded by Surah Al-Hujurat and followed by Surah Al-Dhariyat. It is the thirty-fourth (34) Surah in the order of revelation according to Jabir bin Zaid, revealed after Surah Al-Mursalat (33) and before Surah Al-Balad (35) (2). Fourth Demand: Correlations (Munisabat) in Surah 'Qaf'. * First Issue: Correlation of the Surah's beginning with its end (3): Surah (Qaf) began with the mention of the Quran {Qaf. By the honored Qur'an}, and ended with it {So remind by the Qur'an whoever fears My threat}. Likewise, it began with the mention of Resurrection in His saying: {When we have died and become dust? That is a distant return}, and ended with it in His saying: {The Day the earth splits open from them, hastening forth. That is a gathering easy for Us}. Likewise, the mention of the heavens and earth and what is between them in the beginning of the Surah: {Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?...} verses, and He said at its end: {And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness}.",
    "foot_note": "1. Mafatih al-Ghayb, by Al-Razi (28/145). See also: Masa'id al-Nazar, by Al-Biqa'i (3/21). \n2. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/273). \n3. See: Marasid al-Matali', by Al-Suyuti (p. 67), and Mafatih al-Ghayb, by Al-Razi (28/192).",
    "book_id": "255",
    "new_page_number": 20
  },
  {
    "serial_number": "1067035",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "* Second Issue: Correlation of the Surah with what precedes it (Surah Al-Hujurat): Scholars have paid attention to explaining the correlations between Surahs, which is largely an Ijtihadi (interpretative) matter, hence their opinions varied: Imam Abu Hayyan Al-Andalusi (d. 745 AH) said: \"Its correlation to the end of what preceded it, is that He, the Exalted, informed that those who said: {We have believed} [Al-Hujurat: 14], their faith was not true. The negation of their faith is evidence of denying the Prophethood of the Messenger (peace be upon him), so He said: {But they wonder that there has come to them a warner} [Qaf: 2]. Lack of faith also indicates denial of Resurrection, so He followed it with that\" (1). Al-Biqa'i (d. 885 AH) said: \"Its intent (i.e., Surah Qaf) is to indicate the encompassing Power, which is the result of what Al-Hujurat ended with, concerning encompassing Knowledge, to explain that there must be a Resurrection for the Day of Threat\" (2). Al-Tabarsi (d. 548 AH) said: \"When Allah concluded that Surah by mentioning faith and its conditions for the servants, He opened this Surah by mentioning what must be believed regarding the Quran and evidences of Tawheed\" (3). * Third Issue: Correlation of the Surah with what follows it (Surah Al-Dhariyat): He mentioned in Surah (Qaf) Resurrection, Recompense, Paradise, and Hell, and opened Surah Al-Dhariyat by swearing that what they were promised of that is true and that Recompense is real. He mentioned in Surah (Qaf) the destruction of many generations in general terms, and mentioned that in detail in Surah Al-Dhariyat (4).",
    "foot_note": "1. Tafsir al-Bahr al-Muhit, by Abu Hayyan Al-Andalusi (9/528). \n2. Masa'id al-Nazar li al-Ishraf 'ala Maqasid al-Suwar, by Al-Biqa'i (3/14). \n3. Majma' al-Bayan, by Al-Tabarsi (9/178). \n4. See: Tafsir Al-Maraghi (26/173), and Asrar Tartib al-Quran, by Al-Suyuti (p. 133).",
    "book_id": "255",
    "new_page_number": 21
  },
  {
    "serial_number": "1067036",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "* Fourth Issue: Correlation between Surah (Qaf) and what precedes it in terms of Revelation (Surah Al-Mursalat): Surah Al-Mursalat addresses the subject of deniers of the Day of Judgment through encouragement and intimidation. Surah (Qaf) continues the subject of addressing deniers of the Day of Judgment with another style. These intellectual and psychological remedies contained in Surah (Qaf) are complementary treatments to what came in Surah Al-Mursalat, not identical repetition. Surah (Qaf) adds to it the addressing of those who deny the message of Muhammad (peace be upon him) on the pretext that he is a human from among them, and treating the soul of the Messenger (peace be upon him) and stabilizing his heart against the denial he met from his people and the hurtful words they confronted him with (1). * Fifth Issue: Correlation between Surah 'Qaf' and what follows it in terms of Revelation (Surah Al-Balad): The subject of Surah Al-Balad revolves around the trial which is the purpose of human creation, which logically entails obligation, responsibility, then accounting, deciding judgment, and realization of recompense. The Surah also clarifies some distractions of the soul from faith in the Day of Judgment. So Surah Al-Balad follows up on completing the persuasion regarding the Divine Law of Recompense, around which the subject of Surah Qaf revolved (2). * * *",
    "foot_note": "1. See: Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur, by Abdul Rahman Hassan Al-Maidani (2/546), and (3/11). \n2. See: Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur, by Abdul Rahman Hassan Al-Maidani (3/172-174).",
    "book_id": "255",
    "new_page_number": 22
  },
  {
    "serial_number": "1067037",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Section Three: Objective-based Reflection on Surah (Qaf). First Demand: The Objective of the Surah. Surah (Qaf) addresses - like other Meccan Surahs - the subject of those who deny the message of Muhammad (peace be upon him), and what he brought regarding the news of Resurrection and Account, except that it is more manifest in addressing the Resurrection (1). Al-Biqa'i (d. 885 AH) said: \"Its intent is confirming the Prophet (peace be upon him) in the Message, the bulk of which is warning, and the greatest of which is informing about the Day of Coming Out\" (2). • Proofs of the Objective: 1 - An explicit verse on the objective: Allah Almighty said: {Qaf. By the honored Qur'an (1) But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing. (2) When we have died and become dust? That is a distant return}. The transitional strike (Idrab) from swearing by the Quran to presenting the disbelievers' statement in denying Prophethood and denying the Return indicates the importance of what is transitioned to, and that it is the axis of the speech. 2 - Correlation of the Surah's opening with its conclusion: That the Surah opened with an oath by the Quran, then presented the polytheists' doubt in denying Resurrection, then followed the doubt by establishing Allah's power through cosmic signs and destroying deniers, and concluded likewise by establishing the occurrence of Resurrection, and the command to remind by the Quran. Thus clarifying that the miraculous Quran is among the clearest proofs of Resurrection, and that reflection on the Quran is among the greatest ways leading to knowing the truth.",
    "foot_note": "1. See: Mafatih al-Ghayb, by Al-Razi (28/145), Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/275), and Ma'arij al-Tafakkur, by Al-Maidani (3/11). \n2. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/396).",
    "book_id": "255",
    "new_page_number": 23
  },
  {
    "serial_number": "1067038",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "3 - Its Time of Revelation (1): The Surah is Meccan, and the norm in Meccan Surahs is that they establish Tawheed and sound creed, especially regarding Tawheed of Worship and belief in Resurrection; because most of the addressees deny that (2). 4 - Its Order of Revelation (3): Surah (Qaf) was revealed after Surah Al-Mursalat. Surah Al-Mursalat addressed the subject of deniers of the Day of Judgment with encouragement and intimidation. This Surah is but a complementary treatment with its predecessor in proving the Return through the style of intellectual persuasion, except that Surah (Qaf) adds to it proving Prophethood, and stating the destruction of deniers from previous nations. Surah Al-Balad was revealed after Surah (Qaf), and it continues completing the persuasion regarding the Divine Law of Recompense. 5 - Order in the Mushaf: Surah Al-Hujurat (49) concluded by establishing the comprehensiveness of Allah's knowledge, and Surah (Qaf) confirmed that as well along with establishing the perfection of Allah's power (which is among the clearest proofs of Resurrection). Then Surah Al-Dhariyat followed it, explaining Allah's wisdom in creating man after emphasizing Allah's great power. 6 - Its Virtues (4): The Prophet (peace be upon him) persisted in reciting it in large forums and great gatherings, which indicates its inclusion of the foundations of Islamic creed, most importantly: Belief in Resurrection and the Return. 7 - Its Topics: Surah (Qaf) addressed a number of issues of Islamic creed, and all of them lead back to the issue of Resurrection after death. Their explanation will come in the next demand.",
    "foot_note": "1. Refer to: First Demand of Section Two. \n2. See: Usul fi al-Tafsir, by Ibn Uthaymeen (p. 19). \n3. Refer to Fourth Demand of the previous Section. \n4. Refer to: Second Demand of the previous Section.",
    "book_id": "255",
    "new_page_number": 24
  },
  {
    "serial_number": "1067039",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "8 - Its Characteristics: The letter Qaf is repeated in it fifty-seven (57) times (1). Words containing the letter Qaf are repeated in it remarkably. Ibn al-Qayyim (d. 751 AH) said: \"Reflect on the Surahs that contained single letters [at the beginning], how you find the Surah built upon the word of that letter. From that: (Qaf), the Surah is built upon 'Qaf-based' words: From mention of the Quran (Qur'an), mention of Creation (Khalq), repetition of Saying (Qawl) and reviewing it repeatedly, Proximity (Qurb) to the son of Adam, the two Angels Receiving (Talaqqi) the servant's word, mention of the Observer (Raqib), mention of the Driver (Sa'iq), the Companion (Qarin), Casting (Ilqa') into Hell, Advancing (Taqaddum) the threat, mention of the God-fearing (Muttaqin), mention of the Heart (Qalb), the Generations (Qurun), Exploring (Tanqib) in the lands, mention of 'Before' (Qabl) twice, Splitting (Tashaqquq) of the earth, Casting (Ilqa') the firm mountains in it, the Tall (Basiqat) palm trees, Provision (Rizq), mention of the People (Qawm), the reality of the Threat (Haqq al-Wa'id), even if it were only the repetition of Saying (Qawl) and dialogue. Another secret: Every meaning in this Surah fits what is in the letter Qaf of intensity, loudness (Jahr), elevation, and openness\" (2). End quote. Second Demand: Topics of the Surah (3). Surah (Qaf) included several sub-themes concerning Islamic creed, and all of them relate to addressing the subject of Resurrection and Messengership (4). Here is their explanation:",
    "foot_note": "1. Manifestations of Rhetorical Inimitability in the Holy Quran, Ahmed Qoufi (p. 127). \n2. Bada'i al-Fawaid, by Ibn al-Qayyim (3/1120-1121). Al-Zarkashi (d. 794 AH) quoted it in Al-Burhan fi Ulum al-Quran (1/169), with slight differences, and the printed version contains numerous typos. \n3. Topics of the Surah: These are the partial meanings contained in parts of the Surah. As for the Objective of the Surah, it is the general meaning that gathers these partial objectives and links them. \n4. See: Tafsir Ibn Kathir (13/179), Al-Fawaid, by Ibn al-Qayyim (pp. 5-6), Basa'ir Dhawi al-Tamyiz, by Al-Firuzabadi (1/437), Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/275), and Ma'arij al-Tafakkur, by Al-Maidani (3/12-15).",
    "book_id": "255",
    "new_page_number": 25
  },
  {
    "serial_number": "1067040",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "• Praising the status of the Quran and its inimitability, and validating the one who brought it (Muhammad, peace be upon him), and what he brought (including Resurrection and Account). • Presenting the doubts of the polytheists in denying the Message and Resurrection, and refuting them by establishing the perfection of the Lord's knowledge, the perfection of His power, and the perfection of His wisdom (1). • Clarifying manifestations of Allah's power in the heavens and earth, including growing sustenance and fruits by sending down rain. This is among the clearest proofs of Resurrection. • Clarifying manifestations of Allah's power in destroying the deniers of messengers from previous nations, threatening the polytheists who deny Resurrection with worldly punishment, and stabilizing the Prophet's heart and consoling him. • Establishing the Beginning and the Return, Tawheed, Prophethood, and belief in Angels. • Clarifying Allah's surveillance and hegemony over man, which starts from his birth, passes through death, then ends with Resurrection and Account, then the destiny to Paradise or Hell. • Mentioning Hell and its punishment, Paradise and its bliss, and clarifying the attributes of the people of each. • Affirming attributes of perfection for Allah and exonerating Him from what opposes His perfection of deficiencies and flaws. • Clarifying \"That the perfection of the Lord Almighty and the perfection of His names and attributes require the Return and necessitate it, and that He is exonerated from what His deniers say, just as His perfection is exonerated from all flaws and deficiencies\" (2).",
    "foot_note": "1. Benefit: Ibn al-Qayyim, may Allah have mercy on him, mentioned that proofs of the Return in the Quran are built upon three principles: [1-] Establishing the perfection of the Lord's knowledge, [2-] Perfection of His power, [3-] And perfection of His wisdom. That is because the doubts of those denying Resurrection return to three types: [1-] Denying Allah's knowledge of the scattered parts mixed with parts of the earth in a way that distinguishing parts of different persons is not achieved, [2-] Denying Allah's power to gather those scattered parts and return souls to them, [3-] And denying wisdom in reviving the dead. (See: Al-Fawaid, by Ibn al-Qayyim, pp. 7-8). \n2. See: Al-Fawaid, by Ibn al-Qayyim (p. 9).",
    "book_id": "255",
    "new_page_number": 26
  },
  {
    "serial_number": "1067041",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Third Demand: Segments of the Surah. Surah (Qaf) can be divided according to its objective into three main segments: • First Segment: From the beginning of the Surah to His saying: {Did We fail in the first creation? But they are in confusion over a new creation}: In it is the presentation of the polytheists' doubt, and refuting it by establishing the comprehensiveness of His knowledge and perfection of His power, and displaying some manifestations of His power from Allah's signs in the universe, and in destroying previous nations. • Second Segment: From His saying: {And We have already created man} to His saying 5: {They will have whatever they wish therein, and with Us is more} [Verses: 16-35]: In it is \"Clarification of Allah's surveillance and hegemony over man which starts from his birth, passes through death, then ends with Resurrection and Account, then the destiny to Paradise or Hell.\" • Third Segment: From His saying: {And how many a generation We destroyed before them} to the end of the Surah [Verses: 36-45]: In it is consolation for the Messenger (peace be upon him), clarification of the reality of his message, threatening the polytheists, and establishing Resurrection. It can be said that most of it is confirmation of what was mentioned in the beginning of the Surah explicitly or implicitly in reverse order. Fourth Demand: Objective-based Reflection on the Verses. * First Segment [Verses: 1-15]: {Qaf. By the honored Qur'an} (1): This verse occurs in the context of praising the status of the Holy Quran, stating its inimitability, and that it is the authentic source for receiving proofs of Resurrection and evidences of Prophethood. Allah Almighty swore by the Quran, indicating its honor, great status, elevation, and superiority over all",
    "foot_note": "1. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/276), and Ma'arij al-Tafakkur, by Al-Maidani (3/16-19).",
    "book_id": "255",
    "new_page_number": 27
  },
  {
    "serial_number": "1067042",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "other speech; because the challenge of the Quran's inimitability, and the inability of disbelievers, rather all humans, to oppose it with the like of it - is the most decisive proof that it is from Allah, and the brightest argument for the truthfulness of Muhammad (peace be upon him) in claiming the Message, and for the truth of what he brought regarding the news of Resurrection after death, Recompense, and Account. In this is a vilification of the disbelievers and exposition of the ugliness of their stance towards the Prophet (peace be upon him) and what he brought regarding Resurrection and Account. It is an affirmation that true power is the power of argument and proof which the Quran brought, and that the Quran is the axis of the Call. Therefore, this Surah opened with it, just as it concluded with it: {So remind by the Qur'an whoever fears My threat}. {But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing\"}: This verse occurs in presenting the statement of the polytheists in denying the Message and denying Resurrection. It mentions their denialist wonder at the sending of a messenger from their own human kind, using the excuse that the Messenger being a human contradicts Divine Wisdom, as well as their wonder at his (peace be upon him) warning them of Allah's punishment on the Day of Judgment, and his inviting them to belief in Resurrection after death. The verse confirms \"the vilification of wrangling against the truth and deliberate opposition by following desires, and vilification of holding onto incorrect inherited traditions\" (1). For they \"denied his message and the virtue of his Book with their tongues out of envy and jealousy. In this is evidence that arrogance and envy are impediments to accepting the truth, and that it leads to foolishness...; because they wondered that the Messenger was a human and considered that huge, and deemed it necessary that the god be a stone, and they wondered that they would be returned from dust and life be established for them, yet they did not wonder that they were originated from dust while having no basis in life\" (2). That is because their disbelief \"is based on covering the evidences that",
    "foot_note": "1. See: Al-Tafsir al-Hadith, by Muhammad Darwaza Izzat (2/301). \n2. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/404).",
    "book_id": "255",
    "new_page_number": 28
  },
  {
    "serial_number": "1067043",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "prove the truth with its proofs, by casting doubts, throwing out expressions of wonder, and claiming that the matter is intellectually unacceptable\" (1). {When we have died and become dust? That is a distant return}: This verse occurs in clarifying the naive doubt of the polytheists in denying Resurrection and deeming life after death unlikely. It is that the decay of bodies, their becoming dust, mixing with soil, and the scattering of their parts in the corners of the earth and the blowing of winds leave no hope for the possibility of gathering them, due to lack of knowledge of the locations of those parts and atoms. And even if their locations were known, how would their souls be returned to them? That is a return whose occurrence the mind deems unlikely, and custom considers impossible (2). In it is mention of the polytheists' denial of Allah's knowledge of things and His power to create what He wills, which includes denial of Allah's wisdom in creating man (3). {We know what the earth diminishes of them, and with Us is a retaining record}: This verse is a brief refutation of the polytheists' doubt in denying Resurrection and deeming it unlikely. In it is \"Establishing the perfection of Allah's knowledge\" (4) and establishing His power implicitly, and stating that He, Glory be to Him, \"has known what the earth diminishes of their flesh, bones, and hair, and that just as He is knowing of those parts, He is capable of retrieving them, gathering them after their separation, and composing them into a new creation\" (5). In the verse is \"Establishing the doctrine of Decree and Destiny by establishing the Book of Destinies\" (6). The expression of 'diminishing' (Naqs) instead of annihilating or destroying in His saying: {what the earth diminishes",
    "foot_note": "1. Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur, by Abdul Rahman Al-Maidani (3/21, 24). \n2. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/280). \n3. Ma'arij al-Tafakkur, by Abdul Rahman Al-Maidani (3/28). See: Al-Fawaid, by Ibn al-Qayyim (pp. 7-8). \n4. Al-Fawaid, by Ibn al-Qayyim (p. 8). \n5. Al-Fawaid, by Ibn al-Qayyim (p. 7). \n6. See: Aysar al-Tafasir, by Al-Jaza'iri (5/138).",
    "book_id": "255",
    "new_page_number": 29
  },
  {
    "serial_number": "1067044",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "of them}, indicates what was reported in the Hadith: \"There is nothing of the human being but it decays, except one bone, which is the tailbone (coccyx), and from it creation is assembled on the Day of Resurrection\" (1). {But they denied the truth when it came to them, so they are in a confused condition}: This verse occurs in establishing the Return by clarifying the invalidity of the polytheists' stance of denying the truth by mentioning the proof of invalidity - which is confusion - and stating its cause - which is haste. Because \"confusion necessitates difference, and that is the strongest indication of invalidity, just as stability and purity necessitate agreement, and that is the strongest indication of truth\" (2); for \"Correct certainty does not change or alter... [As for the polytheists] their affair was confused\" (3), (this is in their description of the Quran as: magic, sometimes soothsaying, sometimes poetry, sometimes lies, sometimes they negate the Message from humans, and other times they claim it only befits people of status and leadership (4). The cause of this difference: It stems only from their haste in denying the Quran, and lack of looking and reflecting on its evidences. In this is an invitation to the polytheists and others to reflect on the Quran and its proofs, and an affirmation that \"lack of patience and thinking is an impediment among the impediments to being guided to the truth.\" One should meet \"every new idea or call with reflection and deliberation\" (5); because it helps in knowing the aspects of truth in it and the places of defect, and protects - by Allah's permission - from slipping.",
    "foot_note": "1. Narrated by Al-Bukhari in his Sahih, Book of Tafsir, Chapter {The Day the Horn will be blown, and you will come forth in multitudes}, (H 4935), (6/165). See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/283). \n2. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/407). \n3. Mafatih al-Ghayb, by Fakhr Al-Razi (28/154). \n4. See: Nazm al-Durar, by Al-Biqa'i (18/407), Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/285), and Tafsir Al-Maraghi (26/152-153). \n5. Al-Tafsir al-Hadith, by Muhammad Darwaza Izzat (2/301).",
    "book_id": "255",
    "new_page_number": 30
  },
  {
    "serial_number": "1067045",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "{Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts? (6) And the earth - We spread it out and cast therein firmly set mountains and made grow therein [something] of every beautiful kind}: These two verses occur in establishing the doctrine of Resurrection through manifestations of Divine Power in the universe, which the polytheists denied in the context of their denial of Resurrection. Just as the previous verse contains an invitation to reflect on the Quran and proofs of its truth, likewise this verse contains an invitation to disbelievers and all people to reflect on \"the upper world, its construction, elevation, evenness, beauty, and coherence, then on the lower world which is the earth, and how [Allah 5] spread it out and prepared it by spreading for what is intended from it, stabilized it with mountains, and grew in it of every good class of plants with their varying shapes, colors, amounts, benefits, and attributes\" (1). All of that indicates the perfection of His power, Glory be to Him, His knowledge encompassing everything, His great wisdom, His consummate perfection of everything He created, His precise craftsmanship, and other attributes of perfection. In this is evidence for the legitimacy of looking and considering the signs of Allah in the universe surrounding man and the benefits therein, to increase his faith and reach the rank of certainty, and to thank the blessing of his Lord by worshiping Him, not denying them by worshiping others (2). {Giving insight and a reminder for every servant who turns [to Allah]}: This verse is \"A reminder to deniers of Resurrection, waking them from the slumber of heedlessness, and clarifying its possibility and lack of impossibility\" (3). In it is clarification that \"Giving insight and reminder are among the wisdoms for which Allah created those creatures\" (4). Because Allah has placed two functions in His cosmic signs: A worldly one to benefit from them",
    "foot_note": "1. Al-Fawaid, by Ibn al-Qayyim (p. 9). \n2. See: Ma'arij al-Tafakkur, by Abdul Rahman Al-Maidani (3/37, 56), Aysar al-Tafasir, by Al-Jaza'iri (5/139-140), and Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/288, 289, 292). \n3. Fath al-Qadir, by Al-Shawkani (5/96). \n4. Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/290).",
    "book_id": "255",
    "new_page_number": 31
  },
  {
    "serial_number": "1067046",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Quranic Objectives in Surah (Qaf)",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "for worldly interests, and an eschatological one, which is indicating Allah Almighty and His attributes, which the turning servant benefits from (1). \"In it is an indication that reaching the station of 'insight' is only through servitude and turning [to Allah]\" (2). In the verse is \"Honoring of all believers and clarification of their merit as they are not devoid of insight and remembrance through those actions, varying among themselves in that..., and an insinuation regarding the disbelievers neglecting insight and remembrance\" (3). In this is evidence for \"Considering one who does not benefit from a thing as lacking it\" (4). In this is what confirms that the believer should reflect on Allah's creatures and contemplate His precise craftsmanship; because \"Whenever the reflecting contemplator repeatedly witnesses Allah's signs in the universe, he learns new things from them, and they increase him in knowledge of truths about their Creator and Originator\" (5), and he knows with certainty that he was not created in vain, but for a majestic wisdom and a noble goal, and he knows that he is accountable for his deeds, and that there must be Recompense and Account. {And We have sent down blessed rain from the sky and made grow thereby gardens and grain for the harvest (9) And lofty palm trees having fruit arranged in layers (10) As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection} (6): These verses occur in refuting the impossibility of Resurrection and demonstrating its proximity (7), by mentioning \"the most dazzling signs and most indicative of it, which",
    "foot_note": "1. See: Ma'arij al-Tafakkur, by Al-Maidani (3/63). \n2. Ruh al-Bayan, by Al-Khalwati (9/107). \n3. Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/291). \n4. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/411). \n5. Ma'arij al-Tafakkur, by Al-Maidani (3/41). \n6. See: Al-Fawaid, by Ibn al-Qayyim (pp. 9-10), Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar (18/414), Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/292), and Ma'arij al-Tafakkur, by Al-Maidani (3/42). \n7. See: Al-Tahrir wa al-Tanwir, by Ibn Ashour (26/295).",
    "book_id": "255",
    "new_page_number": 32
  },
  {
    "serial_number": "1067047",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "renewed over the passage of time\", which is a completion of what preceded regarding the affirmation of the perfection of Allah's power, the comprehensiveness of His knowledge, and the greatness of His wisdom. In it is an analogy of resurrecting people for the Hereafter, after their death and the annihilation of their bodies, to the restoration of the life of plants from their seeds. It also contains gratitude for the manifestations of beauty in Allah's creation, and for the blessing of rain and what comes from its descent, such as vegetation, fruits, and sustenance for humans and animals, and the revival of the earth after its death. And \"an indication of the difference in the conditions of obtaining what benefits people from types of plants; for gardens bear fruit while their roots remain, and grains bear fruit after their roots are harvested\" (1). In it is \"an alert that what is befitting for the servant is that his benefit from it in terms of remembrance and insight should be prior and more important than his enjoyment of it in terms of sustenance\" (2). Because \"sustenance is obtained for everyone, except that the repentant one eats while remembering and thanking for the blessing, while others eat as cattle eat!\" (3). {The people of Noah denied before them, and the companions of the Rass and Thamud (12) And 'Ad and Pharaoh and the brothers of Lot (13) And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled}: The speech moved after mentioning Allah's signs in the universe and horizons to mentioning His signs in the souls of those who denied the messengers before. These verses are cited in \"affirming Prophethood with the best affirmation, the most concise wording, and the furthest from any suspicion and doubt; for He, Glory be to Him, informed that He sent messengers to the people of Noah, 'Ad, Thamud, the people of Lot, and the people of Pharaoh, but they denied them. So He destroyed them with various types of destruction, and His threat which His messengers had promised them if they did not believe came true in them. This is an affirmation of their prophethood and the prophethood of the one who informed about that concerning them without learning it from a teacher or reading it in a book, but rather he informed about it with detailed information matching",
    "foot_note": "1. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/412). \n2. Ruh al-Ma'ani, by Al-Alusi (25/423). \n3. Mafatih al-Ghayb, by Al-Razi (28/158).",
    "book_id": "255",
    "new_page_number": 33
  },
  {
    "serial_number": "1067048",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "what is with the People of the Book\" (1). And \"in that is an honor for the Prophet, peace and blessings be upon him, and for the previous messengers\" (2), and an affirmation of the unity of Creed and Message. It contains an allusion of threat to the polytheists who deny the Message and Resurrection, and a consolation for the Messenger, peace and blessings be upon him, and a strengthening of his heart, that he is not a novelty among messengers, but is a messenger before whom messengers have passed (3), because \"misfortune, when it becomes general, becomes easier to bear\" (4). In the verse is an indication \"that sharing in the action necessitates sharing in the recompense\" (5). In this is an invitation to take heed and learn lessons from those whose news Allah has narrated to us with truth; so we know Allah's eternal cosmic sunnah in His granting victory to His messengers, and His punishment of the deniers, and that the [good] end is for the righteous, and ruin and disgrace are upon the wrongdoers. {Did We fail in the first creation? But they are in confusion over a new creation}: This verse is cited in \"affirming the Return (Ma'ad)\", and refuting the suspicion of the polytheists regarding the impossibility of Resurrection. In it is \"inferring from Allah's power, Glory be to Him, over the first creation, His power over recreating creation, reviving the dead, and resurrection in the Great Resurrection\" (6). \"Because recreation cannot be harder than initiation\" (7). In this is a denial against the deniers of Resurrection, and an accusation of their intellects being shallow and superficial, and \"a mockery of them, declaring them foolish, and rebuking them\" for their deeming Resurrection impossible (8).",
    "foot_note": "1. Al-Fawa'id, by Ibn al-Qayyim (p. 10). \n2. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/297). \n3. Ma'arij al-Tafakkur, by Al-Maydani (3/74). \n4. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/414). \n5. Tafsir Hada'iq al-Ruh wa al-Rayhan, by Muhammad al-Amin al-Harari (27/436). \n6. See: Al-Mustadrak 'ala Majmu' al-Fatawa (1/89), and Al-Nubuwwat, by Ibn Taymiyyah (2/678). \n7. Adwa' al-Bayan, by Al-Shinqiti (7/686). \n8. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/298).",
    "book_id": "255",
    "new_page_number": 34
  },
  {
    "serial_number": "1067049",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "* The Second Section [Verses: 16 - 35]: {And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein}: This verse is cited in clarifying some details of the first creation mentioned in the verse: {Did We fail in the first creation?}. In it is: \"An alert to the greatest signs of Allah's power, evidences of His Lordship, and proofs of the Return, which is the creation of man composed of flesh, bone, veins, nerves, ligaments, outlets, tools, knowledge, wills, and industries; all that from a drop of water\" (1). And \"An alert to the vastness of Allah's knowledge of all their conditions. If He knows the whisper of the soul; then there is no wonder that He knows what the earth consumes of them.\" In it is an indication that \"whispering in the soul is sometimes from Satan and sometimes from the soul\" (2), and that \"parts of man veil other parts, but nothing veils Allah's knowledge\" (3). In it is \"a metonymy for warning against concealing what does not please Allah\" (4), and \"a deterrent from sins that are hidden\" (5). \"This is what invites man to be mindful of his Creator who is aware of his conscience and inner self, close to him in all his states, so he feels shy from Him seeing him where He forbade him, or missing him where He commanded him\" (6).",
    "foot_note": "1. See: Al-Fawa'id, by Ibn al-Qayyim (p. 12), with modification. \n2. Minhaj al-Sunnah al-Nabawiyyah (5/186). \n3. Tafsir al-Qurtubi (19/437). \n4. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/299). \n5. Tafsir al-Qurtubi (19/435). \n6. Tafsir al-Sa'di (7/1700).",
    "book_id": "255",
    "new_page_number": 35
  },
  {
    "serial_number": "1067050",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "{When the two receivers receive, seated on the right and on the left (17) Man does not utter any word except that with him is an observer prepared}: These two verses are cited in clarifying the constant surveillance over every human (1); in them is a severe warning, admonition, and threat of recompense for the polytheists who denied the Day of Resurrection out of rejection and arrogance. And \"informing that on man's right and left are two angels writing his deeds and sayings, and drawing attention by counting sayings and writing them to the writing of deeds, which occur less frequently, and are greater in impact than sayings, and are the goals and ends of sayings\" (2). So man should guard his tongue and limbs from bad deeds and desire good deeds. In this is a sufficient indication for the intelligent person that man is not left in vain, and that he was created for a majestic wisdom and a lofty purpose. The statement of His closeness - the Exalted - when the two angels receive man's sayings and deeds is \"an indication that appointing the two angels as guardians is a matter He has no need of\", and that this appointing is for a wisdom (3), which is establishing the proof against the servant on the Day of Resurrection (4). {And the intoxication of death will bring the truth; that is what you were trying to avoid}: This verse is a transition \"to narrating what the deniers will face at the time of their death\" (5). In it is the mention of \"the Minor Resurrection, which is the intoxication of death, and that it comes with the truth, which is: meeting Him, Glory be to Him, coming to Him, presenting the soul to Him, and the reward and punishment hastened for it before the Great Resurrection\" (6).",
    "foot_note": "1. Ma'arij al-Tafakkur, by Al-Maydani (3/86). \n2. See: Al-Fawa'id, by Ibn al-Qayyim (p. 12-13). \n3. Al-Kashshaf, by Al-Zamakhshari (4/292). See: Hada'iq al-Ruh wa al-Rayhan (27/439). \n4. Al-Tafsir al-Wasit, by Al-Tantawi (26/211). See: Tafsir al-Qurtubi (19/437). \n5. See: Al-Tafsir al-Hadith (2/235). \n6. Al-Fawa'id, by Ibn al-Qayyim (p. 13). See: Majmu' al-Fatawa (4/265).",
    "book_id": "255",
    "new_page_number": 36
  },
  {
    "serial_number": "1067051",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "The use of the past tense is an alert that the matter is certain to occur, and that its like has actually occurred to those people whose death preceded the revelation of the text (1). In this is an awakening of hearts from heedlessness, and an emphasis that man should prepare for death and its conditions, and spend his life in apprehension and caution. {And the Horn will be blown. That is the Day of [carrying out] the threat}: This verse is cited in \"mentioning the Great Resurrection\" (2). In it is the news of the angel entrusted with blowing into the Horn blowing the second blow, which is the blow of Resurrection, and that is the day of punishment promised to the disbelievers and the disobedient. \"He singled out the threat (Wa'id) for mention without the promise (Wa'd), to magnify the terror of this day and warn the disobedient of what will happen in it\" (3), and to suit the strong style of the Surah in rebuke and reprimand. {And every soul will come, with it a driver and a witness}: This verse is cited in \"narrating what the deniers will face when they are resurrected on the Day of Resurrection from the truths they used to evade or doubt\" (4). In it is the news that \"everyone will come to Allah, Glory be to Him, on that day with a driver driving him and a witness testifying against him. This is other than the testimony of his limbs, other than the testimony of the earth on which he was against him, and other than the testimony of His Messenger and the believers.\" In the verse is evidence that the Judge does not judge by His knowledge [alone]. \"For Allah, Glory be to Him, calls to witness against the servant the guardians, the prophets, the places where they did good and evil, and the skins with which they disobeyed Him. He does not judge between them merely by His knowledge; while He is the Most Just of judges and the Wisest of rulers. For this reason, He informed His Prophet that he judges between people by what he hears of their acknowledgment and the testimony",
    "foot_note": "1. Ma'arij al-Tafakkur (3/93). \n2. Al-Fawa'id, by Ibn al-Qayyim (p. 13). \n3. Al-Tafsir al-Wasit, by Al-Tantawi (26/231). \n4. Al-Tafsir al-Hadith (2/235).",
    "book_id": "255",
    "new_page_number": 37
  },
  {
    "serial_number": "1067052",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "of evidence, not merely by his knowledge, so how is it permissible for a judge to judge merely by his knowledge without evidence or acknowledgment?!\" (1). {You were heedless of this, so We have removed from you your cover, and your sight, this Day, is sharp}: This verse begins mentioning the Reckoning and its conditions. In it is a rebuke for the one negligent in deeds in the world, and a mention of what Allah Almighty says by way of sarcasm to man about his heedlessness in the world regarding the Hereafter, and lack of belief in it. \"For He, Glory be to Him, informed that man is in heedlessness of this matter which deserves not to be neglected and to be constantly in his remembrance and mind... Then He informed that the cover of heedlessness and absentmindedness is removed from him on that day just as the cover of sleep is removed from the heart so it wakes up and from the eye so it opens. So the ratio of removing this cover from the servant upon witnessing is like the ratio of removing the cover of sleep from him upon waking up\" (2). In the verse is a statement of the perfection of Allah's power through \"His encompassing, Glory be to Him, of decreeing and incapacitating\" (3), and also an affirmation of Prophethood in a marvelous style. The verse indicated the deficiency of the human intellect and its inability to perceive what benefits it and avoid what harms it, and its constant need for someone to guide it to the path of righteousness and guidance. For that reason, Allah sent messengers, revealed books, and called to belief in the Unseen which our senses do not perceive nor our minds reach in this world. \"So when we die, the Unseen becomes seen, and we witness what the messengers informed about, which was Unseen to us\" (4); as this verse informed.",
    "foot_note": "1. See: Al-Fawa'id, by Ibn al-Qayyim (p. 13). \n2. Al-Fawa'id, by Ibn al-Qayyim (p. 13-14). \n3. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/425). \n4. Al-Safadiyyah, by Ibn Taymiyyah (2/284).",
    "book_id": "255",
    "new_page_number": 38
  },
  {
    "serial_number": "1067053",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "{And his companion will say, \"This is what I have ready\"}: This verse is cited in mentioning the beginning of the Reckoning. In it is the news that man is brought by his companion entrusted with him from the angels, bringing with him his deed which he recorded, and presenting him for Reckoning before the Lord of the Worlds, in a terrifying situation that makes bodies shudder and hearts tremble. So man should prepare to meet Allah before death, and call himself to account before he is called to account in the Hereafter. {Throw into Hell every obstinate disbeliever (24) Preventer of good, aggressor, and doubter (25) Who made [as equal] with Allah another deity; then throw him into the severe punishment}: These verses are cited in presenting scenes from the difficult, terrifying situation in the trial of criminals and stating their fate, and the general command to throw them into Hell. In it is a rebuke to the disbelievers, warning them, arousing fear in them, and driving them to determent. \"The verse in its absoluteness and generality includes declaring the prevention of good and aggression as ugly in general. And warning the one characterized by these morals of Allah's wrath and anger..., and includes affirming that what the disbelieving, good-preventing, aggressive, malicious ones encounter is only a recompense for the sin they committed, rightfully and justly\" (1). In it is what emphasizes that it is not permissible to punish a person without trial or without proving his crimes. {His companion said, \"Our Lord, I did not make him transgress, but he was in extreme error\"}: This verse is regarding the dispute of the disbeliever and his companion from the devils. For when the disbeliever arrives at the Fire, he wants to evade his disbelief and stubbornness by casting the blame on his companion who used to beautify disbelief for him. So his companion disavows bearing the consequence of man's disbelief. And \"of the witty wisdom in that is arousing fear in the disbelievers, the misguided, and the criminals, and driving them to refrain by notifying them that those who whispered to them from their companions and devils will disavow them, and that those accompanying them from the angels of",
    "foot_note": "1. Al-Tafsir al-Hadith (2/237).",
    "book_id": "255",
    "new_page_number": 39
  },
  {
    "serial_number": "1067054",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Allah have recorded everything against them and will present it to Allah Almighty to hold them accountable\" (1). This disavowal and dispute is proof of the horror of the situation. {He said, \"Do not dispute before Me, while I had already presented to you the threat (28) The word will not be changed with Me, and never will I be unjust to the servants\"}: These two verses are cited in clarifying the perfection of Allah's knowledge and the perfection of His justice; for \"the perfection of His knowledge and awareness prevents changing the word before Him and promoting falsehood to Him; and the perfection of His justice and richness prevents His injustice to His servants\" (2). Since Allah, Glory be to Him, clarified the threat in the world on the tongues of His messengers; no confusion or argument remained for anyone. So there is no benefit in disputing to cast the blame of disbelief on one of the two parties, because the equality of the two parties in disbelief is sufficient to hold all accountable equally. In the verse is \"an establishment of the meaning of injustice in the souls of the nation; for it is not permissible to punish the offender before legislating the law, just as Allah did not punish His servants except after prior warning, despite Him being the Creator of the servants, to Whom belongs the creation and the command, Doer of what He wills\" (3). In it is a statement \"that among possible matters is what constitutes injustice which Allah, Glory be to Him, is exalted above despite His power over it, and for that He is praised and extolled; for praise and extolment occur regarding optional matters of action and inaction\" (4). {On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there any more?\"}: This verse is cited in \"terrifying those driven to Hell that they should not hope that their large number will cramp the vastness of Hell so some of them might hope to be among those for whom no place is found in it. So Allah narrated it in the Quran as a lesson for those who",
    "foot_note": "1. Al-Tafsir al-Hadith (2/239). \n2. Al-Fawa'id, by Ibn al-Qayyim (p. 17). \n3. See: Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/317). \n4. Minhaj al-Sunnah al-Nabawiyyah, by Ibn Taymiyyah (5/104).",
    "book_id": "255",
    "new_page_number": 40
  },
  {
    "serial_number": "1067055",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "hear it from the polytheists and as instruction for the people of the Quran, the believers\" (1). \"The use of the present tense indicates that the question and answer are repeated and renewed after throwing group after group into Hell\" (2). As mentioned in the agreed-upon Hadith: «Hell will continue to be thrown into, and it will say: 'Are there any more?', until the Lord of Glory places His Foot in it, so its parts will fold upon each other and it will say: 'Enough, enough, by Your Glory and Generosity'» (3). \"In it is an indication that existing things yearn to fulfill and show compliance to what Allah created them for, and that they do not hesitate or make excuses in performing it\" (4). {And Paradise will be brought near to the righteous, not far}: This verse, and the one following it, is \"a digression to mentioning the lot of the believers on the Day of Resurrection - according to the custom of the Quran in following intimidation with encouragement and vice versa -\" (5). In it is the mention of bringing Paradise near to the righteous, and a statement of the virtue of piety (Taqwa) and the honor of the righteous with the Lord of the Worlds. Which \"is of a nature to attract those with conscious hearts and good souls, and carry them to walk on the straight path, and spread tranquility, bliss, and contentment in them\" (6). In it is an invitation to the polytheists to believe and choose piety, and leave what they are in of denial and heedlessness. {This is what you were promised - for every returner [to Allah] and keeper [of His covenant]}: This verse is cited in clarifying what is said to the righteous when Paradise is brought near to them, and mentioning two of their attributes, which are being a returner (Awwab) and a keeper (Hafiz).",
    "foot_note": "1. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/317). \n2. Ma'arij al-Tafakkur, by Al-Maydani (3/113). \n3. Narrated by Al-Bukhari in his Sahih, Book of Oaths and Vows, Chapter: Swearing by Allah's Glory, Attributes, and Words, (No. 6661), (8/135), and Muslim in his Sahih, Book of Paradise and Description of its Bliss and People, (No. 2848), (8/152) and this is his wording. \n4. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/318). \n5. See: Al-Tahrir wa al-Tanwir, by Ibn Ashur (30/137). \n6. Al-Tafsir al-Hadith (2/241).",
    "book_id": "255",
    "new_page_number": 41
  },
  {
    "serial_number": "1067056",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "In it is an indication that it behooves the believer to maintain obedience and keep Allah's commandments and limits. If a slip occurs from him, he follows it with repentance and returns to his Lord. \"It is not enough for a person to declare his Islam, rather he must strive in fearing Allah through righteous deeds and avoiding sins, and be a keeper of his covenants and duties, watchful of Allah in his secret and public, turning to Him with his heart and limbs. In this there is the intent of refining the Muslim's soul and preparing him to be righteous, dutiful, good, guided, with an alert heart, pure conscience and soul, performing his duties towards Allah and people for their own sake, fearing his Lord in secret and public\" (1). {Who feared the Most Merciful unseen and came with a heart returning [in repentance]}: This verse is cited in mentioning the third and fourth attributes of the righteous, which is that they fear Him, the Exalted, in secret, despite their knowledge of His vast mercy, and they return from disobeying Allah and approach His obedience, and do not nullify their righteous deed at the end of their lives, so they come on the Day of Resurrection returning [in repentance]. In this is confirmation that \"beneficial fear is fearing Him, the Exalted, in the unseen and the seen\" (2), and that it is one of the causes of a good ending. In describing Him, the Exalted, with Mercy, and describing the heart with Returning (Inabah), is an invitation to the polytheists and kindness to the disobedient not to despair of Allah's mercy and \"not to despair of the acceptance of repentance because of the abundance of threats driven to them, following the custom of the Quran in following intimidation with encouragement and vice versa\" (3). In coupling the name Al-Rahman (The Most Merciful) with fear (Khashyah), is an alert that the knowledge of the righteous of the vastness of His mercy, the Exalted, does not prevent them from fearing Him, and that their fear \"is accompanied by intimacy",
    "foot_note": "1. Al-Tafsir al-Hadith (2/241). \n2. Tafsir al-Sa'di (7/1703). \n3. Al-Tahrir wa al-Tanwir, by Ibn Ashur (23/295).",
    "book_id": "255",
    "new_page_number": 42
  },
  {
    "serial_number": "1067057",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "-meaning: hope-, as is legislated\" (1). In the meaning of the verse is the hadith of the seven whom Allah shades in His shade, among them: «And a man who remembered Allah in solitude and his eyes overflowed» (2). In it is a refutation of the polytheists who denied the name Al-Rahman for Allah, the Exalted. {Enter it in peace. This is the Day of Eternity (34) They will have whatever they wish therein, and with Us is more}: These two verses are in clarifying \"the reward of those who possessed these attributes\" (3) the four mentioned before. In them is the favor of permitting them to enter Paradise in safety, which is \"from the perfection of honoring the guest\" (4), and reassuring them that it is the Day of Eternity and making them yearn for the bliss therein which no eye has seen, no ear has heard, and has not crossed the heart of a human, including seeing Allah, Glory be to Him. In them is an indication that \"surprise with favor is a type of kindness and honoring\" (5). And in it is an indication \"that His power has no end, is not restricted by a limit, nor counted by a number, in refutation of the people of stubbornness and the innovation of Ittihad (Union) in their saying 'There is nothing in possibility more wonderful than what was'\" (6). * The Third Section [Verses: 36 - 45]: {And how many a generation We destroyed before them who were stronger than them in power and explored throughout the lands. Is there any place of escape?}: This verse is cited in the psychological treatment of the deniers of the Messenger, peace and blessings be upon him, and the deniers of the Day of Judgment using the style of intimidation, and reminding of worldly punishment before the punishment of the Hereafter. In it is",
    "foot_note": "1. Nazm al-Durar, by Al-Biqa'i (18/431). \n2. Agreed upon: Narrated by Al-Bukhari in Book of Adhan, Chapter: Whoever sits in the mosque waiting for prayer and the virtue of mosques, (No. 660), (1/133), and Muslim in Book of Zakat, (No. 1031), (3/93). See: Tafsir Ibn Kathir (13/197). \n3. Al-Fawa'id, by Ibn al-Qayyim (p. 18). \n4. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/320). \n5. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/321). \n6. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/434).",
    "book_id": "255",
    "new_page_number": 43
  },
  {
    "serial_number": "1067058",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "warning the polytheists and \"frightening them that destruction will befall them like what befell those before them, and that they were stronger than them in power, yet the severity of their power did not ward off destruction from them\" (1), and \"reassurance for the heart of the Messenger, peace and blessings be upon him, and the hearts of those who believed with him that Allah's victory is coming inevitably, just as Allah gave victory to the previous messengers and those believers with them, even though the early deniers were stronger in power and might than the contemporaries of the Quran's revelation\" (2). In this is confirmation of Allah's justice, His majestic wisdom, and the perfection of His power, and evidence of the legitimacy of frightening the disobedient and deniers with divine punishment (3), and taking lessons from Allah's Sunnah in the collective destruction of nations. {Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind]}: This verse is cited in urging reflection on the Quran, and \"thinking about considering the conditions that caused the destruction of previous nations; so they measure their conditions against them\" (4). In it is: praising the status of the believers and alluding to likening the polytheists to one who has no heart and one who does not listen because they are far from benefiting from reminders (5). And stating that \"whoever is given wisdom and benefits from knowledge is on two levels: either a man who saw the truth by himself so he accepted it and followed it; that is the owner of the heart. Or a man who did not comprehend it by himself, but needs someone to teach him, clarify it to him, admonish him and discipline him; this one listened so: {listens while he is present}, meaning: present of heart\" (6); because \"mere listening does not benefit, unless",
    "foot_note": "1. Al-Fawa'id, by Ibn al-Qayyim (p. 19). \n2. Ma'arij al-Tafakkur (3/120). \n3. Aysar al-Tafasir, by Al-Jaza'iri (5/153). \n4. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/323). See: Al-Tafsir al-Hadith (2/244). \n5. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/324). \n6. Majmu' Fatawa Shaykh al-Islam Ibn Taymiyyah (9/311). See: Al-Fawa'id, by Ibn al-Qayyim (p. 4-5), and Miftah Dar al-Sa'adah wa Manshur Wilayat al-Ilm wa al-Iradah, by him (1/489-490).",
    "book_id": "255",
    "new_page_number": 44
  },
  {
    "serial_number": "1067059",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "the listener is present with his intellect and mind\" (1). {And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness}: This verse is cited in highlighting the meaning of the vastness of Divine Power indicating the possibility of Resurrection; since the polytheists deemed it impossible based on attributing limited capability to Divine Power regarding its execution (2). In it is \"declaring Allah, Glory be to Him, free from weariness (Lughub). Declaring free (Tanzih) implies His description, Glory be to Him, with attributes of affirmative perfection, because negative matters are not perfection unless they imply positive matters. So negating weariness implies the perfection of His power, the Exalted, and the utmost strength, unlike the creature who is afflicted by fatigue and exhaustion as he is afflicted\" (3). In it is \"belying the enemies of Allah among the Jews where they said He rested on the seventh day\" (4). In creating the heavens and earth in six days is \"teaching man deliberateness and gradation\" (5), \"and had He willed, the Exalted, it would have been in less than the blink of an eye, but He enacted for us deliberateness in that\" (6); Sa'id bin Jubayr said: \"Allah Mighty and Majestic was capable of creating the heavens and earth in a glance and a moment, but He created them in six days to teach His creation verification and deliberateness in matters\" (7).",
    "foot_note": "1. Tafsir Ghara'ib al-Quran, by Al-Nisaburi (6/180). \n2. Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/325). \n3. See: Majmu' Fatawa Shaykh al-Islam Ibn Taymiyyah (3/36), and (10/250), Al-Safadiyyah, by Ibn Taymiyyah (2/65), and Minhaj al-Sunnah al-Nabawiyyah (2/183). \n4. Al-Fawa'id, by Ibn al-Qayyim (p. 19). \n5. Al-Tafsir al-Hadith (2/248). \n6. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/437). \n7. Ma'alim al-Tanzil, by Al-Baghawi (3/235).",
    "book_id": "255",
    "new_page_number": 45
  },
  {
    "serial_number": "1067060",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "The Exalted said: {So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting (39) And [in part] of the night exalt Him and after prostration}: These two verses are cited in treating the psychological and spiritual state of the Messenger, peace and blessings be upon him, firstly, and for educating the bearers of the Messenger's message, peace and blessings be upon him, from the scholars and callers of his nation (1). In them is urging the Prophet, peace and blessings be upon him, to patience and clarifying what aids him in it of Tasbih (glorification) and Tahmid (praise) which prayer includes, and the command to \"emulate Him, Glory be to Him, in patience over what His enemies say about Him, just as He, Glory be to Him, was patient over the saying of the Jews: that He rested! 'And no one is more patient over harm he hears than Him' (2)\" (3). In the verse is indication that patience is acquired by practicing patience, and confirmation of the greatness of prayer and its effect in solving internal and external crises, and \"that prayer is the greatest antidote for victory and removing worry, and for this reason the Prophet, peace and blessings be upon him, used to rush to prayer if a matter troubled him\" (4). {And listen on the Day when the Caller will call out from a place that is near (41) The Day they will hear the blast in truth. That is the Day of Emergence}: These two verses are also cited in strengthening the heart of the Prophet, peace and blessings be upon him. In them is \"depicting the day of the polytheists' calamity and its proximity and explaining what is in it for them of exemplary punishments and catastrophic afflictions\" (5), and reminding him, peace and blessings be upon him, of what will happen in the Hereafter of \"the Caller calling for the return of souls to their bodies for gathering\" (6) and emergence from the graves; because increasing certainty in the Hereafter",
    "foot_note": "1. Ma'arij al-Tafakkur, by Al-Maydani (3/130). \n2. This is the wording of a hadith, narrated by Al-Bukhari (6099), and Muslim (2804) from Abu Musa Al-Ash'ari. \n3. Al-Fawa'id, by Ibn al-Qayyim (p. 19), and see: Ighathat al-Lahfan min Masa'id al-Shaytan, by him (2/340). \n4. See: Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/440). \n5. Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar, by Al-Biqa'i (18/440). \n6. Al-Fawa'id, by Ibn al-Qayyim (p. 20).",
    "book_id": "255",
    "new_page_number": 46
  },
  {
    "serial_number": "1067061",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "and renewing it is one of the greatest aids to patience. For with certainty the chest expands and derives great spiritual strength with which worldly hardships and worries diminish. In this is a spiritual instruction for callers to care for the remembrance of the Hereafter to be a help for the caller in his journey. {Indeed, it is We who give life and cause death, and to Us is the destination}: This verse is cited in affirming the doctrine of Resurrection after death. In it is the reminder that the Giver of Life and Causer of Death is Allah with no partner, and inferring from that the Resurrection which is the Greatest Giving of Life, because \"the Return is not harder than the Beginning, so whoever acknowledges it and denies the Resurrection is stubbornly opposing or definitely insane\" (1). \"So whoever gave life first then caused death, there is no wonder that He returns the one He caused to die to another life to meet his account and recompense for what he presented in the first life, which was the journey of his test, and that the destination after the journey of trial in the worldly life is to the Creator Lord\" (2). {The Day the earth splits open from them, hastening forth. That is a gathering easy for Us}: This verse is cited in inferring the possibility of Gathering after establishing the matter of Resurrection in the previous verse. In it is the mention of the image of people emerging from their graves, which is the earth splitting open from them just as plants split [the earth], in a not long time, then their gathering in the Place of Gathering, no matter how far their graves are from the land of Gathering, as mentioned in the hadith: «Then Allah sends down water from the sky so they grow as herbs grow» (3). In this is confirmation of the perfection of Allah's power and the comprehensiveness of His knowledge of all things, including the scattered, decomposed parts mixed with soil buried in the earth. It is a refutation of the polytheists' saying: {That is a distant return}.",
    "foot_note": "1. See: Nazm al-Durar, by Al-Biqa'i (18/441-442). \n2. Ma'arij al-Tafakkur, by Al-Maydani (3/135). \n3. Narrated by Al-Bukhari in his Sahih, Book of Tafsir, Chapter {The Day the Horn is blown and you will come forth in multitudes}, (No. 4935), (6/165). See: Al-Tahrir wa al-Tanwir, by Ibn Ashur (26/283).",
    "book_id": "255",
    "new_page_number": 47
  },
  {
    "serial_number": "1067062",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "{We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat}: This verse is the conclusion of the Surah, and it is a confirmation of what the Surah included of affirming Resurrection and Message, while turning away from addressing the deniers, and directing the address to the Messenger, peace and blessings be upon him. It comprised three concise sentences: His saying, the Exalted: {We are most knowing of what they say}: contains consolation and reassurance from Allah Almighty to the Messenger, peace and blessings be upon him, regarding the sayings of his denying people, and a metonymy for Allah's promise to His Messenger that He, the Exalted, will triumph for him against them, and a threat and warning from Allah to those who harm the Messenger with their words that He will take revenge on them and support His Messenger. For \"He, Glory be to Him, informed that He is Aware of what His enemies say, and that implies His recompensing them for their words; since it is not hidden from Him, and He, Glory be to Him, mentions His knowledge and power to realize the recompense\" (1). And His saying, the Exalted: {and you are not over them a tyrant}, contains a clarification of the reality of the Message and the reality of Da'wah (Call), and reassurance to the Messenger, peace and blessings be upon him, that he is not responsible for their lack of guidance; because he was sent only as a caller and guide, and not sent to compel them to believe. In it is confirmation that the caller is not charged with guiding his people, but rather inviting them and clarifying the truth to them is sufficient, to establish the proof and absolve responsibility. {But remind by the Qur'an whoever fears My threat}: This is the conclusion of the conclusion. In it is confirmation that reminding and remembrance revolve around this Quran. In it is teaching scholars and callers that the axis of their call should be centered on this Great Quran, and connecting people to it in all conditions, and in every field (2). For this reason, the Surah ended with it as it began with it: {Qaf. By the Glorious Qur'an}.",
    "foot_note": "1. Al-Fawa'id, by Ibn al-Qayyim (p. 14). \n2. See: Kawkabat al-Khutab al-Munifah, by Al-Sudais (1/57-58).",
    "book_id": "255",
    "new_page_number": 48
  },
  {
    "serial_number": "1067063",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Conclusion. Praise be to Allah first and last. To proceed,, • The research has reached some results, including: 1 - That the Quranic Objectives are: Allah Almighty's intent from His speech, or the goals for which the Quran was revealed to achieve the interests of the servants. It is, in terms of independence, a relatively modern term. Its importance lies in being the key to contemplating Allah's speech, the Exalted, as Al-Shatibi said: \"For contemplation is only for one who turns to the objectives\". Also, knowing the Quranic Objectives regulates the methodology of interpreting Allah's speech, the Exalted, and preserves the Holy Quran from distortion and [incorrect] interpretation. 2 - That Surah Qaf is Meccan, and it is the first of the Mufassal Hizb, and the Prophet, peace and blessings be upon him, used to read it in large gatherings. The axis of the Surah revolves around addressing the denial of the deniers of Muhammad's message, peace and blessings be upon him, and what he brought of the news of Resurrection and Reckoning. 3 - Surah Qaf addressed several partial topics concerning Islamic Creed, all relating to addressing the subject of Resurrection and Message. Among the Quranic Objectives included in this Surah are: • Affirming the fundamentals of religion: belief in Allah, His angels, His books, His messengers, the Last Day, and Destiny. • Affirming the attributes of perfection for Allah and declaring Him free from what contradicts His perfection of deficiencies and flaws.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 49
  },
  {
    "serial_number": "1067064",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "• Affirming the comprehensiveness of Allah's knowledge, including: affirming the doctrine of Allah's observation of man, His encompassing him from every aspect, and appointing guardians over him. • Affirming the perfection of Allah's power, including: clarifying the manifestations of Allah's power in creating the heavens and earth, in destroying the deniers, and in creating man. • Affirming Allah's wisdom in creating everything, and creating man. • Clarifying the Islamic religion's care for all aspects of human life, and giving a complete conception of his life which begins with his birth, passes through death, then ends with Resurrection and Reckoning, then the destiny to Paradise or Fire. • Consoling the Prophet, peace and blessings be upon him, and the believers, and warning the enemies of the Messenger, peace and blessings be upon him, of the bad consequence of disbelief. • Revealing the conditions of the people of falsehood in inferring with corrupt reasoning, and the reasons for their denial of the truth. • Affirming the status of reason in Islam, and its non-contradiction with authentic transmission, and the call to use it to reach the truth, through thinking about Allah's cosmic signs, and learning lessons from the ends of previous deniers. 4 - The eloquence and inimitability of the Holy Quran, and among its manifestations: the way the Surah presents the central holistic and partial issues, which appear disparate and different -at first glance-, but upon contemplation we find them closely connected to the objective of the Surah. So scholars and callers should care for this Surah, Surah Qaf, by recitation and contemplation, and revive the Sunnah of the Messenger of Allah, peace and blessings be upon him, in reading it in the Friday sermon, and in the Eid prayer,",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 50
  },
  {
    "serial_number": "1067065",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "and Fajr prayer, and not be content with reading verses from it (1); because compliance with the Sunnah is not achieved by partial reading, as the reading of the Messenger, peace and blessings be upon him, of the Surah was only because of what the Surah included of the most important objectives of the Quran. It is worthy for researchers to turn to studying the Quranic Objectives in all Surahs, especially those Surahs which the Messenger of Allah, peace and blessings be upon him, used to regularly read on different occasions, such as Surah Al-Qamar, Surahs Al-A'la and Al-Ghashiyah, Surahs Al-Jumu'ah and Al-Munafiqun, and Surahs Al-Sajdah and Al-Insan; for it aids in understanding the Book of Allah correctly, and returns with good to the Islamic society and the Muslim individual. And may Allah send blessings upon our Prophet Muhammad and upon all his family and companions. * * *",
    "foot_note": "1. See: Zad al-Ma'ad, by Ibn al-Qayyim (1/203).",
    "book_id": "255",
    "new_page_number": 51
  },
  {
    "serial_number": "1067066",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Sources and References 1. \"The Holy Quran\", narration of Hafs from Asim. 2. \"Asrar Tartib al-Quran\". Al-Suyuti, Jalal al-Din Abd al-Rahman bin Abi Bakr (d. 911 AH). Investigation: Abd al-Qadir Ahmad Ata, and Marzuq Ali Ibrahim. No ed., Cairo: Dar al-Fadilah, 2002 AD. 3. \"Asma' Suwar al-Quran wa Fada'iluha\". Al-Dosari, Dr. Munira Muhammad Nasir. 1st ed., Saudi Arabia: Dar Ibn al-Jawzi, 1426 AH. 4. \"Usul fi al-Tafsir\". Al-Uthaymin, Muhammad bin Salih (d. 1421 AH). 1st ed., Ain Shams: Al-Maktabah al-Islamiyyah, 1422 AH - 2001 AD. 5. \"Adwa' al-Bayan fi Idah al-Quran bi al-Quran\". Al-Shinqiti, Muhammad al-Amin bin Muhammad al-Mukhtar al-Jakni (d. 1393 AH). Supervision: Bakr bin Abdullah Abu Zaid. 1st ed., Makkah: Dar Alam al-Fawa'id, 1426 AH. 6. \"Al-Itqan fi Ulum al-Quran\". Al-Suyuti, Jalal al-Din Abd al-Rahman bin Abi Bakr (d. 911 AH). Investigation: Center for Quranic Studies, No ed., Madinah: King Fahd Complex for the Printing of the Holy Quran, 1426 AH. 7. \"Al-Burhan fi Ulum al-Quran\". Al-Zarkashi, Badr al-Din Muhammad bin Abdullah (d. 794 AH). Investigation: Muhammad Abu al-Fadl Ibrahim. No ed., Cairo: Dar al-Turath, n.d. 8. \"Al-Bayan fi 'Add Ay al-Quran\". Al-Dani, Abu Amr al-Andalusi (d. 444 AH). Investigation: Dr. Ghanim Qadduri al-Hamad. 1st ed., Kuwait: Center for Manuscripts and Heritage and Documents, 1414 AH.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 52
  },
  {
    "serial_number": "1067067",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "9. \"Al-Tahrir wa al-Tanwir 'Tahrir al-Ma'na al-Sadid wa Tanwir al-Aql al-Jadid min Tafsir al-Kitab al-Majid'\". Ibn Ashur, Muhammad al-Tahir bin Muhammad bin Muhammad al-Tahir al-Tunisi (d. 1393 AH). No ed., Tunis: Al-Dar al-Tunisiyyah li al-Nashr, 1984 AD. 10. \"Al-Tafsir al-Hadith (Arranged according to the order of revelation)\". Izzat, Darwaza Muhammad (d. 1404 AH). No ed., Cairo: Dar Ihya' al-Kutub al-Arabiyyah, 1383 AH. 11. \"Al-Tafsir al-Mawdu'i li Suwar al-Quran al-Karim\". Preparation: A group of scholars of Tafsir and Quran sciences. Supervision: Prof. Dr. Mustafa Muslim. 1st ed., UAE: University of Sharjah, 1431 AH - 2010 AD. 12. \"Al-Tafsir al-Wasit lil-Quran al-Karim\". Al-Tantawi, Dr. Muhammad Sayyid. No ed., Cairo: Matba'at al-Sa'adah, 1406 AH - 1986 AD. 13. \"Al-Jami' li Ahkam al-Quran wa al-Mubin lima Tadammanahu min al-Sunnah wa Ay al-Furqan\". Al-Qurtubi, Abu Abdullah, Muhammad bin Ahmad bin Abi Bakr (d. 671 AH). Investigation: Dr. Abdullah bin Abdul Muhsin Al-Turki. 1st ed., Beirut: Mu'assasat al-Risalah, 1427 AH - 2006 AD. 14. \"Al-Dirasah al-Tahliliyyah li Maqasid wa Ahdaf al-Hizb al-Thani wa al-Khamsin min al-Quran al-Karim (Surah al-Fath - al-Hujurat - Qaf - al-Dhariyat)\". Rashid, Nasr Samir, Master's Thesis, Gaza: Faculty of Usul al-Din, Islamic University, 1439 AH - 2018 AD. 15. \"Al-Safadiyyah\". Ibn Taymiyyah, Ahmad bin Abd al-Halim (d. 728 AH). Investigation: Dr. Muhammad Rashad Salim. 1st ed., Riyadh: Dar al-Fadilah, before 1976 AD. 16. \"Al-Fawa'id\". Ibn Qayyim al-Jawziyyah, Abu Abdullah Muhammad bin Abi Bakr bin Ayyub (d. 751 AH). Investigation: Muhammad Uzair Shams. 1st ed., Makkah: Dar Alam al-Fawa'id, 1429 AH.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 53
  },
  {
    "serial_number": "1067068",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "17. \"Al-Kashshaf 'an Haqa'iq Ghawamid al-Tanzil wa 'Uyun al-Aqawil fi Wujuh al-Ta'wil\". Al-Zamakhshari, Jar Allah Mahmud bin Umar (d. 538 AH). Setting: Al-Dani bin Munir Al-Zahwi. 1st ed., Beirut: Dar al-Kitab al-Arabi, 1427 AH - 2006 AD. 18. \"Al-Muharrar al-Wajiz fi Tafsir al-Kitab al-Aziz\". Ibn Atiyyah, Abu Muhammad Abd al-Haqq bin Ghalib al-Andalusi (d. 546 AH). Investigation: Abd al-Salam Abd al-Shafi Muhammad. 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1422 AH - 2001 AD. 19. \"Al-Muhkam wa al-Muhit al-A'zam\". Ibn Sidah, Abu al-Hasan Ali bin Ismail al-Mursi (d. 458 AH). Investigation: Dr. Abd al-Hamid Hindawi. 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1421 AH - 2000 AD. 20. \"Al-Mustadrak 'ala al-Sahihayn\", Abu Abdullah Al-Hakim Al-Nisaburi (d. 405 AH), Investigation: Center for Research and Information Technology, 1st ed., Saudi Arabia: Dar al-Ta'sil, 1435 AH - 2014 AD. 21. \"Al-Mustadrak 'ala Majmu' Fatawa Shaykh al-Islam Ibn Taymiyyah\" (d. 728 AH). Compiled by: Muhammad bin Abd al-Rahman bin Muhammad bin Qasim, 1st ed., n.p.: n.p., 1418 AH. 22. \"Al-Maqasid al-Quraniyyah fi Surah al-Muzzammil: Dirasah Tahliliyyah\". Al-Umar, Akram Ghazi al-Husayn. Master's Thesis, Malaysia: Faculty of Islamic Sciences, Al-Madinah International University, 1439 AH - 2018 AD. 23. \"Al-Maqasid al-Quraniyyah fi Surah Sad\". Ghaniya, Shayma. Master's Thesis, El Oued: Institute of Islamic Sciences, University of Echahid Hamma Lakhdar, 1438 - 1439 AH / 2018 - 2019 AD. 24. \"Al-Maqasid al-Quraniyyah: Dirasah Manhajiyyah\". Al-Rabi'ah, Dr. Muhammad bin Abdullah. Journal of Imam Al-Shatibi Institute for Quranic Studies, Jeddah, Issue (27), Jumada al-Akhirah 1400 AH - February 2019 AD, 207 - 262.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 54
  },
  {
    "serial_number": "1067069",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "25. \"Al-Muwafaqat\". Al-Shatibi, Ibrahim bin Musa bin Muhammad al-Lakhmi al-Gharnati (d. 790 AH). Investigation: Abu Ubaidah Mashhur bin Hasan Al Salman. 1st ed., n.p.: Dar Ibn Affan, 1417 AH - 1997 AD. 26. \"Al-Nasikh wa al-Mansukh fi al-Quran al-Karim\". Ibn Hazm, al-Andalusi (d. 456 AH). Investigator: Dr. Abd al-Ghaffar Sulayman al-Bandari. 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1406 AH - 1986 AD. 27. \"Al-Nubuwwat\". Ibn Taymiyyah, Taqi al-Din Abu al-Abbas Ahmad bin Abd al-Halim (d. 728 AH). Investigation: Dr. Abd al-Aziz bin Salih al-Tuwayan. 1st ed., Riyadh: Adwa' al-Salaf, 1420 AH - 2000 AD. 28. \"Aysar al-Tafasir li Kalam al-Ali al-Kabir\". Al-Jaza'iri, Abu Bakr Jabir (d. 1439 AH), 3rd ed., Madinah: Maktabat al-Ulum wa al-Hikam, 1418 AH - 1997 AD. 29. \"Bada'i' al-Fawa'id\". Ibn Qayyim al-Jawziyyah, Abu Abdullah Muhammad bin Abi Bakr bin Ayyub (d. 751 AH). Investigation: Ali bin Muhammad al-Imran. 1st ed., Makkah: Dar Alam al-Fawa'id, 1429 AH. 30. \"Basa'ir Dhawi al-Tamyiz fi Lata'if al-Kitab al-Aziz\". Al-Fayruzabadi, Majd al-Din Muhammad bin Ya'qub (d. 817 AH). Investigator: Muhammad Ali al-Najjar. No ed., Cairo: Supreme Council for Islamic Affairs, 1416 AH - 1996 AD. 31. \"Taj al-Arus min Jawahir al-Qamus\". Al-Zubaidi, Sayyid Muhammad Murtada al-Husayni (d. 1205 AH). Investigation: Abd al-Sattar Ahmad Farraj. No ed., Kuwait: Kuwait Government Press, 1385 AH - 1965 AD. 32. \"Tafsir al-Bahr al-Muhit\". Abu Hayyan, Muhammad bin Yusuf al-Andalusi (d. 745 AH). Investigation: Adil Ahmad Abd al-Mawjud, and Ali Muhammad Mu'awwad, and others. 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1413 AH - 1993 AD.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 55
  },
  {
    "serial_number": "1067070",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "33. \"Tafsir al-Quran al-Azim\". Ibn Kathir, Imad al-Din Abu al-Fida Ismail al-Dimashqi (d. 774 AH). Investigation: Mustafa al-Sayyid, and others. 1st ed., Egypt: Mu'assasat Qurtubah, 1421 AH - 2000 AD. 34. \"Tafsir al-Quran al-Karim (From al-Hujurat to al-Hadid)\". Al-Uthaymin, Muhammad bin Salih (d. 1421 AH). 1st ed., Riyadh: Dar al-Thuraya, 1425 AH - 2004 AD. 35. \"Tafsir al-Maraghi\". Al-Maraghi, Ahmad bin Mustafa (d. 1371 AH). 1st ed., Egypt: Mustafa al-Babi al-Halabi and Sons Library and Printing Company, 1365 AH - 1946 AD. 36. \"Tafsir Hada'iq al-Ruh wa al-Rayhan fi Rawabi Ulum al-Quran\". Al-Harari, Muhammad al-Amin bin Abdullah al-Urmi al-Alawi al-Shafi'i. Supervision and revision: Dr. Hashim Muhammad Ali bin Husayn Mahdi. 1st ed., Beirut: Dar Tawq al-Najat, 1421 AH - 2001 AD. 37. \"Tafsir Ghara'ib al-Quran wa Ragha'ib al-Furqan\". Al-Nisaburi, Nizam al-Din al-Hasan bin Muhammad bin Husayn al-Qummi (d. 850 AH). Investigation: Zakariya al-Umayrat. 1st ed., Beirut: Dar al-Kutub al-Ilmiyyah, 1416 AH - 1996 AD. 38. \"Taysir al-Karim al-Rahman fi Tafsir Kalam al-Mannan\". Al-Sa'di, Abd al-Rahman bin Nasir (d. 1376 AH). Care: Sa'd bin Fawwaz al-Sumayl. 1st ed., Saudi Arabia: Dar Ibn al-Jawzi, 1422 AH. 39. \"Jamal al-Qurra' wa Kamal al-Iqra'\". Al-Sakhawi, Ali bin Muhammad (d. 643 AH). Investigation: Dr. Ali Husayn al-Bawwab. 1st ed., Makkah Al-Mukarramah: Maktabat al-Turath, 1408 AH - 1987 AD. 40. \"Dar' Ta'arud al-Aql wa al-Naql\". Ibn Taymiyyah, Taqi al-Din Abu al-Abbas Ahmad bin Abd al-Halim (d. 728 AH). Investigation: Dr. Muhammad Rashad Salim. 2nd ed., Riyadh: Imam Muhammad bin Saud Islamic University, 1411 AH - 1991 AD.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 56
  },
  {
    "serial_number": "1067071",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "41. \"Ruh al-Bayan\". Al-Khalwati, Ismail Haqqi al-Burusawi (d. 1137 AH), No ed., Istanbul: Al-Matba'ah al-Uthmaniyyah, 1926 AD. 42. \"Ruh al-Ma'ani fi Tafsir al-Quran al-Azim wa al-Sab' al-Mathani\". Al-Alusi, Shihab al-Din Mahmud bin Abdullah al-Baghdadi (d. 1270 AH). Investigation: A group of investigators. 1st ed., Beirut: Mu'assasat al-Risalah, 1431 AH - 2010 AD. 43. \"Zad al-Masir fi Ilm al-Tafsir\". Ibn al-Jawzi, Abu al-Faraj Jamal al-Din Abd al-Rahman bin Ali bin Muhammad bin Muhammad al-Qurashi al-Baghdadi (d. 597 AH). 3rd ed., Damascus: Al-Maktab al-Islami, 1404 AH - 1984 AD. 44. \"Zad al-Ma'ad fi Hady Khayr al-Ibad\". Ibn Qayyim al-Jawziyyah, Abu Abdullah Muhammad bin Abi Bakr bin Ayyub (d. 751 AH). Investigation: Shu'ayb al-Arna'ut, and Abd al-Qadir al-Arna'ut. 3rd ed., Beirut: Mu'assasat al-Risalah, 1418 AH - 1998 AD. 45. \"Surah Qaf: Dirasah Tahliliyyah Mawdu'iyyah\". Sa'dawi, Abdullah. Master's Thesis, Algeria: Faculty of Humanities and Social Sciences, University of Abou Bekr Belkaid, 1435 AH - 1436 AH / 2014 - 2015 AD. 46. \"Sahih Al-Bukhari - Al-Jami' al-Musnad al-Sahih al-Mukhtasar min Umur Rasul Allah salla Allahu alayhi wa sallam wa Sunanihi wa Ayyamihi\". Al-Bukhari, Abu Abdullah Muhammad bin Ismail bin Ibrahim bin al-Mughirah al-Ju'fi (d. 256 AH). Investigation: Muhammad Zuhayr bin Nasir al-Nasir. 1st ed., Beirut: Dar Tawq al-Najat, 1422 AH. 47. \"Sahih Muslim - Al-Musnad al-Sahih al-Mukhtasar min al-Sunan bi Naql al-Adl 'an al-Adl ila Rasul Allah salla Allahu alayhi wa sallam\", Muslim, Abu al-Hasan Muslim bin al-Hajjaj bin Muslim al-Qushayri al-Nisaburi",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 57
  },
  {
    "serial_number": "1067072",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "(d. 261 AH). Investigation: Muhammad Zuhayr bin Nasir al-Nasir. 1st ed., Beirut: Dar Tawq al-Najat, 1433 AH - 2013 AD. 48. \"Fath al-Qadir (Al-Jami' bayna Fannay al-Riwayah wa al-Dirayah min Ilm al-Tafsir)\". Al-Shawkani, Muhammad bin Ali (d. 1250). Investigation: Dr. Abd al-Rahman Umayrah. 2nd ed., Mansoura: Dar al-Wafa', 1418 AH - 1997 AD. 49. \"Kawkabat al-Khutab al-Munifah min Minbar al-Ka'bah al-Sharifah\", Al-Sudais, Abd al-Rahman bin Abd al-Aziz. 1st ed., Makkah Al-Mukarramah: Maktabat Imam al-Da'wah al-Ilmiyyah, 1423 AH - 2002 AD. 50. \"Lisan al-Arab\". Ibn Manzur, Abu al-Fadl Jamal al-Din Muhammad bin Mukarram al-Ifriqi al-Masri (d. 711 AH). 3rd ed., Beirut: Dar Sadir, 1414 AH. 51. \"Majma' al-Bayan fi Tafsir al-Quran\". Al-Tabarsi, Abu Ali al-Fadl bin al-Hasan bin al-Fadl (d. 548 AH). 1st ed., Beirut: Dar al-Murtada, 1427 AH - 2006 AD. 52. \"Majmu' Fatawa Shaykh al-Islam Ahmad Ibn Taymiyyah (d. 728 AH)\". Collection and Arrangement: Abd al-Rahman bin Muhammad bin Qasim and his son Muhammad. No ed., Madinah: King Fahd Complex for the Printing of the Holy Quran, 1425 AH - 2004 AD. 53. \"Marasid al-Matali' fi Tanasub al-Maqati' wa al-Matali'\", Al-Suyuti, Jalal al-Din (d. 911 AH). Read and completed by: Dr. Abd al-Muhsin bin Abd al-Aziz al-Askar. 1st ed., Riyadh: Maktabat Dar al-Minhaj, 1426 AH. 54. \"Markaziyyat al-Maqasid 'inda Muhammad al-Ghazali: Muqarabah fi al-Mafhum wa al-Mustalah wa al-Darurah\", Zarman, Prof. Dr. Muhammad. Tafsir Center for Quranic Studies, Electronic Publication.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 58
  },
  {
    "serial_number": "1067073",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "55. \"Masa'id al-Nazar lil-Ishraf 'ala Maqasid al-Suwar, and called: 'Al-Maqsad al-Asma fi Mutabaqat Ism Kulli Surah lil-Musamma'\". Al-Biqa'i, Burhan al-Din Abu al-Hasan Ibrahim bin Umar al-Shafi'i (d. 885 AH). Investigation: Dr. Abd al-Sami' Muhammad Ahmad Hasanayn. 1st ed., Riyadh: Maktabat al-Ma'arif, 1408 AH - 1987 AD. 56. \"Mazahir al-I'jaz al-Bayani fi al-Quran al-Karim\". Qufi: Prof. Dr. Ahmad. No ed., n.p.: Academic Book Center, 2018 AD. 57. \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\". Al-Maydani, Abd al-Rahman Hasan Habannakah (d. 1425 AH). 1st ed., Damascus: Dar al-Qalam, 1420 AH - 2000 AD. 58. \"Ma'alim al-Tanzil fi Tafsir al-Quran - Tafsir al-Baghawi\". Al-Baghawi, Abu Muhammad al-Husayn bin Mas'ud (d. 516 AH). Investigation: Muhammad Abdullah al-Nimr, and Uthman Jumu'ah Dumayriyyah, and Sulayman Muslim al-Harsh. 4th ed., Riyadh: Dar Taybah, 1409 AH - 1989 AD. 59. \"Mu'jam Maqayis al-Lughah\". Ibn Faris, Abu al-Husayn Ahmad bin Faris bin Zakariya (d. 395 AH). Investigation: Abd al-Salam Muhammad Harun. No ed., Dar al-Fikr, 1399 AH - 1979 AD. 60. \"Mafatih al-Ghayb - Al-Tafsir al-Kabir\". Fakhr al-Din al-Razi (d. 606 AH). 1st ed., Beirut: Dar al-Fikr, 1401 AH - 1981 AD. 61. \"Miftah Dar al-Sa'adah wa Manshur Wilayat al-Ilm wa al-Iradah\". Ibn Qayyim al-Jawziyyah, Abu Abdullah Muhammad bin Abi Bakr bin Ayyub (d. 751 AH). Investigation: Abd al-Rahman bin Hasan bin Qa'id. 1st ed., Makkah: Dar Alam al-Fawa'id, 1432 AH. 62. \"Muqarabat 'Maqasid al-Quran al-Karim': Dirasah Tarikhiyyah\". Hallali, Abd al-Rahman. Al-Tajdid Journal, International Islamic University Malaysia, Vol (20), (39 A), 1438 AH - 2016 AD, 193 - 234.",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 59
  },
  {
    "serial_number": "1067074",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Quranic Objectives in Surah Qaf",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "63. \"Maqasid al-Quran min Tashri' al-Ahkam\". Hamidi, Dr. Abd al-Karim. 1st ed., Dar Ibn Hazm, 2010 AD. 64. \"Manahil al-Irfan fi Ulum al-Quran\". Al-Zarqani, Muhammad Abd al-Azim (d. 1367 AH). Investigation: Fawwaz Ahmad Zamarli. No ed., Dar al-Kitab al-Arabi, n.d. 65. \"Minhaj al-Sunnah al-Nabawiyyah fi Naqd Kalam al-Shi'ah al-Qadariyyah\". Ibn Taymiyyah, Taqi al-Din Abu al-Abbas Ahmad bin Abd al-Halim (d. 728 AH). Investigation: Dr. Muhammad Rashad Salim. 2nd ed., Riyadh: Imam Muhammad bin Saud Islamic University, 1406 AH - 1986 AD. 66. \"Nazariyyat al-Maqasid 'inda al-Shatibi\". Al-Raysuni, Ahmad. No ed., Virginia: International Institute of Islamic Thought, Dar al-Aman, 1421 AH. 67. \"Nazm al-Durar fi Tanasub al-Ayat wa al-Suwar\". Al-Biqa'i, Abu al-Hasan Burhan al-Din Ibrahim bin Umar al-Shafi'i (d. 885 AH). No ed., Cairo: Dar al-Kitab al-Islami, 1413 AH. * * *",
    "foot_note": "None",
    "book_id": "255",
    "new_page_number": 60
  }
]