[
  {
    "text": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 1
  },
  {
    "text": "sn: 3244\nbook_title: خطبة الحاجة التي كان رسول الله صلى الله عليه وسلم يعلمها أصحابه\nbook_link: https://shamela.ws/book/11175\nbook_id: 11175\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مكتبة المعارف\nedition: الطبعة الأولى 1421هـ-2000م\npages: 45\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التخريج والأطراف\ncategory_id: 8",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 2
  },
  {
    "serial_number": "3203975",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Takhrij and End Parts (Atraf). Book: The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Maktabat al-Ma'arif. Edition: First Edition 1421 AH - 2000 AD. Number of Pages: 45 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Maktabat al-Ma'arif. Edition: First Edition 1421 AH - 2000 AD. Number of Pages: 45 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Maktabat al-Ma'arif. Edition: First Edition 1421 AH - 2000 AD. Number of Pages: 45 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 3
  },
  {
    "serial_number": "3203976",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Khutbat-ul-Haajah that the Messenger of Allah ﷺ used to Teach His Companions",
    "edition": "First Edition 1421 AH / 2000 CE",
    "publisher": "Maktabat al-Ma‘arif",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction… In the Name of Allah, the Most Merciful, the Most Compassionate. The Khutbat-ul-Haajah: Indeed, all praise is for Allah. We praise Him, seek His help, and seek His forgiveness. We seek refuge in Allah from the evils within ourselves and from our bad deeds. Whoever Allah guides, none can misguide; and whoever He allows to go astray, none can guide. I bear witness that there is no deity worthy of worship except Allah alone, without partner, and I bear witness that Muhammad is His servant and Messenger. “O you who believe! Fear Allah as He should be feared and do not die except as Muslims.” “O mankind! Fear your Lord, who created you from a single soul, and created from it its spouse, and spread from them many men and women. And fear Allah, through whom you ask one another, and (honor) the wombs. Indeed, Allah is ever watching over you.” “O you who believe! Fear Allah and speak words that are upright; He will rectify your deeds for you and forgive your sins. Whoever obeys Allah and His Messenger has certainly achieved a great success.” After this, he states his need.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 4
  },
  {
    "serial_number": "3203977",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction. In the name of Allah, the Most Gracious, the Most Merciful. All praise is due to Allah, and blessings and peace be upon the Messenger of Allah, his family, his companions, and those who follow him. As for what follows: When the day of my marriage contract to my second wife arrived, a few months after the death of the first - \"Umm Abdur-Rahman,\" may Allah have mercy on her - one of the brothers offered to deliver the marriage sermon himself. He mentioned that he had witnessed its benefit and impact more than once when he delivered it. I said: I have no objection, but I want to cast my eye over it. So he presented it to me, and I saw that it was acceptable, except that I introduced some improvements to it, such as removing some weak hadiths and replacing them with authentic ones. And it was",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 5
  },
  {
    "serial_number": "3203978",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 5,
    "volume_number": 1,
    "text": "most important to me that I introduced it with the Sermon of Need (Khutbat al-Hajah) that the Messenger of Allah (may Allah bless him and grant him peace) used to teach his companions, after I had tracked its chains of transmission and wordings from various books of the Purified Sunnah. This is the sermon that the Righteous Predecessors (Al-Salaf Al-Salih) used to present before their lessons, their books, and their various affairs, as will be explained in the \"Conclusion,\" Allah the Exalted willing. Then it appeared to me to collect this in this treatise as a reminder for myself, and perhaps there is benefit in it for others. I have arranged it into two chapters and a conclusion. Allah the Exalted is my Sufficiency, and [He is] the best Disposer of affairs. Muhammad Nasir al-Din al-Albani",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 6
  },
  {
    "serial_number": "3203979",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 6,
    "volume_number": 1,
    "text": "Chapter One: On the Text of the Sermon. [Indeed] (1) all praise is due to Allah, [we praise Him and] we seek His help and we seek His forgiveness, and we seek refuge in Allah from the evils of our own selves [and from our bad deeds]. Whomever Allah guides, there is none to misguide him, and whomever He leaves astray, there is none to guide him. And I bear witness (2) that there is no deity worthy of worship except Allah alone, having no partner,",
    "foot_note": "1. 1 What is between the brackets is an established addition in some narrations; we placed them between brackets to draw attention to that. 2 It is noted here that the verb is in the singular first-person form, unlike the preceding verbs which are in the plural form. Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) revealed a subtle wisdom regarding this, which his student Ibn al-Qayyim quoted from him in \"Tahdhib al-Sunan\" 3/54, saying: The hadiths generally agree that: \"we seek His help\", \"we seek His forgiveness\", and \"we seek refuge in Him\" are with the 'Nun' (plural marker), and the two testimonies are singular: \"I bear witness that there is no deity worthy of worship except Allah and I bear witness that Muhammad is His slave and His Messenger.\" Sheikh al-Islam Ibn Taymiyyah said: Since the word of Testimony (Shahada) cannot be borne by one person on behalf of another and does not accept proxy in any case =",
    "book_id": "11175",
    "new_page_number": 7
  },
  {
    "serial_number": "3203980",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 7,
    "volume_number": 1,
    "text": "and I bear witness that Muhammad is His slave and His Messenger. {O you who have believed, fear Allah as He should be feared and do not die",
    "foot_note": "1. = he singled out the Testimony with it (singular form). And since seeking help, seeking refuge, and seeking forgiveness accept that (proxy) - for a man may seek forgiveness for another, seek Allah's help for him, and seek refuge in Allah for him - he used the plural wording in them. For this reason, one says: 'O Allah help us, grant us refuge, and forgive us.' He said this regarding the hadith of Ibn Masud which does not contain 'we praise Him' (nahmaduhu). In the hadith of Ibn Abbas, 'nahmaduhu' is with the 'Nun' (plural) even though Praise is not borne by one on behalf of another nor does it accept proxy. There is another meaning for this, which is that seeking help, refuge, and forgiveness is a request and an origination (insha'), so it is recommended for the seeker to request it for himself and for his believing brothers. As for the Testimony, it is information about his witnessing of Allah's Oneness and of His Prophet's Message. It is information that corresponds to the knot of the heart (belief) and its verification. A person only reports this about himself based on his knowledge of his own state, unlike reporting about others, for he reports about their speech and utterance, not about the knot of their hearts. And Allah knows best.\" I say: The word \"we praise Him\" (nahmaduhu) has appeared in the hadith of Ibn Masud via two paths as will come, and it appeared in the hadith of Ibn Abbas in \"Muslim\" and others as will come.",
    "book_id": "11175",
    "new_page_number": 8
  },
  {
    "serial_number": "3203981",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Khutbat-ul-Haajah that the Messenger of Allah ﷺ used to Teach His Companions",
    "edition": "First Edition 1421 AH / 2000 CE",
    "publisher": "Maktabat al-Ma‘arif",
    "page_number": 8,
    "volume_number": 1,
    "text": "“…except while you are Muslims.” “O mankind! Fear your Lord who created you from a single soul, and created from it its spouse, and spread from the two of them many men and women. And fear Allah through whom you ask one another, and (honor) the ties of kinship. Indeed, Allah is ever watching over you.” “O you who believe! Fear Allah and speak words that are upright; He will rectify your deeds for you and forgive your sins. And whoever obeys Allah and His Messenger has certainly achieved a great success.” After this, he states his need.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 9
  },
  {
    "serial_number": "3203982",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter Two: On the Extraction (Takhrij) of the Sermon. This blessed sermon has been narrated from six of the Companions: Abdullah bin Masud, Abu Musa al-Ash'ari, Abdullah bin Abbas, Jabir bin Abdullah, Nabit bin Sharit, and Aisha, may Allah be pleased with them; and from one Successor (Tabi'i), who is Az-Zuhri, may Allah have mercy on him. 1 - The Hadith of Ibn Masud. There are four paths for it from him: First: From Abu Ishaq, from Abu Ubaydah bin Abdullah, from his father, who said: The Messenger of Allah, peace and blessings of Allah be upon him, taught us the Sermon of Necessity [in marriage and other matters]: 'Al-Hamdu Lillah (All praise is due to Allah)...' The Hadith. It was recorded by Abu Dawud 1:331, An-Nasa'i 1/208, Al-Hakim 2/182, 183, At-Tayalisi No. 338, Ahmad No. 3720 and 4115, and Abu Ya'la in his 'Musnad'",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 10
  },
  {
    "serial_number": "3203983",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 10,
    "volume_number": 1,
    "text": "s 342/1, At-Tabarani in 'Al-Mu'jam Al-Kabir', and Al-Bayhaqi in his 'Sunan' 7/146 through paths from him. I say: This is a chain whose men are all trustworthy (thiqat), except that it is interrupted (munqati'); for An-Nasa'i said after citing it: 'Abu Ubaydah did not hear anything from his father, nor did Abdur-Rahman bin Abdullah bin Masud, nor Abdul-Jabbar bin Wa'il bin Hujr.' This addition 'in marriage and other matters' belongs to Abu Dawud via the path of Sufyan from Abu Ishaq, and it appears to be from the speech of Ibn Masud. However, Shu'bah disagreed with him and made it from the speech of Abu Ishaq, as he said: 'I said to Abu Ishaq: Is this in the marriage sermon or in others? He said: In every need.' Narrated by At-Tayalisi. The first, second, third, and fourth additions belong to At-Tahawi,",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 11
  },
  {
    "serial_number": "3203984",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 11,
    "volume_number": 1,
    "text": "and to Ahmad belongs the first in a narration; to Al-Hakim, the second and sixth; to An-Nasa'i, the third; to At-Tabarani, the fifth; and to Ad-Darimi, the second and sixth. Second: From Abu Al-Ahwas from Abdullah who said: The Messenger of Allah, peace and blessings of Allah be upon him, taught us the Tashahhud in prayer and the Tashahhud in necessity (Hajah). He said: The Tashahhud in necessity... so he mentioned it. Recorded by An-Nasa'i 2/29, At-Tirmidhi 2/178, At-Tabarani in Al-Kabir from Al-A'mash, Ibn Majah 1/584, 585 from Yunus bin Abi Ishaq, At-Tahawi 1/4, and Al-Bayhaqi 3/214 from Al-Mas'udi; all three of them from Abu Ishaq from him. At-Tirmidhi said: 'A Hasan Hadith. Al-A'mash narrated it from Abu Ishaq from Abu Al-Ahwas from the Prophet, peace and blessings of Allah be upon him, and Shu'bah narrated it from Abu",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 12
  },
  {
    "serial_number": "3203985",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 12,
    "volume_number": 1,
    "text": "Ishaq from Abu Ubaydah from Abdullah from the Prophet, peace and blessings of Allah be upon him. Both Hadiths are authentic (Sahih) because Isra'il combined them, saying: From Abu Ishaq from Al-Ahwas and Abu Ubaydah from Abdullah bin Masud from the Prophet, peace and blessings of Allah be upon him. I say: This narration of Isra'il was connected by Ahmad No. 4116, Abu Dawud, and Al-Bayhaqi from Waki': Isra'il told us... and Isra'il was not unique in this; rather, Shu'bah followed him in it according to Ahmad No. 3721, At-Tahawi, and Al-Bayhaqi. This indicates the authenticity of the two chains from Ibn Masud. However, the first is interrupted as mentioned previously. As for this one, it is authentic according to the conditions of Muslim. It contains the first addition according to everyone except Ibn Majah; and to him and At-Tahawi belongs the second addition; and to them and At-Tirmidhi belongs the third addition; and to Ibn Majah belongs the fourth.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 13
  },
  {
    "serial_number": "3203986",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 13,
    "volume_number": 1,
    "text": "Third: From Imran Al-Qattan from Qatadah from Abd Rabbih from Abu Iyad from Ibn Masud, may Allah be pleased with him, that the Messenger of Allah, peace and blessings of Allah be upon him, used to say when he performed Tashahhud: 'All praise is due to Allah, we seek His help and ask for His forgiveness...' The Hadith up to his saying: 'His slave and Messenger.' And he added: 'He sent him with the truth as a bringer of good tidings and a warner before the Hour. Whoever obeys Allah and His Messenger has been guided, and whoever disobeys them (ya'sihima) harms only himself and does not harm Allah in the slightest.' Recorded by Abu Dawud 1/172, 331 and Al-Bayhaqi 3/215, 7/146. At-Tabarani recorded it in 'Al-Kabir' except that he said: 'He used to say in the Sermon of Necessity...'. This is a weak chain, and its defect is this Abu Iyad – who is the Madinan. Al-Hafiz said in 'At-Taqrib': 'He is unknown (Majhul).' This is the defect of the Hadith, and a group [of scholars] overlooked it; the first of whom",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 14
  },
  {
    "serial_number": "3203987",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 14,
    "volume_number": 1,
    "text": "I found [who overlooked it]: Al-Mundhiri in 'Mukhtasar As-Sunan', where he found fault with it due to this Imran, saying: 'In its chain is Imran bin Dawar Al-Qattan, and there is some criticism regarding him.' Ibn Al-Qayyim followed him in that, and his words will follow. And Ash-Shawkani in 'Nayl Al-Awtar' 3/224 said: 'In its chain is Imran bin Dawar — in the original: Darun, which is a mistake — Abu Al-Awwam Al-Basri. Affan said: He was trustworthy. Al-Bukhari cited him as evidence. Yahya bin Ma'in and An-Nasa'i said: Weak in Hadith...'. The furthest of them from correctness was Imam An-Nawawi, may Allah have mercy on him, as he said in 'Sharh Sahih Muslim' 6/160: 'Its chain is authentic!' I believe his mind was diverted from the real defect that was mentioned; otherwise, were it not for it, the chain would be Hasan in my view.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 15
  },
  {
    "serial_number": "3203988",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 15,
    "volume_number": 1,
    "text": "Then, within the text of this narration is a reprehensible matter (nakarah), which is his saying: 'And whoever disobeys them (ya'sihima).' For the prohibition of this wording has been authenticated from him, peace and blessings of Allah be upon him, as in the Hadith of Adi bin Hatim: That a man delivered a sermon in the presence of the Prophet, peace and blessings of Allah be upon him, and said: 'Whoever obeys Allah and His Messenger has been guided, and whoever disobeys them has gone astray.' So the Messenger of Allah, peace and blessings of Allah be upon him, said: 'What a wretched speaker you are! Say: And whoever disobeys Allah and His Messenger.' Recorded by Muslim 3/12, 13, Abu Dawud 1/172, An-Nasa'i 2/79, Al-Bayhaqi 3/216, and Ahmad 4/256, 379. So you see that he, peace and blessings of Allah be upon him, rebuked the speaker for his saying: 'And whoever disobeys them.' For that reason, Ibn Al-Qayyim said in 'Tahdhib As-Sunan' 3/55: 'If the Hadith of Imran bin Dawar is authentic, perhaps some of them narrated it",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 16
  },
  {
    "serial_number": "3203989",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 16,
    "volume_number": 1,
    "text": "by meaning, thinking that the two wordings are equal, and the Hadith: 'What a wretched speaker you are' did not reach him. And Imran is not that [strong of a] memorizer.' I say: We have just clarified the defect of the Hadith. It has now become clear to me that even if its chain were authentic, it would not be reprehensible (Munkar) with regard to the Prophet, peace and blessings of Allah be upon him, because he has the right to do what is not for us to do, especially since the likes of what is in this Hadith has been proven from him, peace and blessings of Allah be upon him, as will come in the words of An-Nawawi. So it is from his special characteristics, peace and blessings of Allah be upon him. He said in 'Sharh Muslim': 'Al-Qadi and a group of scholars said: He only rebuked him for joining them in the pronoun which implies equality, and he ordered him to use conjunction out of glorification for Allah the Exalted by advancing His name, just as he, peace and blessings of Allah be upon him, said in another Hadith: 'Let none of you say: What Allah wills and so-and-so wills, but let him say: What Allah wills, then what so-and-so wills.' The correct view: The reason for the prohibition is that sermons are meant for elaboration",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 17
  },
  {
    "serial_number": "3203990",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 17,
    "volume_number": 1,
    "text": "and clarification, and avoiding hints and symbols. For this reason, it is established in the Sahih that when the Messenger of Allah, peace and blessings of Allah be upon him, spoke, he would repeat it three times so it would be understood. As for the saying of the former group, it is weakened by several things, including: That such a pronoun has occurred repeatedly in authentic Hadiths from the speech of the Messenger of Allah, peace and blessings of Allah be upon him, such as his saying, peace and blessings of Allah be upon him: 'That Allah and His Messenger are more beloved to him than anything else,' and other Hadiths. He only used the dual pronoun here because it is not a sermon of admonition; rather, it is teaching a ruling. So the fewer the words, the closer it is to being memorized, unlike the sermon of admonition, for the intent is not memorizing it, but rather taking a lesson from it. What supports this is what is established in Sunan Abi Dawud with an authentic chain from Ibn Masud, who said: 'He taught us the Sermon of Necessity: All praise is due to Allah, we seek His help... and whoever disobeys them harms only himself",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 18
  },
  {
    "serial_number": "3203991",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 18,
    "volume_number": 1,
    "text": "and does not harm Allah in the slightest. And Allah knows best.' I say: What An-Nawawi, may Allah have mercy on him, considered weak is the correct view, and what he considered correct is the weak view. The explanation of that is in several matters: First: His saying: 'The reason for the prohibition is that the sermon's nature is elaboration and clarification.' The researcher As-Sindi, may Allah have mercy on him, critiqued this in his commentary on Muslim by saying: 'It is very weak; for if that were the reason for the rebuke, it would be [applicable] in a place where the pronoun caused some type of ambiguity. But in a place where there is no ambiguity, it is not so; otherwise, mentioning the pronoun in the sermon would be reprehensible and forbidden [always], yet it is not so. Rather, explicit mention in some places in sermons is reprehensible. So reflect.' Second: His support for what he adopted using the Hadith of Ibn Masud",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 19
  },
  {
    "serial_number": "3203992",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 19,
    "volume_number": 1,
    "text": "claiming that its chain is authentic, is incorrect due to the unknown narrator (jahalah) in its chain as we clarified previously. Third: Assuming the chain is authentic, the Hadith would only indicate permissibility if it contained that the Prophet, peace and blessings of Allah be upon him, was *teaching* them that, as stated in 'Sharh Muslim'. But it is not so. This is another mistake by Imam An-Nawawi, as he mentioned that the text of the Hadith in Abu Dawud is with the wording: 'He taught us the Sermon of Necessity...' However, this wording is not present with anyone else who recorded the Hadith from this path. Rather, it is in the first two paths which are devoid of this weak addition: 'He sent him with the truth...' etc., as previously mentioned. So it seems that one wording was mixed up with the other for An-Nawawi, may Allah have mercy on him, leading him to a context that has no basis in any of the narrations. So be aware. Fourth: That his saying: 'That has occurred repeatedly in the authentic Hadiths",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 20
  },
  {
    "serial_number": "3203993",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 20,
    "volume_number": 1,
    "text": "from his speech, peace and blessings of Allah be upon him.' does not indicate the detailed breakdown he went for. The most it implies is that this occurred from him, peace and blessings of Allah be upon him, but it does not contain instruction from him, peace and blessings be upon him, to his Ummah. In that case, it does not contradict the previously mentioned Hadith of Adi bin Hatim, based on what is established in the principles (Usul) that speech takes precedence over action when there is a conflict. Thus, it is permissible for him, peace be upon him, to the exclusion of his Ummah. The wisdom behind this distinction is clear: it is because he, peace and blessings of Allah be upon him, is not in a position where his speech could be thought to intend something unbecoming of the station of Lordship and Divinity, unlike others beside him, peace and blessings of Allah be upon him, regarding whom that might be thought. So he, peace and blessings of Allah be upon him, commanded the avoidance of ambiguities and being articulate about the intent, based on his saying, peace and blessings of Allah be upon him: 'Leave that which makes you doubt for that which does not make you doubt' [1].",
    "foot_note": "1. 1 An authentic Hadith narrated from a group of Companions, and I have extracted it in 'Irwa' al-Ghalil fi Takhrij Ahadith Manar as-Sabil' No. 2134.",
    "book_id": "11175",
    "new_page_number": 21
  },
  {
    "serial_number": "3203994",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Necessity (Khutbah al-Hajah) that the Messenger of Allah, peace and blessings of Allah be upon him, used to teach his Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 21,
    "volume_number": 1,
    "text": "Then I saw that Al-Izz bin Abdus-Salam had preceded me to what I concluded. As-Sindi quoted that from him in the marginal notes on An-Nasa'i, p. 80, saying: 'And Sheikh Izz ud-Din said: It is from his special characteristics, peace and blessings of Allah be upon him, that it was permissible for him to combine the pronoun between him and his Lord, the Exalted, while that is prohibited for others. He said: It is prohibited for others and not him because if another person combines them, his generalization suggests equality, unlike him [the Prophet], for his station is not susceptible to the suggestion of that.' This agrees completely with what we considered most likely, and praise be to Allah for His enablement. As-Sindi had quoted before that the words of Al-Qurtubi regarding reconciling the Hadith of Ibn Masud—and he explicitly stated its authenticity—and the Hadith of Adi through four aspects he mentioned, from which it can be inferred that he leans towards this",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 22
  },
  {
    "serial_number": "3203995",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Khutbat-ul-Haajah that the Messenger of Allah ﷺ used to Teach His Companions",
    "edition": "First Edition 1421 AH / 2000 CE",
    "publisher": "Maktabat al-Ma‘arif",
    "page_number": 22,
    "volume_number": 1,
    "text": "This is the view we have considered preferable—review it if you wish. It seems that al-Nawawi followed this opinion as well, for he explicitly affirmed his share in it. His mistake has already been clarified. Abu al-Hasan al-Sindi, may Allah have mercy on him, inclined toward this same view when he said: “The correct approach is to say that combining (two individuals) in a single pronoun undermines the level of reverence that is required when considered from the perspective of some speakers, and it may give the impression of equality from the perspective of some listeners who lack understanding. Thus, its ruling differs depending on the speaker and the listener. And Allah knows best.” I hold that the correct position is to generalize this ruling as a precautionary measure, and in accordance with the general meaning of the hadith: ‘None of you should say: What Allah wills and what so-and-so wills…’ end of hadith.",
    "foot_note": "1. It is documented in my book ‘Silsilat al-Ahaadith as-Saheehah’, hadith no. 136.",
    "book_id": "11175",
    "new_page_number": 23
  },
  {
    "serial_number": "3203996",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 23,
    "volume_number": 1,
    "text": "For it is from this chapter that the Hadith of Adi bin Hatim was narrated. And the view adopted by Al-Sindi, which we quoted from him previously, that mentioning the pronoun in the sermon is not objectionable (Munkar), his reliance was solely on this Hadith of Ibn Masud. And you have known that there is no proof in it regarding its chain of narration (Isnad) nor its text (Matn). And his saying: 'That displaying the pronoun in some places of the sermons is almost objectionable.' I have contemplated it, and its validity did not appear to me unless it is from the perspective of taste/preference, and this is not considered if it conflicts with the legislative direction. And Allah knows best. Fourth: From Huraith, from Wasil al-Ahdab, from Shaqiq, from Abdullah bin Masud, who said: 'The Messenger of Allah (may Allah bless him and grant him peace) used to teach us the Tashahhud and the Khutbah (sermon) just as he used to teach us a Surah from the Qur'an... and the Khutbah is: All praise is due to Allah...'.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 24
  },
  {
    "serial_number": "3203997",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 24,
    "volume_number": 1,
    "text": "It was narrated by Al-Bayhaqi 7/146, 147. This is a weak chain due to Huraith, who is Ibn Abi Matar Amr al-Fazari; for he is weak by agreement. In this path are the second and fourth additions. 2 - The Hadith of Abu Musa al-Ash'ari: Narrated by Abu Ya'la in his 'Musnad' 1/342 from the aforementioned Hadith of Ibn Masud via the first path, quoting it up to his saying: 'And I bear witness that Muhammad is His slave and His Messenger,' and he added: 'Abu Ubaidah said: And I heard from Abu Musa saying: The Messenger of Allah (may Allah bless him and grant him peace) used to say: 'If you wish to connect your sermon with verses from the Qur'an,' you say: 'I said: So he mentioned the three verses.' And in it is: 'As for what follows (Amma Ba'du): Then speak of your need.' Al-Haythami cited it in Majma' al-Zawa'id 4/288.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 25
  },
  {
    "serial_number": "3203998",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 25,
    "volume_number": 1,
    "text": "And he said: 'It was narrated by Abu Ya'la and Al-Tabarani in Al-Awsat and Al-Kabir in summary, and its men are trustworthy (Thiqat), and the Hadith of Abu Musa is connected, but Abu Ubaidah did not hear from his father.' I say: I have checked the Musnad of Abdullah bin Masud in 'Al-Mu'jam Al-Kabir' and did not find it; so it appears it is in the Musnad of Abu Musa in it, and the part containing this Musnad is not present in 'Al-Maktabah Al-Zahiriyah'. 3 - The Hadith of Abdullah bin Abbas: He said: 'Dimad came to Mecca, and he was from the Azd Shanu'ah, and he used to perform Ruqyah (healing incantations) for this wind (i.e., madness/jinn possession). He heard fools among the people of Mecca saying: Indeed Muhammad is mad. So he said: If I were to see this man, perhaps Allah would cure him at my hands. He said: So he met him and said: O Muhammad, I perform Ruqyah for this wind, and indeed Allah cures at my hands whom He wills.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 26
  },
  {
    "serial_number": "3203999",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 26,
    "volume_number": 1,
    "text": "So do you wish [for it]? The Messenger of Allah (may Allah bless him and grant him peace) said: 'Indeed, all praise is due to Allah, we praise Him and we seek His help. Whoever Allah guides, there is none to misguide him, and whoever He leaves astray, there is none to guide him. And I bear witness that there is no deity worthy of worship except Allah alone, with no partner, and that Muhammad is His slave and His Messenger. As for what follows.' He said: So he [Dimad] said: Repeat these words of yours to me. So the Messenger of Allah (may Allah bless him and grant him peace) repeated them to him three times. He said: So he said: I have heard the speech of the soothsayers, the speech of the magicians, and the speech of the poets, but I have never heard the likes of these words of yours; they have reached the depths of the ocean. He said: So he said: Give me your hand so I may pledge allegiance to you for Islam. He said: So the Messenger of Allah (may Allah bless him and grant him peace) accepted his pledge. The Messenger of Allah (may Allah bless him and grant him peace) said: 'And for your people?' He said: And for my people. He said: So the Messenger of Allah (may Allah bless him and grant him peace) sent an expedition (Sariyyah), and they passed by his people. The leader of the expedition said to the army: Did you take",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 27
  },
  {
    "serial_number": "3204000",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 27,
    "volume_number": 1,
    "text": "anything from these people? A man from the group said: I took a vessel (Mithara) from them. So he said: Return it, for these are the people of Dimad.' Narrated by Muslim 3/12 and Al-Bayhaqi with this completion. Ahmad (No. 3275), Ibn Majah (1/585), and Al-Tahawi narrated only the sermon from it, but the text and a part of the chain were dropped from the printed copy [of Al-Tahawi], and in Ahmad's version, it lacks the phrase: 'As for what follows' (Amma Ba'du). In it - as you see - is the second addition in place of his saying: 'And we seek His forgiveness.' Sheikh al-Islam Ibn Taymiyyah hesitated regarding the establishment of this addition, yet it is authentic and established without doubt as previously explained. 4 - The Hadith of Jabir bin Abdullah: Narrated by Al-Khatib 14/440, 441 via the path of Amr bin Shamir from Abu Ja'far Muhammad bin Ali from Ali bin",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 28
  },
  {
    "serial_number": "3204001",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 28,
    "volume_number": 1,
    "text": "Hussein from him from the Prophet (may Allah bless him and grant him peace) that when he sat on the pulpit, he said: 'All praise is due to Allah, I praise Him and I seek His help, and I believe in Him and I rely upon Him, and I seek refuge in Allah from the evils of our own selves and from the evil consequences of our deeds...' the Hadith until his saying: 'And that Muhammad is His slave and His Messenger.' This chain is very weak; its defect is Amr bin Shamir, for he is a liar and a fabricator. However, the Hadith has a basis with a different context. Imam Ahmad said (3/371): Waki' told us, from Sufyan, from Ja'far, from his father, from Jabir who said: The Messenger of Allah (may Allah bless him and grant him peace) used to stand and deliver a sermon, praising Allah and extolling Him with what He is worthy of, and he would say: 'Whoever Allah guides, there is none to misguide him, and whoever He leaves astray, there is none to guide him. Indeed, the best of speech is the Book of Allah, and the best guidance is the guidance of Muhammad (may Allah bless him and grant him peace), and the worst of matters are the newly invented ones, and every newly invented matter is an innovation.'",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 29
  },
  {
    "serial_number": "3204002",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 29,
    "volume_number": 1,
    "text": "And when he mentioned the Hour, his eyes would redden, his voice would rise, and his anger would intensify as if he were warning of an army [saying]: 'It is attacking you in the morning and the evening. Whoever leaves wealth, it is for the heirs, and whoever leaves a liability (family) or a debt, it is upon me and to me, and I am the guardian of the believers.' I say: This chain is authentic according to the condition of Muslim, and he narrated it in his 'Sahih' (3/11), as did Al-Bayhaqi in his 'Sunan' (3/214) via the path of Abu Bakr bin Abi Shaybah: Waki' told us... with it. Muslim did not quote the entire wording but referred for the rest of it to the wording he quoted before it via the path of Abdul-Wahhab bin Abdul-Majid from Ja'far with it, similar to it. In it, instead of saying: 'And every newly invented matter is an innovation,' [it says] 'And every innovation is misguidance.' Al-Bayhaqi combined the two in his narration. He also combined them in his book 'Al-Asma' wa al-Sifat' from this aspect, and from the path of...",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 30
  },
  {
    "serial_number": "3204003",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 30,
    "volume_number": 1,
    "text": "Ibn al-Mubarak from Sufyan with it, he paired their narration from him and also added: 'And every misguidance is in the Fire.' This is also in Al-Nasa'i (1/234) with the first two phrases via the path of Ibn al-Mubarak, and its chain is authentic as Sheikh al-Islam Ibn Taymiyyah said in 'Iqamat al-Dalil 'ala Ibtal al-Tahlil' from 'Al-Fatawa': 3/58. Then Imam Ahmad said (3/319): 'Yahya told us, from Ja'far with it, with the wording: The Messenger of Allah (may Allah bless him and grant him peace) used to say in his sermon after the Tashahhud: 'Indeed the best of speech is the Book of Allah'...' the Hadith briefly similar to it. I say: This chain is also authentic according to the condition of Muslim. His saying: 'After the Tashahhud' indicates the Tashahhud mentioned in the text of the Hadith of Ibn Masud and Ibn Abbas, and that it was famous and known to them such that the narrator sufficed with that instead of mentioning it.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 31
  },
  {
    "serial_number": "3204004",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 31,
    "volume_number": 1,
    "text": "5 - The Hadith of Nabit bin Sharit, who said: 'I was riding behind my father on the rear of the mount while the Prophet (may Allah bless him and grant him peace) was delivering a sermon at the Jamrah. He said: 'All praise is due to Allah, we praise Him, we seek His help, and we seek His forgiveness. And I bear witness that there is no deity worthy of worship except Allah and that Muhammad is His slave and His Messenger. I advise you to fear Allah. Which day is most sacred?' (1) They said: This one. He said: 'Which month is most sacred?' They said: This one. He said: 'Which land is most sacred?' They said: This land. He said: 'Indeed, your blood and your wealth are forbidden unto you like the sanctity of this day of yours, in this month of yours, in this land of yours.'' Narrated by Al-Bayhaqi (3/215) via the path of Abu Ghassan Malik",
    "foot_note": "1. 1 The original text says 'Ahramu Hadha' (Is this one most sacred?). And in its margin: 'Thus it is in all copies'.",
    "book_id": "11175",
    "new_page_number": 32
  },
  {
    "serial_number": "3204005",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 32,
    "volume_number": 1,
    "text": "Ibn Isma'il al-Nahdi: Musa bin Muhammad al-Ansari told us: Abu Malik al-Ashja'i told us from him. I say: This is a chain whose men are trustworthy except Musa bin Muhammad bin Muhammad al-Ansari; it appears he is Al-Makhzumi Al-Madani. If it is him, then he is weak. If it is other than him, I do not know him. 6 - The Hadith of Aisha, Mother of the Believers: Narrated by Abu Bakr bin Abi Dawud in 'Musnad Aisha' (Folio 2/57) with a good chain from Hisham - he is Ibn Urwah - from his father who said: The Messenger of Allah (may Allah bless him and grant him peace) used to frequently recite these two verses in the Khutbah: {O you who have believed, fear Allah and speak words of appropriate justice} the verse. I say: Thus it is in the original 'from his father', it did not say: 'Aisha said:' or similar to that. The scribe placed above it the head of the letter Sad 'Saad' as an indication that it appeared like this in his original source as well, and that...",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 33
  },
  {
    "serial_number": "3204006",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 33,
    "volume_number": 1,
    "text": "the correct reading establishes his saying: 'Aisha said', evidenced by the fact that the author included it in 'Her Musnad'. Had this not been established in his narration, he would not have included it therein, because the Hadith would then be Mursal (hurried/disconnected) as is apparent. I saw another Hadith in it where a similar omission occurred, but something remained indicating it, for he said (1/59)... from Hisham from his father [she] said... and the scribe placed 'Saad' on it as well. So his saying 'She said' is explicit that the speaker is not Urwah, but rather a woman, and she is none other than Aisha based on the preceding evidence and because he narrates extensively from her, and she is his maternal aunt. And Allah knows best. 7 - The Hadith of Sahl bin Sa'd who said: 'Whenever the Messenger of Allah (may Allah bless him and grant him peace) addressed the people or taught them, he would not omit this verse: {O you who have believed, fear Allah and speak words of appropriate justice} up to his saying: {he has certainly achieved a great attainment}.'",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 34
  },
  {
    "serial_number": "3204007",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 34,
    "volume_number": 1,
    "text": "Narrated by Samawayh in his 'Fawa'id' as cited in 'Husn al-Tanabbuh fi Tark al-Tashabbuh' by Sheikh Muhammad al-Ghazzi (8/5). 8 - The Hadith of Ibn Shihab al-Zuhri: Ibn Wahb said: Yunus informed me that he asked Ibn Shihab about the Tashahhud of the Messenger of Allah (may Allah bless him and grant him peace) on Friday. Ibn Shihab said: 'Indeed, all praise is due to Allah, we praise Him, we seek His help, we seek His forgiveness, and we seek refuge in Him from the evils of our own selves. Whoever Allah guides, there is none to misguide him, and whoever He leaves astray, there is none to guide him. And I bear witness that there is no deity worthy of worship except Allah, and that Muhammad is His slave and His Messenger; He sent him with the truth as a bringer of good tidings and a warner before the Hour. Whoever obeys Allah and His Messenger has been guided, and whoever disobeys them both has erred. We ask Allah our Lord to make us among those who obey Him and obey His Messenger, follow His pleasure and avoid His anger; for indeed we exist by Him and for Him.' Narrated by Abu Dawud (1/172) and Al-Bayhaqi (3/215). This is a chain...",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 35
  },
  {
    "serial_number": "3204008",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 35,
    "volume_number": 1,
    "text": "whose men are all trustworthy, but it is Mursal (missing the Companion link), so it is therefore weak and not used as proof. And in it is: 'And whoever disobeys them both.' This phrase appeared previously in the third path of Ibn Masud's Hadith, and I explained its weakness there. So it might be said: This Mursal is a witness (supporting evidence) for it. I say: It is not so. Because the Irsal (disconnection) in it is in a place where it is possible that the one who narrated it [to Al-Zuhri] took it from that unknown person who narrated it from Ibn Masud—I mean: It is possible that Al-Zuhri took it from Abu Iyad from Ibn Masud or from whoever narrated it from him, and then he sent it (made it Mursal). With this probability, one does not strengthen the other. So contemplate.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 36
  },
  {
    "serial_number": "3204009",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 36,
    "volume_number": 1,
    "text": "Conclusion... Conclusion: It has become clear to us from the collection of preceding Hadiths that this Sermon (Khutbah) opens all sermons, whether it is a marriage sermon, a Friday sermon, or others. It is not specific to marriage (1) as might be thought. And in some paths of Ibn Masud's Hadith, there is an explicit statement of that as previously mentioned. This is supported by the practice of the Righteous Predecessors (Salaf), for they used to open their books with this Sermon, as done by Imam Abu Ja'far al-Tahawi...",
    "foot_note": "1. 1 Note: As for the Hadith narrated by Isma'il bin Ibrahim from a man from Bani Sulaym who said: I proposed to the Prophet (may Allah bless him and grant him peace) for Umamah bint Abdul-Muttalib, and he married her to me without performing the Tashahhud (Khutbah). It was narrated by Abu Dawud and Al-Bayhaqi; it is weak due to this Isma'il, for he is unknown as in 'Al-Taqrib'. Furthermore, there is confusion (Idtirab) regarding him in it as explained by Al-Bayhaqi and others. Even if it were authentic, it would indicate the permissibility of omitting it sometimes, not the lack of legitimacy absolutely.",
    "book_id": "11175",
    "new_page_number": 37
  },
  {
    "serial_number": "3204010",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 37,
    "volume_number": 1,
    "text": "may Allah have mercy on him, where he said in the introduction of his book 'Mushkil al-Athar': 'And I begin with what the Prophet (may Allah bless him and grant him peace) commanded to begin the need with, from what has been narrated from him via chains of narration which I will mention after this, Allah willing: Indeed all praise is due to Allah...' I say: So he mentioned it in its entirety. And Sheikh al-Islam Abu al-Abbas Ibn Taymiyyah, may Allah have mercy on him, followed this method; he uses it frequently in his works, as is not hidden from anyone who pays attention to them. The investigator Al-Sindi said in his 'Hashiyah on Al-Nasa'i' in explaining his saying in the Hadith: 'And the Tashahhud in need': 'The apparent meaning is the generality of need for marriage and others. This is supported by some narrations. So a person should employ this to seek help through it for fulfilling and completing it. Therefore, Al-Shafi'i said: The Khutbah is a Sunnah at the beginning of all contracts, before sale, marriage, and others. And the 'Need'...",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 38
  },
  {
    "serial_number": "3204011",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 38,
    "volume_number": 1,
    "text": "is a reference to it. It is possible that the intended meaning of 'Need' is marriage, as the Khutbah is customary in it unlike other needs.' And likewise in his 'Hashiyah on Ibn Majah'. I say: This second probability is weak, rather false, due to the establishment of that from the Prophet (may Allah bless him and grant him peace) in other than marriage, as in the story of Dimad in the Hadith of Ibn Abbas and as in the Hadith of Jabir. So be aware. However, the statement regarding the legitimacy of this Sermon in sales and the like, such as renting and similar things, is questionable. This is because it is based on the statement requiring 'offer and acceptance' (Ijab and Qabul) in them, which is not conceded. Rather, it is a newly invented matter, for people from the time of the Prophet (may Allah bless him and grant him peace) until our day have continued to contract in these things without utterance, but rather by action indicating the intent (1). So it is more appropriate that...",
    "foot_note": "1. 1 From the words of Sheikh al-Islam Ibn Taymiyyah in a chapter he dedicated to explaining a rule of great benefit - as he said himself - regarding this issue, which is the offer and acceptance in contracts and in mutual exchange (Mu'atah). In it, he went to the view: That one is not restricted in it to a specific wording; rather, this is an innovation, and that they are valid with any wording and with action indicating the intent. He argued for that with the Qur'an, the Sunnah, and the language. Within the folds of that are benefits and verifications you will not find with others. So see 'Al-Fatawa' 3/267, 274.",
    "book_id": "11175",
    "new_page_number": 39
  },
  {
    "serial_number": "3204012",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 39,
    "volume_number": 1,
    "text": "the Khutbah in them is an innovation and a newly invented matter. His sales (may Allah bless him and grant him peace) and his contracts which appeared in the books of the Purified Sunnah are of such abundance and fame that it suffices against quoting some of them in this haste, and in none of them is there offer and acceptance, let alone the Khutbah in them. I say this with my respect for the Imams and my following of them upon their guidance. Rather, I consider this explicit statement of mine to be following them, because they, may Allah have mercy on them, are the ones who taught us freedom of opinion and frankness in speech even regarding imitating them, for as...",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 40
  },
  {
    "serial_number": "3204013",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 40,
    "volume_number": 1,
    "text": "Imam Malik, may Allah have mercy on him, said: 'There is none among us except that he refutes or is refuted, except the occupant of this grave.' So may Allah reward them with good on our behalf (1). I say: The purpose of compiling this treatise is to spread this Sunnah which people have almost unanimously agreed to abandon. So I draw the attention of the Khatibs (preachers), admonishers, teachers, and others to the necessity of them memorizing it and opening their sermons, articles, and lessons with it. Perhaps Allah the Exalted will achieve their goals through it (2).",
    "foot_note": "1. 1 I have cited their texts regarding that in the introduction of my book 'The Description of the Prophet's Prayer (may Allah bless him and grant him peace)'. What was hoped for from Allah has been achieved, for it has been printed multiple times until now by the Islamic Office, and it has been summarized and translated as well, and to Allah belongs the praise and the favor. 2 And it was understood from the Sheikh – may Allah have mercy on him – that he held the view of the obligation of this Sermon. For that reason, he commented with a word in 'Al-Kitab Al-Nasihah' p. 81, saying, may Allah have mercy on him: 'And it is the Sermon that the Prophet (may Allah bless him and grant him peace) used to teach his companions. It had been neglected =",
    "book_id": "11175",
    "new_page_number": 41
  },
  {
    "serial_number": "3204014",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 41,
    "volume_number": 1,
    "text": "------------------------------------------------------------------------",
    "foot_note": "1. = and in some years some Imams revived it, such as Imam Al-Tahawi, Sheikh al-Islam Ibn Taymiyyah, Ibn al-Qayyim al-Jawziyyah – may Allah have mercy on them – and others. Then it was neglected in the later centuries. So our turn came – and praise be to Allah – to revive it, so the well-known treatise was written on it – 'Khutbat al-Hajah' – and Allah benefited whom He willed of the lovers of the Sunnah with it, and the practice of it spread in the forewords of books and treatises and in Friday sermons and others – so to Allah belongs the favor. It is strange that some virtuous people stand in its way, writing a word in his beneficial book 'Tashih al-Du'a' p. 454, saying in summary: 'In the sermon are innovations, among them: The commitment to opening the Friday sermon with the Sermon of Need narrated in the Hadith of Ibn Masud – may Allah be pleased with him. The wonder is that this Hadith of Ibn Masud was narrated by the authors of the 'Sunan' categorizing it in the Book of 'Marriage', except Al-Nasa'i, for he categorized it – also – in 'Prayers'. Whoever traces the guidance of the Prophet (may Allah bless him and grant him peace) does not see in it a commitment to opening his sermons (may Allah bless him and grant him peace) with that... And we did not see in his action (may Allah bless him and grant him peace) nor in the regular guidance of his companions – may Allah be pleased with them – a commitment to this wording in their sermons and the opening of their affairs. And these authors from the scholars of Islam, you do not see them doing so, and among them is Sheikh al-Islam Ibn Taymiyyah – may Allah have mercy on him – for in =",
    "book_id": "11175",
    "new_page_number": 42
  },
  {
    "serial_number": "3204015",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 42,
    "volume_number": 1,
    "text": "----------------------------------------------------------------------------",
    "foot_note": "1. = his books and fatwas, he opens with it sometimes and with other than it at other times...'. So I say: – and with Allah is success –: First: It is not Fard (obligatory) such that it cannot be left; rather, the opposite might be the most correct, which is leaving it occasionally so no one imagines its obligation, as in the Hadith of the Night Prayer of Ramadan: 'Indeed I feared it would be prescribed upon you.' Indicating that we are well aware of that – praise be to Allah – is: That I did not open a number of my works and investigations with this Sermon, such as the book 'Al-Iman' by Ibn Abi Shaybah, 'Hijab al-Mar'ah al-Muslimah' First Edition, 'Tamam al-Minnah' Second Edition, 'Adab al-Zafaf' Second Edition, and among the latest of that is my introduction to the new edition of the first volume of 'Al-Silsilah Al-Sahihah' and many others. Second: If commitment to it is an innovation, then what is the ruling on neglecting it absolutely?! For I have not seen him open a book of his with this blessed Sermon, expounding on it with sermons he composes himself! Is this not from the chapter of: {Do you exchange that which is lower for that which is better?}?! Third: The virtuous one referred to, in this place of the footnote of his book, attributed to the Fatawa of Sheikh al-Islam Ibn Taymiyyah 18/286 – 287, pointing to it by saying: 'Important'! =",
    "book_id": "11175",
    "new_page_number": 43
  },
  {
    "serial_number": "3204016",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 43,
    "volume_number": 1,
    "text": "_________ = So I say: Yes, it is important. And among the most important of it is his saying, may Allah have mercy on him: 'Indeed the Hadith of Ibn Masud did not specify marriage; rather, it is a sermon for every need in the address of servants to one another.' So what is the value of the wonder of the mentioned virtuous person that the authors of the Sunan narrated the Sermon of Need in the Book of Marriage?! The same applies to his saying at the end of his research: 'By this report, you know the Fiqh (understanding) of the authors of the 'Sunan' – may Allah Almighty have mercy on them – in classifying the Sermon of Need in the Book of Marriage and the scholars' affirmation of its legitimacy within the marriage contract!!' And from the great decree of the Lord, Glory be to Him, is that the Sermon of Need appears in the volume of Al-Fatawa to which the mentioned virtuous one attributed! In the introduction of two treatises by Sheikh al-Islam, may Allah have mercy on him, 18/76, 210, unlike that place he pointed to, urging towards it, in which he spoke in detail about this blessed Prophetic Sermon. This is in addition to two volumes from it or his other books. Similar is Imam Ibn al-Qayyim al-Jawziyyah, may Allah have mercy on him. So why were these two Imams not a role model for this virtuous one so he could emulate them – even once – and open a book of his with the Sermon of Need?! Fourth: What confirms the generality of its legitimacy before every righteous deed is the Hadith of Ibn =",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 44
  },
  {
    "serial_number": "3204017",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 44,
    "volume_number": 1,
    "text": "_________ = Abbas which Muslim narrated in the story of Dimad's arrival in Mecca. In it, the Prophet (may Allah bless him and grant him peace) mentioned this blessed Sermon to him, and Dimad converted to Islam after hearing it, and there was no marriage or marriage contract there! Fifth: It is as if Sheikh al-Islam – may Allah have mercy on him – refers in some of his speech to the occurrence of negligence in this Sermon as I pointed out. He said, may Allah have mercy on him: 'For this reason, I deemed it desirable and practiced in addressing people with knowledge generally and specifically, from teaching the Book and the Sunnah and Fiqh in that, and admonishing people and debating with them, that one opens with this legislative Prophetic Sermon. And what the Sheikhs of our time whom we met and took from, and others, were upon was opening gatherings of Tafsir or Fiqh in the Mosques and Schools and elsewhere with another sermon...'. Until he said, may Allah have mercy on him: 'Just as I saw people delivering sermons for marriage with other than the legislated Sermon, and every people have a type unlike the others...'. I say: So contemplate his comparison, may Allah have mercy on him, between the Sheikhs opening their gatherings with other than the legislative Sermon of Need, and likewise what the people do who deliver sermons for marriage with other than the legislated Sermon; the truth will appear to you and the right way will be revealed before you without doubt... And praise be to Allah, Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 45
  },
  {
    "serial_number": "3204018",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "The Sermon of Need That the Messenger of Allah (may Allah bless him and grant him peace) Used to Teach His Companions",
    "edition": "First Edition 1421 AH - 2000 AD",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 45,
    "volume_number": 1,
    "text": "And the Prophet (may Allah bless him and grant him peace) said: 'Whoever introduces a good practice (Sunnah Hasanah) in Islam, and it is acted upon after him, there is written for him the like of the reward of those who act upon it, without that decreasing anything from their rewards. And whoever introduces a bad practice (Sunnah Sayyi'ah) in Islam, and it is acted upon after him, there is written against him the like of the burden of those who act upon it, without that decreasing anything from their burdens.' Narrated by Muslim in his 'Sahih' 8/61 from the Hadith of Jarir bin Abdullah, may Allah be pleased with him. Glory be to You, O Allah, and with Your praise. I bear witness that there is no deity worthy of worship except You. I seek Your forgiveness and I repent to You. Abu Abdur-Rahman Muhammad Nasir al-Din al-Albani.",
    "foot_note": "None",
    "book_id": "11175",
    "new_page_number": 46
  }
]