[
  {
    "text": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation\nAuthor: عرفة بن طنطاوي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1532\nbook_title: صَحِيِحُ المَنْقُوُلِ المُوَافِقُ لِصَرِيِحِ المَعْقُوُلِ فِيِ مُنَاقَشَةِ ثَلَاثَةِ تَفَاسِيِرَ رُتِّبَتْ عَلى تَرْتِيِبِ النُّزُوُلِ\nbook_link: https://shamela.ws/book/944\nbook_id: 944\nauthor_name: عرفة بن طنطاوي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3169\nauthor_ID: 3169\neditor: Null\npublisher: مجلة البحوث الإسلامية العدد ٧٣، ربيع الأول ١٤٤٣ هـ مجلة البحوث الإسلامية: مصرية محكّمة، بدأت في ١٤٣٦ هـ، تصدر شهريا، ويرأس تحريرها أ د عبد الفتاح محمود إدريس، أستاذ بقسم الفقه المقارن بكلية الشريعة والقانون جامعة الأزهر\nedition: Null\npages: 63\nvolumes: Null\npagination: [ترقيم صفحات البحث موافق للمجلة. ورقم الجزء هو رقم العدد]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1104244",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Quranic Sciences and Principles of Exegesis\nBook: The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation (Sahih al-Manqul al-Muwafiq li-Sarih al-Ma'qul...)\nAuthor: Arafa bin Tantawi\nResearch published in: Journal of Islamic Research (Majallat al-Buhuth al-Islamiyyah), Issue 73, Rabi' al-Awwal 1443 AH\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, issued monthly. Its editor-in-chief is Prof. Dr. Abdul Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\n\nBook: The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation\nAuthor: Arafa bin Tantawi\nResearch published in: Journal of Islamic Research, Issue 73, Rabi' al-Awwal 1443 AH\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, issued monthly. Editor-in-Chief: Prof. Dr. Abdul Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\n\nAuthor: Arafa bin Tantawi\nResearch published in: Journal of Islamic Research, Issue 73, Rabi' al-Awwal 1443 AH\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, issued monthly. Editor-in-Chief: Prof. Dr. Abdul Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\n\nResearch published in: Journal of Islamic Research, Issue 73, Rabi' al-Awwal 1443 AH\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, issued monthly. Editor-in-Chief: Prof. Dr. Abdul Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\n\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, issued monthly. Editor-in-Chief: Prof. Dr. Abdul Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\n\n\n[Numbering of the research pages corresponds to the journal. The part number is the issue number]",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 3
  },
  {
    "serial_number": "1104245",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Research Abstract\nThis is a research titled \"The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation.\"\nThe researcher addressed it in two chapters:\nAs for the first chapter: The researcher discussed the topic of the arrangement of verses within the Surahs and provided evidence that it is a divinely ordained arrangement (Tawqifi). Then he discussed the topic of the arrangement of the Surahs and the schools of thought of scholars regarding it, then provided evidence that it is divinely ordained. Then he mentioned the beginning and source of opposing and contradicting this arrangement, then he touched upon mentioning the most prominent callers for it among the Orientalists and those contemporaries who were influenced by them - as well.\nAs for the second chapter: The researcher presented the three commentaries (Tafsir) that violated the Mushaf arrangement. Then he addressed the definition of each commentary, its author, his methodology, his creed, his motives for violating this arrangement, and the reasons for his inclination towards the chronological order of revelation. Then he discussed those motives and refuted them. Then he showed that the initiators of this door did not achieve their goals, then he concluded by stating the obligation of respecting the Mushaf arrangement upon which the Ummah agreed and received with acceptance.\n\nIntroduction\nPraise be to Allah Who revealed His glorious Book in the best style and dazzled hearts with the beauty of its methods and the eloquence of its composition. He revealed it as clear verses, separated it into Surahs and verses, arranged it with His profound wisdom in the best arrangement, and organized it in the greatest system with the most eloquent wording and most profound composition. And may peace and blessings be upon him to whom it was revealed to warn with it and as a reminder upon his noble heart, so He removed constriction from him and expanded his chest, and upon his family and companions, emigrants and helpers... (1).\nTo proceed:\n\nPreamble [*]\nThis is an important preamble presented by the researcher before this research, which he has titled \"The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation.\" In it, the researcher pauses at important points regarding a number of characteristics and virtues of the Great Quran related to our research, as follows:\n\nFirst: The Quran is the Eternal, Everlasting Miracle\nThe Holy Quran is the eternal miracle upon which the prophethood and message of the Seal of Prophets and Messengers, our Prophet Muhammad, peace and blessings be upon him, was built. Allah revealed it to him as His final Book and made it a miracle and proof of the truthfulness of his prophethood and message.\nThe confirmation of that is what is proven in the two Sahihs from the hadith of Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"There is no prophet among the prophets but was given signs the like of which human beings believed in. And indeed, what I was given was a revelation that Allah revealed to me, so I hope that I will be the one with the most followers among them on the Day of Resurrection.\" (1)\nAnd among the speech of Allah Almighty: The Great Quran, which is the clear Book of Allah, His strong rope, His straight path, and the revelation of the Lord of the Worlds. The Trustworthy Spirit brought it down upon the heart of the Master of Messengers, in a clear Arabic tongue. Revealed, not created; from Him it began and to Him it returns. It consists of decisive Surahs, clear verses, letters, and words. Whoever reads it and articulates it correctly has ten good deeds for every letter. It has a beginning and an end, parts and portions. It is recited by tongues, preserved in chests (hearts), heard by ears, written in Mushafs (copies). In it are clear and ambiguous [verses], abrogating and abrogated, specific and general, command and prohibition. (Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a Wise, Praiseworthy [One]) (Fussilat: 42). (2)\nSo the Holy Quran—which is the Speech of Allah, His revelation, and His sending down—is revealed, not created, miraculous in its organization. Nothing of the speech of the created beings resembles it, nor is anyone of the created beings capable of its like. \"That which is in the Mushafs of the Muslims; nothing has been missed from it, nor has it been lost by the forgetfulness of a person, nor the loss of a page, nor the death of a reciter, nor the concealment of a concealer. Nothing has been distorted from it, nor has a letter been added to it, nor has a letter been decreased from it. All of it is truth from Allah, even if the enemies of the Messengers (3) from the disbelievers, polytheists, atheists, and those who followed their path from the philosophers and people of desires denied it.\" (4)\n\nSecond: The Quran is the Miracle that Encompassed the Two Heavy Ones (Jinn and Mankind)\nThis miracle - the Quran - is a general miracle by which Allah challenged [creation], and the challenge encompassed both Jinn and Mankind. It is a miracle remaining as long as time remains, as our Lord said: (Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\") (Al-Isra: 88).\nThis is a command from Allah to His Prophet, peace and blessings be upon him, to declare this challenge so that the Two Heavy Ones hear it, because the challenge has encompassed them all. He informed that even if all humans and Jinn gathered and agreed to produce the like of what He revealed to His Messenger, they would not be able to do so and would not manage it, even if they cooperated, helped, and supported one another, for it is a matter that cannot be done. (5)\nThe meaning of 'gathering' (Ijtima'): Agreement and unity of opinion, i.e., if the minds of humans and Jinn concurred that each one of them would bring the like of this Quran, they would not bring its like. It is a gathering of opinion, not a gathering of cooperation [initially], as indicated by the emphasis in His saying afterwards: \"even if they were to each other assistants,\" - and this gathering is - a gathering of mutual support on one work and one purpose. (6)\nThe meaning intended here is that if their opinions agreed and their efforts combined together to bring the like of this Quran in its eloquence, rhetoric, beauty of style, splendor of expression, quality of casting, beauty of organization, firmness of meanings, perfection of purposes, and depth of aims; they would never be able to do that and would not manage to reach it, even if they united, gathered, and cooperated on that, supporting and aiding one another.\nAnd His saying: (even if they were to each other assistants) means: They would not bring its like even if humans and Jinn cooperated and supported each other on that, so how about if they attempted that separately?! (7)\nAllah challenged them to bring its like, or ten surahs like it fabricated, just as He challenged them to bring the shortest surah from it - as well - (8), so they were incapable of all that despite the availability of motives for them. How can a creature made of dust be capable of his speech being like the speech of the Lord of the Worlds? Or how can the deficient, poor in all aspects, serve to bring speech like the speech of the Perfect One, to whom belongs absolute perfection and vast richness from all aspects? This is not within possibility, nor within human capacity. Anyone with the slightest taste and knowledge of types of speech, if he weighs this Great Quran against others from the speech of the eloquent, the great difference will appear to him. (9)\n\nThird: The Quran is the Miracle Whose Hearing is Considered a Proof\nThe challenge with this proof and its binding nature remains from its first revelation until the Quran is lifted at the end of time; indeed, the challenge with it remains - as well - until the Day of Resurrection. Allah Almighty confirmed the establishment of the proof by the Quran against the polytheists in His saying: (And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know) (At-Tawbah: 6).\nWere it not that hearing it is a proof against him, his affair would not depend on hearing it, and it would not be a proof unless it is miraculous. (10)\nThe particle (In - If) was used, which is typically for a condition of rare occurrence; to alert that this is a hypothetical condition; so that the polytheists do not claim that they were not able to meet the Prophet, peace and blessings be upon him, and take it as an excuse to persist in polytheism if the Muslims fought them. (11)\n\nFourth: The Quran - the Miracle - is the Speech of Allah, Revealed, Not Created\nHis saying: (so that he may hear the words of Allah) contains an explicit argument for the doctrine of Ahl al-Sunnah wal-Jama'ah, who say that (the Quran is the Speech of Allah, not created); because He, the Exalted, is the One speaking it, and He attributed it to Himself as an attribution of an attribute to its described subject, and [it proves] the invalidity of the doctrine of the Mu'tazila and those who adopted their saying: that the Quran is created. (12)\nAnd the statement: (The Quran is the Speech of Allah, not created) contains an explicit text that this which we read and recite is the very Speech of Allah. The voice is the voice of the reader, and the speech is the speech of the Creator; because Allah declared that this polytheist seeker of protection hears the Speech of Allah, recited to him by the Prophet of Allah, peace and blessings be upon him. So this which is preserved in the chests, read by the tongues, written in the Mushafs; is the Speech of Allah, the Majestic and Exalted, in its meanings and words. (13)\nThe correct view which the predecessors (Salaf) of the nation are upon, such as Imam Ahmad and Al-Bukhari the author of the Sahih in the book (Creation of the Actions of Servants), and others, and all the Imams before them and after them - following the established texts and the consensus of the predecessors of the nation - is that the entire Quran is the Speech of Allah, its letters and its meanings; none of that is the speech of another... and that Allah speaks with a voice as came in the authentic Hadiths. (14)\nImam Al-Tahawi (d. 321 AH), may Allah have mercy on him, said: \"Indeed the Quran is the Speech of Allah. From Him it began without modality as speech, and He sent it down to His Messenger as revelation. The believers believed him regarding that as truth, and they became certain that it is the Speech of Allah Almighty in reality, not created like the speech of creation. So whoever hears it and claims it is the speech of a human has disbelieved. Allah has condemned him, faulted him, and threatened him with Saqar (Hellfire) where He said: (I will drive him into Saqar) (Al-Muddaththir: 26). When Allah threatened with Saqar him who said (This is not but the word of a human being) (Al-Muddaththir: 25), we knew and became certain that it is the statement of the Creator of humans and it does not resemble the speech of humans.\" (15)\nIbn Abi Hatim (d. 327 AH), may Allah have mercy on him, said: \"I asked my father and Abu Zur'ah about the doctrines of Ahl al-Sunnah regarding the fundamentals of religion, and what they found the scholars upon in all regions, and what they believe regarding that? They said: We found the scholars in all regions: Hijaz, Iraq, Sham, and Yemen, and their doctrine was: Faith is speech and action, it increases and decreases, and the Quran is the Speech of Allah, uncreated from all its aspects.\" (16)\n\nFifth: The Quran is the Speech of Allah - the Miracle - Allah Spoke it with Letter and Sound\nThe Quran, according to Ahl al-Sunnah, is the Speech of Allah Almighty in reality - letters and meanings - and that He, Glory be to Him, spoke it with letter and sound, and Gabriel heard it. The Salaf spoke about letter and sound and mentioned its evidences, and spoke on the ruling of whoever denies it. But when there appeared - among the people of innovation - those who deny the letter and sound to deny the Speech of Allah, the Salaf clarified that the Speech of Allah includes letters and meanings, and that He, Exalted is He, speaks with a sound, as they describe Him with what was reported of Speaking (Taklim), Calling out (Munadah), and Whispering (Munajah). (17)\nAbu Abdullah Muhammad bin Ismail Al-Bukhari (d. 256 AH), may Allah have mercy on him, said: I heard Ubaidullah bin Saeed say: I heard Yahya bin Saeed say: I have always heard our companions say: The actions of the servants are created. Abu Abdullah said: Their movements, their voices, their earning, and their writing are created. As for the Quran that is recited, clarified, established in the Mushaf, written, recorded, memorized in the hearts, it is the Speech of Allah, not created. Allah Almighty said: (Rather, the Qur'an is distinct verses [preserved] within the breasts of those who have been given knowledge) (Al-Ankabut: from verse 48). And Ishaq bin Ibrahim said: As for the vessels (hearts/books), who doubts in their creation?\" (18)\nSheikh al-Islam Ibn Taymiyyah (d. 728 AH), may Allah have mercy on him, said: \"If we read the Quran, we only read it with our created voices which do not resemble the voice of the Lord. The Quran which we read is the Speech of Allah, conveyed from Him not heard [directly] from Him. We only read it with our movements and voices; the speech is the speech of the Creator, and the voice is the voice of the reader, as indicated by the Book and the Sunnah along with reason. Allah Almighty said: (And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah then deliver him to his place of safety) (At-Tawbah: 6). And the Prophet, peace be upon him, said: (Adorn the Quran with your voices).\" (19)\nThe scholar Ibn al-Qayyim (d. 751 AH), may Allah have mercy on him, said in \"Al-Kafiyah Al-Shafiyah\":\n\"And Allah my Lord has never ceased speaking ... And His speech is heard by ears.\nWith truth and justice His words were perfected ... In command and information without decrease.\" (20)\nAnd Sheikh Hafiz Hakami (d. 1377 AH), may Allah have mercy on him, said:\n\"And the saying regarding His detailed Book ... Is that it is His revelation sent down.\nUpon the Chosen Messenger, best of creation ... It is not created nor fabricated.\nIt is preserved by the heart and by the tongue ... It is recited just as it is heard by ears.\nLikewise by eyes it is looked at ... And by hands its script is written.\nAnd everything possessing this (writing/reciting) is created in reality ... Except the Speech of the Creator of Creation.\nExalted are the attributes of our Lord the Merciful ... From being described with creation and temporal origination.\nSo the voice and melodies are the voice of the reader ... But the Recited is the Saying of the Creator.\nWhat He said accepts no alteration ... No, and none is more truthful than Him in speech.\" (21)\n\nSixth: The Quran - the Miracle - is the Book that Dominated Over the Books Revealed Before It\nAllah made the Quran dominant over previous books and a judge over them as He, Glory be to Him, said: (And We have revealed to you, [O Muhammad], the Book in truth, confirming that which preceded it of the Scripture and as a criterion [Muhayminan] over it) (Al-Ma'idah: from verse 48).\nAnd (Al-Muhaymin): The Trustee (Al-Amin). The Quran is a trustee over every book before it. (22)\n(Wa Muhayminan): meaning: A judge over the books before it. (23)\n(Wa Muhayminan 'alayh): meaning: Confirming it. Everything Allah revealed of Torah, Gospel, or Psalms, the Quran confirms that. And everything mentioned by Allah in the Quran confirms them and confirms that what occurred from them is truth. (24).\nThe Quran was dominant over the books because it is the Book that never becomes abrogated at all, and no alteration or distortion can approach it, according to the Almighty's saying: (Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian) (Al-Hijr: 9). (25)\n- And - Allah made this Great Book which He revealed as the last of books and their seal, most comprehensive, greatest, and most perfect; as He gathered in it the beauties of the perfections of what was before it which are not in others. Therefore, He made it a witness, a trustee, and a judge over all of them. And He, the Exalted, guaranteed its preservation by His Noble Self, saying: (Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian) (Al-Hijr: 9). So it is preserved by the preservation of Allah Almighty until the Hour is established, a witness over these books, clarifying what was distorted of them, and ruling by what Allah approved and commanded of their laws, and abrogating what Allah abrogated of them, and it is a trustee over them in all that. (26)\nAhl al-Sunnah wal-Jama'ah acknowledge that the Holy Quran is the Dominant Book and Judge over all previous revealed books, and the Preserver of every book before it; and a witness over all those books that they are revelation sent down from Allah Almighty which He revealed to His messengers, and that it confirms what is in them of truth, negating what falsehood was attached to them, and that it is a ruler over them by abrogation or confirmation. So whatever of them agrees with it is the Truth which Allah revealed, and whatever opposes it is of the falsehood attributed to them. Thus, the Quran has dominance over all those revealed books from every aspect.\n- And - The Salaf are all agreed that the Quran is the Dominant (Muhaymin), the Trustee, the Witness over the books before it. (27)\n\nSeventh: The Quran - the Miracle - is a Book Whose Verses are Perfected\nThe Holy Quran is a book whose verses were perfected and then detailed as our Lord said: (Alif, Lam, Ra. [This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted) (Hud: 1). (Fussilat) means: Clarified. The origin of (Fasl) indicates distinguishing one thing from another, and separating it from it. (28).\nAnd (Kitabun Uhkimat Ayatuhu thumma Fussilat): meaning: This Quran, Allah perfected its verses so there is no defect in them, nor falsehood, nor contradiction, then they were explained with truthful news and just rulings of commands and prohibitions. (29)\nWhat do you say about the virtue of a book by which Allah saved a nation from ignorant ignorance and blind misguidance? Their habit was looting and plundering, their worshipped objects were idols and stones, their custom was inheriting enmities and grudges, not knowing a trace of truth. It was given what it found its fathers upon, and what its ancestors approved, of deviant opinions, invented sects, and innovated religions. So Allah revealed to them this Book, saved them from it by it, and pulled them out by it from its mud.\n\nEighth: The Quran - the Miracle - is a Book with Virtues Too Many to Count\n- So - what do you say about the virtue of a book with which Allah sealed the Books, and revealed to a Prophet with whom He sealed the Prophets, and with a religion with which He sealed religions. (30)\nWhat do you say about the virtue of a book by which cities were conquered, knees knelt before it, scholars drank from its fountain, literati drank from its watering place, sights humbled to its dominance, hearts submitted to it, and worshippers, bowers, and prostrators stood reciting it.\nThat is the Holy Quran: The totality of the Sharia, the pillar of the religion, the fountain of wisdom, the sign of the Message, and the light of eyes and insights. There is no path to Allah but it, no salvation without it, and no holding onto anything that contradicts it.\" (31)\n\nNinth: The Quran - the Miracle - has a Descending Order and a Mushaf Order for its Verses and Surahs which no one has the right to interfere with in any case\n\nThe First Arrangement: Arrangement of Verses in Surahs\nOne of the most prominent aspects of the miraculous nature of the Quran is the arrangement of its verses in its Surahs in one system, as if they were all revealed consecutively and arranged in this order which baffles human minds in the strength of its style, the beauty of casting its phrases, the goodness of its organization, and the interconnectedness of its verses as if they were pearls following one another. As if it is one piece in one poem revealed in this pattern, consecutively. Even though the chronological order of revelation of verses is different from this sequence and connection—verses might be revealed in a Surah and be late in their arrangement compared to other verses in the same Surah, and those verses might have been revealed after them—yet, you can never feel any defect or lack of connection in the thematic unity between the verses of a single Surah, or find in yourself the slightest doubt that they were revealed in this pattern of consecutive verses as if they were revealed in this Mushaf order.\n\nThe Second Arrangement: Arrangement of Quranic Surahs\nSay the same regarding the Mushaf order of the Quran's Surahs. For the Mushaf order, according to its placement in the Mushafs spread among Muslims in the East and West of the world, is the arrangement settled upon by the Uthmani Mushafs upon which the Companions, may Allah be pleased with them all, agreed, and upon which the Predecessors (Salaf) and Successors (Khalaf) agreed and the Ummah received with acceptance. It is, moreover, completely in agreement with the Final Review (Al-Ardah Al-Akhirah) which is in agreement with the Quran established in the Preserved Tablet with the Lord of Glory in a hidden, preserved Book.\n\nTenth: Conclusion and Statement of the Witness from this Preamble\nAfter explaining those great and majestic characteristics of the Quran—that it is the eternal remaining miracle indicating the truth of the prophethood and message of the Seal of Messengers, peace be upon him; that it is the miracle whose hearing is considered proof; that it is the Speech of Allah; that it is revealed and not created; that Allah Almighty spoke it with letter and sound; that it is a miracle by which Allah challenged the Two Heavy Ones; that it dominates over the books revealed before it and is a ruler and witness over them; that the arrangement of its verses came in the greatest form of pattern and wondrous connection as if they were revealed in this pattern; and that the Mushaf arrangement of Surahs and verses has been established in practice and consensus since Uthman burned the [other] Mushafs and united them on the Imam [Mushaf].\n\nThree individuals have dared to violate the Mushaf arrangement by writing three commentaries according to the order of revelation. The researcher in this research discusses the authors of those three commentaries whose compilers violated the consensus of the Companions, may Allah be pleased with them all, and violated the consensus of the entire Ummah - as well -, by classifying those commentaries and arranging them according to the chronological order of the Surahs, leaving the Mushaf arrangement and throwing it behind their backs. Although they violated the consensus of the Ummah, they agreed in that with the enemies of the religion from the clique of Orientalists.\nThis study came to discuss the three individuals regarding their deed in which they dared upon this majestic work, opening upon the Ummah a great door of evil and a dangerous breach whose crack must be repaired and whose gap must be filled to block other great pretexts that might open the door to daring to tamper with the arrangement of verses just as it opened the door to violating the Mushaf arrangement of the Quran's Surahs agreed upon before, and upon which is the practice of the first and last of this shown-mercy Ummah.\nIndeed, \"the most important thing that the people of Allah's religion must uncover, and the first thing that must be researched, is what was a foundation for the origin of their religion, a pillar and system for the base of their monotheism, a proof of the truth of their Prophet, peace be upon him, and a confirmation and argument for his miracle, especially since ignorance has extended its canopy, hypocrisy is severe, and has taken over the horizons.\" (32)\nTherefore, the motive for discussing these commentaries and refuting the motives of their compilers with argument, clarification, clear evidence, and shining proof, was victory for the Quran, and pleasing our Lord the Merciful.",
    "foot_note": "1. See 'Asrar Tartib al-Quran' by Al-Suyuti (p. 65). Secrets of the Arrangement of the Quran, Author: Abdul Rahman bin Abi Bakr, Jalal al-Din al-Suyuti (Died: 911 AH), Publisher: Dar Al-Fadila for Publishing and Distribution, Number of Parts: 1.\n\n1. Narrated by Muslim, Hadith (152), and narrated by Al-Bukhari in \"Book of the Virtues of the Quran\", \"Chapter: How Revelation Descended and the First of What Descended\", Hadith (4981).\n2. Lum'at al-I'tiqad: (p. 22 - 28).\n3. Shu'ab al-Iman by Al-Bayhaqi (1/326).\n4. See: Sharh al-Aqidah al-Tahawiyyah by Ibn Abi al-Izz (333). [*] (Shamela Comment): This preamble is not in the printed version of the journal, and it is established in the original research sent to us by the author, may Allah preserve him.\n\n5. Tafsir Ibn Kathir: (5/117).\n6. Tafsir Ibn Ashur: (15/203).\n7. See: (Tafsir Ibn Jarir) (15/75), (Tafsir Al-Qurtubi) (10/327), (Tafsir Ibn Kathir) (5/117), (Tafsir Al-Tahir bin Ashur) (15/203).\n8. Ponder the verses of challenge in the numbers of verses of the following Surahs: (Al-Baqarah: 23), (Yunus: 38), (Hud: 13), (At-Tur: 34).\n9. Tafsir Ibn Sa'di: (1/46).\n\n10. I'jaz al-Quran (p. 28) by Al-Baqillani.\n11. Tafsir Al-Tahir bin Ashur: (10/117).\n\n12. See: (Tafsir Ibn Sa'di) (p. 329).\n13. See: (Al-Adhb Al-Namir) by Al-Shinqiti (5/280). Al-Adhb Al-Namir min Majalis Al-Shinqiti fi Al-Tafsir, Author: Muhammad Al-Amin bin Muhammad Al-Mukhtar bin Abdul Qadir Al-Jakni Al-Shinqiti (Died: 1393 AH), Editor: Khalid bin Uthman Al-Sabt, Supervision: Bakr bin Abdullah Abu Zaid, Publisher: Dar Alam Al-Fawa'id, Mecca, Edition: Second, 1426 AH, Parts: 5.\n14. Majmu' al-Fatawa, by Sheikh al-Islam Ibn Taymiyyah: (12/243 - 244).\n15. Sharh al-Aqidah al-Tahawiyyah: (p. 179).\n16. Narrated by Ibn Jarir Al-Tabari in \"Al-Sunnah\": (1/176) with a Sahih chain, see: Sharh Usul I'tiqad Ahl al-Sunnah wal-Jama'ah by Abu al-Qasim al-Lalaka'i: (1/198).\n\n17. Previous reference: (6/518).\n18. See: Khalq Af'al al-Ibad: (2/70).\n19. Authenticated by Al-Albani, Silsilat al-Ahadith al-Sahihah (2/270), see its extraction in Al-Badr Al-Munir (9/637). See: Majmu' al-Fatawa by Ibn Taymiyyah: (12/98), and same source: (12/53).\n20. From \"Al-Kafiyah Al-Shafiyah\": (Verses: 556 - 557).\n21. See: The poem Sullam al-Wusul ila Ilm al-Usul fi Ilm al-Tawhid, by Hafiz Ahmad Hakami, corrected copy from: Jannat Center for Studies, (Verses from: 52 - 59)\n\n22. Tafsir Al-Tabari: Vol 4 (6/345).\n23. Tafsir Ibn Kathir: (2/92).\n24. Tafsir Al-Tabari: Vol 4 (6/346).\n25. Al-Tafsir Al-Kabir by Fakhr Al-Razi: (12/11).\n26. See: Al-Masa'il Al-Aqadiyyah allati haka fiha Ibn Taymiyyah Al-Ijma', by \"Group of Authors\": (p. 748).\n27. Majmu' al-Fatawa: (17/43).\n\n28. See: Maqayis al-Lugha by Ibn Faris (4/505), Al-Basit by Al-Wahidi (11/343), Tadhkirat al-Arib by Ibn al-Jawzi (p. 339), Al-Kulliyyat by Al-Kafawi (p. 700).\n29. See: Tafsir Al-Tabari: (12/308, 310), Ma'ani al-Quran by Al-Nahhas (3/327, 328), Tafsir Ibn Atiyyah (3/148), Tafsir Al-Qurtubi (9/2, 3), Majmu' al-Fatawa by Ibn Taymiyyah (15/106), (Bayan Talbis al-Jahmiyyah) by Ibn Taymiyyah (8/337), Tafsir Ibn Kathir (4/303), Tafsir Ibn Sa'di (p. 376).\n\n30. The phrase \"Heavenly Religions\" should be replaced by the word \"Heavenly Laws\" (Shara'i), because Religion is one and does not multiply as our Lord said: (Indeed, the religion in the sight of Allah is Islam...) (Al Imran: from verse 19). And Allah Almighty said: (Say, \"We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Descendants and what was given to Moses and Jesus and what was given to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [submitting] to Him.\") (Al-Baqarah: 136). And Allah described Abraham that he (was a Haneef, a Muslim, and he was not of the polytheists). (Al Imran: 67). Perhaps it was a slip of the pen from Imam Al-Shatibi, may Allah have mercy on him. The Researcher.\n31. Al-Muwafaqat by Al-Shatibi (3/346).\n\nNone\n\n32. I'jaz al-Quran, by Al-Baqillani: (p. 3 - 4), investigation by Ahmad Saqr, Dar Al-Ma'arif Egypt, Fifth Edition.",
    "book_id": "944",
    "new_page_number": 4
  },
  {
    "serial_number": "1104256",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Research Plan\nThe researcher included in his research a research plan consisting of two chapters, and under each chapter falls a number of sections (Mabahith), and under each section falls a number of requirements (Matalib). He clarified in it the following:\nFirst: The importance of the research topic.\nSecond: The most important and prominent previous studies.\nThird: Reasons and motives for choosing the research topic.\nFourth: The research problem and its objectives.\nFifth: Research methodology.\nSixth: Conclusion of the research, and stating the most important results reached by that brief study.\nSeventh: Collection of indexes.\n\nThe research plan consists of two chapters as follows:\n\nChapter One: Divine Ordainment of the Mushaf Arrangement for Verses and Surahs\nIt includes six sections:\nSection One: Clarifying that the arrangement of verses in Surahs is divinely ordained (Tawqifi).\nIt has two requirements:\nThe Mushaf arrangement includes two matters:\nRequirement One: The First Matter: Arrangement of verses in Surahs.\nRequirement Two: As for the Second Matter: It is the arrangement of Surahs according to the Mushaf arrangement.\n\nSection Two: Of the clearest proofs that the arrangement of verses in Surahs is divinely ordained is the revelation of some Surahs all at once.\nIt has two requirements:\nRequirement One: Mentioning a number of Surahs that were revealed all at once.\nRequirement Two: Summary of mentioning Surahs that were revealed all at once.\n\nSection Three: Schools of thought of scholars and their disagreement on the arrangement of Surahs.\nIt has three requirements:\nRequirement One: The First School: That the arrangement of Surahs is a matter of Ijtihad (effort) by the Companions.\nRequirement Two: The Second School: That the arrangement of Surahs is a matter of Divine Ordainment (Tawqifi) from the Prophet, peace be upon him.\nRequirement Three: The Third School: That the arrangement of most Surahs is a matter of Divine Ordainment from the Prophet, peace be upon him, and that the arrangement of some Surahs was by Ijtihad from the Companions.\n\nSection Four: Prominent sayings of scholars who say that the arrangement of the Holy Quran's Surahs was a divinely ordained arrangement.\nIt has two requirements:\nRequirement One: Mentioning a number of sayings of early scholars.\nRequirement Two: Mentioning a number of sayings of contemporary scholars.\n\nSection Five: Prominent evidences used by some scholars for the divine ordainment of the Mushaf Arrangement.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 5
  },
  {
    "serial_number": "1104257",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "It has four requirements:\nRequirement One: The First Evidence: Consensus of the Companions - may Allah be pleased with them - on the arrangement of Surahs in the Uthmani Mushaf.\nRequirement Two: The Second Evidence: The partitioning (Tahzib) of the Quran by the Companions - may Allah be pleased with them.\nRequirement Three: The Third Evidence: The ordinal organization of some Surahs similar in their opening.\nRequirement Four: Summary of the sayings and evidences of scholars who say that the arrangement of Surahs is divinely ordained.\n\nSection Six: The beginning of opposing and contradicting the Mushaf arrangement with the chronological arrangement and clarifying its source.\nIt has three requirements:\nRequirement One: The first to oppose and contradict the Mushaf arrangement with the chronological arrangement.\nRequirement Two: The most prominent Orientalists calling for rearranging the Quran chronologically.\nRequirement Three: The most prominent contemporaries influenced by Orientalists.\n\nChapter Two: Presentation, Study, and Discussion of the Three Commentaries Arranged According to the Order of Revelation\nIt has three sections:\n\nSection One: Presentation, study, and discussion of the first commentary \"Bayan al-Ma'ani\" by \"Abdul Qadir Mulla Huwaish\".\nIt has six requirements:\nRequirement One: Definition of the commentary \"Bayan al-Ma'ani\" and its author \"Mulla Huwaish\".\nRequirement Two: The books upon which \"Huwaish\" relied in his commentary.\nRequirement Three: His method in interpretation.\nRequirement Four: The first study about this commentary.\nRequirement Five: A brief critical study of \"Huwaish's\" commentary.\nRequirement Six: Enumerating the motives for \"Huwaish's\" undertaking to change the Mushaf arrangement to the chronological arrangement and discussing them.\n\nSection Two: Presentation, study, and discussion of the second commentary \"Al-Tafsir Al-Hadith\" by \"Muhammad Izzat Darwaza\".\nIt has eight requirements:\nRequirement One: Definition of his commentary.\nRequirement Two: \"Darwaza's\" argument for undertaking the change of the Mushaf arrangement to the chronological arrangement.\nRequirement Three: Clarifying the most important and prominent motives that drove \"Darwaza\" to arrange his commentary chronologically.\nRequirement Four: Discussing \"Darwaza's\" motives.\nRequirement Five: \"Darwaza's\" method in his commentary.\nRequirement Six: Evaluation of \"Darwaza's\" commentary.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 6
  },
  {
    "serial_number": "1104258",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Requirement Seven: The creed of \"Darwaza\" regarding the attributes of the Lord - Majesty be to Him.\nRequirement Eight: Prominent studies on \"Darwaza's\" commentary.\n\nSection Three: Presentation, study, and discussion of the third commentary, the book \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by \"Habannaka al-Maydani\".\nIt has seven requirements:\nRequirement One: Definition of the book and its author and clarifying the most important motives and causes for its authorship.\nRequirement Two: Side lights on the creed of \"Habannaka\".\nRequirement Three: The methodology of \"Habannaka\" in his book, his opinion on the arrangement of Surahs, and what was obligatory upon him to follow.\nRequirement Four: Enumerating the motives of \"Habannaka\" in adopting this method.\nRequirement Five: Discussing the motives and justifications of \"Habannaka\".\nRequirement Six: Were the goals aimed for by the initiators of changing the Mushaf arrangement to the chronological arrangement achieved?\nRequirement Seven: Statement of the obligation to respect the Mushaf arrangement, not to interfere with it, and to confront those who interfere with it.\n\nResearch Methodology\n\nFirst: Importance of the Research Topic\nThe importance of this research centers around that audacity undertaken by the three individuals who introduced a grave matter, classifying three commentaries and writing them according to the chronological order, leaving behind their backs the Mushaf arrangement settled upon by the Uthmani sheets, agreed upon by all the Companions to the last one of them - may Allah be pleased with them all -, received by the Ummah with acceptance, and agreed upon by the Predecessors and Successors up to our present time.\nFrom here comes the importance of this research. It was necessary and obligatory to present a study addressing this danger, discussing and refuting it, and repelling that tragedy with a fundamental scientific style coupled with transmitted and rational arguments. Therefore, the research was named \"The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation.\"\n\nSecond: The Most Important and Prominent Previous Studies\nStudy One: \"Commentaries According to the Order of Revelation in the Balance\" by Prof. Dr. Mustafa Muslim Muhammad, Expert at Tafsir Center for Quranic Studies, and formerly Professor of Quranic Studies at the University of Sharjah. Research published in Multaqa Ahl al-Tafsir, date: 15/12/1432 AH.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 7
  },
  {
    "serial_number": "1104259",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Presentation of that study: The researcher discussed in that study the issue of the arrangement of the Quran between Divine Ordainment (Tawqif) and Human Effort (Tawfiq/Ijtihad). Then he followed it by presenting the motives of the authors of those commentaries, discussed them, and refuted them with a pen that indicates jealousy for the Book of Allah and indicates the firmness of its owner. He benefited and did well, so may Allah reward him.\n\nThe most important observations on that study:\nFirst: The researcher presented those motives collectively then refuted them collectively. It would have been better for him to present the motives of each one of those commentaries separately, then follow it with a refutation directly. But as we said, he presented them all then refuted them all. By presenting them all and collectively, I mean he presented the first, then the second, then the third, then the response to them came after that in the same manner of presentation. It would have been better to present the motives of each one then respond to them and refute them directly so the reader's mind does not get distracted, and so observations, criticisms, and responses do not overlap between one commentary and another.\nSecond: One of the most important observations, indeed criticisms, on this research is its lack of clarifying the Ash'ari creed of the authors of the three commentaries. Indeed, the first of them - Mulla Huwaish - is accused of Sufism and belonging to the Naqshbandi order, along with his rejection of consensus, his ignorance of the Sunnah and rejection of it, his weakening of authentic established Hadiths, his citation of fabricated ones, and his attacking the two Sahihs as well, and other calamities mentioned in detail within our research. The references of \"Huwaish\" which he relied upon in his commentary indicate that clearly. Knowing the doctrinal aspect and highlighting it to the reader is of great importance so he can be wary of doctrinal slips and violations in which the commentator opposed the belief of Ahl al-Sunnah, especially in interpreting the attributes of the Lord, Majesty be to Him.\nThird: Among the important observations on this research - as well - is its lack of providing a definition of those commentaries, even a brief definition, so the reader can stand on a general view of those commentaries and view the method of each commentator among them in dealing with the verses of the Glorious Book, and the criticisms taken against the work of each commentator in his commentary.\nFourth: And among the clear observations on this research - as well - is its lack of biography of the authors of those commentaries for the reader to view and stand upon. Defining the book, its author, his belief, and his method of approaching interpretation gives a clear picture of the book and its writer from several aspects that serve the reader and make it easy for him to stand on everything he should know about the book he reads and about its author, methodology, and creed.\nThese observations and others do not impugn the effort of the researcher nor the scientific critical value of his research, especially since he is a professor of worth and scientific and progressive standing - may Allah Almighty have mercy on him.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 8
  },
  {
    "serial_number": "1104260",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Apology for those observations:\nAmong what can be used as an excuse for those observations regarding his eminence is that perhaps he saw the brevity appropriate for the requirement of the situation for which that study was written, which is participating with it in one of the scientific conferences, as his eminence indicated (1). There is no doubt that this situation requires brevity and focusing only on the requested research topic.\n\nStudy Two: \"The Holy Quran between the Mushaf Arrangement and the Revelation Arrangement: A Critical Methodological Study in the Mushaf and Historical Arrangement of the Quran\" by Dr. Said Bou Assab.\n\nPresentation of that study:\nThat study is considered among the modern writings in Quranic sciences. It is a publication of the Center for Quranic Studies affiliated with the Muhammadiya Association of Scholars in Morocco, First Edition, 1438 AH / 2017 CE in a medium volume consisting of 168 pages. It is also a publication of: Dar Al-Aman for Publishing and Distribution, date: 06/06/2017 CE - as well. Its author is a professor of Tafsir and Quranic Sciences at Al-Qarawiyyin University, Faculty of Sharia Sciences in Smara.\n\nImportance of that study:\nThe importance of that study comes from its distinct topic, which addresses the problematic issue of the call to arrange the Mushaf according to revelation, which has become a subject of controversy among modern scholars in recent times between supporters and opponents. This study came to discuss the topic in a descriptive, historical, analytical, critical methodology; which made it a fundamental critical approach seeking a calm objective scientific style.\n\nContents of that study:\nThe introduction of this study began by stating the importance of the topic of demanding the rearrangement of the Quran in Mushafs according to revelation; as there appeared among people in our time those who demand that, after the consensus of the predecessors since the Prophetic era was on the Mushaf arrangement of the Holy Quran. The author also clarified the motive for writing on the subject, which he summarized in: Writing in this chapter is considered an act of worship; that calls demanding rearrangement contain what is acceptable with conditions, and what is rejected; that in part of these calls there is a touching of the sanctity of the Mushaf; and that writing on this subject alerts to the sublime occasions contained in the Mushaf arrangement, from which the \"Science of Quranic Proportionality\" was generated; and that works discussing the topic of arrangement or interpretation according to revelation for the Holy Quran are considered few and rare.\nThe researcher paved the way for that study with a preliminary chapter, in which he addressed the methodology of Quranic revelation, including the concept and circumstances surrounding it, the purposes and objectives intended from the gradual revelation of the Quran, then the causes of revelation. He divided the book into two main sections. He dedicated the first of them to studying the Mushaf arrangement of the Holy Quran, clarifying the arrangement of verses in the Holy Quran, the arrangement of Surahs, the proportionality between verses and proportionality between Surahs, and the sayings of scholars on that, presenting the evidences of each group. He also dedicated the second section to the call for arranging and interpreting the Holy Quran according to the method of revelation, discussing those calling for that, as well as discussing their motives for this method and the extent of its applicability. He undertook a general critical discussion of Muhammad Abed Al-Jabri's claim regarding the arrangement of the Holy Quran's Surahs, and focused on partial issues related to interpretation according to revelation. The author appended his book with a conclusion containing the most important results reached by the research. (2)\n\nMost important observations on that study:\nThe same observations and criticisms on the previous study apply in many aspects to this study, if not matching completely. Added to them is the author's saying: \"that calls demanding rearrangement contain what is acceptable with conditions, and what is rejected.\" There is no doubt that this claim opens the door wide to the voices calling for rearranging the Quran chronologically.\n\nStudy Three: \"Arrangement of Quran Surahs according to their revelation in Al-Jabri's thought\" Presentation, Analysis, and Criticism, by Dr. Sabri Abdul Aziz Mansour Siam, Assistant Professor of Tafsir and Quranic Sciences at the Faculty of Arabic and Islamic Studies for Boys in Cairo, at Al-Azhar and Tabuk Universities. It is published in \"Volume One of Issue Thirty-Six of the Yearbook of the Faculty of Islamic Studies for Girls in Alexandria (n.d.). This study consists of ninety-two pages. Its author did well and benefited, as he discussed Muhammad Abed Al-Jabri, who died on: 19 Jumada al-Awwal 1431 AH, corresponding to: 3 May 2010 CE, a discussion sufficient for the purpose.\n\nAmong the most prominent points taken against this study are the following:\nFirst: The author's saying that he did not find anyone who refuted Al-Jabri, meaning he did not come across previous studies discussing him. There are many studies, including the study preceding this one by Dr. Said Bou Assab, which was in discussing Al-Jabri and was registered on: 06/06/2017 CE. We did not find a date for this study by Dr. Sabri Abdul Aziz Mansour Siam. One of the two studies must have preceded the other in time, so it was obligatory on the later one to mention the earlier study in recognition of credit and precedence and attributing it to its people. An excuse is sought for the later one by thinking well of him, saying perhaps he did not come across the studies preceding his study, including that study.\nSecond: Although this discussion was for Al-Jabri's thought only, the author mentioned the three individuals whose audacity to leave the Mushaf arrangement and incline towards the chronological arrangement we discussed in this research of ours, namely \"Mulla Huwaish\", \"Darwaza\", and \"Habannaka\", due to their sharing in the audacity to change the Mushaf arrangement agreed upon by the Ummah, predecessors and successors. Dr. Sabri mentioned them but passed over them quickly in a few lines, in the third requirement of the second section. He should have discussed them, because their influence might exceed Al-Jabri's influence due to their affiliation with knowledge in general and Tafsir in particular, and due to the spread of their books among people. Thus, the danger of being influenced by them is greater and more general than being influenced by Al-Jabri, who was known, recognized, and famous among people for his modernist Westernizing methodology.\nThird: Among what is taken against this study is the author's praise for the owners of the three commentaries, which it seems he did not read or read critical studies of them, as he said - may Allah pardon him -: \"These three luminaries had behind interpreting the Quran according to the time of revelation of Surahs lofty goals stemming from the supreme goal of the revelation of the Great Quran...\"\nFourth: One of the most severe criticisms on that study is what was taken against its two predecessors regarding not giving the doctrinal aspect the care befitting it. He passed over those three commentaries quickly as we mentioned earlier, and did not touch upon the doctrinal aspect, rather he did not refer to it at all, neither from near nor far.\nThese observations do not diminish the value of the research nor the effort of the researcher. The author had a refined sense and possessed a solid pen and jealousy for the Book of his Lord, so may Allah reward him for his book the fullest reward in the world and the Day of Judgment.\n\nGeneral Studies on Al-Jabri's Commentary:\nAllah has also facilitated other critical studies on Al-Jabri's commentary, the most prominent of which were:\nStudy One: \"Fabrications of Al-Jabri on Tafsir and Exegetes through his book Fahm al-Quran al-Hakim,\" a critical study by: Muhammad bin Abdul Aziz bin Abdullah Al-Musnad, issued by: Tibyan Journal for Quranic Studies, which is a \"refereed journal\" affiliated with the Saudi Scientific Association for the Holy Quran and its Sciences, in its issue: 25, pages: 173 - 233, for the year 1438 AH - 2018 CE.\nThe most prominent objectives of this study were:\n1 - Defending Tafsir and its Imams from the distortion of extremists, the plagiarism of falsifiers, and the interpretation of the ignorant.\n2 - Critiquing Al-Jabri's commentary specifically and what it contains of fabrications and objections against Tafsir and its Imams.\n3 - Clarifying the reality of what is called Modernist Tafsir of the Quran through critiquing Al-Jabri's commentary, which is considered a clear example of this type of interpretation.\nIts most important results were:\n1 - The variety of efforts by enemies to attack this Quran, the latest being what is called Modernist Readings of the Quran to remove sanctity from it.\n2 - The participation of some deceived Muslim sons in these misleading efforts.\n3 - The orientation of some of them to interpret the Quran not to clarify its meanings but to subject it to Western ideas and culture.\n4 - That \"Reason\" is a great blessing, but if it is ruled by desire, it becomes a curse on its owner.\nIts most important recommendations were:\n1 - He recommended researchers to exert much effort in confronting these misleading campaigns.\nHe recommended universities and research centers to care for such misleading Westernizing trends by spreading awareness of their danger and printing researches and books that undertook refuting them and exposing their falsehood. He also recommended universities to allocate a specialized study subject concerned with that. And Allah grants success. Allah guided the collector of this study to expose the defects of \"Al-Jabri\" with a solid scientific style and a firm authentic refutation, so may Allah reward him well for His Book, religion, methodology, and law.\n\nStudy Two: \"The Clear Commentary According to the Order of Revelation by 'Muhammad Abed Al-Jabri', an Analytical Critical Study.\" This study is a scientific thesis by which researcher Ahlam Khalifa Abdullah Al-Suway'i obtained a PhD degree in Arabic Studies and Literature - Islamic Studies Division - at Ain Shams University, in 1438 AH-2017 CE.\nEven though it is a study and scientific thesis discussing \"Al-Jabri's thought in Tafsir only - like its predecessor and successor - adding it to the aforementioned studies, mentioning it, and pointing to it with those studies gives the noble reader a broader conception of Al-Jabri, and opens the field for him to imagine his thought and culture which indicate that he is not of the people of knowledge at all. It also clarifies to him the reality of the man's affiliation with the contemporary Westernizing Modernist school.\nThe researcher opened the study's questions with the following questions:\n- Was Al-Jabri qualified to be an exegete?\n- Was the commentary imprinted with the philosophical and Western ideas its owner carries?\n- Did Al-Jabri raise important issues in the Holy Quran while remaining silent on others, and what is the motive behind that?\n- Did Al-Jabri raise doubts about the Quran and Islam under the pretext of renewal?\n- Was Al-Jabri in his opinions and ideas influenced by a certain current?\n- Is Al-Jabri considered among the renewers in Quranic exegesis?\nThus, all these questions and others were disclosed in the study. These questions and their answers are sufficient to expose \"Al-Jabri\", his methodology, and thought.\n\nStudy Three: \"The Question of Method in Understanding the Holy Quran and Interpreting it according to Muhammad Abed Al-Jabri through his book Understanding the Wise Quran: The Clear Commentary According to the Order of Revelation,\" an analytical critical study by Hassan Ghamari. The researcher did not find details for this study.\n\nThird: Reasons and Motives for Choosing the Research Topic\nDiscussing those commentaries comes as a victory for the Quran and a rebuttal of that suspicion into which they fell, so that no inexperienced noble person is deceived by their action and follows and agrees with them on it, especially since those commentaries are within people's reach.\nTherefore, the researcher here addressed the observations and criticisms that became clear to him regarding previous studies, including presenting those commentaries, their method of approaching interpretation, criticizing them with constructive scientific criticism, clarifying the belief of their authors, and other issues that the reader cannot do without to enable him to fully view all aspects of those three commentaries so he gains encompassment of them, and obtains a sufficient complete conception that suffices him from searching and digging for them in other places and locations.\nThis study also addresses the concerned scientific bodies in the Ummah to take necessary measures regarding those commentaries so that this tragedy is not repeated again, especially since their authors have passed their terms and gone to what they presented.\n\nFourth: The Research Problem and Its Objectives\nThe problem of this research is represented in what these three individuals undertook of innovation in changing the Mushaf arrangement to the chronological arrangement, claiming claims for which Allah sent down no authority. Those claims, if not refuted by argument and proof and by means of persuasion, may create a kind of conviction in those who do not have sharp insight and sound mind. Especially since among the authors of those commentaries are those who relied in this work of theirs on fatwas of some scholars of their country to absolve their conscience and make it an argument between them and their Lord. And among them are those who presented flimsy reasons that do not constitute an argument nor clarify a path. It is feared that if those flimsy arguments are not discussed and refuted with convincing silencing answers, that idea will penetrate and spread among people like fire in straw.\nSo that study came to discuss those commentaries and refute those flimsy arguments they presented which are frailer than a spider's web, with clear arguments and irrefutable proofs to preserve the Mushaf arrangement upon which is the work of the first and last of the people of Islam all together.\n\nFifth: Research Methodology\nThe researcher used in his research a number of research methodologies, the clearest and most prominent of which was: The Descriptive Analytical Method.\nAs for the [first] chapter: The researcher described the arrangement of verses in Surahs as \"Tawqifi arrangement\", then analyzed that arrangement deducing its Tawqifi nature with several evidences, most prominently: the revelation of some Surahs all at once. Then he turned to the schools of scholars and their disagreement on the arrangement of Surahs and that they are three schools. Then he turned to mentioning the most prominent sayings of scholars who say that the arrangement of the Holy Quran's Surahs was a Tawqifi arrangement, then described each school with a brief analytical description suitable for the situation. Then he turned to presenting the speech on the most prominent evidences used by some scholars for the Tawqifi nature of the Mushaf arrangement describing them with an analytical description. Then he concluded this chapter by speaking about the beginning of opposing and contradicting the Mushaf arrangement with the...",
    "foot_note": "1. That study is present within a collection of researches presented to the Conference on Service to the Holy Quran in the Fourteenth Hijri Century, organized by the College of Sharia and Islamic Studies at the University of Sharjah, from 22-23 Safar 1424 AH, corresponding to 23-24 April 2004 CE. The participating papers were printed in five axes in two volumes. This research is located in Part Two / from page 514 to 526, meaning about 12 pages only, titled: \"Commentaries According to the Order of Revelation in the Balance\". For more, see: Multaqa Ahl al-Tafsir, date: 24/3/2006 CE.\n2. See website: The Muhammadiya Association of Scholars, Kingdom of Morocco. Prepared by: Professor Radwan Ghazali, researcher at the Center for Quranic Studies. [*] (Shamela Comment): The entire content of this page is not in the printed version of the journal and is established in what was sent to us by the author - may Allah preserve him -\n\n1. [*] (Shamela Comment): The entire content of this page is not in the printed version of the journal and is established in what was sent to us by the author - may Allah preserve him -\n\nNone",
    "book_id": "944",
    "new_page_number": 9
  },
  {
    "serial_number": "1104263",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "...chronological arrangement and clarifying its source, explaining and describing it with a precise analytical description, showing in it the first who opposed and contradicted the Mushaf arrangement with the chronological arrangement. Then he followed by mentioning the most prominent Orientalists calling for rearranging the Quran chronologically. Then he thirdly concluded by mentioning the most prominent contemporaries influenced by Orientalists.\nAs for the second chapter: The researcher presented the three commentaries, then addressed the description of each commentary with an analytical description suitable for the situation, showing in it the definition of the commentary, its author, his methodology, and his creed. Then he turned to the motives for his violation of the Mushaf arrangement and his inclination towards the chronological arrangement. Then after describing those motives, he analyzed them with a descriptive analysis refuting those motives with the description befitting each motive as the context requires. Then the researcher showed that the goals aimed for by the initiators of changing the Mushaf arrangement to the chronological arrangement were not achieved for them. Then he concluded by stating the obligation of respecting the Mushaf arrangement, not interfering with it, and confronting those who interfere with it.\n\nChapter One: Divine Ordainment of the Mushaf Arrangement for Verses and Surahs\nSection One: Clarifying that the arrangement of verses in Surahs is divinely ordained (Tawqifi)\nIt has two requirements:\nThe Mushaf arrangement is that upon which the Final Review settled, agreeing with what is established in the Preserved Tablet. It is the arrangement upon which the Bakri collection settled for the first collection of the Quran between two boards. It is the arrangement upon which the Imam Mushaf settled in the Uthmani collection. It is the arrangement agreeing with the Uthmani sheets which the Rightly Guided Caliph Uthman, may Allah be pleased with him, sent to the regions.\nThe Mushaf arrangement includes two matters:\nRequirement One: The First Matter: Arrangement of Verses in Surahs\nThere is no doubt that the arrangement of verses in Surahs is a Tawqifi matter in which there is no room for Ijtihad at all:\nAl-Zarkashi (d. 794 AH), may Allah have mercy on him, said: As for the verses in every Surah, and placing the Basmalah at their beginnings, their arrangement is Tawqifi without doubt, and there is no dispute about it; therefore, it is not permissible to reverse them. (1)\nAl-Suyuti (d. 911 AH), may Allah have mercy on him, said: Consensus and consecutive texts indicate that the arrangement of verses is Tawqifi, there is no doubt about that. As for consensus, more than one narrated it, including Al-Zarkashi in Al-Burhan, and Abu Ja'far bin Al-Zubair in his Munasabat, and his wording is: The arrangement of verses in their Surahs occurred by his instruction (Tawqif), peace be upon him, and his command without disagreement in this among Muslims. (2)\nAl-Suyuti (d. 911 AH) - also - said, may Allah have mercy on him: \"And what we hold is that all of the Quran which Allah revealed and commanded establishing its script, and did not abrogate, nor lifted its recitation after its revelation, is that which is between...",
    "foot_note": "1. Al-Zarkashi, Al-Burhan fi Ulum al-Quran, (1/256), Al-Burhan fi Ulum al-Quran - by Badr al-Din Muhammad bin Abdullah Al-Zarkashi (d. 794) investigation: Muhammad Abu Al-Fadl Ibrahim - First Edition - Dar Ihya' Al-Kutub Al-Arabiyyah, Egypt 1376 AH - 1957 CE.\n2. Al-Suyuti, Al-Itqan fi Ulum al-Quran (1/211). Al-Itqan fi Ulum al-Quran, by Jalal al-Din Abdul Rahman bin Abi Bakr Al-Suyuti (d. 911 AH) investigation: Muhammad Abu Al-Fadl Ibrahim - Dar Al-Turath in Cairo, Third Edition, 1405 AH-1985 CE. See: I'jaz al-Quran by Al-Baqillani (p. 60). I'jaz al-Quran by Al-Baqillani Author: Abu Bakr Al-Baqillani Muhammad bin Al-Tayyib (Died: 403 AH) Investigator: Al-Sayyid Ahmad Saqr Publisher: Dar Al-Ma'arif - Egypt Edition: Fifth, 1997 CE Number of Parts: 1. And Asrar Tartib al-Quran: (p. 41) by Al-Baqillani. And Manahil al-Irfan fi Ulum al-Quran (1/347). Manahil al-Irfan fi Ulum al-Quran Author: Muhammad Abdul Azim Al-Zarqani (d. 1367 AH) Publisher: Matba'at Isa Al-Babi Al-Halabi wa Shurakahu, Third Edition, Number of Parts: 2. And Hashiyat al-Shihab 'ala Tafsir al-Baydawi Inayat al-Qadi wa Kifayat al-Radi: (1/25). And Fath al-Bayan fi Maqasid al-Quran - Abu al-Tayyib Muhammad Siddiq Khan bin Hasan bin Ali bin Lutf Allah Al-Husseini Al-Bukhari Al-Qinnawji (15/307). Fath al-Bayan fi Maqasid al-Quran Author: Abu al-Tayyib Muhammad Siddiq Khan bin Hasan bin Ali Ibn Lutf Allah Al-Husseini Al-Bukhari Al-Qinnawji (Died: 1307 AH) Cared for its printing, introduced it and reviewed it: Servant of Knowledge Abdullah bin Ibrahim Al-Ansari Publisher: Al-Maktabah Al-Asriyyah for Printing and Publishing, Sidon - Beirut Year of Publication: 1412 AH - 1992 CE, Number of Parts: 15.",
    "book_id": "944",
    "new_page_number": 10
  },
  {
    "serial_number": "1104264",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "the two covers, which the Mushaf of Uthman contained. Nothing was decreased from it, nor added to it. Its arrangement and organization are established upon what Allah Almighty organized, and His Messenger, peace be upon him, arranged it upon regarding the verses of Surahs. Nothing was advanced from that which is delayed, nor delayed that which is advanced.\" (1)\nAl-Zarqani (d. 1367 AH), may Allah have mercy on him, said: \"The consensus of scholars was concluded that the arrangement of verses in the Surah was by Tawqif from the Prophet, peace be upon him - from Allah Almighty, and that there is no room for opinion and Ijtihad in it, and no opposer is known in that.\" (2)\nAmong those who stated the consensus recounted by Al-Suyuti and Al-Zarqani as well are:\n1 - Ibn Qudamah Al-Maqdisi (d. 620 AH) where he says - may Allah have mercy on him: The arrangement of verses is obligatory; because their arrangement is by text (Nass) by consensus. (3)\n2 - And Abu Ja'far Al-Gharnati (d. 708 AH) where he says - may Allah have mercy on him: Know first that the arrangement of verses in their Surahs occurred by his instruction and command - peace be upon him, without disagreement in this among Muslims. (4)\n3 - And Mulla Ali Al-Qari (d. 1014 AH) where he says - may Allah have mercy on him: The arrangement of verses is Tawqifi, and upon it is consensus. (5)\n4 - And Shihab al-Din Al-Nafrawi (d. 1127 AH) where he says - may Allah have mercy on him: The arrangement of verses is Tawqifi by agreement. (6)\nMany evidences from the authentic established Sunnah from the Infallible, peace be upon him, also indicated that - and they are too many to count. We mention some of them as examples, not exclusively, as follows:\n1 - Among them is what Al-Bukhari extracted in his Sahih from Ibn Abi Mulaykah who said: Ibn Al-Zubair said: I said to Uthman: This verse which is in Al-Baqarah (And those who are taken in death among you and leave wives behind...) to his saying (...without expulsion) (Al-Baqarah: from verse 240) has been abrogated by the other, so why do you write it? He said: Leave it, O son of my brother, I do not change anything of it from its place. (7). The reply of Uthman bin Affan to Ibn Al-Zubair is understood from it that they - may Allah be pleased with them all - knew the places of arrangement of verses, so Uthman left it in its place established because the evidence indicates it, and because it is what they learned and what is acted upon among them.\n2 - And among them is what Muslim narrated in his Sahih from Umar who said: I did not ask the Prophet, peace be upon him, about anything more than I asked him about Kalala until he poked his finger in my chest and said: Does not the verse of Summer which is at the end of Surat An-Nisa suffice you? (8)\nThe verse of Kalala is placed at the end of Surat An-Nisa and its conclusions. When Umar, may Allah be pleased with him, asked the Messenger of Allah, peace be upon him, he guided him to its place at the end of the Surah. From here two matters become clear to us:",
    "foot_note": "1. Previous reference: (p. 163).\n2. Manahil al-Irfan by Al-Zarqani: (1/346).\n3. Kashshaf al-Qina' 'an Matn al-Iqna': (1/344). See: Al-Mubdi' fi Sharh al-Muqni' (1/433). And Al-Iqna' fi Fiqh al-Imam Ahmad bin Hanbal: (1/119).\n4. Al-Burhan fi Tanasub Suwar al-Quran - by Al-Gharnati: (p. 182). Al-Burhan fi Tanasub Suwar al-Quran Author: Ahmad bin Ibrahim bin Al-Zubair Al-Thaqafi Al-Gharnati, Abu Ja'far (Died: 708 AH) Investigation: Muhammad Shabani Publisher: Ministry of Awqaf and Islamic Affairs - Morocco Year of Publication: 1410 AH - 1990 CE Number of Parts: 1.\n5. Mirqat al-Mafatih Sharh Mishkat al-Masabih - Mulla Ali bin Sultan Muhammad Al-Qari: (4/1520). Mirqat al-Mafatih Sharh Mishkat al-Masabih Author: Ali bin (Sultan) Muhammad, Abu Al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari (Died: 1014 AH) Publisher: Dar Al-Fikr, Beirut - Lebanon Edition: First, 1422 AH - 2002 CE Number of Parts: 9.\n6. Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani - Ahmad bin Ghanim (or Ghunaym) bin Salim bin Muhanna, Shihab al-Din Al-Nafrawi Al-Azhari: 1/56, 66. Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani Author: Ahmad bin Ghanim (or Ghunaym) bin Salim Ibn Muhanna, Shihab al-Din Al-Nafrawi Al-Azhari Al-Maliki (Died: 1126 AH) Publisher: Dar Al-Fikr Edition: Without edition Date of Publication: 1415 AH - 1995 CE Number of Parts: 2.\n7. Narrated by Al-Bukhari in Al-Sahih under number (4536).\n8. Narrated by Muslim under number (1617).",
    "book_id": "944",
    "new_page_number": 11
  },
  {
    "serial_number": "1104265",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "The First Matter: That the verses of the Surah are arranged and sequential from its beginning until its end.\nThe Second Matter: That the arrangement of verses was among what the Prophet, peace be upon him, taught his noble Companions, may Allah be pleased with them.\n3 - And among them is what Muslim narrated in his Sahih from Abu Darda, raised (Marfu'): Whoever memorizes ten verses from the beginning of Al-Kahf is protected from the Dajjal. And in a wording with him: Whoever recited the last ten of Surat Al-Kahf. (1)\nHis saying: (from the beginning of Al-Kahf) and his saying: (the last ten) is clear indication of the arrangement of the Surah's verses as is the case with the verses of the entire Quran.\nLikewise, \"his reading, peace be upon him, of various Surahs in the presence of the Companions indicates that the arrangement of their verses is Tawqifi. The Companions would not arrange an arrangement different from what they heard the Prophet - peace be upon him - read, and that reached the level of mass transmission (Tawatur).\" (2)\n4 - And among them is what is proven with Al-Bukhari from the hadith of Aisha, may Allah be pleased with her, (that she) said: The Prophet, peace be upon him, heard a man reciting in the mosque, so he said: \"May Allah have mercy on him, he has reminded me of such and such verse, I had dropped them from Surah such and such.\" (3). This Hadith and its likes are among what is used as evidence for his teaching, peace be upon him, his Companions - may Allah be pleased with them - the places of verses and their arrangement in Surahs and that it is a Tawqifi matter with no deviation or escape from it.\nThere are very many evidences establishing this issue. The Prophet's hearing, peace be upon him, of the Quran from his Companions with arranged verses and his approval, peace be upon him, of their reading, as well as his praying with them over the course of the stage of Quranic revelation in twenty-three years, and that was repeated repeatedly and frequently and is known in the collections of Sunnah; so indicating it is sufficient and enough.\nWhoever wants more benefit in this chapter should review the virtues of reading specific verses of the Quran in their places in the books of Sunnah, like the virtue of Fatihat al-Kitab which are too many to count, and like the virtues of the last two verses of Surat Al-Baqarah (4), and like the virtue of the first ten verses of Surat Al-Kahf (5). And likewise what the Messenger of Allah, peace be upon him, persisted in reading of some Surahs of the Quran and did not change anything in their verses, neither by advancing nor delaying, such as his reading of Surahs Al-Baqarah, An-Nisa, and Al-Imran, and his reading of Surah \"Qaf\" in Eid. (6) And likewise from above the pulpit and in prayer as well, as he used to read \"Al-Munafiqun\" in Jumu'ah (7). The Prophet, peace be upon him, with his persistence in reading these Surahs and verses, also persisted, peace be upon him, in their arrangement. It is not known about him, peace be upon him, that he changed anything of them at all. There is no doubt that his action, peace be upon him, is of the clearest proofs that this arrangement is what agreed with its arrangement in the Preserved Tablet which he received from Gabriel - peace be upon him.",
    "foot_note": "1. Narrated by Muslim under number (809).\n2. See: Al-Itqan: (1/62-65).\n3. Narrated by Al-Bukhari, Book of Virtues of the Quran, Chapter: He who saw no harm in saying: Surah Al-Baqarah, and Surah such and such 6/194 Hadith number 5042, and Muslim 33 Book of Travelers' Prayer 33 - Chapter: Command to pledge to the Quran, and dislike of saying I forgot verse such and such, and permissibility of saying I was made to forget it 1/543 Hadith number 788.\n4. See: Muslim in his Sahih under number: 809, and others.\n5. See: Al-Bukhari in his Sahih under numbers: (5008 - 5009 - 5040), and Muslim under number: (807).\n6. Narrated by Muslim under number: (891), and others.\n7. See: Muslim under number: (877), and others from the hadith of Abu Huraira.",
    "book_id": "944",
    "new_page_number": 12
  },
  {
    "serial_number": "1104266",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Other Evidences Confirming that Verse Arrangement is Tawqifi:\nAmong what confirms that the arrangement of verses is a Tawqifi arrangement as well and proves it is the revelation of a number of Surahs of the Quran all at once (Jumlatan Wahidah).\n\nRequirement Two: As for the Second Matter: It is the arrangement of Surahs according to the Mushaf Arrangement\nWe have just passed the certainty that the arrangement of verses in Surahs is a Tawqifi matter in which there is no room for Ijtihad at all. As for the arrangement of Surahs according to the Mushaf arrangement, it is an issue in which scholars disputed. The researcher will present the sayings reported regarding the arrangement of Surahs with preference between them. Mention of that will be detailed in its appropriate place in a special section of this chapter, which is Section Three: Schools of thought of scholars and their disagreement on the arrangement of Surahs.\n\nSection Two: Of the clearest proofs that the arrangement of verses in Surahs is divinely ordained is the revelation of some Surahs all at once.\nIt has two requirements:\n\nRequirement One: Mentioning a number of Surahs that were revealed all at once\nOne of the clear evident proofs that the arrangement of verses in Surahs is Tawqifi is the revelation of some Surahs all at once. In classifying the revelation of Quranic Surahs, Al-Suyuti mentions the second type, which is the type that was revealed all at once, saying - may Allah have mercy on him: \"... And among the examples of the second: Surah Al-Fatiha, Al-Ikhlas, Al-Kawthar, Tabbat, Lam Yakun, Al-Nasr, and Al-Mu'awwidhatan were revealed together. And from it is Surah Al-Saff.\" (1)\nWe cite some correct established evidences regarding the revelation of some Surahs all at once. Among those Surahs that were revealed all at once is Surah Bara'ah (At-Tawbah). Al-Bukhari narrated in his Sahih from Al-Bara' - may Allah be pleased with him, who said: \"The last Surah revealed complete is Bara'ah.\" (2)\nAl-Bukhari also narrated it (3) with the wording: \"The last Surah revealed is Bara'ah...\" without the word \"complete\". Some scholars held that Surah Bara'ah was revealed piecemeal and not all at once, claiming the incorrectness of the word \"complete\". Badr al-Din al-Ayni (d. 855 AH), may Allah have mercy on him, said: \"His saying: (complete), Al-Dawudi said: The word: complete, is nothing because Bara'ah was revealed bit by bit. I said: Therefore the word: complete, was not mentioned in this Hadith in [the Book of] Tafsir, and its wording there is: The last Surah revealed is Bara'ah.\" (4)\nBut Al-Tahir bin Ashur mentioned in \"Al-Tahrir wa Al-Tanwir\" that it was revealed all at once and attributed this saying to the majority of scholars. (5)\nAmong those Surahs that were revealed all at once as well is Surah Al-Fath: Al-Bukhari narrated in his Sahih from Umar - may Allah be pleased with him from the Prophet, peace be upon him, who said: (Tonight a Surah has been revealed to me, it is dearer to me than all that the sun rises upon) then he read: (Indeed, We have given you a clear conquest) (Al-Fath: 1). (6)\nAmong those Surahs that were revealed all at once as well is Surah Al-Bayyinah: From Ammar bin Abi Ammar, he said: I heard Abu Habba Al-Badri say: When (Those who disbelieved among the People of the Scripture... were not) [Al-Bayyinah: 1] was revealed to its end, Gabriel - peace be upon him - said: O Messenger of Allah, indeed your Lord commands you to read it to Ubayy. So the Prophet, peace be upon him, said to Ubayy: (Indeed Gabriel commanded me to read this Surah to you). Ubayy said: Was I mentioned there, O Messenger of Allah? He said: (Yes). He said: So Ubayy wept. (7)",
    "foot_note": "1. Al-Itqan: (1/136 - 137). With modification.\n2. Narrated by Al-Bukhari: (4364).\n3. Narrated by Al-Bukhari: (4605).\n4. Umdat al-Qari: (18/18).\n5. Al-Tahrir wa Al-Tanwir: (10/97). Tafsir Ibn Ashur: Al-Tahrir wa Al-Tanwir \"Liberating the Sound Meaning and Enlightening the New Mind from the Interpretation of the Glorious Book\" Author: Muhammad Al-Tahir bin Muhammad bin Muhammad Al-Tahir bin Ashur Al-Tunisi (Died: 1393 AH) Publisher: Al-Dar Al-Tunisiyyah for Publishing - Tunisia Year of Publication: 1984 AH, Number of Parts: 30 (Part 8 is in two sections).\n6. Narrated by Al-Bukhari: (4177).\n7. Narrated by Ahmad in Al-Musnad: (16001), and its investigators said: A Hadith Sahih due to others. Its origin is in Al-Bukhari: (3809), and Muslim: (799), from the hadith of Anas.",
    "book_id": "944",
    "new_page_number": 13
  },
  {
    "serial_number": "1104267",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Also among the Surahs revealed all at once is Surah Al-Kawthar: From Anas, he said: While the Messenger of Allah, peace be upon him, was among us one day, he dozed off a little, then raised his head smiling. We said: What makes you laugh, O Messenger of Allah? He said: \"A Surah was revealed to me just now.\" So he read: {In the name of Allah, the Most Gracious, the Most Merciful. Indeed, We have granted you, [O Muhammad], al-Kawthar. So pray to your Lord and sacrifice. Indeed, your enemy is the one cut off.} (Al-Kawthar complete: 1-3). (1)\nAlso among the Surahs revealed all at once is Surah Al-Nasr: From Ubaidullah bin Abdullah bin Utbah, he said: Ibn Abbas said to me: Do you know the last Surah revealed from the Quran, revealed entirely? I said: \"Yes, When the victory of Allah has come and the conquest\", He said: You spoke the truth. (2)\nAlso among the Surahs revealed all at once is Surah Al-Masad: It is proven in the two Sahihs from the hadith of Abbas (Ibn Abbas), may Allah be pleased with them both, who said: The Prophet - peace be upon him - ascended Al-Safa one day and said: (Ya Sabahah - O morning warning), so Quraysh gathered to him. They said: What is the matter with you? He said: (Do you see if I told you that the enemy attacks you in the morning or evening, would you believe me?) They said: Yes. He said: (Then indeed I am a warner to you before a severe punishment). Abu Lahab said: Perish you, is it for this you gathered us? So Allah revealed: (Perish the hands of Abu Lahab) (Al-Masad: 1). (3)\nAlso among the Surahs revealed all at once are the two Surahs of Refuge (Al-Mu'awwidhatan): From Uqbah bin Amir, he said: The Messenger of Allah, peace be upon him, said: Do you not see verses revealed tonight the like of which has never been seen? {Say, \"I seek refuge in the Lord of daybreak\"} and {Say, \"I seek refuge in the Lord of mankind\"}. (4)\n\nRequirement Two: Summary of mentioning Surahs that were revealed all at once\nThat the revelation of many short Surahs of the Mufassal revealed all at once is a matter established by clear authentic evidences, like Al-Fatiha, Al-Qadr, Al-Ma'un, Al-Masad, Al-Kawthar, Al-Fil, Al-Nasr, Al-Kafirun, Al-Ikhlas, Al-Falaq, and Al-Nas. And likewise Al-Fath.\nAs for what some exegetes mentioned that several Surahs were revealed all at once as well, especially from the long ones, most of those sayings are subject to consideration and Ijtihad, and the disagreement in them is known because they are Ijtihadi sayings not supported by a clear argument from a correct explicit established evidence. Therefore, the researcher only mentioned what was established to him by correct established explicit evidence.\nThis: It must be known that the principle in the Holy Quran is that it was collected and arranged on the basis of its agreement with the Final Review, and the Final Review settled according to what is established and agreeing and matching the Quran established in the Preserved Tablet as well.\n\nAs for the Second Matter: It is the arrangement of Surahs according to the Mushaf arrangement. We have just passed the certainty that the arrangement of verses in Surahs is a Tawqifi matter in which there is no room for Ijtihad at all. As for the arrangement of Surahs according to the Mushaf arrangement, it is an issue in which scholars disputed. Here the researcher presents the sayings reported regarding the arrangement of Surahs",
    "foot_note": "1. Narrated by Muslim in 4 - Book of Prayer 14 - Chapter: Argument of who said: Basmalah is a verse from the beginning of every Surah except Bara'ah 1/300 Hadith number 400.\n2. Sahih Muslim in the beginning of Book of Tafsir 4/2318 Hadith number 3024.\n3. Narrated by Al-Bukhari: (4801), and Muslim: (208).\n4. Narrated by Muslim 6 - Book of Travelers and Shortening it 46 - Chapter: Virtue of reading Al-Mu'awwidhatan 1/558 Hadith number 814.",
    "book_id": "944",
    "new_page_number": 14
  },
  {
    "serial_number": "1104268",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "with preference between them.\n\nSection Three: Schools of thought of scholars and their disagreement on the arrangement of Surahs\nIt has three requirements:\nAl-Suyuti - may Allah have mercy on him - says in \"Al-Itqan\" about the disagreement on the arrangement of Surahs:\nAs for the arrangement of Surahs as they are now in the Mushaf, the people of this discipline have differed on it into three schools:\n\nRequirement One: The First School: That the arrangement of Surahs is a matter of Ijtihad (Tawfiqi - Success/Effort) by the Companions.\nIt is the doctrine of the majority who see that the arrangement of Surahs is a matter of Ijtihad by the Companions, as the Prophet, peace be upon him, delegated that to his nation after him. One of the most prominent who tended towards this opinion is Imam Malik.\n\nRequirement Two: The Second School: That the arrangement of Surahs is a matter of Divine Ordainment (Tawqifi) from the Prophet, peace be upon him.\nIt sees that this arrangement is an instruction from the Prophet, peace be upon him, and this was said by a group of scholars.\n\nRequirement Three: The Third School: That the arrangement of most Surahs is a matter of Divine Ordainment from the Prophet, peace be upon him, and that the arrangement of some Surahs was by Ijtihad from the Companions.\nIt leans towards that the arrangement of most Surahs was by instruction from the Prophet, peace be upon him, and was known in his life, and that the arrangement of some Surahs was by Ijtihad from the Companions. (1)\nWe have just passed what Al-Suyuti mentioned of scholars' sayings in stating the arrangement of Surahs generally. The disagreement in this issue is very wide and has great importance due to its relation to a great matter concerning the Speech of Allah Almighty. Proponents of each saying presented evidences for what they preferred. Those who spoke on this issue are great Imams whose opinion is relied upon. The researcher did not cite the evidences of each group to discuss them for fear of prolongation, although addressing this section is of great importance due to its status and worth and the worth of what it relates to, which is the Book of Allah Almighty.\n\nSection Four: Prominent sayings of scholars who say that the arrangement of the Holy Quran's Surahs was a divinely ordained arrangement\nMany Imams see that the arrangement of the Holy Quran's Surahs was a Tawqifi arrangement just as the arrangement of its verses was. They presented clear evidences and tearful (strong) arguments that make the researcher pause at them for long and repeat contemplation, research, and looking into them much. It has two requirements:\n\nRequirement One: Mentioning a number of sayings of early scholars\nAmong the most prominent of these sayings are:\nThe First Saying: The saying of Al-Zarkashi (d. 794 AH) in Al-Burhan, may Allah have mercy on him: \"Some of our verifying Sheikhs said:",
    "foot_note": "1. Al-Burhan (1/258).",
    "book_id": "944",
    "new_page_number": 15
  },
  {
    "serial_number": "1104269",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Whoever said: No occasion should be sought for the noble verse because it is according to scattered occurrences has erred. The decisive speech is that it is according to occurrences in revelation and according to wisdom in arrangement. The Mushaf is like the Noble Sheets according to what is in the Hidden Book, all its Surahs and verses arranged by Tawqif... I said: And it is built on [the premise] that the arrangement of Surahs is Tawqifi, and this is the preponderant view.\" (1)\nThere is no doubt that a saying like Al-Zarkashi's has its scientific value and its status and worth as well, because he discussed the evidences of each group on one hand, and due to his mastery of this science on the other hand.\n\nThe Second Saying: The saying of Al-Suyuti (d. 911 AH) in Al-Itqan - may Allah have mercy on him: \"And among what indicates that it is Tawqifi is that the Hawamim (Surahs starting with Ha-Mim) were arranged successively 'meaning consecutively', and likewise the Tawasin (Surahs starting with Ta-Sin), while the Musabbihat (Surahs starting with Tasbih) were not arranged successively; rather separation occurred between their Surahs. And separation occurred between 'Ta-Sin-Mim' of Poets (Al-Shu'ara) and 'Ta-Sin-Mim' of Stories (Al-Qasas) with 'Ta-Sin' (Al-Naml) even though it is shorter than both. If the arrangement were Ijtihad, the Musabbihat would have been mentioned successively, and 'Ta-Sin' would have been delayed after Al-Qasas.\" (2)\n\nThe Third Saying: The saying of Abu Bakr Al-Anbari (d. 328 AH) where he says - may Allah have mercy on him: \"The consistency of Surahs is like the consistency of verses and letters; all is from the Prophet, peace be upon him. So whoever advances a Surah or delays it has corrupted the organization of the Quran.\" (3)\n\nThe Fourth Saying: The saying of Al-Kirmani (d. 893 AH) may Allah have mercy on him: \"The arrangement of Surahs is thus with Allah in the Preserved Tablet in this order.\" (4)\n\nThe Fifth Saying: The saying of Sharaf al-Din Al-Tibi (d. 743 AH) also - may Allah have mercy on him: \"The Quran was revealed first all at once from the Preserved Tablet to the lowest heaven, then it descended piecemeal according to interests, then it was established in the Mushafs according to the composition and organization established in the Preserved Tablet.\" (5)\n\nThe Sixth Saying: The saying of Muhibb al-Din Al-Nuwayri (d. 857 AH) where he says - may Allah have mercy on him: \"He - Uthman - only ordered them to copy from the sheets; so that his Mushaf would rely on Abu Bakr's original which relies on the Prophet's original, peace be upon him. He appointed Zaid because Abu Bakr and Umar relied on him, and added a group to assist him, so that number joins justice (integrity). These were [chosen] for the fame of their precision and knowledge. They wrote it as one hundred and fourteen Surahs, the first is 'Al-Hamd' and the last is 'Al-Nas' in this order.\" (6)\nIt is clear from Al-Nuwayri's speech that he sees that Abu Bakr's copy was complete, with verses and Surahs arranged as well, and that it relied on what was written and memorized from the Messenger of Allah, peace be upon him; there is no difference between verses and Surahs in Tawqif. Therefore he - Uthman - ordered them to copy from it.\n\nThe Seventh Saying: The saying of Abu Ja'far Al-Nahhas (d. 338 AH) where he says - may Allah have mercy on him:",
    "foot_note": "1. Al-Burhan fi Ulum al-Quran (1/37). See: Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani: 1/56. And Al-Kawkab Al-Wahhaj Sharh Sahih Muslim: 10/76.\n2. Al-Itqan: Al-Suyuti Vol 1 p 63.\n3. Al-Itqan: Al-Suyuti Vol 1 p 62.\n4. Al-Burhan: Al-Zarkashi Vol 1 p 259, and Al-Itqan by Al-Suyuti Ed 1 p 62.\n5. Al-Itqan: Al-Suyuti Vol 1 p 62.\n6. Sharh Tayyibat al-Nashr: (1/109).",
    "book_id": "944",
    "new_page_number": 16
  },
  {
    "serial_number": "1104270",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "\"The composition of Surahs in this order is from the Messenger of Allah - peace be upon him.\" (1).\n\nThe Eighth Saying: The saying of Abu Al-Hasan Ibn Al-Hassar (d. 620 AH) where he says - may Allah have mercy on him: \"The arrangement of Surahs and placing verses in their places was only by Revelation.\" (2)\n\nThe Ninth Saying: The saying of Al-Baghawi (d. 516 AH) where he says - may Allah have mercy on him: \"The Companions - may Allah be pleased with them - collected between the two covers the Quran which Allah Glorious and Exalted revealed to His Messenger, peace be upon him, without adding to it or decreasing anything from it... So they wrote it as they heard it from the Messenger of Allah, peace be upon him, without advancing anything or delaying... So it is proven that the Companions' effort was in collecting it in one place, not in its arrangement. For the Quran is written in the Preserved Tablet in the order which is in our Mushafs. Allah Almighty sent it down all at once in the month of Ramadan on the Night of Decree to the lowest heaven, as the Almighty said: {The month of Ramadhan [is that] in which was revealed the Qur'an} (Al-Baqarah: 185), and He said: {Indeed, We sent it down during the Night of Decree} (Al-Qadr: 1).\" (3)\nAl-Baghawi's speech is of utmost precision. He sees that the Quran in our hands remains as it was in the Preserved Tablet, so it was arranged, and descended arranged to the lowest heaven with its complete verses and Surahs. And that although it descended piecemeal after that to the Messenger of Allah, peace be upon him, it was collected by Revelation as it was in the Preserved Tablet, and the Companions - may Allah be pleased with them - wrote it according to this collection which they learned from the Messenger of Allah, peace be upon him.\n\nThe Tenth Saying: The saying of Mulla Ali Al-Qari (4) where he says - may Allah have mercy on him: \"Although the most correct view is that the arrangement of Surahs is Tawqifi as well, even if their Mushafs were different in that before the Final Review... And among what indicates that it is Tawqifi is that the Hawamim were arranged successively, and likewise the Tawasin, while the Musabbihat were not arranged successively; rather separation occurred between their Surahs, and likewise the mixing of Meccan with Medinan Surahs.\" (5)\nIn the saying and evidence of Ali Al-Qari, it becomes clear that the arrangement, even if no theoretical text appeared regarding it, was more confirmed through contemplation of the practical application, which suggests in a way that leaves no room for doubt that the arrangement was Tawqifi. The gist of his speech is quoted from Al-Suyuti's saying.\nBased on the above, scholars did not hesitate to prefer this opinion stating Tawqif. Ahmad bin Abdul Rahman bin Muhammad Al-Banna Al-Sa'ati said: \"The correct view is that the arrangement of Surahs and verses is a Tawqifi matter with no room for opinion in it.\" (6)\nAmong what was organized and said in that is the saying of Abu Al-Hasan Ibn Al-Hassar (d. 620 AH) in his book \"Al-Nasikh wa Al-Mansukh\":\nO you who ask me about the Book of Allah, striving ... And about the arrangement of what is recited of Surahs\nAnd how the Chosen One from Mudar brought them ... May God bless the Chosen One from Mudar (7)\nSo Ibn Al-Hassar indicates that the arrangement of Surahs was brought by the Prophet - peace be upon him, and it is a signal...",
    "foot_note": "1. Al-Burhan: Al-Zarkashi Vol 1 p 259, and Al-Itqan by Al-Suyuti Ed 1 p 62.\n2. Al-Itqan: Al-Suyuti Vol 1 p 62.\n3. Sharh Al-Sunnah by Al-Baghawi: (4/521). See: Al-Manhal Al-Adhb Al-Mawrūd Sharh Sunan Abi Dawood: 5/206.\n4. Mulla Ali Al-Qari: (d. 1014 AH - 1606 CE), he is the jurist, Muhaddith, reciter Nur al-Din Abu al-Hasan Ali bin Sultan Muhammad, Al-Qari Al-Harawi Al-Makki known as \"Mulla Ali Al-Qari\". Nicknamed Al-Qari; because he was a scholar of readings. Al-Harawi: attribution to the city of Herat, one of the mother cities of Khorasan, currently in the Republic of Afghanistan. Al-Makki: attribution to Mecca Umm al-Qura; because he traveled to it, took from its Sheikhs, and settled there until he died. Born in Herat around 930 AH, grew up there, sought knowledge, memorized the Holy Quran, perfected it under his Sheikh the Reciter Mu'in al-Din bin Al-Hafiz Zain al-Din Al-Harawi, and received principles of Sharia sciences from the Sheikhs of his time. Then he traveled to Mecca, where he settled, accompanied scholars for many years, continued acquiring knowledge, until he became one of the famous scholars. He was, may Allah have mercy on him, of Hanafi school, as known from his works and biography. He contributed to editing many issues of the Hanafi school and supporting them with legal evidences. He was known for religiosity, piety, and chastity. He used to eat from the work of his hand, minimizing worldly things, asceticism and chastity and contentment with subsistence prevailed over him. He had little mixing with people, much worship and piety. He used to write a Mushaf every year in his beautiful handwriting, adding readings and interpretation in the margins, sell it, and it sufficed him for his food for the whole year. He believed that getting close to rulers and accepting their grants harms sincerity and piety. He used to say: \"May Allah have mercy on my father, he used to tell me: I do not want you to become one of the scholars, fearing that you stand at the door of princes.\" Ended from \"Mirqat al-Mafatih\" (1/311). For more on his biography and news see: Al-A'lam by Al-Zirikli (5/12-13). Al-Ta'liq Al-Sabih 'ala Mishkat al-Masabih by Al-Kandhlawi (p. 6). Al-Ta'liqat Al-Saniyyah by Al-Laknawi (p. 8-9). Mulla Ali Al-Qari Fahras Mu'allafatihi wa Ma Kutiba 'anhu by Muhammad Abdul Rahman Al-Shamma'.\n5. Mirqat al-Mafatih Sharh Mishkat al-Masabih - Ali bin (Sultan) Muhammad, Abu Al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari: (4/1522).\n6. Al-Fath Al-Rabbani li Tartib Musnad Al-Imam Ahmad: Ahmad bin Abdul Rahman bin Muhammad Al-Banna Al-Sa'ati: 18/174. See: Fath al-Bayan fi Maqasid al-Quran - Muhammad Siddiq Khan: 1/31 and 15, 307. Hashiyat al-Shihab 'ala Tafsir al-Baydawi: 1/25. Tafsir Hada'iq al-Ruh wa al-Rayhan fi Rawabi Ulum al-Quran: Introduction: 96. Al-Tafsir min Sunan Saeed bin Mansur: 1/239. Mar'at al-Mafatih Sharh Mishkat al-Masabih: 7/334.\n7. For more see: Al-Itqan by Al-Suyuti (1/44).",
    "book_id": "944",
    "new_page_number": 17
  },
  {
    "serial_number": "1104271",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "clear in indication from his speech that the arrangement of Surahs is Tawqifi from him - peace be upon him.\n\nRequirement Two: Mentioning a number of sayings of contemporary scholars\nA group of contemporaries also preferred the view of Tawqif, and they include for example but not limited to the following:\n\"It came in Al-Tafsir Al-Wasit: The arrangement of Surahs according to what came in the Noble Mushaf is by the command of Allah Almighty.\" (1).\n1 - The author of Al-Tafsir Al-Wasit said: What the soul inclines to is that the arrangement of Surahs is Tawqifi, and that every Surah has its subjects which we see prominent in a way distinguishing it from others. (2)\n2 - And Wahba bin Mustafa Al-Zuhayli (d. 1436 AH) said: There is no disagreement among scholars that the arrangement of verses of Surahs is Tawqifi, transmitted, established from the Prophet, peace be upon him, just as the arrangement of Surahs is also Tawqifi according to the preponderant view. (3)\nAmong those who said so from contemporaries as well are Muhammad Abdullah Draz, Ahmad Shakir.\n\nSection Five: Prominent evidences used by some scholars for the divine ordainment of the Mushaf Arrangement\nIt has four requirements:\n\nRequirement One: The First Evidence: Consensus of the Companions - may Allah be pleased with them - on the arrangement of Surahs in the Uthmani Mushaf\nAmong the most prominent evidences some of these used for the Tawqif of the Mushaf arrangement is the following: If this arrangement were an Ijtihadi arrangement, they would not have agreed upon it and would have held onto their Mushafs and would not have offered them for burning, and would not have united on the Imam Mushaf. \"Uthman bin Affan - may Allah be pleased with him - burned the Mushafs in which disagreement occurred, and kept for them the Agreed Upon, as established in the Final Review.\" (4)\nIt is proven in Al-Bukhari from Anas bin Malik, may Allah be pleased with him, that Hudhayfa bin Al-Yaman, may Allah be pleased with him, came to Uthman, may Allah be pleased with him, while he was campaigning with the people of Sham in the conquest of Armenia and Azerbaijan with the people of Iraq. Hudhayfa was alarmed by their difference in recitation, so Hudhayfa said to Uthman: O Commander of the Faithful, save this nation before they differ in the Book like the difference of the Jews and Christians. So Uthman sent to Hafsa: Send us the sheets so we may copy them into the Mushafs, then we will return them to you. So Hafsa sent them to Uthman. He ordered Zaid bin Thabit, Abdullah bin Al-Zubair, Saeed bin Al-Aas, and Abdul Rahman bin Al-Harith bin Hisham, so they copied them into the Mushafs. Uthman said to the three Qurashi men: If you differ, you and Zaid bin Thabit, in anything of the Quran, write it in the dialect of Quraysh; for it was revealed in their dialect - meaning initially. So they did until they copied the sheets into the Mushafs, Uthman returned the sheets to Hafsa, and sent to every horizon a Mushaf of what they copied, and ordered that everything else of the Quran in every sheet or Mushaf be burned. (5) (6)",
    "foot_note": "1. Majma' al-Buhuth (10/2043).\n2. Al-Tafsir Al-Wasit by Muhammad Sayyid Tantawi (d. 1431 AH): (6/9). This interpretation is sometimes attributed to \"Tantawi\", and other times to a group of scholars under the supervision of the Islamic Research Academy at Al-Azhar, as is the case in the edition of: General Authority for Amiri Press Affairs Edition: First, (1393 AH = 1973 CE) - (1414 AH = 1993 CE) Number of Volumes: 10.\n3. Al-Tafsir Al-Munir by Al-Zuhayli (1/23). See: Kuwaiti Fiqh Encyclopedia: 14/181. And see: Arrangement of verses and Surahs of the Holy Quran - Dr. Muhammad Abu Zaid from his website. With modification.\n4. Al-Bidaya wa Al-Nihaya: by Ibn Kathir: (7/178).\n5. Narrated by Al-Bukhari, Hadith: (4987).\n6. Umar bin Ali bin Ahmad Al-Shafi'i, known as Ibn Al-Mulaqqin: (d. 804 AH) said: Meaning of (Yughazi) is conducting a raid/campaign. Arminiya: with Kasra on its beginning, Ibn Al-Sam'ani opened it (Fatha), and its Ya is lightened or stressed as Yaqut said. The authors of \"Al-Matali'\" said: Lightened only. Abu Ubaid said: A known country named for the Armenians being in it, a nation like the Romans. It was said: Named after Armon bin Lamti bin Yuman bin Japheth bin Noah. Abu Al-Faraj said: Whoever put Damma on the Hamza erred. He said: And with Kasra I read it to Abu Mansur the Linguist; he said: It is a non-Arabic name. It was established - as Al-Rashati said - in the year twenty-four in the caliphate of Uthman by the hand of Sulaiman bin Rabi'ah Al-Bahili. He said: Its people are Banu Al-Rumi bin Iram bin Shem bin Noah. And Azerbaijan - with Fatha on its beginning with shortening and extension, and Fatha on Ba and Kasra, and Kasra on Hamza also, narrated by Ibn Makki in his \"Tanqib\" - a country in the mountains from the lands of Iraq adjacent to the districts of Armenia from the West. Abu Ishaq Al-Buhayri said: The eloquent is Dharbijan. Al-Jawaliqi said: The Hamza in its beginning is original, because Adhar is added to the other. See: Al-Tawdih li Sharh Al-Jami' Al-Sahih: (24/20 - 25).",
    "book_id": "944",
    "new_page_number": 18
  },
  {
    "serial_number": "1104272",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Ali bin Abi Talib, may Allah be pleased with him, said: \"O people, do not go to extremes regarding Uthman, and say nothing but good for him regarding the Mushafs and burning the Mushafs. By Allah, he did not do what he did regarding the Mushafs except with consultation from us all.\" (1)\nThe saying of Ali bin Abi Talib, may Allah be pleased with him, indicates that they agreed upon it by silent consensus - may Allah be pleased with them all.\n\nStance of Ibn Masud - may Allah be pleased with him:\nIbn Kathir - may Allah have mercy on him - said: \"It was narrated about Abdullah bin Masud that he was angry when his Mushaf was taken from him and burned, and spoke about the precedence of his Islam over Zaid bin Thabit who wrote the Mushafs. So Uthman bin Affan - may Allah be pleased with him - wrote to him inviting him to follow the Companions in what they agreed upon of interest in that, uniting the word, and lack of difference. So Abdullah bin Masud returned (repented), and responded to following, and left opposition - may Allah be pleased with them all.\" (2)\nThe response of Ibn Masud - may Allah be pleased with him - to following in offering his Mushaf for burning reinforces what we mentioned earlier of the saying of Ali bin Abi Talib - may Allah be pleased with him. It strengthens, confirms, and reinforces the saying of silent consensus on one hand, and establishes the actual consensus on the other hand as well. May Allah be pleased with them all.\nRegarding that, Al-Zarqani (d. 1367 AH) says in his \"Manahil\" - while reviewing the evidences of those saying Tawqif: \"That the arrangement of all Surahs is Tawqifi by the teaching of the Messenger - peace be upon him - like the arrangement of verses, and that no Surah was placed in its position except by his command, peace be upon him. The proponents of this opinion argued that the Companions agreed on the Mushaf written in the era of Uthman and none of them dissented. Their consensus is not complete unless the arrangement they agreed upon was from Tawqif (instruction), because if it were from Ijtihad, the owners of differing Mushafs would have held onto their difference. But they did not hold onto it, rather they turned away from it and their arrangement, and turned away from their Mushafs and burned them and returned to Uthman's Mushaf and its arrangement entirely. Then they cited narrations for their doctrine as evidences on which consensus relies.\" (3)\nEven if we conceded for the sake of argument that the arrangement of the Mushaf was initially an Ijtihadi arrangement not Tawqifi, we would say that the consensus of the Ummah has settled on the Mushaf arrangement. Even all books of Tafsir are on this matter; we do not know of any dissenter among them from the Predecessors and Successors, but three individuals from the contemporaries deviated from that (4). Therefore, it is not permissible, the case being so, to breach this work upon which the Ummah agreed. The meaning by that is books of Tafsir, because the matter of Mushafs, no one dares to oppose it at all except what some Orientalists called for as will be explained.\n\nRequirement Two: The Second Evidence: The partitioning (Tahzib) of the Quran by the Companions - may Allah be pleased with them\nAmong what they used as evidence also that the arrangement of Surahs is Tawqifi is the partitioning of the Quran. In...",
    "foot_note": "1. Al-Masahif by Ibn Abi Dawood p. 96. Kitab al-Masahif Author: Abu Bakr bin Abi Dawood, Abdullah bin Sulaiman bin Al-Ash'ath Al-Azdi Al-Sijistani (Died: 316 AH) Investigator: Muhammad bin Abduh Publisher: Al-Faruq Al-Haditha - Egypt/Cairo Edition: First, 1423 AH - 2002 CE Number of Parts: 1\n2. Al-Bidaya wa Al-Nihaya by Ibn Kathir: (7/228). With slight modification. Al-Bidaya wa Al-Nihaya Author: Abu Al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Publisher: Dar Al-Fikr Year of Publication: 1407 AH - 1986 CE Number of Parts: 15.\n3. See: Manahil al-Irfan: (1/354)\n4. As for the Successors (Khalaf): Three individuals initiated a breach of this consensus, so they wrote their commentaries according to the chronological order, leaving the Mushaf arrangement upon which is the practice of the Salaf and the consensus of the Ummah settled. As for the three commentaries, they are:\n1 - Tafsir Bayan al-Ma'ani: which is \"Interpretation of the Wise Book of Allah according to Revelation by Abdul Qadir Mulla Huwaish\".\n2 - Al-Tafsir Al-Hadith: by \"Muhammad Izzat Darwaza\"\n3 - The book \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by \"Abdul Rahman Habannaka Al-Maydani\" and discussion on them will come in detail in the following pages, God willing.",
    "book_id": "944",
    "new_page_number": 19
  },
  {
    "serial_number": "1104273",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "this regard, Al-Hafiz Ibn Hajar (d. 852 AH) - may Allah Almighty have mercy on him - says: \"Among what indicates that the arrangement of the Mushaf was Tawqifi is what Ahmad and Abu Dawood and others narrated from Aws bin Abi Aws, from Hudhayfa Al-Thaqafi who said: I was in the delegation of Thaqif who embraced Islam... and in it... So we asked the Companions of the Messenger of Allah, peace be upon him, we said: How do you partition the Quran? They said: We partition it: three Surahs, five Surahs, seven Surahs, nine Surahs, eleven, thirteen, and the section of Mufassal from 'Qaf' until we finish.\" Then Ibn Hajar said: \"This indicates that the arrangement of Surahs as it is in the Mushaf now was in the era of the Prophet - peace be upon him.\" (1)\nThis is also a clear evident proof mentioned by Al-Hafiz in Al-Fath and used as evidence that the arrangement of Surahs as it is in the Mushaf now was likewise in the era of its first revelation during the time of the Prophet, peace be upon him.\n\nRequirement Three: The Third Evidence: The ordinal organization of some Surahs similar in their opening\nRegarding that, Al-Suyuti - may Allah Almighty have mercy on him - says: \"And among what indicates that it is Tawqifi is that the Hawamim were arranged successively 'meaning consecutively', and likewise the Tawasin, while the Musabbihat were not arranged successively; rather separation occurred between their Surahs. And separation occurred between 'Ta-Sin-Mim' of Poets (Al-Shu'ara) and 'Ta-Sin-Mim' of Stories (Al-Qasas) with 'Ta-Sin' (Al-Naml) even though it is shorter than both. If the arrangement were Ijtihad, the Musabbihat would have been mentioned successively, and 'Ta-Sin' would have been delayed after Al-Qasas.\" (2)\nIt was mentioned earlier when presenting the sayings of those arguing for the Tawqif of Surah arrangement. This precise arrangement mentioned by Al-Suyuti for Surahs similar in their opening and beginning and the manner of their order and succession with that extreme precision of \"Al Ha-Mim\" Surahs and \"Al Ta-Sin-Mim\" Surahs, since the seven \"Al Ha-Mim\" Surahs were arranged successively, as well as the three \"Al Ta-Sin-Mim\" Surahs. As for the seven Musabbihat Surahs, despite the similarity of their opening, they did not come consecutively. And his saying: (And Ta-Sin was delayed) means Al-Naml opened with (Ta-Sin) was delayed after Al-Qasas so it came after it [Actually Al-Naml is before Al-Qasas, context suggests he meant Ta-Sin was placed between the two Ta-Sin-Mims instead of putting the two Ta-Sin-Mims together], it occurred between Surah Al-Shu'ara and Al-Qasas which are similar in opening with (Ta-Sin-Mim). He evidenced by that that the arrangement of Surahs is Tawqifi without doubt. This is an inference from Al-Suyuti that has its strength, validity, and authoritativeness.\nThe Hawamim Surahs are: The Surahs possessing \"Al Ha-Mim\".\nThe Tawasin or Tawasim Surahs are: The Surahs possessing \"Al Ta-Sin-Mim\". They were pluralized irregularly.\nAs for \"Al Ha-Mim\" Surahs: They are the seven \"Al Ha-Mim\" Surahs that opened with \"Ha-Mim\", and they are Surahs: 1 - Ghafir 2 - Fussilat 3 - Al-Shura 4 - Al-Zukhruf 5 - Al-Dukhan 6 - Al-Jathiyah 7 - Al-Ahqaf.\nAl-Kumait bin Yazid (3) said:\nWe found for you in the family of Ha-Mim a verse ... Interpreted from us by a pious and parsing one (4)",
    "foot_note": "1. Fath al-Bari: Ibn Hajar Al-Asqalani Vol 9 p 42, 43.\n2. Al-Itqan: Al-Suyuti Vol 1 p 63.\n3. Al-Kumait bin Zaid Al-Asadi, kunya Abu Al-Mustahill, (60 AH - 126 AH) an Arab poet from the tribe of Banu Asad and one of the most famous poets of the Umayyad era, lived in Kufa and was famous for Shi'ism and his poems in that called Al-Hashimiyyat. See Free Encyclopedia - Wikipedia.\n4. The verse is by Al-Kumait bin Zaid Al-Asadi, Majaz al-Quran by Abu Ubaidah: (218 - 1) and his Diwan Encyclopedia Edition in Cairo 18. Al Ha-Mim and Dhawat Ha-Mim: Surahs beginning with \"Ha-Mim\". Al-Hariri stated in Durrat al-Ghawwas that it is said: Al Ha-Mim, and Dhawat Ha-Mim, and Al Ta-Sin-Mim, and it is not said: Hawamim nor Tawasim.",
    "book_id": "944",
    "new_page_number": 20
  },
  {
    "serial_number": "1104274",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "They are according to the Mushaf arrangement as follows:\nFirst: (Ha, Meem. (1) The revelation of the Book is from Allah, the Exalted in Might, the Knowing (2)) [Ghafir].\nSecond: (Ha, Meem. (1) [This is] a revelation from the Entirely Merciful, the Especially Merciful (2)) [Fussilat].\nThird: (Ha, Meem. (1) 'Ayn, Seen, Qaf (2)) [Al-Shura].\nFourth: (Ha, Meem. (1) By the clear Book (2)) [Al-Zukhruf].\nFifth: (Ha, Meem. (1) By the clear Book (2)) [Al-Dukhan].\nSixth: (Ha, Meem. (1) The revelation of the Book is from Allah, the Exalted in Might, the Wise (2)) [Al-Jathiyah].\nSeventh: (Ha, Meem. (1) The revelation of the Book is from Allah, the Exalted in Might, the Wise (2)) [Al-Ahqaf]. \"And 'Ha-Mim' may be made a name for the Surah and admits grammatical inflection but is not fully declined (diptote).\" (1)\n\nAs for \"Al Ta-Sin-Mim\" Surahs: They are the Surahs opening with (Ta-Sin-Mim) or (Ta-Sin), and they are three Surahs: 1 - Al-Shu'ara 2 - And Al-Naml 3 - And Al-Qasas. They are according to the Mushaf arrangement as follows:\nFirst: (Ta, Seen, Meem. (1) These are the verses of the clear Book) [Al-Shu'ara].\nSecond: (Ta, Seen. These are the verses of the Qur'an and a clear Book (1) As guidance and good tidings for the believers (2)) [Al-Naml].\nThird: (Ta, Seen, Meem. (1) These are the verses of the clear Book (2)) [Al-Qasas].\nAbu Ubaidah recited:\nBy the Tawasim which have been tripled ... And by the Hawamim which have been septupled (2)\nHe means by his saying: \"have been tripled\" that they are three Surahs, and by his saying: \"have been septupled\" that they are seven Surahs.\n\nAs for Al-Musabbihat, they are the Surahs opening with Tasbih (Glorification), and they are seven Surahs: 1 - Al-Isra. 2 - Al-Hadid. 3 - Al-Hashr. 4 - Al-Saff. 5 - Al-Jumu'a. 6 - Al-Taghabun. 7 - Al-A'la.\nThey are according to the Mushaf arrangement as follows:\nFirst: (Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed) (1) [Al-Isra].\nSecond: (Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Hadid].\nThird: (Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Hashr].\nFourth: (Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise) (1) [Al-Saff].\nFifth: (Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise) (1) [Al-Jumu'a].\nSixth: (Whatever is in the heavens and whatever is on the earth exalts Allah. His is the dominion, and to Him belongs [all] praise, and He is over all things competent) (1) [Al-Taghabun].",
    "foot_note": "1. See: Zad al-Masir: 7/204 - 205.\n2. See: Zad al-Masir: 7/204 - 205, Jamal al-Qurra: 1/34 - 36.",
    "book_id": "944",
    "new_page_number": 21
  },
  {
    "serial_number": "1104275",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "Seventh: (Exalt the name of your Lord, the Most High) (1) [Al-A'la].\n\nRequirement Four: Summary of the sayings and evidences of scholars who say that the arrangement of Surahs is divinely ordained\nAfter clarifying the review of the sayings and evidences of those saying that the arrangement of Surahs is Tawqifi and judging them, the following becomes clear to us:\nFirst: The strength of their evidences, their authoritativeness, their validity, and their preponderance.\nSecond: That the Mushaf arrangement of Surahs upon which the Imam Mushaf settled is the one agreeing with what is established in the Preserved Tablet without doubt. It is what the Companions, may Allah be pleased with them, agreed upon, and the Ummah received with acceptance. It is obligatory to hold onto it, cling to it, act by it, and not deviate from it, whether this arrangement is Tawqifi or Ijtihadi, with the rejection of biased calls calling for rearranging the Mushaf chronologically or thematically, and rejecting any call similar to those false, degraded calls like those calls that issued from some Orientalists who will be mentioned and those who were influenced by them, followed them, and advocated their idea from some contemporaries as well.\n\nSection Six: The beginning of opposing and contradicting the Mushaf arrangement with the chronological arrangement and clarifying its source\nIt has three requirements:\n\nRequirement One: The first to oppose and contradict the Mushaf arrangement with the chronological arrangement\nA group of Orientalists attacked this arrangement, and there is no surprise in that, for this is their habit and custom. But when a group of our own skin and those belonging to our Qibla attack this arrangement, here comes the wonder!\nFor \"Each of Sheikh 'Abdul Qadir Mulla Huwaish', and Professor 'Muhammad Izzat Darwaza', and they are (contemporaries), admitted that the arrangement of Surahs in the Mushaf is Tawqifi and it is not permissible to violate this arrangement, because it was by revelation from Allah to Gabriel to the Messenger of Allah - peace be upon him.\" (1)\nDespite that, they violated the Tawqifi arrangement in their two commentaries, and argued that the method of dealing with interpretation differs from the Mushaf arrangement, and they presented excuses that do not constitute an argument nor clarify a path.\nBoth \"Huwaish\" and \"Darwaza\" dictated a contemporary commentary that each of them arranged chronologically, not according to the Mushaf order. \"Huwaish\" is the spearhead who started this grave matter, as he is the first to approach this work in which he opposed what the Imams of Tafsir and masters of composition and interpretation followed, predecessors and successors, as will be clarified and explained in its subject. Then \"Darwaza\" followed him, and Sheikh \"Habannaka Al-Maydani\" followed them both in this work, as will be discussed regarding those commentaries with some detail, clarification, and explanation.",
    "foot_note": "1. See: Bayan al-Ma'ani 1/3, and Al-Tafsir Al-Hadith 1/9. Tafasir Hasab Tartib al-Nuzul fi al-Mizan: Dr. Mustafa Muslim. Article from Ahl al-Tafsir website, date: 15/12/1432 AH. With slight modification to organize the speech only.",
    "book_id": "944",
    "new_page_number": 22
  },
  {
    "serial_number": "1104276",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "All of them thereby breached the consensus of the Ummah on following the Mushaf arrangement upon which is the work of the Imams of Tafsir from the Predecessors and Successors. To the extent of the researcher's knowledge and narrow information, no one ever preceded them to this work from this Ummah, except what was from the call and appeal of some Orientalists to rearrange the Quran chronologically, in an effort by them to spread doubts about the Quran and to shake confidence in the Book of Allah, especially in the souls of future generations.\n\nRequirement Two: The most prominent Orientalists calling for rearranging the Quran chronologically\nA group of Orientalists opposed the Mushaf arrangement, requesting and calling for rearranging the Quran chronologically. Indeed, some of them did that then regretted and retreated when their hoped-for aim from behind that was not achieved.\nAmong the most prominent of these Orientalists:\n1 - The German Orientalist Gustav Leberecht Flügel: (d. 1278 AH).\n2 - The Jewish German Orientalist Gustav Weil: (d. 1306 AH).\n3 - The German Orientalist Friedrich Schwally: (d. 1338 AH), who is a student of Theodor Nöldeke.\n4 - The Sheikh of German Orientalists Theodor Nöldeke: (d. 1349 AH). He is among the first Orientalists who raised the issue of rearranging the Holy Quran, \"according to the order of revelation\". He spent a large part of his life, relying on the book of Abu Al-Qasim Umar bin Muhammad bin Abdul Kafi from the men of the fifth century. (1) It is said that he regretted at the end of his life the great effort he exerted in a science in which one cannot reach definitive results due to the difference and conflict of narrations.\n5 - The English Orientalist David Samuel Margoliouth: (d. 1358 AH).\n6 - The French Orientalist Régis Blachère: (d. 1393 AH). \"Blachère\" undertook (as he claimed) translating the Holy Quran into French in 1371 AH-1950 CE. The truth is that translation is completely impossible for many reasons that cannot be mentioned here, and what can be translated is only the meanings of the Quran. \"Blachère\" arranged that alleged translation according to the order of revelation at first. Then after seven years of his contemplation, the lack of correctness and utility of his first method which he used, namely the arrangement according to the order of revelation, was proven to him, so he rearranged this translation of his according to the Mushaf arrangement.\n\nRequirement Three: The most prominent contemporaries influenced by Orientalists\nSome contemporaries were influenced by these disbelieving Orientalists as well, and among the likes of",
    "foot_note": "1. See: Tarikh al-Quran by Abu Abdullah Al-Zanjani: (p. 71).",
    "book_id": "944",
    "new_page_number": 23
  },
  {
    "serial_number": "1104277",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "these:\n1 - Yusuf Rashid who says: \"The arrangement of the Quran in its current situation confuses thoughts and wastes the benefit of the Quran's revelation, because it contradicts the method of legislative graduation observed in the revelation. It corrupts the system of natural sequence of the idea, because the reader if he moves from a Meccan Surah to a Medinan Surah collides a violent collision, and moves without preparation to an atmosphere strange to the atmosphere he was in. He becomes like one moving from a lesson in alphabet letters to a lesson in rhetoric.\" (1) He also has a treatise under the title: \"Arrange the Quran as Allah revealed it\". Allah raised Dr. Muhammad Abdullah Draz - may Allah have mercy on him - against it, so he refuted it with a report he submitted to the administration of Al-Azhar. (2)\n2 - And Mirza Baqir Al-Asku'i Al-Ha'iri Al-Rafidi (d. 1301 AH).\n3 - And Dr. Yusuf Siddiq Al-Tunisi (contemporary) born (1362 AH), he is a philosopher and anthropologist.\n4 - And Aisha bint Abdul Rahman known as \"Bint al-Shati\" (d. 1419 AH) who has Al-Tafsir Al-Bayani lil-Quran, issued in two parts in which she addressed the interpretation of some Surahs of the Quran.\n5 - Muhammad Abed Al-Jabri (d. 1431 AH), in his book: \"Fahm al-Quran al-Hakim: Al-Tafsir al-Wadih Hasaba Tartib al-Nuzul\" (Understanding the Wise Quran: The Clear Interpretation According to the Order of Revelation). It is the topic discussed by \"Al-Jabri\" in the tenth and last chapter of the second section of his book: \"Madkhal ila al-Quran al-Karim\" (Introduction to the Holy Quran), Publisher: Center for Arab Unity Studies - Beirut Edition: Second, Year of Printing 2007 CE, Number of Pages 456.\nAl-Jabri is considered one of the figures of the contemporary Westernizing Modernist current in the Arab Maghreb. Allah prepared for refuting him and debunking his false claims two studies by two noble researchers.\nAs for the first study: It is \"The Holy Quran between the Mushaf Arrangement and the Revelation Arrangement\", a critical methodological study in the Mushaf and historical arrangement of the Quran, authored by Dr. Said Bou Assab.\nThat study is considered among the modern writings in Quranic sciences. It is a publication of the Center for Quranic Studies affiliated with the Muhammadiya Association of Scholars in Morocco, First Edition, 1438 AH / 2017 CE in a medium volume consisting of 168 pages. It is also a publication of: Dar Al-Aman for Publishing and Distribution, date: 06/06/2017 CE - as well. Its author is a professor of Tafsir and Quranic Sciences at Al-Qarawiyyin University, Faculty of Sharia Sciences in Smara.\nAs for the second study: It is \"Arrangement of Quran Surahs according to their revelation in Al-Jabri's thought\" Presentation, Analysis, and Criticism, by Dr. Sabri Abdul Aziz Mansour Siam, Assistant Professor of Tafsir and Quranic Sciences at the Faculty of Arabic and Islamic Studies for Boys in Cairo, at Al-Azhar and Tabuk Universities. It is published in \"Volume One of Issue Thirty-Six of the Yearbook of the Faculty of Islamic Studies for Girls in Alexandria (n.d.).\n\nGeneral Studies on Al-Jabri's Commentary:\nAllah has also facilitated other critical studies on Al-Jabri's commentary, the most prominent of which were:\nStudy One: A- \"Fabrications of Al-Jabri on Tafsir and Exegetes through his book Fahm al-Quran al-Hakim\" a critical study by: Muhammad bin Abdul Aziz bin Abdullah Al-Musnad, issued by: Tibyan Journal for Quranic Studies, which is a \"refereed journal\" affiliated with the Saudi Scientific Association for the Holy Quran and its Sciences, in its issue: 25, pages: 173 - 233, for the year 1438 AH - 2018 CE.\nStudy Two: \"The Clear Commentary According to the Order of Revelation by 'Muhammad Abed Al-Jabri', an Analytical Critical Study.\" This study is a scientific thesis by which researcher Ahlam Khalifa Abdullah Al-Suway'i obtained a PhD degree in Arabic Studies and Literature - Islamic Studies Division - at Ain Shams University, in 1438 AH-2017 CE.\nStudy Three: \"The Question of Method in Understanding the Holy Quran and Interpreting it according to Muhammad Abed Al-Jabri through his book Understanding the Wise Quran: The Clear Commentary According to the Order of Revelation,\" an analytical critical study by Hassan Ghamari. The researcher did not find details for this study.\n\nChapter Two: Presentation, Study, and Discussion of the Three Commentaries Arranged According to the Order of Revelation\nThe Three Commentaries are:\n1 - Tafsir Bayan al-Ma'ani: which is \"Interpretation of the Wise Book of Allah according to Revelation by 'Huwaish'\".\n2 - Al-Tafsir Al-Hadith: by \"Darwaza\".\n3 - The book \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by \"Habannaka Al-Maydani\".\nIt has three sections:\nA brief look must be cast on those commentaries which breached the consensus of the Ummah in this grave matter, and they come in the following sections as follows:\n\nSection One: Presentation, study, and discussion of the first commentary \"Bayan al-Ma'ani by Abdul Qadir Mulla Huwaish\" (d. 1398 AH)\nIt has six requirements:\n\nRequirement One: Definition of the commentary \"Bayan al-Ma'ani\" and its author \"Mulla Huwaish\"\nAs for the commentary, it is \"Interpretation of the Wise Book of Allah according to Revelation by Huwaish\". This commentary is considered the first of its kind to date within the limits of what we know, and within the scope of what reached our knowledge.\nHuwaish is: Abdul Qadir bin Mulla Huwaish Al-Sayyid Mahmoud Al-Ghazi",
    "foot_note": "1. Article: \"Technical Criticism of the Project of Arranging the Holy Quran According to its Revelation\", Abdullah Draz, Al-Azhar Magazine, Editor-in-Chief: Muhammad Farid Wajdi Bey, under the administration of the Diwan of Administration for Al-Azhar and Religious Institutes, Cairo, Issue of Ramadan year (1370 AH/1950 CE, Vol 22). Al-Azhar Press, p: 784.\n2. This refutation was published in \"Kunuz al-Quran\" magazine in October 1951 issue. See: Al-Jam' al-Sawti lil-Quran: (p. 359) and footnote (1).",
    "book_id": "944",
    "new_page_number": 24
  },
  {
    "serial_number": "1104278",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Al-Ghazi (d. 1398 AH) Al-Ani (1) Al-Deirzori (2) Al-Furati. (3) He is Hanafi Ash'ari. \"He was accused of being a 'Naqshbandi Sufi', but his son denied that and informed that he used to go to the Sheikh of the Naqshbandi order and host him in our house\". (4) Only that!!\nHis book was printed in its first edition at Al-Taraqqi Press in Damascus in the year: 1382 AH - 1965 CE, in twelve parts collected in six large volumes. Would that it had not been printed.\n\nRequirement Two: The books upon which \"Huwaish\" relied in his commentary\n\nA- Books of Tafsir upon which \"Huwaish\" relied\nHe relied in his commentary on a number of Tafsir books, including:\n1 - Tafsir Al-Khazin: \"Lubab al-Ta'wil fi Ma'ani al-Tanzil\". Al-Khazin is: Ala al-Din Ali bin Muhammad bin Ibrahim bin Umar Al-Shihi Abu Al-Hasan, known as Al-Khazin (d. 741 AH).\n2 - Tafsir Al-Nasafi: \"Madarik al-Tanzil wa Haqa'iq al-Ta'wil\". Al-Nasafi is: Abu Al-Barakat Abdullah bin Ahmad bin Mahmoud Hafiz al-Din Al-Nasafi (d. 710 AH).\n3 - Tafsir Al-Baghawi: \"Ma'alim al-Tanzil fi Tafsir al-Quran\". Al-Baghawi is: Abu Muhammad Al-Hussein bin Mas'ud Al-Baghawi (d. 510 AH).\n4 - Tafsir Al-Nakhjuwani: \"Al-Fawatihw al-Ilahiyyah wa al-Mafatih al-Ghaybiyyah al-Muwadidhah lil-Kalim al-Quraniyyah wa al-Hikam al-Furqaniyyah\". Al-Nakhjuwani is: Ni'matullah bin Mahmoud Al-Nakhjuwani and is known as Sheikh Alwan (d. 920 AH).\n5 - Tafsir Abu Al-Saud: \"Irshad al-Aql al-Salim ila Mazaya al-Kitab al-Karim\". Abu Al-Saud is: Muhammad bin Muhammad bin Mustafa Al-Imadi (d. 982 AH).\n6 - Tafsir Ruh al-Bayan by Al-Khalwati: \"Ruh al-Bayan fi Tafsir al-Quran\". Al-Khalwati is: Ismail Haqqi bin Mustafa Al-Istanbuli Al-Hanafi Al-Khalwati, Al-Mawla Abu Al-Fida (d. 1127 AH).\n7 - Tafsir Ruh al-Ma'ani by Al-Alusi: \"Ruh al-Ma'ani fi Tafsir al-Quran al-Azim wa al-Sab' al-Mathani\". Al-Alusi is: Shihab al-Din Mahmoud bin Abdullah Al-Husseini Al-Alusi (d. 1270 AH).\n8 - Tafsir Al-Baydawi: \"Anwar al-Tanzil wa Asrar al-Ta'wil\". Al-Baydawi is: Nasir al-Din Abu Saeed Abdullah bin Umar bin Muhammad Al-Shirazi Al-Baydawi (d. 685 AH).\n9 - Tafsir Al-Kashshaf by Al-Zamakhshari the Mu'tazilite: \"Al-Kashshaf 'an Haqa'iq Ghawamid al-Tanzil\". Al-Zamakhshari is: Abu Al-Qasim Mahmoud bin Amr bin Ahmad, Al-Zamakhshari Jar Allah (d. 538 AH).",
    "foot_note": "1. Attributed to the Iraqi city of Anah adjacent to the Syrian border, which is his birthplace.\n2. Attribution to the Syrian city of Deir ez-Zor where he learned, which is located on the eastern border of Iraq.\n3. Sheikh Abdul Qadir Mulla Huwaish, preacher, author, jurist, judge, and interpreter of the Quran, one of the notable scholars of Iraq. See: Free Encyclopedia \"Wikipedia\", quoted from Shamela.\n4. See: Al-Tafsir wa al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi al-Asr al-Hadith. Dr. Fadl Hasan Abbas: (3/250). Dar Al-Nafa'is - Amman - Jordan, 1st ed., 1437 AH.",
    "book_id": "944",
    "new_page_number": 25
  },
  {
    "serial_number": "1104279",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "10 - Tafsir Muhyiddin Ibn Arabi the Sufi: \"Ara'is al-Bayan fi Haqa'iq al-Quran\". Ibn Arabi is: Abu Bakr Muhyiddin Muhammad bin Ali bin Muhammad bin Ahmad bin Abdullah Al-Hatimi Al-Ta'i Al-Andalusi (d. 638 AH).\n\nB- Fiqh books upon which \"Huwaish\" relied\nAmong the Fiqh books he relied upon:\n1 - Al-Mabsut by Al-Sarkhasi. Al-Sarkhasi is: Muhammad bin Ahmad bin Abi Sahl Shams al-A'immah Al-Sarkhasi (d. 483 AH).\n2 - Radd al-Muhtar 'ala al-Durr al-Mukhtar, and its gloss (Hashiyah) by Ibn Abidin. Ibn Abidin is: Muhammad Amin bin Umar bin Abdul Aziz Abidin Al-Dimashqi Al-Hanafi (d. 1252 AH).\n3 - Sharh Mukhtasar al-Tahawi by Al-Jassas. Al-Jassas is: Ahmad bin Ali Abu Bakr Al-Razi Al-Jassas Al-Hanafi (d. 370 AH). Al-Tahawi is: Abu Ja'far Ahmad bin Muhammad bin Salamah bin Salamah Al-Azdi Al-Tahawi (d. 321 AH).\n\nC- Sufi books upon which \"Huwaish\" relied\nAmong the Sufi books he relied upon:\n1 - Awarif al-Ma'arif by Shihab al-Din Umar Al-Suhrawardi (d. 632 AH).\n2 - Al-Bahjah al-Saniyyah by Muhammad bin Abdullah Al-Khani Al-Khalidi Al-Naqshbandi (1279 AH).\n3 - And Nur al-Hidayah wa al-Irfan by As'ad Al-Sahib, who is: As'ad bin Mahmoud Al-Kurdi Al-Shahrazuri Al-Dimashqi Al-Naqshbandi (d. 1374 AH).\n4 - And Al-Insan al-Kamil by Abdul Karim nicknamed \"Al-Jili or Al-Jilani\" (d. 826 AH).\n5 - Ihya Ulum al-Din by Al-Ghazali (d. 505 AH), and Al-Risalah Al-Qushayriyyah fi al-Tasawwuf by Abu Al-Qasim Al-Qushayri (d. 465 AH).\n\nD- Books upon which \"Huwaish\" relied in editing Meccan and Medinan Surahs and Readings\nHe relied in editing Meccan and Medinan Surahs and Readings on the following books:\n1 - Kitab Adad Suwar al-Quran, wa Ayatihi wa Kalimatihi wa Hurufihi wa Talkhis Makkihi min Madanihi by Abu Al-Qasim Umar bin Muhammad bin Abdul Kafi (d. 400 AH).\n2 - Kitab Nazimat al-Zahr by Imam Ibn Firruh - with Kasra on Fa, Sukun on Ya, and Shadda on Ra - Al-Shatibi (d. 590 AH) and its explanation by Abu Eid Ridwan Al-Mukhallalati (d. 1311 AH). (1).\n3 - Kitab Irshad al-Qurra' wa al-Katibin by Al-Mukhallalati also (2).\n\nRequirement Three: His method in interpretation\nHis method in interpretation is to start with the name of the first Surah by revelation, then the one following it",
    "foot_note": "1. He is: Ridwan bin Muhammad bin Sulaiman, Abu Eid, known as Al-Mukhallalati, a scholar of readings. Among his works: Fath al-Muqfalat, Shifa' al-Sudur, and Al-Qawl al-Wajiz fi Fawasil al-Kitab al-Aziz. Died in 1311 AH = 1893 CE. (Al-A'lam by Al-Zirikli: (3/53)).\n2. See: Bayan al-Ma'ani, Vol 1/4. With modification, Bayan al-Ma'ani [Arranged according to order of revelation] Author: Abdul Qadir bin Mulla Huwaish Al-Sayyid Mahmoud Al-Ghazi Al-Ani (Died: 1398 AH) Publisher: Matba'at Al-Taraqqi - Damascus Edition: First, 1382 AH - 1965 CE.",
    "book_id": "944",
    "new_page_number": 26
  },
  {
    "serial_number": "1104280",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "in chronological order of revelation. Then mentioning its meaning and indicating other names if more than one name was narrated for it, the number of its verses, words, and letters, mentioning its abrogating and abrogated verses, then indicating the words with which the Surah began or ended, its repetition, or number of repetitions, place of revelation, date of revelation, and the opinions regarding it. Then he enters into the interpretation of the verse, a rhetorical analytical interpretation.\nHis methodology in interpreting the verse was dividing researches into subjects, segmented; quoting opinions titled with the transmitter's name; citing traditions and poems as support; and quoting words of Gnostics and Sufis as confirmation (1).\n\nRequirement Four: The first study about this commentary\nAlaa Muhammad Saeed summarized this commentary \"Bayan al-Ma'ani\", printed by Maktabat Abi Ayyub Al-Ansari in Damascus, 1st ed., 1427 AH-2006 CE. (2) Would that he had limited himself to studying it, refuting it, and rearranging it according to the Mushaf order, instead of summarizing it.\n\nRequirement Five: A brief critical study of \"Huwaish's\" commentary\nThis commentary has been severely criticized, and many major objections and severe calamities were taken against it and its compiler, even one of which would be sufficient. Among the most prominent are:\n1 - Contradiction of his style and its weakness.\n2 - His opposition to the explicit Quran and authentic Sunnah in many places of his book.\n3 - His diverting many texts from their indications.\n4 - His citation of some Israeliyyat (Biblical narratives), like those in which the Children of Israel slander their prophets.\n5 - His belief in the validity of some flimsy, fabricated, and denounced stories like the story of the Cranes (Gharaniq). Had he read some of what one of the nation's luminaries wrote about that, it would have sufficed him. (3)\n6 - His inclusion of superstitions and his excessive indulgence in them, and this is a prominent feature in his commentary.\n7 - His contradiction in affirming the vision of Allah Almighty, negation and affirmation.\n8 - His clear confusion accompanied by his weakness in the interpretive craft.\n9 - His ignorance of the axioms of the language in which the Quran was revealed.\n10 - His lack of knowledge of history and his ignorance of it.\n11 - Strangeness and bringing wonders.\n12 - His rejection of consensus.\n13 - His ignorance of the Sunnah and his rejection of it, his weakening of authentic established Hadiths, his citation of fabricated ones, and his attacking Sahih Al-Bukhari and Muslim, which are the most authentic classified books and which the Ummah received with acceptance. (4).",
    "foot_note": "1. For more, see: Bayan al-Ma'ani, Vol 1/204 and 422 and 481.\n2. - For more, see: Al-Mufassirun Hayatuhum wa Manhajuhum: Muhammad Ali Ayazi: Vol 1, pp. 324-329. With attention and extreme caution because the writer is a Rafidi (Shia) and also produced a book like its writer, containing mixing and falsehoods only Allah knows. Sheikh al-Islam, may Allah have mercy on him, said: \"And the Rafidah are a forsaken nation, having no sound reason, nor explicit tradition, nor accepted religion, nor victorious world.\" Minhaj al-Sunnah (8/479). And he said - may Allah have mercy on him also: \"The lies of the Rafidah are not accepted by most rational disbelievers!!!\" Dar' Ta'arud al-Aql wa al-Naql: (7/72).\n3. - Like the book \"Nasb al-Majaniq li-Nasf Qissat al-Gharaniq\" by the Muhaddith of the era Abu Abdul Rahman Muhammad Nasir al-Din, bin Al-Hajj Nuh bin Najati bin Adam, Al-Albani (Died: 1420 AH) Publisher: Al-Maktab Al-Islami.\n4. - For more, one can view a critique similar to this criticism and perhaps exceeding it in what he mentioned in criticizing his commentary, Dr. Fadl Hasan Abbas in his book: Al-Tafsir wa al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi al-Asr al-Hadith (3/245 onwards), Dar Al-Nafa'is - Amman - Jordan, 1st ed., 1437 AH. He indicated the places of his criticism in the book \"Bayan al-Ma'ani\" by Abdul Qadir Mulla Huwaish.",
    "book_id": "944",
    "new_page_number": 27
  },
  {
    "serial_number": "1104281",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Al-Nawawi, may Allah have mercy on him, said: \"Scholars agreed that the most authentic books after the Glorious Quran are the two Sahihs of Al-Bukhari and Muslim, and the Ummah received them with acceptance.\" (1)\nIbn Tahir Al-Qaysarani (d. 507), may Allah have mercy on him, said: \"Muslims unanimously agreed on accepting what was extracted in the \"Two Sahihs\" by Abu Abdullah Al-Bukhari and Abu Al-Hussein Muslim bin Al-Hajjaj Al-Naysaburi, or what met their conditions but they did not extract.\" (2)\nFinally, \"This comprehensive preventive commentary, as its owner described it, which the sons of our era were in dire need of. Truly, it is indeed comprehensive, but for everything strange, harmful, denounced, and fabricated. And it is indeed preventive as well, but for everything in it for the people of this era of good in their religion and world. It should be blocked between this book and the people of this era. Its owner attacks the most authentic books after the Book of Allah, yet he filled his book with what is far, all distance, from interpretation and its meaning. After that, I see no reason to evaluate this commentary, for its texts are its best evaluator. If Al-Khazin, as some call him, is a treasurer (Khazin) of Israeliyyat as was said, then our interpreter is a reservoir not only for Israeliyyat, but for fabricated and denounced Hadiths which Al-Khazin and others refrain from mentioning. If Al-Tha'alibi is a wood gatherer at night as Sheikh al-Islam Ibn Taymiyyah (d. 728 AH) says, then our interpreter is a wood gatherer in a pitch-black night. Finally, such a commentary requires from scholars care and supervision over what is written about the Book of Allah. We ask Allah to spare us slipping in word and deed and to make us vigilant regarding this and its likes. There is no power nor strength except by Allah, the Most High, the Great.\" (3)\nThere is no doubt that Mulla Huwaish did not do that and undertake it except for motives he saw and was convinced of. He said in the introduction of his commentary Bayan al-Ma'ani: \"Know that Caliph Uthman - may Allah be pleased with him - and those with him from the Companions only did not take his opinion - i.e., the opinion of Imam Ali bin Abi Talib - may Allah be pleased with him - where he had arranged his Mushaf according to the order of revelation - because Surahs and verses were arranged and collected according to what is in the Mushafs now, and it is a Tawqifi matter with no room for opinion in it. Let it be known that its interpretation according to the opinion of Imam Ali, may Allah honor his face (4), no one doubts that it is of great benefit and general utility, because the order of revelation is other than recitation. And because scholars, may Allah have mercy on them, when they interpreted it according to the pattern of Mushafs, were forced to point to those causes with repeated phrases, since between its arrangement in Mushafs and its arrangement according to revelation is a distance aiming at the necessity of repetition, which led to the hugeness of their commentaries. From this arose the difference in causes of revelation, abrogating and abrogated, and acceptance and rejection regarding them. I learned by induction that no one presented his commentary according to what...",
    "foot_note": "1. Sharh Al-Nawawi 'ala Sahih Muslim (1/14).\n2. Safwat al-Tasawwuf, quoted from Ahadith al-Sahihayn bayn al-Zann wa al-Yaqin by Sheikh Thanaullah Al-Zahidi (18/294 - within Journal of Islamic Research issued by General Presidency for Scientific Research, Ifta, Da'wah and Guidance).\n3. See: Al-Tafsir wa al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi al-Asr al-Hadith (previous reference). Dr. Fadl Hasan Abbas: (3/257), Dar Al-Nafa'is - Amman - Jordan, 1st ed., 1437 AH. With slight modification.\n4. Ibn Kathir, may Allah Almighty have mercy on him, said: I said: It has become common in the phrasing of many scribes of books to single out Ali, may Allah be pleased with him, by saying: \"Peace be upon him\" excluding other Companions, or \"May Allah honor his face\". Although its meaning is correct, one should equalize between Companions in that, for this is a matter of glorification and honoring, and the two Sheikhs (Abu Bakr and Umar) and Commander of the Faithful Uthman are more worthy of that than him, may Allah be pleased with them. See: Tafsir Ibn Kathir: (3/517 - 518). And \"Titling Ali bin Abi Talib with honoring the face and singling him out with that is from the extremism of the Shia regarding him. It is said it is because he never looked at anyone's private parts at all, or because he never prostrated to an idol. This is not specific to him but others share it with him from Companions who were born in Islam. See: Fatawa of the Permanent Committee for Ifta in Saudi Arabia, Fatwa number: (3/289). Likewise, singling out Ali bin Abi Talib, may Allah be pleased with him, and Ahl al-Bayt with \"Peace\" is from the characteristics of the Rafidah as well. So let one be aware. The Researcher.",
    "book_id": "944",
    "new_page_number": 28
  },
  {
    "serial_number": "1104282",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "...the Imam, peace be upon him, indicated. It saves the reader the burden of those differences and recording them, and he knows the manner of its revelation, and stands on the reasons of its sending down, and tastes the pleasure of its meanings and the taste of the brevity of its structures in an easy, facilitated image, free from rejection and substitution, safe from criticism and defects, protected from error and slip. So it occurred to me to undertake that, since there is no legal impediment preventing what is there. I see myself in this as a follower not an innovator, hoping that this work of mine be a good Sunnah... clarifying the first revealed up to the interval (Fatrah) and the interval, its cause and duration and the first revealed after it, and the cause and date of each, its place and time, its stories, news, parables, and rulings, and the repeated verses and the reason for repetition, and their analogues suitable in wording and meaning, and the words not repeated in it, (except what was between Surah (Qaf) to (Al-Hadid) and the two parts (Tabarak) and (Amma) because many of their words were not repeated due to the wondrous rhymed prose and strange wording they contain. And what is agreeing with the law of those before us in it... and the summary of reasonable stories and noted battles.\" (1).\nAmong what refutes his saying that \"Uthman did not take the opinion of Ali and the Companions\" is the saying of Ali bin Abi Talib - may Allah be pleased with him - himself: \"O people, do not go to extremes regarding Uthman, and say nothing but good for him regarding the Mushafs and burning the Mushafs. By Allah, he did not do what he did regarding the Mushafs except with consultation from us all.\" (2)\nThe saying of Ali bin Abi Talib, may Allah be pleased with him, indicates that they agreed upon it by silent consensus - may Allah be pleased with them all.\nHis saying is also refuted by the stance of Ibn Masud, may Allah be pleased with him: Ibn Kathir, may Allah have mercy on him, said: \"It was narrated about Abdullah bin Masud that he was angry when his Mushaf was taken from him and burned, and spoke about the precedence of his Islam over Zaid bin Thabit who wrote the Mushafs. So Uthman bin Affan, may Allah be pleased with him, wrote to him inviting him to follow the Companions in what they agreed upon of interest in that, uniting the word, and lack of difference. So Abdullah bin Masud returned (repented), and responded to following, and left opposition - may Allah be pleased with them all.\" (3)\nAlso, the response of Ibn Masud - may Allah be pleased with him - to follow in offering his Mushaf for burning reinforces what we mentioned earlier of the saying of Ali bin Abi Talib - may Allah be pleased with him. It strengthens, confirms, and reinforces the saying of silent consensus on one hand, and establishes the actual consensus on the other hand as well. May Allah be pleased with them all.\nThe problem here is that Sheikh \"Huwaish\" is among those who see that the arrangement of Surahs is Tawqifi. Even if we said that Ali or others of the Companions - may Allah be pleased with them all - arranged his Mushaf chronologically, the response to that would be from two aspects:\nFirst Aspect: That was at the beginning before the Bakri collection then the Uthmani collection.\nSecond Aspect: Even if any of them wrote a special Mushaf for himself for any reason, should that Mushaf be generalized and the Imam Mushaf agreed upon by all Companions including...",
    "foot_note": "1. See: Introduction to Tafsir Bayan al-Ma'ani 1/4.\n2. Al-Masahif by Ibn Abi Dawood p. 96.\n3. Al-Bidaya wa Al-Nihaya by Ibn Kathir: (7/228). Its extraction preceded. With slight modification.",
    "book_id": "944",
    "new_page_number": 29
  },
  {
    "serial_number": "1104283",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "...Ali bin Abi Talib - may Allah be pleased with them all - be abandoned? There is no doubt that the Mushafs in people's hands today are copied from the Imam Mushaf upon which the Final Review settled, and the Final Review agrees with what is established in the Preserved Tablet.\n\"The most prominent motives of Sheikh 'Huwaish' can be summarized in the following points:\n1 - Avoiding what exegetes fell into of repetition leading to the hugeness of their commentaries.\n2 - Avoiding difference in causes of revelation and abrogating and abrogated.\n3 - To inform the reader how the Quran was revealed and its dependence on causes of revelation.\n4 - So the reader tastes the meanings of the Quran and the taste of the brevity of its structures in an easy, facilitated image free from rejection and substitution, safe from criticism and defects, protected from error and slip.\n\nRequirement Six: Enumerating the motives for \"Huwaish's\" undertaking to change the Mushaf arrangement to the chronological arrangement and discussing them\nWe can enumerate his motives and discuss them according to his following goals:\nFirst Goal: Avoiding what exegetes fell into of repetition leading to the hugeness of their commentaries.\nSheikh Mulla Huwaish did not provide us a comparison between his commentary and other commentaries where repetition occurred so we could be clear about what he says. Then how does an exegete - including \"Mulla Huwaish\" - avoid verses revealed in the Meccan stage generally like the verses of Surat Al-Isra containing commands to adhere to fundamental morals, then revealed in Surat Al-An'am, also Meccan, and very close to what appeared in Surat Al-Isra. Say the same regarding what appeared in Surat Al-Ma'arij (Meccan) and Surat Al-Mu'minun of attributes and deeds that are almost identical, and Sheikh \"Mulla Huwaish\" himself interpreted them here and there. Say the same regarding the stories of Prophets which were repeated many times, sometimes in general, sometimes in detail, and other times addressing an aspect of the Prophets' lives or a method of their call. Like the story of Abraham, peace be upon him, story of Noah, peace be upon him, and story of Moses, peace be upon him. The exegete has no choice but to proceed with the verses and present the miraculous Quranic style in presenting the matter and alert to the special aspect mentioned each time. He can refer to the preceding place in the commentary as most exegetes do; they often refer the reader to some preceding details saying: We mentioned the detail of this matter in Surah such and such when discussing such and such. (1)\nAs for the Sheikh's saying that the hugeness of ancient commentaries was caused by repetition, I say the cause of the hugeness of commentaries is the sciences and contents they addressed, and the aspects they exposed in interpreting verses, of doctrinal, linguistic, or jurisprudential issues, or refutations of some sayings...",
    "foot_note": "1. Were it not for the size of the brief research, I would have cited examples of exegetes' words on this, and I would have cited - (Dr. Mustafa Muslim) - from Mulla Huwaish's words what contradicts his saying and that he fell into the opposite of what he claimed of avoiding repetition. (See Surah Al-Isra and Al-An'am, and Surah Al-Ma'arij and Al-Mu'minun) in Mulla Huwaish's commentary.",
    "book_id": "944",
    "new_page_number": 30
  },
  {
    "serial_number": "1104284",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "...which they did not approve of... and so on. It is not an issue of repetition as the Sheikh claimed. Moreover, his commentary exceeded three thousand pages, consisting of twelve parts in six large volumes; isn't this a huge commentary?!\n\nSecond Goal: Avoiding difference in causes of revelation and abrogating and abrogated:\nI did not understand what the Sheikh meant by avoiding difference in causes of revelation and abrogating and abrogated. It is known that narrations are reported regarding causes of revelation, some authentic and some sick (weak). The exegete must study these narrations, take the authentic narration, and leave the other. What does that have to do with the order of revelation?! The Sheikh did that, but he did not do it consistently - he used to do it sometimes - so he did not commit to taking the authentic always but took the weak narration, and might leave the authentic one sometimes.\nSimilar is the case in abrogating and abrogated. Rulings reported in some verses where combining these verses is impossible and we know the time of revelation of both verses, we judge with the abrogation of the earlier revealed verse, as recorded in the rules of preponderance (Tarjih) among scholars of Tafsir and scholars of Usul al-Fiqh. Whether the interpretation of the Quran is according to the Mushaf arrangement or according to the revelation arrangement, the study of the two verses takes a specific dimension and defined methodology in study and comparison. The two verses of waiting period for the widow in Surat Al-Baqarah (1), the abrogating verse is advanced in the arrangement of verses, and the abrogated verse is delayed in arrangement. Despite that, there was no problem for any exegete in mentioning the abrogating verse and determining the ruling of the abrogated, because interpreting both verses and determining the later in revelation of them is necessary, then clarifying the contradiction and consequently judging the abrogation of one of them.\n\nAs for the Third Goal: Sheikh \"Mulla Huwaish's\" saying: To inform the reader how the Quran was revealed and its dependence on causes of its sending down:\nThis aspect was exhaustively researched by exegetes, as they mentioned the time of revelation of the Surah and verses and mentioned narrations determining causes of revelation. They left nothing small or big in that except they mentioned it. In fact, Sheikh \"Mulla Huwaish\" and those who followed him in interpreting according to the order of revelation were dependent on previous exegetes in taking narrations mentioning the Meccan or Medinan nature of the Surah, and clarifying causes of revelation. They mentioned all that while adhering to the arrangement of Surahs as they appeared in the Mushaf.\n\nAs for the Fourth Goal: Sheikh \"Mulla Huwaish's\" saying: So the reader tastes the pleasure of Quran's meanings and the taste of the brevity of its structures in an easy, facilitated image...\nWhat is the relationship of tasting the pleasure of Quran's meanings with arrangement? Tasting meanings comes in interpreting the Surah with an eloquent beautiful style, so what does that have to do with arrangement? That comes from the methodology followed by the exegete in his book of interpreting Quran by Quran...",
    "foot_note": "1. See: The Abrogating Verse (234) Al-Baqarah, and the Abrogated Verse (240) Al-Baqarah.",
    "book_id": "944",
    "new_page_number": 31
  },
  {
    "serial_number": "1104285",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "...and by authentic Prophetic Sunnah and established sayings of Companions, and by understanding given to the exegete and his special faculty which is not deviated by desires. As long as the Surah is the complete unit whose interpretation is addressed, its location has no relation to interpretation, tasting it, and its safety from criticism, defects, error, and slips.\nThe goals and motives mentioned by Mulla Huwaish, which he claimed carried him to interpret the Quran according to the order of revelation, are achieved in every commentary regardless of the arrangement of Surahs, as long as the exegete follows a sound methodology with a beautiful correct style in presenting the meanings of verses.\" (1)\n\nSection Two: Presentation, study, and discussion of the second commentary \"Al-Tafsir Al-Hadith\" by \"Muhammad Izzat Darwaza\" (d. 1404 AH)\nIt has eight requirements:\n\nRequirement One: Definition of his commentary\nIt is the second of those commentaries whose authors followed a specific path not followed by the Salaf in arranging Surahs chronologically, not according to the Mushaf. His commentary contained the entire Holy Quran, and he arranged it according to the order of revelation. Two editions of it were issued: The first in year: 1964 CE - in Cairo at Isa Al-Babi Al-Halabi Press, and it is a beautiful and valuable edition. The second, which is revised and corrected from the author's copy, was issued in year 2000 CE by Dar Al-Gharb Al-Islami in Beirut. It was issued in twelve parts collected in six volumes. He died, may Allah have mercy on him, in Shawwal of the year 1404 AH.\n\nRequirement Two: \"Darwaza's\" argument for undertaking the change of the Mushaf arrangement to the chronological arrangement\nProfessor \"Darwaza\" prefaced the introduction of his commentary with some fatwas upon which he relied and justified this deed of his. They are the fatwa of Sheikh Abu Al-Yusr Abidin and Sheikh Abdul Fattah Abu Ghuddah. They gave him a fatwa of permissibility, distinguishing between the two arrangements, clarifying that the Mushaf arrangement is for recitation, and that the arrangement of commentary differs from the arrangement in recitation. \"Darwaza\" prefaced his commentary with them as we mentioned, and they are as follows:\nThe First: By the Mufti of Syria \"Abu Al-Yusr Abidin\", and its text is: \"Commentary is not a Quran to be recited, so that the arrangement of verses and Surahs is observed in it. An exegete can interpret a verse, then leave what is next to it due to the clarity of its meaning, and can interpret a Surah, then leave what is after it relying on understanding the next. There is no objection to authoring a commentary in the mentioned form, and Allah knows best.\"\nThe Second: By \"Abdul Fattah Abu Ghuddah\", in it came: \"The suspicion of prohibition of this method comes from the side that it is a method contradicting what the Noble Mushaf is upon. Repelling it...",
    "foot_note": "1. Al-Tafasir Hasaba Tartib al-Nuzul fi al-Mizan Dr. Mustafa Muslim. Research from Ahl al-Tafsir website, date: 15/12/1432 AH. With modification.",
    "book_id": "944",
    "new_page_number": 32
  },
  {
    "serial_number": "1104286",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "...is that prohibition is established in it if this act was a behavior for this arrangement to be a Mushaf for recitation... The permissibility of this method is supported by what was followed by majestic scholars of the Ummah witnessed for leadership and example among the predecessors in their writings, and it is not known that anyone denied what they did.\" (1)\nIt was incumbent upon Abu Ghuddah to clarify whom he mentioned among scholars who preceded to this work. As for \"Darwaza\", he said: \"Present with me among them now is Imam Ibn Qutaybah who died in the year 276 Hijri. He proceeded in interpreting what he interpreted in his printed book 'Ta'wil Mushkil al-Quran' on other than the order of revelation and other than the currently recited arrangement. I do not doubt that there are others who shared this method with him among scholars of his age and after him, whom I cannot research now due to lack of time.\" (2).\n\nThe Motive of \"Darwaza\" and Ibn Qutaybah do not agree:\nThe book (Ta'wil Mushkil al-Quran) by Ibn Qutaybah is considered among the most precious written in refuting atheists and heretics who attacked the Quran and described it as containing problematic things. Ibn Qutaybah stepped forward to present their suspicions and attacks and refuted them with a foundational scientific response coupled with shining decisive proofs and arguments and irrefutable evidences coupled with silencing transmitted and rational proofs. The motive and incentive for him to classify this book was defending the domains of the Dear Book.\n\"Ibn Qutaybah wrote his book 'Ta'wil Mushkil al-Quran' to defend the sanctuary of the Holy Quran against doubts raised about it and attacks directed towards it. He assigned himself to repel them, clarify their crookedness, and return their plot to the throats of their owners, lest the inexperienced and young be deceived by them, or the weak-minded and weak-faithed be tempted by them. He was aided in the silencing response and decisive answer by his possession of the reins of bright solid eloquence, and his capability in solid scientific criticism.\nIbn Qutaybah mentions the motive for authoring this book in his introduction saying: 'Atheists have attacked the Book of Allah with criticism, and spoke nonsense and abandoned talk regarding it, and followed what is ambiguous of it seeking discord and seeking its interpretation with blunt understandings, sick sights, and defective vision. So they distorted speech from its places, and deviated it from its paths, then judged it with contradiction, impossibility in grammar, corruption of organization, and difference. They presented in that causes that might sway the inexperienced weak one, and the naive youth, and intercept hearts with doubts, and strike chests with suspicions... So I loved to defend the Book of Allah, and throw from behind it illuminating arguments and clear proofs, and uncover for people what they confuse. So I authored this book gathering the interpretation of the problematic of the Quran, deducing that from Tafsir with addition in explanation and clarification, and carrying what I know in it is a saying of an Imam acquainted with the languages of Arabs, to show the stubborn the place of metaphor, and the way...",
    "foot_note": "1. Muhammad Izzat Darwaza, Introduction to Tafsir: (p. 711). Al-Tafsir Al-Hadith [Arranged according to order of revelation] Author: Darwaza Muhammad Izzat Publisher: Dar Ihya' Al-Kutub Al-Arabiyyah - Cairo Edition: 1383 AH.\n2. Previous reference: (11/1).",
    "book_id": "944",
    "new_page_number": 33
  },
  {
    "serial_number": "1104287",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "...of possibility, without judging in it with opinion, or deciding on it with interpretation. It was not permissible for me to stipulate attribution (Isnad) to him who has the origin of interpretation, since I did not limit myself to the revelation (speech) of the people until I uncovered it, nor to their gesture until I clarified it. I added to words and decreased, advanced and delayed, and struck parables and forms for that, until the listeners are equal in understanding it\" (1).\nFurthermore, Ibn Qutaybah reviewed in his book the verses which the attackers raised their objections against in their places from their Surahs of the Quran, not observing the Mushaf arrangement. Rather, he mentions what he wants to speak about of verses upon which objections were raised, then moves to others, and might return to the previous Surah after moving to others if the context calls for that.\nHere a question arises: Is Ibn Qutaybah's book considered a pure Tafsir book? Or is it a book mentioned in one aspect, which is refuting fabrications, attacks, and suspicions in a specific aspect, which is the aspect of what is apparently problematic in the Quran? Ibn Qutaybah went in a Surah and returns to it as well. Can it be said after that that it is a pure Tafsir book? Or is its subject like the subject of the book \"Daf' Iham al-Idtirab 'an al-Kitab\" by Al-Shinqiti, in which he collected available aspects of reconciling between verses thought to be contradictory in the Holy Quran, arranging them according to Mushaf arrangement, not chronological. I do not know that anyone of the people of knowledge nor others of researchers since the time of the scholar Al-Shinqiti until our present time mentions that he has a Tafsir book other than his famous book known as \"Adwa' al-Bayan\".\nThere is a scientific thesis \"PhD dissertation\" titled: (Works on the Problematic of the Holy Quran and their Methodologies) at the Islamic University in Medina. The researcher (2) collected in it what was authored on the Problematic of the Quran and reached ninety-six works, between manuscript, lost, and printed. As for the printed ones, they exceed fifty works, and manuscripts are about seventeen. Did the people of knowledge count what was classified in this chapter among books appended to Tafsir books? Or only within works of Quranic Problematic? And do works of Quranic Problematic address what Tafsir works address of comprehensiveness, or do they address only one aspect?\nAlso, \"Darwaza\" relied in his commentary on the arrangement found in the \"Qadroghli\" Mushaf, because it was mentioned in it that it was printed under the supervision of a special committee of people of knowledge and endowments where it comes to mind that the order of revelation was indicated in it (Surah such and such was revealed after Surah such and such) after the committee viewed various narrations and preferred between them. (3)",
    "foot_note": "1. Ibn Qutaybah, Ta'wil Mushkil al-Quran, Introduction p 4, Ta'wil Mushkil al-Quran Author Abu Muhammad Abdullah bin Muslim bin Qutaybah Al-Dinawari (Died: 276 AH) Investigator: Ibrahim Shams al-Din Publisher: Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon. See: Nazrah hawla kitab \"Ta'wil Mushkil al-Quran\" li Ibn Qutaybah, article by \"Abdul Azim Anflus\" from Ahl al-Tafsir website, date: 18/3/1438 AH\n2. The researcher is: Abdul Rahman bin Sanad bin Rashid Al-Rahili, see: Al-Manzumah database for university theses.\n3. Muhammad Izzat Darwaza, Introduction to Tafsir: (p. 12 - 13).",
    "book_id": "944",
    "new_page_number": 34
  },
  {
    "serial_number": "1104288",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "The \"Qadroghli\" Mushaf is a large Uthmani Mushaf written by the famous calligrapher Sayyid Mustafa Nazif known as \"Qadroghli\", who was born in the year: (1262 AH) in the city of Rus in Bulgarian lands. He is originally from Crimea. His father Mustafa Efendi took him to Istanbul, so he entered the Enderun (1) and wrote it. His writing was in the month of Ramadan of the year (1309 AH), during the reign of Sultan Abdul Hamid II - may Allah have mercy on him.\nThe first edition of the Holy Mushaf printed by the famous Al-Shamrali Press - in Cairo - was the printing of that copy written by the hand of Sayyid Mustafa Nazif known as \"Qadroghli\", and he had written it in 1891 CE. It was printed in the Ottoman Press, then Al-Shamrali Press reprinted it in 1944 CE. \"Qadroghli\" died - may Allah have mercy on him - in 1313 AH, and was buried in the cemetery of Yahya Efendi in Besiktas district in Istanbul.\n\nRequirement Three: Clarifying the most important and prominent motives that drove \"Darwaza\" to arrange his commentary chronologically\n\"As for the motives of Professor 'Muhammad Izzat Darwaza' to follow this pattern of interpretation, he explained it saying in the introduction of his commentary in the first edition: '... For after we wrote the three [books], namely: The Era of the Prophet, peace be upon him, The Biography of the Messenger, peace be upon him, from the Quran, and The Quranic Constitution (2) in Life Affairs, the idea of writing a comprehensive commentary sprang in us, intending to present the Quran entirely after we presented it in chapters according to its subjects in the three books. Showing in it the wisdom of revelation and principles of the Quran, and its contents generally in a modern style and arrangement, responding to the strong desire felt by many of our youth who complain about the traditional style and turn away from it, which led to severing the connection between them and the book of their holy religion, calling for regret and anxiety'. The author commented on the previous speech in the second edition saying: 'We add to what we said in the first edition saying: The need for that intensifies day after day in proportion to the increase of what our youth and rising generation are exposed to of sweeping stormy currents of atheism and dissolution from various values and moral and social ties, blind imitation of every trivial silly thing violating religion, character, and chivalry, and turning to reading promiscuous, obscene, trivial magazines and novels...' End quote (3).\nHe says in another place justifying this method: '... Because we saw this aligns with the method we believed is best for understanding the Quran and serving it, since by that one can follow the Prophetic biography time after time, as one can follow the phases of revelation and its stages more clearly",
    "foot_note": "1. Enderun: \"An educational pedagogical system\" that was affiliated with the Ottoman Palace. See: Calligrapher Haj Muhammad Nazif and his works: form website: Network of Creators for Lectures, Booklets and Calligraphic Exhibitions. With modification.\n2. Constitution (Dustur) is a description not befitting the Quran.\n3. Al-Tafsir Al-Hadith, Muhammad Izzat Darwaza, Dar Al-Gharb Al-Islami. (n.p)",
    "book_id": "944",
    "new_page_number": 35
  },
  {
    "serial_number": "1104289",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "and accurately. By this and that, the reader merges into the atmosphere of Quran revelation, the atmosphere of its circumstances, occasions, extent, and concepts, and the wisdom of revelation becomes clear to him.' (1)\n\"Thus, 'Darwaza's' motives can be determined by the following points:\n1 - Explaining the wisdom of revelation, principles of the Quran, and its contents generally in a modern style and arrangement.\n2 - Responding to the desire of youth complaining about the traditional style in Tafsir.\n3 - To rescue youth and the rising generation from atheistic currents dissolved from values and morals, and blind imitation of every trivial silly thing violating religion, character, and chivalry.\n4 - In this method is facilitation of understanding the Quran.\n5 - This method enables following the Prophetic biography time after time.\n6 - This method also enables following the phases of revelation and its stages more clearly and accurately.\" (2)\n\nRequirement Four: Discussing \"Darwaza's\" motives:\nThe truth is that whoever contemplates those motives mentioned by Professor \"Darwaza\" - may Allah have mercy on him - finds the following:\n1 - That they are not convincing at all. He did not present proofs and motives with strong and close meaning to what he went to of this breach and splitting the stick of the community by his opposing this consensus received by the Ummah with acceptance.\n2 - That those motives have absolutely no relation, near or far, to his method of arranging his book according to chronological order.\n3 - That achieving those goals and motives has no contradiction between them and the Mushaf arrangement which the Ummah agreed to accept and work by, whether this arrangement is Tawqifi or Ijtihadi.\n4 - Does the complaining youth need changing what the Ummah received with acceptance and work? Will this change comfort and reform the youth, or does he need education, guidance, reform, and upbringing?!\n5 - He should have explained and proven as well the relationship of this method to facilitating understanding the Quran. For His saying Almighty (And We have certainly made the Qur'an easy for remembrance, so is there any who will remember) [Al-Qamar: 17] has no relation to the method of arranging the Quran. Because its meaning is \"Is there anyone remembering by this Quran which Allah made easy to memorize and understand?\". (3)\n6 - And are atheistic currents and blind imitation etc... all that treated by changing the arrangement of Quran Surahs on this pattern? Or treated by awareness, enlightenment, returning to sources of reception, and highlighting righteous role models for youth to emulate?",
    "foot_note": "1. Al-Tafsir Al-Munir, Wahba Al-Zuhayli, Dar Al-Fikr. (n.p)\n2. Al-Tafasir Hasaba Tartib al-Nuzul fi al-Mizan Dr. Mustafa Muslim. Research from Ahl al-Tafsir website, date: 15/12/1432 AH\n3. Tafsir al-Quran al-Azim, by Ibn Kathir: (4/337). Tafsir Ibn Kathir: Tafsir al-Quran al-Azim Author: Abu Al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Investigator: Sami bin Muhammad Salamah Publisher: Dar Taybah for Publishing and Distribution, 2nd ed., 1420 AH - 1999 CE, Number of Parts: 8.",
    "book_id": "944",
    "new_page_number": 36
  },
  {
    "serial_number": "1104290",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "7 - Knowing causes and history of revelation contains sufficiency in knowing the phases of revelation and its stages, and say the same in arranging the following of the Seerah.\nFinally for this discussion: Professor \"Darwaza\" did not present clear proofs nor irrefutable arguments for what he went to of changing the Mushaf arrangement and leaning towards the chronological arrangement.\n\nRequirement Five: \"Darwaza's\" method in his commentary\n\"Darwaza\" followed in his commentary the rhetorical and analytical method. He also frequently addressed the interpretation of some verses by the thematic interpretation method. He arranged it chronologically, not according to the Mushaf. His book (The Glorious Quran) was like an introduction to his commentary titled \"Al-Tafsir Al-Hadith\".\nAmong his most prominent topics and interests were the following:\n1 - He spoke about the styles of the Quran, and also spoke about its impact.\n2 - He addressed in his commentary also the collection of the Quran, its recording, reading, Mushaf script, and method of its organization.\n3 - He also addressed the ideal way to interpret the Quran, and the path leading to understanding it.\n4 - He was interested in casting some looks at a number of works in Tafsir, and spoke about the ways and methods followed by their authors.\n5 - He also addressed explaining Quranic occasions (Munasabat) and causes and history of revelation of verses.\n6 - He took care to define Surahs before exposing their interpretation, a definition covering several aspects which he clarifies and elucidates by saying: \"We saw in addition to this that it is useful to place an introduction or brief definition of Surahs before starting their interpretation, including their description, contents, most important features, and what comes to mind from their content regarding the correctness of their arrangement in revelation and in the Mushaf, and what is in Meccan Surahs of Medinan verses, and in Medinan Surahs of Meccan verses according to narrations, and commenting on that as required.\" (1)\n7 - He was sometimes attentive and alert to Israelite stories and Jewish news and warned against them as well. Among the clearest of that is his comment on the story of Harut and Marut where he says: \"Ancient exegetes cited numerous narrations containing the strange and odd, differing in formula and detail, agreeing in essence... Ibn Kathir cited a strange forged narration to Mother of Believers Aisha... Al-Qasimi mentioned that Al-Razi in his commentary decided the invalidity of narrations from several aspects, and that Imam Abu Muslim argued for the invalidity of magic descending on them from several aspects also, which we saw no point or necessity in citing) (2)",
    "foot_note": "1. Al-Tafsir Al-Hadith: (1/8).\n2. Previous reference: (7/217).",
    "book_id": "944",
    "new_page_number": 37
  },
  {
    "serial_number": "1104291",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "And likewise his comment on the story of Solomon, peace be upon him, where he says: \"... We believe that this story is among what was circulated in the environment of the Prophet, peace be upon him, and that its source is the Jews\". (1) But despite all this, he frequently cited their likes from Israeliyyat, thus combining two opposites and contradictions at the same time.\n8 - He also sometimes addressed some jurisprudence rulings when there was a reason for that, with his inference and transmission of sayings and traditions, and clarifying legislative wisdoms and secrets.\n9 - He also had many quotations from sources of Imams of Tafsir and masters of composition on which he relied in his commentary, such as the commentary of the Sheikh of Exegetes - Ibn Jarir Al-Tabari -, Tafsir Al-Baghawi, Ibn Kathir, Tafsir Al-Khazin, Al-Kashshaf by Al-Zamakhshari the Mu'tazilite, Al-Qasimi, Al-Naysaburi, Al-Nasafi and others.\n10 - He also relied on quoting from books of language, history, and Quranic sciences and attributing to them, like the book History of Arabs before Islam, and History of the Arab Race in various phases, roles, and regions, Al-Itqan by Al-Suyuti and other works.\n11 - He also had a clear stance for which he is praised and thanked and credited, namely his criticism of the Shia, opposing them, belying them, and exposing their defects.\n\nMost important incentives and motives for arranging his commentary chronologically:\nHe says regarding that: \"We turned over aspects of opinion about this method, and wondered if it contains touching the sanctity of the circulating Mushaf. Opinion led us to deciding on it, because commentary is not a Mushaf for recitation on one hand, and it is a technical or scientific work on a second hand, and because the interpretation of every Surah can be an independent work in itself having no connection to the Mushaf arrangement, and it is not of its nature to touch the sanctity of its arrangement on a third hand) (2).\nThis speech has its valid points if it were an interpretation of a single Surah only, because as he said it can be an independent work in itself. As for his collecting the interpretation of the whole Quran in this way, he violated by that what is the practice of the Ummah, predecessors and successors.\n\nRequirement Six: Evaluation of \"Darwaza's\" commentary\n\"Everyone who reads what the exegete wrote in the introduction of his commentary blaming exegetes, and searching for gaps in their commentaries, such that he did not absolve an ancient or modern commentary from these gaps, I say everyone who reads that, a bright image of Al-Tafsir Al-Hadith is drawn in his mind and imagination. But the truth is that this commentary - which its owner wanted to be gathering the beauties of commentaries, innocent of their gaps, according to what he drew in his ideal plan...",
    "foot_note": "1. Previous reference: (2/322).\n2. See: Muhammad Izzat Darwaza wa Tafsir al-Quran al-Karim, Dr. Farid Mustafa Suleiman. Riyadh Maktabat Al-Rashid, PhD thesis at Faculty of Usul al-Din at Al-Azhar University, 485 p, First Edition, 1993 CE - 1413 AH.",
    "book_id": "944",
    "new_page_number": 38
  },
  {
    "serial_number": "1104292",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "...for Tafsir - was an innovation (Bid'a) among commentaries - not only in terms of its arrangement - nor in terms of its methodology as well - nor in terms of ideas and opinions contained in it, but in terms of all these aspects. The professor spoke about Quranic stories, so the practical application he brought us was frequent citation of Israeliyyat, without distinguishing between what contradicts Islamic creed and the consensus of the Ummah on the infallibility of Prophets peace be upon them, while he used to fault exegetes for less than what he mentioned. When he spoke about cosmic verses, he stripped them of their truths and restricted them to a preaching scope only, while it was more appropriate for him to do such with stories. As for verses of rulings, we saw the man slip dangerous slips not in terms of contradiction and error in some issues, but in terms of disturbance and confusion reflected on the reader. After all that, the commentary was void of necessary scientific terminologies and places of indication to clarify secrets of miraculousness from presenting the guidances of Quranic verses in an interesting presentation, except for some gestures we recorded for him. Thus, the commentary, despite what benefits it has and merits, is void of many characteristics of Tafsir, ancient and modern. Al-Tafsir Al-Hadith in my opinion has its positives and negatives, but is not free of negatives. The man had a thankful sense in his defense of Islam, and had general culture, and his jealousy for his religion appears during his commentary. Human work is always prone to error. May Allah have mercy on the author of Al-Tafsir Al-Hadith and grant him abundant reward and reward him well for what he presented.\" (1)\n\nRequirement Seven: Creed of \"Darwaza\" regarding the attributes of the Lord - Majesty be to Him\nIt is of great importance to conclude the speech here on the creed of \"Darwaza\" regarding the attributes of the Lord - Majesty be to Him - in light of his commentary. We cite for that two clear examples from his commentary:\nExample One: His interpretation (Ta'wil) of the attribute of Hand established for Allah Almighty in reality in a manner befitting His High Self, a clear evident interpretation when interpreting His saying Almighty: (Indeed, those who pledge allegiance to you, [O Muhammad] - they are actually pledging allegiance to Allah. The hand of Allah is over their hands) (Al-Fath: 10). He attributed to Al-Zamakhshari the Mu'tazilite in Al-Kashshaf his saying: The expression (The hand of Allah is over their hands) was a subject of sayings connected to Ilm al-Kalam and the attribute of Allah regarding attributing limbs to Allah Almighty. (2)\nThen he says - may Allah pardon him -: We do not see the expression and context bearing that. It was intended by it, as is apparent, the intensity of emphasis on the gravity of the covenant and pledge and Allah being a witness over it aiming for the strength of indoctrination intended to be disseminated in the souls of Muslims. Then he followed that by quoting several interpretations for the attribute of Hand from some people of interpretation (Ta'wil) among exegetes, then said after it supporting those interpretations: And in these interpretations is correctness and they indicate that the sentence was carried on metaphor (Majaz). Then he concludes...",
    "foot_note": "1. See: Al-Tafsir wa al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi al-Asr al-Hadith (previous reference). Dr. Fadl Hasan Abbas: (3/240 - 241). Dar Al-Nafa'is - Amman - Jordan, 1st ed., 1437 AH. With slight modification.\n2. The researcher did not find this saying with Al-Zamakhshari the Mu'tazilite as \"Darwaza\" attributed. Rather he found with Al-Zamakhshari his saying: When He said they only pledge allegiance to Allah, He emphasized it with an emphasis by way of imagery (Takhyil) so He said: (The hand of Allah is over their hands) meaning that the hand of the Messenger of Allah which is over the hands of pledgers: is the Hand of Allah. Allah Almighty is exalted above limbs and attributes of bodies. The meaning is only: establishing that contracting the covenant with the Messenger is like contracting it with Allah without difference between them, like His saying Almighty: (He who obeys the Messenger has obeyed Allah) (Al-Nisa: 80). See: Tafsir Al-Zamakhshari: (10/512). And the speech of Al-Zamakhshari the Mu'tazilite is also all false interpretation contradicting the belief of Ahl al-Sunnah regarding the attributes of the Lord, Majesty be to Him.",
    "book_id": "944",
    "new_page_number": 39
  },
  {
    "serial_number": "1104293",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "his speech here - may Allah pardon him - by affirming his creed regarding the attributes of the Lord - Majesty be to Him - saying: We have alerted in previous occasions to what expressions like: Hand of Allah, Face of Allah, Hearing of Allah involve, and what should be understood from Quranic affirmations and the Sunnah of the righteous predecessors. He attributed that to the interpretation of Surah Al-Qasas. (1)\nHis Eminence our Sheikh Imam Ibn Baz (d. 1420 AH), may Allah have mercy on him, says: This verse according to Ahl al-Sunnah wal-Jama'ah indicates two matters:\nFirst Matter: Affirming the Hand for Allah Glory be to Him and Exalted, and that He, Glory be to Him, is described with Hand, as He, Majestic and Exalted, said: (What prevented you from prostrating to that which I created with My hands) (Sad: 75), and He, Glory be to Him, said: (Rather, His hands are extended) (Al-Ma'idah: 64). This is established for Allah Almighty by consensus of Ahl al-Sunnah wal-Jama'ah; the attribute of Hand for Allah is established according to Ahl al-Sunnah wal-Jama'ah by text and consensus.\nSecond Matter: That He, Glory be to Him, approves this pledge and is pleased with it, and that the hand of His Messenger - peace be upon him - stands in place of His Hand, Glory be to Him, in executing this pledge, (The hand of Allah is over their hands). The intended meaning by this is proving that the hand of the Messenger, peace be upon him, stands in place of the Hand of Allah in establishing this pledge. So in it is affirmation of both hands: The Hand of Allah, Glory be to Him, which is established for Him, Glory be to Him, and He is above the Throne, above all creation; and the hand of the Messenger which they pledged allegiance to by the command of Allah and legislation of Allah and His pleasure. (2)\nExample Two: His interpretation (Ta'wil) of the attribute of Coming (Maji') of the Lord, Majesty be to Him, when interpreting His saying Almighty: (And your Lord has come and the angels, rank upon rank) (Al-Fajr: 22). Darwaza - may Allah pardon him - said: \"... And what comes to mind is that this, with the obligation to believe in it and its being in the text from the power of Allah, and with the obligation to declare Allah Almighty above the concept of coming, going, standing, sitting and other actions of creation and their attributes, aimed to influence the listeners because due to the gravity of the Great Judgment Scene of the Hereafter, they are accustomed in the world to holding judicial councils to try criminals and [decide] their punishments. The matter in this might be like describing Paradise and Hell with descriptions people are accustomed to in the world for approximation, representation, and influencing listeners as we explained before...\". (3)\nThere is no doubt that this clear interpretation (Ta'wil) of the attributes of the Lord, Majesty be to Him, clarifies his creed in them, and that he followed the path of the people of Ta'wil from the Ash'aris and those who leaned towards them. He thereby contradicted the creed of Ahl al-Sunnah wal-Jama'ah in affirming the attributes of the Lord, Majestic and Mighty, in reality in a manner befitting His Self - Glory be to Him -, without Ta'wil (interpretation/distortion), Ta'til (negation), Tashbih (likening), Takyif (asking how), or Tamthil (representation), as our Lord said: (There is nothing like unto Him, and He is the Hearing, the Seeing) (Al-Shura: 11).",
    "foot_note": "1. See: Al-Tafsir Al-Hadith by \"Darwaza\": (1/591).\n2. See: Majmu' Fatawa wa Maqalat Sheikh Ibn Baz: (24/273). Majmu' Fatawa al-Allamah Abdul Aziz bin Baz, may Allah have mercy on him. Author: Abdul Aziz bin Abdullah bin Baz (Died: 1420 AH). Supervised its collection and printing: Muhammad bin Saad Al-Shuway'ir. Number of Parts: 30 parts.\n3. Al-Tafsir Al-Hadith: (1/545).",
    "book_id": "944",
    "new_page_number": 40
  },
  {
    "serial_number": "1104294",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Requirement Eight: Prominent Studies on \"Darwaza's\" Commentary\n1 - Efforts of Muhammad Izzat Darwaza in his commentary named: (Al-Tafsir Al-Hadith). By Mohsen Abdul Rahman Ahmad. Cairo, Faculty of Arts, Ain Shams University, 1984 CE, PhD thesis. (Risalat al-Quran, Issue Eight/208).\n2 - Muhammad Izzat Darwaza and Interpretation of the Holy Quran, Dr. Farid Mustafa Suleiman. Riyadh, Maktabat Al-Rashid, PhD thesis at Faculty of Usul al-Din at Al-Azhar University, 485 p, First Edition, 1993 CE - 1413 AH.\n3 - Al-Tafsir Al-Hadith by Professor Muhammad Izzat Darwaza. Abdul Hakim Muhammad Anis. University of Baghdad, Islamic Sciences, Master's thesis, 1993 CE. (1).\n\nSection Three: Presentation, study, and discussion of the third commentary, the book \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by \"Habannaka Al-Maydani\" (d. 1425 AH) (2).\nIt has seven requirements:\n\nRequirement One: Definition of the book and its author and clarifying the most important motives and causes for its authorship\nHis book is the third of those works in Tafsir whose authors followed a specific path not followed by the Salaf in arranging Surahs chronologically, not according to the Mushaf. The first edition of this book was issued by Dar Al-Qalam in Damascus in fifteen large volumes. He died before completing it; he finished - may Allah have mercy on him - the Meccan [part] then his term came after he started interpreting Surat Al-Baqarah.\n\nDefinition of the Author:\nIts author is: Sheikh Abdul Rahman bin Hasan Habannaka Al-Maydani - may Allah have mercy on him.\n\nDefinition of the Book:\nThe book is: \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" (The Ascents of Reflection and Subtleties of Pondering).\n\nClarifying the most important motives and causes for its authorship:\nIts author based this commentary on the order of revelation of the Holy Quran, where he says explaining the reason for choosing this method: \"I saw through field pondering of Surahs that what the specialists in Quranic sciences mentioned regarding the order of revelation is mostly true, taking from the sequence of integrative cognitive building, and the sequence of educational integration. I discovered in this pondering majestic matters related to the movement of cognitive building for matters of religion, and the movement of divine educational treatments for the Messenger, peace be upon him, and for those who believed in him and followed him, and for those who did not respond to the call of the Messenger, hesitating or denying disbelievers.\"\nThe author tried to apply what he mentioned in his book (Rules of Optimal Pondering of the Holy Quran) in this book of his. He says, may Allah have mercy on him: \"To proceed, Allah Almighty opened upon me during my long pondering of His Glorious Book, to extract forty rules of the rules of optimal pondering of His Book, subject to addition. These rules provide ponderers with the principles of the most upright interpretation of the Quran. I did not find among exegetes anyone who cared to adhere to their content, nor to adhere to many of them. I saw it obligatory upon me to present what I can present of pondering for the Surahs of this...",
    "foot_note": "1. See: Al-Muhtasib, Ittijahat al-Tafsir fi al-Asr al-Rahin/54 which is the same as Ittijahat al-Tafsir fi al-Asr al-Hadith but its name changed in a new revised edition by the author, and Abi Hajar, Al-Tafsir al-Ilmi lil-Quran fi al-Mizan/315. And see (Al-Saffar, Al-Jami' lil-Rasa'il, p. 27).\n2. His Eminence Sheikh Allamah Abdul Rahman Habannaka Al-Maydani Al-Dimashqi was born in the year 1345 AH (1927 CE), in one of the oldest neighborhoods of Damascus, Al-Midan neighborhood, to a family of knowledge, Da'wah, and Jihad. His father is the educating scholar, the Mujahid, the bearer of the banner of Da'wah in Sham, Imam Hasan Habannaka Al-Maydani, member of the Constituent Council of the Muslim World League. The roots of the Sheikh's family go back to the Arabs of Bani Khalid whose dwellings extend to the desert of Hama in the land of Sham. On the night of Wednesday 25 Jumada al-Akhira 1425 AH, Allah decreed His true decree with the death of Sheikh Abdul Rahman Habannaka Al-Maydani, at about 80 years old, following an illness he suffered. For more: See: Al-Allamah Al-Mufakkir Abdul Rahman Habannaka Al-Maydani - Ayman bin Ahmad Dhu al-Ghina - Article on Alukah website - Date: 19/3/1428 AH. And see \"Zawji Kama Araftuhu\" (My Husband As I Knew Him) - Aisha Al-Jarrah - Dar Al-Qalam - Damascus.",
    "book_id": "944",
    "new_page_number": 41
  },
  {
    "serial_number": "1104295",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "...Noble Miraculous Book, adhering to the extent of my ability to the content of the rules Allah opened upon me, acknowledging that adhering to them precisely and comprehensively is very difficult, rather it might be impossible for a single ponderer.\" (1).\n\nRequirement Two: Side lights on the creed of \"Habannaka\"\nHe says in his book \"Al-Aqidah Al-Islamiyyah wa Ususuha\" (Islamic Creed and its Foundations): (2) \"The second type - of revelation - is what was by means of making the divine speech heard without the hearer seeing who speaks to him, like Allah creating sounds in some bodies of stone or tree. Of this type is what happened to Moses, peace be upon him, when he whispered to his Lord at the side of the Mount. This second type is what Allah indicated by His saying in the verse: {or from behind a partition} (Al-Shura: from verse 51) meaning: revelation from behind a partition by means of Allah creating sounds as we mentioned or in another form Allah Almighty chooses.\"\nI say: And Moses' whispering to his Lord from the side of the Mount is what came in His saying Almighty: (But when he came to it, he was called from the right side of the valley in a blessed spot - from the tree: \"O Moses, indeed I am Allah, Lord of the worlds\") [Al-Qasas 30]. The meaning of this according to Habannaka the Ash'ari is that the tree in which the sound, which is the Quran, was created, said to Moses: Indeed I am Allah, Lord of the worlds! (3)\nRather, where is \"Habannaka\"? From His saying, Glory be to Him: (And Allah spoke to Moses with [direct] speech) (Al-Nisa: 164), and from His saying, Majestic and Exalted: (And when Moses arrived at Our appointed time and his Lord spoke to him) (Al-A'raf: from verse 143).\nThe researcher contemplated some of what \"Habannaka\", may Allah have mercy on him, wrote and did not find him clear in terms of doctrinal methodology in his clear and evident victory for the belief of the Salaf. Supporting what the researcher mentioned here is what one of the contemporary luminaries, who have great care for the methodology of the Salaf and highlighting the creed of Ahl al-Sunnah wal-Jama'ah and calling to it and upon its methodology (4), answered. He was asked about the book (Usus al-Aqidah al-Islamiyyah) by \"Habannaka\", so he answered, may Allah Almighty preserve him: \"You do not need the books of contemporaries now. [As a] student of knowledge, read the books of the Salaf. Books of contemporaries - those who do not explain the creed of Ahl al-Sunnah intentionally and clarify it - you do not need them in Creed, especially Creed. Beware. -Meaning- until you master the creeds of the Salaf with their details, then after that you can read some books on that. This book is of the genre of Sheikh Abdul Rahman Habannaka Al-Maydani's books; he has an inclination towards Ash'arism or explicit declaration of it in places. He has a book named: (Dawabit al-Ma'rifah), a philosophical book meaning knowledge according to philosophers.\" (5) Ended.",
    "foot_note": "1. See: Al-Ta'rif bi Kitab \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by Majdi Makki - Dar Al-Qalam - Damascus - 1st ed - 1427 AH. And see: The General Introduction to the book Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur: (1/5 - 6).\n2. See his book: Al-Aqidah Al-Islamiyyah wa Ususuha: (2/249) First Edition: Dar Al-Qalam: (1385 AH). And see same book under title \"Ambiguous Texts in Attributes of Allah Almighty\" p 246..\n3. From book: Al-Radd Al-Qawim Al-Baligh 'ala Al-Khalili Al-Ibadi, by Sheikh/ Ali bin Muhammad bin Nasir Al-Faqihi: (1/283). Edition of Dar Al-Ma'athir, Second Edition 1422 AH.\n4. Namely Sheikh Salih bin Abdul Aziz Al-Sheikh.\n5. Sharh al-Aqidah al-Wasitiyyah (1/259).",
    "book_id": "944",
    "new_page_number": 42
  },
  {
    "serial_number": "1104296",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "Requirement Three: The methodology of \"Habannaka\" in his book, his opinion on the arrangement of Surahs, and what was obligatory upon him to follow\n\nA- His methodology in his book:\nAmong the most prominent features of his methodology in his book are the following: Sheikh \"Habannaka\" followed in his ponder-based commentary a path we summarize briefly as follows:\nFirst: He mentioned in the beginning of his book pondering-related rulings concerning Isti'adha (seeking refuge) and Basmalah.\nSecond: He mentions the Meccan and Medinan of the Surah, then clarifies the reported opinions about it, then prefers between them and clarifies what he went to and chose.\nThird: He mentions the Surah in its full length, then turns to mentioning the aspects of readings reported in it.\nFourth: He mentions the Surah and what was reported in it of virtues, especially regarding the subject of his research, inferring from texts of the Sunnah and traces of the Salaf in that.\nFifth: He followed an objective method in dividing the Surah, then studied it an objective analytical study, then followed that with a comprehensive look at all topics contained in the Surah.\nSixth: He addresses jurisprudence rulings and some rhetorical issues sometimes, especially when there is a reason to mention them.\n\nB- His opinion, may Allah have mercy on him, on the arrangement of Surahs:\nWe have passed the saying of Sheikh \"Huwaish\" and Professor \"Darwaza\" regarding the arrangement of Surahs and that it is Tawqifi according to them. As for Sheikh \"Habannaka\", he undertook interpreting the Quran according to the order of revelation, and this is a grave matter in which he has no Imam (predecessor), except what was from his two companions Sheikh \"Huwaish\" and Professor \"Darwaza\" as we knew. Yet they presented arguments and justifications for the work they undertook, even if they were all falling, unconvincing. We have passed the discussion and refutation of the justifications they presented.\nAs for Sheikh \"Habannaka\": He sees that the arrangement of Surahs is an Ijtihadi matter, contrary to his \"two companions\" \"Huwaish\" and \"Darwaza\", and he did not present arguments nor proofs like his two companions.\n\nC- What was obligatory upon him to follow:\nTherefore, several matters were obligatory upon him, most importantly:\nFirst: Presenting the sayings of those who say the arrangement of Surahs is Tawqifi and clarifying their arguments and evidences.\nSecond: Discussing the sayings and evidences of those saying Tawqif, and clarifying the evidences of what he went to and preferred.\nThird: Conveying the consensus of the Companions and the settling of their opinion on the Imam Mushaf and their acceptance and submission to it.\nFourth: Conveying the consensus of the Ummah on accepting the Tawqifi arrangement of Surahs upon which the Imam Mushaf settled and work continues upon it from the time of Uthmani collection to our time.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 43
  },
  {
    "serial_number": "1104297",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "But he did not do this, may Allah have mercy on him.\n\nRequirement Four: Enumerating the motives of \"Habannaka\" in adopting this method\nIn light of his speech at the beginning of his book, his most important motives for adopting this method can be identified as follows:\n1 - That his long pondering of the Book of Allah, and his deduction of the rules he mentioned in his book (Rules of Optimal Pondering) was among what invited him to follow this method.\n2 - That this method achieves the sequence of integrative cognitive building.\n3 - That this method achieves the sequence of educational integration.\n4 - This method revealed majestic matters related to the movement of cognitive building for matters of religion and the movement of comprehensive divine educational treatments for the Messenger, peace be upon him.\n5 - Looking forward to the wisdom of graduation, and knowing the purpose of repetition\". (1).\n\nRequirement Five: Discussing the motives and justifications of \"Habannaka\"\nWere the hoped and expected goals, purposes, and aims achieved by this work which departed from what the Predecessors and Successors of exegetes followed?\nFirst: Does the Mushaf arrangement prevent pondering so that we move to the chronological arrangement?\nSecond: Then those resonant words and new terms which the Imams of Salaf did not follow and did not use in Tafsir are closer to books of behavior and education than to the speech of Imams of Tafsir, such as \"sequence of integrative cognitive building\", \"educational integration\", \"cognitive building\", and their likes of those terms by which the Sheikh highlighted his justifications.\nThird: Then justifying that with the argument of \"looking forward to the wisdom of graduation\". Was this wisdom hidden in the Mushaf arrangement so the chronological arrangement reveals it?\nDr. Muhammad Abdullah Draz - may Allah have mercy on him - strikes a tangible example for that in his book: \"Hasad Qalam\" (Harvest of a Pen), describing that as one who undertook: \"bringing goods to build a house, not caring to buy parts of the trellis and roof before foundations and walls, following in that the opportunity of availability of price and availability of that commodity in the market, then built his house. Was that disrupting the engineering of that house, and the measurements set by the engineer?? Likewise, the Holy Quran was revealed according to occurrences, then arranged according to that (Arrangement) (2) which Allah Almighty wanted for it, so it was harmonious, integrated, taking into account graduation in teaching and understanding, and transition from atmosphere to atmosphere gradually either ascendingly or descendingly, as necessity requires...\". (3)\nThere is no doubt at all that the Mushaf arrangement is what the Final Review settled upon...",
    "foot_note": "1. See: Al-Tafasir Hasaba Tartib al-Nuzul fi al-Mizan Dr. Mustafa Muslim. Article from Ahl al-Tafsir website, date: 15/12/1432 AH. And this last motive I took from the Sheikh's explanation of the ninth rule in the book Rules of Optimal Pondering p 153. (Dr. Mustafa Muslim).\n2. It is originally in Dr. Draz \"Design\" so the researcher modified it to the appropriate meaning which is: \"Arrangement\".\n3. Hasad Qalam, Dr/ Muhammad Abdullah Draz: Investigation, Ahmad Mustafa Fadila, Introduction Dr/ Abdul Sattar Fathallah Saeed, Dar Al-Qalam, 2000 CE, Cairo: p: 45 onwards.",
    "book_id": "944",
    "new_page_number": 44
  },
  {
    "serial_number": "1104298",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "...agreeing with what is established in the Preserved Tablet with the Lord of Glory in a hidden Book. We have mentioned this matter repeatedly. The Quran was sent down all at once in this position and that state which it settled upon to the House of Glory in the lowest heaven, then it was revealed piecemeal (Munnajjam) after that according to events and occurrences.\nThis is what Dr. Muhammad Abdullah Draz - may Allah have mercy on him - means in his book - Al-Naba' Al-Azim - by saying: \"If it was a collection from separation, it was separated from a collection.\" (1)\nFurthermore, scholars of Occasions (Munasabat) extracted for the Ummah pearls of occasions between verses and Surahs, although much of it was revealed with verses separated and was not revealed all at once. Indeed, a single Surah might have verses from it revealed early and be in the middle of the Surah or at its ends and conclusions, and the beginning of Surahs might be revealed later than their conclusion and vice versa. You find that realized in the longest Surah of the Quran, namely Surat Al-Baqarah, which is among the first Medinan Quran in revelation, isn't it so? Was it revealed all at once or bit by bit? The answer comes in the answer of the Imams of Tafsir regarding the last thing revealed of the Quran, for most of them hold that the last verse revealed is His saying Almighty: (And fear a Day when you will be returned to Allah. Then every soul will be compensated for what it earned, and they will not be treated unjustly) (Al-Baqarah: 281). It is narrated from a group of the Salaf, among them: Ibn Abbas, Abu Saeed Al-Khudri, Ikrimah, Said bin Jubayr, as it is the choice of a group of late scholars as well. Regarding that, Al-Hafiz (d. 852 AH) says in Al-Fath - may Allah have mercy on him: The most correct of opinions regarding the lastness of the verse is His saying Almighty: (And fear a Day when you will be returned to Allah) (Al-Baqarah: from verse 281). (2)\nDespite all that, you see the textual connection, thematic unity, and purposes of the Surah connected, coordinated, as if it is one ingot in connection, meaning, rhetoric, and miraculousness. You never feel while contemplating it and pondering its verses that it was revealed piecemeal, and there might be between that piecemeal revelation distant times.\n\nRequirement Six: Were the goals aimed for by the initiators of changing the Mushaf arrangement to the chronological arrangement achieved?\nFinally, were the goals aimed for by the initiators of this door achieved?\nFirst: Those goals were not achieved as we have seen. How can they be achieved in a great grave matter agreed upon by the masses of scholars, predecessors and successors, and they have breached this consensus?\nSecond: How can those goals be achieved when they were not accompanied by any convincing justifications or any apparent landmarks or irrefutable arguments and shining proofs and silencing answers.\nRather, what was achieved of the goals is what the founders and promoters of this idea wanted, first...",
    "foot_note": "1. See: Al-Naba' Al-Azim: (p. 154). Al-Naba' Al-Azim Nazarat Jadidah fi Al-Quran Al-Karim Author: Muhammad bin Abdullah Draz (Died: 1377 AH) Cared for by: Ahmad Mustafa Fadila Introduced by: Prof. Dr. Abdul Azim Ibrahim Al-Mat'ani Publisher: Dar Al-Qalam for Publishing and Distribution Edition: Increased and Investigated Edition 1426 AH - 2005 CE Number of Parts: 1.\n2. Fath al-Bari: (8/317).",
    "book_id": "944",
    "new_page_number": 45
  },
  {
    "serial_number": "1104299",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "...among the Orientalists. Indeed, one of them retreated from this work, namely the French Orientalist Régis Blachère: (d. 1393 AH) as passed with us in the introduction of the research. - Yes - he retreated from arranging his translation of the Quran according to the order of revelation when he saw his error, so he rearranged that translation according to the Mushaf arrangement, this despite his bad intention and malicious nature.\nWas it not for the three individuals who breached this breach to retreat from their deed as that Orientalist retreated from the like of it, and return to what their righteous predecessors agreed upon? Because by that they have corrupted the organization of the Quran, since \"whoever advances a Surah or delays it has corrupted the organization of the Quran.\" (1).\nSince they have passed away and finished their terms, it is the right of the people of loosing and binding (authority) from the concerned bodies in the Ummah to conclude a wise matter in that, and work to repair their crack after they have gone to their Lord, and perform what Allah obligated them towards the Book of their Lord. Allah meant them by His saying: (And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\") (Al Imran: 187).\nIbn Sa'di said in his commentary: \"The Mithaq (Covenant) is the heavy confirmed pledge. This covenant Allah Almighty took from everyone whom Allah gave the Books and taught knowledge, that he clarifies to people what they need of what Allah taught him, and not conceal that from them, nor be stingy with it towards them, especially if they ask him, or something occurs necessitating that. For everyone who has knowledge, it is obligatory upon him in that case to clarify it, and clarify truth from falsehood.\" (2)\nSo it was obligatory upon them to perform their duty towards the Book of their Lord and return those works to what the Ummah agreed upon and proceeded on for those long centuries, just as the ambiguous is returned to the decisive. For it is of the characteristics of the people of truth to return the ambiguous to the decisive, just as it is of the characteristics of the people of falsehood to follow the ambiguous and reject the decisive.\n\nMajor Calamities We Fear:\nThis, and we fear that a time comes upon the Ummah in which someone calls for rearranging the verses of the Quran chronologically as the Orientalists called for arranging Surahs chronologically as well. They want by that to attack the Quran so it loses thereby the greatest evidences of its permanence and preservation, of its credibility, realization of its miraculous aspects, strength of its wording, and precision of its organization. But as Allah Almighty said: (But Allah refuses except to perfect His light, although the disbelievers dislike it) (At-Tawbah: from verse 32). Allah Almighty has undertaken the preservation of His Book by His High Self, so He, Glory be to Him, said: (Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian) (Al-Hijr: 9).\nWe fear that they be followed in that by those whose sights Allah blinded from adhering to the truth and holding onto it, among those who have no share nor lot nor portion of knowledge nor piety...",
    "foot_note": "1. Al-Itqan: Al-Suyuti Vol 1 p 62. He attributed it to Ibn al-Anbari.\n2. Tafsir Ibn Sa'di: (161/1).",
    "book_id": "944",
    "new_page_number": 46
  },
  {
    "serial_number": "1104300",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "...nor fear of God from our own skin. Allah Almighty alone is behind the intent and He is our sufficiency and best disposer of affairs. And praise be to Allah Lord of the Worlds.\n\nRequirement Seven: Statement of the obligation to respect the Mushaf arrangement, not to interfere with it, and to confront those who interfere with it\nSummary: The matter has ended that this arrangement must be respected. \"Whether the arrangement of Quranic Surahs was Ijtihadi (from Companions) or Tawqifi (from Allah), it must be respected especially in writing Mushafs because it is from the consensus of Companions and consensus is a proof. And because opposing it leads to Fitnah (strife), and preventing Fitnah and blocking means to corruption is obligatory.\" (1)\nAfter finishing the presentation of those three books whose authors opposed the masses of Predecessors and Successors in adhering to the Mushaf arrangement, and inclining away from it to the chronological arrangement, discussing them and judging them, it is appropriate here at the conclusion to increase in the sayings and evidences of those saying that the arrangement of Surahs is Tawqifi and judging them. Matters have become clear to us, a number of which we mentioned at the beginning of the research. We move here to mentioning another important number of those matters to conclude with, to be the musk of the conclusion, as follows:\nFirst: If there is miraculousness in the arrangement of the Quran's verses, then from the arrangement of Surahs scholars have extracted pearls in the science of Occasions (Munasabat) between Surahs as well. It is no less important than the arrangement of its verses. Muhammad bin Sirin (d. 110 AH) said to Ikrimah (d. 107 AH) during the days of the first collection of the Quran: \"Compose it as it was revealed, the first then the first. Ikrimah said: If mankind and Jinn gathered to compose it that composition, they would not be able.\" (2)\nSecond: The priority in reciting the Quran is observing the Mushaf arrangement whether that is in prayer or outside it because it is the origin. If he deviates from it sometimes, that is permissible for him but he left the better, the priority, the best, the most perfect, and the most complete. That is because the order of recitation is a recommended matter and not obligatory, evidenced by his action, peace be upon him, doing that in his prayer at some times.\nSome attach to that the teaching of children from the beginning of the short Mufassal surahs due to the hardship and difficulty in memorizing long Surahs at the beginning, indeed due to its impossibility for them too. The practice of many of the early ones proceeded on that in teaching children. Also attached to them is teaching non-Arabs who do not know Arabic well, and likewise one who embraced Islam and was new to leaving disbelief, due to the existence of difficulty and hardship in starting with reciting and memorizing long Surahs. Also the elderly and those who have stumbling and heaviness in the tongue, and everyone who finds difficulty and hardship in memorizing and learning recitation from the beginning of long Surahs. That is because they all share with children the cause and reason equally. The face of permissibility in...",
    "foot_note": "1. Al-Zarqani: Manahil al-Irfan: (1/344).\n2. Al-Suyuti, Al-Itqan: (p. 155).",
    "book_id": "944",
    "new_page_number": 47
  },
  {
    "serial_number": "1104301",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "...that is the Prophet's reading, peace be upon him, sometimes contrary to the Mushaf arrangement, which indicates the lack of obligation of that in recitation on one hand, as it indicates its permissibility when there is a need with which memorization stumbles like what we mentioned and what is similar to it on a second hand. And because the recitation of every individual is not established in a special Mushaf he has, rather each of them recites and memorizes from one Mushaf in its Mushaf arrangement which the Ummah agreed upon, predecessors and successors, and its acceptance occurred by consensus and work on it is ongoing in the Ummah through all its generations. So altering the Mushaf arrangement is safe and secure [from happening in the written text]. And Allah knows best.\nAmong what indicates that is what is proven in Muslim from the hadith of Hudhayfa bin Al-Yaman, may Allah be pleased with him, who said: I prayed with the Prophet, peace be upon him, one night, so he started Al-Baqarah. I said: He will bow at the hundred. Then he continued. I said: He will pray with it in one Rak'ah. So he continued. I said: He will bow with it. Then he started An-Nisa and read it, then started Al-Imran and read it. He reads slowly. If he passes a verse containing glorification, he glorifies. If he passes a request, he asks. If he passes seeking refuge, he seeks refuge. Then he bowed... Hadith. (1)\nIn a similar vein, Al-Nawawi, may Allah have mercy on him, says in Al-Tibyan: \"Scholars, may Allah have mercy on them, said: The choice is to read according to the order of the Mushaf. So he reads Al-Fatiha, then Al-Baqarah, then Al-Imran, then An-Nisa until he finishes with (Say, I seek refuge in the Lord of mankind), whether he reads in prayer or outside it. It is also desirable if he reads a Surah to read after it the Surah that follows it. If he reads in the first Rak'ah: (Say, I seek refuge in the Lord of mankind), he reads in the second from Al-Baqarah. The evidence for this is: That the arrangement of the Mushaf is for a wisdom, so it should be maintained except where the Sharia reported an exception, like the Morning Prayer on Friday, he reads in the first Rak'ah: (Alif Lam Mim Tanzil) [Al-Sajdah] and in the second: (Has there come) [Al-Insan], and the two Eid prayers (Qaf) and (The Hour has drawn near) [Al-Qamar]. If he violated the order and read a Surah then read the one before it, or violated consecutiveness and read before it what does not follow it, it is permissible but he was leaving the better. As for reading the Surah from its end to its beginning, it is agreed upon its prohibition and condemnation; for it removes some types of miraculousness, and removes the wisdom of arrangement.\" (2)\nAnd just as he used to read in Jumu'ah sometimes Al-Jumu'ah in the \"First\" and Al-Ghashiyah in the \"Second\".\n\nThird: Since the Mushaf arrangement has been agreed upon by the Ummah, predecessors and successors, and work has proceeded on it, no one whomever he is has the right to breach the consensus which is a proof in itself and deviate from it to other types of arrangement, be it chronological, thematic, historical or otherwise upon which the work of those who collected the Quran in its three eras did not proceed, nor did the work of anyone who followed them in goodness proceed. Whether this Mushaf arrangement is a Tawqifi arrangement, or an Ijtihadi arrangement. That is for the protection and preservation of the Book of Allah Almighty from alteration, change, and distortion, and because of what results from that of corruptions and calamities whose consequences are not praised. And also because of what might...",
    "foot_note": "1. Narrated by Muslim: (17/1176).\n2. See: Al-Tahbir fi Ilm al-Tafsir: by Al-Suyuti: (p. 637).",
    "book_id": "944",
    "new_page_number": 48
  },
  {
    "serial_number": "1104302",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "...open the door of daring to tamper with the Book of Allah Almighty which (Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a Wise, Praiseworthy [One]) (Fussilat: 42).\nFrom here was the duty to confront such work and highlight it to the servants from time to time in victory for the Book of Allah Almighty and refuting the attacks of the attackers and doubters in the Book of the Lord of the Worlds from all enemies of the religion and creed, those whose mind does not calm nor decision settle nor stop attacking the Book of Allah Almighty, and they work and strive in that day and night across time and place. And returning their arrows to their throats so they return to their people losers, and retreat defeated, and return to their holes humiliated, and turn back belittled.\nYes, they do that as advice for Allah Almighty and His Book as the First Siddiq (Abu Bakr), may Allah be pleased with him, stood and confronted the withholders of Zakat on the Day of Apostasy, and as the Revered Imam Ahmad bin Hanbal Al-Shaybani, Imam of Ahl al-Sunnah, stood for the Book of Allah on the Day of Trial (Mihnah).\nSo confronting these and their likes and tails was among the most obligatory duties on those concerned with this great matter among those stationed on the frontiers of Islam and its protectors, and those jealous for their religion and the Book of their Lord, and those who love to be included in their Lord's description of them (and those who followed them in goodness) so His promise of His pleasure with them is realized for them, may Allah be pleased with them, in His saying Almighty: (And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment) (At-Tawbah: 100).\nAll that is striving to realize the promise of their Lord which does not fail, nor delay, nor alter, nor change ever, about which He, Glory be to Him, said: (Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian) (Al-Hijr: 9).\n\nConcluding this section, we cite a subtle point for Al-Albani - the Muhaddith of the era - may Allah have mercy on him: This question was directed to him: What is the purpose of collecting the Quran and placing it in the Mushaf, and is the arrangement of Surahs in the Mushaf Tawqifi or Ijtihadi?\nAmong what he answered after a long speech - may Allah have mercy on him - was the following:\n\"... I don't know, I don't know. Here the issue is said to be a worship issue (Ta'abbudiyyah) because the arrangement of the Quran is not according to history, the chronological history you refer to. This is an issue in which scholars differed whether it is Tawqifi or Ijtihadi, unlike when a verse is organized and placed in a Surah, this is Tawqifi with certainty. As for the arrangement of Surahs, their advancement and delay, for example 'Recite in the name of your Lord' supposed according to the question posed earlier to be placed in the first of what was revealed, yet it was placed in the last of what was revealed. They differed in this arrangement for Surahs not in the arrangement of verses in the Surah. The arrangement of verses in the Surah is Tawqifi without any hesitation. As for the arrangement of Surahs as it is now in the Mushaf, they differed. Some of them say this is Tawqifi also from...",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 49
  },
  {
    "serial_number": "1104303",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "the Messenger, peace be upon him, and some of them say no, this is by Ijtihad from those after him. As for me personally, I do not have a decisive opinion on the subject, but I say if the preponderant view is that it is Tawqifi, then here comes the answer to the previous question: Allah knows best. And if it is by Ijtihad from those who collected the Quran after the Messenger, peace be upon him, and classified it after him on this classification, then I did not know what the wisdom is. Therefore, I leave knowledge to its Knower.\" (1)\nLet us contemplate how a flag among the flags (scholar) and a master among the masters of people says such words: (I don't know, I don't know... I did not know what the wisdom is... Therefore, I leave knowledge to its Knower) [May Allah have mercy on Al-Albani, that godly scholar. Our research and wandering in what was mentioned has been long due to the greatness of the matter. Allah, Glory be to Him, alone is behind the intent, and He is our sufficiency and best disposer of affairs. Our last prayer is that praise be to Allah Lord of the Worlds].\n\nResearch Conclusion\nIn the conclusion of this very important study, the researcher praises his Generous Lord, the Bestower of favor, grace, and blessing for what He bestowed - Glory be to Him - upon His poor weak servant of completing a research in a manner by which he hopes for excuse before Allah and reaching the argument and clarity of the path for every fair person hoping to follow the truth and walk the path of the believers in following what the Predecessors and Successors agreed upon of following the Mushaf arrangement with which the Quran was revealed and upon which Uthman's sheets settled and the Ummah received with acceptance, and upon which work continues since Uthman, may Allah be pleased with him, gathered the Ummah on the Imam (Mushaf) until our present time.\n\nStatement of the most important results reached by that brief study\nThat humble study reached important results, perhaps the most prominent are:\n1 - If the arrangement of verses in Surahs is Tawqifi, then the arrangement of the Holy Quran's Surahs is Tawqifi - as well.\n2 - That the Mushaf arrangement is what the Ummah has acted upon since Uthman, may Allah be pleased with him, gathered the Ummah on the Imam. The Companions - may Allah be pleased with them - agreed upon it, and the Ummah received it with acceptance, and work is upon it to our present time.\n3 - That Orientalists are the first who opposed and contradicted the Mushaf arrangement with the chronological arrangement and demanded rearranging the Quran chronologically. Some contemporaries were influenced by them.\n4 - That the first who responded to the command of Orientalists and followed their path and opposed the path of believers in working with the Mushaf arrangement upon which is the work of the Ummah, predecessors and successors, are the three individuals whom we studied together and discussed their work in violating the Mushaf arrangement and inclining towards the chronological...",
    "foot_note": "1. Silsilat al-Huda wa al-Nur: (257). With very slight modification in words because they came recorded, so I adjusted very slight words for the meaning to be straight in writing.",
    "book_id": "944",
    "new_page_number": 50
  },
  {
    "serial_number": "1104304",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "...arrangement called for by the enemies of the religion - the Orientalists. They wanted by that to corrupt the organization of the Quran, but how can they achieve that.\n5 - That the three individuals - authors of the three commentaries - argued with flimsy arguments, frailer and weaker than a spider's web. It has become clear with us in the folds of the research the refutation of those flimsy arguments with clear proofs and shining evidences by rational and transmitted arguments.\n6 - That the goals aimed for by the initiators of changing the Mushaf arrangement to the chronological arrangement were not achieved at all - in that is a decisive indication of the invalidity of what they aimed for and intended.\n7 - That it has been proven by decisive evidence and by rational and transmitted arguments and proofs that the Mushaf arrangement is what the Ummah's practice and the consensus of Predecessors and Successors is upon. So how about when it is proven that it is Tawqifi? Therefore, it must be respected, not interfered with, and those who interfere with it must be confronted.\n8 - The concerned bodies in the Ummah must warn against such audacity on the Book of Allah Almighty and prevent any works similar to what the authors of the three commentaries undertook. They must also rearrange those commentaries according to the Mushaf arrangement. This is also an imperative obligation on the heirs of the authors of those commentaries, all according to ability and capacity.\n9 - The fatwas issued by some of those affiliated with knowledge to the authors of those commentaries did not agree with the truth upon which is the path of believers, and upon which is the work of the first and last of the best of this Ummah. So they are not relied upon and not acted according to, due to their contradiction to the truth upon which is the consensus of the predecessors and successors of the Ummah.\nAnd our last prayer is that praise be to Allah Lord of the Worlds. [*].",
    "foot_note": "1. [*] (Shamela Comment): The conclusion came in what was sent by the author - may Allah preserve him - with difference in phrases, as follows: Conclusion of the research, and stating the most important results reached by that brief study\nA- Conclusion of the Research: In the conclusion of this research, the researcher praises his Generous Lord, the Bestower of favor for what He bestowed of discussing this research, studying it, and clarifying the violation of the Mushaf arrangement and inclining away from it to the chronological arrangement followed by the authors of the three commentaries. He hopes to have been successful in it to hit the truth and follow the path of believers who agreed on the Tawqif of the Mushaf arrangement and the obligation of adhering to it and not deviating from it.\nB- Most Important Results reached by that brief study: That humble brief study reached several important results, the researcher summarizes the most prominent as follows:\nFirst: That the Mushaf arrangement includes two matters:\nAs for the first matter: It is the arrangement of verses in Surahs, and that it is a Tawqifi arrangement with no disagreement in that ever.\nAs for the second matter: It is the arrangement of Surahs according to the Mushaf arrangement. The researcher presented in it the schools of scholars and their disagreement on it. The opinion that the arrangement of Surahs is a Tawqifi matter from the Prophet, peace be upon him, was preponderant to him. It must be respected and it is not permissible to violate it in any case for the following reasons:\na- Because it is the arrangement upon which the Final Review settled.\nb- And because it is the arrangement agreeing with the Quran established in the Preserved Tablet.\nc- And because it is the arrangement upon which the Companions, may Allah be pleased with them, agreed.\nd- And because it is the arrangement which the Ummah received with acceptance.\ne- And because it is the arrangement upon which is the work of Predecessors and Successors.\nSecond: That the beginning of opposing and contradicting the Mushaf arrangement with the chronological arrangement had its first source in some Orientalists, who retreated from that work when the futility of their deed became clear to them and they regretted the time they wasted in it without benefit.\nThird: That the first who breached the gathering of the Ummah and contradicted what the Predecessors and Successors agreed upon of working on the Mushaf arrangement and dared to violate it following and imitating the Orientalists, are the authors of the three commentaries which the researcher presented and discussed. And that these three individuals intended to author and classify those commentaries and write and arrange them according to the chronological order, leaving and throwing behind their backs the Mushaf arrangement upon which the Uthmani sheets settled and upon which the Companions - may Allah be pleased with them all - agreed, and it is the arrangement upon which the Final Review settled, and it is the arrangement agreeing with the Quran established in the Preserved Tablet as passed with us previously.\nFourth: After presenting, studying, and discussing those three commentaries arranged according to the order of revelation, the following became clear to us:\n1 - The invalidity of this work entirely and in detail.\n2 - The invalidity of the flimsy arguments presented by the authors of those three commentaries.\n3 - The non-achievement of the goals aimed for by the initiators of changing the Mushaf arrangement to the chronological arrangement.\n4 - After clarifying the invalidity of the flimsy arguments relied upon by these three individuals and the non-achievement of their goals they aimed for, it is obligatory on the general Ummah to adhere to the Mushaf arrangement agreed upon by the Predecessors and Successors and not to deviate from it to other types of arrangement, whether chronological, thematic, historical or otherwise upon which the work of those who collected the Quran in its three eras did not proceed, nor did the work of anyone who followed them in goodness.\n5 - The obligation of adhering to the Mushaf arrangement on everyone, and people in that are equal. This is for those who see it is a Tawqifi arrangement, and for those who see it is an Ijtihadi arrangement. That is for protection and preservation from changing the organization of the Quran and preservation of the Book of Allah Almighty from any alteration, change, or distortion, and because of what results from that work and this arrangement of great corruptions and major calamities whose consequences are not praised.\n6 - That it is obligatory on general researchers in the Quran and its sciences and on the concerned scientific bodies in the Ummah to be fully vigilant for everything that emerges and is published of researches and works supporting this change and alteration contrary and opposite to the Mushaf arrangement or authoring works different from it, with care to highlight researches, studies, and grounded scientific theses concerned with this aspect as protection and victory for the Holy Quran.\n7 - The concerned bodies - as well - must address the heirs of the authors of the three commentaries to refrain from what their work proceeded on and modify it according to the Mushaf arrangement, taking into account the obligation of alerting to the doctrinal and methodological observations taken against those commentaries, especially the commentary \"Bayan al-Ma'ani\" by \"Mulla Huwaish\", although not reprinting it and warning against taking and circulating it due to what it contained between its sides of calamities and major corruptions is the priority, more correct, and right.",
    "book_id": "944",
    "new_page_number": 51
  },
  {
    "serial_number": "1104305",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 94,
    "volume_number": 1,
    "text": "Index of References\n1 - Al-Itqan fi Ulum al-Quran, by Jalal al-Din Abdul Rahman bin Abi Bakr Al-Suyuti (d. 911 AH), Investigation: Muhammad Abu Al-Fadl Ibrahim - Dar Al-Turath in Cairo, Third Edition, 1405 AH-1985 CE.\n2 - I'jaz al-Quran by Al-Baqillani Author: Abu Bakr Al-Baqillani Muhammad bin Al-Tayyib (Died: 403 AH) Investigator: Al-Sayyid Ahmad Saqr Publisher: Dar Al-Ma'arif - Egypt Edition: Fifth, 1997 CE Number of Parts: 1.\n3 - Al-Burhan fi Ulum al-Quran - by Badr al-Din Muhammad bin Abdullah Al-Zarkashi (d. 794) Investigation: Muhammad Abu Al-Fadl Ibrahim - First Edition - Dar Ihya' Al-Kutub Al-Arabiyyah, Egypt 1376 AH - 1957 CE.\n4 - Al-Burhan fi Tanasub Suwar al-Quran Author: Ahmad bin Ibrahim bin Al-Zubair Al-Thaqafi Al-Gharnati, Abu Ja'far (Died: 708 AH) Investigation: Muhammad Shabani Publisher: Ministry of Awqaf and Islamic Affairs - Morocco Year of Publication: 1410 AH - 1990 CE Number of Parts: 1.\n5 - Al-Bidaya wa Al-Nihaya Author: Abu Al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Publisher: Dar Al-Fikr Year of Publication: 1407 AH - 1986 CE Number of Parts: 15.\n6 - Al-Tafsir wa al-Mufassirun Asasuhu wa Ittijahatuhu wa Manahijuhu fi al-Asr al-Hadith. Dr. Fadl Hasan Abbas, Dar Al-Nafa'is - Amman - Jordan, 1st ed., 1437 AH.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 52
  },
  {
    "serial_number": "1104306",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 95,
    "volume_number": 1,
    "text": "7 - Tafsir Ibn Kathir: Tafsir al-Quran al-Azim Author: Abu Al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Investigator: Sami bin Muhammad Salamah Publisher: Dar Taybah for Publishing and Distribution, 2nd ed., 1420 AH - 1999 CE, Number of Parts: 8.\n8 - Tafsir Ibn Ashur: Al-Tahrir wa Al-Tanwir \"Liberating the Sound Meaning and Enlightening the New Mind from the Interpretation of the Glorious Book\" Author: Muhammad Al-Tahir bin Muhammad bin Muhammad Al-Tahir bin Ashur Al-Tunisi (Died: 1393 AH) Publisher: Al-Dar Al-Tunisiyyah for Publishing - Tunisia Year of Publication: 1984 AH, Number of Parts: 30 (Part 8 is in two sections).\n9 - Tafsir: Bayan al-Ma'ani [Arranged according to order of revelation] Author: Abdul Qadir bin Mulla Huwaish Al-Sayyid Mahmoud Al-Ghazi Al-Ani (Died: 1398 AH) Publisher: Matba'at Al-Taraqqi - Damascus Edition: First, 1382 AH - 1965 CE.\n10 - Al-Tafasir Hasaba Tartib al-Nuzul fi al-Mizan Dr. Mustafa Muslim. Research from Ahl al-Tafsir website, date: 15/12/1432 AH.\n11 - Al-Tafsir Al-Hadith [Arranged according to order of revelation] Author: Darwaza Muhammad Izzat Publisher: Dar Ihya' Al-Kutub Al-Arabiyyah - Cairo Edition: 1383 AH.\n12 - Ta'wil Mushkil al-Quran Author: Abu Muhammad Abdullah bin Muslim bin Qutaybah Al-Dinawari (Died: 276 AH) Investigator: Ibrahim Shams al-Din Publisher: Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon.\n13 - Al-Ta'rif bi Kitab \"Ma'arij al-Tafakkur wa Daqa'iq al-Tadabbur\" by Majdi Makki - Dar Al-Qalam - Damascus - 1st ed - 1427 AH.\n14 - Hasad Qalam, Dr/ Muhammad Abdullah Draz: Investigation, Ahmad Mustafa Fadila, Introduction Dr/ Abdul Sattar Fathallah Saeed, Dar Al-Qalam, 2000 CE.\n15 - Al-Aqidah Al-Islamiyyah wa Ususuha: First Edition: Dar Al-Qalam: (1385 AH).\n16 - Al-Fawakih Al-Dawani 'ala Risalat Ibn Abi Zaid Al-Qayrawani Author: Ahmad bin Ghanim (or Ghunaym) bin Salim Ibn Muhanna, Shihab al-Din Al-Nafrawi Al-Azhari Al-Maliki (Died: 1126 AH) Publisher: Dar Al-Fikr Edition: Without edition Date of Publication: 1415 AH - 1995 CE Number of Parts: 2\n17 - Kitab al-Masahif Author: Abu Bakr bin Abi Dawood, Abdullah bin Sulaiman bin Al-Ash'ath Al-Azdi Al-Sijistani (Died: 316 AH) Investigator: Muhammad bin Abduh Publisher: Al-Faruq Al-Haditha - Egypt/Cairo Edition: First, 1423 AH - 2002 CE Number of Parts: 1\n18 - Mirqat al-Mafatih Sharh Mishkat al-Masabih Author: Ali bin (Sultan) Muhammad, Abu Al-Hasan Nur al-Din Al-Mulla Al-Harawi Al-Qari (Died: 1014 AH) Publisher: Dar Al-Fikr, Beirut - Lebanon Edition: First, 1422 AH - 2002 CE Number of Parts: 9.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 53
  },
  {
    "serial_number": "1104307",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Sound Narrated Tradition Agreeing with the Explicit Rationality in Discussing Three Commentaries Arranged According to the Order of Revelation",
    "edition": "None",
    "publisher": "None",
    "page_number": 96,
    "volume_number": 1,
    "text": "19 - Muhammad Izzat Darwaza wa Tafsir al-Quran al-Karim, Dr. Farid Mustafa Suleiman. Riyadh Maktabat Al-Rashid, PhD thesis at Faculty of Usul al-Din at Al-Azhar University, First Edition, 1993 CE - 1413 AH.\n20 - Majmu' Fatawa al-Allamah Abdul Aziz bin Baz, may Allah have mercy on him. Author: Abdul Aziz bin Abdullah bin Baz (Died: 1420 AH) Supervised its collection and printing: Muhammad bin Saad Al-Shuway'ir Number of Parts: 30 parts.\n21 - Manahil al-Irfan fi Ulum al-Quran Author: Muhammad Abdul Azim Al-Zarqani (d. 1367 AH) Publisher: Matba'at Isa Al-Babi Al-Halabi wa Shurakahu, Third Edition, Number of Parts: 2.\n22 - Al-Azhar Magazine, Editor-in-Chief: Muhammad Farid Wajdi Bey, under the administration of the Diwan of Administration for Al-Azhar and Religious Institutes, Cairo, Issue of Ramadan year (1370 AH/1950 CE, Vol 22). Al-Azhar Press.\n23 - Al-Naba' Al-Azim Nazarat Jadidah fi Al-Quran Al-Karim Author: Muhammad bin Abdullah Draz (Died: 1377 AH) Cared for by: Ahmad Mustafa Fadila Introduced by: Prof. Dr. Abdul Azim Ibrahim Al-Mat'ani Publisher: Dar Al-Qalam for Publishing and Distribution Edition: Increased and Investigated Edition 1426 AH - 2005 CE Number of Parts: 1.",
    "foot_note": "None",
    "book_id": "944",
    "new_page_number": 54
  }
]