[
  {
    "text": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri\nAuthor: يزيد بن أبي حبيب المصري\nYear: 129",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 1
  },
  {
    "text": "sn: 1685\nbook_title: أحاديث يزيد بن أبي حبيب المصري (ت ١٢٩ هـ) - برواية الليث بن سعد المصري\nbook_link: https://shamela.ws/book/30310\nbook_id: 30310\nauthor_name: يزيد بن أبي حبيب المصري\nauthor_year: 129\nnickname: Null\nauthor_link: https://shamela.ws/author/2262\nauthor_ID: 2262\neditor: حمزة أحمد الزين\npublisher: دار الحديث - القاهرة\nedition: 1424 هـ - 2004 م\npages: 68\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب السنة\ncategory_id: 6",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 2
  },
  {
    "serial_number": "1209705",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Books of Sunnah\nBook: Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri\nInvestigation and Study: Hamza Ahmad Al-Zain\nWithin the collection: \"Hadiths of the Great Sheikhs\"\nYear of Printing: 1424 AH - 2004 AD\nBook: Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri\nInvestigation and Study: Hamza Ahmad Al-Zain\nWithin the collection: \"Hadiths of the Great Sheikhs\"\nYear of Printing: 1424 AH - 2004 AD\nInvestigation and Study: Hamza Ahmad Al-Zain\nWithin the collection: \"Hadiths of the Great Sheikhs\"\nYear of Printing: 1424 AH - 2004 AD\nWithin the collection: \"Hadiths of the Great Sheikhs\"\nYear of Printing: 1424 AH - 2004 AD\nYear of Printing: 1424 AH - 2004 AD\nYear of Printing: 1424 AH - 2004 AD\n[The book is automatically numbered and does not match the printed version]",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 3
  },
  {
    "serial_number": "1209706",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 1,
    "volume_number": 1,
    "text": "Text of the Part of Yazid bin Abi Habib:\nIn the name of Allah, the Most Gracious, the Most Merciful.\nThe two Sheikhs, the Trustworthy Sheikh Abu Muhammad Hibatullah bin Ahmad bin Muhammad Al-Akfani, and the Sheikh Abu Al-Qasim Yahya bin Batriq bin Bishr Al-Tarsusi informed us, by reading to him on Friday, the twenty-fourth of Jumada Al-Akhirah in the year five hundred and twenty, and Abu Muhammad Abd Al-Karim bin Hamzah bin Al-Khadir Al-Sulami, they said: Abu Al-Hasan Muhammad bin Al-Mikyal bin Uthman bin Abdullah Al-Azdi Al-Masri informed [us], by reading to him in Damascus, in the Congregational Mosque in the month of Rabi' Al-Awwal of the year four hundred and fifty-seven, he said: The Sharif Abu Al-Qasim Al-Maymun bin Hamzah bin Al-Hussein Al-Alawi Al-Husseini, the Trustworthy, informed [us] from his book by reading to him. By the reading of Khalaf bin Muhammad bin Ali Al-Wasiti, the Hafiz, he said: Abu Bakr Ahmad bin Abd Al-Warith bin Jarir Al-Assal informed [us] in Muharram of the year three hundred and nineteen, he said: Abu Musa Isa bin Hammad Zughbah informed [us] in the year two hundred and forty-two, he said: Al-Layth bin Sa'd informed us, from Yazid bin Abi Habib, from Muhammad bin Ishaq, from Ja'far bin Abdullah bin Al-Hakam that: In the past, the Imam on Friday used to not mention anything except the Quran and the Remembrance (Dhikr). But when the people innovated, an Amir was appointed over Madinah and he began cursing men. Perhaps if you remain, you will be pleased with the companionship of those who are worse than them.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 4
  },
  {
    "serial_number": "1209707",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 2,
    "volume_number": 1,
    "text": "2 - Al-Maymun bin Hamzah informed us, saying: Ahmad bin Abd Al-Warith told us, saying: Isa bin Hammad told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Muhammad bin Ishaq, from Makhul: That Ali, peace be upon him, used to set [the blood money] for the central incisors at fifty, fifty [camels]; and for the lateral incisors at forty, forty; and for the canines at thirty, thirty; and for the molars at twenty-six, twenty-six.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 5
  },
  {
    "serial_number": "1209708",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 3,
    "volume_number": 1,
    "text": "2 - And the judgment of Umar bin Al-Khattab, may Allah be pleased with him, regarding the central incisors and the lateral incisors was five camels for each tooth, and they are twelve [teeth in total], and for the molars a camel for a camel. And Sa'id bin Al-Musayyib said: \"If I were a judge, I would have made for the molars a camel for a camel until the mouth completes the [full] blood money.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 6
  },
  {
    "serial_number": "1209709",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 4,
    "volume_number": 1,
    "text": "3 - Al-Maymun informed us, saying: Ahmad informed [us], saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Aban bin Salih, that concerning the affair of Barirah, the Messenger of Allah, may Allah bless him and grant him peace, entered upon Aisha, may Allah have mercy upon her, and found meat with her. He said: \"What is this meat, O Aisha?\" She said: \"Meat that was gifted to Barirah, given to her as charity, so nothing prevented us from serving it except that you do not eat charity.\" So the Messenger of Allah, may Allah bless him and grant him peace, said: \"It is charity for Barirah, and it is a gift for us.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 7
  },
  {
    "serial_number": "1209710",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 5,
    "volume_number": 1,
    "text": "3 - He said: And also concerning her affair, she was set free while her husband was a slave. So he spoke to him [the Prophet] regarding her, and the Messenger of Allah, may Allah bless him and grant him peace, spoke to him. He said [to her]: \"Return to your husband.\" She said: \"As for if my affair is in my hand, then I will never return.\" He said: \"Your affair is in your hand.\" So she refused to return.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 8
  },
  {
    "serial_number": "1209711",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 6,
    "volume_number": 1,
    "text": "4 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Sa'id bin Abi Hilal: That the first time a loan was guaranteed was when the Messenger of Allah, may Allah bless him and grant him peace, called Safwan bin Umayyah in the Year of the Conquest (Fath), while the Messenger of Allah, may Allah bless him and grant him peace, wanted to go out to Hunayn. He said: \"It has been mentioned to us that you have weapons, so give them to us so we may use them for assistance in this war of ours.\" He [Safwan] said: \"Is it by force?\" The Messenger of Allah, may Allah bless him and grant him peace, said: \"Rather, it is a guaranteed loan upon us until we bring it back to you.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 9
  },
  {
    "serial_number": "1209712",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 7,
    "volume_number": 1,
    "text": "5 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Muhammad bin Talhah bin Yazid bin Rukanah, from Banu Al-Muttalib, that Amr bin Dinar, the client of Badhan, told him that it reached him that Safwan bin Umayyah came to the Messenger of Allah, may Allah bless him and grant him peace, in Madinah. He said: \"O Abu Umayyah, what brought you here?\" He said: \"O Messenger of Allah, the people claim that whoever does not migrate has no share [in goodness].\" So the Messenger of Allah, may Allah bless him and grant him peace, said: \"I swear upon you that you return until you wake up in the valley of Makkah.\" So Safwan went out and slept in the mosque, and a man stole his cloak from under his head while he was sleeping. He woke up because of him, followed him, caught him, and brought him to the Messenger of Allah, may Allah bless him and grant him peace. The Messenger of Allah, may Allah bless him and grant him peace, ordered that his hand be cut off. He [Safwan] said: \"O Messenger of Allah, rather free him, for it [the cloak] is his.\" He said: \"Why did you not do so before bringing him to me, O Abu Umayyah?\" So the Messenger of Allah, may Allah bless him and grant him peace, ordered regarding him, and it [his hand] was cut.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 10
  },
  {
    "serial_number": "1209713",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 8,
    "volume_number": 1,
    "text": "6 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth told us, from Yazid bin Abi Habib, from Muhammad bin Ishaq, from Muhammad bin Talhah bin Yazid, that his maternal aunt, the daughter of Mas'ud ibn Al-Ajma', told him that her father said to the Messenger of Allah, may Allah bless him and grant him peace, regarding the Makhzumi woman who stole a velvet cloth: \"We will ransom her with forty ounces [of gold].\" The Messenger of Allah, may Allah bless him and grant him peace, said: \"To be purified is better for her.\" So he ordered regarding her, and her hand was cut. And she was from Banu Abd Al-Asad.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 11
  },
  {
    "serial_number": "1209714",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 9,
    "volume_number": 1,
    "text": "7 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Al-Ala' bin Abd Al-Rahman, the client of Juhaynah, that his father told him that Abu Sa'id Al-Khudri said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"The waist wrapper (Izar) of the believer is to the middle of the shin; whatever is down to the ankles, there is no harm in it; and whatever is below the ankles is in the Fire. Allah does not look at the one who drags his garment out of arrogance.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 12
  },
  {
    "serial_number": "1209715",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 10,
    "volume_number": 1,
    "text": "8 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Sa'id bin Abi Hilal, that Mutarrif from Banu Amir bin Sa'sa'ah told him that Uthman bin Abi Al-As Al-Thaqafi called for milk for him to give him to drink. Mutarrif said: \"I am fasting.\" So Uthman said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"Fasting is a shield from the Fire, like the shield of one of you from fighting.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 13
  },
  {
    "serial_number": "1209716",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 11,
    "volume_number": 1,
    "text": "9 - And I heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"A good fasting is [fasting] three days of the month.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 14
  },
  {
    "serial_number": "1209717",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 12,
    "volume_number": 1,
    "text": "10 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abdullah bin Umar, that he was asked for a legal ruling regarding Tila' (cooked juice). He said: \"Vinegar is lawful, raisins are lawful, and grapes are lawful, but Khamr (wine/intoxicant) is forbidden. By Allah, no one drinks it except that faith decreases until nothing of it remains in his chest. And he does not enter a house except that house becomes filth until he leaves it.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 15
  },
  {
    "serial_number": "1209718",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 13,
    "volume_number": 1,
    "text": "11 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ammar bin Abi Farwah, that Muhammad bin Muslim told him that Urwah and Amrah bint Abd Al-Rahman bin Sa'd told him that Aisha, may Allah be pleased with her, told them that the Messenger of Allah, may Allah bless him and grant him peace, said: \"If a slave girl commits adultery, flog her; and if she commits adultery [again], flog her; and if she commits adultery [again], flog her; then sell her even for a rope of hair.\" The 'dafir' is the rope. Al-Layth said: The slave girl is not flogged for adultery absolutely [without conditions]; rather if she becomes pregnant from adultery, or four witnesses testify against her that they saw her committing adultery, or she confessed to that, then she is flogged by her confession.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 16
  },
  {
    "serial_number": "1209719",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 14,
    "volume_number": 1,
    "text": "12 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Safwan bin Sulaym, from Abd Al-Rahman Al-A'raj, the client of Banu Makhzum, from Abu Hurairah, that he said: The Messenger of Allah, may Allah bless him and grant him peace, prostrated in \"When the sky has split\" [Surah Al-Inshiqaq, verse 1] and \"Read in the name of your Lord\" [Surah Al-Alaq, verse 1].",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 17
  },
  {
    "serial_number": "1209720",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 15,
    "volume_number": 1,
    "text": "13 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Khalid bin Kathir, that Abu Ishaq told him, that Al-Harith bin Abd Al-Rahman told him that Ali, peace be upon him, used to say regarding the Zakat al-Fitr (charity of breaking the fast): \"A Sa' of barley; and if he cannot find that, then a Sa' of dates; and if he cannot find that, then a Sa' of raisins.\" Al-Layth bin Sa'd said: \"It has reached us that the Messenger of Allah, may Allah bless him and grant him peace, mandated the Zakat al-Fitr as two Mudds of wheat, or a Sa' of barley, or a Sa' of dates, upon every free person and slave, male or female, young or old.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 18
  },
  {
    "serial_number": "1209721",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 16,
    "volume_number": 1,
    "text": "14 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed [us], from Yazid bin Abi Habib, that Khalid bin Kathir Al-Hamdani told him that Al-Sariy bin Isma'il Al-Kufi told him that Al-Sha'bi told him that he heard Al-Nu'man bin Bashir say: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Indeed, from wheat there is Khamr (wine), and from barley there is Khamr, and from raisins there is Khamr, and from dates there is Khamr, and from honey there is Khamr, and I forbid every intoxicant.\" Al-Layth said: It reached us from the Companions of the Prophet, may Allah bless him and grant him peace, and others from the jurists that they used to say: \"From every fruit there is Khamr, and whatever intoxicates in large amounts, a small amount of it is forbidden.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 19
  },
  {
    "serial_number": "1209722",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 17,
    "volume_number": 1,
    "text": "15 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Khalid bin Kathir, that Abu Hafs Al-Umari told him that Al-Hasan Al-Basri told him that Al-Mughirah bin Shu'bah said to him: The Messenger of Allah, may Allah bless him and his family and grant them peace, went to relieve himself, so I took the water container and went with him. When the Messenger of Allah, may Allah bless him and grant him peace, finished relieving himself, he performed ablution while wearing a Jubbah with tight sleeves. The Messenger of Allah, may Allah bless him and grant him peace, tried to bring out his forearms but could not due to its tightness, so he brought his hand out [from underneath] and placed it on his shoulder. He washed his face and hands and wiped over the Khuffs (leather socks) and the turban. This was on the day he prayed behind Abd Al-Rahman bin Awf. That was because the Prophet, may Allah bless him and grant him peace, was delayed in his exit, and he arrived while his Companions were praying behind Abd Al-Rahman bin Awf. Abd Al-Rahman moved back, but the Messenger of Allah, may Allah bless him and grant him peace, sent him back [to lead] and prayed behind him. Al-Layth said: It reached us that the Messenger of Allah, may Allah bless him and grant him peace, went out to the open land [to relieve himself] and stayed for a long time. The prayer was established, so Abd Al-Rahman bin Awf stepped forward and prayed one rak'ah and two prostrations with them. Then the Messenger of Allah, may Allah bless him and grant him peace, came and entered the prayer while they did not notice, so he bowed a rak'ah with them. Abd Al-Rahman said the Taslim (concluding peace), and the Messenger of Allah, may Allah bless him and grant him peace, stood up and made up the second rak'ah of Fajr. The people were alarmed, but when the Messenger of Allah, may Allah bless him and grant him peace, said the Taslim, he said: \"You have done correctly.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 20
  },
  {
    "serial_number": "1209723",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 18,
    "volume_number": 1,
    "text": "16 - Al-Maymun informed us, saying: Ahmad told us, Isa told us, saying: Al-Layth informed [us], from Yazid bin Abi Habib, from Abdullah bin Rashid Al-Zawfi, from Abdullah bin Abi Murrah Al-Zawfi, from Kharijah bin Hudhafah that he said: The Messenger of Allah, may Allah bless him and grant him peace, came out to us and said: \"Indeed, Allah, Mighty and Majestic, has supplied you with a prayer that is better for you than red camels: the Witr. Allah has appointed it for you between the Isha prayer until the dawn breaks.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 21
  },
  {
    "serial_number": "1209724",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 19,
    "volume_number": 1,
    "text": "17 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth told us, from Yazid bin Abi Habib, from Abu Al-Khayr, from Uqbah bin Amir that the Messenger of Allah, may Allah bless him and grant him peace, gave him sheep to distribute among his companions as sacrifices. A kid goat (Atud) remained, so he mentioned it to the Messenger of Allah, may Allah bless him and grant him peace. He said: \"Sacrifice it yourself.\" Al-Layth said: It reached us from the Messenger of Allah, may Allah bless him and grant him peace, that he granted a concession to a man from his Companions regarding a Jadh'ah (young) goat, and said: \"There is no concession in it for anyone after you.\" And that he granted a concession regarding the Jadh'ah (young) sheep to be sacrificed.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 22
  },
  {
    "serial_number": "1209725",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 20,
    "volume_number": 1,
    "text": "18 - Al-Maymun informed us, saying: Ahmad told us, Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abu Al-Khayr, from Uqbah bin Amir that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Beware of entering upon women.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 23
  },
  {
    "serial_number": "1209726",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 21,
    "volume_number": 1,
    "text": "18 - A man from the Ansar said: \"O Messenger of Allah, what about the Hamuw (the brother-in-law)?\" He said: \"The Hamuw is death.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 24
  },
  {
    "serial_number": "1209727",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 22,
    "volume_number": 1,
    "text": "19 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed [us], from Yazid bin Abi Habib, from Muhammad bin Ishaq, from Mu'adh bin Abdullah bin Khubayb, from Abdullah bin Khubayb, from Abdullah bin Unays, the Companion of the Messenger of Allah, may Allah bless him and grant him peace, that he was asked about the Night of Decree (Laylat al-Qadr). He said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"Seek it tonight.\" And that night was the night of the twenty-third. A man said: \"O Messenger of Allah, is it then or on the eighth [remaining]?\" He said: \"Rather, or the ninth [remaining], for indeed the month is not complete [referring to the calculation of nights].\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 25
  },
  {
    "serial_number": "1209728",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 23,
    "volume_number": 1,
    "text": "20 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, Al-Layth informed [us], from Yazid bin Abi Habib, from Abu Al-Nadr, from Abd Al-Rahman bin Yaqub, the client of Al-Huraqah, a clan from the clans of Juhaynah, that he said: The master of my grandmother married my grandmother to Abdullah, then he freed her as a Mudabbarah (freed upon his death), and she had given birth to children before he freed her, and she gave birth to children after her freedom as a Mudabbarah. Then her master died, so she took the dispute to Uthman bin Affan. He judged: That those she gave birth to before she was made Mudabbarah are slaves, and those she gave birth to after the Tadbir are to be freed with her freedom.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 26
  },
  {
    "serial_number": "1209729",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 24,
    "volume_number": 1,
    "text": "21 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth told us, from Yazid bin Abi Habib, from Ibrahim bin Salih bin Abdullah, and his name by which he is known is Nu'aym ibn Al-Nahham, but the Messenger of Allah, may Allah bless him and grant him peace, named him Salih, that he informed him that Abdullah bin Umar said to Umar bin Al-Khattab: \"Propose to the daughter of Salih on my behalf.\" He said: \"Indeed he has orphans, and he is not one to prefer us over them.\" So Abdullah went to his uncle Zaid bin Al-Khattab to propose on his behalf. Zaid went to Salih and said: \"Indeed Abdullah bin Umar sent me to you to propose to your daughter.\" He said: \"I have orphans, and I am not one to dust my flesh and raise your flesh [neglect my kin for yours]. Indeed, I have married her to so-and-so.\" The desire of her mother was for Abdullah bin Umar, so she came to the Messenger of Allah, may Allah bless him and grant him peace, and said: \"O Prophet of Allah, Abdullah proposed to my daughter, but her father married her off while she is an orphan in his care and did not consult her.\" So the Messenger of Allah, may Allah bless him and grant him peace, sent for Salih and said: \"Did you marry off your daughter without consulting her?\" The Messenger of Allah, may Allah bless him and grant him peace, said: \"Consult women regarding themselves, consult women regarding themselves,\" even if she is a virgin. So Salih said: \"She only did this because Ibn Umar offered her a dowry.\" He said: \"Then she has in my wealth the like of what he gave her.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 27
  },
  {
    "serial_number": "1209730",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 25,
    "volume_number": 1,
    "text": "22 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abu Al-Khayr, from Ibn Zurayr, from Ali bin Abi Talib, peace be upon him, who said: A mule was gifted to the Messenger of Allah, may Allah bless him, so he rode it. Ali, peace be upon him, said: \"If we were to make donkeys cover horses, we would have the like of this!\" So the Messenger of Allah, may Allah bless him and grant him peace, said: \"Only those who do not know do that.\" Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib and others, that Umar bin Abd Al-Aziz, may Allah have mercy upon him, wrote to his worker over the Diwan (registry) of the people of Egypt, Sa'd bin Uqbah, ordering him that whoever makes a donkey cover a mare, erase five dinars from his stipend.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 28
  },
  {
    "serial_number": "1209731",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 26,
    "volume_number": 1,
    "text": "24 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ibn Shihab that he wrote mentioning that Amir bin Sa'd bin Abi Waqqas informed him that Sa'd bin Abi Waqqas fell severely ill during the Farewell Pilgrimage. The Messenger of Allah, may Allah bless him and grant him peace, visited him. He [Sa'd] said: 'O Messenger of Allah, I have abundant wealth and no one inherits from me except my daughter. Shall I give two-thirds of my wealth in charity?' He said: 'No.' He said: 'Half?' He said: 'No.' He said: 'Give one-third in charity, and one-third is a lot. O Sa'd bin Abi Waqqas, that you leave your heirs rich is better than that you leave them dependent, begging from people.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 29
  },
  {
    "serial_number": "1209732",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 27,
    "volume_number": 1,
    "text": "25 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that he said: Ibn Shihab wrote to me saying: The Sunnah in the authentic reports is that Salim told me from his father that a man from Thaqif feared death, so he divorced his wives and divided his wealth. Umar bin Al-Khattab sent for him and said: 'Perhaps Satan has cast into your heart that you are about to die, so you divided your wealth and divorced your wives. And perhaps you will not remain after you stand from my presence until you die, except for a short while. So if you die before you take back your wealth and take back your wives, I will surely make your wives inherit—and he had not made their divorce irrevocable—then I will order regarding your grave and it shall be stoned, until I make it like the grave of Abu Righal.' He said: So he went out and took back his wives and retrieved his wealth, then he did not tarry [long] until he died. Ibn Shihab said: So Allah, Mighty and Majestic, purified him from contradicting the Sunnah through the opinion of Umar.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 30
  },
  {
    "serial_number": "1209733",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 28,
    "volume_number": 1,
    "text": "26 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Ibn Shimasah told him that Uqbah bin Amir stood in prayer while he was [praying] sitting. The people said: 'Subhan Allah (Glory be to Allah), Subhan Allah.' He knew what they intended. When he completed his prayer, he prostrated two prostrations while he was sitting. He said: 'I heard what you said, and this is the Sunnah.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 31
  },
  {
    "serial_number": "1209734",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 29,
    "volume_number": 1,
    "text": "27 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Suwayd bin Qays informed him, from Muawiyah bin Hudaij, that the Messenger of Allah, may Allah bless him and grant him peace, prayed one day, said the Taslim (salutation), and left, while a Rak'ah remained of the prayer. A man caught up to him and said: 'You forgot part of the prayer.' So he returned, entered the mosque, and ordered Bilal, who established the prayer, and he prayed one Rak'ah with the people. I [the narrator] informed the people about that, and they said to me: 'Do you know the man?' I said: 'No, unless I see him.' Then he passed by me, so I said: 'It is this one.' They said: 'Talhah bin Ubaidullah.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 32
  },
  {
    "serial_number": "1209735",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 30,
    "volume_number": 1,
    "text": "28 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Yazid bin Qays, from Muawiyah bin Hudaij, from Muawiyah bin Sufyan, that he asked his sister Umm Habibah, the wife of the Prophet, may Allah bless him and grant him peace: 'Does he [the Prophet] pray in the garment in which he has intercourse?' She said: 'Yes, if he does not see any harm [impurity] on it.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 33
  },
  {
    "serial_number": "1209736",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 31,
    "volume_number": 1,
    "text": "29 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Imran bin Abi Anas, from Abu Salamah, from Abu Hurairah that the Messenger of Allah, may Allah bless him and grant him peace, prayed one day and said the Taslim after two Rak'ahs, then he left. Dhu Al-Shimalayn caught up to him and said: 'O Messenger of Allah, was the prayer shortened or did you forget?' He said: 'The prayer was not shortened, and I did not forget.' He said: 'Rather [it happened], by the One who sent you with the truth.' So the Messenger of Allah said: 'Did Dhu Al-Yadayn speak the truth?' They said: 'Yes, O Messenger of Allah.' So he prayed two Rak'ahs with the people.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 34
  },
  {
    "serial_number": "1209737",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 32,
    "volume_number": 1,
    "text": "30 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Muhammad bin Ishaq, from Abd Al-Rahman bin Al-Aswad Al-Nakha'i, from his father Al-Aswad, from Abdullah that he said: I received {By those [winds] sent forth in gusts} [Al-Mursalat: 1] from the Messenger of Allah, may Allah bless him and grant him peace, on the Night of the Snake. They said: 'And what is the Night of the Snake?' He said: A snake came out, so the Messenger of Allah, may Allah bless him and grant him peace, said: 'Kill it.' But it disappeared into a hole. So the Messenger of Allah, may Allah bless him and grant him peace, said: 'Leave it, for Allah, Mighty and Majestic, has protected it from your evil as He protected you from its evil.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 35
  },
  {
    "serial_number": "1209738",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 33,
    "volume_number": 1,
    "text": "31 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Al-Rabi' bin Sabrah Al-Juhani, from his father Sabrah that he said: The Messenger of Allah, may Allah bless him and his family and grant them peace, permitted Mut'ah (temporary marriage). So I and a man from the Companions of the Messenger of Allah, may Allah bless him and grant him peace, who was older than me, went to a woman from Banu Amir who was like a tall, long-necked young camel. We offered ourselves to her. She said: 'What will you give me?' I said: 'My cloak.' And my companion said: 'My cloak.' My companion's cloak was better than my cloak, but I was more youthful than him. When she looked at my companion's cloak, it pleased her, and when she looked at me, I pleased her. Then she said: 'You and your cloak are sufficient for me.' So I stayed with her for three days. Then the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever has anything of these women whom he enjoys [in Mut'ah], let him let her go.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 36
  },
  {
    "serial_number": "1209739",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 34,
    "volume_number": 1,
    "text": "32 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak who informed him that Abu Bakr said to Aisha, may Allah be pleased with her, when death approached him: 'Indeed, the hardest of people for me to lose and the most beloved of them to follow me [in goodness] is you. I had given you the wealth [date palms] that is in [the land of] the Banu [so-and-so], and if you had harvested it for a year, it would have been yours. But you did not harvest it, and now it is only [inheritance for] your two brothers and your two sisters.' Aisha said: 'O Abu Bakr, do I have any sister except one?' Abu Bakr said: 'It has been cast into my soul that inside the daughter of Kharijah is a girl.' So divide it according to the Book of Allah and His ordained shares.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 37
  },
  {
    "serial_number": "1209740",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 35,
    "volume_number": 1,
    "text": "33 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Urwah, from Aisha: That she informed him that her paternal uncle through breastfeeding, named Aflah, asked permission to enter upon her, but she screened herself from him. She informed the Messenger of Allah, may Allah bless him and grant him peace, and he said: 'Do not screen yourself from him, for indeed breastfeeding prohibits what lineage prohibits.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 38
  },
  {
    "serial_number": "1209741",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 36,
    "volume_number": 1,
    "text": "34 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Abu Hurairah: That the Messenger of Allah, may Allah bless him and grant him peace, forbade combining four women [meaning two pairs]: 'A woman and her paternal aunt, and a woman and her maternal aunt.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 39
  },
  {
    "serial_number": "1209742",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 37,
    "volume_number": 1,
    "text": "35 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that Zainab bint Abi Salamah informed him: That Umm Habibah said to the Messenger of Allah, may Allah bless him and grant him peace: 'We have talked that you are going to marry Durrah bint Abi Salamah?' The Messenger of Allah, may Allah bless him and grant him peace, said: 'Even if I had not married Umm Salamah, she would not be lawful for me; indeed her father is my brother through breastfeeding.' Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Irak said: Palm trees and crops are not to be bought until their fruit becomes evident. And when their fruit becomes evident, the merchants stipulate [a condition] if a calamity strikes it, such as a flood, an army, locusts, or hail.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 40
  },
  {
    "serial_number": "1209743",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 38,
    "volume_number": 1,
    "text": "37 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak that a man from Ghatafan asked for a legal ruling from Abd Al-Malik bin Marwan, the Commander of the Faithful: Is it proper for a man to take his slave girl away from her husband? Abd Al-Malik said: 'Has anyone among you heard anything about this?' Those who were with him remained silent. So he sent for Qabisah, who said: 'A man did that in the time of Umar bin Al-Khattab, so he ordered concerning him and he was flogged one hundred lashes and he [Umar] freed her.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 41
  },
  {
    "serial_number": "1209744",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 39,
    "volume_number": 1,
    "text": "38 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Irak informed him, from Urwah, from Aisha, who informed him that Quraysh used to fast on the Day of Ashura in the Pre-Islamic Period (Jahiliyyah). Then the Messenger of Allah, may Allah bless him and grant him peace, ordered fasting it until Ramadan was made obligatory. Then the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever wishes, let him fast it, and whoever wishes, let him break the fast.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 42
  },
  {
    "serial_number": "1209745",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 40,
    "volume_number": 1,
    "text": "39 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak bin Malik, who said: Abdullah bin Umar did not use to fast it [Ashura] unless his [habitual] fasting coincided with it.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 43
  },
  {
    "serial_number": "1209746",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 41,
    "volume_number": 1,
    "text": "40 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Abu Hurairah, that he said: 'Do not pray Witr with three [Rak'ahs] like the Maghrib prayer; pray Witr with five, or with seven, or with eleven.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 44
  },
  {
    "serial_number": "1209747",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 42,
    "volume_number": 1,
    "text": "41 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Urwah: That he informed him that the Messenger of Allah, may Allah bless him and grant him peace, used to pray while Aisha was lying across between him and the Qiblah on the bed upon which they used to sleep.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 45
  },
  {
    "serial_number": "1209748",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 43,
    "volume_number": 1,
    "text": "42 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that Talhah bin Ubaidullah informed him that he entered upon Abdullah bin Umar, he and Abu Salamah bin Abd Al-Rahman. Ibn Umar invited them to lunch on the Day of Arafah. Abu Salamah said: 'Are these not the nights of the ten [days] which Allah mentioned in the Quran?' Ibn Umar said: 'And how do you know?' He said: 'I doubt.' He said: 'Yes, then doubt.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 46
  },
  {
    "serial_number": "1209749",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 44,
    "volume_number": 1,
    "text": "43 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that Urwah informed him that the Messenger of Allah, may Allah bless him and grant him peace, proposed to Aisha through Abu Bakr. Abu Bakr said: 'I am only your brother.' He said: 'You are my brother in the religion of Allah, Mighty and Majestic, and His Book, and she is lawful for me.' Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that he heard Marwan at the [Hajj] season saying: '[The hand] was cut for a shield, and a camel is better than a shield.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 47
  },
  {
    "serial_number": "1209750",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 45,
    "volume_number": 1,
    "text": "45 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Urwah, from Aisha who informed him that the Messenger of Allah, may Allah bless him and grant him peace, used to pray thirteen Rak'ahs at night, including the two Rak'ahs of Fajr.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 48
  },
  {
    "serial_number": "1209751",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 46,
    "volume_number": 1,
    "text": "46 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak that it reached him that Nawfal bin Muawiyah bin Urwah said: I heard the Messenger of Allah, may Allah bless him and grant him peace, say: 'Indeed, among the prayers is a prayer, whoever misses it, it is as if he has lost his family and his wealth.' Ibn Umar said: 'I heard the Messenger of Allah, may Allah bless him and grant him peace, say: It is the Asr prayer.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 49
  },
  {
    "serial_number": "1209752",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 47,
    "volume_number": 1,
    "text": "47 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that he heard Abu Hurairah say: 'Saying Tasbih (Subhan Allah) is for men, and clapping is for women in the prayer.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 50
  },
  {
    "serial_number": "1209753",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 48,
    "volume_number": 1,
    "text": "48 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that the Messenger of Allah, may Allah bless him and grant him peace, used to say: 'The days of Tashreeq are three days of eating and drinking.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 51
  },
  {
    "serial_number": "1209754",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 49,
    "volume_number": 1,
    "text": "49 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that Urwah informed him that a man from Banu Ghifar joined the Messenger of Allah, may Allah bless him and grant him peace, and accompanied him, leaving his parents behind. The Messenger of Allah, may Allah bless him and grant him peace, said to him: 'Who is there to serve your parents?' He said: 'I am.' The Messenger of Allah, may Allah bless him and grant him peace, gave him a slave to serve. The Messenger of Allah, may Allah bless him and grant him peace, waited for some days, then he asked him about the slave, 'What did he do?' He said: 'I freed him.' He said: 'If you had given him to your parents, it would have been better for you.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 52
  },
  {
    "serial_number": "1209755",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 50,
    "volume_number": 1,
    "text": "50 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Irak used to say: It is permissible for the one not in Ihram (Muftir) to slaughter with it [referring to game]. And he informed him that the Messenger of Allah was asked about that, and he said: 'It is lawful.'",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 53
  },
  {
    "serial_number": "1209756",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 51,
    "volume_number": 1,
    "text": "51 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Abu Hurairah, that he heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"The worst of people is the two-faced person who comes to these people with one face and to those people with [another] face.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 54
  },
  {
    "serial_number": "1209757",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 52,
    "volume_number": 1,
    "text": "52 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, from Urwah, that he heard Aisha, may Allah be pleased with her, saying: \"Oh, I wish I had not become angry.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 55
  },
  {
    "serial_number": "1209758",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 53,
    "volume_number": 1,
    "text": "53 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Al-Hakim bin Abdullah bin Qays, that a man from the Ansar came to Abdullah bin Umar and said: \"We have a harvest or date-picking [season], and we have orphans and poor people who do not wait [or cannot wait]. Shall we put that [charity] with our orphans and our poor people?\" He said: \"No, but give that to the one whom Allah has entrusted with the authority. But if you wish to be generous to your poor people, then do so.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 56
  },
  {
    "serial_number": "1209759",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 54,
    "volume_number": 1,
    "text": "54 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Salim bin Abdullah, from Abu Al-Jarrah, the client of Umm Habibah, that she heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"The angels do not accompany a traveling party in which there is a bell.\" Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that Amr bin Sa'd, one of the Banu Abd Al-Ashhal, married a woman and did not know she was his sister through breastfeeding until a woman informed him that she had breastfed her. So he divorced her. Then he and his cousin Mu'adh insulted each other, and he [Mu'adh] said: \"O one who has intercourse with his sister!\" So he came to Marwan and said to him: \"I only said what had happened.\" So he [Marwan] said at that time: \"You divorced her when you knew that.\" So Marwan lashed him [Mu'adh] the Hadd punishment [for slander].",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 57
  },
  {
    "serial_number": "1209760",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 55,
    "volume_number": 1,
    "text": "56 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Irak, that a man went to Bahrain. His wife said to him: \"Take this slave girl of mine and sell her.\" So he made a group of Muslims witnesses to her statement. When he arrived in Bahrain, he displayed her in the market until her price reached its limit, then he made a group of Muslims witnesses [saying]: \"I have taken her for myself at this price.\" And when the man returned to his family and his wife knew that he had bought her, she went to Umar, may Allah be pleased with him, and said: \"Indeed my husband has had intercourse with my slave girl.\" He [Umar] said: \"By Allah, if you are telling the truth, I will surely stone him.\" So he [the husband] established proof that she had ordered him to sell her, and established proof that he had displayed her in the market until her price reached its limit and then bought her. So he [Umar] lashed her [the wife] the Hadd punishment [for slander].",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 58
  },
  {
    "serial_number": "1209761",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 56,
    "volume_number": 1,
    "text": "57 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ja'far bin Rabi'ah, from Irak, that he said: It has reached me that the Messenger of Allah, may Allah bless him and grant him peace, stayed in Makkah for fifteen days shortening the prayer to two Rak'ahs, two Rak'ahs, after the Conquest. Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ja'far, that a man told him that he heard Abd Al-A'la bin Abdullah bin Utbah say: I heard my father say: \"Whoever exceeds fifteen [days] in a town must complete [the prayer].\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 59
  },
  {
    "serial_number": "1209762",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 57,
    "volume_number": 1,
    "text": "59 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ja'far, from Irak, from Urwah, from Aisha, may Allah be pleased with her, that she said: Umm Habibah asked the Messenger of Allah, may Allah bless him and grant him peace, about the blood [of Istihadah/irregular bleeding]? Aisha said: I saw her washbasin filled with blood. The Messenger of Allah, may Allah bless him and grant him peace, said to her: \"Wait for the extent of time that your menstruation used to hold you back, then bathe and pray.\" Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Muhammad bin Muslim said: It is not proper for a man to part with his Dinar when he exchanges it until he takes the exchange. Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, that Ibn Shihab said: When a man prays voluntary prayer while traveling and he is on his mount, let him pray towards his face [direction] wherever it is. And if he wants to pray the obligatory prayer, let him dismount and then pray facing the Qiblah. meaning: [Unless] if he is in fear, then let him pray facing the Qiblah or otherwise. Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Ja'far, from Muhammad bin Shihab that he said: One begins with the private parts in the bath of Janabah (major impurity). And Muhammad said: The fetus is eaten if it has grown hair, and its slaughter is the slaughter of its mother.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 60
  },
  {
    "serial_number": "1209763",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 58,
    "volume_number": 1,
    "text": "63 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid, meaning Ibn Abi Habib, that Al-Sunabihi told him that he heard Ka'b say: \"We will rub Iraq like the rubbing of tanned leather [or heavy rain], and we will crumble Egypt like the crumbling of dung.\" And Al-Layth said: A man told me, from Wahib Al-Ma'afiri that he said: \"He will split Sham (the Levant) like the splitting of a hair.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 61
  },
  {
    "serial_number": "1209764",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 59,
    "volume_number": 1,
    "text": "64 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abu Al-Nadr, that it was mentioned to him that the Prophet of Allah, may Allah bless him and grant him peace, in the year he raided Tabuk, went out to the open area [to relieve himself]. And the Prophet of Allah, may Allah bless him and grant him peace, when he went out, would go far until no one could see him. So Al-Mughirah bin Shu'bah went and sat waiting for him on his path, having with him a container of water. When the Messenger of Allah, may Allah bless him and grant him peace, passed by him returning, he said to him: \"Do you have water?\" So he handed him the water, and the Messenger of Allah, may Allah bless him and grant him peace, performed ablution, then he wiped over his Khuffs (leather socks). Al-Mughirah said to him: \"Is this the Wudu (ablution), O Messenger of Allah?\" He said: \"Yes, if you put them in while they [the feet] were pure.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 62
  },
  {
    "serial_number": "1209765",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 60,
    "volume_number": 1,
    "text": "65 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Al-Harith bin Yaqub, that Yaqub bin Abdullah told him that he heard Busr bin Sa'id saying: I heard Sa'd bin Abi Waqqas saying: I heard Khawlah bint Hakim Al-Sulamiyyah saying: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"Whoever stops at a stopping place then says: 'I seek refuge in the perfect words of Allah from the evil of what He has created,' nothing will harm him until he departs from that stopping place of his.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 63
  },
  {
    "serial_number": "1209766",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 61,
    "volume_number": 1,
    "text": "66 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Al-Harith bin Yaqub, from Yaqub bin Abdullah bin Al-Ashajj, from Al-Qa'qa', that Rumaythah bint Hakim said: I heard Aisha, may Allah be pleased with her, saying: \"I have always prayed eight Rak'ahs, and I would not leave them even if my father were resurrected for me from the grave.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 64
  },
  {
    "serial_number": "1209767",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 62,
    "volume_number": 1,
    "text": "67 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Bukair bin Abdullah Al-Ashajj, from Sulaiman bin Yasar, from Abd Al-Rahman bin Jabir bin Abdullah, from Sawdah, that the Messenger of Allah, may Allah bless him and grant him peace, used to say: \"No one is lashed more than ten lashes except in a Hadd (ordained punishment) from the Hudud of Allah, Mighty and Majestic.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 65
  },
  {
    "serial_number": "1209768",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 63,
    "volume_number": 1,
    "text": "68 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed [us], from Yazid, from Bukair bin Abdullah, from Al-Mundhir bin Al-Mughirah, from Urwah bin Al-Zubair, that Fatimah bint Abi Hubaish told him that she came to the Messenger of Allah, may Allah bless him and grant him peace, and complained to him about the blood [of irregular bleeding]. So the Messenger of Allah, may Allah bless him and grant him peace, said to her: \"That is only a vein. So look, when your menstruation comes, do not pray. And when your menstruation passes, purify yourself and then pray during what is between one menstruation to the next menstruation.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 66
  },
  {
    "serial_number": "1209769",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 64,
    "volume_number": 1,
    "text": "69 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abu Al-Sa'bah, from a man from Hamadan called Abu Aflah, from Ibn Zurayr, that he heard Ali bin Abi Talib, peace be upon him, saying: The Prophet of Allah, may Allah bless him and grant him peace, took silk and placed it in his right hand, and took gold and placed it in his left hand, then said: \"Indeed, these two are forbidden for the males of my nation (Ummah).\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 67
  },
  {
    "serial_number": "1209770",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 65,
    "volume_number": 1,
    "text": "70 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed [us], from Yazid bin Abi Habib, from Salim, from Muawiyah Al-Hamdani, from Abu Hurairah, that he heard him say: I asked the Messenger of Allah, may Allah bless him and grant him peace: \"What did your Lord, Mighty and Majestic, return to you regarding intercession?\" He said: \"By the One in Whose Hand is the soul of Muhammad, I surely thought that you would be the first to ask me about that from my nation, due to what I have seen of your eagerness for knowledge. By the One in Whose Hand is the soul of Muhammad, due to what concerns me of their crowding at the gates of Paradise, they are with me part of the completion of my intercession for them. And my intercession is for whoever testifies that there is no god but Allah, sincerely, his heart confirming his tongue, and his tongue confirming his heart.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 68
  },
  {
    "serial_number": "1209771",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 66,
    "volume_number": 1,
    "text": "71 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed [us], from Yazid bin Abi Habib, from Ruwaifi', that he told him that Abu Mulaikah passed by a man while he was weeping. He said to him: \"What makes you weep?\" He said: \"Why should I not weep when I have neglected the Asr prayer and did not pray it until the sun set?\" Abu Mulaikah said: \"Did you not pray it when you remembered?\" He said: \"Yes.\" He said: \"You have indeed completed your prayer. And even if you did not remember that you had forgotten, indeed the Tasbih (remembrance) is raised for you for what a man forgets of the prescribed prayer in bowing and prostration and is heedless of it, for He makes for him from his Tasbih the completion of what was deficient in his prayer.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 69
  },
  {
    "serial_number": "1209772",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 67,
    "volume_number": 1,
    "text": "72 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Salim bin Abi Salim, from Abdullah bin Umar that he said: \"By Allah, I surely know the year in which they will leave Egypt.\" He [the narrator] said: So I said to him: \"What will drive us out of it, O Abu Muhammad? Is it an enemy?\" He said: \"No, but this Nile of yours will drive you out of it; it will sink [recede] until not a drop remains in it, until there will be sand dunes in it, and the beasts of the earth will eat its sides.\"",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 70
  },
  {
    "serial_number": "1209773",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Hadiths of Yazid bin Abi Habib Al-Masri (died 129 AH) - Narrated by Al-Layth bin Sa'd Al-Masri",
    "edition": "None",
    "publisher": "Dar Al-Hadith - Cairo",
    "page_number": 68,
    "volume_number": 1,
    "text": "73 - Al-Maymun informed us, saying: Ahmad told us, saying: Isa told us, saying: Al-Layth informed us, from Yazid bin Abi Habib, from Abu Al-Khayr, from Sa'id bin Yazid, that he heard him say: A man said to the Messenger of Allah, may Allah bless him and grant him peace: \"Advise me.\" He said: \"I advise you to be shy of Allah as you are shy of a righteous man from your people.\" End of the part of the Hadith of Al-Layth bin Sa'd, from Yazid bin Abi Habib. And praise be to Allah, the Lord of the Worlds, and His blessings follow in succession upon our master Muhammad and his family and his companions, and grant them peace abundantly. Written by Abd Al-Rahim bin Abd Al-Khaliq bin Muhammad bin Abi Hisham Al-Qurashi Al-Shafi'i, may Allah forgive him.",
    "foot_note": "None",
    "book_id": "30310",
    "new_page_number": 71
  }
]