[
  {
    "text": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "category_id": "2",
    "category": "Sects and Refutations",
    "new_page_number": 1
  },
  {
    "text": "sn: 881\nbook_title: كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات\nbook_link: https://shamela.ws/book/133365\nbook_id: 133365\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: Null\nedition: الثانية، 1398 هـ - 1978 م\npages: 109\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع، وهو مقابل]\ncategory: الفرق والردود\ncategory_id: 2",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "category_id": "2",
    "category": "Sects and Refutations",
    "new_page_number": 2
  },
  {
    "serial_number": "287537",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sects and Refutations. Book: Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'. Author: Muhammad Nasir al-Din al-Albani. Edition: Second, 1398 AH - 1978 AD. Number of Pages: 109. Prepared for Shamela by: Muhammad al-Mansour. The book was also compared against its first edition to correct some typographical errors present in the second edition. [The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nBook: Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'. Author: Muhammad Nasir al-Din al-Albani. Edition: Second, 1398 AH - 1978 AD. Number of Pages: 109. Prepared for Shamela by: Muhammad al-Mansour. The book was also compared against its first edition to correct some typographical errors present in the second edition. [The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nAuthor: Muhammad Nasir al-Din al-Albani. Edition: Second, 1398 AH - 1978 AD. Number of Pages: 109. Prepared for Shamela by: Muhammad al-Mansour. The book was also compared against its first edition to correct some typographical errors present in the second edition. [The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nPrepared for Shamela by: Muhammad al-Mansour. The book was also compared against its first edition to correct some typographical errors present in the second edition. [The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nThe book was also compared against its first edition to correct some typographical errors present in the second edition. [The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\n[The book numbering matches the printed version, and it is compared]. Date of publication in Shamela: 2 Rabi' al-Awwal 1440.\nDate of publication in Shamela: 2 Rabi' al-Awwal 1440",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 3
  },
  {
    "serial_number": "287538",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words' by the pen of Muhammad Nasir al-Din al-Albani",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 4
  },
  {
    "serial_number": "287539",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "First Edition 1975 - 1395. Second Edition 1978 - 1398",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 5
  },
  {
    "serial_number": "287540",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction: Verily, all praise is due to Allah, we praise Him, we seek His help, and we ask for His forgiveness. We seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, none can mislead him, and whomever He misguides, none can guide him. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger. He sent him with the truth as a bringer of good tidings and a warner, and as one who invites to Allah by His permission, and as an illuminating lamp. So he conveyed the message and fulfilled the trust. May Allah bless him and grant him abundant peace. As to what follows: Indeed, one of the major calamities in the present era is that a Muslim student of knowledge is compelled to waste much of his time defending himself and refuting the accusations and falsehoods directed at his person, which have been affixed to him by some people who do not fear Allah and are not ashamed before the slaves of Allah, confirming the saying of the Prophet, peace and blessings be upon him: \"Indeed, among what people realized from the words of the first Prophecy is: If you feel no shame,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 6
  },
  {
    "serial_number": "287541",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "then do as you wish.\" And related to this is the saying of the poet: If you do not preserve honor and do not fear a Creator ... And do not feel shame before a created being*, then do as you wish. If you approach a man honoring his rights ... And the right is ignored by you, then severance is more spacious. And since it is known that he who has no shame has no cure, and rebuking him is of no use, it would immediately come to mind that the priority is to turn away from him and leave him to his affairs, as the poet said: If a youth is gifted with an impudent face ... He turns about in matters however he wishes. And there is no use for medicine or anything ... To treat him with, for there is no benefit in it. So you have nothing in rebuking the one who has ... No shame in his face except suffering. However, since silence regarding the likes of him exposes many innocent people to slipping because of him and being influenced by his accusations and falsehoods, it was necessary to reply to him and unveil his fabrications, {so that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence} [Al-Anfal: 42]. And in that, there is another benefit that returns to the slanderer himself, which is: the possibility that he may return to his senses, and the reduction of his burdens of sin, as a result of reducing the number of misled people involved with him, whose burdens he will carry on top of his own private burdens, as Allah the Exalted said: {And they will surely carry their burdens and [other] burdens along with their burdens, and they will surely be questioned on the Day of Resurrection about what they used to invent} [Al-Ankabut: 13]. And in the other verse: {That they may bear",
    "foot_note": "1. * (a created being) was omitted from the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Shamela Library]",
    "book_id": "133365",
    "new_page_number": 7
  },
  {
    "serial_number": "287542",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "their burdens in full on the Day of Resurrection and some of the burdens of those whom they mislead without knowledge. Unquestionably, evil is that which they bear} [An-Nahl: 25]. Perhaps in this there is a reminder and persuasion for those who are not pleased by such replies at all, and who wish that such efforts were directed towards purely academic areas devoid of debate and give-and-take. Most of them do not possess the scientific spirit that helps in discerning the truth regarding what people differ over, and then adhering to it and inviting to it. And although we are with those people in what they wish for, they must remember that often the winds blow with what the ship's crew does not desire, as the poet said: Not everything a man wishes for does he attain ... The winds blow with what the ships do not desire. Also, it is not from the attributes of the believers to remain silent over oppression, injustice, slander, and lies affixed to them, while they find a legitimate means to repel it and return it to its owner, contrary to what is attributed to our Master Jesus, peace be upon him, which the Christians call the Golden Verse: \"Whoever strikes you on your right cheek, turn to him the left cheek, and whoever asks you for your garment, give him your cloak, and whoever asks you to walk with him a mile, walk with him two miles\"! There is nothing of this in Islam; rather, in its absolute sense, it contradicts the Holy Quran in clarifying some of the attributes of the believing servants of the Most Merciful, among which is what the noble verse conveyed: {And those who, when tyranny strikes them, they defend themselves * And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation - his reward is [due] from Allah. Indeed, He does not like",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 8
  },
  {
    "serial_number": "287543",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "the wrongdoers * And whoever avenges himself after having been wronged - those have not upon them any cause [for blame] * The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment} [Ash-Shura: 39-42]. So if there is nothing in all that has preceded that convinces those people, then at least let it be considered an excuse for me, for it has been said: Haste in blame is not justice. And the poet said: Take your time and do not hasten to blame your companion ... Perhaps he has an excuse while you are blaming. Indeed, it was incumbent upon them to turn upon the unjust oppressor with blame and disapproval and deter him from his injustice, and to support the oppressed, due to his saying, upon him be peace and blessings: \"Help your brother, whether he is an oppressor or is oppressed. It was said:* How do I help him if he is an oppressor? He said: You prevent him from oppression, for that is helping him.\" And in another Hadith: \"Let a man help his brother, whether he is an oppressor or is oppressed: if he is an oppressor, let him forbid him, for that is a help to him, and if he is oppressed, let him help him.\" And his saying: \"No man forsakes a Muslim man in a place where his honor is disparaged and his sanctity is violated, except that Allah the Exalted will forsake him in a place where he loves His support. And no one supports a Muslim in a place where his honor is disparaged and his sanctity is violated, except that Allah will support him in a place where he loves His support\" (1). In any case, it is known that pleasing people is an unattainable goal, as stated in some proverbs: No stick struck another stick but that a group was saddened by it, and others were pleased",
    "foot_note": "1. * (It was said) was omitted from the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Shamela Library] \n1. Sahih Al-Jami' Al-Saghir (5566).",
    "book_id": "133365",
    "new_page_number": 9
  },
  {
    "serial_number": "287544",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "by it. And the poet said: And I am not safe from the saying of a slanderer ... Even if I were in a cave on a rugged mountain. And who is the one who escapes from people unharmed ... Even if he was absent from them between the wings of an eagle. And if the matter is so, then it suffices me that I will adhere in this reply of mine to the limits of the Sharia, so I will not meet the aggressor with any aggression, nor the slanderer with any slander. Rather, I will describe him with what is in him so that people may beware of him so they do not go astray by his misguidance, nor deviate by his deviation from the Book of Allah and the Sunnah of His Prophet, peace and blessings be upon him, especially those among them who have recently come into contact with him and have been deceived by his appearance and have no knowledge of the reality of his affair, as the poet said: Let not a friend ever deceive you ... By appearance, until you test him. How many a friend concerning whom I was blind ... His appearance deceived me for a time. He would meet me with a cheerful face ... And words like pearls he spreads. But when I searched him for his unseen [reality] ... I did not find that to correspond to what he conceals. So leave brothers alone, except every one who ... Conceals affection just as he reveals it. So if you win one who combines this ... Then make him a treasure for yourself to store.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 10
  },
  {
    "serial_number": "287545",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "And scholars have long said: Criticism is not backbiting in six [cases] ... An oppressed person, an identifier, a warner. And one who openly commits immorality, and one seeking a fatwa, and one who ... Seeks help in removing an evil. And a single trait of these traits is sufficient to permit such a reply, so how about when others are joined to it, especially the first of them? And its proof is the saying of Allah the Blessed and Exalted: {Allah does not like the public mention of evil in words except by one who has been wronged. And ever is Allah Hearing and Knowing} [An-Nisa: 148]. And his saying, peace and blessings be upon him: \"The procrastination of the wealthy makes his honor and punishment permissible\" (1). And the poet said: And placing dew in the place of the sword is by height ... Harmful, like placing the sword in the place of dew. I ask Allah the Blessed and Exalted to protect us from injustice and belittling people without right, and to make what I write a defense of the Sunnah of the Prophet, peace and blessings be upon him, and the path of the Salaf as-Salih (Pious Predecessors). Indeed, He is Hearing and Responsive. Muhammad Nasir al-Din al-Albani",
    "foot_note": "1. (1) Sahih Al-Jami' Al-Saghir (5363).",
    "book_id": "133365",
    "new_page_number": 11
  },
  {
    "serial_number": "287546",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Preface I became acquainted with Sheikh Abd al-Fattah \"Abu Ghuddah\" in his hometown (Aleppo) approximately more than twenty years ago. I recognized in him a man who was blindly fanatical towards the Hanafi school of thought. In a lesson of his in his mosque in Aleppo, he decided on the permissibility of medical treatment with alcohol upon the guidance of a skilled Muslim doctor. So I said to him: This is not enough; rather, he must be knowledgeable in the Sunnah. For in the Sunnah, for example, alcohol is described as a disease and not a cure. So how is it conceivable for a learned Muslim doctor, knowledgeable of his Sharia, to prescribe a medicine that his Prophet, peace and blessings be upon him, described as a disease?! He said: Perhaps the Hadith is weak and not authentic! I said: How so, when it is in \"Sahih Muslim\" (1). He said: We will check to make sure of that. One of those present, who was a friend to both parties, said to him: So if you make sure of its authenticity, will you take it or the Madhhab (School of Thought)? He said: The Madhhab! And I confirmed later his extreme fanaticism from what reached me of his campaigns in his sermons and lessons against Salafism and its callers. Because of that, some of our brothers in Aleppo strove earnestly to hold meetings between him and me to discuss his fanaticism against the Sunnah and to explain the Call (Da'wah) to him. But he would not respond to any meeting he was invited to, even if individually.",
    "foot_note": "1. (1) Book of Drinks, Prohibition of Treatment with Alcohol (6/ 89 - Istanbul).",
    "book_id": "133365",
    "new_page_number": 12
  },
  {
    "serial_number": "287547",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Unless it was for a meal! But he would not make room for any research regarding the Salafi Call; rather, he would eat and then leave! Yet, he continued with innuendos, hints, and defamation, just like other ignorant, hateful preachers. Then days and years passed, and suddenly Abu Ghuddah was appointed as a teacher in the College of Sharia in Riyadh. In the summer vacation, he used to spend it in Lebanon and frequently visit the house and library of our brother, Mr. Zuhair al-Shawish, his friend at that time. I used to meet him there sometimes, and he persisted in his previous stance of refraining from entering into any discussion or research, despite the mediation of Mr. Zuhair and his pushing him to accept the research, but in vain. It was from the policy of Brother Zuhair and his wisdom at that time with him that he would sometimes present him to lead us in prayer, to show him practically that the rumors he and his likes spread about [our] Takfir (declaring others non-Muslims) were false, evidenced by my praying behind him, even though his prayer contradicted the authentic Sunnah in many of its rulings! He seemed delighted by this presentation, stepping forward without any hesitation, apology, or deferring to anyone else! As if he did not want, in return, to prove to us that he considers his prayer valid behind the one praying behind him!! And while outward appearances indicated that Abu Ghuddah in recent times was a peaceful man to the extent that he fled from entering into a calm scientific discussion, let alone a heated sectarian dispute, content with his fanaticism for \"The Imam of Imams, and the Foremost of the Ummah, Abu Hanifa, may Allah be pleased with him...\" Suddenly, he reveals that \"beneath the sheep's skin is the heart of a wolf\" and that \"nature overcame nurture\"! For he returned to launching a campaign",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 13
  },
  {
    "serial_number": "287548",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "of severe agitation and vilification against me in the Kingdom of Saudi Arabia, the location of his job, and Lebanon, the country of his summer vacation. That is: 1 - What he broadcasted of falsehood and spread of slander here and there until it reached the hearing of some Muslim students in Europe that Al-Albani attacks the four schools of thought, especially the Hanafi school, in his commentary on the book \"Mukhtasar Sahih Muslim by Al-Hafiz Al-Mundhiri\", while it contains nothing but my saying: \"Indeed Jesus, peace be upon him, will rule by our Sharia...\" which will be explained later along with the reply to it. For Abu Ghuddah was not content with spreading that with his tongue, until he wrote it with his pen (1), so he is thereby like one wearing two garments of falsehood: and the printing of the Mukhtasar was in the year 1388. 2 - His fabrication against me, implicitly and explicitly, that I am among the haters and those who detest Imam Abu Hanifa, may Allah have mercy on him. He accused me of fanaticism against him, may Allah have mercy on him, and of scientific treachery in his biography, and that was in his commentary on the book \"Qawa'id fi 'Ulum al-Hadith\" (Rules in the Sciences of Hadith) by Sheikh Al-Thanvi. He finished commenting on it - as he stated in its conclusion - in Rabi' al-Thani in the year 1390 in Riyadh, meaning before he filed his unjust report, or at least one year before my reply to him in the \"Introduction to the Explanation of At-Tahawiyyah\" (2).",
    "foot_note": "1. (1) That is in his \"Words\" p. 39 and its mention is coming soon. \n2. The reader of \"Al-Tawdih\" sees that Mr. Zuhair quoted Abu Ghuddah's words on page (7) and photographed it on page (17), and its text is: \"So Nasir Al-Albani called names in this....\" etc. While what is found in the copies I saw distributed and bound of the book is \"So some of the haters called names in this....\" etc. The reason for this is that Abu Ghuddah distributed a quantity of his book, and a copy arrived =",
    "book_id": "133365",
    "new_page_number": 14
  },
  {
    "serial_number": "287549",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "And the virtuous brother, Mr. Zuhair al-Shawish, replied to him in a treatise: \"Al-Tawdih\" (The Clarification), the best of replies, by revealing his fabrication and the mentioned accusation by quoting from my books what testifies for Abu Hanifa, may Allah have mercy on him, regarding the knowledge and virtue he deserves. He thereby demonstrated that \"Abu Ghuddah\" is the one who betrayed the scientific trust when he quoted my words in a mutilated form. So let whoever wishes for the explanation check his mentioned treatise, which is printed separately and with \"Sharh al-Aqidah al-Tahawiyyah\" (Explanation of the Tahawiyyah Creed), Fourth Edition.",
    "foot_note": "1. = to Brother Mr. Zuhair al-Shawish, from these copies. He wrote \"Al-Tawdih\", quoted, photographed, and published.... And when some of those by whose command Abu Ghuddah moves saw Abu Ghuddah's words, they made him understand that this declaration of accusing Al-Albani exposes you to legal prosecution in the penal courts, and you will be convicted of the crime of slander!! So Abu Ghuddah became afraid and proceeded to remove pages (305), (306), (307), and (308) and what corresponds to them, which are pages (317), (318), (319), and (320), and reprinted them after deleting my name, and put in its place (some haters..) overlooking the footnote that remained printed, which is \"(1) In 'Silsilat Al-Ahadith Al-Da'ifah wal-Mawdu'ah' 5: 76\". And anyone who owns a copy of the book \"Al-Qawa'id\" can verify that if he compares the paper of these pages with the rest of the book's paper, and also if he looks at the many holes in the sewing of the book due to undoing the previous sewing and re-sewing, gathering, and binding it anew!! And what confirms this is Abu Ghuddah's complete silence about raising it in his \"Words\", for if he were able to collect all the previous copies, he would not have delayed accusing the author of \"Al-Tawdih\" with various accusations as is Abu Ghuddah's habit!!",
    "book_id": "133365",
    "new_page_number": 15
  },
  {
    "serial_number": "287550",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "3 - His unjust report that he submitted to some officials in the Kingdom of Saudi Arabia in the year 1391 or slightly before that - and to non-officials as well - regarding my extraction (Takhrij) of \"Sharh al-Aqidah al-Tahawiyyah\". That was after he had seen it about ten years prior, without ever speaking to me at all about anything he had in mind of criticism regarding it, while we were meeting with him during these years at the place of our brother Mr. Zuhair al-Shawish, or at least speaking to him about it!! And he [Zuhair] is the owner of the Islamic Office and the publisher of the book (1). All these matters and others that reached me about him made me certain that we have been tested with a cunning enemy, who shows the opposite of what he conceals, and that a reply to him must be written, revealing his ignorance in what he criticized me for in his \"Unjust Report\" and what he included of lies, falsehood, inversion of facts, and other traits that do not befit a believer who believes in Allah and the Last Day. So I wrote the reply and made it an introduction to the fourth edition of Sharh al-Aqidah al-Tahawiyyah, so that the noble readers would be aware of the reply to Abu Ghuddah's objections closely, and know his severe hostility to this Creed, hiding behind criticizing the one who extracted its Hadiths, and pretending to honor its explainer! After the issuance of this edition in late 1391 AH, I performed Hajj to the House of Allah, so I visited the virtuous professor Dr. Muhammad Amin al-Masri in his house in Makkah Al-Mukarramah. He told me that Sheikh Abu Ghuddah was with him in another room with some professors from Aleppo. So I said to him: Would you be so kind as to present to him my desire to meet him and discuss with him regarding what came in his \"Report\"? He agreed",
    "foot_note": "1. (1) See Abu Ghuddah's full report in \"Al-Tawdih\".",
    "book_id": "133365",
    "new_page_number": 16
  },
  {
    "serial_number": "287551",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "happily, but he soon returned sorry because Abu Ghuddah refused the meeting despite the professors' approval of this offer of mine, as Dr. Al-Masri told me, and he is among the most trustworthy people to me. Starting the reply to the words of \"Abu Ghuddah\" and his falsehoods. And after about three years from printing the reply to the unjust report, Sheikh Abu Ghuddah came out to us with his treatise: \"Words in Unveiling Falsehoods and Fabrications\", mentioning at its end that he finished it on 12/4/1394 in the city of Riyadh. After finishing reading it, it became clear to me that it is a reply to a group of those who replied to him and revealed to people his ignorance of the Sunnah and his severe hostility to its people and its Imams, foremost among them Sheikh al-Islam Ibn Taymiyyah, and his student the scholar Ibn Qayyim al-Jawziyyah, and the caller to Tawhid Sheikh Muhammad bin Abdul Wahhab, may Allah the Exalted have mercy on them, whom Abu Ghuddah opposes with the utmost hostility following his Sheikh Al-Kawthari, the deviant misguider, and of whom he is a relic!! And that there is absolutely no knowledge in it; rather, it is truly lies and falsehoods. Among that is his giving the impression to the readers that there is a group of authors working against him, cooperating and conspiring \"from the owners of bad purposes and deviant plotting intentions...\" according to his claim. This is a pure lie, and to clarify that I say: The books or treatises that Abu Ghuddah replies to some of what came in them and gives the illusion to the readers that the group cooperated to author and publish them are: 1 - The book \"Sufism between Truth and Creation\" by Mr. Muhammad Fahr al-Shaqfa, second edition, increased and verified. It is known that the one who undertook its publication and commenting on it is Mr. Mahmoud Istanbuli.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 17
  },
  {
    "serial_number": "287552",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "2 - \"The Polished* Ingenious Sword against the Falsehoods of Al-Kawthari's Student\" which is by Mr. Abdul Aziz al-Rabian, a teacher at the Secondary Institute at the Islamic University in Madinah Munawwarah, who was at the College of Sharia in Riyadh the day Abu Ghuddah was a teacher there and invited him to debate with him but he refused. 3 - An article published in Al-Da'wah newspaper issue 323. 4 - My introduction to \"Sharh al-Aqidah al-Tahawiyyah\". 5 - \"The Comparison between Guidance and Misguidance\" by the pen of Sheikh Abdul Razzaq Hamza, may Allah have mercy on him, and investigation by Abdullah bin Saleh al-Madani the jurist. 6 - \"Al-Tawdih\" (The Clarification) for the mentioned introduction by Mr. Zuhair al-Shawish, and Abu Ghuddah did not disclose its name, perhaps because the author is Abu Ghuddah's old friend! 7 - \"The Hajj of the Prophet, peace and blessings be upon him\" authored by me. 8 - My commentary on \"Mukhtasar Muslim\" by Al-Mundhiri. 9 - \" The Veil of the Muslim Woman\" authored by me. 10 - \"The Innovation of Sectarian Fanaticism\" by brother Mr. Muhammad Eid Abbasi. So you see Abu Ghuddah, if he replies to a sentence in one of these books, he attributes it to all these authors, even the one written by Sheikh Abdul Razzaq, may Allah have mercy on him, giving the illusion that they wrote that conspiring and cooperating! Even though I absolutely did not participate in authoring any of them, not even in \"Al-Tawdih\", so how about in the book of Sheikh Abdul Razzaq, may Allah have mercy on him?!",
    "foot_note": "1. * In the second edition: (Al-Masqul/Polished), and the correction is from the first edition of the book. [Preparer of the book for Shamela Library]",
    "book_id": "133365",
    "new_page_number": 18
  },
  {
    "serial_number": "287553",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Consequently, no one among them participated with me in authoring any of my mentioned works, and Abu Ghuddah is aware of that. Yet, he attributes every phrase he replies to to all of them. He says in the first book, p. (5): \"They printed it in Damascus in the year 1390 and inserted into it falsely and slanderously words about me...\" The truth is that the one who printed it is Mr. Mahmoud Istanbuli, and the alleged insertion, if proven, has absolutely nothing to do with us, especially since my style of writing differs from his style as is known to everyone...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 19
  },
  {
    "serial_number": "287554",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Forgery on the tongue of Mr. Al-Shaqfa Then Abu Ghuddah said: \"As soon as its author learned of that insertion, his anger raged against them and his wrath at them, and he sent me a letter in his handwriting expressing... and denouncing what they did of forgery against him... regarding what they committed of lies...\" etc. I say: It is easy for every reader to discover this false lying attribution from Abu Ghuddah to the group by referring to the text of Mr. Fahr's letter photographed from his handwriting at the end of \"Abu Ghuddah's Words\" to see in it what belies him. It stated: \"And this matter was an addition by the publisher Mahmoud Mahdi Istanbuli without knowledge from me... for I saw good in him when he offered to bring out my book... so the publisher exploited this authorization... and I have warned the publisher.\" And similar to that is in Mr. Fahr's other letter whose image is published following the first letter. From that, it becomes clear that Abu Ghuddah did not only lie against the group by attributing the alleged insertion to all of them, not to the publisher alone as is explicit in Mr. Fahr's words. But he also lied against the Professor himself in his previous saying: \"As soon as* its author learned",
    "foot_note": "1. * (as) was omitted from the printed original. [Preparer of the book for Shamela Library]",
    "book_id": "133365",
    "new_page_number": 20
  },
  {
    "serial_number": "287555",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "of that insertion, his anger raged against them...\" And I do not think but that Mr. Fahr's anger actually raged against Abu Ghuddah for this false attribution to him! Abu Ghuddah was not content with the preceding lies but confirmed it by saying (p. 6): \"And they yielded to the author's request, and placed on the mentioned book..\" And Allah bears witness that we have no knowledge of the mentioned placement nor of the fabricated yielding except when we read this phrase of Abu Ghuddah, so do we not have the right to say: Is not... And likewise he said regarding what came in the rest of the previously mentioned books: \"they transferred\" and \"they said\" and similar to that which is contrary to reality, and examples of it will be mentioned. For the transferrer and the sayer is the author, so what is the matter with the others, among whom is one who has moved to the mercy of Allah, and this one has no knowledge of what occurred after him of dispute between the people of Sunnah like him and the people of desires and innovations like the student of Al-Kawthari, and the others have no knowledge of what he, may Allah have mercy on him, authored, naturally after the spread of his book as well! How great is Abu Ghuddah's negligence, or rather how great is his lying! Because of all that, I decided to restrict my reply to \"Abu Ghuddah\" to what affected me of his oppression, injustice, and fabrication, leaving it to others to reply to him if they wish, so that this reply does not become too long, for the people of the house know best what is in it, and Allah the Mighty and Majestic says: {Or has he not been informed of what was in the scriptures of Moses * And of Abraham, who fulfilled [his obligations] * That no bearer of burdens will bear the burden of another * And that there is not for man except that [good] for which he strives} [An-Najm: 36-39]. So I say, and with Allah alone I seek help: First - Among Abu Ghuddah's oddities is that when he addressed replying to me regarding what I said about him rightfully in the introduction to Sharh al-Tahawiyyah \"in reply to",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 21
  },
  {
    "serial_number": "287556",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "his unjust report\", he did nothing more than count the words I described him with in it - rightfully - saying (p. 10): \"For they stuffed it with the following words: 'with fanaticism, intentional lying, and... and ignorance and... and imitation... and hypocrisy... and that I am a Hanafi... and dispraising the Hanafi Sheikhs and that they are at a high degree of fanaticism and that they harbor severe hostility towards the people of Hadith...'\" I say: The aspect of oddity is that he recounted these words which I described him with without replying to them with proof and evidence, contenting himself with saying that they are \"explicit fabrication.\" Knowing that these words came within the folds of my reply to him, which amounts to \"44\" pages. So these words that he listed do not amount to a single page of it, so where is the reply to the rest of the pages in which I convicted him of all that? Does any rational, fair person doubt, when seeing Abu Ghuddah not writing a single word in reply to them to prove his innocence from them - that if he found a way to do so, he would not have sufficed with what we pointed out of his sayings? And there is no harm in repeating the summary of what he had held against me and hinted at in his unjust report, and my reply to him and what I convicted him of in the Introduction. Summary of what Abu Ghuddah held against me, my reply to him, and what I convicted him of in the \"Introduction\". 1 - He had accused me that my saying in the extraction (Takhrij) \"Authentic (Sahih), excluded by Muslim\" or \"Authentic, agreed upon\" meant the authenticity came from my judgment of it as authentic and not from the judgment of Imam Muslim or the Two Sheikhs, and that what I said about it \"Narrated by Muslim\" or \"Agreed upon\" without prefacing it with my saying \"Authentic\" meant to him that I was hesitant about it and it was under review! And he said: So he came with something that the predecessors and successors did not precede him in. So I said to him:",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 22
  },
  {
    "serial_number": "287557",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "This is conjecture and fabrication... and I detailed the statement on that in four pages of the Introduction \"17 - 20\" and clarified that I had stated in the introduction to the third edition my goal from this terminology, and that I was preceded in this usage by Al-Hafiz Al-Baghawi in \"Sharh al-Sunnah\". So I proved thereby his conjecture and ignorance. So how did he answer it? Instead of admitting his ignorance and his accusation of his Muslim brother with what is not in him - while he is aware of it - he persisted in that and did not retract. Rather, he resorted to arrogance and feigning humility in his reply that he is innocent and oppressed before the readers, most of whom do not know what his hands committed. Is this the attribute of one who says in the beginning of his treatise: \"And after, indeed Allah the Exalted legislated for us this Hanif religion to be a barrier for the believer in it from every evil and badness, and a caller to perform every good and virtue, and for the one affiliated with it to realize the upright character and straight behavior so he says nothing but the truth...\" etc of his words, the end of which reminds one of the proverb \"She accused me of her illness and slunk away\" because he accuses us in it of lies and fabrications while he is their source and fountainhead, and this is the first example before you. So is this persistence in accusation and feigning ignorance from the upright character according to Abu Ghuddah while he knows His saying, the Exalted: {O you who have believed, why do you say what you do not do? * Great is hatred in the sight of Allah that you say what you do not do} [As-Saf: 2-3]. 2 - He also criticized me for my saying regarding the report of Ibn Mas'ud: \"He perished who does not have a heart with which he knows the known (good) and the unknown (evil)\": \"I do not know it (La a'rifuhu)\". So he said following it exactly: \"So is the meaning of this that he does not know the known from the unknown (!) or he does not know the speech of Abdullah bin Mas'ud\".",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 23
  },
  {
    "serial_number": "287558",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "So I replied to him in five pages (21 - 26) and clarified the terminology of scholars in this phrase \"I do not know it\" from what Abu Ghuddah himself quoted in an introduction of his to some of his publications. So I attributed him because of that to feigning ignorance, and to ignorance as well, and that his mentioned saying has no relation to this terminology which I followed the Muhaddithin (Hadith scholars) in using. And that he only said that to quench the anger of his heart, and show people the ambush of his hatred, and the greatness of his envy through his foul language such that he does not know what comes out of his mouth; we ask Allah for well-being. So Abu Ghuddah did not reply to this either with anything absolute except his claim that I accused him (and he says deceptively to the readers 'they accused me'!) of ignorance and feigning ignorance! If you were, O Abu Ghuddah, truthful in this saying, why didn't you explain the relationship of your saying \"So is the meaning of this that he does not know the known from the unknown\" to my saying: \"I do not know it\" and prove thereby that you are not ignorant nor feigning ignorance, while you are the one saying in your words \"and my behavior is exposed and my character is known, and praise be to Allah\"?! Yes, your behavior is exposed and your character is known, and praise be to Allah who is not praised for a hateful thing other than Him. 3 - and 4 - He had recorded against me two delusions; he declared one of them, and he was correct in that, but he deceived in the course of explaining it a malicious deception with his inversion of some facts as I clarified (p. 29 - 30). So the deception and inversion of facts that I convicted him of stuck to him, because he did not bring even a single word showing his innocence from it, except his saying regarding it and its likes: explicit fabrication!! The other delusion he pointed to, and did not declare, was that I had attributed a delusion to the Explainer (Al-Tahawi), may Allah have mercy on him, in his attributing a Hadith to the \"Sahih\" while it is not in it. So Abu Ghuddah recounted my words on that and added nothing, his purpose in that being to give the illusion to the readers that I am deluded in my attribution of delusion",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 24
  },
  {
    "serial_number": "287559",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "to the Explainer. The reality is that there is no delusion, and he intended behind the mentioned recording to drop the confidence of the readers among the people of knowledge and virtue in Al-Albani's extraction (Takhrij)! To take that as a pretext to turn people away from the book itself \"Sharh al-Aqidah\". So I replied to him in several pages, the summary of which is: That it does not necessitate from the error of a trustworthy person in one Hadith or more that trust be removed from him absolutely. And I supported that with what the unjust fanatic himself quoted in some of his commentaries. And I compelled him to drop trust in the Explainer of the Tahawiyyah due to real errors, not few, which I clarified in my extraction on it then summarized in the \"Introduction\". So I compelled him thereby to one of two things: First, that Al-Albani's error in a Hadith or more does not drop trust in him. And the other: that if that does drop trust in him, then the Explainer's errors are more, so he is more deserving and apparent for dropping trust in him according to Abu Ghuddah. So he remained silent about that as well, so what I compelled him with stuck to him as is apparent, especially since I had requested him to explain to me if I was mistaken in that according to him, but he did not do so. So who says after this that he \"does not play on two ropes\"?! 5 - He had hinted at me regarding my saying about a Hadith narrated by Al-Bukhari: \"And in its chain is weakness, but it has paths by which perhaps it is strengthened...\" So I replied to him from two aspects: The summary of the first of them is that I am preceded in weakening its chain by senior Imams like Al-Dhahabi, Ibn Rajab Al-Hanbali, and Al-Hafiz Al-Asqalani, and that I was reserved in weakening its text; rather, I hoped it would be strengthened by the multitude of its paths. Then I confirmed that as I clarified in \"Al-Sahihah\" (1640). The summary of the other aspect is that I compelled him that hinting at and attacking his Sheikh Al-Kawthari is more appropriate because he quoted the attack on the mentioned Hadith of Al-Bukhari",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 25
  },
  {
    "serial_number": "287560",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "just mentioned and approved it, without holding the reservation I mentioned! Then I followed it by mentioning fourteen authentic Hadiths from what Al-Bukhari and Muslim or one of them extracted, all of which his Sheikh Al-Kawthari \"The Investigator Mark, the Proof, the Imam..\" as his student Abu Ghuddah claims, weakened, and another Hadith from what Muslim narrated which the unjust fanatic himself weakened! (See p. 30 - 34 of the Introduction). And by his silence on the saying of Sheikh Al-Thanvi in his book \"Introduction to I'la al-Sunan\" under the title \"Mention of some defects in the Two Sahihs and the affectation of answering them\": \"And what people say that whoever the Two Sheikhs narrated for has crossed the bridge, this is from affectation and is not strong.\" Abu Ghuddah remained silent on this in his commentary on the book (463). And on the preceding examples of what he himself wrote or read by his Sheikh, yet he attacks me for a single Hadith of Al-Bukhari whose chain I weakened without its text, then he ignores all that to say complaining in his \"Words\" that we accused him of \"...and playing on two ropes\" and he missed mentioning that we said about such an action of his that it is from the chapter of weighing with two scales, and measuring with two measures, or from the type of combining summer and winter on one roof! So who denies the applicability of all these descriptions to Abu Ghuddah after seeing these facts. If the unjust fanatic was truthful in that complaint of his, he would have answered a scientific answer to all these compulsions we compelled him with. And he would not have sufficed with replying to all that by saying: \"Explicit fabrication\" and similar sayings which the most ignorant of people and those most immersed in falsehood and obstinacy are not incapable of, as per their saying: A goat even if it flew. Second - Is this not exposed hypocrisy? I mentioned in the Introduction that I have decisive proof for what I attributed to Abu Ghuddah of equivocation (Mudarah) and I did not say sycophancy (Mudahanah).",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 26
  },
  {
    "serial_number": "287561",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "And so I spoke back then with reservation and deliberation until we see Abu Ghuddah's answer to what I claimed was decisive proof. Then I quoted from him his saying in his unjust report on the Explainer of the Tahawiyyah: \"It is from trusting and... in a tangible famous leadership (Imamah)\". And because of my knowledge that Abu Ghuddah is a fanatical Hanafi, and Hanafis are Maturidis, and the Explainer refutes them in many places, especially in the Attribute of Divine Speech, it appeared to me that Abu Ghuddah says about him what he does not believe for a purpose I explained there. Therefore, I followed his mentioned saying with my saying: \"I said: If Abu Ghuddah truly believes in this tangible famous leadership, then I choose for him from the speech of this Imam seven issues. If he answers them with what agrees with what this famous Imam went to with a sincere heart, then that is what we hope for, and I apologize to him for thinking ill of him. But if it is the other, then that supports - unfortunately - what I accused him of regarding equivocation.\" Then I listed the seven issues with some commentary on them and clarification of his Sheikh Al-Kawthari's stance against them, which are: First: And the people of blameworthy theological rhetoric (Kalam) apply the negation of the occurrence of incidents [in Allah's essence]. Second: And that the Quran is the Speech of Allah, from Him it appeared without modality as speech, and He sent it down upon His Messenger as revelation, and the believers believed Him on that truly, and they became certain that the Speech of Allah the Exalted is in reality not created like the speech of creation. (1) Third: And He, the Exalted, is independent of the Throne and what is below it, encompassing everything and is above it.",
    "foot_note": "1. (1) In the \"Introduction to the Explanation\", it occurred as: \"speech of humans\", which is a typographical error.",
    "book_id": "133365",
    "new_page_number": 27
  },
  {
    "serial_number": "287562",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Fourth: The Imam affirms asking about 'Aboveness' with the phrase 'Where is Allah' which the Messenger of Allah, peace and blessings be upon him, asked the slave girl to know her faith. And I said to him there: And your Sheikh, O Abu Ghuddah, denies such a question following his casting doubt on the authenticity of the Hadith as preceded (p. 22). So do you believe in this Hadith and permit this question which the Messenger, peace and blessings be upon him, asked? Fifth: The Imam says following the three Imams and others: Faith is affirmation with the heart, and acknowledgment with the tongue, and action with the pillars (limbs), and they said: It increases and decreases. Sixth: The Imam went to the permissibility of exception in Faith, which is the believer saying: 'I am a believer, Insha'Allah (if Allah wills)' contrary to the Hanafis. Rather, a group of them went to declaring the one who says that a disbeliever. Seventh: The Imam went, following his Imam Abu Hanifa and his two companions, to the dislike (Karahah) of Tawassul (seeking means) by the right of the Prophets and their status. Then I said following it: \"I said: So these are seven important issues, all in Creed except the last of them, which I directed to Abu Ghuddah who pretended to praise the Explainer of the Tahawiyyah and described him as having 'tangible famous leadership'. So if he answers by following him in them - and this is what I consider unlikely given his Kawtharism - then praise be to Allah. But if he opposes him in them and remains on his Kawtharism, then it has become clear to people - if Allah the Exalted wills - that his praise of the Explainer of the Tahawiyyah (the Imam) was not out of belief and trust in him as he claimed, but rather to use it as a ladder to attack the one who extracted its Hadiths. Otherwise, how was it permissible for him to remain silent about the Explainer regarding these errors, rather deviations,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 28
  },
  {
    "serial_number": "287563",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "the seven [deviations] according to his claim following Al-Kawthari, and regarding his other Hadith errors which I previously indicated types of, and criticize me complaining to some of his bosses or officials there and others - in matters - which if his criticism in them were correct - are hardly worth mentioning compared to those in quantity or quality?!\" So what was the answer of the unjust fanatic to these seven questions?! The noble reader will be amazed if I said: He turned away from answering them absolutely, and fell silent towards them like the silence of the People of the Cave. He neither declared that he follows the owner of the \"tangible famous leadership\" in them, nor that he is still on his Kawtharism in them. So who says after this that this is not exposed hypocrisy or that he is still a Kawthari as some of his colleagues in studying under Al-Kawthari described him in what I quoted from him (p. 46 of the Introduction). And he admitted that and did not deny it in his \"Words\"; rather, he confirmed it by saying in it (p. 38): \"They know from about 25 years that I am a student of Al-Kawthari, so what is the meaning that I became his student now.\" I say: This is a lie from his lies that have no end. For who among those I referred to and described as having knowledge said that you became his student now? The truth is that you were exposed to people who did not know you before your commentaries which you blackened with quotes from your Sheikh Al-Kawthari and your exaggeration in praising him despite his severe hostility to Hadith and its people. And you pushed us by force by that - and by your vilification of us in your frantic campaigns for the slightest slip you imagine, especially in your unjust report where you put down a person and elevate another - despite their sharing in the error - to reply to you and unveil your identity and explain what you are upon of attributes which you summarized in your (Words) (p. 10) and I was reserved regarding",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 29
  },
  {
    "serial_number": "287564",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "some of them due to what the Sharia obligates upon us of verification and confirmation. As for now, the truth has become manifest to everyone with two eyes. And indeed, what confirms his remaining on his Kawtharism, and his preference for imitating him over imitating his Imam Abu Hanifa and his two companions, may Allah have mercy on them, in many issues, is that Al-Kawthari has a treatise titled \"Mahq* al-Taqawwul fi Mas'alat al-Tawassul\" (The Eradication of Fabrication in the Issue of Tawassul) in which he went to its permissibility and took the path of absolute Ijtihad in it. He used as evidence Hadiths, some authentic which do not indicate it, and some weak which he tried to strengthen by strengthening weak narrators following his desire, contradicting thereby his own declaration of his weakness in another Hadith as I explained some of that in the beginning of my book \"Silsilat Al-Ahadith Al-Da'ifah\". And out of his following his desire and following the common people, he did not address in it the mention of the sayings of his three Imams because they eradicate his treatise from its foundation (1). So you find Abu Ghuddah imitating him in this issue, despite his contradicting his three Imams in a sermon he delivered in his mosque in Aleppo, and naturally that was before his employment in Saudi Arabia. I have obtained a recorded tape of his sermon, in which is the declaration of some of his ideas and beliefs in which he contradicts the belief of the Salaf as-Salih and those who followed them in goodness like Sheikh al-Islam Ibn Taymiyyah and Muhammad bin Abdul Wahhab and others. Such as his belief that Shirk (polytheism) is only Shirk of Rububiyyah (Lordship), so he permits Tawassul by the Prophet and the Wali (Saint) to Allah without calling upon him and asking from him. And if he asks by mistake, then this caller does not believe regarding him that he looses and binds, gives and withholds, lowers and raises, and disposes in the destinies of Allah the Mighty and Majestic!! Therefore, seeking aid (Istighatha) from the dead other than Allah the Exalted is not Shirk according to him because the seeker of aid does not believe that",
    "foot_note": "1. * In the second edition: (Muhaqqiq/Verifier), and the correction is from the first edition of the book. [Preparer of the book for Shamela Library] \n1. Refer for the reply to it and other treatises of the opposers to our seventh treatise of the treatises of the Salafi Call which is titled \"Tawassul: Its Types and Rulings\".",
    "book_id": "133365",
    "new_page_number": 30
  },
  {
    "serial_number": "287565",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "the dead harms and benefits, but rather it is only a verbal mistake! Yet, Sheikh Abu Ghuddah is not ashamed to declare in his words (p. 36) that he worships Allah the Exalted with the creed of the Salaf, may Allah be pleased with them, and that he holds the division of Tawhid into Tawhid al-Uluhiyyah and Tawhid al-Rububiyyah! And he missed the third division, which is Tawhid of Attributes, and perhaps he left it intentionally. Because the Khalaf (Successors/Later generations), and he is among them, do not know this type of Tawhid, and if they knew it, they would not have negated many of His Attributes, the Exalted, in the name of interpretation (Ta'wil) like their negation of His Uloo (Highness) over His creation. A sermon by Abu Ghuddah attacking the Salafis. And it is necessary on this occasion that I present some of Sheikh Abu Ghuddah's sermon transcribed from a recorded tape preserved with me, and whoever doubts it, I will make him hear it with his voice and his heat in it, so that the extent of his hostility to the people of Tawhid and the callers to the Sunnah, his malice against them, his hatred for them, and his accusing them of various accusations in the manner of his Sheikh Al-Kawthari in that, or rather worse than him, becomes clear to the reader. He is in that unique in his kind! His accusing the Salafis of ignorantizing the Imams and belittling the status of scholars and Ijtihad. He said after a brief introduction on the virtue of the Mujtahid Imams and their adherence to the Sunnah: \"We say this to clarify what comes from some people, of attributing ignorance to the Imams, belittling the status of scholars, and deeming some of their opinions foolish, thinking that they are on correctness, and that if they have smelled the scent of knowledge, then they are on certainty regarding what they know, and that it is in their power to fault the scholars and attribute ignorance to the Imams, and belittle the status of Ijtihad, and make it light to the people, even to the simplest of people,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 31
  },
  {
    "serial_number": "287566",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "even if he was a professional who did not know his craft, or rather, did not master it! He could say: 'This is Halal and this is Haram' solely by his opinion or merely because he memorized a Hadith or two. This is a clear error and deviation from the path. For Ijtihad (independent legal reasoning) in this Ummah is not achieved by its stalwarts nor its intelligent ones unless they acquire the tools of Ijtihad. These tools are the introduction to acquiring Ijtihad (here there is an erasure from the tape of about a line) from the Holy Quran and the Noble Hadith, and among them is the knowledge of the competitions (sic) of the Arabs and their styles, and among them also is understanding the speech of the Messenger of Allah, peace and blessings be upon him, according to the rules of the upright Islam, as the Companions, may Allah be pleased with them, understood it. As for the one who has a bit of knowledge and thinks he can climb the peak of Ijtihad, this is a sleeping human, who saw himself [in a dream] that he is sleeping too (!), and walked striving in his sleep which he saw in his slumber (!). So he is upon weakness and error without knowing his worth. Because Ijtihad requires extreme confidence of understanding, complete knowledge of science, the traces of the jurists and their sayings, the Ijtihad of the Companions of the Prophet, peace and blessings be upon him, and their actions, and the sayings of the Messenger of Allah, peace and blessings be upon him, and the Speech of Allah the Mighty and Majestic, and other means of knowledge that scholars have established in their place. Returning to his accusation of them belittling the status of scholars, casting their Ijtihads to the ground, and of arrogance and ignorance. Therefore, he errs who faults the scholars or belittles their status. Or claims that he can dominate over these Imams and cast their Ijtihads one by one to the ground. The origin of this is arrogance and deficiency in knowledge, and ignorance of the value of scholars as well. And that is that those people were ignorant of many things, so they fell into many errors.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 32
  },
  {
    "serial_number": "287567",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "His accusing them of belittling the status of the Prophet, peace and blessings be upon him, and denying his miracles!! Among these errors is that they belittle (sic) the status of the Prophet, peace and blessings be upon him, making him (sic) one of the people after his death and during his life, not distinguished from any human being. And he is so, except in what Allah the Mighty and Majestic honored him with. And Allah the Mighty and Majestic has honored His Messenger, peace and blessings be upon him, with miracles (Karamat), and what miracles! For the Prophet, peace and blessings be upon him, is alive after his death by which he moved from the world to his grave, for the Prophets are alive in their graves. So the one who claims that the Prophets are dead like the state of dead people: this is a human who does not differentiate between the living and the dead, nor the Prophet and the false prophet. So it is his right [duty] to re-study from A to Z, because the Messenger of Allah, peace and blessings be upon him, indicated to us that the martyrs are alive in their graves (!) and our Master the Messenger of Allah, peace and blessings be upon him, is above the martyrs in rank, honor, station, and veneration. Therefore, belittling the status of the Messenger, peace and blessings be upon him, under the pretext of purifying the doctrine is an error and a deviation. We witness from those people that they do not mention the miracles (Karamat) of the Prophet, peace and blessings be upon him, nor his noble miracles (Mu'jizat), nor his lofty states, to an extent that chests would expand with (!). Rather, they revolve around things from which they feel, or a person feels in them, that it belittles the status of Prophecy and shrinks the shadow of the Prophet, peace and blessings be upon him, and makes him like a human among humans, no less and no more (!). This invites them to get involved in many errors. Therefore, these people err in these allegations which I alluded to, multiple errors. For this reason, a person should not be deceived by these sayings or by such claims that they claim: For our Master the Messenger of Allah, peace and blessings be upon him, commanded us",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 33
  },
  {
    "serial_number": "287568",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "to follow the scholars who have acceptance, knowledge, and complete aptitude. Which qualifies them to be Imams in the religion. And if we look into the biography of Imam Abu Hanifa, or Imam Al-Shafi'i, or Imam Malik, or Imam Ahmad bin Hanbal, may Allah be pleased with them, we find in the biography of each of them a new leadership (Imamah) (!). Meaning, if we looked at his behavior in his house, we found him an Imam. If we looked at his behavior with people, we found him an Imam. If we looked at his worship, we found him an Imam. If we looked at his preservation of knowledge, we found him an Imam. If we looked at his understanding of texts, we found him an Imam. If we looked at his devotion (!) and piety and his exiting from his self (!), we found him an Imam. So every character trait of those Imams is a lamp from the lamps of guidance and rationality. This is the measure of knowledge and the measure of being guided by people. Returning to his accusing the Salafis of reckless disregard for the Mujtahids and belittling their status, and forbidding people from following them while calling them to follow themselves. Therefore, reckless disregard for the Mujtahids and belittling their status, and the claim (sic) of people to perform Ijtihad, or those people prohibiting (!) the following of the Mujtahid Imams contains a great error. Because they forbid people to follow Abu Hanifa, Al-Shafi'i, Ahmad, and Malik, may Allah be pleased with them, and invite them to follow themselves (!). So they forbid them to imitate the Imams, and invite them to imitate themselves (!). As if they forbid this for others, and permit it for themselves. And if we are imitators (Muqallideen), and your speaker is among the imitators, and he who is higher than him in knowledge is among the imitators (sic), if we are so, then do we imitate",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 34
  },
  {
    "serial_number": "287569",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "those whom people testified for, and people tested their knowledge, and people served their Madhhab (school of thought), from thousands of people, the Muslims (!) - not people who do not know the abrogating Hadith from the abrogated, nor do they know the concepts of the Arabic language in reality. For this imitation would be a blameworthy, unlucky imitation, because he who does this moves from day to night, from light to darkness, and from correctness to error. For the Prophet, peace and blessings be upon him, commanded us to take knowledge from scholars who are scholars in their morals, and scholars in their behavior. His hinting that they are exploited and rented for the (Wahhabi) tendency! And that they are pretenders to Ijtihad! And in the freedom of their thought, they are scholars, they are not exploited for a call or tendency, nor are they rented for a group or following. Rather, they are independent. If the Sultan courted them to say a saying that would be in his interest, they would reject the Sultan and his kingdom. They were trusted, and torture befell them while they were happy with that. I mention to you a man, not like Abu Hanifa and Al-Shafi'i but from their followers: Shams al-A'imma al-Sarakhsi, an Imam who was in the ninth century Hijri [Note: Sarakhsi was actually 5th century AH]. In his time there was a Sultan who monopolized rule, so Imam Al-Sarakhsi issued a fatwa against the Sultan, so the Sultan imprisoned him in a well for nearly twenty years. He imprisoned him in the well for nearly twenty years (sic, repeated) or more than that. So he authored while he was imprisoned in the well; his students would come to him there while he was in the well, and he would dictate to them a dictation, as I speak like this, without looking at a paper, or reading from a book, or holding a pen or ruler (!). Rather it was an overflow of knowledge Allah granted to that human. He dictated to them thirty-six volumes, rising from the ground the height of a full meter. He dictated them from his chest (memory). And this human, despite the breadth of his knowledge, did not depart from imitating those",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 35
  },
  {
    "serial_number": "287570",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Imams. Not following them out of weakness, but following them out of conviction, because they deserve to be emulated. For the Imams, the Salaf as-Salih (Pious Predecessors), did not care about the Sultan, nor did they care about a call from the calls (here are unintelligible words). Many died persecuted and torture befell them, like Abu Hanifa, may Allah be pleased with him - according to one saying - he died tortured in prison because he denied the Sultan (sic). As for Imam Ahmad bin Hanbal, may Allah be pleased with him, torture befell him in a way unimaginable. He was struck with whips that were not counted, so that he would say a word regarding the matter of the Holy Quran which the Sultan wanted to adopt and call the scholars to say, the Imams among them, like Ahmad bin Hanbal. So Ahmad bin Hanbal, may Allah be pleased with him, met varieties of torture, yet he did not depart from his opinion, nor did he sell his opinion for a few dirhams for a call the Sultan invited him to. So the blame of a blamer did not seize them in [the cause of] Allah. They used to say the saying clearly from their knowledge, conviction, and understanding. If they realized their error in this saying, they called out against it the next day or after years, that it was an error. And they returned from it, the return of a person from something not regretted. So this Imam Al-Shafi'i, may Allah be pleased with him, established a long, broad Madhhab (!), then he moved to Iraq [Note: Text says Iraq, historically Egypt], and toured some Islamic lands, and Sunan from the Prophet, peace and blessings be upon him, and Hadiths reached him which had not reached him (!) before. So he changed his entire Ijtihad (!), until it was as if he abrogated his old Madhhab, and established a new Madhhab. And he did not care that people said: Yesterday he was saying such, and today he changes his opinion. And one of the followers of Abu Hanifa, Hasan bin Ziyad, was in a position where people returned to him for Fatwa. So he issued a Fatwa, then it became clear to him that he erred in it. So he sent a crier calling out among the people and saying in the town: That (sic) Hasan bin Ziyad, a human asked him for a Fatwa",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 36
  },
  {
    "serial_number": "287571",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "he does not know who he is? So he gave him a wrong Fatwa of such and such, and the correct [ruling] is such and such. Hasan bin Ziyad has erred. So they used to call out against themselves if they exceeded the Sharia, that they had erred. And Abu Hanifa, the Greatest Imam, may Allah be pleased with him and with all the Imams, has sayings in the Madhhab regarding which it is known that he returned from them. And Imam Ahmad bin Hanbal, may Allah be pleased with him, is the most frequent of people and Imams in returning from his sayings when he moves to new knowledge regarding them. That is because they are sincere to the religion; they do not belong to a group (!) nor do they worship for desire, greed, or fear. Rather, their goal is realizing the guidance of Allah the Mighty and Majestic, and clarifying the Law of Allah the Mighty and Majestic. So these Imams are the place of example for people, their present, their past, and their last, until Allah inherits the earth and whoever is on it, and He is the Best of Inheritors. His opinion on Ijtihad and the Pretenders to Ijtihad (Mutamajhidin), and in what thing Ijtihad should be. It is very joyful that people emerge among the people who have the aptitude for Ijtihad, and the tools of Ijtihad, so they perform Ijtihad among people today and tomorrow in the events and incidents that occur, and confuse scholars in extracting their rulings and clarifying their position regarding Allah's Halal and Haram. So if those people, the pretenders to Ijtihad (!), have a scope in Ijtihad, then they should not strive in faulting what has already been strived in (decided), and people have passed upon it (!). Rather, let them strive in what has occurred for people of rulings and actions for which scholars do not know the extraction of their rulings, and applying them to their place from what Allah permitted or forbade. Therefore, a person should not fall short a double shortcoming, attributing ignorance to the scholar, and speaking out of ignorance as well, for this is a great deficiency.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 37
  },
  {
    "serial_number": "287572",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "His accusing the Salafis of declaring the one who seeks means (Tawassul) by a grave owner a disbeliever, and that he is a polytheist whose blood is lawful! Among the deficiency that these people fall into is that if they find a human touching a grave, or seeking means (Tawassul) by a grave owner, they count him a polytheist (Mushrik), a disbeliever (Kafir), whose blood is lawful, who is not buried in Muslim cemeteries, nor prayed upon, nor inherited from, nor married, nor married from, nor married to. That is because in their belief he is a polytheist. His permitting Tawassul by the dead! This is great injustice and clear ignorance. We do not approve of this person in his seeking means by the grave, or his touching of the stone. Rather, we say to him: He is ignorant, mistaken, in error. But there is a difference between error, ignorance, and deviation, and judging a person with Kufr (disbelief) by which he deserves the shedding of blood and prohibition of being buried in Muslim cemeteries, and that he be buried as a carcass of dogs and killer animals is buried. There is a big difference between this and that. His hinting to people that Shirk is only Shirk of Rububiyyah (Lordship), his interpretation of the intentions of those seeking aid from the dead, and his declaration that Tawassul by the dead to Allah the Exalted is a permissible right! We do not sense from a mistaken person like this one whom we pictured that he believes that this Prophet or this Wali (Saint) loosens and binds, gives and withholds, lowers and raises, and disposes in the destinies of Allah the Mighty and Majestic (!!). Rather, this human believes that this one by whom he seeks means has a rank (sic) with Allah the Mighty and Majestic and a noble place (sic). So he requests from Allah by the dignity of this human upon Him and his precedence with Him, that He answer",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 38
  },
  {
    "serial_number": "287573",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "his supplication. And there is nothing of Haram in that (!). Rather, this man erred so he asked this human, and requested from him a direct request. His right [duty] was to seek means through him to Allah the Mighty and Majestic, and request from Allah, Glory be to Him, independently. For Allah the Mighty and Majestic says: {Call upon Me; I will respond to you} [Ghafir: 60]. And He says, teaching us: {It is You we worship and You we ask for help} [Al-Fatihah: 5]. So there is a difference between the error of the mistaken and the ignorance of the ignorant, and our declaring him a disbeliever and counting him a polytheist, immoral, disbeliever who does not meet with the Ummah of Muhammad, peace and blessings be upon him. There is a big difference between this and that. His hinting that denying seeking aid (Istighatha) from the dead is not certainty but conjecture! And another thing, if we find the ignorant ones whose condition we described erring, then upon us (here are some words we could not understand, and it appears to be a repetition of the previous explanation of the difference between counting him) a disbeliever, fuel for Hell, and clarifying to him that he erred in what you estimate and assume (!). Then, in that case, he can descend from his error to his correctness. But if you come to him threatening, thundering, and foaming, as if he deserved killing, but you pardoned him out of kindness and generosity (!). Regarding this, the poet says: If attaining guidance was through humiliation... I would see guidance as not inclining to guidance (!). His ignorance of the Sharia and Prophetic Hadith and mixing into it what is not of it. For Pharaoh who claimed divinity and said {I am your most high lord} (Speech is not continuous on the tape) in it is exaggeration in praise. So the man urinated, until when he finished his urination, the Prophet, peace and blessings be upon",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 39
  },
  {
    "serial_number": "287574",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "him, said: Bring me a Dhanub of water, meaning a bucket of water. So they brought a bucket of water and he poured the bucket, and purified the place of urine, and the matter ended. So the man returned to the Prophet, peace and blessings be upon him, saying: O Allah have mercy on me and have mercy on Muhammad and do not have mercy on anyone with us. So the Prophet, peace and blessings be upon him, said to him: You have narrowed a vast thing, O brother of the Arabs, generalize, generalize (!). So he said what meant 'Were it not for you, they would have killed me' (!). And the Prophet, peace and blessings be upon him, guided this human who urinated in the holiest spot of the houses of Allah the Mighty and Majestic, he guided him gently. And it came regarding Ka'b bin Ujrah (sic) one of the Companions, that he entered the mosque and greeted while people were in prayer. So he said while they were in prayer: Peace be upon you and the mercy of Allah and His blessings (!). So the Companions of the Prophet, peace and blessings be upon him, began silencing him, like this, meaning clapping for him (!), like this, meaning do not speak. So he feared for himself, what had he done (!), as if he fell into destruction. Then he entered into prayer (!). When he finished his prayer, the Prophet, peace and blessings be upon him, called him. So Ka'b bin Ujrah says: May my father and mother be sacrificed for him, meaning I ransom him with my father and mother, peace and blessings be upon him. By Allah, he did not scold me, nor rebuke me, nor chide me - meaning he was not harsh on me. But he said: Indeed, this prayer of ours, nothing of the speech of people is suitable in it. Meaning he guided him with kindness, softness, and definition, and informed him of his affair. And it came in the Hadith that Khallad bin Rafi', one of the Companions of the Prophet, peace and blessings be upon him - and he had entered Islam - entered the mosque and prayed. And the Messenger, peace and blessings be upon him, was witnessing his prayer. So he prayed, and prayed, but he did not perform the prayer well at all. So he came to the Prophet, peace and blessings be upon him. So the Messenger, peace and blessings be upon him, said: Pray, for you have not prayed. Meaning repeat the prayer. So he went and prayed, and his prayer the second time was like his prayer the first time, incomplete, not perfect. When he returned to the Prophet, peace and blessings be upon him,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 40
  },
  {
    "serial_number": "287575",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "he said to him: Pray, for you have not prayed. Then he returned and prayed a third time, and his third prayer was like his first and second prayer. So he returned to the Prophet, peace and blessings be upon him, and said to him: Pray, for you have not prayed. He said: O Messenger of Allah! I do not know except this. So the Prophet, peace and blessings be upon him, taught him how to raise, how to prostrate, how to stand, and how to sit. And how to recite? So his prayer became like the prayer of the Prophet, peace and blessings be upon him (!). So he did not push him (?) nor chide him. And in this is a lesson for us in a matter people err in. His return to [the claim] that Shirk is only Shirk of Rububiyyah, and his declaration that Tawassul by the dead is correct and permissible! So if a human errs and holds the window of a Wali or a Prophet, peace and blessings be upon him, we say to him: This window, this stone does not harm nor benefit, nor advance nor delay. And this is a servant from the servants of Allah whom Allah the Mighty and Majestic honored with Prophethood, and made for him a rank with Him. Do you believe that he is the one who gives to you and withholds from you?! Everyone you ask in this state says to you: No (!). But I believe there is dignity (karamah) in him that is not present in me - I am a possessor of sins and offenses, disobedience and crimes, and actions from which the face and forehead blacken. So I know from my condition what I do not know from people. So how about this human, the Prophet or the righteous one? Therefore, I seek means (Atawassalu) through him to Allah the Mighty and Majestic. Therefore we say to him: Do not request from this Wali or Prophet. As for your seeking means through him, it is correct (!). And do not make the request from him, but the request is from the Lord of Lords who does not deny His asker nor deny the one begging Him. So he (here are unintelligible words) in fierceness, severity, and harshness. Then to be mistaken in the origin of his method, then people compel him to it.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 41
  },
  {
    "serial_number": "287576",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Repeating his attack on Salafis and accusing them of being agents and that one of them is paid money to say the crooked is straight! This is what the mind of a rational person does not accept. I know and accept that a human is mistaken and calls people to his error! If his error stems from his heart and core, his thought and mind, and he sees that this error is straight (!) by his abstract mind, and calls people to that so they say like his saying, then he is excused because he sees this line as straight in his view, but it is crooked in the view of people. But to be invited to a crooked line, and be bought and sold, and money is given, and spent for him so that he says the crooked is straight. This is what is not followed (!) nor imitated at any time (!) nor walked in its path at all. For error, inasmuch as it is error, occurs from the great Imams and the small people. But for a human to be a caller to error due to a material reason, by which he was bought (!), this is the embodied cubic error that is not forgiven. Therefore, O assembly of people, as the Prophet, peace and blessings be upon him, said: The religion of Allah is between the extremist and the negligent (!). We ask Allah to guide us to the path of truth by the truth, and to make us upon the guidance of Muhammad, peace and blessings be upon him, in word and deed, behavior and action, and to make us among those who say the truth and follow the best of it. And make us among those who enjoin good and forbid evil, believe in Allah, and call to Allah the Mighty and Majestic upon insight and guidance. And Allah speaks the truth and He guides to the path. I say this saying and ask Allah for forgiveness for me and you. Abu Ghuddah's sermon ended to its letters as it came on the recorded tape preserved with me, and I transferred it by pen to its draft, then whitened it (finalized it) with my pen as well with all precision and impartiality. Muhammad Nasir al-Din al-Albani. Damascus 24 Ramadan al-Mubarak year 1394.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 42
  },
  {
    "serial_number": "287577",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Perhaps in this sermon of Abu Ghuddah is the decisive proof that the man pretends to be what is not in him. For example, in it he permits the Tawassul which the owner of the 'Tangible Leadership' denied according to him, following the three Imams as preceded. So when I asked him about it among the seven questions, he did not answer that he agrees - because he knows that if he did, the people of his town would say about him: He became a Sabean and a Wahhabi! And if he declared permissibility in the country of his job as he declared it in his sermon in his town, it would become clear to everyone with two eyes that he... and perhaps he would be dismissed from his job! Third - His insistence on the accusation: Abu Ghuddah still insists on his accusation of the Salafis with what I attributed to him previously in the Introduction (p. 44) from his saying in some of his sermons in Aleppo: \"These Wahhabis, their souls are disgusted or shrink when the name of Muhammad, peace and blessings be upon him, is mentioned.\" It is clear to him that by 'Wahhabis' - while he is preaching in Aleppo - he only means the Salafis in Aleppo and other places than the Saudi lands who disturbed his sleep by their calling people to the Book and the Sunnah, and fighting Shirk and innovation. So Abu Ghuddah stood defaming them and vilifying them with such slander and fabrication, which if it were true in anyone, God forbid, would be apostasy from the religion, and refuge is sought with Allah. Yet, Abu Ghuddah, may Allah treat him as he deserves, persisted on this false accusation, with some cunning and spinning and much malice and ill intent. He quoted in his 'Words' (p. 7) what was previously attributed to him from the source I had quoted from, with an addition of two lines I had turned away from for brevity. Then he quoted them with the mentioned line for Abu Ghuddah himself to reply to, so he was in that like 'the one searching for his death with his hoof'. They are:",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 43
  },
  {
    "serial_number": "287578",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "\"For (Abu Ghuddah) preached once in one of the mosques of Aleppo, and touched upon speaking about the Salafis, naming them (Wahhabis) imitating the common people and the rabble. And among what he said was: Indeed these Wahhabis, their souls are disgusted... (etc what I mentioned) which the most lying of people would not dare to say...\" Abu Ghuddah said: Their words ended (1). Abu Ghuddah himself quoted this to reply to it, so he said directly following it: \"Fall of the slander: And I say whoever's soul is disgusted by the mention of Muhammad, peace and blessings be upon him, is outside the religion (Millah) with certainty. And whoever said this in these days about the people of these Holy Lands, which hundreds of thousands of pilgrims of the Islamic world enter every year, has judged himself with absolute insanity and rejection by everyone who heard him... And there remains no possibility for anyone among people to believe such lies... So glory be to Allah, these people (meaning the Salafis) lie a mad lie and think that people have no minds, nor do they have eyes, nor do they have scales, and that they believe him in whatever they babble and slander! And it is known that the Prayer on the Prophet, peace and blessings be upon him, is a pillar of the pillars of prayer according to the master Hanbalis...\". Convicting Abu Ghuddah of declaring the Salafis disbelievers (Takfir). Indeed, this reply of Abu Ghuddah to that paragraph attributed to him contains important matters: First: His admission of it issuing from him, and we take that, first:",
    "foot_note": "1. (1) And this is from his deception and obfuscation which was previously alerted to in paragraph (Third), for it is only the words of Mr. Al-Istanbuli.",
    "book_id": "133365",
    "new_page_number": 44
  },
  {
    "serial_number": "287579",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "From his lack of initiative to deny that and invalidate its attribution to him as is his habit in such cases, and the reader finds in his \"Words\" numerous examples of that. And secondly from his saying: \"And whoever said this in these days about the people of these Holy Lands...\" For the concept (Mafhum) of his saying \"in these days\" - and the concepts of Sheikhs are considered as the Hanafis say - is that whoever said that before these days is not among those whom Abu Ghuddah judged with absolute insanity. As if Abu Ghuddah wants to say: I have actually said that before I became aware of the truth by my mixing with the Najdis in their lands. As for after that, the falsehood of the disgust attributed to them became clear to me. So if this is what he intends, why did he not have some moral courage with that and declare that he was deceived by the tendentious propaganda that many of his innovator Sheikhs used to broadcast in the lands east and west, like Al-Kawthari and his likes, and before him Zayni Dahlan and his counterparts, until the Islamic lands were filled, specifically Syria, with this false accusation. Is it not obligatory upon him and his likes who knew the truth later, to announce it to all people, not letting the blame of a blamer seize them in [the cause of] Allah? Second: That he declares that attributing that disgust to the people of these Holy Lands is a lie and insanity according to his saying. So we ask him: Who are the people of the Holy Lands he means? If he means the people of the Najdi lands whose capital is Riyadh, then from where in the Sharia does he get that they are holy lands? Especially since the era with his likes is that they attack it and its people, evidenced by the fact that the majority of them still interpret his saying, peace and blessings be upon him, when he said: O Allah bless our Sham, O Allah bless our Yemen. They said: And our Najd, O Messenger of Allah?",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 45
  },
  {
    "serial_number": "287580",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "He said: There are earthquakes and tribulations, and there the horn of Satan emerges. So they interpret their saying: \"And in our Najd\" to be the Najd known today, and interpret his saying, peace and blessings be upon him, there are earthquakes... as being a reference to Sheikh Muhammad bin Abdul Wahhab and his call and followers! Although it came in a narration that they said: \"And in our Iraq\", so it explains the first narration, and upon that the commentators of Hadith like Al-Khattabi and Al-Asqalani and others proceeded. Yet, many Sheikhs in our country and others still obstinately uphold and carry the Hadith contrary to what the other narration conveyed, all of that to attack the Najdis and their pure call to Tawhid and fighting polytheism and idolatry! Rather, to attack everyone who called with this blessed call even if he was from other than those \"Holy Lands\"! Like the Salafis in Syria for example!! And if he means by his saying \"people of the Holy Lands\" the people of Mecca and Medina who are the general population and did not respond to the call of Muhammad bin Abdul Wahhab, and remained on their belief in polytheistic and idolatrous practices and grave worship, then Sheikh Abu Ghuddah would have deceived the readers especially and the Najdis generally with another malicious deception. That is because the people of Mecca and Medina, their lands are indeed holy, and it absolutely does not come to the minds of any of the readers other than that. And what supports it is his saying describing it \"which hundreds of thousands of pilgrims of the Islamic world enter every year\". In that case, they are not the ones he meant by his saying when he was in his old misguidance: \"Indeed these Wahhabis, their souls are disgusted or shrink when they hear the mention of (the Prophet, peace and blessings be upon him, because there is no one who accuses the inhabitants of these holy lands actually of Wahhabism so that Abu Ghuddah clears them of this accusation. Rather, those accused of it are the Najdis ruling in it. So why did Abu Ghuddah turn away from declaring the clearance of these Najdis",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 46
  },
  {
    "serial_number": "287581",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "from this accusation which he used to affix to them while he was in Aleppo before he became one of the inhabitants of those \"Holy Lands\"?! The answer is that such a declaration, if he revealed it, two matters would bind him, one of which is inevitable: 1 - Convicting him of lying and fabricating against innocent people, and Allah the Mighty and Majestic says: {And whoever earns a fault or a sin and then blames it on an innocent [person] has taken upon himself a slander and manifest sin} [An-Nisa: 112]. So how about if he throws it at a group, or rather an entire people, and when he inhabited their land he began to praise them and curry favor with them by commending them in his \"Words\" (p. 13 and 14)! 2 - His dismissal from his job, for the sake of retaining which he shows people that he is a Salafi professing the Tawhid called to by Ibn Taymiyyah and Ibn Abdul Wahhab!! Third: * Suppose that Abu Ghuddah meant by his previous saying to clear the Najdis themselves from his accusing them previously, and that he did not mean by the Holy Lands their Najdi lands, but rather meant the two Noble Sanctuaries indeed, and attributed it to them on the basis that they are the rulers over them. Then in that case, it is an evasion and a malicious plot from him. Because the accusation attributed to him is not regarding the rulers of these Holy Lands directly, but rather it is regarding the group of Tawhid living in Aleppo and other Syrian lands, who are known there as \"Salafis\". These are the ones regarding whom it was claimed against Abu Ghuddah that he accused them of that false accusation. So if we see him fleeing from clearing them of it, to clearing those against whom accusing them of it was not claimed - even if he and others of the innovators include them in their accusation of those charges along with the Salafis and others of the people of Tawhid - then this means two things:",
    "foot_note": "1. * The numbering was disrupted here in the second edition, and the correction is from the first edition of the book. [Preparer of the book for Shamela Library]",
    "book_id": "133365",
    "new_page_number": 47
  },
  {
    "serial_number": "287582",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "First: That he clears the Najdis of that accusation, even if the speech has no relation to them, so that they be pleased with him and not think ill of him. As for others besides these, from the Salafis and others of the people of Tawhid whom Abu Ghuddah slanders with what preceded, continuing to think ill of him, that is something that does not concern him now. Because the measure for him is not the pleasure of Allah and distance from His wrath, but rather maintaining the job that generates for him money and material gains. Otherwise, tell me by your Lord, why did he turn away from answering what Abu Ghuddah was accused of regarding his accusing the Syrian Salafis? He did not determine his stance towards accusing them with what preceded, neither negatively nor positively. For example, he did not say: Yes, they are as we said previously \"their souls are disgusted or shrink when they hear the mention of the Prophet, peace and blessings be upon him\". Nor did he say as we hoped he would say: \"Glory to You, this is a great slander\" and I did not say anything of what the commentator on the book \"Sufism\" attributed to me. But to evade, and turn away from saying anything about the Salafis while they are the ones he accused of that lie directly, and turn the speech to the Najdis who have no mention at all in the accusation attributed to him and which he quoted in his \"Words\", rather it is against the Salafis in Aleppo specifically. How worthy he is of the proverb that says: \"Is it evasion, O Fox, when you are caught in the ropes\". In summary, at the time Abu Ghuddah wants to prove that the accusation attributed to him is only a fabrication against him, he suddenly convicts himself by himself, and verifies the accusation in his person, confirming the saying of the Exalted: {but the evil plot encompasses only its own people} [Fatir: 43] and realizing the proverb saying: \"He fled from death and into death he fell\" and \"Baraqish brought it upon herself\". And the Messenger of Allah, peace and blessings be upon him, spoke the truth when saying: \"Whoever says about a believer what is not in him, Allah will lodge him in Radghat",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 48
  },
  {
    "serial_number": "287583",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "al-Khabal, until he comes out of what he said, and he is not coming out.\" It is an authentic Hadith extracted in \"Al-Sahihah\" (438) and \"Irwa al-Ghalil\" (2376). And Radghat al-Khabal is, as in another Hadith, the sweat of the people of Hell or the juice of the people of Hell. We seek refuge in Allah from it, from its causes, and those who take to it! And if Abu Ghuddah has declared in his saying quoted previously from him: \"Whoever's soul is disgusted by the mention of Muhammad, peace and blessings be upon him, is outside the religion (Millah) with certainty\" - and this in itself is true without doubt - and he was still accusing the Salafis of the mentioned disgust as preceded in explanation and his conviction of it, then it results from these two premises that the Salafis according to him are disbelievers (Kuffar) outside the religion of Islam with certainty. Some readers may insist on clearing Abu Ghuddah of accusing the Salafis of the mentioned disgust despite Abu Ghuddah's lack of denying it if he found a way to do so - due to the obscenity of the accusation, its atrocity, and the evil result of Takfir from it. But what do the readers say about his other accusation of them which is: \"That they belittle (sic) the status of the Prophet, peace and blessings be upon him\". This accusation is recorded on a tape preserved with me as preceded, and we are ready to let whoever doubts that hear Abu Ghuddah's voice saying that verbatim with his grammatical error indicated (!). And it is no less than the previous one in obscenity and atrocity. And such accusations which Abu Ghuddah throws among people recklessly are \"a habit we know from Akhzam\", which he is not unique in - unfortunately - but rather it is a known Sunnah (way) for all enemies of the Sunnah and Hadith without any fear or sense of responsibility in every time and place, that they accuse them of what they are innocent of. And if the noble readers know that the Master of Humanity, upon him be peace and blessings,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 49
  },
  {
    "serial_number": "287584",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "was accused by his enemies of being a poet, a sorcerer, a madman, is it not more appropriate that the enemies of the Sunnah accuse the people of the Sunnah of what they are innocent of? And if it is difficult for them to believe these false accusations issuing from Abu Ghuddah on the pretext that it is not written in any of his books, let them know that the proof is established by other than books as well, even according to Abu Ghuddah himself. For he said in his \"Words\" (p. 21): \"However, I challenge any human to prove that I said anything of this which they claimed falsely and slanderously - in my books and lessons - or in what I classified or authored.\" As for the first accusation - the accusation of disgust - his admission of it and his lack of initiative to deny it as preceded is sufficient to prove it issued from him. Even if we assume he rectified the matter after we compelled him with his declaring Salafis disbelievers, and as per the common proverb \"In the summer you wasted the milk\", at that point names of upright eyewitnesses who testify against him regarding that emerge. Therefore, it is better for him to confess that his declaration of that was a slip by which Satan misled him, so he repents from it, and perhaps he will do so. If he does not do so, then it is arrogance itself about which the Messenger of Allah, peace and blessings be upon him, said: \"He will not enter Paradise who has in his heart a mustard seed's weight of arrogance.\" Then he explained it by saying: \"Arrogance is rejecting the truth (meaning rejecting it after its appearance) and belittling people\" meaning attacking them without right, exactly as Abu Ghuddah did, may Allah guide him. As for the other accusation, his voice saying it is recorded with us as we mentioned, so in that is the greatest proof of it and conviction of him with it. Then why do we go far? Here is a doctor from the doctors and teachers in a college of the Sharia colleges saying in a book of his that is printed",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 50
  },
  {
    "serial_number": "287585",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "its text verbatim: \"A people went astray (meaning the Salafis) whose hearts did not feel the love of the Messenger of Allah, peace and blessings be upon him, and went about denouncing Tawassul by his person, peace and blessings be upon him, after his death\" (1). This is like the previous two accusations in atrocity because its meaning is also that they are disbelievers according to him. And this stupid ignorant one does not feel that senior figures whom he and his likes of the fanatical imitators obligate people to imitate, foremost among them Imam Abu Hanifa, may Allah have mercy on him, have preceded us in denouncing the mentioned Tawassul. So do you think he and others are astray, O stupid one, or do you not know what comes out of your mouth?! And after, is Abu Ghuddah's saying (p. 19) truthful: \"For declaring people disbelievers (Takfir), let alone scholars, is not of my nature nor my character, and praise be to Allah. For Allah the Exalted has preserved me with what He honored me with of intellect (!) and what He disciplined me with of the discipline of Islam from falling into these Expiators (Mukaffirat) and destructive sins. For whoever calls a believer a disbeliever has disbelieved\"? And I say: The Messenger of Allah, peace and blessings be upon him, spoke the truth: Whoever calls a Muslim a disbeliever has disbelieved. And if Abu Ghuddah says: The Salafis, their souls are disgusted when they hear the mention of the Prophet, peace and blessings be upon him, then he says: Indeed whoever's soul is disgusted by the mention of Muhammad, peace and blessings be upon him, is outside the religion (Millah) with certainty.\" And directly after this he clears from this disgust which expels one from the religion (the people of the Holy Lands whom",
    "foot_note": "1. (1) See the book \"Fiqh al-Seerah\" (p. 354 - Third Edition) by Dr. Muhammad Sa'id Ramadan Al-Buti.",
    "book_id": "133365",
    "new_page_number": 51
  },
  {
    "serial_number": "287586",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "hundreds of thousands of pilgrims enter every year...) and does not specify the Salafis upon whom he directly poured his accusation with clearance. Does that not mean that Salafis according to him are outside the religion with certainty? So where is that nature and character he boasted about?! And here I remind him of his saying, peace and blessings be upon him: \"Any Muslim man who calls a Muslim man a disbeliever, if he was a disbeliever [it is so], otherwise he [the accuser] is the disbeliever.\" Perhaps he will be ashamed to claim what is not in him, and perhaps he will be deterred and refrain from declaring monotheist Muslims disbelievers, and repent to Allah from what issued from him, a sincere repentance, in which there is no equivocation or arrogance. Fourth - Among his lies that have no end: Abu Ghuddah mentioned (p. 10 - 11) what we had described him with rightfully in the \"Introduction\" of attributes he was clothed in in his unjust report, pretending that he is innocent of all that without trying to establish even a semblance of proof for that. A matter which makes every fair person divested of desire and purpose convict him of all that when he sees us having established proof for everything we described him with in the Introduction, and sees Abu Ghuddah repudiating that in his \"Words\" merely by saying: \"This is explicit fabrication.\" Indeed, the greatest criminal on the face of the earth is not incapable of clearing himself with such a cheap saying \"explicit fabrication.\" As for the truly innocent noble man, he is the one who refutes argument with argument and proof with proof. This is what Abu Ghuddah did not do and will not do, because he knows that if he did, he would be like the one searching for his death with his hoof. And this haste does not accommodate repeating the proofs we mentioned in the \"Introduction\" for what we described him with, especially since in his \"Words\" are",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 52
  },
  {
    "serial_number": "287587",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "new examples that testify for some of the traits we described him with there, which saves me from repeating here. So let us mention some of these examples so the reader knows that Abu Ghuddah is far beyond that! New examples of that. First: He said (p. 10) mentioning the Introduction to the explanation of \"Al-Aqidah Al-Tahawiyyah\": \"And it was stuffed with what conflicts with the loftiness of the Sublime Creed, of obscenity, defamation, stabbing, and Takfir (declaring others disbelievers).\" I say: As for his saying \"and Takfir\", it is from his lies that indicate the hidden [evil] of his soul, to prove thereby to the readers the false myth which he and his likes of the superstitious spread that Salafis declare Muslims disbelievers. So we challenge him to prove the place where I accused him of the alleged Takfir from the \"Introduction\", and it is in numbered pages. If he does not do so - and he will not do so - then it has become clear to people that he is a sinful liar. And if he insists, we will do Mubahalah (invoking Allah's curse on the liar) with him if he wishes {Then whoever argues with you about it after [this] knowledge has come to you - say, \"Come, let us call our sons and your sons, our women and your women, ourselves and yourselves, then supplicate earnestly [together] and invoke the curse of Allah upon the liars\"} [Al Imran: 61]. As for stabbing [criticism], there is no harm on us from it, because it is with right and is legitimate as I established in the Introduction (p. 43). As for defamation (Qadhf), if he means by it insulting, then it is like stabbing and you have known its answer. He is only multiplying words for agitation. And if he means by it Qadhf of adultery, then it is a falsehood like the previous one. And similar to it is his saying: \"obscenity\" (Iqdha'). In Al-Qamus: \"He was obscene with him (Qadha'ahu) like prevented him; he threw foulness and bad speech at him, like Aqdha'ahu\"! Second: He said (p. 10 - 11): \"And he described me times after times as being a Hanafi, driven in the context of taunting and insult, as they view affiliation to Imam Abu Hanifa or others of the followed glorious Imams as an insult and a deficiency.\"",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 53
  },
  {
    "serial_number": "287588",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "So I say: Glory be to You [Allah], this is a great slander and a grave lie from such a sinful fabricator. For he knows that we are on the contrary of that, as is printed in many of my works, especially my introduction to my book 'The Prophet's Prayer Described from the Takbir to the Taslim as if You Were Seeing It'. It is fifty-nine pages long. It has been printed several times over many years, and Abu Ghuddah is certainly aware of it. But the Messenger of Allah (peace and blessings of Allah be upon him) spoke the truth: 'If you feel no shame, then do as you wish.' There is no harm in quoting from it what suits the context. I said therein (p. 26), after offering an excuse for Abu Hanifa, may Allah the Exalted have mercy on him, regarding his contradiction of some authentic Hadiths, while noting his command to his followers to act upon what is authentic according to them in many texts established from him: 'I said: If this is Abu Hanifa's excuse for what occurred from him of contradicting authentic Hadiths unintentionally—which is an excuse acceptable absolutely because Allah the Exalted does not burden a soul beyond its capacity—then it is not permissible to attack him because of it, as some ignorant people might do. Rather, it is obligatory to be polite with him because he is one of the Imams of the Muslims through whom this religion was preserved and its branches reached us. He is rewarded in any case, whether he was correct or mistaken. Likewise, it is not permissible for those who revere him to remain clinging to his statements that contradict the authentic Hadiths, for they are not [truly] from his Madhhab (school of thought), as you have seen his texts regarding that. So, these [ignorant attackers] are in one valley, and those [blind followers] are in another, and the truth is between these and those. {Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful}.' This is a part of what I mentioned there regarding praising the followed Imams and defending some of them, and what ought to be the conduct of...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 54
  },
  {
    "serial_number": "287589",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "...their followers. It contains an explicit approval of affiliation [to a Madhhab] on the condition of prioritizing Hadith over blind imitation (Taqlid). I can summarize that here as follows: Affiliation with one of the Imams as a means to acquire knowledge of the jurisprudence of the Book and the Sunnah, which might be missed by a student of knowledge, is something inevitable religiously and practically; for that without which a duty cannot be fulfilled is itself a duty. The Salaf (predecessors) and the Khalaf (successors) all proceeded upon this, receiving knowledge one from another. However, the Khalaf—except a few of them—contradicted the Salaf when they made the means an end. They made it obligatory upon every Muslim, no matter how high he rose in knowledge and understanding of Allah and His Messenger after the four Imams, to blindly imitate one of them, never inclining away from him to another, as one of them said: 'And it is obligatory to blindly imitate a scholar among them.' The result of this was that each of them became fanatical about his Madhhab, without remembering that following a Madhhab is a means, and that the goal is following the Book and the Sunnah. So the goal became forgotten among them, and they cast the Quran behind their backs, clinging to the Madhhab and making it their religion, and showing fanaticism for it against the authentic Sunnah. Whenever you bring one of them an authentic Hadith, he turns away from it and distances himself. Among the wonders is that some of them justify this by saying: 'We are prisoners of the texts,' meaning the sayings of the scholars despite the contradiction and difference existing between them within a single Madhhab, let alone other Madhhabs. So we said: We are also prisoners, but with a big difference; we are prisoners of the infallible texts of the Book and the Sunnah, which are protected from difference and disturbance {If it had been from [any] other than Allah, they would have found within it much contradiction}. As for you, you are prisoners of texts that are different and disturbed with much contradiction, in which the skilled guide among you in traditional Fiqh is confused in reconciling them or preferring one aspect of...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 55
  },
  {
    "serial_number": "287590",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "...disagreement within them! Here, desire, habit, and pleasing the rabble and the common folk intervene, making them the preponderant factor whether they like it or not. So if Abu Ghuddah means by the 'affiliation' mentioned in his words this absolute affiliation which is a means and not an end—and this is what is apparent from the general nature of his words—then he has fabricated a lie against us, and Allah is his Reckoner. And if it is the affiliation that the overwhelming majority of blind imitators are upon—and this is what I do not think he can openly admit—then we say quite frankly: We view it as a disgrace and a deficiency. We add and say that this is what we received from the Imams who forbade blind imitation and made following the Book and the Sunnah obligatory in numerous texts which I covered in the Introduction referred to previously. Among that is the saying of one of them: 'No one blindly imitates except a fanatic or a fool' (1). And his saying previously: 'He described me time and time again as being a Hanafi, driven in a manner of shaming and insult.' This is of that same genre of fabrication and slander. For we do not shame anyone merely for being affiliated with Abu Hanifa or others among the Imams, may Allah have mercy on them all. Rather, we shame the one who is fanatical about his Madhhab, preferring it over the Book of his Lord and the Sunnah of his Prophet (peace and blessings of Allah be upon him). And Abu Ghuddah is of this type, decidedly severe in his fanaticism for his Madhhab, proud of it. For he praises Allah for...",
    "foot_note": "1. (1) Abu Ghuddah distorted this phrase due to his ignorance or feigned ignorance, saying (p. 38): 'So no one follows (yutabi') in everything except a fanatic or a fool.' This is because he understands that 'Itiba' (following) is 'Taqlid' (blind imitation), evidenced by his saying before that: 'Even though I am a follower (tabi'), a blind imitator (muqallid), and praise be to Allah for His bounty (!), so no one follows in everything except....' This is from his ignorance of what scholars like Ibn Abd al-Barr and others have established regarding the difference between Itiba' and Taqlid, or it is from an intentional opposition to them (and the sweeter of the two is bitter).",
    "book_id": "133365",
    "new_page_number": 56
  },
  {
    "serial_number": "287591",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "...his imitation of it as preceded. So, it is for this fanaticism that we shamed him, and not because he is (Hanafi) as he fabricated against us. If you read the Introduction, you would not find therein what he claimed. Rather, you find therein my description of him as being 'from the fanatics of the Hanafis' (p. 15) and similar phrases on (p. 29, 76), or as 'the fanatic*' (p. 19-22, 27, 30, 31), and sometimes** as 'the unjust fanatic' (p. 19-22 and 27-30-31-34, 35, 37, 56), and once I said of him: 'despite his extreme fanaticism'! So this is what we criticize him for; it is the fanaticism, not the mere being a Hanafi! You have known the difference between them, and upon this are the people of knowledge and fairness (1).\n\nExamples of His Fanaticism\nSome might ask and say: It is true that you did not shame him merely for being a Hanafi, but rather for his fanaticism to his Madhhab and his preferring it over the Book of Allah and the Sunnah of His Prophet, so what is your proof for that? I say: I have deposited in the 'Introduction' some of the proofs I wished, and I did not permit myself to describe him as such until I verified it from him. There is no harm in pointing out some of that.",
    "foot_note": "1. * In the second edition: (The unjust fanatic), which is a repetition; the correction is from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]\n** (and sometimes) fell out of the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]\n1. It is strange that Abu Ghuddah mentioned in the biography of Abu al-Hasanat al-Lucknawi in his introduction to 'Al-Raf' wal-Takmil' (p. 29) from Sheikh Abd al-Hayy al-Hasani al-Nadwi that he said about Imam al-Lucknawi: 'He was upon the Madhhab of Abu Hanifa in branches and principles, but he was not fanatical in the Madhhab. He followed the evidence and abandoned blind imitation if he found an explicit text contrary to the Madhhab in a specific issue.' I say: Abu Ghuddah quoted this but did not benefit from it at all, except in steadfastness upon his fanaticism and hostility toward Hadith and its people!",
    "book_id": "133365",
    "new_page_number": 57
  },
  {
    "serial_number": "287592",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "1 - His following of Al-Thanvi, the author of 'Introduction to I'la al-Sunan' (1), in attacking the 'Sahihain' (Bukhari and Muslim) and the Imams of Hadith, and criticizing them with a general criticism in support of their Hanafi Madhhab which does not accept many of their Hadiths (p. 35 Introduction to Sharh al-Tahawiyyah). He did not reply to this in his 'Words' with even a single word.\n2 - His attack on Imam Al-Bukhari and attributing to him deviation from Abu Hanifa, fanaticism against him, and insinuating against him under the title 'The Reason for Al-Bukhari's Deviation from Abu Hanifa' (p. 380 - Third Edition). Our brother Mr. Zuhair quoted a part of it in 'Al-Tawdih', yet he did not reply to him with even a word.\n3 - His attack on the Hadith scholars, old and new, and his bad opinion of them. Indicative of this is what he quoted from Sheikh Al-Kashmiri the Hanafi in explaining the Hadith scholars' weakening of Imam Muhammad bin al-Hasan al-Shaybani, which is that he was the first to strip Fiqh from Hadith, whereas the style of authorship before that* was to mention reports and Fiqh mixed together; so when he opposed their view, they attacked him for that! I said, commenting on this in 'The Introduction' (p. 39): 'This is what he said! Even though he knows that the criticism according to them is only due to poor memory. Al-Dhahabi said in the biography of Muhammad bin al-Hasan in 'Al-Mizan': \"Al-Nasa'i and others softened him due to his memory.\" The author himself** narrated this from (Al-Thanvi) (p. 344), but he brought another calamity, saying in the commentary on it: \"I say: His strictness is known\"! Meaning Imam Al-Nasa'i!'",
    "foot_note": "1. (1) Abu Ghuddah named it 'Rules in the Sciences of Hadith'.\n* (that) fell out of the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]\n** In the second edition: (from him), and the correction is from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 58
  },
  {
    "serial_number": "287593",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Refer to p. 193 of his 'Rules' to see other examples of attacks on Hadith scholars, and his commentary on 'Al-Takmil' (p. 21, 30, 31, 142, 183, 188), and his biography of Al-Harith al-Muhasibi in the treatise (Al-Mustarshidin) (p. 13 and p. 38-39) of the introduction. Abu Ghuddah did not reply to this even with a word!\n4 - His insistence on the saying that Faith (Iman) does not increase or decrease, out of fanaticism for his Hanafism and Kawtharism, contrary to explicit Verses, authentic Hadiths, and the sayings of the Salaf; and finally, contrary to the commentator of Al-Tahawiyyah whom Abu Ghuddah glorified and described—rightfully—as being 'of verification and precision and a tangible, famous Imamate.' However, it was a word of truth used for a falsehood. Evidence for this is his insistence on not following him on this issue among the seven issues regarding which I asked him about his stance. He did not address them with an answer, fearing his reality would be exposed to those among the people of Tawhid who still think well of him. Even if he went along with them or agreed with the truth, his companions who do not value him except for his Madhhab fanaticism would reject him!! So he preferred silence over answering so as not to get entangled with these or those!! That is also the reason for his silence regarding Imam Ibn al-Qayyim's declaration correcting the view that Faith increases and decreases, and that it is the consensus of the Salaf as narrated by Al-Shafi'i and others; Abu Ghuddah did not comment on it with anything!! (1)\n5 - He did not agree with the statement of Imam Al-Tahawi: 'The Quran is the Speech of Allah the Exalted, originating from Him without modality as a saying; He sent it down to His Messenger as revelation; the believers believed it to be the truth upon that, and they became certain that it is the Speech of Allah the Exalted in reality, not created like the speech of mankind. And that He, the Exalted, has not ceased to be Speaking if He wills, when He wills*, and how He wills, and that He speaks...",
    "foot_note": "1. (1) See 'Al-Manar Al-Munif' by Ibn al-Qayyim, verified by 'Abu Ghuddah' (p. 119).\n* (and when He wills) fell out of the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 59
  },
  {
    "serial_number": "287594",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "...with a voice.' Whoever reads his research on the issue of the creation of the Quran, on which he spoke at length in his commentary on 'Al-Qawa'id' (p. 361-379), it will become clearly evident to him that he is a Jahmi, Ja'di. So how can he agree with the owner of the 'tangible, famous Imamate' on his Salafi creed? Refer to his commentary on Al-Raf' wal-Takmil (p. 188) to see his approval of his Sheikh Al-Kawthari in his attack on the narrators of Hadith for saying that the Quran is the Speech of Allah, uncreated, and that the disagreement between them on one side, and the Hanafis and Mu'tazila on the other, is verbal, 'and on the assumption that it is real, the fault would inevitably be on their side'!!\n6 - Nor [does he agree] that Allah the Exalted is above His Throne as befits His Majesty. How can Abu Ghuddah believe in all that when his Sheikh Al-Kawthari declares that this is anthropomorphism (Tashbih) and corporealism (Tajsim)!! Rather, Abu Ghuddah himself indicated that when he attacked Imam Ibn al-Qayyim, saying in his commentary on 'Al-Ajwibah Al-Fadilah' (p. 130): 'You see him, if he narrates a Hadith that aligns with his known (Mashrab) (!) (meaning Tajsim), he exaggerates in strengthening it...' then he repeated the mention of his (Mashrab) after a line!!\n7 - Nor does he allow a Muslim to ask saying: 'Where is Allah?' as the Messenger of Allah (peace and blessings of Allah be upon him) asked, despite the authenticity of the Hadith in Muslim and others, due to his Sheikh's casting doubt on its authenticity. Otherwise, why did he not answer any of those questions, especially this one, for I said to him explicitly (p. 52): 'Do you believe in this Hadith, and do you permit this question which the Messenger of Allah (peace and blessings of Allah be upon him) asked?'. He did not answer—as is his habit—with even a single letter. So does there remain after that the slightest doubt regarding his fanaticism for his Madhhab and his turning away from the Book of his Lord and the Sunnah of his Prophet (peace and blessings of Allah be upon him)?!",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 60
  },
  {
    "serial_number": "287595",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "And if you wish for more examples of what we know about him which we have not previously mentioned, here is some of what is available:\n8 - His strengthening of the Hadith 'The minimum of menstruation is three and its maximum is ten' in support of his Madhhab and in rejection of Ibn al-Qayyim's statement in 'Al-Manar' that nothing of it is authentic but rather it is all false. He critiqued him in his commentary on it (p. 122), following Ali al-Qari and others, claiming it has multiple paths. They were ignorant or feigned ignorance that these are severely weak and not suitable for strengthening, as I detailed in 'Silsilat Al-Ahadith Al-Da'ifah' (No. 1114).\n9 - His contradiction of the consensus of Hadith scholars on weakening certain Hadiths, including the Hadith 'Wudu is not obligatory on one who sleeps sitting,' out of fanaticism for his Madhhab and imitating Sheikh Ali al-Qari in 'Fath Bab al-'Inayah' (1/67). I have detailed the discussion on the weakness of the Hadith along with a rebuttal to both of them in the previous source (4384) and explained that its paths are severely weak and cannot strengthen each other, along with its contradiction to the generality of his saying (peace and blessings of Allah be upon him): 'Whoever sleeps, let him perform Wudu.'\nThirdly: His saying (p. 11) continuing from his saying 'that I am a Hanafi': 'and he condemns the Hanafi Sheikhs.'\nI say: This absolute statement is a lie, because it implies that the condemnation encompasses all Hanafi Sheikhs, the early ones and the later ones, the fair ones and the fanatics, and it is not so. Rather, my speech concerns the Sheikhs of the unjust fanatic himself. And I do not mean all of them either, but obviously those who shared with him in fanaticism against the Imams of Hadith like Al-Bukhari and Muslim and attacked them. This is the text of my words regarding that (p. 36): 'The extent of the fanaticism of this...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 61
  },
  {
    "serial_number": "287596",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "...Hanafi, following his Hanafi Sheikhs, against the people of Hadith in general and Al-Bukhari and Muslim in particular, is only known by one who tracks their works or their commentaries on others. Some models of this have been mentioned (meaning Al-Kawthari and Al-Kawthari's student). Among the new proofs I came across is that Introduction which was referred to previously, which this unjust fanatic undertook to print recently and comment upon.' This is the context of my words; it is only regarding *some* of the Sheikhs of this fanatic among the Hanafis. So look at how he distorted my saying 'his Hanafi Sheikhs' to 'the Hanafi Sheikhs,' which cannot be understood in the narrow circle implied by the possessive addition of Sheikhs to him, but rather as the absolute generalization he attributed to me. So whose doing is this substitution and distortion of words?!\n\nA List of What We Convicted Abu Ghuddah With Regarding His Ignorance of This Noble Science, His Agitation Against Its Servant, and His Attacking Him With Falsehood, Then He Remained Silent in His 'Falsehoods and Fabrications' About It!\n1 - He denied my saying 'Agreed upon Sahih' because it combines declaring authenticity (Tashih) and attribution to the two Sahihs, and he built upon that what his desire dictated of false accusation, saying in his ignorance: 'He brought something in which neither the ancients nor the moderns preceded him'! So I proved to him that this which he denied is the practice of Al-Hafiz Al-Baghawi and the critic Al-Dhahabi.\n2 - He denied my saying regarding some reports: 'I do not know it.' So I proved to him that it is a known terminology among Hadith scholars, and I brought him numerous evidences from his own words in an introduction of his!",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 62
  },
  {
    "serial_number": "287597",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "3 - He denied my correction of the commentator of Al-Tahawiyyah regarding his attribution to 'Al-Sahih,' and I showed that it is not in 'Al-Sahih' (meaning Bukhari and Muslim), and the unjust fanatic did not prove otherwise.\n4 - He denied my criticism of the chain of the Hadith 'Whoever shows enmity to a Wali of Mine...', so I proved to him that it is a correct scientific criticism preceded by more than one Imam, and that I was cautious in judging its text, stating that its authenticity became clear to me later, whereas his Sheikh Al-Kawthari judged it to be Munkar (denounced), so he [Al-Kawthari] was more deserving of his denial!\n5 - I denied his inclination towards authenticating the Hadith of the return of the sun for Ali, may Allah be pleased with him, in terms of Hadith methodology, imitating his Sheikh Al-Kawthari, and his saying: 'So based on this, the report must be interpreted along with our statement of its authenticity despite it contradicting what is of scientific matters.' I explained that this is a philosophy that opens the door to rejecting authentic Hadiths due to such doubts.\n6 - I also denied his quoting Ibn Taymiyyah immediately after that, stating that he [Ibn Taymiyyah] was certain of the Hadith's fabrication! I convicted him of ignorance in this science, otherwise he would not have been confused between two contradictory rulings, and I mentioned the secret behind his narration of it!\n7 - I proved his bias against me due to a mistake I made in referencing a Hadith which I had alerted to in a retraction printed at the end of the book two years before his mentioned bias, and I established evidence from his own words that such a mistake does not necessitate dropping trust in the one who made the mistake, as he attempts to do.\n8 - I compelled him, based on his mentioned bias—if he were sincere in it—to also drop trust in the commentator of Al-Tahawiyyah for some...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 63
  },
  {
    "serial_number": "287598",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "...mistakes that occurred in 'The Commentary', otherwise he is playing on both ropes.\n9 - I attributed to him a malicious deception (Tadlis) regarding the mentioned retraction and that he inverts facts.\n10 - I listed for him fourteen authentic Hadiths from the two Sahihs or one of them which his Sheikh Al-Kawthari weakened entirely, and I asked him for his opinion on this Sheikh of his: Is he still, in his view, in the position where he describes him as 'The Verificationist Scholar, the Proof, the Imam...' or is he not trusted due to his weakening of these authentic Hadiths?!\n11 - Indeed, I proved to him an authentic Hadith narrated by Muslim which the fanatic himself weakened its text, showing him the difference between his weakening of it and my weakening of the chain of the Hadith mentioned in the previous paragraph number (4).\n12 - I also proved to him the difference between my weakening of the aforementioned chain without the text, and what appeared in the introduction of I'la al-Sunan by Al-Thanvi regarding the attack on the 'Sahihain' and mentioning some defects in them, and the unjust fanatic's approval of him in his commentary on it! It only obligates them that they are the ones attacking the 'Sahihain', not others.\n13 - I criticized the author of the mentioned Introduction and the commentator on it for establishing Hadith principles in which they contradicted the Imams of Hadith, such as: if a Mujtahid uses a Hadith as evidence, it is an authentication of it; and the acceptance of Mursal reports from other than a Companion from the people of the second, third, and fourth centuries. So if a narrator, even in the fourth century or after the six Imams, says: 'The Messenger of Allah (peace and blessings of Allah be upon him) said,' it becomes an authentic Hadith!! I explained to him the danger of such alleged rules which contradict what is agreed upon even by some Hanafis, that the chain of narration (Isnad) is part of the Religion...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 64
  },
  {
    "serial_number": "287599",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "...therefore I suggested to him to append to the new name he gave to the Introduction: 'Rules in the Sciences of Hadith' the phrase: 'According to the Hanafi Madhhab'!\n14 - And I criticized some of his Sheikhs, the author of the Introduction, for saying: 'The statement of the Imams of Hadith: \"This Hadith is not established or is Munkar\" is not accepted unless the criticism is mentioned,' alongside their previous statement implying that the Mujtahid's Hadith is accepted merely by his using it as evidence!!\n15 - And I proved their fanaticism for their Imam by his saying: 'The Sheikhs of our Greatest Imam Abu Hanifa, may Allah be pleased with him, are trustworthy,' while the reality contradicts him as I proved there, by listing the names of some of his Sheikhs, may Allah have mercy on him, among whom is Jabir al-Ju'fi, about whom it is proven that Abu Hanifa himself said: 'I have not seen anyone more of a liar than him'!\n16 - We exposed to him the intensity of his hostility toward the people of Sunnah and Hadith and his attack in a sermon on the pulpit of his mosque against the people of Tawhid known in his city as Salafis specifically, and against the Saudi people of Tawhid and others generally, whom he labels with the nickname 'Wahhabis' and explicitly declares them misguided... etc., and says about them: 'These Wahhabis, their souls feel nausea or disgust when the name of Muhammad (peace and blessings of Allah be upon him) is mentioned.'\n17 - We proved to him that when he quotes in his commentaries from the two Sheikhs, Ibn Taymiyyah and Ibn al-Qayyim, he only does so to pretend that he is among those who love them, while his state of being recites: 'And please them as long as I am in their land.' He adorns the books he prints with quotes from Sheikh al-Islam Ibn Taymiyyah and Ibn al-Qayyim, may Allah the Exalted have mercy on them, and we mentioned our doubt and hesitation regarding the purpose he aims for by that. At the same time, he frequently quotes their bitter enemy, the one named Zahid Al-Kawthari, and exaggerates in glorifying and praising him to the extent that he attributed himself to him, so he is Sheikh Abd al-Fattah Abu Ghuddah Al-Hanafi Al-Kawthari...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 65
  },
  {
    "serial_number": "287600",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "...and not only this, but he named his eldest son: 'Zahid' seeking blessings through him and reviving his memory. We showed him that this is from the chapter of combining light and darkness, truth and falsehood.\n18 - We exposed what Abu Ghuddah and others hold of the severe enmity that Al-Kawthari used to display, nay, proclaim in his books and commentaries towards the people of Hadith in general and Ibn Taymiyyah and Ibn al-Qayyim in particular. He accuses them of anthropomorphism (Tashbih) and corporealism (Tajsim), calls them Hashawites (rabble) and foolish. He calls the book of Tawhid by Imam Ibn Khuzaymah 'The Book of Shirk' and accuses the Imam himself of being an anthropomorphist ignorant of the principles of religion, rigid in Fiqh, and of little understanding, and that they are [merely] carriers of books. He attacked about three hundred trustworthy narrators, including a group of Hafizs, Imams, and Jurists, like Malik, Al-Shafi'i, and Ahmad. He accuses Abdullah, the son of Imam Ahmad and narrator of the 'Musnad', of lying, and therefore he does not see him as fit to be relied upon. He describes Al-Hafiz Al-'Uqayli as 'the loser fanatic.' He says about Sheikh al-Islam Ibn Taymiyyah: 'If Ibn Taymiyyah is still considered Sheikh al-Islam after all this, then farewell to Islam.' Abu Ghuddah is aware of all this, yet he bestows upon him those grand titles 'The Verificationist Scholar, the Proof, the Hadith Scholar, the Jurist, the Usuli, the Theologian, the Theorist, the Historian, the Critic, the Imam'!!! I deduced from this—in addition to our private information about him and his lack of denouncing any of his Sheikh Al-Kawthari's statements in any of his commentaries despite the many opportunities for denunciation—that he is one hundred percent Kawthari in his hostility to the people of Hadith and Sunnah and Sheikh al-Islam Ibn Taymiyyah. It did not escape my mind that there is a possibility he might have repented from his discipleship to him and his adoption of his deviations, so I opened the way for him to retract and we asked...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 66
  },
  {
    "serial_number": "287601",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "...him to declare his dissociation from him in whole and in detail. I said: 'If he does so—and I do not think he will—we will accept his apparent statement and entrust his secret to his Lord, Glory be to Him and the Exalted'!\n19 - Knowing that it is possible he might declare his dissociation from his Sheikh Al-Kawthari with his tongue, I followed that by asking him seven questions containing the creed of the Salaf from the book 'Sharh al-Aqidah al-Tahawiyyah', the commentator of which Abu Ghuddah praised and described with 'tangible Imamate', while Al-Kawthari opposes them in these issues, such as their saying regarding the Quran that it is uncreated, that Allah the Exalted is above all His creations, the permissibility of asking 'Where is Allah', that Faith increases and decreases, and other matters detailed there. I asked him about them to reveal the reality of his belief and for fear that he might deceive people with his tongue, believing in what is narrated from Umar, may Allah be pleased with him, that he said: 'I am not a deceiver, nor can a deceiver deceive me.'\n20 - I convicted him for submitting his unjust report secretly without my knowledge or the knowledge of his friend at the time, the owner of the Islamic Office, despite my meeting him at the said Office time and time again in the years following the printing of the book, without him discussing with me or drawing my attention to any of the subjects he raised in his unjust report. He submitted it years later, when he thought the opportunity had arisen to quench the thirst of his malice and heal the anger of his heart by attacking Al-Albani and harming the publisher of his book, Mr. Zuhair Al-Shawish. Verily, only spies and informants do such things.\nThis is some of what I convicted Sheikh Abu Ghuddah with in 'The Introduction', which amounts to (44) pages from (p. 13 - 57). As for what is before...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 67
  },
  {
    "serial_number": "287602",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "...page (13), it is from the introduction of the publisher Mr. Zuhair Al-Shawish and his biography of Imam Al-Tahawi. So what did Abu Ghuddah do in his 'Falsehoods and Fabrications'? He remained silent towards all this which we branded him with, the silence of a deaf stone. He did not address the answer to absolutely any of it, a matter which indicates to every fair person stripped of desire that 'Abu Ghuddah' in his 'Falsehoods and Fabrications' convicted himself by himself when he remained silent about all of that. He did not answer any question directed at him that would reveal the reality of his affair and his creed. He did not disown, with any argument whatsoever, all that I convicted him of regarding ignorance, falsification, severe enmity to the people of Sunnah and Hadith, and his contradiction of them in creed due to his following of his Sheikh Al-Kawthari, except for his saying: 'Explicit fabrication.' Such a cheap defense is capable by the most wretched and immoral of people if they are convicted of the misguidance they are upon, accompanied by proof and evidence!\n\nHis Answer to Some Questions and an Explanation of the Prevarication It Contains Confirming His Kawtharism and Hostility to Ibn Taymiyyah\nYes, he addressed the answer to what came in the last four paragraphs with some explanation, but in reality, he was like one trying to stab the eye of the sun. Rather, he was therein like one digging his own grave with his hoof, or like one fleeing from death only to fall into it. Here is the clarification:\nFirst: He answered what came in paragraph (16) saying: 'The Fall of the Slander: I say, he whose soul feels nausea at the mention of Muhammad (peace and blessings of Allah be upon him) is out of the fold of Islam with certainty. And whoever says this in these days about the people of these Holy Lands, which hundreds of thousands of pilgrims from the Islamic world enter every year, has judged himself to be stark raving mad...' See (p. 8) of...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 68
  },
  {
    "serial_number": "287603",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "...his 'Falsehoods and Fabrications.'\nSecond: He alluded to some of what appeared in paragraph (17) with some agitation and misleading of the readers as is his habit, saying: 'So they mentioned my name, my lineage, my city, my Madhhab, and the name of my son, but they missed mentioning the rest of the family members...'. I say: The mention of his son's name was only to prove to the readers his misguidance in following his Sheikh Al-Kawthari to the extent of naming his son after him. So his saying: 'but they missed mentioning the rest of the family members...' is cheap agitation and sarcasm that backfires on its owner. He has admitted in more than one place in his 'Words' that he is a Kawthari; so what we attributed to him, he has admitted. This is the intent behind our mentioning his name and his son's name. So from your own mouth, I convict you. As they said of old: 'What is in you appeared on your mouth'!\nThird: My assumption about him was confirmed, unfortunately, for he did not declare his dissociation from his Sheikh Al-Kawthari in whole and in detail. For while he continued to be proud of affiliating with him, he said (p. 37): 'So their claim that I am committed to everything Al-Kawthari says is a false claim.' His answer reminds me of the poet's saying:\nAnd claims, if you do not establish for them ... evidences, their children are illegitimate.\nSo where is the proof for the invalidity of the mentioned claim, given the abundance of errors and deviations we narrated from your Sheikh Al-Kawthari, along with your glorification of him as previously explained, and our request for you to dissociate from them, which you did not do? So the false claim is your claim. You remain convicted of being a Kawthari in whole and in detail until you fulfill our request by declaring your dissociation from him in whole and in detail, so we may rest from you and from discussing you in whole...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 69
  },
  {
    "serial_number": "287604",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "...and in detail, and Allah is your Reckoner. Yes, he brought a proof for his claim, as he alleged, saying (p. 38): 'And the closest proof to repel this fabrication of theirs is that I have filled my books and commentaries with the words of Sheikh al-Islam Ibn Taymiyyah and Imam Ibn al-Qayyim, may Allah the Exalted have mercy on them, just as I praised them... And Sheikh Al-Kawthari, may Allah the Exalted have mercy on him and forgive us and him, used to shun these two Imams according to his opinion and Ijtihad (!). So if I were committed to him in everything he says, I would have shunned them and followed him in his orientation (Mashrab) towards them, may Allah have mercy on them. But reality proves the contrary'!!\nThe answer to this nonsense is from several aspects:\n1 - You made the evidence that you are not committed to everything Al-Kawthari says to be that you do not shun the two Sheikhs as your Sheikh Al-Kawthari used to shun them. This is, by Allah, the farce of the age. For if you pretend now that you do not shun them, does that remove you from what you admitted, that you are still a Kawthari?! In other words, if a Hanafi, for example, disagrees with his Imam on a specific issue, does he thereby exit from being a Hanafi?! The answer is no, as is clear to all rational people. Your master Abu al-Hasanat al-Lucknawi declared this in 'Al-Fawa'id Al-Bahiyyah' (1). Therefore, this proof of yours bears witness against you that you are a Kawthari in everything we described Al-Kawthari with regarding misguidance and deviation from the Salaf and the Imams of Hadith. Had it not been so, you would have declared your dissociation from all that just as you declared your dissociation from his shunning of the two Sheikhs, especially since we opened the way for you to do so by asking you to announce your dissociation from all that. Does a rational person interpret your refusal to announce it as anything other than a decisive proof that you are a Kawthari one hundred...",
    "foot_note": "1. (1) See 'Sifat al-Salat' (p. 39).",
    "book_id": "133365",
    "new_page_number": 70
  },
  {
    "serial_number": "287605",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "...percent? And now we say: one hundred except one, after your admission of dissociating from your Sheikh's shunning of the two Sheikhs, and Allah is your Reckoner! However, by that, you did not ward off the accusation from yourself that you are a Kawthari, because a single disagreement does not absolve you from attribution to him as previously explained. So do you possess the correct creed and scientific boldness to explain to us in detail, especially regarding what we asked you about his accusing the two Sheikhs and Ahl al-Sunnah of anthropomorphism (Tajsim), his deviation from the two Sahihs, his weakening of many of their Hadiths, and other matters we stated in the Introduction and summarized in this paragraph? If you were innocent, you would have done so. Since you did not do so, you are an enemy to the two Sheikhs and the people of Hadith until you declare your dissociation from all of Al-Kawthari's contradictions to them.\n2 - You say that you praised the two Sheikhs, may Allah the Exalted have mercy on them: The answer is that such praise for them—with which you blackened numerous pages of your 'Words' by quoting from your commentaries on some books—does not indicate to the people of knowledge and understanding that you hold a good belief regarding them or that, in your opinion, there is no deviation in their knowledge. This is the point of contention between the Salafis like us and the Khalafis like you. The evidence is that all those words do not contain a single sentence, nay, not even a fragment, from which one can smell your appreciation of them in their creed and that they are not deviant in their knowledge. This is alongside the observation that you published most of those commentaries while you were an employee in the Saudi Kingdom, living among a people who know the virtue of Ibn Taymiyyah and his student and follow their creed. So one could say: That was issued from you for local consumption! And it has indeed been said.\n\nExamples of His Attack on Ibn Taymiyyah and Ibn al-Qayyim\nAnd something else: It is that your praise might fool those who have no knowledge of what issued from you of attacks on their creed and knowledge. I am not...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 71
  },
  {
    "serial_number": "287606",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "...holding you accountable for what issued from you in some of your sermons in your city Aleppo, for that is a matter that goes back to others whom you accuse of lying against you. Rather, I will convict you with what your pen, deviant from the two Sheikhs, may Allah the Exalted have mercy on them, wrote:\n1 - You approved in your commentary on the book 'Iqamat al-Hujjah' (p. 29)—authored according to what is mentioned in Ibn Taymiyyah's biography—that he [the author] quoted from him [Ibn Taymiyyah] corrupt beliefs for which Al-Yafi'i, Ibn Hajar al-Makki, and others reviled him! And not only this, but you quoted this phrase in your commentary on 'Al-Raf' wal-Takmil' (p. 135) by way of supporting it. If the noble reader refers to the words of Ibn Hajar al-Makki, he will find therein the accusation of Sheikh Ibn Taymiyyah with much of what Al-Kawthari accuses him of, such as Tashbih (resemblance) and Tajsim (corporealism) and other things there is no room to mention now, along with reviling him and attacking him most severely at the beginning and end of his speech, similar to Al-Kawthari's attack on him: 'The conclusion is that no weight should be given to his words; rather, they should be cast into a rugged and rough place. It should be believed about him that he is a stray innovator, a misleading ignorant extremist. May Allah treat him with His justice, and may He save us from the likes of his path, his creed, and his deed, and may He forsake his followers and scatter the gathering of those who believe in him.' This is his speech regarding Sheikh al-Islam Ibn Taymiyyah in 'Al-Fatawa Al-Hadithiyyah' (p. 86, 87). So, would one who is truthful in respecting and revering the Sheikh direct readers to this speech of Al-Haytami, which contains what you have known and heard of Takfir (declaring disbelief) and Tadlil (declaring astray)? Or does that indicate that the one directing is a bitter enemy of the Sheikh, may Allah have mercy on him? That is what enemies of Sheikh Ibn Taymiyyah did before Abu Ghuddah, like Sheikh Muhammad Bakhit al-Muti'i in the treatise 'Tathir al-Fu'ad min Danas al-I'tiqad' (Purifying the Heart from the Filth of Belief); he attacked Ibn Taymiyyah therein as his desire dictated, relying in that on the word of Ibn Hajar al-Makki referred to in 'Al-Fatawa' and quoting it in its entirety!!",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 72
  },
  {
    "serial_number": "287607",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "2 - The author of 'Al-Raf' wal-Takmil' (p. 90-91 and 135) and in 'Al-Ajwibah Al-Fadilah' (p. 174) approved of grouping Sheikh al-Islam Ibn Taymiyyah in the faction of those who are obstinate in criticizing Hadiths by criticizing their narrators. He [Abu Ghuddah] supported this by saying: 'And our Sheikh Al-Kawthari, may Allah the Exalted have mercy on him, has: \"Al-Ta'qib Al-Hathith lima Yanfihi Ibn Taymiyyah min Al-Hadith\" (The Rapid Pursuit of what Ibn Taymiyyah Denies of Hadith), which is still a manuscript.' He repeated this in his commentary on 'Al-Ajwibah' (p. 176): 'And our Sheikh the Imam (sic) Al-Kawthari, may Allah the Exalted have mercy on him, tracked Ibn Taymiyyah's practice in his strictness in denying what is established, in a book he named: \"Al-Ta'qib Al-Hathith..\" which is still a manuscript'!\n3 - He said commenting on what appeared in 'Al-Raf' wal-Takmil' (p. 131) regarding the attack on Imam Al-Dhahabi: 'And our Sheikh Al-Kawthari, may Allah the Exalted have mercy on him, has a comprehensive word on the state of Al-Dhahabi, so check it in his commentary on Al-Subki's refutation of Ibn al-Qayyim's poem (Nuniyyah), titled \"Al-Sayf Al-Saqil fi Al-Radd 'ala Ibn Zafil\" (The Polished Sword in Refutation of Ibn Zafil) (p. 176).' For the intelligent scholar, this referral to his Sheikh's word on the state of Imam Al-Dhahabi is sufficient indication of the validity of what we accused him of regarding the hostility Abu Ghuddah harbors for the people of Hadith. For he knows with certainty that it is not in praise or commendation of him, nor of those who followed his path in creed like his Sheikh Ibn Taymiyyah and his student Ibn al-Qayyim, may Allah have mercy on them. Rather, it is in attacking all of them. He accuses Al-Dhahabi therein of anthropomorphism (Tajsim) and lack of religion, and that his mentality is of the silliest mentalities... etc. of what he raved about. At the conclusion of that, Al-Kawthari says: 'And with that, he is lesser in evil than the poet and his Sheikh as preceded,' meaning Ibn Taymiyyah and Ibn al-Qayyim. And he said in the place he referred to, which is (p. 177):",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 73
  },
  {
    "serial_number": "287608",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "«He is Shafi'i in the branches [of jurisprudence] but an anthropomorphist (Mujassim) in belief, despite his disavowal of it in many places. He has a Kharijite tendency, although he is much lesser in evil than the Nazim (poet) and his Sheikh in all of that»! It is clear that Abu Ghuddah cannot claim that he differentiates between Al-Dhahabi on one hand and Ibn Taymiyyah and Ibn al-Qayyim on the other, because he knows with certainty that they are on one path in the Salafi creed, and because of his Sheikh Al-Kawthari's hostility towards all of them for that reason, as indicated by his previous statement about them. No matter how much Abu Ghuddah tries to evade that, his traces disbelieve in him [expose him]. Listen, O noble reader, to him as he attacks Ibn al-Qayyim and accuses him of anthropomorphism (Tajsim), exactly the handiwork of his Sheikh Al-Kawthari, but with some cunning and evasion {But the evil plot does not encompass except its own people}. He said in his commentary on «Al-Ajwibah Al-Fadilah» (p. 130): «As for Ibn al-Qayyim, despite the greatness of his status and the sharpness of his mind, you see him, if he narrates a hadith that aligns with his (Mashrab) orientation/taste, exaggerating in strengthening and solidifying it to the utmost, until the reader imagines that the hadith is from the category of Mutawatir, whereas it might be a weak, strange, or rejected hadith. But because it aligned with his (Mashrab) orientation, he gathered all his energy for it...» So what is Ibn al-Qayyim's 'orientation' according to Abu Ghuddah? It is this anthropomorphism (Tajsim) that Al-Kawthari accused him of previously and in other books of his, especially his commentary on 'Al-Sayf Al-Saqil', which he named: «Completion of the Refutation of Ibn al-Qayyim's Nuniyyah». And among his statements in it, while advising the readers (p. 57): «I seek refuge for them with Allah from respecting a man who is not exceeded in",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 74
  },
  {
    "serial_number": "287609",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "leaving Islam and the Muslims by the heretics (Zanadiqah) nor the atheists»! And when Al-Subki described Sheikh Abu Ismail Al-Harawi by saying: «The one whom the anthropomorphists (Mujassimah) call Sheikh al-Islam», Abu Ghuddah commented on it saying: «He is the author of the book 'Manazil al-Sa'irin', which Sheikh Ibn al-Qayyim explained in the book ('Madarij al-Salikin')». He points by that, with cunning and malice, to the fact that Ibn al-Qayyim is among the anthropomorphists, for he indeed described Al-Harawi as Sheikh al-Islam in more than one place in «Al-Madarij», such as (1/127). Likewise, Al-Dhahabi described him in «Al-Tadhkirah» (3/354). So these people, according to Al-Subki and according to Abu Ghuddah, are among the anthropomorphists because he approved of him in that! So, after this clarification, does any human remain in the world who believes Abu Ghuddah in the several pages he blackened in his «Kalimat» (Words) praising Sheikh al-Islam Ibn Taymiyyah, saying that he is an Imam among the great Imams of the religion, and praising his student Ibn al-Qayyim, saying that he is among the illustrious Imams of the Muslims!! From (p. 23 - 35), while he attacks them with those aforementioned attacks, in addition to his lack of explicit refutation of his Sheikh Al-Kawthari in his declaring them disbelievers (Takfir), despite our demand for him to do so. Rather, you see him even in his «Kalimat» still mentioning him with reverence and praying for mercy upon him; indeed, he considers his Takfir of the two Sheikhs to be merely Ijtihad from him for which he is rewarded! (p. 38). And you, O reader, if you compare this with Abu Ghuddah's attack on Imam Al-Bukhari and the rest of the Imams of Hadith who spoke about the poor memory of Abu Hanifa, and he does not defend them with anything like his defense of his Sheikh Al-Kawthari, but rather asserts that this was only due to partisanship on their part, may Allah have mercy on them all. It becomes clear to you the deviation of Abu Ghuddah from the People of Sunnah to the People of Innovation and Misguidance, and Allah is the One sought for help.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 75
  },
  {
    "serial_number": "287610",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "New examples of his lies and misleadings. Among his lies and misleadings of the noble readers in the path of showing his reverence for Ibn Taymiyyah and his innocence from attacking him is his saying (p. 24), after mentioning his commentary on the book «Al-Ajwibah Al-Fadilah»: «Let one look at the following pages, wherein are my comments and citations of the speech of Sheikh al-Islam with reverence, respect, and prayers for mercy upon him, as is the custom in etiquette with every scholar and Imam. Those pages are 47, 78, 80, 92, 96, 97, 98, 100, 101, 102, 103, 104, 109, 111, 113 - 120». If you return to the pages he indicated, you will see a wondrous wonder: 1 - There is nothing in any of these pages of the reverence and respect he claimed, except his saying (p. 92): 'Sheikh al-Islam', which he said once and did not return to! I had commented on this statement of his in the «Introduction» (p. 47) with the summary that it is possible he said it as a form of flattery to the people of his temporary country «Riyadh», and it is possible he said it out of conviction, so we requested that he say that by declaring his disavowal of his Sheikh Al-Kawthari's statement about Ibn Taymiyyah: «If Ibn Taymiyyah is still considered Sheikh al-Islam, then peace be upon Islam»! But he did not disavow it, while blackening pages with no substance in praising Ibn Taymiyyah to whiten his dark page thereby, but how impossible! It would have sufficed him from all that, had he been sincere, to admit the truth, which is that he was misled—I do not say: astray—like others among the many enemies of Ibn Taymiyyah, then Allah guided him and he recognized the virtue of Ibn Taymiyyah and knew the soundness of his creed from what Al-Kawthari accuses him of. Since he did not do so, it has been confirmed to us what we accused him of previously: that he plays on two ropes. He wants to satisfy the public among whom he lives now, just as he wants not to anger his peers,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 76
  },
  {
    "serial_number": "287611",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "colleagues, and students who know of his true reverence for Al-Kawthari. The truth is that he pleased neither these nor those. You will see when the dust settles... is there a horse beneath you or a donkey. 2 - He did not pray for mercy upon him except twice (p. 47, 78)! 3 - He described him in some places as (The Sheikh), and I mentioned in the Introduction that this description is not a text indicating praise and commendation, so refer to it. 4 - In most of the pages he indicated, there is nothing of what was mentioned nor anything else indicating the reverence and respect he claimed. These are pages (97, 98, 100, 101, 102, 103, 104, 109, 113). Even though in some pages he mentioned him more than once, like the last page where he mentioned him three times, he did not add more than saying «Ibn Taymiyyah», so he was stingy with him even regarding praying for mercy upon him, even once! All of this clarifies to the reader that when Abu Ghuddah multiplies references to pages as evidence of his reverence for Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, and then one finds nothing of that in most of them, the saying of peace and blessings be upon him applies to him: «The one who pretends to have what he was not given is like the wearer of two garments of falsehood». We ask Allah for well-being and safety. What confirms this to you is that he also quoted from the number one enemy of Sheikh al-Islam Ibn Taymiyyah, namely his Sheikh Al-Kawthari, in approximately the same number of pages in which he quoted from Ibn Taymiyyah. You see him in most of them describing him as 'The Imam' and in some 'Our Sheikh', and sometimes he says",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 77
  },
  {
    "serial_number": "287612",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "«Our Sheikh the Imam» and in all of them he adds to that the prayer for mercy upon him; he did not miss that even once! These are the pages (52, 59, 69, 71, 83, 92, 95, 97, 104, 105, 107, 132, 138, 148, 172, 176, 184, 203, 221, 234). Indeed, in page (97) he mentioned him twice with a prayer for mercy upon him each time! And in page (104) he mentioned Ibn Taymiyyah without praying for mercy upon him or anything else indicating the alleged reverence, and four lines later he said: «And our Sheikh the Imam Al-Kawthari, may Allah the Exalted have mercy on him, has directed...»! And in the opposite page he said: «End of the speech of our Sheikh the Imam Al-Kawthari, may Allah the Exalted have mercy on him». Even more than this, he mentioned both of them in one line, praying for mercy upon Al-Kawthari but not Ibn Taymiyyah, saying (p. 276): «And our Sheikh the Imam Al-Kawthari, may Allah have mercy on him, critiqued the action of Ibn Taymiyyah in his strictness...» etc., the speech which I quoted in full (p. 70). Among his cunning and plotting is that he did not mention in the previous pages to which he referred as evidence of his reverence for Sheikh al-Islam this page (176), because what is in it of the quote from Al-Kawthari reveals his shame and indicates what he harbors for the Sheikh of hatred and defamation, following his Sheikh Al-Kawthari, may Allah deal with them both with His justice. And among his cunning and malice is that he says about Ibn Taymiyyah, Ibn al-Qayyim, and Ibn Abdul Wahhab (p. 19) in his disclaimer of the Takfir attributed to him: «And these are distinguished Imams among the chosen believing scholars and workers calling to Allah the Exalted. Whoever wants to judge them with foolishness and dementia must declare the Imams of Islam disbelievers, as well as these distinguished masters. Suppose I said this morning is night... would the worlds be blind to the light?»",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 78
  },
  {
    "serial_number": "287613",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "He says this while knowing that his Sheikh Al-Kawthari declares Ibn Taymiyyah and Ibn al-Qayyim disbelievers and places them, regarding exiting Islam and the Muslims, like the heretics (Zanadiqah), as mentioned previously. So do you believe then, if you are truthful in misleading the aforementioned, that your Sheikh Al-Kawthari is a demented fool! If you believe this, how do you combine in your mind—may Allah heal you from it—between this attribution of foolishness, if you commit to it, and your taking him as an Imam? And if you do not commit to that and remain on your affiliation to him, then how do you reconcile this with your previous statement: «And these are distinguished Imams... and whoever wants to judge them with foolishness and dementia must declare the Imams of Islam disbelievers...»? Is this not hypocrisy and deception of the people?! Truthful was he who said: Whatever nature a man has... even if he thinks it hidden from people, it will be known. From that also, he blackened pages under the title «My victory for Sheikh al-Islam in the most critical circumstances». When you read the speech beneath it, some of his fanaticism against Ibn Taymiyyah and his deviant belief regarding him is revealed. He quoted the speech of Sheikh Al-Thanawi about him, who showed bad manners towards him, which is his saying: «And among the good hadiths that Ibn Taymiyyah rejected... is the hadith of the return of the sun for Ali, may Allah be pleased with him. When he saw Al-Tahawi had graded it Hasan (good) and affirmed it, he began to defame Al-Tahawi with a sharp tongue and fluent speech. By Allah, the rank of Al-Tahawi in the science of Hadith is above thousands like Ibn Taymiyyah. And where is it for Ibn Taymiyyah to be like the dust of his sandal? The statements of such hardliners are not relied upon except after verification and contemplation».",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 79
  },
  {
    "serial_number": "287614",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Then Abu Ghuddah focused his speech on Al-Thanawi's saying: «And where is it for Ibn Taymiyyah to be like the dust of his sandal», and criticized him for this phrase and wrote to Al-Thanawi about it until he retracted it. The noble reader will notice that Abu Ghuddah only concerned himself with a formal aspect, using that as a means to show his reverence for Sheikh al-Islam Ibn Taymiyyah and his lack of Takfir towards him. He missed that what was more deserving of his criticism of Al-Thanawi was his claim that «Al-Tahawi's rank in the science of Hadith is above thousands like Ibn Taymiyyah» and his saying about him that he is among the «hardliners» (Mutashaddidin). So, Abu Ghuddah turning away from criticizing him in these two matters is the greatest proof of his agreement with him on them. This is supported by what was previously quoted from Abu Ghuddah regarding his inclusion of Ibn Taymiyyah in the group of hardliners, following his Sheikh Al-Kawthari. So where is the reverence and respect for Ibn Taymiyyah he claimed, while he looks at him with that contemptuous, degraded view in Hadith, and that he is among the hardliners?! Know, O noble reader, that we do not rule out that Abu Ghuddah might honor Ibn Taymiyyah in one of the attributes existing in him, such as his asceticism, his knowledge in Tafsir, Hadith, and Usul, etc., and his patience with trials and tribulations. Therefore, what he claims of praise for Ibn Taymiyyah and defense of him is from this perspective. This, naturally, does not contradict that he believes regarding him that he is misguided and deviant from the creed, such as [accusing him of] anthropomorphism and other things his Sheikh Al-Kawthari accuses him of. This is one thing and that is another. The contemplator might glimpse something of this in his speech, for he quoted on p. 28-29 of his «Kalimat» a comment of his in some books praising Ibn Taymiyyah and his patience in his imprisonment, and he commented on that saying: «May Allah the Exalted have mercy on him and grant us to emulate him in what befalls of trials, tribulations, aggression, and fabrication». He did not ask to be granted emulation",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 80
  },
  {
    "serial_number": "287615",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "of him also in his call to the creed of the Salaf and his good understanding of the Sharia, because Ibn Taymiyyah is not fit to be a role model for people in those matters according to him. This is what Abu Ghuddah does not dare to declare openly, and that is why he continues to argue, act arrogantly, and evade. This is the end of the response to what came in his answer to paragraph (16). Secondly: He answered paragraph (17) with what condemns him regarding what it contained of pointing out his hypocrisy in the land of his livelihood. He did not deny that about himself even with his tongue, because he started mocking our introducing him to the readers by name, school of thought (Madhhab), and orientation (Mashrab), and his being a Hanafi fanatic for Al-Kawthari. He did not add more than saying, to mislead his readers from the truth: «So they mentioned my name, my lineage, the name of my country, my school of thought, and the name of my son, but they missed mentioning the rest of the family members». By this, he misleads the readers who had not previously seen the «Introduction». The intent that led us to mention him with the attributes of lineage, school of thought, and orientation was by way of introducing the writer of that unjust report. Salafi and Kawthari?! Thirdly: He answered paragraph (18) that he is not one hundred percent Kawthari! He uses as evidence for that the fact that Al-Kawthari used to shun (thus he said, and he does not say: declare as disbelievers) Ibn Taymiyyah and Ibn al-Qayyim according to his opinion and Ijtihad (thus he said, may Allah treat him as he deserves). Then he said: «If I were committed to everything he says, I would have shunned them and followed him in this orientation of his towards them»! As for Al-Kawthari's attack on the Imams of Hadith, including Ibn Taymiyyah and Ibn al-Qayyim, and accusing them of anthropomorphism, labeling them as foolish Hashawiyyah (riffraff) and accusing them of stagnation in Fiqh and understanding, and that they are carriers of books (donkeys), and his attack on trustworthy narrators including a group of Hafizs and jurist Imams",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 81
  },
  {
    "serial_number": "287616",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "such as Malik, Al-Shafi'i, and Ahmad, and his declaring Abdullah bin Ahmad a liar... etc., from what was previously mentioned in the stated paragraph—for all of this, Abu Ghuddah did not say that he is not with his Sheikh Al-Kawthari in it, despite our insistence on him to disavow him completely and in detail. Then, with that, he did not speak nor disavow except his shunning of Ibn Taymiyyah and Ibn al-Qayyim. Every person of intellect witnesses, this being the case, that Abu Ghuddah is still a Kawthari in the other matters, and how many they are! And one of them is enough to judge Abu Ghuddah with misguidance and exiting the Saved Sect, if we do not say falling into the arena of Kufr (disbelief) which necessitates eternity in the Fire, and what a wretched destination. Especially when he boasts in his «Kalimat» saying (p. 38): «...and I leave what I see as far from acceptance even if it issued from someone greater than Sheikh Al-Kawthari». If Abu Ghuddah is truthful in this statement of his, yet he did not disavow those numerous corruptions that mislead their holder, does it not result from that that Abu Ghuddah believes in them because he did not turn away from them? Especially since we requested that from him because we do not hold enmity towards him personally, but rather we desire guidance for him as for others, and for that reason, we made room for him to retract, but he did not do so. {Upon itself, Baraqish brought harm}. Fourthly: He did not address the answer to this paragraph (19) directly; rather, he deviated from it so that his deception of the readers would not be exposed, forgetting the saying of Allah the Exalted {And Allah will bring forth what you were concealing}. He said under the title «My sayings regarding Ibn al-Qayyim» (p. 36): «And I, by the praise of Allah the Exalted and His bounty, profess to Allah the Exalted in the station of creed the creed of the Salaf, may Allah be pleased with them. So I speak with their creed regarding the Names and Attributes, and I affirm for Allah the Glorified what He affirmed for Himself",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 82
  },
  {
    "serial_number": "287617",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "and what our Master the Messenger of Allah, peace and blessings be upon him, affirmed for Him, without interpretation (Ta'wil), distortion (Tahrif), likening (Tashbih), or representation (Tamthil). {There is nothing like unto Him, and He is the Hearing, the Seeing}». So I say, and Allah is the One sought for help: 1 - Salafi and Kawthari?! These are two opposites that do not combine. So how does Abu Ghuddah insist on being a Kawthari in the issues we had explained in the Introduction and pointed to previously, requesting him in it to disavow them, yet he did not disavow, and then he declares here that he is Salafi in creed! Is this not among the evidences supporting us in our description of him that he «plays on two ropes»? He is Salafi with the Salafis in creed, and Kawthari with the Kawtharis! By Allah, this is a wondrous thing! If Al-Kawthari himself were alive, he would have disavowed you for your combining between contradictions and your playing on two ropes. I bear witness for him regarding his misguidance that he is better than you in his frankness and his distance from such exposed hypocrisy!! 2 - I ask you, do you imagine a Muslim, whether Salafi or Khalafi, Maturidi or Ash'ari, Deobandi or Kawthari, daring to say the opposite of this sweet speech you said to prove you are Salafi in creed? All Muslims say the likes of this statement of yours, even your Sheikh Al-Kawthari, despite his great misguidance, cannot say other than that—despite his attacking the protectors of the Salafi creed—otherwise, if he said other than that, the cover would be revealed. So then, what is the difference between the Salaf and the Khalaf in that? The answer: The Doctrine of the Salaf in Attributes and the Stance of Preachers Today Regarding It. 1 - The Salaf describe Allah the Exalted with what He described Himself with in",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 83
  },
  {
    "serial_number": "287618",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "His Book or what His Prophet, peace and blessings be upon him, reported about Him, and they believe in that as He described Himself *in reality (Haqiqatan)* without interpretation (Ta'wil)... etc. This word «Haqiqatan» (in reality) is the distinguishing characteristic of the Salafi over others from the Khalafis (Later Generations). For the latter are of two sections: A section of Tafwid (Relegators) who believe in the wordings of the verses and hadiths of Attributes without believing in the realities of their meanings that befit Allah the Exalted. This is what many of the Khalafis are upon now who have not studied the creed of the Salaf, or studied it but did not understand it, or understood it but did not digest it and did not believe in it. This is prevalent among those who pretend to be callers to Islam (and one who lacks a thing cannot give it), and some of them claim that this is the doctrine of the Salaf out of ignorance or feigned ignorance. Among them is Al-Kawthari, the Sheikh of Abu Ghuddah, as he declared in his commentary on «Al-Ikhtilaf fi Al-Lafz» by Ibn Qutaybah (p. 30). And a section of Mu'awwilah (Interpreters) and Mu'attilah (Negators) who inevitably deny some of the attributes of Allah the Exalted in the name of Ta'wil (interpretation) and distorting words from their places. Among them is your Sheikh Al-Kawthari; indeed, he is the flag bearer of this deviation in the present era. And you, when you said: «without interpretation nor distortion...» have removed yourself—albeit with your tongue, and Allah is your Reckoner and Questioner about what is in your heart—from this last section. But you did not remove yourself from being among the Mufawwidah (Relegators) whose faith stops at the wordings without the meanings! So, I wonder, did you intentionally not add the word «Haqiqatan» (in reality) to your previous speech in order to mislead the readers so they would testify for you that you are Salafi! Or is it that you yourself do not know the difference between the two aforementioned sections?! If you do not know, then that is a calamity... and if you know, then the calamity is greater.",
    "foot_note": "1. * (The word «Haqiqatan» is) fell from the second edition and I retrieved it from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 84
  },
  {
    "serial_number": "287619",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "And Allah bears witness that it pleases and gladdens me that you be sincere in this declaration of yours in which you deny the interpretation (Ta'wil) that your Sheikh Al-Kawthari subscribed to, which led him to exit the path of the Salaf one hundred percent, and even drove him to attack the creed of the Salaf and to interpret their words that contradict his school of thought regarding the verses and hadiths of Attributes. And why would he not interpret their words when he interprets the Word of Allah and the word of His Messenger, peace and blessings be upon him?! I do not rule out that your declaration of what you differ in with your Sheikh Al-Kawthari regarding interpretation might be something you benefited from your association with the Najdi scholars, who are among the most knowledgeable people today of this Salafi creed. However, there remains upon you something important, very important, which is that your belief in the creed of the Salaf must be a real belief, not only with no interpretation (Ta'wil) but also with no relegation (Tafwid). This is what I am certain you are very far from believing in, because if you were truly a believer, you would have hastened to answer the seven questions referred to in this paragraph, most of which relate to the creed, the creed of the Salaf. In that case, there is no great benefit from your denial of interpretation because you did not believe in what corresponds to it, which is belief in His Attributes, the Exalted, in reality (Haqiqatan) as befits Him, Glorified and Exalted. So your saying then: «So I speak with their creed regarding the Names and Attributes». Either it is of the type {They say with their tongues what is not in their hearts} or of the type of the hypocrite's saying when asked in the grave about the Prophet, peace and blessings be upon him: «I do not know, I say as the people say». You heard the monotheist scholars of Najd denying interpretation, so you spoke with their saying without understanding its implication, which is belief in the Attributes",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 85
  },
  {
    "serial_number": "287620",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "in reality (Haqiqatan), no interpretation and no relegation. And from where would Abu Ghuddah know the Salafi creed when he lived his life in the embrace of the greatest enemy to it in the present era and studied under him until he affiliated himself to him proudly, for he is «The Hanafi Kawthari» by his own admission!! Therefore, we still demand with insistence that you answer the seven questions with a frank answer containing no evasion or deception, and declare that you are innocent of Al-Kawthari completely and in detail, and that you do not agree with him in all the criticisms we held against him in the «Introduction» (p. 24 - 46) and many others, and renounce your affiliation to him explicitly. For everyone knows that if you disavow him, you have not disavowed Islam, and you testify the two testimonies and what they necessitate of the correct creed as long as you say that you speak with their creed. So answer what you were asked, and announce your innocence from your 'Kawtharism' so that your loved ones and enemies may be on clear proof regarding your matter. And peace be upon he who follows the guidance. Fifthly: As for what relates to paragraph (20), the poor man did nothing but quote from the «Introduction» what I had mentioned in its conclusion regarding «Reports submitted by spies and informants» without us naming anyone. But he identified himself, saying after it: «End of their speech literally. And they mean me by all of this». So I say: You knew, so stick to it, then regret what «your hands tied, and your mouth blew»! (1) As for what the paragraphs prior to this contained",
    "foot_note": "1. (1) A well-known proverb used for someone who brings harm upon himself. Similar to their saying: «From you is the menstruation, so wash it»!",
    "book_id": "133365",
    "new_page_number": 86
  },
  {
    "serial_number": "287621",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "regarding the indication of what is in the Introduction of knowledge, correct criticism, binding arguments, and other truths, Abu Ghuddah did not address them by mentioning them at all, neither objecting nor admitting, forgetting that admitting the truth and returning from error is a virtue. This matter reminds us of the Levantine proverb: «He is like the Sufi, he neither denies nor fulfills»! And the old Arabic proverb: «The scorpion stings and squeaks»: meaning it screams! And «If the scorpion returns, we return to it, and the sandal is present for it»! Fourthly - New slander and dishonorable incitement: Abu Ghuddah was not satisfied with all those fabrications and stabs he directed at me in his unjust report which I refuted in the «Introduction» with a refutation he could not answer at all, as you knew from this response to his «Kalimat». Rather, he returned to new slander and malice, which reminds me of what is in the proverbs: It was said to the wretched one, come to happiness, so he said: What I am in is sufficient for me! That is because, after he despaired of moving the officials there against Al-Albani's comments and his extraction (Takhrij) of the explanation of Al-Tahawiyyah, he went back searching in Al-Albani's other books hoping to stumble upon a slip to cling to—like a drowning man clinging even to the threads of the moon!—to build palaces and high towers upon it. He found in some of them words containing a reminder to the officials there about some reprehensible matters occurring in Medina, so that they might hasten to rectify them before the tear widens for the patcher. So Abu Ghuddah considered that a condemnation and an attack on the scholars and officials there, to ingratiate himself to them through hypocrisy at the expense of overturning the facts {And Allah testifies that the hypocrites are liars}. How not, when every Muslim knows his saying, peace and blessings be upon him: «Religion is advice (Nasiha): for Allah, His Book,",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 87
  },
  {
    "serial_number": "287622",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "His Messenger, and the leaders of the Muslims and their common folk». Yet Abu Ghuddah ignores this hadith along with other texts from the Book and the Sunnah that obligate commanding good and forbidding evil and advising the leaders of the Muslims and their common folk. He makes that an attack on the leaders and incites them against me, claiming that I denounced them. He says, after pleading to them by praising and commending them with what his companions and students know before others that he says with his tongue what is not in his heart; for after returning to point to the Introduction and the descriptions in it by which we revealed his character, and to the attack on its writer and publisher with his saying: «Those who claim Salafiyyah and jealousy for the creed for personal benefits and goals, while they are the fiercest enemies to what they claim»? So let the overturning of facts be like this: Abu Ghuddah the Kawthari is Salafi, and Al-Albani and his Salafi brothers known for that for a third of a century or more are the fiercest enemies to what they claim, and not the Kawthari and the student of the Kawthari! By Allah, the saying of the one who said has come true regarding him: «He came with the two horns of a donkey». Abu Ghuddah the Kawthari said after that under the title: Exploitation of Salafiyyah and attacking it: «They published in some of their books what they used to attack the scholars and officials in this noble Kingdom which was established on the creed, its protection, its care, and its dissemination, and it still is its protector and caretaker, placing all its capabilities in the path of spreading it, calling to it, and defending it. They said in the book «Hujjat al-Nabi, peace and blessings be upon him» (p. 145), denouncing the esteemed Kingdom of Saudi Arabia and the scholars and sheikhs known in it, what I place literally between parentheses: «The State of Tawhid has begun",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 88
  },
  {
    "serial_number": "287623",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "to be lenient in eliminating what contradicts its Tawhid, which is its capital. And the Sheikhs and the group of Commanding Good are a [mere] committee! Except for what Allah wills» end of their speech». So look, O noble reader, at this hunchbacked loser Kawthari, rightfully, how he overturns facts, making the good evil and the evil good. Instead of adding his voice to mine and mentioning my reminder of the necessity of fighting the polytheistic and idolatrous practices that have begun to appear, he considers this reminder of mine a denunciation of the Saudi rulers and scholars! I only said what he quoted from me as a comment on one of the innovations I listed at the end of «Hujjat al-Nabi, peace and blessings be upon him», which is: «123 - Tying rags to the Maqam and the Minbar to fulfill needs». I said commenting on it: «This phenomenon has swelled in recent times, a swelling that was not there before, which indicates that the State of Tawhid...» etc. So contemplate how the Kawthari deleted this sentence which indicates to the reader the reason that pushed me to remind the State of the mentioned leniency, hoping it would address the matter with the necessary firmness and resolve. He considered this reminder of mine and my advice to the State and its scholars as an attack on them! Does not this action of Abu Ghuddah indicate that he is jealous, outwardly, for the Saudi Kingdom and its scholars more than he is jealous for the Law of Allah, assuming that his jealousy for them is sincere from him? And why is that, I wonder? The answer is clear to the readers. Nevertheless, it suffices me to believe that the wise ones, scholars, and sincere Sheikhs among them do not share with «Abu Ghuddah» in this stab; rather, they believe that I performed something of what is obligatory",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 89
  },
  {
    "serial_number": "287624",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "upon me of alerting and reminding, and they appreciate that, as some of them frankly told me. Even if the enemies of Tawhid exploit such things and try to provoke the rulers against us there {And Allah is predominant over His affair, but most of the people do not know}. I wonder what Abu Ghuddah wants from his incitement of the rulers there against us. If I were an employee like him with them, it would be said: He seeks to harm you by getting you expelled from your job—and cutting off your livelihood. But while I live in Syria earning my livelihood by the toil of my right hand and the sweat of my brow, what does Abu Ghuddah desire from that incitement? Nothing remains to be said except that he desires by that to prevent you from Hajj and Umrah which you have been accustomed to every year mostly for several years. Let the reader contemplate the action of this hunchback who boasted in his «Kalimat» saying: «My behavior is exposed, and my character is known»! And before that, he was pleased that some of his brothers published that recommendation about him which stated: «He combined with his abundant knowledge piety and fear of Allah in secret and in public (!), so he stops at the limits of Allah and does not transgress them, distancing himself from doubts and disliked matters (!). It was never known of him that he commanded a good deed except that he applied it to himself (!) and those he supports (!), nor forbade an evil except that he avoided it himself and those he supports (!)» (1). So does one about whom some of this praise was made incite with that incitement, or is it the hypocrisy controlling the Sheikh himself and some of his students?!",
    "foot_note": "1. (1) Some of what came in a flyer Abu Ghuddah published praising himself, see «Introduction to the Explanation of Aqidah Tahawiyyah» (p. 48). He avoided referring to it in his «Kalimat».",
    "book_id": "133365",
    "new_page_number": 90
  },
  {
    "serial_number": "287625",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "Then Abu Ghuddah, may Allah guide him and remove his hatred and malice from him, said: «And they said in this book also (p. 151) denouncing the officials responsible for the Prophetic Mosque, describing them with going along with desires, weakness of faith, and dominance of whims: '...And I have spoken with some virtuous people about the necessity of intervening between these ignorant people and the violations they commit, but the official who is capable of that did not do so, and will not do so unless Allah wills! That is because he goes along with some of the people of Medina in their desires and whims, and does not respond to the sincere advisors among the people of knowledge, even if they were from the people of the country! And to Allah is the complaint from the weakness of faith and the dominance of whims, in which even Tawhid was of no avail! Due to the dominance of the love of wealth over its people, except for whom Allah wills, and how few they are. And the Messenger of Allah, peace and blessings be upon him, was truthful when he says: «The trial of my nation is wealth».' End of their speech». I say: This text is like the previous one in indicating that I mentioned the officials there regarding the reprehensible acts occurring in the Prophetic Mosque. But Abu Ghuddah, according to his habit of overturning facts, considers that a denunciation of the officials. From here you know the reason why Abu Ghuddah was able to remain an employee with them for about ten years, even though they are Salafi in creed and he is a Khalafi (Successor/Later Generation) *[Note: printed as Hanafi in 2nd ed, corrected from 1st ed]*! That is by his flattery to them and his hypocrisy towards them, whereas others did not stay with them long, only three years, despite their belief in him that he is Salafi. That was only due to his advice and reminding regarding negligence that no human is free from, while that one excelled in abandoning advice and reminding to gain from them «a number of coins to fill the belly!». Before I move the readers to another paragraph, I want to draw attention to the completion of the speech that Abu Ghuddah intentionally deleted at the beginning of",
    "foot_note": "1. * In the second edition: (Hanafi), and what is affirmed is from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 91
  },
  {
    "serial_number": "287626",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "the previous statement he quoted from my book and indicated with three dots at its beginning «...». I say Abu Ghuddah intentionally deleted it for a known purpose not hidden from the reader, which is my saying commenting on the innovation: 147 - Intending prayer towards his grave, peace and blessings be upon him: «I have seen in the three years I spent in Medina (1381 - 1383) as a professor at the Islamic University, very many innovations being done in the Prophetic Mosque, and the officials responsible in it are silent about all of that, just as is the case here in Syria exactly. Among these innovations is what is explicit Shirk (polytheism), like this innovation, for many pilgrims intend to pray towards the noble grave, even after the Asr prayer during the disliked time. They are encouraged in this by seeing in the wall of the grave which they face a small Mihrab (prayer niche) from the relics of the Turks that calls out with the tongue of its state to the ignorant ones to pray at it. Add to that that the place where they pray is a raised platform furnished with the best carpets. And I have spoken with some virtuous people...» etc. So is there in this speech anything other than reminding the officials there of what is obligatory upon them of striving to remove these reprehensible acts from the Prophetic Mosque, which he himself, peace and blessings of Allah be upon him, does not approve of, before the disease exacerbates and the cure becomes difficult. Similar to that is his saying under the title: «Arrogance towards officials»: A new example of his lying in citation «And they said in this book also p. 156 in the course of their criticism of the government of the esteemed Kingdom of Saudi Arabia constructing",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 92
  },
  {
    "serial_number": "287627",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "كشف النقاب عما في «كلمات» أبي غدة من الأباطيل والافتراءات",
    "edition": "الثانية، 1398 هـ - 1978 م",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "a wall over the graves of the martyrs of Uhud to prevent entering and seeking blessings (Tamassuh) from them, claiming the nearness of the return of manifestations of idolatry to the land of the State of Tawhid under the shadow of the current Saudi rule. They said what I place literally (!) between parentheses: «The land in which is the grave of Hamza and others from the martyrs of Uhud had no building on it until the past year 1383 AH. But the Saudi government in this year erected on their land a wall built with cement, and made for it a large iron door from the Qibla side, and an iron window at the end of the eastern wall. when we saw that, we anticipated evil! And we said: This is a harbinger of evil! And it is not far-fetched that it is a prelude to restoring the mosque and domes over their graves, as the matter was before the first Saudi rule, when the people were enthusiastic for religion, acting by its rulings. And this is the beginning of evil. If the matter continues in this manner of leniency in applying the Law, and daring to violate it, I do not rule out that manifestations of idolatry will return to the land of the State of Tawhid as was the case before its rule» end of their speech, and in it is their attack on the scholars of the Kingdom and their arrogance towards the officials in it». I say, and through Allah is help sought, the most difficult thing is discussing one who does not fear Allah, and acts arrogantly until he says: A goat even if it flew. For: His saying: 'what I place literally'. Is an exposed lie, for he deleted sentences from my speech for the purpose of misleading and proving the alleged attack. 1 - I said after my saying 'acting by its rulings': «And Allah is predominant over His affair. And this is the beginning of evil, for I saw a rag on the window",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 93
  },
  {
    "serial_number": "287628",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "multiply, and when the building of the wall is completed, and it was said to me: That some of them started praying inside the structure seeking blessings, and if the matter continues in this manner...’ If you know this omitted speech, it becomes clear to you that ‘Abu Ghuddah’ still alters words from their places, like those about whom Allah said: {They alter words from their places and have forgotten a portion of that of which they were reminded}. For by the mentioned omission, he altered the meaning from the intent I aimed for with the complete speech. For the demonstrative noun in my saying (this is the beginning of evil) refers to what I saw of the breach on the window. But based on his mentioned omission, it refers to what was previously mentioned regarding the building of the wall over the graveyard! 2 - His saying: ‘Their speech ended, and it contains their attack...’ contains two lies, nay three: The first: That the speech did not end, rather at its end came the text: ‘May Allah make its steps firm, and direct it to acting upon the Sharia completely, not fearing in Allah the blame of a blamer, and He is the One sought for help.’ His omission of this sentence is the clearest distortion because if he had established it, his fabrication would have been exposed to the readers intuitively. Therefore, he omitted it to mislead the readers and slander the innocent; so upon him from Allah is what he deserves. This sentence is the greatest proof that we intend advice by these words for the Saudi state and its rulers, and we do not intend to harm or attack them as this sinful fabricator wants to say. The second: His saying: ‘Their speech,’ for this is my speech alone, and the publisher bears no responsibility for it if it were a mistake. So this is also part of his misleading the readers as I explained before.",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 94
  },
  {
    "serial_number": "287629",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 92,
    "volume_number": 1,
    "text": "The third: His saying: ‘Their attack,’ for it is a double lie, as there is no attack absolutely; rather, it is advice and reminder. Even if it were assumed to be an attack, upon me alone is its responsibility; the publisher nor anyone else has any connection to it. \n\n5 - His repetition of the accusation of attacking the Madhhabs and the refutation of him regarding it and his claim that they are the Sharia!\nThis appears as if Abu Ghuddah feels deep inside himself that this accusation which he tried to attach to me to incite the rulers there against me will return with him failing, if it is not an arrow in his throat. Therefore, he took another path he had trodden before by spreading it with his tongue, and now he returns to it broadcasting it with his pen, thereby revealing other aspects of his ignorance of Islam and numerous other accusations. Thus, he becomes like the one searching for his death with his hoof, and digging his grave by himself. For after attributing to me that I considered his affiliation to the Hanafi Madhhab a scope for disparaging Abu Ghuddah—and this is also a lie—he said under the title: ‘Their attack on the four Madhhabs’: ‘And it was not for me to find that strange from them as long as they believe that affiliation to any Imam of the followed Madhhabs is an insult and a disgrace with which those affiliated to those Madhhabs are stigmatized. For they have paired the followed Madhhabs with the Gospel, and removed them from the circle of our Sharia and from the Book and the Sunnah, and claimed that they are other than them. Yes, they claimed that they are other than the Book and the Sunnah. So I do not know what they mean?! And what—behind that—do they intend?! This is their saying in the footnote of “Mukhtasar Sahih Muslim by Al-Hafiz Al-Mundhiri” printed in Kuwait, the first and second editions both, in the second part of it on p. (308) literally:",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 95
  },
  {
    "serial_number": "287630",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 93,
    "volume_number": 1,
    "text": "“...Indeed Isa, peace be upon him—meaning when he descends—will rule by our Sharia, and judge by the Book and the Sunnah, not by other than them such as the Gospel or Hanafi Fiqh and the like.” Their saying ended literally. Far be it that they cover up what issued from them with any interpretation or justification?! For this statement of theirs implied: That (Hanafi Fiqh and the like) is not from our Sharia and is not from the Book and the Sunnah.’\n\nClarification of the lying and misguidance in his speech regarding the ‘Footnote of Mukhtasar Muslim’\nI say: In this speech, there is lying and misguidance that would not issue from a person who respects his religion and his intellect, let alone respecting his brothers and friends. Here is the clarification:\nFirst: We have proven previously his lie regarding what he attributed and attributes to us of attacking the Madhhabs and that we consider affiliation to them an insult and a disgrace. This is an open lie, and the explanation of that has preceded in detail, so we will not return to it. If this misguided one makes repeating the accusation regarding that his habit, then Allah is his Reckoner.\nSecond: His saying ‘And they removed them (i.e., the Madhhabs) from the circle of our Sharia and from the Book and the Sunnah and claimed that they are other than them.’\n\nOur Position on the Madhhabs\nSo I say: This is also a lie with this generalization. No Muslim on the face of the earth says that. For it is known by necessity that in the Madhhabs there are many, very many issues agreed upon among Muslims, and they have their evidences from the Book and the Sunnah. And in every one of them, regarding what they differed in, there is much correctness which is preponderant by evidence from the Book and the Sunnah. However, opposite this, there are many issues in every Madhhab which were based...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 96
  },
  {
    "serial_number": "287631",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 94,
    "volume_number": 1,
    "text": "...on Ijtihad and opinion, and the Sunnah indicated their error. So the mistaken one in them is rewarded with a single reward. Therefore, when the scholar Ibn Daqiq al-Eid, may Allah the Exalted have mercy on him, collected the issues in which the Madhhab of each of the four Imams contradicted the authentic Hadith, individually and collectively, in a huge volume, he mentioned in its beginning that attributing these issues to the Mujtahid Imams is prohibited (Haram), and that it is obligatory upon the Jurists who blindly follow them to know them so that they do not attribute them to them, and thus lie about them (1). Because of that, the prohibition of blind imitation was authentic from the four Imams, may Allah the Exalted have mercy on them, as well as the command to return to the Book and the Sunnah, as is detailed in the beginning of my book ‘The Prophet’s Prayer Described...’ and others. In it is an explanation of the middle position that a Muslim should take towards the Imams, may Allah the Exalted have mercy on them. Abu Ghuddah is aware of that, but he is arrogant according to his habit and attributes to me what he himself knows to be false; so Allah is his Reckoner. Because of this type of issue which contradicts the Sunnah in every Madhhab of the four Madhhabs, let alone others, it is not permissible to say that they are the Book and the Sunnah, and that they, with all the details and errors they contain, are from our Sharia. And if Imam Ibn Daqiq al-Eid prohibits, as preceded, attributing these issues to the four Imams, then how is it permissible to attribute them to the Islamic Sharia?! Therefore, I absolved Isa, peace be upon him, from ruling by one of the Madhhabs when I said, commenting on the statement of Imam Ibn Abi Dhi’b, the narrator of the Hadith: ‘How will you be when the son of Mary descends among you and your Imam is from you?’ Ibn Abi Dhi’b said explaining it: ‘And leads you by the Book of your Lord and the Sunnah of your Prophet.’ So I said commenting on it:",
    "foot_note": "1. (1) ‘Iqaz al-Himam’ by Sheikh Salih al-Fullani, may Allah have mercy on him.",
    "book_id": "133365",
    "new_page_number": 97
  },
  {
    "serial_number": "287632",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 95,
    "volume_number": 1,
    "text": "‘This is explicit that Isa, peace be upon him, will rule by our Sharia, and judge by the Book and the Sunnah, not by other than them such as the Gospel, or Hanafi Fiqh and the like.’ By mentioning the Gospel, I indicated the refutation of the Christians who claim that Isa, upon his descent, will not rule by the Quran, but rather by the Gospel. And by mentioning Hanafi Fiqh, [I intended] the refutation of some Hanafi fanatics who assert that Isa, peace be upon him, will rule by the Hanafi Madhhab. And I intended by my saying: ‘and the like’ to repel what might cross the mind of some Hanafi fanatics that my mentioning of Hanafi Fiqh without others is only fanaticism from me against it and an inclination towards others. So I said: ‘and the like’ to equate between it and all the Madhhabs in that Isa will not rule by any of them, but rather by the Book and the Sunnah only. It would not have crossed the mind that this brief speech would be exploited with such a cheap exploitation as issued from Abu Ghuddah previously and subsequently. As for previously, that was when the book was printed in its first edition; he raised the world and did not sit it down, by spreading rumors among people that Al-Albani attacks the four Madhhabs and that it is not permissible to affiliate with them just as it is not permissible to affiliate with the Gospel, and similar falsehoods which he has now expressed in writing in his ‘Words’. How many a person asked me about this rumor, and my answer to it was: Glory be to You, this is a great slander. When we knew that day that its source was Abu Ghuddah, I hastened to write a retraction (Istidrak) in which I included the refutation of this rumor and its invalidation, while indicating that the one who took charge of the greater part of it was one of the Hanafi fanatics. I clarified therein this brief comment similar to what the publisher of the second edition clarified in his introduction to the second edition. I sent the retraction to the agent of the first publisher, and the one in charge of printing the book in Beirut at that time, so that he would print the retraction and append it...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 98
  },
  {
    "serial_number": "287633",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 96,
    "volume_number": 1,
    "text": "...to the book before its distribution. I followed that with a telegram I sent to the publisher while he was in Kuwait, hoping that the book would not go down to the markets before the retraction came to him printed to be appended to the book. I followed it with a letter I sent to him detailing the matter. But the book was distributed without the retraction! It was said that the reason is that Abu Ghuddah is a friend of that agent, and he used to visit him at that time, so he showed him the retraction, and he advised him against publishing it. So he had what he wanted. Months later, I met the publisher and asked him about the reason for not publishing the retraction, and he answered with an answer that was of no avail. I do not know until today what the proportion of responsibility he bears is for not printing the mentioned retraction.\nThirdly: Among the wonders is that the publisher referred to is one of Abu Ghuddah’s intimate friends, and he still sells his books, with all the attacks on the Imams contained therein, in his library in Kuwait until today. Abu Ghuddah knows with certainty that he is the publisher, yet he holds him, also, responsible for my saying in the footnote by associating him with me in his usual lie: ‘their saying.’ The speaker is only me alone, and the publisher or the printer has no relation to it. Look at him how he says: ‘So this is their saying in the footnote of “Mukhtasar Muslim...” printed in Kuwait...’ for he usually means by such a phrase: ‘their saying’ the author and the publisher of his books, who is Brother Zuhair Al-Shawish ‘owner of the well-known office (Al-Maktab Al-Islami)’! But his unjust habit overcame him, so he meant with me someone other than him among the publishers, namely the first Kuwaiti-Egyptian publisher, and he is one of his intimate friends as we mentioned. So he harmed him while he did not perceive, which reminds me of the famous proverb: ‘A rational enemy is better than an ignorant friend’!\nFourthly: His saying ‘Printed in Kuwait in the first and second editions’ is a misleading intended by him, for he knows that it was printed in Beirut...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 99
  },
  {
    "serial_number": "287634",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 97,
    "volume_number": 1,
    "text": "...the first and second editions, and the publisher of the second edition, Brother Al-Shawish, stated that explicitly in the introduction to the second edition. Abu Ghuddah is aware of it, as is explicit in his statement. His purpose behind this misleading is to divert people from what was attributed to him regarding his striving with the one in charge of the first edition in Beirut not to print the retraction referred to previously.\nFifthly: His saying: ‘And far be it that they cover up what issued from them with any interpretation or justification.’ I said: This is from the arrogance of this unjust fanatic and his denial of facts. He calls the clarification and explanation which the publisher printed in the introduction to the second edition a cover-up! If we wished to treat him with the likes of this action of his, we would have said that his authoring of this treatise of his ‘Words in Unveiling Falsehoods and Fabrications’ is only a cover-up for his falsehoods, fabrications, and swindling of people, and that would be enough. We would not have wasted time precious to us in uncovering it accompanied by evidence and proof as is the methodology of the Quran {Say, \"Bring your proof, if you should be truthful.\"} As for Abu Ghuddah, you see him launching his speech without restraint regarding the falsehoods and accusations he hurls at his opponent without attempting to support that with evidence. But in reality, he is excused in his own eyes, because he knows that he has no evidence for that; that is why he suffices with biting and squeaking?\n\nClarification of the Intent of the Footnote on ‘The Mukhtasar’ and the Claim of Some Hanafis regarding Isa, Peace Be Upon Him\nTo confirm that, I transfer to the noble readers the text of the word of the virtuous publisher, Mr. Zuhair Al-Shawish—may Allah reward him with good—in the introduction to the second edition, after he pointed to my comment which the unjust fanatic exploited. He said:",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 100
  },
  {
    "serial_number": "287635",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "‘The restriction in the commentary was to what the verifier (Al-Albani) saw as sufficient. However, those with agendas exploited that comment in the worst exploitation. The argument of the verifier therein is the refutation of the fanatics who emulated, by their speech and their fanaticism for their Imam and their Madhhab, the saying of the misguided ones who claimed that our Master the Messenger of Allah [Isa] (Isa son of Mary, peace be upon him, comes confirming what they are upon of disbelief in Allah and in Isa and his mother the Virgin. The reality is that the statement of the verifier was a refutation of what came in letters, fatwas, and sayings claiming that our Master Isa, peace be upon him, will rule by the Hanafi Madhhab when he descends at the end of time. They deduce that based on the story of a silly dream narrated by an unknown person who says that the sayings of his Madhhab remain preserved in a box in the Jayhun river, containing what Abu Hanifa taught Al-Khidr. Before Isa descends, the Quran and knowledge will be lifted, so Isa will go to the river confused, seeking knowledge from the river, and a hand will emerge for him holding the box of knowledge which Al-Khidr deposited in the river from what he learned from Imam Abu Hanifa, may Allah's mercy be upon him). This is what the verifier refuted with one brief line, the meaning of which the people of knowledge know, thinking that this refutation would be an aid to them in deducing with the Hadith of the Prophet, peace and blessings of Allah be upon him: “How will you be when he descends...”’—so he mentioned the Hadith—and the preceding comment upon it. Then the brother, publisher of the second edition, said: ‘Among those who narrated the story of the river, Al-Khidr, and Abu Hanifa is Imam Al-Haskafi, who is among the senior men of the Madhhab of Imam Abu Hanifa, may Allah have mercy on him, in the introduction of his famous book (Al-Durr Al-Mukhtar), upon which the footnote of Ibn Abidin was placed; [it is] the greatest of the books of the Hanafis in the later ages, rather it is one of the most important references for Islamic jurisprudence as a whole. The verifier avoided mentioning the story in detail, because pursuing...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 101
  },
  {
    "serial_number": "287636",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "...the slips of scholars is of what we were forbidden from, and he sufficed with refuting the fabrication to those who knew it. By that, he prevented the spreading of what indicates relying in beliefs and rulings on dreams and incorrect sayings, as some do. If those who exploited the comment and acted according to it had realized that, it would have been better for them.’\nSixthly: He said following what preceded: ‘And this statement of theirs implied: “That Hanafi Fiqh and the like” is not from our Sharia and is not from the Book and the Sunnah.’\nI say: This is a repetition of his preceding saying: ‘And they removed them from the circle of our Sharia...’ The lying and misleading therein, and the correct view which we believe regarding the Madhhabs—and whether it is said they are from the Sharia absolutely or not—has already been explained, so there is no need for repetition.\n\nA Question to ‘Abu Ghuddah’: Will He Answer?\nBut I want to ask this fanatic who tries to fish in troubled waters: The concept of this speech of yours...—and the concepts of books are considered valid according to the Hanafis—is that Hanafi Fiqh is entirely from the Book and the Sunnah. So do you say this?! If you answer in the negative, then you have come to my saying, so what do you deny of me?! And if you answer in the affirmative, you have revealed your misguidance and contradiction! As for the misguidance, it is that in the Hanafi Madhhab—like other Madhhabs—there are many issues contrary to the evidences of the Book and the Sunnah as previously explained and supported by the words of Ibn Daqiq al-Eid. So if you say: ‘They are from the Book and the Sunnah,’ you have attributed difference, contradiction, and error to the Sharia, and Allah Almighty and Exalted says {If it had been from [any] other than Allah...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 102
  },
  {
    "serial_number": "287637",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "...they would have found within it much contradiction}. There is no misguidance beyond that misguidance. As for the contradiction, it is that you admitted in your ‘Words’ (p. 44) that in ‘every Madhhab there are odd branches which are not acted upon.’ So how can it be said: That Hanafi Fiqh is entirely from our Sharia while it contains oddities that are not acted upon?! Does anyone utter the likes of this except a fool who does not know what comes out of his mouth? Then he does not suffice with this stupidity until he adds another to it, denouncing the one who denies that everything in Hanafi Fiqh is from the Islamic Sharia! I say this, and I do not rule it out for such a fool (1) to combine contradictories in his mind. For sometimes he speaks what is correct, like his admission of the existence of odd branches in the Hanafi Madhhab that are not acted upon. And sometimes he says what reminds us of the major misguidance which says: ‘Every Mujtahid is correct’ and that the Madhhabs, with the wide difference between them, are like multiple Sharias; there is no harm on a Muslim to take from whichever of them he wills and leave what he wills, for all is Sharia (2). For he commented on the saying of Sheikh Al-Qari in ‘Fath Bab Al-Inayah’ (1/261): ‘And one prays on a garment whose lining is impure according to Muhammad, and according to Abu Yusuf it is not permissible.’ Then he quoted from the footnote of Ibn Abidin that he said: The apparent meaning of ‘Al-Bada’i’ is preferring the saying of Muhammad, and it is the most similar [to the truth], but in ‘Al-Hashiyah’ he preferred the saying of ‘Abu Yusuf’. Abu Ghuddah said: ‘So the two sayings are preferred; acting upon either of them is permissible’! Does this not indicate that Abu Ghuddah sees that the contradictory sayings...",
    "foot_note": "1. (1) He is the fool. \n2. See ‘Sifat al-Salat’ p. 44-49.",
    "book_id": "133365",
    "new_page_number": 103
  },
  {
    "serial_number": "287638",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "...—and how many they are in his Madhhab—are all Sharia, and it is permissible to act upon whatever you wish of them? Someone might say: Perhaps this is specific to what was of difference within the Hanafi Madhhab only! I say: No, for I saw him prefer the Madhhab of Imam Malik regarding the permissibility of a menstruating woman and a woman in post-natal bleeding reading the Quran and touching the Mushaf for learning and teaching, and the permissibility of a person in a state of major ritual impurity (Junub) reading what is customary to seek refuge with, like Ayat al-Kursi, Surah Al-Ikhlas, and the two Surahs of Refuge (Al-Mu'awwidhatayn) upon fear or sleep... etc., of what he explicitly permitted contrary to his Hanafi Madhhab which does not permit that. He concluded his speech by saying: ‘And in this is from the tolerance of Islam and its spaciousness in facilitating the maintenance of performing the litanies required of the believer to read upon his sleep, even if he is Junub or menstruating or in post-natal bleeding’ (1). So I say: But in your Hanafi Madhhab—which you worship Allah by—is the opposite of what you mentioned of tolerance and facilitation, and it is by your admission (p. 40) nothing other than the Islamic Sharia which is the Book and the Sunnah. So is Islam according to you two religions, one of them ease and the other hardship?! So take lesson, O people of vision.\nAnd now, after this clarification and before moving to the refutation of him regarding the...",
    "foot_note": "1. (1) From his commentary on ‘Fath Bab Al-Inayah’ (1/218). I say: If any of the Salafis had chosen such an opinion contrary to his Madhhab, Abu Ghuddah would have shouted and his jugular veins would have swelled out of zeal for his Madhhab and attacking the supporters of the Sunnah for their Ijtihad and their contradiction of their Madhhab. We have mentioned previously his attack in the Friday sermon against them for such contradiction. But as for him, if he performs Ijtihad and contradicts, it is permissible. So, what is not permissible for others is permissible for him! Is this not what confirms our previous description of him as weighing with two scales and measuring with two measures?",
    "book_id": "133365",
    "new_page_number": 104
  },
  {
    "serial_number": "287639",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "...last of what he uttered of falsehood and ignorance, I want to ask the unjust fanatic for his opinion on the following:\n1 - We believe that Isa, when he descends, will rule by the Book and the Sunnah, and not by a Madhhab of the four Madhhabs. So do you believe that with us, or do you believe the opposite which we refuted in our brief comment?\n2 - We believe that in every Madhhab of the Madhhabs there is right and wrong, and there is no Madhhab infallible from error. So do you believe this with us, or do you say: Your Hanafi Madhhab is all correct, and the Madhhab of others is all wrong?\nIf you say in both of the questions in agreement with what we hold, then it has become apparent to the readers that your refutation of us is merely disputing with falsehood and fishing in troubled waters out of malice, envy, and seeking ingratiation with the common folk who think, because of people like you, that the follower of a Madhhab is more deserving of being followed, and that the truth* is multiple, and in all that they say: ‘And all of them are seeking from the Messenger of Allah.’\nAnd if your answer is contrary to our belief, then you are at that time, along with your misguidance, contradictory as previously explained. So we ask Allah for guidance to the truth and noble character!\nI add now and say: Abu Ghuddah said in his commentary on ‘Al-Tasrih bima Tawatara fi Nuzul al-Masih’ (p. 58): ‘And the scholar Al-Alusi said in his Tafsir: “Then indeed Isa, peace be upon him, when he descends, remains upon his previous prophethood; he is not removed from it in any case. However, he does not worship by it because of its abrogation in his right and the right of others. His obligation is with the rulings of this Sharia, in principles and branches. So there will be no revelation to him, peace be upon him, nor establishing of rulings. Rather, he will be...",
    "foot_note": "1. * (because of people like you, that the follower of a Madhhab is more deserving of being followed, and that the truth) fell out of the second edition, and I retrieved it from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 105
  },
  {
    "serial_number": "287640",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "...a successor to the Messenger of Allah, peace and blessings of Allah be upon him, and a ruler among the rulers of his nation among his Ummah by what he knew in the heaven before his descent of his Sharia [Muhammad’s], upon him be blessings and peace, as is in some reports”.’ Abu Ghuddah quoted this and approved it and did not critique it with anything, which indicates in its totality that he has accepted it for himself as a Madhhab. Based on this, is not the meaning of that that Isa, upon him be blessings and peace, will not rule by the Hanafi Madhhab nor by others, but rather he will rule by the Book and the Sunnah? So what do you resent from us, may Allah paralyze your hand and cut your tongue?!\n\nSeventhly and Finally: He said—may his mouth be smashed—(p. 43): ‘And they have distributed their poisons and their attacks on the followed Imams in numerous books... to achieve the goal they seek, and without the secrets of their souls which they harbor being exposed, while pretending with it jealousy for the Book and the Sunnah. For they said in the book “Hijab al-Mar’ah al-Muslimah” (p. 61) the following: The Shafi’is reasoned strangely, for they said: As for if the color—meaning the color of the Awrah in prayer—(1) is covered and the [volume of] the limbs is described, there is no harm, as if one wore tight trousers.’ They said: And it is recommended that the woman prays in a ample shirt and a veil, and takes a thick outer garment (Jilbab) over her clothes so that it hangs away from her, and the size of her limbs is not distinguished. Al-Rafi’i mentioned it in his explanation (4/92, 105 with Sharh al-Muhadhdhab). Their speech ended. Then they commented on it by their saying literally:",
    "foot_note": "1. (1) This addition is from Abu Ghuddah for clarification and explanation, and the correct phrasing is to say: ‘meaning the color of the Awrah in prayer’.",
    "book_id": "133365",
    "new_page_number": 106
  },
  {
    "serial_number": "287641",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "‘I said: So based on this opinion of theirs, it is permissible for a woman today to go out wearing these tight clothes that stick to the body and describe it accurately, to the point that one who is far from her imagines that she is naked! Like these flesh-colored stockings that describe the volume of the shins and thighs and increase them in beauty, nay, the trousers which describe the member itself! If a woman wore such clothing, it would be permissible for her according to them because she covered the color with it, even if the woman gave a color more beautiful than her natural color! So does a Muslim say of the permissibility of this today?! This is among the many proofs for the obligation of Ijtihad and abandoning blind imitation. Is there any who will remember?!’ Their speech ended literally.’\nI say: Thus did this unjust, spiteful, foolish fanatic use these words which he quoted from me as evidence for what he claimed of attacking the followed Imams... etc. of his speech which he presented before it (a trait we know from Akhzam). The one who contemplates this action of his cannot understand from it except one of two matters:\nThe First: That he does not agree with me on what I went to regarding the obligation of the covering garment being loose and ample, not tight such that it delineates the Awrah. And he sees, imitating the Shafi’is, that there is no harm in wearing tight trousers. Consequently, he holds the view I compelled them with: the permissibility of these tight clothes which stick to the body and describe it... etc., because they covered the color. This is what I do not think he holds if there remains with him an atom of intellect and religion! If this is what he means, let him declare it so we may refute him from his Madhhab, if the corruption and temptation resulting from wearing these tight clothes does not convince him of its error...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 107
  },
  {
    "serial_number": "287642",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "...and the correctness of what I went to. For it came in ‘The Chapter of Prohibition and Permissibility’ from the footnote of Ibn Abidin (5/242) after quoting some quotes from the Hanafi scholars regarding tight clothes: ‘And based on this, it is not lawful to look at the Awrah of another over a garment sticking to it describing its size.’\n\nHis Thinking That Declaring Error is suspicion of the One in Error, and the Refutation of Him with the Sayings of Scholars\nAnd the other: That he agrees with me on that, but he does not see it correct to openly declare the error of the Shafi’is in their saying of non-obligation, or he sees that declaring error means attacking the opponents. If this is what he means—and this is what is preponderant to me—then this is from his extreme ignorance, or from his cold piety. For declaring error does not necessitate attacking the one in error due to Ijtihad except according to the ignorant. Because the one in error has a single reward as the Messenger, peace and blessings of Allah be upon him, declared, and according to the likes of His saying, the Exalted: {There is no blame upon you for that in which you have erred}. So how can it be imagined that two contradictory beliefs combine in the mind of a Muslim at one time: the one in error is rewarded and attacked?! Among the chapters of Al-Hafiz Ibn Abd al-Barr in his book ‘Jami’ Bayan al-Ilm wa Fadlih’: ‘Chapter: Mentioning the evidence in the sayings of the Salaf that difference consists of error and correctness, necessitating seeking proof regarding it, and mentioning some of what they declared each other in error regarding, and what some of them denied of others when they differed.’ Here I am quoting for the noble reader some texts which Al-Hafiz cited in the mentioned chapter, shortening the chains of narration to clarify for him the status of this unjust attacker regarding knowledge of the sayings of the scholars...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 108
  },
  {
    "serial_number": "287643",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "...and their Madhhabs, even if he pretends to be polite with them, but it is a cold politeness which they would not approve from anyone because it is contrary to the etiquette of the Salaf with one another!\n1 - From Sa’id bin Jubayr, he said: I said to Ibn Abbas: Indeed Nauf Al-Bikali claims that Moses, the companion of Al-Khidr, is not the Moses of the Children of Israel! He said: He lied!\n2 - And Aisha rejected the saying of [Ibn] Umar: The dead is tormented by the weeping of his family over him, and she said: Abu Abd al-Rahman was deluded or erred.\n3 - And it was raised to Ali bin Abi Talib that Shuraih judged regarding a man who found a fugitive slave and took him, then he escaped from him: That he guarantees the slave. So Ali said: Shuraih erred and judged poorly. Rather, he swears by Allah that he escaped from him while he did not know, and there is nothing upon him.\n4 - And Waki’ narrated from Isma’il bin Abd al-Malik, he said: I asked Sa’id bin Jubayr about a daughter and a cousin, one of whom is a maternal brother? He said: For the daughter is the half, and what remains is for the cousin who is not a maternal brother. He said: And I asked Ata? He said: Sa’id bin Jubayr erred. For the daughter is the half, and what remains is between them in halves.\n5 - And Abd al-Razzaq mentioned from Ibn Uyaynah from Isma’il bin Abi Khalid, he said: I said to Al-Sha’bi regarding that Ibrahim said about a man who has a debt owed by a man to a term, so he reduces some for him and hastens some: That there is no harm in it, but Al-Hakam disliked it? So Al-Sha’bi said: Al-Hakam was correct and Ibrahim erred.\n6 - And it was said to Sa’id bin Jubayr that Al-Sha’bi says: Umrah is...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 109
  },
  {
    "serial_number": "287644",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "...voluntary. He said: Al-Sha’bi erred.\n7 - And the saying of Shuraih regarding the writer (Mukatab) was mentioned to Sa’id bin al-Musayyib, so he said: Shuraih erred.\n8 - And Hammam narrated from Qatada that Iyas bin Mu’awiyah permitted the testimony of a man and two women in divorce. Qatada said: So Al-Hasan was asked about that and he said: The testimony of women is not valid in divorce. He said: So I wrote to Umar bin Abd al-Aziz with the saying of Al-Hasan and the judgment of Iyas. So Umar wrote: Al-Hasan was correct and Iyas erred.\nAbu Umar Ibn Abd al-Barr said: This is frequent in the books of scholars, and likewise is the difference of the Companions of the Messenger of Allah, peace and blessings of Allah be upon him, and the Followers and those after them among the successors. What some of them rejected of others can hardly be encompassed by a book, let alone be collected in a chapter. In the returning of the Companions of the Messenger of Allah, peace and blessings of Allah be upon him, to one another, and the rejection of some of them against others, is a clear proof that difference according to them is error and correctness. If correctness was in two conflicting aspects, the Salaf would not have declared one another in error in their Ijtihad, their judgments, and their fatwas. Reason refuses that a thing and its opposite be both correct. And he excelled who said:\nAffirming two opposites together in a state ... is the ugliest of what comes of impossibilities.\nAnd Ashhab said: I heard Malik saying: The truth is but one. Two different sayings cannot be both correct. The truth and correctness are but one. Ashhab said: And Al-Layth says the same*.\nAbu Umar said: Difference is not a proof according to anyone I know of the jurists of the Ummah except one who has no insight and no knowledge with him, and there is no proof in his saying.",
    "foot_note": "1. * It came in the second edition: (to his death with his hoof) instead of (but one. Ashhab said: And Al-Layth says the same), and the established text is from the first edition of the book. [Preparer of the book for Al-Maktaba Al-Shamila]",
    "book_id": "133365",
    "new_page_number": 110
  },
  {
    "serial_number": "287645",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "I said: And the basis for the Companions and those after them declaring error of one another, without any discomfort, is the Messenger of Allah, peace and blessings of Allah be upon him. For he is the one who established that for them. It is proven in the two Sahihs and others from the Hadith of Ibn Abbas that the Prophet, peace and blessings of Allah be upon him, said to Abu Bakr Al-Siddiq after he interpreted a vision for a man: “You were right in some, and you erred in some.” Such declaration of error did not have any bad effect in their hearts, firstly due to their safety from rancor and suspicion, and secondly due to their knowledge that it does not necessitate any of the attack which is not befitting the right of a Muslim. This is unlike these fanatics whose hearts are filled with hatred and malice against the People of the Sunnah and suspicion of them. The Sunni hardly utters a word of truth as advice, reminder, and teaching, except that the enemies of the Sunnah hasten with their malice and suspicion to interpret it as its opposite. And upon this Abu Ghuddah proceeded in his “Words”, {And those who have wronged are going to know to what [kind of] return they will be returned}.\nFrom what preceded, you know that Abu Ghuddah has returned as a loser and disappointed with this final arrow he directed at me, his state in it being his state in all the arrows and attacks whose exposure and directing back at him has preceded. And such is the state of every sinful aggressor who thinks that by his plotting and scheming he only harms others and blows his poison into them, while the reality is that by that he is like one striving for his death with his own hoof.\nI ask Allah the Exalted to discipline us with the etiquettes of Islam, and to character us with the morals of the sincere, truthful believers, whose hearts Allah has purified...",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 111
  },
  {
    "serial_number": "287646",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Unveiling the Falsehoods and Fabrications in Abu Ghuddah's 'Words'",
    "edition": "Second, 1398 AH - 1978 AD",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "...from malice, envy, hypocrisy, schism, and bad morals. Indeed He is the best One asked. And Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You, I ask Your forgiveness and I repent to You.\nDamascus/ 18 Rabi’ al-Thani 1395\nAnd written by Muhammad Nasir al-Din al-Albani",
    "foot_note": "None",
    "book_id": "133365",
    "new_page_number": 112
  }
]