[
  {
    "text": "الرسالة المصرية\nالمؤلف: أبو الصلت أمية بن عبد العزيز الأندلسى\nسنة الوفاة: 528",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الرسالة المصرية",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 1
  },
  {
    "text": "sn: 6883\nbook_title: الرسالة المصرية [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/957\nbook_id: 957\nauthor_name: أبو الصلت أمية بن عبد العزيز الأندلسى\nauthor_year: 528\nnickname: أبو الصلت\nauthor_link: https://shamela.ws/author/1089\nauthor_ID: 1089\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الرسالة المصرية",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 2
  },
  {
    "serial_number": "6271018",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: البلدان والرحلات الكتاب : الرسالة المصرية [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : أبو الصلت أمية بن عبد العزيز الأندلسى ( 470 - 528 هـ ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالكتاب : الرسالة المصرية [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : أبو الصلت أمية بن عبد العزيز الأندلسى ( 470 - 528 هـ ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : أبو الصلت أمية بن عبد العزيز الأندلسى ( 470 - 528 هـ ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالمؤلف : أبو الصلت أمية بن عبد العزيز الأندلسى ( 470 - 528 هـ ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nعدد الصفحات : 52 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتاريخ النشر بالشاملة : 5 محرم 1444",
    "foot_note": "None",
    "book_id": "957",
    "new_page_number": 3
  },
  {
    "serial_number": "6271019",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 5,
    "volume_number": 1,
    "text": "الرسالة المصرية لأبي الصلت أمية بن عبد العزيز الأندلسي 470 - 528",
    "foot_note": "None",
    "book_id": "957",
    "new_page_number": 4
  },
  {
    "serial_number": "6271020",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 6,
    "volume_number": 1,
    "text": "مقدمة نزح كثيرون من رجال الأندلس إلى الشرق طلباً للعلم أو المال أو الجاه، أو رغبة في أداء فريضة الحج، وكان من أولئك النازحين إلى مصر رجل جمع إلى الأدب الحكمة، وإلى الطب التنجيم والموسيقى والرياضة، والبراعة في علم الحيل. هذا الرجل هو أبو الصلت أمية بن عبد العزيز بن أبي الصلت، المولود في مدينة دانية، من بلاد الأندلس سنة 470 هـ. قدم أبو الصلت إلى الإسكندرية ومعه أمه - فيما يروى ابن خلكان - سنة 487، أي في أيام الخليفة الفاطمي المستنصر بالله أبي تميم معد بن الظاهر بالله على بن الحاكم بأمر الله؛ ووزيره إذ ذاك والقائم بأمر دولته الأفضل شاهنشاه ابن أمير الجيوش بدر الجمالي الأرمني. وكان يأمل أبو الصلت من وراء رحلته هذه بسطةً في العيش، وثراء من المال، كما أشار إلى ذلك في صدر رسالته. ويبدو أنه ظل دهراً خاملاً يتحين الفرص، إلى أن أتيح له أن يتصل بأحد المقربين إلى الوزير الأفضل (1) ، في أيام الخليفة الآمر (2) ، وذلك الرجل هو تاج المعالي مختار (3) ، فخدمه بصناعتى الطبّ",
    "foot_note": "1. بدأت وزارة الأفضل للمستنصر الفاطمي سنة 487 بعد وفاة أبيه بدر الجمالى، ثم وزر للمستعلى باللّه أحمد سنة 488، ثم للآمر بأحكام اللّه سنة 496. وقد استبد بهؤلاء الخلفاء جميعا إلى أن تمكن منه الآمر ودبر مقتله، فقتل سنة 515. النجوم الزاهرة (5: 222). \n2. هو الآمر بأحكام اللّه منصور بن المستعلى باللّه أحمد بن المستنصر باللّه. ولد في سنة 490 واستخلف وله خمس سنين، وقيل سنة 524. انظر النجوم الزاهرة (5: 17) والخطط المقريزية عند ذكر «الجامع الأقمر». \n3. معجم الأدباء (7: 54).",
    "book_id": "957",
    "new_page_number": 5
  },
  {
    "serial_number": "6271021",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 7,
    "volume_number": 1,
    "text": "والتنجيم، فأعجب به، ووصفه بحضرة الأفضل وأثنى عليه، وكان كاتب الأفضل ينفس عليه ذلك، ويخشى بأس تاج المعالي، وحدث أن تتابعت من تاج المعالي السقطات فأدى ذلك إلى أن يقبض عليه الأفضل ويعتقله، فيجد كاتب الأفضل الفرصة سانحة للقضاء على أبي الصلت، فيختلق له ما يدفع الأفضل إلى أن يلقى به في سجن المعونة (1) بمصر، مدة ثلاث سنين وشهر (2) ، بعد الذي دبج فيه من المدائح والشعر (3) . ويروى ابن أبي أصيبعة في طبقات الأطباء. أن دخول أبي الصلت إلى مصر كان في حدود سنة 510 هـ، وأنه حبس في الإسكندرية في خلافة الآمر بأحكام الله ووزارة الأفضل (4) . فإن صحت هذه الرواية كانت سنداً في أن أبا الصلت ورد مرة أخرى بعد وفاة ولي نعمته أبي الطاهر يحيى بن تميم بن المعز ابن باديس (5) المتوفى سنة 509، وهي سنة خروجه من مصر.",
    "foot_note": "1. ذكر المقريزي هذا السجن عند ذكر الدار المأمونية المنسوبة إلى المأمون البطائحي. قال: «وكان بجوار الدار المأمونية حبس المعونة». ثم قال: «ولم يزل هذا الموضع سجنا مدة الدولة الفاطمية، ومدة دولة بنى أيوب، إلى أن عمره الملك منصور قلاوون قيسارية أسكن فيها العنبرانيين في سنة 680». وقال: «وكان حبس المعونة هذا يحبس فيه أرباب الجرائم \n…. وأما الأمراء والأعيان فيسجنون بخزانة البنود». والدار المأمونية هي المعروفة بالمدرسة السيوفية. \n2. وقد روى المقرى في نفح الطيب (1: 530 ليدن) رواية عجيبة: أن عمر أبى الصلت 60 سنة، منها 20 في أشبيلية، و 20 في أفريقية عند ملوكها الصنهاجيين، و 20 في مصر محبوسا في خزانة الكتب. \n3. انظر بعضها عند ابن أبي أصيبعة (2: 53، 56). \n4. ذكر ابن أبي أصيبعة سبب حبسه في الإسكندرية: أن الأفضل طلب إليه أن يعمل الحيلة في رفع مركب غارق في البحر، فاجتهد أبو الصلت، ولكنه حينما قارب النجاح خانه جده، فهبط المركب إلى قعر البحر، بعد ما كبد الدولة خسائر فادحة، فحبسه الأفضل لذلك. \n5. ملك أبو الطاهر يحيى بن تميم، المغرب سنة 501 واستقر في ملكه إلى أن توفى سنة 509. انظر تاريخ طرابلس الغرب لابن غلبون (ص 39 - 40).",
    "book_id": "957",
    "new_page_number": 6
  },
  {
    "serial_number": "6271022",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 8,
    "volume_number": 1,
    "text": "ضاق أبو الصلت ذرعاً بمصر، وما لقى فيها من الخيبة والعنت. قال القفطي (1) : «ودخل مصر في أيام أفضلها فلم ينل منه إفضالاً، وقصده للنيل فلم يجد لديه نوالاً». فحينئذ شد رحاله إلى المغرب في سنة 506، واستعاد صلته بحضرة أبي الطاهر يحيى بن تميم بن باديس، الذي وضع له هذه «الرسالة المصرية». يصف له فيها ما عاينه في مصر وما عاناه، وتناول في هذه الرسالة القيمة: 1 - الوصف البلداني للديار المصرية ونيلها. 2 - ثم أخذ في تصوير جمال ربوعها ومغانيها تارة بالشعر وأخرى بالنثر. 3 - وعقب على ذلك بالكلام في سكانها وأجناسهم ومذاهبهم وأخلاقهم وعقائدهم، منذ عهد الفراعنة إلى ظهور الإسلام. 4 - وتحدث بعد ذلك فيما تحتويه من الآثار العجيبة، كالهرمين والبرابي. 5 - وذكر عواصم مصر في القديم والحديث. 6 - وقدامى العلماء من اليونان والروم، مستطرداً بذلك إلى ندرة من لقيه بمصر من المشتغلين بالعلم والحكمة والطب. 7 - وعجب من جهل من لقي بها من الأطباء، ونوه بفضل بعض الأطباء البارعين. 8 - وتحدث في ولوع المصريين بأحكام النجوم وكثرة استعمالهم لها، وأورد في ذلك نوادر وطرائف. 9 - ثم عرج على ذكر من لقيه بها من الأدباء والظرفاء. فهذه الرسالة تضرب بأسباب إلى علوم وفنون شتى، وتعدّ اليوم كما عدت",
    "foot_note": "1. انظر أخبار العلماء للقفطى (ص 57) طبع السعادة.",
    "book_id": "957",
    "new_page_number": 7
  },
  {
    "serial_number": "6271023",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 9,
    "volume_number": 1,
    "text": "بالأمس، وثيقة يرجع إليها البلداني، والمؤرخ، وباحث الآثار، والاجتماعي، والحكيم، والطبيب، والمنجم، والأديب. هذه الرسالة الصغيرة الحجم العظيمة القدر كانت متعارفة متداولة بين كبار العلماء والمؤرخين، ثم أضحت نادرة مجهولة، إلى أن تمكن المغفور له العلامة أحمد تيمور باشا - طيب الله ثراه - من اقتنائها في مكتبته الخاصة، وهي برقم 601 أدب. وعلى هذه النسخة الوحيدة في العالم - كما يتضح من مراجعة فهارس بروكلمان (1) - أعتمد في نشر هذه الرسالة الفريدة، التي أورد طرفاً منها ياقوت في «إرشاد الأريب»، والعماد في «الخريدة»، والقفطي في «إخبار العلماء»، وابن أبي أصيبعة في «عيون الأنباء»، والأسعد بن مماتي في «قوانين الدولة»، والمقرى في «نفح الطيب»، والمقريزي في «الخطط»، والأدفوى في «الطالع السعيد»، والسّيوطى في «حسن المحاضرة»، كما سيتضح لك عند تحقيق نصوصها. ولأبي الصلت غير الرسالة المصرية «كتاب الحديقة» على أسلوب «يتيمة الدهر» للثعالبي، وقد نقل منه العماد في «الخريدة». وله أيضاً «الأدوية المفردة» وهو محفوظ في مكتبة بودليان؛ و «رسالة في العمل بالأسطرلاب» في برلين وليدن وبودليان، و «تقويم الذهن» في المنطق، بمكتبة الإسكوريال، و «أوراق من كتاب في الفلك» بالإسكريال، و «كتاب في المعاني المختلفة للفظة نقطة» في مكتبة ليدن، و «قصيدة» بمكتبة برلين.",
    "foot_note": "1. انظر بروكلمان (1: 486 - 487) وملحقه الأول (ص 889). على أنني عثرت فيما بعد على قطعة من الرسالة المصرية في دار الكتب المصرية برقم 354 تاريخ، سأنبه على موضع بدئها ونهايتها في الحواشى.",
    "book_id": "957",
    "new_page_number": 8
  },
  {
    "serial_number": "6271024",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 10,
    "volume_number": 1,
    "text": "وقد صنف معظم هذه الكتب وهو في اعتقال الأفضل بمصر، كما نص ابن خلكان. انتهت أيام أبي الصلت في المهدية، وقد اختلف المؤرخون في سنة وفاته، فقيل سنة 520 وقيل سنة 528 (1) . وإليك الرسالة:",
    "foot_note": "1. انظر ترجمته عند ياقوت (7: 52) وابن خلكان (1: 80) والقفطي (57) والمقرى (1: 520) وابن أبي أصيبعة (2: 52).",
    "book_id": "957",
    "new_page_number": 9
  },
  {
    "serial_number": "6271025",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 11,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم قال الشيخ أبو الصلت أمية بن عبد العزيز بن أبي الصلت رحمه الله تعالى: كنت إبان عصر الشباب مونق، وغصن الصّبا مورق. إذ لمتي مسودة … ولماء وجهي رونق (1) ممن سامحه الدهر بغفلة من غفلاته، وتجافى له عن غفوة من غفواته، فعاش آمن السرب، سائغ الشرب، لا يتفرغ من أدب يرود رياضه، ويرد حياضه، إلا إلى طرب يعمر ميدانه؟؟؟، ويسحب ذيوله وأردانه. ثم تلون فقلب لي ظهر مجنه، وسقاني دردى دنه، فتدارك ما أغفله، واسترد ما بذله، واضطررت إلى مفارقة الوطن، والخروج عن العطن، فتماسكت إشفاقاً من مفارقة أول أرض مس جلدي ترابها، وشدت على التمائم بها (2) . وجاءت أمور لا تطاق كبار، فلما لم يمكن القرار، ولم يبق إلا الفرار، قلت: ليس لي إلا أن أرمي بنفسي كل مرمى، وأطرحها كل مطرح. لأبلغ عذرا أو أنالَ رغيبة … ومبلغ نفس عذرها مثل منجح (3) وسكت إلى البيت المشهور:",
    "foot_note": "1. اقتبسه من قول أبى الطيب المتنبي وتصرف فيه: ولقد بكيت على الشباب ولمتى \n…. مسودة ولماء وجهي رونق \n2. اقتباس من قول رقاع بن قيس الأسدي: بلاد بها نيطت على تمائمى \n…. وأول أرض مس جلدي ترابها اللسان (نوط) وأمالي القالى (1: 83). \n3. اقتبسه كذلك من قول عروة بن الورد، ورواه أبو تمام في الحماسة (1: 188): ومن يك مثلي ذا عيال ومقترا \n…. من المال يطرح نفسه كل مطرح ليبلغ عذرا أو يصيب رغيبة \n…. ومبلغ نفس عذرها مثل منجح",
    "book_id": "957",
    "new_page_number": 10
  },
  {
    "serial_number": "6271026",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 12,
    "volume_number": 1,
    "text": "تلقى بكل بلاد إن حللت بها … أهلاً بأهل وأوطاناً بأوطان (1) وإن كان يقول العامة: ليس بين بلد وبلد نسب، فخير البلاد ما حملك - فجعلت أستقري البلاد لأتيمم أوفقها للمقام، وأعونها على مقارعة الأيام، فكانت مصر مما وقع عليه إختياري، وصدقت حسن ظني قبل اختباري، وسرت قاصداً إليها أعتسف المجاهل والتنائف، وأخوض المهالك والمتالف، فطوراً أمتطي كل حالكة الإهاب (2) ، مسودة الجلباب، ثابتة كصبغة الشباب، قد فسح ميدانها، ووضع براحة الريح عنانها، فجرت جري الطرف الجموح، وفاتت مدى الطرف الطموح؛ وطوراً كل نقب الأياطل، كالهياطل (3) ، سبط المشافر جعد الأشعار، أحتذى العقيق، أو الصنو الشقيق، إن علاقات ظليم خاضب، وإن هوى قلت شهاب ثاقب، يصل الذميل بالوخاد (4) ، وبلتهم التهائم والنجاد. فكم جزع واد جزعته، وجلباب ليل أدرعته، وكم بر خرقت مخارمه وفجاجه، وبحر شققت غواربه وأمواجه، وليس لي غير مصر مقصد، ولا وراءها مذهب، ولا دونها للغنى متطلب. وكم في الأرض من بلد ولكن … عليك لشقوتي وقع اختياري فلما تغمّرت ركابي من النيل، واستذرت بظل المقطم، ألقيت عصا التسيار، واستقرت بي النوى، وخفت ظهورهن من الرحال، وأرحتهن من الحل والترحال، وقلت: ضالتي المنشودة، وبغيتي المقصودة، هاهنا ألبث وأقيم،",
    "foot_note": "1. البيت من أبيات في الحماسة (1: 98). وقبله: لا يمنعنك خفض العيش في دعة \n…. نزوع نفس إلى أهل وأوطان \n2. يعنى السفينة. \n3. إنما نقبت أياطله من إدمان السير. والنقب، هنا: تنفط الجلد. والهياطل: جمع هيطل، وهو الذئب؛ يشبه به الفرس في شدة العدو. وفي الأصل: «نقب الأياطيل كهياطيل». \n4. المسموع في مصدر وخد هو الوخد والوخدان.",
    "book_id": "957",
    "new_page_number": 11
  },
  {
    "serial_number": "6271027",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 13,
    "volume_number": 1,
    "text": "فلا أبرح ولا أريم، «بلذة طيبة ورب غفور». وحيث التفت فروضه وغدير، وخورنق وسدير، وظل ظليل، ونسيم عليل. وكم تمنيت أن ألقى بها أحداً … يسلى من الهم أو يعدى على النوب (1) فما وجدت سوى قوم إذا صدقوا … كانت مواعيدهم كالآل في الكذب (2) وكان لي سبب قد كنت أحسبني … أحظى به فإذا دائي من السبب فما مقلم أظفاري سوى قلمي … ولا كتائب أعدائي سوى كتبي (3) ولم تطل مدة اللبث حتى تبينت بما شاهدته أنى فيها مبخوس البضاعة، موكوس الصناعة، مخصوص بالإهانة والإضاعة؛ وأن عيشها الرغد، مقصور على الوغد، وعقابها المر، موقوف على الحر، فلو تقدمت فعلمت ذلك لخف عنها مركبي (4) وصرفت إلى سواها وجه مطلبي، ولكان لي في الأرض مرمى شاسع، ومنتاب واسع، بل تثبطت، حتى تورطت، حتى عوملت بما يعامل به ذوو الجرائر والذنوب، وجرعت من المذلة بأوفى ذنوب. هذا مع ما حبرته من المدح التي اشتهرت شهرة الصباح، وهبت هبوب الرياح، ولهج بها الحادي والملاح (5) . فسار بها من لا يسير مشمراً … وغنى بها من لا يغني مغرداً إلا أن الله جلت آلاؤه، وقدست أسماؤه، تدارك برحمته فأزال تلك المحنة بالمنحة، ونسخ تلك النقمة بالنعمة، وختم بالوصول إلى حضرة الملك الأجل أبي الطاهر يحيى بن تميم بن المعز بن باديس، الذي لم تزل حضرته مصاد",
    "foot_note": "1. في الأصل: «من النوب»، صوابه في ياقوت (7: 80) والقفطي (57) وابن أبي أصيبعة (2: 60). وقد اقتبس هذه الأبيات من شعر له قديم، كما يفهم من رواية ابن أبي أصيبعة. \n2. في الأصل: «كالألف»، صوابه في ياقوت والقفطي وابن أبي أصيبعة. \n3. في الأصل «كتائب أعواني»، والصواب من المراجع. \n4. في الأصل: «فخف». \n5. انظر مديحه للأفضل في ابن أبي أصيبعة (2: 56).",
    "book_id": "957",
    "new_page_number": 12
  },
  {
    "serial_number": "6271028",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 14,
    "volume_number": 1,
    "text": "العناة (1) ، ومراد العفاة، ومجتمع الفضائل، ومنتجع الأفاضل، ومشرع الجود، ومشعر الوفود. فلما استترت بجناحه، واستظهرت باستماحه، أعذب لي بسماحة الدهر جناه، واعتذر لي مما جناه، فكف دوني كفه، وصرف عني صرفه. كريم رفضت الناس لما بلغته … كأنهم ما خف من زاد قادم فكنت فيما مضيت عليه، وآلت حالي إليه، من إشراقها بعد الأفول، وإيراقها بعد الذبول، كنصل أهمل أمره، من جهل قدره، ولما وقع إلى الخبير به صان صفحته وحده، وحلى حمائله وغمده، ثم ادخره فيما يدخر وأعده، فإن انتضاه، يوماً ارتضاه، وإن جرده، أحمده، وإن هزه، سره في الضريبة حزه. ولكن أبى الله أن يكون الفضل إلا لمن نشأ في مغارسه، ونجم في منابته، وربى في جحره، وغذى بدره. فلم أستسغ إلا نداه فلم يكن … ليعدل عندي ذا الجناب جناب فما كل إنعام يخف احتماله … وإن هطلت منه علىّ رباب (2) ولكن أجلّ الصنع ما جىّ ربه … ولم يأت باب دونه وحجاب وما شئت إلا أن أدل عواذلي … على أن رأيي في هواك صواب (3) وأعلم قوماً خالفوني فشرقوا … وغربت أني قد ظفرت وخابوا والأولى أن أضرب عما سلف، وأترك ما فرط، وآخذ فيما أجريت إليه وقصدته، ونحوته واعتمدته، مما آثرت به الحضرة السامية (4) - أدام الله",
    "foot_note": "1. المصاد: موضع الصيد. والعناة: جمع عان، وهو الأسير. \n2. الرباب: سحاب يركب بعضه بعضا، الواحدة ربابة. وفي الأصل: «لدى ولا منه على»، صوابه من ياقوت (7: 59)، وقافيته فيه «سحاب». \n3. البيت وتاليه للمتنبى في ديوانه (1: 127) برواية العكبري. \n4. في الأصل: «الشامية».",
    "book_id": "957",
    "new_page_number": 13
  },
  {
    "serial_number": "6271029",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 15,
    "volume_number": 1,
    "text": "سموها - من وصف ما عانيته من أرض مصر وعاينته، والاقتصار على الذي رأيته دون ما رويته، فليس من يقول: علمت هذا من طريق العلم والسماع، كمن يقول: تحققته بالمشاهدة والاطلاع، فإن ذا اللب الأمين لا ينخدع بمحال، ولا يرضى بانتحال. وأنا أبتدئ بذكر هذه البلاد وموقعها في المعمورة ومجرى النيل منها، وغنائه فيها، وأشفع ذلك بنبذ من ذكر أحوال أهلها في أخلاقهم، وسيرهم وعاداتهم، وما يتصل بذلك وينجرّ معه، ويجيء بسببه، ويدخل في تضاعيفه. وها أنا ذا آخذ في ذلك، وبالله أستعين، وعليه التوكل. (1) أرض مصر بأسرها واقعة من المعمورة في قسمي الإقليم الثاني والإقليم الثالث، ومعظمها في الثالث. وحكى المعتنون بأخبارها وتواريخها أن حدها في الطول (2) من مدينة برقة التي في جنوب البحر الرومي، إلى أيلة من ساحل الخليج الخارج من بحر الحبشة والزنج والهند والصين. ومسافة ذلك قريب من أربعين يوما. قالوا: وحدها في العرض من مدينة أسوان وما سامتها من الصعيد الأعلى المتاخم لأرض النوبة، إلى رشيد (3) وما حاذاها من مساقط النيل في البحر الرومي، ومسافة ذلك قريب من ثلاثين يوماً. ويكتنفها من مبدئها في العرض إلى منتهاها جبلان [أحدهما في الضفة الشرقية من النيل، وهو المقطم، والآخر في الضفة الغربية منه. والنيل منسرب فيما بينهما. وهما (4) ] أجردان غير شامخين، يتقاربان",
    "foot_note": "1. الكلام من هنا إلى كلمة «الاستقامة» نقله المقريزي في (1: 15 - 16). \n2. هذا تسجيل تاريخي بلدانى لما كانت عليه حدود مصر في عهده. \n3. في الأصل: «لأرض الشام ورشيد»، صوابه من الخطط. \n4. التكملة من الخطط.",
    "book_id": "957",
    "new_page_number": 14
  },
  {
    "serial_number": "6271030",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 16,
    "volume_number": 1,
    "text": "جداَ في وضعيهما، من لدن مدينة أسوان إلى أن ينتهي إلى الفسطاط، فثم تتسع مسافة ما بينهما وتنفرج قليلاً، ويأخذ المقطم منهما مشرقاً والآخر مغرباً على وراب في أخذيهما (1) وتفريج (2) في مسلكيهما، فتتسع أرض مصر من الفسطاط إلى ساحل البحر الرومي الذي عليه الفرماء (3) وتنيس ودمياط ورشيد والاسكندرية، وهناك تنقطع في عرضها الذي هو مسافة [ما بين] أوغلها في الجنوب و [أوغلها] في الغرب والشمال. وإذا ما مسحت بالطريق البرهانية في طريق هذه المسافة [من الأميال (4) ] لم تبلغ ثلاثين ميلاً (5) ، بل تنقص عنها نقصاً ما له قدر، وذلك لأن فضل ما بين عرض أسوان التي هي أوغلها في الجنوب وعرض مدينة تنيس التي هي أوغلها في الشمال، تسعة أجزاء ونحو سدس جزء من الأجزاء التي بها تحيط الدائرة العظمى، [وهي (6) ] ثلاثمائة وستون جزءاً. وليس بين طوليهما فضل يقع بسببه في هذا الحساب ماله قدر يعتد به. فإذا ضاعفنا هذا العدد بما يخص الدرجة الواحدة من محاذاة ذلك من الأميال، وذلك ستة وخمسون ميلاً وثلثا ميل على ما دل علية البرهان، كان ذلك (7) نحو خمسمائة وعشرين ميلاً بالتقريب، وذلك مسافة سير عشرين يوماً أو قريب من ذلك (8) . وفي هذه المدة من الزمان يقطع السفار أبدا ما بين هذين البلدين بالسير المعتدل في أكثر من ذلك قليلاً، لما في الطريق من التعريج وعدم الاستقامة (9) .",
    "foot_note": "1. في الخطط: «مأخذيهما». \n2. في الأصل: «وتعريج»، صوابه في الخطط. \n3. في الأصل: «الهرمان»، وتصحيحه من الخطط. \n4. هذه التكملة والتي قبلها من الخطط. \n5. في الأصل: «يوما»، ووجهه ما أثبت من الخطط. \n6. ليست في الأصل. \n7. في الأصل: «من ذلك». \n8. نقل عنه في النجوم الزاهرة (1: 36) أنها ثلاثون يوما \n9. إلى هنا ينتهى نقل المقريزي.",
    "book_id": "957",
    "new_page_number": 15
  },
  {
    "serial_number": "6271031",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 17,
    "volume_number": 1,
    "text": "وليس تشتمل أرض مصر بعد الفسطاط الذي هو مقر الملك وكرسي الدولة، على مدائن لها قدر في كثرتها ولا فخامتها، لكن أجل مدائنها وأفخرها أما في الجهة الشمالية من الفسطاط فالاسكندرية وتنيس ودمياط، وأما في الجهة الجنوبية إلى أقصى الصعيد فقوص وقفط. فهذه صفة أرض مصر على الجملة. (1) وأما النيل فينبوعه من وراء خط الاستواء، من جبل هناك يعرف بجبل القمر، فإنه يبتدئ بالتزيد في شهر أبيب (2) ، الذي هو بالرومية يولية (3) . والمصريون يقولون: «إذا دخل أبيب، كان للماء دبيب». وعند ابتدائه في التزيد (4) تتغير جميع كيفياته وتفسد، والسبب الموجب لذلك مروره بنقائع مياه آجنة (5) يخالطها فيجتلبها، ويستخرجها معه ويستصحبها، إلى غير ذلك مما يحتمل (6) . فتصير مثل الحال التي وصفه بها الأمير تميم بن المعز لدين الله: أما ترى الرعد بكى فاشتكى … والبرق قد أومض فاستضحكا (7) فاشرب على غيم كصبغ الدجى … أضحك وجه الأرض لما بكى (8) [وقد حكى العود أنين الهوى … لكنّه جوّد فيما حكى] (9)",
    "foot_note": "1. من هنا يبتدئ نقل آخر للمقريزي في (1: 59). \n2. في الخطط: «التزايد». والتزيد والتزايد بمعنى. \n3. ما بعد «أبيب» ليس في الخطط. وفي الأصل: «قوليه». \n4. في الخطط: «التزايد». \n5. في الأصل: «بنقاء مع مياه آجنة»، والصواب في الخطط. \n6. الكلام والشعر بعد هذا لم يورده المقريزي. \n7. في الأصل: «الجو من إظلامه قد اشتكى»، ولا يستقيم به الوزن، إذ هو من السريع. وأثبت ما في ديوان تميم الورقة (120) من مصورة دار الكتب ذات الرقم (16025 ز)، وهذه الرواية هي التي ذكرها الثعالبي في يتيمة الدهر (1: 349) الطبعة الأولى. \n8. في الأصل: «يشبه التحقيق كصبح» تحريف، وأثبت ما في الديوان ويتيمة الدهر. \n9. إثبات هذا البيت من ديوان تميم.",
    "book_id": "957",
    "new_page_number": 16
  },
  {
    "serial_number": "6271032",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 18,
    "volume_number": 1,
    "text": "وانظر لماء النيل في مده … كأنما صندل أو مسكا أو كما قال غيره من أهل العصر، من قصيدة يصف فيها أرض مصر: ولله مجرى النيل منها إذا الصّبا … أرتنا به في مرها عسكراً مجرا (1) فشط يهز السمهرية ذبلا … وموج يهز البيض هندية تبرا إذا مدّ حاكى الورد غضا وإن صفا … حكى ماءه لونا ولم يعده نشرا (2) وهذا نظير ما أنشدنيه عبد الله بن سرية لنفسه: راقني النهر صفاء … بعد شوقي لصفائه كان مثل الورد غضا … ثم قد صار كمائه ولأبي بكر الصنوبري (3) في مثل هذا المعنى: ولقد طربت إلى الفرا … ت بكل ذي كرم ومجد والشمس عند غروبها … صفراء مذهبة الفرند والماء حاشيتاه … خضراوان من آس ورند (4) تحبوه أيدي الريح إن … هبت على قرب وبعد بطرائف من فضة … وطرائف من لازورد والسفن كالطير انبرت … في الجو من مثنى وفرد حتى إذا جزر الفرا … ت مضى وأعقبه بمدّ (5)",
    "foot_note": "1. يقال للجيش العظيم: مجر، لثقله وضخمه. \n2. حكى ماءه، أي أشبه ماء الورد في لونه. وفي الأصل: «حكى ماؤه نافلم» تحريف. \n3. هو أبو بكر أحمد بن محمد بن الحسن بن المرار، المعروف بالصنوبرى الحلبي. قال السمعاني في الورقة (355): نسبة إلى الصنوبر. وانظر تعليلا آخر في مختصر تاريخ دمشق (1: 456). ووفاته سنة 334 هـ. كما في شذرات الذهب. وانظر فوات الوفيات (1: 77). \n4. الرند: شجر من أشجار البادية طيب الرائحة، ويقال للآس «رند». وفي الأصل: «ورود»، ولا وجه له. \n5. في الأصل: «بورد»، ووجهه ما أثبت.",
    "book_id": "957",
    "new_page_number": 17
  },
  {
    "serial_number": "6271033",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 19,
    "volume_number": 1,
    "text": "أبصرته وكأنه … ملقى عليه رداء ورد متململاً كالصب أو … ذن من أحبته بصد وكأنما بحشاه ما … بحشاي من قلق ووجد وقال تميم المعز، وأحسن التشبيه (1) : يوم لنا بالنيل مختصر … وبكل يوم مسرة قصر والسفن تصعد كالخيول بنا … فيه وجيش الماء ينحدر فكأنما أمواجه غرف … وكأنما داراته سرر وقال محمد بن الحسن: النهر مكسو من الأزهار … برداً أنيقاً مثل ثوب … يجري بمسك أو بذوب نضار (2) وإذا استقام رأيت صفحة منصل … وإذا استدار رأيت عطف سوار وقال أبو الحسن محمد بن الوزير، في تدرج زيادة الماء إصبعاً إصبعاً، ومنفعة ذلك التدرج: أرى أبداً كثيراً من قليل … وبدراً في الحقيقة من هلال فلا تعجب فكل قليل ماء … بمصر مسبب لخليج مال زيادة إصبع في كل يوم … زيادة أذرع في حسن حال فإذا كان في الخامس عشر ذراعاً وزاد من السادس عشر إصبعاً واحدة كسر الخليج (3) . ولكسره يوم معدود، ومقام مشهود، ومجتمع غاص، يحضره العام والخاص. وإذا كسر فتحت التّرع - وهي فوّهات الخلجان - ففاض الماء",
    "foot_note": "1. الأبيات التالية لم أجدها في ديوان تميم. \n2. في الأصل: «يجرى لسك ذوب نضار». \n3. في الأصل: «نفعت نفعا عظيما»، وأثبت ما عند المقريزي في (1: 59).",
    "book_id": "957",
    "new_page_number": 18
  },
  {
    "serial_number": "6271034",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 20,
    "volume_number": 1,
    "text": "وساح، وعم الغيطان والبطاح (1) ، وانضم الناس إلى أعلى مساكنهم من الضياع والمنازل، وهي على آكام وربى لا ينتهي إليها الماء، ولا يتسلط السيل عليها، فتعود عند ذلك أرض مصر بأسرها بحراً غامراً لما بين جبليها المكتنفين لها. وتثبت على هذه الحال ريثما يبلغ الحد المحدود، في مشيئة الرب المعبود. وأكثر ذلك يحوم حول ثمانية عشر ذراعاً، ثم يأخذ عائداً في منصبه، إلى مجرى النيل [ومسربه، فينضب أولاً عما كان (2) ] من الأرض مشرفا عاليا، وبصير فيما كان منها متطامناً (3) ، فيترك كل قرارة كالدرهم، ويغادر كل تلعة كالبرد المسهم. وفي هذا الوقت من السنة تكون أرض مصر أحسن شيء منظراً، ولا سيما متنزهاتها المشهورة، ودياراتها المطروقة، كالجزيرة، وبركة الحبش (4) وما جرى مجراها من المواضع التي يطرقها أهل الخلاعة، وينتابها ذو والأدب والطرب. واتفق أن خرجنا في مثل هذا الزمان إلى بركة الحبش، فافترشنا من زهرها أحسن بساط، واستظللنا من دوحها بأوفى رواق، وطلعت علينا من زجاجات الأقداح شموس في خلع البدور، ونجوم (5) بالصفاء تنور، إلى أن جرى ذهب الأصيل على لجين الماء، ونشبت نار الشفق بفحمة الظلماء، فقال في ذلك بعضنا (6)",
    "foot_note": "1. في الخطط: «وغمر القيعان والبطاح». \n2. مكان هذه التكملة التي أثبتها من الخطط بياض في الأصل. \n3. بدل هذه الجملة في الأصل « \n…. متحفظ \n…. نسطاميا»، وإكماله وصوابه من الخطط. \n4. كانت في ظاهر مدينة الفسطاط من قبليها فيما بين النيل والجبل. وسميت بركة الحبش نسبة إلى قتادة بن قيس بن حبشي الصدفي، ممن شهد فتح مصر، وكانت له حدائق بجوار هذه البركة تعرف بالحبش فنسبت البركة إليها. وهذه البركة موقعها اليوم منطقة الأراضي الزراعية التابعة لزمام قرية دير الطين، وجزء عظيم من الأراضي الزراعية التابعة لقرية البساتين. انظر الخطط (2: 152) والنجوم الزاهرة (5: 14). \n5. في الأصل: «وجوم». \n6. يعنى نفسه. وجاء في الخطط (2: 155): «وقال ابن سعيد في كتاب المغرب: «وخرجت مرة حيث بركة الحبش التي يقول فيها أبو الصلت أمية بن عبد العزيز الأندلسي عفا اللّه عنه». وأنشد الأبيات التالية. وجاء في (2: 160): «بئر أبى سلامة وتعرف ببئر الغنم، وهي من قبلي النوبية، وموضعها أحسن موضع في البركة، وهي التي عنى أبو الصلت أمية بن عبد العزيز بقوله». وأنشد الأبيات، ورواها ياقوت في ترجمة أمية منسوبة إليه.",
    "book_id": "957",
    "new_page_number": 19
  },
  {
    "serial_number": "6271035",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 21,
    "volume_number": 1,
    "text": "لله يومي ببركة الحبش … والأفق بين الضياء والغبش والنيل تحت الرياح مضطرب … كصارم في يمين مرتعش قد نسجتها يد الغمام لنا … فنحن من نسجها على فرش ونحن في روضة مفوفة … دبج بالنور عطفها ووشى (1) فعاطني الراح، إن تاركها … من سورة الهم غير منتعش وسقني بالكبار مترعة … فهن أروى لشدة العطش (2) فأثقل الناس كلهم رجل … دعاه داعي الصبا فلم يطش (3) وقال أيضاً: علل فؤادك باللذات والطّرب … وباكر الرّاح بالغايات والنخب أما ترى البركة الغناء لابسة … وشياً من النّور حاكته يد السّحب وأصبحت من جديد النبت في حلل … قد أبرز القطر منها كل محتجب من سوسن شرق بالطل محجره … وأقحوان شهى الظلم والشنب وانظر إلى الورد يحكى خد محتشم … من نرجس ظل يبدي لحظ مرتقب والياسمين وقد أربى على درر … والراح من درر تطفو على ذهب كم مرة قد شفينا فيه غلتنا … بجاحم من فم الإبريق ملتهب (4) شمس من الراح حيانا بها قمر … موف على غصن يهتز في كثب أرخى ذوائبه، وانهز منعطفاً … كصعدة الرمح، في مسودة العذب فاطرب ودونكها فاشرب فقد نغبت … على التصابي دواعي اللهو والطرب ومما يتعلق بوصف النيل من أبيات له كتبها إلى الأفضل ليلة المهرجان:",
    "foot_note": "1. في الأصل: «ذبح بالقطر»، صوابه من الخطط ومعجم الأدباء. \n2. في الأصل: «لعل أروى». وفي معجم الأدباء: «فهن أشفى». \n3. في الأصل: «يدعوه داعى الصبا»، وأثبت ما في الخطط ومعجم الأدباء. \n4. في الأصل: «علتنا» بالمهملة.",
    "book_id": "957",
    "new_page_number": 20
  },
  {
    "serial_number": "6271036",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 22,
    "volume_number": 1,
    "text": "أبدعت للناس منظرا عجبا … لا زلت تحيى السرور والطربا ألّفت بين الضّدّين مقتدرا … فمن رأى الماء خالط اللهبا كأنّما النيل والشموع به … أفق سماء تألّقت شهبا قد كان من فضّة فصار سما … وتحسب النار فوقه ذهبا وقد تعاور الشعراء ..... شعاع على صبح [*] . ومن مليح ما قيل فى ذلك قول بعض أهل العصر، وهو أبو الحسن على بن أبى البشر الكاتب: شربنا مع غروب الشمس شمسا … مشعشعة إلى وقت الطلوع وضوء الشمع فوق النيل باد … كأطراف الأسنة فى الدّروع وأنشد أبو منصور الثعالبى (فى يتيمة الدهر) لمنصور بن كيغلغ (1) : قام الغلام يديرها فى كفه … فحسبت بدر التّمّ يحمل كوكبا والبدر يجنح للأفول كأنه … قد سلّ فوق الشطّ سيفا مذهبا (2) وأنشد فيه (3) للقاضى أبى القاسم على بن إبراهيم بن أبى الفهم التنوخى: أحسن بدجلة والدّجى متصوّب … والبدر فى أفق السماء مغرّب فكأنها فيه بساط أزرق … وكأنه فيها طراز مذهب (4) وقال ابن وكيع التّنّيسى: غدير يدرّج أمواجه … هبوب الشمال ومرّ الصّبا إذا الشمس من فوقه أشرقت … توهّمته جوشنا مذهبا",
    "foot_note": "1. فى الجزء الأول من يتيمة الدهر (ص 65). وقبل البيتين: عاد الزمان بمن هويت فأعتبا \n…. يا صاحبى فسقيانى واشربا كم ليلة سامرت فيه بدرها \n…. من فوق دجلة قبل أن يتغيبا \n2. فى الأصل: «فوق اللحظ»، وفى اليتيمة: «فوق الماء». وانظر ما سيأتى فى شعر ابن التمار الواسطى. \n3. أى فى هذا المعنى أو فى كتاب يتيمة الدهر. انظر اليتيمة (65:1). \n4. فى الأصل: «وكأنه فيه طراز»، والوجه ما أثبت من اليتيمة. [*] (تعليق الشاملة): العبارة بكمالها كما ورد فى الخريدة: «وقد تعاور الشعراء وصف وقوع الشعاع على صفحات الماء». [أفاده في المستدرك]",
    "book_id": "957",
    "new_page_number": 21
  },
  {
    "serial_number": "6271037",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 23,
    "volume_number": 1,
    "text": "وقال بعض أهل العصر من قصيدة: باطى نهر كان الر … وهو اللجين به ذوبا (1) إذا حمشته الصبا رأيته … كأنه زردا مذهبا [*] وقال أبو عبادة البحترىّ يصف بركة: إذا علتها الصبا أبدت بها حبكا … مثل الجواشن مصقولا حواشيها (2) إذا النّجوم تراءت فى جوانبها … ليلا حسبت سماء ركّبت فيها وقد أحسن عبد الله بن المعتز فى قوله: وتبدّى لهن بالنّجف المق … فر ماء صافى الجمام غرىّ (3) فإذا قابلته درّة شمس … خلته كسّرت عليه الحلىّ (4) وقال ابن التّمّار الواسطى يصف ضوء القمر على دجلة: قف فانتصف من صروف الدهر والنّوب … واجمع بكأسك شمل اللهو والطّرب أما ترى الليل قد ولّت عسا كره … مهزومة وجيوش اللهو فى الطلب والبدر فى الأفق الغربىّ تحسبه … قد مدّ جسرا على الشّطّين من ذهب وقال محمد بن عبد الله السّلامى: ونهر تمرح الأمواج فيه … مراح الخيل فى رهج الغبار إذا اصفرّت عليه الشمس خلنا … نمير الماء يمزج بالعقار *** وأمّا سكّان أرض مصر فأخلاط من الناس مختلفة الأصناف (5) : من قبط وروم وعرب وبربر وأكراد وديلم وحبشان وأرمن (6) ، وغير ذلك من",
    "foot_note": "1. كذا ورد البيتان على ما بهما من تحريف. \n2. البيتان من قصيدة له يمدح فيها المتوكل ويصف بركته. الديوان 319. \n3. الغرى: البارد، يقال غرى الغدير: برد ماؤه. \n4. فى ديوان ابن المعتز 61: «فإذا ضاحكته». \n5. فى الخطط (48:1): «مختلفو الأصناف». \n6. هذه الكلمة ليست فى الخطط. [*] (تعليق الشاملة): البيتان كما فى الخريدة: بشاطئ نهر كأن الزجاج \n…. وصفو اللجين به ذوبا إذا جمشته الصبا بالضحى \n…. توهمته زردا مذهبا انظر ص 116 من نوادر المخطوطات. [أفاده في المستدرك]",
    "book_id": "957",
    "new_page_number": 22
  },
  {
    "serial_number": "6271038",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 24,
    "volume_number": 1,
    "text": "الأصناف والأجناس على حسب اختلافاتهم، وقالوا: إن السبب فى اختلافهم، والموجب لاختلاطهم، اختلاط المالكين لها، والمتغلّبين عليها، من العمالقة واليونانيين والروم والعرب وغيرهم، فلهذا اختلطت أنسابهم فاقتصروا من التعريف بأنفسهم على الانتساب إلى مواضعهم (1) ، والانتماء إلى مساقطهم ومواقعهم. وحكى جماعة من المؤرّخين أنهم كانوا فى الزمن السالف عبّاد أصنام، ومدبرى هياكل، إلى أن ظهر دين النّصرانية وغلب على أرض مصر فتنصّروا، وبقوا على ذلك إلى أن فتحها المسلمون فى أيام عمر بن الخطاب رضى الله عنه، فأسلم بعضهم وبقى بعض على دين النصرانية، ومذهبهم مذهب اليعاقبة. وأما أخلاقهم فالغالب عليهم اتّباع الشهوات، والانهماك فى اللذات، والاشتغال بالتّرّهات، والتصديق بالمحالات، وضعف المرائر والعزمات، إلى غير ذلك مما حكاه أبو الحسين على بن رضوان فى ذلك واقتصّه، وأورده من الأمور الطبيعية وموجبه (2) ، وكفى به حكما منصفا، وشاهدا عدلا. وحكى الوصيفىّ فى كتابه الذى ألّفه فى أخبار مصر أنّ أهلها فى الزمن السابق كانوا يعتقدون أنّ هذا العالم، الذى هو عالم الكون والفساد أقام برهة من الدهر خاليا من نوع الإنسان، عامرا بأنواع أخر غير الإنسان، وأن تلك الأنواع مختلفة على خلق فاذّة (3) ، وهيئات شاذّة، ثم حدث نوع الإنسان فنازع تلك الأنواع فغلبها واستولى عليها، وأفنى أكثرها قتلا، وشرّد ما بقى منها إلى القفار، وأن تلك المشرّدة هى الغيلان والسّعالى وغير ذلك، مما حكاه من اعتقاداتهم المستحيلة، وتصوّراتهم الفاسدة، وتوهّماتهم النافرة. إلا أنّه يظهر من",
    "foot_note": "1. فى الخطط: «على الإشارة إلى مواضعهم». \n2. كذا وردت هذه الكلمة. \n3. الفاذة: المنفردة. وفى الحديث: «هذه الآية الفاذة»، أى المنفردة فى معناها.",
    "book_id": "957",
    "new_page_number": 23
  },
  {
    "serial_number": "6271039",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 25,
    "volume_number": 1,
    "text": "أمرهم أنه كان فيهم طائفة من ذوي المعارف والعلوم، خصوصاً بعلم الهندسة والنجوم (1) . ويدل على ذلك ما خلفوه من الأشغال (2) البديعة المعجزة، كالأهرام والبرابي، فإنها من الآثار التي حيرت الأذهان (3) [الثاقبة، واستعجزت الأفكار الراجحة]، وتركت لها شغلاً بالتعجب منها، والتفكر فيها. وفي مثلها يقول أبو العلاء أحمد بن سليمان المعري في قصيدته التي يرثي بها أباه (4) : تضلّ العقول الهبر زيّات رشدها … ولا يسلم الرأي القويم من الأفن وقد كان أرباب الفصاحة كلما … رأوا حسناً عدّوه من صنعة الجن وأي شيء أعجب وأغرب بعد مقدورات الله ومصنوعاته، من القدرة على بناء جسم [جسيم (5) ] من أعظم الحجارة، مربع القاعدة مخروط الشكل، ارتفاع عموده ثلاثمائة ذراع ونحو سبعة عشر ذراعاً (6) يحيط به أربعة سطوح مثلثات متساويات الأضلاع، طول كل ضلع منها أربعمائة ذراع وستون ذراعاً (7) وهو مع هذا العظم (8) ، من إحكام الصنعة وإتقانها (9) ، في غاية من حسن التقدير بحيث لم يتأثر (10) إلى هلم جرا (11) بعصف الرياح وهطل السحاب،",
    "foot_note": "1. في الخطط (1: 118): «وخصوصا علم الهندسة والنجوم». \n2. في الخطط: «من الصنائع». \n3. في الأصل: «الآثار البعيدة من الأذهان»، صوابه من الخطط. \n4. في سقط الزند (1: 196) بشرح التنوير. \n5. هذه من الخطط. \n6. في الخطط: «تسعة عشر ذراعا». والذراع يذكر ويؤنث. \n7. في النجوم الزاهرة (1: 98) نقلا عن أبي الصلت: «وسبعون ذراعا». \n8. في الأصل: «مع هذا الطول منه» وكتب إزاءه: «في العظم» بدلا من «الطول منه». وأثبت ما في الخطط. \n9. بدله في الخطط: «وإتقان الهندام». \n10. في الأصل: «وهو لا يتأثر»، وأثبت ما في الخطط. \n11. كذا ورد في الأصل والخطط. ولعلها: «إلى اليوم وهلم جرا».",
    "book_id": "957",
    "new_page_number": 24
  },
  {
    "serial_number": "6271040",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 26,
    "volume_number": 1,
    "text": "وزعزعة الزلازل. وهذه صفة كل واحد من الهرمين المحاذيين للفسطاط من الجانب الغربي، على ما شاهدناه منهما (1) . وقال بعضهم وقد ذكر عجائب مصر: «وما على وجه الأرض بنية إلا وأنا أرثي لها من الليل والنهار، إلا الهرمين فإني أرثى لليل والنهار منهما». وهذان الهرمان (2) لهما إشراف على أرض مصر وإطلال [على] بطائحها، وإصعاد على ذراها. وهما اللذان أراد أبو الطيب المتنبي بقوله: أين الذي الهرمان من بنيانه … ما قومه، ما يومه، ما المصرع (3) كنا نظن دياره مملوءة … ذهباً فمات وكل دار بلقع (4) تتخلف الآثار عن أربابها … حيناً ويدركها الخراب فتتبع (5) واتفق أن خرجنا يوماً إليهما، فلما أطفنا بهما واستدرنا حولهما كثر تعجبنا منهما، فتعاطينا القول فيهما، فقال بعضنا (6) : بعيشك هل أبصرت أعجب منظراً … على طول ما أبصرت من هرمي مصر (7) [أنافا عناناً للسماء وأشرفا … على الجوّ إشراف السّماك أو النّسر (8)",
    "foot_note": "1. في الأصل: «منها»، والصواب في الخطط. \n2. في الأصل: «أرثى لليل والنهار منها على وهذان الهرمان من أعظمها.» وأثبت الصواب من الخطط. \n3. من قصيدة له في ديوانه (1: 405) بشرح العكبري، يرثى بها أبا شجاع فاتكا. \n4. هذا البيت لم يورده المقريزي، وهو هنا في غير موضعه الطبيعي. وموضعه في الديوان بعد بيت يتلو الثالث هنا؛ لأن ضمير «دياره» عائد إلى أبى شجاع في البيت المشار إليه، وهو: لم يرض قلب أبى شجاع مبلغ \n…. قبل الممات ولم يسعه موضع \n5. في الخطط: «عن سكانها». وفي الديوان: «عن أصحابها». \n6. في بدائع البدائة 136 أن الذي قال الشعر هو أبو الصلت نفسه. \n7. بعد هذا في الأصل بياض بقدر صفحتين، وقد وفقت لسد هذا الفراغ مما نقله المقريزي في الخطط (1: 118 - 119): ووضعت هذا السقط بين معقفى التكملة: [. . . . .]. \n8. في بدائع البدائة: «أنافا بأكناف السماء».",
    "book_id": "957",
    "new_page_number": 25
  },
  {
    "serial_number": "6271041",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 27,
    "volume_number": 1,
    "text": "وقد وافياً نشزاً من الأرض عالياً … كأنهما نهدان قاما على صدر (1) وزعم قوم أن الأهرام قبور ملوك عظام، آثروا أن يتميزوا بها على سائر الملوك بعد مماتهم، كما تميزوا عنهم في حياتهم، وتوخوا أن يبقى ذكرهم بسببها على تطاول الدهور، وتراخي العصور. ولما وصل الخليفة المأمون إلى مصر (2) أمر بنقبها، فنقب أحد الهرمين المحاذيين للفسطاط بعد جهد شديد، وعناء طويل، فوجدوا داخله مهاوي ومراقي يهول أمرها، ويعسر السلوك فيها، ووجدوا في أعلاها بيتاً مكعباً، طول كل من أضلاعه نحو من ثمانية أذرع، وفي وسطه حوض رخام مطبق، فلما كشف غطاؤه لم يجدوا فيه غير رمة بالية، قد أتت عليها العصور الخالية، فعند ذلك أمر المأمون بالكف عن نقب ما سواه. ويقال: إن النفقة على نقبه كانت عظيمة، والمئونة شديدة. ومن الناس من زعم أن هرمس الأول، المدعو بالمثلث بالنبوة والملك والحكمة، وهو الذي يسميه العبرانيون خنوخ بن يرد بن مهلائيل بن قينان بن أنوش بن شيث بن آدم عليه السلام وهو إدريس عليه السلام استدل من أحوال الكواكب على كون الطوفان يعم الأرض، فأكثر من بنيان الأهرام، وإيداعها الأموال وصحائف العلوم، وما يشفق عليه من الذهاب والدروس، حفظاً لها، واحتياطاً عليها. ويقال: إن الذي بناها ملك اسمه سوريد بن سهلوق بن سرياق. وقال آخرون: إن الذي بنى الهرمين المحاذيين للفسطاط شداد بن عاد، لرؤيا رآها. والقبط تنكر دخول العمالقة بلد مصر،",
    "foot_note": "1. بعده في بدائع البدائة: «وصنع أبو منصور ظافر الحداد: تأمل هيئة الهرمين وانظر \n…. وبينهما أبو الهول العجيب كعماريتين على رحيل \n…. بمحبوبين بينهما رقيب وفيض البحر بينهما دموع \n…. وصوت الريح بينهما نحيب وظاهر سجن يوسف مثل صب \n…. تخلف فهو محزون كئيب» \n2. كان ذلك في سنة 217 كما في كتب التاريخ.",
    "book_id": "957",
    "new_page_number": 26
  },
  {
    "serial_number": "6271042",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 28,
    "volume_number": 1,
    "text": "وتحقق أن بانيهما سوريد (1) ، لرؤيا رآها، وهي أن آفة تنزل من السماء، وهي الطوفان. وقالوا إنه بناهما في مدة ستة أشهر، وغشاهما بالديباج الملون، وكتب عليهما: «قد بنيناهما في ستة أشهر، قل لمن يأتي من بعدنا يهدمهما في ستمائة سنة، فالهدم أيسر من البنيان، وكسوناهما الديباج الملون فليكسهما حصراً، فالحصر أهون من الديباج». ورأينا سطوح كل واحد من هذين الهرمين مخطوطة من أعلاها إلى أسفلها بسطور متضايقة متوازية، من كتابة بانيها، لا تعرف اليوم أحرفها، ولا تفهم معانيها. وبالجملة الأمر فيها عجيب، حتى إن غاية الوصف لها والإغراق في العبارة عن حقيقة الموصوف منها، بخلاف ما قاله على (2) ] بن العباس الرومي، وإن تباعد الموصوفان، وتباين المقصودان، إذ يقول: إذا ما وصفت امرأ لا مرئ … فلا تغل في وصفه واقصد فإنّك إن تغل تغل الظنو … ن فيه إلى الغرض الأبعد فيصغر من حيث عظمته … لفضل المغيب على المشهد وكذلك أمر البرابى، كبربا إخميم، وبربا سمنود (3) ، وبربا دندرا (4) ، فإن فيها من الإحكام وجودة الشكل وحسن التصوير، ما يدل على أن عمّارها",
    "foot_note": "1. في النجوم الزاهرة: «سويرد وقيل سويد». \n2. إلى هنا ينتهى السقط الذي نبهنا عليه في الحاشية 7 من صفحة 26. \n3. في الأصل: «سمندو»، صوابه من المقريزي عند ذكر البرابى، وقال ياقوت: «كورة السمنودية كان فيها بربا وكانت إحدى العجائب. قال القضاعي: ذكر عن أبي عمرو الكندي أنه قال: رأيته وقد خزن فيه بعض عمالها قرظا، فرأيت الجمل إذا دنا من بابه وأراد أن يدخله سقط كل دبيب في القرظ، ولم يدخل منه شيء إلى البربا. ثم خرب عند الخمسين وثلاثمائة». \n4. في الأصل: «ديدار» وإنما هي «دندرا، أو دندرة، أو «أندرا» كما في معجم البلدان. وفي بربا دندرة يقول المقريزي: وهو بربا عجيب، فيه ثمانون ومائة كوة تدخل الشمس كل يوم من كوة منها، ثم الثانية حتى تنتهى إلى آخرها، ثم تكر راجعة إلى موضع بدنها». وأنشد ياقوت في مطلع أبيات: إن قاض بدندرا \n…. قال بيتين سطرا",
    "book_id": "957",
    "new_page_number": 27
  },
  {
    "serial_number": "6271043",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 29,
    "volume_number": 1,
    "text": "ذوو عقول راجحة، وأنه قد كانت لهم بالحكمة عناية بالغة، لا سيما بصناعتى الهندسة والنجوم. وقال بعض أهل العناية بأخبار الأمم وتواريخهم: كان بمصر بعد الطوفان علماء بضروب الحكمة، من العلوم الرياضيّة والطبيعية ولإلهيّة، ومتحقّقون بعلم المرايا المحرقة، وبالطّلّسمات والنّير نجيات وغير ذلك. والملك بمصر من قديم الزمان بمدينة منف، وهي في غربي النيل، على مسافة اثني عشر ميلاً من الفسطاط. ولما بنى الإسكندر مدينة (الإسكندرية) منذ نحو ألف سنة وأربعمائة سنة وأربعين سنة، رغب الناس في عمارتها (1) ، وكانت دار العلم، ومقر الحكمة، إلى أن تغلّب عليها المسلمون في خلافة عمر بن الخطاب، رضوان الله عليه، واختط عمرو بن العاص مدينته المعروفة (بالفسطاط) فانسرب أهل مصر وغيرهم من العرب والعجم إلى سكناها، فصارت قاعدة ديار مصر ومركزها إلى وقتنا هذا. فيقال إن من قدماء أهل العلم بها هرمس الثالث (2) ، وكان فيلسوفاً جوالاً في البلاد، طوافاً في المدائن، عالماً بنصبتها (3) ، وطوالعها وطبائع أهلها، وله تصانيف جليلة مفيدة في فنون من الحكمة. ومنهم دبوفنطس (4) صاحب المقالات الموضوعة في علم العدد وخواصه على طريق الجبر والمقابلة.",
    "foot_note": "1. في الأصل: «وأعجب في عمارتها»، صوابه من المقريزي (1: 135). \n2. في الأصل: «هرمس الثاني»، والصواب ما أثبت من عيون الأنباء لابن أبي أصيبعة (1: 17) حيث ذكر الهرامسة الثلاثة، وقال في هرمس هذا: «وأما هرمس الثالث فإنه سكن مدينة مصر، وكان بعد الطوفان». وأما هرمس الثاني فهو كلدانى من أهل بابل. وهرمس الأول مصرى كان قبل الطوفان، وهو عند العرب إدريس عليه السلام. \n3. في الأصل: «بنصبها»، وفي عيون الأنباء: «عالما بنصبة المدائن وطبائعها». \n4. ذكره ابن أبي أصيبعة في (1: 245) في أثناء ترجمة «قسطا بن لوقا»، قال: «كتاب في ترجمة ديوفنطس في الجبر والمقابلة»: وذكره أيضا عرضا في ترجمة ابن الهيثم (2: 98).",
    "book_id": "957",
    "new_page_number": 28
  },
  {
    "serial_number": "6271044",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 30,
    "volume_number": 1,
    "text": "ومنهم الإسكندراني (1) صنف كتاب الأفلاك، وكتاب القانون في تقويم الكواكب. ومنهم روسم (2) صاحب التصانيف في الكيميا. ومنهم أنقلاؤس الإسكندري (3) وأصحابه، الذين اختصروا كتب جالينوس في صناعة الطب، وألفوها على طريق المسألة والجواب، يدل حسن اختصارهم لها على وفور علمهم، وفضل معرفتهم. ومنهم واليس (4) صاحب الكتاب المعروف بالبريدج الرومي، المصنف في المواليد وما يتقدمها من المدخل إلى علم أحكام النجوم. ويقال إنه الذي استخرج بطول التحري (5) ومواصلة العناء، جدود المصريين. فهؤلاء هم المشهورون من أهل الحكمة بمصر في ذلك الزمان. وأما زماننا هذا فقد دثر منها كل علم وامحي رسمه، وجهل اسمه، ولم يبق إلا رعاع وغثاء وجهلة دهماء، وعامة عمياء، وجلهم أهل رعانة (6) ولهم خبرة بالكيد والمكر،",
    "foot_note": "1. لعله «أقطيمن الإسكندرانى». قال القفطي في أخبار الحكماء (50): «كان عالما بالرياضة محققا للأرصاد خبيرا بعمل آلاتها». اجتمع هو وميطن على الرصد بمدينة الإسكندرية من الديار المصرية، ورصدا وأثبتا ما تحققاه، وتداوله العلماء بعدهم إلى زمن بطليموس القلوذى الراصد بالإسكندرية. «وكان زمنهما قبل زمانه بخمسمائة وإحدى وسبعين سنة». \n2. ذكره القفطي في ص 127، بلفظ «روشم» قال: «روشم المصري، هذا الرجل كان بمصر قبل الإسلام، وهو قيم بعلوم الكيمياء وأصولها وتفصيلها وإحكام أمر تركيبها \n…. وله في ذلك كتب جليلة مشهورة عند علماء هذا النوع يتنافسون في تحصيلها، والظفر بها». \n3. ترجم له القفطي في (51 - 52) وابن أبي أصيبعة في (5: 103 - 104). \n4. ذكره القفطي في (172) قال: «فاليس المصري، وربما قيل واليس الرومي، كان حكيما فاضلا في الزمن الأول بعلوم الرياضة وأحكام النجوم. وله في ذلك المؤلفات الجميلة المشتملة من هذا النوع على المقاصد الجليلة. وهو مؤلف الكتاب المشهور بين أهل هذه الصناعة، المسمى بالبريدج الرومي». \n5. في الأصل: «التجربة». \n6. المعروف في هذا المصدر: الرعن، والرعونة.",
    "book_id": "957",
    "new_page_number": 29
  },
  {
    "serial_number": "6271045",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 31,
    "volume_number": 1,
    "text": "وفيهم بالفطرة قوة عليه وتلطف فيه وهداية إليه، لما في أخلاقهم من الملق والسياسة (1) التي أربوا فيها على كل من تقدم وتأخر، وخصوا بالإفراط فيها دون جميع الأمم، حتى صار أمرهم في ذلك مشهوراً، والمثل بهم مضروباً. وفي خبثهم ومكرهم يقول أبو نواس (2) : محضتكم يا أهل مصر نصيحتي … ألا فخذوا من ناصح بنصيب (3) رما كم أمير المؤمنين بحية … أكول لحيات البلاد شروب [ولا تثبوا وثب السفاة فتركبوا … على حد] حامي الظهر غير ركوب (4) فإن يك باقي إفك فرعون فيكم … فإن عصا موسى بكف خصيب وأما حال المنتسبين إلى العلم منهم فأنا ذاكر منها ما وقفت عليه، وكشفت بالمحنة عنه. كنت في أول جلوسي بها شديد العناية بكتب جالينوس وبقراط، باحثاً عن مشكلها، فاحصاً عن مستغلقها، فحرصت كل الحرص، وجهدت كل الجهد على أن أجد من أهل هذه الصناعة من أستفيد منه وأستزيد بمذاكرته وأقدح خاطري بمفاوضته، فلم أجد غير قوم طبع الله على قلوبهم وأعمى أبصارهم، وطمس أفهامهم، وحال بين الحكمة وبينهم، فكانوا وإياي، كما قال الشاعر: قوم إذا جالستهم … صدئت بقربهم العقول لا يفهموني قولهم … ويدق عنهم ما أقول فهم كثير بي كما … أنّى بجمعهم قليل",
    "foot_note": "1. في الخطط (1: 49): «الملق والبشاعة». \n2. الأبيات الأربعة في ديوانه (103 - 104) يمدح بها الخصيب أمير مصر. \n3. في الديوان: «منحتكم يا أهل مصر». \n4. التكملة من الديوان (103)، وموضعها بياض في الأصل. حامى الظهر: هو البعير الذي حمى ظهره فيترك فلا ينتفع منه بشئ ولا يمنع من ماء ولا مرعى. وفي الأصل: «مانى الظهر» صوابه من الديوان. والبيت لم يرد في الخطط.",
    "book_id": "957",
    "new_page_number": 30
  },
  {
    "serial_number": "6271046",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 32,
    "volume_number": 1,
    "text": "وقد تخلقوا بكثرة الخلاف، وقلة الإنصاف، ولزموا البهت والمعاندة، والشغب والمكابرة، وجهلهم بصناعة الكتب وخلوهم من أداتها، وعدمهم لعددها وآلاتها، وإهمالهم لشرائطها، وإغفالهم للوازمها، وقصور أذهانهم عن إدراك دقائقها، وبعد عقولهم عن تصور حقائقها، ولم يعلموا أن الطبيب محتاج إلى أشياء تعينه في صناعته، وتفتح له مغالقها، وتوضح مشكلها، وتشرح مشتبهها، وتبين له مستعجمها، وتذيقه برد اليقين (1) ، وتجلو عن عين بصيرته ظلم الشكوك والظنون، وهي العلوم الطبيعية التي تعرفه مبادئها وأوائلها، وتعطيه استقصّاتها وعناصرها (2) ، والقوانين القياسية التي تسدد ذهنه نحو الصواب فيما يلتمس علمه، ويتطلب فهمه، وتعرفه كيف يحيل (3) مطلوباتها إليه، ويبنى قياساته عليها، وكيف يتطرق من جليها إلى خفيها، ويستدل بظاهرها على غائبها، ويأمن الزلل، ووقوع الخطل والخلل، ويحقّق الأسباب والعلل. ولا بدّ لمن أراد أن يكون طبيباً كاملاً، وحكيماً فاضلاً، من النظر في العلوم الرياضية، ولا سيما النجومية منها والموسيقاوية. وأولى الناس بأن يكون على هذه الصفة أطباء الملك التبعى الألمعى، الذي إنما يستعمل الطبيب والمنجم على جهة الاستظهار، لا على جهة الافتقار والاضطرار. وكيف ونظره الأعلى، وقدحه المعلى، وسهمه الأسد، وباعه الأمد. ومن كان مثله - ولا مثل له في تطبيق المفاصل، وإصابة الشواكل - فخليق به أن يختار، ولا يختار، ويستبد، ولا يستمدّ.",
    "foot_note": "1. في الأصل: «برد النفس»، والوجه ما أثبت. \n2. الأستقص، ويقال الأسطقص، هو الشئ البسيط الذي منه يتركب المركب، كالحجارة والقراميد والجذوع التي يتركب منها القصر، وكالحروف التي منها يتركب الكلام، وكالواحد الذي يتركب منه العدد. والأسطقسات الأربعة هي النار والهواء والماء والأرض، انظر مفاتيح العلوم للخوارزمي (82). \n3. في الأصل: «يحلل».",
    "book_id": "957",
    "new_page_number": 31
  },
  {
    "serial_number": "6271047",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 33,
    "volume_number": 1,
    "text": "هيهات أن يأتي الزمان بمثله … إن الزمان بمثله لبخيل فلما [لم] يأخذوا نفوسهم بالإتقان لما قد سلف تعديده، بل استطالوه، واستبعدوا الأمد إليه، ورأوا أن غرضهم من صناعة الطب الذي هو عندهم وبحسب رأيهم، التكسب بما يتم لهم بأقرب مما شرطه الأوائل متناولاً، وأسهل مراماً، لم يحفظوا (1) غير أسماء أدوية قليلة العدد يصرفونها في مداواة كل مرض دون إعمال فكرهم في حقيقة نوعه وسببه، ومقتضيه وموجبه. وقد ذم جالينوس من فرق الطب الثلاث الفرقة الجبلية (2) ، لحذقها جميع لوازم الصناعة الطبية، واقتصارها في المداواة على النظر في المرض، هل من جنس الاستفراغ فيقابل بالإمساك، أو من جنس الإمساك فيقابل بالاستفراغ، دون الفحص عن أمر المزاج والسن والسجية، والبلد والعادة والماهية. فما ظنك بجالينوس لو شاهد هؤلاء الذين لا يثبتون على نحلة، ولا ينتسبون إلى فرقة، فإن برئ على أيديهم عليل فبرؤه على جهة الاتفاق، وإن هلك فبالواجب والاستحقاق، وهم كما قال الشاعر في مثلهم: وطبيب مجرب ما له بال … نجح في كل ما يجرب عادة مر يوماً على عليل فقلنا … قر عيناً فقد رزقت الشهادة وكما قال الآخر في بعض حكمائنا المشهورين عند العوام بالحذق والتقدم: قل للوبا أنت وابن زهر … قد جزتما الحد والنهاية ترفقا بالورى قليلاً … في واحد منكما كفاية أو كما قال بعض أهل العصر أيضاً فيهم: وطبيب مشعبذ … يمزج الطب بالرّقى",
    "foot_note": "1. في الأصل: «فلم يحفظوا». \n2. في الأصل: «الفرق الجبلية».",
    "book_id": "957",
    "new_page_number": 32
  },
  {
    "serial_number": "6271048",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 34,
    "volume_number": 1,
    "text": "ما رأيناه قط ط … بّ عليلا فوفّقا بل عدم الصّحّة فى ال … جسم والقلب والبقا ذو صفات تغادر ال … جسم مما به لقى عادما للحراك والح … سّ والخفّة والنقا (1) قد سقاه بها الحما … م ولم يدر ما سقى وقال آخر: ما خطر النبض على باله … يوما ولا يعرف ما الماء (2) بل ظنّ أن الطبّ درّاعة … ولحية كالقطن بيضاء (3) [*] *** ومن ظريف ما سمعته أنّه كان بمصر منذ عهد قريب رجل ملازم للمارستان يستدعى للمرضى كما تستدعى الأطبّاء، فيدخل على المريض فيحكى له حكايات مضحكة، وخرافات مسلّية، ويخرج له وجوها مضحكة، وكان مع ذلك لطيفا فى إضحاكه وبه خبيرا، وعليه قديرا؛ فإذا انشرح صدر المريض وعادت إليه قوّته تركه وانصرف، فإن احتاج إلى معاودة المريض عاده إلى أن يبرأ، أو يكون منه ما شاء الله. فليت أطبّاء عصرنا هذا بأسرهم قدروا على مثل هذا العلاج الذى لا مضرّة فيه ولا غائلة له، بل أمره على العليل هيّن، ونفعه ظاهر بيّن؛ كيف لا وهو ينشّط النفس ويبسط الحرارة الغريزية، ويقوّى القوى الطبيعية، ويقوّى البدن على دفع الأخلاط الرديّة المؤذية والفضول، مع الاستظهار بحفظ الأصول. وأكثر أطبائها المبرزين (4) نصارى ويهود، وفى ذلك يقول بعضهم:",
    "foot_note": "1. موضع هذه الكلمة بياض فى الأصل. \n2. يعنى اختبار ماء المريض، وهو بوله. \n3. الدراعة، كرمانة: جبة مشقوقة المقدم. \n4. فى الأصل: «المزبرقين». [*] (تعليق الشاملة): البيتان رواهما العماد فى الخريدة 120:2 منسوبين إلى العينى المصرى، ثم قال: «ووجدت هذين البيتين فى رسالة أبى الصلت منسوبين إلى ظافر الحداد». [أفاده في المستدرك]",
    "book_id": "957",
    "new_page_number": 33
  },
  {
    "serial_number": "6271049",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 35,
    "volume_number": 1,
    "text": "أقول المسلمين طراً … تبغون في طبنا (1) اشتهاراً هيهات حاولتم محالا … كونوا إذا هوداً أو نصارى (2) وأشبه من رأيته منهم وأدخله في عداد الأطباء، رجل من اليهود يدعى أبا الخير سلامة بن رحمون، فإنّه لقى أبا الوفاء (3) المبشر بن فاتك (4) ، فأخذ عنه شيئاً من صناعة المنطق تخصص به وتميز عن أضرابه، وأدرك أبا كثير بن الزفان (5) تلميذ أبي الحسن علي بن رضوان (6) ، وقرأ عليه بعض كتب جالينوس، ثم نصب نفسه لتدريس جميع كتب المنطق، وجميع كتب الفلسفة الطبيعية والإلهية، وشرح بزعمه وفسر ولخص، ولم يكن بذاك (7) في تحصيله وتحقيقه، واستقصائه عن لطيف العلم ودقيقه، بل كان يكثر (8) كلامه فيضل، ويسرع جوابه فيزل. ولقد سألته في أول لقائي واجتماعي به، عن مسائل استفتحت مباحثته (9) بها مما يمكن أن يفهمها من لم يمتد بعد في العلم باعه، ولم يكثر تبحره واتساعه، فأجاب عنها بما أبان عن تقصيره ونطق بعجزه، وأعرب عن سوء",
    "foot_note": "1. في الأصل: «طبها». \n2. النص التالي نقله القفطي في إخبار العلماء (142 - 143)، وكذلك ابن أبي أصيبعة (2: 106). \n3. بعد هذه تبتدئ القطعة المحفوظة بدار الكتب رقم 354 تاريخ من الرسالة المصرية وسأشير إليها في التعليقات برمز «ق». \n4. ترجم له القفطي (176 - 177) وقال: «هذا رجل أصله من دمشق وموطنه مصر، وهو من الحكماء الأماثل في علم الأوائل \n…. وكانت له ابنة عمرت بعده وروت بالإسكندرية أحاديث نبوية. وكان في آخر المائة الخامسة للهجرة». \n5. عند القفطي: «الكثير البرقاني»، تحريف. وأبو كثير كنية له واسمه أفرائيم ابن الزفان، قال ابن أبي أصيبعة في (2: 105): «إسرائيلي المذهب، وهو من الأطباء المشهورين بديار مصر». وقد اشترى منه الأفضل بن أمير الجيوش عشرة آلاف مجلد من كتبه، كان قد ساوم عليها بعض العراقيين. \n6. انظر ترجمته عند ابن أبي أصيبعة (2: 99). \n7. ق وابن أبي أصيبعة: «ولم يكن هناك». وعند القفطي: «ولم يكن هنالك». \n8. في الأصل: «تراه يكثر»، وأثبت ما في سائر المصادر. \n9. في الأصل: «استقبحت مباحثه بها»، صوابه في سائر المصادر.",
    "book_id": "957",
    "new_page_number": 34
  },
  {
    "serial_number": "6271050",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 36,
    "volume_number": 1,
    "text": "تصوره وفهمه. وكان مثله في عظم دعاويه، وقصوره عن أيسر ما هو متعاطيه (1) كقول الشاعر: يشمر للج عن ساقه … ويغمره الموج في الساحل أو كما قال آخر: تمنيتم مائتي فارس … فردكم فارس واحد (2) وكان (3) بمصر طبيب من أهل أنطاكية يسمى «جرجس»، ويلقب بالفيلسوف، على نحو ما قيل في الغراب: أبو البيضاء، وفي اللديغ: سليم، وقد تفرغ للتولع [بأبي الخير سلامة بن رحمون اليهودي الطبيب المصري (4) ] والإزراء عليه، وكان يزور فصولا طبية وفلسفية يبرزها في معارض ألفاظ القوم، وهي محال لا معنى لها، وفارغة لا فائدة فيها، ثم ينفذها (5) إلى من يسأله عن معانيها، ويستوضحه أغراضها، فيتكلم عليها ويشرحها بزعمه دون تيقظ (6) و [لا (7) ] تحفظ، بل باسترسال واستعجال، وقلة اكتراث وسوء اهتبال، فيؤخذ منه (8) ما يضحك منه ويشرح الصّدر. [وأنشدت (9) ] لجرجس هذا فيه، وهو من أحسن ما سمعته في هجو طبيب مشئوم (10) ، وأنا متّهم له فيه:",
    "foot_note": "1. في الأصل: «نشر ما هو متعاطيه»، صوابه في سائر المصادر. \n2. إلى هنا ينتهى نقل القفطي في 142 - 143. وانظر البيان (1: 249). \n3. النص التالي نقله القفطي في 109 وابن أبي أصيبعة في (2: 106 - 107). \n4. التكملة من القفطي، وبدلها عند ابن أبي أصيبعة: «بابن رحمون». \n5. ق فقط: «ثم ينفذ بها». \n6. ق فقط: «تيقن». \n7. هذه من القفطي وابن أبي أصيبعة. \n8. القفطي وابن أبي أصيبعة: «فيوجد فيها عنه». \n9. هذه من ق والقفطي وابن أبي أصيبعة. \n10. كلمة «مشئوم» وما بعدها ساقط من ق. وفي نسخة الأصل: «ومن أحسن ما قيل في ذم الطبيب الجاهل».",
    "book_id": "957",
    "new_page_number": 35
  },
  {
    "serial_number": "6271051",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 37,
    "volume_number": 1,
    "text": "إنّ أبا الخير على جهله … يخفّ فى كفّته الفاضل عليله المسكين من شومه … فى بحر هلك ما له ساحل ثلاثة تدخل فى دفعة … طلعته والنعش والغاسل ولبعضهم: لأبى الخير فى العلا … ج يد ما تقصّر كلّ من يستطبّه … بعد يومين يقبر والذى غاب عنكم … وشهدناه أكثر (1) ومما قيل فيه: جنون أبى الخير الجنون بعينه … وكلّ جنون عنده غاية العقل خذوه فغلّوه وشدّوا وثاقه … فما عاقل من يستهين بمختلّ وقد كان يؤذى الناس بالقول وحده … فقد صار يؤذى الناس بالقول والفعل [*] وأما المنجّمون الآن بمصر فهم وأطباؤهم كما قد الشّراك من الجلد، بل كما حذيت النّعل بالنعل، لا يتعلّق أمثلهم من علم النجوم بأكثر من زايجة يرسمها (2) ومراكز يقوّمها. فأما الإمعان والتبحّر فى معرفة الأسباب والعلل (3) ، والمبادى",
    "foot_note": "1. فى نسخة الأصل: «وسمعنا بوصفه». وأثبت ما فى ق وابن أبى أصيبعة. ولم يرو القفطى هذه الأبيات. \n2. جاء فى «مفاتيح العلوم» «للخوارزمى 127: «الزائجة هى صورة مربعة أو مدورة تعمل لمواضع الكواكب فى الفلك لينظر فيها عند الحكم لمولد أو غيره. واشتقاقه بالفارسية من زائش، أى المولد، ثم أعربت الكلمة فاستعملت فى المولد وغيره». وجاء فى معجم استينجاس (608): «زايجة  astronomical tables»  أى الجداول الفلكية. وفى نسخة الأصل: «زايرجة»، وأثبت ما فى ق. والزايرجة، هى - كما ذكر ابن خلدون فى المقدمة - فرع من فروع علم السيميا، يمكن بها استخراج الأجوبة من الأسئلة بارتباط بين الكلمات. فمن الزايرجة المنظومة يستطاع معرفة الأجوبة بطرق خاصة، وحساب معين يدخل فيه الجمع والطرح والضرب. وهناك كلمة أخرى مماثلة، وهى الزيج، وتجمع على أزياج. والزيج: صناعة حسابية بقوانين عددية يمكن بها معرفة الشهور والأيام والتواريخ الماضية والمستقبلة، وهو الدستور لما يسمى عند الفلكين بالتقويم. \n3. هذا ما فى ق. وفى نسخة الأصل: «ومعرفة الأسباب والعلل». [*] (تعليق الشاملة): هذا الكلام ورد فى إخبار العلماء بأخبار الحكماء للقفطى ص 159. [أفاده في المستدرك]",
    "book_id": "957",
    "new_page_number": 36
  },
  {
    "serial_number": "6271052",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 38,
    "volume_number": 1,
    "text": "الأول، فليس منهم من يرقى إلى هذه الدرجة، ويسمو إلى هذه المرتبة، ولا يحلق في هذا الجوّ، ويستضيء بهذا الضو (1) إلا أبو الحسن علي بن النضر (2) المعروف بالأديب، رضي الله عنه، من أهل صعيد مصر الأعلى، فإنه كان من الأفاضل [الأعيان (3) ]، المعدودين من حسنات هذا الزمان (4) . وسنذكره فيما نستأنفه إن شاء الله تعالى. وأما الطائفة المقلدة التي حظّها من المعارف القشور دون اللبوب (5) ، والظواهر دون البواطن، والأشباح دون الأرواح، فأمثل من بها منهم الآن رجل يعرف برزق الله النحاس (6) ، فإن له في فروع هذه الصناعة بعض دربه وتجربة، وبتجريباتها (7) بعض خبرة، وهو أكبر المنجمين بها وكبيرهم الذي علمهم، وأميرهم الذي يلوذون به (8) ، فجميعهم إليه منسوب، وفي جريدته مكتوب، وبفضله معترف، ومن بحره (9) مغترف، وهو شيخ مطبوع يتطايب ويتخالع (10) . ومن حكاياته الظريفة عن نفسه قال: سألتني امرأة مصرية أن أنظر لها في مسألة جملية تخصها، فأخذت ارتفاع الشمس للوقت، وحققت درجة الطالع والبيوت الإثني عشر ومركز الكواكب، ورسمت ذلك كلّه بين يدىّ",
    "foot_note": "1. في الأصل: «ولا يحلق» و «لا يستضيء»، وأثبت ما في ق. \n2. في الأصل: «ابن النصر» بالصاد المهملة. وأثبت ما في ق. \n3. هذه من ق. \n4. ق: «من حسنات الزمان». \n5. في اللسان: «ولب الجوز واللوز ونحوهما: ما في جوفه، والجمع اللبوب». ق: «اللباب»، وما أثبت من الأصل أوفق. \n6. في الأصل: «بن النحاس»، وصوابه في ق والقفطي 127. \n7. في الأصل: «وبجزئياتها»، وأثبت ما في ق. وعند القفطي: «وبتجرباتها». \n8. ق: «الذي نوه بهم وقدمهم». وعند القفطي: «وكبيرهم الذي علمهم السحر» فقط. \n9. في الأصل: «ومن علمه»، وأثبت ما في ق. \n10. يتخالع: يظهر الخلاعة. وفي الأصل: «يتخالق»، صوابه في ق.",
    "book_id": "957",
    "new_page_number": 37
  },
  {
    "serial_number": "6271053",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 39,
    "volume_number": 1,
    "text": "في تخت الحساب (1) ، وجعلت أتكلم على بيتٍ بيت منها على العادة، وأنا في خلال ذلك أتحسس أمرها (2) وهي ساكتة لا تنبس، فوجمت لذلك وأدركتني فترة عظيمة، وألقت إلى درهما (3) . قال: فعاودت الكلام وقلت: أرى عليك قطعاً في بيت مالك (4) فاحتفظي واحترزي! فقالت: الآن أصبت وصدقت، قد كان والله ما ذكرت. قلت: وهل ضاع لك شيء؟ قالت: نعم، الدرهم الذي ألقيته إليك! وتركتني وانصرفت. والمصريون أكثر الناس استعمالاً لأحكام النجوم وتصديقاً لها وتعويلاً عليها، وشغفاً بها وسكوناً إليها، حتى إنه قد بلغ من زيادة أمرهم في ذلك إلى أن لا يتحرك واحدٌ منهم حركةً من الحركات الجزئية التي لا تُحصر فنونها ولا تحصل أجزاؤها وأنحاؤها، ولا تضبط جهاتها، ولا تقيّد غاياتها (5) ، ولا تعد ضروبها إلا في طوالع يختارونها، [ونصب يعتمدونها (6) ]. ولقد شهدت يوماً رجلاً من الوقّادين في أتون الحمام (7) ، يسأل رزق الله المذكور عن ساعة حميدة لقص أظفاره، فتعجبت من سمو همته على خساسة قدره (8) ووضاعة مهنته. ومن الحكايات العجيبة في فرط استعمالهم لأحكام النجوم وعنايتهم بها،",
    "foot_note": "1. هذا ما في ق، وفي الأصل: «في التخت». \n2. ق: «أتحسس لها». \n3. القفطي: «وكانت قد ألقت إلى درهما». \n4. هذا ما في ق والقفطي، وفي الأصل: «ضياع بيت مالك». \n5. ق: «ولا تقدر أساليبها». \n6. هذه من ق. \n7. ق: «أتون حمام». \n8. ق: «مع خساسة قدره».",
    "book_id": "957",
    "new_page_number": 38
  },
  {
    "serial_number": "6271054",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 40,
    "volume_number": 1,
    "text": "ما شهدت بالصعيد الأعلى. وذلك أن بعض الولاة حبس رجلاً من [بعض (1) ] أهل تلك الناحية كان ينظر في علم النجوم، وشفع (2) إليه فيه من يكرم عليه، فشفعه فيه، وأمر بإطلاقه وكان من الحبس في عذاب واصب، وجهد ناصب، فلما أتوه وقالوا له: انطلق لشأنك (3) ، أخرج من كمه أصطرلاباً فنظر فيه ثم أخذ طالع الوقت فنظر فيه، فوجده مذموما، فسألهم أن يتركوه مكانه (4) إلى أن يتفق وقت يصلح للخروج من السجن، فعادوا إلى الوالي فأخبروه يخبره (5) ، فضحك منه وتعجب من جهله، وفساد عقله، وأجابه إلى سؤاله، وتركه على حاله، وأطال مدة اعتقاله. وفيما أوردته من أخبار الأطباء والمنجمين الآن بمصر كفاية وبلاغ، إلى أن أنتصب له انتصاباً ثانياُ، فأقول فيه قولاً شافياً. وأما الآن فإني ذاكر على الشرط من لقيته من أدبائها وظرفائها، وفضلائها في الأدب وعلمائها. وأولاهم بالتقديم، وأحقهم بالحظ الأوفر من التعظيم «القاضي أبو الحسن علي ابن النضر (6) » المعروف بالأديب، ذو الأدب الجم والعلم الواسع، والفضل البارع. وله في سائر أجزاء الحكمة اليد الطولى، والرتبة الأولى. وقد كان ورد الفسطاط يلتمس من وزيرها الملقب الأفضل تصرفا وخدمة فخاب فيه أمله،",
    "foot_note": "1. هذه من ق. \n2. ق: «فشفع». \n3. ق: «لسبيلك». \n4. في الأصل: «أن يصبروا عليه»، وأثبت ما في ق. \n5. في الأصل: «خبره»، وأثبت ما في ق. \n6. في الأصل: «النصر» بالمهملة، تحريف صوابه في ق والخريدة (2: 195) من مخطوطة دار الكتب رقم (10098 ز) والطالع السعيد للأدفوى. حيث ذكر أنه كان أحد عمال الديار المصرية في زمن الأفضل شاهنشاه.",
    "book_id": "957",
    "new_page_number": 39
  },
  {
    "serial_number": "6271055",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 41,
    "volume_number": 1,
    "text": "وضاع رجاؤه، وأخفق سعيه، فقال من قصيدة يعاتب فيها الزمان، ويشكو الخيبة والحرمان: بين التعززِ والتذللِ مسلكٌ … بادى المنار لعين كلَّ موفقِ فاسلكه في كل المواطن واجتنب … كبر الأبيّ وذلةَ المتملقِ ولقد جلبتُ من البضائع خيرها … لأجلَّ مختار وأكرم متقِ (1) ورجوتُ خفض العيش تحت رواقه … لا بد إن نفقت وإن لم تنفق (2) ظناً شبيهاً باليقين ولم أخلْ … أن الزمان بما سقاني مشرقي ولعائبي بالحرص قول بين … لو كنتَ شمتَ سحابةُ لم تطرق (3) ما ارتدتً إلا خيرَ مرتادٍ ولم … أصلِ الرجاءَ بحبل غير الأوثق (4) وإذا أبى الرزقَ القضاءُ على امرئ … لم تغنِ فيه حيلةُ المسترزق ولعمرُ عاديةِ الخطوب وإنْ رمت … شملي بسهم تشتّت وتفرّق (5) لأقارعنّ الدهرَ دون مروءَتي … وحرمتُ عزَّ النًصرِ إن لم أصدق (6) وله في سفرته هذه (7) وقد قوى يأسه من بلوغ أمله ونيل بغيته، وعزم على الصدر (8) عن الفسطاط إلى مستقره، يحض على الزّهادة، ويحرّض على القناعة",
    "foot_note": "1. في الأصل: ولقد جلبت من البضائع جلها \n…. من كل مختار وأكرم ما انتقى [وأثبت ما في ق والخريدة والطالع السعيد. بيد أن الكلمة الأخيرة في الطالع السعيد: «موثق». \n2. ق: «ووجدت». وكلمة «رواقه» هي في الأصل: «ظلاله»، وأثبت ما في ق والخريدة. وفي الطالع السعيد: «تحت ردائه»، تحريف. \n3. في الأصل: «ولعائنى» صوابه في ق. وفي الخريدة: «ولعاتبى». \n4. ق: «بغير حبل الأوثق»، وفي الخريدة: «بحبل غير موثق». \n5. في الأصل: «رمت حظى»، صوابه في ق والخريدة. \n6. في الأصل: «لأصيرن اليأس»، صوابه في ق والخريدة. \n7. في الأصل: «وله من قصيدة غير هذه» وأثبت ما في ق والخريدة. \n8. ق: «الصدور»، وهما صحيحان، يقال صدر يصدر صدرا وصدورا.",
    "book_id": "957",
    "new_page_number": 40
  },
  {
    "serial_number": "6271056",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 42,
    "volume_number": 1,
    "text": "ويذمّ الضّراعة، ويتأسّف على إذالة خدّه، وإراقة ماء وجهه: لهفى لملك قناعةٍ لو أنني … متعت فيه بعزه المتملكِ ولكنزِ يأسٍ كنتُ قد أحرزتُه … لو لم تعثْ فيه الخطوبُ وتفتكِ آليتُ أجعلُ ماء وجهي بعده … كدمٍ يهلُّ به الحجيجُ بمنسك وأخٍ من الصبر الجميل قطعته … في طاعة الأمل الذي لم يدرك يا قاتلَ الله الضرورة حالةً … أيَّ المسالكِ بالفتى لم تسلك (1) كم بات مشكوّ إليه [تحيفت … حلقاته قرعا] براحةِ ممسك (2) وفمٍ على قدم رمت، ونواظر … كحلت محاجرها بموطئ سنبك (3) ومسربل بالصبر والتقوى دعت … فأجامها في معرض المتنسك (4) ظلت تصرفه كتصريف العصا … رأسَ البعير لمبرك عن مبرك وله إلى رئيس كان يكلفه زيارته ويقعد عن ذلك تعاظما وتكبراً: أكبرتَ نفسك أن تسعى مصادفةً … وسمتنيه لقد كلفتني شططا (5) لا تكذبنَّ فما كنّا لنوجب من … حقٍ وأنت تراه عنك قد سقطا لو بعتك النفس بيعاً كنت تملكها … به لكان عليك العدل مشترطاً (6) فهل سبيلٌ إلى أن لا تواصلني … ولا تكلف مثلى هذه الخططا (7) عسى صحيفةُ ما بيني وبينك أن … تطوى وما ضمّنت غير الذي فرطا (8)",
    "foot_note": "1. هذا ما في ق والخريدة، وفي الأصل: يا قاتل اللّه الضرورة إنها \n…. سلكت مهالك بالفتى لم تسلك \n2. في الأصل: «لم يأت»، وصواب البيت وتكملته من ق والخريدة. \n3. هذا البيت ساقط من الأصل. \n4. في الأصل: «ومسربل بالنصر»، صوابه في ق والخريدة. \n5. في الأصل والخريدة: «مصارفة» بالراء، وأثبت ما في ق. \n6. ق والخريدة: «به على لكان العدل». \n7. في الأصل: «ولا تكلف مثلي الطرق والخططا»، صوابه في ق والخريدة. \n8. في الأصل: «وما قد من أمرنا فرطا»، صوابه في ق والخريدة.",
    "book_id": "957",
    "new_page_number": 41
  },
  {
    "serial_number": "6271057",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 43,
    "volume_number": 1,
    "text": "وله (1) في صدر رسالة: أتى كتابك عن سخط فآنسنى … بما تضمن أنس العين بالوسنِ (2) قرأته فجرت في كلّ جارحة … منّى معانيه جرى الماء في الغصن (3) فما أقول بعثتَ الروح فيه إلى … قلبي ولكن بعثتَ الروح في بدني وله في شدة أصابته: يا مستجيبَ دعاء المستجير به … ويا مفرج ليلِ الكربة الداجي قد أرتجت دوننا الأبوابُ وامتنعت … وجلَّ بابك عن منعٍ وإرتاج تخافُ عدلك أن يجري القضاءُ به … ونرتجيك فكن للخائف الراجي (4) ومن شعرائها المشهورين أبو الطاهر بن إسماعيل بن محمد المعروف بابن مكنسة (5) ، وهو شاعر كثير التصرف، قليل التكلف، مفتن في وشي (6) جد القريض وهزله، وضارب بسهم في رقيقه وجزله. وكان في ريعان شبيبته، وعنفوان حداثته، يعشق غلاماً من أبناء عسكرية المصريين، يدعى عز الدولة فائق، وهو الآن بمصر من رجال دولتها المعدودين وأكابرها المقدمين. ولم يزل مقيما على عشقه له، وغرامه به إلى أن محا محاسنه الشعر، وغير معالمه الدهر. ولم يزل معز الدولة (7) هذا متعهّدا له محسنا إليه، مشتملا عليه، إلى أن فرق الدهر بينهما. وكان في أيام أمير الجيوش بدر الجمالي منقطعاً إلى عامل من النصارى يعرف بأبى مليح،",
    "foot_note": "1. بعد هذه الكلمة في الأصل بياض بقدر صفحتين من الأصل، وقد أمكنني سد هذه الثلمة من ق والخريدة. والقدر المشترك بين ق والخريدة ينتهى إلى كلمة «الراجي» ختام الأبيات الجيمية التالية، ثم تنفرد «ق» بإتمام النقص الذي سأنبه على نهايته. \n2. في الخريدة: «فأبأسنى»، تحريف صوابه في ق والطالع السعيد. وصدره في الطالع السعيد (222): «وافى كتابك». \n3. في الطالع السعيد: «نفخت الروح». \n4. إلى هنا ينتهى القدر المشترك من التكملة بين ق والخريدة، ثم تنفرد «ق». \n5. ترجم له ابن شاكر في الفلوات (1: 26) وقال: «توفى في حدود الخمسمائة». \n6. في الأصل: «وعى». \n7. سبق قريبا بلفظ «عز الدولة فائق» وهكذا وردا بالأصل.",
    "book_id": "957",
    "new_page_number": 42
  },
  {
    "serial_number": "6271058",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 44,
    "volume_number": 1,
    "text": "وأكثر أشعاره فيه، فلما انتقل الأمر إلى الأفضل تعرّض لامتداحه، فلم يقبله ولم يقبل عليه، وكان سبب حرمانه ما سبق لأبي مليح ومراثيه ميتا، لا سيما قوله: طويت سماء المكرما … تِ وكورت شمسُ المديحِ ما كان بالنكس الدن … ي من الرجال ولا الشحيح كفر النصارى بعد ما … عقدوا به دين المسيح وكفله عز الدولة بن فائق، وقام بحالة إلى أن مات. ولم يقبل الأفضل على أحد من الشعراء كإقباله على رجل من أهل معرة النعمان (1) يدعى أبا الحسن علي بن جعفر بن النون (2) فإنه أفاض عليه سحائب إحسانه، وأدر له حلوبة إنعامه، ولقبه بأمين [الملك (3) ] وأدناه واستخلصه، ولم يكن شعره هناك (4) بل كان متكلفاً متعسفاً، ولست أعرف أحداً من أهل تلك البلاد يروي له بيتاً واحداً فما فوقه، لمنافرة الطباع كلامه، ونبو الأسماع عن طريقته. وقد كان أمره الأفضل يوماً أن يصف مجلساً عبّيت فيه فواكه ورياحين، فقال من مزدوجته (5) يصف الأترج المصبع: كأنما أترجه المصبعُ … أيدي جناة من زنود تقطع فغلط ولم يفطن، وأساء أدبه ولم يشعر؛ لأنه قصد مدح الأترجّ فقذر نفس الملك منه وصرفها عنه، ولو قصد ذمة لما زاد على ما وصف به من الأيدي المقطوعة من زنودها. والبليغ الحاذق من إذا وصف شيئاً أعطاه حقه، ووفاه شرطه، ووصفه بما",
    "foot_note": "1. إلى هنا ينتهى السقط الذي نبهت عليه في أول الصفحة السابقة. \n2. ق: «النوين». \n3. هذه من ق. \n4. في الأصل: «هناك بالجيد» صوابه، في ق، وكلمة «بالجيد» مقحمة. \n5. في الأصل: «مزدوجات» صوابه في ق.",
    "book_id": "957",
    "new_page_number": 43
  },
  {
    "serial_number": "6271059",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 45,
    "volume_number": 1,
    "text": "يناسبه في حالتي مدحه وذمه، ووضع كل شيء في مكانه في نثره ونظمه (1) . فأين هذا الشاعر في أدبه وحذقه بالصناعة (2) وفطنته، من أبي علي الحسن ابن رشيق، وقد أمره المعز بن باديس أن يصف أترجه [مصبّعة (3) ] كانت بين يديه (4) ، فقال مرتجلاً على البديهة: أترجّة سبطة الأطراف ناعمة … تلقى العيونَ بحسنٍ غير مبخوسِ (5) كأنها بسطت كفا لخالقها … تدعو بطول بقاء لابن باديس ولو أن ابن الرومي قصد مدح الورد بقوله: يا مادحَ الورد ما ينفك من غلطه (6) … أما تأملته في كفِّ ملتقطه كأنه سرم بغلٍ حين يبرزه … عند الخراء وباقي الروث في وسطه لكان غالطاً أو جاهلاً أو غافلاً، بل قال ذلك حين قصد ذمه وأراد تخسيسه. فانظر هذا التشبيه الذي لم يسمع أعجب منه. فلعن اللّه شيطانه (7) ! وكذلك عبد الله بن المعتز في قوله يصف القمر من أبيات: وبات كما سَرّ حساده … إذا رام قرباً من النوم شذّ (8) تفزّزه سروات البعوضِ … في قمر مثل ظهر الجرذ (9) وقول ابن المعتز في القمر من أبيات: يا سارقَ الأنوارٍ من شمس الضحى … يا مثكلى طيب الكرى ومنغّصى",
    "foot_note": "1. ق: «من نثره ونظمه». \n2. ق: «ومعرفته بالصناعة». \n3. هذه من ق. \n4. في الأصل: «كانت في يده»، وأثبت ما في ق. \n5. مبخوس: منقوص. وفي الأصل «منحوس»، صوابه في ق. \n6. هذا ما في ق. وفي الأصل: «من غلط». \n7. هذا ما في ق. وفي الأصل: «فلعن اللّه ذلك». \n8. في ديوان ابن المعتز (2: 116): «كما سر أعداءه». \n9. في الأصل: «فمن قمر»، صوابه من الديوان.",
    "book_id": "957",
    "new_page_number": 44
  },
  {
    "serial_number": "6271060",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 46,
    "volume_number": 1,
    "text": "أمّا ضياء الشمس فيك فناقصٌ … وأرى حرارة نارها لم تنقص لم يظفر التشبيهُ فيك بطائل … متسلخاً بهقاً كجلد الأبرص (1) وهذا باب لو استقصيناه لطال واتسع (2) ، فلنتركه ولنصل من حبلنا ما انقطع (3) . وقال إسماعيل بن مكنسة (4) من قصيدة: أعاذلُ ما هبت رياحُ ملامةٍ … بنار هوىَ إلا وزادت تضرّما فكلنى إلى عين إذا جفّ ماؤها … رأت من حقوق الحبّ أن تذرف الدّما فكم عبرة أعطت غرامي زمامها … عشيةَ أعملن المطيَّ المزمما وعين حماها أن يلمّ بها الكرى … أحاديث أيام تقضين بالحمى ولله قلبٌ قارعته همومه … فلم يبق حدٌّ منه إلا تثلما (5) وله من أخرى: دقت معاقد خصره فكأنها … مشتقة من عهده وتجلدي (6) وتجعدت أصداغه فكأنها … مسروقة من خلقه المتجعّد (7) [ومنها (8) ]:",
    "foot_note": "1. في الديوان: «منك بطائل». وفي الأصل: «بمسلخ»، صوابه في ق. وفي الديوان: «مسلخ». \n2. هذا ما في ق. وفي الأصل: «لو استقصيته لاتسع». \n3. هذا ما في ق. وفي الأصل: «من غرضنا ما انقطع». \n4. ق: «أبو الطاهر بن مكنسة»، وكلاهما صحيح. \n5. في الأصل: «مثلما»، وأثبت ما في ق والخريدة (2: 301). \n6. في الأصل: «من قده»، صوابه في ق وفي الخريدة (2: 299) «من تيهه»، وليست بشئ. \n7. في الأصل: «من شعره»، وأثبت ما في ق والخريدة، \n8. هذه من ق.",
    "book_id": "957",
    "new_page_number": 45
  },
  {
    "serial_number": "6271061",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 47,
    "volume_number": 1,
    "text": "ما باله يجفو وقد زعم الورى … أنّ الندى يختصّ بالوجه الندي (1) لا يخدعنك وجنةٌ محمرّة … رقّت ففي الياقوت طبع الجلمد وله من قصيدة: وعسكرىّ أبداً حيثما … تلقاه يلقاكَ بكلِّ السلاح حاجبه قوس وأجفانه … نبلٌ وعطفاه تثنى الرماح [راح وفعل الراح فيه كما … يفعل بالغصن نسيم الرياح (2) أغار في هذا البيت الأخير على خالد الكاتب في قوله: رأت منه عيني منظرينِ كما رأت … من الشمس والبدر المنيرِ على الأرضِ (3) عشيةَ حياني بوردٍ كأنه … خدودٌ أضيفت بعضهن إلى بعض (4) [وناولني كأساً كأنَّ مزاجها … دموعيَ لما صدَّ عن مقلتي الغمض (5) ] وراح وفعل الراح في حركاته … كفعل نسيم الريح في الغصن الغضِّ وأما البيت الذي قبله (6) فقد تداوله الشعراء. ومن مليح ما وقع فيه قول بعض أهل العصر: بي من بني الأصفر ريمٌ رمى … قلبي بسهم الحور الصائب سهمٌ من اللحظ رمتني به … من كثب قوسٌ من الحاجب كأنما مقلته في الحشى … سيفٌ علىّ بن أبي طالب وله في ورق كاغد أهدى إليه:",
    "foot_note": "1. كلمة «يجفو» ساقطة من الأصل. وإثباتها من ق والخريدة. \n2. البيت ساقط من الأصل، وإثباته من ق والخريدة (2: 301). \n3. في الأصل: «كأنما هو الشمس»، وأثبت ما في ق والخريدة. \n4. في الأصل: «على بعض»، وأثبت ما في ق. \n5. هذا من الخريدة فقط. \n6. يعنى قوله: حاجبه قوس وأجفانه \n…. نبلٌ وعطفاه تثنى الرماح",
    "book_id": "957",
    "new_page_number": 46
  },
  {
    "serial_number": "6271062",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 48,
    "volume_number": 1,
    "text": "أهدي لنا ورقاً أر … قَّ من الشراب المستحيل خلقا تمزقه الخطو … ط كأنه عرض البخيل لا بالصبيغ ولا الصقي … ل ولا العريض ولا الطويل إلا بياضاً خلته … وضحاً على جسم نحيل (1) وقد استوفى بعض أهل العصر هذا المعنى، فقال يذكر رزمة كاغد أخرجت إليه من خزانة السلطان، تستعمل في ديوان الإنشاء، وكان بعض كتاب الديوان يسرق الكاغد، فسلمت تلك الرزمة منه لدمامتها وخسة ثمنها: وكاغدٍ يشبه حالاتنا … في كلّ معنى ويحاكيها جنّس للخطّ به صورة … لا شيء في القبح يدانيها (2) ينفذ في صفحته كلُّ ما … ترسمهُ أقلامنا فيها نودعه مكنون أسرارنا … وهو إلى الألحاظ يفشيها مختلف الأجزاء مستخشن … تلمسه الكفُّ فيدميها كجلدة الأبرصِ في لونه … وصفاً على الحق وتشبيها لو كان خلقاً كان مستبشعاً … أو كان خلقاً كان تشويها يعثر الأقلام حتى ترى … مفلولة فيه مواضيها (3) يتركها تشبه أعجازها … في عدم البرى هواديها (4) من بعد ما ضاهى بأطرافها … أطراف سمر الخطّ باريها (5)",
    "foot_note": "1. هذا البيت ساقط من ق. \n2. في الأصل: «فيها ما يدانيها»، صوابه من ق. \n3. يقال أعثره إعثارا وعثره تعثيرا. وفي الأصل: «يغير الأقلام» وأثبت ما في ق. \n4. الكلمة الأولى ساقطة من الأصل، كما سقطت كلمة «البرى» ونصف الكلمة التي بعدها، وإتمامه من ق. وفي ق: «في قدم البرى»، ووجهه ما أثبت من الأصل. وهواديها بمعنى أوائلها، أي رءوسها. \n5. ورد البيت في الأصل مبتورا، منتهيا بكلمة «أطراف» وإتمامه من ق.",
    "book_id": "957",
    "new_page_number": 47
  },
  {
    "serial_number": "6271063",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 49,
    "volume_number": 1,
    "text": "وتفعل الأنملُ في جريها … كالبرق … يها (1) وكم غدا يسلبها جاهداً … من كان بالنفس يفديها يقول من يبصر أطباقه … شلت يدٌ باتت تعبيها قد عبث السوس بأوساطها … وقرض الفأرُ حواشيها (2) لو عرضت رزمتهُ لم تجد … مشترياً في الخلق يشريها لو بذل الفلس بها غالطاً … أوسع تضييعاً وتسفيها (3) لا يرزأ السارقُ منها ولا … يغتالها من حيلة فيها (4) تحصى الحصى مستوفيا عدّه … من قبل أن تحصى مساويها (5) من ذم ذا نقصٍ وذا خسةٍ … فهو بذاك الذم يعنيها (6) وقال أبو الطاهر (7) : قلت إذ عقربَ الدلا … لُ على خده الشعر هذه آيةٌ بها … ظهر الحسنُ وانتشر ما رئى قبلَ صدغه … عقربٌ حلت القمر (8) هذا معنى مليح ولكنه سرقه من بيتين أنشدنيهما بمصر رجل يسمى أبا محمد التكريتي، من تلاميذ أبي حامد الغزالي، لأبي حامد، ولم أسمعها من غيره:",
    "foot_note": "1. كذا جاء البيت في الأصل، وهو ساقط من ق. \n2. في الأصل: «بأطرافها»، والوجه ما أثبت من ق. \n3. تضييعا كذا وردت. \n4. في الأصل: «نعبا لها» صوابه في ق. و «من حيلة» هي في الأصل وق: «في حيلة». \n5. مستوفيا عده، مكانها بياض في الأصل، وإثباتها من ق. \n6. كلمة «وذا خسة» موضعها أبيض في الأصل، وإثباتها من ق. \n7. هو أبو الطاهر إسماعيل بن محمد، المعروف بابن مكنسة، وقد سبق التنبيه على اسمه في ص 43. \n8. في الخريدة (2: 302): «ما رئي قط قبل ذا».",
    "book_id": "957",
    "new_page_number": 48
  },
  {
    "serial_number": "6271064",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 50,
    "volume_number": 1,
    "text": "حلت عقارب صدغه في خده … قمراً فجلّ بها عن التشبيه (1) ولقد عهدناه يحلُّ ببرجها … فمن العجائب كيف حلت فيه وقال أبو الطاهر أيضاً من قصيدة وقد عزم عليه بعض الأمراء في الخروج (2) معه إلى الشام لقتال الغز (3) ، أولها: غير عاصٍ عليك تقويم عودي … فانقصى من ملامتي أو فزيدي (4) قل لمولاي إذ دعاني لأمر … قمت فيه له مقامَ العبيد ضعفت حيلتي وقل غنائي … ودنت غايتي ورثّ جديدى (5) أنا ما لي وللشآم وإني … لأرى نار حربها في وقود بلد جنّه عفارية الغ … زَّ وأرضٌ وحوشها من أسود (6) والجفار التي تقول إذا ما … قيل هلا امتلأت: هل من مزيد (7) وكأن بي على بعيرٍ تراني … آخر الناس في لفيف الحشود (8) أسود الوجه ناظرا في أمور … معضلات من الحوادث سود",
    "foot_note": "1. وكذا روى في وفيات الأعيان، في ترجمة أبى حامد الغزالي. وفي الخريدة وق: «ويجل به عن التشبه». قال ابن خلكان: «ورأيت هذين البيتين في موضع آخر لغيره». \n2. ق: «في المسير». \n3. في اللسان والقاموس أن «الغز» جنس من الترك. وانظر ابن الأثير (9: 141 - 147). \n4. في الأصل: «غير عاض» صوابه من الخريدة (2: 308). وفي ق: «عاس» يقال عسا إذا اشتد. \n5. الغناء، بالفتح: النفع. وفي الأصل: «عنائي» صوابه في ق والخريدة (2: 308). \n6. في الأصل: «حنة» صوابها في ق والخريدة. والعفارية بياء قبل الآخر: جمع عفرية، وهو العفريت. وفي الأصل: «عفاربه» وفي ق والخريدة: «عفارته» صوابهما ما أثبت. انظر اللسان (عفر 263). \n7. الجفار: جمع جفرة بالضم، وهي الحفرة الواسعة المستديرة. وفي الأصل وق: «الذي يقول» صوابه في الخريدة. وفي الخريدة: «قيل امتلأت هل مزيد»، وفي ق: «قل هل امتلأت» ولا يستقيم الوزن بأحدهما. والوجه ما أثبت. \n8. في الأصل: «وكأني على»، وأثبت ما في ق والخريدة.",
    "book_id": "957",
    "new_page_number": 49
  },
  {
    "serial_number": "6271065",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 51,
    "volume_number": 1,
    "text": "وإذا قيل في غدٍ يلتقي النا … س فلا تنسَ فهو بيت القصيد حيث لا ناظرى تراه حديدا … حين يبدو له بريق الحديد حيث لا يتّقى لساني ولا يث … نى عنان المغير عنّى نشيدى (1) إن رأيي إذا يسدد نحوي … سهم رامٍ لغير رأي سديد (2) فإذا ما قتلتُ كنت خليقاً … بدخولي جهنما وخلودي فاقلني عثارها وابقَ للمج … د وكبتِ العدى وغيظِ الحسود (3) وقال من قصيدة في طريقة أبي الشمقمق (4) : أنا الذي حدّثكم … عنه أبو الشمقمق وقال عني إنني … كنت نديم المتقى وكنت كنت كنت كن … ت من رماة البندق حتى متى ألفي كذا … تيساً طويل العنق (5) بلحية سابلة … وشارب محلّق (6) [يا ليتها قد خلقت … من وجه شيخ حلقى (7) ] وقال (8) من أخرى: عشت خمسين بل تزي … د رقيعا كما ترى",
    "foot_note": "1. ق: «رأس البعير عنى»، وفي الخريدة: «زمام البعير». \n2. ق والخريدة: «إذا تسدد نحوى»، يقال سدده فتسدد. \n3. ق والخريدة: «وابق للحمد». \n4. ق: «أبو الرقعمق»، وهو شاعر آخر وليس مرادا. أما أبو الشمقمق فهو مروان ابن محمد وكان معاصرا لبشار وأبى نواس. وترجمته في «تاريخ بغداد» 7128 وابن خلكان في تضاعيف ترجمة يزيد بن مزيد. ولم يفرد له ترجمة. وأما أبو الرقعمق فهو أبو حامد أحمد بن محمد الأنطاكي، وترجم له الثعالبي في اليتيمة (1: 238) وابن خلكان في الوفيات (1: 41). \n5. ق والخريدة: «حتى متى أبقى». \n6. في اللسان: «يقال سبل سابل». وفي الخريدة: «بلحية مسبلة». \n7. البيت من ق والخريدة. والحلقى: المأبون، وجاءت في أصلها: «حلق» محرفة. \n8. في الأصل: «وقوله»، صوابه في ق.",
    "book_id": "957",
    "new_page_number": 50
  },
  {
    "serial_number": "6271066",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 52,
    "volume_number": 1,
    "text": "أحسبُ المقل بندقاً … وكذا الملحَ سكراً (1) وأظنُّ الطويل من … كل شيء مدورا قد كبر بر ببر ببر … ت وعقلي إلى ورا عجباً كيف كلُّ شي … ءٍ أراه تغيرا لا أرى البيض صار يؤ … كل إلا مقشرا وإذا دق بالحجا … ر زجاجٌ تكسرا وإذا مات ميت … لا يشمنّ عنبرا (2) ومن شعراء المصريين زماننا هذا من يقول - وهو أبو مشرف الدجر جاوى (3) ، وهو منسوب إلى دجرجا، وهي ضيعة (4) بالصعيد الأعلى: قاضٍ إذا انفصل الخصمان ردهما … إلى الخصام بحكم غير منفصل يبدي الزهادةَ في الدنيا وزخرفها … جهراً ويقبل سراً بعرةَ الجمل ومنهم من يقول، وهو أبو الحسن علي بن البرقي، من أهل قوص: رماني الدهرُ منه بكلِّ سهمٍ … وفاجأني ببين بعد بين (5) وجمع في فؤادي كلَّ حزنٍ … وفرق بين أحبابي وبيني ففي قلبي حرارةُ كلَّ قلب … وفي عيني مدامعُ كل عين وله من أبيات: ولي سنةٌ لم أدر ما سنةُ الكرى … كأن جفوني مسمعي والكرى العذل (6)",
    "foot_note": "1. المقل: ثمر الدوم. وفي الأصل: «البقل»، وفي ق والخريدة: «المصل» والوجه ما أثبت. وفي الأصل: «سكرا. وأحسب الملح سكرا»، صوابه في ق والخريدة. \n2. البيت ساقط من ق والخريدة. وفي الأصل: «لا يسمن»، تحريف. \n3. قال ياقوت، عند الكلام على دجرجا: «قد خرج منها شاعر متأخر يعرفه المصريون يقال له (أبو) المشرف. وله شعر جيد» وفي الأصل: «الدجرجراى» صوابه في ق والخريدة. \n4. في الأصل: «إلى ضيعته دجرجرا وهي»، صوابه في ق. \n5. في ق ركب صدر هذا البيت على عجز تاليه فصارا بيتا واحدا. وكذا جاء في الطالع السعيد للأدفوى 219 \n6. في الأصل: «وبين جفوتى» صوابه في ق والخريدة والطالع السعيد. والكلمة الأخيرة من البيت ساقطة من الأصل وإثباتها من النسخ الثلاث.",
    "book_id": "957",
    "new_page_number": 51
  },
  {
    "serial_number": "6271067",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 53,
    "volume_number": 1,
    "text": "ومنهم من يقول، وهو أبو محمد عبد الله بن الطباخ الكاتب، يهجو رجلاً أوقص. أنشدتهما لأبي الحسن [علي بن (1) ] الصوفي الحنبلي (2) : قصرت أخادعه وغاض قذاله … فكأنه متوقع أن يصفعا (3) وكأنه قد ذاق أول درة … وأحس ثانية لها فتجمعا ومنهم من يقول، وهو أبو عبد الله محمد بن مسلم الكاتب: تعسّفها الحادي وقد هجر الفلا … ومرّ عليها الخمسُ يتبعه العشر (4) وأنحلها لفحُ الهجير كأنّه … هوى وهو قلب قد أضرّ به الهجر ومنهم من يقول، ولا أتحقّق إسمه، في رجل يلقب بالرشيد (5) : شتان ما بين الرش … يد وبين هارونَ الرشيد هذا يعزّر بالجلو … د وذا يعزز بالجنود (6) ومنهم من يقول، وهو محمود بن ناصر الإسكندري (7) كاتب القاضي ابن حديد، في طبيب أعلم مشوه الخلق: صديقنا المستطبُّ نادرةٌ … قد أخذت منه أعينُ الناس (8) أنياب غول ومشفرا جملٍ … ورأس بغل وذقن نسناس ومنهم من يقول، وهو أبو نصر ظافر بن قاسم المعروف بالحداد (9) من أهل الإسكندرية، وكتب إلىّ بها في رسالة:",
    "foot_note": "1. هذه من ق. \n2. ق: «الجبلي». \n3. في الأصل: «وغاب قذاله»، وأثبت ما في ق. \n4. في الأصل: «تعشقها»، صوابه ما في ق. \n5. في الأصل: «يسمى هارون الرشيد»، وأثبت ما في ق. \n6. التعزير: ضرب للتأديب دون الحد. وهذا هو الوضع الصحيح للبيت كما في الأصل. وجاء على العكس في ق وليس بشئ: هذا يعزز بالجنو \n…. د وذا يعزز بالجلود \n7. ق: «الإسكندرانى». \n8. في الأصل: «قد أخذتها من أعين الناس»، صوابه في ق والخريدة. \n9. ترجم له ابن خلكان في «وفيات الأعيان»، وياقوت في «إرشاد الأريب» وذكر أنه توفى سنة 529.",
    "book_id": "957",
    "new_page_number": 52
  },
  {
    "serial_number": "6271068",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 54,
    "volume_number": 1,
    "text": "وما طائرٌ قصَّ الزمانُ جناحه … فأعدمه وكراً وأفقده إلفا تذكر زغباً بين أفنانِ أيكةٍ … خوافي الخوافي ما يطرن بها ضعفا إذا التحف الظلماءَ ناجى همومه … لترجيع لحنٍ كاد من رقّة يخفى (1) بأشوق منى إذ أطاعت بكَ النوى … هوائيةٌ مائيةٌ تسبق الطرفا تولت وفيها منك ما لو أقيسه … بما هي فيه كان في فضله أوفى (2) وقال أيضا: رحلوا فلولا أنّنى … أرجو اللّقا لقضيت نحبي (3) والله ما فارقتكم … لكنني فارقت قلبي (4) ومنهم من يقول، وهو أبو القاسم بن رشد (5) المصري: وكم قائلٍ ليَ سافر إلى … بلاد العراق تقع في الرخاء (6) لعمري لقد صدقوا قد وقع … ت وسط الرخاء بتقديم خاء ومنهم من يقول - وهو الناجي المصري - يهجو حماما: إن حمامنا الذي نحنُ فيه … هو في حاجةٍ إلى حمامِ قد دخلنا ونحن أولاد سامٍ … وخرجنا ونحن أولاد حامِ وقال بعض أهل العصر في هذا المعنى: حمامنا هذا أشد ضرورة … ممن يحلُّ به إلى حمامِ تبيضُّ ألوان الورى في غيره … ويعيرها هذا ثيابَ سخام قد كنتُ من سامٍ فحين دخلته … لشقاء جدي ردني من حام (7) ومنهم من يقول، وهو أبو الحسن مروان بن عثمان: تمكّن منى السّقم حثّى كأنني … توهّم معنى في خفىّ سؤال",
    "foot_note": "1. ق: «من دقة». \n2. ق: «كان في وصفه وفي». \n3. ق: «أرجو الإياب قضيت نحبى». \n4. ق: «واللّه ما فارقتهم». \n5. في الأصل: «بن زبيد» وأثبت ما في ق. \n6. ق: «الرخا» بالقصر، وكذا «خا» بالقصر في البيت التالي. \n7. في الأصل: «دخلتها»، صوابه في ق والخريدة (2: 305).",
    "book_id": "957",
    "new_page_number": 53
  },
  {
    "serial_number": "6271069",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 55,
    "volume_number": 1,
    "text": "[ولو سامحت عيناه عينيَّ في الكرى … لأشكل من طيف الخيال خيالي (1) ] سمحت بروحي وهي عندي عزيزةٌ … وجدت بقلبي وهو عنديَ غالي وقد خفتُ أن تقضى علىّ منيتي … ولم أقضِ أوطاري بيوم وصال (2) وهونَ ما ألقي من الوجد أنه … صدودُ دلال لا صدودُ ملال فلو كان ذاك الصدُّ منه ملالة … شددت عن الدنيا مطىّ رحالى (3) هذا من قول العباس بن الأحنف: لو كنتِ عاتبةً لسكن لوعتي … أملي رضاك وزرتُ غير (4) [مراقب لكن صددتِ فلم تكن ليَ حيلة … صدُّ الملول خلاف صدّ العاتب ولمروان: ما بالِ قلبك يستكينُ … أبه غرام أم جنونُ (5) برحَ الخفاء بما تج … نُ، فأذهب الشك اليقين حتى متى بين الجوا … نح والضلوع هوىً دفين وإلى متى قلبُ المت … يم في يد البلوى رهين يا ماطلى بديونِ قل … بي آنَ أن تقضي الديون شخصت له فيك العيو … نُ وقسمت فيك الظنون وسلبتَ ألباب الورى … بلواحظٍ فيها فتون وقوام أغصان الريا … ض وأين تدركك الغصون الحسن في الأغصان … فنّ وهو في هذا فنون",
    "foot_note": "1. البيت من الخريدة (2: 203). \n2. في الأصل: «منية»، وأثبت ما في ق والخريدة. \n3. هذا البيت ساقط من ق. \n4. بعد هذا بياض في الأصل بقدر نحو صفحتين، وقد أكملته من ق والخريدة (2: 204)، والقدر المشترك بينهما في التكملة هو السطر الأخير فقط مما وضع بين معكفين، وأما سائر التكملة فهو من الخريدة فقط. \n5. يجوز في رويه الإسكان والتحريك.",
    "book_id": "957",
    "new_page_number": 54
  },
  {
    "serial_number": "6271070",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "الرسالة المصرية",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 56,
    "volume_number": 1,
    "text": "من أين للأغصان ذا … ك الغنجُ والسحر المبين أم ذلك الورد الجن … ي بخده والياسمين ومنهم من يقول، وهو أبو إسحاق إبراهيم بن الأشعث]: إذا حل محمودٌ بأرضٍ فإنه … يفجر فيها من ندى كفه عينا (1) فتنبت نوراً مشبهاً لهباتهِ … يرى ورقاً بعض وبعض يرى عينا (2) وله في غلام مليح أسمر: يا ذا الذي ينفق أمواله … في حبِّ هذا الرشا الفائق (3) ما الذهب الصامت مستكثراً … إذهابه في الذهب الناطق (4) ومنهم من يقول في معشوق له تمتام، وهو محمود بن إسماعيل بن حميد الدّمياطى: تمتمة تمّ غرامى بها … وعارضٌ عرضني للسقام ووفرةٌ همي بها وافر … وحاجب حجب عنّى المنام (5) وله من أبيات يصف الخمر: وبتّ ليلي أرى النار التي سجدت … لها المجوس من الإبريق تسجد لي هذا - أطال الله بقاء الحضرة السامية - ما أملاه الخلد، على اليد، في مدة متقاربة الطرفين، ضيقة ما بين الحاشيتين. فإن تراخت المدة استدركت الفائت (6) واستلحقت الناقص، إن شاء اللّه تعالى. نجزت يوم الثلاثاء تاسع عشر ذي القعدة عام 1091 بأدرنة.",
    "foot_note": "1. في الأصل: «غيثا»، صوابه في ق والخريدة. والعين في هذا: الينبوع الجاري. \n2. في الأصل «غيثا»، صوابه في ق والخريدة. والورق: الفضة، تقال بفتح الراء وكسرها، وفتح الراء هنا أوفق للصناعة. والعين في هذا البيت بمعنى الذهب. وفي ق والخريدة: «يرى ورقا بعضا وبعضا يرى» وتقرأ: «يرى» بهذه الرواية على أنها مضارع أرى. \n3. ق: «الأسمر الفائق». \n4. في الخريدة: «مستنكرا»، وفي الأصل: «ذهابه»، وأثبت ما في ق والخريدة (2: 205). \n5. في الأصل: «الملام»، صوابه في ق. \n6. في الأصل: «الفائق»، صوابه في ق.",
    "book_id": "957",
    "new_page_number": 55
  }
]