[
  {
    "text": "Al-Dayarat (The Monasteries)\nAuthor: علي بن الحسين بن محمد بن أحمد بن الهيثم المرواني الأموي القرشي أبو الفرج الأصبهاني\nYear: 356",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Dayarat (The Monasteries)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6872\nbook_title: الديارات\nbook_link: https://shamela.ws/book/725\nbook_id: 725\nauthor_name: علي بن الحسين بن محمد بن أحمد بن الهيثم المرواني الأموي القرشي أبو الفرج الأصبهاني\nauthor_year: 356\nnickname: أبو الفرج\nauthor_link: https://shamela.ws/author/732\nauthor_ID: 732\neditor: Null\npublisher: Null\nedition: Null\npages: 30\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Dayarat (The Monasteries)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6270576",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Journeys. Book: Al-Dayarat (The Monasteries). Author: Ali bin al-Husayn bin Muhammad bin Ahmad bin al-Haytham al-Marwani al-Umayyad al-Qurashi, Abu al-Faraj al-Isfahani (died 356 AH). [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 30. Date of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.\nBook: Al-Dayarat (The Monasteries). Author: Ali bin al-Husayn bin Muhammad bin Ahmad bin al-Haytham al-Marwani al-Umayyad al-Qurashi, Abu al-Faraj al-Isfahani (died 356 AH). [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 30. Date of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Ali bin al-Husayn bin Muhammad bin Ahmad bin al-Haytham al-Marwani al-Umayyad al-Qurashi, Abu al-Faraj al-Isfahani (died 356 AH). [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 30. Date of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered and does not correspond to the printed version]. Number of pages: 30. Date of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 30. Date of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Al-Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 3
  },
  {
    "serial_number": "6270577",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Chapter One: News of the Monasteries\n\nDayr Ablaq (The Piebald Monastery)\nDayr al-Ablaq: A monastery in Ahwaz [Ahvaz, Iran], then in Kawara in the district of Ardashir-Khwarrah [Firuzabad, Iran]. Ahmed bin Muhammad bin al-Hasan al-Asadi and Amr bin Abdullah al-Ataki told me, saying: Al-Riyashi told us: That Haritha bin Badr was in Kawara for recreation. Al-Ataki said in his report from Abu Ubaidah—which al-Asadi did not say, nor did al-Riyashi go beyond it—he said: Haritha was in Kawara of Ardashir-Khwarrah and said:\n'Did you not see that Haritha bin Badr...\nstayed at Dayr Ablaq in Kawara?'\nThen he said to the soldiers who were with him: \"Whoever completes this verse, for him is a judgment (reward).\" A man among them said: \"I will complete it, on the condition that you grant me safety from your anger, make me your messenger to Basra [Basra, Iraq], and seek my discharge from the Emir.\" He said: \"That is yours.\" Then he repeated the recitation of the verse to him, and the man said:\n'Residing there drinking pure reddish wine...\nWhenever I said it would knock him down, he spun around.'\nHaritha said to him: \"You have your condition, though if you had said something that pleased us, we would have pleased you.\" Al-Mada'ini recounted saying: He drank the morning draught in Dayr al-Ablaq with a group of his companions, and when he became intoxicated, he said:\n'My day at Dayr al-Ablaq, the unique...\nYou are nothing but the Garden of Eternity!'\n'In it and the likes of it, Abu al-Hindi...\nNever ceased to drive the white camels.'\n\nDayr al-A'la (The Upper Monastery)\nDayr al-A'la in Mosul [Mosul, Iraq]. Beneath the monastery was a large spring known today as Ain Kibrit (Sulfur Spring). Yakut said about it that it appeared under Dayr al-A'la in the year 301 AH (913 AD), and that it contains several minerals: sulfur, marcasite, and vitriol. Professor Gurgis Awad said: The water of this spring is cold in all seasons of the year, and people visit it in summer to bathe in its water, which benefits those among them afflicted with certain skin diseases. Some of them drink a little of its water to relieve the heat of their stomachs.\n- The Palm Sunday (Sha'anin) in this monastery is beautiful; people go out to it and stay there for days drinking. Whatever governors passed through Mosul would stay there.\n- Beside the monastery is the shrine of Amr bin al-Hamq al-Khuza'i, who was a Companion from the companions of Ali bin Abi Talib.\n- Sa'id al-Khalidi said regarding it:\n'A moon at the Upper Monastery of Mosul...\nI am his slave and his love is my master.'\n'He kissed the cross, so I said out of envy...\nMy mouth was more deserving of the beloved's kiss.'\nDayr al-A'la: This monastery is in Mosul at its highest point, overlooking the Tigris and the Zab. It is a large, populated monastery, cited as an example for the fineness of its air and the beauty of its view. It is said that the Christians have no monastery like it due to the gospels and places of worship it contains.\nMuhammad bin Mazid told me, saying: Hammad bin Ishaq told us, saying: Ahmad bin Sadaqa told me, saying: We went out with Al-Ma'mun, and we stopped at Dayr al-A'la in Mosul due to its pleasantness and integrity. The festival of Palm Sunday arrived, so Al-Ma'mun sat in a spot within it that was beautiful and overlooked the Tigris, the desert, and the orchards, and from which one could see those entering the monastery. The monastery was decorated that day in the finest attire. Its monks and priests came out to the altar, and around them were their young men with censers in their hands, wearing crosses and draped in embroidered sashes. Al-Ma'mun saw that and found it beautiful. Then the people dispersed to their cells and their communion. Those slave girls and boys who were with them turned towards Al-Ma'mun, each holding a gift of the aromatic plants of their season, and a group of them holding cups containing types of drink. He drew them near and began taking a greeting from this one and that one, having been captivated by what he saw of them—and there was none among us who was not in this state. During all this, he was drinking while music was playing. Then he ordered the slave girls with him who wore the zunnar (waist sash) to be brought out. Twenty slave girls came out to him, looking like full moons, wearing brocade, with gold crosses on their necks, holding palm leaves and olives in their hands. He said: \"O Ahmad, I have composed verses about these, so sing them to me,\" which are:\n'Gazelles like dinars (gold coins)...\nBeautiful in the chambers.'\n'Palm Sunday has revealed them...\nTo us in the zunnars (sashes).'\n'And they have curled sidelocks...\nLike the tails of starlings.'\n'And they approached with waists...\nLike the waists of wasps.'\nThen he brought out Ni'am, his slave girl, who was a servant, and she sang:\n'You claimed that I was unjust so you abandoned me...\nAnd you shot into my liver with a piercing arrow.'\n'Yes, I wronged you, so forgive and overlook...\nThis is the station of the seeker of refuge, the shelterer.'\n'This is the station of a youth harmed by passion...\nWith wounded eyelids, seeking refuge in the beauty of your face.'\n'And you have taken from my heart its familiarity...\nMay Allah not paralyze the hand of that taker.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 4
  },
  {
    "serial_number": "6270578",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "He was moved and drank, and asked for the song to be repeated several times. Then he said to Al-Yazidi: \"Have you seen anything better than what we are in?\" He said: \"Yes, O Commander of the Faithful, that you thank the One who granted you this so He may increase it for you and preserve it for you.\" He said: \"May Allah bless you, for you have reminded in the place of remembrance.\" Then he ordered thirty thousand dirhams and gave it as charity immediately.\n\nDayr al-Anwar (Monastery of Lights)\nDayr al-Anwar: Near Amorium [Ammuriya, Turkey] in the land of the Romans (Byzantines). Abu Bakr Muhammad bin al-Qasim al-Anbari said: I left Anbar [Al-Anbar, Iraq] on some of my travels to Amorium in the land of the Romans. On the way, I stayed at a monastery called Dayr al-Anwar in a village near Amorium. The master of the monastery, the leader of the monks there, came out to me—his name was Abdul-Masih. He brought me into the monastery, and I found forty monks inside. They honored me that night with good hospitality. Then I departed from them the next day, having seen such diligence and worship from them as I had never seen from anyone else. I accomplished my purpose in Amorium and returned to Anbar. When the following year came, I performed Hajj. While I was circumambulating the Noble House (Kaaba), I saw Abdul-Masih the monk also circumambulating, accompanied by five of his companion monks. When I confirmed his identity, I approached him and said to him:\n- \"Are you Abdul-Masih (Servant of the Messiah) the monk?\"\n- He said: \"Nay, I am Abdullah (Servant of Allah), the seeker of Allah's pardon.\"\nI began kissing his grey hair and weeping, then I took his hand and moved to the side of the Sanctuary. I said to him: \"By the One who guided you, will you not tell me the reason for your Islam?\"\nHe said: It was a wonder! A group of Muslim ascetics and worshippers passed by the village I was in. They sent a young man among them to buy food for them. He saw in the market a Christian girl selling bread, and she was one of the most beautiful women and loveliest in form. When he looked at her, he was captivated by her and fell to his face, fainting. When he recovered, he returned to his companions and informed them of what befell him, saying to them:\n- \"Go about your business, for I am not going with you.\"\nThey rebuked him and preached to him, but he paid no attention to them. So they departed and left him. He entered the village and sat at the door of that woman's shop. She asked him about his need, and he told her that he was in love with her. She turned away from him. He remained in his place for three days eating no food, staring at her face. When she saw that he would not leave her, she went to her family and neighbors and told them. They set the boys upon him to stone him. They stoned him until they crushed his head, smashed his face, and bloodied his ribs, yet he still would not leave. The people of the village resolved to kill him. A man among them came to me and told me of his condition. I went out to him and saw him lying down. I wiped the blood from his face, carried him to the monastery, and treated his wounds. He stayed with me for fourteen days. When he was able to walk, he left the monastery, came to the door of the woman's shop, and sat looking at her. When she saw him, she stood up to him and said:\n- \"By Allah, I have pitied you. Will you enter my religion so that I may marry you?\"\nHe said: \"Allah forbid that I shed the religion of Monotheism and enter the religion of polytheism.\"\nShe said:\n- \"Stand and enter my house with me, satisfy your desire with me, and leave guided.\"\nHe said: \"I am not one to waste the worship of twelve years for the lust of a single moment!\"\nShe said:\n- \"Then leave me.\"\nHe said: \"My heart does not obey me.\"\nShe turned her face away from him. The boys noticed him and advanced upon him, stoning him. He fell on his face saying:\n- \"Indeed, my protector is Allah, who has sent down the Book; and He is an ally to the righteous.\" I left the monastery and came to him, chasing the boys away from him. I lifted his head from the ground and heard him say:\n- \"O Allah, unite me and her in Paradise.\" I carried him to the monastery, but he died before I reached it with him. I took him out of the village, dug a grave for him, and buried him. When night came and half of it had passed, that woman screamed a great scream in her bed. The people of the village gathered to her and asked her about her story. She said:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 5
  },
  {
    "serial_number": "6270579",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "- \"While I was sleeping, that Muslim man entered upon me, took my hand, and took me to Paradise. When he brought me to its gate, its keeper prevented me from entering, saying that it is forbidden to disbelievers. So I accepted Islam at his hand and entered Paradise with him. I saw therein palaces and trees that I cannot describe well to you. Then he took me to a palace of jewels and said: 'This palace is for me and you, and I will not enter it except with you. In five nights you will be with me in it, if Allah Almighty wills.' Then he reached his hand to a tree at the gate of the palace and plucked two apples from it, saying: 'Eat this one, and hide the other until the monks see it.' I ate the apple and never tasted anything better. Then he took my hand and brought me out until I reached my house.\" Then she took out the apple from her pocket, and it shone in the darkness of the night as if it were a brilliant star. They brought the woman to us at the monastery with the apple. We had never seen anything like it among the fruits of Paradise. I took a knife and divided it according to the number of my companions. We never saw anything more delicious than its taste nor better than its scent. We said: \"Perhaps a devil appeared to her to seduce her from her religion.\" Her family took her and left. Then she abstained from eating and drinking. When it was the fifth night, she rose from her bed, left her house, and went to his grave. She threw herself upon it and died, and no one from her family knew of her. When it was morning, two Muslim sheikhs wearing clothes of hair (wool) approached the village, accompanied by two women dressed similarly. They said: \"Allah has a female saint (Waliyah) among you who has died as a Muslim, and we will take charge of her, not you.\" The people of the village sought the woman and found her dead upon the grave. They said:\n- \"This is our companion who died in our religion, and we will take charge of her.\" The dispute and conflict intensified between them. One of the two sheikhs said: \"The sign of her Islam is that the monks of the monastery 'the forty' should gather and pull her from the grave. If she comes with them, she is a Christian. Then one of us will step forward and pull her; if she is pulled with him, she is a Muslim.\" The people of the village agreed to this. The forty monks of the monastery gathered, and we came to her to carry her, but we could not. We tied a thick rope around her waist, and the 'forty monks' pulled all together, but the rope broke, and she did not move. The villagers stepped forward and did the same, but she did not move from her place. When we were unable to move her by any trick, we said to one of the sheikhs: \"You step forward and carry her.\" He stepped forward to her, pulled her by his cloak, and said: \"In the name of Allah, the Most Gracious, the Most Merciful, upon the religion of the Messenger of Allah, peace and blessings be upon him.\" Then he carried her in his lap and went with her to a cave there. He placed her in it, and the two women came and washed and shrouded her. Then the two sheikhs carried her, prayed over her, and we buried her next to the grave of that ascetic. We departed having witnessed all of this. When we were alone with each other, we said: \"The truth is more worthy of being followed, and the truth has become clear to us by witnessing and sight. There is no proof of the validity of the religion of Islam clearer to us than what we have seen.\" Then I accepted Islam, and the 'forty' monks of the monastery and all the people of the village accepted Islam. Then we sent to the land of \"Al-Jazira\" requesting a knowledgeable jurist to teach us the laws of Islam and the rulings of the religion. A righteous jurist came to us and taught us the method of worship and the rulings of Islam, and we are today in great goodness. To Allah belongs the praise and the favor for that.\n\nDayr Bawlus (Paul's Monastery)\nDayr Bawlus in Ramla [Ramla, Palestine/Israel]. Abu al-Faraj said: It is in the district of Ramla. Al-Halabi told me, saying: My father told me: I stayed with Al-Fadl bin Ismail bin Salih bin Ali bin Abdullah bin Abbas at Dayr Bawlus while we were going out towards Ramla. He saw a beautiful girl there, the daughter of a priest there. She served him for three days and gave him aged wine to drink. When he wanted to depart, he gave her ten dinars and said on his way:\n'Peace of Allah be upon you, O monastery, from a youth...\nIn whose soul is a long yearning for you.'\n'May a heavy downpour from the rise of Arcturus never cease...\nUpon you, quenching your soil.'\n'May a cloud guaranteeing the revival of the gardens...\nGive you a second drink, time after time.'\n'When its tears water a land, a view appears...\nThat is beautiful to the eyes of the beholders.'\n'Oh, many a dark night I have cut through...\nWith no companion with me but the sword.'\n'And chilled wine, for which I lit for my companions...\nLamps whose wicks never fade.'\n'A slender, tender girl distracts me with wine...\nUpon whom there seems to be a trustee over hearts.'\n'Deaths roam among them when...\nHer glances begin roaming among hearts.'\n'O daughter of the monastery's priest, my heart is obsessed...\nWith you, and my body, since you became distant, is ailing.'\nAnd regarding it, Abu Sha's says:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 6
  },
  {
    "serial_number": "6270580",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "'O Dayr Yunus, may the rain clouds water your courtyard...\nUntil it is seen looking with blossoms, smiling.'\n'No water in the heat of summer cured a thirst...\nAs your cold water cured the heat of my heart.'\n'And no sorrowful one with illness ever settled in you...\nExcept that illness dissolved away from him.'\n'I seek forgiveness from Allah; how many a coquettish one have I had in you...\nBecause of whom the pen ran against me in your quarters.'\nHe also says:\n'Do not turn away from the daughter of the vine (wine)...\nFor my father's sake! For in it is the health of the body!'\n'If there were no relief in drinking it...\nExcept the deliverance from the hand of worry!'\nAbu Sha's also says:\n'O blamer, there is no way against the likes of me...\nAnd your blaming regarding wine is impossible.'\n'Is not my mount the waist of a boy...\nAnd the saddle of my fingertips a chilled cup?'\n'If the daughters of the vine are my drink...\nAnd the qibla of my face is the beautiful face.'\n'I am safe with these two from the consequence of the nights...\nAnd what the blamer reports is easy for me!'\n\nDayr al-Thaalib (The Foxes' Monastery)\n- Al-Shabushti said: This monastery is in Baghdad [Baghdad, Iraq], on the western side of it, at the place known as Bab al-Hadid (The Iron Gate). The people of Baghdad visit it and recreate in it, and it is hardly ever empty of a visitor or a knocker. It has a festival in which no one from the Christians or Muslims stays behind. Bab al-Hadid is the most populated place in Baghdad and the most pleasant: because of the orchards, trees, palms, and aromatic plants it contains, and for its central location in the city and proximity to everyone. So it is not devoid of idle people, nor is it missed by people of music and pleasures. Its spots are forever populated, and its grounds are packed with picnickers.\n- Al-Biruni mentioned that the festival of Dayr al-Thaalib is the last Saturday of September, unless the first of October of the coming year is a Sunday, in which case the festival is delayed to it and exits September. Thus that year is stripped (of the festival), and it repeats in the coming year twice: at its beginning and its end.\n- Yakut said that it is: A famous monastery, between it and Baghdad is two miles or less, in the district of Nahr Isa, on the road to Sarsar. I saw it myself, and near it is a village called Al-Harithiya.\n- Muhammad bin Umar Ibn Dehqana al-Hashimi has verses of poetry in which the name of the monastery appears, including:\n'Dayr al-Thaalib, the haunt of error...\nAnd the place of every gazelle (sun) and gazelle (boy/girl).'\n- Among the earliest to mention this monastery is Khalifa bin Khayyat. He mentioned it in the events of the year 127 AH, before the establishment of the city of Baghdad. He said in a long report: Al-Dahhak bin Qays advanced from Al-Mada'in intending Kufa, so he camped at Dayr al-Thaalib with three thousand, and the exaggerator says: with four thousand.\n- In the book \"Al-Hawadith al-Jami'ah\" (The Comprehensive Events), there is a mention of this monastery. It said in the events of the year 683 AH:\n- In this year, the Tigris rose greatly, and several areas in the western side of Baghdad flooded, and it reached the domes of Dayr al-Thaalib.\n- Sibt Ibn al-Ta'awidhi, the famous poet (583 AH), visited this monastery on its feast day and saw a handsome deacon there, so he improvised about him:\n'And a gazelle I became attached to...\nOn the day of Dayr al-Thaalib.'\n'From the gazelles of the detached sand...\nStrutting in the garb of a monk.'\n'He tightened his zunnar so he dissolved...\nThe knots of the religious schools.'\n- Father Anastas Marie al-Karmali mentioned that the remains of Dayr al-Thaalib are known today as Ain al-Sanam.\n- Father Louis Cheikho favored the view that \"Dayr al-Thaalib is attributed, as we think, to the Banu Tha'labah who converted to Christianity, close to Baghdad near Al-Harithiya.\"\n- Dr. Abdul Latif al-Rawi supported him in this preference. See: Iraqi Society in the Poetry of the Fourth Century AH, 282. And see: Masalik al-Absar 1-277, 571.\n- Baghdad in the Era of the Abbasid Caliphate 92, 108, 182.\n- Guide to the Map of Baghdad 43, 65, 102, 104.\n- Conditions of the Christians of Baghdad 120-121, 123-125.\n- Old Monasteries of Baghdad 29-15.\nDayr al-Thaalib near Baghdad, in the district of Nahr Isa, at the place known as Bab al-Hadid.\n- I and Abu al-Fath Ahmad bin Ibrahim bin Ali bin Isa, may Allah have mercy on him, went out to Dayr al-Thaalib on a day in the year 355 AH for recreation and to witness the gathering of Christians there, and to drink by the Yazdegerd River which flows at the gate of this monastery. While we were touring the monastery, accompanied by a group of the children of Christian scribes and their youths, suddenly a young girl, like an engraved dinar as they say, swaying and bending like a basil branch in the north breeze, struck her hand upon Abu al-Fath's hand and said: \"O my master, come read this poetry written on the wall of the witness room.\" So we went with her, and we were filled with such joy because of her, her charm, and the beauty of her speech that only Allah knows. When we entered the room, she revealed a forearm like silver and pointed to the spot, and there was written:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 7
  },
  {
    "serial_number": "6270581",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "'She went out on the day of her festival...\nIn the clothes of the nuns.'\n'So she captivated with her strutting...\nEvery comer and goer.'\n'For my misery I saw her...\nOn the day of Dayr al-Thaalib.'\n'Swaying among women...\nA buxom girl among buxom girls.'\n'She is among them like the...\nFull moon among the stars.'\nWe said to her: \"By Allah, you are the one intended by the meaning of these verses.\" We did not doubt that she wrote the verses, and she did not leave us for the rest of our day. I composed these verses about her and recited them to her, and she rejoiced:\n'A slender-waisted one passed by us in the monastery...\nBewitching the viewer, captivating.'\n'The monks brought her out from her seclusion...\nTo honor the monastery and its monks.'\n'She passed by us swaying in her walk...\nAs if her stature was a ben tree.'\n'A wind blew on her so she leaned with it...\nJust as the branch of basil bends.'\n'She enslaved my heart and stirred for it...\nIts ancient sorrows and griefs.'\nBetween her and Abu al-Fath, an intimacy developed after that. Then he left for al-Sham (Syria) and died there, and I know no news of her after that.\n\nDayr al-Jathaliq (The Catholicos Monastery)\nDayr al-Jathaliq\n- There are two monasteries bearing the same name:\n- The first: An old monastery at the head of the border between Al-Sawad and the land of Takrit [Tikrit, Iraq].\n- The second: Was in the west of the city of Baghdad. Al-Shabushti described it saying: This monastery is near Bab al-Hadid. It is a large, beautiful, pleasant monastery, surrounded by orchards, trees, and aromatic plants. It parallels Dayr al-Thaalib in pleasantness, goodness, and the development of the location, because they are in one spot.\n- In some sources, this Dayr al-Jathaliq was located on the Rufayl River, one of the old rivers of Baghdad in the days of the Abbasids; its intake was from the Isa River and its outlet into the Tigris at the bridge.\n- The Baghdadi Dayr al-Jathaliq was also called \"Dayr Klilishu,\" which is a Syriac word meaning \"Wreath of Jesus.\"\n- It is understood from historical texts that Dayr al-Jathaliq is an ancient monastery whose construction dates back to before the founding of Baghdad, indeed to before the appearance of Islam.\n- See also:\n- News of the Patriarchs of the See of the East from the book Al-Majdal: by Mari bin Suleiman (74, 75, 77, 83, 110).\n- Ibn al-Athir 4 - 328.\n- Al-Budur al-Musfirah 21.\n- Baghdad in the Era of the Abbasid Caliphate 182.\n- Irrigation of Samarra in the Era of the Abbasid Caliphate 1 - 196 - 197, 198, 199.\n- Guide to the Map of Baghdad 104 - 108.\nDayr al-Jathaliq near Baghdad. A monastery of old construction, with a spacious courtyard from the district of Maskin, near Baghdad on the west of the Tigris in the width of Harbi. It is at the head of the border between Al-Sawad and the land of Takrit. At it was the war between Abd al-Malik bin Marwan and Mus'ab bin al-Zubayr, and at it Mus'ab bin al-Zubayr was killed. Ubayd Allah bin Qays al-Ruqayyat said eulogizing him:\n'Indeed, a slain man residing at Dayr al-Jathaliq...\nHas bequeathed sorrow and humiliation to the two cities (Kufa and Basra).'\n'Bakr bin Wa'il did not fight for the sake of Allah...\nNor was Tamim truthful at the encounter.'\n'If only there had been among Qays, circling around him...\nBattalions whose fervor boils and endures.'\n'But he wasted the time, and there was not...\nA generous Mudarite with him on that day.'\n'May Allah repay a Kufan with blame for that...\nAnd their Basran, for the generous one is generous.'\n- My uncle told me from Muhammad bin al-Qasim bin Mahrawayh, from Ali bin Abdullah bin Sa'd who said: Bakr bin Kharijah was in love with a Christian boy called Isa bin al-Bara al-Abbadi al-Sayrafi. He has a poem in couplets about him in which he mentions the Christians, their laws, and their festivals, names their monasteries, and favors them. He said: And I was told by one who witnessed Di'bil when he recited his saying about Isa bin al-Bara al-Abbadi:\n'His zunnar is knotted at his waist...\nAs if it is cut from my liver.'\nDi'bil said: Allah knows I have never envied anyone as I envied Bakr for these two verses! Bakr bin Kharijah said about Isa bin al-Bara al-Abbadi:\n'So by the Gospel recited by sheikhs...\nMonks at the monastery of \"Al-Jathaliq\".'\n'And by the Eucharist and the crosses, unless...\nYou have pity on my sick, yearning heart.'\n'Grant me sanctuary, I have died before you from my worries...\nAnd guide me to the path of the road.'\n'For the faces of my affair have narrowed upon me...\nAnd you are the one sought for refuge from the strait.'\nBakr bin Kharijah used to stay often at this monastery, famous for drinking in it, out of infatuation with this Christian boy. About him, he says a beautiful Urjuza (poem) including his saying:\n'From a distant lover whose passion is near...\nSpeaking with tears, silent of tongue.'\n'Bound of heart, free of body...\nTormented by rejection and abandonment.'\n'Without a sin his hands earned...\nExcept a passion his eyes revealed.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 8
  },
  {
    "serial_number": "6270582",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "'Longing for the sight of the one who made him miserable...\nAs if he healed him who afflicted him.'\n'Oh woe to him, what a lover encounters...\nFrom pouring tears that do not cease.'\n'He melted until he almost disappeared from love...\nAnd became finer than fine thought regarding him.'\n'Nothing remained in him but an eye weeping...\nWith tears like the arrangement of a string.'\n'As if it resembles the rain of the sky...\nExtinguishing the fires of passion and kindling them.'\n'To a gazelle from the children of the Christians...\nThe fuzz of his cheeks captivated the virgins.'\n'Leaving the minds of mankind bewildered...\nCaptives in the noose of love for him.'\n'A white antelope at the monastery of the Romans aimed at killing me...\nWith a dark eye, not from kohl.'\n'And a forelock by which my mind flew away...\nAnd beautiful coquetry and ugly deed.'\n'Here I am, cut from his stature...\nAnd the tear from my cheek has a trench for him.'\n'What harm would it do the one by whom my heart is supported...\nIf avoidance did not disturb his purity?'\n'I wish I were a cross for him...\nSo I would be forever near him.'\n'Seeing beauty and smelling perfume...\nFearing neither slanderer nor watcher.'\n'Or I wish I were an offering for him...\nKissing the mouth and fingertips from him.'\n'Or I were a Catholicos or a Metropolitan...\nSo that he would see obedience to me as faith.'\n'Or I wish I were a zunnar for him...\nMy waist turning with him wherever he turned.'\n'Until when the night folds the day...\nI become a waist-wrapper for him under the darkness.'\n'I wish I were an amulet on his chest...\nOr wine he drinks, delicious.'\n'Or a suit he wears, cut...\nNot discarded when it wears out.'\n'I wish I were a scripture for Amr...\nOr a pen with which he writes what he composed.'\n'Of beautiful poems he has classified...\nFor I have enough of some of this.'\n'Oh for the one who exhausted me with his beauty...\nAnd stripped away my patience and clothed me in emaciation.'\n'A gazelle on distance and nearness...\nTook the place of the soul in my body.'\n'Oh my liver from his reddened cheek...\nOh my sadness from his gap-toothed smile.'\n'Nothing like his black eye...\nIs more removing of piety and restraint.'\n'To you I complain, O gazelle of intimacy...\nO you whose face is my crescent and my sun.'\n'What loneliness I have after intimacy...\nThe soul is not killed except by the soul.'\n'Here I am drowning in the sea of passion...\nDrunk from your love, I do not sober up.'\n'Burning, while no fire touched me...\nThe enemy and the friend have mercy on me.'\nAnd he says in it:\n'O Amr, I adjure you by the Messiah...\nWill you not hear the speech of an advisor?'\n'Expressing a heart that is wounded for him...\nNot resting from love.'\n'O Amr, by the truth of the Divinity (Lahut)...\nAnd the Spirit, the Holy Spirit, and the Humanity (Nasut).'\n'That one who was singled out with descriptions...\nSpeaking in the cradle and with silence.'\n'By the right of whoever is in the lofty hermitages...\nOf one prostrating to his Lord and bowing.'\n'Weeping when every sleeper sleeps...\nOut of fear of Allah with flowing tears.'\nThen he swears to him by every oath the Christians know and says:\n'Will you not look, O prince of my affair...\nSeeking the great reward regarding me?!'\n\nDayr al-Jamajim (The Monastery of Skulls)\nDayr al-Jamajim in Kufa [Kufa, Iraq]. Abu al-Faraj said: It is a monastery on the outskirts of Kufa, on the land road taken to Basra. At it occurred the battle between Al-Hajjaj bin Yusuf and Abd al-Rahman bin Muhammad bin al-Ash'ath. That was because Ibn al-Ash'ath, when he saw the large number of his army in Basra, and Al-Hajjaj had confronted him there, left intending for Kufa. He saw that its people were more obedient to him than the people of Basra due to their hatred of Al-Hajjaj, and because he would find many supporters among his clans and clients there. So he marched to it, and Al-Hajjaj marched parallel to him. Ibn al-Ash'ath camped at Dayr al-Jamajim, and Al-Hajjaj camped opposite him at Dayr Qurra. War broke out between them, then Ibn al-Ash'ath was defeated and returned to Basra. The poets have mentioned Dayr al-Jamajim often. Jarir said mocking Al-Farazdaq:\n'Did you not witness Al-Jawnayn, the Pass, and Al-Safa...\nAnd the attacks of Qays on the day of Dayr al-Jamajim?'\n'You incite, O son of the blacksmith, Qays so they might make...\nFor your people a day like the day of Al-Araqum.'\n'With the sword of Abu Raghwan, the sword of Mujashi'...\nYou struck, but you did not strike with the sword of Ibn Zalim.'\n'You struck with it in the presence of the Imam, so your hands...\nTrembled, and they said: A novelty (prophet), not a sharp sword.'\nRegarding this monastery, Al-Dahhak al-Yarbou'i says:\n'If Al-Hajjaj perishes, then the garrison city is our garrison city...\nOtherwise, our abode is at Dayr al-Jamajim.'\n'If you bring out Sufyan, we bring out to you...\nAbu Hazim among horses with disheveled forelocks.'\n'And if you emerge for war, our nobles emerge...\nBrave leaders, looking askance, with sharp swords.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 9
  },
  {
    "serial_number": "6270583",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "This Sufyan: is Ibn al-Abrad al-Kalbi, and he was one of Al-Hajjaj's knights.\n\nDayr Hizqiyal (Ezekiel's Monastery)\nDayr Hizqiyal. Abu al-Faraj said: Ja'far bin Qudamah told me, saying: Shurayh al-Khuza'i said: I passed by Dayr Hizqiyal. While I was touring it, there was writing on a pillar, so I read it, and it was:\n'Many a night, extended by the breath of the lover...\nIn length, I cut through with sobbing.'\n'And bliss, like the union of the one I used to love...\nI exchanged for the misery of blame.'\n'They attributed madness to me to hide...\nWhat is in my heart of youthfulness and depression.'\n'I wish I had what they claimed of losing my mind...\nFor it is better than the length of this torment.'\nAnd beneath it was written: \"I loved so I was forbidden, I was chased and displaced, I was separated from home, veiled from the intimate and the tranquil, imprisoned in this monastery out of injustice and aggression, and shackled in iron for ages:\n'And I, despite what has befallen me and afflicted me...\nAm possessor of strength, enduring against the calamities.'\n'If the days turn, I will win my desire...\nAnd if I remain, my hope is cast away.'\n'How many a dead one from worry, rage, and heartbreak...\nIs patient for what day and night bring.'\nHe said: I wrote down what I found and asked about its author. They said: A man loved a cousin of his, so his uncle imprisoned him in this monastery fearing he would be exposed regarding his daughter. His family gathered, came, took him out, and married him to her against the uncle's will.\n\nDayr Hannah - Al-Ukayrah\nDayr Hannah: In Al-Ukayrah, in the district of Al-Balikh. Abu al-Faraj al-Isfahani mentioned Dayr Hannah and said: Abu Nuwas mentioned it in his poetry, meaning in his saying:\n'O Dayr Hannah of Dhat al-Ukayrah...\nWhoever sobers up from you, I am not sobering.'\n'Every shunned one, separated, visits it...\nFrom the nobles, upon it are old sackcloths.'\n'Among youths whom their fear did not leave...\nThe occurrence of what they feared, except as ghosts.'\n'They do not approach water with a vessel...\nExcept scooping from the pools with the palm.'\nHe said: Al-Ukayrah: A pleasant land with many orchards, gardens, and waters. He said: In Al-Hirah also there is a place called Al-Ukayrah in which there is a monastery. Al-Ukayrah are small domes inhabited by monks. The singular of them is called: Al-Kirah. Bakr bin Kharijah also mentioned this monastery. He said:\n'Leave the orchards of myrtle and apples...\nAnd aim for the garden of Dhat al-Ukayrah.'\n'To the estates, for the monastery opposite them...\nAt Al-Ukayrah is from the monastery of Ibn Waddah.'\n'Dwellings I never ceased for a time to stick to...\nThe sticking of one going early to pleasures and returning.'\nAnd in Al-Hirah [Al-Hirah, Iraq] also is a place called Al-Ukayrah, and in it is a monastery built by Abd bin Hanif from Banu Lihyan, who were with Lakhm, and two kings of Al-Hirah were from them. I think it is the one Bakr bin Kharijah meant, because he is Kufan in the poetry recited previously. Regarding these Ukayrah, Ali bin Muhammad al-Alawi, al-Hammani says:\n'How many a stop you have at Al-Khawarnaq...\nNot equaled by the stops (at Hajj).' \n'Between Al-Ghadir to Al-Sadir...\nTo the monasteries of the bishops.'\n'So the stops of the monks in...\nThe rags of a female fearful one and a male fearful one.'\n'Ruins, as if their gardens...\nAre clothed in the flags of embroidered garments.'\n'And as if their pools...\nIn them are tenth-markers in the Qurans.'\n'Their beginnings meet their ends...\nWith the colors of the shelf-cloths.'\n'Maritime are its winters...\nLand-like in it are the summers.'\n'Pearl-like are its pebbles...\nCamphor-like from it are the heights.'\n'Its rain-clouds spent the night churning...\nIn its thundering storm clouds.'\n'And as if the flash of its lightning...\nIn the sky are the swords of the fencers.'\n'Then they poured down like a...\nWeeping woman with four flowing eyes.'\n'So as if its blossoms...\nShake in the stormy winds.'\n'The forelocks of the servant girls turning...\nWith them to the forelocks of the servant girls.'\n'She defended it from its gloom...\nWith white, noble, turning (hearts/swords).' \n'The day of despair smells fragrant...\nEvil is evident in the day of the opulent.'\n'Generous with the free money, stoppers...\nIn the day of ruin.'\n'Oh for the days of youth...\nAnd what they wore of decorations.'\n'And their passing with what I knew...\nOf the objectionable things and the acquaintances.'\n'Days when your mention was in the...\nDiwans of youth at the top of the pages.'\n'Oh for my days and the days...\nOf the women with pure lips.'\n'And the planters of the ben-tree branches...\nUpon the dunes of the buttocks.'\n'And the makers of the full moon...\nBetween the eyebrows and the sidelocks.'\n'Days when they show opposition...\nWithout the intentions of the opponent.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 10
  },
  {
    "serial_number": "6270584",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "'Bliss stopped upon youth...\nAnd you slipped from those positions.'\nAbu Nuwas said:\n'Leave the orchards of roses and apples...\nAnd turn, may you be guided, to Dayr al-Ukayrah.'\n'Turn to a group, whose figures have become thin...\nFrom worship, except for the worn-out ghosts.'\n'Repeating bells echoed...\nTo the Psalms in the evening and morning.'\n'So turn your hearing away from a voice you dislike...\nFor you will not hear in it the voice of a farmer.'\n'Except the study of the Gospel from nearby...\nThe mention of the Messiah with clarity and eloquence.'\n'Oh pleasant one, and aged wine is their masterpiece...\nWith every type of wide bowl.'\n'A waist-banded one serves it to you, possessing slimness...\nA brother of wool armors over sackcloths.'\nAhmad bin Umar al-Kufi recounted, saying: There was in Kufa a man of literature with weak means who accepted whatever fell into his hand. He would be brought to Dayr Hannah and drink there until he got drunk, then leave to his family, saying: \"I admire the crow for its early rising in seeking sustenance.\" Perhaps he spent the night there, saying:\n'Your night was long at Al-Zawiya...\nAnd spending the night there was health.'\n'And under your head was a brick...\nAnd your side thrown upon a reed mat.'\n'That is better than leaving...\nSo the sons of the whore judge over you.'\n'And you become either a hostage of prisons...\nOr a slain man by a water channel.'\nHe said: And by Allah, he was found days later killed by a water channel! He is the one who said:\n'The pleasure of life to me is none other than one...\nIt is going early to some taverns.'\n'For one of obscure mention, safe from his calamities...\nEasy to lead among the brisk, well-trained mounts.'\n'Until he settles at the monastery of the son of an unbeliever...\nFrom the Christians, selling wine, famous.'\n'As if he tied the zunnar over a sand dune...\nAnd turbaned above the darkness of gloom with light.'\nAl-Tharwani said about it:\n'My day at the temple of Dayr Hannah ceased not...\nThe best of clouds pouring in it and making it fertile.'\n'Armoring himself at times, and at times drawing...\nWhite swords, and at times wearing armor.'\nLikewise, Bakr bin Kharijah al-Kufi said about it:\n'Has Al-Khawarnaq been watered from a place...\nOf elegant gardens, beloved, chic!'\n'I stayed at his Dayr Hannah for a time...\nIn drunkenness in the morning draught and the evening draught.'\n'And among us is one wearing a wreath of flowers...\nAnd one with dyed sidelocks with perfume.'\n'As if its gardens in beauty and blossoms...\nAre clouds gilded with the flash of lightning.'\n'As if the dripping of trees in it...\nWhen the darkness gets dark, represents a train of camels.'\n'And what do you wish of the pearls of chamomile...\nThere, and of the rubies of anemones.'\n\nDayr Hannah in Al-Hirah\nDayr Hannah: In Al-Hirah [Al-Hirah, Iraq]. Abu al-Faraj said: It is an ancient monastery built by a clan of Tanukh called Banu Sati'. Opposite it is a high minaret like a watchtower, called Al-Qa'im, belonging to Banu Aws bin Amr, then to a branch of them called Banu Mabraq. The youths of Al-Hirah used to frequent it and drink in it. Al-Tharwani meant it by his saying:\n'O Dayr Hannah at Al-Qa'im the Cupbearer...\nTo Al-Khawarnaq from the monastery of Ibn Barraq.'\n'Consolation is not (even if I became abstaining...\nFrom my desire in you) of my form and my morals.'\n'May it rain for your effaced traces from an effacer, its landmarks...\nAre desolate, and your remaining part is like the brocade of a survivor.'\nDayr Hannah: Abu Nuwas mentioned it:\n'O Dayr Hannah of Dhat al-Ukayrah...\nWhoever sobers up from you, I am not sobering.'\nAbu al-Faraj al-Isfahani mentioned in the book \"Al-Dayarat\": Hannah, and that it is different from the one mentioned by Abu Nuwas, and mentioned that Al-Tharwani said about it:\n'O Dayr Hannah at Al-Qa'im the Cupbearer...\nTo Al-Khawarnaq from the monastery of Ibn Barraq.'\n\nDayr Hanzalah al-Ta'i\nDayr Hanzalah al-Ta'i: In Al-Jazira [Mesopotamia]. Abu al-Faraj said: Hashim bin Muhammad Abu Dulaf al-Khuza'i told me, saying: Al-Riyashi told me: Abu al-Mahallim told me: Dayr Hanzalah in Al-Jazira. It is attributed to a man from Tayy called Hanzalah bin Abi 'Afra bin al-Nu'man bin Hayyah bin Sa'nah bin al-Harith bin al-Huwayrith bin Rabi'ah bin Malik bin Safar bin Hani bin Amr bin al-Ghawth bin Tayy. This Hanzalah is the uncle of Iyas bin Qabisah bin Abi 'Afra who was the King of Al-Hirah. From his clan was Abu Zubayd al-Ta'i the poet. He was one of the poets of the Jahiliyyah (Pre-Islamic era); he became an ascetic in the Jahiliyyah, converted to Christianity, and built this monastery, so it has been known by him until now. This Hanzalah is the one who said:\n'Whatever the doubt of time may be, I...\nSee the moon of the night setting like the youth.'\n'It appears small, then its light grows...\nAnd its form, until when it has leveled.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 11
  },
  {
    "serial_number": "6270585",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "'And approached fading, its light and beam...\nAnd it diminishes until it hides and is not seen.'\n'Likewise is the increase of the matter, then its decrease...\nAnd its repetition: in its time after it has passed.'\n'You greet the people of the abode...\nAnd the abode is a decoration.'\n'And you come to the mountains from their high peaks...\nNeither does a rich man delay for the surplus of his wealth...\nAnd if he says delay me and take a bribe, it refuses.'\n'Nor from a poor man do they delay for his poverty...\nSo that the complaint to them would benefit him if he complained.'\nJa'far bin Qudamah told me, saying Hammad bin Ishaq told me from his father: Abu Najah told me: I was with Abdullah bin Muhammad al-Amin when he went out to the districts of Al-Jazira. He had many beautiful estates there. We passed by this Dayr Hanzalah, and it was the days of spring. Around it were gardens that make one forget robes of embroidery, and carpets of greenery and flowers. We stayed in it, and he sent to a vintner near the Euphrates, so we drank. Abdullah had a beautiful voice, skilled in singing and music, witty and perfect. He said:\n'O Dayr Hanzalah the ransomed...\nYou have deposited in me fatigue and toil.'\n'I drive a skin of wine to you...\nAnd place upon it the moistened leaves.'\n'And start with the morning draught before my companions...\nAnd whoever is active for it is the ransomed one.'\n'O monastery, may the morning clouds water you...\nClouds loaded with lightning and thunder.'\n'Increasing your growing structure in growth...\nAnd clothing the garden in renewed beauty.'\nSo we drank the morning draught in it for ten days, and Abdullah and the singers with us sang to us. Abdullah has a melody in this poetry from the light Ramal meter, beautiful. Regarding this monastery, the poet says:\n'Su'da knocked on your door between the two banks of Bariq...\nMy soul is the ransom for her phantom as a knocker.'\n'O Dayr Hanzalah, the stirrer of passion for me...\nCan you cure the love of the lover?'\n\nDayr Hanzalah al-Lakhmi\nDayr Hanzalah al-Lakhmi: In Al-Hirah. Abu al-Faraj said: Among the monasteries of Banu Alqama in Al-Hirah is the Monastery of Hanzalah bin Abd al-Masih bin Alqama bin Malik bin Rubba bin Namara bin Lakhm bin Adi bin al-Harith bin Murra bin Udad. Found in the front of the monastery written in lead on engraved teak wood: \"This holy temple was built, out of love for the guardianship of truth and honesty, by Hanzalah bin Abd al-Masih. May his sanctification be with the endurance of the world, and just as his friends are mentioned with protection, may the mentioning of the sinner Hanzalah be.\" Some poets say about it:\n'In the courtyard of Al-Hirah is Dayr Hanzalah...\nUpon it the tails of joy are let down.'\n'I revived in it a welcoming night...\nAnd our cup was circulating among the drinking companions.'\n'And the wine in it was like a kindled fire...\nAnd all of us were exhausting what was bestowed upon him.'\n'In it, the one who blamed him finds pleasure while disobeying...\nHastening before he meets his designated time.'\n\nDayr al-Khusyan (The Monastery of Eunuchs)\nDayr al-Khusyan: In Ghor al-Balqa between Damascus and Jerusalem. Abu Zayd al-Asadi recounted saying: I entered upon Sulayman bin Abd al-Malik, and he was sitting on a dais paved with red marble, furnished with green brocade, in the middle of a garden with thick trees, whose fruits had ripened. Opposite every side of the dais was a garden that bloomed with spring plants and blossoms. At his head were maidservants, each one more beautiful than her companions, as if they were scattered pearls. In their hands were pitchers with the colors of wines, and bowls of crystal. The drink had taken effect on him. I said: \"Peace be upon you, O Commander of the Faithful, and the mercy of Allah and His blessings.\" Sulayman was looking down, so he raised his head and said: \"Abu Zayd, on a day like this, do you greet with the greeting of the living?\" I said: \"O my master, O Commander of the Faithful, has the Resurrection risen?\" He said: \"Yes, for the people of passion!\" Then he looked down, raised his head, and said: \"Abu Zayd, what is good in this day of ours?\" I said: \"Red coffee (wine) in a white glass, handed to me by a slender, curvaceous, slim, aquiline-nosed, large-eyed girl. I drink it from her palm and wipe my mouth with her mouth.\" Sulayman looked down for a long time while his tears flowed. When the maidservants saw that from him, they moved away from him. He said: \"Abu Zayd, by Allah, you have settled in a day in which is the expiration of your term, the end of your duration, and the annihilation of your life. By Allah, I will strike your neck unless you inform me of what stirred this description from your heart.\" I said: \"Yes, O Commander of the Faithful. I was sitting at the gate of your brother Sa'id bin Abd al-Malik, and suddenly a girl came out to the courtyard of the palace. She wore a flowing shirt through which the whiteness of her breasts, the roundness of her navel, and the embroidery of her waistband were visible. On her foot were sandals whose whiteness of her feet shone against their redness. She had a single braid hitting her waist, a forelock curled on her forehead, two temples like the letter Nun on her cheeks, eyebrows arched over eye sockets filled with magic, and a nose like a cane of pearl.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 12
  },
  {
    "serial_number": "6270586",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "And she was saying: 'Servants of Allah, what is the medicine for what is complained of? And what is the treatment for what is not forgotten? The veil has been long, the letter slow, the mind is flying, the intellect is deep, the eye is tearful, insomnia is permanent, passion is present, the soul is bewildered, the heart is snatched, and the heart is detained. May Allah have mercy on a people who lived with endurance and died of grief. If only there were a trick in patience, or a means to consolation.' So I said: 'O girl, are you human or Jinn? Celestial or terrestrial? For the sharpness of your intellect has amazed me, and the beauty of your speech has astounded me.' She covered her face with her palm and said: 'Excuse me, O speaker, for how desolate is passion without help, and suffering blockage with stubbornness.' Then she left. So by Allah - O Commander of the Faithful - I did not eat anything good but choked on it, nor saw anything beautiful but it appeared ugly in my eyes due to her beauty. Sulayman said: 'Ignorance almost provokes me, and infatuation returns to me, and forbearance escapes me. That is Al-Dhalfa, about whom the poet says:\n'Al-Dhalfa is but a ruby...\nBrought out from the purse of a Dehqan (landlord).'\nHer purchase cost my brother a million dirhams. She is in love with a youth who bought her from him. By Allah, no one dies except by regret for her, nor leaves the world except with a lump in the throat for her. In patience is solace, and in expecting death is bewilderment. So conceal - O Abu Zayd - the conversation. O boy: weigh down his hand with a purse of money.' He said: When Sa'id died, she came to Sulayman. There was no one more beautiful in her time. She possessed his heart and prevailed over him to the exclusion of all his other wives and slave girls. He went out one day near the monastery of the monks and pitched his tent in a green garden, elegant with flowers, possessing orchards and joy, surrounded by types of fresh, tender flowers, ranging from bright yellow to pure white to brilliant red. It was like Hadhrami garments and star-patterned cloaks. The wind carried from it the breeze of pungent musk, and its scent diffused the fragrance of crushed ambergris. He had a singer he was intimate with, relied upon, and secluded with often, listening to his talk and singing, called \"Sinan.\" This \"Sinan\" was the most beautiful of people in face and the wittiest in charm. He ordered him, so he pitched his tent in a green garden, elegant with flowers, possessing orchards and joy, surrounded by types of fresh, tender flowers near him. \"Al-Dhalfa\" had gone out with Sulayman to that picnic spot. Sulayman remained his day with Sinan in perfect joy and complete happiness until night came. Sulayman left to his tent, and Sinan left to his place. He found a group had camped by him, so they greeted him. He returned their greeting, happy with their arrival, joyful with their staying. He brought them food, and they ate. He presented wine, and they took from it. He said: \"Is there any need?\" They said: \"We only came to you for hospitality.\" He said: \"You have settled in a spacious home, and descended in a fertile side.\" They said: \"As for food, we have eaten; and as for wine, it is present; there remains listening (music).\" He said: \"As for listening, there is no way to it with the jealousy of the Commander of the Faithful and his prohibition of me from singing, except what is in his assembly.\" They said to him: \"We have no need for food and drink with you unless you let us hear.\" When he saw they would not be neglected, he raised his voice and sang these verses:\n'A veiled woman heard my voice, so it kept her awake...\nFrom the end of the night until wakefulness wearied her.'\n'Guards did not block the voice nor a lock...\nSo her tears flow at the coming of the voice.'\n'She lowers over her thighs a yellow-dyed garment...\nAnd the jewelry is visible on her upper chest, a waist.'\n'On the night of the full moon, her bedfellow does not know...\nIs her face more splendid with him or the moon?'\n'If she were released, she would walk towards me on a foot...\nThat almost splits from delicacy due to walking.'\nWhen \"Al-Dhalfa\" heard the voice of \"Sinan,\" she went out to the courtyard of the tent to hear the voice. She did not hear anything of beautiful blowing along with what coincided with the time of the moonlit night, except she saw all of that in herself, her time, and her state. That stirred something dormant in her heart, so her eyes overflowed with tears and her sobbing became loud. Sulayman woke up and did not find her in the tent. He went out to its courtyard and saw her in that state. He said to her: \"What is this, O Al-Dhalfa?\" She said: \"O Commander of the Faithful:\n'Many a magnificent voice from a deformed one...\nUgly of face, base of father and grandfather.'\n'His voice impresses you, and perhaps he is...\nAttributed to a slave woman along with a slave.'\nSulayman said: \"Leave me from this. By Allah, something from him has mixed in your heart. O boy: bring me 'Sinan'.\" Al-Dhalfa called a servant of hers and said: \"If you beat the messenger to 'Sinan' and warn him, you will have ten thousand dirhams and you are free.\" But Sulayman's messenger beat him and brought him. When he stood before him, and Sulayman was trembling with jealousy, Sulayman said: \"Who are you?\" He said: \"I am Sinan.\" He said:\n'May his mother be bereaved of Sinan...\nHe was a basil plant for her to smell.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 13
  },
  {
    "serial_number": "6270587",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "'And his maternal uncle and his paternal uncle be bereaved of him...\nPossessor of foolishness whose life distresses him.'\nSinan said:\n'Keep me until the morning, I will offer an excuse...\nIndeed, my tongue is broken by the drink.'\n'Your Kalbi knight attacks in a day...\nSo if he commits a sin or stumbles.'\n'Then the forgiving master is more worthy to forgive.'\nThen he said: \"O Sinan, did I not forbid you from such an act?\" He said: \"O Commander of the Faithful, intoxication carried me, and people visited me at night, and I am the slave of the Commander of the Faithful. If he sees fit not to waste his share of me, let him do so.\" He said: \"As for my share of you, I will not waste it, but I will not leave for women a share in you. O Sinan, do you not know that when a man sings, the woman listens to him? And that when the horse neighs, the mare desires him? And that when the male camel rumbles, the female camel submits to him? O boy, bring me a cupper and castrate him.\" He lived after that for a year and died. So that monastery was named: Dayr al-Khusyan (The Monastery of Eunuchs), and it is known by that until today.\nAhmad bin Abd al-Aziz al-Jawhari told me - and this report is the soundest of what was narrated regarding that in chain of transmission - he said: Abu Zayd Umar bin Shabba told us from Ma'n bin Isa. And Isma'il bin Yunus told us, saying: Umar bin Shabba told me, saying: Abu Ghassan told me: Ibn Janah said: Ma'n bin Isa told me from Abd al-Rahman bin Abi al-Zinad from his father and from Muhammad bin Ma'n al-Ghafari. They said: The reason why the Mukhannathun (effeminates) were castrated in Medina was that Sulayman bin Abd al-Malik was in a club of his chatting at night on a roof. His companions dispersed from him, so he called for ablution water. A slave girl of his came with it. While she was pouring it over him, he signaled with his hand and pointed with it twice or thrice, but she did not pour over him. He disapproved of that and raised his head, and lo, she was listening intently towards the camp. And lo, the voice of a man singing. He listened to him until he heard all that he sang. When it was morning, he gave permission to the people, then brought up the mention of singing and softened regarding it until the people thought he desired and wanted it. They elaborated on it with ease and mentioned who listened to it. Sulayman said: \"Is there anyone left who is heard from?\" A man from the group said: \"I have, O Commander of the Faithful, two men from the people of Ayla, skilled and masterful.\" He said: \"And where is your house?\" He pointed to the direction from which the singing was. He said: \"Send for them.\" He did so. The messenger found one of them and brought him to Sulayman. He said: \"What is your name?\" He said: \"Samir.\" He asked him about singing, and he admitted to it. He said: \"When was your last time with it?\" He said: \"Last night.\" He said: \"And where were you?\" He pointed to the direction from which Sulayman heard the singing. He said: \"So what did you sing?\" He informed him of the poetry Sulayman had heard. He turned to the group and said: \"The camel rumbled so the she-camel submitted, the billy goat bleated so the ewe opened up, the pigeon cooed so the female pigeon strutted, and the man sang so the woman was moved.\" Then he ordered him and he was castrated. He asked about singing, where is its origin? It was said: In Medina among the Mukhannathun, and they are its leaders and the skilled ones in it. So he wrote to Abu Bakr bin Muhammad bin Amr bin Hazm al-Ansari, who was his governor over it, to castrate whoever was there of the singing Mukhannathun. - Musa bin Ja'far bin Abi Kathir claimed, saying: Some scribes told me: I read Sulayman's letter in the Diwan, and I saw on the Kha (of 'Ihsi' - count) a dot like an Ajwa date. He said: And whoever does not know says: The reader misread it, and it was 'Ahsi' (count). He said: So Ibn Hazm tracked them down and castrated nine of them. Among them were: Al-Dallal, Tarif, and Habib Nawmat al-Duha. Some of them said when he was castrated: \"The circumciser and the circumcised are safe.\" This is a phrase a boy says when he is circumcised. He said: Ibn Abi Thabit al-A'raj claimed. He said: Hammad bin Nashit al-Hasani told me. He said: We came from Mecca and with us was Badraqus, who was the one who circumcised them, and his boy had helped him in castrating them. We stayed with Habib Nawmat al-Duha. He celebrated us and honored us. Thabit said to him: \"Who are you?\" He said: \"O son of my brother, do you ignore me when you oversaw my circumcision!\" Or he said: \"And you circumcised me.\" He said: \"Oh shame! Which of them are you?\" He said: \"I am Habib.\" So I avoided his food and feared he would poison me. He said: And Al-Dallal's beard began to fall out after a year or two.\nAs for Ibn al-Kalbi, he mentioned from Abu Miskin and Laqit that Ayman wrote to count (ihsa') those in Medina of the Mukhannathun to know them, so he could send to him whoever he chose for the delegation. He thought he wanted castration (khisa'), so he castrated them.\nWaki' told me, saying: Abu Ayyub al-Madini told me, saying: Muhammad bin Salam told me, saying: Ibn Ja'dubah told me - and I copied from the book of Ahmad bin al-Harith al-Kharraz - from al-Madini from Ibn Ja'dubah, and the wording is his:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 14
  },
  {
    "serial_number": "6270588",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "That what provoked Sulayman bin Abd al-Malik to do what he did to the Mukhannathun who were in Medina, was that he was lying on his bed at night, and a slave girl of his was by his side. She was wearing a tunic and a cloak, both yellow-dyed, and two sashes of gold, and on her neck were beads of pearl, peridot, and ruby. Sulayman was infatuated with her. In his camp was a man called Samir al-Ayli who sang. Sulayman did not think of his singing due to being occupied with her and attentive to her. She was distracted from him, not answering him, listening intently to the man, until that became long for him. He turned his face away from her in anger, then returned to what he was distracted from understanding by her. He heard Samir singing with the best voice and sweetest tone:\n'A veiled woman heard my voice, so it kept her awake...\nFrom the end of the night until wakefulness consumed her.'\n'She lowers over her neck the folds of a yellow-dyed garment...\nAnd the jewelry from her is on her upper chest, a waist.'\n'On the night of the half (full moon), her bedfellow does not know...\nIs her face more splendid with him or the moon?'\nAnd it is narrated: 'Is her face what he sees... or is her face the moon?'\n'If she were released, she would walk towards me on a foot...\nThat almost splits from delicacy due to walking.'\n- The song is by Samir al-Ayli, Ramal Mutlaq with the ring finger from Habash... And Dhaka' Wajh al-Ruzza told me that he heard a melody in it by Al-Dallal from the Heavy First meter.\n- Sulayman did not doubt that what was with her was from what she heard, and that she loved Samir. So he sent immediately someone to bring him and imprisoned him. He called for a sword and a leather mat (for execution) for her, and said: \"By Allah, you will tell me the truth or I will strike your neck!\" She said: \"Ask me what you want.\" He said: \"Tell me what is between you and this man?\" She said: \"By Allah, I do not know him nor have I ever seen him. I am a girl raised in Hejaz, and from there I was brought to you. By Allah, I do not know anyone in this land but you.\" He pitied her and brought the man and questioned him, and was gentle with him in questioning, but did not find any way between him and her. He did not feel right releasing him intact, so he castrated him, and wrote regarding the Mukhannathun with the same order. This narration is authentic.\n\nDayr Darzijan\nDayr Darzijan: Near Baghdad, on the Tigris, on the western side of it. Abu al-Hasan al-Wasiti al-Sufi said to me: I read on the wall of Dayr Darzijan: So-and-so son of So-and-so al-Dimashqi attended while saying:\n'If the distance of separation has parted between us...\nMy heart is residing with you and staying.'\n\nDayr al-Rusafa\nDayr al-Rusafa: Ibn Asakir mentioned that its name is \"Dayr Hanina,\" and that the name of the owner of the poem is: Al-Farkh. And that Al-Mutawakkil ordered the demolition of the monastery: Ibn Asakir - Al-Zahiriyah Manuscript - 19 - Folio 145.\nAl-Bakri said: It is in Damascus 2 - 580.\n- Yakut clarified that this monastery is located in Rusafa Hisham [Ar-Rusafa, Syria], which is eight days from Damascus. Mu'jam al-Buldan (Dayr al-Rusafa).\n- It is inferred from Al-Bakri that it is of Roman construction... Royal Romans (Melkites). Al-Bakri.\n- Yakut mentioned that he saw the monastery, and decided that it is one of the wonders of the world in beauty and architecture. Mu'jam al-Buldan (Dayr al-Rusafa).\n- In this monastery, a poet said, pointing to its glory, and alluding to the Umayyads:\n'I see you panicked, O Dayr al-Rusafa...\nThe morning the Caliphate shifted from you!'\n'So do not panic and shed tears in grief...\nFor every gathering has a blight!'\nDayr al-Rusafa in Rusafa Hisham bin Abd al-Malik. Abu Nuwas passed by this monastery and said about it:\n'There is no monastery like the monastery in Rusafa...\nIn it is what souls desire and love.'\n'I spent a night in it and fulfilled desires...\nAnd a day whose two ends I filled with amusement.'\nAbu al-Faraj said: Ja'far bin Qudamah told me, saying: Abu Abdullah bin Hamdun told me said: I was with Al-Mutawakkil when he went out to Al-Sham. He rode one day from Damascus recreating in Rusafa Hisham, visiting his palaces and the palaces of his children. Then he went out and entered an old monastery there, of Roman construction, among rivers, farms, and trees. While he was touring it, he saw a patch of paper stuck up. He ordered it to be torn off. It was torn off, and in it was:\n'O dwelling by the monastery that has become empty...\nThe north and west winds play in it.'\n'As if white, sociable women did not inhabit you...\nAnd houris did not strut in your courtyard.'\n'And sons of kings from Ab Shams, masters...\nTheir small one is great among mankind.'\n'If they wear their armor, they are lions...\nAnd if they wear their crowns, they are full moons.'\n'However, on the day of meeting they are lions...\nAnd on the day of giving they are seas.'\n'Around you are banners belonging to them and armies...\nAnd horses having snorting after neighing.'\n'Nights when Hisham was residing in Al-Rusafa...\nAnd in you was his son, O monastery, while he was a prince.'\n'When life was fresh and the Caliphate was supple...\nAnd you were sleek and time was inexperienced.'\n'And your garden was trained, and your blossoms shining...\nAnd the life of Banu Marwan in you was fresh.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 15
  },
  {
    "serial_number": "6270589",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "'Indeed, may the rain water you with the downpour of a cloud...\nUpon you, having an early morning after the evening.'\n'I remembered my people while alone and wept for them...\nWith sorrow, and the likes of me are worthy of weeping.'\n'And I consoled my soul, a soul that whenever...\nThe memory of my people runs to it, has a moan and a sigh.'\n'Perhaps a time that was unjust to them one day...\nWill turn for it with what souls desire.'\n'So a sad one rejoices, and a miserable one becomes blessed...\nAnd a captive is released from the tightness of the bond.'\n'Slow down, for today is followed by tomorrow...\nAnd the changes of fortune turn!'\nHe said: When Al-Mutawakkil read it, he was terrified by it and took it as a bad omen, saying: \"I seek refuge in Allah from His bad decrees!\" Then he called for the owner of the monastery and said to him: \"Who wrote this note?\" He swore that he did not know. He said: \"Since the Commander of the Faithful descended in this place, I control nothing of the affairs of this monastery. The soldiers and the Shakiriyya enter and exit, and the limit of my ability is that I am hiding in my cell.\" He intended to strike his neck and destroy the monastery, but his companions spoke to him until his anger subsided. Then it became clear after that that the one who wrote the verses was a man from Banu Ruh bin Zinba' al-Judhami, and his mother was one of the freed slaves of Hisham bin Abd al-Malik.\n\nDayr al-Ruha (Monastery of Edessa)\nDayr al-Ruha: In Al-Jazira between Mosul and Al-Sham [Sanliurfa, Turkey]. Abu Muhammad Hamza bin al-Qasim al-Shami told me: He said: I passed by the church of Al-Ruha during my journey to Iraq. I entered it to witness what I used to hear about it. While I was in my touring, I saw written in red on one of its corners: So-and-so son of So-and-so attended while saying:\nFrom the advancing of the intelligent one, if ordeal rides him is the interruption of life, and the presence of death. And the severest torment is the prolongation of lives in the shadow of misfortune. And I am the sayer:\n'I have an ambition whose lowest station is Suha (a star)...\nAnd a soul that transcended with noble deeds and intellect.'\n'I was wealthy in Marw [Merv, Turkmenistan], near...\nBut the days brought me to the church of Al-Ruha.'\n'If I were known in it, I would not stay in it...\nBut I have become a stranger in it.'\n'It is the habit of days to distance the chosen one...\nAnd to separate the gathered, and to disturb the desired.'\nSo I appreciated the poetry and prose and memorized them.\n\nDayr Zurara\nDayr Zurara: It is between Kufa and Hammam A'yun, on the right of the pilgrim from Baghdad. It is pleasant, with many taverns and drink, not devoid of those seeking amusement and play, and preferring idleness and revelry. Hashim bin Muhammad al-Khuza'i told me, saying: Al-Abbas bin Maymun bin Ta'i told us, saying Ibn Khurdadhbih told me: Muti' bin Iyas and Yahya bin Ziyad went out performing Hajj. They sent their luggage ahead and one of them said to the other: \"Would you like us to go to Zurara and revel for our night at it, then catch up with our luggage?\" That remained their habit until the people returned from Mecca. He said: So they rode their camels and shaved their heads and entered with the returning pilgrims. Muti' said about that:\n'Did you not see me and Yahya having performed Hajj...\nAnd Hajj was of the best trade.'\n'We went out seeking good and righteousness...\nBut the road inclined us to Zurara.'\n'So the people returned having gained and performed Hajj...\nAnd we returned laden with loss.'\nThis report has been narrated for Bashar bin Burd and others.\n\nDayr Zakka\nDayr Zakka: It is a monastery in Al-Raqqah [Raqqa, Syria]. Opposite it is a hill called: Tell Zufar, which is Zufar bin al-Harith al-Kilabi. In it is an estate called Al-Salihiyya, laid out by Abd al-Malik bin Salih al-Hashimi - thus said Al-Isfahani - containing an orchard described as beautiful, and two ancient cypress trees. Poets have mentioned it and mentioned its splendor, and longed for it. Al-Hasan bin Ali told me, saying Abd al-Allah bin Abi Sa'd told us saying: Muhammad bin Abd al-Allah bin Malik told me. And Muhammad bin Khalaf bin al-Marzuban told me of it, saying Abu al-Abbas al-Katib told me said: Al-Rashid loved Maridah - his slave girl - and he had left her behind in Al-Raqqah. When he arrived at the City of Peace (Baghdad), he missed her, so he wrote to her:\n'Peace be upon the distant stranger...\nThe greeting of a lover, depressed because of him.'\n'A gazelle whose pastures are at Al-Balikh...\nTo Dayr Zakka to Qasr al-Khashab.'\n'O one who helped against himself...\nBy leaving behind, obediently, the one he loved.'\n'I will cover... and covering is of my nature\nThe love of the one I love with one I do not love.'\nWhen his letter arrived to her, she ordered Abu Hafs al-Shatranji - the companion of Ulayya - so he answered Al-Rashid on her behalf with these verses, saying:\n'Your letter came to me, O my master...\nAnd in it are wonders, all wonder.'\n'Do you claim that you are a lover of me...\nAnd that you are infatuated and fond of me?'\n'If this were so, you would not be...\nLeaving me as an opportunity for anguish.'\n'While you are in Baghdad grazing in it...\nThe plants of pleasure with whom you love.'\n'O one who shunned me while I did not shun him...\nO one who saddened me with what is in the books.'\n'Your letter has increased me in yearning...\nAnd kindled my heart with the heat of flame.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 16
  },
  {
    "serial_number": "6270590",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "'So grant that, yes, I have concealed the passion...\nBut how to conceal a flowing tear?'\n'And were it not for fearing you, O my master...\nThe swift she-camels would have brought me to you.'\nWhen Al-Rashid read her letter, he immediately sent a servant on the post-horse to bring her down to Baghdad via the Euphrates, and ordered all the singers, so they sang his poetry.\n\nDayr Sa'd\nDayr Sa'd in western Mosul near the Tigris, attributed to Sa'id bin Abd al-Malik bin Marwan. Abu al-Faraj Ali bin al-Husayn al-Isfahani said: Al-Harami bin Abi al-Ala told us, saying Al-Zubayr bin Bakkar told us, saying Muhammad bin al-Dahhak told me from his father, saying: I found in a book in the handwriting of Al-Dahhak saying: Aqil bin 'Ullafah went out with his two sons: 'Ullafah and Jaththama, and his daughter Al-Jarba', until they came to a daughter of his married into Banu Marwan in Al-Sham, who had been widowed. Then they returned with her until they were on some road, Aqil bin 'Ullafah said:\n'She fulfilled a wish from Dayr Sa'd and it has been long...\nThat upon a breadth they butted it with skulls.'\n'If you descend a land whose crow dies...\nIn it of thirst, give them the nose-rings.'\nThen he said: \"Complete it, O 'Ullafah.\" 'Ullafah said:\n'So they became in the waterless desert carrying youths...\nDrunk from the night journey, with tilted turbans.'\n'If they leave a flag in a desert...\nThey measure with arms to another obliterated one.'\nThen he said: \"Complete it, O Jarba'.\" She said: \"And am I safe?\" He said: \"Yes.\" She said:\n'As if slumber gave them Sarkhadi wine to drink...\nWine that walks in the back and the legs.'\nAqil said: \"You drank it, by the Lord of the Kaaba! Were it not for the safety, I would have struck with the sword under your earring. Could you not find speech other than this!\" Jaththama said: \"And did she do wrong! She only completed (the verse), and there is no one but me and you.\" So Aqil shot him with an arrow, hitting his leg, and the arrow pierced his leg and the saddle. Then he attacked Al-Jarba' and hamstrung her she-camel, then loaded her onto Jaththama's she-camel and left him wounded with Al-Jarba's she-camel. Then he said: \"Were it not that Banu Murrah would revile me, you would not have tasted life.\" Then he left heading to his family and said: \"If you inform your family about Jaththama, or tell them that anything other than the plague hit him, I will kill you.\" When they arrived at the people of Abir (who are Banu al-Qayn), Aqil regretted what he did to Jaththama. He said to them: \"Would you like a slaughtered camel that broke down?\" They said: \"Yes.\" He said: \"Then stick to the trace of this mount until you find the slaughtered camel.\" The people went out until they reached Jaththama and found him drained by blood. They carried him, divided the camel, lodged him with them, and treated him until he healed. They rejoined him with his people. When he was near them, he sang:\n'Does our blamer excuse, or does he blame for youth...\nWhile they and the youths are but halves (siblings/partners).' \nThe people said to him: \"You only just escaped the wound your father inflicted on you earlier, and you have returned to what he hates. Refrain from this and the like; if you meet him, no evil or harm will reach you from him.\" He said: \"It is but a thought that crossed the mind, and the rider sings when he travels.\"\n\nUmr Safar Yeshu\nUmr Safar Yeshu: Below the city of Wasit [Wasit, Iraq]. Abu Abdullah al-Wasiti, the poet known as Ibn al-Ajurri told me, saying: I used to associate with a group of witty people and sons of chiefs, and we would meet over drink constantly. A youth among them invited us to the monastery (Umr) which is below the city of Wasit, known as Umr Safar Yeshu. We went, having with us singing, instruments, and drink, everything elegant. We stayed three days, and pleasant times passed for us there. We departed on the fourth day and dispersed after that for livelihoods and businesses. When months had passed after that, we were invited to the monastery. When we got into the cell where we had drunk that time, the youth said to us: \"Shall I not tell you of my state after you?\" We said: \"Yes.\" He said: When you departed from us, a young man of good appearance and view came to me, accompanied by a clean-faced boy in similar attire, whom I reckon was a lover of his. He said to me: \"Where are the youths who were gathered with you? For they left early in the dark.\" He became sad, and depression was evident in his face. Then he asked me about your condition, what you did, and how long you stayed. I told him, so he became cheerful, and requested what he and his companion ate. They began drinking and making merry, and stayed in their state for three days, doing the like of your deed. When it was the fourth day, he bade me farewell, took a piece of charcoal, and wrote poetry on the wall of the room, saying: \"If they return, show it to them.\" And he left. We rose to the room, and there it was:\n'My brothers, I heard of you...\nI intended the monastery out of joy.'\n'But I found time had separated you...\nAnd thus is time, possessor of calamities.'\n'I asked the priest what they did...\nSo the priest answered with wonder.'\n'So we did the like of your deed...\nAnd drank from the blood of the grape.'\n'A daughter of the vine aged for a time...\nSince the era of Al-Lat and the idols.'\n'And we picked the sweet of fruits...\nAnd ate the ripe dates.'",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 17
  },
  {
    "serial_number": "6270591",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "'And we separated in distress...\nAll of us calling: Oh my sorrow.'\nWhen we returned to Wasit, we searched for the man, but we did not know any news of him, so we knew he was a stranger who passed through the town.\n\nDayr Sulayman\nDayr Sulayman in the frontier near Duluk [Duluk, Turkey], overlooking Marj al-Ain. It is the utmost in pleasantness. Ja'far bin Qudamah told me, saying: Ibrahim bin al-Mudabbir, following his calamity and its removal from him, governed the Khazar frontiers. His residence was mostly in Manbij [Manbij, Syria]. He went out in some days of his governorship to the districts of Duluk Ra'ban, and left behind in Manbij a slave girl he had as a concubine, a singer called: Ghadir. Some of his scribes told me that he was with him in Duluk, and he was on a mountain of its mountains containing a monastery known as Dayr Sulayman, one of the most beautiful and pleasant of Allah's lands. He stayed in it and called for light food, so he ate and drank. Then he called for an inkwell and paper and wrote:\n'O my two cupbearers in the middle of Dayr Sulayman...\nCirculate the cups, and give me a second drink and a third.'\n'And single out with the pure of it Abu Ja'far my brother...\nAnd the possessor of my trust among mankind and my sincere friend.'\n'And turn with it towards Ibn Salam who...\nI have affection for, and return after that to Nu'man.'\n'And include with it the drinking companions and friends, for I...\nDenied my life after my companions and brothers.'\n'And do not leave my soul to die of its illness...\nFor the memory of a beloved who saddened me and distressed me.'\n'I journeyed from him due to avoidance and abandonment...\nAnd he came towards me weeping, so he made me weep.'\n'And I parted from him - and Allah will gather our union...\nWith the anguish of a sad one and the thirst of a burning one.'\n'And the night of Ain al-Marj, his phantom visited...\nSo it stirred longing for me and renewed my sorrows.'\n'So I overlooked the top of the monastery looking up...\nWith glancing eyes and looking at a human.'\n'Perhaps I see the houses of Manbij, a sight...\nThat calms my passion and uncovers my griefs.'\n'But my gaze fell short and poured with a tear...\nAnd I would be the ransom for the one who, if he knew, would ransom me.'\n'And like it is my longing for him facing me...\nAnd my heart whispered to him in conscience and he whispered to me.'\n\nDayr Samalu\n- Dayr Samalu in Raqqat al-Shammasiya in Baghdad, near Al-Baradan. Abu Bakr Muhammad bin Umar told me: I went out one day, having been afflicted by tightness of chest and divided thought, to the place known as Al-Malikiyya. I passed by Dayr Samalu, on the Fadl River. I sat in a place under the shade of a tree in the courtyard of the house humming some verses. Suddenly, a beardless boy like the rising moon passed by me. I said:\n- \"O youth, alone in a place like this?\" He said: \"What is in my heart drove me to ride the risk. So by Allah upon you, will you not inform me if a group of Turks passed you with a singer on a donkey, wearing an orange cloak?\" I said: \"Yes, they are in that orchard. But tell me, do you want to enter upon them?\" He trembled a great tremble, and his color did not cease changing until he calmed a little. I continued to console him and encourage him, and I knew that he loved the singer, and that she had left him and broken her promise to him, and went out with the Turks. When he calmed from his sigh and recovered from his swoon, he said: \"Allah has bestowed a favor upon me through you, otherwise what is in my heart would have driven me to enter the orchard and end up in an ugly state.\" Then he stood and asked me to help him and walk with him until he reached the city. He realized the place of error and panicked severely. So I stood with him and strengthened his spirit, and took him on a path between the orchards so that no one walking on the main road would see him. When we neared the city, he took a rag and wrote on the wall of an orchard we passed:\n'Where are those covenants, O treacherous one...\nAnd the tender speech under the minaret?'\n'We have known that it was falsehood...\nAnd fabrication, flirtation, and cunning.'\n'So strive with all effort, for we have forgotten...\nYour love, even with the splitting of the gall bladder.'\nI said to him: \"As if you knew her in the Mosque?\" He said: \"Yes, by Allah. I thought the bitch would be faithful. I made her swear under the minaret of the Rusafa Mosque with oaths that mountains could not bear, so she swore she would not contact other than me, nor want other than me. When she knew of my departure to visit the Shrine at the Tuffuf (Karbala), she seized the opportunity of my absence and did what she did. When I arrived, I asked about her and was told her news. I went out on my face until you met me and turned me back. May Allah grant you good reward on my behalf, and take charge of rewarding you.\" We parted after I knew his house, and he became a friend to me.\n\nDayr Sim'an (St. Simeon's Monastery)\nDayr Sim'an: This monastery became famous for the death of Umar bin Abd al-Aziz in it, but the difference is severe regarding its location, and in determining the place where the Umayyad Caliph fell ill. It was said he died in \"Khanasira,\" and it was said he died in Khanasira and was buried in Dayr Sim'an.\n- The author of \"Al-Uyun wa al-Hada'iq\" mentioned that he died in Khanasir and was buried in Dayr Sim'an in the land of Ma'arrat (al-Nu'man).\n- Al-Mas'udi said: In the mention of Umar bin Abd al-Aziz:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 18
  },
  {
    "serial_number": "6270592",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "He died at Dayr Sim'an in the works of Homs [Homs, Syria] near the lands of Qinnasrin. His grave is famous in this place to this end, honored, visited by many people from the settled areas and the desert; it was not subjected to exhumation in the past time.\n- The authenticity of the grave in Homs was doubted in the days of Saladin al-Ayyubi. When he passed by Aleppo in the year 584 AH, and headed from it intending Ma'arrat al-Nu'man [Ma'arrat al-Nu'man, Syria], he passed by Homs and did not stay in it, which indicates that the grave attributed to the Umayyad Caliph was doubted in those days.\n- There are numerous monasteries bearing the name Sim'an, most of them famous in the vicinity of Aleppo, Antioch, Damascus, Homs, and Ma'arra, and for that reason, historians were not successful in identifying Umar's grave in one of them.\n- It is inferred from Abu al-Faraj's description that the burial of Umar bin Abd al-Aziz was on Mount Qasioun. Ibn Tulun said during his discussion on the Mu'azzamiya and Aziziyya schools - and the construction of the first was in the year 621 AH and the second in the year 635 AH - he said: North of these two schools is a great enclosure with high walls said to have been Dayr Sim'an. It has a door opening to the east and inside it are several honored graves.\nDayr Sim'an in Damascus\nIt is in the districts of Damascus [Damascus, Syria], near Al-Ghouta, on a piece of the mountain, overlooking it. Around it are orchards and rivers, and its location is very beautiful. It is one of the large monasteries. Umar bin Abd al-Aziz was buried at it, on its outskirts. His eulogist said:\n'I said when they included you in the soil and departed...\nMay the pillar of justice and religion not be distant.'\n'They have hidden in the niche of the grave, laid down...\nAt Dayr Sim'an, the balance of the scales.'\n'He whose concern was not a spring he bursts forth...\nNor the palm trees nor the galloping of draft horses.'\nAbu al-Faraj mentioned that the owner of Dayr Sim'an entered upon Umar bin Abd al-Aziz with fruit to gift him during his illness. He accepted it from him and ordered dirhams for him. He refused to take them, but he persisted until he took them, saying: \"O Commander of the Faithful! It is but from the fruit of our trees.\" Umar (may Allah have mercy on him) said: \"Even if it is from the fruit of your trees!\" Then he said: \"O owner of Dayr Sim'an! I am dying from this illness of mine.\" He became sad and wept. Then Umar said to him: \"Sell me the place of my grave from your land for a year; then when the year comes, benefit from it.\"\n\nDayr al-Susi\nDayr al-Susi in the districts of Surra Man Ra'a [Samarra, Iraq] on the eastern side. Al-Baladhuri said: It is Dayr Maryam (Monastery of Mary), built by a man from the people of Susa, and he inhabited it along with monks with him, so it was named after him. It is in the districts of Surra Man Ra'a on the western side. Ibn al-Mu'tazz mentioned it in his poetry, saying:\n'Distract me with the sound of a flute and lute...\nAnd give me the blood of the daughter of the bunch to drink.'\n'I drink the wine while it drinks my mind...\nAnd upon that was the killing of Al-Walid.'\n'Many a drunkenness whose appointment I made the morning...\nAnd a cupbearer I urged with increase.'\n'O nights at Al-Matira and Al-Karkh...\nAnd Dayr al-Susi, by Allah, return.'\n'You were to me samples of Paradise...\nBut without eternity.'\nAhmad bin Abi Tahir said: I intended Surra Man Ra'a seeking one of its grandees with poetry I praised him with. He accepted me and made my gift generous, and gave me a handsome Roman boy. I traveled intending Baghdad. When I had traveled about a parasang, clouds overtook us, so I turned to Dayr al-Susi to stay in it until the rain lightened. The rain intensified and night came. The monk who was in it said: \"You are staying here tonight, and I have good drink, so spend the night reveling then leave early.\" So I spent the night with him. He brought out for me good drink; I had never seen clearer nor more fragrant. The boy spent the night serving me drink, and the monk was my drinking companion, until I died of drunkenness. When I reached morning, I departed and said:\n'May (Allah) water Surra Man Ra'a and its inhabitants...\nAnd a monastery belonging to its Susi, the monk.'\n'For I spent a night in his monastery...\nAnd a full moon on a branch was my companion.'\n'A gazelle gave me drink until the morning...\nYellow (wine) like melting gold.'\n'He gave me wine while awake...\nAnd I slept and he slept by my side.'\n'And there were things for me, woe from...\nTheir sin which my recording angel wrote!'\n\nDayr Saliba (Monastery of the Cross)\nDayr Saliba: Located in the districts of Damascus opposite Bab al-Faradis. It is also known as Dayr Khalid, because Khalid bin al-Walid, when he descended besieging Damascus, his descent was at it.\n- Al-Khalidi said that it is next to Bab al-Faradis, and the proof is the saying of Jarir:\n'I said to the riders when the journey became serious with them...\nOh the distance of Yabrin from Bab al-Faradis!'\nAnd he recited regarding it the saying of the other, which is:\n'O monastery of Bab al-Faradis, the stirrer for me...\nOf sadness with its cells and its trees.'\n'If I lived ninety years in you accompanying...\nMy heart would not fulfill from you some of its desires.'\n- This monastery is also known as Dayr al-Sa'ima.\n- Ibn Asakir said: Dayr Khalid was outside the Eastern Gate next to Bayt al-Abar, so it was ruined.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 19
  },
  {
    "serial_number": "6270593",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "- Ibn al-Kalbi said that the monastery was one mile from the East Gate [of Damascus, Syria].\n- Among the poets who visited this monastery was Abu al-Fath Muhammad bin Ali, known as Abu al-Liqa. He said that he stayed there for a month and said about it:\nIt is a paradise nicknamed Dayr Saliba ... Its beauty is created with perfection and goodness.\nI came to it to stay for a day, so we remained ... In it for a month, and it was a wondrous matter.\nDayr Saliba is near Damascus [Syria], overlooking the Ghouta [Damascus Countryside, Syria]. Abu Bakr Muhammad bin Umar told me, he said: Abu Abdullah Muhammad bin al-Fadl al-Nahwi informed us, he said: Some of the Banu Hamdun told me from his sheikhs, saying: I was with al-Mutawakkil when he went to al-Sham [Syria]. When we were in Homs [Syria], he said, \"I want to tour all the monks' churches, and the place known as al-Faradis when we reach it, for I used to hear about the goodness of this place.\" I said, \"The opinion is what the Commander of the Faithful sees.\"\nThen he settled us in a place between great churches and ancient ruins, to which souls find rest, and he who stays there desires not to depart. When he rested from the fatigue of riding, he summoned me and said: \"Do you wish to tour?\" I said: \"As the Commander of the Faithful commands.\" So he took my hand, and he did not cease exploring those churches and monasteries, witnessing the wonders of images and luxurious items within them. He saw among the young monks and the daughters of the priests faces like moons upon branches, swaying in those porticos and courtyards. Whenever we passed something of that, he would say to me: \"Do you see, woe to you, what we are in? I have never seen the like of this!\"\nThen we were alone with a monk from the caretakers of the church. Al-Mutawakkil kept asking him about the condition of every girl and boy passing by him, and his name and lineage, while he walked. Suddenly, he glanced at writing on the wall of the church. We approached it and it read:\nThe homeless, stripped stranger attended while saying:\nMy gathering was scattered after familiarity ... And my body became miserable after hardship.\nI walked from Iraq [Iraq] to this portico ... And I departed from it in Dhu al-Hijjah of the year two hundred and one.\nAnd I say:\nMy affair has turned to the vilest of matters ... And joy has been exchanged for distress.\nCalamities of time have afflicted me ... Competing to tear the veil of the concealed.\nO soul, have patience for the accidents of the nights ... For everything humbles itself to the decree.\nHe said: \"Woe to you! How curious is this poor man, and how burning is this groan.\" While we were in that state, a girl passed by us; my eye had never seen her like. She was wearing a Jubbah (gown) and in her hand was incense which she was burning... Al-Mutawakkil said to her: \"Come here, O girl.\" She approached with good manners and perfection. He said to the monk: \"Who is this?\" He said: \"My daughter.\" He said: \"And what is her name?\" He said: \"Sa'anin.\"\nAl-Mutawakkil said: \"Give me water to drink.\" She said to him: \"O my master, our water here is from the water of the ponds, and I do not deem the monks' vessels clean enough for you. If it were suitable to quench your thirst, I would have been generous with it for you.\" Then she hurried and came with a silver jug containing water. He signaled to me to drink it, so I drank it. His wonder for her and his desire for her intensified. He said to her: \"O Sa'anin! If I loved you, would you make me happy?\" She sighed and said: \"As for now, I am your slave. But if I knew the truth of your love, and you took hold of your heart, then how I fear the occurrence of tyranny when authority takes hold. Have you not heard the saying of the poet:\nYou were a slave to me in the beginning of the matter ... Then when you possessed, you became an enemy.\nWhere is that joy at the time of meeting ... It has become avoidance and distance from me.\"\nAl-Mutawakkil was moved with joy and almost tore his shirt. Then he said to her: \"Gift yourself to me today so that you and I may drink, for I am your guest.\" She said to him: \"With welcome and ease.\" Then she took us up to an upper room overlooking all those churches. We saw a beautiful view. Then she went and brought clean, thin breads. It seemed Al-Mutawakkil refrained from it due to the dignity of the Caliphate, so he asked her permission to bring food, and she permitted it. So a lamb, sanbusaj (samosas), and things easy to take of similar food were brought. She found what was brought to be elegant and was awed by the utensils. She realized Al-Mutawakkil's status, so she stood before him serving him and bowing to him, but he prevented her. Then her father came to us with wine from the communion house; Al-Mutawakkil mentioned that he had never seen its like. He drank and she drank with him. I asked to be excused due to a fever that had afflicted me that night, so he excused me. He was completely delighted with her, her charm, and the sweetness of her logic.\nWhen the wine took hold of her, she said: \"Shall I sing to you, O my master, from our singing, despite the weakness of the craft?\" He almost wandered in love and said: \"If you do, by Allah, your charm is complete.\" So she stood and brought something they call the \"Qithara\" (Guitar/Lyre), played it, and began to sing:\nO suitor of affection from me, welcome ... Hearing and obeying a command, may I not lack you as a suitor.\nI am a slave to your passion, so drink and give me drink ... And turn away with your cup from your friend if he refuses.\nBy the One who raised the sky, you have possessed me ... And left my heart tormented in your love.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 20
  },
  {
    "serial_number": "6270594",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Al-Mutawakkil shouted and said to me: \"Woe to you! Are you dead?\" I woke up and knew that I had erred in ceasing to accompany him. So I took a Ratl (a large cup) and did not stop drinking until I caught up with him. A day passed for us that was unique among days. Then Al-Mutawakkil made her desire [Islam], so she accepted Islam, and he married her. She remained a favorite with him until he was killed while she was in his house. I saw in some copies that a blackbird and a turtledove were crying out on the tops of trees at the monastery, and Al-Mutawakkil listened to them. When she realized he was listening, Sa'anin recited to him:\nAs if the blackbird is a monk of a church ... The goodness of the time distracted him from his belt (Zunnar).\nHe made the orbits of the branches his hermitages ... Mourning in his Gospel and his Psalms.\nAnd as if the turtledove laments his sorrow ... With his groaning, his longing, and his sighing.\nA lover whose anxieties split him when the dwellings ... Of his companion and his friend drew near to him.\nThis pleased him from her, and he increased in joy with her and love for her.\n\n**Dayr Abd al-Masih (Monastery of Abd al-Masih)**\nDayr Abd al-Masih: It was built by Abd al-Masih bin Amr bin Baqila al-Ghassani in al-Hirah [near Najaf, Iraq]. Al-Isbahani mentioned it and said: Abd al-Masih was one of the long-lived ones; it is said he lived three hundred and fifty years. This monastery is on the outskirts of al-Hirah [Iraq] in a place called al-Jar'ah. Abd al-Masih is the one who met Khalid bin al-Walid, may Allah be pleased with him, when he invaded al-Hirah and fought the Persians. They threw at them from their three fortresses, the fortresses of the family of Baqila, with round pottery. He used to go out in front of the horses, so they would shy away from him. Dirar bin al-Azwar said to him: \"This is from their plot.\" So Khalid sent a man to summon a wise man from among them. Abd al-Masih bin Amr came to him, and what happened between them is well-known and famous. He said: Abd al-Masih remained in that monastery after he made peace with the Muslims for one hundred thousand, until he died. The monastery fell into ruin after a period, and an arched structure of stone appeared in it. They thought it was a treasure, but lo, inside was a marble bed with a dead man upon it. At his head was a tablet on which was written:\nI am Abd al-Masih bin Amr bin Baqila:\nI milked time for its halves during my life ... And I attained wishes beyond increase.\nI struggled with affairs and they struggled with me ... Yet I did not submit to a difficult dilemma.\nI almost attained the Pleiades in honor ... But there is no path to immortality.\n\n**Dayr Adas**\nDayr Adas in al-Sham [Syria/Levant]. Abu Bakr Muhammad bin al-Hasan bin Durayd told us, he said: Al-Makki informed us from Ibn Abi Khalid, from al-Haytham, he said: Usama bin Zayd informed us, from Zayd bin Aslam, from his father, from Umar bin al-Khattab, may Allah be pleased with him, who said:\nI went out with some people from Quraysh for trade to al-Sham [Syria] in the Pre-Islamic period (Jahiliyyah). While I was in one of its markets, a patrician seized me by my neck. I went to dispute with him, but it was said to me: \"Do not do it, for you will not get justice from him.\" He took me into a church where there was a great pile of dirt. He brought me a basket and a shovel and said to me: \"Move what is here.\" I sat pondering my affair, how to act. When it was midday, he came to me wearing a Sabaniyah (cloth) through which I could see the rest of his body. He said: \"You have, as I see, moved nothing!\" Then he gathered his hands and struck my brain with them. I said: \"Oh, bereft of your mother, O Umar, have you reached what I see!\" Then I jumped to the shovel and struck his head with it, then I buried him in the dirt. I went out aimlessly, not knowing where I was going. I walked for the rest of my day and night, and the next day until midday. I ended up at a monastery and sought shade in its courtyard. A man came out to me and said: \"O servant of Allah, what makes you sit here?\" I said: \"I have lost my companions.\" He said: \"You are not on a road, and you look with the eye of a fearful person. Enter, have some food, and rest.\" So I entered, and he brought me food and drink and was kind to me. Then he looked me up and down and said: \"The People of the Book—or the Books—know that there is no one on earth more knowledgeable about the Book—or the Books—than me, and I find your description to be the description of the one who will drive us out of this monastery and conquer us over it.\" I said: \"O man, you have gone to a wrong interpretation.\" He said to me: \"What is your name?\" I said: \"Umar bin al-Khattab.\" He said: \"You are, by Allah, our man. So write for me a guarantee for this monastery of mine and what is in it.\" I said to him: \"O man, you have done me a favor, so do not spoil it.\" He said: \"It is only a writing on parchment. If you are our man, then so be it; and if not, nothing will harm you.\" So I wrote for him concerning his monastery and what was in it. He brought me clothes and dirhams and gave them to me. Then he saddled a female donkey and said to me: \"Do you see it?\" I said: \"Yes.\" He said: \"Ride it, for you will not pass by any people but that they will water it, feed it, and host you. When you reach your place of safety, turn its face back, and they will do the same with it until it returns to me.\" He said: So I rode it until I caught up with my companions and went with them.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 21
  },
  {
    "serial_number": "6270595",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "When Umar arrived in al-Sham [Syria] during his Caliphate, that monk came to him with the document; he was the owner of Dayr Adas. When he saw him, he recognized him and then said: \"That which Umar has no way out of has come.\" Then he turned to his companions and told them his story. When he finished it, he turned to the monk and said: \"If you host the Muslims, treat their sick, and guide them, we will do that [honor the agreement].\" He said: \"Yes, O Commander of the Faithful.\" So Umar fulfilled it for him.\n\n**Dayr al-Adhara (Monastery of the Virgins)**\nDayr al-Adhara: For the nuns in the Arab East, there are numerous monasteries; we indicated some of them in the introduction.\n- Al-Shabushti noted the monastery located in Qati'at al-Nasara (The Christians' Ward) in Baghdad [Iraq] during his era, saying: \"And in Baghdad also is a monastery known as 'Dayr al-Adhara' in Qati'at al-Nasara on Nahr al-Dajaj (Chicken River). It was named that because they have a fast of three days before the Great Fast (Lent), called the Fast of the Virgins. When the fast ends, they gather at this monastery to worship and draw near [to Allah]. It is a beautiful monastery.\"\n- Al-Khalidi said: I saw it, and it had virgin women and wine taverns, but the Tigris [River] swept over it with its floods and destroyed it until no trace of it remained. It was mentioned that he passed by it in the year 320 AH while it was populated.\n- Dayr al-Adhara: It was a monastery for Syriac nuns in Baghdad [Iraq], in Qati'at al-Nasara, where the Church of Mar Toma (Saint Thomas) for the Syriacs was located. Ibn al-Ibri mentioned it in the events of the year 1002 of the Greeks [approx. 691 AD], and he called it the Monastery of the Sisters. He said that a group of commoners tried to loot it, then they turned away fleeing because news reached them that a crowd of the mob perished in a fire that broke out in the mentioned church due to their actions.\n- See also: Al-Mushtarak Wad'an 190-191.\n- Marasid al-Ittila': 2-569.\n- Masalik al-Absar 1-258-261.\n- Al-Budur al-Musfirah 19-20.\n- Baghdad in the Era of the Abbasid Caliphate 80-181.\n- Irrigation of Samarra in the Era of the Abbasid Caliphate 1-184, 185.\n- The Christian Monasteries in Islam 24.\n- Guide to the Map of Baghdad 42, 82.\n- Conditions of the Christians of Baghdad 113-115.\n\n**Dayr al-Adhara**\nAbu al-Faraj al-Isbahani said: It is between the land of Mosul [Iraq] and the land of Bajarma in the works of al-Raqqa [Syria]. It is a great ancient monastery. In it are virgin women who became nuns and stayed there for worship, so it was named after them. It had reached one of the kings that there were women of beauty in it, so he ordered them to be brought to him to choose from them whom he wanted with his own eye. That news reached them, so they stood their night praying and asking [Allah] to suffice them against his evil. A night visitor [death/calamity] struck that king and destroyed him that very night. So they became fasting, and for that reason, the Christians fast the fast known as the Fast of the Virgins until now.\nDayr al-Adhara in Surra Man Ra'a (Samarra) [Iraq] exists until now, inhabited by nuns. The poets have mentioned this monastery frequently. Among them is Abu al-Hasan Jahza al-Barmaki. Abu al-Faraj al-Husayn bin Ali al-Isbahani recited to me what he [Jahza] said about it:\nIs there a way to Dayr al-Adhara and a look ... At the goodness before death?\nAnd do I have a drunkenness in the market of al-Qadisiyah ... That comforts my soul while the breeze is gentle?\nAnd do I have a stance at the taverns of al-Matirah ... Watching the exit of the wineskin while it is carried?\nTo young men whose gathering was not scattered by blame ... Their slogan at the morning is wine.\nThe bell has spoken after its silence ... And a priest hastened and a wick shined.\nHe wants to stand for the station by his claim ... And addiction makes him tremble so he leans.\nHe sings while the causes of correctness support him ... And he has no equal in what he says:\n\"Is there a way to smell the lavender and a look ... At Qarqara before death?\"\nAnd he sang a second time while touching his cup ... And his tears were flowing on his cheeks:\n\"He will turn away from mentioning me and forget my affection ... And a friend will create a friend after me.\"\nMay Allah water a life in which there was no attachment ... For them, and no blamer denied it.\nBy your life, I did not bear patience for his loss ... And all patience for other than him is beautiful.\nHe said: When Ubayd Allah bin Abdullah bin Tahir went out from Baghdad [Iraq] to Surra Man Ra'a (Samarra) [Iraq], and Al-Mu'tazz had summoned him, he stayed at this monastery. He stayed there for two days, found it pleasant, and drank there. Then he said these verses:\nDo you not see the goodness of our time, O Sa'id ... A laughing time and an arranged garden.\nAnd gardens as if they are cloaks ... Every day they have a new dye.\nAs if the anemone in it is a lover ... And as if the ox-eye daisy is a lovestruck admirer.\nAs if the branches leaning are figures ... And as if the blossoms in them are necklaces.\nAs if the fruits and the green leaves ... Are clothes under which are breasts.\nSo give it to me as wine that relieves from worry ... And shows our joy and repeats it.\nAnd urge the cup, O Sa'id, for indeed ... A flute has urged you for it and a lute has moved.\nAnd deflower the virginity of pleasures in Dayr ... Al-Adhara, for its like will not return!\nIbn Qudamah mentioned and said:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 22
  },
  {
    "serial_number": "6270596",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "I attended the funeral of Shaji. When we departed, I entered with Ubayd Allah, assisting him and comforting him. He was looking down, and his tears were flowing on his cheeks. I had never seen a weeper more beautiful than him. Then he raised his head and turned to us, saying:\nI swear that if I were afflicted by losing her ... While within me a vein pulsed for life and for relapse,\nI would have killed myself upon parting with her ... But she died while my soul had already gone.\nHe said: Then I attended with him to visit her grave. When he intended to leave, he said:\nWhoever visits the home of loved ones for their life ... And for what he hopes of meeting, is capable.\nSo let him come to the home of loved ones who inhabited decay ... Out of generosity and preservation, and the meeting is the Gathering [Day of Judgment].\nHe said: And a son of Ubayd Allah from Shaji died, so he visited his grave, then recited:\nO gathering place of loved ones after separation ... I see you near, yet the meeting is far.\nO wonder, I visit you compelled ... And in you are those I love, yet I turn away from you willingly.\nJahza said: I entered upon Ubayd Allah bin Abdullah bin Tahir one day. Some sheikhs came to him, and he ordered them to sit on his right. Then middle-aged men came, and he ordered them to sit on his left. Then young men entered and stood before him, and he did not order them to sit. I asked him about them, and he said: \"These are my sons,\" and he pointed to the sheikhs, \"and these are their sons,\" and he pointed to the middle-aged men, \"and these are their sons,\" and he pointed to the young men. I said: \"Are your sons from one mother or from different mothers?\" He said: \"All of them are from Shaji.\" And he recited:\nShaji and I planted in my youth ... The seedlings of passion, so they matured with sweet fruit.\nThe sons of Shaji grew gray for my back and matured ... And their sons grew gray while she is the owner of my heart.\nHe said: She has been with me for seventy years. An astrologer had judged that he would die before her, but she died before him. He said:\nO wonder of me and of whom I tended ... With the strongest causes of passion, and she tended me.\nI was hoping to be her ransom ... But when the time of death came, she ransomed me.\n\n**Dayr Alqama (Monastery of Alqama)**\nDayr Alqama in al-Jazira [Upper Mesopotamia]: And in al-Jazira is Dayr Alqama. It was built by Alqama bin Adi bin al-Rumayk bin Thawb bin Usus bin Ruba bin Namara bin Lakhm. Adi bin Zayd al-Ibadi says about him, eulogizing him:\nGood morning, Alqama bin Adi ... Did you stay today or do you depart?\nThe young men have departed with their caravan ... And the meat in the lowlands has not been pulled up.\nAdi also says about this monastery, and it contains singing:\nI drank with the sons of Alqama in the monastery ... I gave them chilled wine when,\nIt was as if the scent of musk was in its cup ... When we mixed it with the water of the sky.\nWhoever is pleased by life and its pleasures ... Let him make wine a ladder for himself.\nAlqama, what is the matter with you that you did not come to us ... Did you not desire today to be blessed?\nThis monastery was a promenade for the princes of al-Hirah [Iraq]: they would eat near it and drink.\n\n**Dayr Futrus and Dayr Bulus (Monastery of Peter and Paul)**\nDayr Futrus and Dayr Bulus: Outside Damascus [Syria]. Abu al-Faraj said: These two monasteries are outside Damascus in the areas of Banu Hanifa in the district of al-Ghouta [Damascus Countryside, Syria]. The place is beautiful, wondrous, with many orchards, trees, and waters. Jarir said:\nWhen I remembered at the two monasteries, I was kept awake ... By the sound of chickens and the striking of bells.\nSo I said to the riders when the departure became serious for us ... O how far is Yabrin from the Gate of al-Faradis!\nHe also says regarding it, eulogizing his son:\nSawadah perished, showing my eye flesh ... A hawk screeching atop the high watchtower.\nIf you have no weeping woman at the two monasteries ... Then many a weeping woman is wailing in the sands.\nThey said: Your share is reward, so I said to them: ... How can there be stability when I have parted from my lion cubs?\n\n**Dayr al-Qa'im al-Aqsa (The Farthest Standing Monastery)**\nDayr al-Qa'im al-Aqsa is on the bank of the Euphrates [River] on the western side on the road to al-Raqqa [Syria] from Baghdad [Iraq]. Abu al-Faraj said: I have seen it. It was called al-Qa'im (The Standing) only because it has a high watchtower that was between the Romans and the Persians, used to watch over the edge of the border between the two kingdoms, similar to the hill of Aqarquf in Baghdad [Iraq], and the finger of Khaffan behind Kufa [Iraq]. Near it is a monastery that is now a ruin. I entered it and there was no one in it, nor did it have a roof or a door.\nHashim bin Muhammad al-Khuza'i informed me, he said my uncle Abdullah bin Malik informed me, from his father, he said: Ishaq al-Mawsili said: We went out with al-Rashid to al-Raqqa [Syria]. We passed by al-Qa'im al-Aqsa. Al-Rashid admired the place. The time was spring, and those meadows were filled with anemones and varieties of flowers. So he drank upon that for three days. I entered the monastery and toured it. Lo, there was a female monastery dweller whose breasts were just budding, wearing sackcloth. I had never seen a face more beautiful than hers, nor a figure, nor symmetry. It was as if that sackcloth on her was jewelry. I called for date wine (Nabidh) and drank cups to her face, and I said about her:\nAt Dayr al-Qa'im al-Aqsa ... Is a gazelle, a fawn with dark lips.\nMy love for him has worn out my body ... And he does not know what I encounter.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 23
  },
  {
    "serial_number": "6270597",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "And I hide his love with my effort ... But by Allah, it is not hidden.\nThen I called for the lute and sang a beautiful song with it. I kept repeating it and drinking to it, looking at her face, until I became intoxicated. When it was the next day, I entered upon al-Rashid while I was dead drunk. He asked me for news, so I told him my story. He said: \"Goodness, by my life!\" He called for drink and drank for the rest of his day. When it was evening, he said: \"Stand up so that I may disguise myself and enter with you to your female companion, so I may see her.\"\nHe rode a donkey and veiled himself with his cloak. We entered, and he saw her and said: \"Beautiful, by Allah! You have not wasted what you did.\" He ordered a cup to be brought, and my lute was brought. I sang the song for him three times. He drank three Ratls (large cups) and ordered ten thousand dirhams for me. I said to him: \"O my master, what about the subject of the story?\" So he ordered the like of that for her. He ordered that no land tax (Kharaj) be taken from the farms of this monastery, and he granted it to them as a fiefdom. He set upon it a tax of ten dinars every year, to be paid on its behalf in Baghdad [Iraq]. Then we departed.\nMuhammad bin Mazid informed me, he said: Hammad told us from his father, he said: We went out with al-Rashid intending for al-Raqqa [Syria]. When we were at the place called al-Qa'im, we stopped. He went out to hunt, and we went out with him. He went far in pursuit of game. A monastery appeared to me, so I headed for it, as I was tired. I looked down upon its owner, and he said: \"Do you wish to stay with us today?\" I said: \"Yes, by Allah, and I am in need of that!\" So I dismounted, and he opened the door for me and sat talking to me. He was a very old man who had lived during the the state of Banu Umayyah. He began telling me about the people who had stayed with him, their clients, and their armies. He offered me food, and I accepted. He presented me with food from the food of the monasteries, clean and good. I ate from it. He brought me drink and fresh basil, so I drank from it. He assigned a nun girl to serve me; I had never seen a better face than hers nor more shapely. I drank until I became intoxicated, slept, and woke up at nightfall. I said regarding that:\nAt Dayr al-Qa'im al-Aqsa ... Is a gazelle, a fawn with dark lips.\nMy love for him has worn out my body ... And he does not know what I encounter.\nAnd I conceal his love with my effort ... But by Allah, it is not hidden.\nI rode and caught up with the army. Al-Rashid had sat for drinking and asked for me but I was not found. I was informed of that. I sang those verses and entered upon him. He said: \"Where were you? Woe to you!\" I told him the news and sang the song for him. He was delighted and drank to it until he became intoxicated. He delayed the departure the next day, and we went to the monastery and he entered it. He saw the sheikh and made him speak, and he saw the girl who was serving me yesterday. He called for light food and ate from it, and called for drink. He ordered the girl who was serving me yesterday to take charge of serving him and giving him drink, so she did. He drank until his soul was pleased. Then he ordered one thousand dinars for the monastery and ordered the bearing of its land tax for him for seven years. Then we departed.\nHammad said: My father told me, he said: When we were at Tell Azaz in Dabiq [Syria], I went out with friends of mine to picnic in one of its villages. We stayed there for days. Al-Rashid sought me but did not find me. When I heard, I came to al-Fadl bin al-Rabi', and he said to me: \"Where were you? The Commander of the Faithful sought you.\" I told him of our picnic, and he got angry. I feared al-Rashid more than what I encountered from al-Fadl. So I said:\nIndeed my heart is at the Tell, Tell Azaz ... With a gazelle from the gazelles of al-Jawazi.\nA fawn living in al-Sham [Syria] and in him ... With the charm of Iraq [Iraq] is the form of al-Hijaz [Saudi Arabia].\nO my people, for the daughter of a priest who struck ... From you the purity of passion and does not reward.\nI swore by the Messiah that she would fulfill the promise ... But she does not intend fulfillment.\nI sang it, then I entered upon al-Rashid while he was angry. He said: \"Where were you? I sought you but did not find you.\" I apologized to him and recited this poetry to him and sang it to him. He smiled and said: \"An excuse, by your father, and what an excuse!\" He did not cease drinking to it and asking me to repeat it all night long until we departed at the rising of dawn. When I arrived at my saddlebag, lo, the messenger of the Commander of the Faithful came to us inviting us. I arrived and entered, and lo, Ibn Jami' was rolling on a bench in the house, intoxicated and restless. He said to me: \"O Ibn al-Mawsili, do you know what brought us?\" I said: \"No, by Allah, I do not know.\" He said: \"But by Allah, I know, a correct knowledge. Your fornicating Christianity brought us, upon you and upon it be the curse of Allah!\" The permission came out, so we were permitted in. We entered. When I saw al-Rashid, I smiled. He said to me: \"What makes you laugh?\" I told him what Ibn Jami' said. He said: \"He spoke the truth. It was only that I missed you both and longed for what we were in, so bring us back.\" So we returned to it until our session ended and we departed.\n\n**Dayr Qurrah (Monastery of Qurrah)**\nDayr Qurrah: It is located opposite Dayr al-Jamajim. Al-Isbahani said: Qurrah, which was built by a man from Lakhm, built it in the days of the reign of Al-Mundhir bin Ma' al-Sama. It is adjacent to Taff al-Barr and Dayr al-Jamajim, on the side of Kufa [Iraq].",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 24
  },
  {
    "serial_number": "6270598",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Ibn al-Ash'ath had chosen Dayr al-Jamajim so that supplies and provisions would come to him, just as he had resolved to cut off the flow of water from al-Hajjaj and his companions, to kill them with thirst. So al-Hajjaj, out of necessity, camped with his armies at Dayr Qurrah. He said: \"What is the name of this monastery?\" It was said: \"Dayr Qurrah (Monastery of Comfort/Settlement).\" He said: \"We have possessed the lands and settled in them.\" He said: \"What is the name of the one where Ibn al-Ash'ath camped?\" It was said: \"Dayr al-Jamajim (Monastery of Skulls).\" He said: \"The skulls of his companions will increase at it, if Allah wills.\"\n\n**Qallayat al-Qass (The Priest's Cell)**\nQallayat al-Qass: It is in al-Hirah [near Najaf, Iraq], in a beautiful location. The priest to whom it is attributed was one of the handsome Christians, and he was an ascetic, then became a profligate. Abu al-Faraj mentioned it, and al-Tharwani said regarding it:\nO my two friends from Taym and Ijl, may you be guided ... Add with the urging of the cup my today to my yesterday.\nIf you two greet me with a greeting ... Then do not skip the basil of Qallayat al-Qass.\nAnd with the Azad lily and the roses, throw ... Your narcissus in the East or the setting of the sun.\nIf you greet me with it, then seclude yourselves ... Praiseworthy, without me, with perfume and saffron.\nAnd if you say: There is no escape from a circulating drink ... And you do not excuse me in delay or confinement,\nThen from a Hirah wine, monastic ... Aged for five or increasing over five.\nIt drags its Izar (garment) over the striking of the mix ... And struts from it in the dyed clothes of the wedding.\n\n**Dayr Ka'b (Monastery of Ka'b)**\nDayr Ka'b in al-Sham [Syria]. Al-Hasan bin Ali informed me, he said: Harun bin Muhammad bin Abd al-Malik told us, he said: Abu Ayyub al-Madini told me, he said: Ahmad bin Ibrahim the scribe told me, he said: My father told me from a man from the people of al-Sham [Syria], he said:\nI was one day staying at Dayr Ka'b, having arrived from a journey. Suddenly, I saw a man who had stopped at the monastery, with luggage, equipment, and a travel bag. He was close to my place. He called for food and ate. He called the monk and gave him two dinars. It appeared there was friendship between them. He brought out wine for him, so he sat drinking and talking to the monk while I was watching them. Then [another man] entered the monastery and sat with them, interrupting their conversation and being heavy in his sitting. He was dull in conversation and stayed long. Some of the servants of the man staying there came to me, and I asked about him. He said: \"This is Muti' bin Iyas.\" When the man stood up and left, Muti' wrote something on the wall and began to drink until he became drunk. When it was the next day, he departed. I came to his place, and written there was:\nA rapture—how I was enraptured in Dayr Ka'b ... I almost died from my rapture in it.\nI remembered my brothers and drinking companions ... So the memory of my friends stirred weeping.\nWhen they were absent, scattered, and I became alone ... And they distanced between the east of the land and the west.\nThey are who they are, so it suffices me; I do not seek ... A replacement for them, by your life, it suffices me.\nTalha the Good is among them, and Abu al-Mundhir ... Is my friend, and Malik, that is my peer.\nO heavy intruder upon us ... When the conversation was good for me and my friends,\nLighten up from us, for you are heavier, by Allah ... Upon us than the parasangs (leagues) of Dayr Ka'b.\nAmong people are those who are light, and among them ... Is like the millstone of seeds mounted upon my heart.\n\n**Dayr Lubba (Monastery of Lubba)**\nDayr Lubba is on the side of the Euphrates [River]. On the eastern side of it. Abu al-Faraj mentioned it and said: It is also narrated as Lubni with a Nun. He said: It is an ancient monastery on the side of the Euphrates on its eastern bank. It is one of the dwellings of Banu Taghlib in al-Jazira [Upper Mesopotamia]. Al-Akhtal mentioned it and said:\nDayr Lubba has been effaced of Umayma, and so has al-Hadar ... It has become desolate, except when a traveler visits it.\nThey finished a concern at the two monasteries they sought ... So they are towards amusement, and their neighbors look askance.\nThere were battles there between Banu Taghlib and Banu Shayban and struggles over those lands. Ibn Muqbil said:\nAs if the horses when they came upon Kalb in the morning ... See behind them what they seek.\nThey were angry, so they do not see retaliation for them ... So let them not pull back until they go out in the morning.\nIf the eyebrows of the family of Qays were lined with kohl ... With Taghlib after Kalb, we would not have been hospitable.\nSo the horses of Qays are not safe for you ... And do not hope for the daughters nor the sons.\nThey raised a dust cloud in Dayr Lubba ... And at the two Hadars they turned the hair gray.\nAl-Ra'i said:\nThey left on the sides of Lubba ... Their women for us when they met us.\n\n**Dayr al-Lujj (Monastery of the Depth/Abyss)**\nDayr al-Lujj: In al-Hirah [near Najaf, Iraq]. Abu al-Faraj said: It was built by Abu Qabus al-Nu'man bin al-Mundhir during his reign. There was no building among the monasteries of al-Hirah better than it, nor a place more pleasant. The poet says about it:\nMay Allah water Dayr al-Lujj with rain, for it ... Despite its distance, is a monastery beloved to me.\nClose to my heart, distant in its place ... And how many are distant in abode yet are close.\nA gazelle inhabiting it stirs its memory ... Nasal-voiced, with enchanting eyes, raised [in luxury].\nWhen he recites the Gospel and sways, bending ... A sad, strange heart remembers.\nAnd upon the echoing of his voice, anxieties ... Of sicknesses and palpitations stirred in my heart.\nAl-Nu'man used to ride to it every Sunday and every festival, and with him were his family specifically from the family of al-Mundhir, and those who drank with him from the people of his religion. Upon them were gilded brocade suits, and on their heads were gold crowns, and in their waists were belts (Zunnar) set with jewels. Before them were flags topped with crosses. When they finished their prayer, they departed to a lookout on the Najaf [Iraq], and al-Nu'man and his companions drank there for the rest of his day. He would give robes, bestow gifts, carry burdens [pay debts], and give connection. That was the best and most beautiful sight. Regarding Dayr al-Lujj, Ismail bin Ammar al-Asadi says:\nI do not forget Sa'da and al-Zarqa on the day they were ... At al-Lujj, east of it, upon the benches.\nSinging to us like the blowing of magic, we deposit it ... From us into hearts that became obedient to Ibn Ramin.\nWe are given to drink a wine like the color of fire, aged ... The sober ones become like madmen from it.\nIf we mentioned a prayer after it had passed ... We stood for it with neither reason nor religion.\nWe walk to it slowly, with no movement in us ... As if our legs are being pulled from mud.\nWe walk with our legs crooked in their placement ... The walk of the geese coming from China.\nOr the walk of the blind of a monastery who have no guide ... Except sticks, to Dayr al-Sa'anin.\nI love Rubayha, indeed Allah has favored her ... With her beauty and singing of various arts.\nSo whoever says to her, \"Sing,\" she makes him happy ... [Singing] \"You killed me on the day of Dayr al-Lujj, so revive me.\"\n\n**Dayr Marah Maryam (Monastery of Saint Mary) in al-Hirah**\nDayr Marah Maryam: In the outskirts of al-Hirah [Iraq], overlooking the Najaf [Iraq]. Abu al-Faraj said: This is an ancient monastery, built by the family of al-Mundhir. It is a beautiful place, between al-Khawarnaq and al-Sadir, and between the Palace of Abu al-Khasib, overlooking the Najaf. In it was a priest called Yahya, a vintner, and he had a son called Yusha (Joshua), whom the witty young men befriended. They would drink at his place to the reading of the Christians and the striking of bells. Bakr bin Kharijah says about him:\nWe spent the night at Marah Maryam ... May Marah Maryam be watered [with rain].\nAnd for our priest Yahya the dominance ... After the sleep of the sleepers.\nAnd for Yusha and his red ... Wine like dragon's blood.\nAnd for young men who surrounded him ... Disobeying the blame of the blamers.\nA gazelle, nasal-voiced, gives them drink ... Delicate in the creation of the wrist.\nShooting hearts with his eyes ... Like the shooting of arrows.\nAl-Tharwani defined it, saying:\nAt Marah Maryam the Great ... And the shade of its courtyard, so stand.\nAt the Palace of Abu al-Khasib the overlooking ... The looming over the Najaf.\nSo the sides of al-Khawarnaq and al-Sadir ... The playgrounds of the predecessors.\nTo the spathed palm trees ... And the doves cooing above them.\nSo leave the saying of the blamer and ... Come early to the reddish wine with kindness.\nAnd from the poetry of al-Tharwani about it:\nLet the days do what they wanted ... If they were generous with a drinking companion and a cup!\nAnd Marat Maryam, and the courtyard in it ... Two gardens of roses and myrtle.\nAnd a gazelle in the glances of his eyes ... Drowsiness in languor, not sleepiness.\nAnd a friend who does not turn away from youthful passion ... Remembering affection, not forgetting.\nAnd embracing an eloquent tambourine ... Singing to me with the poetry of Abu Nuwas:\n\"And pleasures are nothing but that you see me ... Prostrate between a jug and my cup.\"\nAnd Bakr bin Kharijah says about it:\nAt Marah Maryam and at Dayr Zakka ... And Mar Toma and Dayr al-Jathaliq (Monastery of the Catholicos).\nAnd by the Gospel recited by sheikhs ... From the priests in the Ancient House.\nAnd by the Communion and the Crosses, unless ... You have mercy on my sick, yearning heart.\nGrant me refuge, I died before you from worries ... And guide me to the face of the road.\nFor the faces of my affair have narrowed upon me ... And you are the one sought for refuge from the strait.\nAbu al-Faraj said: He says this poetry about a boy of a Christian man from the people of al-Hirah [Iraq], called Ashir bin al-Bara al-Sarraf. He has much poetry about him, mentioning the festivals of the Christians and their churches. Di'bil used to admire his saying:\nHis belt is knotted at his waist ... As if it were cut from my liver.\nAnd he says: I wish these two were mine for a hundred verses of my poetry!\nJaafar bin Qudamah informed me, he said: Maymun bin Harun told me, he said Ishaq al-Mawsili told me, he said: When I went out with Al-Wathiq to al-Najaf [Iraq], we toured al-Hirah and passed by its monasteries. I saw Dayr Maryam in al-Hirah, and I admired its location and the beauty of its building. I said:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 25
  },
  {
    "serial_number": "6270599",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Diyarat",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Its memory stirs like a gazelle that comes … I sing of the dawn of the two eyes, the foster child, when the Gospel is returned and the table shakes … The heart of the stranger remembered it in sorrow, and my heart stirred at the echo of its voice … Nightingales of ailments and distress. Al-Numan used to ride there every Sunday, and on every festival, accompanied by his household, especially the family of Al-Mundhir, and those of his faith who joined him, wearing gold-embroidered silks, crowns of gold on their heads, belts inlaid with gems, and banners topped with crosses before them. After completing their prayers, they would proceed to a lookout in Najaf, where Al-Numan and his companions spent the rest of the day, giving gifts and offerings, traveling and connecting. It was the most beautiful and finest sight. In the monastery of Al-Luj, Isma'il ibn Ammar Al-Asadi says: I will not forget Sa'dah and Al-Zarqa on the day they were … in Al-Luj, east of the shops, singing like a spell, we gave them … hearts that became tender to Ibn Ramin, watered with drinks like the color of refined fire … those awake became like madmen when we mentioned a prayer after neglect … we went to it without reason or faith, walking slowly as if our feet were lifted from clay … walking like crooked legs of geese from China or blind monks with no guide but sticks … to the monastery of Al-Sa’aneen. I love Rubiha, for Allah favored her … with her beauty and melodious voice. Whoever tells her to sing brings her joy: 'You killed me on the day of Al-Luj, bring me to life.' Monastery of Mary in Al-Hirah: near Al-Hirah, overlooking Najaf. Abu Al-Faraj said: It is an old monastery, built by the family of Al-Mundhir, well-placed between Al-Khurnuq and Al-Sadir, and near Qasr Abi Al-Khasib, overlooking Najaf. There was a priest called Yahya Khimara, with a son called Joshua, loved by the young men, who would drink there according to Christian readings, and ring the bells. Bakr ibn Khurajah said: We spent nights at Mary’s Monastery … giving water to Mary and to the priest Yahya Al-Muhayyam … after sleep, and to Joshua and Khimara … with young men who gathered around … drinking from a fine gazelle … gentle of character, throwing arrows with precision … like the arrows shot. Al-Thurwani said: At the Great Monastery of Mary … near Qasr Abi Al-Khasib … Over Najaf, around Al-Khurnuq … Monastery playgrounds extending to the enclosed palm groves … and doves above, calling. Let the blame fall aside … The red in its delicacy … and from Al-Thurwani’s poetry: Let the days do what they wish … when generosity flows with wine! And Mary’s Monastery and its courtyard … two gardens with roses and myrtle, and a gazelle in his eyelids … drowsy without sleep, a friend unwavering in affection … a holder of a fine tambour, singing for me Abu Nuwas’ poetry: 'And pleasures are only when I see you … lying between skirts and cloaks.' Bakr ibn Khurajah says: At Mary’s Monastery and the Monastery of Zakka … and passing by Thomas and the Archiepiscopal Monastery, where priests recite the Gospel in the ancient house … regarding offerings and crosses … I grieve my yearning heart. Grant me relief before worries overwhelm … and guide me to the right path, for my affairs have narrowed … and You are the refuge from constriction. Abu Al-Faraj said: This poetry is about a young Christian boy from Al-Hirah called ‘Ashir ibn Al-Bara’ Al-Sarraaf, with much poetry about Christian festivals and their markets. Di’bal praised his lines: 'His quiver tied at the waist … as if drawn from my own liver.' He said: 'I wish these two were mine with a hundred verses of my poetry!' Ja’far ibn Qudamah narrated: Maimun ibn Harun told me, who was told by Ishaq Al-Mawsili: When I went out with Al-Wathiq to Najaf, we passed through Al-Hirah and its monasteries, and I saw Mary’s Monastery in Al-Hirah, I admired its location and fine construction, and I said:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 26
  },
  {
    "serial_number": "6270600",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "What an excellent place for one who seeks his pleasure ... A monastery for Mary built upon the ridge.\nA shading shade and water not stagnant ... And cloistered women like dolls, houris.\nAl-Wathiq said: \"By Allah, we will not take our morning drink tomorrow except in it.\" He ordered that what was suitable be prepared in it from the night. We went early to it and had our morning drink in it to this voice [song]. He ordered money and distributed it to the people of that monastery, and ordered a reward for me.\n\n**Dayr Marah Maryam in al-Sham**\nDayr Marah Maryam: In al-Sham [Syria], an ancient monastery among its monasteries. Abu al-Faraj said: Al-Husayn bin Yahya told us, from Hammad bin Ishaq, from his father, he said: We stayed with al-Rashid at Dayr Marah Maryam during some of his outings to al-Sham [Syria]. He saw it as a beautiful place, so he became eager for drink and said: \"Sing me a song with the meaning of our place.\" So I sang to him:\nWhat an excellent place for one who seeks his pleasure ... A monastery for Mary built upon the river.\nA shading shade and water not stagnant ... And cloistered women like dolls, houris.\nHe was delighted and drank. He said: \"Is this yours?\" I said: \"No, it is by Ibn Muhriz.\" He said: \"Then you are an echo, conveying what you heard!\" I said: \"Then I will compose a melody for it.\" So I composed for it, and sang it. Abu al-Faraj said: The melody of Ibn Muhriz and Ishaq in this poetry, both are from the First Heavy [rhythm].\n\n**Dayr Mar Sargis (Monastery of Saint Sergius)**\nDayr Mar Sargis: In al-Matirah of Surra Man Ra'a (Samarra) [Iraq]. My uncle informed me, he said: Abu Abdullah Ahmad bin al-Marzuban bin al-Nayruzan told us, he said: Shaybah bin Hisham told me, he said: Abdullah bin al-Abbas bin al-Fadl bin al-Rabi' became attached to a Christian girl. He had seen her during some of the Christians' festivals, so he would not leave the churches during their festivals out of passion for her. He went out on the festival of Mar Sargis and found her in an orchard next to the church. Before that, he used to correspond with her and make known his love for her, but he could not contact her or meet her except on the road. When he found her, she turned away from him and refused somewhat. Then she appeared to him and sat with him. They ate and drank, and he stayed with her and with women who were with her for a week. Then she departed on a Thursday. Abdullah bin al-Abbas said regarding that and sang in it:\nMany a reddish wine from the drink of the Magians ... Babylonian coffee, old wine.\nI unveiled it with a flute and a lute ... Before the striking of the deacon on the bell.\nAnd a kohl-eyed gazelle with coquetry ... Magic-eyed, Samaritan, a bride.\nWe were alone with his goodness, unveiling him ... On a Saturday until the morning of Thursday.\nBetween roses and fresh myrtle ... In the middle of the orchard of Dayr Mar Sargis.\nBending with the beauty of a gazelle's neck ... With a silvered ebony cross.\nHow often I kissed the cross on her neck ... Like a crescent crowned with suns.\n\n**Dayr Mar Sargis**\nDayr Mar Sargis, opposite al-Baradan near Baghdad [Iraq]. Abu al-Faraj said: This man has several monasteries [mentioned in his poetry], among them a monastery opposite al-Baradan, at the back of a village called Kadha. Hammad bin Ishaq narrated from Abdullah bin al-Abbas al-Rabi'i, he said: I and Abu al-Nasr al-Basri—a client of Banu Jumah—entered the Church of Mar Sargis. We had ridden with Al-Mu'tasim to hunt. I stopped looking at a girl I loved, and he began looking at an image in the church. He admired it, until that went on for long. Then he recited to me:\nAn image in a church tempted us ... Allah tempted the one who painted it.\nThe engraver increased the beauty of salt in its image ... Indeed, he made it radiant.\nHer face, I have no doubt, is a temptation ... And so is she to the one who sees her.\nI am envious of the priest over her ... Would that other than me had broken it in jest.\nHe said: So I said to him: \"How different we are: I love a human, and you love a stone!\" He said to me: \"This is jest, and you are serious.\" Abdullah bin al-Abbas sang this poetry with a beautiful melody I heard from him. People attributed the poetry to him because of his frequent poetry about a Christian woman he loved.\n\n**Dayr al-Matrun**\nDayr al-Matrun\n- Al-Qifti mentioned that it—al-Matrun—is an orchard outside Damascus [Syria] called al-Maytur.\n- It seems a large distance separates al-Matrun and al-Maytur, indicated by the saying of Arqalah al-Kalbi:\nHow many a night at al-Matarun I spent ... And a day to al-Maytur while it was rainy.\n- Ibn Munir considered it with Darayya among the parks of Damascus [Syria], so he said after listing a group of parks known in his era:\nSo al-Matrun, then Darayya, then its neighbor ... Then Abil, then the dwellings of Dayr Qanun.\nIbn al-Ruqayyat mentioned it and said:\nAl-Faradis became desolate of them, then al-Ghouta ... Possessor of villages and possessor of shades.\nThen Dumayr, then al-Matrun, then Hawran [Syria] ... Are wastelands, barren deserts of ruins.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 27
  },
  {
    "serial_number": "6270601",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "- And Mahasin al-Shawa al-Halabi mentioned it:\nO my drinking companion, give me drink at al-Matarun ... A wine that brings the joys of the sad.\n- It seems that al-Matarun faded away in the second half of the seventh Hijri century [thirteenth century AD].\n\n**Dayr al-Matrun near Damascus**\nAbu Muhammad Hamza bin al-Qasim said: I read on the wall of an orchard in al-Matarun these verses:\nI was sleepless at Dayr al-Matrun as if I ... Was a guard for the traveling stars at the end of the night.\nAnd Sirius the Crosser turned away as if it were ... A lamp hung upon the churches.\nAnd Canopus appeared on my right as if it were ... A meteor whose direction the wind blew, a firebrand.\nThese are ancient verses narrated for Arta'ah bin Suhayyah.\n\n**Dayr Murran**\nDayr Murran\n- Al-Bakri said: And there is the Aqabat (pass) of al-Murran, named so because it grows tall, straight trees resembling the Murran (lance wood). And Murran with a Fatha on the Mim is another place, but it is not al-Sham [Syria].\nIbn Munir said:\nAnd what made famous ... The festivals of Palm Sunday (Sha'anin) in Dayr Murran attracts me to the abode of the Romans.\nArqalah al-Kalbi said, longing for this monastery:\nAnd in Dayr Murran is a female vintner ... From the Romans on the day of her Palm Sunday.\nShe gave me drink upon her desired face ... Thinner and older [wine] than her religion.\n- Among the events of this monastery is that Khumarawayh bin Ahmad al-Tuluni was killed—in the year 282 AH—in his palace at Dayr Murran—outside Damascus [Syria].\nI say: This is a confirmation of what Habib Zayat established regarding the existence of annexes, taverns, and buildings adjacent to the monastery—see: Al-Khazanah al-Sharqiyyah - Part Two.\n- The time of this monastery's ruin is not known, but it is likely that all the news and poems narrated about it after the fifth and sixth Hijri centuries should be attributed to the locality of Murran. It appears that the traces of the monastery remained visible until after the eleventh century, as inferred from verses by Abd al-Rahman ibn Hamza narrated by al-Muhibbi.\n\n**Dayr Murran near Damascus**\nAli bin Sulayman al-Ahfash informed me, he said: Al-Sukkari and Al-Mubarrad told me from Dimadh Abu Ghassan, whose name is Rafi' bin Salamah, from Abu Ubaydah:\nThat Muawiyah sent an army to the land of the Romans to raid the summer campaign. Smallpox afflicted them, so most of the Muslims died. His son Yazid was drinking his morning draught at Dayr Murran with his wife \"Umm Kulthum.\" The news of them reached him, so he said:\nIf I reclined on carpets drinking the morning draught ... At Dayr Murran, with Umm Kulthum with me,\nThen I do not care what their armies encountered ... At al-Fadhaqadhunah of fever and smallpox.\nHis poetry reached his father, so he said: \"Yes, by Allah, he shall surely join them so that what afflicted them may afflict him.\" So he went out until he joined them and raided until he reached Constantinople [Istanbul, Turkey]. He looked at two built domes upon which were brocade clothes. If the charge was for the Muslims, sounds of tambourines, drums, and flutes rose from one of them. And if the charge was for the Romans, it rose from the other. He asked about them, and it was said to him: \"This is the daughter of the King of the Romans, and that is the daughter of Jabalah bin al-Ayham; each one of them shows joy for what her tribe does.\" He said: \"By Allah, I will surely grieve them.\" Then he aligned the army and charged until he defeated the Romans and forced them into the city. He struck the gate of Constantinople with an iron mace that was in his hand and smashed it until it was pierced. A gold plate was struck over it, and it remains on it to this day.\nAbu al-Faraj al-Isbahani said: Dayr Murran is in an area of Damascus [Syria] on a hill overlooking farms and pleasant, joyful gardens. Harun al-Rashid stayed at it, caroused in it, and drank. Al-Husayn bin al-Dahhak al-Khali' was with al-Rashid when he stayed at it, so he said to him: \"By my life, say some poetry about it!\" So he said verses regarding it, among them:\nO Dayr Murran, may you not be stripped of inhabitants ... You have stirred sorrow for me, O Dayr Murrana.\nMay Murran and its dweller be watered and tended ... Oh, how lovely is the resident in the monastery, whoever it was.\nUrge the wine, for the cup is brimming ... From what stirs the causes of longing at times.\nAl-Rashid ordered Amr bin Banah to sing two melodies in it, one Hazaj and the other Raml.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 28
  },
  {
    "serial_number": "6270602",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Ishaq al-Mawsili recounted from his father, who said: Al-Rashid passed by Dayr Murran and admired it and was pleased by its overlooking of beautiful orchards and delightful, joyful gardens. So he camped at it and ordered that light food be brought. He ate and drank, and called for the drinking companions and singers. The owner of the monastery came out to him; he was a very old, decrepit sheikh. He stood before him, prayed for him, and asked his permission to bring him food from the monastery. He permitted him to do that. So he brought him elegant, concise foods in clean vessels. It was of the utmost beauty and goodness. He ate much of it and found it good. He ordered the sheikh to sit, so he sat before him. Al-Rashid turned his face to him and asked him, so he spoke to him, and he found his conversation witty. Then he said: \"Did anyone from Banu Umayyah stay with you in this monastery?\" He said: \"Yes, may Allah reform my master the Commander of the Faithful. Al-Walid bin Yazid stayed with me here, and with him was his brother al-Ghamr. They sat in this place where my master the Commander of the Faithful sat. I presented food to them, so they ate, drank, sang, and were merry. When the wine took hold of them, Al-Walid leaped into that basin—which was full of wine—and drank from it directly (sipped). His brother al-Ghamr did the same, until they became intoxicated and slept in their places. When Al-Walid recovered from his intoxication, he ordered the basin to be filled for me with dirhams. Then they departed.\" Al-Rashid looked at it (meaning the cup), and lo, he could not drink its fill. He said: \"Banu Umayyah refused but to precede us to pleasures, a precedence in which no one surpasses them.\" Then he ordered the removal of the wine, rode immediately, and departed. He ordered a magnificent reward for the monastery dweller.\nAl-Suli told me, he said: Yazid bin Muhammad al-Muhallabi told us, he said: Amr bin Banah told us, he said: We went out with Al-Mu'tasim to al-Sham [Syria] when he raided. We stopped on our way at Dayr Murran—which is a monastery on a high overlooking hill, beneath which are meadows and beautiful waters. Al-Mu'tasim camped in it, ate, and became eager for drink, so he called for us. When we drank some cups, he said to Husayn bin al-Dahhak: \"Where is this place compared to the outskirts of Baghdad [Iraq]!\" He said: \"Nowhere, O Commander of the Faithful! By Allah, some of the thickets and reed beds there are better than here.\" He said: \"You spoke the truth, by Allah. And upon that, say some verses in which Amr may sing.\" He said: \"As for saying something describing this area with good, I do not think my tongue will utter it. But I will speak longing for Baghdad.\" He laughed and said: \"Say what you wish.\" So he said:\nO Dayr Madyan, may you not be stripped of inhabitants ... You stirred sickness for me, O Dayr Madyana.\nDoes your priest have knowledge to inform us ... Or how does the face of patience aid the one who departed?\nUrge the wine, for the cup is brimming ... From what stirs the causes of longing at times.\nMay Karkhaya and its dweller be watered and tended ... And for the little garden in al-Rawha, whoever was there.\nAl-Mu'tasim admired it, and he ordered me and Mukhariq, so we sang in it. He drank to that until he became intoxicated, and ordered rewards for the group.\n\n**Dayr Marmari (Monastery of Marmari)**\nDayr Marmari in Surra Man Ra'a (Samarra) [Iraq]: It is in Surra Man Ra'a, at the Bridge of Wasif. Around it are vineyards and trees. It was populated with many monks, and people of amusement frequented it. Regarding it, Al-Fadl bin al-Abbas bin al-Ma'mun says:\nI wore out the horses of my pleasures in Surra Man Ra [Samarra] ... And I attained from it my soul's desire and my needs.\nI inhabited in it the places of amusement, immersing myself ... In revelry between rivers and gardens.\nAt Dayr Marmar, as we revive the morning draught in it ... And work the cup in it in the evenings.\nBetween the bells and the sanctification at times ... And sometimes between lutes and flutes.\nAnd how many a slender, flirtatious gazelle in it ... Hunts us with Babylonian glances.\n- Al-Suli told me, he said: Ahmad bin Muhammad bin Ishaq al-Khurasani told me, he said: Al-Fadl bin al-Abbas bin al-Ma'mun told me, he said: I was with Al-Mu'tazz hunting. He became separated from the procession, and I and Yunus bin Bugha were with him. We were near the Bridge of Wasif, and there was a monastery there with a monastery dweller whom I knew and who knew me. He was clean, witty, with pleasant manners and speech. Al-Mu'tazz complained of thirst. I said: \"O Commander of the Faithful, in this monastery is a monastery dweller I know who is light-spirited and is not without cold water. Do you see fit that we turn to him?\" He said: \"Yes.\" So we came, and he brought out cold water for us. He asked me about Al-Mu'tazz and Yunus, so I said: \"Young men from the sons of the soldiers.\" He said: \"Nay, two escapees from the Houris of Paradise.\" I said to him: \"This is not in your religion.\" He said: \"It is now in my religion.\" Al-Mu'tazz laughed. The monastery dweller said to me: \"Will you eat something?\" I said: \"Yes.\" So he brought out sandwiches, bread, and clean condiments. We ate the best meal. He came to us with the most curious potash (cleaning agent). Al-Mu'tazz found him amusing and said to me: \"Ask him between you and him: Whom do you love to be with you of these two, never parting from you?\" I said to him [the question]. He said: \"Both of them, and dates.\" Al-Mu'tazz laughed until he leaned against the wall of the monastery.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 29
  },
  {
    "serial_number": "6270603",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "I said to the monastery dweller: \"You must choose.\" He said: \"The choice, by Allah, in this is destruction, and Allah has not created a mind that distinguishes between these two!\" The procession caught up with them, and the monastery dweller was terrified. Al-Mu'tazz said to him: \"By my life, do not cease from what we were in, for I am a master to those there and a friend to those here.\" So we joked for an hour, then he ordered five hundred thousand dirhams for him. He said: \"By Allah, I will not accept it except on a condition.\" He said: \"And what is it?\" He said: \"That the Commander of the Faithful answers my invitation with whomever he wishes.\" He said: \"That is yours.\" So we agreed on a day we would come to him. He left no limit [in generosity] and established for the whole procession what was needed. He brought us the children of the Christians to serve us. Al-Mu'tazz gave him a magnificent gift that day, and he did not cease visiting him, staying with him, and drinking for the duration of his life.\n\n**Dayr al-Mazuq**\nDayr al-Mazuq, and it is said Dayr Ibn al-Mazuq. It is ancient, on the outskirts of al-Hirah [Iraq]. Abu al-Faraj mentioned it and recited for Muhammad bin Abd al-Rahman al-Tharwani regarding it and Dayr Fathiyun:\nI said to him while the stars were leaning ... On the night of Easter, at the first of the magic (pre-dawn),\nDo you have a desire for Mar Fathiyun and for ... Dayr Ibn Mazuq, without falling short?\nThis breeze overflows from the side of ... Al-Sham [Syria] and the flow of dew is on the trees.\nAnd we ask the earth about its cheerfulness ... And its covenant with spring and rain.\nO what goodness and smelling of a scent ... Like musk coming with the breath of the magic.\nIn drinking wine and hearing a good female [singer] ... Distracting you between the tongue and the string.\nHe said: Dayr Fathiyun is at the bottom of the Najaf [Iraq]. And Dayr Ibn Mazuq is opposite the Palace of Abd al-Masih at the top of the Najaf. Al-Tharwani says about it:\nYou turn the gaze of your eye from afar ... Resembling affection and threat.\nYou admit with the gaze of your eye to me of connection ... And your action to me admits denial.\nYou make me doubt, and I know that this ... Is a passion between sympathy and avoidance.\nYour passion is a passion renewed by the nights ... And it does not wear out with the passing of epochs.\nHe also said:\nThe drink returned to an intoxicated morning drinker ... Who woke up to drink it while the rooster had not crowed.\nAnd the night is in an army whose lightning flashes are many ... From the stars, and the light of the morning has not appeared.\nAnd life is no life unless you act early for it ... With a reddish wine that kills the worry of the soul with joy.\nUntil he who spent the night drinking it remains ... With no departure in him, strutting like the merry one.\nAl-Tharwani longed for it from Baghdad [Iraq], so he said:\nDayr al-Hariq and the Church of al-Mazuq ... Between the pond and the dome of al-Sinniq.\nAre more desirable to me than al-Sarat and its goodness ... At the morning, and than the darkness of the patrician.\nO friend! Avoid blame; do you not see ... How ugly your blame is to me, while you are my friend?\n\n**Dayr Najran (Monastery of Najran)**\nDayr Najran: It is in Yemen [historically Yemen, currently Najran, Saudi Arabia], and the Arabs call it the Kaaba of Najran. It belongs to the family of Abd al-Madan bin al-Dayyan from Banu al-Harith bin Ka'b. From it came the people who wanted to engage in Mubahala (mutual imprecation) with the Prophet, may Allah bless him and grant him peace. Abu al-Faraj al-Isbahani mentioned it and said: It belonged to the family of Abd al-Madan, the masters of Banu al-Harith. He said: People of three houses from Yemen were Christians, competing in churches and their attire and the beauty of their building: the family of al-Mundhir in al-Hirah [Iraq], Ghassan in al-Sham [Syria], and Banu al-Harith bin Ka'b in Najran [Saudi Arabia]. Their monasteries would be in places with many trees, gardens, and ponds, with lofty construction. They made their utensils of gold and silver, their curtains of brocade, put mosaics in their walls, and gold in their ceilings. Banu al-Harith remained upon that until Islam came. Regarding this Kaaba of theirs, Al-A'sha, Al-A'sha of Qays bin Tha'labah, said:\nAnd the Kaaba of Najran is a duty upon you ... Until you make the camels kneel at its doors.\nWe visit Yazid and Abd al-Masih ... And Qays, and they are the best of its lords.\nWhen the Hibarat (Yemeni cloaks) are twisted on them ... And they drag the bottoms of their fringes.\nAnd our witness is the roses and the jasmine ... And the female singers with their flutes.\nAnd a tireless worker binds us ... So which of the three did he criticize?\nHe said: In this poetry is good singing, which Jahza took from Banan.\n\n**Dayr Hind al-Sughra (Monastery of Hind the Younger)**\nDayr Hind al-Sughra in al-Hirah [Iraq]. Abu al-Faraj al-Isbahani said: In al-Hirah is the monastery of Hind bint al-Nu'man bin al-Mundhir. Khalid bin al-Walid entered upon her and said to her: \"Submit [to Islam] so that I may marry you to a noble, original man from the Muslims who resembles you in your lineage.\" She said: \"As for my religion, I have no desire to leave it, nor do I seek a substitute for it. As for marriage, if there were any remainder [of youth] in me, I would not have married nor desired it, so how [can I] when I am an old woman, a skull of today or tomorrow.\" He said to her:\n- \"Ask me a need I may fulfill for you.\" She said:",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 30
  },
  {
    "serial_number": "6270604",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "- \"My greatest need is these Christians who are in your protection.\" He said: \"Yes, this is an obligation upon us in our religion; our Prophet, may Allah bless him and grant him peace, commanded us with it. Is there other than this?\" She said: \"I am in this monastery adjacent to these decaying bones of the people of my house and my religion until I join them.\" He ordered money and clothing for her, but she said: \"I have no need for anything of what you offered. I have two slaves who cultivate a farm from which I get nourishment that sustains my last breath, and I spend what remains on the weak of the people of my religion. I have counted your speech as action, and your promise as cash. But hear from me a supplication that used to be prayed for our kings: 'May a hand that became poor after wealth be grateful to you, and may a hand that became rich after poverty not reach you. And may Allah make your kindness hit its places, and may He not remove a blessing from a generous one except that He makes you a cause for returning it to him'.\"\nThis monastery is near Banu Abdullah bin Darim in Kufa [Iraq], next to the trench, in a pleasant place. Several poets have mentioned it, among them Ma'n bin Zaida al-Shaybani, and his home was there. He says about it:\nO would that I knew, shall I spend a night ... At Dayr Hind while the beloved is near?\nSo desires are fulfilled and loved ones are met ... And a moist branch of joy puts forth leaves.\nHe also says about it:\nIf my night in Baghdad [Iraq] is long, then perhaps ... It is seen in the south of the Monastery as short.\nAbu al-Faraj said: Al-Mughira bin Shu'bah entered upon her when she had gone blind. He conversed with her for a long time, then proposed to her. She laughed and said: \"A one-eyed old man, and a blind old woman! By the Cross, you did not want me seeking offspring, nor out of desire for wealth, nor passion for beauty, but you wanted to say: 'I married the daughter of al-Nu'man!' Depart guided.\" So he departed saying:\nYou perceived what I wished my soul in private ... Goodness to you, O daughter of al-Nu'man.\nYou have returned his mind to Al-Mughira ... Indeed, kings are of sharp minds.\nO Hind, indeed you have spoken the truth, so refrain ... And truth is the best speech of man.\nI am a believer in your swearing by the Cross ... And the Crucifix is the truest oath of the monks.\nAfter that, the youth of Kufa [Iraq] used to go out to this monastery picnicking, eating in its gardens and drinking. Abu Hayyan says about this Dayr Hind:\nO Dayr Hind, you have become a comfort to me ... And you were not; you were to me, O monastery, a place of comfort.\nMay your shade be watered, a shade I used to frequent ... In it, I associate with a priest and a deacon.\nOf old, and the times of joy were ... And of happiness in it, O people, like weddings.\nI do not lack amusement in the corners of its temple ... Nor do I return the cup to the cupbearer in it.\n\n**Dayr Hind al-Kubra (Monastery of Hind the Elder)**\nDayr Hind al-Kubra in al-Hirah [Iraq] is a monastery built by Hind the Elder, mother of Amr bin Hind. She is Hind bint al-Harith bin Amr bin Hujr Akil al-Murar al-Kindi. Written on its front was: \"Hind bint al-Harith bin Amr bin Hujr, the Queen daughter of Kings, and mother of the King Amr bin al-Mundhir, the maidservant of the Messiah, and mother of His servant, and maidservant of His servant, built this church in the time of the King of Kings Khosrow Anushirvan, and in the time of Ephraim the Bishop. So may the God for whom she built this house forgive her sin, and have mercy on her and her son, and accept them and raise them to the establishment of truth, and may the God be with her and with her son for the eternal eternity.\"\nAbu al-Faraj said: Jaafar bin Qudamah told me, from Muhammad bin Abdullah bin Malik al-Khuza'i from his father, he said: I entered with Yahya bin Khalid - Dayr Hind the First, when we went out with al-Rashid to al-Hirah [Iraq]. He had intended it to picnic in it and see the ruins of al-Mundhir. He saw the grave of her father al-Nu'man, and her grave beside it. Then he went out to the other Dayr Hind, which is the larger one, and it is on the edge of the Najaf [Iraq]. He saw on the side of its wall an inscription. He ordered a ladder, so it was brought, and ordered some of his companions to climb to it. And lo, it was:\nIndeed, the Banu al-Mundhir have passed away generally ... Where the monk built the church.\nTheir pungent musk wafts ... and ambergris that the collector gathers.\nAnd silk and linen were their clothes ... No weaver wove wool for them.\nAnd glory and kingship were established for them ... And wine whose pouring vessel flows.\nThey became such that no seeker hopes from them ... Any good, nor does a fearer fear them.\nAs if they were a toy in it ... With which the rider traveled to where?\nSo they became in the layers of the earth ... After a bliss that was constant for them.\nThe worst of remainders is he who remains of them ... Fewness and humiliation, his luck is disappointed.\nHe said: Yahya wept when this poetry was read, and said: \"This is the way of the world.\" And he turned away from that direction of his.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 31
  },
  {
    "serial_number": "6270605",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "**Chapter Two**\n**News of Unknown Monasteries**\nIbrahim bin Muhammad bin Ayyub told us, he said Abdullah bin Muslim told us: It reached me that Abu al-Tamhan al-Qayni was asked—and he was a profligate ruiner—\"What is the lowest of your sins?\" He said: \"The night of the monastery.\" It was said: \"And what is the night of the monastery?\" He said: \"I stayed with a nun, so I ate a Tafishal (stew) with pork at her place, drank from her wine, committed adultery with her, stole her cloak, and then left her.\"\nHarun bin Muhammad al-Zayyat said: Hammad bin Ishaq al-Mawsili told me from his father: That al-Gharid heard the voices of monks at night in a monastery of theirs and admired them. Some of those with him said to him: \"O Abu Yazid; craft a melody like this voice.\" So he crafted the like of it in his melody:\nO Umm Bakr, your love is apparent ... Do not cut me off, for I am departing early.\nThe departure has become serious and my companions have urged me ... And I want an enjoyment of provisions.\nThe poetry is by Sa'id bin Abd al-Rahman bin Hassan bin Thabit al-Ansari.\n- Al-Hasan bin Ali informed me, he said Ibn Mahrawayh told us, he said Ubayd Allah bin Ammar told me, he said Ubayd Allah bin Ahmad bin al-Harith al-Qurashi told me, he said al-Abbas bin al-Walid told us, he said Damrah told us:\nAbd al-Wahhab bin Ibrahim the Imam went out one day to some monasteries and stayed in one, while he was governor of al-Ramla [Palestine]. He asked the owner of the monastery: \"Did anyone from Banu Umayyah stay with you?\" He said: \"Yes, Al-Walid bin Yazid and Muhammad bin Sulayman bin Abd al-Malik stayed with me.\" He said: \"So what did they do?\" He said: \"They drank in that place, and indeed I saw them drinking from their vessels. Then one of them said to his companion: 'Come, let us drink from this Jurn (large stone basin)'—and he pointed to a great basin of marble—He said: 'I will do it.' So they did not cease passing it between them and drinking from it until they were intoxicated.\" Abd al-Wahhab said to a black client of his: \"Bring it.\" Damrah said: I saw him, and he was described as strong, going to move it, but he could not. The monk said: \"By Allah, I saw them passing it to each other, and each one of them would fill it for his companion, lift it, and drink it without caring.\"\nAbu Hashisha said: Ibrahim bin al-Mahdi heard voices of my singing from Muhammad bin al-Harith bin Buskhunnar and Amr bin Banah, and he admired them and his slave girls took them. He said: \"The Tanbur (long-necked lute) is all invalid; if any of it is truth, then it is this.\" He desired to hear me. I feared him with a great fear and said: \"If he is pleased with me, that will not increase me, and if he is not pleased with me, a stigma will remain on me for the rest of time.\" He used to request me from Muhammad bin al-Harith bin Buskhunnar specifically, and from Ishaq bin Amr bin Bazi', so I used to flee from them. Until we were present in Surra Man Ra'a (Samarra) [Iraq], and I was in those days devoted to Abu Ahmad bin al-Rashid. We were in tents, and we had not inhabited the houses yet. The messenger of Ibrahim bin al-Mahdi came to Abu Ahmad bin al-Rashid, conveyed greetings to him, and said: \"Your uncle says to you: 'The tricks have exhausted me regarding this malicious one, and I love to hear him while he flees from me. So I would love for you to send him to me and let Rabrab be with him to comfort him'.\"\nAbu Ahmad said to me: \"You must go to my uncle.\" I strove with every effort for him to excuse me, but he refused. When I saw that it was something inevitable, I put on my clothes and went to him. He was staying in the monastery. He welcomed and brought [me] near, and put me completely at ease. Rabrab was with me. He called for date wine (Nabidh) and ordered servants of his, elders, so they sat with me, drank, and gave me drink. He offered me by every trick to sing, but I feared him with intense fear and was tongue-tied. I drank a Ratl (large cup). He called for three slave girls; they came out and sat. He said to them: \"Say.\" They said:\nHow is my trick when you do not connect ... My patience has run out and tricks are few.\nIf my body is wasted by your love ... Then my heart relies upon you.\nThe poetry is by Khalid the Scribe and the singing is by Abu Hashisha, Raml [rhythm]. He used to call it \"The Monastic\" (Al-Rahbani); he created it to a melody from the melodies of the Christians he heard from monks at night repeating it, so he created it upon that. One of them sang it, so I lost my mind, and I heard something I had never heard the like of. He said: \"O my friend, is this yours?\" I said: \"Yes, may Allah reform the Prince.\" A trembling seized me. He said to them: \"Say.\" They said:\nMy Lord, what is the matter with me and passion ... What is the matter with this passion and with me.\nMy eye is confused, which loved ... The beauty of my heart and what it contained.\nThe poetry is by Khalid, and the singing is by Abu Hashisha, Raml. She sang it even more wondrously than the first. He said: \"O my friend, is this yours?\" I said: \"Yes, O my master.\" He said: \"Thus we took them from Muhammad bin al-Harith.\" Then he drank another Ratl. I said to myself: \"The man invited you to hear you or to make you hear.\" I strengthened my resolve and sang to him with poetry by Khalid the Scribe, which is:\nIf your heart persists in mentioning him ... And your beloved persists in abandoning him.\nIt has bequeathed the eye long weeping ... And the heart is mighty against patience for him.\nIf passion for him takes away the heart ... Then your body, no doubt, is on his trail.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 32
  },
  {
    "serial_number": "6270606",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Al-Dayarat (The Monasteries)",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "And which lover has passion treated harshly ... With long remembrance, yet did not wear him out?\nHe began repeating the first verse and the last verse and said: \"Do not go out, O my friend, to another.\" I did not cease repeating it to him until he drank a third. I rested for an hour, drank a Ratl, and my soul felt good. Then he asked me to repeat, so I sang his melody to him, differently than the first. He looked at me and laughed and did not say anything. He drank a fourth Ratl. Sunset came, so he said to me: \"O my friend, I do not doubt that I have made my son lonely for you, so go in the protection of Allah.\" I departed flying with joy. When I came to Abu Ahmad and he looked at me from afar, he said: \"Wheat or barley?\" I said: \"Nay, sesame and honey. escape despite the nose of the one who is spiteful.\" He said: \"Woe to you, do you think I do not know your merit? But I loved to seek the help of his opinion on my opinion of you.\" I told him the story, and that pleased him. He was not satisfied until he sent Muhammad bin Rashid the strangler to him secretly, asking him about me. He said: \"I did not think there was anyone like him in his craft.\"\nAbu al-Hasan Jahza said: Khalid the Scribe said to me: I entered some monasteries one day, and suddenly I was with a young man bound in shackles, beautiful of face. I greeted him, and he returned the greeting to me and said: \"Who are you?\" I said: \"Khalid bin Yazid.\" He said: \"The author of the delicate pieces?\" I said: \"Yes!\" He said: \"If you see fit to relieve me with some of what you recite to me of your poetry, then do so.\" So I recited to him:\nI sipped from her lips a wine ... And kissed from her cheek a pomegranate blossom.\nAnd I embraced from her a shifting sand dune ... And a moist branch and a moon that illuminated.\nAnd I saw from her light in the darkness ... For every place in the night, a day.\nHe said: \"You have done well! May Allah not break your mouth (teeth).\" Then he said: \"Complete for me these two verses:\nMany a night longer than the breath of the lover ... In length, I spent in wailing.\nAnd a conversation more delicious than the look of the lover ... I exchanged for bad blame.\"\nBy Allah, I worked my mind, but I was not able to complete them!\n\n**Chapter Three**\n**Festivals of Palm Sunday (Sha'anin)**\nAli bin Harun bin al-Munajjim informed me from Ziryab, she said: I visited Abdullah bin al-Mu'tazz on the day of Sha'anin (Palm Sunday). He was pleased with my arrival and composed immediately a melody to the poetry of Abdullah bin al-Abbas al-Rabi'i, for which he has a Hazaj [rhythm], which is:\nI have wounds in my heart from the gazelle ... So leave blame, for blame is meanness.\nHow lovely is the day of Sha'anin and what ... I attained in it of joy, if it would last.\n- The poetry is by Abdullah bin al-Abbas, and his melody in it is Hazaj.\nShe said: So Abdullah bin al-Mu'tazz composed a Hazaj for the second verse, and a verse after it which he added to it, which is:\nMy master visited me in it for an hour ... Would that he, by Allah, as long as I live, would stay.\nThe melody of Ibn al-Mu'tazz in \"How lovely is the day of Sha'anin\" and this verse is Light Raml, and it is among the limits (best) of the songs he composed. And among his composition in which he was witty and elegant:\nMy sleeve crowded his sleeve so they twisted ... My heart agreed with his heart so they equaled.\nAnd long did they taste passion so they were cauterized ... O cool of the eye and O my worry and O.\nHe intended here by his saying \"and O\" what people say in imitating the thing with which they address a person of beautiful or ugly, so they say: I said to him O my master and O my lord and O O, and likewise its opposite, to dispense by indicating with this call instead of the explanation. The melody of Ibn al-Mu'tazz in this is Hazaj.\nMy uncle told me, he said: Ahmad bin al-Marzuban told me, he said: Shaybah bin Hisham told me, he said: Abdullah bin al-Abbas loved a Christian girl. He could not reach her nor see her except when she went out to the church. So we went out one day with him to the Sha'anin. He stood until she came. He saw her and then recited to us for himself and sang in it after that:\nIf you are a possessor of medicine, then treat me ... And do not blame, for blame incites me.\nO a look that left a fatal passion ... From a fawn on the day of Sha'anin.\nAnd a look from a herd of wild cows' eyes ... Who went out in the best adornment.\nThey went out walking to a picnic ... Young women among the orchards.\nBelted with their belts (Zunnar) ... And life is what is under the belts.\nThe melody of Abdullah bin al-Abbas in this poetry is Hazaj.",
    "foot_note": "None",
    "book_id": "725",
    "new_page_number": 33
  }
]