[
  {
    "text": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti\nAuthor: محمد بن عبد الله المقشي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "new_page_number": 1
  },
  {
    "text": "sn: 7377\nbook_title: فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»\nbook_link: https://shamela.ws/book/238\nbook_id: 238\nauthor_name: محمد بن عبد الله المقشي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3087\nauthor_ID: 3087\neditor: Null\npublisher: Null\nedition: غير مطبوع\npages: 75\nvolumes: Null\npagination: [الكتاب غير مطبوع]\ncategory: النحو والصرف\ncategory_id: 31",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "new_page_number": 2
  },
  {
    "serial_number": "6662871",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Grammar and Morphology. Book: Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif, by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti'. Explainer: Dr. Muhammad bin Abdullah bin Hamoud Al-Maqshi. Number of Pages: 75 [The book is not printed]. Publication Date in Shamela: 13 Ramadan 1442.\nBook: Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif, by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti'. Explainer: Dr. Muhammad bin Abdullah bin Hamoud Al-Maqshi. Number of Pages: 75 [The book is not printed]. Publication Date in Shamela: 13 Ramadan 1442.\nExplainer: Dr. Muhammad bin Abdullah bin Hamoud Al-Maqshi. Number of Pages: 75 [The book is not printed]. Publication Date in Shamela: 13 Ramadan 1442.\n[The book is not printed]. Publication Date in Shamela: 13 Ramadan 1442.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 3
  },
  {
    "serial_number": "6662872",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Fath Al-Karim Al-Latif fi Sharh Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti. Explanation by Dr. Muhammad bin Abdullah bin Hamoud Al-Maqshi.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 4
  },
  {
    "serial_number": "6662873",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Foreword by the Great Scholar Sheikh Ibrahim Muhammad Abdullah Al-Shinqiti. In the name of Allah, the Entirely Merciful, the Especially Merciful. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon the Seal of the Prophets and Messengers, Muhammad the illiterate Prophet, and upon his family and companions, and those who follow them in goodness until the Day of Judgment. To proceed: The book 'Fath Al-Karim Al-Latif fi Sharh Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by its author, the brilliant and erudite Sheikh Muhammad bin Abdullah bin Hamoud Al-Maqshi, is a beneficial book, an insight for the beginner and a reminder for the advanced student. Its reader can sense the precision in content and clarity in style. We hope from Allah, the High, the Generous, that He benefits [people] through it, and writes its reward for its author and its reader. Written by Ibrahim Muhammad Abdullah Al-Shinqiti.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 5
  },
  {
    "serial_number": "6662874",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Foreword by Sheikh Dr. Abdul Wahid Al-Khamisi. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon the noblest of Prophets and Messengers, our master Muhammad, and upon all his family and companions. To proceed: I have reviewed the explanation titled 'Fath Al-Karim Al-Latif fi Sharh Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by its author Dr. Muhammad bin Abdullah Al-Maqshi, and found it to be a gentle and wonderful explanation in its field. It is suitable for those wishing to begin learning the science of Morphology (Tasrif), as it gives them a clear conception of some topics of Morphology, which are what a student of knowledge needs initially. So I ask Allah to benefit [people] through it and reward the author with the best reward. He is the Guardian of that and Capable of it. And praise be to Allah, Lord of the Worlds. Written by Dr. Abdul Wahid Abdullah Ali Al-Khamisi, Head of the Arabic Language Department at Al-Iman University, 26 Jumada al-Akhirah 1434 AH.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 6
  },
  {
    "serial_number": "6662875",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Foreword by the Great Scholar Sheikh Walid Ahmad Mahmoud. In the name of Allah, the Entirely Merciful, the Especially Merciful. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon His noble Prophet. To proceed: I have reviewed what the virtuous Sheikh Dr. Muhammad bin Abdullah Al-Maqshi wrote in his explanation of the poem 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif', which he named 'Fath Al-Karim Al-Latif fi Sharh Bakurat Al-Ta'rif'. I found it to be a magnificent explanation that unravels its words and clarifies its meanings, without verbosity, stuffing, or deficiency. It is an explanation that benefits the scholar, and the student of knowledge cannot do without. So I ask Allah Almighty to benefit [people] through it and benefit through its author. Written by Walid bin Ahmad Mahmoud, Professor of Usul (Principles) and Language at Al-Iman University.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 7
  },
  {
    "serial_number": "6662876",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Poem: Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif. In the name of Allah, the Entirely Merciful, the Especially Merciful. Introduction. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon our master Muhammad and upon his brothers among the Prophets and Messengers, and upon his family, companions, and the followers. To proceed: This is a gentle explanation on the poem of Sheikh Muhammad Hammad bin Ahmad bin Sayyid Al-Jakani Al-Shinqiti in the science of Morphology called 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif'. In it, I limited myself to resolving its wording and clarifying its intent in a gentle manner free from stuffing and verbosity. I named it 'Fath Al-Karim Al-Latif fi Sharh Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif'. I ask Allah to benefit through it, and He is sufficient for me and the best Disposer of affairs.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 8
  },
  {
    "serial_number": "6662877",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "I praise my Lord, Who has disposed the universe... ........................................ The Explanation. The author said, seeking blessings by the Great Name of Allah and following His Generous Book: (In the name of Allah, the Entirely Merciful, the Especially Merciful), meaning: I compose [poetry]; for every doer who begins his action with 'In the name of Allah' implies what made the Basmalah a beginning for it. Just as a traveler, if he settles or departs and says: 'In the name of Allah', the meaning is 'In the name of Allah I settle', and 'In the name of Allah I depart'. (Allah) is a proper name for the Necessary Existent Essence. (Al-Rahman, Al-Rahim) are two names built for exaggeration from 'Rahima' (to have mercy), and Al-Rahman is more emphatic than Al-Rahim; because the increase in structure indicates an increase in meaning. (I praise my Lord) 'Hamd' (Praise) linguistically is: praising with the tongue for optional beauty by way of glorification. 'Al-Rabb' (The Lord) is one of the names of Allah Almighty. (Who has disposed the universe) meaning: The One who managed this universe, for He is the One disposing in it by creation and annihilation. In the author's phrase: (Who has disposed the universe) there is what is called 'excellence of the opening' (Bara'at al-Istihlal). Its meaning according to rhetoricians is that the speaker mentions in the beginning of his speech something that alludes to his intent. Here, the author presented this phrase at the beginning of his poem to subtly indicate what he will talk about in it, which is the science of Morphology (Tasrif).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 9
  },
  {
    "serial_number": "6662878",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "................. ... He sent blessings and peace upon the one He honored. The Explanation. (He sent blessings) It is famous that 'Salah' (blessings/prayer) from Allah Almighty means mercy, from angels it means seeking forgiveness, and from humans it means supplication and prayer. Al-Hafiz Ibn Hajar chose in 'Fath Al-Bari' that the meaning of Allah's Salah upon His Prophet is His praising him and honoring him, and the Salah of angels and others upon him is requesting that for him from Allah Almighty. (And peace) from 'Taslim', meaning peace/safety. Some said: Establishing Salah and Salam after the Basmalah in the opening of books and letters originated during the rule of Banu Hashim, then the practice continued as recommended. Some scholars also conclude books with them (1). (Upon the one He honored) meaning: Upon the one whose status and rank He raised. 'Sharaf' (Honor) is highness and elevation. (Alladh) is a dialectal form of 'Alladhi' (The one who).",
    "foot_note": "1. Tuhfat al-Habib 'ala Sharh al-Khatib (1/50).",
    "book_id": "238",
    "new_page_number": 10
  },
  {
    "serial_number": "6662879",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Muhammad and his family, and to proceed... ....................................... The Explanation. (Muhammad) is an appositive (Badal) for (the one He honored). Muhammad is a proper name for our Prophet, peace be upon him. His grandfather Abd al-Muttalib named him so by inspiration from Allah Almighty that creation would praise him much due to his many praiseworthy qualities, as narrated in biographies. (And his family) are, according to the most correct view, the believers of Banu Hashim and Banu Al-Muttalib. (And to proceed) meaning: And after what preceded of praise and prayers and peace. This phrase, whether it follows 'Amma' or not, is brought to transition from one style to another. It is not permissible to bring it at the very beginning of speech. It is recommended to bring it in sermons and correspondence, following the example of the Messenger of Allah, peace be upon him. Al-Bukhari dedicated a chapter to it in his Sahih. There is disagreement regarding the first person to say it, with eight opinions summarized by someone in two verses: Dispute occurred regarding who first started with \"Amma ba'du\" ... Opinions were counted, and Dawood is closest. And Ya'qub, Ayyub the Patient, Adam ... And Quss, Sahban, Ka'b, and Ya'rub.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 11
  },
  {
    "serial_number": "6662880",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "....................... ... So take from verb conjugation a necklace. For it is an art of majestic worth ... And ignorance of it is truly shameful for a person. The Explanation. (So take) 'Hak': A verbal noun imperative meaning 'Take'. (From verb conjugation a necklace) He likened his poem to a necklace strung with gems, beads, and the like that is hung around the neck. He specified conjugation to the verb in his saying (from verb conjugation) because he did not speak in this poem except about the conjugation of the verb specifically. Originality in conjugation belongs to verbs; due to their frequent changes, and it only entered nouns by analogy to verbs. (For it) meaning: The science of Morphology. (Is an art of majestic worth) meaning: Of great status. It is among the most glorious Arabic sciences and greatest in importance; because it deals with the core of Arabic words, and acts as a standard and scale for them. (And ignorance of it is truly shameful for a person) meaning: That a student of knowledge's ignorance of the science of Morphology attaches a defect to him and decreases his rank.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 12
  },
  {
    "serial_number": "6662881",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "I mentioned in it what is needed ... And from the Lord is assistance. I named it 'The First Fruits of Introduction' ... To what concerns us of Morphology. The Explanation. (I mentioned in it what is needed) meaning: He mentioned regarding verb conjugation what is indispensable. (And from the Lord is assistance) meaning: Assistance is sought from Allah Glory be to Him, not from others. Bringing forward the object in his saying: (And from the Lord is) indicates exclusivity (Hasr). (I named it 'The First Fruits of Introduction') meaning: He named this poem of his (Bakurat Al-Ta'rif). 'Bakurah' of a thing is its first fruit/beginning. So it is the first introduction to the science of Morphology; because he mentioned in it the most important rules indispensable for a student of this art. (To what concerns us of Morphology) meaning: To the most important aspects of the science of Morphology; because knowledge is vast and life is short, so the student of knowledge prioritizes the most important, then the important. Thus Ibn al-Wardi said: And life falls short of acquiring every science ... So begin from it with the most important.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 13
  },
  {
    "serial_number": "6662882",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": ".................................. The Explanation. Structure (Mabna), Weight (Wazn), Form (Sigha), and Shape (Hay'a) are synonymous terms. It is said: The structure of the word - meaning: its weight. By 'structure' is meant the shape of the word in which others can share. This shape consists of the number of letters in the word, their order, their movements (vowels) and stillness (sukoon), taking into account extra and original letters. So \"Rajul\" (man) - for example - is on a shape and form that can be shared by the word \"Adud\" (upper arm) and similar words that consist of three letters, the first of which is open (Fatha) and the second is joined (Damma). Thus, the science of Morphology investigates the conditions of word structures that are not inflection (I'rab) or construction (Bina', indeclinability). The science of Syntax (Nahw) investigates the endings of words in terms of inflection and construction. Its subject matter: Arabic words in terms of investigating their soundness and infirmity (Ilal), their originality and addition, and so on. It is specific to declinable nouns (Mu'rab) and conjugatable verbs (Mutasarrif). Particles (Harf) of all kinds, indeclinable nouns (Mabni), and rigid verbs (Jamid) are not investigated in the science of Morphology.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 14
  },
  {
    "serial_number": "6662883",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "................................ The Explanation. 'Tasrif' (Morphology) linguistically: Absolute change. From it is 'Tasrif al-riyah' (the changing of winds), meaning their changing and turning. Terminologically: A science in which the conditions of Arabic word structures are investigated, and what pertains to their letters of originality and addition, soundness and infirmity, and so on. 'Abniyah' (structures) is the plural of 'Bina' (structure), 'Binyah', and 'Bunyah'. Its founder: Mu'adh bin Muslim Al-Harra (1). Its fruit: Preserving the tongue from error in Arabic vocabulary, leading to understanding the language which leads to understanding the Book of Allah Almighty. By knowing it, forms, their diminutives, and attributions are regulated. Its source: From the Book (Quran), the Sunnah, and the speech of the Arabs. Its ruling: A communal obligation (Fard Kifaya). Its issues: Its propositions mentioned therein, like our saying: 'Daraba' is a bare verb (Mujarrad), 'Akrama' is an augmented verb (Mazid), and 'Fa'ula' with a Damma on the 'Ayn' has its present tense as 'Yaf'ulu', and so on.",
    "foot_note": "1. Attributed to the sale of Herati clothes. .............................. The Explanation",
    "book_id": "238",
    "new_page_number": 15
  },
  {
    "serial_number": "6662884",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Chapter on the Structures of the Bare Verb (Mujarrad). The Explanation. (Chapter on the Structures of the Bare Verb) 'Abniyah' (structures) as mentioned before is the plural of 'Bina' (structure). Intended by structures of the bare verb are the forms upon which the bare verb comes. Before mentioning these weights for the bare verb, we clarify that the verb is divided into bare (Mujarrad) and augmented (Mazid): The verb bare of addition is: The verb whose letters are all original. An original letter is: The letter that sticks to the word in all its conjugations. The augmented verb is: That which has one or more extra letters. An extra letter is: The letter that drops in some conjugations of the word, like the Alif in \"Qatala, Daraba\", the Ta and Alif in \"Taqatala, Taghafala\", and the Hamza, Sin, and Ta in \"Istaghfara, Istaqama\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 16
  },
  {
    "serial_number": "6662885",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "The weight of the bare verb according to them is Fa'ala ... Fa'ila along with Fa'ula then Fa'lala. The Explanation. Addition is either a repetition of an original letter or not. If it is a repetition of an original, it is not restricted to the letters of addition. If it is not a repetition of an original, it can only be one of the ten letters gathered in your saying: \"Sa'altumuniha\". These letters are called letters of addition. The meaning of naming them letters of addition is that no letter is added for other than repetition except from them. The meaning is not that these letters never occur as original in speech; for they may occur as original like \"Mata, Sa'ala\". He said: (The weight of the bare verb... etc. the verse). The author mentioned in this verse the weights of the bare verb, which are four weights: three for the trilateral (three-letter) past tense, and one for the quadrilateral (four-letter) past tense. As for the weights of the trilateral: 1 - \"Fa'ala\" with Fatha on the 'Ayn', like: Daraba (hit), Nasara (helped), Dakhala (entered), Kharaja (exited), Akala (ate). 2 - \"Fa'ila\" with Kasra on the 'Ayn', like: Marida (became sick), Fariha (rejoiced), 'Ajila (hurried), Ghalita (erred), Fashila (failed). 3 - \"Fa'ula\" with Damma on the 'Ayn', like: 'Azuma (became great), Karuma (became noble), Kabura (became big), Saghura (became small).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 17
  },
  {
    "serial_number": "6662886",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Kataba along with 'Alima then Zarufa ... Dahraja ........................... The Explanation. As for the weight of the quadrilateral, it is: \"Fa'lala\" with Sukoon on the 'Ayn' and Fatha on the rest, like: Ba'thara (scattered), Hashraja (rattled in throat), Hadhrama (spoke fast), Bartama (1), 'Arbada (2). Then the author proceeded in the following verse to give examples for the four weights mentioned above, saying: (Kataba along with 'Alima then Zarufa Dahraja). His saying: \"Kataba\" (wrote) is an example for the first weight \"Fa'ala\" with Fatha on the 'Ayn'. His saying: \"'Alima\" (knew) is an example for the second weight \"Fa'ila\" with Kasra on the 'Ayn'. His saying: \"Zarufa\" (was witty/elegant) is an example for the third weight \"Fa'ula\" with Damma on the 'Ayn'. His saying: \"Dahraja\" (rolled) is an example for the quadrilateral weight \"Fa'lala\".",
    "foot_note": "1. Meaning: He frowned and swelled with anger. \n2. Meaning: He became ill-mannered/quarrelsome.",
    "book_id": "238",
    "new_page_number": 18
  },
  {
    "serial_number": "6662887",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "........................... ... ......... representation by folding that fulfilled. The Explanation. Then he said: (Representation by folding [Laff] that fulfilled [Wafa]). 'Laff wa Nashr' (Folding and Unfolding/Involution and Evolution) is one of the semantic embellishments. It is: Mentioning multiple things in detail or generally, then mentioning what belongs to each without specification (1) relying on the intelligent listener to attribute each to its counterpart. If the speaker brings multiple items, and after that brings another set of multiple items where each individual relates to an individual of the former in detail and without assignment, this act is called \"Laff wa Nashr\". If it is in order, such that the first is for the first and the second for the second and so on, then the Laff wa Nashr is ordered (Murattab). Otherwise, it is disordered (Ghayr Murattab). Here, the folding happened in order. The author gave examples for the four weights mentioned in the previous verse according to their order of mention. He started by exemplifying Fa'ala with \"Kataba\", then exemplified Fa'ila with \"'Alima\", then exemplified Fa'ula with \"Zarufa\", then exemplified Fa'lala with \"Dahraja\". And his saying: (Qad Wafa) - It is said: Wafa al-shay' yafi, meaning: It was complete/fulfilled.",
    "foot_note": "1. If he specifies, it is called Division (Taqsim), not Laff wa Nashr.",
    "book_id": "238",
    "new_page_number": 19
  },
  {
    "serial_number": "6662888",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Chapter on Conjugation of the Present Tense. Fa'ula with Damma adheres to intransitivity ... ...................................... The Explanation. Chapter on Conjugation of the Present Tense. When the author finished discussing the weights of the bare verb, he proceeded to discuss the present tense of each of the four preceding weights, saying: (Fa'ula with Damma adheres to intransitivity) meaning: \"Fa'ula\" with Damma on the 'Ayn' adheres to being intransitive (Luzum), so its verb only comes as intransitive. An intransitive verb (Lazim) is: One that is satisfied with its subject (Fa'il), meaning: it suffices with it and has no object, like: Zaid stood (Qama Zaid), Amr sat (Qa'ada Amr), Bakr went out (Kharaja Bakr). Or it has an object but does not reach it except through a preposition, like: I passed by Zaid (Marartu bi-Zaid). A transitive verb (Muta'addi) is: One that reaches the direct object without a preposition, like: I hit Zaid (Darabtu Zaidan), I honored Amr (Akramtu Amran).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 20
  },
  {
    "serial_number": "6662889",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "..................... ... And Damma of what is present tense from it is known. And open for it from the one with Kasra in the past ... ...................................... The Explanation. Its sign: That a pronoun 'Ha' can be attached to it which does not refer to the verbal noun (Masdar), like: \"The door, I closed it\" (Al-Babu Aghlaqtuhu). The pronoun - the Ha - is a direct object referring to the door, which is not a verbal noun. So \"Fa'ula\" with Damma on the 'Ayn' is never anything but intransitive, like: \"Karuma (was noble), Shaju'a (was brave), Hasuna (was beautiful), Qabuha (was ugly), Qasura (was short), Fazu'a (was horrible)\". He said: (And Damma of what is present tense from it is known) meaning: Every verb on the weight of \"Fa'ula\" always has its present tense on the weight of \"Yaf'ulu\" with Damma on the 'Ayn', like: \"Karuma Yakrumu, Hasuna Yahsunu, Qabuha Yaqbuhu, Qasura Yaqsuru, 'Azuma Ya'zumu, Sharufa Yashrufu\" and so on. He said: (And open for it) meaning: for the present tense (from the one with Kasra in the past) meaning: from \"Fa'ila\" with Kasra on the 'Ayn'. Every verb on the weight of \"Fa'ila\" with Kasra on the 'Ayn', its present tense comes on the weight of \"Yaf'alu\" with Fatha on the 'Ayn', like: \"Fariha Yafrahu, Hazina Yahzanu, 'Atisha Ya'tashu, Shariba Yashrabu, Shabi'a Yashba'u, 'Alima Ya'lamu, Radiya Yarda, Sakira Yaskaru, Ghadiba Yaghdabu\" and so on.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 21
  },
  {
    "serial_number": "6662890",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "......................... ... It dominates in colors and defects/accidents. And break it in \"Warith\" \"Warim\" \"Wali\" \"Wathiq\" ... \"Wariya Mukhkhun\" and \"Wari'\" \"Wafiq\" \"Wamiq\" The Explanation. And his saying: (It dominates in colors and defects/accidents) meaning: The form \"Fa'ila\" with Kasra on the 'Ayn' predominantly indicates colors and accidents (A'rad). Accidents are attributes that do not permanently stick to the essence, but come and go like illness and joy. An example of what indicates colors: Hamira (became red), Sawida (became black), Khadira (became green), Safira (became yellow). And an example of what indicates accidents: Fariha (rejoiced), Hazina (grieved), Marida (became sick), Barisa (became leprous), Jariba (became scabby), Nashita (became active), Shabi'a (became full), 'Atisha (became thirsty), Ta'iba (became tired). He said: (And break it in \"Warith\" \"Warim\" ... etc. the verse). It was mentioned in the previous verse that the present tense of \"Fa'ila\" with Kasra on the 'Ayn' originally comes with Fatha like \"Yafrahu\". There are verbs on the weight of \"Fa'ila\" with Kasra on the 'Ayn' for which only the anomalous Kasra was heard in their present tense. Their number is thirteen. The author mentioned eight of them, which are: \"Waritha Yarithu (inherited), Warima al-jurhu Yarimu (the wound swelled), Waliya Yali (governed/followed), Wathiqa Yathiqu (trusted), Wariya",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 22
  },
  {
    "serial_number": "6662891",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Two faces from it in \"Hasib\" \"Na'im\" \"Ba'is\" ... \"Waghir\" \"Wahir\" \"Walih\" \"Wahil\" \"Yabis\" \"Ya'is\". The Explanation. al-Mukhkhu Yari (the marrow became abundant), Wari'a al-rajulu Yari'u (the man was pious/abstained), Wafiqa al-farasu Yafiqu (the horse was excellent/suitable), Wamiqa Yamiqu (loved)\". These eight verbs did not appear in the Arabic language except with Kasra in the present tense, even though the rule for their present tense is Fatha. The meaning of Warima is: swelled. Wariya al-Mukhkh is: increased. Wari'a is: left doubtful matters fearing falling into the forbidden. Wafiqa al-Faras is: became good. Wafiqta amraka is: you found it suitable. Wamiqa is: loved. He said: (Two faces from it in \"Hasib\" \"Na'im\" ... etc. the verse). After the author mentioned what was heard with only Kasra in the present tense of \"Fa'ila\", he proceeded to discuss the verbs in which two faces were heard: the measured Fatha and the anomalous Kasra. They are twelve verbs. The author mentioned nine of them in this verse, which are: Hasiba Yahsabu and Yahsibu, Na'ima Yan'amu and Yan'imu, Ba'isa Yab'asu and Yab'isu, Waghira Yaugharu and Yaghiru, Wahira Yauharu and Yahiru, Waliha Yaulahu and Yalih, Wahila Yauhalu and Yahilu, Yabisa Yaybasu and Yaybisu, Ya'isa Yay'asu and Yay'isu\". The meaning of Hasiba is: thought. Na'ima al-rajulu is: his condition became good. Ba'isa if his condition became bad. Waghira sadruhu is: burned with rage. Wahira is: filled with grudge. Waliha, so he is Walih and Walhan, if he almost lost his mind due to losing a beloved one from family or wealth. Wahila 'an al-shay' is: forgot it. Yabisa al-shajaru is: its moisture went away. Ya'isa is: if his hope was cut off. When he finished discussing the present tense of \"Fa'ula\" with Damma on the 'Ayn', and \"Fa'ila\" with Kasra on the 'Ayn', he moved to discuss the present tense of \"Fa'ala\" with Fatha on the 'Ayn'.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 23
  },
  {
    "serial_number": "6662892",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "The coming of Fa'ala the Open is broken in ... A Waw-Fa or intransitive doubled Or Ya-i (1) in its Ayn or its Lam ... ........................................ The Explanation. He said: (The coming of Fa'ala is broken) meaning: its present tense; because the present tense is called \"Al-Ati\" (The Coming). (The Open) meaning: open 'Ayn' (vowel a). (In a Waw-Fa or intransitive doubled or Ya-i in its Ayn or its Lam) meaning: \"Fa'ala\" with Fatha on the 'Ayn' has the 'Ayn' of its present tense broken (Kasra), so it is said: \"Yaf'ilu\" if a cause (2) from the four causes of Kasra mentioned in the poem is found, which are: 1 - That the Fa of \"Fa'ala\" is a Waw (3). To this the author pointed by saying: (In a Waw-Fa). Examples of this are: \"Wa'ada Ya'idu (promised), Wajada Yajidu (found), Wasafa Yasifu (described), Wasala Yasilu (arrived), Wa'aza Ya'izu (preached)\" (4). They stipulate that its Lam should not be a guttural letter (5). If it is so, the 'Ayn' of its present tense is opened (Fatha), like: \"Waqa'a Yaqa'u (fell), Wada'a Yada'u (left), Wada'a Yada'u (placed)\".",
    "foot_note": "1. Thus it appeared in the poem \"Aw Ya'iyan\" (accusative), and the correct way is to say \"Aw Ya'iyin\" (genitive) because it is conjoined to a genitive noun. However, for what the author mentioned there is a justification, which is that his saying: \"Ya'iyan\" is the predicate (Khabar) of \"Kana\" whose name is deleted, so the estimation is: \"Aw Kana al-fi'lu ya'iyan\" (Or if the verb was Ya-i). However, what we mentioned was better because what has no estimation is prioritized over what has estimation. \n2. 'Jawalib': Plural of 'Jalib'. A 'Jalib' according to morphologists is the cause/inviter. It is said: Jalib al-kasr, meaning: the cause for Kasra. \n3. Scholars of Morphology chose a standard and morphological scale against which they compare the roots of words that they encounter. They composed the scale from three letters; because most words in the Arabic language are trilateral. They made these three letters: \"Fa'ala\", which are the Fa, the 'Ayn', and the Lam. They named the first letter corresponding to Fa: Fa of the word. The second letter corresponding to 'Ayn': 'Ayn of the word. The third letter corresponding to Lam: Lam of the word. So the Kaf of \"Kataba\" - for example - is the Fa of the word, the Ta is the 'Ayn' of the word, and the Ba is the Lam of the word, and so on. They adhere to the form of the scale with the same movements and stillness of the weighed word, so they say: \"Kataba\" is on the weight of \"Fa'ala\", \"Fahima\" is on the weight of \"Fa'ila\", \"Karuma\" is on the weight of \"Fa'ula\", and so forth. \n4. The Waw was deleted in all these verbs because it occurred between the open Ya (Fatha) and the Kasra. The origin is \"Yaw'idu... etc\". The rule is that if Waw falls between them, it is deleted. Ibn Malik said: The Fa of an imperative or present tense from like \"Wa'ada\" delete, and in like \"'Idah\" this is consistent. \n5. The guttural letters are six: Hamza, Ha, 'Ayn, Ha (unemphatic), Ghayn, and Kha.",
    "book_id": "238",
    "new_page_number": 24
  },
  {
    "serial_number": "6662893",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . The Explanation. 2 - That \"Fa'ala\" is doubled (1) intransitive. To this the author pointed by saying: (Or intransitive doubled). Examples of this are: \"Dabba Yadibbu (crawled), Farra Yafirru (fled), Khaffa Yakhiffu (lightened), Dalla Yadillu (strayed), Hanna Yahinnu (yearned), Qalla al-shay'u Yaqillu (the thing became little), Tanna Yatinnu (buzzed), Anna Ya'innu (groaned), Ranna Yarinnu (rang)\". 3 - That \"Fa'ala\" is Ya-i in the 'Ayn' (middle radical is Ya), like: \"Ja'a Yaji'u (came), Qa'a Yaqi'u (vomited), Ghaba Yaghibu (was absent), Qala Yaqilu Qaylulatan (napped), Khaba Yakhibu (failed), Zada Yazidu (increased), 'Asha Ya'ishu (lived), Mala Yamilu (leaned)\". 4 - That \"Fa'ala\" is Ya-i in the Lam (last radical is Ya), like: \"Ata Ya'ti (came), Baka Yabki (cried), Bana Yabni (built), Rama Yarmi (threw), Zana Yazni (committed adultery), Hadha Yahdhi (deliriously spoke), 'Asa Ya'si (disobeyed), Jara Yajri (ran)\". However, it is stipulated that its 'Ayn' should not be a guttural letter. If it is a guttural letter, the 'Ayn' of the present tense is opened (Fatha), like: \"Ra'a Yara (saw), Ra'a Yar'a (grazed/tended), Sa'a Yas'a (strove), Naha Yanha (forbade)\". The author pointed to the third and fourth causes of Kasra by saying: (Or Ya-i in its Ayn or its Lam).",
    "foot_note": "1. Intended by 'doubled' here is the trilateral doubled: which is what had its 'Ayn' and 'Lam' of the same kind, like: \"Shadda, Madda, Hanna\". Their origin is: \"Shadada, Madada, Hanana\".",
    "book_id": "238",
    "new_page_number": 25
  },
  {
    "serial_number": "6662894",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "....................... ... Its two Waws, there is no doubt in its joining (Damma). Likewise what came for overcoming in pride, or ... Doubled if it is transitive ................. The Explanation. Then when he finished with the causes of breaking (Kasra) the present tense of \"Fa'ala\" with Fatha on the 'Ayn', he proceeded to discuss the causes of joining (Damma) the present tense, which are also four, saying: (Its two Waws, there is no doubt in its joining, likewise what came for overcoming in pride, or doubled if it is transitive). Meaning: That \"Fa'ala\" with Fatha on the 'Ayn', the 'Ayn' of its present tense is joined (Damma) so it is said: \"Yaf'ulu\", if a cause - motive - from the four causes of Damma mentioned in the poem is found. These are: 1 - That the 'Ayn' of \"Fa'ala\" is a Waw, like: \"Qala Yaqulu (said), Dhaba Yadhubu (melted), Fata Yafutu (passed), Na'a Yanu'u (rose heavily), Jada Yajudu (was generous), Faza Yafuzu (won), Khada Yakhudu (waded), Ja'a Yaju'u (hungered), Tafa Yatufu (circumambulated)\" (1). 2 - That the Lam of \"Fa'ala\" is a Waw, like: \"Da'a Yad'u (called), Bada Yabdu (appeared), Zaka Yazku (grew/purified), Rashahu Yarshuhu (bribed him), Saba Yasbu (yearned), 'Afa Ya'fu (forgave), 'Ada Ya'du (ran/transgressed), Ghaza Yaghzu (raided), Fasha Yafshu (spread), Haja Yahju (satirized), Hafa Yahfu (slipped)\" (2). To this cause and the one before it, the author pointed by saying: (Its two Waws, there is no doubt in its joining), meaning: That \"Fa'ala\" with Fatha on the 'Ayn', if it has a Waw 'Ayn' or Lam, there is no doubt - meaning: no uncertainty - in joining (Damma) the 'Ayn' of its present tense.",
    "foot_note": "1. In all examples mentioned like \"Qala, Dhaba, Jada\", the Alif is changed from Waw. \n2. In all examples mentioned like \"Da'a, Bada, Zaka, Saba, Fasha, Haja\", the Alif is changed from Waw.",
    "book_id": "238",
    "new_page_number": 26
  },
  {
    "serial_number": "6662895",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": ".................. The Explanation. 3 - That \"Fa'ala\" indicates overcoming in boasting (Mughalaba), like: \"Sara'ani fa-sara'tuhu fa-ana asru'uhu\" (He wrestled me and I defeated him, so I defeat him), \"Tadarabna fa-darabtuhu fa-ana adrubuhu\" (We hit each other and I hit him [better], so I hit him [better]), \"Tanasarna fa-nasartuhu fa-ana ansuruhu\" (We helped each other and I helped him [better], so I help him [better])\". Every verb intended to indicate that two people boasted in a matter and one overcame the other in it, its present tense has a joined 'Ayn' (Damma). This is what is meant by the author's saying: (Likewise what came for overcoming in pride). His saying: (Li-badhdhi al-fakhr) means: for overcoming in boasting. \"Al-Badhdh\" here is not a dialectal variant of \"Al-Badhl\" (giving) as might be imagined. 4 - That \"Fa'ala\" with Fatha on the 'Ayn' is doubled and transitive, like: \"Sabba Yasubbu (insulted), Madda Yamuddu (extended), Sabba Yasubbu (poured), Fatta Yafuttu (crumbled), Hajja al-bayta Yahujjuhu (performed Hajj to the House), Radda Yaruddu (returned/replied), Hattha Yahuththu (urged), Baththa al-khabara Yabuththuhu (spread the news), Darrahu Yadurruhu (harmed him), Rashsha Yarushshu (sprinkled), Dakka Yadukku (pounded), Zaffa al-'arusa Yazuffuha (led the bride)\". To this cause the author pointed by saying: (Or doubled if it is transitive), meaning: That one of the causes for Damma in the present tense of \"Fa'ala\" with Fatha on the 'Ayn' is that it comes as doubled and transitive.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 27
  },
  {
    "serial_number": "6662896",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "5 - .......................... ... ............................. And they narrated by hearing the Kasra, and in Habba it was alone ... ....................................... The Explanation. He said: (And they narrated by hearing the Kasra, and in Habba it was alone). It was mentioned previously that the standard rule for \"Fa'ala\" with Fatha on the 'Ayn' which is doubled and transitive is that its present tense comes with Damma on the 'Ayn'. However, some verbs deviated from this. The deviation is of two types: 1 - What was heard with the standard Damma and the anomalous Kasra. These are nine verbs, including: \"Shaddahu Yashudduhu and Yashidduhu (pulled it), Namma al-haditha Yanummuhu and Yanimmuhu (spread the talk maliciously), Shajjahu Yashujjuhu and Yashijjuhu (broke his head), Battahu Yabuttuhu and Yabittuhu (cut/decided it)\". This is what is meant by the author's saying: (And they narrated) meaning: in the present tense of the transitive doubled Fa'ala (by hearing the Kasra) meaning: along with Damma, and that is in the nine verbs. 2 - What was heard with only the anomalous Kasra and nothing else. This is in one verb, which is: \"Habba\", its present tense is \"Yahibbu\" with Kasra on the Ha (1). This is what is meant by the author's saying: (And in Habba it was alone) meaning: Kasra was solitary, and Damma was not heard in it according to the rule.",
    "foot_note": "1. As for \"Yuhibbu\" with Damma on the present tense letter - the Ya - it is the present tense of the quadrilateral \"Ahabba\", not the trilateral \"Habba\".",
    "book_id": "238",
    "new_page_number": 28
  },
  {
    "serial_number": "6662897",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "............................ ... And Damma of intransitive by hearing has occurred. The Explanation. He said: (And Damma of intransitive by hearing has occurred). It was mentioned previously that the standard rule is Kasra on the 'Ayn' of the present tense of Fa'ala - with Fatha on the 'Ayn' - if it is intransitive like \"Farra Yafirru\". However, some verbs deviated from this where Damma of their present tense was heard. This deviation is of two types: 1 - What was heard with the standard Kasra and the anomalous Damma. These are many verbs, including: \"Sadda Yasiddu and Yasuddu (turned away/repelled) (1), Kharra al-hajaru Yakhirru and Yakhurru (the stone fell), Haddati al-mar'atu Tahiddu and Tahuddu (the woman mourned), Shadhdha Yashidhdhu and Yashudhdhu (was odd/deviated), Shahha Yashihhu and Yashuhhu (was miserly)\". 2 - What was heard with only the anomalous Damma. These are also many verbs, including: \"Habbati al-rihu Tahubbu (the wind blew), Hamma bi al-amri Yahummu (intended the matter), Marra Yamurru (passed), Shakka - meaning: doubted - Yashukku, Janna al-zalamu Yajunnu (darkness covered), Rashsha Yarushshu (sprinkled), Tashsha Yatushshu (drizzled), Thajja Yathujju (flowed copiously)\".",
    "foot_note": "1. With both ways - Kasra and Damma - the verse was recited: {And when the son of Mary was presented as an example, immediately your people laugh aloud [Yasidduna]} Az-Zukhruf: 57.",
    "book_id": "238",
    "new_page_number": 29
  },
  {
    "serial_number": "6662898",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "And the Fatha in a guttural 'Ayn' is mandatory ... Or Lam ............................ The Explanation. When the author finished discussing the causes of Kasra and Damma, he proceeded to discuss the causes of Fatha, saying: (And the Fatha in a guttural 'Ayn' is mandatory, Or Lam). He mentioned that it is mandatory to open (Fatha) the 'Ayn' of the present tense of \"Fa'ala\" if a cause from the causes of Fatha is found in it. These are two: 1 - That the 'Ayn' of \"Fa'ala\" is one of the guttural letters. Hence the author said: (And the Fatha in a guttural 'Ayn' is mandatory) meaning: It is mandatory to open the 'Ayn' of the present tense of \"Fa'ala\" if the 'Ayn' is guttural. His saying: (The Fatha) is the subject (Mubtada), and (mandatory) is its predicate (Khabar). Examples of this are: \"Sa'ala Yas'alu (asked), Bahatha Yabhathu (searched), Ba'atha Yab'athu (sent), Bahata Yabhatu (astounded), Lahatha Yalhathu (panted), Nahara Yanharu (slaughtered), Shaghara al-makanu Yashgharu (the place became vacant), Nahasha Yanhashu (bit)\". 2 - That the Lam of \"Fa'ala\" is one of the guttural letters. Hence the author said: (Or Lam) meaning: It is mandatory to open the 'Ayn' of the present tense of \"Fa'ala\" if it has a guttural Lam, just as it is mandatory if it has a guttural 'Ayn'. Like: \"Khasha'a Yakhsha'u (humbled), Khada'a Yakhda'u (submitted), Bada'a Yabda'u (began), Hada'a Yahda'u (calmed), Sharaha Yashrahu (explained), Raka'a Yarka'u (bowed), Khala'a Yakhla'u (took off), Rafa'a Yarfa'u (raised), Zara'a Yazra'u (planted), Raqa'a Yarqa'u (patched), Nasaha Yansahu (advised), Shara'a fi al-amri Yashra'u (started the matter), La'ana Yal'anu (cursed), Fataha Yaftahu (opened)\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 30
  },
  {
    "serial_number": "6662899",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "....................... ... ......... If the cause is absent in it. The Explanation. However, it is stipulated for the opening (Fatha) of the present tense of \"Fa'ala\" that there should be no cause for Kasra or Damma. Hence the author said: (If the cause is absent in it) meaning: the cause for Kasra and Damma. But if a cause for Kasra or Damma is found, it prevails and is prioritized over the cause for Fatha, except for what was previously excepted; because the cause for Fatha is the weakest of causes. Like: \"Da'a\". It is said: Da'ahu - meaning: pushed him violently - Yadu'uhu - with Damma on the 'Ayn' (1), even though its 'Ayn' and 'Lam' are guttural. Its 'Ayn' is the letter 'Ayn', and its 'Lam' is also 'Ayn'; because its origin is \"Da'a'a\". Yet, the cause for Damma, which is \"Fa'ala\" being doubled and transitive, was prioritized. Another example is: \"Bagha\" (sought/transgressed). It is said in its present tense: \"Yabghi\" with Kasra, even though a cause for Fatha was found in it, which is the 'Ayn' of the word being a guttural letter. However, it was opposed by a cause for Kasra, which is the Lam being Ya-i (a Ya), so the cause for Kasra was prioritized over the cause for Fatha.",
    "foot_note": "1. From it is His saying Almighty: {The Day they are thrust toward the fire of Hell with a [violent] thrust} At-Tur: 13.",
    "book_id": "238",
    "new_page_number": 31
  },
  {
    "serial_number": "6662900",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "With fame ........................ ... ....................................... The Explanation. Then he said: (With fame) meaning: It is also stipulated for the opening (Fatha) of the present tense of \"Fa'ala\" that there is no fame (Shuhrah). If the verb became famous among the Arabs with Kasra or Damma, then fame is prioritized and prevails over the cause for Fatha; because fame is stronger than the cause. Examples of this are: \"Qa'ada (sat), Za'ama (claimed), Akhadha (took), Dakhala (entered), Sa'ala (coughed), Nakhala (sifted)\". For these examples, the rule suggests opening the 'Ayn' of their present tense; because their 'Ayn' is a guttural letter. However, Damma became famous in their present tense, so it is said: \"Yaqu'udu, Yaz'umu, Ya'khudhu, Yadkhulu, Yas'ulu, Yankhulu\". Examples also include: \"Nafakha (blew), Sarakha (screamed), Balagha al-sabiyyu (the boy reached puberty), Tala'at al-shamsu (the sun rose)\". For these examples, the rule suggests opening the 'Ayn' of their present tense; because their Lam is a guttural letter. However, Damma became famous in their present tense, so it is said: \"Yanfukhu, Yasrukhu, Yablughu, Tatlu'u\". Another example is: \"Shakhara - meaning: made a sound from his throat and nose -\". The rule suggests opening the 'Ayn' of its present tense; because its 'Ayn' is a guttural letter. However, Kasra became famous in its present tense, so it is said: \"Yashkhiru\". Other examples are: \"Raja'a (returned), Naza'a (removed)\". The rule suggests opening the 'Ayn' of their present tense; because their Lam is a guttural letter. However, Kasra became famous in their present tense, so it is said: \"Yarji'u, Yanzi'u\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 32
  },
  {
    "serial_number": "6662901",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "And what deviated from all ... So break or join (Damma) from it a coming [present tense] like 'Atala. The Explanation. He said: (And what deviated from all, So break or join from it a coming [present tense] like 'Atala). Meaning: Whatever is free from all the previous causes, so no cause for Kasra, Damma, or Fatha is found in it, and is free from fame so it was not famous among the Arabs for anything specific; then it is permissible for the 'Ayn' of its present tense to have Kasra or Damma. Like: 'Atala. Hence the author said: (Like 'Atala) - and 'Atl is: Pushing with violence and force - so you say in its present tense: Ya'tilu and Ya'tulu\" (1). And his saying: (Atin) meaning: present tense; because the present tense is called \"Al-Ati\" as we presented.",
    "foot_note": "1. With both ways - Kasra and Damma - the verse was recited: {Then drag him to the center of the Hellfire} Ad-Dukhan: 47.",
    "book_id": "238",
    "new_page_number": 33
  },
  {
    "serial_number": "6662902",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . The Explanation. Summary: The trilateral bare verb has six chapters (Abwab) regarding its present tense: First Chapter: Fa'ula Yaf'ulu - with Damma on the 'Ayn' in both past and present -, like: Karuma Yakrumu. Second Chapter: Fa'ila Yaf'alu - with Kasra on the 'Ayn' in past, and Fatha in present -, like: Fariha Yafrahu. Third Chapter: Fa'ila Yaf'ilu - with Kasra on the 'Ayn' in both past and present -, like: Waritha Yarithu. Fourth Chapter: Fa'ala Yaf'ilu - with Fatha on the 'Ayn' in past, and Kasra in present -, like: Daraba Yadribu. Fifth Chapter: Fa'ala Yaf'ulu - with Fatha on the 'Ayn' in past, and Damma in present -, like: Nasara Yansuru. Sixth Chapter: Fa'ala Yaf'alu - with Fatha on the 'Ayn' in both past and present -, like: Fataha Yaftahu.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 34
  },
  {
    "serial_number": "6662903",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "And the summary of what relates to \"Fa'ala\" with Fatha on the 'Ayn' is as follows: 1 - The 'Ayn' of its present tense is broken (Kasra) if it has a Waw Fa, or is intransitive doubled, or has a Ya 'Ayn' or Lam. 2 - The 'Ayn' of its present tense is joined (Damma) if it has a Waw 'Ayn', or Waw Lam, or indicates overcoming, or is transitive doubled. 3 - The 'Ayn' of its present tense is opened (Fatha) if it has a guttural 'Ayn' or guttural Lam, and is free from causes of Kasra and Damma, and free from fame among Arabs [for other vowels]. 4 - If it is free from causes of Kasra, Damma, and Fatha, and was not famous among Arabs for anything, then Kasra and Damma are permissible in the 'Ayn' of its present tense.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 35
  },
  {
    "serial_number": "6662904",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Then when the author finished discussing the weight of the trilateral present tense, he moved to discuss the weight of the quadrilateral present tense, saying: The present of the quadrilateral is broken just as ... What exceeded three, and generalize. The Explanation. (The present of the quadrilateral is broken) meaning: That every bare quadrilateral verb like \"Dahraja\", its present tense comes with Kasra on the letter before the last, like: \"Yudahriju, Yuzalzilu, Yuhashriju, Yubartimu, Yu'arbidu\". His saying: (broken) meaning: what is before its end. His saying: (just as what exceeded three) meaning: just as the letter before the last is broken in the present tense of the augmented trilateral, like: Yantaliqu - present of the five-letter verb Intalaqa -, Yastakhriju - present of the six-letter verb Istakhraja. His saying: (and generalize) meaning: Generalize this ruling, which is breaking the letter before the last of the augmented present tense. However, this generalization is questionable; because the trilateral verb beginning with an extra Ta has the letter before its last opened (Fatha) in the present tense as will come, like: \"Yataghafalu, Yataqatalu, Yatakallamu, Yata'allamu, Yataqaddamu, Yatakallafu\". The Alif in his saying (Wa 'ammima) is changed from the lightened energetic Nun when stopping; because the original is to say: (Wa 'ammiman) but he deviated from that to observe the meter.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 36
  },
  {
    "serial_number": "6662905",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Alert Your distinguishing the Ya from the Waw is by an 'Ayn' ... ........................................ The Explanation. Alert. 'Tanbih' (Alert) linguistically: Awakening. Terminologically it is: Following previous speech by mentioning a partial matter included in it implicitly. If we wish, we can say in defining it: It is speech detailing what was summarized before it (1). It would have been better for the author to say: \"Mas'alah\" (Issue) instead of saying: \"Tanbih\"; because this issue which the author spoke about in this alert was not mentioned previously at all. In these verses, the author wanted to clarify the method by which the Alif is known whether it is changed from Waw or from Ya. He said: (Your distinguishing the Ya from the Waw is by an 'Ayn') meaning: If you want to distinguish the 'Ayn' of the verb",
    "foot_note": "1. See: Al-Ta'rifat by Al-Jurjani (p. 91).",
    "book_id": "238",
    "new_page_number": 37
  },
  {
    "serial_number": "6662906",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "............................ ... By connecting the moving nominative [pronoun], it becomes clear. The Explanation. whether it is changed from Waw or Ya like \"Qala, Ba'a, Tala, Khafa, Haba\", then bring the moving nominative pronoun like the Ta of the speaker, and connect it to the verb whose 'Ayn' you want to distinguish (1). Hence the author said: (By connecting the moving nominative, it becomes clear) meaning: That if you connect to the end of the verb one of the moving nominative pronouns (2), the 'Ayn' of the verb will appear, and it will become clear whether it is Waw or Ya. His saying: (By an 'Ayn') meaning: Located in the 'Ayn' of the word. His saying: (Yabin) meaning: Appears.",
    "foot_note": "1. Benefit: Ibn Hisham said: \"If the matter of a verb confuses you, connect it with the Ta of the speaker or addressee, whatever appears is its origin. Do you not see that you say in Rama and Hada: Ramaytu and Hadaytu, and in Da'a and 'Afa: Da'awtu and 'Afawtu. If the matter of a noun confuses you, look at its dual form, whatever appears in it is its origin. Do you not see that you say in Al-Fata and Al-Huda: Al-Fatayan and Al-Hudayan, and in Al-'Asa: Al-'Asawan. How beautiful is the saying of Al-Shatibi [i.e., in Hirz Al-Amani] may Allah have mercy on him: And dualizing nouns reveals them and if ... you return the verb to yourself you find a source. Al-Hariri, may Allah have mercy on him, said: If a verb one day its spelling obscures you ... then attach the Ta of address to it and do not stop. If you see it with Ya one day write it ... with Ya, otherwise it is written with Alif. ... See: Sharh Qatr Al-Nada (p. 331 - 332). \n2. The moving nominative pronouns are: The Ta of the doer like \"Darabtu\", the Nun of females like \"Khifna\", and the Na of doers like \"Qulna\".",
    "book_id": "238",
    "new_page_number": 38
  },
  {
    "serial_number": "6662907",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "And transferring the vowel/shape of its 'Ayn' to the Fa ... If the past of this was joined (Damma) or broken (Kasra). The Explanation. Then he said: (And transferring the vowel/shape of its 'Ayn' to the Fa, If the past of this was joined or broken). 'Shakl' (Shape): Vowel. The meaning is that the past verb whose 'Ayn' is joined (Damma) or broken (Kasra), if you connect it with a moving nominative pronoun, you transfer the vowel of the verb's 'Ayn' to the Fa. Example of what has a broken 'Ayn': \"Khafa\" (feared), its origin is \"Khawifa\". The vowel letter moved and the letter before it was opened, so it had to be changed to Alif, so it is said: \"Khafa\". If you connect it with a moving nominative pronoun like the Ta, you say: \"Khiftu\". The origin is \"Khawiftu\". The vowel of the Waw was transferred to the Kha after removing its vowel, then the Waw was deleted due to the meeting of two sukoons - the Waw and the Fa - so it became \"Khiftu\" on the weight of \"Filtu\". The remaining of the Kasra on the Fa of the word is evidence that its 'Ayn' is Ya. His saying: (Dha'i) is a demonstrative noun for the singular masculine.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 39
  },
  {
    "serial_number": "6662908",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "But with the open [Ayn], the homogeneous ... Is transferred, not the vowel/shape, according to what they established. The Explanation. Then the author said: (But with the open [Ayn], the homogeneous is transferred, not the vowel/shape, according to what they established). Meaning: That if the 'Ayn' of the past verb is open (Fatha) and we connect it to a moving nominative pronoun, what is transferred is the vowel homogeneous to the 'Ayn', not its own vowel; because its vowel is Fatha, and there is no benefit in transferring Fatha to Fatha. Rather, we give the Fa a vowel homogeneous to the letter of the 'Ayn'. If the letter of the 'Ayn' is Waw, we give the Fa Damma; because it is homogeneous to Waw. And if the letter of the 'Ayn' is Ya, we give the Fa Kasra; because it is homogeneous to Ya. Example of what has Waw as 'Ayn': \"Qala\" (said), its origin is \"Qawala\". The vowel letter moved and the letter before it was opened, so it had to be changed to Alif, so it is said: \"Qala\". If we connect a moving nominative pronoun to it, it becomes \"Qultu\". The presence of Damma on the Fa is evidence that the Alif is changed from Waw. And example of what has Ya as 'Ayn': \"Ba'a\" (sold), its origin is \"Baya'a\". The vowel letter moved and the letter before it was opened, so it had to be changed to Alif, so it is said: \"Ba'a\". If we connect a moving nominative pronoun to it, it becomes \"Bi'tu\". The presence of Kasra on the Fa is evidence that the Alif is changed from Ya. The author's saying: (the homogeneous is transferred) contains some leniency; because there is no transfer here in reality, unlike what preceded regarding the joined and broken. His saying: (according to what they established) meaning: according to what they founded and set rules for.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 40
  },
  {
    "serial_number": "6662909",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Chapter on the Present Tense. And with \"Na'aytu\" the present tense is started ... And open ................................. The Explanation. Chapter on the Present Tense. The author mentioned in this chapter the letters with which the present tense begins, the vowel of these letters, and the vowel of the letter before the last. He started with what starts the present tense, saying: (And with \"Na'aytu\" the present tense is started). Meaning: That the present tense verb must begin with one of the four letters collected in your saying: \"Na'aytu\" (1), like: \"Najlisu, Ajlisu, Yajlisu, Tajlisu\". These four letters are called the letters of the present tense (Mudaara'ah). Then the author proceeded to discuss the vowel of these letters, saying: (And open) meaning: Open these letters if the verb is trilateral like \"Yadribu, Tansuru, Aftahu\", or five-lettered like \"Yantaliqu, Najtami'u, Ata'allamu\", or six-lettered like \"Yastakhriju, Nastaghfiru\".",
    "foot_note": "1. They are also collected in the word \"Anaytu\" and \"Na'ti\".",
    "book_id": "238",
    "new_page_number": 41
  },
  {
    "serial_number": "6662910",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath Al-Karim Al-Latif fi Sharh 'Bakurat Al-Ta'rif bil-Muhimm min Al-Tasrif' by Sheikh Muhammad Hammad bin Ahmad Al-Shinqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "............................. ... ............... And in the quadrilateral, Damma occurs. And what is before the last, open if it started ... With Ta ................................... The Explanation. He said: (And in the quadrilateral, Damma occurs) meaning: As for the present tense of the quadrilateral, the letter of the present tense in it is joined (Damma) according to all Arabs. So you say: \"Yudahriju, Nukrimu, Tukhbiru, Usafiru, U'allimu\" and so on. Then when he finished discussing the vowel of the present tense letter with which the present tense verb opens, he proceeded to discuss the vowel of the letter before the last, saying: (And what is before the last, open if it started with Ta) meaning: That the augmented past verb starting with an extra Ta that is customarily added (1) - and it is only five-lettered like \"Takallama, Taqaddama, Ta'allama, Taqatala, Taghafala\" - has the letter before the last of its present tense opened. So you say: \"Yatakallamu, Yataqaddamu, Yata'allamu, Yataqatalu, Yataghafalu\" and so on.",
    "foot_note": "1. Our saying: \"customarily added\" is to exclude the Ta of \"Tarmasa al-shay'\" - meaning: hid it in the Rams (grave) - for its addition is not customary, but was brought to enable pronunciation of the quiescent letter, which should start with Hamza not Ta. That is why some use it as a riddle saying: What is the letter that is not a Hamza of connection used to enable pronunciation of a quiescent letter?",
    "book_id": "238",
    "new_page_number": 42
  },
  {
    "serial_number": "6662911",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": ".......................... … ...... And others have passed [first of all / from the beginning] \n\nThe Explanation: He said: (And others have passed, badi badi) meaning: Speech regarding that which does not begin with 'Ta' has already passed, and that was in the chapter on the conjugation of the Present Tense (Mudari'). For that which does not begin with 'Ta' is either triliteral like \"daraba\" (hit), \"fataha\" (opened); or quadriliteral like \"dahraja\" (rolled), \"ba'thara\" (scattered); or pentaliteral like \"intalaqa\" (set off), \"inkasara\" (broke), \"ijtama'a\" (gathered); or hexaliteral like \"istaghfara\" (sought forgiveness). If it is quadriliteral, pentaliteral, or hexaliteral, it is obligatory to break (Kasra) the letter before the last in the Present Tense, such as: \"yudahriju\", \"yuba'thiru\", \"yukrimu\", \"yuslimu\", \"yusafiru\", \"yu'allimu\", \"yuqaddimu\", \"yantaliqu\", \"yankasiru\", \"yajtami'u\", \"yastaghfiru\" and so on. If it is triliteral like \"fataha\", \"daraba\", \"nasara\", \"karuma\", speech regarding it has already preceded in detail, and we explained that the letter before the last in its Present Tense might be open (Fatha) like \"yaftahu\", \"yafrahu\", \"yas'alu\", \"yakhsha'u\", \"yakhda'u\", \"yakhla'u\". It may be broken (Kasra) like \"ya'ti\", \"yabki\", \"yabni\", \"yarmi\", \"yahdhi\", \"ya'si\", \"yajri\", \"yamshi\", \"yazni\". And it may be joined (Damma) like \"yad'u\", \"yabdu\", \"yazku\", \"ya'fu\", \"ya'du\", \"yaghzu\", \"yafshu\", \"yahju\", \"yahfu\". And his saying: (badi badi) means: at the beginning of the matter. Ibn al-Athir said: \"Al-Badiyy with stress (shadda): The first, and from it is their saying: Do this 'badiya badiyin'. Meaning: First of all things\" (1). Al-Radi said while discussing this phrase: \"Its usage became so frequent that the combination of the two words conveyed what is conveyed by a single word, as the meaning of 'badi badi' is: starting\" (2).",
    "foot_note": "1. See: Al-Nihayah fi Gharib al-Athar (1/271). \n2. See: Sharh al-Radi 'ala al-Kafiyah (3/139).",
    "book_id": "238",
    "new_page_number": 43
  },
  {
    "serial_number": "6662912",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Chapter on what is built for the Unknown (Passive Voice)\n\nAnd the verb, if built for the object (Passive) … Join (Damma) its beginning ...................................\n\nThe Explanation: Chapter on what is built for the Unknown (Passive Voice). He said: (And the verb, if built for the object, join its beginning) meaning: That the verb—whether triliteral or exceeding three letters—if you wish to build it for the object (meaning: for that whose doer is not named), you apply Damma to its beginning, whether it is Past or Present tense. His saying: (Dumm) is an imperative verb, and the doer is a hidden pronoun estimated as (you). An example of the Triliteral Past: \"duriba\" (was hit), \"futiha\" (was opened), \"suriqa\" (was stolen), \"hufiza\" (was preserved), \"fuhima\" (was understood), \"kutiba\" (was written), \"ukhidha\" (was taken), \"ukila\" (was eaten), \"qutila\" (was killed). An example of the Present Triliteral verb: \"yudrabu\", \"yuftahu\", \"yusraqu\", \"yuhfazu\", \"yufhamu\", \"yuktabu\", \"yu'khadhu\", \"yu'kalu\", \"yuqtalu\". An example of the Past exceeding three letters: \"duhrija\", \"tu'ullima\", \"tusuddiqa\", \"untuliqa\", \"ujtumi'a\", \"ustukhrija\". An example of the Present exceeding three letters: \"yudahraju\", \"yuba'tharu\", \"yuntalaqu\", \"yujtama'u\", \"yustakhraju\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 44
  },
  {
    "serial_number": "6662913",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "........................ … ....... And break the weak [verb] like 'shim' \n\nThe Explanation: He said: (And break the weak (1) like 'shim') meaning: If the Past Triliteral verb has a weak middle letter (Hollow verb) like: \"qala\" (said), \"ba'a\" (sold), \"ja'a\" (came), \"kada\" (almost did), and it is constructed for the object (Passive), then its beginning is broken (Kasra), so it is said: \"qila\", \"bi'a\", \"ji'a\" (2). And his saying: (like 'shim'), 'shim' is an imperative verb from 'shama al-barq'. And 'al-shaym' is: looking at the lightning, watching where it intends to go and where it will rain. It is said: 'shama al-barqa yashimuhu shayman'\" (3).",
    "foot_note": "1. The verb is divided into two types: Sound (Sahih) and Weak (Mu'tall). The Sound is: what is free of the three vowel letters - Alif, Waw, and Ya. The Weak is: what has one of its original letters as a vowel letter. It is divided into five types: First: Mithal: What has a weak first letter (Fa), like: wa'ada, warima. Second: Ajwaf (Hollow): What has a weak middle letter ('Ain), like: ba'a, qala, khafa, qama, sama. Third: Naqis (Defective): What has a weak last letter (Lam), like: rama, baka, bagha, radiya, da'a. Fourth: Lafif Maqrun: What has a weak middle and last letter, like: tawa, rawa, hawa, nawa, lawa, shawa. Fifth: Lafif Mafruq: What has a weak first and last letter, like: wafa, waqa, wa'a, waliya. \n2. What the poet mentioned regarding breaking the first letter of the hollow verb when built for the passive is the most eloquent, although pure Damma is permissible - which is the dialect of Faq'as and Dubayr - so you say: \"bu'a\", \"qula\", \"suma\". From this is the poet's saying: \"Layta wa hal yanfa'u shay'an laytu .... layta shababan bu'a fa-ashtaraytu\" (If only youth were sold so I could buy it). Ishmam is also permissible, which is: mixing the sound of Damma with a bit of the sound of Kasra. \n3. Al-Qamus al-Muhit (p. 1456), Islah al-Mantiq by Ibn al-Sikkit (p. 16).",
    "book_id": "238",
    "new_page_number": 45
  },
  {
    "serial_number": "6662914",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "And what is before the last of the Past is broken … And opening it in the Present is transmitted.\nIn \"ikhtara\" and \"inqada\" and the like, break … the first and the third, and be precise.\n\nThe Explanation: He said: (And what is before the last of the Past is broken) meaning: If the Past verb is built for the object (Passive), the letter before its last is broken (Kasra), such as: \"kusira\", \"duriba\", \"futiha\", \"suriqa\", \"hufiza\", \"fuhima\", \"kutiba\", \"ukhidha\", \"ukila\", \"qutila\". He said: (And opening it in the Present is transmitted) meaning: And the letter before its last is opened (Fatha) if it is Present tense, such as: \"yuksaru\", \"yudrabu\", \"yuftahu\", \"yuhfazu\", \"yufhamu\", \"yuktabu\", \"yu'kalu\", \"yuqtalu\". And his saying: (uthira) means: transmitted from the Arabs. He said: (In \"ikhtara\" and \"inqada\" and the like, break the first and the third, and be precise) meaning: In \"ikhtara\" (chose) and \"inqada\" (obeyed/led), the first and third letters are broken, so you say: \"ikhtira\" (was chosen) and \"inqida\" (was led). \n\nAnd what begins with Hamzat al-Wasl, then join … its third like the second of the one with 'Ta', it is obligated.\n\nAnd his saying: (and the like) means: Whatever resembles them from every verb on the weight of \"ifta'ala\" or \"infa'ala\", which has a weak middle letter and a sound last letter; its ruling is like their ruling, meaning its first and third letters are broken (1). And his saying: (wa harriri) is from Tahrir, which is refinement. Perhaps the poet intended to clarify by this phrase that what does not meet the aforementioned conditions of being on the weight of \"ifta'ala\" or \"infa'ala\", such as \"istawa\" (2), is not given their ruling. Rather, it is like others starting with Hamzat al-Wasl, having only the joining (Damma) of its first and third, as will come in the next verse, which is his saying: And what begins with Hamzat al-Wasl, then join … its third like the second of the one with 'Ta', it is obligated.",
    "foot_note": "1. Pure Damma is also permissible, so you say: \"ukhtura\", \"unquda\", and Ishmam (mixing vowels) is also permissible. \n2. And similar verbs where a condition from the aforementioned conditions is missing, which here is the soundness of the last letter, for its last letter is weak.",
    "book_id": "238",
    "new_page_number": 46
  },
  {
    "serial_number": "6662915",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "And what begins with Hamzat al-Wasl, then join … its third like the second of the one with 'Ta', it is obligated.\n\nThe Explanation: (And what begins with Hamzat al-Wasl, then join its third like the second of the one with 'Ta', it is obligated) meaning: The Past verb starting with Hamzat al-Wasl - which is only pentaliteral or hexaliteral - if built for the object (Passive), it is obligatory to join (Damma) the third letter of it - meaning: along with the first -, such as: \"untuliqa\", \"ujtumi'u\", \"ustukhrija\", \"ustughfira\", \"ustunbita\". It would have been better to present this verse before the verse preceding it; because what was mentioned in the previous verse is an exception to this rule. So it was better to present the mention of the rule, then mention what is excepted from it, which is every verb on the weight of \"ifta'ala\" or \"infa'ala\" with a weak middle and sound last. And his saying: (like the second of the one with 'Ta') meaning: The verb starting with an extra 'Ta' has its second letter joined - meaning: along with the first - like \"ta'allama\", \"tasaddaqa\", \"taqatala\", so you say in their passive forms: \"tu'ullima\", \"tusuddiqa\", \"tuqutila\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 47
  },
  {
    "serial_number": "6662916",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Chapter on the Imperative (Amr)\nAnd the Imperative from 'af'ala' is 'af'il' ............ … ........................................\n\nThe Explanation: Chapter on the Imperative. The poet spoke in this chapter about how to form the imperative verb. The summary of this chapter is that the Past verb is either on the weight of \"af'ala\" or not. If it is on the weight of \"af'ala\" with a Fatha on the 'Ain', then the imperative from it comes on the weight of \"af'il\" with a Kasra on the 'Ain'. This is the meaning of the poet's saying: (And the Imperative from 'af'ala' is 'af'il'). Examples of this are: \"akrim\" (honor), \"ahsin\" (do good), \"a'ti\" (give), \"amin\" (believe). For the past tense of these commands are: \"akrama\", \"ahsana\", \"a'ta\", \"amana\". So the difference between the Past form and the Imperative - as you see in the examples - is that the letter before the last is open in the Past, and broken in the Imperative (1).",
    "foot_note": "1. Another difference between them is that the last letter in the Past is open (Fatha), and in the Imperative, it is silent (Sukun), although the vowel of the last letter is not a topic of Morphology (Sarf), but rather a topic of Syntax/Grammar (I'rab).",
    "book_id": "238",
    "new_page_number": 48
  },
  {
    "serial_number": "6662917",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "................. And delete … from other than it the Mudari' letter, you will suffice.\n\nThe Explanation: And if the Past is not on the weight of \"af'ala\", such as being triliteral like \"daraba\", or quadriliteral not on the weight of af'ala like \"dahraja\", or pentaliteral like \"intalaqa\", or hexaliteral like \"istakhraja\", then the method of deriving the imperative verb from it is to bring the Present verb (Mudari') in the Jussive case (Majzum) with the Lam of Command (Lam al-Amr). Then the Lam of Command and the Mudari' letter (prefix) are removed from it. Then one looks at the letter that was connected to the Mudari' letter; if it has a vowel, then you obtain the imperative verb directly, such as: \"li-tudahrij\", \"li-tuzakhrif\", \"li-tusaddiq\", \"li-tusharik\", \"li-tuqatil\", \"li-tataqaddam\", \"li-taqul\", \"li-tasum\". You say in the imperative from them: \"dahrij\", \"zakhrif\", \"saddiq\", \"sharik\", \"qatil\", \"taqaddam\", \"qul\", \"sum\". This is what is meant by the poet's saying: (And delete from other than it the Mudari' letter, you will suffice) meaning: Remove the Mudari' letter from other than \"af'ala\" and you will fulfill what is required of you. But if the letter connected to the Mudari' letter is silent (Sukun), then a Hamzat al-Wasl is brought to enable the pronunciation of that silent letter. This Hamza is broken (Kasra) if the Mudari' has a broken middle letter like \"yadribu\", or an open middle letter like \"yadhhabu\", \"ya'lamu\", so you say in the imperative from them: \"idrib\", \"idhhab\", \"i'lam\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 49
  },
  {
    "serial_number": "6662918",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "And the silent one, join it with a broken Hamza … if the coming [verb] is opened, likewise if broken.\nAnd join it from what is joined originally ........ … ..............................................\n\nThe Explanation: The poet pointed to this by saying: (And the silent one, join it with a broken Hamza if the coming is opened, likewise if broken) meaning: If the letter following the Mudari' letter is silent, join it with a broken Hamzat al-Wasl if the Mudari' is open or broken. His saying: (if the coming is opened) refers to the Mudari'. He said: (And join it from what is joined originally) meaning: And apply Damma to the Hamzat al-Wasl if the middle letter of the Present verb is joined with an original Damma. Examples of this: \"yansuru\", \"yaqtulu\", \"yanzuru\", \"yaktubu\", \"yad'u\". These are Present verbs with a joined middle letter, so you say in the imperative from them: \"unsur\", \"uqtul\", \"unzur\", \"uktub\", \"ud'u\". And his saying: (from what is joined originally) is a precaution against cases where the Damma of the Mudari's middle letter is temporary (accidental). In that case, the Hamzat al-Wasl is brought broken, because the temporary is weak and does not override the original. So you say: \"imshu\" (walk - plural) with a broken Hamzat al-Wasl, even though the middle letter of the Present verb assigned to the Waw of the group is joined \"yamshun\", but this Damma is temporary because of the Waw of the group.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 50
  },
  {
    "serial_number": "6662919",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "...................... And anomalous is … the deletion of it from 'kul' and 'mur' and 'sal' and 'khudh'\n\nThe Explanation: And his saying: (And anomalous is the deletion of it from 'kul' and 'mur' and 'sal' and 'khudh') meaning: The deletion of Hamzat al-Wasl is anomalous (irregular) in limited verbs, which are: \"kul\" (eat), \"mur\" (order), \"sal\" (ask), \"khudh\" (take), even though the principle is to keep it; because the letter connected to the Mudari' letter is silent, and the analogy in such cases is to establish the Hamzat al-Wasl. So the original forms would be: \"u'kul\", \"u'mur\", \"is'al\", \"u'khudh\". However, since the Arabs deleted this silent letter connected to the Mudari' letter, they dispensed with bringing the Hamzat al-Wasl; because it was imported to enable pronunciation of the silent letter, and that has been removed, so they deleted it, and they became \"kul\", \"mur\", \"sal\", \"khudh\". However, the deletion of the Hamza in \"mur\" and \"sal\" is not obligatory except when starting speech with the word. But if preceded by a conjunction, they are not committed to deleting it; rather, the most common usage for these two words in that case is restoring the Hamza, like His saying (Exalted is He): {Wa'mur ahlaka bi-as-salah} (And enjoin prayer upon your family), {Fa-as'alu ahla al-dhikr} (So ask the people of the message). As for \"khudh\" and \"kul\", completing them after a conjunction is rare.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 51
  },
  {
    "serial_number": "6662920",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Chapter on the Active Participle (Ism Fa'il) and Passive Participle (Ism Maf'ul)\n'Fa'ula' with Damma, 'Fa'il' [or] 'Fa'l' … is the Active Participle for it, like \"Zaydun Sahlun\"\nAnd 'Fa'il' for 'Fa'ila' with Kasra, perpetuate … like 'Af'al', 'Fa'lan' if it was intransitive.\n\nThe Explanation: Chapter on the Active Participle and Passive Participle. The poet said: ('Fa'ula' with Damma, 'Fa'il' [or] 'Fa'l' is the Active Participle for it, like \"Zaydun Sahlun\") meaning: Every verb on the weight of \"fa'ula\" - its Active Participle by analogy comes on the weight of \"fa'il\" or on the weight of \"fa'l\". Whatever deviates from these two weights is anomalous, preserved but not used for analogy. Examples of what came on the weight of \"fa'il\": \"karuma fa-huwa karim\" (generous), \"nabula fa-huwa nabil\" (noble), \"qabuha fa-huwa qabih\" (ugly), \"qasura fa-huwa qasir\" (short), \"'azuma fa-huwa 'azim\" (great), \"sharufa fa-huwa sharif\" (honorable), \"samuna fa-huwa samin\" (fat). Examples of what came on the weight of \"fa'l\": \"sahula fa-huwa sahl\" (easy), \"sa'uba fa-huwa sa'b\" (difficult). The poet's saying: (Zaydun Sahlun) is a Subject and Predicate. He said: (And 'Fa'il' for 'Fa'ila' with Kasra, perpetuate, like 'Af'al', 'Fa'lan' if it was intransitive) meaning: Every intransitive verb on the weight of \"fa'ila\" with a broken middle, its Active Participle comes on the weight of \"fa'il\" which is predominant like \"fariha fa-huwa farih\" (happy), \"batira fa-huwa batir\" (arrogant); or on the weight of \"af'ala\" if it indicates color like \"khadira fa-huwa akhdar\" (green), \"hamira fa-huwa ahmar\" (red), \"sawida fa-huwa aswad\" (black); or on the weight of \"fa'lan\" like \"shabi'a fa-huwa shab'an\" (full), \"'atisha fa-huwa 'atshan\" (thirsty), \"sakira fa-huwa sakran\" (drunk). Sometimes the three weights combine like \"sha'itha fa-huwa sha'ith, and ash'ath, and sha'than\" (disheveled). Thus some said: And perhaps they combined like sha'ith, and like sha'than, and like al-ash'ath.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 52
  },
  {
    "serial_number": "6662921",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "And 'Fa'il' for the open 'Fa'ala' and the … broken if it is transitive .....................\n\nThe Explanation: And the meaning of his saying: (And 'Fa'il' for 'Fa'ila' with Kasra, perpetuate) is: The Active Participle which is on the weight of \"fa'il\" is always brought for \"fa'ila\" with a broken middle. His saying: (adim) is an imperative from 'adama'. His saying: (if it was intransitive) meaning: on the condition that \"fa'ila\" with the broken middle is intransitive, not transitive. He said: (And 'Fa'il' for the open 'Fa'ala' and the broken if it is transitive) meaning: Every verb on the weight of \"fa'ala\" with an open middle - whether intransitive like \"dhahaba\" or transitive like \"daraba\", \"kataba\" -, or on the weight of \"fa'ila\" with a broken middle provided it is transitive like \"hafiza\", \"fahima\", then the Active Participle comes from them on the weight of \"fa'il\", such as: \"dhahaba fa-huwa dhahib\" (goer), \"daraba fa-huwa darib\" (hitter), \"kataba fa-huwa katib\" (writer), \"hafiza fa-huwa hafiz\" (preserver), \"fahima fa-huwa fahim\" (understander). And his saying: (if it is transitive) meaning: provided that \"fa'ila\" with the broken middle is transitive. But if it is intransitive, it was mentioned in the previous verse that its Active Participle is on the weight of \"fa'il\", or \"af'al\", or \"fa'lan\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 53
  },
  {
    "serial_number": "6662922",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "................... … .................. For other than this, it is transferred\nThe weight of its Mudari' with a Miem joined … at its beginning, and break what follows the last.\n\nThe Explanation: After the poet mentioned the form of the Active Participle from the triliteral verb, he mentioned that it comes from non-triliteral verbs, saying: (For other than this, it is transferred) meaning: For other than the triliteral. It means that the Active Participle comes from non-triliteral verbs on the weight of its Present tense (Mudari'), except that the Mudari' letter is replaced with a joined (Damma) Mim, and what is before its last letter is broken (Kasra), such as: \"akrama yukrimu fa-huwa mukrim\" (honorer), \"intalaqa yantaliqu fa-huwa muntaliq\" (departer), \"istakhraja yastakhriju fa-huwa mustakhrij\" (extractor). Thus the poet said: (The weight of its Mudari' with a Miem joined at its beginning, and break what follows the last). So his saying: (The weight of its Mudari') means: on the weight of the Present. His saying: (with a Miem joined) means: the Mudari' letter is replaced by a joined Miem. His saying: (at its beginning) means: the Miem is at its start. His saying: (and break what follows the last) means: and break the letter before the last one.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 54
  },
  {
    "serial_number": "6662923",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "And if you open it, then 'Maf'ul' you intend … and this weight from the Triliteral is consistent.\n\nThe Explanation: When the poet finished discussing the Active Participle, he began discussing the Passive Participle (Ism Maf'ul) from the triliteral verb and others. He started by discussing its formation from non-triliteral verbs, saying: (And if you open it, then 'Maf'ul' you intend) meaning: And if you want the Passive Participle from the verb exceeding three letters, then open (Fatha) the letter before the last of its Active Participle, such as: \"mukram\" (honored), \"muntalaq\" (departed from), \"mustakhraj\" (extracted), \"mustanbat\" (deduced) and so on. Then he mentioned the Passive Participle from the Triliteral, saying: (and this weight) meaning: the weight of \"maf'ul\" (from the Triliteral is consistent) meaning: it is the analogy for the Passive Participle from the Triliteral absolutely. So every triliteral verb, whether on the weight of \"fa'ula\" with joined middle, or \"fa'ila\" with broken middle, or \"fa'ala\" with open middle, the Passive Participle from it is brought on the weight of \"maf'ul\", such as: \"mashrub\" (drunk), \"ma'kul\" (eaten), \"madrub\" (hit), \"masruq\" (stolen), \"maqtul\" (killed).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 55
  },
  {
    "serial_number": "6662924",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Chapter on Masdars (Verbal Nouns)\nFrom 'Fa'ula' the joined, the measurement of the Masdar … is 'Fa'alah' [and] 'Fu'ulah', mention for it.\n\nThe Explanation: Chapter on Masdars. Masdars are of two types: Auditory (Sama'i - irregular) and Analogical (Qiyasi - regular). The Auditory ones are more numerous than the Analogical ones, but the poet did not discuss them; rather, he limited himself to the Analogical ones. He began by discussing the Masdar of \"fa'ula\" with the joined middle, saying: (From 'Fa'ula' the joined, the measurement of the Masdar is 'Fa'alah' [and] 'Fu'ulah', mention for it) meaning: Every verb on the weight of \"fa'ula\" with the joined middle, the analogy of its Masdar is to come on the weight of \"fa'alah\" or \"fu'ulah\", such as: \"zarufa zarafah\" (to be witty), \"fasuha fasahah\" (to be eloquent), \"shaju'a shaja'ah\" (to be brave), \"sahula suhulah\" (to be easy), \"sa'uba su'ubah\" (to be difficult). His saying: (qays) means: analogy, and (fa'alah and fu'ulah) in the poet's speech are the object of his saying: (udhkur) meaning: Mention for \"fa'ula\" 'fa'alah' and 'fu'ulah'.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 56
  },
  {
    "serial_number": "6662925",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "And 'Fa'ila' the broken, intransitive, 'Fa'al' … its analogy is 'Fa'l' for the falling [transitive] that occurred.\nAnd 'Fa'ala' the opened, from it the Masdar … is 'Fa'l' ..................................\n\nThe Explanation: He said: (And 'Fa'ila' the broken, intransitive, 'Fa'al') meaning: Every intransitive verb on the weight of \"fa'ila\" with a broken middle, the analogy of its Masdar is to come on the weight of \"fa'al\", such as: \"fariha farahan\" (happiness), \"batira bataran\" (arrogance), \"ghadiba ghadaban\" (anger), \"'atisha 'atashan\" (thirst) and so on. His saying: (And 'Fa'ila' the broken) means: broken middle letter. (Intransitive) means: on the condition it is intransitive. As for the transitive, the analogy of its Masdar is to come on the weight of \"fa'l\" with a silent middle, thus the poet said: (its analogy is 'Fa'l' for the falling that occurred) such as: \"fahima fahman\" (understanding), \"thalima thalman\" (notching). His saying: \"(for the falling)\" means: for the transitive verb, because the transitive is called \"the falling\" (al-waqi') due to its action falling upon the object. He said: (And 'Fa'ala' the opened, from it the Masdar is 'Fa'l') meaning: And every verb on the weight of \"fa'ala\" with an open middle, if it is transitive, the analogy of its Masdar is to come on the weight of \"fa'l\" with a silent middle, such as: \"daraba darban\" (hitting), \"fataha fathan\" (opening), \"bahatha bahthan\" (searching), \"ba'atha ba'than\" (sending).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 57
  },
  {
    "serial_number": "6662926",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "........................ … ...... 'Fu'ul' in intransitive is mentioned.\nAnd 'Fa'il' came like 'dabib', and 'Fu'al' … like 'surakh', 'Fa'alan' for transition.\n\nThe Explanation: But if it is intransitive, the analogy of its Masdar is to come on the weight of \"fu'ul\", such as: \"qa'ada qu'udan\" (sitting), \"jalasa julusan\" (sitting), \"dakhala dukhulan\" (entering), \"khada'a khudu'an\" (submitting). Thus the poet said: ('Fu'ul' in intransitive is mentioned). Except that it is frequently heard regarding \"fa'ala\" the intransitive with open middle that its Masdar comes on the weight of \"fa'il\" if it indicates movement/march, such as: \"rahala rahilan\" (departure); or on the weight of \"fu'al\" if it indicates sound, such as: \"da'a du'a'an\" (calling); or on the weight of \"fa'alan\" if it indicates motion and disturbance, such as: \"dara dawaranan\" (rotation). Thus the poet said: (And 'Fa'il' came like 'dabib', and 'Fu'al' like 'surakh', 'Fa'alan' for transition) meaning: The Masdar for intransitive \"fa'ala\" came on the weight of \"fa'il\", such as: \"dabba dabiban\" (crawling); and on the weight of \"fu'al\" like \"sarakha surakhan\" (screaming); and on the weight of \"fa'alan\" if \"fa'ala\" indicates transition and motion, such as: \"fada fayadanan\" (flooding), \"jara jarayanan\" (flowing), \"ghala ghalayanan\" (boiling). Also, it is heard that the Masdar from intransitive \"fa'ala\" comes on the weight of \"fi'alah\" if it indicates a craft or guardianship, such as: \"kataba kitabah\" (writing), \"sana'a sina'ah\" (manufacturing), \"khata khiyatah\" (sewing), \"darasa dirasah\" (studying), \"waliya wilayah\" (guardianship). It is also heard that the Masdar from intransitive \"fa'ala\" comes on the weight of \"fu'al\" if it indicates a disease, such as: \"sa'ala su'alan\" (coughing), \"zukima zukaman\" (cold/flu), \"sada'a suda'an\" (headache).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 58
  },
  {
    "serial_number": "6662927",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "And 'Fa'lah' for an instance like 'Khalsah' … ........................................\n\nThe Explanation: (And 'Fa'lah' for an instance like 'Khalsah') meaning: The Noun of Instance (Ism al-Marrah) from the triliteral verb absolutely, whether intransitive or transitive, is on the weight of \"fa'lah\", such as: \"jalasa jalsah\" (a sitting), \"akala aklah\" (an eating), \"qa'ada qa'dah\" (a sitting). His saying: (like 'Khalsah') is from ikhtilas: which is taking something quickly, and al-khalsah is a single instance of snatching. However, it is a condition in the foregoing that the Masdar is not originally built with a 'Ta'. If it is built with a 'Ta' like \"rahmah\" (mercy), \"nafkhah\" (blow), then it does not indicate the single instance [by form alone]. If an instance is intended from it, it is described by unity (the word 'one'), so it is said: \"rahima rahmatan wahidatan\" (he had mercy once), \"nafakha nafkhatan wahidatan\" (he blew once). As for forming the Instance from other than the triliteral verb, it is by adding a 'Ta' to its end, such as: \"intalaqa intilaqah\" (a departure), \"istakhraja istikhrajah\" (an extraction).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 59
  },
  {
    "serial_number": "6662928",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "......................... … And 'Fi'lah' for a manner like 'Khilsah'\n\nThe Explanation: He said: (And 'Fi'lah' for a manner like 'Khilsah') meaning: The Manner (Hay'ah) is formed from the triliteral verb absolutely on the weight of \"fi'lah\", such as: \"fa-ahsinu al-qitla\" (so improve the manner of killing), \"fa-ahsinu al-dhibha\" (so improve the manner of slaughtering), \"jalasa jilsata al-mutakabbir\" (he sat the sitting of the arrogant), \"qa'ada qi'data al-a'rabi\" (he sat the sitting of the Bedouin), \"mata mitatan hasanah\" (he died a good death). His saying: (like 'Khilsah') means: like the manner of one who wants to snatch. A source for Manner (Masdar Hay'ah) is not built from non-triliteral verbs.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 60
  },
  {
    "serial_number": "6662929",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Chapter on Masdars of Non-Triliteral Verbs\nThe non-triliteral, if started with a Wasl [Hamza] … its third break, and extend what is after.\nAnd the 'Ain' of its weak one is deleted decisively … and the compensation of a 'Ta' is often, from it, found.\n\nThe Explanation: Chapter on Masdars of Non-Triliteral Verbs. The poet said: (The non-triliteral, if started with a Wasl, its third break, and extend what is after) meaning: The non-triliteral verbs, if they begin with Hamzat al-Wasl - and this is only pentaliteral or hexaliteral - then the analogy of the Masdar from it is that its third letter is broken, and an Alif is added before its last letter, such as: \"intalaqa intilaqan\" (departure), \"iqtadara iqtidaran\" (ability), \"istaghfara istighfaran\" (seeking forgiveness), \"istanbata istinbatan\" (deduction). His saying: (its third) is the object for the verb that follows it (break) meaning: break its third. His saying: (and extend what is after) meaning: extend (add Alif to) what is before the last. However, a condition for the foregoing is that the 'Ain' (middle root letter) is sound. If it is weak, the analogy of the Masdar from it is that its 'Ain' is deleted, and a 'Ta' is substituted for it. Thus the poet said: (And the 'Ain' of its weak one is deleted decisively, and the compensation of a 'Ta' is often, from it, found) such as: \"istabana istibanah\" (clarification), \"istaqama istiqamah\" (uprightness), \"ista'adha isti'adhah\" (seeking refuge). His saying: (and the compensation of a 'Ta') means: substituting a 'Ta'. His saying: (often) means that this 'Ta' is often mentioned, and less often it is deleted; this - i.e., deletion - is frequent with annexation (Idafah), such as: \"iqam as-salah\" (establishing prayer), \"istinar al-badr\" (illumination of the full moon), and their original forms are: \"iqamah as-salah\", \"istinarah al-badr\". His saying: (ulif) means: found and known.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 61
  },
  {
    "serial_number": "6662930",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "And what begins with 'Ta', if sound, obligated … is Damma for what is before the last, known.\nAnd break it from its weak one ............. … .............................................\n\nThe Explanation: He said: (And what begins with 'Ta', if sound, obligated is Damma for what is before the last, known) meaning: Every verb starting with an extra 'Ta' - and it is only pentaliteral - the analogy of the Masdar from it is that what is before its last is joined (Damma), provided it has a sound last letter (Lam). Thus the poet said: (if sound) meaning: if it has a sound Lam, such as: \"tadahraja tadahrujan\" (rolling), \"ta'allama ta'alluman\" (learning), \"takallama takalluman\" (speaking), \"tashaytana tashaytunan\" (acting like a devil), \"takallafa takallufan\" (burdening), \"takarraama takarruman\" (being generous), \"tafahama tafahhuman\" (understanding) and so on. But if it has a weak Lam, such as: \"tawana\", \"tawalla\", \"tadalla\", then the analogy of the Masdar from it is that what is before its last is broken (Kasra). Thus the poet said (And break it from its weak one), so you say: \"tawaniyan\" (slacking), \"tawalliyan\" (taking charge), \"tadalliyan\" (hanging down).",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 62
  },
  {
    "serial_number": "6662931",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "............... And 'Fa'lala' … its Masdar is 'Fa'lalah' like 'Hawqala'.\nAnd 'Fa''ala' the Masdar is 'Taf'il' ......... … ............................................\n\nThe Explanation: He said: (And 'Fa'lala' its Masdar is 'Fa'lalah' like 'Hawqala') meaning: Every verb on the weight of \"fa'lala\" and what is attached to it like \"faw'ala\", the analogy of the Masdar from it is to come on the weight of \"fa'lalah\", such as: \"dahraja dahrajah\" (rolling), \"waswasa waswasah\" (whispering), \"zalzala zalzalah\" (shaking), \"hawqala hawqalah\" (saying la hawla...). Some mentioned that \"fi'lal\" is also an analogical Masdar for \"fa'lala\", which is the apparent meaning of Ibn Malik's words in Al-Tashil (1), so you say: \"dahraja dihrajan\", \"waswasa wiswasan\", \"zalzala zilzalan\". He said: (And 'Fa''ala' the Masdar is 'Taf'il') meaning: Every verb on the weight of \"fa''ala\" (with shadda), the analogy of its Masdar is to come on the weight of \"taf'il\" provided it has a sound Lam, such as: \"kallama takliman\" (speaking), \"'allama ta'liman\" (teaching), \"'azzama ta'ziman\" (glorifying), \"dhakkara tadhkiran\" (reminding).",
    "foot_note": "1. However, in the Alfiyyah he mentioned that it is not analogical where he said: \"Fi'lalun aw Fa'lalatun li-Fa'lala .... wa-aj'al maqisan thaniyan la awwala\" (Fi'lal or Fa'lalah for Fa'lala ... and make the second analogical, not the first).",
    "book_id": "238",
    "new_page_number": 63
  },
  {
    "serial_number": "6662932",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "But if it has a weak Lam, the analogy of its Masdar is to come on the weight of \"Taf'ilah\". Thus the poet said: ............................... And this … if it is weak, 'Taf'ilah' for it, take.\nAnd 'Taf'al' came for abundance for it … For 'Fa'ala', 'Fi'al' and 'Mufa'alah'.\n\nThe Explanation: (And this) meaning: \"fa''ala\" (if it is weak) meaning: if it has a weak Lam (Taf'ilah for it, take) meaning: take for it a Masdar on the weight of \"taf'ilah\", such as: \"zakka tazkiyah\" (purification), \"rabba tarbiyah\" (upbringing), \"namma tanmiyah\" (development), \"waffa tawfiyah\" (fulfillment), \"ghatta taghtiyah\" (covering). He said: (And 'Taf'al' came for abundance for it) meaning: That \"fa''ala\" sometimes has its Masdar come on the weight of \"taf'al\" to indicate abundance, such as: \"tawwafa tatwafan\" (circulating much), \"sayyara tasyaran\" (traveling much) (1). He said: (For 'Fa'ala', 'Fi'al' and 'Mufa'alah') this hemistich is from the Alfiyyah of Ibn Malik. The meaning is that every verb on the weight of \"fa'ala\", the analogy of the Masdar from it is to come on the weight of \"mufa'alah\" by agreement, and on the weight of \"fi'al\" according to the correct view, such as: \"daraba diraban and mudarabah\" (fighting), \"khasama khisaman and mukhasamah\" (disputing), \"qatala qitalan and muqatalah\" (battling).",
    "foot_note": "1. Benefit: Every Masdar that comes on the weight of Taf'al has an open 'Ta' except \"tibyan\" (clarification) and \"tilqa'\" (encounter).",
    "book_id": "238",
    "new_page_number": 64
  },
  {
    "serial_number": "6662933",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Chapter on the Construction of 'Maf'al' and 'Maf'il'\nWhat does not have a necessary breaking for its coming [verb] … then from it 'Maf'al' with Fatha is marked.\n\nThe Explanation: Chapter on the Construction of 'Maf'al' and 'Maf'il'. The poet organized this chapter regarding the construction of Maf'al - with open 'Ain' - and Maf'il - with broken 'Ain' -, which is called: \"The Mim-Masdar\" because it begins with an extra Mim. He said: (What does not have a necessary breaking for its coming [verb] … then from it 'Maf'al' with Fatha is marked) meaning: The verb for which the breaking of the middle letter of its Present tense (Mudari') is not obligatory, like \"dhahaba\" (went), the Maf'al form is brought from it with Fatha indicating the Masdar, the Place, and the Time. Distinction is made between them by context, so you say: \"dhahaba Zaydun madhhaban hasanan\" - meaning: a good going (Masdar) -, \"and this is the madhhab of Zayd\" - meaning: the place of his going -, \"and Ramadan is the madhhab of Zayd\" - meaning: the time of his going. His saying: (for its coming) meaning: for its Mudari'. His saying: (wusim) meaning: known.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 65
  },
  {
    "serial_number": "6662934",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "And break it from the Waw-initial absolutely … except for the weak [ending], then release the opening.\n\nThe Explanation: He said: (And break it from the Waw-initial absolutely) meaning: Break the \"Maf'il\" from every triliteral verb that begins with a Waw (Mithal), whether the middle of its Mudari' is broken like \"wa'ada ya'idu\" (promise) or not like \"waqa'a yaqa'u\" (fall). So you say: \"wa'ada Zaydun maw'idan hasanan\" - meaning: a promise -, \"and this is the maw'id of Zayd\" - meaning: the place of his promise -, \"and Ramadan is the maw'id of Zayd\" - meaning: the time of his promise. From this is His saying (Exalted is He): {Qala maw'idukum yawmu al-zinah} (He said: Your appointment is the day of decoration). He said: (except for the weak, then release the opening) meaning: Unless it has a weak last letter (Lam), then the Maf'al is brought from it with Fatha absolutely - meaning: whether it starts with Waw or not -, indicating the Masdar, the Place, and the Time. Example of Waw-initial: \"waqa\" (protect), so you say: \"mawqa\" for the Masdar, Time, and Place, and distinction is made by context. Example of what is not Waw-initial: \"rama\" (throw), so you say: \"marma\" for the Masdar, Time, and Place, and distinction is also made by context.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 66
  },
  {
    "serial_number": "6662935",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "And other than what passed of the broken … is opened in the Masdar without falsehood.\nAnd break it from the Adverb of Time and Place … And other than this, its anomaly is clear.\n\nThe Explanation: He said: (And other than what passed) meaning: other than what preceded regarding the Waw-initial and the weak-final (of the broken) meaning: from that whose Mudari' middle is broken like \"daraba yadribu\" (is opened in the Masdar) meaning: that the Maf'al form is brought from it with Fatha indicating the Masdar, so you say: \"daraba Zaydun madraban hasanan\" - meaning: a hitting. His saying: (without falsehood) meaning: without lying. He said: (And break it from the Adverb of Time and Place) meaning: And the Maf'il form is brought from it with Kasra indicating Time and Place, so you say: \"Ramadan madribu Zayd\" - meaning: the time of his hitting - \"and this is madribu Zayd\" - meaning: the place of his hitting. He said: (And other than this, its anomaly is clear) meaning: What deviates from the previous rules is anomalous, preserved but not used for analogy, such as: \"'asa\" (disobeyed). The analogy is Fatha in the Mim-Masdar because it has a weak ending, so it should be: ma'sayah - with Fatha on Sad -, but only Kasra was heard anomalously - ma'siyah. And like: \"sajada\" (prostrated), the analogy in it is Fatha: \"masjad\"; because its first is not Waw, its last is not weak, and its Mudari' is not broken in the middle, yet only Kasra was heard in it.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 67
  },
  {
    "serial_number": "6662936",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "The non-triliteral like 'Muf'al' comes … like 'Mukram' and 'Mudkhal' and 'Mukhraj'\n\nThe Explanation: When the poet finished discussing the Mim-Masdar from the triliteral verb, he mentioned that it comes from the non-triliteral, saying: (The non-triliteral like 'Muf'al' comes, like 'Mukram' and 'Mudkhal' and 'Mukhraj') meaning: If the Mim-Masdar is desired from the verb exceeding three letters, it is brought on the weight of its Passive Participle (Ism Maf'ul). So \"akrama\" - for example - its Passive Participle is \"mukram\", and \"adkhala\" its Passive Participle is \"mudkhal\", and \"akhraja\" its Passive Participle is \"mukhraj\". And \"mukram\", \"mudkhal\", and \"mukhraj\" are suitable for the Masdar, Place, and Time, and distinction is made by context. The poet's saying: (like 'Muf'al' comes) would be more correct to say: \"like its Passive Participle\"; because some of them are not on the weight of \"muf'al\", such as \"mustakhraj\" which is on the weight of \"mustaf'al\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 68
  },
  {
    "serial_number": "6662937",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Chapter on Construction of the Noun of Land\n'Maf'alah' with Fatha with 'Maf'ah' … for abundance in the land, by analogy it comes.\n\nThe Explanation: Chapter on Construction of the Noun of Land. The poet said: ('Maf'alah' with Fatha with 'Maf'ah' for abundance in the land, by analogy it comes) meaning: A noun is formed from the names of tangible objects that are abundant on the weight of \"maf'alah\" with Fatha, as a description for the land, to indicate the abundance of that thing in it. Such as: \"ardun ma'sadah\" - meaning: rich in lions -, \"ardun masba'ah\" - meaning: rich in beasts -, \"ardun madh'abah\" - meaning: rich in wolves. The \"Maf'alah\" is only formed from a triliteral noun (1), whether simple like \"asad\" (lion), or augmented but by deleting the extra letter like \"af'a\" (viper), it is said: \"ardun maf'ah\" meaning: rich in vipers. Thus the poet said: (with 'Maf'ah'). His saying: (qaysan) means: by analogy. So the meaning of the verse: that \"maf'alah\" comes as an analogical weight for what is abundant in the land.",
    "foot_note": "1. Sibawayh said: \"They did not produce a counterpart for this in what exceeds three letters like al-difda' (frog) and al-tha'lab (fox); hating that it would be heavy for them, and because they could dispense with it by saying: 'kathiratu al-tha'alib' (abundant in foxes) and the like. They specialized it for the triliteral roots due to their lightness.\" See: Kitab Sibawayh (4/94).",
    "book_id": "238",
    "new_page_number": 69
  },
  {
    "serial_number": "6662938",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "And 'Af'alat', 'Muf'ilah' with Damma for it … The non-triliteral, rarely, make it with it.\n\nThe Explanation: Then he said: (And 'Af'alat', 'Muf'ilah' with Damma for it) meaning: Sometimes a verb on the weight of \"af'ala\" is formed from the noun, then the description is brought from it on the weight of \"muf'ilah\" with a broken 'Ain', as a description for the land to indicate what is abundant in it. Such as: \"a'shabat al-ardu fa-hiya mu'shibah\" meaning: its grass became abundant. His saying: (with Damma) meaning: Damma of the Mim. His saying: (for it) meaning: for what is abundant in the land. Then he said: (The non-triliteral, rarely, make it with it). It was mentioned that forming \"Maf'alah\" is only from a triliteral noun. The poet mentions here that it may be formed rarely from the non-triliteral - meaning: from a quadriliteral noun -, such as: \"ardun mutha'labah\" - meaning: rich in foxes -, \"ardun mu'aqrabah\" - meaning: rich in scorpions. It is with an open 'Ain' according to Sibawayh, and with a broken 'Ain' according to others. Sibawayh said: \"If you were to say from the four-letter roots based on your saying: 'ma'sadah', you would say: 'mutha'labah'; because what exceeds three becomes analogous to the Passive Participle (Maf'ul). They said: 'ardun mutha'labah and mu'aqrabah'\" (1). Al-Zubaidi said: \"And 'ardun mu'aqribah' with a broken 'Ra'\" (2). Al-Fayyum said: \"And 'ardun mu'aqribah' is an Active Participle possessing scorpions, just as it is said: mutha'libah and mudafdi'ah and the like\" (3).",
    "foot_note": "1. See: Kitab Sibawayh (4/94). \n2. See: Taj al-Arus min Jawahir al-Qamus (3/425). \n3. See: Al-Misbah al-Munir (p. 218).",
    "book_id": "238",
    "new_page_number": 70
  },
  {
    "serial_number": "6662939",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Chapter on the Construction of the Instrument\nAnd for building the Instrument 'Mif'al' appeared … 'Mif'al' or 'Mif'alah', for it, is consistent.\nAnd anomalous is Damma in 'Muduqq', 'Munsul' … .............................................\n\nThe Explanation: Chapter on the Construction of the Instrument. The poet organized this chapter to discuss building the Instrument (Ism al-Alah) from the verb with which the action is performed. The Instrument is the medium between the doer and the object. He said: (And for building the Instrument 'Mif'al' appeared, 'Mif'al' or 'Mif'alah') meaning: The Instrument is formed from the verb with which work is done on the weight of \"mif'al\", such as: \"mikhyat\" (needle), \"mi'zaf\" (instrument/lute), \"mihlab\" (milking vessel), \"mibrad\" (file), \"mishrat\" (scalpel). Or on the weight of \"mif'al\", such as: \"miqrad\" (scissors), \"miftah\" (key), \"miswak\" (tooth-stick), \"mismar\" (nail), \"misbar\" (probe). Or on the weight of \"mif'alah\", such as: \"mikhaddah\" (pillow), \"miknasah\" (broom), \"miqra'ah\" (whip), \"mistarah\" (ruler), \"misfah\" (strainer). His saying: (for it, is consistent) meaning: The noun of Instrument comes from these three weights by consistent analogy. However, there are nouns that deviated from this analogy, and the poet pointed to them by saying: (And anomalous is Damma in 'Muduqq') which is: The tool with which things are pounded. And ('Munsul') which is: One of the names of the sword.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 71
  },
  {
    "serial_number": "6662940",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "................................ … 'Mukhulah', 'Mudhun' and 'Mus'ut', 'Munkhul'\n\nThe Explanation: And ('Mukhulah') which is: The container in which Kohl is put. And ('Mudhun') which is: The tool in which oil is put. And ('Mus'ut') which is: The tool with which a patient is given snuff/medicine in the nose. And ('Munkhul') which is: The tool with which sifting is done. These words were only heard anomalously - I mean: with Damma on the Mim and the 'Ain' (1) - although the analogy as previously mentioned is always breaking (Kasra) the Mim and opening (Fatha) the 'Ain'. The place for the necessity of the anomalous Damma is when applying the name to them without noting the meaning [of the action], as if they are names for specific tools.",
    "foot_note": "1. Except \"muduqq\", for it has Damma on the first and second letters.",
    "book_id": "238",
    "new_page_number": 72
  },
  {
    "serial_number": "6662941",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "However, if derivation and action are intended by noting the meaning in them, then adhering to Damma is not obligatory. Rather, it is permissible to bring them according to analogy. The poet pointed to this by saying:\nAnd whoever intends the action, permissible is the analogy for him … And praise be to Allah, the High, completing it.\nThen His blessings upon the one He sent … And his Companions and the Followers, the Perfect ones.\n\nThe Explanation: (And whoever intends the action, permissible is the analogy for him) meaning: Whoever intends in the previous words derivation and commencing the action, it is permissible to break the Mim according to analogy, so you say: \"daqaqtuhu bi-l-midaqq\" (I pounded it with the pounder), \"kahaltuhu bi-mikhalati\" (I applied kohl with my kohl-stick), \"nakhaltuhu bi-minkhali\" (I sifted it with my sieve), and so on. His saying: (Al-Qays) means: The Analogy. He said: (And praise be to Allah, the High, completing it) meaning: Praise be to Allah who aided in completing this poem. (Then His blessings upon the one He sent) who is our Prophet Muhammad, peace and blessings be upon him. (And his Companions) plural of Companion (Sahibi), who is one who met the Prophet, peace and blessings be upon him, believing in him and died upon that. (And the Followers) plural of Follower (Tabi'i), who is: one who met a Companion in a state of faith and died upon that. (The Perfect ones) meaning: plural of Perfect (Kamil), and the Perfect is the one who is complete in his morals and attributes. The 'Perfect ones' is a description for the Companions and the Followers.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 73
  },
  {
    "serial_number": "6662942",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Its number is \"Zana\" and I ask the High … A good conclusion and forgiveness of the slip.\n\nThe Explanation: He said: (Its number is \"Zana\") meaning: The number of verses in this poem is fifty-eight verses; because the letter 'Za' in the calculation of Abjad numerals (1) is seven, the letter 'Alif' is one, and the letter 'Nun' is fifty. He said: (And I ask the High for a good conclusion) The conclusion of everything is its end, and the good conclusion is that its owner is successful in pronouncing the word of Testimony (Shahada). (And forgiveness of the slip) Al-Ghafr with Fatha on the Ghayn is: covering/veiling. Al-Zalal: meaning: mistake, and deviating from the path of correctness, from your saying: 'zallat qadamuhu' (his foot slipped). This blessed explanation is completed. I ask Allah the Exalted to make it purely for His Generous Face, necessitating success with Him, and that benefit spreads through it. We have observed moderation in it; because the poem is brief, so it is most fitting for its explainer to follow its example and not exceed its path. We ask Allah the Exalted to grant us success for righteous deeds, and gather us upon knowledge and its dissemination in every state by His grace and generosity. And praise be to Allah alone, and may Allah bless our Master Muhammad and his Family and Companions and grant them peace abundantly until the Day of Judgment.",
    "foot_note": "1. Hisab al-Jummal (Abjad numerals) is a calculation method where Arabic alphabet letters are placed opposite numbers, meaning the alphabet letter takes the numerical value corresponding to it according to a known table. Hisab al-Jummal is based on the Abjad order, which is: \"Abjad, Hawwaz, Hutti, Kalamun, Sa'fas, Qarashat, Thakhadh, Dazagh\". Their total is twenty-eight letters; nine for units, nine for tens, nine for hundreds, and a letter for a thousand. The alphabetic letters are used in Hisab al-Jummal as follows: A=1, B=2, J=3, D=4, H=5, W=6, Z=7, H=8, T=9, Y=10, K=20, L=30, M=40, N=50, S=60, 'A=70, F=80, S=90, Q=100, R=200, Sh=300, T=400, Th=500, Kh=600, Dh=700, D=800, Z=900, Gh=1000.",
    "book_id": "238",
    "new_page_number": 74
  },
  {
    "serial_number": "6662943",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Poem: The First Fruits of Introduction to the Important Aspects of Morphology\nIn the name of Allah, the Most Gracious, the Most Merciful\n1 - I praise my Lord, Who has transformed (sarrafa) existence … Blessings and peace upon the one He honored.\n2 - Muhammad and his Family, and afterwards … Here is a necklace for you from the morphology of the verb.\n3 - For it is an art of great value … And ignorance of it is truly disgraceful for a person.\n4 - I mentioned in it what is touched by need … To it, and in the Lord is the assistance.\n5 - I named it 'The First Fruits of Introduction' … To what concerns us regarding Morphology.\n\nChapter on the Structures of the Abstract (Mujarrad)\n6 - The weight of the Abstract according to them is 'Fa'ala' … 'Fa'ila' with 'Fa'ula', then 'Fa'lala'.\n7 - 'Kataba' with 'Alima' then 'Zarufa' … 'Dahraja', a representation with brevity that sufficed.\n\nChapter on the Conjugation of the Present Tense (Mudari')\n8 - 'Fa'ula' with Damma implies intransitivity … And the Damma of its Present tense is known.\n9 - And open for it [the Present] from the one with broken Past … It prevails in colors and defects.\n10 - And break it in \"Warith\", \"Warim\", \"Wali\", \"Wathiq\" … \"Wariya Mukh\", and \"Wari'\", \"Wafiq\", \"Wamiq\".\n11 - Two faces for it in \"Hasib\", \"Na'im\", \"Ba'is\" … \"Waghir\", \"Wahir\", \"Walih\", \"Wahil\", \"Yabis\", \"Ya'is\".\n12 - The coming [Present] of open 'Fa'ala' is broken in … The Waw-initial or the doubled intransitive.\n13 - Or the Ya-based in its 'Ain' or its 'Lam' … The Waw-based of them, no doubt in its joining (Damma).\n14 - Likewise what came for boasting glory, or … Doubled if it becomes transitive, and they narrated.\n15 - By hearing, the breaking (Kasra), and in 'Habba' it was unique … And the Damma of the intransitive by hearing has arrived.\n16 - And opening in the guttural 'Ain' is obligatory … Or 'Lam' if the attractor is absent in it.\n17 - With fame, and what deviated from all … Then break or join its coming [Present] like 'Atal'.\n18 - The Present of the Quadriliteral is broken as … It increased over three and generalize.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 75
  },
  {
    "serial_number": "6662944",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Notice\n19 - Your distinguishing the 'Ya' from the 'Waw' by the 'Ain' … Becomes clear by connecting the moving nominative pronoun.\n20 - And transfer the vowel of its 'Ain' to the 'Fa' … If the Past of this is joined or broken.\n21 - As for the open, the homogeneous [vowel] … Is transferred, not the [original] vowel, upon what they established.\n\nChapter on the Present Tense\n22 - And with \"Na'aytu\" the Present is begun … And open, and in the Quadriliteral Damma is occurring.\n23 - And what is before the last open if it starts … With 'Ta', and others passed [first of all / from the beginning].\n\nChapter on what is built for the Unknown (Passive Voice)\n24 - And the verb, if built for the object, join … Its beginning, and break the weak like 'Shim'.\n25 - And what is before the last of the Past is broken … And opening it in the Present is transmitted.\n26 - In \"ikhtara\" and \"inqada\" and the like, break … The first and the third, and be precise.\n27 - And what begins with Hamzat al-Wasl, then join … Its third like the second of the one with 'Ta', it is obligated.\n\nChapter on the Imperative (Amr)\n28 - And the Imperative from 'af'ala' is 'af'il' and delete … From other than it the Mudari' letter, you will suffice.\n29 - And the silent one, join it with a broken Hamza … If the coming [verb] is opened, likewise if broken.\n30 - And join it from what is joined originally, and anomalous is … The deletion of it from 'kul' and 'mur' and 'sal' and 'khudh'.\n\nChapter on the Active Participle and Passive Participle\n31 - 'Fa'ula' with Damma, 'Fa'il' [or] 'Fa'l' … Is the Active Participle for it, like \"Zaydun Sahlun\".\n32 - And 'Fa'il' for 'Fa'ila' with Kasra, perpetuate … Like 'Af'al', 'Fa'lan' if it was intransitive.\n33 - And 'Fa'il' for the open 'Fa'ala' and the … Broken if it is transitive; for other than this, it is transferred.\n34 - The weight of its Mudari' with a Miem joined … At its beginning, and break what follows the last.\n35 - And if you open it, then 'Maf'ul' you intend … And this weight from the Triliteral is consistent.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 76
  },
  {
    "serial_number": "6662945",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Chapter on Masdars\n36 - From 'Fa'ula' the joined, the measurement of the Masdar … Is 'Fa'alah' [and] 'Fu'ulah', mention for it.\n37 - And 'Fa'ila' the broken, intransitive, 'Fa'al' … Its analogy is 'Fa'l' for the falling [transitive] that occurred.\n38 - And 'Fa'ala' the opened, from it the Masdar … Is 'Fa'l'; 'Fu'ul' in intransitive is mentioned.\n39 - And 'Fa'il' came like 'dabib', and 'Fu'al' … Like 'surakh', 'Fa'alan' for transition.\n40 - And 'Fa'lah' for an instance like 'Khalsah' … And 'Fi'lah' for a manner like 'Khilsah'.\n\nChapter on Masdars of Non-Triliteral Verbs\n41 - The non-triliteral, if started with a Wasl … Its third break, and extend what is after.\n42 - And the 'Ain' of its weak one is deleted decisively … And the compensation of a 'Ta' is often, from it, found.\n43 - And what begins with 'Ta', if sound, obligated … Is Damma for what is before the last, known.\n44 - And break it from its weak one, and 'Fa'lala' … Its Masdar is 'Fa'lalah' like 'Hawqala'.\n45 - And 'Fa''ala' the Masdar is 'Taf'il', and this … If it is weak, 'Taf'ilah' for it, take.\n46 - And 'Taf'al' came for abundance for it … (For 'Fa'ala', 'Fi'al' and 'Mufa'alah').\n\nChapter on the Construction of 'Maf'al' and 'Maf'il'\n47 - What does not have a necessary breaking for its coming [verb] … Then from it 'Maf'al' with Fatha is marked.\n48 - And break it from the Waw-initial absolutely … Except for the weak [ending], then release the opening.\n49 - And other than what passed of the broken … Is opened in the Masdar without falsehood.\n50 - And break it from the Adverb of Time and Place … And other than this, its anomaly is clear.\n51 - The non-triliteral like 'Muf'al' comes … Like 'Mukram' and 'Mudkhal' and 'Mukhraj'.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 77
  },
  {
    "serial_number": "6662946",
    "category_id": "31",
    "category": "Grammar and Morphology",
    "book_title": "Fath al-Karim al-Latif in Explaining 'Bakurat al-Ta'rif bi-l-Muhimm min al-Tasrif' by Sheikh Muhammad Hammad bin Ahmed Al-Shanqiti",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Chapter on Construction of the Noun of Land\n52 - 'Maf'alah' with Fatha with 'Maf'ah' … For abundance in the land, by analogy it comes.\n53 - And 'Af'alat', 'Muf'ilah' with Damma for it … The non-triliteral, rarely, make it with it.\n\nChapter on the Construction of the Instrument\n54 - And for building the Instrument 'Mif'al' appeared … 'Mif'al' or 'Mif'alah', for it, is consistent.\n55 - And anomalous is Damma in 'Muduqq', 'Munsul' … 'Mukhulah', 'Mudhun' and 'Mus'ut', 'Munkhul'.\n56 - And whoever intends the action, permissible is the analogy for him … And praise be to Allah, the High, completing it.\n57 - Then His blessings upon the one He sent … And his Companions and the Followers, the Perfect ones.\n58 - Its number is \"Zana\" and I ask the High … A good conclusion and forgiveness of the slip.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 78
  }
]