[
  {
    "text": "The Prayer of the Two Eids in the Musalla is the Sunnah\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4763\nbook_title: صلاة العيدين في المصلى هي السنة\nbook_link: https://shamela.ws/book/11273\nbook_id: 11273\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتب الإسلامي\nedition: الطبعة الثالثة 1406هـ/1986\npages: 48\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4630628",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues. Book: The Prayer of the Two Eids in the Musalla is the Sunnah. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Office. Edition: Third Edition 1406 AH / 1986. Number of Pages: 48 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Prayer of the Two Eids in the Musalla is the Sunnah. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Office. Edition: Third Edition 1406 AH / 1986. Number of Pages: 48 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Office. Edition: Third Edition 1406 AH / 1986. Number of Pages: 48 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 3
  },
  {
    "serial_number": "4630629",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction... In the name of Allah, the Most Gracious, the Most Merciful, and in Him we seek help. Praise be to Allah alone, and His blessings and peace be upon our Prophet Muhammad, his family, his companions, and whoever holds fast to his guidance and remains steadfast on his path until the Day of Judgment (1). As for what follows: This is our treatise today, and its subject is establishing that: The Prayer of the Two Eids in the Musalla (open prayer ground) outside the town is the Sunnah. I had thought about making it a comprehensive treatise for the rulings of the prayer of the Two Eids, similar to the treatise \"Salat al-Tarawih\".",
    "foot_note": "1. 1 Our teacher, the Muhaddith Sheikh Nasir al-Din al-Albani, had introduced this treatise with words regarding the refutation of the treatise \"Al-Isabah\" and the ignorance, deviations, and fabrications against the followers of the Sunnah contained therein. And concerning the Tarawih prayer and that it is eleven Rak'ahs. We have restricted ourselves to the subject specific to the Eid prayer in the Musalla. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 4
  },
  {
    "serial_number": "4630630",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 4,
    "volume_number": 1,
    "text": "However, time overtook me, as there were only a few days remaining until Eid al-Fitr (1), and therefore I was compelled to restrict it to this subject which I mentioned, hoping from Allah, Blessed and Exalted, to facilitate for me soon the production of the comprehensive treatise and its publication to the people, hoping that they accept our treatises with good acceptance. Perhaps I may attain from them a righteous supplication in the unseen that will benefit me, Allah willing, {The Day when there will not benefit [anyone] wealth or children * But only one who comes to Allah with a sound heart} (2). Know, O noble reader: That those authors had blackened two large pages in their treatise \"Al-Isabah\" (pages 14-15) \"regarding the subject of Eid prayer in the Musalla,\" in which they contradicted themselves in a shameful manner from which the reader can discern {the extent of their knowledge}. They had fabricated against us in that treatise of theirs, claiming that we say: The Eid prayer in the mosques is not valid! For they said: \"The reason for the Prophet, may Allah bless him and grant him peace, choosing to pray it in the Musalla was due to the lack of 'so and so' availability of reasons in the Illuminated Medina, where there was no mosque in Medina other than one mosque.\" This is extreme ignorance, for the mosques that existed in Medina during his era, may Allah bless him and grant him peace, were many and well-known, the most famous being \"Masjid Quba\", \"Masjid al-Qiblatayn\", and \"Masjid al-Fath\". regarding these mosques, there are many authentic narrations in the books of Sunnah, and Al-Hafiz mentioned in \"Al-Fath\" (1/445) other mosques by their names, so whoever wishes may refer to it. Their intent behind this false claim is to find a means to nullify the Sunnah of Eid prayer in the Musalla by fabricating this lying excuse, which is: \"That Medina did not have any mosque other than his mosque, may Allah bless him and grant him peace.\" And that it, according to their claim, did not accommodate the worshipers for the Eid prayer!",
    "foot_note": "1. 1 This was in its first edition in the year 1373 AH in Damascus. Likewise, time overtook us with this edition, so we were unable to contact our teacher, the author, so that he might add to it. But Allah decreed, and what He willed He did. We hope to rectify that to reprint it soon, Allah willing. 2 Surah Al-Shu'ara: Verses 88–89.",
    "book_id": "11273",
    "new_page_number": 5
  },
  {
    "serial_number": "4630631",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 5,
    "volume_number": 1,
    "text": "So here we have proven the invalidity of this excuse by the invalidity of the claim from its foundation. In that case, we say: If we assume that the Prophet's Mosque was not spacious enough for them, it was possible for them to pray in those many mosques as people do today. So his leaving the prayer in them in favor of prayer in the Musalla is a clear proof that the Sunnah is the prayer in it (the Musalla) and not the mosques. Thus the intended meaning is established, and what they aimed for regarding the nullification (of the Sunnah) is invalidated. Then they said: \"And when the Muslims increased in number such that it became impossible for the Muslims to gather in the Musalla, especially in major cities like Damascus due to the large number of worshipers, they began to gather in the mosques according to need\"! I say: Look, O noble reader, at this inverted logic, where they made the gathering of Muslims in the Musalla impossible, while it is easy and facilitated. The proof of this is that it has been practiced in most regions, as Imam Al-Nawawi said in",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 6
  },
  {
    "serial_number": "4630632",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 6,
    "volume_number": 1,
    "text": "\"Sharh Muslim\" (Explanation of Muslim), and the text of his speech will come in the section \"The indication of the Hadiths that the Sunnah is prayer in the Musalla.\" To this day, this Sunnah is still established by the grace of Allah in many Islamic lands such as Damascus, Jordan, Egypt, Algeria, Pakistan, and others. Furthermore, what need is there to disperse the congregation of Muslims into these many mosques, the large of them and the small, scattered everywhere, which are sometimes close to each other to the degree that there is not between them except a distance of fifty steps or less! Had these authors restricted their speech to prayer in the single largest mosque (Masjid Jami'), they would have had a predecessor in this opinion, as will come from Imam Al-Shafi'i, may Allah have mercy on him. But they do not hesitate to say what no Muslim before them has ever said absolutely, for the sake of fighting the Sunnah. Otherwise, the Muslims are all agreed that prayer in the Musalla is the Sunnah if the mosque does not accommodate them. And the majority of them did not accept this condition; rather, they said: Even if the mosque accommodated them. So by their ignorance, they have opposed",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 7
  },
  {
    "serial_number": "4630633",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 7,
    "volume_number": 1,
    "text": "all the Muslims, their predecessors and their successors. And Allah the Exalted says: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination} (1). So the Sunnah, the Sunnah, O people! Then they said: \"...according to need, due to the action of the Prophet, may Allah bless him and grant him peace, when he prayed in the mosque for an excuse.\" Then they mentioned in the commentary the Hadith of Abu Huraira regarding his prayer, may Allah bless him and grant him peace, in the mosque due to the excuse of rain. The answer is that the Hadith of Abu Huraira—if authentic—is an argument for us, because its implication is that were it not for the excuse of rain, he would have prayed in the Musalla. And no Muslim disagrees with you on this. For your previous speech focuses entirely on the saying that prayer in the Musalla is not legislated now because it is impossible according to your claim. We have refuted you, so the Hadith returns as an argument against you, not for you. And all this is said assuming the Hadith is authentic, while it is not correct; rather, its chain is weak as will be explained. And the rest of your speech is nonsense that does not deserve an answer, except their saying after",
    "foot_note": "1. 1 Surah An-Nisa: Verse 115.",
    "book_id": "11273",
    "new_page_number": 8
  },
  {
    "serial_number": "4630634",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 8,
    "volume_number": 1,
    "text": "they quoted the first Hadith from Abu Sa'id which will come, and the Hadith of Abu Huraira: \"So it is derived from the two Hadiths that it is valid in the Musalla and in the mosque, and that in both there is reward. Just as it is derived from the first Hadith that it is better to pray it in the desert due to the persistence of the Prophet, may Allah bless him and grant him peace, on that.\" I say: So look at them, O noble reader, how they returned to the correct view which we call for, and thereby they contradicted their previous speech with us. But do you think they will settle on it? No, for they returned to where they started. They said, after quoting from Al-Hafiz Ibn Hajar the speech of Imam Al-Shafi'i which will come: \"So whoever examines closely what preceded along with the Hadith of Al-Bukhari (1) from Umm Atiyya: 'The Messenger of Allah, may Allah bless him and grant him peace, commanded us to bring them out on al-Fitr and al-Adha: the adolescent girls, the menstruating women,",
    "foot_note": "1. 1 I say: Attributing it to Al-Bukhari with the following wording is a mistake; rather, it belongs to Muslim (3/20-21 – Istanbul).",
    "book_id": "11273",
    "new_page_number": 9
  },
  {
    "serial_number": "4630635",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 9,
    "volume_number": 1,
    "text": "and the secluded women. As for the menstruating women, they should withdraw from the prayer'. And in a wording 'the Musalla', 'and they witness the good and the supplication of the Muslims'. It is known that the reason for the persistence of the Messenger of Allah, may Allah bless him and grant him peace, on praying in the Musalla is: either because his mosque, may Allah bless him and grant him peace, did not accommodate the men and women on those two days, or that the mosque is not suitable for the presence of menstruating women.\" I say: We have contemplated all this speech and found it futile like the rest of their speech! For if we concede that his mosque, may Allah bless him and grant him peace, did not accommodate the men and women, then the matter is likewise in our mosques; not one of them accommodates all the worshipers. Thus, the legitimacy of going out to the Musalla remains effective, and this is what is sought. Then, if the mosque is not suitable according to them for the presence of menstruating women, it is an admission from them that the Musalla is suitable for their presence. So if they commit to praying in the mosque, they have prevented them from \"witnessing the good and the supplication of the Muslims\".",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 10
  },
  {
    "serial_number": "4630636",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 10,
    "volume_number": 1,
    "text": "And this contradicts the command of the Messenger of Allah, may Allah bless him and grant him peace, in the Hadith which they attributed to Al-Bukhari. For the Hadith is one of our evidences that the prayer should be in the Musalla, not in the mosque, because the mosque, no matter how big, cannot accommodate the presence of both genders according to their admission? And among our arguments against them is their saying: \"And the women used to go out to the Musalla, even the menstruating women, saying Takbir along with their Takbir.\" So we ask them: How can you realize this Sunnah in the mosques? You have no way to do that except by preventing them from attending absolutely, and this contradicts his command, may Allah bless him and grant him peace, as preceded. As for ordering them to attend outside the mosque and from behind its walls and fences, how can they, in this case, say Takbir along with their Takbir?! So reflect, O Muslim brother, on what ignorance does to its owner, and take lesson. \"Alert\": It has become clear from what we quoted from those authors that they state the legitimacy of women going out to the Musalla even if they are",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 11
  },
  {
    "serial_number": "4630637",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 11,
    "volume_number": 1,
    "text": "young women, because they are \"the adolescents\" (Al-Awatik). So memorize this, for perhaps a day will come when these authors rush to deny what they admitted if they see the supporters of the Sunnah practicing that, out of envy and oppression from themselves! This, and although we encourage women to attend the congregation of Muslims in fulfillment of the command of the Master of Messengers, may Allah bless him and grant him peace, we do not miss drawing their attention and the attention of those responsible for them to the obligation of adhering to the legislative Hijab which does not permit them to reveal from their bodies anything except the face and the hands, according to what I detailed in my book \"The Hijab of the Muslim Woman in the Quran and Sunnah\". And Allah the Blessed and Exalted says: {O Prophet, tell your wives and your daughters and the women of the believers to bring down over themselves [part] of their outer garments. That is more suitable that they will be known and not be abused. And ever is Allah Forgiving and Merciful}. [Surah Al-Ahzab: Verse 59]. Along with our declaration there that it is better for them to cover them (face and hands) as well, contrary to what some authors who do not fear the Lord of the Worlds attributed to me. And some might find the opinion of the legitimacy of women going out to the Musalla for the prayer of the Two Eids strange, so let them know: That this is the truth",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 12
  },
  {
    "serial_number": "4630638",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 12,
    "volume_number": 1,
    "text": "about which there is no doubt due to the abundance of Hadiths reported regarding that. Suffice us now the Hadith of Umm Atiyya mentioned previously, for it is not only a proof for legitimacy but also for the obligation of that upon them due to his command, may Allah bless him and grant him peace, regarding it, and the default rule in a command is obligation. It is supported by what Ibn Abi Shaybah narrated in \"Al-Musannaf\" (2/184) from Abu Bakr Al-Siddiq that he said: \"It is a duty upon every woman possessing a sash (Dhat Nitaq) - 'like a waist-wrapper with a tie' - to go out to the Two Eids.\" And its chain is authentic. So does the one who claims to support the Rightly Guided Caliphs say this, when the first of them has said it as you see it extracted and authenticated? That is not what we think of them, so let them prove our thought wrong—which is more beloved to us—otherwise, their purpose from their claimed support has become clear to the people. And the opinion of obligation is what Al-San'ani deemed apparent in \"Subul al-Salam\", as well as Al-Shawkani and Siddiq Khan. It is the apparent meaning of Ibn Hazm's speech, and it seems Ibn Taymiyyah inclined towards it in his \"Ikhtiyarat\", and Allah knows best. The first (1) \"pp. 9-10\", its summary is that we say:",
    "foot_note": "1. 1 It is his treatise \"Min Tasdid Al-Isabah ila man Za'ama Nusrat al-Khulafa' al-Rashidin wa as-Sahabah\" (Directing the Hit towards the one who Claimed to Support the Rightly Guided Caliphs and the Companions).",
    "book_id": "11273",
    "new_page_number": 13
  },
  {
    "serial_number": "4630639",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 13,
    "volume_number": 1,
    "text": "Indeed the Sunnah is the Eid prayer in the Musalla, with its permissibility in the mosques. And I promised there to verify the statement in this treatise. So the time to fulfill that has come, so I say:",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 14
  },
  {
    "serial_number": "4630640",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 14,
    "volume_number": 1,
    "text": "His persistence, may Allah bless him and grant him peace, on the Eid prayer in the Musalla and the Hadiths regarding that. More than one of the verifying Hafiz scholars mentioned \"that his guidance, may Allah bless him and grant him peace, regarding the prayer of the Two Eids was always performing them in the Musalla\" (1). This is supported by the many Hadiths that have been reported regarding that in the Two Sahihs, the Sunan, the Masanid, and others from very many paths. So some of them must be mentioned in this haste so that the noble reader may see the correctness of what I mentioned. So I say: First Hadith: From Abu Sa'id Al-Khudri, may Allah be pleased with him, who said: \"The Messenger of Allah, may Allah bless him and grant him peace, used to go out on the day of Al-Fitr",
    "foot_note": "1. 1 See \"Zad al-Ma'ad\" (1/172) and \"Fath al-Bari\" (2/361), and his speech on that will come shortly. And \"Mukhtasar Zad al-Ma'ad\" by Sheikh Muhammad bin Abdul Wahhab page 44, verification by Zuhair al-Shawish, printed by the Islamic Office.",
    "book_id": "11273",
    "new_page_number": 15
  },
  {
    "serial_number": "4630641",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 15,
    "volume_number": 1,
    "text": "and Al-Adha to the Musalla (1). So the first thing he would begin with was the prayer. Then he would turn away and stand facing the people, while the people were sitting in their rows. He would admonish them, advise them, and command them. If he wanted to cut off a detachment (send an expedition), he would cut it off (2), or order something, he would order it, then he would depart. Abu Sa'id said: The people did not cease to be upon that...\" Narrated by Al-Bukhari (2/259-260), Muslim (3/20), Al-Nasa'i (1/234), Al-Mahamili in \"Kitab al-Eidain\" (Vol 2 No. 86 from my copy in my handwriting), Abu Nu'aym in his \"Mustakhraj\" (2/10/2), and Al-Bayhaqi in his Sunan (3/280).",
    "foot_note": "1. 1 Al-Hafiz said: \"It is a known place in Medina; between it and the door of the Mosque is a thousand cubits.\" Ibn al-Qayyim said: \"It is the Musalla where the Mahmal of the Haji is placed.\" I say: It seems it was towards the eastern side of the Prophet's Mosque near the Baqi' cemetery as derived from the third Hadith coming up. 2 Meaning he dispatches a group from the army to a specific direction. \"Fath\". I say: In this is a strong indication that the Eid sermon is not restricted to preaching and guidance only, but it includes reminding and directing towards everything that achieves the interests of the Ummah.",
    "book_id": "11273",
    "new_page_number": 16
  },
  {
    "serial_number": "4630642",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 16,
    "volume_number": 1,
    "text": "Second Hadith: From Abdullah bin Umar, may Allah be pleased with them both, who said: \"He, may Allah bless him and grant him peace, used to go early to the Musalla on the day of Eid, and the 'Anazah' (1) would be carried before him. When he reached the Musalla, it would be set up in front of him, and he would pray towards it. That is because the Musalla was an open space with nothing in it to screen him.\" Narrated by Al-Bukhari (1/354), Muslim (2/55), Abu Dawud (1/109), Al-Nasa'i (1/232), Ibn Majah (1/392), and Ahmad (No. 6296). The wording belongs to Ibn Majah and is more complete, and its chain is authentic. It was also narrated by Al-Mahamili in (2 No. 26-36), Abu Al-Qasim Al-Shahhami in \"Tuhfat al-Eid\" (No. 14-16 from my copy in my son's handwriting), and Al-Bayhaqi (3/284-285). Third Hadith: From Al-Bara' bin Azib who said: \"The Prophet, may Allah bless him and grant him peace, went out on the day of Adha to",
    "foot_note": "1. 1 In \"Al-Nihayah\": \"The 'Anazah' is like half a spear or slightly larger, and it has a head like the spearhead, and the 'Ukkazah' (staff) is close to it.\"",
    "book_id": "11273",
    "new_page_number": 17
  },
  {
    "serial_number": "4630643",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 17,
    "volume_number": 1,
    "text": "Al-Baqi' (1) 'and in a narration: The Musalla', so he prayed two Rak'ahs, then he turned his face towards us and said: 'Indeed the first of our rituals (Nusk) (2) on this day of ours is that we begin with the prayer, then we return and sacrifice (Nahr). So whoever does that has accorded with our Sunnah, and whoever slaughters before that, then it is only something he hastened for his family, it is not of the Ritual (Nusk) in anything'.\" Narrated by Al-Bukhari (2/372) and the context is his, Ahmad (4/282), and Al-Mahamili (2 No. 90, 96). The other narration belongs to them with a good (Hasan) chain. Fourth Hadith: From Ibn Abbas, it was said to him: Did you witness the Eid with the Prophet, may Allah bless him and grant him peace? He said: Yes, and were it not for my position of young age, I would not have witnessed it, until he came to the mark which is at the house of Kathir bin Al-Salt (3), so he prayed, then delivered the sermon",
    "foot_note": "1. 1 It is Baqi' al-Gharqad: It was named so because of the roots of the Gharqad thorn that were in it, and it is the cemetery of Medina. There is more than one Baqi' in Medina, but the famous one is Baqi' al-Gharqad. \"Zuhair\". 2 Al-Nusk: Obedience and worship. \"Nihayah\". 3 Al-Hafiz said: \"Defining the Musalla by being at the house of Kathir bin Al-Salt is by way of approximation for the listener, otherwise the house of Kathir bin Al-Salt was built after the Prophet, may Allah bless him and grant him peace. It appears from this Hadith: That they made a thing for his prayer place by which it is known, and that is what is meant by the 'Alam' (mark/sign)—with two Fathas—the prominent object.\"",
    "book_id": "11273",
    "new_page_number": 18
  },
  {
    "serial_number": "4630644",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 18,
    "volume_number": 1,
    "text": "then he came to the women, and with him was Bilal, so he admonished them, reminded them, and commanded them with charity (1). So I saw them reaching with their hands, casting it (jewelry/charity) into the garment of Bilal. Then he departed, he and Bilal, to his house. Narrated by Al-Bukhari (2/373) and the context is his, Muslim (2/18-19), Ibn Abi Shaybah (2/3/2), Al-Mahamili (No. 38, 39), Al-Firyabi (No. 85, 93), Abu Nu'aym in his \"Mustakhraj\" (2/8/2 - 9/1). Muslim added in his narration from Ibn Jurayj: I said to Ata: Is it a duty upon the Imam now to come to the women when he finishes and remind them? He said: Yes, by my life, indeed that is a duty upon them, and what is wrong with them that they do not do that?",
    "foot_note": "1. 1 As for now, there is no need for a special admonition for women because they are the counterparts of men, and the address and admonition are one for men and women. Likewise, due to the presence of multiple loudspeakers in every mosque and Jami'. And they are usually brought to the Eid prayer places. Yes, and it is requested from the Khatib (preacher) to consider the interest of women regarding types (of advice) they are more in need of than men in his comprehensive sermon. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 19
  },
  {
    "serial_number": "4630645",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 19,
    "volume_number": 1,
    "text": "The Indication of the Hadiths that the Sunnah is the Prayer in the Musalla. If you have known these Hadiths, they are a decisive proof that the Sunnah in the prayer of the Two Eids is that they be performed in the Musalla. And the majority of scholars have stated this. In \"Sharh al-Sunnah\" by Imam Al-Baghawi: The Sunnah is that the Imam goes out for the prayer of the Two Eids except for an excuse, in which case he prays in the mosque (1), meaning: a mosque inside the town. Imam Muhyiddin Al-Nawawi said in \"Sharh Muslim\" when discussing the first Hadith: This is a proof for those who say it is recommended to go out for Eid prayer to the Musalla and that it is better than performing it in the mosque. And upon this the people have acted in most regions. As for the people of Mecca, they do not",
    "foot_note": "1. 1 Rather, the majority reasoned that the location of Mecca, may Allah honor it, is between mountains, and therefore there is no square close to the dwellings closer than the courtyard of the Sacred House... and it is a plausible reasoning.",
    "book_id": "11273",
    "new_page_number": 20
  },
  {
    "serial_number": "4630646",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 20,
    "volume_number": 1,
    "text": "pray it except in the Mosque from early times. And for our companions (Shafi'is) there are two views: The first: The desert is better due to this Hadith. The second, which is the more correct according to most of them: The mosque is better unless it is narrow. They said: The people of Mecca only prayed in the Mosque due to its spaciousness, and the Prophet, may Allah bless him and grant him peace, only went out to the Musalla due to the narrowness of the mosque. Thus indicating that the mosque is better if it is spacious (1).",
    "foot_note": "1. 1 Rather, the majority reasoned that the location of Mecca, may Allah honor it, is between mountains, and therefore there is no square close to the dwellings closer than the courtyard of the Sacred House... and it is a plausible reasoning. As for reasoning by merit (of the place), it is not accepted: because his mosque, may Allah bless him and grant him peace, has established merit, yet he did not pray in it except for an excuse. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 21
  },
  {
    "serial_number": "4630647",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 21,
    "volume_number": 1,
    "text": "Refutation of reasoning the prayer in the Musalla by the cause of the mosque's narrowness. Thus they said, and in it is a clear questionable point. For were the matter as they said, the Prophet, may Allah bless him and grant him peace, would not have persisted in performing it in the Musalla, because he does not persist except on the best. And the statement: That he only did that due to the narrowness of the mosque is a claim with no evidence upon it. It is supported (refuted?) by the fact that he, may Allah bless him and grant him peace, used to pray Jumu'ah (Friday prayer) in the mosque, and people used to come to him from the outskirts (Awali) of Medina and other places, and he would lead them in Jumu'ah in it. And no difference appears between the number of those who attend Jumu'ah among the Companions and those who attend the Two Eids such that it be said: It used to accommodate those but not these. Whoever claims otherwise, the burden of proof is upon him, and I do not think he is capable. And it supports what we mentioned that had the prayer of the Two Eids in",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 22
  },
  {
    "serial_number": "4630648",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 22,
    "volume_number": 1,
    "text": "the mosque been better than in the Musalla, and the mosque was narrow, he, may Allah bless him and grant him peace, would have hastened to expand it as some of the Caliphs did after him. For he, may Allah bless him and grant him peace, is more entitled to expand it than them if it did not accommodate it. So his leaving, may Allah bless him and grant him peace, of the expansion cannot be imagined while conceding the mentioned preference. Unless someone claims that there was an impediment, and I do not think a scholar would dare to make this claim. And if anyone did that, we would rush to him with the saying of Allah the Blessed and Exalted {Say, \"Produce your proof, if you should be truthful\"} (1). And it is strange that the Shafi'is: made the continuation of the Messenger, may Allah bless him and grant him peace, on performing Jumu'ah prayer in the single mosque a proof for the impermissibility of multiple Jumu'ahs in one town, yet they did not make his persistence, may Allah bless him and grant him peace, on performing the prayer of the Two Eids in the Musalla a proof for the preference of performing it in the Musalla over the mosque, while the evidence for the two issues is one as you see? And all this supports the first view of the two views mentioned by Imam Al-Nawawi, may Allah have mercy on him, in the school of the Shafi'i masters.",
    "foot_note": "1. 1 [Surah Al-Baqarah: Verse 111].",
    "book_id": "11273",
    "new_page_number": 23
  },
  {
    "serial_number": "4630649",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 23,
    "volume_number": 1,
    "text": "However, the disagreement between them is formal and not practical in the likes of the city of Damascus and similar large cities. Since the second view explicitly stated that the preference of prayer in the mosque is conditional on it accommodating all the worshipers, and such a mosque does not exist. So the two views agree then, as is the Madhhab of the majority of scholars, that the best is prayer in the Musalla. And Imam Al-Shafi'i, may Allah have mercy on him, has stated the dislike (Karahah) of prayer in the mosque in the case of its narrowness, as will come. Al-Hafiz Ibn Hajar Al-Asqalani said in \"Al-Fath\" (2/450 - Salafiyyah) under the first Hadith: It is deduced for the recommendation of going out to the desert for Eid prayer and that that is better than praying it in the mosque due to the persistence of the Prophet, may Allah bless him and grant him peace, on that despite the merit of his mosque. And Al-Shafi'i said in \"Al-Umm\": It has reached us that the Messenger of Allah, may Allah bless him and grant him peace, used to go out on the Two Eids to the Musalla in Medina, and likewise those after him, except for an excuse of rain or the like. And likewise the generality of the people of the lands, except the people of Mecca.",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 24
  },
  {
    "serial_number": "4630650",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Two Eid Prayers in the Open Area (Musalla) Are the Sunnah",
    "edition": "Third Edition, 1406 AH / 1986 CE",
    "publisher": "Al-Maktab Al-Islami",
    "page_number": 24,
    "volume_number": 1,
    "text": "The difference between the two opinions is merely formal and has no practical effect in cities such as Damascus and other large cities. This is because the second opinion explicitly states that praying in the mosque is preferable only if it can accommodate all the worshippers, and such a mosque does not exist. Thus, both views ultimately agree — as is the position of the majority of scholars — that praying in the open area (musalla) is better. Imam Al-Shafi‘i, may Allah have mercy on him, clearly stated the dislike of praying in the mosque when it is too small, as will be mentioned. Al-Hafiz Ibn Hajar Al-‘Asqalani said in *Fath al-Bari* (2/450 – Salafiyyah edition), commenting on the first hadith: \"From it is derived the recommendation of going out to the open area for the Eid prayer, and that doing so is better than praying it in the mosque, due to the Prophet’s consistent practice of doing so despite the virtue of his mosque.\" Al-Shafi‘i said in *Al-Umm*: \"It has reached us that the Messenger of Allah, peace and blessings be upon him, used to go out on the two Eids to the musalla in Madinah, and so did those after him—except when there was an excuse, such as rain or similar. Likewise, this is the practice of the people of most lands, except the people of Makkah.\"",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 25
  },
  {
    "serial_number": "4630651",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 25,
    "volume_number": 1,
    "text": "Then he indicated that the reason for that was the spaciousness of the Mosque and the narrowness of the outskirts of Mecca. He said: \"So if a town is populated and the mosque of its people accommodates them on the Eids, I do not see that they should go out from it. But if it does not accommodate them, I dislike praying in it, but there is no need to repeat the prayer\" (1). The implication of this is that the cause (Illah) revolves around narrowness and spaciousness, not for the sake of going out to the desert itself, because what is sought is achieving the general gathering. So if it is achieved in the mosque, with its superiority, it is more appropriate. Imam Al-Shawkani critiqued this by saying (3/248): \"In this is that [claiming] the cause is narrowness and spaciousness is merely a guess that does not stand as an excuse for not emulating him, may Allah bless him and grant him peace, in going out to the Jabbanah (2) after admitting his persistence, may Allah bless him and grant him peace, on that. As for using the performance of the prayer",
    "foot_note": "1. 1 Al-Umm \"1 / 207\" and the text of his speech will come on \"p. 33\". 2 Al-Jabbanah: It is originally the desert, then it was applied to graveyards because they are usually located there; this is from the chapter of naming a thing by its location. Likewise is Al-Jabban. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 26
  },
  {
    "serial_number": "4630652",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 26,
    "volume_number": 1,
    "text": "in the Mosque of Mecca as evidence that this is the cause, it is answered by the probability that the abandonment of going out to the Jabbanah was due to the narrowness of the outskirts of Mecca, not due to the spaciousness of its Mosque.\" I say: This probability mentioned by Imam Al-Shawkani was alluded to by Imam Al-Shafi'i himself, as Al-Hafiz said in what I quoted from him earlier. The text of Imam Al-Shafi'i's speech in \"Al-Umm\" (1/207) is: \"I only said this because it was so, and they do not have such space in the outskirts of the houses in Mecca, a large space.\" This supports what Al-Shawkani, may Allah have mercy on him, went towards, that reasoning his abandonment, may Allah bless him and grant him peace, of prayer in the mosque due to its narrowness is merely a guess, so it is worthy of rejection! One might argue for that cause (narrowness) with what Al-Bayhaqi narrated in \"Al-Sunan Al-Kubra\" (3/310) via the path of Muhammad bin Abdul-Aziz bin Abdur-Rahman from Uthman bin Abdur-Rahman Al-Taymi who said: It rained heavily on us during the emirate of Aban bin Uthman over Medina on the night of Al-Fitr, so he gathered the people in the mosque and did not go out to the Musalla where Al-Fitr and Al-Adha are prayed.",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 27
  },
  {
    "serial_number": "4630653",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 27,
    "volume_number": 1,
    "text": "Then he said to Abdullah bin Amir bin Rabi'ah: \"Stand and inform the people what you informed me.\" So Abdullah bin Amir said: \"The people were rained upon during the era of Umar bin Al-Khattab, may Allah be pleased with him, so the people were prevented from the Musalla. Thus Umar gathered the people in the mosque and led them in prayer. Then he stood on the pulpit and said: 'O people, the Messenger of Allah, may Allah bless him and grant him peace, used to go out with the people to the Musalla to lead them in prayer because it was gentler for them and more spacious for them, and because the mosque did not accommodate them.' He said: 'So if there is this rain, the mosque is gentler.'\" The Answer: This narration is very weak because this Muhammad bin Abdul-Aziz is Muhammad bin Abdul-Aziz bin Umar bin Abdur-Rahman bin Awf, the Judge. Al-Bukhari said: \"Munkar al-Hadith\" (Denounced in Hadith). Al-Nasa'i said: \"Matruk\" (Abandoned). Al-Shafi'i extracted it in \"Al-Umm\" (1/207) from another path from Aban without the Marfu' (Prophetic) hadith and the Mawquf reasoning. However, its chain is also very weak because it is from the narration of Ibrahim, the Sheikh of Al-Shafi'i, and he is Ibrahim bin Muhammad bin Abi Yahya Al-Aslami,",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 28
  },
  {
    "serial_number": "4630654",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 28,
    "volume_number": 1,
    "text": "and he is a liar (Kadhdhab). Malik said: He was not trustworthy in hadith nor in his religion. Therefore, Al-Hafiz said about him in \"Al-Taqrib\": \"Matruk\" (Abandoned). Thus, the invalidity of reasoning by the narrowness of the mosque is established from what has preceded. And the opinions of the scholars who asserted that prayer in the Musalla is the Sunnah, and that it is legislated in every time and place except for necessity, are preponderant. I do not know of any of the independent scholars—whose opinion counts—who disagreed with that. Ibn Hazm said in \"Al-Muhalla\" (5/81): \"The Sunnah of the prayer of the Two Eids is that the people of every village or city go out to a wide open space in the presence of their homes in the forenoon after the whitening of the sun and at the beginning of the permissibility of voluntary prayer.\" Then he said (p. 86): \"And if there is hardship upon them in going out to the Musalla, they pray in congregation in the Jami' (Mosque).\" Then he said (p. 87): \"We have narrated from Umar and Uthman, may Allah be pleased with them both: That they prayed Eid with the people in the mosque due to rain that fell on the day of Eid. And the Messenger of Allah, may Allah bless him and grant him peace, used to go out to the Musalla for the prayer of the Two Eids. So this is better, and other than it suffices because it is an action, not a command.\" And with Allah is success.",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 29
  },
  {
    "serial_number": "4630655",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 29,
    "volume_number": 1,
    "text": "The virtuous professor Sheikh Ahmad Muhammad Shakir (1), the famous Muhaddith, has a good and beneficial research on Eid prayer in the Musalla and on women going out to it. I saw fit to quote it from him due to the benefits it contains. He said, may Allah have mercy on him, in his commentary on Al-Tirmidhi (2/421-424) after pointing to the first Hadith and mentioning the saying of Ibn Jurayj to Ata mentioned in the fourth Hadith: \"Is it a duty upon the Imam to come to the women when he finishes and remind them? He said: Yes, by my life...\" Sheikh Ahmad said: The sayings of the scholars have concurred on that. The scholar Al-Ayni Al-Hanafi said in \"Sharh Al-Bukhari\" while deducing from the hadith of Abu Sa'id (Vol 6, p 280-281): \"In it is the going out to the Musalla and leaving towards it, and one does not pray in the mosque except due to necessity.\"",
    "foot_note": "1. 1 He is my teacher, the grand scholar, the Muhaddith, the Mujtahid, the Judge, author of many beneficial works. He was born in Cairo in the year 1309 and died therein in the year 1377. May Allah cover him with His mercy. He is from a family of knowledge, virtue, chivalry, and defense of the Sunnah. From this family is his father, the scholar Sheikh Muhammad Shakir, the Sheikh of the scholars of Alexandria, and his brother, the grand scholar, the Sheikh of Islamic literati in this era, Mahmoud Muhammad Shakir, author of beneficial works and investigations. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 30
  },
  {
    "serial_number": "4630656",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 30,
    "volume_number": 1,
    "text": "Ibn Ziyad narrated from Malik that he said: \"The Sunnah is going out to the Jabbanah (desert/open ground) except for the people of Mecca, for [it is] in the Mosque.\" In Al-Fatawa Al-Hindiyyah (Vol 1, p 118): \"Going out to the Jabbanah for Eid prayer is Sunnah, even if the Jami' Mosque accommodates them; upon this are the Sheikhs and it is the correct view.\" In \"Al-Mudawwanah\" narrated from Malik (Vol 1, p 171): Malik said: \"He does not pray the Two Eids in two places, and they do not pray in their mosque, but they go out just as the Prophet, may Allah bless him and grant him peace, went out.\" Ibn Wahb from Yunus from Ibn Shihab who said: \"The Messenger of Allah, may Allah bless him and grant him peace, used to go out to the Musalla, then the people of the cities adopted that as Sunnah.\" Ibn Qudamah Al-Hanbali said in Al-Mughni (Vol 2, p 229-230): \"The Sunnah is to pray Eid in the Musalla. Ali commanded that",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 31
  },
  {
    "serial_number": "4630657",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 31,
    "volume_number": 1,
    "text": "may Allah be pleased with him, and Al-Awza'i and the People of Opinion (Ashab al-Ra'y) approved it. It is the saying of Ibn Al-Mundhir. It was narrated from Al-Shafi'i: 'If the town's mosque is spacious, then prayer in it is more appropriate because it is the best of places and the purest. Therefore, the people of Mecca pray in the Sacred Mosque.' Our argument is that the Prophet, may Allah bless him and grant him peace, used to go out to the Musalla and leave his mosque, and likewise the Caliphs after him. The Prophet, may Allah bless him and grant him peace, would not leave the better option while it is close and burden himself with doing the lesser option while it is far, nor would he legislate for his Ummah the abandonment of virtues. Also because we are commanded to follow the Prophet, may Allah bless him and grant him peace, and emulate him. It is not permissible that what is commanded is the deficient and what is forbidden is the perfect. And it has not been reported from the Prophet, may Allah bless him and grant him peace, that he prayed Eid in his mosque except due to an excuse. And because this is the consensus of the Muslims, for people in every era and city go out to the Musalla despite the spaciousness or narrowness of the mosque. And the Prophet, may Allah bless him and grant him peace, used to pray in the Musalla despite the honor of his mosque.\" I say: The saying of Ibn Qudamah 'And it has not been reported from the Prophet",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 32
  },
  {
    "serial_number": "4630658",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 32,
    "volume_number": 1,
    "text": "may Allah bless him and grant him peace, that he prayed Eid in his mosque except due to an excuse' refers to the hadith of Abu Huraira in Al-Mustadrak by Al-Hakim (Vol 1, p 295): 'That rain befell them on a day of Eid, so the Prophet, may Allah bless him and grant him peace, led them in prayer in the mosque.' He and Al-Dhahabi authenticated it (1).",
    "foot_note": "1. 1 I say: In this authentication, there is a clear questionable point. For its pivot according to Al-Hakim is upon Isa bin Abdul-A'la bin Abi Farwa, that he heard Abu Yahya Ubaydullah Al-Taymi narrating it from Abu Huraira. Likewise, Abu Dawud (1/180), Ibn Majah (1/394), and Al-Bayhaqi (3/210) narrated it. This is a weak, unknown chain. This Isa is unknown (Majhul) as Al-Hafiz said in \"Al-Taqrib\". Similarly, his Sheikh Abu Yahya, who is Ubaydullah bin Abdullah bin Mawhab, is of unknown status (Majhul al-Hal). Al-Dhahabi said in \"Mukhtasar Sunan Al-Bayhaqi\" (1/160/I say): \"Ubaydullah is weak.\" And he said in the biography of the narrator from him in \"Al-Mizan\": \"He is hardly known, and this is a Munkar (denounced) hadith.\" I say: So Al-Hakim's agreement on the authentication of the hadith in \"Talkhis Al-Mustadrak\" is among his many mistakes in it which we hope will be forgiven. Therefore, Al-Hafiz asserted in \"Talkhis Al-Habir\" (p. 144) and in \"Bulugh Al-Maram\" (2/99) that \"Its chain is weak.\" So Al-Nawawi's statement in \"Al-Majmu'\" (5/5): \"Its chain is Jayyid (good)\" is not good. It seems he relied on Abu Dawud's silence regarding it, and this is of no consequence, for Abu Dawud often remains silent on what is clearly weak as mentioned in \"Al-Mustalah\" (Science of Hadith Terminology), and I clarified it in my book \"Sahih Sunan Abi Dawud\".",
    "book_id": "11273",
    "new_page_number": 33
  },
  {
    "serial_number": "4630659",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 33,
    "volume_number": 1,
    "text": "Imam Al-Shafi'i said in Kitab Al-Umm (Vol 1, p 207): \"It has reached us that the Messenger of Allah, may Allah bless him and grant him peace, used to go out on the Two Eids to the Musalla in Medina, and likewise those who came after him, and the generality of the people of the cities except Mecca. For it has not reached us that anyone from the Salaf prayed Eid with them except in their mosque. I reckon that—and Allah the Exalted knows best—is because the Sacred Mosque is the best of places in the world, so they did not like to have a prayer except in it as much as possible for them. I only said this because it was so, and they do not have such space in the outskirts of the houses in Mecca, a large space. And I have not known them to ever pray Eid or Istisqa (prayer for rain) except in it. So if a town is populated and the mosque of its people accommodates them on the Eids, I do not see that they should go out from it. But if they go out, there is no harm. And if it does not accommodate them and an Imam leads them in it, I dislike that for him, but there is no need for them to repeat. And if there is an excuse of rain or otherwise, I command him to pray in the mosque and not go out to the desert.\"",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 34
  },
  {
    "serial_number": "4630660",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 34,
    "volume_number": 1,
    "text": "The scholar Ibn Al-Hajj said in \"Al-Madkhil\" (283): \"The established Sunnah in the prayer of the Two Eids is that it be in the Musalla, because the Prophet, may Allah bless him and grant him peace, said: 'A prayer in this mosque of mine is better than a thousand prayers in other than it, except the Sacred Mosque' (1). Then, despite this great virtue, he, may Allah bless him and grant him peace, went out to the Musalla and left it (the mosque). This is clear evidence for the emphasis of the command to go out to the Musalla for the prayer of the Two Eids. So it is the Sunnah, and praying them in the mosque according to the Madhhab of Malik, may Allah have mercy on him, is a Bid'ah (innovation), unless there is a compelling necessity for that, then it is not a Bid'ah. Because the Prophet, may Allah bless him and grant him peace, did not do it, nor did any of the Rightly Guided Caliphs after him. And because upon him be peace, commanded the women to go out to the prayer of the Two Eids, and he commanded the menstruating women and the secluded women (ladies of the houses) to go out to them. One of them said: O Messenger of Allah, one of us may not have a Jilbab. So upon him be blessings and peace said:",
    "foot_note": "1. 1 It reaches the level of Tawatur (mass transmission). See \"Al-Irwa'\" 953 and \"Sahih Al-Jami'\" 3732. \"Zuhair\".",
    "book_id": "11273",
    "new_page_number": 35
  },
  {
    "serial_number": "4630661",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 35,
    "volume_number": 1,
    "text": "'Let her sister lend her from her Jilbab so she may witness the good and the supplication of the Muslims.' So when he, upon him be blessings and peace, legislated for them to go out, he legislated the prayer in the wide open space (Al-Barah) to manifest the ritual of Islam. Thus, the Prophetic Sunnah which was reported in the authentic Hadiths indicated that the Prophet, may Allah bless him and grant him peace, used to pray the Two Eids in the desert outside the town. The practice continued upon that in the first era (of Islam), and they did not pray Eid in the mosques unless there was a necessity such as rain and the like. This is the Madhhab of the four Imams and others from the people of knowledge among the Imams, may Allah be pleased with them. I do not know anyone who disagreed with that except the statement of Al-Shafi'i, may Allah be pleased with him, regarding the choice of prayer in the mosque if it accommodates the people of the town. Yet, despite this, he did not see any harm in praying in the desert even if the mosque accommodated them. And he, may Allah be pleased with him, explicitly stated that he dislikes the prayer of the Two Eids in the mosque if it does not accommodate the people of the town. So these authentic Hadiths and others, then the continuation",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 36
  },
  {
    "serial_number": "4630662",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 36,
    "volume_number": 1,
    "text": "of practice in the first era, then the sayings of the scholars; all of that indicates that the prayer of the Two Eids in the mosques now is: a Bid'ah (innovation), even according to the statement of Al-Shafi'i, because there is no single mosque in our town that accommodates the people of the town in which it is located.",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 37
  },
  {
    "serial_number": "4630663",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 37,
    "volume_number": 1,
    "text": "Wisdom of Prayer in the Musalla. Furthermore, this Sunnah—the Sunnah of prayer in the desert—has a great and profound wisdom: That the Muslims have two days in the year wherein the people of every town gather—men, women, and children. They turn to Allah with their hearts, united by one word, praying behind one Imam, saying Takbir and Tahlil, and supplicating to Allah sincerely, as if they are upon the heart of one man, happy and rejoicing in Allah's blessing upon them. Thus, the Eid becomes for them a [true] Eid. The Messenger of Allah, may Allah bless him and grant him peace, commanded the going out of women for the Eid prayer with the people, and he did not exempt anyone from them. Even that he did not grant concession to the one who did not have something to wear for her going out; rather, he commanded that she borrow a garment from another. And even that he commanded those who had an excuse preventing them from prayer (menstruation) to go out to the Musalla \"to witness the good and the supplication of the Muslims.\"",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 38
  },
  {
    "serial_number": "4630664",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 38,
    "volume_number": 1,
    "text": "And the Prophet, may Allah bless him and grant him peace, then his Caliphs after him, and the Amirs deputized by them in the lands used to lead the people in Eid prayer, then preach to them with what admonishes them and teaches them what benefits them in their religion and worldly life. He would command them with charity in that gathering, so the rich would show kindness to the poor, and the poor would rejoice in what Allah gives him of His bounty in this blessed assembly upon which mercy and pleasure descend. So perhaps the Muslims will respond to following the Sunnah of their Prophet and to reviving the rituals of their religion which is the anchor of their determination and success. {O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life} (1). Sheikh Waliullah Al-Dehlawi said in \"Hujjat Allah Al-Balighah\" under the title: \"The Two Eids\" (2? 30-31): The origin in them is that every people have a day in which they gather and go out from their towns in their adornment. That is a custom from which no sect of the Arabs or non-Arabs is free. And he, may Allah bless him and grant him peace, prayed",
    "foot_note": "1. 1 Surah Al-Anfal: Verse 24.",
    "book_id": "11273",
    "new_page_number": 39
  },
  {
    "serial_number": "4630665",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 39,
    "volume_number": 1,
    "text": "in Medina while they had two days in which they played. So he said: \"Allah has replaced them for you with better than them: The day of Al-Adha and the day of Al-Fitr\" (1). It was said: They are \"Nairuz\" and \"Mahrajan\". They were replaced because there is no festival among people except that the reason for its existence is celebrating the symbols of a religion, or agreeing with the Imams of a sect, or something similar to that. So the Prophet, may Allah bless him and grant him peace, feared that if he left them and their custom, there would be a celebration of the symbols of Jahiliyyah (Pre-Islamic ignorance) or promotion of the sunnah of its ancestors. So he replaced them with two days containing celebration of the symbols of the Hanifiyyah (Monotheistic) Millah, and he joined with the beautification in them the remembrance of Allah and chapters of obedience. And so that the gathering of Muslims would not be purely play, and so that a gathering of theirs would not be devoid of exalting the word of Allah. One of them: The day of breaking their fast and performing a type of their Zakat (Zakat al-Fitr). So the \"natural\" joy gathered from their dispersing from what was difficult for them, and the poor taking the charities. And the \"intellectual\" [joy] from rejoicing in what Allah bestowed upon them of success in performing what He obligated upon them, and what He draped over them of keeping the heads of family and children [alive] to another year.",
    "foot_note": "1. 1 I say: Ahmad and others narrated it with an authentic chain, and it is extracted in \"Al-Sahihah\" under number \"2021\".",
    "book_id": "11273",
    "new_page_number": 40
  },
  {
    "serial_number": "4630666",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 40,
    "volume_number": 1,
    "text": "The second: The day Ibrahim slaughtered his son Ismail, upon them be peace, and Allah's favor upon them by ransoming him with a great sacrifice. For in it is the remembrance of the state of the Imams of the Hanifiyyah Millah and taking lesson from them in sacrificing souls and wealth in obedience to Allah and strength of patience. In it is a resemblance to the pilgrim and celebration of them and longing for what they are in. Therefore, Takbir was legislated, which is His saying, Exalted is He: {And to magnify Allah for having guided you} (1). Meaning in gratitude for guiding you to fasting. Therefore, the sacrifice (Udhiyah) and raising the voice with Takbir during the days of Mina were legislated, and leaving shaving was recommended for the one intending to sacrifice (2), and the prayer and the sermon were legislated so that nothing",
    "foot_note": "1. 1 [Surah Al-Baqarah: Verse 185]. [And Surah Al-Hajj: Verse 37]. 2 I say: He refers to his saying, may Allah bless him and grant him peace: \"When the crescent of Dhu al-Hijjah appears and one of you wants to sacrifice, let him withhold from his hair and his nails.\" And in a narration \"Let him not take anything from his hair or his nails until he sacrifices.\" Mukhtasar Sahih Muslim No. 1251 and others. I say: The apparent meaning of the hadith is the obligation of leaving the taking of hair and nails for the one who resolved to sacrifice, so the mentioned taking becomes forbidden. Imam Ahmad and others said this. So let those afflicted with shaving the beard take notice of this, for shaving it for Eid contains three sins: =",
    "book_id": "11273",
    "new_page_number": 41
  },
  {
    "serial_number": "4630667",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 41,
    "volume_number": 1,
    "text": "of the gathering would be without the remembrance of Allah and celebrating the symbols of the religion. And he joined with it another objective from the objectives of the Shariah, which is: That every nation must have a display wherein its people gather to show their strength/power (Showkah) and their large numbers be known. Therefore, the going out of everyone was recommended, even the children, women, secluded women, and menstruating women—and they withdraw from the Musalla and witness the supplication of the Muslims. Therefore, the Prophet, may Allah bless him and grant him peace, used to differ the route in going and returning so that the people of both paths would see the strength/power of the Muslims. And since the basis of Eid is adornment, good",
    "foot_note": "1. = The First: The shaving itself, for it is effeminacy and imitation of the disbelievers and changing the creation of Allah as I explained in my book \"Adab al-Zafaf fi al-Sunnah al-Mutahharah\" (Etiquettes of Marriage in the Purified Sunnah) \"Sixth Edition p: 118\". The Second: Adorning oneself for Eid with disobedience to Allah! The Third: What this hadith indicated of the prohibition of taking hair for the one who wanted to sacrifice. The truth is that few escape these violations, even among some people of knowledge. We ask Allah for safety.",
    "book_id": "11273",
    "new_page_number": 42
  },
  {
    "serial_number": "4630668",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 42,
    "volume_number": 1,
    "text": "clothing, Taqlis (1), differing the path, and going out to the Musalla were recommended.",
    "foot_note": "1. 1 Taqlis is beating tambourines and playing upon the arrival of kings as a way of welcoming them. End of footnote. I say: He refers to a hadith narrated by Ibn Majah (1/391) and others with two chains. In one of them is Sharik, who is Ibn Abdullah the Judge, bad in memorization. In the other is Abu Ishaq, who is Al-Sabi'i, and he became confused (mixed up). Al-Tahawi found defect in it in \"Mushkil al-Athar\" (2/209-210) from both aspects. So refer to it if you wish.",
    "book_id": "11273",
    "new_page_number": 43
  },
  {
    "serial_number": "4630669",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 43,
    "volume_number": 1,
    "text": "Doubts and their Answer. You have known from what preceded in clarification: That the prayer of the Two Eids in the Musalla is the Sunnah, and that it is a matter agreed upon among the Imams from a scientific perspective. And that in performing it in the Musalla there are benefits and wisdoms, most of which are not realized in performing it in the mosques or the mosque. Therefore, it is upon the Muslims to return to the Sunnah of their Prophet, may Allah bless him and grant him peace, and participate with those who hastened to revive this Sunnah in these lands. For the Hand of Allah is over the Jama'ah (congregation)—the congregation of the Sunnah, not the congregation opposing it! It is not befitting for a rational person to say: That in reviving this Sunnah there is division of the congregation of Muslims, and that if they are praying in the mosques in multiple congregations, then establishing it in the Musalla is a departure from them and bringing about a new congregation which we are in no need of, while we are in need of reducing those congregations, not increasing them. For we say:",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 44
  },
  {
    "serial_number": "4630670",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 44,
    "volume_number": 1,
    "text": "Indeed, this statement is not befitting for a rational Muslim to say, because it carries within it what is inconceivable for a believer to intend. For its implication is that applying the Sunnah, which all the Imams spoke of as we detailed, is a cause for dividing the Muslims and tearing apart their congregation. Imagining this is sufficient alone to invalidate this statement. Rather, the truth which we profess to Allah is: That there is no way to unite the word of the Muslims and unify their ranks except by returning to the Sunnah, especially the practical one which the Messenger of Allah, may Allah bless him and grant him peace, was upon throughout his life, and upon which he left his Ummah, and upon which he left them behind after him. If you wish for a close example of that, take what we are discussing regarding prayer in the Musalla. For the Muslims today have separated in this prayer into many congregations contrary to the Sunnah as preceded. So if we wanted to gather them into one congregation, we have no way to it except by going out to a spacious land that accommodates all the worshipers, women and men, taking for themselves a Musalla in which they perform this great worship \"Eid Prayer\". That is what the Sunnah commanded. So how can it be said after that: That applying the Sunnah is dividing the congregation?!",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 45
  },
  {
    "serial_number": "4630671",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 45,
    "volume_number": 1,
    "text": "Yes. Indeed, there is no doubt that reviving this Sunnah requires bringing about a new congregation that leaves those other dispersed congregations in the many mosques. But since the goal of this new congregation is gathering those congregations into one congregation as the matter was in his era, may Allah bless him and grant him peace, and the era of the Rightly Guided Caliphs, the existence of this congregation was inevitable because the One Congregation does not stand by a leap, and it does not stand except by them. And it is established in the Principles (Usul): That without which the obligation cannot be fulfilled is itself obligatory. So this confirms the acknowledgment of the necessity of the existence of this congregation because it is upon the Sunnah, and its goal is realizing the Jama'ah (congregation) in its broadest meanings, unlike those other congregations. A sayer might say: Many of the sincere ones might respond to this congregation after the Sunnah became clear to them, but it is assumed that many people will remain insisting on separation in the mosques contrary to the Sunnah and all the Madhhabs. Thus, the sought-after One Congregation is not achieved!",
    "foot_note": "None",
    "book_id": "11273",
    "new_page_number": 46
  },
  {
    "serial_number": "4630672",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 46,
    "volume_number": 1,
    "text": "I say: The truth is that this might happen. But it is clear then that the responsibility does not fall on those who revived this Sunnah and called people to it, but rather on those who insisted on opposing it. So the disapproval is directed only at them. As for the first group, their congregation is the legislated one because it is upon the Sunnah that the Messenger of Allah, may Allah bless him and grant him peace, was upon. And he, may Allah bless him and grant him peace, said in describing the Saved Sect: It is the Jama'ah. And in a narration: \"It is what I and my companions are upon\" (1). So the opposition of those who oppose them does not harm them then, even if they are greater than them in number (sawadan), due to his saying, may Allah bless him and grant him peace: \"A group of my Ummah will not cease to be manifest upon the truth; those who forsake them will not harm them until the command of Allah comes while they are like that\" (2).",
    "foot_note": "1. 1 I say: Its chain is Hasan (good) due to other supports. Al-Tirmidhi narrated it and deemed it Hasan from Ibn Amr, and Al-Tabarani and others from Anas. It is extracted along with the first narration—which is authentic—in \"Silsilat Al-Ahadith Al-Sahihah\" number \"204\". 2 An authentic Mutawatir hadith extracted in the mentioned source. See \"Mukhtasar Sahih Muslim\" number \"1095\" and \"Sahih Al-Jami' Al-Saghir\" number \"7166\".",
    "book_id": "11273",
    "new_page_number": 47
  },
  {
    "serial_number": "4630673",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 47,
    "volume_number": 1,
    "text": "So the believer does not feel lonely due to the fewness of those walking on the path of guidance, nor does the multitude of opposers harm him. Imam Al-Shatibi said in \"Al-I'tisam\" (1/11-12): \"And this is the Sunnah (way) of Allah in creation: That the people of Truth compared to the people of Falsehood are few, due to His saying, Exalted is He: {And most of the people, although you strive [for it], are not believers} (1). And His saying: {And few of My servants are grateful} (2). And so that Allah may fulfill what He promised His Prophet, may Allah bless him and grant him peace, regarding the return of the description of strangeness (Ghurba) to it (3). For strangeness does not occur except with the loss of its people or their scarcity. That is when the recognized good becomes evil, and the evil becomes recognized good, and the Sunnah becomes innovation, and innovation becomes Sunnah. So the people",
    "foot_note": "1. 1 [Surah Yusuf: Verse 103]. 2 [Surah Saba: Verse 13]. 3 Meaning Islam. Referring to his saying, may Allah bless him and grant him peace: \"Islam began as something strange and will revert to being strange as it began, so glad tidings to the strangers.\" Narrated by Muslim and others, and it is extracted in \"Al-Sahihah\", \"1273\".",
    "book_id": "11273",
    "new_page_number": 48
  },
  {
    "serial_number": "4630674",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Prayer of the Two Eids in the Musalla is the Sunnah",
    "edition": "Third Edition 1406 AH / 1986",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami)",
    "page_number": 48,
    "volume_number": 1,
    "text": "of Sunnah are treated with intimidation and harshness (1), just as the people of innovation were treated at first, in the hope of the innovator that the word of misguidance will unite. But Allah refuses that it unites until the Hour is established. So all the sects, despite their multitude, do not unite on opposing the Sunnah by habit and report. Rather, a group of the people of Sunnah must remain firm until the command of Allah comes. Except that due to the abundance of the misguided sects snatching at them and setting up enmity and hatred against them calling for agreement with them, they do not cease to be in jihad, dispute, defense, and combat throughout the night and day. And by that, Allah multiplies for them the abundant reward and grants them the great recompense.\" I ask Allah the Exalted to keep us firm on the Sunnah and cause us to die upon it. And this is the last of what was facilitated to collect in this haste. And Praise be to Allah, Lord of the Worlds.",
    "foot_note": "1. 1 Just as the authors of \"Al-Isabah\" did to us. For after they wavered in clarifying their opinion on \"Eid prayer in the desert\" as preceded, they said: \"And the Muslims have not ceased to have among them those who maintain the prayers and the commands of their religion and their prayer. Then this band stood up denying them and dividing their congregation.\" So reflect on how they made calling to the Sunnah a division of the congregation. Truthful is he who said: She threw her disease at me and slipped away!",
    "book_id": "11273",
    "new_page_number": 49
  }
]