[
  {
    "text": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 1
  },
  {
    "text": "sn: 3242\nbook_title: تخريج أحاديث مشكلة الفقر وكيف عالجها الإسلام\nbook_link: https://shamela.ws/book/365\nbook_id: 365\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتب الإسلامي - بيروت\nedition: الأولى - 1405 هـ- 1984 م\npages: 83\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التخريج والأطراف\ncategory_id: 8",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 2
  },
  {
    "serial_number": "3193602",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Takhrij (Grading) and Atraf (Parts)\nBook: Grading the Hadiths of the Problem of Poverty and How Islam Addressed It\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Grading the Hadiths of the Problem of Poverty and How Islam Addressed It\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 3
  },
  {
    "serial_number": "3193603",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 9,
    "volume_number": 1,
    "text": "1 - (Sahih / Authentic) How excellent is the righteous wealth for the righteous man.\n\n2 - (Da'if / Weak) Poverty almost becomes Kufr (disbelief). Weak. It was extracted by Al-Uqayli in *Al-Du'afa*, Abu Nu'aym in *Al-Hilyah*, and Abu Al-Hasan bin Abd Kuwayh in *Thalathat Majalis* via the path of Sufyan from Hajjaj from Yazid Al-Raqashi from Anas bin Malik raised (marfu') with it, and he added: \"And envy almost overcomes the decree (Al-Qadar).\" And this chain of narration is weak.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 4
  },
  {
    "serial_number": "3193605",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 10,
    "volume_number": 1,
    "text": "3 - (Da'if / Weak) O Allah, I seek refuge in You from Kufr (disbelief) and poverty. Weak. It was extracted by Al-Nasa'i, Al-Hakim, and Ahmad.\n\n4 - (Sahih / Authentic) O Allah, I seek refuge in You from poverty, scarcity, and humiliation, and I seek refuge in You from wronging [others] or being wronged. Authentic. It appeared in *Sahih Al-Jami' Al-Saghir*.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 5
  },
  {
    "serial_number": "3193607",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 11,
    "volume_number": 1,
    "text": "5 - (Da'if / Weak) Take the gift as long as it remains a gift; but when it becomes a bribe against the religion, do not take it. Yet you will not leave it; need and poverty prevent you. Weak. It was extracted by Al-Tabarani in *Al-Saghir*, and from him Abu Nu'aym in *Al-Hilyah* and Al-Khatib in *Tarikh Baghdad*.\n\n6 - (Sahih / Authentic) From Abu Hurairah that the Messenger of Allah (pbuh) said: A man said: \"I will surely give charity tonight.\" So he went out with his charity and placed it in the hand of a thief. In the morning, people were talking, \"Charity was given to a thief.\" He said: \"O Allah, to You belongs all praise. I will surely give charity...\" Then he gave charity another time to a woman, but his charity fell into the hands of an adulteress. In the morning, people were talking about that, \"Charity was given tonight to an adulteress.\" Then someone came to him in a dream and said to him: \"As for your charity to a thief, perhaps it will cause him to abstain from his theft, and as for your charity to an adulteress, perhaps it will cause her to abstain from her adultery.\" Authentic. It was extracted by Al-Bukhari, Muslim, Al-Nasa'i, and Ahmad.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 6
  },
  {
    "serial_number": "3193609",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 12,
    "volume_number": 1,
    "text": "7 - (Sahih / Authentic) A judge should not judge while he is angry. Authentic. It was extracted by the Two Sheikhs (Al-Bukhari and Muslim) and others, and it is in *Al-Irwa'*.\n\n8 - (Sahih / Authentic) There should be neither harming nor reciprocating harm. Authentic. It was extracted by Ibn Majah and others, and its authenticity is derived from the sum of its paths and supporting evidences, and it is in *Al-Irwa'*.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 7
  },
  {
    "serial_number": "3193611",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 13,
    "volume_number": 1,
    "text": "9 - (Sahih / Authentic) The Messenger (may Allah's peace and blessings be upon him) was asked, \"Which sin is greatest?\" He said: \"That you set up a rival to Allah while He created you.\" He said: \"Then which?\" He said: \"That you kill your child out of fear that he will eat with you.\"\n\n10 - (Study not completed) It was narrated from Abu Dharr that he said: \"I am amazed at the one who does not find sustenance in his house, how he does not go out to the people with his sword drawn.\" Gharib (Strange/Unfamiliar).\n\n11 - (Hasan / Good) From Al-Zuhri from Abu Khuzamah from his father who said: I asked the Messenger of Allah (pbuh) saying: \"O Messenger of Allah, do you see ruqyah (incantations) we use for healing, medicine we take for treatment, and protection (shields) we use for defense—do they avert anything from the decree (Qadar) of Allah?\" He said: \"They are part of the decree of Allah.\" Hasan. It was extracted by Al-Tirmidhi, Ibn Majah, Al-Hakim, and Ahmad. Al-Haythami mentioned a witness (supporting evidence) for the hadith from Ibn Abbas who said: A man said, \"O Messenger of Allah, does medicine avail against the decree?\" He said: \"Medicine is part of the decree, and it may avail by the permission of Allah.\" It was narrated by Al-Tabarani, and it contains Salih bin Bashir Al-Murri, who is weak.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 8
  },
  {
    "serial_number": "3193614",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "12 - (Sahih / Authentic) He prayed for his companion and servant Anas: \"O Allah, increase his wealth.\" Authentic. It was extracted by Al-Bukhari, Muslim, Al-Tirmidhi, Al-Tayalisi, and Ahmad via the path of Qatadah from Anas from Umm Sulaym that she said: \"O Messenger of Allah, [this is] your servant Anas, supplicate to Allah for him.\" So he said: \"O Allah, increase his wealth and his children, and bless him in what You have given him.\" It has another path narrated by Humayd from Anas who said: The Prophet (pbuh) entered upon Umm Sulaym, and she brought him dates and ghee (clarified butter). He said: \"Return your ghee to its skin vessel and your dates to their container, for I am fasting.\" Then he stood in a corner of the house and prayed a non-obligatory prayer, then he supplicated for Umm Sulaym and her household. Umm Sulaym said: \"O Messenger of Allah, I have a special request (khuwayissah).\" He said: \"What is it?\" She said: \"Your servant Anas.\" So he did not leave any good of the Hereafter or the world except that he supplicated for me with it: \"O Allah, grant him wealth and children and bless him in it.\" So indeed, I am among the wealthiest of the Ansar, and my daughter Aminah told me that somewhat over one hundred and twenty of my offspring were buried by the time Al-Hajjaj arrived in Basra. It was extracted by Al-Bukhari, Al-Tayalisi, and Ahmad. And it has a third path narrated by Thabit from Anas similarly, and he added: \"And there is no man among the Ansar wealthier than me.\" Then Anas said: \"O Thabit, I do not possess any yellow (gold) or white (silver) except my ring.\" It was extracted by Muslim and Ahmad, and the addition belongs to him (Ahmad).",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 9
  },
  {
    "serial_number": "3193615",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "13 - (Sahih / Authentic) No wealth has benefited me like the wealth of Abu Bakr. Authentic. It was extracted by Ibn Majah, Al-Tahawi, Ibn Hibban, Ahmad, and Ibn Asakir from Abu Hurairah who said: The Messenger of Allah (pbuh) said: \"No wealth has ever benefited me as the wealth of Abu Bakr has benefited me.\" He said: So Abu Bakr wept and said: \"O Messenger of Allah, am I and my wealth anything but for you, O Messenger of Allah?\" And its chain is authentic. There is another path for the hadith of Abu Hurairah with the wording: \"No one has done us a favor except that we have requited him, except for Abu Bakr, for indeed he has a favor upon us for which Allah will requite him on the Day of Resurrection. And no wealth of anyone has ever benefited me as the wealth of Abu Bakr has benefited me. And if I were to take a Khalil (close friend), I would have taken Abu Bakr as a Khalil, but your companion is the Khalil of Allah.\" It was extracted by Al-Tirmidhi who said: A Hasan Gharib Hadith. Thus he said, but its chain is weak.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 10
  },
  {
    "serial_number": "3193616",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "14 - (Sahih / Authentic) If the son of Adam had two valleys of gold, he would seek a third, and if he had a third, he would seek a fourth, and nothing fills the eye of the son of Adam except dust. Authentic with the wording: \"If the son of Adam had two valleys of wealth, he would seek a third, and nothing fills the belly (and in a narration: eye) of the son of Adam except dust, and Allah accepts the repentance of he who repents.\" It was extracted by Al-Bukhari—and the context is with his other narration—Muslim, and Ahmad.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 11
  },
  {
    "serial_number": "3193617",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "15 - (Sahih / Authentic) The Holy Spirit (Ruh al-Qudus) inspired into my heart (mind) that a soul will never die until it has completed its provision (rizq). So fear Allah and be moderate in seeking. Authentic. It was extracted by Abu Ubayd in *Gharib al-Hadith* and Al-Quda'i in *Musnad al-Shihab* with an authentic chain. It was also extracted by Al-Hakim. It appeared with the wording: \"Do not deem the provision slow in coming, for the servant will not die until the last provision meant for him reaches him. So be moderate in seeking: take the lawful and leave the unlawful.\" It was extracted by Ibn Hibban, Al-Hakim, and Abu Abdur-Razzaq (sic - likely Abdur-Razzaq or Abu Nu'aym/Abu Ya'la, but translating as written). Al-Hakim said: Authentic according to the conditions of the Two Sheikhs, and Al-Dhahabi agreed with him.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 12
  },
  {
    "serial_number": "3193618",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "16 - (Sahih / Authentic) Richness is not about the abundance of accidental goods (possessions); rather, richness is the richness of the soul. Authentic. It was extracted by Al-Bukhari, Al-Tirmidhi, Ahmad, Muslim, and Ibn Majah. Ahmad added via the path of Yazid bin Al-Asamm: \"By Allah, I do not fear poverty for you, but I fear for you abundance (of wealth), but I fear for you intentionality (seeking it deliberately).\" And its chain is authentic according to the condition of Muslim.\n\n17 - (Da'if / Weak) Be satisfied with what Allah has apportioned for you, and you will be the richest of people. Weak. It was extracted by Al-Tirmidhi, Ahmad, and Ibn Asakir via the path of Abu Tariq from Al-Hasan from Abu Hurairah who said: The Messenger of Allah (pbuh) said: \"Who will take these words from me and act upon them, or teach someone who will act upon them?\" Abu Hurairah said: I said: \"I will, O Messenger of Allah.\" So he took my hand and counted five things, saying: \"Avoid the prohibitions and you will be the most worshipful of people; be satisfied with what Allah has apportioned for you and you will be the richest of people; be good to your neighbor and you will be a believer; love for people what you love for yourself and you will be a Muslim; and do not laugh too much, for excessive laughter deadens the heart.\" Al-Tirmidhi said: A Gharib Hadith, and Al-Hasan did not hear from Abu Hurairah.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 13
  },
  {
    "serial_number": "3193620",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "18 - (Sahih) He has succeeded who is guided to Islam, whose provision is sufficient, and is content with it. Sahih, recorded by Muslim, Al-Tirmidhi, Ibn Majah, and Ahmad.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 14
  },
  {
    "serial_number": "3193621",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "19 - (Sahih) How excellent is righteous wealth for a righteous man.\n\n20 - (Da'if/Weak) The disease of the nations before you has crept towards you: envy and hatred. It is the shaver (destroyer). I do not say that it shaves hair, but it shaves (destroys) religion. By the One in Whose Hand is my soul, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not inform you of something that will establish that for you? Spread peace (Salam) among yourselves. Weak, recorded by Al-Tirmidhi.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 15
  },
  {
    "serial_number": "3193623",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "21 - (Sahih) And be, O servants of Allah, brothers.\n\n22 - (Hasan/Good) The Prophet (pbuh) said to the Bedouin who left his she-camel untied, relying on Allah, he said to him: 'Tie it and rely [on Allah].' Hasan, recorded by Al-Tirmidhi on the authority of Anas bin Malik who says: A man said: 'O Messenger [of Allah], should I tie it and rely, or let it loose and rely?' He said: 'Tie it and rely.' See the explanation. At the end of it [the author says]: And with this supporting evidence, my heart is reassured regarding the preservation of the hadith, even if at the degree of Hasan at the very least.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 16
  },
  {
    "serial_number": "3193625",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "23 - (Sahih) If you were to rely upon Allah with the reliance He is due, He would provide for you just as birds are provided for; they go out in the morning with empty stomachs and return in the evening with full stomachs. Sahih, recorded by Al-Tirmidhi, Ibn Hibban, Abdullah bin Al-Mubarak, Ibn Abi Al-Dunya, Al-Hakim, Ahmad, and Al-Quda'i.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 17
  },
  {
    "serial_number": "3193626",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "24 - (Sahih) My provision has been placed under the shadow of my spear. Sahih, and it is a piece of a hadith extracted in [the book] 'Hijab al-Mar'ah al-Muslimah' (The Veil of the Muslim Woman) on the authority of Abdullah bin Umar who said: The Messenger of Allah (pbuh) said: 'I have been sent before the Hour with the sword so that Allah alone is worshiped with no partner associated with Him, and my provision has been placed under the shadow of my spear, and humiliation and lowliness have been placed upon those who disobey my command, and whoever imitates a people is one of them.'\n\n25 - (Study not completed) It was narrated that Umar saw, after the prayer, a group of people sitting in the mosque claiming reliance on Allah, so he struck them with his whip and said: 'Let none of you sit refraining from seeking provision while saying: \"O Allah, provide for me,\" when he knows that the sky does not rain gold nor silver, and verily Allah says: {And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah}.' Al-Albani remained silent about it.\n\n26 - (Study not completed) On the authority of Umar bin Al-Khattab, who said: 'There is no state in which death comes to me - after Jihad in the cause of Allah - more beloved to me than for it to come to me while I am seeking the bounty of Allah.' Our professor Al-Albani remained silent about this report. It is narrated in the books of literature; see 'Al-Iqd Al-Farid'.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 18
  },
  {
    "serial_number": "3193629",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "27 - (Da'if/Weak) The truthful, trustworthy merchant will be with the Prophets, the Truthful ones (Siddiqin), and the Martyrs.\n\n28 - (Sahih) There is no Muslim who plants a crop or plants a seedling, and a bird, or a human, or an animal eats from it, but that it is a charity for him.\n\n29 - (Sahih) No one has ever eaten food better than that which he eats from the work of his own hand.\n\n30 - (Munkar/Rejected) Whoever spends the night exhausted from seeking the Halal (lawful) spends the night forgiven. Munkar, recorded by Ibn Asakir on the authority of Al-Miqdam bin Ma'di Karib who said: I saw the Prophet (pbuh) one day with his hands outstretched saying... then he mentioned it with an addition at the beginning with the wording: 'A servant has not eaten food more beloved to Allah than [that from] the labor of his hand, and whoever spends the night...'",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 19
  },
  {
    "serial_number": "3193633",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "31 - (Sahih) For one of you to take his rope and bring a bundle of firewood on his back and sell it, thereby Allah saving his face, is better than asking people, whether they give him or withhold from him.\n\n32 - (Sahih) Allah has not sent a prophet except that he shepherded sheep. They said: 'And you, O Messenger of Allah?' He said: (Yes, I used to shepherd them for [a few] Qirats for the people of Mecca).\n\n33 - (Sahih) No one has ever eaten food better than that which he eats from the work of his own hand, and indeed the Prophet of Allah, Dawud, used to eat from the work of his own hand.\n\n34 - (I did not see it as Marfu') From the hadith of Ibn Abbas: that Dawud was a chainmail maker who made chainmail and armor, Adam was a farmer, Nuh was a carpenter, Idris was a tailor, and Musa was a shepherd.\n\n35 - (Da'if/Weak) Travel, and you will become wealthy. Weak, the text is Mudtarib (confused/shaky). Recorded by Al-Tabarani in Al-Awsat from the hadith of Abu Hurairah, elevated (to the Prophet) with the wording: 'Go on raids (campaigns) and you will gain booty, fast and you will be healthy, and travel and you will become wealthy.'",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 20
  },
  {
    "serial_number": "3193638",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "36 - (Hasan/Good) A man passed away in Medina who was one of those born there, so the Messenger of Allah (pbuh) prayed over him and said: 'Would that he had died somewhere other than his birthplace.' A man said: 'Why, O Messenger of Allah?' He said: 'Indeed, if a man dies as a stranger (away from home), it is measured for him from his birthplace to the end of his trace in Paradise.' Hasan, recorded by Al-Nasa'i, Ibn Majah, Ibn Hibban, and Ahmad.\n\n37 - (I did not find it with this wording) The Messenger of Allah, peace and blessings be upon him, stood over the grave of a man in Medina and said: 'Oh, if only he had died a stranger.'\n\n38 - (Sahih) On the authority of Abdullah bin Adi Al-Khiyar, that two men informed him that they came to the Prophet (pbuh) asking him for charity. He looked them up and down and saw them to be sturdy, so he said: 'If you wish, I will give you, but there is no share in it for a rich person nor for a strong person capable of earning.' Sahih, and it is in [the book] Al-Irwa.\n\n39 - (Sahih) Charity is not lawful for a rich person nor for one of sound strength. Sahih, and it is in [the book] Al-Irwa.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 21
  },
  {
    "serial_number": "3193642",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "40 - (Agreed upon) A man continues to ask people until he comes on the Day of Resurrection with not a shred of flesh on his face. Sahih, and it is agreed upon (by Bukhari and Muslim) from the hadith of Ibn Umar, and the wording is that of Muslim, and it is in [the book] 'Ghayat al-Maram' with another wording.\n\n41 - (Da'if/Weak) A man from the Ansar came to the Prophet (pbuh), so he said: 'Is there nothing in your house?' He said: 'Yes, a cloth, part of which we wear and part of which we spread, and a wooden bowl in which we drink water.' He said: 'Bring them to me.' So he brought them to him, and the Messenger of Allah (pbuh) took them and said: 'Who will buy these two?' A man said: 'I will take them for a dirham.' He said: 'Who will offer more than a dirham?' two or three times. A man said: 'I will take them for two dirhams.' So he gave them to him and took the two dirhams and gave them to the Ansari and said: 'Buy food with one of them and throw it to your family, and buy an adze with the other and bring it to me.' So the Messenger of Allah (pbuh) fixed a wooden handle to it with his own hand, then said to him: 'Go and gather firewood and sell, and let me not see you for fifteen days.' So the man went gathering firewood and selling. He came back having earned ten dirhams, so he bought a garment with some of it and food with some of it. The Messenger of Allah (pbuh) said: 'This is better for you than that begging should come as a mark on your face on the Day of Resurrection. Indeed, begging is not proper except for three: one in abject poverty, or one in severe debt, or one with a painful blood money [debt].' Weak, and it is in [the book] Al-Irwa.\n\n42 - (Sahih) Whoever believes in Allah and the Last Day, let him uphold his ties of kinship. Sahih, recorded by the two Sheikhs (Bukhari and Muslim) and others, and it is extracted in [the book] 'Mishkat al-Masabih'.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 22
  },
  {
    "serial_number": "3193645",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "43 - (Hasan/Good) Your mother, your father, your sister, your brother, and your master (Mawla) who follows that. A mandatory right and a connected kinship. Hasan, recorded by Abu Dawood and Al-Bukhari in 'Al-Adab Al-Mufrad'.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 23
  },
  {
    "serial_number": "3193646",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "44 - (Sahih) Your mother, your father, your sister, your brother, then the closest to you, the closest to you. Sahih, recorded by Al-Nasa'i on the authority of Tariq Al-Muharibi who said: We arrived in Medina and there was the Messenger of Allah (pbuh) standing on the pulpit addressing the people, saying: 'The giving hand is the upper one, and start with those you support: your mother, your father...' The Hadith.\n\n45 - (Hasan/Good) On the authority of Kulayb bin Manfa'ah Al-Hanafi, from his grandfather, that he came to the Prophet, peace and blessings be upon him, and said: 'O Messenger of Allah, to whom should I be dutiful?' He said: 'Your mother, your father, your sister, your brother, and your master (Mawla) who follows that. A mandatory right and a connected kinship.'\n\n46 - (Sahih) On the authority of Tariq Al-Muharibi who said: I arrived in Medina and there was the Messenger of Allah, peace and blessings be upon him, standing on the pulpit addressing the people, saying: (The giving hand is the upper one, and start with those you support: your mother, your father, then your sister, and your brother, then the closest to you, the closest to you).\n\n47 - (Sahih) A man came to the Prophet (pbuh) and said: 'O Messenger of Allah, who among the people is most deserving of my good companionship?' He said: 'Your mother.' He said: 'Then who?' He said: 'Your mother.' He said: 'Then who?' He said: 'Your mother.' He said: 'Then who?' He said: 'Your father, then the closest to you, then the closest to you.' Sahih, and it is in [the book] 'Ghayat al-Maram' and in 'Al-Irwa'.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 24
  },
  {
    "serial_number": "3193650",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "48 - (Hasan/Good) On the authority of Mu'awiyah Al-Qushayri who said: I said: 'O Messenger of Allah, to whom should I be dutiful?' He said: 'Your mother.' I said: 'Then who?' He said: 'Your mother.' I said: 'Then who?' He said: 'Your father, then the nearest, then the nearest.' Hasan, recorded by Abu Dawood, Al-Tirmidhi, Al-Hakim, and Ahmad.\n\n49 - (Sahih) The Prophet (pbuh) said to Hind: 'Take what suffices you and your child according to what is customary.' Sahih, and it is in [the book] Al-Irwa 2158.\n\n50 - (Sahih) Indeed, the purest of what you eat is from your own earnings, and indeed your children are from your earnings, so eat it with enjoyment and wholesomeness. Sahih, and it is in [the book] Al-Irwa 1626.\n\n51 - (Sahih) Start with yourself and give charity to it. If something remains, then for your family. If something remains from your family, then for your relatives. If something remains from your relatives, then like this and like that. Sahih, and it is in [the book] Al-Irwa.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 25
  },
  {
    "serial_number": "3193654",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "52 - (Study not completed) That Umar compelled the agnatic relatives ('Asabah) of a boy to spend on him, the men excluding the women. Recorded by Al-Bayhaqi on the authority of Amr bin Shu'ayb from Sa'id bin Al-Musayyib that Umar, may Allah be pleased with him, compelled... etc. And he [Al-Bayhaqi] said it is disconnected (Munqati'), meaning between Ibn Al-Musayyib and Umar.\n\n53 - (Study not completed) The guardian of an orphan came to Umar bin Al-Khattab, so he said: 'Spend on him.' Then he said: 'If I found only his most distant kinsman, I would have imposed it upon them.' I [the author] said: I have not found it [the source] right now.\n\n54 - (Sahih) O servants of Allah, seek medical treatment, for indeed the One who created the disease created the cure. Sahih, and it is in [the book] 'Ghayat al-Maram' 292.\n\n55 - (Sahih) In that which the sky waters, there is a tithe (one-tenth), and in that which is watered by machinery (irrigation tools), there is half a tithe (one-twentieth). Sahih, and it is in [the book] Al-Irwa and in 'Al-Rawd Al-Nadir'.\n\n56 - (Sahih) Ibn Abbas said: The Messenger of Allah (pbuh) imposed Zakat al-Fitr as a purification for the fasting person from idle talk and obscenity, and as food for the poor. Sahih, and it is in [the book] Al-Irwa.\n\n57 - (Sahih) Islam is built on five [pillars]: The testimony that there is no deity except Allah and that Muhammad is the Messenger of Allah, establishing prayer, paying Zakat, fasting Ramadan, and pilgrimage to the House for whoever is able to find a way. Sahih, and it is in [the book] Al-Irwa.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 26
  },
  {
    "serial_number": "3193660",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "58 - (Da'if/Weak) Abdullah bin Masoud said: You were commanded to establish prayer and pay Zakat, and whoever does not pay Zakat, there is no prayer for him. Recorded by Al-Tabarani in 'Al-Mu'jam Al-Kabir' and its chain of narration is weak.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 27
  },
  {
    "serial_number": "3193661",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "59 - (Sahih) Purity is half of faith, and 'Al-hamdu lillah' (Praise be to Allah) fills the scale, and 'Subhan Allah' (Glory be to Allah) and 'Al-hamdu lillah' fill - or fills - what is between the heavens and the earth. Prayer is a light, charity is a proof (Burhan), patience is a brightness, and the Quran is an argument for you or against you. All people go out early in the morning and sell themselves, either freeing themselves or destroying themselves. Sahih, recorded by Muslim, Al-Nasa'i, Al-Tirmidhi, Al-Darimi, and Ahmad on the authority of Abu Malik Al-Ash'ari.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 28
  },
  {
    "serial_number": "3193662",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "60 - (Sahih) Whoever Allah has given wealth to and he does not pay its Zakat, it will appear to him on the Day of Resurrection as a bald snake (a type of serpent) having two black spots (over its eyes). It will encircle him on the Day of Resurrection, then it will seize him by his jaws (meaning his cheeks), then it will say: 'I am your wealth, I is your treasure.' Then the Prophet (pbuh) recited: {And let not those who [greedily] withhold what Allah has given them of His bounty ever think that it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection}. Sahih, recorded by Al-Bukhari, Al-Nasa'i, and Ahmad on the authority of Abu Hurairah.\n\n61 - (Hasan/Good) No people withheld Zakat except that Allah tested them with years [of drought/famine]. Hasan, and it is in 'Al-Silsilah Al-Sahihah' 106.\n\n62 - (Hasan/Good) And they did not withhold the Zakat of their wealth except that rain was withheld from the sky, and were it not for the animals, it would not rain. Hasan, and it is in 'Al-Silsilah Al-Sahihah' number 106.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 29
  },
  {
    "serial_number": "3193665",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Treated It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "63 - (Da'if/Weak) Charity - or he said Zakat - never mixed with wealth except that it spoiled it. Weak, recorded by Al-Humaydi.\n\n64 - (Hasan/Good) Whoever gives it seeking reward, he will have his reward. And whoever withholds it, we will take it and half of his wealth as a fine from the fines of our Lord. None of it is lawful for the family of Muhammad. Hasan, and it is in [the book] Al-Irwa.\n\n65 - (Sahih) Narrated by Abu Huraira: When the Messenger of Allah (pbuh) passed away and Abu Bakr succeeded him, and those among the Arabs who disbelieved had disbelieved, Umar bin Al-Khattab said to Abu Bakr: \"How will you fight the people when the Messenger of Allah (pbuh) said: 'I have been commanded to fight the people until they say La ilaha illa Allah (There is no deity but Allah). Whoever says La ilaha illa Allah, his wealth and life are protected from me except by its right, and his reckoning is with Allah'?\" Abu Bakr said: \"By Allah, I will fight anyone who differentiates between the Prayer and the Zakat, for Zakat is the right of the wealth. By Allah, if they withhold from me a hobbling-cord (for a camel) that they used to give to the Messenger of Allah (pbuh), I would fight them for withholding it.\" Umar bin Al-Khattab said: \"By Allah, it was nothing but that I saw Allah, the Mighty and Majestic, had expanded Abu Bakr's chest for fighting, so I knew it was the truth.\" Sahih. Narrated by Al-Bukhari, Muslim, Abu Dawood, Al-Nasa'i, and Al-Tirmidhi from Abu Huraira.\n\n66 - (Sahih) \"Whoever among you sees an evil, let him change it with his hand; if he cannot, then with his tongue; and if he cannot, then with his heart, and that is the weakest of faith.\" Sahih. Narrated by Muslim, Abu Dawood, Al-Nasa'i, Al-Tirmidhi, Ibn Majah, and Ahmad from the hadith of Abu Sa'id Al-Khudri, who said: I heard the Messenger of Allah (pbuh) say... then he mentioned it.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 30
  },
  {
    "serial_number": "3193669",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "67 - (Sahih) A man came to the Prophet (pbuh) and said: \"My mother died and she had a month's fasting due; should I make it up on her behalf?\" He said: \"If your mother had a debt, would you pay it on her behalf?\" He said: \"Yes.\" He said: \"Then the debt of Allah is more deserving to be paid.\" Sahih. Narrated by Muslim, Al-Tirmidhi, Al-Darimi, Ibn Majah, and Ahmad. Al-Tirmidhi said: A Hasan Sahih hadith. His wording, and likewise Ibn Majah's, is \"two consecutive months.\" In a narration by Ahmad: A man came to the Prophet (pbuh) and said: \"My sister vowed to perform Hajj and she died.\" He said: \"Do you see if she had...\" the hadith. Its chain is upon the condition of the Two Sheikhs (Bukhari and Muslim).",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 31
  },
  {
    "serial_number": "3193670",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "68 - (Sahih) \"Every sin is forgiven for the martyr except debt.\" Sahih. Narrated by Muslim and Ahmad from the hadith of Abdullah bin Amr in a raised (Marfu') chain.\n\n69 - (Sahih) The Prophet (pbuh) commanded Mu'adh when he sent him to Yemen: \"Inform them that Allah has obligated upon them a charity (Sadaqah) to be taken from their rich and returned to their poor. If they obey you in that, then beware of [taking] the best of their wealth, and fear the supplication of the oppressed, for there is no veil between it and Allah.\" Sahih. It is in Al-Irwa.\n\n70 - (Da'if - Weak) Narrated by Jabir bin Atik that the Messenger of Allah (pbuh) said: \"Riders who are disliked will come to you. When they come to you, welcome them and leave them to what they seek. If they are just, it is for themselves, and if they are unjust, it is upon them. For the perfection of your Zakat is their satisfaction, and let them supplicate for you.\" Weak. Narrated by Abu Dawood, Ibn Abi Shaybah, and Al-Bayhaqi.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 32
  },
  {
    "serial_number": "3193673",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "71 - (Da'if - Weak) Narrated by Anas (ra) that a man said to the Messenger of Allah (pbuh): \"If I pay Zakat to your messenger, am I acquitted of it before Allah and His Messenger?\" He said: \"Yes, if you pay it to my messenger, you are acquitted of it before Allah and His Messenger. You have its reward, and its sin is upon the one who changes it.\" Weak. Narrated by Ahmad via Sa'id bin Abi Hilal from Anas bin Malik.\n\n72 - (Sahih) From Suhayl bin Abi Salih from his father, who said: \"I accumulated some money which included charity [due]. I asked Sa'd bin Abi Waqqas, Ibn Umar, Abu Huraira, and Abu Sa'id Al-Khudri whether I should distribute it myself or give it to the ruler (Sultan). Not one of them disagreed with me.\" In another narration: \"I said to them: 'This ruler does what you see' (this was during the time of the Umayyads), 'so shall I give my Zakat to them?' They all said: 'Yes, give it to them.'\" Sahih. Narrated by Abu Ubayd in Al-Amwal and Al-Bayhaqi via Suhayl bin Abi Salih with the same. This chain is Sahih according to the condition of Muslim.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 33
  },
  {
    "serial_number": "3193675",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "73 - (Sahih Athar) Narrated by Ibn Umar (ra) who said: \"Pay your charities to whomever Allah has placed in charge of your affairs. Whoever does good, it is for himself, and whoever sins, it is upon himself.\" Sahih. Narrated by Abu Ubayd in Al-Amwal.\n\n74 - (Da'if Athar - Weak) Narrated by Al-Mughira bin Shu'ba that he said to a freed slave of his who was in charge of his wealth in Ta'if: \"What do you do regarding the charity (Zakat) of my wealth?\" He said: \"Some of it I give in charity [myself], and some I give to the ruler.\" He said: \"Why do you do that?\" He replied: \"They buy land with it and marry women with it.\" He said: \"Give it to them, for the Messenger of Allah (pbuh) commanded us to give it to them.\" Weak. Narrated by Al-Bayhaqi.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 34
  },
  {
    "serial_number": "3193677",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "75 - (Da'if - Weak) A man came to the Prophet (pbuh) and said to him: \"Give me from the charities.\" He said to him: \"Indeed, Allah was not pleased with the judgment of a prophet nor anyone else regarding charity until He judged it Himself. He divided it into eight parts. If you are among those parts, I will give you your right.\" Weak. It is in Al-Irwa.\n\n76 - (Sahih) \"The poor person (Miskin) is not the one turned away by a date or two, nor by a mouthful or two. Rather, the poor person is the one who abstains [from asking]. Read if you wish: {They do not ask people persistently}.\" Sahih. Narrated by Al-Bukhari, Muslim, Abu Dawood, Al-Nasa'i, and Ahmad via several paths from Abu Huraira. The wording is Al-Bukhari's.\n\n77 - (Sahih) \"The poor person (Miskin) is not the one who goes around to people and is turned away by a mouthful or two, or a date or two. But the poor person is the one who does not find a wealthy person to enrich him, nor is he noticed so that charity is given to him, nor does he stand up and ask people.\" Sahih. Narrated by Al-Bukhari, Muslim, Al-Nasa'i, Malik, and Ahmad.\n\n78 - (Da'if Athar - Weak) Al-Hasan Al-Basri was asked about a man who owns a house and a servant, can he take from Zakat? He answered that he may take if he is in need, and there is no harm upon him. Weak. Narrated by Abu Ubayd in Al-Amwal.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 35
  },
  {
    "serial_number": "3193681",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "78 - (Not studied) From Al-Hasan Al-Basri that he said: \"They used to give Zakat to one who owns ten thousand dirhams worth of horses, weapons, a servant, and a house.\" Al-Albani said: I did not find a chain for it. The author quoted it from Al-Bada'i by Al-Kasani, from the Hanafi Fiqh books.\n\n79 - (Sahih) \"No one has ever eaten food better than to eat from the work of his own hand.\"\n\n80 - (Sahih) \"Charity is not lawful for a rich person nor for a strong, able-bodied person.\"\n\n81 - (Sahih) From Abdullah bin Adi Al-Khiyar that two men informed him that they came to the Prophet (pbuh) asking him for charity. He looked them up and down and saw that they were sturdy. He said: \"If you wish, I will give you, but there is no share in it for a rich person nor for a strong person capable of earning.\"\n\n82 - (Sahih) Qabisah bin Al-Mukhariq (ra) said: I carried a financial burden (Hamalah) [to reconcile between people], so I came to the Messenger of Allah (pbuh) asking him for help with it. He said: \"Stay until the charity (Sadaqah) comes to us, and we will order it for you.\" Then he said: \"O Qabisah, asking is not lawful except for one of three: a man who has carried a financial burden (to reconcile people), so asking is lawful for him until he acquires it, then he refrains; a man whom a calamity has struck, destroying his wealth, so asking is lawful for him until he acquires the bare necessities of life—or he said, a sufficiency of life; and a man who has been struck by poverty such that three men of reason from his people say, 'So-and-so has been struck by poverty,' so asking is lawful for him until he acquires the bare necessities of life—or he said, a sufficiency of life. Anything other than these forms of asking, O Qabisah, is illicit gain (Suht) that its owner eats as illicit gain.\" Narrated by Muslim. It is in Al-Irwa. Hamalah is when fighting or the like occurs between two groups, and a person reconciles them with money he pledges upon himself. Jarihah is a calamity that strikes a person's wealth. Qiwam is what sustains a person's affairs like money etc. Sadad is what fills the need of the destitute and suffices him. Faqah is poverty. Hija is reason/intellect.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 36
  },
  {
    "serial_number": "3193686",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "83 - (Da'if - Weak) It came in the saying of Umar: \"If you give, enrich.\" Weak. Narrated by Abu Ubayd in Al-Amwal via Amr bin Dinar who said: Umar said. I say: This chain is weak and interrupted; Amr bin Dinar was born two years after the death of Umar bin Al-Khattab.\n\n84 - (Sahih) \"Whoever among you can afford the means of marriage, let him marry, for it is more effective in lowering the gaze and protecting the private parts.\" Sahih. Narrated by Al-Bukhari, Muslim, Abu Dawood, Al-Tirmidhi, Al-Nasa'i, Al-Darimi, Ibn Majah, and Ahmad from the hadith of Ibn Mas'ud. He added: \"And whoever cannot, let him fast, for it acts as a shield for him.\"",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 37
  },
  {
    "serial_number": "3193688",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "85 - (Sahih) 2553 - And Yahya bin Ma'in told me, Marwan bin Mu'awiyah Al-Fazari told us, Yazid bin Kaysan told us, from Abu Hazim from Abu Huraira who said: A man came to the Prophet (pbuh) and said: \"I married a woman from the Ansar.\" The Prophet (pbuh) said to him: \"Did you look at her? For there is something in the eyes of the Ansar.\" He said: \"I have looked at her.\" He said: \"For how much did you marry her?\" He said: \"For four Uqiyahs.\" The Prophet (pbuh) said to him: \"For four Uqiyahs! It is as if you carve silver from the side of this mountain! We do not have anything to give you, but perhaps we will send you on an expedition from which you might acquire something.\" So he sent an expedition to Bani Abs and sent that man among them. * Sahih. Narrated by Muslim.\n\n86 - (Sahih) 220 - Hisham bin Ammar told us, Hafs bin Sulaiman told us, Kathir bin Shanzir told us, from Muhammad bin Sirin from Anas bin Malik who said: The Messenger of Allah (pbuh) said: \"Seeking knowledge is a duty upon every Muslim, and placing knowledge with other than its people is like hanging pearls, jewels, and gold on pigs.\" * \"Seeking knowledge is a duty upon every Muslim\" is Sahih. Narrated by Ibn Majah and the wording is his. It is narrated from a group of Companions including Anas bin Malik, Abdullah bin Amr, Abu Sa'id Al-Khudri, Abdullah bin Mas'ud, and Ali. Refer to the book as it contains a lengthy study of the hadith.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 38
  },
  {
    "serial_number": "3193690",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "87 - (Sahih) \"O servants of Allah, seek medical treatment, for He who created the disease created the cure.\"\n\n88 - (Sahih) 2262 - Yahya bin Bukayr told us, Al-Layth told us, from Uqail from Ibn Shihab that Salim informed him that Abdullah bin Umar (may Allah be pleased with them both) informed him that the Messenger of Allah (pbuh) said: \"A Muslim is the brother of a Muslim; he does not wrong him nor surrender him. Whoever is in the need of his brother, Allah is in his need. Whoever relieves a Muslim of a distress, Allah will relieve him of a distress from the distresses of the Day of Resurrection. And whoever covers a Muslim, Allah will cover him on the Day of Resurrection.\" * Sahih. Narrated by Al-Bukhari and the wording is his, and Ahmad and others. It is in Al-Sahihah 504.\n\n89 - (Sahih) 61 - Abdullah bin Yusuf told us, he said Al-Layth told us, from Sa'id (who is Al-Maqburi), from Sharik bin Abdullah bin Abi Namir that he heard Anas bin Malik saying: While we were sitting with the Prophet (pbuh) in the mosque, a man entered on a camel, made it kneel in the mosque, then tied it. Then he said to them: \"Which of you is Muhammad?\" The Prophet (pbuh) was reclining among them. We said: \"This white man reclining.\" The man said to him: \"O son of Abdul Muttalib.\" The Prophet (pbuh) said to him: \"I have answered you.\" The man said to the Prophet (pbuh): \"I am going to ask you and I will be harsh in questioning, so do not find anything against me in yourself.\" He said: \"Ask whatever appears to you.\" He said: \"I ask you by your Lord and the Lord of those before you, did Allah send you to all people?\" He said: \"O Allah, yes.\" He said: \"I adjure you by Allah, did Allah command you that we perform the five prayers in the day and night?\" He said: \"O Allah, yes.\" He said: \"I adjure you by Allah, did Allah command you that we fast this month of the year?\" He said: \"O Allah, yes.\" He said: \"I adjure you by Allah, did Allah command you to take this charity from our rich and distribute it amongst our poor?\" The Prophet (pbuh) said: \"O Allah, yes.\" The man said: \"I have believed in what you brought, and I am a messenger from my people behind me, and I am Dimam bin Tha'labah, brother of Bani Sa'd bin Bakr.\" Narrated by Musa bin Isma'il and Ali bin Abdul Hamid from Sulaiman bin Al-Mughira from Thabit from Anas from the Prophet (pbuh) with this. * Sahih. Narrated by Al-Bukhari and the wording is his, and Al-Nasa'i.\n\n90 - (Hasan) 1384 - Nasr bin Ali told us, my father informed us, Ibrahim bin Ata', the freed slave of Imran bin Husayn, informed us from his father that Ziyad or some of the rulers sent Imran bin Husayn [to collect] the charity. When he returned, he said to Imran: \"Where is the money?\" He said: \"Did you send me for the money? We took it from where we used to take it during the time of the Messenger of Allah (pbuh) and we placed it where we used to place it during the time of the Messenger of Allah (pbuh).\" * Hasan. Narrated by Abu Dawood and the wording is his, and Ibn Majah.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 39
  },
  {
    "serial_number": "3193694",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "91 - (Hasan) \"I am closer to every Muslim than his own self. Whoever leaves wealth, it is for his heirs, and whoever leaves a debt or dependents (diya'a), then it is to me and upon me.\" Sahih. It is in Al-Irwa. It has a witness from the hadith of Jabir in a raised (Marfu') form with the wording: \"I am closer to the believers than their own selves. Whoever leaves wealth, it is for his family, and whoever leaves a debt or dependents, then it is to me and upon me, and I am closer to the believers.\" Narrated by Ahmad and Muslim in shortened form, and this is a narration of Ahmad.\n\n92 - (Sahih) \"Whoever among you lives will see much difference. So adhere to my Sunnah and the Sunnah of the Rightly Guided Caliphs after me; bite onto it with your molars.\" Sahih. It is in Al-Irwa.\n\n93 - (Sahih) \"All of you are shepherds and all of you are responsible for his flock. The Imam is a shepherd and is responsible for his flock. The man is a shepherd in his family and is responsible for his flock.\" Sahih. It is in Ghayat Al-Maram 269.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 40
  },
  {
    "serial_number": "3193697",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Extraction of Hadiths regarding the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "The Islamic Office - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "94 - (Sahih) \"Whoever believes in Allah and the Last Day, let him honor his neighbor.\" Sahih. It is extracted in Mukhtasar Sahih Muslim and Sahih Al-Jami' Al-Saghir.\n\n95 - (Da'if / Weak) Be good to your neighbor and you will be a Muslim. Weak. See Hadith number 17 from The Problem of Poverty.\n\n96 - (Sahih / Authentic) Gabriel continued to recommend to me (good treatment of) the neighbor until I thought he would make him an heir. Authentic. It is in *Al-Irwa'*.\n\n97 - (Sahih / Authentic) He is not a believer who spends the night satiated while his neighbor to his side is hungry and he knows. Authentic. It is in *Silsilat Al-Sahihah* 149.\n\n98 - (Da'if / Weak) Any people of a courtyard (neighborhood) among whom a person wakes up hungry, the covenant of Allah has become clear of them. Weak.\n\n99 - (Sahih / Authentic) From Abu Dharr, he said: My close friend (pbuh) advised me: \"If you cook a broth, add more water to it, then look for a household from your neighbors and give them some of it as a kindness.\" Authentic. It was extracted by Muslim—and the wording is his—Al-Bukhari in *Al-Adab Al-Mufrad*, Al-Darimi, and Ahmad.",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 41
  },
  {
    "serial_number": "3193703",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "100 - (Sahih / Authentic) From Aisha, she said: I said, \"O Messenger of Allah, I have two neighbors, so to which of them should I give a gift?\" He said: \"To the one whose door is closer to you.\" Authentic. It was extracted by Al-Bukhari in *Al-Adab Al-Mufrad*—and the wording is his—Al-Tahawi in *Mushkil Al-Athar*, Al-Tayalisi, Ahmad, and Al-Khatib.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 42
  },
  {
    "serial_number": "3193704",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "101 - (Sahih / Authentic) Mujahid said: I was with Abdullah bin Umar while a servant of his was skinning a sheep. He said: \"O boy, when you skin it, start with our Jewish neighbor.\" He said that repeatedly. He said to him: \"How often do you say this!\" He said: \"Indeed the Messenger of Allah (pbuh) kept recommending the neighbor to us until we thought he would make him an heir.\" Authentic. It was extracted by Al-Bukhari in *Al-Adab Al-Mufrad*, Abu Dawud, and Al-Tirmidhi.\n\n102 - (Hasan / Good) Whoever has the means but does not offer a sacrifice, let him not approach our place of prayer. Hasan. It was extracted by Ibn Majah, Al-Khatib, and Al-Hakim from Abu Hurairah (may Allah be pleased with him) who said: The Prophet (pbuh) said: \"Whoever has wealth but does not offer a sacrifice, let him not approach our place of prayer.\" And he said once: \"Whoever finds means but does not slaughter, let him not approach our place of prayer.\" This is the wording of Al-Muqri with Al-Hakim. With Ahmad it is with the other wording, and he said: \"but does not offer a sacrifice.\" And the wording of Ibn Al-Hubbab with Al-Hakim is: \"Whoever finds means to sacrifice but does not sacrifice, let him not attend our place of prayer.\" And its wording with Ibn Majah is: \"Whoever has means and does not sacrifice, let him not approach our place of prayer.\"",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 43
  },
  {
    "serial_number": "3193706",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "103 - (Da'if / Weak) From Fatimah bint Qais, she said: I asked the Prophet or the Prophet (pbuh) was asked about Zakat. He said: \"Indeed, there is a right (due) in wealth other than Zakat.\" Then he recited this verse which is in Al-Baqarah: {Righteousness is not that you turn your faces toward the east or the west}.\n\n104 - (Sahih / Authentic) The believer to the believer is like a building, parts of which strengthen others. Authentic. It was extracted by Al-Bukhari, Muslim, Al-Nasa'i, Al-Tirmidhi, and Ahmad. Al-Bukhari added in a narration: \"And he interlaced his fingers.\" Al-Tirmidhi said: A Hasan Sahih Hadith.\n\n105 - (Sahih / Authentic) The likeness of the believers in their mutual love, mercy, and compassion is like the likeness of a single body; if one limb complains, the rest of the body responds to it with wakefulness and fever. Authentic. It is in *Mukhtasar Muslim* 1773 and *Silsilat Al-Sahihah* 1083.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 44
  },
  {
    "serial_number": "3193709",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "106 - (Sahih / Authentic) The Muslim is the brother of the Muslim; he does not wrong him nor surrender him (to the enemy).\n\n107 - (Da'if / Weak) Any people of a courtyard (neighborhood) among whom a person wakes up hungry, the covenant of Allah has become clear of them.\n\n108 - (Sahih / Authentic) Whoever does not show mercy to people, Allah will not show mercy to him. Authentic. It was extracted by Al-Bukhari, Muslim, Al-Tirmidhi, and Ahmad. Ahmad added in a narration: \"And whoever does not forgive will not be forgiven.\" And it is with Al-Bukhari, Muslim, and others from the hadith of Abu Hurairah raised, abbreviated with the wording: \"Whoever does not show mercy will not be shown mercy.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 45
  },
  {
    "serial_number": "3193712",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "109 - (Sahih / Authentic) Whoever has food for two, let him take a third, and whoever has food for four, let him take a fifth or a sixth.\n\n110 - (Sahih / Authentic) The Muslim is the brother of the Muslim; he does not wrong him nor surrender him.\n\n111 - (Sahih / Authentic) Whoever has a spare mount, let him give it to the one who has no mount, and whoever has spare provision, let him give it to the one who has no provision. He said: He mentioned types of wealth until we thought that none of us had a right to any surplus. Authentic. It was extracted by Muslim, Abu Dawud, and Ahmad from the hadith of Abu Saeed Al-Khudri who said: While we were on a journey with the Prophet (pbuh), a man came on a mount of his. He said: He began turning his gaze right and left. So the Messenger of Allah (pbuh) said... and he mentioned it.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 46
  },
  {
    "serial_number": "3193715",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "112 - (Sahih / Authentic) Feed the hungry and free the captive. Authentic. It was extracted by Al-Bukhari, Al-Darimi, and Ahmad from the hadith of Abu Musa Al-Ash'ari raised with it, and they added—except Al-Darimi—\"and visit the sick.\" In a narration by Al-Bukhari: \"and answer the inviter\" instead of \"feed the hungry.\" And in another by him: \"free the captive and answer the inviter.\"\n\n113 - (Sahih / Authentic) The servant says: \"My wealth! My wealth!\" But he has nothing of his wealth except three: what he ate and consumed, or what he wore and wore out, or what he gave and stored away. And what is other than that is going and he is leaving it for the people. Authentic. It was extracted by Muslim, Ibn Hibban, and Ahmad from the hadith of Abu Hurairah. It has a witness from the hadith of Abdullah bin Al-Shikhkhir who said: I came to the Prophet (pbuh) while he was reciting {Competition in increase diverts you}. He said: \"The son of Adam says: 'My wealth! My wealth!' He said: 'And do you have, O son of Adam, of your wealth except what you ate and consumed, or wore and wore out, or gave in charity and passed on?'\" Extracted by Muslim, Al-Nasa'i, Al-Tirmidhi, Al-Hakim, and Ahmad. Al-Tirmidhi said: A Hasan Sahih Hadith.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 47
  },
  {
    "serial_number": "3193717",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "114 - (Sahih / Authentic) \"Which of you loves the wealth of his heir more than his own wealth?\" They said: \"O Messenger of Allah, there is none of us but his own wealth is more beloved to him.\" He said: \"Then his wealth is what he sent forth, and the wealth of his heir is what he left behind.\" Authentic. It was extracted by Al-Bukhari, Al-Nasa'i, and Al-Tahawi.\n\n115 - (Sahih / Authentic) There is none of you but Allah will speak to him, there being no interpreter between him and Him. He will look to his right and see nothing but what he sent forth, and he will look to his left (Ash'am) and see nothing but what he sent forth, and he will look in front of him and see nothing but the Fire facing his face. So fear the Fire even with half a date. Authentic. It was extracted by Al-Bukhari, Muslim, Al-Tirmidhi, Ibn Majah, Ibn Khuzaimah, and Ahmad.\n\n116 - (Sahih / Authentic) Whoever gives in charity the equivalent of a date from good earnings—and Allah accepts nothing but good—Allah accepts it with His Right Hand, then raises it for its owner just as one of you raises his foal (colt when first born) until it becomes like a mountain. Authentic. It was extracted by Al-Bukhari, Muslim, Al-Nasa'i, Al-Tirmidhi, Al-Darimi, Ibn Majah, and Ahmad, and it has numerous paths.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 48
  },
  {
    "serial_number": "3193720",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "117 - (Sahih / Authentic) Charity extinguishes sin just as water extinguishes fire. Authentic. It was extracted by Ahmad, Al-Tirmidhi, Ibn Majah, Ibn Hibban, and Al-Hakim.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 49
  },
  {
    "serial_number": "3193721",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "118 - (Sahih / Authentic) Every person will be in the shade of his charity until judgment is passed between the people. Authentic. It was extracted by Ibn Khuzaimah, Ibn Hibban, Al-Hakim, Ahmad, and Abu Nu'aym in *Al-Hilyah*.\n\n119 - (Hasan / Good) One dirham surpassed one hundred thousand dirhams. A man said: \"How is that, O Messenger of Allah?\" He said: \"A man having much wealth took from his surplus one hundred thousand dirhams and gave them in charity, and a man having nothing but two dirhams took one of them and gave it in charity.\" Hasan. It was extracted by Al-Nasa'i, Ibn Khuzaimah, Ibn Hibban, Al-Hakim, and Ahmad.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 50
  },
  {
    "serial_number": "3193723",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "120 - (Sahih / Authentic) When {Who is it that would loan Allah a goodly loan so He may multiply it for him} was revealed, Abu Al-Dahdah Al-Ansari said: \"O Messenger of Allah, does Allah Almighty want a loan from us?\" He said: \"Yes, O Abu Al-Dahdah.\" He said: \"Show me your hand, O Messenger of Allah.\" So he gave him his hand. He said: \"I have loaned my Lord Almighty my garden.\" - Ibn Mas'ud said - And he had a garden containing six hundred palm trees, and Umm Al-Dahdah and her children were in it. He said: So Abu Al-Dahdah came and called her: \"O Umm Al-Dahdah!\" She said: \"Labbayk (At your service).\" He said: \"Come out, for I have loaned it to my Lord Almighty.\" Authentic. It was extracted by Ibn Jarir in his Tafsir and Ibn Abi Hatim as in Tafsir Ibn Kathir from the path of Khalaf, and this chain is weak. And it was narrated by Abu Ya'la and Al-Tabarani, and their men are trustworthy, and the men of Abu Ya'la are men of the Sahih, and it has other witnesses.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 51
  },
  {
    "serial_number": "3193724",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "121 - (Sahih / Authentic) Abdullah bin Yusuf told us, Malik informed us from Ishaq bin Abdullah bin Abi Talhah that he heard Anas bin Malik (may Allah be pleased with him) saying: Abu Talhah was the wealthiest of the Ansar in Medina in terms of palm trees, and the most beloved of his wealth to him was Bairuha'. It was facing the mosque, and the Messenger of Allah (pbuh) used to enter it and drink from its good water. Anas said: When this verse was revealed {Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love}, Abu Talhah stood up to the Messenger of Allah (pbuh) and said: \"O Messenger of Allah, Allah Blessed and Exalted says {Never will you attain the good [reward] until you spend [in the way of Allah] from that which you love}, and indeed the most beloved of my wealth to me is Bairuha', and it is a charity for Allah, I hope for its righteousness and its storage with Allah. So place it, O Messenger of Allah, wherever Allah shows you.\" He said: So the Messenger of Allah (pbuh) said: \"Bakh! That is a profitable wealth! That is a profitable wealth! I have heard what you said, and I see that you should place it among your relatives.\" So Abu Talhah said: \"I will do so, O Messenger of Allah.\" So Abu Talhah divided it among his relatives and his cousins. Ruh followed him, and Yahya bin Yahya and Ismail narrated from Malik: 'Raih' (going/impermanent - likely a variant or error for Rabih). * Authentic. It was extracted by Al-Bukhari—and the wording is his—Muslim, Al-Darimi, and Ahmad from the hadith of Anas. From the Encyclopedia of Hadith I add: It was also extracted by Malik, Abu Dawud, Al-Nasa'i, and Al-Tirmidhi.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 52
  },
  {
    "serial_number": "3193725",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "122 - (Sahih / Authentic) When a human being dies, his deeds end except for three things: a continuous charity, beneficial knowledge, or a righteous child who prays for him. Authentic. It is extracted in *Al-Irwa'*.\n\n123 - (Sahih / Authentic) Umar acquired land from the lands of Khaybar. He said: \"O Messenger of Allah, I have acquired land in Khaybar; I have never acquired wealth more precious to me than it. So what do you command me?\" He (pbuh) said: \"If you wish, you can keep its original (land) and give (its produce) in charity.\" So Umar gave it in charity on the condition that it would not be sold, nor given as a gift, nor inherited; for the poor, the relatives, the freeing of slaves, the weak (or guests), and the wayfarer. There is no sin on the one who administers it if he eats from it reasonably and feeds others without accumulating wealth (or in a wording: without seeking to enrich himself with wealth). Authentic. It is in *Al-Irwa'*.\n\n124 - (Da'if / Weak) Whoever hoards food for forty nights has become clear of Allah and Allah has become clear of him. Weak. It is in *Ghayat Al-Maram* 324.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 53
  },
  {
    "serial_number": "3193728",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "125 - (Sahih / Authentic) Many a disheveled, dusty person with two worn-out garments, paid no attention to, if he swore by Allah, He would fulfill it. Authentic. It was extracted by Al-Tahawi in *Al-Mushkil*, Al-Hakim, and Abu Nu'aym in *Al-Hilyah*. In a narration he added after \"two worn-out garments\": \"eyes turn away from him in scorn.\" It is in the *Musnad* and the *Two Sahihs* and others from other paths from Anas with the wording: \"Indeed among the servants of Allah are those who if they swore by Allah, He would fulfill it,\" and it contains a story. And from the hadith of Harithah bin Wahb who said: The Messenger of Allah (pbuh) said: \"Shall I not inform you of the people of Paradise? Every weak, oppressed person, if he swore by Allah, He would fulfill it. Shall I not inform you of the people of Fire? Every cruel, haughty, arrogant person.\" Extracted by Al-Bukhari, Muslim, Ibn Majah, and Ahmad from Ma'bad bin Khalid from Harithah bin Wahb.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 54
  },
  {
    "serial_number": "3193729",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "126 - (Sahih / Authentic) A huge fat man will come on the Day of Resurrection and he will not weigh the wing of a mosquito in the sight of Allah. And read if you wish: {We will not assign to them on the Day of Resurrection any weight}. Authentic. It was extracted by Al-Bukhari and Muslim from the hadith of Abu Hurairah raised.\n\n127 - (Sahih / Authentic) From Adi bin Hatim: I was with the Prophet (pbuh) when a man came to him complaining of poverty, then another came complaining of highway robbery (Adi had come to the Prophet (pbuh) to embrace Islam, and the Prophet (pbuh) feared that it might weaken his resolve and discourage him when he saw the weakness of his people and their poverty and the lack of security in their land at that time, so he gave the mentioned glad tidings for encouragement and strengthening). He said: \"O Adi, have you seen Al-Hirah?\" I said: \"I have not seen it, but I have been informed about it.\" He said: \"If you live long, you will surely see a woman traveling in a litter from Al-Hirah until she circumambulates the Kaaba fearing no one but Allah.\" And in a narration: \"It will not be long before the caravan leaves for Mecca without a guard.\" Adi said: I said to myself, \"Where are the bandits of Tayy who have inflamed the land?\" And the Prophet (pbuh) continued his speech to him saying: \"And if you live long, the treasures of Kisra will surely be opened.\" I said: \"Kisra son of Hormuz?\" He said: \"Kisra son of Hormuz. And if you live long, you will surely see a man coming out with a handful of gold or silver seeking someone to accept it from him, but he will not find anyone to accept it from him.\" Authentic. It was extracted by Al-Bukhari and Ahmad from Adi bin Hatim.",
    "foot_note": "None\n\nNone",
    "book_id": "365",
    "new_page_number": 55
  },
  {
    "serial_number": "3193731",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "128 - (Sahih / Authentic) Give charity, for a time will come upon you when a man walks with his charity and will not find anyone to accept it. The man will say: \"If you had brought it yesterday, I would have accepted it, but today I have no need for it.\" Authentic. It was extracted by Al-Bukhari, Muslim, Al-Nasa'i, and Ahmad from the hadith of Harithah bin Ma'bad.\n\n129 - (Sahih / Authentic) The Hour will not be established until wealth increases among you and overflows, so that the owner of wealth worries about who will accept his charity, and until he offers it, and the one to whom it is offered says: \"I have no need for it.\" Authentic. It was extracted by Al-Bukhari, Muslim, and Ahmad from the hadith of Abu Hurairah.\n\n130 - (Sahih / Authentic) There will surely come upon people a time when a man goes around with charity of gold, yet he will not find anyone to take it from him. Authentic. It was extracted by Al-Bukhari and Muslim from the hadith of Abu Musa Al-Ash'ari.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "365",
    "new_page_number": 56
  },
  {
    "serial_number": "3193734",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Grading the Hadiths of the Problem of Poverty and How Islam Addressed It",
    "edition": "First - 1405 AH - 1984 AD",
    "publisher": "Al-Maktab Al-Islami - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "131 - (Sahih / Authentic) That the Prophet (pbuh) said to Mu'adh when he sent him: \"Take it from their rich and return it to their poor.\" Authentic. It is in *Al-Irwa'*.",
    "foot_note": "None",
    "book_id": "365",
    "new_page_number": 57
  }
]