[
  {
    "text": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي\nالمؤلف: محمود بن إبراهيم الخطيب\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "new_page_number": 1
  },
  {
    "text": "sn: 1662\nbook_title: تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي\nbook_link: https://shamela.ws/book/989\nbook_id: 989\nauthor_name: محمود بن إبراهيم الخطيب\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1648\nauthor_ID: 1648\neditor: Null\npublisher: Null\nedition: Null\npages: 82\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: التجويد والقراءات\ncategory_id: 5",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "new_page_number": 2
  },
  {
    "serial_number": "1159918",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: التجويد والقراءات الكتاب : تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي المؤلف : د . محمود بن إبراهيم الخطيب عدد الصفحات : 82 [ الكتاب مرقم آليا غير موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالكتاب : تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي المؤلف : د . محمود بن إبراهيم الخطيب عدد الصفحات : 82 [ الكتاب مرقم آليا غير موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nالمؤلف : د . محمود بن إبراهيم الخطيب عدد الصفحات : 82 [ الكتاب مرقم آليا غير موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nعدد الصفحات : 82 [ الكتاب مرقم آليا غير موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\n[ الكتاب مرقم آليا غير موافق للمطبوع ] تاريخ النشر بالشاملة : 8 ذو الحجة 1431\nتاريخ النشر بالشاملة : 8 ذو الحجة 1431",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 3
  },
  {
    "serial_number": "1159919",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي إعداد د. محمود بن إبراهيم الخطيب الأستاذ المساعد بقسم الدراسات الإسلامية بكلية المعلمين بالقنفذة رئيس مركز البحوث والدراسات التربوية  المقدمة: الحمد لله رب العالمين، أنزل القرآن هدى للناس وبينات من الهدى والفرقان، يهدي للتي هي أقوم، والصلاة والسلام على من لا نبي بعده سيدنا محمد صلى الله عليه وسلم، وعلى آله وصحابته ومن اهتدى بهديهم إلى يوم الدين، تركنا على المحجة البيضاء ليلها كنهارها لا يزيغ عنها إلا هالك. أما بعد: فإن الله سبحانه وتعالى تكفل بحفظ كتابه العزيز بقوله تعالى: {إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ} (الحجر: 9) ، وقد قيض الله عز وجل للقيام بهذه الأمانة العظيمة في هذا العصر حكومة خادم الحرمين الشريفين التي اتخذت كتاب الله أساسًا لها في الحياة والحكم، وعنيت به عناية فائقة وظهر ذلك جليًا في مجالات متعددة بما فيها تلاوته وتجويده وحفظه، وتنظيم المسابقات المحلية والدولية، وإقامة المدارس والكليات الخاصة به، وطباعته وتوزيعه، وترجمة معانيه، ونشره في كل وسيلة ممكنة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 4
  },
  {
    "serial_number": "1159920",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "وقد أحسنت وزارة الشؤون الإسلامية والأوقاف والدعوة والإرشاد ممثلة في مجمع الملك فهد لطباعة المصحف الشريف بالمدينة المنورة، بعقد ندوة عناية المملكة العربية السعودية بالقرآن الكريم وعلومه تحقيقًا لأهداف عديدة، ومن ذلك التعريف بأساليب تعليم القرآن الكريم، وإمكان الاستفادة من التقانة الحديثة في ذلك، ويشرفني أن أساهم في هذه الندوة المباركة بالكتابة في موضوع: \" تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي \".",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 5
  },
  {
    "serial_number": "1159921",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "مشكلة البحث: نظرًا لتطور طرق التعليم بصورة عامة وإمكان الإفادة من هذه الطرق في تعليم القرآن الكريم وتمسك كثير من المعلمين بالموروث من الأساليب والإجراءات غير التربوية التي تتم في الموقف الصفّي، كانت الحاجة لتقويم طرق تعليم القرآن الكريم السائدة في التعليم العام والتعليم الجامعي لمعرفة فاعليتها وجدواها. هذا الأمر يتطلب طرح التساؤلات التالية: ما طرق تعليم القرآن الكريم السائدة في التعليم العام؟ وما إيجابياتها وما سلبياتها؟ ما طرق تعليم القرآن الكريم السائدة في التعليم الجامعي؟ وما إيجابياتها وما سلبياتها؟ هل توجد فروق بين الطرق المختلفة لتعليم القرآن الكريم في المراحل المختلفة للتعليم؟",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 6
  },
  {
    "serial_number": "1159922",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "أهمية البحث:",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 7
  },
  {
    "serial_number": "1159923",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "تبرز أهمية البحث من خلال مكانة القرآن الكريم في حياة المسلمين عامة، حيث يمثل رمز وحدة الأمة وهو مصدر أساسي في التربية الإسلامية ولكل فكر إسلامي صحيح، فهو القاعدة التي يرتكز عليها الإسلام عقيدةً وتشريعًا وتنظيمًا وبما أن تعليم القرآن الكريم قد قطع شوطًا كبيرًا هذه الأيام، حيث أعطت حكومة المملكة العربية السعودية أهميةً كبيرةً لتعليمه، وأكدت وجوب العناية بتلاوته وحفظه وضبطه، وبما أن كثيرًا من الذين يتولون تعليم القرآن الكريم من غير المؤهلين تربويًا، ولا دراية لهم بالأساليب التربوية الحديثة للتعليم بصورة عامة، مع عدم استفادتهم من التقنيات الحديثة في التعليم، حيث إن معظم المعلمين في المرحلة الابتدائية من حملة دبلوم معهد المعلمين الثانوي، أو كليات المعلمين المتوسطة، كما أن معظم مدرسي القراءات في كليات المعلمين بخاصة من حملة الشهادة العالية في القراءات، فكان لا بد من تقويم الطرق المتبعة في تعليم القرآن الكريم حتى تكون النتائج تتناسب مع الجهد المبذول، حيث إن تعليم القرآن الكريم ينجم عنه آثار إيجابية تعين المتلقي في حياته العلمية والعمليّة، فضلًا عما يناله من الأجر والثواب العظيم وما تتغذى به",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 8
  },
  {
    "serial_number": "1159924",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "روحه من الإيمان. وانطلاقًا من الدور التربوي والتعليمي والديني الهامّ للقرآن الكريم، تصبح الحاجة ماسّة إلى إجراء بحوث ودراسات للوقوف على طرق تدريس القرآن الكريم، وتقويمها، بتشخيص الواقع وقياس ما تم تحقيقه لتسديد نواحي الضعف وتعزيز جوانب القوة (1) ، والتعرف على الوسائل التي يجب تأمينها لتحسين طرق التعليم (2) ، للوصول إلى الطرق المثلى لتعليم القرآن الكريم مع إمكان الإفادة من التقانة الحديثة التي تناسب كل مرحلة من مراحل التعليم، كل ذلك لأهم H ية القرآن في بناء الشخصية المسلمة السّوية التي ستؤدي بالمسلم إلى احتلال مكان الصدارة كما كان عليه السلف الصالح. ويقدم الباحث استبانة يمكن استخدامها في تقويم أداء المعلم الكريم في الموقف الصفي للكشف عن الأساليب المتبعة في مراحل التعليم المختلفة.",
    "foot_note": "1. (1) شحاتة،1420هـ،323. \n2. أحمد،1416هـ،197.",
    "book_id": "989",
    "new_page_number": 9
  },
  {
    "serial_number": "1159925",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "مصطلحات الدراسة:  التقويم Evaluation: عملية إصدار الحكم على قيمة الأشياء أو الأشخاص أو الموضوعات، ويشمل كل جوانب العملية التعليمية بما فيها طرق التدريس، كما يتضمن معنى التحسين أو التعديل أو التطوير الذي يعتمد على أسس ومعايير تربوية محددة سابقًا (1) . وهو وسيلة يستعان بها لتشخيص الواقع وقياس ما تم تحقيقه لتسديد نواحي الضعف، وتعزيز جوانب القوة (2) .",
    "foot_note": "1. (1) راشد، 1408هـ، 214) ، (البشير، 1416هـ، 86. \n2. شحاتة، 1419هـ، 323) ، (عبد القادر، 1416هـ، 165) .",
    "book_id": "989",
    "new_page_number": 10
  },
  {
    "serial_number": "1159926",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "طريقة التدريس Teaching Method: ما يتبعه المعلم من خطوات وإجراءات متسلسلة متتالية مترابطة، يلتزمها في المواقف الصفية (1) لتحقيق هدف أو مجموعة أهداف تعليمية (2) مخطط لها بتوصيل المادة الدراسية إلى أذهان الطلبة بأيسر السبل وأقل الوقت والنفقات (3) .",
    "foot_note": "1. (1) عيد، 1420هـ، 18. \n2. (4) قنديل، 1418هـ، 155. \n3. (5) عبد القادر، 1416هـ، 18) ، (جان، 1418هـ، 424.",
    "book_id": "989",
    "new_page_number": 11
  },
  {
    "serial_number": "1159927",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "التعليم: يطلق على العملية التربوية كلها، ولكن المقصود هنا (في البحث) هو التدريس أو الدور الذي يقوم به المدرس في العملية التعليمية. وكل طريقة من طرق التدريس لها طبيعتها وعناصرها المختلفة المتداخلة في نسيج واحد يشمل الأهداف والوسائل التعليمية الميسرة وأسلوب إعداد الدروس (1) ، والإجراءات المتبعة لتعليم مجموعة من المتعلمين في زمن معين وتحت ظروف مختلف المعوقات في البيئة التعليمية (2) . وعملية التدريس بواقعها ما هي إلا نتاج مجموعة من طرق التدريس المتنوعة التي تحقق أغراض الموقف التعليمي (3) .",
    "foot_note": "1. (1) 1) اللقاني، 1988م، 220، رشدي، 1983م، 29-30. \n2. القعيد، 1414هـ، 218. \n3. قنديل، 1418هـ،170",
    "book_id": "989",
    "new_page_number": 12
  },
  {
    "serial_number": "1159928",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "القرآن الكريم: هو كتاب الله المنزل على محمد صلى الله عليه وسلم، المتعبد بتلاوته (1) .",
    "foot_note": "1. (1) الرومي، 1420هـ، 21",
    "book_id": "989",
    "new_page_number": 13
  },
  {
    "serial_number": "1159929",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "مراحل التعليم العام: (في البحث) يقصد بذلك المرحلة الابتدائية والمتوسطة والثانوية في المدارس، عدا مدارس تحفيظ القرآن الكريم، ومدارس الرئاسة العامة لتعليم البنات. التعليم الجامعي: كل تعليم يلتحق به من أتم دراسة المرحلة الثانوية، لدراسة برامج تعليمية وتدريبية في شتى التخصصات النظرية والعملية، مدة أربع سنوات غالبًا.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 14
  },
  {
    "serial_number": "1159930",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "الإطار النظري: القرآن الكريم كلام الله سبحانه وتعالى المُنزل على سيد البشر صلى الله عليه وسلم المتعبد بتلاوته (1) ، فهو ذو بناء فريد وتركيب معجز، وتلاوته عمل تعبّدي تهذب النفس، وتمنحها القدرة على مجابهة الحياة الدنيوية، وتُعدّها لحياة الآخرة، وعلينا عند تلاوته أن نتأدب بأدب القرآن من خشوع وخضوع وصفاء؛ حتى ينفذ ذلك إلى قلوب المتعلمين، ونكون نموذجًا يُحتذى، مراعين الأسس التالية عند تلاوته: إخراج الحروف من مخارجها مع وضوح الألفاظ، وجلاء المعاني، ومراعاة أحكام التجويد مهما كان مستوى المستمع للتلاوة، لأن ذلك أدعى إلى المحاكاة والتقليد عند المبتدئين من المتعلمين، مع الالتزام بتطبيق قواعد القراءة السّليمة لدى المتقدمين منهم ومعرفة المصطلحات والعلامات الموجودة في المصحف والتعرف على كيفية الوقوف وكيفية التصرف عند الاضطرار إلى الوقوف (2) الضبط لكلمات القرآن الكريم بالشكل؛ لما في ذلك من أهمية بالغة تتعلق بأمور العقيدة، لأن انحراف الحركة عن موضعها يؤدي إلى تغيير المعنى، وإفساد القراءة يقود إلى جعل الإيمان كفرًا، والحقيقة باطلًا.",
    "foot_note": "1. (1) الرومي، 1420هـ، 21 \n2. شحاتة، 1420هـ، 232.",
    "book_id": "989",
    "new_page_number": 15
  },
  {
    "serial_number": "1159931",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "التلاوة من المصحف، وتعريف المتعلمين برسم الكلمات فيه، (الرسم العثماني) وأن المسلمين قد حافظوا على هذا الرسم لحكمة لا نعرفها، لا لأن الذين كتبوها يجهلون قواعد الرسم الإملائي.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 16
  },
  {
    "serial_number": "1159932",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "وعلى المعلم أن يراعي المبادئ التالية لتعليم القرآن الكريم وتعلمه في المراحل المختلفة: 1.  التعليم القبلي: يستمع المعلم عادة في درس القرآن الكريم إلى تلاوة مباركة لمجموعة من الآيات التي سبق للمتعلم أن تعلمها في الدرس السابق، ويمكن أن يثير مجموعة من الأسئلة حول الأفكار العامة، أو الجزئية التي تضمنتها الآيات المذكورة؛ حتى يتمكن من ربط السابق باللاحق إن أمكن، وبذلك يعرف المعلم مواطن الضعف فيوليها اهتمامه ويعرف مواطن القوة فلا يضيع وقته فيها.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 17
  },
  {
    "serial_number": "1159933",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "2.  التمهيد: يمهد المعلم للسورة أو الآيات الكريمة بحديث سهل يتعلق بموضوع الدرس، ومن الممكن مناقشة الطلاب بأسئلة تمس محتوى الدرس، أو محتوى الدرس السابق، إذا كان ذا علاقة بالدرس الجديد، وذلك باستثارة معلوماتهم المختزنة، وذلك لتشويق الطلاب وجذب انتباههم إلى معرفة موضوع الآيات التي ستتلى (1) ، لأن الأسئلة وسيلة للكشف عن الحقائق واكتساب المعلومات، وإثارة للتفكير، وتنشيط للطلاب وتشجيع للطلبة المقصرين إذا أعطوا الأسئلة السهلة (2) ، لأن السؤال أداة العلم كما قال رسول الله صلى الله عليه وسلم: «العلم خزائن تفتحها المسألة» (3) .",
    "foot_note": "1. (1) موسى، 1420هـ،198 \n2. جان،1418هـ،302-307 \n3. الدارمي، 1386هـ، حديث رقم 545",
    "book_id": "989",
    "new_page_number": 18
  },
  {
    "serial_number": "1159934",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "3.  القراءة النموذجية: يقرأ المعلم الآيات موضوع الدرس قراءة نموذجية مرتلة خالية من الأخطاء، مراعيًا إخراج الحروف من مخارجها، مع التقيد بعلامات الوقف وما يليق بالقرآن من الخشوع، والطلاب منصتون وينظرون إلى الآيات في مصاحفهم، ويمكن تكرار القراءة مرات عدة، مع الاستعانة بالمسجل في ترتيل الآيات المذكورة، لتشويق الطلاب ودفع الملل عنهم، وتكرار التلاوة يتوقف على مستوى الطلاب (1) ، \"ومما تنبه إليه علماء التربية المسلمون، ضرورة ترتيل القرآن الكريم بحيث تستبين في القراءة الحروف والكلمات مجودة متقنة المخارج والنطق، لأن ذلك يساعد على فهم المعنى، كما أنه ضروري لتعظيم القرآن الكريم، ويرى العلماء الذين ألفوا في علوم القرآن هذا الرأي وينصحون بقراءة التحقيق والترتيل لفائدتهما في التعليم، فالتحقيق في القراءة يكون لرياضة الألسن، وتقويم الألفاظ ويستحب الأخذ به، وذكر بعضهم أن التحقيق يكون للرياضة والتعليم والتمرين، والترتيل يكون للتدبر والتفكير والاستنباط\" (2) . ويمكن للمعلم بعد القراءة النموذجية أن يكلف الطلاب بالقراءة الصامتة (الصدرية) وبذلك يمهد للقراءة الجهرية والشرح والمناقشة والتحليل.",
    "foot_note": "1. (1) موسى، 1420هـ،170. \n2. يونس، 1999م، 244",
    "book_id": "989",
    "new_page_number": 19
  },
  {
    "serial_number": "1159935",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "4.  القراءة الجمعية مع المدرس وهذا يناسب المرحلة الأولية (الدنيا) : يقوم المعلم بتهيئة الطلاب إلى أنه سيقرأ السورة أو النص موضوع الدرس جزءًا جزءًا، وعليهم أن يعيدوا بعده كل جزء يقرؤه، ثم يقرأ النص مجزأ، ويراقب الأطفال، وهم يقرؤون بعده، وفي هذا المجال تنبه علماء التربية المسلمون إلى أن الإيقاع الجماعي، والترديد الجماعي الناشئ عن اجتماع الصبيان يحمسهم للتعلم ويدفعهم إليه، ومثل هذا الإيقاع الجماعي والترتيل يدعو إليه بصفة خاصة علماء تعليم اللغات جميعهم في مراحل التعليم الأولى (1)",
    "foot_note": "1. (1) يونس، 1999م، 243.",
    "book_id": "989",
    "new_page_number": 20
  },
  {
    "serial_number": "1159936",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "5.  المنافسة في القراءة الجماعية وتقسيم الطلاب حسب قدراتهم الفكرية: يحاول المعلم أن يقسم الطلاب إلى مجموعات حسب جلوسهم في الفصل الدراسي، حيث تعيد كل مجموعة ما يقرؤه المعلم، ثم يكلف مجموعة أخرى بالإعادة وهكذا … لإثارة التنافس بينهم في إجادة القراءة، ويمكن تقسيمهم إلى مجموعات حسب قدراتهم الفكرية، ليعلمهم حسب قدراتهم، ويراعي الفروق الفردية بينهم من حيث القدرة التحصيلية، وفي هذا المجال يقول المربون المسلمون: يجب على المعلم أن يشخص طبيعة المتعلم من الذكاء والغباء على مقدار وسعه، ولا يكلفه بما لا يطيق، فإن كُلف يئس عن تحصيل العلم، فاتبع الهوى وأشكل تعليمه، وفي هذا يجب على المعلم أن يقتصر بالمتعلم على قدر فهمه (1) ، وفي هذا يقول الإمام الغزالي: \"ولولاه لما اختلف الناس في فهم العلوم ولما انقسموا إلى بليد لا يفهم بالتفهيم إلا بعد تعب طويل من المعلم، وإلى ذكي يفهم بأدنى رمز وإشارة، وإلى كامل تنبعث من نفسه حقائق الأمور بدون تعليم … وذلك مثل الأنبياء\" (2) .",
    "foot_note": "1. (1) يونس،1999م، 245 \n2. 1420هـ، ج1 / 122.",
    "book_id": "989",
    "new_page_number": 21
  },
  {
    "serial_number": "1159937",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "6.  القراءة الفردية: يكلف المعلم عددًا من الطلاب المجيدين تلاوة الآيات المباركة موضوع الدرس، ثم يكلف آخرين بالتلاوة، ومن المفضل أن يقرأ أكبر عدد ممكن من طلاب الصف، وعلى المعلم أن يتابع قراءة الطلاب وأن يصوب أخطاءهم، ويتبع في تصويبه طريقة الحوار والاستنتاج الذي يؤدي في النهاية إلى اكتشاف الطالب الخطأ بنفسه، ويجب أن لا يقاطعه أثناء القراءة، بل يتركه يتم الآية، ثم يبحث عن الخطأ، فإذا اكتشفه الطالب واصل القراءة، وإلا ترك الفرصة لغيره باكتشافه، وإذا لم يتمكن أحد من ذلك، أشار المعلم إليه (1) ، وإذا كان عدد الطلاب في الصف كثيرًا، وبخاصة في المراحل الأولية، يستعين المعلم بعدد من الطلاب النابهين لمساعدته في متابعة قراءة الطلاب الآخرين، يقول الغزالي في هذا المجال: \"فأما المرحلة الأولى، فقد كان على المدرس فيها أن يعلِّم عددًا محدودًا من الصبيان، فإذا كثر الطلاب في كتابه، عيّن من العرفاء عددًا يتناسب مع عدد الطلاب، بحيث يكون لكل عريف عدد قليل من الصبيان\" (2) ، وهذا ما يسمى في التربية الحديثة تعليم الأقران.",
    "foot_note": "1. (1) موسى، 1420هـ، 176 \n2. يونس، 1999م، 246",
    "book_id": "989",
    "new_page_number": 22
  },
  {
    "serial_number": "1159938",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "7.  أهمية المعنى وطريقة مناقشته: للمعنى في كل مادة مقروءة أهمية عظمى، فالمادة المقروءة لا تعني شيئًا إلا إذا فهم معناها، وعرفت من خلال المعنى، فالقراءة وسيلة للفهم، فهي ليست غاية في ذاتها، لذلك يجب على المعلم في درس القرآن الكريم أن يشرح الآيات المباركة ومفاهيمها شرحًا يتناسب مع قدرات طلابه، بحيث يتمكن المتعلمون من إدراك الأهداف والأحكام والأفكار العامة والجزئية التي تدل عليها الآيات، ويكون ذلك بأسلوب المناقشة والاستعانة بالوسائل المتعددة، حتى يدرك المتعلمون أن ما يتعلمونه يتصل بعقائدهم وحياتهم، وبذلك يتحقق الربط بين الآيات الكريمة وواقع حياة الطلاب، لأن ضعف دراسة القرآن الكريم تلاوةً وفهمًا وتدبرًا وحفظًا جعل القرآن الكريم ينزوي في ركن قصي من أركان المناهج التعليمية في كثير من الدول الإسلامية، وبهذا يبعد الحياة عن طريق القرآن (1) .",
    "foot_note": "1. (1) مدكور، 1991م، 151",
    "book_id": "989",
    "new_page_number": 23
  },
  {
    "serial_number": "1159939",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "ومن الوسائل التي تفيد في إدراك مفاهيم القرآن الكريم، السبورة وما تتضمنه من توضيح وشرح، وكذلك الوسائل التعليمية المختلفة، وتمثيل الأدوار وضرب الأمثال، كما هو واضح في قصص الأنبياء والأشخاص، ولا نغفل دور الأفلام التسجيلية والصور والخرائط من آثار في تقريب المدركات وتوضيحها وإعطائها صورة حية. والأفلام التسجيلية يمكن أن تفيد في توضيح الآيات القرآنية المتعلقة بمناسك الحج وشعائره وأماكنه، ويمكن أن تفيد أيضًا في نقل صورة حية لأداء الفريضة نفسها، وما وعد الله به في القرآن الكريم: {وَأَذِّنْ فِي النَّاسِ بِالْحَجِّ يَأْتُوكَ رِجَالًا وَعَلَى كُلِّ ضَامِرٍ يَأْتِينَ مِنْ كُلِّ فَجٍّ عَمِيقٍ} (الحج: 27) ، ومن المفيد أن نذكر هنا أن الخرائط التي تصور خطط الغزوات التي وردت في القرآن الكريم، ورحلات المجاهدين المسلمين هنا وهناك تؤدي دورًا مهمًا أيضًا في توضيح الآيات التي تتناول هذه المعركة أو تلك، وفق المفاهيم المختلفة، كما يمكن استخدام وسائل العرض الحديثة، واللوحات بأنواعها المختلفة، كالسبورة المغناطيسية، ولوحات الجيوب، واللوحات الوبرية ولوحات مصورة مكبرة عليها آيات القرآن الكريم. بالإضافة إلى اعتبار",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 24
  },
  {
    "serial_number": "1159940",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "ترتيل الطلاب المجيدين للتلاوة وسيلة تدفع إخوانهم إلى رفع مستوى أدائهم (1) .",
    "foot_note": "1. (1) الزعبلاوي، 1420هـ، 89، الشافعي، 1984م، 283",
    "book_id": "989",
    "new_page_number": 25
  },
  {
    "serial_number": "1159941",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "8.  النشاطات غير الصفية المتعلقة بحصة القرآن الكريم المقررة: إن وضوح الهدف من دراسة الآيات المباركة وتلاوتها للمتعلمين على نحو سابق \"بمعنى أن يعرف المتعلم في هذه الحصة الهدف من دراسة الآيات الكريمة (من-إلى) في الحصة القادمة\" خير دافع للمتعلمين للبحث والرجوع إلى مصادر البحث المختلفة، لتحقيق الهدف المطلوب، والمشاركة الإيجابية في نشاطات الحصة، ويجب أن يركز المعلم على النوع لا الكم، ويمكن التغلب على مشكلة الكم بأن يعطي طلابه واجبًا منزليًا خاصًا بدرس التلاوة، أو يعطيهم أسئلة يحاولون الإجابة عنها من الآيات التي ستتلى، والتدرب في منازلهم وعلى مهل على تلاوة الآيات التي ستعطى. هذه أهم ما يطمح الباحث إلى تحقيقه في درس القرآن الكريم في المراحل المختلفة كل حسب قدراته، لذا قام بتصميم استبانة (ملحق رقم 2) للكشف عن أساليب تعليم كلام الله وطرائقها، في قاعات الدرس للمستويات المختلفة في مراحل التعليم العام والتعليم الجامعي.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 26
  },
  {
    "serial_number": "1159942",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "إجراءات البحث الميدانية  عينة البحث: محددات اختيار البحث: نظرًا لأن الهدف من البحث هو تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي، فقد تم اختيار أفراد من عينة البحث من جميع مراحل التعليم العام والجامعي، حيث قسمت مراحل التعليم إلى عدة فئات (مستويات) : الصفوف الدنيا من المرحلة الابتدائية (الصف الأول والثاني والثالث) . الصفوف العليا من المرحلة الابتدائية (الصف الرابع والخامس والسادس) . المرحلة المتوسطة والثانوية. التعليم الجامعي.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 27
  },
  {
    "serial_number": "1159943",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "وصف العينة: تكونت عينة البحث من (350) معلمًا في جميع المراحل، اختيروا من عدة مناطق تعليمية (بيشة، محايل، القنفذة، مكة المكرمة، الليث، المخواة) ، وكليات وجامعات في (الرياض، والباحة، وجازان، والقنفذة، ومكة المكرمة، وأبها، والمدينة المنورة، وجدة) . وقد وصلت مجموعة كبيرة من الاستبانات استبعد منها غير المستوفية للشروط، ودخل التحليل كعينة دراسة (50) استبانة للصفوف الابتدائية الدنيا (الأول والثاني والثالث) ، و (50) استبانة للصفوف الابتدائية العليا (الرابع والخامس والسادس) ، و (60) استبانة للمرحلتين المتوسطة والثانوية، و (30) استبانة للتعليم الجامعي، وبذلك يكون مجموع الاستبانات موضوع التحليل (190) استبانة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 28
  },
  {
    "serial_number": "1159944",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "أدوات البحث: تم تصميم استبانة خاصة بتقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي بعد الاطلاع على المراجع المتخصصة في طرق التدريس العامة وطرق تدريس المقررات الإسلامية (التربية الإسلامية، والعلوم الشرعية) وكتب التدريس والتربية بصورة عامة، وأُجرِي للاستبانة الصدق والثبات بطرائق متنوعة وفقًا للآتي: أولًا - الصدق: تم عرض الاستبانة قبل تطبيقها على مجموعة من المختصين في التربية وطرق التدريس والقياس والتقويم والمشرفين التربويين، ومدراء المدارس، ملحق رقم (1) وذلك لاختبار مدى شمولية الاستبانة وصدقها لتوفية الطرق المختلفة لتعليم القرآن الكريم. وبعد الاطلاع على آرائهم ومناقشتها والاستفادة منها، صممت الاستبانة بشكلها النهائي (ملحق رقم 1) . ثانيًا - الثبات: تم تطبيق الاستبانة نفسها (ملحق رقم 2) مرتين على عدد من معلمي القرآن الكريم في مراحل التعليم المختلفة في التعليم الابتدائي والمتوسط والثانوي والجامعي لاختبار الثبات للاستبانة من خلال معامل الارتباط، حيث وجد أن معامل الارتباط هو 86 و0 حسب معامل ارتباط سبيرمان (الرتب) ، وهذا يدل على صدق إجابات أفراد العينة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 29
  },
  {
    "serial_number": "1159945",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "وقد استبعدت استبانات هؤلاء المعلمين من البحث.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 30
  },
  {
    "serial_number": "1159946",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "أولا - المرحلة الابتدائية- الصفوف الدنيا (الصف الأول والثاني والثالث) : انظر ملحق (3) لمعرفة النسب  اختبار التعلم القبلي: يلاحظ أن أعلى نسبة حصلت عليها الفقرة الأولى وهي تكليف الطلاب المجيدين بقراءة آيات الدرس السابق أولًا مع بداية الموقف الصفي، ولكنها لم تَرقَ إلى درجة القبول، حيث حصلت على 44%، وهذه نسبة غير مقبولة. عدم اهتمام المعلمين بمناقشة الطلاب بمدلولات الألفاظ والمعنى الإجمالي للدرس السابق حسب تعليمات إدارة التعليم، حيث إن شرح المعنى الإجمالي للسورة بأسلوب قصصي يشوق الطلاب لمتابعة الدرس (1) ، ويجعلهم يستذكرون أجواء السورة بشكل عام، مما يؤدي إلى غرس المفاهيم الإسلامية الصحيحة في نفوسهم منذ نعومة أظفارهم وبخاصة ما يتعلق بالعقيدة، فالسور القصيرة من القرآن الكريم والتي يتعلمها الطلاب في المرحلة الدنيا تشمل كل ما جاء به القرآن من أحكام، وأعداء الإسلام يعلمون أبناءهم حب دينهم منذ الصغر رغم انحرافه، فكيف بتعليم دين حق؟",
    "foot_note": "1. (1) الزعبلاوي،1420هـ، 99",
    "book_id": "989",
    "new_page_number": 31
  },
  {
    "serial_number": "1159947",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "عرض الدرس: من خلال النسب المستخلصة يلاحظ ما يلي: أ- إن طرح أسئلة أو سرد قصة لإثارة اهتمام الطلاب لم تحصل إلا على 36% وهذه نسبة متدنية رغم أن عنصر التشويق يعد من أهم العوامل التي قامت عليها طريقة هربارت في التدريس (1) . ب- عدم إعطاء الطلاب الفرصة للقراءة الصامتة (الصدرية) ، رغم أن في القراءة الصامتة تعويدًا للطالب منذ البداية على تنمية مثل هذه المهارة ولا سيما أن طلاب الصف الأول وبصورة خاصة يحفظون السور غيبا، فيمكن تكليفهم بالقراءة الصامتة. ج- إن مراعاة أصول التلاوة حظيت بنسبة عالية وصلت إلى 100% في تلاوة الدرس تلاوة مجودة، والوقوف التعليمي الجيد كما في الفقرات من 9-11 من الاستبانة. وارتفعت نسبة الاعتماد على قراءة الطلاب المجيدين أولًا إلى 88% وهذه نسبة طيبة، رغم أن ذلك أهمل في بداية الموقف الصفي.",
    "foot_note": "1. (1) أحمد، 1416هـ، 117",
    "book_id": "989",
    "new_page_number": 32
  },
  {
    "serial_number": "1159948",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "ورغم ذلك لم تَرقَ مسألة تطبيق أحكام التجويد من قبل الطلاب إلى أكثر من نسبة 55% ولكن المطلوب تعويد الطلاب على القراءة المجودة منذ الصغر حتى تتدرب ألسنتهم على النطق السليم للألفاظ، والتعود على صفات الحروف كالتفخيم والترقيق مع التجاوز عما لا يقدرون عليه. مع وجوب اهتمام المعلمين بالقراءة الفردية والابتداء بالمجيدين حتى يكونوا قدوة لزملائهم وفي ذلك إثارة للتنافس وإسراع في عملية التلاوة (1) . د- يلاحظ أن القراءة الجهرية الجماعية وصلت نسبتها إلى 60%، والمأمول أن ترتفع إلى أكثر لما للقراءة الجماعية من فوائد كثيرة في تشجيع الطلاب وهي دافع لهم للمزيد من التعلم. هـ- عدم الميل للقراءة الجهرية الزمرية حيث إن نسبة المعلمين الذين يطبقون القراءة تلك لم تصل إلا إلى نسبة 42% رغم أن تعليمات إدارات التعليم تشجع مثل هذا النوع من القراءة لخلق روح المنافسة بين الزمر المختلفة، حيث يقسم المعلم الصف إلى زمرتين مثلًا، يستمع إلى الأولى مع ملاحظة مَن يخطئ من الطلاب، ثم يستمع إلى الزمرة الثانية.",
    "foot_note": "1. (1) موسى،1420هـ، 175",
    "book_id": "989",
    "new_page_number": 33
  },
  {
    "serial_number": "1159949",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "و لا يميل المعلمون إلى تصنيف الطلاب إلى مجموعات حسب قدراتهم رغم أن في الفروق الفردية بين الطلاب تشجيعًا للمجيد والأخذ بيد المتعثر. فلم تصل نسبة تصنيف الطلاب إلا إلى 38%، وهذه نسبة غير مقبولة. ويرى (كنجزلي) أن من الضروري أن يميز المعلم بين الطالب الموهوب وغير الموهوب، لأن عدم رعاية الموهوبين يعودهم على الكسل فيما لو تركوا تحت ظروف التدريس العادية فإنهم لا ينجزون أكثر من 40% فقط من طاقاتهم التي يمتلكونها (1) .يميل المعلمون في هذه المرحلة إلى عدم توزيع الطلاب إلى مجموعات رغم كثرتهم فلم يوافق على ذلك 56% من المعلمين رغم أن توزيع الطلاب إلى مجموعات يسهل عملية التعليم، ووافق على ذلك نسبة 2% فقط مع أن هذه الطريقة كانت متبعة قديما بتعيين عريف على كل مجموعة يكون من النجباء وهو ما يقوم به المعيد في هذه الأيام، ويسمى في العرف التربوي تعليم الأقران، وتردد في ذلك 42%.",
    "foot_note": "1. (1) الدوش، 1418هـ، 62.",
    "book_id": "989",
    "new_page_number": 34
  },
  {
    "serial_number": "1159950",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "التقويم التكويني: ويلاحظ ما يلي: عدم اتباع المعلمين الطرق التربوية السليمة في تصحيح الأخطاء، حيث إن 82% من المعلمين يقومون بتصحيح الأخطاء بأنفسهم، في حين أن نسبة الذين يتركون للطالب القارئ الفرصة لتصويب نفسه عندما يخطئ في القراءة لم تصل إلى درجة القبول حيث بلغت 36% من المعلمين وأجاب 38% من المعلمين على أن الذي يقوم بتصويب الأخطاء طالب آخر، والصحيح أن الطالب تترك له الفرصة لتصويب نفسه بعد أن ينهي الطالب الآية (1) أو المقطع الذي يمكن الوقوف عليه وذلك بسؤاله عن الحرف أو الحركة التي أخطأ فيها، أو العلامة التي لم يراعها (2) ولا يسأل عن أحكام التجويد في هذه المرحلة ولكن يعود على تطبيق أحكام التجويد من خلال التلقين وإن عجز عن ذلك تترك الفرصة لزميل آخر بتصويب الخطأ، وإذا عجز الجميع عن التصويب يأتي دور المعلم في التصويب، وفي ذلك تدريب للطالب على اكتشاف خطئه أو خطأ غيره، وفي ذلك جذب لانتباه الطلاب وإثارة روح المنافسة بينهم.",
    "foot_note": "1. (1) موسى، 1420هـ، 176 \n2. شحاته، 1420هـ، 231",
    "book_id": "989",
    "new_page_number": 35
  },
  {
    "serial_number": "1159951",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "عدم اهتمام المعلمين بمناقشة الطلاب بمدلولات المفردات، حيث بلغت نسبة المعلمين المستخدمين لهذا الإجراء 26% ونسبة مناقشة المعنى الإجمالي 18% ونسبة مناقشة الأفكار العامة 24% ونسبة مناقشة الأفكار الجزئية 20%، في حين أنهم يميلون إلى ذلك حيث ترددت نسب عدم قبول هذه الإجراءات على الإطلاق 20-42% حسب ما هو مبين في الملحق رقم (3) .",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 36
  },
  {
    "serial_number": "1159952",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "استخدام الوسائل التعليمية: من خلال النسب المذكورة في الملحق رقم (3) يلاحظ ما يلي: تركيز استخدام الوسائل التعليمية على وسيلتين فقط؛ بصورة عامة هما السبورة التي بلغت نسبة استخدامها من قبل المعلمين 68%، في حين ارتفعت نسبة استخدام شرائط الكاسيت إلى 84%، ولم يرفض هاتين الوسيلتين إلا 6% فقط. ويفضل أن يتوسط استخدام الشرائط تلاوة الطلاب الفردية بعد تلاوة المجيدين لتكون فرصة لرفع مستوى أدائهم (1) . إن استخدام الأشرطة تنويع للقراءة وتعريف للطلاب بأهمية الأشرطة في التعلم وفي ذلك تشجيع لهم على استخدامها في بيوتهم لرفع مستوى قدراتهم وبخاصة استخدام المصحف المعلم. استخدام اللوحات المختلفة لم يرق إلى النسبة المقبولة، حيث بلغت نسبة استخدامها 32% مع أن استخدام اللوحات المختلفة أمر مهم، حيث إن اللوحات تساعد المعلم على التقليل من تضييع الوقت في الكتابة على السبورة الطباشيرية، فيمكن المعلم عرض لوحة مكبرة أو استخدام لوحة الجيوب في وضع كلمة بعينها أو مجموعة كلمات، وبخاصة الكلمات الصعبة وبيان طريقة نطقها.",
    "foot_note": "1. (1) الزعبلاوي، 1420هـ، 102",
    "book_id": "989",
    "new_page_number": 37
  },
  {
    "serial_number": "1159953",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "أما الشفَّافيات فلم يستخدمها إلا 10% من المعلمين في حين أن استخدام جهاز السبورة الضوئية سهل وميسر وبواسطته يمكن عرض أكبر عدد ممكن من المسائل في أقل وقت ممكن وبخاصة أن الشَّفَّافيات إذا لونت فيها الحركات والحروف فهي أبلغ وسيلة لإيصال المعلومة وتصحيح الأخطاء، ويمكن تصوير الآيات من مصحف معلم وتكبيرها بالحجم المطلوب وعرضها بواسطة هذا الجهاز، وفي ذلك تنويع للوسائل، ويمكن للمعلم عن طريق اللوحة المكبرة أن يشير إلى المقاطع الصوتية التي يقف عليها. د. أما مختبر اللغة فبلغت نسبة الذين لا يستخدمونه 66% وهذه نسبة عالية نسبيًا وربما تكون النسبة أكثر بكثير من ذلك لعدم وجود مختبرات لغة أصلا في المدارس، ولكن في هذه المرحلة حقيقة لا يستخدم المختبر لأسباب فنية، ولكنه ضروري لأنه يساعد الطالب إذا استخدمه على التلقي الصحيح بدون تشويش من الآخرين.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 38
  },
  {
    "serial_number": "1159954",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "هـ. أما الأفلام فلم تستخدم بصورة عامة، حيث بلغت نسبة الاستخدام 2%، مع أن استخدام الأفلام ولا سيما في هذه المرحلة الأولية من التعليم له أهميته لتشويق الطلاب للدرس حيث يربط الطالب بالمكان والصورة مثل فلم عن صلاة عيد الأضحى أولًا ثم بيان النحر ثانيًا في عيد الأضحى كما بينته سورة الكوثر، أو فلم عن بلاد الشام واليمن ومكة والربط بينهما في سورة قريش … الخ. إن اختيار الوسيلة المناسبة يثري المواقف التعليمية إذا استخدمت بصورة صحيحة مما يجعل لها معنى ووظيفة فاعلة بالنسبة للطلاب إذا كانت مناسبة لأعمار الطلاب ومستوياتهم وخبراتهم السابقة التي تتصل بالخبرات الجديدة التي تتيحها هذه الوسائل (1) .",
    "foot_note": "1. (1) الخطيب، 1998م، 44",
    "book_id": "989",
    "new_page_number": 39
  },
  {
    "serial_number": "1159955",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "تعزيز ونشاط غير صفي وتطبيق ومناهج . من خلال الملحق رقم (3) يمكن ملاحظة ما يأتي: يميل المعلمون إلى التعزيز في الموقف الصفي حيث بلغت نسبة من يقومون بتعزيز أفعال الطلاب 56% وهذه النسبة يجب أن تكون أكثر لأن في التعزيز دعمًا وتشجيعًا للطلاب وتنشيطًا لهم ليقوموا في المستقبل بالتحضير للحصة، لأن التعزيز مثير يؤدي إلى زيادة احتمال حدوث تكرار الاستجابة، موضوع التعزيز، والتعزيز إما أن يكون باللفظ مثل صحيح، جيد … الخ، أو يغير اللفظ بتعبيرات الوجه أو بأي حركة مفهومة (1) .وربما يكون التعزيز بالنواحي المادية كالجوائز. لا يميل المعلمون إلى تكليف الطلاب بالتحضير للدرس قبل إعطائه وذلك ربما بسبب عدم ثقتهم بقدرات الطلاب ولكن الطالب الذي يعرف الحرف يستطيع التهجي وبالتالي يعرف اللفظ، وفي هذا تدريب على التعلم الذاتي. يرى المعلمون أن ترتيل القرآن الكريم له فائدة في التعلم والتفكير والاستنباط حيث بلغت نسبة من يرون ذلك 82%.",
    "foot_note": "1. (1) الخطيب، 1998م، 74-76.",
    "book_id": "989",
    "new_page_number": 40
  },
  {
    "serial_number": "1159956",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "أما ربط معاني الآيات بالحياة العامة فلم يرفضه بشكل تام إلا 10% من المعلمين مع ذلك لم يوافق عليه إلا 50% من المعلمين مع العلم أن ربط معاني الآيات بالحياة العامة له تأثير في مستقبل هذه الأمة لأن القرآن الكريم حياة، وهدف القرآن الكريم بناء الشخصية المسلمة السوية، والمجتمع المسلم المتكامل والأمة المسلمة الموحدة القادرة على تحقيق أهداف الإسلام ومقاصده (1) في تحقيق الضروريات والحاجات والتحسينات محافظة على الدين والنفس والعقل والمال والعرض، فلابد من ربط القرآن بالحياة. هـ. يستخدم أقل من 50% من المعلمين طريقة التلقين فقط في تعليم القرآن الكريم حيث بلغت نسبة من يعتمدون على طريقة التلقين فقط 46%، مع أن التلقين هو الأسلوب الأمثل في تعليم القرآن، لأنه لا يجوز رواية القرآن بالمعنى، أو الاجتهاد وإتقان تلاوته عبادة واجبة (2) ، ومحمد صلى الله عليه وسلم تلقى القرآن الكريم من جبريل عليه السلام تلقينًا، وهذا لا يمنع استخدام طرق أخرى في تعليم القرآن الكريم، حيث انتقد المربون المسلمون الطريقة التلقينية وطريقة الحفظ بدون فهم وفضلوا عليها طريقة المناقشة والحوار (3) ، مع التلقين الذي هو أساس تعليم القرآن الكريم.",
    "foot_note": "1. (1) مدكور، 1991م، 151 \n2. عيد، 1420هـ، 184 \n3. مرسي، 1982م، 129",
    "book_id": "989",
    "new_page_number": 41
  },
  {
    "serial_number": "1159957",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "مع العلم أن تعاميم إدارات التعليم في المملكة - وبخاصة في محافظة القنفذة - تركز على أن يكون تعليم القرآن الكريم في الصف الأول بالذات تلقينًا، لأن الطلاب لا يستطيعون القراءة من المصحف بصورة جيدة. و. يلتزم معظم المعلمين بإكمال المقرر الدراسي حيث بلغت نسبة من يكملون المقرر الدراسي 76% ولم يقل أحد منهم بعدم إكمال المقرر الدراسي، وهذا أمر طيب يشكر المعلمون عليه. ز. يركز 56% من المعلمين على إجادة الطلاب للقراءة بغض النظر عن إكمال المقرر، ولكن يمكن التغلب على مشكلة عدم إكمال المقرر باتباع أية طريقة مناسبة حسب مستويات الطلاب وقدراتهم، إما بنصحهم بالالتحاق بحلقات تحفيظ القرآن الكريم أو تكليفهم بواجبات منزلية … الخ. ح. أما إجراء المسابقات في إتقان القرآن الكريم بين الطلاب فلم يرفضها أحد وكان نسبة من يقومون بإجراء المسابقات 72% وهذه نسبة مقبولة، لما للمسابقات من أثر في إذكاء روح المنافسة بين الطلاب ورفع مستوياتهم وخدمة للمقرر من القرآن الكريم.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 42
  },
  {
    "serial_number": "1159958",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "اختبار التعليم القبلي: يلاحظ أن المعلمين يكلفون الطلاب ذوي القدرات المتدنية بقراءة آيات الدرس السابق أولا مع بداية الحصة بنسبة 48% وهي نسبة أكبر من نسبة تكليف الطلاب المجيدين التي بلغت 38% بعكس معلمي المرحلة الدنيا الذين قدموا الطلاب المجيدين أولًا، وجاءت نسبة تكليف الطلاب متوسطي القدرات أقل حيث بلغت 28% والإجراء السليم تقديم الطلاب المجيدين أولًا، ثم متوسطي القدرات ثم ذوي القدرات المتدنية، وبهذا يمكن القول: إن المعلمين لا يهتمون بهذا المحور. يلاحظ انخفاض نسبة مناقشة الطلاب في مدلولات الألفاظ الواردة في آيات الدرس السابق، حيث بلغت 18%، وبلغت نسبة مناقشة الطلاب في المعنى الإجمالي 16%، في حين كان من الأولى أن يعرف الطلاب معاني الكلمات الواردة في الآيات والمعنى الإجمالي لها أو للسورة بصورة عامة، لأن فهم معنى السورة يساعد على سرعة التلاوة، فالطالب المتعثر في القراءة يشق عليه فهم المعنى وتذوق الأسلوب القرآني حيث ينحصر اهتمام الطالب باللفظ لا المعنى (1)",
    "foot_note": "1. (1) الزعبلاوي، 1420هـ، 96.",
    "book_id": "989",
    "new_page_number": 43
  },
  {
    "serial_number": "1159959",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "عرض الدرس: يلاحظ ما يأتي: لا يهتم معلمو هذه المرحلة بتشويق الطلاب للدرس الجديد بصورة عامة، حيث بلغت نسبة من يثير أسئلة أو يسرد قصة 32% وهي نسبة أقل من نسبة الصفوف المتدنية وقد بينَّا ما لتشويق الطلاب من أثر في العملية التعليمية وتهيئة لأذهان الطلاب للدرس الجديد. لا يعطي معلمو هذه المرحلة القراءة الصامتة اهتمامًا رغم أن الطلاب في هذه المرحلة يمكنهم التدرب على القراءة الصامتة الصدرية أكثر من نظرائهم في الصفوف الدنيا لتمكنهم من القراءة بصورة أفضل، حيث بلغت نسبة من يقومون بتكليف الطلاب بالقراءة الصامتة 36% وهذه نسبة غير مقبولة. مع العلم أن القراءة الصامتة تسهل التلاوة الجهرية، حيث يعدها البعض تمهيدا لها (1) . ويمكن أن يتغاضى معلم الصف الأول عن القراءة الصامتة لكنها ضرورية في الصفوف العليا من المرحلة الابتدائية. لا يهتم معلمو هذه المرحلة بالكشف عن المعنى الإجمالي لآيات الدرس الجديد، حيث بلغت نسبة المهتمين بالكشف عن المعنى الإجمالي 24% وهذه نسبة غير مقبولة وربما يلجأ معلمو القرآن على ما يبدو إلى تكليف الطلاب بفتح مصاحفهم رأسا بدون مقدمات.",
    "foot_note": "1. (1) الزعبلاوي، 1420هـ، 97",
    "book_id": "989",
    "new_page_number": 44
  },
  {
    "serial_number": "1159960",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "يظهر اهتمام المعلمين بتلاوة الآيات بطرق متعددة واضحة من خلال النسب المدونة، حيث بلغت نسبة من يتلو الآيات كاملة تلاوة مجودة 98%، ونسبة من يتلوها مع الوقوف على رؤوس الآيات 68% ومن يهتم بضبط الحركات 96%، وهذه نسب مقبولة مع أن 38% من المعلمين ذكروا أنهم لا يقفون على رؤوس الآيات وهذا أمر مخالف لأصول القراءة الصحيحة. هـ. وهناك تناقض واضح بين الفقرة الأولى من اختبار التعلم القبلي والفقرة رقم (12) حيث بلغت نسبة تكليف الطلاب المجيدين بقراءة الدرس السابق مع بداية الموقف الصفي 38% في حين بلغت نسبة من يكلف الطلاب المجيدين بالقراءة بعد تلاوة المعلم 98%، فالأصل تكليف الطلاب المجيدين. يلاحظ أن المعلمين لا يميلون بصورة مقبولة إلى تكليف الطلاب بالقراءة بصورة عشوائية، حيث بلغت نسبة تكليف الطلاب بالقراءة بصورة عشوائية (بدون ترتيب) 44%، مع أن من الأفضل أن تكون القراءة بدون ترتيب، لأن في ذلك شدًا لانتباه الطالب دائما، لأنه يتوقع أن يكلف بالقراءة في أي وقت، وهذه نسبة غير مقبولة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 45
  },
  {
    "serial_number": "1159961",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "لا يميل المعلمون في هذه المرحلة (الصفوف العليا) إلى استعمال القراءة الجهرية الجماعية في حين مال معلمو الصفوف الدنيا إلى استخدام القراءة الجهرية الجماعية حيث بلغت في الصفوف الدنيا 60% في حين بلغت في الصفوف العليا 34% مع العلم أن القراءة الجهرية الجماعية ضرورية في هذه المرحلة لمساعدة الطلاب على محاكاة أقرانهم بالإضافة إلى طرد عنصر الخجل من البعض. بلغت نسبة المعلمين الذين يطلبون من الطلاب تطبيق أحكام التجويد في تلاوتهم 70% وهي أكثر من نسبتهم في المرحلة الدنيا التي بلغت 54% وربما يرجع ذلك إلى تأكيد إدارات التعليم وجوب الاهتمام بأحكام التجويد في هذه المرحلة، وهذه النسبة نسبة مقبولة رغم أن من الواجب الاهتمام بتطبيق أحكام التجويد بصورة أفضل. لا يميل معلمو هذه المرحلة إلى القراءة الزمرية الجماعية حيث بلغت نسبة من يطبقها من المعلمين 22% وهي نسبة أقل من نسبة نظرائهم في المرحلة الدنيا التي بلغت 42% لأن القراءة الزمرية تساعد على إذكاء روح المنافسة بين الزمر المختلفة وفيها تشويق ودافع للقراءة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 46
  },
  {
    "serial_number": "1159962",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "لا يميل معلمو هذه المرحلة إلى تصنيف الطلاب إلى مجموعات حسب قدراتهم الفكرية، حيث بلغت نسبة من يقوم بذلك من المعلمين 20% وهي نسبة أقل من نسبة نظرائهم في المرحلة الدنيا، وليس في ذلك ضير. فقد بين لنا القرآن الكريم وجود الفروقات الفردية بين الناس؛ قال تعالى: {وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ} (الأنعام: 165) وقال تعالى: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا} (البقرة: 286) ، فلماذا لا يشجع المبرز ويعان المتعثر ولا يكون ذلك إلا بمعرفة القدرات الفردية. يلاحظ أن 88% من معلمي هذه المرحلة يتابعون تحريك أصابع الطلاب مع كل كلمة، وهذه نسبة مقاربة إلى نسبة نظرائهم في المرحلة الدنيا، وفي ذلك ربط بين اللفظ والرسم. إن نسبة 6% من معلمي هذه المرحلة يوزعون الطلاب إلى مجموعات إذا كان عددهم كثيرًا، وهذه نسبة متدنية جدًا إذا عرفنا أن ذلك الإجراء يساعد المعلم كثيرا على متابعة الطلاب والتأكد من حفظهم وإتاحة الفرصة له لإكمال المقرر الدراسي، وبخاصة مع وجود نبهاء بين طلاب الصف الذين يتولون متابعة أقرانهم كعرفاء.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 47
  },
  {
    "serial_number": "1159963",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "إن نسبة 60% من معلمي هذه المرحلة يكلفون الطلاب بترديد الآيات بعدهم، وهذه النسبة رغم أنها مقبولة لكنها في الحقيقة لا ترقى إلى ما يجب أن تكون، حيث إن تعليم القرآن يكون بالتلقين، وهذه النسبة أقل بكثير من نسبة نظرائهم في المرحلة الدنيا.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 48
  },
  {
    "serial_number": "1159964",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "التقويم التكويني: من خلال الملحق رقم (4) نلاحظ: كما وقع معلمو المرحلة الدنيا في خطأ الاعتماد على التصويب الفوري لأخطاء الطلاب في التلاوة من قبلهم، وقع معلمو المرحلة العليا في نفس الخطأ، حيث بلغت نسبة من يعتمد من معلمي هذه المرحلة على التصويب الفوري لأخطاء الطلاب في التلاوة من قبلهم 58% وهذه نسبة عالية فكان الأحرى بهم الاعتماد على ترك الفرصة للطالب القارئ بتصويب نفسه عندما يخطئ في القراءة، حيث بلغت نسبة من يطبق هذا الإجراء 42%، ونسبة من يعتمد على أحد الطلاب بتصويب خطأ الطالب القارئ 30%. وهذه النسب غير مقبولة لأن الاعتماد يجب أن يكون على الطالب نفسه أولاُ، ثم غيره ثم المعلم. يلاحظ أن معلمي هذه المرحلة كنظرائهم في المرحلة الدنيا لم ترتفع نسبة من يناقشون الطلاب في مدلولات المفردات، والمعنى الإجمالي، والأفكار العامة والأفكار الجزئية والتفصيلية لآيات الدرس الجديد عن 34%، حيث بلغت على التوالي 34%، و 30%، و 18% و 26%. وهذا أمر يجب التنبه إليه مع العلم أن كل ذلك لا يكون على حساب التلاوة بل ضمن توزيع الزمن العام للحصة حسب أصول التخطيط السليم للدرس.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 49
  },
  {
    "serial_number": "1159965",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "استخدام الوسائل: من خلال النسب المثبتة في الملحق رقم (4) يلاحظ ما يلي: اعتماد معلمي هذه المرحلة على استخدام السبورة في تقرير جوانب الصواب في الدرس حيث بلغت نسبة من يعتمد في ذلك على السبورة 72% ونسبة من يعتمد على الشرائط كوسيلة مناسبة لتلاوة القرآن الكريم 74% وهذه نسب متقاربة وهي مقبولة. ولكن يظهر أن هاتين الوسيلتين يعتمد عليهما معلمو المرحلة الابتدائية بصورة عامة في الصفوف الدنيا والصفوف العليا. يلاحظ أن استخدام الوسائل التعليمية الأخرى غير السبورة والشرائط بصورة ضعيفة جدًا حيث لم تتجاوز نسبة المعلمين الذين يستخدمون اللوحات المختلفة في توضيح أفكار ومفاهيم الدرس 18%، في حين بلغت نسبة من يستخدم الشفافيات 4% ونسبة من يستخدم المختبرات في تعليم القرآن الكريم 8%، وأما نسبة من يستخدم الأفلام المناسبة فلم تكن أحسن حظًا من الوسائل الأخرى، حيث بلغت أيضا 4%. وهذا يدل على عدم الاستفادة من الوسائل الحديثة في تعليم القرآن الكريم، رغم أهمية استخدام التقانة الحديثة في تعليم القرآن الكريم وبخاصة مع تطور استخدامات الحاسب الآلي الذي خدم القرآن وتعليمه بصورة جيدة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 50
  },
  {
    "serial_number": "1159966",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "تعزيز ونشاط وتطبيق ومناهج: من خلال النسب المثبتة في الملحق رقم (4) يلاحظ أن النسب المتحققة في هذه المرحلة في هذا المجال بصورة خاصة أقل من النسب المتحققة في المرحلة الدنيا بصورة عامة، مع أن المعلمين يجب عليهم التنبه إلى الاهتمام بما يتضمنه هذا المجال وعلى كل حال فإنه يلاحظ ما يلي:",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 51
  },
  {
    "serial_number": "1159967",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "إن المعلمين في هذه المرحلة يميلون إلى الثناء على أفعال الطلاب المحمودة، ويذمون الأفعال المكروهة بنسبة بلغت 50% وهذه نسبة مقبولة تجاوزًا، ولكن يجب الاهتمام بصورة أكبر بتحقيق هذا الإجراء لما للثناء وغيره من وسائل التعزيز من آثار محمودة في دفع الطلاب إلى المزيد من الجد والعطاء، واستخدام التعزيز بعد الإجابة يضفي جوًا من الحيوية داخل الصف (1) ، ويثير دافع المتعلمين ويحملهم إلى المزيد من التحصيل والنجاح والتفوق، ومن هنا تأتي أهمية تشجيع الطلاب المتأخرين دراسيا والطلاب الخجولين، لأن ذلك يقوي ثقتهم بأنفسهم، ولنا في رسول الله قدوة حسنة في التشجيع والثناء، «فعن أبي بن كعب - وكانت كنيته أبا المنذر - قال: قال رسول الله صلى الله عليه وسلم: \"يا أبا المنذر، أتدري أي آية من كتاب الله معك أعظم؟ قال: قلت (الله لا إله إلا هو الحي القيوم … ) ، قال: فضرب في صدري وقال: ليهنك العلم أبا المنذر» رواه مسلم وأبو داود (2)",
    "foot_note": "1. (1) الخطيب، 1998م، 76 \n2. مسلم، كتاب صلاة المسافرين وقصرها، ج6 / 92.",
    "book_id": "989",
    "new_page_number": 52
  },
  {
    "serial_number": "1159968",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "لا يميل معلمو هذه المرحلة إلى تكليف الطلاب بالتحضير للدرس قبل إعطائه، حيث يستخدم هذا الإجراء ما نسبته 22%، رغم أن التحضير للدرس يساعد على سرعة الفهم والتلاوة والمشاركة الإيجابية في نشاطات الحصة، والتعود على البحث والاستقصاء. يرى ما نسبته 66% من المعلمين في هذه المرحلة أن في ترتيل الطلاب لآيات القرآن فائدة في التعلم والتفكير والاستنباط، وهذه نسبة مقبولة نسبيا، لكنها أقل من نسبة نظرائهم في المرحلة الدنيا، ويجب على المعلمين تشجيع الطلاب على التفكر فيما ورد في القرآن الكريم حسب استطاعتهم. لا يستخدم معلمو هذه المرحلة طريقة التلقين فقط في تعليم القرآن الكريم، حيث بلغت نسبة من يستخدمون هذه الطريقة 26% وهي أقل بكثير من المرحلة الدنيا رغم ما قيل سابقا بشأن هذه الطريقة، فالمعلم يمكن أن يستخدم طرقًا كثيرة بشكل دائم، حيث إن كل إجراء يعد طريقة. هـ. يلتزم 68% من معلمي هذه المرحلة بإكمال المنهج، في حين يركز 58% منهم على إجادة الطلاب للقراءة بغض النظر عن إكمال المقرر، ولا يمنع إكمال المنهج من الإجادة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 53
  },
  {
    "serial_number": "1159969",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "لا يميل معلمو هذه المرحلة لإجراء المسابقات في إتقان التلاوة بين الطلاب، حيث بلغت نسبة من يجري المسابقات بين الطلاب 42%، وهذه نسبة متدنية غير مقبولة لا ترقى إلى نسبة نظرائهم في المرحلة الدنيا الذين يشجعون المسابقات، وكان حريًّا بالمعلمين تشجيعًا للطلاب وحفزًا لهممهم إجراء المسابقات المذكورة لأن في ذلك دافعًا للطلاب للمنافسة ورفع مستوياتهم التعليمية، وبخاصة في حصص النشاط غير الصفي.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 54
  },
  {
    "serial_number": "1159970",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "اختبار التعليم القبلي: يلاحظ عدم اهتمام معلمي هذه المرحلة بهذا المحور لتدني نسبة من يلتزمون باتباع الإجراءات المثبتة في هذا المحور، حيث لم تتجاوز أعلى نسبة 30% وهي أدنى النسب على الإطلاق في جميع مراحل التعليم، حيث بلغت نسبة من يناقش الطلاب في مدلولات الألفاظ الواردة في آيات الدرس السابق 6.6% فكأن هؤلاء المعلمين لا يهتمون إطلاقًا بربط الآيات السابقة باللاحقة، ولم تكن نسبة من يناقشون الطلاب في المعاني الإجمالية بأوفر حظًا، حيث بلغت نسبتهم 8.3%. لا يميل معلمو هذه المرحلة بتكليف الطلاب الجيدين أو متوسطي القدرات أو ذوي القدرات المتدنية بقراءة آيات الدرس السابق، حيث بلغت النسبة على التوالي، 30%، و 20%، و 25%، وهذا ربما يؤدي إلى إهمال الطلاب لهذا المقرر العظيم لأن عدم سؤال المعلم يؤدي إلى عدم استعداد الطالب، والواجب تكليف المجيدين بالقراءة في بداية الموقف الصفي.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 55
  },
  {
    "serial_number": "1159971",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "عرض الدرس: يلاحظ أن معلمي هذه المرحلة لا يهتمون بالتمهيد لعرض الدرس حيث بلغت نسبة من يشوقون الطلبة للدرس الجديد بقصة أو سؤال 8.3% وهذه أدنى نسبة أيضا على مستوى جميع المراحل الدراسية مع أن التمهيد المشوق يجعل هذه المادة مشوقة ويشجع الطلاب على المزيد من الحيوية في الدرس. لا يميل معلمو هذه المرحلة بتكليف الطلاب بالقراءة الصامتة للآيات موضوع الدرس رغم الفوائد الجمة لمثل هذا الإجراء، حيث بلغت نسبة من يكلفون الطلاب بذلك 41.7%، وهي ضرورية في ظروف قلة عدد حصص القرآن الكريم. أما مناقشة الطلاب للوصول إلى المعنى الإجمالي لآيات الدرس الجديد فلم تنل من عناية المعلمين سوى 13.3%، والواجب على معلمي هذه المرحلة الاهتمام الشديد بالمعنى الإجمالي للآيات واستنتاج أهم الفوائد والأحكام وربط تلك الآيات بحياة الطالب لتزيد إحساسه بأهمية القرآن لحياته في الدنيا والآخرة (1) ولا يعنى ذلك تحويل حصة التلاوة للتفسير، مع أن نشرات إدارات التعليم تحث على بيان معاني الكلمات، وبيان أسباب النزول، وأسس العقيدة، والأحكام العامة والآداب التي شملتها الآيات (2) ، وهذا غير متبع لدى المعلمين.",
    "foot_note": "1. (1) الفرج، 1416هـ، 73 \n2. نشرة لإدارة تعليم القنفذة، 22 / 11 / 1419هـ) .",
    "book_id": "989",
    "new_page_number": 56
  },
  {
    "serial_number": "1159972",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "يلاحظ اهتمام المعلمين بالتلاوة على مختلف صورها، التلاوة المجودة، والوقوف على رؤوس الآيات، وضبط الحركات حيث كانت نسبة المعلمين الذين يطبقون ذلك دائما على التوالي 86.7%، و 56.7%، و 85%، وهذه نسب مقبولة، ولكن نأمل رفع تلك النسب. هـ. أما إجراء تكليف الطلاب المجيدين بتلاوة الآيات بعد تلاوة المعلم فيطبقه ما نسبته 58% من المعلمين في هذه المرحلة. لا يميل معلمو هذه المرحلة إلى تكليف الطلاب بالقراءة بدون ترتيب وذلك من خلال نسبتهم البالغة 48.3%، والصحيح أن يكلف الطلاب بالقراءة بدون ترتيب. يميل معلمو هذه المرحلة إلى عدم تطبيق القراءة الجهرية الجماعية والقراءة الجهرية الزمرية، وتقسيم الطلاب إلى مجموعات حسب قدراتهم، وترديد الطلاب الآيات بعد المعلم أو المسجل خلف عريف من خلال النسب المثبتة في الملحق رقم (5) ، حيث بلغت 65%، و 73.3%، و 53.3%، و 51.7%. وبالطبع إن ذلك لا يتناسب مع هذه المرحلة بصورة عامة حسب رأي البعض، رغم أن إجراء القراءة الجماعية والجهرية والزمرية والقراءة خلف المعلم أو المسجل لها مردود طيب من خلال التجربة الميدانية.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 57
  },
  {
    "serial_number": "1159973",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "يطلب معلمو هذه المرحلة من طلابهم تطبيق أحكام التجويد في تلاوتهم، حيث بلغت نسبة ذلك 88.3% وهذه نسبة مقبولة، وهذا ليس بالغريب، لأن الطلاب من الصف الرابع إلى الصف الثالث الثانوي مطالبون بتطبيق أحكام التجويد، وهذا من صميم المقرر الدراسي. يميل معلمو هذه المرحلة لمتابعة طلابهم أثناء القراءة بتحريك أصابعهم مع كل كلمة، حيث بلغت نسبة المعلمين الذين يطبقون ذلك 51.7% وهذا الإجراء جيد لو طبق فعلًا، مع وجود الضعف العام في مستويات الطلاب، مع عدم مناسبته لهذه المرحلة حسب رأي البعض.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 58
  },
  {
    "serial_number": "1159974",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "التقويم التكويني: من خلال النسب المثبتة في ملحق رقم (5) يلاحظ ما يلي: وقوع معلمي هذه المرحلة في خطأ معلمي المرحلة الابتدائية نفسه بالاعتماد على التصويب الفوري من قبل المعلم حيث بلغت نسبة المعلمين الذين يقومون بأنفسهم بالتصويب الفوري نسبة 55%، ونسبة من يتركون الفرصة للطالب بتصويب نفسه 41.7%، وهذه نسب غير مقبولة لأن الأساس أن يصوب الطالب الخطأ بنفسه ثم يصوبه زميله ثم المعلم. وقد وقع المعلمون في خطأ آخر بعدم اعتمادهم مطلقا على تكليف أحد الطلاب بتصويب خطأ الطالب القارئ بنسبة 10%، وهذه نسبة غير مقبولة أيضًا. لا يميل المعلمون في هذه المرحلة إلى مناقشة الطلاب بمدلولات مفردات الآيات، ولا مناقشتهم بالمعنى الإجمالي، والأفكار العامة، والأفكار الجزئية والتفصيلية للدرس الجديد، حيث كانت نسبة المعلمين الذين يناقشون الطلاب في الأمور السابقة على التوالي 20%، و 20%، و 11.7%، و 11.7%، وهذه نسب متدنية جدًا، ومن أقل النسب في جميع المراحل بصورة عامة، فيجب التنبه لذلك لما لهذه الإجراءات من تشجيع للبحث والاستقصاء.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 59
  },
  {
    "serial_number": "1159975",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "استخدام الوسائل: من الملحق رقم (5) يمكن ملاحظة ما يأتي: رغم أن استخدام السبورة وسيلةً تعليمية شائع في كل المراحل، حيث تكتب عليها الكلمات الصعبة، ومعاني الكلمات، والأحكام، … الخ إلا أن معلمي هذه المرحلة لا يميلون لاستخدامها بصورة جيدة، حيث كانت نسبة من يستخدمونها 40% وهذه نسبة متدنية، وفي ذلك إهمال لوسيلة سهلة ميسورة. رغم شيوع استخدام أشرطة الكاسيت وسيلة مريحة للمعلم الذي يجيد القراءة والذي لا يجيدها لا يميل معلمو هذه المرحلة إلى استخدام الكاسيت وسيلة تعليمية، حيث بلغت نسبة من يستخدمون الكاسيت دائما 28.3%، وهذه نسبة غير مقبولة إطلاقا، لأن الطالب الكبير لا يختلف عن غيره في حاجته لتنويع الوسائل والتشويق للدرس وزيادة الدافعية، ففي دراسة لعبد الرحمن صالح أوضح أثر استخدام المسجل وفعاليته في تعلم تلاوة القرآن الكريم في الأردن في المرحلة الثانوية، حيث إن استخدام المسجل يتيح للمعلم فرصة أفضل للتركيز على أداء الطلبة في التلاوة، وهم يرددون الآيات التي يسمعونها من المسجل (1) .",
    "foot_note": "1. (1) موسى، 1420هـ، 156-157- لم يذكر تاريخ الدراسة",
    "book_id": "989",
    "new_page_number": 60
  },
  {
    "serial_number": "1159976",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "وليست الوسائل الأخرى بأوفر حظا من السبورة والشريط، فتكاد الوسائل الأخرى كاللوحات بأنواعها، والشَّفَّافيات، ومختبر اللغة، والأفلام لا تستعمل من خلال نسبة من يستخدمها من المعلمين، حيث بلغت النسب على التوالي، 5%، و 5%، و 5%، و 8.3%، فمن الملاحظ أن معلمي هذه المرحلة لا يعتمدون بصورة دائمة على أية وسيلة، وبالطبع هذا مخالف لما تطمح إليه الجهات المعنية بالتعليم، ولا يعني أن معلم القرآن الكريم لا يحتاج للوسائل الحديثة بل هو أحوج ما يكون لمتابعة التطورات الحديثة وبعث روح التشويق للطلاب باستخدام الوسائل المختلفة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 61
  },
  {
    "serial_number": "1159977",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "تعزيز ونشاط غير صفي وتطبيق مناهج من خلال النسب في ملحق رقم (5) نلاحظ ما يلي: يميل المعلمون في هذه المرحلة إلى (التعزيز) الثناء على أفعال الطلاب المحمودة وذم أفعالهم المكروهة حيث بلغت نسبتهم 68.3%. لا يكلف معلمو هذه المرحلة الطلاب بالتحضير للدرس قبل إعطائه والرجوع إلى مصادر المعرفة المختلفة حيث بلغت نسبة المعلمين الذين يقومون بذلك 31.7% وهذه نسبة متدنية حيث إن المعلمين إذا قاموا بهذا الإجراء فإنه يسهل عليهم تدريس المقرر ويكمل النقص الحاصل في عدد الحصص المخصصة لتعليم القرآن الكريم وبخاصة إذا كان تحصيلهم بصورة عامة دون الوسط. يرى معلمو هذه المرحلة أن في ترتيل الطلاب لآيات القران الكريم فائدة في التعلم والتفكير والاستنباط حيث بلغت نسبة من يرى ذلك من المعلمين 68.3%وهذه نسبة مقبولة، ولكن يجب أن يصاحب ذلك استثارة همم الطلاب بالبحث والتنقيب. يربط 55% من معلمي هذه المرحلة معاني الآيات موضوع الدرس بالحياة العامة مع إعطاء الأمثلة وهذه النسبة مقبولة ولكن يجب أن ترتفع اكثر في وقت يسعى فيه أعداء الأمة ضد ربط القران الكريم بالحياة حيث إن المرحلة المتوسطة والثانوية مرحلة حساسة في بناء فكر الناشئة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 62
  },
  {
    "serial_number": "1159978",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "هـ. لا يرى معلمو هذه المرحلة استخدام أسلوب التلقين في تعليم القرآن الكريم حيث بلغت نسبة من رأى هذا الرأي 28.30%. يركز معلمو هذه المرحلة على إنهاء المقرر ولا يركزون على إجادة الطلاب للقراءة حيث بلغت نسبة من يركزون على الأمرين السابقين 70%،و36.7%. والواجب أن ينهى المقرر مع التركيز على إجادة الطلاب للقراءة حيث يمكن للمعلم أن يعالج ضعف الطلبة في القرآن الكريم بحثهم على مراجعة الآيات في المنزل والالتحاق بحلقات القران الكريم في المسجد وإقامة حلقة مسائية للطلاب في المدرسة (1) لا يميل معلمو هذه المرحلة إلى إجراء مسابقات في إتقان تلاوة القرآن الكريم بين الطلاب حيث بلغت نسبة من يؤيد إجراء المسابقات بصورة دائمة 26.6%، والواقع يجب أن يكون غير ذلك بتشجيع المسابقات على شتى أنواعها من خلال لجان النشاط الطلابي وحصص النشاط في هذه المرحلة.",
    "foot_note": "1. (1) الفرج،1416هـ،73.",
    "book_id": "989",
    "new_page_number": 63
  },
  {
    "serial_number": "1159979",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "اختبار التعلم القبلي: إن المدرسين لا يهتمون بهذا المحور الاهتمام المقبول عدا تكليفهم للطلاب بقراءة آيات الدرس السابق أولًا مع بداية الموقف الصفي حيث بلغت نسبة من يطبق هذا الإجراء 43.3%، ولكنها أفضل من نسبة معلمي المرحلة الثانوية والمتوسطة. لا يميل المدرسون في هذه المرحلة إلى مناقشة الطلاب في مدلولات الألفاظ ولا المعنى الإجمالي لآيات الدرس السابق حيث بلغت نسبة من يطبقون ذلك من المدرسين في الإجراءين المذكورين 26.6% لكل منهما، وهذه نسبة غير مقبولة ولكنها أفضل من النسبة في المرحلة الثانوية والمتوسطة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 64
  },
  {
    "serial_number": "1159980",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "عرض الدرس: لا يهتم مدرسو القرآن الكريم في هذه المرحلة بالتقديم الجيد للدرس الجديد، حيث بلغت نسبة من يطرح الأسئلة أو يسرد قصة لإثارة اهتمام الطلاب للكشف عن موضوع الدرس الجديد 36.6% من مدرسي هذه المرحلة، وهذه نسبة متدنية، حيث يجب على الأستاذ الجامعي أن يبذل أقصى ما يستطيع لإثارة الطالب عقليًا (1) . بلغت نسبة من يكلف الطلاب قراءة الآيات الكريمة موضوع الدرس الجديد قراءة صامتة 30% وهذه نسبة متدنية لما للقراءة الصامتة كما أسلفنا من آثار تربوية تسهل عملية التعلم، وبخاصة في هذه المرحلة التي يحتاج فيها الطلاب لرفع كفاياتهم وبخاصة تعويدهم على القراءة الصامتة والفهم. إن المدرس الجامعي يجب أن يبذل أقصى ما يستطيع لجعل طلابه مشاركين بفعالية في البحث والاستكشاف والمزيد من التعلم (2) ، وهذا لا يظهر من خلال النسب المدونة في الملحق رقم (5) فقرة رقم 8، 24، 25، 26، 27، فقد بلغت نسبة من يناقشون الطلاب للتوصل إلى المعنى الإجمالي (الفكرة العامة) لآيات الدرس الجديد 36.6%، وهذه نسبة متدنية وهي أفضل من التعليم الثانوي والمتوسط.",
    "foot_note": "1. (1) راشد، 1408هـ، 108 \n2. راشد، 1408هـ، 108",
    "book_id": "989",
    "new_page_number": 65
  },
  {
    "serial_number": "1159981",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "يلاحظ اهتمام المدرسين بالتلاوة بشتى الطرق بتلاوة آيات الدرس الجديد كاملة تلاوة مجودة عدة مرات، والوقوف على رؤوس الآيات، وتلاوتها مع ضبط الحركات، حيث بلغت نسبة من يطبقون ذلك من المدرسين على التوالي 70%، و 66.6%، و 76.6%، وهذه نسب مقبولة رغم أننا نطمح لأن تكون أعلى من ذلك. هـ. يكلف مدرسو هذه المرحلة الطلاب المجيدين بالتلاوة لآيات الدرس الجديد بعد تلاوتهم، حيث بلغت نسبة أولئك المدرسين 76.6% وهذه نسبة مقبولة، ولكنها أقل من نسب المراحل الأخرى. لا يميل مدرسو هذه المرحلة إلى تكليف الطلاب بالقراءة بدون ترتيب، حيث بلغت نسبة هؤلاء المدرسين 26.6% والأصل عكس ذلك لما في الأسلوب العشوائي (بدون ترتيب) من أثر في شد الطالب دائما للدرس انتظارا لتكليفه بالقراءة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 66
  },
  {
    "serial_number": "1159982",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "لا يميل مدرسو هذه المرحلة إلى القراءة الجهرية الجماعية والجهرية الزمرية، وتصنيف الطلاب إلى مجموعات والقراءة حسب قدراتهم العقلية، وتوزيعهم إلى مجموعات، لكل مجموعة عريف إذا كان عدد الطلاب كثيرًا، وتكليف الطلاب بالترديد خلف المدرسين حيث كانت نسبة من يطبق الإجراءات السابقة على التوالي، 20%، و 16.6%، و 23.3%، و 13.3%، و 43.3%، ولكنهم أيضا لم يرفضوا ذلك مطلقًا بعكس معلمي المرحلة الثانوية والمتوسطة الذين مالوا إلى رفض ذلك، حيث كانت نسب الرفض 65%، و 73.3%، و 53.3%، و 70%، و 51.7%، (من خلال نسب ملحق رقم 5) . يطالب 93.3% من معلمي هذه المرحلة الطلاب بتطبيق أحكام التجويد في تلاوتهم، وهذا أمر واجب وطبيعي. يتابع مدرسو هذه المرحلة قراءة الطلاب من المصحف والتأكد من تحريك أصابعهم مع كل كلمة، وهذه المسألة فيها نظر، حيث بلغت نسبة من يطبق هذا الإجراء من المدرسين 66.6%، لأن هذا الإجراء لا يتناسب مع هذه المرحلة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 67
  },
  {
    "serial_number": "1159983",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "التقويم التكويني: لا يختلف مدرسو القرآن الكريم في هذه المرحلة عن غيرهم في الاعتماد على أنفسهم في التصويب الفوري لأخطاء الطلاب حيث بلغت نسبة أولئك المدرسين 80% وهذه نسبة عالية وخطأ تربوي كما أسلفنا سابقًا، في حين أن نسبة من يترك الفرصة للطالب القارئ لتصويب نفسه عندما يخطئ في القراءة 40%، وهذه نسبة غير مقبولة، أما نسبة من يكلف أحد الطلاب بتصويب خطأ الطالب القارئ فبلغت 20%، وقد وقع في الخطأ التربوي الخاص بتصويب خطأ القارئ من قبل المدرس رأسا معظم معلمي المراحل السابقة للمرحلة الجامعية أيضًا.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 68
  },
  {
    "serial_number": "1159984",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "أسلفنا في الفقرة (ج) من عرض الدرس، أن مدرسي هذه المرحلة لا يُعنَون بدور الطلاب بصورة عامة، فهم لا يميلون إلى مناقشة الطلاب بمدلولات مفردات آيات الدرس الجديد، والمعنى الإجمالي، والأفكار العامة، والأفكار الجزئية والتفصيلية لتلك الآيات، حيث بلغت نسب من يطبقون هذه الإجراءات على التوالي، 26.6%، و 33.3%، و 26.6%، و 16.6%، وهذه النسب غير مقبولة لأن المدرس الجامعي يجب أن يناقش الطلاب بما يدربهم على التفكير التأملي والتفكير الإبداعي، لأن ذلك يؤدي إلى أنماط استجابة ملائمة من جانب الطالب، وأفضل مقرر يحتاج للتأمل والمناقشة القرآن الكريم لتثبيت العقيدة الإسلامية الصحيحة في نفوس الطلاب في عصر عولمة المعرفة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 69
  },
  {
    "serial_number": "1159985",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "استخدام الوسائل: يعتمد مدرسو هذه المرحلة على السبورة وسيلةً تعليمية، حيث احتل استخدام السبورة في تعزيز جوانب الصواب في الدرس المكانة الأولى لدى المدرسين، حيث بلغت نسبة من يستخدم السبورة من المدرسين 60%، في حين نلاحظ أن نسبة 23.3% من المدرسين يعتمدون على الأشرطة وسيلة تعليمية، ويبدو أن معلمي المرحلة المتوسطة والثانوية ومدرسي التعليم الجامعي لا يميلون إلى استخدام الأشرطة، وهذا إجراء غير سليم، لأن الشريط وسيلة تعليمية ناجحة إذا أحسن استخدامه وبخاصة مع ظهور الضعف العام في مستويات الطلاب في تلاوة القرآن الكريم، وإن أشرطة الفيديو تعد من الوسائل التي تجمع بين الصوت والصورة، حيث تبين حركات الفم وكيفية النطق مما يجعلها وسيلة فاعلة مؤثرة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 70
  },
  {
    "serial_number": "1159986",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "لا يستخدم مدرسو هذه المرحلة الوسائل التعليمية الأخرى من لوحات مختلفة في توضيح أفكار والدرس مفاهيمه، لأن الطالب إذا لم يتعلم على استخدام الوسائل المختلفة، فكيف سيوصل معلوماته إلى طلابه؟ فالمخرجات التي نتوقعها من الطالب هي مردود المدخلات، فإذا كان لا يوجد مدخل وبخاصة من جانب الوسائل، فكيف نطلب من هذا الطالب استخدام وسيلة في المستقبل عندما يصبح معلما؟. قد يكون إهمال المعلمين في مراحل التعليم العام لاستخدام الوسائل المختلفة مرده إلى ضعف الجانب التربوي في التعليم الجامعي، حيث لم يستخدم اللوحات سوى 10% من المدرسين. إن نسبة 26.6% من مدرسي هذه المرحلة يستخدمون الشفَّافيات في توضيح الأفكار العامة والجزئية في الدرس، وهذه نسبة متدنية مع انتشار الوسائل التعليمية الحديثة، لأن جهاز العرض فوق الرأس (أو ما يسمى بالسبورة الضوئية أو السبورة البيضاء) سهل الاستخدام، ويستخدم عوضًا عن السبورة الطباشيرية، وله مزايا تقضي على سلبيات السبورة الطباشيرية، فيستطيع المدرس تكبير الكلمات والصور وإعداد أشكال متعددة من الشفافيات بالإضافة إلى التحكم في عرض خطوات الدرس.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 71
  },
  {
    "serial_number": "1159987",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "يظهر من خلاصة إجابات المدرسين أنهم لا يستخدمون مختبرات اللغة في تدريسهم إلا بنسبة متدنية حيث بلغ من يستخدم مختبر اللغة من المدرسين 10%، وربما تكون هذه النسبة أقل بكثير وسبب ذلك يعود إلى عدم وجود مختبرات لغة أصلا رغم أن وجود مختبر لغة يسهل عملية التعليم والتعلم بصورة عامة. هـ. تستخدم نسبة صغيرة من مدرسي هذه المرحلة الأفلام المناسبة في إدراك مفاهيم الآيات موضوع الدرس بنسبة متدنية، حيث بلغت 6.6% وهذه نسبة غير مقبولة رغم فاعلية الأفلام في توصيل المعلومات بكل يسر وسهولة، وعلى كل حال كيف نطلب من المدرسين أن يستخدموا مثل هذه الوسائل ومعظم المدرسين غير مؤهلين تربويًا ولا ننتقص من قدرة أولئك المعلمين المجِّدين وهذا ملاحظ من خلال مؤهلات المدرسين القائمين على تعليم القرآن الكريم.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 72
  },
  {
    "serial_number": "1159988",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "تعزيز ونشاط غير صفي وتطبيق ومناهج: يلاحظ أن المدرسين في هذه المرحلة يميلون إلى تعزيز أفعال الطلاب، حيث بلغت نسبة من يقوم بهذا الإجراء 63.3%، وهذه نسبة مقبولة في الوقت الذي لا يرفض أحد منهم هذا الإجراء، والنسبة المذكورة مقاربة لنسبة المرحلة الثانوية والمتوسطة، والطالب مهما كان سنه يحتاج إلى تعزيز بشتى الوسائل. تميز مدرسو هذه المرحلة بتكليف الطلاب بالتحضير للدرس قبل إعطائه والرجوع إلى مصادر المعرفة المختلفة، حيث بلغت نسبة من يقومون بهذا الإجراء من المدرسين 56.6% في الوقت الذي لم تصل النسبة لمثل هذا الإجراء في بقية المراحل إلى الدرجة المقبولة، ومثل هذا الإجراء ضروري لتشجيع الطلاب على البحث والتنقيب، وحافز لهم للمشاركة الإيجابية مما يزيد دافعيتهم للتعلم. يرى معظم مدرسي هذه المرحلة أهمية ترتيل الطلاب لآيات القرآن الكريم في التعليم والتفكير والاستنباط، حيث بلغت نسبة من يرى ذلك 90% من المدرسين فيجب على المدرسين تنمية ملكة التفكير والاستنباط من آيات الله مع هذا القدر الهائل من ثروة المعلومات.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 73
  },
  {
    "serial_number": "1159989",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "يربط 60% من مدرسي هذه المرحلة معنى الآيات موضوع الدرس بالحياة العامة مع إعطاء الأمثلة وذلك لما لهذا الإجراء من أهمية في تكوين الشخصية المسلمة القوية، وتعد هذه النسبة من أعلى النسب في المراحل المختلفة لهذا الإجراء. هـ. يميل 53.3% من مدرسي هذه المرحلة لاستخدام طريقة التلقين فقط في تعليم القرآن الكريم وهذا ما يتفق مع الأسلوب الأمثل لتعليم القرآن الكريم. يلتزم 80% من مدرسي هذه المرحلة بإكمال المقرر الدراسي مع أن 33.3% يركزون على إجادة الطلاب للقراءة بغض النظر عن إكمال المقرر ولكن ذلك ليس عذرًا مقبولًا لأن الإجادة تحصل مع إكمال المقرر إذا سار المدرس حسب الأصول ولجأ إلى الحلول الناجحة في تذليل الصعاب أمام الطلاب متوسطي التحصيل، بتشجيعهم على الالتحاق بحلقات القرآن الكريم ومتابعتهم المستمرة إن نسبة 50% من مدرسي هذه المرحلة يميلون إلى إجراء المسابقات في إتقان التلاوة بين الطلاب وهذه نسبة مقبولة وهي أفضل من النسب في المرحلة الثانوية والمتوسطة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 74
  },
  {
    "serial_number": "1159990",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "وبعد هذا التحليل نكون قد أجبنا عن تساؤلات البحث ببيان طرق التدريس السائدة في مراحل التعليم العام والتعليم الجامعي وبيان سلبياتها وإيجابياتها والمقارنة بين المراحل بقدر الإمكان. وفيما يلي يمكن تلخيص أبرز النتائج السابقة والتوصيات التي يمكن الأخذ بها.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 75
  },
  {
    "serial_number": "1159991",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "أبرز نتائج البحث وتوصياته أولًا: يمكن تلخيص أهم النتائج السابقة بما يلي: يلتزم المعلمون في جميع مراحل التعليم بتلاوة الآيات الكريمة بطرق متعددة ولكن بنسب مختلفة، مع ملاحظة عدم اهتمام البعض بالوقوف على رؤوس الآيات وبخاصة معلمو الصفوف الابتدائية العليا. يُلزم المعلمون الطلاب بالتقيد بأحكام التجويد في جميع المراحل. يرى المعلمون جميعًا أن ترتيل الطلاب لآيات القرآن الكريم فيه فائدة في التعلم والتفكير والاستنباط. يربط المعلمون معنى الآيات بالحياة العامة مع إعطاء الأمثلة. يلتزم كل المعلمين في جميع المراحل على إكمال المقرر الدراسي. يركز المعلمون على إجادة الطلاب للقراءة بغض النظر عن إكمال المقرر الدراسي عدا معلمي المرحلة المتوسطة والثانوية والمرحلة الجامعية. لا يهتم معلمو القرآن الكريم في جميع مراحل التعليم بمحور اختبار التعلم القبلي سواء بتكليف الطلاب بقراءة آيات الدرس السابق أو مناقشتهم بمدلولات الألفاظ والمعنى الإجمالي للآيات أو ما شابه ذلك، وهذا يؤدي إلى إهمال الطلاب لمسألة مراجعة الدروس السابقة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 76
  },
  {
    "serial_number": "1159992",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "إن عنصر التشويق والتمهيد الجيد للدرس الجديد لإثارة اهتمام الطلاب لم يصل إلى درجة القبول في جميع مراحل التعليم. عدم اهتمام معلمي القرآن الكريم في جميع المراحل بالقراءة الصامتة بالرغم مما لهذه الطريقة من آثار طيبة في تسهيل عملية التعلم والتعليم. لا يهتم معلمو جميع مراحل التعليم بشكل عام بالقراءة الجماعية ولا بالقراءة الزمرية، ولا يميلون إلى تقسيم الطلاب إلى مجموعات مهما كثر عددهم. عدم اتباع معلمي القرآن الكريم الطرق التربوية في تصحيح أخطاء الطلاب، حيث يقوم المعلمون بتصحيح الأخطاء بأنفسهم ولا يتركون الفرصة للطالب القارئ بتصحيح أخطائه، ثم من قبل طالب آخر، ثم يأتي دور المعلم. يعتمد معلمو القرآن الكريم على الوسائل القديمة وخاصة السبورة الطباشيرية بالإضافة إلى المسجل في المرحلة الابتدائية فقط رغم تطور وسائل التعليم من شفافيات وأفلام ومختبرات لغة … الخ. لا يهتم معلمو التعليم العام في جميع المراحل بالعناية بدور الطلاب، فلا يميلون تكليفهم بالتحضير للدرس الجديد.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 77
  },
  {
    "serial_number": "1159993",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "لا يعتمد معلمو جميع مراحل التعليم العام على التلقين فقط في تعليم القرآن الكريم، في الوقت الذي اعتمد فيه معلمو المرحلة الجامعية على التلقين فقط. لا يميل معلمو الصفوف العليا من المرحلة الابتدائية والمرحلة المتوسطة إلى إجراء المسابقات في تلاوة القرآن الكريم. ثانيًا: من خلال النتائج السابقة فيمكن الأخذ بالتوصيات التالية: أن يتولى مشرفو التربية الإسلامية مسألة التأكد من تطبيق المعلمين لجميع إجراءات تعليم القرآن بكل جدية بما يتلاءم مع كل مرحلة من مراحل التعليم مع إقامة دروس نموذجية لتعليم القرآن الكريم مع استخدام تقنيات التعليم الحديثة. على معلمي القرآن الكريم الاهتمام بالتحضير لدروس القرآن الكريم وأخذ ما يلي بعين الاعتبار: التمهيد الجيد وتشويق الطلاب لدرس القرآن الكريم الاهتمام بجميع أنواع القراءة وبخاصة القراءة الصامتة والجماعية والجهرية والزمرية والفردية حسب كل مرحلة. اتباع الأصول التربوية في تصحيح أخطاء الطلاب. استخدام الوسائل التعليمية المناسبة في الوقت المناسب. تفعيل دور الطلاب في حصص القرآن الكريم والعمل على زيادة دافعهم إلى التعلم، وتحسين مستوياتهم بكل الطرق الممكنة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 78
  },
  {
    "serial_number": "1159994",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "الاهتمام بالتلقين في تعليم القرآن الكريم في جميع مراحل التعليم. الاهتمام بالأنشطة غير الصفِّية لحفز الطلاب على تعلم القرآن الكريم، ومن ذلك إجراء المسابقات الجادة مع زيادة التعزيز المادي للطلاب. والله الموفق",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 79
  },
  {
    "serial_number": "1159995",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "ملحق رقم (1) أسماء المحكمين لصدق المحتوى 1- د. محمد بن إبراهيم الخطيب، دكتوراه مناهج وطرق تدريس، المشرف التربوي بكلية الزرقاء - جامعة البلقاء - الأردن، (سابقًا) والمشرف التربوي بإدارة التعليم بالهيئة الملكية بالجبيل. 2- د. أحمد محمد الزعبي، دكتوراه توجيه وإرشاد نفسي، الأستاذ المساعد بقسم التربية وعلم النفس والوسائل التعليمية، بكلية المعلمين بالقنفذة. 3- د. سيد سائح حمدان، دكتوراه مناهج وطرق تدريس، رئيس قسم المناهج وطرق التدريس بكلية المعلمين بالقنفذة. 4- أ. د. عبد الحافظ الجزولي، دكتوراه تقنيات، رئيس قسم التربية وعلم النفس والوسائل التعليمية بكلية المعلمين بالقنفذة. 5- د. عيد الشطناوي، دكتوراه أصول تربية إسلامية، الأستاذ المساعد بقسم التربية وعلم النفس والوسائل التعليمية بكلية المعلمين بالقنفذة. 6- د. محمد عوض الكريم الدّوش، دكتوراه شريعة، عميد كلية أصول الدين بجامعة أم درمان الإسلامية (سابقا) . 7- د. عادل محمود المنشاوي، دكتوراه قياس وتقويم، الأستاذ المساعد بقسم القياس والتقويم، جامعة الإسكندرية. 8 - أ. إبراهيم الأسمري، مدرس طرق تدريس القرآن الكريم بكلية المعلمين بالقنفذة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 80
  },
  {
    "serial_number": "1159996",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "9- الأستاذ محمد عامر، مدير مدرسة تحفيظ القرآن الكريم بالقنفذة. 10- الأستاذ علي أحمد الراشدي، الموجه التربوي للتربية الإسلامية بإدارة تعليم محافظة القنفذة. 11- الأستاذ علي موسى الشاردي، الموجه التربوي للتربية الإسلامية بإدارة تعليم محافظة القنفذة.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 81
  },
  {
    "serial_number": "1159997",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "مراجع الدراسة 1- القرآن الكريم. 2- الأبراشي، محمد عطية، التربية الإسلامية وفلاسفتها، دار الفكر العربي، 1396هـ-1976م. 3 - أحمد، محمد عبد القادر، طرق التدريس العامة، مكتبة النهضة المصرية، القاهرة، 1416هـ-1995م. 4 - البشير، محمد مزمل، ومحمد مالك محمد سعيد، مدخل إلى المناهج وطرق التدريس، دار اللواء للنشر والتوزيع، 1416هـ-1995م. 5- جان، محمد صالح بن علي، المرشد النفيس إلى أسلمة طرق التدريس، دار الطرفين، الطائف، 1418هـ. 6- الخطيب، محمد إبراهيم، مرشد المعلم في الموقف الصفي، مكتبة الفلاح، دار حنين، الكويت - عمان، 1998م. 7- الدارمي، عبد الله عبد الرحمن، سنن الدارمي، تحقيق عبد الله هاشم يماني، دار المحاسن، القاهرة، 1386هـ-1966م. 8- الدوش، محمد بن عبد الله، المدرس ومهارات التوجيه، دار الوطن - الرياض، 1418هـ. 9- راشد، علي، الجامعة والتدريس الجامعي، دار الشروق، جدة، 1408هـ-1988م. 10- الرومي، فهد بن عبد الرحمن، دراسات في علوم القرآن، مكتبة التوبة، الرياض، 1420هـ. ، التدريس- أهدافه، أسسه، أساليبه، تقويم نتائجه وتطبيقاته، عالم الكتب - القاهرة، 1983م.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 82
  },
  {
    "serial_number": "1159998",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "12- الزعبلاوي، محمد السيد، طرق تدريس القرآن الكريم، مكتبة التوبة - الرياض، 1420هـ. 13- سالم، عبد الرشيد عبد العزيز، التربية الإسلامية وطرق تدريسها، دار البحوث العلمية- الكويت، 1979م. 14- الشافعي، إبراهيم محمد الشافعي، التربية الإسلامية وطرق تدريسها، ط2، مكتبة الفلاح - الكويت، 1404هـ-1984م. 15- شحاته، زين محمد، وعبد الله الجغيمان، طرق تدريس المواد الشرعية في المرحلة الابتدائية، الندوة العالمية للشباب الإسلامي - الإحساء، 1420هـ. 16- عثمان، حسن ملا، طرق تدريس المواد الإسلامية في المدارس المتوسطة والثانوية، دار عالم الكتب للطباعة والنشر والتوزيع، الرياض، 1417هـ-1996م. 17- عيد، يحيى إسماعيل، أساليب تدريس التربية الإسلامية - بين الأصالة والمعاصرة- عمان، 1420هـ. 18- الغزالي، محمد بن حامد، إحياء علوم الدين، المكتبة العصرية، صيدا، 1420هـ. 19 - الفرح، عبد الرحمن بن مبارك، أساليب وطرق تدريس مواد التربية الإسلامية، مكتبة دار الحميضي - دار الكتاب والسنة، الرياض - إسلام أباد، 1406هـ-1996م.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 83
  },
  {
    "serial_number": "1159999",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "20- القعيد، إبراهيم بن حمد، وعيد بن عبد الله الشمري، (مترجمان) ، مبادئ تعلم وتعليم اللغة (لدوجلاس براون) ، مكتب التربية العربي لدول الخليج، الرياض، 1414هـ-1994م. 21- قنديل، يس عبد الرحمن، التدريس وإعداد المعلم، ط2، دار النشر الدولي، الرياض، 1418هـ-1998م. 22- الكيلاني، ماجد عرسان، فلسفة التربية الإسلامية، دار الريان، بيروت، 1419هـ-1998م. 23- لبيب، رشدي، وجابر عبد الحميد جابر، ومنير عطا الله، الأسس العامة للتدريس، دار النهضة العربية، بيروت، 1983م. 24- اللقاني، أحمد حسين، وبرنس أحمد رضوان، تدريس المواد الاجتماعية، ط3، عالم الكتب، القاهرة، 1988م. 25- مدكور، علي أحمد، منهج تدريس العلوم الشرعية، دار الشواف، الرياض، 1991م. 26- مرسي، محمد منير مرسي، التربية الإسلامية - أصولها وتطورها في البلاد العربية، عالم الكتب، القاهرة، 1982م. 27- مسلم، مسلم بن الحجاج، صحيح مسلم بشرح النووي، دار الفكر، بيروت. 28- موسى، مصطفى إسماعيل، تدريس التربية الإسلامية، أسس نظرية ونماذج تطبيقية، دار أبو هلال للطباعة والنشر، 1996م.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 84
  },
  {
    "serial_number": "1160000",
    "category_id": "5",
    "category": "التجويد والقراءات",
    "book_title": "تقويم طرق تعليم القرآن الكريم في مراحل التعليم العام والتعليم الجامعي",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "29- يونس، فتحي علي، ومحمود كامل الناقة، وعلي أحمد مدكور، أساسيات تعليم اللغة العربية والتربية الدينية، دار الثقافة للطباعة والنشر، القاهرة، 1981م. 30- يونس، فتحي علي، ومحمود عبده أحمد، ومصطفى عبد الله إبراهيم، التربية الدينية الإسلامية بين الأصالة والمعاصرة، عالم الكتب، القاهرة، 1999م.",
    "foot_note": "None",
    "book_id": "989",
    "new_page_number": 85
  }
]