[
  {
    "text": "Al Jarba Family in History and Literature\nAuthor: محمد بن عمر بن عبد الرحمن العقيل المعروف بأبي عبد الرحمن ابن عقيل الظاهري\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al Jarba Family in History and Literature",
    "category_id": "27",
    "category": "Genealogy",
    "new_page_number": 1
  },
  {
    "text": "sn: 6855\nbook_title: آل الجرباء في التاريخ والأدب\nbook_link: https://shamela.ws/book/318\nbook_id: 318\nauthor_name: محمد بن عمر بن عبد الرحمن العقيل المعروف بأبي عبد الرحمن ابن عقيل الظاهري\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/692\nauthor_ID: 692\neditor: Null\npublisher: Null\nedition: Null\npages: 61\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: الأنساب\ncategory_id: 27",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al Jarba Family in History and Literature",
    "category_id": "27",
    "category": "Genealogy",
    "new_page_number": 2
  },
  {
    "serial_number": "6207465",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Genealogy. Book: Al Jarba Family in History and Literature. Author: Muhammad bin Umar bin Abd al-Rahman al-Aqeel, known as Abu Abd al-Rahman Ibn Aqeel al-Zahiri [The book is automatically numbered, not matching the printed version]. Number of Pages: 61. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Al Jarba Family in History and Literature. Author: Muhammad bin Umar bin Abd al-Rahman al-Aqeel, known as Abu Abd al-Rahman Ibn Aqeel al-Zahiri [The book is automatically numbered, not matching the printed version]. Number of Pages: 61. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Muhammad bin Umar bin Abd al-Rahman al-Aqeel, known as Abu Abd al-Rahman Ibn Aqeel al-Zahiri [The book is automatically numbered, not matching the printed version]. Number of Pages: 61. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered, not matching the printed version]. Number of Pages: 61. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 3
  },
  {
    "serial_number": "6207466",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Introduction to the Book. Praise be to Allah, Lord of the Worlds, and may Allah bless Muhammad. Between the years 1373 - 1378 AH, I used to hear the news of Abdul Karim Al Jarba \"Abu Khawdhah\" and Safouk Al Jarba, on the tongue of Muhammad bin Yahyan, may Allah have mercy on him, and some of those who come to Shaqra in Ramadan, whom my father, may Allah have mercy on him, receives. A shadow of their fragrant memories remained in my memory like the remnants of a dream. Since a year ago, when I began writing my book \"Diwan Al-Shi'r Al-'Ami\" (Collection of Colloquial Poetry), I gathered scattered pieces about the Al Jarba family, like other families, from here and there to be my ammunition in interpreting this poetry only, and I did not know that these fragments would become a methodical research about the Al Jarba family. I published it as scattered benefits in the second part of \"Diwan Al-Shi'r Al-'Ami\", then my Sheikh Hamad Al-Jasser provided me with new benefits from the book \"Matali' Al-Su'ud\" by Ibn Sanad, and one benefit from the magazine \"Lughat Al-Arab\" published by Anastas Al-Karmali. Then he handed me what I was missing from the book \"Asha'ir Al-Iraq\" (Tribes of Iraq), which is the first part that expanded on the Al Jarba family, along with his corrections to the drafts of this research, leading to other information gathered with me, so I preferred to dedicate an independent research to Al Jarba. There is no doubt that the glimpses about them in books of history and genealogy do not give a complete picture, so I sought help - after Allah - from oral narration and colloquial poetry in completing this picture. I missed among the sources the book \"Asha'ir Al-Sham\" (Tribes of the Levant) by Wasfi Zakariya. The Al Jarba family is one of the families whose glories our country is proud of when they migrated to Iraq and Syria, so they were a national building in these two countries, and formed a Najdi literature there, and spread the customs and traditions of the country from which they migrated, except that what is not praised for the Shamamrah there is the disturbance of security, and the reintroduction of the custom of looting, plundering, and pre-Islamic revenge. Abdul Jabbar Al-Rawi narrated that Farhan Pasha bin Safouk Al Jarba said to the people of the village of Al-Mushahada in Iraq, admiring the hugeness of their bodies: Why don't you raid? They said: We are not good at raiding and cannot do it. He said: Raid those who are weaker (atqa') than you!! From my struggle with this research, it appeared to me that what was obscure in our history can be satisfied by observing elements that I hope our Sheikh Hamad Al-Jasser will take care of, and those for whom he paved the way who will come after him. These elements are summarized in the following: 1 - Taking care of the history, genealogy, and literature of other countries, where families and Bedouins migrated. And the succession of other events links Najd to others, so perhaps we find in the histories of Hijaz about Najd what we do not find in the books of the history of Najd. The figure is his figure and the features are his features ... But the deed is not the deed of the one with ample qualities *** A small caravan came to us from \"Al-Arid\" hurrying ... Following Ibn Arrouj, the leader of Bani Lam. And the most we find among the people of Najd is their saying: Ibn Arrouj is the last of the kings of Bani Lam. The story remains with us like a myth, until coincidences throw us to the books of the people of Iraq, so we find in the book \"Ansab Al-Asha'ir Al-Arabiyyah fi Al-Najaf Al-Ashraf\" (Genealogies of Arab Tribes in Holy Najaf) by Naji Wida'a Al-Sharis historical documentations confirming the Najdi literary narration. Al-Sharis mentioned a family in Najaf known as Al Shukr, from Al Hadid Al-Ahsa'i, who is Shukr bin Muhammad bin Shukr bin Hamoud Ibn Ali Al-Ahsa'i, one of the descendants of Yusuf bin Hadid bin Arrouj from Al Ghazzi from Al Fudul from Bani Lam. Al-Sharis's book is not of the type of conjectures found among our historians and genealogists, for he relied on endowment and inheritance papers such as an endowment deed for Al Thabit, dated 980 AH, an endowment deed for Hajj Nasir Ibn Ali Al-Ahsa'i, dated 1174 AH, and an endowment deed for Shukr bin Hamoud Al Hadid, dated 1225 AH. He quoted from the book \"Ansab Al-Arab\" (Genealogies of Arabs) by Samir Abdul Razzaq Al-Qutb that Hadid bin Arrouj was the last remaining in Najd from the clan of Al Ghazzi from Al Fudul, and mentioned about him that Hadid's leadership was after Ajl Ibn Hunaitim, and Muhammad bin Hadid took over after him. I benefited from this book in linking the chain of lineage between Al Faris, Al Rashid, and Al Ali. It will be used to link the chain for some settled families from the Bedouins. Joining such benefits crystallizes and scrutinizes some information of genealogists and historians in Najd.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 4
  },
  {
    "serial_number": "6207467",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "2 - Sufficing with what has been published of genealogy books, travelogues, and dictionaries of countries up to the limits of the fourth century and reviving what came after that which adds information and does not repeat it. Sheikh Hamad did well in publishing a section of \"Masalik Al-Absar\" even though the genealogists who came after Ibn Fadlallah benefited from it. Sheikh Hamad benefited from Ibn Rasul's book, benefits in which he is the sole source. It would be great if the care for genealogy books continued for what is after the fourth century and celebrating everything late in its era which is before the writings of contemporaries. I expect that the book Majma' Al-Ansab by Ibn Qudamah, who died in the year 620 AH, might provide something new, and so on for everything late in its era. 3 - Caring for colloquial poetry, in the dialect of the people of Najd from its inception until the stability of the Peninsula in the era of King Abdul Aziz, to interpret history and deepen it, and I have touched this benefit in the six volumes I finished from the book \"Al-Shi'r Al-'Ami\". 4 - Contacting directly the Najdi families and notables from the branches of the Bedouins to benefit from their endowment and inheritance documents. 5 - Undertaking a \"bibliographic\" guide about the history of the Peninsula, its genealogies, and its notables from books of history, biographies, travelogues, and genealogies, especially biography books from the eighth century to the end of the thirteenth.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 5
  },
  {
    "serial_number": "6207468",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "I heard from my Sheikh Ibrahim Al-Uthman that one of the Mamluk sultans - and perhaps he referred to one of Al-Maqrizi's books - requested to meet some notables of Najd and referred me to the travelogue of Ibn Al-Mujawir regarding a text of colloquial poetry, and I found it as he said. I found in the history of Al-Isami by Muhammad bin Jadu' in praise of Barakat bin Ibrahim Al-Sharif a type of old colloquial poetry recorded by Ibn Yahya and published by Ibn Hatim. I found in the genealogies of the people of Oman what I connected with the history of some ruling families in Bahrain, in the first volume of my book on colloquial poetry. I knew with certainty from a poem by Al-Kulaif \"Al-Julaif\" that Muqrin Ibn Ghusayb recovered the kingdom of Al-Ahsa from Al Mughamis and that the Turks took over Al-Ahsa while the rulers were from Al Ajwad as Ibn Bishr and others said, but Ibn Bishr erred in the date only. In any case, the bibliographic project for these fragments helps students of knowledge to clarify their obscure history, especially after the opening of the public to manuscript treasuries, and the ease of photography. A decade ago, we used to see the historian's referral to a manuscript as a major merit. The Al Jarba family are from the princes of the Mountain (Jabal Shammar) and from a deeply rooted tribe in this homeland. Genealogists mentioned that the Tayy tribe left Yemen following the departure of Al-Azd from it, and settled in Samira and Fayd in the neighborhood of Bani Asad, then overcame Bani Asad over Aja and Salma, so they became known later as the two mountains of Tayy. Ibn Sa'id mentioned that they were the holders of leadership among the Arabs in his era in Iraq and the Levant. Their leadership was in Bani Rabi'ah bin Hazim from the descendants of Silsilah bin Ghanm from the descendants of Fitrah bin Tayy, for they inherited the land of Ghassan and the Levant, and among their most famous families are Al Isa bin Muhanna bin Fadl bin Rabi'ah, whom Ibn Fadlallah Al-Umari praised greatly. Our Sheikh Hamad Al-Jasser had written a book about Al Fadl in his youth and told me orally that the descendants of Al Fadl remain until now in Jordan. Shammar is a clan from Tayy, but in later ages it became a gathering of Tayy clans with other mixtures that entered into it by alliance. Ibn Dakhil attributed Al Ali and Al Rashid to Al Fadl, and he has no support except that they replaced them in place and emirate. As for genealogy books, they indicated that they are from Madhhij. If it is true that Abda is from Shammar - as quoted from the book attributed to Ibn Qudamah - then there is no doubt that their leaders Al Daigham are from Janb from Madhhij and they entered into Abda. Al Daigham until the end of the seventh Hijri century were still in the south in the land of Madhhij. It appears - seeking guidance from names - that Al Ali and Al Rashid are from the descendants of Shahwan bin Mansour bin Daigham bin Munif bin Jabir bin Ali whom Ibn Rasul mentioned. Perhaps between their nearest grandfather Arar bin Shahwan and Shahwan bin Mansour is a grandfather named Faris bin Ta'an, seeking guidance from a text about Al Faris as will be explained. I attributed them to Faris bin Ta'an because Al Khalil are the sons of Khalil bin Jasser bin Ali bin Atiyyah from Al Ja'far, and Al-Sharis mentioned that Al Faris and Al Khalil are one clan and Ibn Faris Muhammad was alive in 1109. Then he mentioned that Al Sadiq are from the descendants of Abdullah bin Muhammad bin Ali from Al Faris. If Al Sadiq are cousins of Al Ali and they were from Al Faris bin Ta'an, then Al Ali are from the descendants of Faris. All of them are from Al Ja'far, and Ibn Bassam mentioned that Al Ja'far are from the Daighams. For all this, I preferred that Al Ali and Al Rashid have a grandfather named Faris Ibn Ta'an, either from the descendants of Arar bin Shahwan or between Arar bin Shahwan and Shahwan bin Mansour bin Daigham. In any case, inserting Faris bin Ta'an into the lineage of Al Rashid is a deduction that remains a mere probability. In Ibn Rasul's text, Munif bin Daigham bin Munif bin Jabir had a son named Rashid and he had a grandson named Umair bin Ahmad bin Rashid. In the unknown author's book from which Sheikh Hamad Al-Jasser quoted the news of the black Shahwani horses in his manuscript on horses, Shahwan is the father of Arar or Rashid is the uncle of Umair. It is possible that Arar is a grandson of Munif bin Daigham. It is possible that he is from the descendants of Shahwan bin Mansour bin Daigham. In any case, the inheritance of the name Shahwan, Umair, and Rashid confirms that Arar bin Shahwan and Umair bin Rashid are from the descendants of Munif bin Daigham. Al Jarba are the leaders of Shammar and the heads of the Mountain, and the furthest mention I found of them is about the death of two of them in the year 1100 AH and the year 1103 AH. They left Najd in the year 1205 AH after their defeat before Ibn Saud, so they built their leadership in Iraq and Syria. Abda is the largest tribe of Shammar from the tribe of Janb from Madhhij, so they are cousins of Ubaidah from Qahtan. From Abda are Al Jarban, Al Ali, and Al Rashid. A poet from",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 6
  },
  {
    "serial_number": "6207469",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Ubaidah from Qahtan said: If you ask about us, O Suwaiti, Qahtanis ... 'Awasim, and those beside us are superior. We and Abda and the Daighams are two grandfathers ... Slappers on the day of meeting to every arrogant one. The princes of the Mountain after Al Jarban are Al Ali, and there is much confusion about them in history. Scholars have buried the first era of the emirate of Isa bin Ali, which resulted in confusion between the events of Abdullah Ibn Rashid in the era of Isa the first and the era of Salih bin Abdul Muhsin and the era of Isa bin Ali for the second time. I have verified the order of their rule as follows: 1 - Abdul Muhsin bin Fayez bin Muhammad bin Isa bin Ali bin Ali bin Atiyyah. He was the Emir of the Mountain in the era of Imam Abdul Aziz bin Muhammad and entered into his obedience in the year 1201 AH. 2 - Muhammad bin Abdul Muhsin took over in the year 1201 AH. 3 - Isa bin Ali took over in the year 1234 AH. 4 - Salih bin Abdul Muhsin took over in the year 1249 AH. 5 - Ibn Rashid took over in the year 1250 AH. 6 - Isa bin Ali took over a second time in the year 1253 AH. Then Abdullah bin Rashid expelled him in the same year, and thus the emirate of Al Ali ended. This arrangement came after verification, scrutiny, and discussions. After Al Ali came Al Rashid, and Dr. Abdullah Al-Salih Al-Uthaymin wrote an extremely verified and scrutinized appendix titled \"The Emergence of the Emirate of Al Rashid\" published by the Deanship of Library Affairs at Riyadh University in 1981 AD and printed by the Middle East Press in Riyadh. He touched in this appendix upon the princes of the Mountain before Abdullah bin Rashid. Dr. Al-Uthaymin's appendix is a pioneering study in dealing with our local history, in terms of deduction and benefiting from colloquial poetry and what foreigners wrote. Dr. Al-Uthaymin's attention was to history intentionally, and to colloquial poetry consequentially. I dealt with the history of Abdullah bin Al-Rashid in the second volume of my book \"The History of Najd in the Colloquial Ages\" with the opposite of this method, which is that I intended colloquial poetry and leaned on history to complete the study from poetry. When I compared what I wrote with what Dr. Al-Uthaymin wrote, I saw in his sources a capacity for me, and in his outputs and deductions landmarks by which I was guided. I saw in Dr. Al-Uthaymin's appendix something that must be rectified without prejudice to the originality of his research and its accuracy. And I saw in my research something that must be added to the Doctor's research to be complete according to the tool possessed by the researcher in this era. It is good to bring a brief about Al Ali who succeeded Al Jarba in leadership. I previously mentioned in the talk about Al Jarba that they are from Abda from Shammar, and that Abda is from Al Daigham. Al Rashid are the closest cousins of Al Ali. Dr. Ibn Uthaymin chained the lineage of Prince Muhammad bin Abdul Muhsin as follows: Muhammad bin Abdul Muhsin bin Fayez bin Muhammad bin Isa bin Ali Ibn Ali Al-Kabir, in whom the lineage of this family meets with the lineage of Al Rashid. The Doctor did not mention his source. Sulaiman Al-Dakhil said about Abdullah Al-Rashid: Abdullah Ali bin Rashid bin Khalil bin Atiyyah. And Khalil is the brother of Ali the grandfather of Al Ali. Dr. Al-Uthaymin quoted from a paper with Nayef Al Ali in Hail: Abdullah bin Ali bin Hamad bin Rashid bin Khudair bin Khalil Ibn Yasir bin Ali bin Atiyyah. Al-Uthaymin said: And what Dhari mentioned agrees with Nayef's paper, except that Hamad is a father to Rashid, not a son to him. Ibn Bishr said about Jabr, the uncle of Abdullah bin Rashid: Jabr bin Rashid bin Ali. Abu Abd al-Rahman said: It appears to me that Ali Al-Kabir is the grandfather of Al Sadiq in Najaf, for their grandfather Hajj Ahmad was alive in the year 1185 AH and he is the son of Abdullah bin Muhammad bin Ali from Shammar Abda. It appears that Ali Al-Kabir bin Atiyyah's lineage goes back to Faris Ibn Ta'an, the grandfather of Al Faras in Najaf. Al-Sharis said about Al Faris: One of the branches of Al Ja'far from the tribe of Shammar Abda Al-Ta'iyyah Al-Qahtaniyyah, and Al-Azzawi mentioned them in his book \"Asha'ir Al-Iraq\" (Tribes of Iraq) the Bedouin ones, and they are Al Khalil, one clan. Abu Abd al-Rahman said: The context of lineage from these texts for these families aligns on this tree. Faris bin Ta'an, from his descendants Ali Al-Kabir bin Atiyyah, Muhammad grandfather of Al Sadiq, Ali Isa grandfather of Al Ali, Jasser grandfather of Al Rashid.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 7
  },
  {
    "serial_number": "6207470",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "On this basis, it is correct to say that Al Rashid are from Al Ali as Al-Dakhil said, and that they are cousins of Al Ali as the majority say. This is the most I saw in the chain of lineage. As for the general genealogy books, they mention Al Rashid from Al Khalil from Al Ja'afara from Al Dughairat from Al Yahya from Abda from Shammar. Yusuf Al-Bassam said: And Al Ja'far are from the Daighams from Shammar Abda. I saw Abdullah Al-Khalid Al-Hatim mentioning that Arar bin Shahwan Al Daigham, the grandfather of Al Rashid, princes of Jabal Hail, lived in the year 850 AH. My Sheikh Hamad Al-Jasser leaned towards this in his book \"Jamharat Ansab Al-Usar Al-Mutahaddira\" (Collection of Genealogies of Settled Families), so he attributed them to Al Daigham, and quoted from the book \"Turfat Al-Ashab fi Ma'rifat Al-Ansab\" by Umar bin Yusuf Ibn Rasul \"... - 694 AH\" that Al Daigham were until the end of the seventh Hijri century still in the south in the land of Madhhij \"land of Qahtan now in the region of Asir Emirate\" and he named them Al Munif and attributed them to Janb. Their grandfather is Munif bin Daigham bin Munif bin Jabir bin Ali Ibn Abd al-Rabb bin Rabi' bin Sulaiman bin Abd al-Rahman bin Ruh Ibn Mudrik bin Abd al-Hamid bin Mudrik. It is said that they are from Nizar - from Anz bin Wa'il bin Qasit, entered into the lineage of Janb, because their mother Ubaidah bint Muhalhil bin Rabi'ah Al-Taghlibi was married by Ruh bin Mudrik. They have poems about their journey, parts of which were mentioned by Sheikhs Al-Aboudi and Al-Junaidil in their dictionaries and Sheikh Hamad Al-Jasser in his manuscript book \"Mu'jam Al-Khail\" (Dictionary of Horses). I hinted at something of that in the first volume of my book on colloquial poetry. The attribution of Al Rashid to Al Daigham is present in colloquial poetry. Abdullah bin Rashid said rebuking his group: From the door of Khaddam to the door of Shaddad ... And whoever prides himself on the Daighamiya, it paints him. Mukhlid bin Hadeires praising Abdullah bin Rashid said: The Daighami from Hail crossed the highlands ... Sent the scouts and began gathering its sides. Ali Al-Qabali Al-Tamimi said: The Daighami fills his cloak with all virility ... And we pick up what fell on the soil. Ibn Hadeires said: Abu Talal the Daighami, the elite of the children ... The leader of Ghalba in the meeting, confronting the wandering. Mani' Al-Qu'ud praising Abdul Aziz bin Mutaib Al-Rashid said: Mock the Daighams, O namesake of the dog Sadhan ... Mock the Daighams, and the Daighams are an illness to the enemy. Sulaiman bin Jumhur said: Nothing happened like the Daighami when he disappeared ... He turned away from the eye of the bad one by retreating. Ubaid bin Ali bin Rashid said: Daighams who cheapen the camels and the necks ... And for the companion with their wealth they are not stingy. And he said praising his brother Abdullah: They follow a gallant one whose maternal uncles are his paternal uncles ... From Daigham, no vein of strangers mixed in him. And he said praising his nephew Talal: Daighams who come to the basin of crowding ... They come to it when the substitutes cover the people.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 8
  },
  {
    "serial_number": "6207471",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Except that Al-Azzawi quoted from the book \"Majma' Al-Ansab\" which he attributed to Ibn Qudamah that Abda is from Shammar. Abu Abd al-Rahman said: Based on this, the Qahtanis - from other than Tayy - are Al Daigham who entered into Abda by alliance. Information about Al Ali is incomplete, and what information is found about them has much confusion. Dr. Ibn Uthaymin: Sees that the emirate of Hail during the twelfth Hijri century belonged to Al Ali belonging to Al Ja'far. He counted among the princes of this century Muhammad the First, who is Muhammad bin Isa Ibn Ali, brother of Khansa, or Al-Samn Al-Arabi. As for Sheikh Ali bin Salim, he mentions that the first of the princes of Al Ali is Abdul Muhsin bin Ali. Then he said in another place: I do not have a statement of the time of their mandate and how they became extinct, but they are from the year 1232. Abu Abd al-Rahman said: Abdul Muhsin was the Emir of Hail in the era of Imam Abdul Aziz bin Muhammad and entered into the obedience of the Imam in the year 1201 AH, thus their beginning is before the year 1201 and the saying of Ibn Salim falls: that they are from the year 1232 AH. As for Dr. Al-Uthaymin, he dropped the era of this Abdul Muhsin, and said: The Emir at the end of the twelfth century is Muhammad bin Abdul Muhsin. Abu Abd al-Rahman said: Muhammad only took over after his father Abdul Muhsin at the beginning of the thirteenth century. Al-Uthaymin quoted from the book \"Kaifa Kana Zuhur Sheikh Al-Islam Muhammad bin Abd al-Wahhab\" by an unknown author: That Hujailan in the year 1201 killed a sorcerer and installed Muhammad bin Ali as a sheikh in the region. He commented on that saying: Perhaps Hujailan confirmed Muhammad bin Ali in the leadership of the Mountain. Abu Abd al-Rahman said: I previously mentioned Ibn Salim's text that Abdul Muhsin was the Emir of Hail before his son, and Yusuf Al-Bassam mentioned: That Hujailan appointed Muhammad after the death of his father Abdul Muhsin. These two texts in addition to the text of the author of the book \"Kaifa Kana Zuhur Sheikh Al-Islam\" support the precedence of Abdul Muhsin's emirate and Dr. Al-Uthaymin has no additional knowledge to negate that. It appears that Shammar submitted to the call of Sheikh Muhammad bin Abd al-Wahhab during his life, and the life of Imam Muhammad bin Saud shortly before the year 1178 AH because the author of the book \"Lam' Al-Shihab\" mentioned in the events of this year that Muhammad bin Saud prepared an army of six thousand, led by his son Abdul Aziz by order of Muhammad bin Abd al-Wahhab, and sent it to a group of Shammar, who had entered into obedience before that and when they heard of the coming of Al-Najrani and Ar'ar they apostatized from the rule of Ibn Saud, and began raiding his outskirts, so Abdul Aziz marched with the army to Jabal Shammar and raided them at night, destroying a large group of them and capturing two hundred men or more. As for Al Ali themselves and the settled people of the Mountain, they submitted to the rule of Al Saud since the year 1201 AH. For that, there are two premises: The first: That the Shammar tribe in the year 1196 supported Sa'dun Ibn Uray'ir in his siege of Hujailan, the Emir of Buraydah on behalf of Al Saud. The second: That Shammar in Muharram of the year 1201 AH supported Thuwaini bin Abdullah, in his attack on Najd, and his siege of Qassim and Hujailan in Buraydah. Perhaps as a result of the first premise: Hujailan's raid was in the year 1200 AH where he took a caravan of Shammar and killed many of them. And as a result of the second premise with certainty: Hujailan raided by order of Imam Abdul Aziz the land of Shammar and brought them into obedience, so they pledged allegiance to Ibn Saud. This Muhammad is one of the most famous princes of Al Ali. Among the historical events in his era is that he raided the Shararat tribe in Al-Jawf in the year 1207 AH with four hundred camels and fifty horses but the result of his raid was a failure. In the year 1208 he attacked Al-Jawf and brought it into the obedience of Al Saud, so Imam Saud bin Abdul Aziz annexed the province of Al-Jawf to him. In the year 1211 AH, the people of the Mountain participated with the Saudi forces in repelling Thuwaini's campaign. It was mentioned that Muhammad raided the region of Iraq and clashed with Al Bu'ayj and killed fifty men of them. In the year 1221 AH, Muhammad was among the leaders stationed around Medina, by order of Imam Saud, to force the Emir of the Levant pilgrims to return to his country. In the year 1225 AH, the people of the Mountain were with Imam Saud in his raid on the Levantine lands. In the year 1228 AH, Imam Saud tasked Muhammad with monitoring a division of the Ottoman Egyptian army to force it to go to Iraq. In the year 1229 AH, Muhammad participated with the Saudi forces in their failed disciplinary attack on Ayyad Al-Dhuwaibi Al-Harbi near Al-Hinakiyah. In the year 1230 AH, the people of the Mountain were with Imam Abdullah bin Saud in Qassim, when Tusun arrived there, as they were with him to discipline some",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 9
  },
  {
    "serial_number": "6207472",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Bedouins and residents after Tusun's withdrawal. Sheikh Hamad Al-Jasser mentioned that the rulers of Hail, Al Ali and Al Rashid, lived in Al-Suwaifilah, before moving to Hail, and I cited his text in the poetry of Abdullah bin Rashid while discussing his poem on the rhyme of Ta and Ra connected with Ha in the second volume of my book \"Diwan Al-Shi'r Al-'Ami\". In another text, Al-Jasser mentioned that the capital of the emirate Al-Safilah \"Al-Suwaifilah\" was built in the eighth century and soon fell into ruin, so Hail was built in its wake. He said in a third place about Al-Samra: \"It is said that it is ancient Hail and that it was the seat of Al Ali\". Ibn Uthaymin said: \"The dwellings of Al Ali were at the bottom of the base of the mountain or what is known as Al-Suwaifilah\". Then their leaders built a palace for themselves in a place called Al-Washiqi, three kilometers from their first dwellings. After that, Prince Muhammad bin Abdul Muhsin founded the famous Barzan Palace, which later became the palace of Al Rashid's rule. It is said that the palace was named Barzan because of its prominence (baruz) from their first dwelling. In the previous text, Al-Uthaymin mentioned that Muhammad bin Abdul Muhsin was the one who founded Barzan Palace, and said in another place: He laid the foundation of the famous Barzan. Al-Zirikli said about Muhammad bin Abdullah bin Rashid: He completed Barzan Palace in Hail, and Isa bin Ali had started building it. I cannot reconcile these two texts except that Muhammad bin Abdul Muhsin founded it and Isa completed it, and Muhammad Al-Abdullah renovated and expanded it. Our Sheikh Hamad Al-Jasser did not touch upon the relationship of Barzan to Al Ali, but said: A palace that was in the city of Hail during the Rashidi Emirate era, and drew its location in the book \"Al-Qawl Al-Sadid\" by Ibn Dakhil, and some of its buildings were photographed in the book \"Introduction to Antiquities in the Kingdom\" issued by the Ministry of Education in 1396 AH. Huber mentioned in his journey: That Abdullah bin Ali bin Rashid bought Barzan Palace from Al Ali. Abu Abd al-Rahman said: The fame of Barzan Palace is only in the era of Al Rashid. Rakan bin Hithlain said: And the residents after Tusun's withdrawal. Sheikh Hamad Al-Jasser mentioned that the rulers of Hail, Al Ali and Al Rashid, lived in Al-Suwaifilah, before moving to Hail, and I cited his text in the poetry of Abdullah bin Rashid while discussing his poem on the rhyme of Ta and Ra connected with Ha in the second volume of my book \"Diwan Al-Shi'r Al-'Ami\". In another text, Al-Jasser mentioned that the capital of the emirate Al-Safilah \"Al-Suwaifilah\" was built in the eighth century and soon fell into ruin, so Hail was built in its wake. He said in a third place about Al-Samra: \"It is said that it is ancient Hail and that it was the seat of Al Ali\". Ibn Uthaymin said: \"The dwellings of Al Ali were at the bottom of the base of the mountain or what is known as Al-Suwaifilah\". Then their leaders built a palace for themselves in a place called Al-Washiqi, three kilometers from their first dwellings. After that, Prince Muhammad bin Abdul Muhsin founded the famous Barzan Palace, which later became the palace of Al Rashid's rule. It is said that the palace was named Barzan because of its prominence (baruz) from their first dwelling. In the previous text, Al-Uthaymin mentioned that Muhammad bin Abdul Muhsin was the one who founded Barzan Palace, and said in another place: He laid the foundation of the famous Barzan. Al-Zirikli said about Muhammad bin Abdullah bin Rashid: He completed Barzan Palace in Hail, and Isa bin Ali had started building it. I cannot reconcile these two texts except that Muhammad bin Abdul Muhsin founded it and Isa completed it, and Muhammad Al-Abdullah renovated and expanded it. Our Sheikh Hamad Al-Jasser did not touch upon the relationship of Barzan to Al Ali, but said: A palace that was in the city of Hail during the Rashidi Emirate era, and drew its location in the book \"Al-Qawl Al-Sadid\" by Ibn Dakhil, and some of its buildings were photographed in the book \"Introduction to Antiquities in the Kingdom\" issued by the Ministry of Education in 1396 AH. Huber mentioned in his journey: That Abdullah bin Ali bin Rashid bought Barzan Palace from Al Ali. Abu Abd al-Rahman said: The fame of Barzan Palace is only in the era of Al Rashid. Rakan bin Hithlain said: O my she-camel, cross the peaks of Tumiya ... Head towards Barzan, the beautiful building. And Hamoud bin Ubaid bin Rashid said: If Ibn Hindi intended us at Barzan ... Then we at Arwa shortened the march.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 10
  },
  {
    "serial_number": "6207473",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Muhammad remained Emir of the Mountain for nearly thirty-three years, as he took over around the year 1201 and was killed in the year 1234. The reason for that is that Ibrahim Pasha, when he eliminated the Saudi state, launched a campaign against the emirs of the regions enthusiastic for the Call and its supporters Al Saud, and for this he killed Muhammad and his brother Ali in the year 1234 AH. Ibn Uthaymin said: Al-Habashi, the leader of Ibrahim Pasha's men, assassinated him by a trick in Maqsurat Al-Dahis, then cut off his head and sent it to Turkey. The poet refers to this saying: What a pity, the head of the Sheikh, the owls play with it ... Facing each other, cutting it up. As for the rest of his body, it was buried in Al-Zubara cemetery in Hail, and I saw his grave with written on one of its stones: \"Muhammad bin Ali, may Allah have mercy on him and dwell him\" and dwell him \"Dar Al-Salam\" (House of Peace). The phrase 'Emir of the Muslims' indicates that he was famous for religiosity, as it indicates that he was great, which supports what was mentioned of his enthusiasm for the call of Sheikh Muhammad bin Abd al-Wahhab, and the role he had in the state based on his call. Prince Muhammad bin Abdul Muhsin left four daughters, one of whom is Salma who married Abdullah bin Ali bin Rashid. Sheikh Ali bin Salim said: \"As for Muhammad bin Ali, the Turks killed him during their appearance in Najd at Barzan Palace in Hail when they besieged him and brought him down by force and killed him\". And now his grave is in Al-Zubara cemetery in Hail, a body without a head. Thus I heard from my father, may Allah have mercy on him, saying that, and I do not know which year that was, so Allah knows best. Dr. Al-Uthaymin mentioned: That Muhammad bin Abdul Muhsin advised the people of Qafar during the invasion of Ibrahim Pasha to build a palace part of which is at a level lower than the surface of the nearby ground so that cannons would not affect it. After the killing of Muhammad bin Abdul Muhsin, we do not know who took over directly after him, except that it is certain that Isa bin Ali bin Fayez took over before Salih bin Abdul Muhsin. The proof for that is as follows: A - The indication of Abdullah bin Rashid's Daliyah poem which I preferred was in the first period of Isa's rule, as I explained in the second volume of my book \"Diwan Al-Shi'r Al-'Ami\". B - Ibn Bishr mentioned that in the year 1243 or 1242 AH, Isa Ibn Ali bin Fayez, the head of Jabal Shammar, came to Imam Turki and pledged allegiance, and placed Hamad Al-Shuwai'ir in the treasury of the Mountain. Ibn Bishr described him in the year 1253 as the old head of the Mountain. C - That Imam Turki bin Abdullah did not appoint Salih bin Abdul Muhsin except in the year 1249 AH. Dr. Al-Uthaymin excludes the mandate of Isa bin Ali directly after Muhammad Ibn Abdul Muhsin and argues with the following: A - Ibn Bishr's saying about Isa \"Head of the Mountain\" does not indicate a previous presidency, because Ibn Bishr's habit is to describe with presidency whoever will hold it, then he mentioned examples for that. B - That Ibn Rashid took the emirate from Salih bin Abdul Muhsin by agreement of sources. C - That Ibn Bishr mentioned Salih among Turki's emirs when speaking about his assassination. Abu Abd al-Rahman said: The answer to this is as follows: 1 - That Ibn Bishr sometimes creates ambiguity by describing with presidency whoever will hold it but hasn't held it yet. But this time he removed the ambiguity by saying \"the old head of the Mountain\", so it is correct that Ibn Bishr described Isa with presidency because he was a head in the past. 2 - There is no doubt that Ibn Rashid took over the emirate after Salih bin Abdul Muhsin by agreement of sources. But the sources did not agree that Salih took over directly after Muhammad bin Abdul Muhsin, rather Ibn Bishr stated that Turki appointed him in 1249 AH. 3 - That Ibn Bishr, when he mentioned his arrival in the year 1243 AH, described him as the head and the pledge of allegiance. This is an actual definition of the head in reality. 4 - Ibn Bishr only mentioned Salih as an emir when mentioning the emirs of Turki, because he was the emir at the time of Turki's death. Ibn Bishr only mentions the Imam's emirs at the time of his death, and does not commit to mentioning everyone who commanded in his life. Thus Dr. Al-Uthaymin's probability that Isa was merely an influential person in the era of Emir Salih falls. Abu Abd al-Rahman said: This Isa is likely to be: Isa bin Ali bin Abdul Muhsin bin Fayez bin Ali. So his father would be Ali, the brother of Muhammad bin Abdul Muhsin, whom Ibrahim Pasha killed with his brother. And Ibn Bishr's saying: Isa bin Ali bin Fayez, would be by way of abbreviation, which is a familiar matter. It is also possible that Abdul Muhsin bin Fayez had a brother named Ali, so he would be Isa bin Ali bin Fayez bin Ali. As for Dr. Al-Uthaymin, he cited regarding him the following:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 11
  },
  {
    "serial_number": "6207474",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "A - Musil's saying: Muhammad bin Abdul Muhsin was succeeded by his son Isa. So he is Isa bin Muhammad bin Abdul Muhsin bin Fayez bin Ali and our friend is Isa bin Ali bin Fayez. They are two without doubt, and it is far-fetched that the second name is an abbreviation of the first, because it is an unfamiliar confusion in the abbreviation of genealogists and historians. Al-Uthaymin quoted from some Al Ali residing in Hail that Muhammad did not father a male. This is a refutation of Musil's saying without doubt. B - The saying of Dhari Al-Rashid and \"Huber\" that our friend is Isa Ibn Ubaidullah. Abu Abd al-Rahman said: We did not find a notable with historical events by this name, and it is impossible that the Emir of the Mountain is Isa bin Ubaidullah and Ibn Bishr calls him: Isa bin Ali bin Fayez! Al-Uthaymin mentioned that it was stated in a paper with Sayyid Nayef Al Ali in Hail that Abdullah is a cousin of Salih bin Abdul Muhsin. Abu Abd al-Rahman said: We do not deny the existence of someone named Ubaidullah or Isa in Al Ali, but we deny that Isa bin Ubaidullah is Isa bin Ali bin Fayez the Emir. Al-Uthaymin said: As for the Al Ali family present today, they are from the descendants of Isa bin Salih bin Abdul Muhsin. This Isa was a child when the events befell his father, so his mother hid him until matters settled later. Abu Abd al-Rahman said: So this Isa's era of eligibility for mandate is different from the era of Isa bin Ali bin Fayez. After Isa, Salih bin Abdul Muhsin took over, appointed by Imam Turki in the year 1249 AH as passed previously, then Imam Faisal removed him in the year 1250 AH and appointed Abdullah bin Rashid. I explained in the second volume of my book \"Diwan Al-Shi'r Al-'Ami\" the story of Salih's killing and that Ubaid bin Ali bin Rashid was the one who killed him. In the year 1253, the aforementioned Isa bin Ali seized Hail and expelled Abdullah bin Rashid, then Abdullah expelled him in the same year and thus the emirate of Ali ended. Muhammad bin Abdul Muhsin, who is the most prominent leader from Al Ali, Dr. Al-Uthaymin cited his lineage as follows: Muhammad bin Abdul Muhsin Ibn Fayez bin Muhammad bin Ali bin Ali Al-Kabir. And it appeared in Ibn Bishr: Muhammad bin Abdul Muhsin bin Fayez Ibn Ali and sometimes Muhammad bin Abdul Muhsin bin Ali, so we interpret Ibn Bishr's context as abbreviation. As for Dr. Al-Uthaymin, perhaps he relied on documents with Al Ali in Hail. The fact that Muhammad is the Emir after his father is not a place of confusion, but Ibn Salim said: \"The first kings of Al Ali are Abdul Muhsin bin Ali and after him his son Salih bin Abdul Muhsin and after him Muhammad bin Ali\". Al-Marik commented on that saying: And after Muhammad \"i.e. Ibn Ali\" his brother Salih bin Ali. So his word 'Akhu' (brother) without Ha caused confusion, except that Sheikh Hamad quoted this text a second time and removed the confusion when he said: For the one who took over the emirate after Muhammad bin Ali is his brother Salih bin Ali according to what Professor Fahd Al-Marik informed me. In any case, the subject needs detailing which is not the place for here. Abu Abd al-Rahman said: Muhammad bin Ali is before his brother Salih contrary to what Ibn Salim claimed. And after Muhammad bin Ali: Isa bin Ali before Salih bin Ali and this is what Al-Marik missed. Ibn Salim claimed that Abdul Muhsin has a mention in the history of Ibn Bishr. Abu Abd al-Rahman said: Ibn Bishr did not mention him, he only mentioned his son Muhammad and Salih. Since my benefit from the first part of \"Asha'ir Al-Iraq\" and from the magazine \"Lughat Al-Arab\" was after I edited the material of this research, I preferred keeping my research as it is provided that I make the texts of \"Asha'ir Al-Iraq\" and \"Lughat Al-Arab\" two verified appendices at the end of the book. In conclusion of this preface, I offer my sincere thanks to the teacher of the generation Hamad Al-Jasser who offered me his support and guidance, and I hope that the deficiencies of this book will be completed by what is in his manuscript on horses of news and poems of Al Daigham, and Allah is the Helper. Written for you by Abu Abd al-Rahman bin Aqeel Al-Zahiri Riyadh 9/4/1402 AH Then finished revising it on 30/4/1402 AH Al Jarba Family 2 - Their lineage, and the story of their departure from the South to the land of Al-Mahbalin, then their journey to Iraq and Syria. Lineage of Al Jarba",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 12
  },
  {
    "serial_number": "6207475",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "It is agreed upon among genealogists that Al Jarba are from Abda from Shammar. A section of them entered into Sinjara from Shammar, and they are still now in Syria under the leadership of Mizar Al Jarba, Sheikh of Al-Fadaghah, and Daham Al Jarba, Sheikh of Al-Kharsa. Shammar is a clan from Tha'labah bin Amr from Tayy as Ibn Al-Kalbi said. It is today one of the major Arab tribes. When Ibn La'bun spoke about Shammar the father of the tribe, he said: This attribution Shammar has prevailed over the people of Jabal Tayy from the Bedouins and some of the settled people, and it appears that not all of them are from his descendants, and it is not unlikely that others who meet with him in his lineage column from the rest of Tayy are attributed to him, as well as those who mixed with them or settled with them from neighbor or ally may be attributed to them, with the passage of time. Abu Abd al-Rahman said: So Abda is one of the largest Shammar tribes of Tayy by alliance, and it is from the tribe of Janb of Madhhij by lineage. They are cousins of Ubaidah from Qahtan. A poet from Ubaidah from Qahtan said: If you ask about us, O Suwaiti, Qahtanis ... 'Awasim and those beside us are superior. We and Abda and the Daighams are two grandfathers ... Slappers on the day of meeting to every arrogant one.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 13
  },
  {
    "serial_number": "6207476",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "As for the general Tayy, genealogists mentioned that the Tayy tribe left Yemen following the departure of Al-Azd from it, and settled in Samira and Fayd, in the neighborhood of Bani Asad, then overcame Bani Asad over Aja and Salma, so they became known later as the two mountains of Tayy. Ibn Sa'id mentioned the holders of leadership among the Arabs in his era in Iraq and the Levant. Their leadership was in Bani Rabi'ah bin Hazim, from the descendants of Fitrah bin Tayy, for they inherited the land of Ghassan and the Levant, and among their most famous families are Al Isa bin Muhanna bin Fadl bin Rabi'ah, whom Ibn Fadlallah Al-Umari praised greatly. Our Sheikh Hamad Al-Jasser had written a book about Al Fadl in his youth, and told me orally that the descendants of Al Fadl remain until now in Jordan. Shammar is a clan from Tayy, but in later ages it became a gathering of Tayy clans with other mixtures that entered into it by alliance. Ibn Dakhil attributed Al Ali and Al Rashid to Al Fadl, and he has no support except that they replaced them in place and emirate. As for genealogy books, they indicated that they are from Madhhij. If it is true that Abda is from Shammar - as quoted from Ibn Qudamah - then there is no doubt that their leaders Al Daigham are from Janb from Madhhij, and they entered into Abda. Al Daigham until the end of the seventh Hijri century were still in the south in the land of Madhhij. It appears - seeking guidance from names - that Al Ali and Al Rashid are from the descendants of Shahwan bin Mansour bin Daigham bin Munif bin Jabir bin Ali, whom Ibn Rasul mentioned in his book \"Turfat Al-Ashab\". Perhaps between their nearest grandfather Arar bin Shahwan and Shahwan bin Mansour is a grandfather named Faris bin Ta'an, seeking guidance from a text about Al Faris as will be explained. I attributed them to Faris bin Ta'an because Al Khalil are the sons of Khalil bin Jasser bin Ali bin Atiyyah from Al Ja'far, and Al-Sharis mentioned that Al Faris and Al Khalil are one clan, and Ibn Faris Muhammad was alive in 1109 AH. Then he mentioned that Al Sadiq are from the descendants of Abdullah bin Muhammad bin Ali from Al Faris, so if Al Sadiq are cousins of Al Ali and they were from Al Faris bin Ta'an, then Al Ali are from the descendants of Faris. All of them are from Al Ja'far, and Ibn Bassam mentioned that Al Ja'far are from the Daighams. For all this, I preferred that Al Ali and Al Rashid have a grandfather named Faris Ibn Ta'an, either from the descendants of Arar bin Shahwan, or between Arar bin Shahwan and Shahwan bin Mansour bin Daigham. In any case, inserting Faris bin Ta'an into the lineage of Al Rashid is a deduction that remains a mere probability. In Ibn Rasul's text, Munif bin Daigham bin Munif bin Jabir had a son named Rashid and he had a grandson named Umair bin Ahmad bin Rashid. In the unknown author's book from which Sheikh Hamad Al-Jasser quoted the news of the black Shahwani horses in his manuscript on horses, Shahwan the father of Arar is the brother of Rashid the uncle of Umair. It is possible that Arar is a grandson of Munif bin Daigham. It is possible that he is from the descendants of Shahwan bin Mansour bin Daigham. In any case, the inheritance of the name Shahwan, Umair, and Rashid confirms that Arar bin Shahwan and Umair bin Rashid are from the descendants of Munif bin Daigham. Ibn Mughira said about Al Jarban and about the general lineage of Abda: And Al Saih is a clan from Shammar, and they are clans and thighs, among them Al Jarban the third clan from Shammar Abda: They are Banu Daigham Ibn Muawiyah bin Al-Harith bin Munabbih bin Yazid bin Harb bin Ulah Ibn Jald bin Madhhij brother of Tayy. Muawiyah bin Al-Harith was from Janb and the kingship was in the house of Janb, and he is the one whom Muhalhil the brother of Kulaib sought refuge with, and he married the daughter of Muhalhil named Ubaidah, and to her belong tribes from Janb, so she bore him the father of the tribe Daigham. From Banu Daigham are these Abda and they had the leadership over the tribes of Shammar from Tayy bin Ali \"?\". The leadership of Jabal Tayy was formerly for Jadilah a clan from Tayy then it became in Bani Nabhan then it became in Al Jarban. Then it became in Abda in Al Ja'far. Abu Abd al-Rahman said about Ibn Mughira's words: This is misspelling and confusion, and I will join to it a text by Ibn Rasul hoping it removes some of Ibn Mughira's ambiguity. Our Sheikh Hamad Al-Jasser said: It came in the book \"Turfat Al-Ashab fi Ma'rifat Al-Ansab\" by Sultan Umar bin Yusuf Ibn Rasul who died in the year 694: The lineage of Al Munif who are Al Daigham and Al Rashid is from Janb, and they are known as Al-Ma'dah. He is Munif bin Daigham bin Munif bin Jabir bin Ali bin Abd al-Rabb bin Rabi' bin Sulaiman bin Abd al-Rahman bin Ruh bin Mudrik bin Abd al-Hamid bin Mudrik. It is said: They are from Bakil, but they allied with Ans from Madhhij so they were named Janb. And it is said: They are from Nizar from Anz bin Wa'il bin Qasit Ibn Hanb bin Afsa bin Du'mi bin Jadilah bin Asad bin Rabi'ah Ibn Nizar bin Ma'ad bin Adnan. They entered into",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 14
  },
  {
    "serial_number": "6207477",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "The lineage of Janb, because their mother Ubaidah bint Muhalhil bin Rabi'ah Al-Taghlibi, from Taghlib bin Wa'il the brother of Anz bin Wa'il, was married by Ruh bin Mudrik after Muawiyah bin Amr Ibn Muawiyah bin Al-Harith Al-Janbi. Their brothers from their mother are Al Ayidh, Al Rashid, Banu Qais, Al Safar, Al Salt, and their companions, called Al-Abtun, from the children of this Muawiyah Al-Janbi so they were attributed to them. So Al Daigham bin Munif and his children are eight: Munif, Shukr, Isa, Ali, Mansour, Shaiban, Amir, and Harith. Abu Abd al-Rahman said: From Ibn Rasul's text and Ibn Mughira's text the following becomes clear: Janb, because their mother Ubaidah bint Muhalhil bin Rabi'ah Al-Taghlibi, from Taghlib bin Wa'il the brother of Anz bin Wa'il, was married by Ruh bin Mudrik after Muawiyah bin Amr Ibn Muawiyah bin Al-Harith Al-Janbi. Their brothers from their mother are Al Ayidh, Al Rashid, Banu Qais, Al Safar, Al Salt, and their companions, called Al-Abtun, from the children of this Muawiyah Al-Janbi so they were attributed to them. So Al Daigham bin Munif and his children are eight: Munif, Shukr, Isa, Ali, Mansour, Shaiban, Amir, and Harith. Abu Abd al-Rahman said: From Ibn Rasul's text and Ibn Mughira's text the following becomes clear: 1 - That Abda is not attributed to Shammar by returning to the grandfather Shammar, but they meet with Shammar in Udad bin Zaid, the father of Tayy from whose descendants are Banu Shammar, and Malik from whose descendants are Abda. There is a disagreement among genealogists whether \"Madhhij\" is a title for Malik bin Udad or is a name for the mother of Tayy and Malik. 2 - That the tribes of Abda are from the descendants of Daigham bin Muawiyah bin Al-Harith and Daigham's mother is Ubaidah bint Muhalhil. Except that Abu Hazm made Ubaidah's husband from the descendants of Muawiyah bin Al-Harith saying: And from Bani Yazid bin Harb bin Ulah Ibn Jald bin Malik \"Madhhij\": Muawiyah bin Amr bin Muawiyah bin Al-Harith bin Munabbih bin Yazid bin Harb bin Ali who married the daughter of Muhalhil bin Rabi'ah Al-Taghlibi in Najran and gave her leather as dowry, so her father said about that: Her loss of Al-Araqin married her off, in ... Janb and the gift was of leather. If he had come to propose to her at Abanain ... No nose of a suitor would have been stained with blood.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 15
  },
  {
    "serial_number": "6207478",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "3 - The reason for Abda entering into Janb is that they are from the descendants of Daigham bin Muawiyah bin Al-Harith and his grandfather Munabbih bin Yazid bin Harb is one of the brothers who were included in the name Janb. Ibn Hazm said: Yazid bin Harb bin Ulah bin Jald Ibn Malik \"Madhhij\" begot: Munabbih, Al-Harith, Al-Ghali, Sanhan, Haffan, and Shimran. These six allied against the son of their brother Suda Ibn Yazid, so they were named Janb, along with their cousins Banu Sa'd Al-Ashirah bin Malik bin Ulah bin Jald bin Malik, who is Madhhij. Al-Azzawi quoted from the book \"Majma' Al-Ansab\" that Abda is from Shammar. Abu Abd al-Rahman said: Ibn Mughira's text agrees with the text of Sultan Umar bin Yusuf bin Rasul. It came in this text that Al Daigham were until the end of the seventh century - which is the era of Ibn Rasul - still in the south in the land of Madhhij, and he attributed them to Janb, and mentioned another view in their attribution to Anz bin Wa'il from Nizar, and that they entered into Janb because their mother Ubaidah bint Muhalhil was married by Ruh bin Mudrik. There is no doubt that what is known now among Abda is their attribution to Daigham, and there are evidences for that from colloquial poetry. My Sheikh, the scholar of the Peninsula Hamad Al-Jasser - may Allah preserve him - informed me that Charles Huber quoted from Ubaid bin Ali bin Rashid the news of his ancestors moving from the south to the two mountains in a way resembling the story of Tayy's move from Wadi Tarib in the south to the two mountains. This means Al Rashid's acknowledgment that they are Al Daigham. Lady Anne Blunt quoted from Muhammad bin Rashid that the Shammar who are in the Peninsula and the Shammar his followers consider themselves relatives of womb kinship and said: The blood of our horses is one. Abu Abd al-Rahman said: There is a curious opinion attributing Al Jarba to Al Fadl which is what came in the book \"Kanz Al-Ansab\" quoting from the magazine \"Lughat Al-Arab\" of Baghdad titled Banu Taghlib Al-Adnaniyyah. Then I asked after that one of the great Sheikhs, Sheikh Mijwel Al Jarba, head of the Shammar tribes, about Taghlib and whether they have a remnant existing in the northern lands, but he did not mention anything of that to me, rather he excused himself from identifying the clan apologizing for that by the change of names on him, and he did not deny completely the existence of a remnant of them. When I mentioned Al Fudul to him, he was pleased, and relieved by this name very much, as if he was asleep and woke up, then said: It is close to the truth, then thought for a moment and said: Rather it is the truth itself, and counted for me from them Mutlaq and Bunayyah Al Jarba, heads of Shammar i.e. the first grandfather founder of the emirate of Shammar in Jabal Tayy, and that was when its first famous men appeared with this name. He mentioned after that things indicating the truth of his saying, then said: Al Fudul merged into the tribes, and scattered in the lands, and cited numerous proofs to support this statement of his. Abu Abd al-Rahman said: This is a statement I copied from the papers of my Sheikh Hamad Al-Jasser then I reviewed the magazine \"Lughat Al-Arab\" and found the writer of this research Professor Sulaiman Al-Dakhil, may Allah have mercy on him. He mentions that Salem Al Jarba is the grandfather of Mutlaq and Bunayyah Al Jarba. Abu Abd al-Rahman said: I wish Al-Dakhil had cited these numerous proofs?! In any case, this Al-Asi, one of the Sheikhs of Al Jarba, hints at the origin of their journey with this verse from one of his war songs on horses: See your group are the youth of Yemen ... They are not a gathering from a country. The Journey of Al Daigham from the South to the North. For the journey of Al Daigham from the South to the two mountains, there are evidences from the public heritage, and from the texts of historians like the text of Ibn Rasul. About this stage, Dr. Al-Uthaymin said in summary: The Abda clan used to inhabit one of the regions of the south of the Peninsula, then migrated until it settled in Jabal Shammar, and this migration was more than four centuries ago. The princes of the Mountain before Abda's migration were from the Zubaid tribe, so Abda overcame them until they expelled them, and their last leader was Bahij. About that, one of the poets of Shammar said later: Before you, Bahij was driven down by the Sana'is ... From Aqdah which its canal cannot be driven down.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 16
  },
  {
    "serial_number": "6207479",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Abu Abd al-Rahman said: It is understood from this text that the departure of Abda from the south to Jabal Tayy in the north was around the tenth century, and this is also understood from a text by Sheikh Al-Aboudi that will come. It is understood from a text by Ibn Hatim - will come - that their departure was in the middle of the ninth century. If we could connect the lineage of Arar bin Shahwan bin Daigham to Daigham bin Munif whom Ibn Rasul mentioned, we would be able to determine the date of their departure more accurately. If we assume that Arar is Arar bin Shahwan bin Mansour bin Daigham bin Munif, their departure would be in the early eighth Hijri century approximately, because Ibn Rasul who died in the year 694 mentioned that the offspring of Munif Ibn Daigham were still in the south. In light of that, we make the era of each individual of the lineage chain from Arar to Munif thirty years and add the result to seven centuries at the end of which Ibn Rasul died. Regarding their departure, Sheikh Saad bin Junaidil mentioned a poem by Faris Ibn Shahwan Al Daighami, mentioning that he sketched the path of his tribe's migration from their country to Najd, and arranged the stations of their path accurately. He said in it mentioning Al-Quway': And a night in Al-Sirdah, may rain not water it ... Its dry wood stands and its sour plants perished. And I treaded Wadi Al-Quway' intentionally ... I wished it were not for the thirst a land. And a night in Al-Hadba, may its side not flourish ... They packed and left in the resting place blackness. He said in another place: And a poet from Al Daigham said sketching the path of their migration: A night in Al-Qimra and a night in Al-Raka ... And a night in Hazm Al-Hasah distress. And a night we arrived at Masal and Muwaisil ... The faces of the scoops as if they were new. Then he mentioned after these two verses the three verses mentioned above and mentioned in another place that they are by Faris bin Shahwan Al Daighami and his people passed by him on their way of migration to north Najd. My Sheikh Hamad Al-Jasser mentioned a modern book - and did not mention its name nor its author's name - that talked about noble horses called Al-Duhm Al-Shahwaniyat. Sheikh Hamad said: It came in this book: Shahwan is Ubaidah i.e. from Qahtan and it was named after its shepherd Shahwan Abu Arar brother of Rashid uncle of Umair. Then he said: And he cited news about these horses and poetry by Shahwan Abu Arar in which came: We have a dwelling between Al-Aflaj and Al-Hasa ... And between Sanaa and Al-Sulayl borders. When they descended seeking prices in the villages ... We descended on like the black clouds. The large Shuwadi supplied us from its crops ... Sacks without firewood or fuel. If the beast of the wild hovered around it, it spent the night hungry ... Inside it like eagles crouching. I wish from the crushing nights perhaps we ... Catch up with some O Abu Rabi' Hamoud. If you don't have armor Najd ... Then drinking with the arms of men is hard. Sheikh Hamad said: He cited months for Arar bin Shahwan and news related to his horses. Sheikh Muhammad Al-Aboudi mentioned a battle between Al Daigham and Sultan Marid, in which Humaidan bin Rashid bin Daigham, cousin of Arar Ibn Shahwan, and Sultan Marid were killed together. Umair bin Rashid said a poem about that starting with: A battle was prepared for us at Abraq Al-Saih ... The absent men wished for it. He determined the era of this poetry to be after the era of the poet Jarir by about nine centuries. Professor Abdullah bin Khalid Al-Hatim mentions that Arar bin Shahwan Al Daigham, grandfather of Al Rashid, princes of Jabal Hail, lived in the year 850 AH. He mentioned a poem for him longing for Najd, from which it is understood that his cousin Umair bin Rashid is present in Najd. From what came in this poem is his saying: Arar says the saying of one who remained standing ... On the house mourning with shedding tears. Little benefit from a ruin whose trace was destroyed ... By the blowing winds the violent storms. But I did not see in it shading tents ... The vicissitudes of the calamities erased them obliterated. Until he said: So no and upon no were it not for wishing is foolishness ... I would stand in Najd safe not afraid.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 17
  },
  {
    "serial_number": "6207480",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "And I find Umair in Al-Udhaibah standing ... On Shalshal the white noble camels. Among the news circulated by night-talkers is what Sheikh Ibrahim Ibn Uthman told me that Faris bin Shahwan lived with his father in Wadi Al-Dawasir, so he used to give his neighbor [female] from his hunting and spoils. This developed until she showed him affection, but he did not respond to that, honoring his neighbor. When she saw his turning away from her, she showed his father that he was mistreating her. When he saw the affect on his father's face, he left with those who were light with him from his people and slaves. So Shahwan Abda sent Ammar to accompany Faris, and know his direction. When Faris sensed Ammar's accompaniment, he began taking ostrich eggs, so whenever he stopped at a place he showed an egg and filled it with water, and placed dates beside it and buried it under the kneeling place of his she-camel until he stopped at a place near Zafar which Faris named after himself. After that he ordered Ammar to return to his father, and described to him the burial places of the ostrich eggs, to be provision and landmarks for his way, and said on this occasion a poem starting with: Ammar perhaps you will turn back from this ... From the direction of Shahwan dear neighbor. Abdul Jabbar Al-Rawi adds detail mentioning that Shammar killed Bahij the Sheikh of Al-Ubaid so Al-Ubaid migrated to the island of Iraq. Shammar had advised Bahij to enter upon the Sheikhs of Shammar, and reconcile with them but he refused that and said: Bahij bin Dhubyan says proverbs ... And his tear is on the properties without waterfalls. Shammar the sweet ones drove us from our homes ... Clear water and cold water, heals the thirst. And we turned the necks of the camels away from them and went west ... And the eye of Al-Zubaidiyat towards Najd is inclined. If there is no equal to equal an equal ... One cannot sit in the house while the load is tilting. And if the young man's right is not by his arm ... Damn the rule that comes by intercessions. Patient on asceticism despite the badness of their deed ... In lineage there is none like them among tribes. Mean ones if you made them perform Hajj to the Kaaba of satisfaction ... They reward you for it with barren offshoots. Departure of Al Jarba to Iraq",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 18
  },
  {
    "serial_number": "6207481",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Al Jarba are the leaders of Shammar and the heads of the Mountain, and the furthest mention I found of them is about the death of two of them in the year 1100 AH and the year 1103 AH. They left Najd in the year 1205 AH after their defeat before Ibn Saud, so they built their leadership in Iraq and Syria. Hussein Khaz'al said: The general leadership of Shammar was in the Al Jarba family from the Sinjara clan, and Prince Saud Ibn Abdul Aziz evicted them from their homes in the year 1205 AH after he fought them near the city of Hail and Muslat bin Mutlaq was killed. Mutlaq marched from Jabal Shammar to Iraq and the land of Sham, and accompanied Ahmad Pasha Al-Jazzar to Hajj, then settled in the desert of Samawa in Iraq. As for the departure of Al Jarba, Abbas Al-Azzawi mentions that Al Muhammad Al Jarba, princes of Shammar under the leadership of Faris Al Jarba, leaned towards Iraq in the early thirteenth Hijri century. Yusuf Al-Bassam adds detail saying: The former heads of Shammar are known as Al Muhammad and the last of them is Faris Al Jarba. He was nicknamed Al Jarba relative to his mother who was afflicted with smallpox, and became scabby (jarba) as a result of this disease. In the era of Prince Muhammad bin Saud, founder of the first Saudi state, and his son Imam Abdul Aziz, Faris Al Jarba migrated from Jabal Shammar and settled in the desert of Jazira in Iraq between the Tigris and Euphrates, after the rains stopped for a long time and the land became barren. Following the migration of Faris Al Jarba, many of Shammar followed him and settled in Iraq and remain until now, and Al Ali took over the command of Jabal Shammar. Abdul Jabbar Al-Rawi mentioned that Najd was hit by drought, so the Sheikh of the Shammar tribe, Faris, was forced to migrate with forty families of his people, seeking pasture, until he reached the island of Iraq, and settled as a neighbor to the Ubaid tribes, then he mentioned a semi-mythical story, especially regarding the shabbiness of Shammar while it is known among the people of Najd the fame of the northern tribes - especially the Shamamrah - for elegant dress and lavish appearance. He mentioned in another place that the first to migrate from Najd to the Jazira in Iraq was Faris Al Jarba, and that he is the first president of Al Muhammad, then he mentioned his sons and grandsons. He mentioned that Faris was nicknamed Al Jarba relative to his mother, who was afflicted with smallpox, so she was named by it even if she had recovered from this disease. Abu Abd al-Rahman said: There is no harm in citing this story mentioned by Al-Rawi. He said: Najd was hit by drought, forcing the Sheikh of the Shammar tribe at that time, Faris, to migrate with forty tents, seeking pasture, and he went on until he reached the Jazira, and settled as a Qasir \"i.e. neighbor\" to the Ubaid tribes, who hosted him, and made him a large banquet to which they invited the head of the Tayy and Jubur tribes. The immigrants from Shammar were in shabby clothes, covered in dirt, so the guests were disgusted by them and ate the food reluctantly, and they imagined that these immigrants were from the Suluba or Hutaym tribes, which the Bedouins consider despicable tribes. When Faris, Sheikh of Shammar, felt the disgust that appeared on the faces of the heads of Ubaid, Tayy, and Jubur, he wanted to prove to his hosts that he and his tribe were of such nobility and generosity that they are proverbial, so he decided to reciprocate the banquet with a similar one, and invited the heads of Ubaid, Tayy, and Jubur to eat at his place. However, they hesitated to accept the invitation, believing that these people were not worthy of answering their invitation and attending their banquet. But after hesitation, they answered the invitation reluctantly, and saw the Mansafs - plural of Mansaf which is what food is placed in - filled with food and meat, as he slaughtered camels for them. The Mansafs were of such hugeness that knives were hung on them to help the elderly cut the meat. The hugeness of Mansafs indicates to the Bedouins conclusively the greatness of its owner, therefore they calculated a thousand calculations for these settlers, fearing for themselves, believing that behind these Mansafs were tribes large in number, so they decided to assassinate Faris and his group before his tribes reached him. The banquet of Sheikh Faris was the motive for the three Sheikhs to conspire to kill Faris and his group, as we mentioned previously. However, Faris sensed the conspiracy, so he asked his women to take off their jewelry, and present it to the wives of the three heads as a gift, on condition that they intercede with their husbands to prevent killing him and his aides. They answered the request, and promised them good. When night came, the wives of the leaders of Ubaid, Tayy, and Jubur did not spread the bedding - which among Arabs is a sign from which men infer the occurrence of dangerous matters -, so they were asked about the reason, and they asked for safety for the immigrants",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 19
  },
  {
    "serial_number": "6207482",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Settlers",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 20
  },
  {
    "serial_number": "6207483",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "So they were given safety, and granted what they wanted, so the bedding was spread. Thus Faris's group was able to settle in the Jazira, and stabilize there. Then Faris cut samples of all the herbs and grasses that grow in the Jazira, and filled a sack with them and sent it with his aides to his tribe in Najd, intending thereby to inform them of the excellent types of grasses for grazing, in the land to which he migrated, urging them to join him. It was not long before the Shammar tribes answered his request, and migrated to him in groups, each group not less than fifty tents, so Shammar multiplied, and what the heads of Ubaid, Tayy, and Jubur feared happened. This matter caused a conflict between them in agreement with Al-Sayih on one side and Shammar on the other, over the land of the Jazira which they settled. A fight broke out lasting ninety days, in which Shammar won, and forced the tribes of Al-Sayih, Al-Ubaid, and Tayy to evacuate their places in the Jazira. Al-Sayih crossed the Tigris, heading towards Hawija, and took it as homes for them. Tayy moved from its place, and made its dwellings west of Sinjar. As for Al-Jubur, they inhabited the Khabur region. Thus the atmosphere cleared for Shammar in the Jazira, and their control over its outskirts and regions was complete, until it came to imposing a type of tax called \"Al-Khuwwah\" (brotherhood tax) which they took from every tribe settling in their area, and everyone crossing the Jazira was forced to pay it submissively. This \"Khuwwah\" remained effective, and included all villages neighboring the desert. When the Iraqi government was formed, its regular forces began to combat this \"Khuwwah\" with all the strength they had, but they could not eradicate it and cut its root completely. Many efforts were made to establish a government center in the Jazira until that was accomplished in the first year of my assuming the reins of the General Police Directorate, as I had previously formed similar in the Shamiya desert before that, and managed to prevent the Khuwwah there. As for \"Al-Khuwwah\" itself, it is a tax paid by tribes entering the Jazira voluntarily or forcibly, and it is a specific amount of fat and sheep, paid to a specific Sheikh from Shammar every year. \"Al-Khuwwah\" is also taken from travelers, where they must pay an amount of money for every camel passing through the Jazira, as well as in the villages which pay what grains they owe every season. \"Al-Khuwwah\" is divided among the Sheikhs of Shammar who each know their share of it. So Sheikh So-and-so takes \"Al-Khuwwah\" from Al-Hadidin, and the other from Al-Jubur or travelers or from the villages of Mosul or from the merchants' sheep sent to Syria. Thus no one escapes the hands of the collectors of this tax. The Shammar tribes continue to multiply and increase, since the Saudis took over Hail, the capital of Ibn Al-Rashid, where a large number of the Abda clan migrated from Najd to the Jazira in Iraq, and these now form the largest section of Shammar Abda. Among the most famous leaders of Abda migrating to Iraq is Sheikh Iqab Al-Ajl, head of the Al-Ahya division of Abda, and the reason for his migration is Shammar's refusal to recognize a Sheikh or leader in Hail unless he was from Al-Rashid. This, and most tribes of the Hail region, the ancient capital of Ibn Al-Rashid, are from Shammar, at the present time. Abu Abd al-Rahman said: I have completions and rectifications on these texts as follows: Were given safety, and granted what they wanted, so the bedding was spread. Thus Faris's group was able to settle in the Jazira, and stabilize there. Then Faris cut samples of all the herbs and grasses that grow in the Jazira, and filled a sack with them and sent it with his aides to his tribe in Najd, intending thereby to inform them of the excellent types of grasses for grazing, in the land to which he migrated, urging them to join him. It was not long before the Shammar tribes answered his request, and migrated to him in groups, each group not less than fifty tents, so Shammar multiplied, and what the heads of Ubaid, Tayy, and Jubur feared happened. This matter caused a conflict between them in agreement with Al-Sayih on one side and Shammar on the other, over the land of the Jazira which they settled. A fight broke out lasting ninety days, in which Shammar won, and forced the tribes of Al-Sayih, Al-Ubaid, and Tayy to evacuate their places in the Jazira. Al-Sayih crossed the Tigris, heading towards Hawija, and took it as homes for them. Tayy moved from its place, and made its dwellings west of Sinjar. As for Al-Jubur, they inhabited the Khabur region. Thus the atmosphere cleared for Shammar in the Jazira, and their control over its outskirts was complete.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 21
  },
  {
    "serial_number": "6207484",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "And its regions, until it came to imposing a type of tax called \"Al-Khuwwah\" taking it from every tribe settling in their area, and everyone crossing the Jazira was forced to pay it submissively. This \"Khuwwah\" remained effective, and included all villages neighboring the desert. When the Iraqi government was formed, its regular forces began to combat this \"Khuwwah\" with all the strength they had, but they could not eradicate it and cut its root completely. Many efforts were made to establish a government center in the Jazira until that was accomplished in the first year of my assuming the reins of the General Police Directorate, as I had previously formed similar in the Shamiya desert before that, and managed to prevent the Khuwwah there. As for \"Al-Khuwwah\" itself, it is a tax paid by tribes entering the Jazira voluntarily or forcibly, and it is a specific amount of fat and sheep, paid to a specific Sheikh from Shammar every year. \"Al-Khuwwah\" is also taken from travelers, where they must pay an amount of money for every camel passing through the Jazira, as well as in the villages which pay what grains they owe every season. \"Al-Khuwwah\" is divided among the Sheikhs of Shammar who each know their share of it. So Sheikh So-and-so takes \"Al-Khuwwah\" from Al-Hadidin, and the other from Al-Jubur or travelers or from the villages of Mosul or from the merchants' sheep sent to Syria. Thus no one escapes the hands of the collectors of this tax. The Shammar tribes continue to multiply and increase, since the Saudis took over Hail, the capital of Ibn Al-Rashid, where a large number of the Abda clan migrated from Najd to the Jazira in Iraq, and these now form the largest section of Shammar Abda. Among the most famous leaders of Abda migrating to Iraq is Sheikh Iqab Al-Ajl, head of the Al-Ahya division of Abda, and the reason for his migration is Shammar's refusal to recognize a Sheikh or leader in Hail unless he was from Al-Rashid. This, and most tribes of the Hail region, the ancient capital of Ibn Al-Rashid, are from Shammar, at the present time. Abu Abd al-Rahman said: I have completions and rectifications on these texts as follows: And its regions, until it came to imposing a type of tax called \"Al-Khuwwah\" taking it from every tribe settling in their area, and everyone crossing the Jazira was forced to pay it submissively. This \"Khuwwah\" remained effective, and included all villages neighboring the desert. When the Iraqi government was formed, its regular forces began to combat this \"Khuwwah\" with all the strength they had, but they could not eradicate it and cut its root completely. Many efforts were made to establish a government center in the Jazira until that was accomplished in the first year of my assuming the reins of the General Police Directorate, as I had previously formed similar in the Shamiya desert before that, and managed to prevent the Khuwwah there. As for \"Al-Khuwwah\" itself, it is a tax paid by tribes entering the Jazira voluntarily or forcibly, and it is a specific amount of fat and sheep, paid to a specific Sheikh from Shammar every year. \"Al-Khuwwah\" is also taken from travelers, where they must pay an amount of money for every camel passing through the Jazira, as well as in the villages which pay what grains they owe every season. \"Al-Khuwwah\" is divided among the Sheikhs of Shammar who each know their share of it. So Sheikh So-and-so takes \"Al-Khuwwah\" from Al-Hadidin, and the other from Al-Jubur or travelers or from the villages of Mosul or from the merchants' sheep sent to Syria. Thus no one escapes the hands of the collectors of this tax. The Shammar tribes continue to multiply and increase, since the Saudis took over Hail, the capital of Ibn Al-Rashid, where a large number of the Abda clan migrated from Najd to the Jazira in Iraq, and these now form the largest section of Shammar Abda. Among the most famous leaders of Abda migrating to Iraq is Sheikh Iqab Al-Ajl, head of the Al-Ahya division of Abda, and the reason for his migration is Shammar's refusal to recognize a Sheikh or leader in Hail unless he was from Al-Rashid. This, and most tribes of the Hail region, the ancient capital of Ibn Al-Rashid, are from Shammar, at the present time. Abu Abd al-Rahman said: I have completions and rectifications on these texts as follows:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 22
  },
  {
    "serial_number": "6207485",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "A - It is not unlikely that Al Muhammad were nicknamed Al Jarba because their mother was afflicted with smallpox, but Faris was not the first to be nicknamed so as Yusuf Al-Bassam and Al-Rawi claimed, because I found this nickname used tens of years before the birth of Faris bin Muhammad Al Jarba. The historians of Najd mentioned in the events of the year 1100 AH the killing of Ammar Al Jarba. And they mentioned in the events of the year 1103 AH or 1104 the killing of Muslat Al Jarba. B - Al Jarba did not migrate because of drought, but they migrated because of their defeat before Al Saud as will be explained in the historical events. They did not migrate under the leadership of Faris but migrated under the leadership of his brother Mutlaq, accompanied by his brother Faris and Qurainis. But the Iraqi historians, when they saw that the emirate was in the descendants of Faris, thought that Shammar migrated under his leadership. Faris was a leader before his son Safouk, and perhaps Faris mentioned in the era of Muhammad bin Abdullah bin Rashid is one of his grandsons. C - They lived in the island of Iraq (Al-Jazira) between three rivers: the Tigris from the north and east, the Euphrates from the south, and the Khabur from the west. Another section migrated to the Syrian Jazira south of the Euphrates west of the Khabur. The sheikhs of the Sinjara clans in Syria are cousins of Al Muhammad and their count is in Abda according to the correct famous opinion. D - Since Al Muhammad migrated, they remained there a settled stay. As for their clans, they are still nomadic between Iraq and Najd, except that their close relatives remained there, just as the majority of Abda remained there also, except for those who did not prefer returning to the island of Iraq after their return to Najd. Regarding the story of their return to Najd after their departure to the Jazira, we find two indications: The first: In the year 1224 AH after Shammar's defeat before Al-Zafir in the island of Iraq, they wrote to Imam Saud, so he permitted them and they appeared to Najd. The second: In the year 1231 AH after the killing of their leader Bunayyah bin Qurainis, they evacuated the Jazira and settled with their people in the Mountain. E - Yusuf Al-Bassam mentioned in the text mentioned above that Faris Al Jarba migrated from Jabal Shammar, and settled in the desert of Jazira in Iraq, after the rains stopped for a long time. Following Faris's migration, many of Shammar followed him and settled in Iraq during the era of Imam Muhammad bin Saud and his son Abdul Aziz. He described Faris as the last of Al Muhammad to have leadership in Najd. Abu Abd al-Rahman said: Their journey was only at the end of the era of Imam Abdul Aziz as his son Saud expelled them, and were it not for him saying \"and settled\", I would have said: It is possible that Shammar migrated with Faris due to drought in the era of Muhammad bin Saud then migrated as evacuees in the era of Saud.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 23
  },
  {
    "serial_number": "6207486",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "F - It is known and famous among historians that the leadership of the Mountain belonged to Al Jarba, Bedouin and settled, then to Al Ali, then to Al Rashid, but Dr. Al-Uthaymin refuses that. He said commenting on Al-Rihani: Perhaps it is more accurate if it was said: That Al Jarba was the leader of the Bedouin of Jabal Shammar, because the emirate of the settled people of the Mountain \"Hail\" belonged to Al Ali before the region joined Al Saud. The Doctor did not approve of \"Hogarth's\" opinion in saying that Abdullah Ibn Rashid was a leader of the Shammar tribes. And he did not approve of Al-Fakhiri's saying about Abdullah bin Rashid \"Head of the Shammar Bedouin\". Abu Abd al-Rahman said: Wherever the Mountain is mentioned absolutely, it refers to its inhabitants from Bedouin and settled. The leadership of Al Jarba for the Mountain is a leadership of all Shammar tribes, like the leadership of Ibn Rabi'an for example for all Otaiba tribes and like the leadership of Ibn Hadi for all Qahtan tribes. This does not prevent the existence of an emirate for the specific settled people, and that Al Jarba do not care about the specific settled people, except that the bond between the settled and the Bedouin is raids, campaigns, and kinship in terms of lineage \"or loyalty in most cases\". Therefore, the settled people follow the banner of Al Jarba. Then the leadership of the Mountain, Bedouin and settled, shifted from the traditional Sheikh of all Bedouin, who is Al Jarba, to the Emir of the specific settled people, who is Ibn Ali. It is not a condition for this shift to be recognized in the custom of Bedouin sheikhdom or for the Shammar tribes to be submissive to this shift. Rather, this shift was done by the ruler from Al Saud, for he is the one who chose that the leadership of the Mountain, Bedouin and settled, belong to Ibn Ali, then to Ibn Rashid, such that whoever deviated from this obedience from the Shammar tribes is considered a rebel. There are evidences for this: Among them is that the emirate of Al Ali did not precede the era of Al Saud as Dr. Al-Uthaymin said, for I clarified in my talk about Al Ali that the Shammar tribe submitted to the Call before the year 1178 AH based on a text from \"Lam' Al-Shihab\". And among them is that Sheikh Iqab bin Ajl migrated from Hail because Shammar refused to recognize a Sheikh or leader in Hail unless he was from Al Rashid, so this is proof that Ibn Rashid is the leader of all his Bedouin. And among them is that the settled people of Hail fought Mutlaq Al Jarba and his Bedouin and wrote to Imam Abdul Aziz informing him that Mutlaq broke the pledge, so these events indicate that the Emir of the settled people has an official leadership over the Bedouin which is demanded and fought for. And among them is that the Shammar tribes present in Najd participated in the raids of Al Saud, and we did not see the banner tied to any of the Shammar Sheikhs, but the leadership was for Ibn Ali or Ibn Rashid. Dr. Shafiq Al-Kamali said commenting on a text of \"The Encyclopedia of Islam\" in the article Bilad al-Arab regarding Tayy and Zubaid paying \"Al-Khuwwah\" to Shammar: As for not paying \"Al-Khuwwah\", it is correct, and \"Al-Khuwwah\" was replaced when Faris Al Jarba entered the Jazira by marriage alliance, as he married his son Safouk to Amsha, the daughter of the Sheikh of Tayy, and that was around the year 1225 AH. Abu Abd al-Rahman said: Perhaps the histories of Hijaz reveal to us the history of Al Daigham, for I saw Arar mentioning the Sharifs in his poetry, just as I saw Al-Isami mentioning a battle between the Sharifs and Shammar and also mentioning that Sharif Idris, who was rivaled by his cousin Muhsin, died in Jabal Shammar and was buried in Yatib in the year 1033. Mustafa Murad Al-Dabbagh mentions that it is possible that the village of Jarba in the district of Jenin in Palestine and Jarba in eastern Jordan are attributed to the Jarba tribes of Iraqi Shammar that settled there and imprinted their name on them. Abu Abd al-Rahman said: Note that Al Muhammad are from Al Jarba and not the reverse, and that Al Muhammad does not include Al Jarba but is limited to the descendants of Muhammad bin Salim Al Jarba. Due to the sovereignty of Al Jarba, the Bedouin of Shammar in Iraq became called Shammar Al Jarba. Al Jarba remained remembered by the people of Najd, poets headed towards them and received their grants, and their cousins in northern Najd sought their help. Conversely, there were found in Shammar of the Jazira those who longed for Najd. Here is a poet from Shammar, complaining about the Shia of Iraq and longing for Hail, saying: O help of the one who saw you, O Barzan ... And slept in your embrace happy. O help of the one who left you, O Barghouth ... And the separation of Abadah is upon me. From the Historical Events of Al Jarba",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 24
  },
  {
    "serial_number": "6207487",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "A - In the year 1205 AH, Sharif Ghalib bin Musa'id of Mecca equipped his brother Abdul Aziz with an army in which some Bedouins participated, to attack Diriyah, then Ghalib went out with a great army to reinforce his brother. Then when they were defeated after besieging the town of Al-Sha'ra, Saud bin Abdul Aziz began raiding the tribes that rebelled and joined the Sharif. Among these were Mutayr and Shammar, they were at the water known as Al-Udwa belonging to Shammar, near Hail, and their leader was Hisan Iblis. Imam Saud headed to them in this place, defeated them, and their leader Masoud \"Hisan Iblis\" and Samrah \"?\" the famous leader of Al-Abiyat from Mutayr, and Abu Hulaiba from Mutayr were killed. This battle was at the end of Dhu al-Hijjah of this year. However, these people after their defeat mobilized the rest of their tribes, and sent to Saud inviting him to battle, and warning him of their march towards him. He was in his place at Al-Udwa, dividing the spoils. So he stood firm for them after they reached him under the leadership of Muslat bin Mutlaq Al Jarba, who vowed to penetrate Saud's \"marquee\" with his horse. Muslat loosened the rein of his horse to fulfill his vow, but Saud's people snatched him after a man hit him with a stick used to roast disk bread, knocking him off his steed, and then he was killed and his followers were defeated. When they came to him, they approached with their camels tied together, so Saud and his army stood firm for them, and fired upon them and their camels with bullets. When they were defeated, they left their camels tied with ropes, so Saud captured eleven thousand camels from them, and more than a thousand sheep, and followed their tracks for two days taking money and killing men. Mutlaq Al Jarba, father of Muslat, was of the opinion to wait before attacking Al Saud, after their first defeat at Al-Udwa. It is said: This poem by Muslat Al Jarba was said on this occasion: I climbed the heads of the lofty watchtowers ... A tall high cairn standing upright. I dragged a voice like the wolf dragged ... I feel my conscience jumping from my ribs. My fear is of those whose heads are like quivers ... And a sword cuts on other than the joints. When my wishes became like slaves ... With booties in our right hands we prick him. It is better to be patient and make patience beautiful with goodness ... This life, all of its father is squeezing. And the free one, when the claws close on him ... Is bound to jump from the house of humiliation. Abu Abd al-Rahman said: The last verse is an announcement of evacuation from Jabal Shammar, and evacuation was not in Muslat's intention. It is more likely that this poetry is by Mutlaq Al Jarba, father of Muslat, and this is what actually happened. After Shammar's defeat, and the killing of Muslat, Shammar migrated under the leadership of Mutlaq Al Jarba to Iraq, settled in the Jazira region, and gained strong influence there. Ibn Sanad said in his emotional literary style: He has days, among them Al-Udwa for Saud bin Abdul Aziz against him, and on that day his son Muslat was killed, and he was a brave lion who fought that day until he stopped every patrol, and entertained every spear and sword, how not when Mutlaq his father is that brave, and Muhammad his grandfather whom bombs avoided. As for Mutlaq, on that day he defeated the battalions, and quenched every spear and cutting sword with the blood of the knights: A people if they fought are lions of the thicket ... And if they gave are seas of generosity. O eye, if they die, then generosity has died ... So be generous with your tears for them in sadness. They waded into the war with sharp swords and strong horses ... Lean-bellied, heading for the army of \"Su'ud\". So the brave ones dispersed from him as if they were ... Ostriches fleeing from the roar of lions. The lion Mutlaq met them ... So they hung onto the tail of every young camel. When the lowlands and highlands narrowed on Saud, Ibn Hadhdhal betrayed, so Mutlaq had no room, so he retreated on his heels while fighting that clamorous army. Whenever he attacked his knights ... They fled from him like a sheep from a lion. They did not see a calamity but saw ... Fleeing from it, even if it was a lion.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 25
  },
  {
    "serial_number": "6207488",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "So they remained with him in attack and retreat, and striking with every sharp male sword, until they tired of striking, so they returned with a losing deal, and he and his cousins survived, and the traitor returned with his disgrace and sin, so he settled his men in the desert of Iraq, until his life became green and pure. I found in the notebooks of Sheikh Mandil these verses by Mutlaq's wife mourning Muslat and his father: I groaned a groan of one whose tooth the pliers pulled ... Who endured the pulling attracting from where. Upon you, O protector of the camels, Tahmaz ... The groups of Arabs clamored missing him. Eqab came to us and separated the free and the hawk ... And became with the hunter of bustards his mound. The tear from my eye comes single and in pairs ... And greyness appeared in my forelock before its time. The author of \"Lam' Shihab\" said: Then the Arabs of the Sharif who were taking refuge with him from the Bedouins of Najd dispersed from him returning to the outskirts of Najd. Qahtan turned to Tathlith, Otaiba to the wilderness of Mecca like Rukbah and what follows it. As for Mutayr, they turned to the land of Shammar, and agreed with Mutlaq Al Jarba, and all the Bedouins of Shammar who are in the Mountain, and a war occurred between them and the people of the villages in the Mountain. So the people of the Mountain sent to Abdul Aziz bin Saud that this Mutlaq Al Jarba broke the pledge, and Mutayr took refuge with him, so today we fight him. At that time the Sheikh of Mutayr was Husain bin Watban, a brave man. When Abdul Aziz heard this news, he sent his son Saud with an army to them, with him some of Anazah, who were opponents to Mutayr, and with him also the Bedouins of Al-Arid: Subai' and Al-Ajman. This march was his first support to Al Saud, and the fame of his affair in the Arabian Peninsula, then he gained great reputation. This army reached five thousand \"infantry\" men and eight hundred horsemen. He attacked Arabs called Al-Bara'isa from Mutayr in the morning, and their leader was named Saud? nicknamed Hisan Al-Shaytan, or Hisan Iblis, and he is the one who nicknamed himself with this nickname, and he is a counted brave man, and with him two hundred horsemen of his company. They fought Saud and a number of his horsemen were killed and Hisan Iblis and his children and his brother's children were killed, and his houses and sheep were taken, and their camels were absent in the desert. After this, the matter intensified on Mutlaq Al Jarba, and Husain Al-Dawish, and the world narrowed on them and they were at a water called \"Yatib\" eight hours from Hail. So they came attacking Saud, and camped wanting to engage in war with him. Wars occurred between them and Saud, so he drove first in their faces until he pushed their gatherings with it, then followed them with horses and men. A son of Mutlaq Al Jarba named Sultan was killed, and those Bedouins were defeated, and their number was many. He took their wealth and killed who he killed and captured who he captured, and the total of their wealth is countless. So Mutlaq Al Jarba evacuated to Iraq from that day. B - In Ramadan of the year 1212 AH, Imam Saud bin Abdul Aziz fought many Arabs from several tribes under the leadership of Mutlaq bin Muhammad Al Jarba in Wadi Al-Ubayyid near Samawa in Iraq. No one could stand before Mutlaq's attacks. Ibn Bishr and Ibn Sanad mentioned that, and Qurainis, Mutlaq's brother, was killed. Ibn Sanad said - as I copied from the papers of Sheikh Hamad Al-Jasser: Saud bin Abdul Aziz bin Muhammad Saud raided in the year 1212 the outskirts of Bani Al-Munfaq, so he attacked the village known as Umm Al-Abbas in the morning, killed many of its people and those around it, looted and burned, then returned. Hamoud was in the desert, when the news reached him he strove in marching to catch him, as he caught him. After Saud returned and reached the outskirts of Najd, he turned and raided in that year of his the desert of Iraq. Mutlaq bin Muhammad Al Jarba was camping in the desert of Iraq. When Saud attacked them in the morning, whoever fled fled and whoever stood stood. Mutlaq Al Jarba fought Saud's army, so the horsemen attacked time after time, whenever he attacked a battalion he defeated it, so the brave ones deviated from fighting him. It was from Allah Almighty which cannot be repelled that he attacked them in one of his attacks and his horse stumbled on a sheep, so he fell from his horse's back and was killed, may Allah Almighty have mercy on him - and his killing was considered by Saud one of the greatest victories except that he wished to capture him instead of killing him.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 26
  },
  {
    "serial_number": "6207489",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "C - In the year 1231 AH, the battle took place between the Pasha of Iraq and several tribes under the leadership of Bunayyah bin Qurainis bin Muhammad Al Jarba, and with him Faris bin Muhammad, and the Pasha had expelled them from Iraq. So these tribes were defeated after the killing of their leader Bunayyah in an incident similar to the killing of his uncle Mutlaq bin Muhammad, that is, two horsemen caught up with him, so he sensed them or they called him to duel, so he pulled the rein of his steed a terrible pull to turn it towards them, so the mare fell on her head and hands, and fell on her back, so he became under the saddle and the mare over him, so he was caught and killed. Perhaps the reason for this is what happened in the year 1228 AH, which is that As'ad bin Sulaiman Pasha feared Abdullah Pasha the ruler of Baghdad and fled to Al-Munfaq. When Hamoud bin Thamir the leader of Al-Munfaq refused and after fighting, Shammar sided with Al-Munfaq, and betrayed Abdullah Pasha, so the Iraqi soldiers were defeated. Abu Abd al-Rahman said: The common people in Najd pronounce Al Jarba like this \"Al Jarba\" without Hamza, due to the heaviness of the Hamza letter on the pronunciation of the common people. Ibn Sanad said: In the year one thousand two hundred and thirty-one of the Hijrah, to him (the number of what knowledge encompassed, and what ability attached to of possibilities, Bunayyah bin Qurainis Al Jarba was killed, and his head was brought to the Vizier Sa'id. Know that Bunayyah crossed from the Jazira to west of the Euphrates, when Sa'id Pasha assumed the ministry of Baghdad, due to the grudges between his uncle Faris and Al Ubaid, especially their emir Qasim bin Muhammad bin Abdullah bin Shawi Al-Ubaidi. Sa'id Pasha had entrusted the reins of most of his affairs to him. Due to what was between Faris and the mentioned, he did not settle in the Jazira, so he descended with his tribe on Khuza'ah, in that year, to measure grain. Al-Duray'i Al-Anazi Al-Ruwaili - with Damma on Ra and Fatha on Waw and Lam after it Ya of attribution - tracked his trace and descended near him, and sent to Hamoud bin Thamir, asking for help, so he mobilized with the horsemen of his tribe to help Al-Duray'i, due to the coalition between them. Also the army of the Vizier Sa'id went out, their elder Qasim Ibn Shawi, and with him Uqayl - with Damma on Ain and Fatha on Qaf and Sukun on the lower double-dot Ya - and they are soldiers for the Vizier. So the war stood on a leg and the horsemen defended. It was decreed upon him in one of his attacks that a bullet hit him, so he fell from the back of his horse, may Allah have mercy on him and us - and I heard him attributing himself to Tayy the known tribe to which Hatim bin Abdullah bin Sa'd Al-Ta'i and his son Adi bin Hatim Al-Ta'i the venerable Companion are attributed. This is a literary text, in an emotional style I copied from the papers of my Sheikh Hamad Al-Jasser quoting from \"Matali' Al-Su'ud bi Tib Akhbar Al-Wali Dawud\" by Uthman bin Sanad. Ibn Sanad said: \"D\" And in the year 1237 AH, the governor of Kerman had sent about a thousand of his soldiers for provisions from those homelands, so Safouk Al Jarba met them, and entertained them with stabbing and striking, and watered them punishment instead of fresh water, and made them gulp bitterness and colocynth with swords, so he killed many of them, and the rest were between defeated and captured. Then he said after a long speech related to Dawud Pasha: Several trustworthy people told me that Safouk bin Faris Al Jarba raided Ibn Al-Shah, and crossed Diyala, with horsemen from his tribe, until he was in sight of Ibn Al-Shah's army. The army's horsemen rode when they saw him and attacked him, so he lured them until they crossed Diyala, and were far from it. Then he and those from his tribe and from the Romans turned on them, so the Persian horsemen retreated, and the horsemen of Shammar followed them, and killed those they caught, and brought their horses and loot - and praise and gratitude be to Allah -. More than one person told me that this is different from the first one mentioned by the Turkish historian. The Families of Al Jarba and Some of Their Notables 4 - Clarification of their families, and praise of some of their notables. Abdul Jabbar Al-Rawi said:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 27
  },
  {
    "serial_number": "6207490",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Before detailing each section of these sections, we present an introduction about the famous family to which the reins of the supreme leadership in Shammar Al Jarba were cast. Those who led this tribe are \"Al Muhammad\", and as they multiplied until they became a group, indeed a large tribe, we found no escape from mentioning those who belong to this house since its first inception until today, praising their most famous leaders in the past and present: The first who migrated from Najd to the Jazira in Iraq was Faris Al Jarba, so he is the first leader of Al Muhammad, Sheikhs of Shammar in the Jazira. Faris left a group named Al Faris, and from these Safouk became famous, and from the children of Safouk Farhan Pasha the famous became famous. Farhan Pasha left many children, divided into four branches, each branch attributed to its mother \"i.e. to one of Farhan Pasha's four wives\", and these branches are: Al-Durrah, Al-Jaz'ah, Al-Sarhah, and Al-Bashat. First Branch - Al-Durrah estimated with their freedmen at five hundred houses, and most famous of them are Al Abdul Aziz, Al Faisal, and Al Shallal. From Al Abdul Aziz emerged and headed all Shammar tribes Sheikh \"Ajil Al-Yawar bin Abdul Aziz bin Farhan Pasha\" may Allah have mercy on him, and the leadership is still in his offspring. Second Branch - Al-Jaz'ah estimated with their freedmen at 500 houses also, and most famous of them are Al-Asi, Al-Jarallah, and Al Mijwel. Al-Asi lived \"120\" years, and became Sheikh of all Shammar then the Sheikhdom devolved to his son Al-Hadi in his era, while he was alive then Al-Hadi was killed, and the Sheikhdom devolved to Daham head of the Shammar tribes residing in Syria now. Third Branch - Al-Sarhah estimated with their freedmen at 100 houses, and their most famous leaders are Mutlaq, Hayis, Thuwaini, Abdul Muhsin, and Sultan. Fourth Branch - Al-Bashat named after the Pashas, because they did not leave Farhan Pasha's house until his death, and are estimated with their freedmen at \"50\" houses, and their dwellings are now in Al-Farhaniyah near Balad \"a district belonging to Samarra district in Baghdad governorate\", and their most famous leaders are Al-Humaidi to whom the Sheikhdom of Shammar devolved in the Ottoman era, and Mizar and Bandar, and they have died, and Ahmad and Zaid, and they are alive and sustained. There are others besides these attributed to Al Muhammad, such as: Al Amr: estimated with their freedmen at \"300\" houses, most prominent of them is Zaid Al-Amr. Al Zaidan: estimated with their freedmen at \"300\" houses also. Al Fahd: estimated with their freedmen at \"30\" houses, and most famous of them is Sattam Al-Fahd, and the Sheikhdom of Shammar was not entrusted to any of them. The Poet Ibn Hattab. Abu Abd al-Rahman said: Among Al Jarba who did not migrate to the Jazira are Al-Sa'dun and Al Sarah in Al-Jawf, among them Al Salman from Al Hubub from Al Sarah. From Al Sarah is the poet Ghalib bin Hattab, from his poetry is his saying addressing Sharidah, the servant of his host: Oh how happy is he who climbed the head of Al-Faridah ... And saw Al-Tawil and saw the nose of Al-Adhari. Better for me than facing Sharidah ... Making the camels of the brave kneel at the palace of Ibn Zarra. And his father is the one Ubaid Al-Rashid means by his saying: O who gives me glad tidings of Khulaif and Hattab ... The glad tidings of Pharaoh about Moses and Aaron. I found in Sheikh Mindil's notebooks these verses by Hattab, and he mentioned that he said them while in Ibn Rashid's prison: O those successful in good, O people of the camels ... May happiness be in their throats when you walk. With Al-Naqib call the path of the camels ... And tomorrow afternoon at Al-Laqait you will land. You will find Nasir like the free of the imported ... A den and the age of dens never fail. You will find a cup of coffee settling ... An increase on what they put in the Mansafs. If only for the one who saw those ruins ... In an hour where every cursed one attends. From the poetry of Ghalib bin Hattab is a poem Abu Muhammad Al-Baza'i told me, may Allah have mercy on him, in which he says: O Allah, O Who is above us, Exalted ... We and those who hope for Your reward beside us. We without Your request did not want ... Even if our provision came, it would not please us.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 28
  },
  {
    "serial_number": "6207491",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "O white women, count the veils upon us ... Count your veils and here are our beards. Put the twisted gold in my hands ... And adorn yourselves with our swords, O women. No return for the camels of the loads carrying us ... And we upon us their anger, what is wrong with us. After summoning the tribes we were taken ... Today if a fool comes he would take us. And after treading on tribes we were trodden ... Today with feet everyone trod on us. And Abu Muhammad Al-Baza'i told me these verses by Hattab: You did not obey my advice when I was in Al-Saqfiyah ... You say: Here and I say Here. After we were its glory and countryside ... Today we wait for a seat in our lunch. Oh my groan, the groan of a weak camel ... For homes we knew behind us. If crying relieves we would have cried \"Munifah\" ... The garden which our enemies legislated in. Today the dates of \"Al-Kasb\" are a marvel to me ... After we used to eat the tails of our sweets. As for the poem which includes: Fie on the world if we rejoiced in it ... To return in it from our passion we deviated. Ibn Khamis attributed it once to Hattab, and once to Barghash Ibn Zaid bin Uray'ir, and Ibn Saihan attributed it to Nimr bin Adwan. Abu Abd al-Rahman said: The verified is that it belongs to Ibn Uray'ir, but there is a poem on its meter and rhyme by Murkhan bin Dabis - father of Ibn Samhan - Al-Murkhan from the people of Al-Jawf in which he says: No return for us when your turn we were patient ... What makes you panic from our turn when it came. You were deceived by a time for Al-Duray'i we were unaware ... With trumpet or with purity it did not guard us. We when the smoke rises and we spread ... With the hemp rope the sucking we dip our buckets. Without planting not with its rise we trade ... And it was not said: The door closed on who came to us. O father of emergencies do not reveal our news ... A fault is your language, and a fault we are our language. We covered your nakedness and your widow ... And refused upon honor the arms of our beards. And from the poetry of Ghalib bin Sarah is his saying replying with it to Ubaid Al-Ali Al-Rashid: If you come to us O Ubaid we open the door for you ... We stand and indeed your group enters. In Al-Jawf you find in it Khulaif and Hattab ... They are not a group of weaklings fleeing from you. O Ubaid what is your intent Zakat and deputies ... These are with a judge but O Ubaid you cover. O Ubaid since you are a companion to Hattab ... And the molasses at Husain is scooped with a vessel. Mutlaq bin Muhammad Al Jarba. Among their most prominent notables in the Jazira and Syria is Mutlaq bin Muhammad bin Salim Al Jarba, who led those who migrated with him to Iraq from the Shammaris accompanied by his brother Faris after his brother Qurainis bin Muhammad and his son Muslat bin Mutlaq were killed. Ibn Sanad said in his emotional style towards this noble house: This Mutlaq is from the noble Arabs, of deep-rooted lineage and noble descent, from the brave knights, whose courage no human doubts, he has stances in which the spear and the sword testify for him, and incidents in which the enemy and the friend acknowledged his bravery, and as for his generosity he is the sea speak about it without harm, and as for his morals they are gentler than the north wind and more fragrant than lavender, and as for his house it is the Kaaba of the needy and the corner of the seekers, he combined bravery and generosity in his cloak, such that the tongues of his peers called out: He is the unique flag, and the Shammari whose generosity has no limit, and by Allah he incapacitated those after him from the leaders of the desert, with noble deeds described only as apparent and visible: O sea do not boast of your tide and stop ... From matching a Hatimi Shammari. What settled in his palms is divided among ... All people, their rich and the poor. No feat rose but narrated ... Its raised from him the tongue of ages. For his courtyard is a shelter for the fearful fugitive ... And his gift is a magnet for the insolvent poor.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 29
  },
  {
    "serial_number": "6207492",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "And he said about his migration: Then the Arab ambition called him to ascend the high positions, so he marched from Iraq to the Levant, and headed with Ahmad Al-Jazzar to the Sacred House. Then when he completed his rituals he returned to Iraq from Mecca fighting with fingers and spears, those innovators not with the tongue, so he remained in the desert of Iraq with his command obeyed, his mention spread in the lowlands and highlands, no proverb is struck except by his bravery and generosity, and no fugitive seeks refuge except in the courtyard of his sanctuary, and nothing is sought except his palms, and nothing is kissed except his right hand, until the arrow of death hit him and he ascended a martyr to the Abode of Peace. Then Ibn Sanad composed this poem in praise of Mutlaq: The high spears and thin blades wept him ... Since the tolerant one disappeared from him in the grave. Aja wept from what grieved it and Masal ... And the deserts clamored with wailing. For the calamity of a man sharp cutting broad ... Patient when calamities intensified on him. Forgiving, generous, releasing the palm with dew ... As if his hands for gifts were keys. A noble self-made man from the group who ... Their pride is like the sun white clear. Swords, stalwarts, great ones, examples ... Support for the poor, rains, tolerant. To the most abundant of them in tide and most famous in height ... And greatest in worth the calamities were destined. So a brave one from him was deposited in the belly of the earth ... Dear to him are a Mashrafi sword and a swimmer horse. He never closed his eyes one day on a mote ... Nor desired except what the blades desire. A youth who waded into every battalion if ... None waded it except the strong lion. An arrow was destined for him so it dwelled him in the earth ... So here is every region in it a mourner and wailer. So Salma almost collapsed because of him, and become desolate ... Pastures in its sides and grazing lands. O Mutlaq the Bedouins have no joy after you ... For here he is from excessive gloom frowning. And here he is no rain is sought, nor tent ... Is built, nor a cloud pouring with generosity. And no domes were built over the hills ... And no smeller smelled the scents of dew from him. Since you died generosity said: Here I am dead by the death of a man whom a goer and comer weep. Saddles were not put on horses were it not for you for a raid ... Nor would apraiser have loved poetry were it not for you. Nor would the litters have followed a master like you ... Attributed to the heights by the noble chiefs. And life did not please after losing you one ... Were it not for your dew the calamities would have surrounded him. There is no heart but burning with sorrow for you ... And no eye but in it flowing and shedding. Tayy attributed you to the noble bright ones ... Smiling of face, pouring of palm, giver. Jealous over the female neighbors not looking ... At them nor exposing a secret from them. So from you and in your descriptions is hoped ... The blissful dew and elegies and praises are found sweet. If you protected with swords a chased one ... He is avoided by what the predators fear. And he became in a shade of security lush ... Guarded by a swordsman and archer and spearman. As if you are clouds for the seekers ... Remaining while they are the morning and evening clouds. The Arabs ceased not to hope to catch up with you ... And are not like winds in the breeze the fans. And where from the heads in virtue are legs? And where from the buckets are the pouring clouds?",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 30
  },
  {
    "serial_number": "6207493",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Were it not for you the Bedouins and the wilderness would not be joyous nor would the strong horses be joyous for the raid. May a cloud lingering heavy and pouring water ... A grave you became in it from satisfaction. And may there cease not from you one whose courtyard is sought ... And a fugitive and praiser covers him in the calamity. Abu Abd al-Rahman said: In Mutlaq's life his brother Qurainis was killed in the year 1212 and his son Muslat in the year 1205. Bunayyah bin Qurainis Al Jarba. Abu Abd al-Rahman said: I do not know when Mutlaq died, and the leadership was taken over after him by his brother Faris, and he had grown old and was the Sheikh of \"Al-Shaddad\" (authority) and the leader of battles in the era of Faris his nephew Bunayyah bin Qurainis Ibn Muhammad. Ibn Sanad said: And Bunayyah - with Damma on Ba, Fatha on Nun, Tashdid on Ya and Ha of femininity - is one of the knights of the Arabs and their generous ones, and he had like his uncle Faris in the days of the Vizier Ali Pasha great pomp and precedence. And this Bunayyah almost rivals in bravery Faris Al-Na'amah, and Muhattim Ibn Al-Arqam Dha Al-Ghazala, and as for generosity he is the rain nay the vast sea, and as for protecting the neighbor with every sharp cutting sword, he is at the peak of it, and people only follow his example in it, and as for lowering his gaze from his female neighbors, it is a matter in which his rivalry is not coveted. As for lineage he is from the houses of the Arabs. Attributed to high honor by Banu Thu'al Lions of the thicket and chiefs of the first leaders. The dwellers of the desert over hills And the builders of houses of glory with spears. The slaughterers of camels for guests their slaughtering Lions of the den, with what they drew of blades. And the protectors of the neighbor with swords shining Between the two armies and the quivering spears. Ibn Sanad said: And for what Bunayyah had of generosity and bravery and high fame and for the affection between me and him I eulogized him extemporaneously then he mentioned this poem: He died so for my tear on the cheeks is pouring ... A lion whom the Mashrafi sword wails. A noble of two lineages from those who ... Their pride is like the two luminaries shining. Over the likes of them weeps a stranger thrown ... By black calamities and hardships. And a night traveler in a desert destitute of provision ... Guided to them by lights and cattle. And the fierce war weeps them and a strong horse ... Lean like the wolf of the desert swimming. As if they are for virtue among people eyes ... And for glory a heart and for generosities a spirit. They are the lighters of fire in the desert for guests And for the star in the winter night setting. And a white Shammari I wept ... Attributed to the original origin forgiving. And magnificent as for his grandfather he is Hatim ... And Sa'd and as for his tide it is pouring. As if the natural dew accompanied his spirit Since Noah settled in the honored Ark. So O their generosity if you weep them you weep masters ... With their spreading the cloak of pride smells fragrant. And weep those who were by the melting of their blood ... Treating ulcers that were incurable and wounds. Knights arriving with the step their whites ... And for the lions from the shine of swords approaching. I wept and continued weeping a noble one ... With whom I used to suppress the lords of discord. Bunayyah and the chief who ceased not with him ... Trotting to the blood of wars fan. The pouring of the armored ones' blood as if it is ... A evening drink for him in his attack and a morning drink. I lost with him the full moon that sank since he died ... Seas having from his palms pouring. So I wailed and the flocks of tears as if they were ... Clouds, and the bereaved of the noble ones wails.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 31
  },
  {
    "serial_number": "6207494",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "And I am not fulfilling for him some of his love Even if I last as long as the pigeon wails I wail. He mentioned that he was killed in the year 1231 AH and his head was brought to the Vizier Sa'id. Al-Marik mentioned that Al-Ashmal is Bunayyah Al Jarba, brother of Mutlaq Al Jarba, and Al-Marik mentioned this commenting on Al-Harbid's saying: Sheikh Mandil Al-Fuhayd mentioned to me that the one who killed Bunayyah was Al-Ruwalah in the migration of Anazah against Al Jarban taking revenge for the famous robbery of Hissah. She is Hissah bint Al-Humaidi bin Hadhdhal. That is because Bunayyah when he knew of the coming of Al-Ruwalah sent asking for help from Al Sa'dun, although there were revenges between him and Al Sa'dun, so they promised him to come out for negotiation with them, so he went out safe with no more than forty, so they betrayed him. Abu Abd al-Rahman said: Then I found in Mandil's notebooks a summary: \"A battle occurred between Bunayyah Al Jarba, one of the known Sheikhs of Shammar, and the Turks, led by Nasir Al-Ashqar Al-Sa'dun in the days of previous wars. It was said: That Bunayyah did not have anyone of his people with him during the battle so his horse stumbled with him and he was killed. And it was said: That his head was cut off from his body, and brought to Ibn Sa'dun's council, and placed in a high place near the fire, with the intention of the arrogance of seizing or wondering at his bravery. There was a Shammari man neighbor to the people of Al-Sa'dun, I do not know his name, except that he is Fidaghi from Sinjara. When he saw the head of Bunayyah Al Jarba, he recognized his facial features, so he was affected and stood up and sat near it, and began combing his mustache with his hand or stick and saying: The owner of this face with the awe and great status does not deserve this. Then he said verses of poetry praising Bunayyah and insinuating against Ibn Sa'dun and left to his house. After that some of those present in the council said to Ibn Sa'dun: Did you hear the Shammari's speech? He said: No, so he sent someone to bring him. When the messenger arrived there he asked about him and was told: Sleeping in the Raffa, and after approaching him to wake him he found him dead. Unfortunately, I did not find the verses he said before leaving the council, despite my search for them and asking many narrators. These are verses from a poem said by Abta eulogizing her father Bunayyah after he was killed in this battle, saying in it: He gathered his ropes then collected and carried it ... And she arched from the much retreating and advancing. Condolences O wolf of the captives his fright ... Yes by Allah O people of horses a horseman. How often he gave from every thoroughbred a progeny ... Racing the raid of horses lifted tail. How often you drank from the sweetness of his pots ... In the time of hardship he cheapens for you the dear wealth. How often he pushed away with the sword from a difficult matter ... And how often he slapped away from you everyone who aggressed. No one pierced his spear, nor anyone bent to him ... No battle happened with him that pleased the mind. *** And Al-Ashmal who is from his wishes the repetitions ... And Mutlaq able in the fresh pool. Abu Abd al-Rahman said: It is Bunayyah bin Qurainis, and Mutlaq is his uncle. Bunayyah bin Qurainis Al Jarba is the one who ordered washing the horse of Al-Wudaihi three times with soap, because Basri Al-Wudaihi fled on it escaping in a war of Al Jarba with Al-Ruwalah. On the occasion of killing Bunayyah, a poet from Al-Sadid from Shammar said, boasting of killing Bunayyah, and referring to the aggression of Al Jarba against Al-Sadid: We marched from \"Al-Shimbal\" to the palace of \"Shallal\" ... Two months, and the third we slaughtered Bunayyah. Oh yes by Allah O people of horses a horseman ... And my condolences to his descendants the pride of Shammar. This is the reward of the one who sold us for Ibn Hadhdhal ... We brought his brain to the Pashas a gift. And this is a poet from Al-Burqa' from Shammar living in Aqdah he and his group under the mercy of its Emir Ibn Fawzan Al-Dosari saying: Whoever wants \"Aqdah\" and the pleasure of its growth ... Let him be patient even if he is stabbed in the side. And whoever does not want \"Aqdah\" let him leave its front ... Let him head for \"Bunayyah\" with groups groaning. Meaning Bunayyah bin Qurainis. Safouk bin Faris Al Jarba",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 32
  },
  {
    "serial_number": "6207495",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "As for his uncle Faris, he died in the year 1233 AH, so the leadership was taken over after his son Safouk bin Faris bin Muhammad bin Salim. Ibn Sanad said: And Safouk this - with Fatha on the neglected Sad and Fa followed by a Sukun Waw and Qaf - is originally the inaccessible of mountains, and the soft of bows, and the smooth high rock, its plural is Sufq like Kutub. This generous one was named with it, and the Hatimi who became rich with his gift the destitute. By Allah he is unique, in his generosity about which the tongue of description is short. No wonder the youth follows the footsteps of his fathers, and his fathers there is none of them but is proverbial in his generosity: They are the noble ones so ask about them for they are Who are asked when the crises intensify. Whoever settles in their courtyard as a guest saw in them ... Lions if they collided clouds if they were generous. No neighbor of theirs was wronged by time nor did they forsake ... A client, nor were they heavy in nature nor frowned. No night traveler saw a fire of hospitality and headed for it ... Except that its raiser until it is seen is them. If their guest desired their souls they would grant So let their guest fear Allah regarding souls. Their leader did not lead except with a drawn sword ... Its dye is clot from who transgressed and blood. And by their right the fire of an enemy did not light ... Except that its lighter are their swords with them. No Arab boasted except their youth surpassed ... With every virtue their elders surpassed with. Fond of what their fathers were accustomed to ... Before weaning the newborn loves dew. As if they for the hospitality of guests were created And for stabbing for the lions of the forest colliding. Served but in their councils ... For every guest by hastening hospitality are servants. Were it not for them no Bedouin or hill would flourish Nor would \"Aja\" and \"Al-Nir\" and \"Al-Alam\" flourish. Nor litters in the desert accustomed ... To the stabbing of knights from them a cutting sword. Heavy if attributed then to the generous ones from Thu'al ... And the givers when others were stingy. And the carriers of the longest spear So the lions know that the spearmen are them. And the dwellers in Najd every hill ... The rugged grounds and hills fell short of it. They did not ride the donkey in Bedouin or settled life But strong horses, from them the bay and the black. High proud so they did not pay to a king ... Tribute nor did injustice befall their female neighbors. Their neighbor does not complain of them except generosity If spread in the earth no meanness would be found in it. They slaughter from the huge camels the fat ones what ... If it were in Iram no craving would have touched it. If people were from them one and they counted: ... Who is the generous? Generosity would point towards him. I did not know is \"their Mutlaq\" more dewy and generous or His father, or \"Faris\" or this \"their Safouk\" But I asked the dew about them and it said: Alas ... All is generous, and the most generous is the last of them. He almost from the generosity of morals gives what is In the earth and he sees that dew is frowning. He gave as a boy so he surpassed the generosity of \"Harim\" ... And does Harim rival a youth in giving. Ask about his favors his enemies for they ... From counting what they proved of their little were bored. O \"Shammari\" we saw from his gifts ... What paper nor pen can count. I praised to my hearing about you what fell short ... From matching it in its pouring the rains. I moved in you with my thoughts rhymes that do not ... Cease to be struck as proverbs so they harmonize.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 33
  },
  {
    "serial_number": "6207496",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "And I did not want by my praise in you a prize ... Even if the nations became rich from your flow. But I am a man who loves the generous and who ... Were to the best Vizier in creation servants. Since you emptied capacity in his advice ... And you were his judge when the Persians transgressed. You fought them sincerely in love of a victor ... Were it not \"Dawud\" I would have said the man is \"Mu'tasim\". You supported him with cousins lions ... They sold to every danger their souls. So they attacked in the morning Persians who opposed and transgressed ... With sharp swords thought to be meteors above them. They attacked them in the morning but you are their leader Were it not for you they would not have broken heads nor cut. When they attacked them on short-haired pure horses ... If they were not mountains they soared with them. High noses their bits did not soften ... If from others in an accident bits softened. They drew swords against black faces so since They sheathed their flashes the darkness cleared with them. Rawafid who thought the dawn of guidance charcoal And charcoal is not like the shining whiteness. They sought enmity of one whose impulses remained ... With sharp swords from the transgressors taking revenge. And since he made them taste the spear trembling ... And the Mashrafi sword with it the lion-like bold. They returned in disgrace on heels pelting them With white and brown swords the heroes of war the old. And the armored ones but with hearts so how often ... They attacked and did not armor except their hearts. So you were the boldest of them a colt to a dust ... And the white swords scatter and the spears organize. Lions helped you their sayer said: ... Draw the blades and to the rope of Allah hold fast. So the Persians chirped like ostrich chicks and does ... The Persians clash with the Arabs in their attacks? To Allah are Arabs who obeyed the command of a unsheathed ... And a lion who has from his spears a thicket. Were it not for him the blackness would cover the rejection of Persians \"Black faces if they are not wronged they wrong\". But he drove them away from him with an unsheathed sword So they surrendered the glory when he drew and were defeated. Pride \"Safouk\" because you supported a victor ... By him the examples in his days were sealed. This and when Safouk supported this advanced Vizier, and the Caliph who by his politics which is not found in his contemporaries becomes great, he granted him \"Anah\" and what follows it of villages, and this is a giving I have not seen from other than him to the like of Safouk happened. As for the Vizier, he has cases of generosity, judging for him that he is \"Ibn Jala and the climber of mountain paths\", and when with Safouk he acted, Safouk served him so he became great and majestic, so he opposed his enemies, and allied with his allies, and became to him slave of hands, envied for that in the settled and the Bedouin, and as if the veiled Vizier looked in what he did to the saying of Al-Muhallab: I wondered at who buys slaves with his money, and does not enslave the free with his gift. And as if Safouk only made himself a slave for the saying of who said in this field: Not who bought you is your master, rather your master is who elevated you and gave you authority. I will mention of the Vizier's gifts to Safouk what the tongue of thanks is short of recounting. As for Safouk's generosity, it is what proverbs were struck with, and opposites and likes acknowledged, until one who attended his food mentioned to me, that he surpasses Ibn Sinan and Ibn Mamah. Abu Abd al-Rahman said: Safouk is a proverb in generosity among the common people and if they wanted to refute the claim of a claimer of generosity they said: \"By Allah Lawk (if only you were) Safouk\". Meaning: By Allah you do not reach this description unless you were Safouk and Lawk origin is: Law Annaka (If you were). Abu Abd al-Rahman said: Safouk was killed treacherously by the hand of one of the Turkish governors in the year 1840 or 1841 AD. His father married him to Amsha daughter of the Sheikh of Tayy in the year 1225 AH. He has two other wives who are Salma daughter of his uncle Mutlaq bin Muhammad and Abta daughter of his cousin Bunayyah bin Qurainis bin Muhammad. These two girls quarreled and sought judgment from Ali bin Sarihan, to differentiate between their fathers so he said a poem starting with:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 34
  },
  {
    "serial_number": "6207497",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "O girl the differentiator between the two is a liar Before me the Sheikhs of tribes were unable with it. He praised both their fathers and did not differentiate. This is the text of the complete poem. Ibn Sarihan said: O girl the differentiator between the two is a liar Before me the Sheikhs of tribes were unable with it. If you gather the people they and the companions They would not adjust your right nor was it said leaning. O Hissah whom not every attracter brought ... O daughter of the giver of named thoroughbreds. If the rain of the season decreases and the measure is at the door And the sky clears, the market has no resilience. And if they promoted with the camp ugly spoils And the lean tribes stayed away from them. To the one who has the dabdob and for the neck a butcher Breaker over the food in the banks of Hail. A giver what is in the palm a restrainer what he brought ... Cheerer of the hem of the house fulfilling of qualities. Hinderer of the opponent voider of all causes Resolver carrier of heavy loads. If groups came to him with the ground fog He throws with the edge of the sword whoever came to him attacking. He has an attack in which the marj finds a runner ... With the abundance of the opponent's horses the stabbing of descendants. And if a Bedouin came to him he approached like a bringer ... The morning the choice thoroughbreds are cleared for him. His gift is from the best of his door to students ... Sheikh of Sheikhs and winner of every tall thing. His rumors oh how far they are with the strangers ... The mountain carrier of heavy loads. I copied from Sheikh Mandil's notebooks the saying of Abu Anqa from Abda from Shammar, addressing Safouk Al Jarba and boasting of his people: O Safouk see the red turbans a noise From the group of \"Ibn Shuraim\" they stood for \"Ba'almaykh\". I knew their faces when he took refuge ... The abundance of their conversations and they rose Masalikh. O Safouk indeed some issues are foolishness ... What a pity we anger them and please the Tababikh. A group for us we settle with them every need ... See their gain on the day of meeting is Majawikh. Those whose gains on the day of clamor ... Strong horses their nostrils like bellows. Basri Al-Wudaihi said from a poem praising Sheikh Safouk Al Jarba: I climbed a tall cairn that rose with me ... The watchtower of \"Arwa\" overlooking that from it. I looked at the Khabur seeing Adhib ... Western Tel Nmail a stage split from it. I looked at the house of the Sheikh the illness of the warrior ... Safouk heavy of weight protector of its homeland. A Sheikh and his sight is not from near ... And he does not desist from his will the day he forbids. The house is built and the smoke is like a stream ... The stream of Iraq whose smoke howled. He brings forward dishes in which is mixed and nerve ... And the eaters of food did not decrease from it. Abdullah bin Rabi'ah said about Safouk Al Jarba during his praise of Abdul Muhsin Al-Sa'dun: And he is the one who let Al-Suwaiti enemy of the people ... And the Shammari to the Sham chases his litter. And Safouk from the battle of Al-Muqayyar to today ... Leading the heart of the ostrich his peer. Sheikh Abdullah bin Hadhdhal Sheikh of Anazah addressing Sheikh Safouk - and it is among what I found in Sheikh Mandil's notebooks: \"Marjan\" bring my mare in her cover ... And milk for her from the milk of the herd of Khawawir. After the fodder drag the rest of the dinner for her ... From a Mansaf the guests did not lessen. I will ride her the ride of the bucket rope to the pulley ... And bring her down the bringing down of a bucket on a well.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 35
  },
  {
    "serial_number": "6207498",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "O Safouk I have for the Sayafa a beauty I do not forget it unless I forget the shining stars. I come to you with \"Al-Waylan\" the choice of his men ... Cutting the groups destroyers of battalions. In the palm a polished sword its ignition increases ... Leaving the fragments of the enemy's heads scattered. Dakhil bin Na'im from the tribes of Al-Sayih said, threatening Safouk Al Jarba: If you come to Abu Farhan say to him: We crossed ... Jazaa'a we do not let the nose be trodden. And if \"Al-Arwam\" all ride on our trace We must O Safouk shake the head. And we on the war of your ancestors were patient ... It is not from you and coming O wolf of the ropes. Before \"Al-Jazira\" when \"Najd\" was our homes ... And our dead in it chase on mares. O Safouk by Allah we do not leave our intoxication Unless \"Al-Jazira\" is empty there are no people in it. If the belt is a span we measured ... Throwing the armored from old is a base for us. Dr. Shafiq Al-Kamali said: It is narrated about Sheikh Safouk Al-Faris Al Jarba - and he lived at the beginning of the thirteenth century Hijri - one of the Sheikhs of the Shammar tribe - that he was in a council of the councils of Baghdad, so a man entered the council and everyone celebrated him, and he won their respect so he asked about him, and it was said to him that he is Sheikh So-and-so. He said: He is the Sheikh of which tribe? It was said to him: He is not a tribal Sheikh but rather the Sheikh of the Naqshbandi order, which is a religious order. His answer was: Religion has no engravings (nuqush), meaning there are no engravings or decorations in religion. Radhan Abu Anqa said in eulogy of Sheikh Safouk: Since you were absent from us O son of my brother his way Happiness was absent from our dwelling and the laws. And we graze the grazing of game and flee a fleeing And we became like the flock of goats without a billy goat. Farhan bin Safouk Al Jarba. Abu Abd al-Rahman said: Perhaps the one who took over the leadership after Safouk was his son Farhan Pasha, and I have seen a mention of him in colloquial poetry in the saying of a poet from Zubaid, singing of the victory of Al Ghubain from Anazah over Farhan Al Jarba: They closed upon you with polished swords No, the prisoner of necessities \"Farhan\" did not cry. The story of this verse as I read in Sheikh Mandil's notebooks: That a man from Zubaid moved away from Farhan Al Jarba, for a crime he committed, and took refuge with Al Ghubain from Anazah, and stayed with them for a period. Then their lands were hit by drought so they needed to graze in the Jazira, and they asked Al Jarba for a specific period for grazing so he permitted them. When he knew that the Zubaidi was with them he sent someone to take his camels. So the Sheikh of Al Ghubain stood up and said: Whoever does not pass by the tent of the Zubaidi our neighbor and compensate him with a she-camel is not a Ghubaini! So every owner of a herd began taking a mount from it to the Zubaidi's camels, until they returned to him what was taken from him and an increase of fifteen mounts. Then a man from Al Ghubain came late, so they said to him: The Zubaidi is sufficed and got more than his right. He said: I am not failing my group, if you do not take it to him I will slaughter it! When they returned to their country, a group from Shammar of the Jazira raided them, so Al Ghubain defeated the Shamamrah. When their neighbor the Zubaidi who returned to Al Jarba in the Jazira after his crime ended knew, he said: O cloud Ghurra originated from a cloud ... From \"Al-Jazira\" went west towards \"Hawran\". Raining on \"Al-Ghibnan\" they drive its torrent The people of the quarters who are on horses knights. They rode upon them forcing the calamity ... They loosened the shutters of the reins and halters. They closed upon them with polished swords ... No, the prisoner of necessities Farhan did not cry. Faris and Abdul Karim Al Jarba. I do not know who took over after Farhan except that there are two who took over consecutively after Farhan, and they are from the grandsons of Faris bin Muhammad without doubt: One of them: Faris Al Jarba whom Lady Anne Blunt mentioned in her journey that he was the Sheikh of the Jazira in the era of Muhammad Al-Abdullah Al-Rashid.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 36
  },
  {
    "serial_number": "6207499",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "The second: Abdul Karim Al Jarba and his brother Mutlaq, and I do not know which of them was the Sheikh, except that they were contemporaries of Talal bin Abdullah Al-Rashid, and Abdullah Al-Faisal, so they are older than the contemporary of Muhammad Al-Abdullah Al-Rashid. Abdul Karim has great fame among the people of Najd, and I did not find this fame for him among the historians of Iraq. Abu Abd al-Rahman said: It is likely that Abdul Karim and Mutlaq are sons of Farhan bin Safouk, and that Abdul Karim took over directly after Farhan then after him Faris. Safouk is a contemporary of Abdullah Al-Rashid, and has a relationship in helping him during his ordeal with Al Ali, and perhaps there was intermarriage between them. Sheikh Mandil dictated to me these two verses by Abdullah bin Ali Ibn Rashid addressing his brother Ubaid after they returned from Iraq and married their sister to Al Jarba. Abdullah said: O Ubaid nothing remains for us but a need And it is a need that is neither bought nor sold. And O Ubaid indeed some meanings are foolishness ... By Allah if he intends lost lost. Among the news of Abdul Karim Al Jarba is this story attributed by Sheikh Ibn Khamis to one of the Sheikhs of Al Jarba. Ibn Khamis said about Abdul Aziz bin Eid \"Al-Izzi\" the shepherd of Al-Barra: That he said these verses praising one of the Sheikhs from Al Jarba. O Al-Zir O Al-Zahhar O Al-Nimr O Al-Dhib O Al-Layth O Al-Layuth O the Cub O Al-Dabb. Confronter of the battalion of soldiers if feared With the sword for the necks of the bold ones a butcher. His fault if people said there is a fault in him For the ghee over the flattened tray of camels pouring. Ibn Khamis said: It is said that when he went deep in bringing these strong words in this strong poetic style, and Al Jarba was girdled with a golden belt with a precious dagger, the praised one felt vanity and admiration, and swelled until this belt could not bear him, so it snapped, and it was the first of the poet's gifts! Abu Abd al-Rahman said: Ibn Khamis was followed in this attribution by quoting him both Al-Huqail and the author of \"Al-Azhar\" and Al-Kamali. The correct is what Sheikh Mandil published, and Ibrahim told me that the verses are by Khudair Al-Su'aylik from a poem praising Abdul Karim Al Jarba starting with: O Sheikh I came to you on the grey camels Coming from the house of the lovers crawling. Mandil said: It was said: That when he heard it he gave him a prize of fifteen camels with their load of provisions. Abu Abd al-Rahman said: Here is the text of the complete poem as narrated by Sheikh Mandil. Khudair Al-Su'aylik said: O Sheikh I came to you on the grey camels Coming from the house of the lovers crawling. It crawled on me and crawled from me with approximation ... The livestock decreased O shelter of everyone who feared. From our house we came to your house strangers ... Heading for a star that neither changed nor disappeared. Choosing you O source of generosity and goodness ... May Allah not disappoint for the generous a seeker. Peace from a loving heart without doubt ... To him the young repent and the one who aged becomes young. O the jewel the Nariz O the perfumed with goodness O the slender O the neighing O the horse of requests. O Al-Zir O Al-Zahhar O Al-Nimr O Al-Dhib O Al-Layth O Al-Layuth O the Cub O Al-Dabb. O the fierce the lion severe of strikes O the queen O the breaker of his opponent and strangers. O the rare the eagle the punishment of watchtowers O surpasser of his generation far and near. Confronter of the battalion of soldiers if feared Cover of the virgins if the fog covered the camels. Your fault if the smoke rose as if it were the stream With the sword for the necks of the bold ones a butcher. And your fault if people said there is a fault in you For the ghee over the flattened tray of camels pouring. And slaughtering sheep and large camels rough of hocks And giving fillies, and spending money without count.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 37
  },
  {
    "serial_number": "6207500",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "And in you is a sign pouring the single bent ones And giving food and for the extra gains a gainer. And a leopardess you drag to the enemies and foreigners ... You surprise with it the heedless of your opponent with causes. And after this by the help there are no defects in you Sweeter than sugar on the liver of a drinker. We came to you on camels grey of bags To see you O show clear of fangs. The free falcon strikes with deadly palms And the follower his hunter from the game did not bring. And you are the one who fulfills all duties As if you are \"Hudaib Al-Sham\" with the load blaming. You bend to Abu \"Salfiq\" there are no lies in it ... Sheikh of generosity giver of long necks. How often you gave those who come to you seekers How many came to you from time afflicted. And you relieved his worry with great gifts From a spring rising as \"Al-Zab\" rises. Allah honored that you are good and do good And good is gathered from you O pure of lineage. And it is not much O calmer of difficulties ... Your deeds are counted by the one in the loins. Prince Al-Sudairi mentioned that Abdul Karim is nicknamed among Shammar and Anazah as the Drunkard of the Madmen, and he cited a poem by Hada Al-Hamdani, praising Abdul Karim with it, while seeking neighborhood with him and Abdul Karim granted him neighborhood and he sat with him. From this poem is his saying: Name and obey me on the camels and we move ... To Abdul Karim who is remembered for his deeds. To the Sheikh confronter of the faces coming ... And whoever the dust of nights closed on him came to him. I found in Rosel's book about Al-Ruwalah from what my translator Professor Nasser Al-Ulaywi provided me this war song (Ahydiyah) by one of the poets threatening Abdul Karim Al Jarba: For the eyes of blondes that hovered ... We hear in them the ringing of the bell. Either you threw to Abdul Karim ... Riding the horse is forbidden to me. Abu Abd al-Rahman said: Muhammad bin Yahyan, may Allah have mercy on him, told me around the year 1376 AH - about a rivalry that took place between Abdul Karim Al Jarba and his brother Mutlaq, so people feared differentiating between them, and so did their mother except that she mentioned that Mutlaq while breastfeeding holds the nipple and does not pay attention to his mother's cooing to him, while Abdul Karim releases the breast and plays with his mother's cheerfulness and laughs to her, so people understood from that that she distinguished Abdul Karim with generosity. Due to the excessive generosity of Abdul Karim they nickname him \"Abu Khawdhah\" (Father of Take) as will be explained in Fajhan Al-Farawi's poem. I copied from Sheikh Mandil's notebook these verses by the poet Radhan Ibn Anqa Al-Shammari, praising Abdul Karim Al Jarba, when he clothed him with his fur coat while not knowing him, because he found him a stranger in a winter night. Radhan said: Yesterday was not like yesterdays ... From a blower blowing behind the house and roaring. The pregnant camels and fat ones become in it ... As if you cut their backs with saws. The weak camels become crouching ... The noses of the crooked weak ones began to pour. Were it not for \"Abu Mudbagh\" this would be my death ... In a night where no guards meet me. A gift not from the clear ones ... \"A fur coat\" and as if he drove to me white camels. His father is like him giving the named ones ... Strong hoofed long nails. Sheikh Mandil mentioned that Abdul Karim's maternal uncle is Ibn Sabila from Al Shuraym from Abda. So Ibn Sabila's daughters are four: Mother of Sheikh Abdul Karim, and mother of Al-Ajl from the Sheikhs of Abda, his grandfather Iqab bin Ajl, maternal uncle of Abdul Aziz Ibn Mutaib Al Rashid, and mother of Al-Rim Sheikhs of Abda, and mother of Al Fuhaid people of Al-Asyah known as Mutayrah. Radhan Abu Anqa said addressing Sheikh Abdul Karim: O riders of the swaying straps ... Red and they are from below clothed like raw cloth.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 38
  },
  {
    "serial_number": "6207501",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Stretched after they were unbroken ... They grazed the bones of the quarter year after year. They show speech from my brain anecdotes ... From the head of an old man afflicted by deceit and passion. They arrive at Abdul Karim \"Abu Nayef\" ... May his glory last throughout the days. O Sheikh O you who are for the belt successors O like the sprout of Pleiades when it rose. O spring of rulers fulfilling of costs Were it not for the breach in you from the breach. You inclined your head towards the owner of fines ... Not sitting is your glory with his head nor standing. Holder of grudge in the clean hearts ... Hasty in carrying the pincers blame. The camels went west from you today afraid What is the matter with you O distracter of every rain cloud? Three groups needing descriptions ... Heading for the house of \"Jad'an\" and \"Wadham\". Maybe you see them regrets do not benefit ... Something passes today count it from the year. Abu Abd al-Rahman said: This poem is from what I copied from Sheikh Mandil's notebooks, and he mentioned about its occasion that Al-Ahdab and his people from Al-Thabit from Shammar, killed an adversary of theirs named Ibn Dar'an, in Abdul Karim Al Jarba's house, so Abdul Karim got angry and ordered them to leave him. However, the poet Radhan feared that Al-Ahdab and his people would resort to the enemies, and could not advise Abdul Karim immediately, so Abdul Karim's wife tricked for the poet by ripping the shelter of the tent from every side, while Abdul Karim was sleeping, when he woke up he ordered covering the tent and fixing it so she said: I uncovered the tent for the sake of the enemies. When she paved the occasion for him he presented his advice in the aforementioned poem. I found in Sheikh Mandil's notebooks these verses by Sheikh Abdul Karim Al Jarba on the occasion of the \"Bey\" the state commissioner requesting his Kuhaylah mare and his insistence that he would take it with a price or without a price. Abdul Karim said: You sent to me O \"Bey\" a letter that scares ... You request the torment of the twisting branches. I want when the groups dyed ... I defend on it with the groups of Al-Tanaya. O \"Bey\" it is not a lark in the plates ... This is \"Kuhaylah\" like the goat of the Bedouin. I want when my group come shouting ... In an hour the birds of death hovered. The sale by Allah we do not sell \"Al-Kuhaylah\" ... Nay nor do we give it generously for a quarter of a night. I refuse when they ascended with a long one ... I defend on it at the end of the rejected ones. The \"Bey\" did not concern me nor did \"Sharif\" concern ... We are removers of the enemy and the bordering. By force we do not give the weight of a loaf ... And at satisfaction we are big in gifts.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 39
  },
  {
    "serial_number": "6207502",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Fahd Al-Marik, may Allah have mercy on him, said: Professor Adham Al-Jundi says: I was one day in the club of the late Mashal Pasha Al Jarba, in Damascus, so Sheikh Mashal was asked about the greatest thing he heard and saw of the rare stances of the brave, so he answered saying: The most wonderful and important scene he saw in his life is the bravery of a knight from the knights of the Anazah tribe.. Sheikh Mashal continues in his talk according to the narrator's account until he said: We were raiders from our tribe \"i.e. Shammar tribe\" led by the late Abdul Karim Al Jarba, intending to raid the Anazah tribe, so we found camels herded by a girl, so we seized them, believing that they were an easy bite, and the look of the girl specialized in herding camels drew our attention, for she was looking at us with a look of mockery, or recklessness, and we did not think that behind her look was what was behind it of a buried secret. We had not covered a not far distance until a knight caught up with us alone and when he approached us he asked us for \"Al-Hadhiyah\" i.e. the gift as is the custom followed in such a case, for the seizing one according to the followed custom must give from his booty. Mashal says: We did not hesitate to give him two she-camels, thinking that was enough for him, but he returned and asked for \"Al-Hadhiyah\" a second time so we gave him two she-camels as well, then he returned a third time and asked, so we gave him a similar number, then he returned a fourth time asking for \"Al-Hadhiyah\" but in a tone suggesting that he was not begging, as it seemed to us from the first glance in his previous request, but rather this time he was challenging, and therefore six of our knights came out to fight him while we drove the camels we seized, so he remained for a while wrestling with the knights between attack and retreat, and after that our companions' mares caught up with us empty of their saddles from their knights whom this knight exterminated. So we had no choice but to bring out knights more in number than the previous ones while the rest of us continued driving the camels, and as soon as we took a period, the mares of our people caught up with us whose fate was like the fate of their predecessors. The result was that the knight terrified us and cast fear into the heart of each of us, so we fled leaving him his camels, seizing safety after he killed youths from the best of our knights. After, I found Mr. Al-Jundi the narrator of the story amazed at the heroism performed by the knight, and although it is truly a supernatural heroism, but he is amazed and admiring at the same time at the late Mashal Al Jarba's admission of his enemy's bravery. But I personally did not find that strange by virtue of my firm knowledge of Arab morals. News of Abdul Karim and Farhan will come at the end of this chapter. Abdul Karim died hanged, hanged by the Turks around the year 1265 AH. Among those who cared to praise Abdul Karim is Fajhan Al-Farawi, so from that is his M-rhymed poem. Muhammad bin Yahyan, may Allah have mercy on him, told me it and I do not record the text of his wording and Rudayman bin Husain Al-Shammari dictated it to me, and Ibn Bulaihid published two verses from it, and Sheikh Mandil cited it in his book he said it when he went to Abdul Karim Al Jarba, after his hesitation between Abu Bandar Talal bin Abdullah bin Rashid and the son of Imam Abdullah Al-Faisal: Fajhan Al-Farawi said: I took for myself between the two a pause ... Between \"Abu Bandar\" and \"Son of the Imam\". After them we take on the camels a rush ... To the lands of the smiling faces the noble. To witness \"Al Jarban\" is a duty and pilgrimage ... From among the builders of hair and tents. As for generosity a clamor and noise ... No one rivals them south and north. My destination is my arrival place when I head ... Abdul Karim the lion the goal of my aim. How many a one came from far marching ... Wants to see you O far of mark. And how many a time he left on the opponent a dust ... With leopards dragging it like the middle of darkness. You find in the heart of who opposes him a shake ... From fear of him sleep is forbidden to him. And spears widening in the backs gaps ... And the sharp backs that cut bones. On fillies terrorizing the heart their dust ... Knights drudging the enemy in the crowd.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 40
  },
  {
    "serial_number": "6207503",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "My last speech to \"Abu Khawdhah\" directed ... The bank of the Euphrates if thirst drives you. O Allah O Governor of Destinies save him ... Since he is generous and from inheritances of nobles. Then his poem which Rudayman bin Husain dictated to me and mentioned that Al-Farawi said it after his return from Al Jarba and Sheikh Mandil published it in his book. Fajhan said referring to Abdul Karim Al Jarba giving him a mare: My stories with the brave ones are novel ... Not nonsense returning to nothing. My heart loves the fluttering of the strap ... Sleep of the open to me is strikes and bed. I brought the horse and brought \"Hadba\" lush Solid hooves from the mounts of \"Al-Abwash\". I am not facing it like the color of a carcass ... If a raider goes I went a traveler. Sheikh Al-Asi Among the prominent notables of Al Jarba is Abu Al-Hadi Sheikh Al-Asi from Al-Jaz'ah and he is the Sheikh of all Shammar in the Jazira. I found in handwritten notebooks of Sheikh Prince Ahmad bin Muhammad Al-Sudairi in which he collected war songs of horses news related to Al-Asi, and his son Al-Hadi, so I copied them here. Prince Al-Sudairi had entrusted me with explaining his book so I finished the first part, and when he died, may Allah have mercy on him, his son Mish'al retrieved the originals of the book from me, with what was explained of it, and I do not know what happened to those precious volumes. Among their news is what relates to the dispute between them and Al-Thabit, and Prince Al-Sudairi, may Allah have mercy on him, clarified the cause of hostility between Al-Hadi and Al-Thabit, mentioning that Al-Arjani Al-Arifi Al-Zafiri was a neighbor to Munawir bin Suqi Sheikh of Al-Afarit from Abda of Shammar, then he left them and returned after seven years, but before reaching Munawir, Al-Hadi raided him and looted two herds from him. Munawir apologized for not aiding Al-Arjani, because he was his neighbor seven years ago, but Al-Arjani insisted on his help and aroused his chivalry, and argued that Al-Hadi took him while he was on his way to neighborhood, so chivalry aroused in Munawir's head, and he went to seek help from Mut'ib Al-Hadab, and his group Al-Thabit. Mut'ib rode to his aid with sixty horsemen and descended on Al-Hadi interceding for Al-Arjani's two herds, but Al-Hadi refused his mediation. Al-Hadab rode his steed angry, so Al-Hadi called him mocking: In front of you are the red ones \"meaning his she-camels\"! With this sentence he challenges them to take his she-camels. So Al-Hadab and his group lined up in two rows singing this war song by a poet from Al-Thabit: We are the people of the mutilated and sure ... If they turned back and came with us. We are your shelter from the north ... And all the warring are beside us. O who asks our Sheikh ... O our group what is our sin. And they passed by Al-Hadi's red camels, and seized them. So Al-Hadi asked for his steed, and called his group, so his father Al-Asi hastened to order tying his son Al-Hadi, and putting iron in his hands and feet, as he ordered returning Al-Arjani's two herds to Al-Hadab, with a group from Al-Kharsa and in return Al-Hadab returned Al-Hadi's camels. As for Al-Hadi, he fainted from anger. From this incident the fire of enmity ignited between the two parties, and during the battles between them Al-Hadi was killed, killed by Fahd bin Shukhayr Al-Wudaihi grandson of the poet Basri Al-Wudaihi, and Fahd fled from the island of Iraq and took refuge with Ibn Muhaid in Syria, and remained with him until he died. For this reason Al-Asi expelled his cousins Al-Thabit and Al-Fadaghah, from the island of Iraq, so these two tribes took refuge with Dana Majid from Al-Fid'an, and formed a force for themselves, then they traveled as guests to Al-Asi, and reconciled except that Al-Asi excluded Al-Wadhhan from them, the direct killers of Al-Hadi, and they are still evacuees with Al-Fid'an until now. Perhaps before this circumstance Fahd bin Shukhayr said his poem addressing Al Jarba. Fahd said - as in Prince Al-Sudairi's notebooks -: They said: Visit I said I am not visiting ... The visit of the thick-handed suffices me. Except if the Sheikh says visit and visit And gives me what is like the neck of the gazelle. If I do not kill Daham or the Prince ... Prohibited to me are the wearers of iron.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 41
  },
  {
    "serial_number": "6207504",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Dali Al-Wamir, Sheikh of Al-Kharsa from Dana Majid from Al-Fid'an from Anazah replied to him: O rider of the one the young camel did not suckle Red, the lock folded it after the running. O its rider convey my greeting to Shukhayr ... Who started with the Sheikh a new rhyme. Your father before you did not kill every good one ... Except the poems nothing praiseworthy was mentioned in him. We ride on the like of the flying pigeons Treading iron and the dress of their people is iron. How many a good one fell in their throats ... Upon him the black beasts of prey feast. Daham Sheikh of the people is not small ... His difference over you O Al-Wudaihi is far. I found in Prince Al-Sudairi's notebooks, may Allah have mercy on him, this war song by a chanter from Al-Thabit from Shammar confirming the killing of Al-Hadi Al Jarba: O who looks for the judgment ... Ask and we are his guess. The lion of the wild stood over him ... And the lion eats his kidney. Al-Asi said several war songs eulogizing his son Al-Hadi, from that is his saying: Mercied O dead of ours ... Mentioned to us under the soil O Al-Hadi. I wish you rise ... And see after you what happened. Munawir asks for milk ... Wants from the red ones ten. He said addressing Al-Hadab Sheikh of Al-Thabit after they killed his son Al-Hadi: O groan I groaned it ... From my conscience O Abu Ali. O curse the father of ... Al-Hadab ... Were it not for the bad one he would blame me. Al-Hadi said eulogizing his son Al-Hadi: O Al-Hadi I do not forget your tear ... Unless the camel forgets the roaring. After losing your squadron ... The world after you turns. How many fell from your spear ... A head with the squadron big. Abdul Jabbar Al-Rawi mentioned that Al-Hadi took over the Sheikhdom of Al Jarban after his father aged so his cousin Jarallah's children competed with him, so Al-Asi said encouraging his son Al-Hadi: For you is a home a meadow of bliss ... Mut'ib and Al-Sayb want it. The Sheikh like you does not sleep ... Tires on cooling it. Al-Hadi said addressing his father: I know it before you say ... A girl arranging her feast. A breaker with the black iron ... In the jaws of who wants it. He said addressing his son Al-Hadi: O Al-Hadi your Lord deluded you ... They went on the pulse of the dust. The son of Al-Zafiri ignored them ... A free falcon took charge of chickens. Al-Asi said: O Al-Hadi this is my guess ... Not the guess of a stepping boy. See your group are the youth of Yemen ... They are not a gathering from a country. O Al-Hadi O bird of the attack ... Whoever came in your face is happy. He said about his eldest son: O offspring I lost it ... Except the brother of Shahah corruption. In it Al-Zu'aili and Al-Dawish ... And Udayb his mother's uncle sure. He said about his son Hadi from the Mas-hub melody: O bird O whose den is in the tall one ... In Al-Mistawi between Abanat and Sawaj. Does not kill except every big mottled one Bird of happiness always on the game disturbing. Al-Asi said urging his grandson Daham: I left all my children ... And called you O son of my son. A den of free ones from free ones ... Preserved and your root is not bad. I left for Abda twice ... And the third for Ibn Jadi. Beware, pay attention do not sleep ... Be aware of your right lest it be lost. Al-Asi said addressing his grandson Daham bin Al-Hadi:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 42
  },
  {
    "serial_number": "6207505",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "O Daham Abda went west ... Sit gird yourself do not sleep. They counted with the arranger of his forelock ... Al-Hadi leader of the herds. Aqil Al-Yawar before assuming the Sheikhdom, used to raid frequently and success accompanied him, so he distributed spoils to the houses of Shammar, so Al-Asi feared the transfer of leadership to him and its snatching from his son, so he said urging his son Hakim to take the leadership and it is from the Huda melody: Whoever wants to drink milk ... Let him descend on Al-Yawar Aqil. Every day he takes for himself Arabs ... Signaling to Shammar with the hem. Struggler O stepping boy ... Gathering money of the noise. Prince Al-Sudairi, may Allah have mercy on him, mentioned that the tribes of Al-Thabit and Al-Fadaghah from Sinjara sought help from the Pasha for a while, so they raided Al-Asi, and took his camels Hubub so Al-Asi said: Hubub is mentioned with them ... A milk camel for people of a spear. We must take its revenge ... In a day terrifying the nursing mothers. Its return is obligatory upon us ... An obligation like the obligation of prayer. Al-Asi said on this occasion: Hubub wants a summer resort for it ... Move away from its atmosphere. Move away O people of the spear ... And the war we light its fire. A chanter from Sinjara said replying to Al-Asi: O Al-Asi O big head ... You want the brave deeds just now. Hubub wants for it a morning ... Walking and glaring at its calf. Prince Al-Sudairi, may Allah have mercy on him, mentioned that Mut'ib Al-Hadab Sheikh of Al-Thabit took refuge with Ibrahim Pasha. Ibrahim Pasha is originally from Al-Ruwalah, and lived in Iraq, and a group of Arabs gathered around him so he made truce with the Turks and they granted him the title \"Pasha\". Al-Asi said on this occasion: O messenger towards Al-Hadab ... From behind a planet he turns. After the dwelling of joy ... He descends on Khansa short. O pity O lion of the side ... Sits with no consultant. Al-Asi said replying to Khaz'al one of the slaves of Shammar: O slave we are not upon you ... Upon Jarallah and a father. And your soldiers I subdued them with the sword ... Today and days after. Al-Asi said: Your grandfather to his ancestors is an opponent ... Pot-like, does not tolerate distress. A cloak did not cover you in Barqa ... Your rise is far in Al-Hamad. In you Al-Zu'aili and Al-Dawish ... And Udayb your mother's uncle sure. Al-Sudairi said: A disagreement occurred between Al-Asi and Mutni Al-Sadid Sheikh of Al-Sayih, so Al Jarallah from Al Jarba joined Al-Sadid, and Ibn Hassan Sheikh of Al-Aslam joined Al-Asi although he is counted from Al-Sadid. Al-Asi said on this occasion: The son of the belted Jad'an accompanied him ... Every day he slaps Arabs for him. The war erupted and brave ones were killed in it ... And today the brother of Shahah fought. Prince Al-Sudairi, may Allah have mercy on him, said: Al-Thabit were at Al-Asi's for food and he had reconciled with them after they killed his son Al-Hadi, and Al-Asi wanted to frighten them without breaking the covenant of his guests, so Al-Asi put this war song on the tongue of some of his companions, and ordered him to recite it after food in a loud voice: O Al-Asi cut their heads ... For the eyes of the one who rode the litter. Al-Hadi is left in Al-Mahas ... And the eyelid did not blink happy. Al-Asi said addressing Ubaid bin Shuraib: O Ubaid where are the first ones ... Those whose consultation is strong? Those who close the ambush ... And their stabs in their chests. If you obeyed my advice O living ones ... We put you in their graves. Abu Abd al-Rahman said: In another place of Prince Al-Sudairi's notebooks he attributed this war song to a chanter from Anazah with this formula:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 43
  },
  {
    "serial_number": "6207506",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "O Zaid where are the first ones ... Those whose consultation is strong? Confronters of the face of the ambush ... And their stabs in their chests. Ubaid bin Shuraib Al-Shammari was sharp-tongued, inciting tribes to take revenge, and he asked for Aqil Al-Yawar's neighborhood, so Aqil stipulated that he stop stirring up sedition, on condition that he gives him any salary he wants. Ubaid said addressing Aqil: Aqil my speech is silver and gold ... I do not say speech that is weak. The rule as long as it is for Banu Uthman ... The rule belongs to the Creator it stops. And the rule before you Sultan removed it ... He went stripped having no follower. And the brothers of Noura left Barzan ... And the House Al-Sharif left it. In another place of Al-Sudairi's notebooks the narration appeared like this: Aqil my speech is silver and coral ... And we did not speak the speech of the weak. And the sisters of Noura left Barzan ... ......................etc. Once - as Prince Al-Sudairi mentioned - Al Jarban were preparing to raid Barhah Pasha, and this Barhah is from Al-Kawakibah from Al-Ruwalah who settled in Iraq, and led a number of tribes, and the state gave him the title of Pasha to secure his side, and benefit from his influence in subjugating the Bedouins. When Ubaid bin Shuraib felt the march of Al Jarban he asked them to permit him to go to his family at Barhah's, and his intention was to warn Barhah because he is a friend of his, so they permitted him after taking covenants and charters from him to conceal the news, and it was hard for Ubaid to break his covenant so he said this war song riddling: Allah from a snake that crept ... Between my dress and my shout. I read a Maghribi reading ... And no one understood my reading. My affliction did not come from far ... My affliction is in my group. I cannot reveal its secret ... The wall of my building would collapse. Despite repeating this war song, Barhah's group did not understand it until after Al Jarban defeated them a severe defeat. Prince Muhammad Al-Sudairi, may Allah have mercy on him, narrated that the government of Turkey in Iraq sent a squadron searching for Al-Asi, so he took refuge with his brother, and hid in a lote tree next to the house, and asked his brother to delude them that he is the Prince until Al-Asi fled. When the matter was revealed the squadron returned without avail, so Ubaid bin Shuraib said mocking Al-Asi: The forwarding of Al-Asi to his brother ... A strong bottle for his cat. It attacked a grammar he bought ... Fat and flour it touched. It climbed on the fat bag ... Passed it and touched it. What a pity O Sheikh of the herds ... \"A chapter\" from his house forgot him. He took refuge on the lote tree behind him ... The thorn of the long one pierced him. Al-Asi said: Justice tore his dress a tunic ... And tears filled her eyes. We wait for Dana Subhi to come ... And honor they do not throw it. Al-Asi said: I do not want the war of the leaning one ... A young boy and his weapon is a spear. We wait for Dana Subhi to come ... People of the vague armors. Al-Asi said: O nose say to the aggressor ... Wounds if you forgot. He waits and we take our revenge ... The morning is not like the night. From above honored horses ... From above them I sold and bought. Al-Asi said: From the turn of Salem and the Sharif ... We are not soft to the harsh. We are like the cheat of Iraq ... We catch up over the length of time. Al-Asi said: The banner is the banner of Al-Darat ... And today our banner reached. The strength is the strength of Abu Aqil ... And my strength from the knee reached. Last year my drink was milk ... And today my food is onions.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 44
  },
  {
    "serial_number": "6207507",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "After my riding the thoroughbred ... Today my mount is lean. Al-Asi said: What a pity my bird was lost ... I lost in the days of release. At Al-Khulaibis his guess ... Or the people of Al-Jad'a sure. Al-Asi said: O messenger towards Al-Fid'an ... Its decreed is not prevented. And horses of Al-Sayafa that you say ... Oh how often you resorted to their chests. From the turn of Salem and the Sharif ... The horses we are their light. Al-Asi said praising Muslat bin Mulhim Sheikh of Al-Jubur, because he helped him in his wars with Al-Thabit: Abu Shibl led the wars ... He did not circulate the goods from us. The Sheikh is the glory of relatives Were it not for him by Allah we would not have lived. Al-Asi said: You became for Ibn Haima? Lean ... Be driven away may you go to destruction. There is no boy who pays attention to him ... He fills him in the aorta with an injury. Al-Asi said: The blond of little tail tortured you ... And seduced you the undoer of the curl. The daughter of the bad one do not take her ... She brings you a son like his father. Al-Hadi said: From the turn of Salem and the Sharif ... O Mut'ib and you are our right. The Sayhi brought his affliction ... From the Jazira he repelled us. Prince Al-Sudairi cited this war song in another place of his notebooks attributed to Al-Asi with this wording: O Mut'ib and you are our glory. Al-Rawi said: This is the tribe of Shammar Al-Jarabah in Iraq, the banner of Sheikhdom in it was tied to Al-Hadi while his father Al-Asi was alive, and to Aqil Al-Yawar while his father Abdul Aziz was alive. Abu Abd al-Rahman said: He is Aqil bin Abdul Aziz bin Farhan Ibn Safouk bin Faris bin Muhammad bin Salim Al Jarba. He died in the year 1940 AD and the leadership is still in his offspring on November 14. Among the news of Al Jarban whose time I do not verify is an incident recorded by one of the poets of Shammar in the Jazira Ali bin Sarihan reported by Fahd Al-Marik, may Allah have mercy on him, and mentioned that it is in eulogy of Zahir Al Jarba whom his cousin Fahd Al Jarba killed: By Allah upon you by your face O she-camel ... Do not cut the hearts of people ringing. You lost a young camel like Buji ... Who if he entered the sale for twenty. And I lost Zahir wide of tracks ... Who in his house the poor are satisfied. Khuraisat? Above the horses like towers ... On the ambush and the dear life loosening. Al-Marik mentioned that the representatives of the Shammar Al-Furat tribe are from the Al Jarban family in both the Syrian and Iraqi parliaments when there is an election in the two countries. Al-Marik mentioned what relates to Zaid bin Amr Al Jarba who migrated with some of his group from the Euphrates to the Turkish lands adjacent to the Syrian borders in the year 1350 AH. About one of the battles of Shammar and Anazah, Muwaidi Al-Baraziyah said boasting of the bravery of her people Al-Mutran: And they stopped with Al Jarban like the dust ... And the Sheikh was hit by a hammer that split his jaws. Influence of Al Jarba in Iraq. About the influence of Al Jarba in Iraq, Kahhalah said quoting Jones: Jarbat Shammar is one of the tribes of Iraq whose influence extended to the northern land between the two rivers from north of Sinjara and the Khabur river to Saqlawiya west of Baghdad and sometimes to Al-Hayy. James Felix Jones described this tribe in the year 1853 AD saying: They represent terror for the Turkish authorities and for the residents, and they live in the wilderness and wastelands, and in areas that seem uninhabited, and the authorities do not wish to acquire them, as they launch from them in raiding acts looting everything their hands reach, until they reach the gates of the city in Baghdad. When the Turkish authorities failed to repel them, they finally agreed to pay their leader a monthly salary to ensure his loyalty, and despite that agreement, small looting and robbery occurred sometimes. Abdul Jabbar Al-Rawi said:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 45
  },
  {
    "serial_number": "6207508",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "The Ottoman government, over the extent of its authority and the area of the country it managed, did not have any significant control over the desert. Throughout this rule, for example, you would see the Shammar tribes moving in the Jazira between Khabur, Tigris, and Euphrates. All the authorities did at that time was to appoint two Sheikhs, one \"Badawah\" (Bedouin) who travels with his tribe and moves with them, and the other \"Madinah\" (City) whose center is between Baghdad and Mosul, thus being close to the authorities to help them with Bedouin administration. The first is elected from the brave, generous Sheikhs successful in raiding, while the other is from those of prestige and gentle disposition. But the condition in both is that both Sheikhs must be from Al Muhammad because they are the house of Sheikhdom, and the house of Sheikhdom is restricted to Al Muhammad, and this is what we detailed in the second part of this book. The reason for this is that most people of Mosul and Baghdad know Al Muhammad, Sheikhs of Shammar Al Jarba, and they are the children of Farhan Pasha. The Ottoman government often got angry at them, or threatened them. It happened once, as I noted in another chapter, that one of the governors got angry at one of the Sheikhs and wrote him a threatening letter, concluding it with the saying of Ibn Al-Wardi: Avoid the Sultan and beware his tyranny ... Do not quarrel with one who if he says he does. So the Sheikh answered him seeking his sympathy, repeating in the conclusion of his letter to him his saying: Avoid the Sultan and beware his tyranny ... Do not quarrel with one who if he packs up he leaves. The Ottoman rule did not limit itself to taking the path of Sheikhdom as a means of control, but it established fortresses for soldiers to be a center of power to impose influence from which large forces march from time to time. This is what happened on the day a large campaign marched from those places against Shammar when its Sheikh Abdul Karim Al Jarba spread corruption in the Mosul region, so it arrested him and hanged him at the head of the Mosul bridge. The aggression of Shammar and its Sheikh on Mosul was known at that time as \"Kharab Abdul Karim\" (Ruin of Abdul Karim), and that goes back to about one hundred and thirty years ago. We must mention in this regard that Mosul suffered ruin at the hands of two, one of them Abdul Karim Al Jarba in the past, and the second Abdul Karim Qasim recently, and they are of one name with different surnames. Despite the means followed by the Ottoman rule, the Shammar tribes continued to raid the Anazah tribes, especially in Al-Shamiya, causing chaos and aggression against villages and roads passed by the raid, and the crossings crossed from on the Euphrates river. I still remember the days of childhood in Rawa those many raids and how the long spears filled its valley, as the Bedouins used the crossings and fords in Rawa and its neighborhood as a theater for them. I still remember the names of the brave men who were mentioned who used to lead the raid and the competition between them, especially from the Sheikhdom family like Munif, Nayef, and Nawwaf sons of Jarallah and Al-Hadi bin Al-Asi, who were competing for the Sheikhdom in the Jazira, until the matter reached the point of fighting and assassinating each other. Fathers at that time used to encourage their children to take over the Sheikhdom and urge them to it. Al-Asi used to repeat to his son Al-Hadi: The Sheikh like you does not sleep ... Strives to cool it. Just as he used to praise him over his brothers by saying: \"O offspring after Abu Shahah corruption\". The situation continued between the Bedouin tribes raiding each other, and they fulfill by that their pride in their customs which Islam came 1390 years ago and fought and denounced and considered pre-Islamic tribalism, but that did not have any effect on the Bedouins. It is narrated that Farhan Pasha passed one day by a village called \"Al-Mushahada\" and saw its men with filled bodies and huge statures, so he asked them: Do you raid? They said to him: No, for we cannot raid, and we did not take raiding as a craft. He said to them: Raid those who are weaker (atqa') than you. He said: As for the north in the Mosul region, a banner was formed for the Sheikh of Shammar Daham Al-Hadi, but this banner was not destined for success. After the establishment of the civil rule, the government formed a banner in the north for the Sheikh of Shammar Sheikh Aqil Al-Yawar, who was newly elected. He did not accept that his banner be under the command of a British officer, so the government chose the author of this book as a commander for this banner in 20/2/1922.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 46
  },
  {
    "serial_number": "6207509",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "He said: As for the Jazira ruled by the Shammar tribes, they relied on Sheikh Daham Al Jarba, head of the Shammar tribes in the north in the Jazira and near Mosul. Through him and the Sheikh of Anazah, British armored vehicles began patrolling the Jazira and Al-Shamiya at all times in complete safety, until the movement of these armored vehicles became a mark in the land they traverse. The Bedouins and everyone crossing the desert see the tracks of the armored vehicles clearly, especially in the spring days when the land turns green, except for the tracks of their wheels which do not turn green, so it appears to the viewer like a railway. They appointed for each banner of these banners composed of two hundred camel riders a British commander, assisted by officers from tribal chiefs as is in the Dulaim banner. The banner formed in the Jazira under Sheikh Daham failed in its mission and was cancelled before the establishment of the Iraqi government. When Prince Faisal presided, he turned to appointing Sheikh Aqil Al-Yawar, cousin of Sheikh Daham, as Sheikh of the Sheikhs of Shammar, and forming a banner for him, due to his good reputation among the tribes and among the nationalists because he was helpful to the revolutionaries. He ordered one of the officers of the Iraqi revolution in Hijaz and Syria, Mr. Tahsin Ali, to accompany Sheikh Aqil Al-Yawar to Baghdad. So he went to him in the Shammar encampments and accompanied him to Baghdad. After deliberations and memoranda, the Iraqi government decided to appoint him Sheikh of the Sheikhs of Shammar. I learned that those deliberations and consultations were taking place between the Court and the British High Commissioner's office, as the Court wanted Sheikh Aqil Al-Yawar to be the Sheikh, and the High Commissioner's office wanted Daham, grandson of Al-Asi, to be Sheikh considering that the Sheikhdom was and still is in the house of Al-Asi. Against this view, King Faisal held to his opinion considering that Sheikh Al-Asi was staying in the Ramilan location inside Turkish territory, and that he does not mind giving the Sheikhdom to Al-Asi's grandson if his grandfather Al-Asi leaves his home and descends into Iraqi territory. When this was requested from Daham and he failed to persuade his grandfather to descend into Iraqi territory, the High Commissioner was forced to agree with King Faisal on appointing Sheikh Aqil Al-Yawar as Sheikh of the Sheikhs of Shammar and forming a banner for him of two hundred camel riders. It was also decided to appoint Captain Lauder, the British, as commander of this banner which was known as the Northern Camel Corps. I learned finally that Sheikh Aqil Al-Yawar, when he knew of the appointment of Captain Lauder for this banner, requested the Court and the Ministry of Interior not to form this force, because he does not agree that there be among the Shammar tribes a force commanded by a British officer. After memoranda and deliberations between the Court and the Ministry of Interior, it was decided to appoint an Iraqi officer to command this force instead of the British officer. The choice fell on the writer of these lines to be commander of this force, and I was appointed assistant to the Camel Corps police in Mosul on 20/2/1922. The Jazira was under the control of the heads of Shammar Al Jarba, and this control extended to the villages of Mosul connected to the Jazira, and included everyone traveling in the Jazira of commercial caravans including sheep taken by merchants to Syria and other trade goods whatever their type. Except that this control does not reach the extent of looting and taking money, but rather money passes safely if the fees decided by the heads of Shammar are paid for it to their specialized owners. These fees are known in the Jazira and among its tribes and those who take the Jazira road as \"Al-Khuwwah\". Thus the heads of Shammar Al Jarba were spreading their control when the Camel Corps was formed. For the Sheikhs of Shammar Al Muhammad, each one of them is considered a Sheikh, although they respect and obey the Sheikh appointed by the government. For quite some time the Sheikhdom was in the house of Al-Asi, uncle of Aqil Al-Yawar, and the people of this house are nicknamed Al-Jaz'ah after the name of their mother. As for Ajil and his father, they are known as Al-Durrah, the name of their mother also, where the Shammar tribes, especially Al-Kharsa among them, were inclined to Al-Asi. As for the Abda clans, especially those who migrated from Najd to Iraq after the fall of the Emirate of Al Rashid among them, they incline to the new Sheikh, Sheikh Aqil Al-Yawar. When Sheikh Aqil was installed as Sheikh, Al-Asi was staying in the Ramilan location inside the Turkish borders near Nusaybin. All Shammar tribes were optimistic about this new event, and the thing they considered a new event was forming a Camel Corps in the Sheikh's encampments with huge allocations they were not accustomed to, because they were content with the fees they took in the name of Al-Khuwwah, and they are",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 47
  },
  {
    "serial_number": "6207510",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "holding on to it very strongly, and their sayer says \"Cutting noses but not cutting fees\". Therefore we see a new spirit crept into them and into the desert and unusual activity because they hastened to join the Camel Corps and cooperate with the new Sheikh. How could activity not creep into them with this new event, when they had not seen an employee or officer? Rather they do not know higher than the rank of Corporal, so much so that Abdul Aziz Al-Farhan, father of Sheikh Aqil, when he visited the police director Mr. Tahsin Ali, said to him when bidding him farewell thanking him \"May Allah promote you and make you a Sergeant (Shawish)!\" He said: \"May Allah replace it for you!\". Every Sheikh of the Sheikhs of Shammar Al Jarba has a group of slaves he relies on as an armed force. Among them Sheikh Aqil Al-Yawar had a group of good, nay excellent slaves he relies on not using force only, but in calamities as well. I tested them and found many of them possessing sound opinion. The Sheikh used to treat them well, calling them family and sons, and they reciprocate with respect and sincerity. I still remember that most of them belong to three families: holding on to it very strongly, and their sayer says \"Cutting noses but not cutting fees\". Therefore we see a new spirit crept into them and into the desert and unusual activity because they hastened to join the Camel Corps and cooperate with the new Sheikh. How could activity not creep into them with this new event, when they had not seen an employee or officer? Rather they do not know higher than the rank of Corporal, so much so that Abdul Aziz Al-Farhan, father of Sheikh Aqil, when he visited the police director Mr. Tahsin Ali, said to him when bidding him farewell thanking him \"May Allah promote you and make you a Sergeant (Shawish)!\" He said: \"May Allah replace it for you!\". Every Sheikh of the Sheikhs of Shammar Al Jarba has a group of slaves he relies on as an armed force. Among them Sheikh Aqil Al-Yawar had a group of good, nay excellent slaves he relies on not using force only, but in calamities as well. I tested them and found many of them possessing sound opinion. The Sheikh used to treat them well, calling them family and sons, and they reciprocate with respect and sincerity. I still remember that most of them belong to three families: 1 - Al Uwaid, and they assist him in managing the guesthouse and consultation regarding that. 2 - Al Warridah, and they assist him in correspondence.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 48
  },
  {
    "serial_number": "6207511",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "3 - Al Jaffal, and they are famous for guidance, i.e., knowing lands and roads. The most famous man I saw among them is Dhiyab Al-Jaffal, and I accompanied him in some travels. He said to me: Do you want an easy road to walk you in? Or one with trees or one with stones \"Radm\"? In any case, these slaves were his original force. When the Camel Corps force was formed, these slaves amounted to armed men and became part of the Camel Corps force. After completing the formation of the force, the Jazira became a house of safety, and raiding was completely eliminated. The Camel Corps force from the administrative, disciplinary, training, equipment and armament aspects was under the command of the Camel Corps commander, the assistant police director and his knowledge. As for receiving salaries and distributing them, it was with the knowledge of Sheikh Aqil Al-Yawar. This force is considered \"Camel Corps Assistance\" affiliated to the police director of Mosul Brigade, except that its permanent center is in the dwelling where the Sheikh of Sheikhs of Shammar stays. The center at its formation was in the location called \"Ikhdairwat\" near the village of Al-Ibrahimiyah belonging to Tal Afar district. The Sheikh and his force used to move from one place to another between this famous archaeological site known as \"Al-Hadr\" in the Jazira. When the central force was formed in Al-Hadr, the headquarters of the Camel Corps and the Shammar Sheikhdom became in Al-Hadr, until it was moved from there to the police assistance of Mosul district. The Sheikh of Sheikhs of Shammar Aqil Al-Yawar was tall, handsome in appearance and character, beloved, of good reputation before becoming Sheikh. He was successful when he led the raid, and was good in distributing spoils, and this earned him among the tribes, especially among Shammar, a good reputation. As for his luck, as it appeared, he was successful when he led the raid, and appeared with better success when he became Sheikh where complaints accumulate from Shammar's aggressions on the villages of Mosul and travelers to the \"District Commissioners\" (Qaim Maqams), especially the commissioners of Tal Afar and Sinjar, and to the Governor of Mosul and the British Administrative Inspector, until the matter devolves to referring to the Ministry in Baghdad, and orders are issued to stop paying the allocations of the Sheikh who travels after that to Mosul and confronts the Governor and the Administrative Inspector. The result of this confrontation is the cancellation of orders stopping the payment of allocations. Naturally, this indicates his tact, good conduct in speech, and favor. Thus he was successful throughout his life, may Allah have mercy on him, while he was illiterate, neither reading nor writing, he strove until he learned to sign his signature by hand in writing. The Bedouins, although in their desert far from cities and civilization, understand the situation of the government and rulers and the influence of the English in Iraqi politics. This Sheikh Aqil Al-Yawar who refused that the commander of his banner be a British officer, the Bedouins believed that had he not agreed with the English he would not have become a Sheikh, as appears from the poem of the Bedouin poet known as Ibn Dukhi in which he praised Aqil Al-Yawar when he became Sheikh, and said in his praise in the beginning of the poem: I just met the dark one ... A lion following his squadron. O Daham, Aqil became Yawar for us ... From London his rank came to us. Al-Rawi said about Farhan: There is no harm in citing here an interesting story about Farhan Pasha the supreme grandfather of the current Sheikhs of Shammar Al Jarba, indicating to us the entrenched nature of the custom of raiding in the souls of Bedouins in the near generation. The narration says that Farhan Pasha went one day to the village of Al-Mushahada near Al-Kadhimiya \"one of the suburbs of Baghdad\" and saw its inhabitants of huge bodies, so he asked them: Do you raid? They said: No, for we cannot raid, and we did not take raiding as a craft. So he said to them: Raid those who are weaker (atqa') than you, meaning weaker than you. Hamad Al-Sharabi said praising Al Jarba in the Jazira: My father before me descending for him in a meadow ... And I headed for the destroyers of groups. I found in Sheikh Mandil's notebooks this poem by Manukh Al-Ghuwairi addressing Al-Suwait and defending Al Jarba and its leader Bunayyah, on the occasion of camels taken from Al Jarban: O rider of a free one clapping its hands ... From the offspring of Farhah straight of hands is its foal. As if when it leaned with a step of the fold ... A torrent descended with the edge of a head of a hill. Your destination is Mani' the refuge of the shepherd of the mount ... The old man whose every grey hair is his choice. Taking the cattle is not a disgrace on us ... The shame is with the one dragged over his fire. Seek your forbidden one at the wolf of the squadron ... The sword of Al-Sa'idi engaging in his spine. See your life O Suwaiti is deplorable ... It is no longer worth with you a quarter of a para. The herd is with the squadron of Zawba' ... Throwers of the clothes in the face of the attack. Horses led by your friend Bunayyah ... His answer opposes the riflemen a sign. 5 - Texts of Al-Azzawi in Asha'ir Al-Iraq. Al-Sayih from Shammar: Al-Azzawi said about Al-Sayih: These tribes, this name was not what gathered them, but it is in reality a new name applied to a group of Shammar tribes that had followed Al-Sadid when he fought Al Jarba or disputed with them. So whoever sided with Al-Sadid, or followed him and answered his call was called Al-Sa'ih (The Shouter), and whoever leaned to Al Jarba and followed its heads was counted from Al Jarba. Disputes were ignited between them so they did not want to submit to the demands of Al Jarba while fundamentally Al-Sadid is from them. Examples of that: If you come to Abu Farhan say to him we crossed ... Jazaa'a we do not let the honor be trodden. And if Al-Arwam all ride on our trace ... We must O Safouk shake the head. And we on the war of your ancestors were patient ... It is not from you and coming O wolf of the ropes. Before \"Al-Jazira\" when \"Najd\" was our homes ... And our dead in it chase on mares. O Safouk by Allah we do not leave our intoxication Unless \"Al-Jazira\" is empty there are no people in it. If the belt is a span we measured ... Throwing the armored from old is a base for us. Al Muhammad. Al-Azzawi said about Al Muhammad: I say nothing about them except what Ibn Uthaymir from Al-Tuman said: Whoever argues with them is a lying pretender ... You travel and find in their traces traces. With stabs like flowing streams ... And cheapness of food when it has guards. Another said in a poem praising Faris bin Abdul Karim: The children of Al Muhammad are like the chicks of wolves Or jewels, expensive in prices. Al Jarba. Al-Azzawi said Al Jarba is a nickname that reached them from their mother, and Arabs still use such nicknames. It is said she was afflicted with a \"skin disease\" so her family left her and moved to another home then she recovered so this name stuck to her. It is the custom of Bedouins to leave the one afflicted with smallpox and similar diseases and move away from him until he recovers or dies to get rid of his infection, and watch him from afar and place for him what he needs of food and drink. Her tribe as is known, is preserved and it is from Al Fudul from Tayy \"from Bani Lam\". He said: This naming is old going back to their first prince Muhammad by whom they are called, so it is said \"Al Muhammad\". And this Al Jarba is the mother of Salim bin Muhammad the mentioned which is also preserved but they were not certain of the correctness of its date due to the length of time. These, it is not true what some Arabs used to spread about them that they are from the Sharifs, or from the Barmakids so it stuck in the minds of some of them. Ibn Khaldun transmitted that in his history and denied it. They are from Tayy as Al-Haidari said their kinsmen? From Al Muhammad from Tayy. This is supported by what the author of \"Matali' Al-Su'ud\" Uthman bin Sanad said, and I heard Bunayyah attributing himself to Tayy the known tribe. The author of \"Qalb Jazirat Al-Arab\" mentioned that Al Jarba is from the Sinjara tribe, and its branches to Al-Amud and Al Jarba and clarified that from Al Jarba are Al Hariz, Al-Hasana and Al-Buraij. What is transmitted from them is that Sinjara is a Zawba'i tribe going back to Al-Harith from Tayy, and Al Jarba is from Tayy directly and that it is one of their old clans. He said: They are Al Muhammad as preceded, and Muhammad is the head of their lineage column and the oldest known of their ancestors who is still preserved until now. We start defining them from one of their grandfathers Muqrin bin Muhsin bin Mish'al bin Mani' bin Salim bin Muhammad, and it is noted that some names have been swallowed due to the lack of certainty I knew from many of them so they could not memorize perfectly. Mijrin \"Muqrin\" Ju'airi Al-Zaidan",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 49
  },
  {
    "serial_number": "6207512",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "The Al-Jarbaʾ Clan in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "Taking the rubble carries no weight on us at all… The blame lies upon the one who dragged his fire from above.\nGuard your dignity from the wolf of the desert patrol… The Sa‘idi sword is drawn across his backbone.\nYour life, O Suwayti, is a petty matter… It is not worth even a quarter of a bullet in your eyes.\nThe deaf man has a Zawbi herd… A group adorned with garments facing the fighters.\nYour clan’s horses in front of them… He put forth his reply for the scouts to see.\n\n5 – Al-‘Azzawi’s Texts on the Tribes of Iraq\n\nAl-Sayih from Shammar:\nAl-‘Azzawi said regarding Al-Sayih: These tribes did not originally have this name that now gathers them. Rather, it is a recent designation applied to a group of Shammar tribes who followed Al-Sdayd when he fought the Al-Jarbaʾ or disputed them. Whoever sided with Al-Sdayd, or followed him and answered his call, was called ‘Al-Sayih,’ and whoever inclined toward Al-Jarbaʾ and followed its leaders was counted from the Al-Jarbaʾ. Hostilities between them were ignited, and they did not want to submit to the demands of Al-Jarbaʾ, especially since Al-Sdayd was originally one of them.\n\nAnd similar verses to that:\n\n\"If you come to Abu Farhan, tell him that we crossed… Jazza‘ah does not allow honor to be trampled.\nAnd even if all the Byzantines ride, we shall track them… We must, O Safuq, cause the nod of the head.\nWe endured the warfare of your forefathers… It is not from you, O wolf of the spears.\nBefore ‘Al-Jazirah’ and the days of ‘Najd,’ our land… And our dead roam upon horses within it.\nO Safuq, by Allah we shall not abandon your sugarcane… Until ‘Al-Jazirah’ is empty with no people.\nIf the belt was a span, we stretched it… For long ago we mastered the casting of the mailed warrior.\"\n\nAl-Muhammad\n\nAl-‘Azzawi said regarding Al-Muhammad:\n“I say nothing about them except what Ibn ‘Uthaymir said:\n\n‘From the Tawman, those whom none can dispute except a liar unashamed… They move swiftly, and you find their footprints in the sands.\nWith thrusts like the flowing blades of spears… And cheap food, for whoever prepares it receives warmth and honor.’\n\nAnd another said in a poem praising Fāris ibn ‘Abd al-Karīm:\n\n‘The sons of Al-Muhammad are like wolf cubs… Or like jewels, precious in value.’\n\nAl-Jarbaʾ\n\nAl-‘Azzawi said: Al-Jarbaʾ is a nickname that reached them from their mother; the Arabs still call one another by such names. It is said that she had been afflicted with a ‘skin disease,’ so her family abandoned her and migrated to another land. Then she recovered, and the name remained with her. It is common among the Bedouins to leave the one afflicted with smallpox or similar diseases and depart from him until he recovers or dies, to avoid contagion. They observe him from afar and leave for him food and water.\n\nThe tribe of their mother, as is well known and preserved, is from Al-Fudul of Tayyʾ—of the Banu Lam.\n\nHe said: This designation is ancient, returning to their first leader Muhammad, after whom they are named “Āl Muhammad.” This Al-Jarbaʾ woman is the mother of Salim ibn Muhammad, and this is also confirmed and preserved. The exact date cannot be verified due to the antiquity of the matter.\n\nThese people are not, as some Arabs falsely spread, from the Ashraf nor from the Barmakids—claims that stuck in the minds of some, and were transmitted by Ibn Khaldun in his history, but he was mistaken. Rather, they are from Tayyʾ, as Al-Haydari said, their kinsmen from Āl Muhammad of Tayyʾ.\n\nAnd supporting this is what the author of ‘Matāli‘ al-Su‘ūd,’ ‘Uthman ibn Sand, said: I heard a young man claim lineage to Tayyʾ, the well-known tribe.\n\nAnd the author of ‘Heart of the Arabian Peninsula’ mentioned that the Al-Jarbaʾ are from the Sanjara tribe, and that their branches include Al-‘Amud and Al-Jarbaʾ. He clarified that from Al-Jarbaʾ are Āl Hariz, the Hasna, and Al-Burayj.\n\nIt is said about them that Sanjara is a Zawbi tribe, returning to Al-Harith from Tayyʾ, and that Al-Jarbaʾ are from Tayyʾ directly, and are from its ancient lineages.\n\nHe said: They are Āl Muhammad, as mentioned before, and Muhammad is the root of their lineage—one of the earliest known ancestors preserved until now.\n\nWe begin describing them from one of their ancestors: Miqrin ibn Muhsin ibn Mish‘al ibn Mani‘ ibn Salim ibn Muhammad. It is noticed that some names disappeared due to the lack of certainty that I learned from many of them, as they were unable to preserve the lineage fully.\n\nMujarrin ‘Miqrin’ Ju‘ayri Al-Zaydan.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 50
  },
  {
    "serial_number": "6207513",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "Al-Humaidi Mijrin Najm Faris Mutlaq Amr Qurainis Samir Shalash Bunayyah As'ad Safouk Muhammad Muslat Fahd Farhan Abdul Karim Abdul Razzaq Talal Faris Sultan Mulhim Muslat Mishmal Al-Humaidi Muhammad Al-Shuyukh Abdul Muhsin Safouk Mutlaq Fawaz Abdul Karim Nizar Muhammad Sumait Kurdi Sattam Hijal \"Haikal\" Mish'al. Farhan bin Safouk has many children: 1 - Abdul Aziz 4 - Shallal and these are children of Durrah 5 - Faisal 6 - Abdul Muhsin 7 - Hayis children of Al-Sarhah 8 - Thuwaini 9 - Al-Asi 10 - Mijwel children of Jaz'ah 11 - Jarallah 12 - Mutlaq and he is called Ibn Al-Ayt from his wife daughter of Nuwair Al-Ayt 13 - Al-Humaidi 14 - Zaid 15 - Ahmad and they are called Al-Bashat \"children of Al-Jarjariyah\" 16 - Mizar 17 - Sultan and this is the son of Bahimah daughter of Ibn Qash'am and he is called Ibn Al-Jash'amiyah. Of these Faisal, Al-Humaidi, Ahmad and Zaid are still alive. And Abdul Aziz left Aqil Al-Yawar who is \"Emir of Shammar\" today and Sheikh of their Sheikhs. And these we say about them what we could know: 1 - Muhammad: He is the supreme grandfather by whom the section of leaders was named so they are called Al Muhammad. It is said they were seven brothers one of them \"Al-Sadid\" who is the grandfather of \"Al-Sadid\" and another is the grandfather of Al-Buraij from Al-Kharsa. The rest died without offspring. From this it is known that \"Al Muhammad\" or those who relate to one grandfather are these. 2 - Salim: This is the meaning of their poet's saying: From the turn of Salem and the Sharif ... We are not soft to the harsh. We are like the cheat of Iraq ... We catch up over the length of time. From this verse some infer that they are from the Sharifs. It appears that he refers to a battle that happened to Salim with the contemporary Sharif not considering him a grandfather to them. 3 - Mani'. 4 - Mish'al: And this they relate to him by the closer lineage so they are called Al Mish'al and their recent war cry originated from his time which is \"Harsha and I am Ibn Mish'al\" and their sayer says: Returning on strong camels from the children of Mazid ... Protectors of the house if calamity comes from his opponent. Who gathered two dens in one den ... The eye just enjoyed its sleep. Al-Sidad reconciled they and Al Mish'al ... And the she-camels rejoiced with the days of his feast. Al Mish'al are Al Muhammad, and Al-Sidad are Al Sadid, and they are from Al Muhammad, or as I said previously from the brothers of Al Muhammad heads of Al-Sayih with disagreement in that, and Mazid gathers them who is a supreme grandfather. 5 - Muhsin 6 - Mijrin 7 - Al-Ju'airi 8 - Al-Humaidi: He is the father of Faris Al Jarba and is known as \"Al-Amsah\" because he was born with a wiped eye so no trace appeared for it, and he is considered among the famous Sheikhs of Al Muhammad. He left children of widespread mention and they are Mutlaq and Faris and those who follow them and they are closer to us and their events are close to us and histories still repeat them or tongues transmit them. Among Al-Humaidi's children is \"Amr\" and from him Al Amr brother of Faris..and their branch is still known.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 51
  },
  {
    "serial_number": "6207514",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "9 - Mutlaq: Known as \"Brother of Jawza\" and this wanted to make truce with Imam Ibn Saud but his son Muslat did not submit to the Imam's demands of Zakat and cutting the Sha'af \"hair of the head\" and similar, so he encouraged his father to stand in the face of Ibn Saud so he fought him, and these are the beginnings of their migration to the parts of Iraq and among the motives for leaning towards it. Al-Azzawi said about Muslat bin Mutlaq Al Jarba: He is the son of Mutlaq and nicknamed Al-Mahshush meaning the Angered. He is brave famous for valor, and excelled over many tribes like the Bani Khalid tribe and their head was Ibn Humaid Al Uray'ir and he had said to Ibn Humaid \"Son of a red one your cut\" meaning they seek beauty and comeliness without nobility of lineage and goodness of origin. He had shown them his mother who had protruding canine teeth terrible in appearance so he said my father sought the like of this to give birth to the like of me. Among what is told about him is that his mother used to fear his assault so she warned him. From that is that he asked her one day who is braver he or his father? She did not answer him, when he insisted on her she said to him: Each of you is brave. After excessive insistence she mentioned that his father was braver so he hit her a blow that almost flew the top of her head. His father Mutlaq had fought with one of the tribes and two sons were killed for him so he carried them on a camel and despite this he did not care and contacted their mother on that day so she gave birth to this Muslat so he was from that clot and his news spread and he is famous for generosity he made ghee flow like channels and guests began eating it with dates and enemies and relatives witnessed his generosity. He died before his father as indicated previously. It is told about him that when Masoud's command strengthened and he ordered cutting the Sha'af and paying Zakat he refrained from speaking with anyone and began watching on a Rajm \"hill\" staying in it all day and part of the night so they thought he was in love or mentally disturbed so his father sent to him to come to him and obey Ibn Saud's orders so he refused and hit Ibn Saud's slave and bloodied his forehead. Then the father got angry and took his sword and advanced towards him intending to kill him so Muslat said: I climbed the head of the lofty watchtowers ... A tall high cairn standing upright. I groaned a groan that the wolf does not sleep with ... And I feel my ribs from my conscience jumping. I complain to the brother of Jawza cover of the virgins ... The free one from the house of humiliation jumps. If my wishes became like slaves ... And booties in our right hands we prick. Then the father realized his son's aims so he answered him: Be patient endure and gather the bad for the good ... And this life all of its father is squeezing. I fear from a people whose heads are like quivers ... And a sword on other than the joints cuts.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 52
  },
  {
    "serial_number": "6207515",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Al-Azzawi said about Shalash bin Amr: This is known for generosity. He is called \"Tal Al-Lahm\" (Hill of Meat) referring to what he offers to guests. He was killed near Hor Aqarqouf, in a place called \"Abu Thawb\" and buried there. Al-Azzawi said about Faris Al Muhammad: This one and Mutlaq and the rest of their relatives and families came to the rural areas of Iraq, so the government welcomed them and Shammar's events in Iraq actually begin from this Faris. In his time Shammar's foot settled supreme, and influence in Baghdad belonged to Al Al-Shawi and the Ubaid tribe adhered to the government so it was proud of it. What is preserved from some of them is that Ibrahim Bey bin Abdul Jalil Bey is the one who brought Faris to Iraq for the interest of hostility to Ibn Saud, and to crush the tribes and similar. The correct is what we presented and that Ibrahim Bey belongs to Shammar from \"Al-Ja'far\" from whom are Al Al-Rashid. Because of this leader I mean Faris the thorn of the Ubaid tribe was somewhat broken rather almost erased were it not for the succession of emergence of famous men from Al Shawi helping their tribe Ubaid while these Bedouins have no supporter other than the strength of their arm and their practice in wars and innate intelligence in knowing the political situation of the government so they exploited the situation with knowledge and experience and attained their excellent position with the governors of Baghdad. The government desired to incline a great tribe like this to it and use it against Ubaid and other tribes and it feared their assault and dreaded their power, and it was also in need of knowing what was happening in the Arabian Peninsula and this is what it intended initially then turned to other situations in its time, or that it looked at both matters together and all its hopes were directed to erasing some by some to secure its rule and support its authority and coercion of the residents, so it undertook after that events confirming its intentions and clarifying its situation and all its demands and purposes towards the residents. The first thing the government saw from Faris Al Jarba - besides what was mentioned is what happened in the year 1213 AH 1798 AD - the time of the Governor Salman Pasha the Great for it wanted to entrap Ibn Saud so it gathered all it could of tribal and military force so Faris Al Jarba was with his tribes and so was the Sheikh of Al-Munfaq with those with him of tribes and Muhammad Bey Al-Shawi and many groups the Vizier put them under the command of Ali Pasha Al-Katkhuda except that this one was not knowledgeable in war matters and did not listen to the advice of his senior men from tribal leaders practiced in wars like these especially Al Jarba. In this battle history did not record except a raid on the Subai' tribe so he looted camels and sheep from them and in this raid was Faris and his nephew Bunayyah bin Qurainis they looted what they looted and killed who they killed from the Subai' tribe and returned but Al-Katkhuda was abandoned in this war and the government lost heavy losses immeasurable and were it not for the tribes with him he would have been destroyed an evil destruction, so it ended with apparent peace and complete real defeat, and I have clarified this in its place in the history of Iraq. In the year 1216 AH - 1801 AD squadrons from the people of Najd raided Iraq so Al-Katkhuda Ali Pasha sent to fight them Muhammad Bey Al-Shawi and Faris Al Jarba and with them the Vizier's soldiers so they found the people had fortified themselves with mounts, and bared the leg of war with rifles and arrows, so those sent by Al-Katkhuda refrained and saw that Ahmed so they returned to Shafa'i \"Ain Tamr\" hating the fight so Ibn Sanad reprimanded them in his history saying: They saw the white swords drawn so they thought ... That they were fires lit at night. So they came rushing away from it why not ... Did they arrive at it and with the horses trotted. Retreating from souls being shed ... By swords poured on heads?",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 53
  },
  {
    "serial_number": "6207516",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "This while Ibn Sanad did not know that risk without hope of victory is excess and the army was exhausted in strength so it encountered by surprise people resting who had tied their camels and began waiting for war with calm and rest so the army stopped fighting them and what is beside, for the mentioned reasons and for war conditions, and it appears they wanted to draw their enemy by a war trick then track them but their objective was not achieved and they did not succeed so the battle ended peacefully. Faris Al Jarba and his people did not stop at this limit but their influence increased for they displaced Ubaid and others and established themselves in their homelands, they came between the two rivers - the Jazira - initially intending to water the homeland and after that Faris came to them with many people so some painful wars occurred. Among what tongues transmit is that when Faris arrived in the Jazira he invited the heads of neighboring tribes and presented to them a very large Mansaf \"bowl\" with much food and on its edges knives tied with ropes to cut the meats, so they found what they saw great and calculated for what is behind it and among the invited were the heads of Ubaid and Jubur. The head of the Jubur tribes refused to eat on the pretext that he was fasting lest salt and provision prevent him from entrapping this leader or betraying him and consulted his companions in what he harbored for him to kill him so they be safe from his evil before his people come to him and their affair becomes great but the rest of the leaders did not agree with him because he is a guest and because he did not come as a warrior so he was forced to turn away from his opinion. Then Shammar arrived successively until its affair became great, and occupied the Jazira so it pushed these tribes to different parts, so the Ubaid tribe leaned to Hawija, and displaced Al-Bayat to their current places. And so happened to Jubur so they dispersed. In this was the instruction from the government so it incited against this tribe and Ibn Sanad depicted Faris's status then saying: Faris and his nephew Bunayyah had in the days of the Vizier Ali Pasha great pomp and precedence. So the shadow of Ubaid shrank, and almost was erased so they crossed to Hawija, and they are still there until now. The heads of the two tribes mention these incidents generated by politics and exploited the ability from one side to entrap the other, and that is only to spite Al Al-Shawi. But the government did not see from Shammar the results it hoped for so it saw them harder to manage and they were not followers to every order. The entrapment of the Governor Ali Pasha with Muhammad and Abdul Aziz Al Al-Shawi happened at the beginning of his government. He had gone himself to Sinjar and after he left he got angry at them so he strangled them in the year 1218 AH - 1803 AD and then Faris Al Jarba came, and his nephew Bunayyah the mentioned ones so he erased the house of Al-Shawi and supported the heads of Shammar. From these a branch is still known as \"Al Faris\". And among them is Mijwel bin Muhammad Al-Faris. Al-Azzawi said about Bunayyah: This is the son of Qurainis and he is called Al-Ashmal meaning he practices his works and wars with his left hand \"his Shamal\" and his mare is called \"Al-Junaidiyah\" a known type of horses. This Bunayyah crossed from the Jazira to west of the Euphrates when Sa'id Pasha assumed the ministry of Baghdad due to the grudges between his uncle Faris and Al Ubaid especially their emir Qasim bin Muhammad Al-Shawi, and Sa'id Pasha had entrusted the reins of his affairs to Qasim, so due to what was between Faris and the mentioned Qasim Bunayyah did not settle in the Jazira so he descended with his tribe on Khuza'ah in the year 1231 AH - 1816 AD to measure grain, and then the following battle occurred which is that the Sheikh of Al-Ruwalah from Anazah known as Al-Duray'i sent to Hamoud bin Thamir Sheikh of Al-Munfaq mobilizing him so he mobilized with the horsemen of his tribe to help Al-Duray'i due to the coalition between them, and also the army of the Vizier Sa'id Pasha went out and they are Uqayl and their elder Qasim Al-Shawi so the war stood on a leg and the leader of Shammar was Bunayyah and this one never attacked a wing or heart except he defeated it until the horsemen avoided him so it was destined upon him in one of his attacks that a rifle shot hit him so he fell from the back of his horse dead. It came \"in Unwan Al-Majd fi Tarikh Najd\": That two horsemen caught up with him so when he sensed them or that they called him to duel he pulled the rein of his steed a terrible pull to turn it towards them so the mare raised her head and hands and fell on her back to the ground while he was over her so he became under the saddle and the mare over him so he was caught and killed and his uncle Faris was with him in this battle. As for the effect of this killing of his it was great and had impact in their souls. Among what Ibn Ajaj said in this battle of Al-Munfaq against their first victory over Al Al-Shawi addressing the Sheikh of Al-Munfaq and blaming him for his pride in killing Bunayyah, and he was fleeing from Al Muhammad and a guest at Al-Munfaq, they transmit that he said:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 54
  },
  {
    "serial_number": "6207517",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "You betrayed a Sheikh who always betrays you ... And gave him the rope of the trap. Then you sufficed ninety heads of your people gone for you ... What then O castrator of chickens have you done. In any case his incidents were famous, but the rise of Al Al-Shawi for the second time weakened his resolve so the people rallied against him and he fought until he was killed with support from the government and Al-Munfaq and Anazah. And his uncle was and still is alive and with him in this battle. A period passed until they regained their status in the days of Dawud Pasha and the government sought help from them and other tribes in the war of the Persians in the days of Sheikh Safouk bin Faris and this defeat that befell Bunayyah did not affect the tribes of Shammar but rather it is a duel war and was not a decisive war. Al-Azzawi said about Safouk: This one is more famous than a fire on a flag and the government nicknamed him \"Sultan of the Land\" in the year 1249 AH - 1835 AD, he succeeded Bunayyah his cousin in his status and gained favor with the government in the days of Dawud Pasha the Vizier. This and records multiplied in his days or that what reached us is more due to the closeness of the era. He is distinguished by practice in wars more than those before him, and important measures in driving the army. It is not denied for the likes of these to excel in the matter of wars having tasted their sweet and bitter and attained the matter from them and got used to them. Sound nature, desert life, leadership, extra practice in the matter of wars, and excessive intelligence, compensate somewhat for technical experiences especially if accompanied by composure, patience on hardships, and attention that might be obtained by a few preserved incidents with practical condition compensating for numerous studies, their cases do not need what is needed in organized wars. If a person is predisposed to love of wars and inclined to them with his totality and his environment helps to undertake their matter always, or observing what compensates for them from chasing game in days of peace, then there speak about bravery and war plans, and correct measures without harm. Had their incidents which they narrate, and the means they take to implement their plans been recorded the matter would be appalling or submission to their competence and ability would occur. It is unfortunate that energies are spent for such matters in raiding each other and every one we see skilled in what he practiced, and the danger and difficulty is in one obtaining his luck from the other. This biography subject is considered in the forefront of Arab braves and their great commanders and had he found a good soil and suitable environment he would have appeared greater. The author of \"Al-Matali'\" said in the events of the year 1238 AH - 1823 AD about the battle of the Persians which happened in the year 1237 AH - 1822 AD: Several trustworthy people told me that Safouk raided Ibn Al-Shah and crossed Diyala with horsemen from his tribe until he was in sight of Ibn Al-Shah's army so the army's horsemen rode when they saw him and attacked him so he lured them until they crossed Diyala and were far from it so he turned he and those with him from his tribe and from the Romans on them so the Persian horsemen retreated and the horsemen of Shammar followed them and killed those they caught of them and brought their horses and loot. More than one person told me that this is different from the first one mentioned by the Turkish historian. What is preserved in this battle is that it was in participation with the Izzah tribe, and that they performed great performance in it, so they joined hands against their enemy, and relied on themselves, and they had no supporter from the Roman army \"Ottoman Turks\" and if there were some individuals from Uqayl with them no importance is attached to them. These Shammar in their wars harass the opponent, and make him greedy for victory without decisive victory, until they come to the field of chase and the place of turning - as Ibn Sanad expressed - so they repeat the attack on their enemy, hence they are called people of \"The Habit\" and so Safouk did in arranging his plan and their success and they are more accustomed to it and fundamentally from his youth he practices it. The detail of the battle is in \"History of Iraq between Two Occupations\". Ibn Sanad praised this battle of his with the Persians and his support for the Vizier and clarified that he was the army commander and with him the tribes until he said and when Safouk supported this Vizier he granted him Anah and what follows it of villages so he attained his status with the Vizier so he opposed his enemies and allied with his allies. As for Safouk's generosity proverbs were struck with it and proverbs acknowledged it. Safouk has famous incidents with Anazah tribes most famous of which: 1 - Day of Basala. It is a day Shammar won over Anazah in the year 1238 AH - 1823 AD. 2 - In the following year Anazah won over them which is the year 1249 AH - 1824 AD. In this last battle Shammar was broken so the Vizier strengthened the arm of their elder Safouk.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 55
  },
  {
    "serial_number": "6207518",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Thus said Ibn Sanad, and there is no place for detailing here. In any case Shammar's break this time was not the decisive one but rather it is according to the custom of Arabs in their saying \"War is buckets (turns)\". Therefore the government did not leave them, but rather took their hand so they regained their first status and undertook its war missions with opposing tribes. The government had from the tribes what serves as an army ready for emergencies and present for struggle and mobilization. Safouk's other incidents are of this type. Among them is what relates to the Shammar tribes but the incident of the year 1249 AH - 1831 AD indicates that he remained loyal to Dawud Pasha the Vizier and hated the government of Ali Rida Pasha so he did not submit to him. That is because the Governor of Mosul Yahya Pasha was also of the opinion of Sheikh Safouk Al-Faris and there was correspondence between them. He urged Safouk to rise so he opposed the government and managed to cut the road between Baghdad and Mosul and began roaming between the two rivers so he gathered a large force and came near Imam Musa Al-Kadhim so he fought Ali Rida Pasha the Governor and the government army and his hope is great to punish the force in front of him and seize Baghdad so this incident had a great impact on the government's soul, and in the result of this war Sheikh Safouk was forced to withdraw and leave the heavy loads. When the government learned of the intentions of the Governor of Mosul it removed him and appointed in his place Sa'id Pasha the former Governor who was in Baghdad. The government after this battle of Safouk with Ali Rida Pasha Al-Lazim tricked him and arrested him and banished him to Istanbul and with him his son Farhan Pasha who was young and learned Turkish during his father's stay there, and the period he spent was three years. Among the strange things told about him is that he came to the Sultan through the mediation of Sharif Abdul Muttalib so he entered upon him and then began looking right and left. This is what called for the Sultan to get angry at him again and expel him from his presence and he did not know the reason while he was hoping he would honor him. That is because of what the Sultan saw from him of bad manners, so the Sultan thought of him and did not know he was a Bedouin, and his likes do not know the ceremonies of honors, and the government fundamentally does not know the traditions of Arabs and their customs so it is not strange from the Sultan to believe in him what he believed while he is far from Bedouinism, and not accustomed to roaming nor national tours at least, nor does he have in his hand books of tribes to enlighten him about their conditions. We have seen from the late King Faisal great patience with the harshness of tribes and their roughness as he hears all their Hawsa (war chants) and receives them with all breadth of chest and comfort, because he is knowledgeable of them and the varieties of their natures and conditions. Then the Sharif mediated for him a second time to enter so the Sultan agreed, but when he came to the Grand Vizier he began advising him to observe appropriate ceremonies and not to raise his gaze nor turn to his sides, so he said: I will not enter, and there is no benefit for me from that entry and then I prefer staying because I will go to my tribes and tell them that I saw the Sultan and saw his court and what is in it of such and such, and if I told them: I came out as I entered and did not look at anything then they would not believe me but lie to me and say: We do not believe that you entered. So news of that reached the Sultan so he was pleased with what he narrated, and allowed him to enter and the Sultan permitted him to see him and to look at other places and ministries \"Wizarat\" and all the wonderful buildings and grand palaces and antiquities. The Sultan pardoned him, and he tested the situation on one hand, and on the other that his tribe is accustomed to raiding and looting and it is not possible to determine which of the two reasons called for his rising against the government again in the time of the Governor Najib Pasha and it is said this time the government did not declare chasing him but rather took the path of peace and trickery to arrest him and sent to him the famous tribal heads to bring him closer to reconciliation and submission and obedience. So they brought him as obedient, peaceful to it and submissive, when he reached Hor Aqarqouf and approached Baghdad Muhammad Bey drew his sword on him and struck him killing him treacherously and unaware. Sheikh Safouk had spent most of his days in wars so he is practiced in them, does not rest without them, and his stories are like the stories of ancient heroes and their wars, and Shammar's councils are not free at a time from memories of his valor, and singing of his feats and virtues of his courage. Today the house of general leadership over Shammar is in \"Al Safouk\". It was said Safouk's killing was at the hands of the Turks in the mentioned way in the year 1840 - 1841 AD as came in the book \"Tribes of Syria\" and it has a view [reservation], because his incidents with Ali Rida Pasha are after this date as you saw. Among his children: Farhan, Abdul Karim, and Abdul",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 56
  },
  {
    "serial_number": "6207519",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Razzaq and Faris \"father of Mish'al Pasha\" and among those who eulogized him Radhan bin Anqa said: Razzaq and Faris \"father of Mish'al Pasha\" and among those who eulogized him Radhan bin Anqa said: I groaned and I am from Ghafilah ... Groan of an old woman who stood at the barricades. She found her son lost with his wife ... And after joy she replaced with rags. O woe the saying of Safouk and longest woe ... Woe that cuts in the navel of the liver cutting. Since you were absent from us O son of my brother his way ... Happiness was absent from our dwelling and the laws. And we flee the fleeing of game and graze its grazing ... And we became like the relief of goats without a billy goat. Al-Azzawi said about Farhan: This is the son of Safouk, and his prestige with the government was high, and no incidents occurred to him disturbing the peace nor was opposition to the government known from him, and the Ottoman government bestowed upon him the rank of Pasha and he had gone with his father Safouk banished to Istanbul as mentioned and it is known among Bedouins that he is possessor of Bakht \"luck\", and Bedouins always invoke his luck saying \"O luck of Farhan\". His Sheikhdom and relationship were with Baghdad, and he had a salary from it and he is in its service for dark matters. And yes he made peace with the government, so it observed his side and was pleased with him and he used to help the government if he was close to it or his brother Abdul Karim if the incident was close to Urfa. Farhan Pasha left many children and we have clarified them when mentioning the chain of their house. Al-Azzawi said about Abdul Karim: And this is the son of Sheikh Safouk his name became famous and he attained a known position and his Sheikhdom was in Urfa and he has a salary, and he is the brother of Farhan Pasha and is known as \"The Sheikh\" so the tribe knows this is its Sheikh so he named his children \"The Sheikhs\" and he was hanged in the year 1868 AD after he surrounded Mosul with danger, and the government had taken measures to entrap him with the same as it did in the incident of Safouk or close to it. And this one left Muhammad, Abdul Muhsin, and Safouk and these are children. Among what was said about Abdul Karim: Abdul Karim when he rides a strong horse ... But his leg at retreating is defective. His grandfather from his mother is from the heirs of Hatim ... And his father carrier of the heavy loads calamities. Protector of horses giver of horses ... He has an attack in which led horses abound. If he grasps the ruby he does not hold back with it ... You find the dew between the eyebrows curdled. He says: As if Abdul Karim his leg was defected when we see him riding his steed. And among what Fajhan Al-Farawi from Mutayr said about Abdul Karim: We want to take on the camels a pause ... Between Abu Bandar and the Son of the Imam. And we want to take on the camels a rush ... To the lands of the smiling faces the noble. Indeed generosity has no dust and noise ... And no one rivals them south and north. Meeting Al Jarban is a duty and pilgrimage ... People of the swords that cut bones.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 57
  },
  {
    "serial_number": "6207520",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "And his son Faris lived also peaceful to the government and observing its side and he is Sheikh of Shammar in the parts of Syria, holder of a high position there, and among those who gathered qualities of manhood and cunning and memorizing past incidents and the relationship of other tribes to them but he always wishes to show the superiority of his tribe over other tribes. Al-Azzawi said about Faris bin Safouk: He is the son of Safouk and father of Mish'al Pasha, Ali Bey former Governor of Trabzon and Director of Public Debts had come on an official tour to Baghdad recorded in his book named \"Siyahat Zurnali\" written in Turkish and printed in the year 1314 AH - 1897 AD he had written it as a journey about the year 1300 AH - 1883 AD to the year 1304 AH - 1887 AD clarifying what he saw on his way from Istanbul to Baghdad then India he said: \"I have gone to meet Sheikh Faris Al Jarba - after his passing in Mardin - so his son Muhammad received us\" and this Muhammad is not his son but the son of his brother Abdul Karim \"and entered us into his tent, which is of hair and its length is from 60 to 70 cubits and its width from 25 to 30 and has many pillars and is very huge. He described their houses, food, coffee, and council but the people did not talk in demands to alert to them except that he said: And in Sheikh Faris's council were about 60 leaders. He said: There was not among the Arabs there what calls for honoring and ceremonies for standing and sitting, so we did not see standing among them, and it appears that the referred tourist did not know that the one sitting with him there is no one greater than him to stand for him. Naturally modesty takes over his council especially that they saw a stranger at their Sheikh's or in the correct expression their Emir. He said: Some of them were engaging in drinking Narghile, and voices among them rise and they all speak together so clamor increases in their association \"freedom is not known among Bedouins nor the extent of leaders' authority and that it is limited except by right\" then he had lunch and described the Mansaf presented to him and that the Sheikh was inviting groups after others to eat until little of it remained so he called the boys and these entered the same Mansaf and ate in it because their hands do not reach it due to its hugeness, and when he saw the Mansaf and its hugeness and that it is filled with rice and meat he was taken by confusion and began looking at his companion's face as if pointing to its hugeness. He said: That Sheikh Faris we insisted on him so he refused to eat with us and said thus we are accustomed even that among what called for their confusion is that he remained standing throughout their sitting for eating and remained serving them himself as is the custom of Arabs with the dear guest. But when he saw the insistence occurring from him he called those who eat with him from those present about \"7 or 8\" he said they ate with us with the five [fingers]!. Then he says: And after we bid farewell and went returning from at evening his son \"his nephew\" Muhammad came to us and presented to us a horse, and we had presented to him a rifle, and since we had honored him with the rifle we accepted this gift of his with thanks. End summarized. This is the father of Sheikh Mish'al Pasha. From the saying of this Turkish tourist and what he saw of Sheikh Faris's insistence and presenting food to him and honoring him with an Arabian horse, and describing his station you know the place of other Shammar Sheikhs. Sheikh Faris has - besides Mish'al Pasha - sons Mulhim, Muslat and Al-Humaidi. Al-Azzawi said about Faisal bin Farhan: I have seen him repeatedly and he is still strong although advanced in age, and this one I could not know from him more than raiding incidents, so if I exceeded for you he says to me ask Aqil \"Sheikh Aqil Al-Yawar his nephew\" and his stories about raiding were delicious and refreshing. Sheikh of Al-Rub'iyyin in Iraq Mubarrad bin Suki uncle of Faisal used to say: He is above what he narrates. The strangest thing I heard from him is the story of the wild boar that wanted to kill his brother Abdul Aziz father of Sheikh Aqil, and they were young so he went to help him and save him but he fell with him in a predicament so he could not get rid of it and his brother did not dare to help him, that is because he grabbed his tail from a side so he could not let him go out of fear of him and began turning with him so he could not escape, then Abdul Aziz managed this boar so he hit him with a shot with a Shotgun \"called with us Fard and it is a type of gunpowder rifle except that it is small like a pistol and contains only one shot mostly and is placed in the person's belt or in a special holster like the pistol holster without difference\" As for his raids and news in his wars these are very many, and the most important in them is what he got from them of suffering, wounds, capture or defeat. And his state recites: So I returned to Fahm and was not returning ... And how many like it I left while it whistles.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 58
  },
  {
    "serial_number": "6207521",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "The place does not accommodate prolonging in these, otherwise they constitute night entertainment, and all stories of Bedouin braves are of this kind and are not devoid of strangeness and precision. The referred Sheikh has children, full of intelligence, bravery and high spirit among them Mish'an. Al-Azzawi said about Al-Humaidi: This is the son of Farhan Pasha. He had studied in the Tribes School in Istanbul, and he is today exceeding fifty years of age, famous for righteousness, Salafi in creed, adhering to reading the Holy Quran, Sahih Al-Bukhari and considered Hadith books, he is of the good righteous people. In the year 1353 AH - 1935 AD he became a deputy, and I have seen a young son of his and conversed with him and asked him about Al-Amsah so he explained it so I was pleased with his explanation, and he has a Bedouin spirit, and every good is hoped in him. Al-Humaidi flees from mentioning tribes' traditions, and their customs believing they are contrary to the noble Sharia, and does not like boasting of ancestors and whenever I tried to explore his opinion in some matters his answer was brief and as much as needed. Al-Azzawi said about Al-Asi: From the famous children of Farhan and what is preserved from him is what he said about his son Al-Hadi father of the known Daham today: O falcon I raised it after the brother of Shahah corruption ... His father is Al-Humaidi and Al-Dawish and A'daib his mother's uncle sure.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 59
  },
  {
    "serial_number": "6207522",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "Al-Azzawi said about Aqil: He is today the Sheikh of Sheikhs of Shammar in Iraq, and son of Abdul Aziz Ibn Farhan Pasha, and most of my information about Shammar tribes I quoted from him directly by mediation and from Mubarrad bin Suqi and some famous Shammar Sheikhs who are relied upon. I saw him a logical man, wise, perfect, good in association from every aspect, and I contacted him much, so I did not find what bores from him but rather there is gentleness of side, politeness of morals, goodness of logic, strength of expression, and truthfulness of tone, and the pen is unable to mention all his merits, and the summary of what I can say is that he combines noble Arab qualities. I do not forget his conversations about tribes and their custom and his direction of some Bedouin incidents and rulings which I did not find with others, and is not found with most knowledgeable ones I saw. We did not find important incidents about his other children except that Abdul Razzaq had a battle with the Turks and as for Farhan and Faris their relationship with the Ottoman government was very good, and they obtained the rank of \"Pasha\", and enabled what their ancestors attained of authority and influence over their tribes so their fame covered the rest of other Shammar heads, so we do not prolong the saying by mentioning their branches. Al-Azzawi said: Shammar tribes used to roam in the Arabian Peninsula and Mesopotamia without opposer or contender except what happens due to disagreement of tribes with each other or with the government sometimes. After the occupation of Iraq by the British army in the year 1917 AD and Syria by the French army each team of Shammar became independent in its side and leadership was entrusted to an Iraqi in the Iraqi Kingdom and to a Syrian in the Syrian Kingdom. This leadership was not its sole reason and there is a leadership from each of Al Muhammad over a district or tribe or several tribes, so authority is divided by the multiplication of Al Muhammad and their plurality and in the time of the Ottoman government one of them is known, and if he is not fit to manage tribes the clans incline to whom they desire from Al Muhammad and the leader remains the medium of understanding. As for today everyone knew a leader in his side. The leadership of Shammar in Iraq was decided to Sheikh Aqil Al-Yawar. He is today the Sheikh of their Sheikhs no contender rivals him in it, and he succeeded Daham Al Al-Hadi who went to Syria, and now he is on the borders and leads \"Shammar of the Borders\" as the French authority named them. And Mish'al Pasha became Sheikh over Shammar Al-Zour \"so the Syrian government named them\" and they are Shammar who inhabit Deir ez-Zor. And there are other Shammar led by Mithqal Al-Ajami \"so in Tribes of Syria\" and the French government names them \"Shammar Demir Qabu\". Here it is noted that rivalry exists between Aqil Al-Yawar and Daham Al-Hadi his cousin but nothing occurred between these two leaders what the French authorities expected due to enmity or predicted of occurrence of what stirs latent hatred and malice and that they will remain enemies all their lives deducing from the apparent reconciliation incidents that occurred during the year 1926 AD in Anah and the year 1929 in Hasija. This does not exceed intuitive matters thought to be realized or that the distance of disagreement tensions between sections of a strong tribe whose assault and authority is feared if it agreed and its word united due to momentary quarrel occurring between two relatives not leading to more than forming personal enmity so it leaves no room for Shammar to confront each other. In any case - as we said previously and say - the choice of leadership in Bedouins is only for talents they see in individuals of the leadership house. Al-Azzawi said: Those we counted the Emirate used to transfer to them. There are from Al Muhammad others than these and they are: 1 - Al Amr: And these are in Syria and saying about them was indicated. And a group of them with the Turks. Al-Bassam said in Tribes of Iraq after mentioning Shammar in the way quoted from him in page 128 and the Sheikh of these famous in peace and war, is called Umar Al Jarba. And I overlooked mentioning him so the complete phrase came here complete so the alert was required and the apparent from their pronunciation Amran with Fatha on Ain is that it is Amr not Umar. 2 - Al Zaidan: Some of them in Syria and in Iraq with Al-Kharsa and their head is As'ad bin Sumairi bin Najm bin Mijzan bin Zaidan. These are called Al-Ziyadin also, and among their heads is the mentioned and he is the one saying the poem starting with: A cloak covered my filly in its majesty ... And milk for her milk from herds of white camels. And from it: O Safouk I come to you with woes sand of the crescent ... Vulture of the groups deceived the turners.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 60
  },
  {
    "serial_number": "6207523",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "O Safouk we returned to the swordsmanship men ... Horses and followed by horses all famous. 3 - Al Fahd. Some of them in Syria and in Iraq. 4 - Al Mishhin. And these with Al-Kharsa. 5 - Al Sadid. And they are heads of Al-Sayih tribes. And they meet with Shammar Al Jarba \"Bayas\" and the path of its connection is not known today. 6 - Al Faris. And they are branched from Ibn Faris who is Muhammad Al-Faris so they were named after their grandfather specifically without the rest of his children and they are in Iraq. 7 - Al Safouk. Discussion on them passed. From Al Jarba Al-Wutaifi is famous and now none of his offspring remain except women. And Al-Hashash lives with Al-Kharsa and so Ibn Mishhin, and Ibn Damin and Ibn Sallal. And Al-Atuwiyah. And they are known as Al Abdul Rahman. And counted from Al Jarba Al-Amud and some of them in Najd and in Iraq. And Al-Subhi in Hawija. And Al-Kharsa in the Jazira. The apparent is that their connection is distant except that they are certain of it. And the Bedouin wherever he settled and wherever he lived does not lose his origin. 6 - Texts from the magazine Lughat Al-Arab. Shammar of the Jazira:",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 61
  },
  {
    "serial_number": "6207524",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "About Shammar of the Jazira: About Shammar of the Jazira Deacon Francis Gibran said in a journey of his titled: Wandering in the neighborhood of Baghdad and Al-Mada'in: All the corners located on the eastern side of the Tigris from \"Bawa\" to beyond \"Kut Al-Imara\" are inhabited and farmed by Shammar Tuqah. The houses of these tribes in winter are tents woven from goat hair which are Mazalim (shades) and each Mazallah of them is composed of three or four or five Shiqaq \"Shakak\" according to ability and the width of each Shiqqah is a cubit and a third or half a cubit say: a meter and its length about twenty-something to thirty cubits so they join the edge of one Shiqqah to the edge of the other and men sew it and their tents in summer are from Shiqaq of Shawb Al-Uwayn or Cowpea. The meaning of Shawb is that they take the branches of Al-Uwayn and its stems after its leaves yellow and soak them, in water for a period of seven or eight days then lift them from it and sew them with sticks and clubs and pound them with woods and stones a severe pounding until they become like cotton and this pounded [material] is called by them Shawb, then women start spinning and weaving it into Shiqaq, then men sew it into a tent raising it with poles as a roof for the house. Some reliable verified Sheikhs of Shammar Tuqah narrated, while I was sitting in their presence saying: Before five or six backs i.e. generations we were on the western side of the Tigris with Shammar Al Jarba the Bedouins, a single bond gathered us and our looting does not cut from Mosul and Shirqat to Souq Al-Sheikh and Qurnah and for matters that occurred to our ancestors they turned backs on each other - i.e. separated - so our ancestors crossed from the western crossing of Tigris to its eastern crossing so a bitch of ours from our dogs lagged behind in the western crossing and her name was Tuqah so a woman of ours started lifting her saying Tuqah! Tuqah! Tuqah! So the Bedouins Shammar Al Jarba named our ancestors Shammar Tuqah, insulting and belittling them and this name continued on us to this our day so we became two tribes or factions and we have numerous clans. Qasim Al-Dujaili tracked him saying: Then he counted from Shammar Tuqah \"Al-Gharir..Al-Zaqarit..Al-Aqra'..Al-Sa'id ... Al-Zawba'\" and the correct is Zawba' \"Al-Su'ud\". As for Al-Gharir, Al-Haidari said about them the text: Al-Gharir are from Himyar and among their tribes are Al Shahwan and Al Bakr. As for Al-Zaqarit they are from Abda, from the children of a man named \"Zaqrut\" with Fatha on Zaa and his brothers Al-Afarit and Al-Ja'far and others, and Al-Qazwini mentioned them in his treatise saying: \"Al-Zaqarit is a tribe of Arabs in Iraq attributed to Shammar Dhu Al-Janah from Lahi'ah Al-Himyari father of the Shammar tribe\". He said: Today the western Shammar deny Shammar Tuqah that they are from them as Al-Haidari mentioned in his book \"Unwan Al-Majd\". And western Shammar are of several tribes Al-Haidari mentioned said: And among the most glorious \"meaning Shammar of Iraq\" Shammar and they are several tribes among them Al-Kharsa and Al-Amud and Al-Sayih - and they have kinship with Al-Ubaid - and Al-Najm and Aslam and they are from Al-Sayih and Al-Ulayan \"with Tashdid on Lam\" and Al-Burmaj and Al-Fadaghah and Abda and Al-Ghafilah and Al-Afarit and Al-Zaqarit and Al-Zumail, and Al Ja'far the people of Ibn Rashid Sheikh of Jabal Shammar, and their families are Al Muhammad from Tayy. In the early thirteenth century from Shammar Tuqah a knight excelled famous for horsemanship and bravery all fame, and his reputation flew in the horizons named \"Bunayyah\" with Sukun on Ba and Fatha on Nun and Tashdid on open Ya and at the end Ha - bin Qurainis Al Jarba and he was killed in the year 1231 AH - 1816 AD in a war that arose between him and Uqayl and Al-Ubaid and Khuza'ah and Anazah and Al-Ruwalah and Hamoud bin Thamir from Al-Munfaq occurred in west of Euphrates and his head was brought to Sa'id Pasha son of the Vizier Sulaiman Pasha the Great and buried in Najaf and a dome of yellow, white and black Qashani was built on his grave having a large hall built with gypsum and brick and the dome is in the northwestern side of the Najaf cemetery. Then Al-Dujaili said rectifying his article: We had written lines regarding Bunayyah Ibn Qurainis or Qurainis or Quraynis Al Jarba and said that he is from Shammar Tuqah and our belief was so and last month we went to visit His Excellency Sayyid Mahmoud Effendi Al-Naqib in Baghdad so we met Sheikh Mijwel bin Farhan Al Jarba one of the Sheikhs of western Shammar, and Haj Abbas Al-Ali the elder of the people of Kut, and when we settled sitting we began exchanging conversation as is the custom of visitor and visited and after a while Sayyid Mahmoud Effendi said: You mentioned that Bunayyah is from Shammar Tuqah and the correct is that he is from western Shammar. Then he turned to the mentioned Sheikh Mijwel and said: Is not what I say correct? Sheikh Mijwel said: Yes, and he is from Al Muhammad son of the brother of Faris Al Jarba father of my grandfather Safouk. And the name of Bunayyah's father is not Jurainis but",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 62
  },
  {
    "serial_number": "6207525",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "His name is Qurainis. So we said: If the matter is so, what is the occasion for burying him in Najaf and constructing this building on his grave, while it is contrary to the belief of western Shammar especially as they are from Ahlus-Sunnah wal-Jama'ah? He said: The killing of Bunayyah was in the land of Al-Khuza'il and they are the ones who buried him in Najaf. We said: If we assume for the sake of argument that they buried him in Al-Ghari, who spent on this grand building and the dome covered with Qashani the huge sums? He did not bring a convincing proof then we said: As for our proof that he is from Shammar Tuqah it is because Shammar Tuqah are of the Shia sect, and they bury their dead in Najaf and Karbala so there is no doubt that he was one of them and they are the ones who constructed this building on his grave. Then the aforementioned Haj Abbas Al-Ali noticed my saying: \"Burying him in Najaf and constructing the building on his grave\". He said: Describe his grave to me so I described it to him so he said: This one you mean is the grave of Bunayyah head of the Bani Lam tribe, and not the grave of Bunayyah who was discussed, and the mentioned head of the Bani Lam tribe died around the year 1313 AH - 1895 AD and the one who constructed this building on his grave is his son Ghadban the current head of the Bani Lam tribe. We reviewed some collections and found the matter as the people mentioned. Then after a week we met the aforementioned Sheikh Mijwel and he told us: The grave of Bunayyah Al Jarba today is located in the southeast of \"Umm Al-Ba'rur and Al-Hamidiyah\" from the land of Al-Shamiya at a distance of 4 or 5 hours. So we thank their excellencies all for informing us, and alerting us to our mistakes especially we thank His Excellency Sayyid Mahmoud Effendi Al-Naqib, because he is the reason for that, and how great it would be if we found someone to show us our error and guide us to the right path for human is a place of error and forgetfulness and perfection belongs to Allah alone. Qurainis. So we said: If the matter is so, what is the occasion for burying him in Najaf and constructing this building on his grave, while it is contrary to the belief of western Shammar especially as they are from Ahlus-Sunnah wal-Jama'ah? He said: The killing of Bunayyah was in the land of Al-Khuza'il and they are the ones who buried him in Najaf. We said: If we assume for the sake of argument that they buried him in Al-Ghari, who spent on this grand building and the dome covered with Qashani the huge sums? He did not bring a convincing proof then we said: As for our proof that he is from Shammar Tuqah it is because Shammar Tuqah are of the Shia sect, and they bury their dead in Najaf and Karbala so there is no doubt that he was one of them and they are the ones who constructed this building on his grave. Then the aforementioned Haj Abbas Al-Ali noticed my saying: \"Burying him in Najaf and constructing the building on his grave\". He said: Describe his grave to me so I described it to him so he said: This one you mean is the grave of Bunayyah head of the Bani Lam tribe, and not the grave of Bunayyah who was discussed, and the mentioned head of the Bani Lam tribe died around the year 1313 AH - 1895 AD and the one who constructed this building on his grave is his son Ghadban the current head of the Bani Lam tribe. We reviewed some collections and found the matter as the people mentioned. Then after a week we met the aforementioned Sheikh Mijwel and he told us: The grave of Bunayyah Al Jarba today is located in the southeast of \"Umm Al-Ba'rur and Al-Hamidiyah\" from the land of Al-Shamiya at a distance of 4 or 5 hours. So we thank their excellencies all for informing us, and alerting us to our mistakes especially we thank His Excellency Sayyid Mahmoud Effendi Al-Naqib, because he is the reason for that, and how great it would be if we found someone to show us our error and guide us to the right path for human is a place of error and forgetfulness and perfection belongs to Allah alone.",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 63
  },
  {
    "serial_number": "6207526",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Al Jarba Family in History and Literature",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "About the events of Sha'ban year 1330 AH, Al-Arab magazine said: Ibn Muhaid, head of Al-Fid'an, raided Shammar, descending in the parts of Mosul, and looted from them 300 camels all belonging to Faisal bin Farhan Pasha and returned to his lands safe. It said about this history: Ibn Muhaid, leader of Al-Fid'an and Anazah tribes, drew Shammar tribes to descend in the Jazira, and marched with his tribes and crossed the Euphrates river and passed Anah and Rawa heading to Shammar in the parts of Mosul. And it came in the magazine \"Lughat Al-Arab\" in the events of the end of the year 1329 AH about Humaidi bin Farhan: The Wilayah of Baghdad appointed Humaidi Bey bin Farhan Al Jarba as Sheikh of the Shammar tribe instead of his brother Mijwel, whose inability to maintain security in his lands became clear. When Mijwel heard that, he ordered some tribes of his followers known as \"Al-Mathluthah\" \"and the meaning of Al-Mathluthah to them is mixtures of people from separate tribes\" to alert and rob everyone who opposes them on their way and some of that happened especially on the road of Baghdad and Samarra. Perhaps the new Sheikh will realize the truth of aspirations and prevent the transit fee in his lands which is the fee known as \"Al-Khawah\", and leave raiding and maintain the security of roads and encourage his tribes to farming and agriculture and disarming and approaching the causes of progress and civilization and urbanization. And in the events of 1928 AD Lughat Al-Arab magazine said: The government of Sham intends to make the presidency of Shammar tribes by election to know the measure of reliance of those tribes on which of the two Sheikhs: and the two Sheikhs are Daham Al-Hadi and Mish'al Al-Faris. And in the events of the year 1930 AD it said: His Excellency Sheikh Mish'al Al-Faris head of Shammar tribes in Syria came to our capital and he had taken refuge in Iraq two months ago and he is consulting our government to settle his tribes in Iraq. And in the events of 1927 AD \"Lughat Al-Arab\" magazine said: It is narrated that Sheikh Daham Al-Hadi and Sheikh Mish'al Al-Faris finished collecting Al-Wadi \"camels tax\" from Shammar tribes occupying the lands of Syria so Sheikh Daham collected the Wadi of \"Al-Kharsa\" tribe and Sheikh Mish'al Al-Faris collected the Wadi of \"Al-Thabit\" and \"Al-Fadaghah\" from \"Sinjara\" tribe with the Wadi of \"Al-Amud\" tribe. And about the month of Ramadan year 1330 AH \"Lughat Al-Arab\" said: More than a year ago a dispute occurred between Sheikh Aday Al Jarban and Rashid Al-Dabbuni, because the government gave Sheikh Aday the lands of Al-Ghubayshiyah from the annexes of Al-Bughaila and Al-Jazira to farm, so Rashid tried to take it from his hand but did not succeed and Rashid was killed, then Nazim Pasha returned Aday to his lands and settled him in them, but the judiciary sentenced Aday and his tribe in absentia so they are now asking mercy from the government to pardon them asking mercy from the government to pardon them. And it said about the events of the end of the year 1330 AH: Shammar tribes marched with their horses and camels from Mosul to Iraq under the presidency of Sheikh Humaidi Bey and camped at Ain Al-Arnab at a distance of two days west of Baghdad. Their number is estimated at two thousand horsemen heavily armed. They are awaiting the order of Prince Ibn Al-Rashid to join him and act by his counsel \"from Al-Riyadh\": The more correct is that they came for provisions (Imtiyar). And about the month of Muharram year 1331 AH it said: The Shammar tribe crossed Baghdad and Mesopotamia, led by their supreme head Humaidi Bey bin Farhan Pasha, heading to the district of Al-Jazira then Kut Al-Imara and from there to the brigade of Al-Munfaq, for the fertility of its pasture and cheapness of living in it, and with them Al-Qusait also head of the second division. 1",
    "foot_note": "None",
    "book_id": "318",
    "new_page_number": 64
  }
]