[
  {
    "text": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them\nAuthor: عرام بن الأصبغ السلمى (عاش في القرن الثالث الهجري)\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6862\nbook_title: أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/992\nbook_id: 992\nauthor_name: عرام بن الأصبغ السلمى (عاش في القرن الثالث الهجري)\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1133\nauthor_ID: 1133\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 65\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6266294",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 0,
    "volume_number": 1,
    "text": "Category: Countries and Journeys\nBook: Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them [Printed within the book \"Nawadir al-Makhtutat\" (Rare Manuscripts)]\nAuthor: 'Arram ibn al-Asbagh al-Sulami (Lived in the 3rd Century Hijri)\nInvestigation (Editing): Abd al-Salam Harun\n\n[Repeated metadata omitted for brevity as it duplicates the above lines exactly in the source text]",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 3
  },
  {
    "serial_number": "6266295",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 373,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nPresentation\n\nThis is the eighth collection of \"Nawadir al-Makhtutat\" (Rare Manuscripts), and it includes the book of 'Arram ibn al-Asbagh al-Sulami on (The Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them). It also includes the (General Indices) for the second volume of Rare Manuscripts, according to the system followed in the first volume.\n\nI had promised to publish this book in the first collection of \"Nawadir al-Makhtutat,\" but the opportunity to publish it did not arise at that time. Circumstances concurred that led me to publish it separately outside the scope of Rare Manuscripts. Then I saw fit to fulfill the promise I made, so I am republishing it within the scope of the Anecdotes (Nawadir) in an edition that is more complete and illuminating than that first edition.\n\nThis second edition is distinguished by the addition of several corrections and comments that came to us after the performance of the first edition, as well as some corrections and comments by the Professor Sheikh Hamad al-Jasir. Among its distinguishing features is the holding of an investigative comparison between my first and second editions of the book and the edition of the friend and erudite scholar Abd al-Aziz al-Maymani al-Rajkuti, Professor at Aligarh University in India [India]. Also, the addition of the page numbers of the original manuscript.\n\nThe system of Nawadir al-Makhtutat required that I cancel the indices specific to this treatise to merge them into the General Index for this second volume of the Anecdotes, which is appended to this collection. I did not retain any of those specific indices except for the index of Plants and Animals, because they have no counterpart in the General Indices.",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 4
  },
  {
    "serial_number": "6266296",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 374,
    "volume_number": 1,
    "text": "Introduction to the Investigation for the First Edition (1)\n\nTihamah: \"Tihamah\" is a word whose indication varies severely. It extends in length from Aden [Yemen] to the borders of Al-Sham [Levant] running parallel to the coast of the sea, and it sometimes shrinks from the north or from the south. The ancient geographers differ on this. Perhaps the truest evidence for this is what 'Arram mentioned at the beginning of this book of his, that the first of the mountains of Tihamah is \"Radwa\", which is a day's journey from Yanbu [Saudi Arabia]. It seems that this expansion and contraction occurred in various eras as a result of the political or tribal authority that prevailed in that region or retreated from it.\n\nHowever, the language aids us completely in this issue, as the derivation of Tihamah is from \"Al-Taham\", which is the changing of the wind, its stagnation, and the intensity of the heat. Thus, the coastal extension from the south of Yemen [Yemen] to the borders of Al-Sham [Levant] is what this naming applies to.\n\nAnyone referring to the statements of ancient scholars will understand that the division of the Arabian Peninsula is subject to some extent to the Hejaz [Hejaz], which is the extended mountain range that separates two contrasting geographical sections of the Peninsula: one is elevated, which is Najd [Najd], and the other is lower than it and sunken, which is the Ghor (depression) of Tihamah. The Sarat of this mountain, meaning its heights, is what is called Al-Sarat, extending from the furthest Yemen to the nearest Sham. By geographical nature, Tihamah is the narrow depression that runs parallel to the Sea of Qulzum [Red Sea],",
    "foot_note": "1. I published this edition in a separate book on the date of the beginning of Jumada al-Thani, year 1372 AH.",
    "book_id": "992",
    "new_page_number": 5
  },
  {
    "serial_number": "6266297",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 375,
    "volume_number": 1,
    "text": "striking from the Arab side of the Sinai Peninsula [Egypt] to the furthest south of the lands of Yemen [Yemen]. Its width varies greatly; between Al-Tur and Suez [Egypt], it is a narrow part of the coast (1). The widest place in Tihamah is the coast of Jeddah [Saudi Arabia]. There is Tihamah of Yemen, and Tihamah of Hejaz.\n\nTihamah of Yemen was in some eras a province existing on its own, especially during the Persian conquest of Yemen at the end of the sixth century AD. Then, the Banu Ziyad governed this Tihamah later, and its capital was \"Zabid\" [Yemen], then it became a province subject to the Imams of Sanaa [Yemen]. There is another Tihamah outside the Arabian Peninsula, which is on the western shore of the sea, and it is (Tihamah of Abyssinia), mentioned by Ibn Khordadbeh (2), and he means by that what is known today as the coast of \"Eritrea\" [Eritrea].\n\nAs for the Tihamah that 'Arram means in this book of his, it is (Tihamah of Hejaz) without doubt. He makes its first northern mountains \"Radwa\", which is a day from Yanbu [Saudi Arabia] and seven stages from Medina [Saudi Arabia], and its southern limit is Taif [Saudi Arabia] and its villages.\n\nAlthough the appearance of this book is that it is specific to the mountains of Tihamah and its inhabitants and what relates to it, the reality is that it includes discussion of Tihamah and Hejaz. We find that what pertains to Tihamah ends when it approaches three-fifths of the book, i.e., on page 49. Then we find a chapter devoted to the border of Hejaz, dealing with many of the towns, villages, mountains, and Hejazi locations adjacent to Medina [Saudi Arabia]. Although their mention came as a consequence of mentioning Tihamah due to their contiguity and proximity to it, they obtained an ample share of 'Arram's attention and occupied an authentic place in the book.\n\nWhen you reach the conclusion of the book, you find this text: \"The book of the names of the mountains of Mecca and Medina and what connects to them is completed.\" This text might suggest that they are two books, one for Tihamah and the other for Mecca and Medina. The matter is only as I mentioned regarding 'Arram's digression, and that the word \"Kitab\" (book) only means what he wrote...",
    "foot_note": "1. See Encyclopedia of Islam (Tihamah).\n2. Al-Maktaba Al-Jughrafiya (6: 155).",
    "book_id": "992",
    "new_page_number": 6
  },
  {
    "serial_number": "6266298",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 376,
    "volume_number": 1,
    "text": "in this area. The ancients did not mention for 'Arram any book except this one, \"Book of the Names of the Mountains of Tihamah\", and from it, narrators and authors quote.\n\nAttribution of this book:\nThis book is attributed to \"Abu al-Ash'ath al-Kindi (1)\", who is Abd al-Rahman ibn Muhammad ibn Abd al-Malik, and he is the one who narrated the book directly from \"'Arram\". I did not find a biography for Abu al-Ash'ath, but it is likely that he is from the men of the third century, as his Sheikh \"Ibn Abi Sa'd\" died in the year 274 [Note: The text says 174 here but footnote 3 on page 395 corrects Ibn Abi Sa'd's death to 274, likely a typo in this specific line or referring to birth? Context suggests 3rd century scholar]. It is strange that Yaqut did not attribute the book to 'Arram in his introduction, but attributed it to him in different places within the body of the book.\n\nThis book is also attributed to \"Al-Sakuni\". Al-Bakri said: \"And all that he cited in this book from Al-Sakuni is from the book of Abu Ubayd Allah ibn Bishr al-Sakuni (2) on the mountains of Tihamah and its localities; he carries all of that from Abu al-Ash'ath Abd al-Rahman ibn Muhammad ibn Abd al-Malik al-Kindi, from 'Arram ibn al-Asbagh al-Sulami the Bedouin.\"\n\nI referred to the texts that Al-Bakri attributed in his dictionary to Al-Sakuni and found many of them exceeding our book here, which indicates that \"Al-Sakuni\" made the book his basis in narration but added to it many comments and additions, as was the custom of many ancient narrators of books.\n\nExamples of this include what appeared on page 659 of Al-Bakri's dictionary: \"Al-Sakuni said with his chain of narration from Musa ibn Ishaq ibn 'Umarah who said: We passed by Al-Bughaybighah with Muhammad ibn Abd Allah ibn Hasan and it was inhabited. He said: Do you marvel at it? By Allah, you will die until not a green thing remains in it, then you will live, then you will die. And Al-Sakuni said in mentioning the waters of Damrah: Al-Bughaybighah, Ghayqah, and the tails of Al-Safra were...",
    "foot_note": "1. Introduction to Mu'jam al-Buldan by Yaqut, p. 8.\n2. This Al-Sakuni is also a Kindi like Abu al-Ash'ath, for Al-Sakun, with a Fatha on the Seen, is a branch of Kinda.",
    "book_id": "992",
    "new_page_number": 7
  },
  {
    "serial_number": "6266299",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 377,
    "volume_number": 1,
    "text": "waters for Banu Ghifar of Damrah. Al-Sakuni said: Al-Abbas ibn al-Hasan used to frequently describe Yanbu [Saudi Arabia] to Al-Rashid, so he said to him one day: Bring its description closer to me. So he said: O Valley of the Palace, what an excellent Palace and Valley... a home for a settler if you wish, or a nomad. You find its small boats anchored at the basin... and the lizard, the fish, the sailor, and the saffron/wine.\" This is a clear text that it is not from 'Arram's book, and not from what Al-Sakuni narrated from 'Arram.\n\nAnd on page 811: \"Al-Sakuni narrated from his men from Tariq ibn Abd al-Rahman, who said to Sa'id ibn al-Musayyib: We passed by the Mosque of the Tree and prayed in it. He said: And from where is that known? He said: I heard people saying it...\" etc. This is a comment on \"Al-Hudaybiyyah\" and its mosque, which is the Mosque of the Tree, and this is not from 'Arram's book at all.\n\nAnd this is a third text not from 'Arram's book nor from his method in his book. Al-Sakuni (1) said: If you want to collect the sadaqah (charity tax) of the Bedouins up to Al-'Ajz - meaning the rear of Hawazin - you depart from Medina [Saudi Arabia] and descend at Dhu al-Ghussa, which belongs to the Sultan, and collect from Banu 'Uwal of Banu Tha'labah ibn Sa'd. Then you descend at Al-Abraq, Abraq al-Hima, which belongs to Banu Abi Talib. Then you descend at Al-Rabadhah, then 'Urayj, which belongs to Haram ibn 'Adi ibn Jusham ibn Mu'awiyah. Then you descend at Al-Ma'izah - and it is said Al-Ma'iziyah - which belongs to Banu Amir, of Banu al-Baka'. Then you descend at Batn Turabah and collect from Hilal ibn Amir and Al-Dabab. Then you descend at Tarim which belongs to Banu Jusham. Then you descend at Al-Sayy and collect from Banu Hilal. Then Nasifah, which belongs to Banu Zaman ibn 'Adi ibn Jusham. Then Al-Shisah, which belongs to Banu Zaman also. Then you graze [or pass Tur'a], which belongs to Banu Jada'ah. Then you come to Buwanah.\n\nThis is damning evidence that Al-Sakuni's book on the mountains of Tihamah is a free narration of 'Arram's book that relied on many comments and digressive additions, and Al-Bakri was loose in his expression in the statement I quoted from him.\n\nRegardless, this copy of ours has a noble chain of transmission (Isnad), narrated by Al-Sirafi, who is said to have written a book on the Arabian Peninsula, from Abu Muhammad al-Sukkari, from Abu Sa'd, from Abd al-Rahman ibn Muhammad ibn Abd al-Malik known as Abu al-Ash'ath al-Kindi, from 'Arram.",
    "foot_note": "1. Mu'jam Ma Asta'jam 1236.",
    "book_id": "992",
    "new_page_number": 8
  },
  {
    "serial_number": "6266300",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 378,
    "volume_number": 1,
    "text": "'Arram ibn al-Asbagh al-Sulami:\nWe have not found a biography for 'Arram, except what Ibn al-Nadim (1) mentioned casually when listing the names of the Bedouins who entered the metropolis. He mentioned him as a peer of Abu al-Haytham the Bedouin, Abu al-Mujib al-Rab'i, and Abu al-Jarrah al-'Uqayli. He mentioned him by his full name, \"'Arram ibn al-Asbagh al-Sulami\". It seems he was one of the Bedouins of Banu Sulaym who used to roam the lands and learn their paths, thereby gaining truthful expertise. The derivation of \"'Arram\" is from 'Aramah, meaning intensity, strength, and fierceness. It is said: The child was 'arim ('aramna) and became fierce ('aruma) against us, meaning he became ill-natured, or it is said he became merry and insolent, or it is said he became corrupt. \"Al-Asbagh\" is his father's name, taken from Al-Asbagh, which is a horse whose forelock has turned completely white, or a bird whose tail has turned white.\n\n'Arram the Grammarian:\nAs for the 'Arram mentioned by Ibn al-Nadim in Al-Fihrist (1), and Al-Qifti (2) in Inbah al-Ruwat, he is a nickname for one of the grammarians. 'Arram is not the name of that grammarian but a nickname for him; his name was Abu al-Fadl al-Abbas ibn Muhammad, or Al-Mufaddal ibn Abbas ibn Muhammad. This grammarian was, as they mentioned, impudent, foolish, and light-witted, and he is undoubtedly different from 'Arram ibn al-Asbagh, whose book this is considered one of the most important geographical documents, and indeed one of the authentic mother references.\n\nThe Original Copy:\nThe original of this copy is unique in the libraries of the world, and it is preserved in the Sa'idiyya Library in Hyderabad [India] in a collection numbered (365 Hadith), and its date goes back to the year 876. The copy is in six folios, meaning twelve pages, with 25 lines on each page. The page size is 18 ... 20. It is difficult to read, written in an obscure, poor Naskh script with much neglect of dots, and it is full of distortion (tahrif) and misspelling (tashif). I have overcome the...",
    "foot_note": "1. Ibn al-Nadim 127 Egypt edition, 86 Leipzig edition.\n2. Inbah al-Ruwat, Part Four of Volume Two, p. 399, photocopy of the Egyptian National Library.",
    "book_id": "992",
    "new_page_number": 9
  },
  {
    "serial_number": "6266301",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 379,
    "volume_number": 1,
    "text": "difficulty in it by referring to geographical dictionaries, primarily Yaqut's Dictionary (Mu'jam al-Buldan) and Al-Bakri's Dictionary, as they have encompassed most of the texts of this book despite what they also contain of misspelling and distortion. I also consulted language dictionaries and other books in all the arts required for investigation, sparing no effort to make this book appear as close as possible to soundness.\n\nInvestigation of this book:\nI knew nothing about the existence of this book except what frequently caught my eye when reviewing geographical dictionaries mentioning ('Arram ibn al-Asbagh al-Sulami), until the day I met the generous friend (Sheikh Sulayman al-Sani'). I had begun a scientific work aiming to publish rare small manuscripts, from which I produced two collections containing nine rare books under the name \"Nawadir al-Makhtutat\". The brother informed me that he had a manuscript worthy of publication, which is this book of 'Arram, and promised to send it to me from Hejaz [Saudi Arabia] so I could investigate and publish it. He fulfilled what he promised and sent the copy to me. I found it to be a manuscript from the year 1368, copied from a version transcribed by Sheikh Ibrahim Hamdi, the director of the Sheikh al-Islam Arif Hikmat Library in Medina [Saudi Arabia], from the Indian copy. This copy of Brother Sheikh Sulayman had been cared for by him through revision and verification of some of its places. Then the venerable Sheikh (Sayyid Muhammad Nasif) kindly wrote to me, supporting Sheikh Sulayman's wish with his own noble wish, and sent me another copy transcribed by Sheikh Abd al-Rahman ibn Yahya al-Yamani from the Indian original with precision, mastery, and conformity to the original.\n\nBut all that did not satisfy my scientific conscience, since the original of the book exists and it is possible to obtain it. So I seized the opportunity of the trip of the dutiful brother (Professor Rashad Abd al-Muttalib) to India [India] in a mission for the Arab League to bring photocopies of its precious manuscripts. I recommended him to bring with him a copy of 'Arram's book. He had the great credit of being able to procure it, so it was the original I relied upon in publishing this book. Thanks are due to the brother (Sheikh Sulayman al-Sani') for the favor he extended by introducing me to this...",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 10
  },
  {
    "serial_number": "6266302",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 380,
    "volume_number": 1,
    "text": "book and the good he offered, and to the brother (Professor Rashad Abd al-Muttalib) who had the credit of procuring the copy of the original from India [India]. It does not escape me to make the conclusion of this word of mine thanks to the two noble gentlemen (Sayyid Muhammad Nasif) and (Sayyid Yusuf Zaynal), for the generous interest they showed in publishing this book, and what they undertook of spending on its printing, as a contribution to spreading knowledge and fulfilling the trust.\nCairo [Egypt], at the beginning of Jumada al-Thani, year 1372 (1)\nAbd al-Salam Harun",
    "foot_note": "1. This is the date of the first edition, and it appeared distorted by a typographical error previously, reading year 1373.",
    "book_id": "992",
    "new_page_number": 11
  },
  {
    "serial_number": "6266303",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 381,
    "volume_number": 1,
    "text": "Critique of the First Edition\n\nThat is what I wrote in the preface of my first edition of 'Arram's book. I was greatly pleased that about three months after the appearance of this edition, a scientific critique of it appeared by the pen of the scholar brother Sheikh Hamad al-Jasir, member of the Arab Scientific Academy in Damascus [Syria], in the Academy's Journal Vol. 28: Issue 3, pp. 396-402 dated Shawwal 1372, and Issue 4, pp. 592-599 dated Muharram 1373.\n\nI am one of those who admire criticism greatly and see it as a completion of fulfilling the scientific trust carried by all scholars, not borne by one of them alone. I also see that whoever conceals the trust is sinful against it and against science. So it was natural for me to receive that criticism with joy, and it was also natural for me to turn a blind eye to what the critic sometimes rushes into of language that resembles the impulses of a victor in the heat of battle, for they are impulses from which few have protected their human selves.\n\nI had previously called for criticism among literati to follow a high path of modes of expression, and to be free from personal factors. I wrote long ago, among what I wrote in Al-Thaqafa Magazine, Issue 647, May 1951: \"Literary criticism is no longer, as it was yesterday, defamation and libel against the criticized. Rather, it is time that we adopt seriousness regarding what touches the standings of literati and their scientific dignity, for stumbling is a matter that happens to all literati; no one doubts this except the deluded, the insane, or the weak-souled. The matter of criticism is nothing more than assistance and discussion of opinion, or participation in guiding to the truth. Criticism is forever a servant of science, and is not a trivial type of satire arts; rather, it is a high art approached by the literatus with a tolerant character and noble discourse.\"\n\nIn this spirit, which I cherish and whose inspiration I truly believe in, I publish the beginning of Professor Al-Jasir's word, a generous word that I had hoped would be free from some lapses that...",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 12
  },
  {
    "serial_number": "6266304",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 382,
    "volume_number": 1,
    "text": "marred some of its features. But perfection belongs to Allah alone.\n\nI return here to say: The copy that reached us of 'Arram's book is deeply rooted in misspelling and distortion, difficult to read, such that it puts the investigator in a struggle with every one of its words, and sometimes between every letter of the letters of its words. Whatever effort and endeavor an investigator exerts, he is not able to edit it completely. Therefore, I also declare my joy with what this treatise obtained of verifications, corrections, and comments by the generous critic Professor, totaling over twenty. The reader will see the effect of what I found correct from these criticisms and comments in their places, Allah willing.\n\nProfessor Al-Jasir thought of us that we had seen Professor Al-Maymani's edition when investigating the first edition, and that we hid that from the readers!! This is a naive accusation for which we hope for him a wide forgiveness from Allah. For I did not see this copy for the first time until the afternoon of Thursday, 11 Shawwal 1374, in the house of his friend and our friend Professor Rashad Abd al-Muttalib.\n\nHere is what the critic Sheikh wrote in the beginning of his speech, coupled with my sincere thanks and my sincere admonition as well:",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 13
  },
  {
    "serial_number": "6266305",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 383,
    "volume_number": 1,
    "text": "Names of the Mountains of Tihamah\nAuthored by: 'Arram ibn al-Asbagh al-Sulami\nInvestigated by: Abd al-Salam Harun, Assistant Professor at Cairo University [Egypt]\n\nThe publishing of this treatise has a story we summarize by saying that Sheikh Ibrahim al-Kharbutli, Director of the (Sheikh al-Islam) Library in Medina [Saudi Arabia] (died 1371), visited India [India] in the year 1357. He saw the erudite investigator Sheikh Abd al-Aziz al-Maymani, member of the Arab Scientific Academy, copying it. He helped him in comparing what he copied against the original, and he copied a version himself which he brought to Hejaz. When he passed through Jeddah [Saudi Arabia], he stayed as a guest of the noble, gracious Sayyid Muhammad Husayn Nasif and showed him this copy. Sheikh Nasif copied it and showed it to many of those concerned with knowledge among scholars and others. Among those who copied it from Sheikh Nasif's copy was Sheikh Sulayman al-Sani'. He exerted a commendable effort in correcting it by comparing what was in it against Mu'jam al-Buldan, Mu'jam Ma Asta'jam, and other books, since Sheikh Al-Kharbutli's copy had much distortion and error, in addition to what was in the original of that.\n\nWhen he visited Egypt [Egypt], he informed Professor Abd al-Salam Muhammad Harun about the matter of this treatise so he could publish it in a collection of rare treatises (1), and he sent him a copy after returning from Egypt. However, he did not publish it, but said in the introduction to the second collection of (Nawadir al-Makhtutat) p. 116: \"I had intended to publish in this collection the book of 'Arram ibn al-Asbagh al-Sulami on the Names of the Mountains of Tihamah... but I learned that the Erudite Abd al-Aziz al-Maymani al-Rajkuti had published this book, so I preferred to postpone doing so until I see his copy.\"\n\nAs for Sheikh Al-Maymani, he published the treatise - as Professor Abd al-Salam mentioned - in the magazine of the Oriental College published in the city of Lahore in Pakistan [Pakistan]: (Oriental",
    "foot_note": "1. Meaning Nawadir al-Makhtutat.",
    "book_id": "992",
    "new_page_number": 14
  },
  {
    "serial_number": "6266306",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 384,
    "volume_number": 1,
    "text": "College Magazine), after writing an introduction for it describing the original, speaking about the author of the treatise, and referring to something of the news of the Sa'idiyya Library where it was found.\n\nSheikh Muhammad Nasif wanted to publish this treatise - because he had not seen what Sheikh Al-Maymani published - so he sent it to the (Arab Scientific Academy). It was returned to him and he was told: So-and-so - the writer of this article - should undertake correcting it. So he sent it to me, but I saw that investigating it usefully required obtaining a photostatic copy (photograph) of the original. I expressed to Sheikh Nasif the unsuitability of his copy for publication before comparing it against the original with precise comparison. So he sent it to Sheikh Abd al-Rahman al-Mu'allimi al-Yamani - who was then in India [India] among those in charge of publishing books printed by the Osmania Encyclopedia in (Hyderabad) - so he compared it against the original precisely, and copied another copy from the original which he sent to Sheikh Nasif. By comparing that copy, it appeared that Sheikh Al-Kharbutli's copy had much distortion and error.\n\nThen Sheikh Muhammad Nasif saw fit to publish the treatise, and that Professor Abd al-Salam Harun should undertake publishing it. The Cultural Department of the Arab League had sent Sayyid Muhammad Rashad Abd al-Muttalib to India [India] to photograph some rare Arabic manuscripts. Among what he photographed was the original of this treatise. I was keen when I was in Cairo [Egypt] to see the copy photographed by the Cultural Department, but I was unable to do so despite the connection between me and Sayyid Muhammad Rashad - which I consider strong - and he had kindly lent me a copy of the copies printed by Professor Al-Maymani. I contacted the venerable Professor Sheikh Muhibb al-Din al-Khatib and spoke with him on the subject of publishing it, but he said: The matter requires the existence of a copy of the original.\n\nPerhaps Allah intended good for this treatise - by reviving and investigating it by an investigating scholar of expertise, knowledge, and long endurance, who is Professor Abd al-Salam Harun. We have no blame to direct at our brothers in Egypt [Egypt] whose private circumstances might prevent us from seeing what we wish to see of the books we have a right to see -",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 15
  },
  {
    "serial_number": "6266307",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 385,
    "volume_number": 1,
    "text": "especially the manuscripts of the Cultural Department - yes, we have no right to blame them, for perhaps they have an excuse we are ignorant of. However, we know - as they know - that mutual support, assistance, and cooperation in the path of knowledge are matters that must be prioritized over every consideration.\n\nAs for our word about Professor Abd al-Salam - in his investigation of this treatise - it contains some disagreement with him regarding the investigation, a disagreement I did not wish for, as disagreement is evil in all its aspects, but the duty of science mandates it. I have said in words published in (Al-Risalah, the Journal of the Scientific Academy, Al-Fath Magazine, and Al-Hajj Magazine) that some of our university brothers like Professor Mustafa... and Professor Dr. Zaki... undertook the investigation or translation of some works in a manner not befitting their high scientific standing. I feared that what was said about some famous scholars satisfying themselves with putting their names on the work intended for investigation, while entrusting the matter to some of their brothers who do not reach their standing - I feared this might be true.\n\nAs for Professor Abd al-Salam, I absolve him of this stigma, because I have witnessed from the effects of his work in investigating some ancient works what I have not witnessed from many who concern themselves with that. I wished to find in this treatise what I found in other books he investigated, or more than what I found. However - although I saw in it what pleases, benefits, and entertains - I saw all this as little compared to what I expected from the Professor. To indicate my saying, it behooves me to mention some of what I saw in need of more care.\n\nProfessor Abd al-Salam did not indicate that the Erudite Al-Maymani published this treatise (1), and scientific honesty and acknowledging every right holder's right mandate not concealing the effort of this investigator (2)",
    "foot_note": "1. How does this align with what the Professor quoted from my words in the introduction of this article p. 373, pp. 19-20?\n2. Thus did Professor Al-Jasir's pen and tongue volunteer to slip this slip which does not befit a man who knows me well, and knows my keenness to note the merit of every person of merit, especially the Erudite Al-Maymani, whose merit almost no book of mine fails to mention. I was his partner in publishing Khizanat al-Adab with the late Ahmad Taymur Pasha. The connection between me and him is close and is not harmed by such a claim.",
    "book_id": "992",
    "new_page_number": 16
  },
  {
    "serial_number": "6266308",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 386,
    "volume_number": 1,
    "text": "who is unknown to no researcher in Arabic literature for his favors in the path of investigating many literary books, nor is his merit and knowledge denied. I would not be exaggerating if I say that his effort in investigating this treatise is not less than the effort of Professor Abd al-Salam, if not surpassing it. For example, Al-Maymani clarified 'Arram's condition and era, mentioning that he was from the people of the second and early third century (1) and that he was among those who entered Khorasan with Abd Allah ibn Tahir in the year 217. These are among the matters that Professor Harun missed, and they are indispensable matters, as knowing the author is the most important thing a book investigator cares for.\n\nIt might be said that the Professor is ignorant of the fact that Al-Maymani undertook the investigation of this treatise. But this is refuted by several things:\n1 - That he declared knowledge of that before commencing the investigation of the treatise.\n2 - That Sayyid Muhammad Rashad Abd al-Muttalib, whom Professor Harun said he recommended to bring a photocopied version of the original treatise and he brought it, had brought at the same time a copy of Al-Maymani's investigation (2).\n3 - That I published in Al-Risalah last year the news of Professor Al-Maymani's publication, during my critique of Al-Saqqa's edition of the book (Mu'jam Ma Asta'jam). And Abd al-Salam is not one described as not reading the (Al-Risalah) magazine, being one of those who write in it (3).",
    "foot_note": "1. As for the secret of my hiding the effort of this investigator as the Sheikh claimed, it is that I had not seen this effort yet, so how could I reveal something that was still in the unknown to me?!! And how can it be said I hid what had not appeared to me yet?!\nAs for the secret of my not seeing Al-Maymani's copy which Professor Rashad Abd al-Muttalib brought from India, the Sheikh himself revealed it by saying in this article: \"and he had kindly lent me a copy of the copies printed by Professor Al-Maymani.\" Therefore, this copy which Professor Al-Jasir detained did not fall into my hands, and I despaired of seeing it until 11 Shawwal of this year of ours, as I previously said.\n1. This matches exactly what I mentioned in my first edition p. 6 lines 5-6 of the introduction, but the Professor refuses except to seek lapses of accusation.\n2. I sought the help of logic and a large group of my friends sought help to find an inevitable conclusion to this related to my person, but these conclusions eluded them. The reality is that the photocopied version arrived with the India mission in their bags by plane, whereas the books, including Professor Rashad's private books, arrived by sea two months later.\n3. But they do not read everything in it, and they might miss reading an entire issue. This is what happened to me, for I, with deep regret, did not read this critique by the Professor, and I will try to benefit by reading it, Allah willing.",
    "book_id": "992",
    "new_page_number": 17
  },
  {
    "serial_number": "6266309",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 387,
    "volume_number": 1,
    "text": "This matter - the publisher ignoring the predecessor's effort in investigating what he publishes - is something criticized in Professor Al-Saqqa and some university scholars. We wished for Professor Abd al-Salam Harun to be above it (1).\n\nProfessor Abd al-Salam said in the introduction to the treatise: \"The original of this copy is unique in the libraries of the world, and it is a manuscript in the Sa'idiyya Library in Hyderabad [India] in a collection numbered 355 Hadith, and its date goes back to the year 876. The copy is in six folios (meaning twelve pages).\"\n\nThus said the Professor, but we find Professor Al-Maymani, when describing the treatise, saying: \"There exists in the Sa'idiyya Treasury in Hyderabad a collection containing 27 treatises on Hadiths and Men (Rijal). The first is 'Khalq Af'al al-Ibad' by Al-Bukhari. The completion of its writing corresponded to 18 Jumada al-Ula year 786. It is established on the margin of the epilogue: Comparison reached against the original transmitted from in sessions, the last of which was on the night dawning into Thursday of Dhu al-Hijjah the Sacred, year 787, its scribe Muhammad ibn Ali. But despite this empty claim, it is a sign in misspelling and distortion. The number of 'Arram's book in it is 16, between pages 151 - 159, meaning it fell in nine pages only.\"\n\nThis is what Professor Al-Maymani said, and it contradicts Professor Abd al-Salam's description regarding the date of copying and the number of pages. Which of them is correct in speech? It appears Al-Maymani is the correct one (2), and that Professor Abd al-Salam quoted the copying date from Sulayman al-Sani's copy, who copied it from a copy whose original is Al-Kharbutli's copy, in which the date appeared as Professor Harun mentioned. However, when Sheikh Nasif sent it to India to be compared against the original, Professor Abd al-Rahman al-Yamani corrected this place, as appeared in Professor Al-Maymani's copy. Added to that is that the sample the Professor reproduced photographically in his copy has nothing of the copying date, although it is the end of the treatise. It appears that those who photographed it photographed it alone while it was devoid of the date, so Professor Abd al-Salam relied on what was in Professor Al-Sani's copy, which is a mistake.\n\nAfter Professor Ahmad [Hamad] al-Jasir presented these criticisms in two articles in the Academy's magazine, he said at the conclusion of his speech:",
    "foot_note": "1. We ask Allah for Professor Al-Jasir forgiveness for what he accused us of evil, and we recite in that His saying, Mighty and Majestic: \"And to remit is nearer to piety.\"\n2. That might be regarding the date of copying, for my photocopy is devoid of it, and I relied on what reached me from Sheikh Sulayman al-Sani's copy. As for the number of pages, it is a pure allegation by the Professor, for the copy is in my hand and I turn it over repeatedly. I was keen in this edition to indicate the beginnings of these pages (the twelve), not the nine as the Sheikh quoted from the Erudite Al-Maymani.",
    "book_id": "992",
    "new_page_number": 18
  },
  {
    "serial_number": "6266310",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 388,
    "volume_number": 1,
    "text": "\"This is what I saw fit to present of what I observed regarding this treatise investigated by Sayyid Abd al-Salam Muhammad Harun, Assistant Professor at Cairo University. I do not want to diminish his right or belittle his work, for he is too majestic for his merit to be denied. I consider myself above being characterized by a bad trait, but I wanted to participate in highlighting this treatise by making the benefit from it complete. The Professor has undertaken - in this path - a commendable undertaking, referring to 32 books of general references, and placing comprehensive indices for the treatise for place names, proper names, tribes, plants, animals, rhymes, and language, and decorating it with many useful footnotes, and vocalizing the place names. So his work in this treatise - like his work in others of the many books he investigated - came out useful and beneficial.\"\n\nIt does not escape me to repeat praise and thanks to the venerable Erudite Professor. May Allah inspire us and him with success and correctness.",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 19
  },
  {
    "serial_number": "6266311",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 389,
    "volume_number": 1,
    "text": "Book of the Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them\n\nThe narration of Al-Sirafi with his chain of transmission to 'Arram ibn al-Asbagh al-Sulami",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 20
  },
  {
    "serial_number": "6266312",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 391,
    "volume_number": 1,
    "text": "Image of the first lines of the original copy\nImage of the last lines of the original copy",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 21
  },
  {
    "serial_number": "6266313",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 395,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. My Lord, facilitate with good. Amen.\n\nAbu Sa'id al-Hasan ibn Abd Allah al-Sirafi (1) said: Abu Muhammad Ubayd Allah ibn Abd al-Rahman al-Sukkari (2) informed us, reading to him. He said: Abd Allah ibn Amr ibn Abd al-Rahman al-Warraq, known as Ibn Abi Sa'd (3), told us. He said: Abd al-Rahman ibn Muhammad ibn Abd al-Malik Abu al-Ash'ath told us. He said: 'Arram ibn al-Asbagh al-Sulami dictated to me, saying:",
    "foot_note": "1. He is Al-Hasan ibn Abd Allah ibn al-Marzuban Abu Sa'id, the Judge Al-Sirafi, the Grammarian. His origin is from Siraf [Iran]. He lived on the East Side in Baghdad [Iraq] and held the judiciary there. His father was a Magian who converted to Islam, named Bahzadh, so he named him Abu Sa'id Abd Allah. He was one of the most knowledgeable people in the grammar of the Basrans, and followed the doctrine of the people of Iraq in jurisprudence. He read the Quran under Abu Bakr ibn Mujahid, and language under Abu Bakr ibn Durayd, and studied grammar under both. He read grammar under Abu Bakr ibn al-Sarraj and Abu Bakr al-Mubraman; one of them read readings to him and the other studied arithmetic under him. He was an ascetic who only ate from the earning of his hand and did not leave his house to the council of judgment and teaching every day until he copied ten pages for which he took a wage of ten dirhams. He has a commentary on Sibawayh's Book, the Book of News of Grammarians, the Book of Persuasion in Grammar, and the Book of the Arabian Peninsula. He was born before 290 and died in the year 368. Tarikh Baghdad (7: 341-342), Bughyat al-Wu'at 221, Mu'jam al-Udaba (8: 145-232), Al-Buldan (5: 193), Nuzhat al-Alba 379.\n2. He is Ubayd Allah ibn Abd al-Rahman ibn Muhammad ibn Isa, Abu Muhammad al-Sukkari. He heard Zakariya ibn Yahya al-Manqari the companion of Al-Asma'i, Muhammad ibn al-Jarud al-Warraq, Ibrahim ibn al-Walid al-Jashshash, (Abd Allah ibn Abi Sa'd al-Warraq), and Abd Allah ibn Muslim ibn Qutaybah. Al-Ja'abi, Abu Umar ibn Haywayh, Ahmad ibn Ibrahim ibn Shadhan, and Abu al-Hasan al-Daraqutni narrated from him. He was a majestic trustworthy person. Died year 323. Tarikh Baghdad 5499. In the original: \"Ubayd Allah ibn Abd Allah\", a distortion.\n3. In the original: \"Abu Sa'id\", distorted. He is Abd Allah ibn Amr ibn Abd al-Rahman ibn Bishr ibn Hilal, Abu Muhammad al-Ansari al-Warraq, known as Ibn Abi Sa'd. Originally from Balkh [Afghanistan], he lived in Baghdad [Iraq] and narrated there from Al-Husayn ibn Muhammad al-Marwazi, Affan ibn Muslim, Sulayman ibn Harb, Hawdhah ibn Khalifah, Sulayman ibn Dawud al-Hashimi, and others. Ibn Abi al-Dunya, Abd Allah ibn Muhammad al-Baghawi, (Ubayd Allah ibn Abd al-Rahman al-Sukkari), Al-Husayn ibn al-Qasim al-Kawkabi, Al-Husayn ibn Isma'il al-Mahamili, and others narrated from him. He was trustworthy, a man of news, literature, and anecdotes. Born year 197 and died year 274. Tarikh Baghdad 5144.",
    "book_id": "992",
    "new_page_number": 22
  },
  {
    "serial_number": "6266314",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 396,
    "volume_number": 1,
    "text": "Names of the mountains of Tihamah and their inhabitants, and what villages are in them, and what trees grow on them, and what waters are in them.\n\nThe first of them is (Radwa) [Mount Radwa, Saudi Arabia], a day from Yanbu [Saudi Arabia], and seven stages from Medina [Saudi Arabia] to the right of the Medina road, and to its left is the road of Al-Barira (1) for one ascending to Mecca [Saudi Arabia], and it is two nights from the sea. Opposite it is ('Azwar (3)) [Mount Azwar, Saudi Arabia]. Between it and Radwa is the road of Al-Ma'raqah (4) which the Arabs use as a shortcut to Al-Sham [Levant], to Mecca, and to Medina. Between the two mountains is the extent of a horse run. They are two lofty, impregnable mountains that no one aspires to climb. Their vegetation is Shawhat (Yew?), Qaraz (Acacia), and Ranf (6), which is a tree resembling the Dahya'. The Dahya' is a tree resembling the jujube; camels and sheep eat it, and it has no fruit. The Dahya' has a fruit resembling the gallnut which is not eaten and has no taste or scent.",
    "foot_note": "1. Al-Bakri 655: \"Al-Barr\", a distortion.\n2. In Al-Maymani's copy: \"bi-hidha'ihi\" (opposite him), distorted from what is in the original.\n3. With a Fatha on the first letter and Sukun on the Zay. The origin of the meaning of 'Azwar is bad-tempered. Umar ibn Abi Rabi'ah says about it:\nShe signaled that the tribe's departure time has come ... but your appointment is 'Azwar.\nAnd Kuthayyir says:\nShe kept pace with the pilgrims from Batn Nakhlah ... and from 'Azwar and Al-Khabt, Khabt Tufayl.\n4. Yaqut vocalized it with a Damma on the Meem, Sukun on the Ayn, and Kasra on the Ra. Then he said: It was narrated with Shadda on the Ra and Takhfif (lightening), which is the [correct] aspect, as if it is the road taking towards Iraq. Al-Bakri vocalized it with Fatha on the Meem and Ra. This road was taken by other than Quraysh when the Battle of Badr occurred.\n5. Shortening the road: taking the nearest one.\n6. With Sukun on the Nun. Abu Hanifa said: \"Of the mountain trees, its leaves fold to its branches when night comes, and spread out by day.\"",
    "book_id": "992",
    "new_page_number": 23
  },
  {
    "serial_number": "6266315",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 397,
    "volume_number": 1,
    "text": "And in both mountains are waters of Awshal - and the Washal is water that exits from its peak; no one approaches it (1) nor is its source known. None of those Awshal exceeds the shiqqah (distance/cleft) (2). He recited about the Ranf (3) describing a mountain:\nIts playing grounds are Ranf, so the casting of its Sayyal ... are channels of Awshal whose flowing water crawls (4).\nTheir peaks and precincts (5) are inhabited by Nahd and Juhaynah, specifically the Wabar (Bedouins) excluding the Madar (settled people), and they have apparent wealth there. The two mountains pour into the valley of (Ghayqah), and Ghayqah pours (6) into the sea, and it has Masak (7), which are places (8) that hold water, singular Masak.\n\nFrom the right of Radwa for one descending from Medina to the sea, at a night's distance from Radwa (9) is (Yanbu) [Saudi Arabia]. It has a pulpit (Minbar) and is a large, thriving village. Its inhabitants are the Ansar, Juhaynah,",
    "foot_note": "1. La Yaturuha: Does not hover around it nor approach it. In Al-Maymani's copy: \"min shawahiqihi\" (from its peaks), distorted from what is in the original.\n2. Al-Bakri: \"With Kasra on its first letter and Shadda on its second.\" And he has 327: \"As for Al-Bathnah, with Sukun on its second and Fatha on the Nun, on the weight of Fa'lah, it is land towards Suwayqah in Medina. Abd Allah ibn Hasan ibn Ali ibn Abi Talib worked it with the money of his wife Hind bint Abi Ubaydah ibn Abd Allah ibn Zam'ah and made its springs flow. It is Al-Bathnat. Before marrying her, he was destitute (miqlat). When Al-Bathnat was developed, he said to her: Whatever you step over of Al-Bathnah is yours. So she walked the length of Al-Khayf across three rows of palms. It is the right of her son Musa from him, who is called Al-Shiqqah.\"\n3. In the original: \"anshadani al-ramth\" (he recited to me al-ramth). Al-Maymani made it in his copy: \"wa anshada fi al-ramth\" (and he recited about al-ramth). Both are distortions. Ranf was mentioned previously on p. 396.\n4. Al-Sayyal like Sahab: A tree with white thorns, a type of 'Idah. Al-Madafi': Channels/Streams, singular Madfa' with Fatha on Meem. In the original: \"yudafi'u\".\n5. Al-Dhara with Fatha: Shelter and shade. Al-Ahwaz: Areas/Sides, plural of Hawzah. Similarly Hadbah and Ahdab, Dhutah and Adhwat. In the original: \"ajwaruhuma\". See Al-Hamdani 117, 120.\n6. Written thus in the original to be read with Ta and Ya together.\n7. In the original: \"masak\", distorted.\n8. In the original: \"wa huwa mawdi'\" (and it is a place).\n9. Yaqut added from 'Arram: \"from Medina at seven stages, and it belongs to Banu Hasan ibn Ali.\"",
    "book_id": "992",
    "new_page_number": 24
  },
  {
    "serial_number": "6266316",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 398,
    "volume_number": 1,
    "text": "and Layth also. It has abundant sweet springs. Its valley (Yalil) pours into Ghayqah. (And Al-Safra (1)) [Saudi Arabia] is a village with many palms and farms, and its water consists entirely of springs. It is above Yanbu towards Medina. Its water flows to Yanbu. It belongs to Juhaynah, the Ansar, Banu Fihr, and Nahd. Radwa is in the direction of the sunset from it. Around it are Qinan - singular Qunnah (peaks) - and small Da'adi' (hills) - singular Da'da'. Qinan and Da'adi' are small mountains that are not named.\n\nIn this Yalil is a large spring emerging from inside the sand, among the freshest of springs and most abundant in water. It flows in sand, so it does not enable cultivators [to farm] upon it except in few places (2) in the bends of the sand. In it are palms, and vegetables and melons are grown. This spring is called (Al-Buhayr (3)).\n\n(Al-Jar (4)) [Saudi Arabia] is on the shore of the sea. Ships anchor there from the land of Abyssinia [Ethiopia] and Egypt [Egypt], and from Bahrain [Bahrain/Eastern Arabia] and China [China]. It has a pulpit and is a large populated village. Its people's drinking water is from Al-Buhayr. In Al-Jar are many palaces. Half of Al-Jar is on an island in the sea, [and half of it is on the coast. Opposite Al-Jar is an island in the sea (5)] about a mile by a mile, which is not crossed to",
    "foot_note": "1. It is also called \"Al-Sufayra\". 'Asil ibn Ghaziyah said:\nThen we poured down the mountains of Al-Sufr turning away ... from the left, and on our rights were Jubad.\nHe meant the mountains of Al-Safra, but the meter did not fit for him so he pluralized it and what followed it. Al-Bakri 836.\n2. In the original: \"kathirah\" (many), corrected from Al-Bakri 836 and Yaqut under (Al-Buhayr, Yalil).\n3. And so in Yaqut. In Al-Bakri 826: \"Al-Buhayrah\".\n4. The origin of \"Al-Jar\" is what is close to the houses from the coast, as in Al-Lisan. Yaqut said: A city on the coast of the Sea of Qulzum [Red Sea], between it and Medina is a day and a night, and between it and Ayla is about ten stages, and to the coast of Al-Juhfah is about three stages. In the original: \"wal-khabaw\".\n5. This necessary completion is from Yaqut and Al-Bakri under (Al-Jar). The Erudite Al-Maymani did not notice this completion.",
    "book_id": "992",
    "new_page_number": 25
  },
  {
    "serial_number": "6266317",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 399,
    "volume_number": 1,
    "text": "except (1) in ships. It is a port (2) for Abyssinia specifically. [It is called (3)] (Ghuraf). Its inhabitants are merchants like (4) the people of Al-Jar. They are brought water from two farsakhs away. The valley of Yalil pours into the sea (5).\n\nThen from the left bank of Ghayqah towards (6) Medina on the right of one ascending to Mecca from Medina, and on the left of one ascending from Al-Sham [Levant] to Mecca, are two mountains called (Thafil al-Akbar) and (Thafil al-Asghar) [Mount Thafil/Jabal Subh, Saudi Arabia]. They belong to Damrah (7) specifically. They are people of Halal (settlements) (8), grazing (9), and wealth. Between them is a pass not the distance of an arrow shot. Between them and Radwa and Azwar is two nights. Their vegetation is 'Ar'ar (Juniper), Qaraz, Zayyan, Ayda', and Basham. The Zayyan has a thick stem, and it is thorny - meaning thick with thorns - and is used for firewood. It has a pod like the pod of the 'Ashraq. The Sanfah (pod): what hangs down from the fruit and exits from its branches. 'Ashraq: leaves resembling Handaquqa (Sweet Clover), foul-smelling.\n\nThe Ayda': a tree resembling the Dulb (Plane tree) (1). Except that its branches are closer together than the branches of the Dulb. It has a red flower that you do not find to have a good scent (2), and it has no fruit. The Messenger of Allah, peace be upon him, forbade breaking any of its branches, or [those of] the Sidr (Lote tree), the Tandub, and the Shubhan (3), because all of these possess shades in which people dwell (4) from the cold and heat.\n\nThe Tandub (5) has a fruit called Hamqa', resembling the Apricot (6), eaten and sweet. The Sarh (7) has a fruit called A' (8), resembling the Banana and sweeter than it, bearing very much fruit.",
    "foot_note": "1. This word is established in the original, but Al-Maymani thought it missing so he established it in brackets.\n2. In the original: \"barih\", corrected from Al-Bakri. In Yaqut: \"marsa\" (anchorage).\n3. Completion from Yaqut and Al-Bakri.\n4. In the original: \"al-bahr\" (the sea), corrected from Yaqut in (Al-Jar, Furat). Al-Bakri's phrase: \"and likewise the inhabitants of Al-Jar\".\n5. Al-Bakri said: \"This is Al-Sakuni's statement, but the correct [view] is that Yalil pours into Ghayqah, and Ghayqah pours into the sea.\"\n6. This word is missing from Al-Maymani's copy.\n7. Damrah ibn Bakr ibn Abd Manaf ibn Kinanah ibn Khuzaymah ibn Mudrikah, as mentioned by Yaqut in (Thafil). He said in its derivation: \"Al-Thafl in the language: what settles (thafala) of everything.\" Al-Bakri vocalized it with Kasra on the Fa and Fatha.\n8. Al-Halal: plural of Hillah, with Kasra, which is a group of people's houses, because they settle (tahullu). Kura' said: It is one hundred houses.\n9. Al-Ra'iyah, with Kasra: a noun from Ra'y (grazing), as in Al-Lisan from Al-Lihyani. In the original: \"wa da'ah\", and in Yaqut: \"wa raghbah\", and Al-Bakri: \"wa ra'a\". I established what the comparison of readings requires.",
    "book_id": "992",
    "new_page_number": 26
  },
  {
    "serial_number": "6266318",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 400,
    "volume_number": 1,
    "text": "The Ayda': a tree resembling the Dulb (Plane tree) (1). Except that its branches are closer together than the branches of the Dulb. It has a red flower that you do not find to have a good scent (2), and it has no fruit. The Messenger of Allah, peace be upon him, forbade breaking any of its branches, or [those of] the Sidr (Lote tree), the Tandub, and the Shubhan (3), because all of these possess shades in which people dwell (4) from the cold and heat.\n\nThe Tandub (5) has a fruit called Hamqa', resembling the Apricot (6), eaten and sweet. The Sarh (7) has a fruit called A' (8), resembling the Banana and sweeter than it, bearing very much fruit.",
    "foot_note": "1. Abu Hanifa: Al-Dulb: a tree that grows huge and wide, having no blossom or fruit. It has serrated, wide leaves resembling grape leaves, singular Dulbah. Yaqut said: Linguists other than 'Arram ibn al-Asbagh differ regarding Al-Ayda'. Some said it is Saffron, citing Ru'bah's saying:\nAs a pilgrim in Ihram avoids Ayda' ...\nSome say: It is Dragon's Blood (Damm al-Akhawayn). Some said it is Brazilwood (Bakkam). The correct view to us is 'Arram's statement, because he is a Bedouin from those lands, and he knows the trees of his land best. An excellent witness to 'Arram's statement is Kuthayyir's saying where he said:\nAs if the loads of the people when they departed ... were a cut branch of palm or a cut branch of Ayda'\n2. Yaqut: \"not of good scent\".\n3. This word is missing from Yaqut. It is with Fatha on Sheen and Ba, or Damma: a type of 'Idah.\n4. Yaqut: \"dunaha\" (under them).\n5. In the original: \"wa lil-sidr\" (and for the Sidr), a distortion. The known fruit of the Sidr is Nabq. As for \"Al-Hamqa'\" with Damma on Ha and Fatha on Meem, lightened or stressed, it is the fruit of the Tandub, singular Hamqa'ah, as in Al-Lisan and Al-Mukhassas (11: 188). Indeed, Kura' said: The Hamqa' is the Tandub itself. Yaqut did not mention this phrase, but Al-Bakri mentioned it in (Arthad).\n6. Ibn Durayd doubted the correctness of its Arabic origin. It is with Kasra on both Meems, or Fatha, or Damma, as in Taj al-Arus. Dawud al-Antaki, died year 1008, mentioned that what is called \"Qamar al-Din\" is made from it.\n7. This is a digression by him, otherwise it was not mentioned before. Al-Sarh: plural of Sarhah, which are large, huge trees under which people settle in summer and build houses.\n8. In the original: \"al-laska\". The known fruit of the Sarh is \"Al-A'\", singular \"A'ah\". In Al-Mukhassas (11: 189): The Sarh has a grape called Al-A', singular A'ah, which people eat and prepare rob (thick juice) from. It first has a bud (baramah) in which this A' comes out, and it resembles the Olive. There is no contradiction between 'Arram comparing it to the Olive and Ibn Sidah comparing it to the Banana, for one resemblance might be for shape and the other for taste.",
    "book_id": "992",
    "new_page_number": 27
  },
  {
    "serial_number": "6266319",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 401,
    "volume_number": 1,
    "text": "And in Thafil al-Akbar (Greater Thafil) there are several wells in the belly of a valley called (Yarthad). The wells are called (Al-Dabab), and it is abundant fresh water that is never exhausted; they are *anashit* (1) [shallow], the depth of a stature each. In Thafil al-Asghar (Lesser Thafil), there is water in a round tract of land in its hollow called (Al-Qahah (2)); they are two fresh, abundant wells. They are two large, towering mountains, and all the mountains of Tihamah grow *Ghadur*. Between them and Radwa and Azwar is seven stages (3). Between these mountains are small mountains and *qaradid* (4), and what is adjacent to each mountain is attributed to it. For one returning from [Medina] ascending [towards Mecca], the first mountain he encounters on his left is (Warqan (5)). It is a great black mountain, as great as mountains can be, extending from Sayalah to Al-Muta'asha (6) between Al-Arj and Al-Ruwaythah. Al-Muta'asha is also called Al-Jayy (7). In Warqan, there are all types (8) of fruit-bearing trees [and non-fruit-bearing (9)], and in it are Acacia (*Qaraz*),",
    "foot_note": "1. Plural of *Nashat*. A well is called *Nashat* meaning near the bottom [shallow], from which the bucket comes out with a single pull.\n2. The meaning of *Al-Qahah* and *Al-Bahah* is the same, which is the middle of the house. Yaqut said: 'Al-Qahah has been mentioned in it with Fa' and Jim [Al-Fahah/Al-Jahah].' It is mentioned in the books of Seerah regarding the 'Farewell Pilgrimage'. See *Imta' al-Asma'* 512. It was also mentioned in the path of the Hijrah. See *Al-Seerah* 333 Gottingen.\n3. Plural of *Qardad*, which is what has risen from the earth and become hard.\n4. In my first edition, it appeared as: 'wa Azwar wa Yanbu' marahil', which was a mistake of mine in reading the manuscript. Al-Maymani read it correctly as I have established here, and Sheikh Hamad mentioned it in his corrections. He pointed out that it is so in Al-Bakri's dictionary, under entry (Thafil).\n5. With a Fatha on the first letter and a Kasra on the second, as Al-Bakri and Yaqut recorded it. Yaqut said: It is also narrated with a Sukun on the Ra'. Jamil recited: O my two friends, indeed Buthayna departed ... The day of Warqan, leaving the heart plundered. I say: Only poetic necessity permitted this change.\n6. Neither Yaqut nor Al-Bakri created an entry for it, but they mentioned it in the entry of (Warqan).\n7. Yaqut created an entry for it, but Al-Bakri did not; rather he created an entry for Jayy with a Fatha on the Jim, which is the city of Isfahan.\n8. This word fell out of Al-Maymani's copy.\n9. The completion is from Yaqut, Al-Bakri, and Al-Samhudi 2: 390. The scholar Al-Maymani did not include it.",
    "book_id": "992",
    "new_page_number": 28
  },
  {
    "serial_number": "6266320",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 402,
    "volume_number": 1,
    "text": "Sumac (1), Pomegranate, and *Khazam* (2). The people of Hijaz call Sumac 'Al-Dhamkh (3)' and the people of Najd (4) call it 'Al-Artan', the singular is *Artanah* (5). *Khazam* is a tree whose leaves resemble the leaves of papyrus (*Bardi*), and it has a trunk like the trunk of a palm tree, from which excellent ropes are made. In it [Warqan] are water seepages (*awshal*), springs, and rock pools (*qilat*). Its inhabitants are Aws from Muzaynah, people of columns [tent-dwellers] and wealth, and they are a truthful people. At its foot on the right is (Sayalah (6)), then (Al-Rawha (7)), then (Al-Ruwaythah (8)), then (Al-Jayy). Above it (9) between it and White Quds is a mountain path, or rather a pass (10), called (Rakubah).",
    "foot_note": "1. Dawud said: A tree approaching the pomegranate in height, except that its leaves are downy and delicate. Abu Hanifa said: It has sour fruit in clusters containing small grains that are cooked. He said: I do not know of it growing in any of the land of the Arabs except what was in Al-Sham [Levant]. But Arram's text contradicts Abu Hanifa's statement. Among the districts of Aleppo is a great mountain called 'Jabal al-Summaq' due to the abundance of what grows in it.\n2. Abu Hanifa: *Khazam*: A tree exactly like the Doum palm, having branches and small unripe dates that turn black when ripe; it is bitter and astringent, people do not eat it but crows are greedy for it and frequent it. See Arram's explanation that follows.\n3. In the original: 'Al-Dhabh', a corruption, its correction is in Al-Bakri.\n4. Al-Bakri: 'And the people of Al-Janad'.\n5. In the original: 'Artunah', and this would only be a singular for 'Artun' like 'Zarjun', which is one of many dialects for 'Artan' mentioned in *Al-Lisan* and *Al-Qamus*.\n6. Its mosque: One of three mosques built during the time of the Messenger of Allah (peace be upon him), the second is the Mosque of Al-Harrah, and the third is the Mosque of Al-Shajarah. As for other mosques, they are places where he (peace be upon him) prayed, which were taken as mosques after him.\n7. Urwah bin Hizam says about it (Al-Amali 3: 158): Oh, bear me, may Allah bless you both ... To the settled folk of Al-Rawha, then leave me.\n8. Diminutive of *Rawthah*, which is a single piece of animal dung, or the *rawthah* (tip) of the nose.\n9. The scholar Al-Maymani read it 'yaflis', but its script in the original does not support that. In Al-Samhudi 2: 390: 'yafsil' (separates).\n10. *Thaniyah*: The road of the *Aqabah* (pass). Abu Mansur said: *Aqab*: Tall mountains crossing the road, so the road takes through them. Every traveled pass is a *Thaniyah*, and its plural is *Thanaya*.",
    "book_id": "992",
    "new_page_number": 29
  },
  {
    "serial_number": "6266321",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 403,
    "volume_number": 1,
    "text": "And (Quds (1)), this is a towering mountain extending to Al-Muta'asha between Al-Arj and Al-Suqya, then it is cut off (2) between it and Black Quds by a pass called (Hamat). The vegetation of both Quds mountains is Juniper (*Ar'ar*), Acacia (*Qaraz*), *Shawhat*, and *Shaqb* (3): a tree having shoots resembling the ridges on a sword (4), from which bows are made. Both Quds mountains belong to Muzaynah, and their wealth is livestock of sheep (5) and camels; they are people of columns [tent-dwellers]. There are many water seepages in them. Facing them (6) from the right (7) of the ascending road are two mountains called (Nahban): Lower Nahb and Upper Nahb. They belong to Muzaynah, and Banu Layth have a share in them. Their vegetation is Juniper and *Ithrar* (8). Tar may be made from *Ithrar* just as it is made from Juniper; and in them is Acacia (*Qaraz*). They are high, towering, and large. In Upper Nahb there is water in a round tract of land, a single large well with abundant water, upon which are melon patches (9), vegetables, and small palm trees (10), called (Dhu Khayma (11)), and in it are water seepages.",
    "foot_note": "1. Al-Anbari said: Quds is feminine and does not decline (*la tujra*) - meaning it is diptote - a name for the mountain and what is around it. But Arram treated it as triptote here as will follow. Al-Bakri also treated it as triptote in the entry of (Arah).\n2. In the original: 'sa'ta' with unpointed letters.\n3. With a vowel on the second letter or a Kasra. Al-Maymani made it 'Al-Sakb', which is an oversight by him.\n4. *Al-Usru'*: The shoot, which is what grows around the tree from its base. *Al-Shatbah*: The ridge of the sword prominent on its blade.\n5. Thus in the original, Al-Maymani made it 'Al-Sha'' (sheep/goats).\n6. In the original: 'yuqabiluha' (faces her/it).\n7. Al-Maymani read it thus despite it being unpointed in the original. Sheikh Hamad believes the correct reading is 'yamin' (right).\n8. Its explanation will come on page 408.\n9. Plural of *mabtakhah*, a place for melons.\n10. Al-Maymani made it 'nakhalat' (palms), and there is no need for this change.\n11. Thus in Yaqut under entry 'Nahban' and Al-Zamakhshari in Kitab al-Jibal 166-167 and in Al-Bakri under his entry and in (Quds 1052), and likewise Al-Hamdani in Sifat Jazirat al-Arab 176 'Dhu Khaym'. But in Al-Bakri under entry (Al-Arj): 'Al-Munbajis'.",
    "book_id": "992",
    "new_page_number": 30
  },
  {
    "serial_number": "6266322",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 404,
    "volume_number": 1,
    "text": "In Lower Nahb there are *Awshan* (1), and the road separates them from Quds and Warqan, and in it is (Al-Arj). The valley of Al-Arj is called (Masihah (2)), its vegetation is *Markh*, *Arak*, and *Thumam*. On the left of the road facing Black Quds (3) is a mountain of the highest height, called (Arah). It is a red mountain from whose sides springs burst forth (4); at every spring is a village. Among them is a large, lush village called (Al-Fara' (5) [Al Fara, Saudi Arabia]), which belongs to Quraysh, the Ansar, and Muzaynah. And among them is (Umm al-Iyal (6)), a village that is the charitable endowment (*sadaqah*) of Fatimah, daughter of the Messenger of Allah, peace be upon him (7). Above it is a village called (Al-Madiq (8)). And among them is a village called (Al-Mahdah (9)), and a village called (Al-Wabrah (10)), and a village called (Khadrah (11)), and a village",
    "foot_note": "1. Al-Maymani thought it was missing from the original, but it is fixed in it.\n2. Thus in Al-Bakri in 'Quds' quoting Al-Sakuni. In the original: 'Fasihah', a corruption. Yaqut mentioned in (Samihah) three dialects, said with diminutive, magnification, and placing the Mim first as here.\n3. Thus the quotation from him appeared in Yaqut in the entry 'Arah'. See what preceded on p. 403.\n4. Thus in the original and Al-Samhudi 2: 239. In Yaqut: 'takhruju' (come out) and Al-Bakri: 'tanfajiru' (explode/burst). I had read it in my first edition 'takhruju'.\n5. Pronounced with one Damma or two Dammas, as Yaqut mentioned.\n6. Al-Bakri: 'Land in Al-Fara' belonging to Ja'far bin Talhah bin Amr bin Ubayd Allah bin Uthman bin Ka'b. Talhah was beautiful and handsome, so he stuck to the cultivation of the spring of Umm al-Iyal, which has great value. He stayed there and was struck by the epidemic, so he came to [Medina] having changed. Anas bin Malik saw him and said: This is the one who built his wealth and ruined his body.' See Yaqut (1: 336).\n7. Similar to what appeared in Al-Bakri 1329 that 'Al-Jathjathah: charity of Abdullah bin Hamza'. And what appeared in 743 'and many of them - i.e., the springs - are charities of Al-Hasan bin Zayd'. See a form of donating estates as charity in Al-Bakri 658.\n8. Yaqut mentioned that Banu Amir and their chief Alqama bin Ulatha raided Zayd al-Khayl, so they met at Al-Madiq. Zayd al-Khayl captured them to the last man, and among them was Al-Hutay'ah, who complained to him of poverty, so he bestowed favor upon him.\n9. From their saying 'mahada al-shay'', meaning purified it, as Yaqut mentioned.\n10. Named after the animal (*Wabr* - Hyrax), which is a small dust-colored creature the size of a cat, with beautiful eyes and intense shyness, found in the Ghor.\n11. Thus vocalized in Yaqut and Al-Bakri in its entry, and Al-Bakri also mentioned it in (Quds 1051). In the original: 'Hadrah' with an unpointed Ha, a corruption.",
    "book_id": "992",
    "new_page_number": 31
  },
  {
    "serial_number": "6266323",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 405,
    "volume_number": 1,
    "text": "called (Al-Faghwah (1)) surrounding Arah from all its sides. In all these villages are palm trees and crops. It is three stages from Al-Suqya to its left towards the sunrise. Its valley flows into (Al-Abwa [Al Abwa, Saudi Arabia]), then into (Waddan), which is a village (2) among the mother villages of Damrah, Kinanah, Ghifar, and Fihr Quraysh, then into (Al-Tarifah [on the Red Sea coast]). Al-Tarifah is a village, not large, on the seashore. The name of the valley of Arah is (Haql (3)), and [there is] a village called (Wab'an (4)). (Khalas Arah (5)) is a valley containing villages, *ajza'* (6) [winding parts of a valley], and palms. The poet (7) said about it:",
    "foot_note": "1. It is from *Al-Faghwah*, meaning the flower.\n2. This word fell out of Al-Maymani's edition, but it is fixed in the original.\n3. In Al-Bakri in his entry and in (Quds 1052): 'Haqil'. I established it in my first edition as 'Haqil', and the correction is by Sheikh Hamad conforming to what is in the original and Mu'jam al-Buldan 3: 306. Al-Samhudi in Wafa' al-Wafa 2: 292 said: 'As for Haqil, it is in Najd. And there is a vast distance between the two places.'\n4. Yaqut and Al-Bakri created entries for it, and it is with a Fatha on the Waw and Kasra on the Ba. Al-Bakri erred when he created another entry for it as (Wan'an) with a Fatha on the Waw and Nun, and referred to places where it was mentioned correctly.\n5. Nusayb says about it, as Al-Bakri narrated: And she used to dwell in the Arak trees of Khalas ... To the winding parts of Bishah and Al-Ragham.\n6. Plural of *Jaz'*, with a Kasra, which is the side of the valley and where it bends; it is said it is not called *Jaz'* until it has width that grows trees and other things.\n7. He is Abu al-Muzahim, as Al-Bakri mentioned in 449-450. The verses are in Yaqut (Khalas, Wab'an) and Al-Bakri 450, 1052. Sheikh Hamad wrote a precious comment here, and this is its text: 'Perhaps it benefits the readers to transfer some news of its sayer from the book (Al-Ta'liqat wa al-Nawadir by Abu Ali al-Hajari - Egyptian National Library copy). He said: And recited to me by 'Azlan al-Thumami, from Thumamah bin Ka'b bin Judhaymah bin Khafaf: My two friends, divert me and my saddle and my she-camel ... To Mulah al-Rayyan then leave me. If you two do not do so and pass ... By the garden of Al-Zaydi then bid me farewell. I ask about 'Umq and the goodness of its state ... And were it not for the daughter of Al-Zaydi my questioning would be little. 'Umq al-Zuru' is near Al-Fara', and 'Umq al-Madiq is by Yalyal near Badr. He said: The Zaydis are from Banu Imran -",
    "book_id": "992",
    "new_page_number": 32
  },
  {
    "serial_number": "6266324",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 406,
    "volume_number": 1,
    "text": "If at Khalas then Al-Burayra then Al-Hasha ... Then Wakad to Al-Naq'a from Wab'an (1)",
    "foot_note": "1. - from Muzaynah then from Banu Uthman. And Al-Dahna: A water pit between Marr 'Unayb and Al-Sa'irah. And he has: Visit 'Umq Dhi al-Zuru' and greet ... Even if it deviates from the intended path of the mounts. For indeed in 'Umq Dhi al-Zuru' there is an idol ... Of Aslam, speaking to them brings rewards. Do not be incapable of a need for your brother ... Even if it involves harshness and immorality. What harm would it do if the clan of the Aslamiyyah women appeared ... To us on the day of 'Umq of arms and chests. And regarding the wedding of Qannan I have an oath ... And regarding the beautiful Hanzhi women there are vows. And he has regarding Muzani women: If at Wakad then Al-Burayra then Al-Hasha ... Then Khalas to Al-Ranqa' from Wab'an. Wakad: A black edge behind Marr by Shawkan. Al-Burayra: A small hillock. Al-Hasha: A land between Marr and Shawkan, and Khalas Arah. Al-Ranqa' here: A lowland. Wab'an is in the Harrah. Friendly women from the tribe of 'Ada', both of them ... Aspiring with husbands, not singing women. They were driven mad with a madness from husbands as if they were ... Monkeys jumping in Yemeni robes. So pass and say 'Two seekers of a need' ... And return and say 'We are departing'. So they caught him in Al-Dahna - which is a deep water pit - and tied a millstone to his leg then threw him into it, so he perished. He said: This is what I transferred from the book of Al-Hajari, I cited it at length because it includes something related to the sayer of those verses. But is he Abu al-Muzahim to whom Al-Bakri attributed the verses? It appears he is: The author of Al-Taj recited one of them under entry (Waba'a) and attributed it to Abu al-Muzahim al-Sa'di. Al-Asbahani narrated in Al-Aghani Vol 11 p 79 two verses by Abu al-Muzahim, which are: They reproached me that Sulaym called me their brother ... And Sa'd gave me their oaths. It is understood from them that this Muzahim is a Sa'di who allied with Sulaym and was counted among them. Al-Hajari mentioned that the owner of the verses is Thumami from Thumamah bin Ka'b bin Judhaymah bin Khafaf. It is known that Khafaf is a clan of Sulaym. As for knowing the era of this poet, it is known from his being a contemporary of Abu Wajzah al-Sa'di the poet. This Abu Wajzah is a Tabi'i (Successor), meaning from the Islamic poets. And Al-Hajari who narrated the verses of the Epistle is from the people of the second and third Hijri centuries.'\n1. Its beginning in Al-Bakri: 'If at the winding valleys', and in the original: 'Fawwalad' corruption, its correction is in Yaqut in both places. Al-Bakri narrated 'Nukaz' and 'Farqad'. And 'Al-Naq'a' is the narration of the original and Yaqut in the entry (Wab'an), which is a place behind [Medina], and in Al-Bakri 1052 'Al-Baq'a' with Ba, which is from the land of Rukbah. And in 450 he has 'Al-Naq'ayn'.",
    "book_id": "992",
    "new_page_number": 33
  },
  {
    "serial_number": "6266325",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 407,
    "volume_number": 1,
    "text": "Maidens from the tribe of 'Ada' as if they were ... Wild cows of the sand possessing mates, not captives (1) / Driven mad with a madness by husbands as if they were ... Monkeys, competing in Yemeni robes (2). Then connected [to Khalas Arah (3)] is (Dharah (4)), which are many connected mountains, *Da'adi'* (5) [small mountains] not towering. In their peaks (6) are farms and villages; they belong to Banu al-Harith bin Bahtha bin Sulaym. Their crops are rain-fed (*A'dha'*). They call the *A'dha'* 'Al-Athari': which is that which is not irrigated [artificially]. In it are mud houses, but most of them are tents. They have springs of [water (7)] in rocks which they cannot conduct (8) to where they can utilize it (9). They have trees of *Afar*, Acacia (*Qaraz*), *Talh*, Lote trees (*Sidr*) are abundant there, *Nashm*, and *Ta'alb* (10).",
    "foot_note": "1. 'Ada' can be a verbal noun like 'Mu'adah' (enmity), and this tribe was described by it, or it can be the elongated form of 'Al-Uda' meaning enemies, elongated for poetry. In Al-Bakri 1052: 'Hayy 'Ada'', dual of Hayy (tribe). In Yaqut in (Wab'an): 'Husna ghadha' corruption. Describing the sand as having pairs refers to pairs of wild animals like cows and gazelles. Al-Awani: plural of 'An and 'Aniyah, which is the captive.\n2. The word 'tubari' is unpointed in the original despite the clarity of its letters, its reading is from Yaqut (Wab'an). In Yaqut (Khalas): 'tunadi'.\n3. The completion is from Yaqut (Dharah) from Arram. Al-Maymani did not establish it.\n4. With a Fatha on the first and lightening the second [Dharah], as in Yaqut. Al-Bakri entered it as 'Dharwah' with Fatha on the first and Sukun on the second with the addition of Waw, and quoted Al-Sakuni's text therein.\n5. Explained previously on p. 398.\n6. 'Al-Dhura' explained previously on p. 397. In the original and Al-Maymani's copy: 'duraha' instead of 'fi dhuraha', corrected in Yaqut.\n7. Completion from Yaqut and Al-Bakri.\n8. Thus in Yaqut. In Al-Bakri: 'ijra'uha'.\n9. This word fell out of our first edition.\n10. Mentioned in dictionaries under (Alb) and (Ta'alb). Ibn Sidah said: Ta'alb is among the best woods from which bows are made, its habitats are the mountains of Yemen, and it has clusters like clusters of the terebinth. When it matures and dries, it is pressed for lamps, and it is better for them than oil. The caterpillar falls on the Ta'alb tree and strips it of its leaves. Al-Mukhassas (11: 142).",
    "book_id": "992",
    "new_page_number": 34
  },
  {
    "serial_number": "6266326",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 408,
    "volume_number": 1,
    "text": "Bows and arrows are sometimes made from *Nashm*; it consists of branches (*khaytan*) with no leaves (1). *Ithrar* (2) has leaves resembling thyme leaves and thorns like pomegranate thorns; its fire is struck (3) when it is dry, so it ignites quickly. *Afar* has white blossoms with a pleasant scent like lily (*Sawsan*) (4). Surrounding Dharah is a village called (Jabalah) to its west (5), and (Al-Sittarah) is a village connected to Jabalah. Their valley is one, called (Lahf (6)), and it has springs. They claim that Jabalah is the first village established in Tihamah. In Jabalah there are formidable fortresses built with rocks that no one dares attack. To the east of Dharah is a village called (Al-Qa'r) and a village called (Al-Shar' (7)); both are eastern. In each of these villages are farms and palms on springs. They are on a valley called (Rakhim). At its bottom is a village called (Dhar'aa) containing palaces (8), a pulpit (*minbar*), and fortresses.",
    "foot_note": "1. Ibn Sidah did not add in Al-Mukhassas (11: 142) in describing Nashm more than it is of the best woods. In Al-Lisan: A mountain tree from which bows are made, and it is of the best woods. And (*khaytan*) here is the plural of *khut*, with Damma not *khayt* with Fatha. *Khut*: The tender branch. He recited in Al-Lisan (Khut): Oh, how lovely is the sound of the Ghadha tree when a south wind ... rustles its branches (*khaytan*) after sleep. The scholar Al-Maymani thought it was an error and made it 'idan' (sticks) instead of 'khaytan', which is an oversight by him.\n2. With Kasra on the Hamza as in Al-Qamus and Al-Lisan. In Al-Qamus it is called (Al-Anbarbaris) and in Al-Lisan it is called in Persian (Al-Zarik), correctly (Zirishk) as in Tadhkirat Dawud in entry (Ambaris) and Steingass dictionary 615.\n3. The word is unpointed in the original. Al-Maymani read it 'tarah' and it is not so.\n4. Dawud said: It is in Greek 'Iris', meaning rainbow, due to the varying colors in the flower.\n5. 'In its west' fell out of Al-Maymani's edition.\n6. With Fatha on the Lam as Yaqut stated in its entry.\n7. Yaqut said: Derived from *shara'a al-ihab* (skinning the hide), if it is split and not skinned as a bag or from the legs. It is the widest method of skinning.\n8. In the original: 'qaryah biha laha sar'a yadur', and its correction is in Yaqut under entry 'Dhar'aa'.",
    "book_id": "992",
    "new_page_number": 35
  },
  {
    "serial_number": "6266327",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 409,
    "volume_number": 1,
    "text": "Hudhayl (1) and Ghadirah bin Sa'sa'ah (2) share it with Banu al-Harith. Then connected [to it] is (Shamansir), which is a smooth, round mountain (3) that no one has ever ascended, nor is it known what is on its summit; at its top are monkeys. It is said: Most of its vegetation is *Nab'*, *Shawhat*, and the waters around it are springs (4) with palms and wild figs (*Hamat*) (5). In all the mountains of Tihamah there is *Shaqah* (6), a plant in its *Harud* (7) and lower parts - and *Harud* (8): the sides. *Hamat*: Fig. *Shaqah*: *Ribas* (9). Surrounding Shamansir among the villages is a large village called (Rahat (10)), which is in a valley called (Ghuran (11)). He recited:",
    "foot_note": "1. Yaqut: 'Yashtarik bayn al-Harith fiha Hudhayl', and this is a corruption. These Banu al-Harith are Banu al-Harith bin Bahtha bin Sulaym, as preceded on p. 407.\n2. Ghadirah: A clan from Banu Ghalib bin Sa'sa'ah bin Mu'awiyah bin Bakr bin Hawazin. Taj al-Arus 3: 450. It appeared in my first edition as 'Amir bin Sa'sa'ah' due to a reading error. It is correct in Al-Maymani's edition.\n3. *Al-Mulamlam*: The round, gathered together.\n4. 'And the waters around it are springs' fell out of Al-Maymani's edition.\n5. *Al-Hamat*: Mountain fig tree. In the original 'Al-Hamad' here and in the following place. The correct is what I established.\n6. In the original here and in what follows 'Al-Shaqh' is a corruption. He interpreted it later as 'Al-Ribas'. *Al-Shaqah*, like 'Rumman': the Caper plant, as in Al-Lisan. In Al-Mu'tamad by Ibn Rasul al-Ghassani 282: 'And the Caper that is in the very hot country is like the Caper that is in Tihamah'. And *Al-Ribas* is a Persian word, Steingass said in his dictionary 601 interpreting it: A Sour herb. It applies to Caper and *Shaqah*.\n7. *Al-Hurud*: The edges of the mountain. As in Al-Qamus (Harad). In the original here: 'Haruzuha' and in what follows 'Al-Harur', the correct is what I established.\n8. 'And its lower parts and the *Harud* are the sides', all fell out of Al-Maymani's copy.\n9. See footnote number 6.\n10. With Damma on the Ra'. Ibn al-Kalbi said: 'Hudhayl took Suwa' as a lord in Rahat'.\n11. In Al-Bakri in (Shamansir): 'Ghurab', a corruption. He said in (Ghuran): 'Fa'al from *Al-Gharin*, and *Al-Gharin* and *Al-Gharil* is the mud from which water recedes and dries at the bottom of the pond'.",
    "book_id": "992",
    "new_page_number": 36
  },
  {
    "serial_number": "6266328",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 410,
    "volume_number": 1,
    "text": "For indeed Ghuran is the belly of a valley I love ... To its inhabitant, there is a firm covenant upon me (1) / To its west is a village called (Al-Hudaybiyah [Al Hudaybiyah, Saudi Arabia] (2)), not large, and opposite it is a small mountain called (Da'adi'). Near it is a large dam (*Habs*) where water collects. A *Habs*: stones gathered and placed one upon another. The poet said: / And indeed my turning towards the dam of (Da'adi') ... And the turning of my eye towards Al-Zuba is long (3) / These small villages belong to Sa'd and Banu Masruh, and they are the ones among whom the Messenger of Allah, peace be upon him, grew up. Hudhayl has something in them, and Fahm as well. Their waters are *Buthur*, which are shallow wells (*Ahsa'*) and springs, not deep wells (4). From Al-Hudaybiyah to [Medina] is nine stages, and to [Mecca] is a stage and a mile or two miles. To the right of Arah is the road for the ascender (Al-Hasha (5)), which is the mountain of (Al-Abwa [Al Abwa, Saudi Arabia]). It is in a valley called (Al-Ba'q), a valley on its left flank [a valley] called (7) (Shass). It is a land of thirst and epidemic (8), camels cannot survive there; thirst (*Hiyam*) overtakes them from stagnant waters in it",
    "foot_note": "1. 'uhibbuhu' (I love it), is what is in Al-Bakri. In the original: 'habbahu' with neglect [unpointed]. In Yaqut 'Jannah' (garden). And 'covenant' is in Yaqut and Al-Bakri: 'Aqd'.\n2. With lightening of the Ya and stressing it. Named after a humped tree that was in that place. In the Hadith, it is a well. Some of Al-Hudaybiyah is in the Hill (profane territory) and some in the Haram (sanctuary).\n3. Yaqut: 'Aynayya al-Zuba' with dual eyes. Al-Zuba: A valley in Tihamah. In the original: 'Ayni fi al-siba', and in Al-Bakri: 'Ayni al-saba', both corrupt.\n4. In the original: 'laysat biha' (not in it), corrected from Al-Bakri 810. See what will come regarding the discussion on *Al-Buthur* before the discussion on 'The Border of Hijaz'.\n5. Al-Bakri: 'And Al-Hasha belongs to Khuza'ah and Damrah'.\n6. *Al-Kanaf* and *Al-Kanafa*: The side of the thing. Sheikh Hamad said: 'But in the original as I learned from the two copies compared against it: bi-kafatihi'. I assure the Sheikh that this knowledge is wrong, and that between the Kaf and the Fa in the original is a clear pointed Nun.\n7. In the original: 'wa lahu', and the completion I established before from Al-Bakri 449 requires what I established.\n8. *Mawba'ah*, with Fatha on the Mim: He meant full of epidemic (*waba'*), and this form was not stated in the dictionaries. In the original: 'Bawbah', the correct form is what I established from Yaqut in (Shams).",
    "book_id": "992",
    "new_page_number": 37
  },
  {
    "serial_number": "6266329",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 411,
    "volume_number": 1,
    "text": "stagnant, not flowing (1) - *Al-Hiyam*: camel fever - It is a high, towering mountain with no vegetation of the earth except *Khazam* and *Basham*. It belongs to Khuza'ah and Damrah. The poet (2) said regarding Al-Ba'q: / As if you are relapsed in Shass, expelled ... The thirsty camels of the thicket of Al-Ba'q approach him (3) / And (Al-Abwa) is half a mile from it. Then (Harsha), which is in level land; it is a round hill that grows nothing. Below it is (Waddan) at two miles towards the sunset. The ascenders among the pilgrims of [Medina] cross it and pour down from it returning to [Mecca] (4). Connected to it towards the sunset on its right, between it and the sea, is a *Khabt* - *Khabt*: Sand that grows nothing but *Arta*, which is firewood, and milk skins are specifically tanned with it. In the middle of the *Khabt* is a small black mountain, intensely black, called (Tufayl). Then the mountains cease (5) from you on the right and left. On the road from the Pass of Harsha, between it and Al-Juhfah [near Rabigh, Saudi Arabia], are three named valleys:",
    "foot_note": "1. *Sakirah* with Ra, meaning still. In Al-Lisan: 'Abu Zayd, *Al-Sakir*: That which does not flow, and *sakara sukurun*, and the sea became still (*sakara*): calmed. Ibn al-A'rabi recited describing a sea: * It vomits the foam of heat when it becomes still ... In Al-Bakri 449 and Yaqut (5: 262): 'Sakinah'.\n2. It is Kuthayyir, as in Al-Bakri 796 and Yaqut in (Shass). Al-Bakri also narrated it in 449. Yaqut recited it in (Shass, Ba'q). Before it: And my two friends said the day we departed and ... Loops of the chest were opened and its seals broken / The arrows of the Hajibiyah struck you, indeed ... When she shoots, her wounded does not recover.\n3. *Al-Mardu'*: The one who relapsed in his illness. *Yuqarifuhu*: Approaches him. *Al-Uqdah*: The wooded place.\n4. In the original: 'from Mecca', corrected in Yaqut (Harsha).\n5. In the original: 'Ind' (at).",
    "book_id": "992",
    "new_page_number": 38
  },
  {
    "serial_number": "6266330",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 412,
    "volume_number": 1,
    "text": "Among them is (Ghazal (1)), which is a valley coming to you from the direction of Shamansir and Dharah. In it is well water, and it belongs specifically to Khuza'ah, who are its inhabitants, people of columns [tents]. And (Dawran (2)), which is a valley coming to you also from Shamansir and Dharah; [in it] are two known wells, one called (Rahbah (3)) and the other (Sakubah). It belongs to Khuza'ah also. The third is (Kulayyah (4)), which is a valley coming to you also from Shamansir and Dharah. All these valleys grow *Arak*, *Markh*, *Doum* - which is *Muql* (Theban Palm) - and Palm trees. There are no mountains there. In Kulayyah, on the surface of the road, is well water; the wells are called Kulayyah, and the valley is named after them. At the top of this Kulayyah are three small isolated mountains called (Shanai'k (5)), and they belong to Khuza'ah.",
    "foot_note": "1. In it is the saying of Kuthayyir, and Yaqut recited it: They took a midday nap at Usfan then departed quickly ... Rising in the evening from Ghazal.\n2. In the original: 'Dhawran', corrected in Yaqut. He recited for Kuthayyir: She called you while the white camels were hurrying with us ... The descent of Dhu Dawran then Al-Qa'. It is also called 'Dhu Dawran' as in this poetry, and as in Al-Bakri 1352. The word 'Dhu' is added often in names of places, as they said: Dhu Athayl, Dhu Jusham, Dhu al-Arja, Dhat al-Alanda, and Dhat al-Isad.\n3. Thus in Yaqut in (Dawran).\n4. In diminutive form. It was the dwelling of Nusayb, and about it he says: My two friends, if you alight at Kulayyah then Al-Ruba ... Then Dha Amaj then the She'b (path) possessing water and sour plants.\n5. Thus in Yaqut in its entry, he said: 'As if it is the plural of Shanukah including what is around it. Nasr said: Shanai'k: Three small isolated mountains between Qudayd and Al-Juhfah from the lands of Khuza'ah. It is said Shanukatan are two branches pouring into Al-Rawha between Mecca and Medina'. In Sifat Jazirat al-Arab 181: 'And Shanukatan pouring into Al-Rawha'. Yaqut said in entry (Shanukah): 'Shawkah: A mountain, and it is an improvised proper noun'. He recited for Kuthayyir: Like the purity of affection on the day of Shanukah ... And pledges from them overtook me. Al-Bakri made it 'Sanabik' and created an entry for it and in the entry of (Harsha), and said: 'Sanabik on the wording of plural of Sunbuk: gathered small mountains, mentioned in the entry of Harsha'.",
    "book_id": "992",
    "new_page_number": 39
  },
  {
    "serial_number": "6266331",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 413,
    "volume_number": 1,
    "text": "Below Al-Juhfah by a mile is (Ghadir Khumm (1) [Ghadir Khumm, Saudi Arabia]), and its valley pours into the sea. It grows nothing but *Markh*, *Thumam*, *Arak*, and *Ushar*. This Ghadir Khumm is towards the sunrise; water never leaves it from rainwater. In it are people from Khuza'ah and Kinanah, not many. Then (Al-Sharah (2)), which is a high mountain towering into the sky inhabited by monkeys. It grows *Nab'*, *Shawhat*, and *Qaraz*. It belongs specifically to Banu Layth and Banu Zafar from Banu Sulaym. It is below Usfan [Usfan, Saudi Arabia] on its left. In it is a pass that goes to the region of Hijaz for one traveling via Usfan, called (Al-Kharitah), ascending and very high. Al-Kharitah which is next to Al-Sharah is a hard [smooth (3)] mountain that grows nothing. Then one overlooks from Al-Sharah (Sayah), which is a valley between two *Hamiyahs* (4), which are two black Harrahs (lava fields). In it are many named villages and many roads from many directions. The highest of them is a village called (Al-Fari') containing many palms. Its inhabitants are from all mixed groups of people (5). Its waters are springs flowing underground, all of them are *Fuqar* (underground channels). *Fiqr* and *Qana* (6) are the same, and the singular of *Fuqar* is *Faqir*.",
    "foot_note": "1. Al-Bakri mentioned that the one who dug it was 'Abd Shams', as he also dug 'Zamma'. About them he says: I dug Khumm and I dug Zamma ... Until you see the glory for us has been completed. Al-Fakihi said in Kitab Makkah: 'People used to come to Khumm in Jahiliyyah and Islam in the early era, promenading in it and staying in it.' At it, the Messenger of Allah, peace be upon him, gave a sermon and said regarding Ali, peace be upon him: 'Whomever I am his master, Ali is his master', Shuruh Saqt al-Zand 389.\n2. With a Fatha on the Shin (dotted) and ending with Ha, as in the original and Yaqut. In Al-Bakri: 'Shara'' and he said: 'Elongated, diptote because it is a name of a land. This is the saying of Abu Ubaydah. Al-Asma'i said it has a Kasra on the end like Hadhami and Qatami'.\n3. Completion from Al-Bakri. *Al-Jald* with movement: Hard. *Al-Sald* with Fatha: That which does not grow plants.\n4. In Al-Lisan: 'Al-Hawami: Great stones and heavy ones, singular Hamiyah'.\n5. *Afna' al-nas*: Their mixtures, plural of *finw* with Kasra, weighed like *fata*.\n6. Plural of *Qanat* dug for water, also pluralized as *Qunan*, *Fu'ul*.",
    "book_id": "992",
    "new_page_number": 40
  },
  {
    "serial_number": "6266332",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 414,
    "volume_number": 1,
    "text": "Then below it is (Mahayi' (1)), which is a large lush village (2). It has many people and a pulpit (*minbar*). The governor of Sayah is from the ruler of [Medina]. In it are palms, farms, bananas, pomegranates, and grapes. Its origin belongs to the descendants of Ali bin Abi Talib, may Allah be pleased with him. In it are mixed groups of people and merchants from every land. Then a *Khayf* called (Khayf Salam (3)). A *Khayf*: What is set aside from the waterway to the right and left, widening out. In it is a pulpit and many people from Khuza'ah. Its waters are *Fuqar* (channels) as well. Its nomads are few, consisting of Jusham, Khuza'ah, and Hudhayl. This Salam (4) is a man from the wealthy of this land from the Ansar. Below that is (Khayf Dhi al-Qabr). It has no pulpit although it is populated. It has many palms, bananas, and pomegranates. Its inhabitants are Banu Masruh, Sa'd, and Kinanah (5), and diverse (6) merchants. Its water is *Fuqar* and springs issuing from both banks of the valley. It was named (Khayf Dhi al-Qabr) by the grave of Ahmad bin al-Rida (7), and it is famous for it.",
    "foot_note": "1. Yaqut said: 'As if it is the plural of *Mahya'*, which is the wide road.\n2. A lush (*ghanna'*) village: Abundant in inhabitants, buildings, and grass.\n3. I read it in the first edition: 'wa walin yantabuhu' (and a governor frequents it), which is an error corrected by Sheikh Hamad conforming to Al-Maymani's reading in his copy.\n4. Also said with lightening of the Lam in a saying mentioned by Yaqut in entry (Lawiyyah).\n5. The Waw before 'Kinanah' fell out of Al-Maymani's edition; the correct is to establish it as in the original.\n6. Meaning different/mixed, plural of *lifq* with Kasra, originally one of the two halves of a cloak. The word was written unpointed on the last letter in the original with a tendency towards curvature.\n7. Al-Rida: The title of Ali bin Musa bin Ja'far bin Muhammad bin Ali bin Al-Husayn bin Ali bin Abi Talib Al-Hashimi, Abu Al-Hasan. His son Muhammad, Abu Uthman Al-Mazini the grammarian, Al-Ma'mun bin Al-Rashid and others narrated from him. He was martyred in Tus in the year 203. Tahdhib al-Tahdhib. Ibn Qutaybah mentioned in Al-Ma'arif 169 that Al-Ma'mun sent for Ali bin Musa Al-Rida, carried him to Khorasan, and pledged allegiance to him as Crown Prince after him, and ordered people to wear green. Muhammad bin Ali bin Hamza Al-Alawi mentioned that Al-Rida had no children, male or female, except Muhammad bin Ali bin Musa, and his grave is in Baghdad in the Quraysh cemeteries. Thus, what Arram mentioned here is an error. Al-Bakri 787. See the biography of (Muhammad bin al-Rida) in Tarikh Baghdad 997.",
    "book_id": "992",
    "new_page_number": 41
  },
  {
    "serial_number": "6266333",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 415,
    "volume_number": 1,
    "text": "Below it is (Khayf al-Ni'am (1)) which has a pulpit. Its people are Ghadirah and Khuza'ah, and merchants after that and people. It has palms and farms, and falls under the governor of Usfan. Its waters are many flowing springs. Then (Usfan [Usfan, Saudi Arabia]), which is on the surface of the road, belonging specifically to Khuza'ah. It has a pulpit, palms, and many farms. Then [if you depart from Usfan you encounter (2)] the sea, and mountains and villages leave you, except for named valleys between you and Marr al-Zahran. One valley is called Masihah (3) and a valley called (Madrakah (4)). They are two large valleys with much water and palms; among them is a water called (Al-Hudaybiyah) at its bottom. They pour from the tops of the Harrah (lava field) elongating to the sea. Then (Marr al-Zahran (5) [Wadi Fatimah, Saudi Arabia]). Marr is the village, and Al-Zahran is the valley. It has many springs, palms, and sycamore figs. It belongs to Aslam, Hudhayl, and Ghadirah. Then you exit it into (Bahrayn (6)), then you aim for [Mecca] descending from a pass called",
    "foot_note": "1. Thus in Yaqut and Al-Qamus (Khayf). In Al-Bakri 787 'Khayf al-Nu'man'.\n2. Completion from Yaqut in entry (Masihah, Al-Madrakah).\n3. Yaqut created an entry for it. As for Al-Bakri, he mentioned it casually in 226, 1025. It was vocalized incorrectly in the last place. Al-Bakri and Yaqut recited for Abu Jundub al-Hudhali: To where are we driven when we have reached ... Thirsty, from Masihah, a shallow water.\n4. In the original 'yuqal amdaraka' corruption. Yaqut created an entry for Al-Madrakah and vocalized it with Damma on Mim and Fatha on Ra. Not mentioned in Al-Bakri neither as entry nor casually.\n5. Yaqut mentioned it is called 'Marr al-Zahran'. Kuthayyir Azzah said: It was named Marr for its bitterness (*mararah*). Abu Ghassan said: It was named so because in the belly of the valley between Marr and Nakhlah there is writing on a vein of the earth in white spelling (Marr) except the Mim is not connected to the Ra. Al-Bakri and Yaqut. Al-Bakri said: And in the belly of Marr, Khuza'ah was cut off (*takhazza'at*) from its brethren, so it remained in [Mecca] and its brethren went to Sham during the days of the flood of Al-Arim. Hassan said: When we descended the belly of Marr, separated ... Khuza'ah from us in encampments, the groups. Yaqut attributed the verse to Awn bin Ayyub al-Ansari.\n6. Thus it appeared unpointed with this script. Al-Maymani read it 'tariq' (road), but the script of the original does not allow that.",
    "book_id": "992",
    "new_page_number": 42
  },
  {
    "serial_number": "6266334",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 416,
    "volume_number": 1,
    "text": "(Al-Jafjaf (1)). In Najd, at the border of [Mecca], is a valley (2) called (Wadi Turabah (3) [Turabah, Saudi Arabia]) pouring into (Bustan Ibn Amir (4)). The lower part of Turabah belongs to Banu Hilal. Surrounding it among the mountains are (Al-Sharah (5)), (Yasum), (Qarqad (6)), (Ma'dan al-Baram (7)), and two mountains called (Shawanan (8)),",
    "foot_note": "1. With Fatha on both Jims. Yaqut said: 'It is in the language the wide, back-facing lowland'.\n2. Yaqut: 'And you descend at the border of [Mecca] into a valley'. I preferred Yaqut's phrase in my first edition. Sheikh Hamad said commenting on Yaqut's phrase: 'But when we know the distance of Wadi Turabah from [Mecca], we can realize the flaw here'.\n3. With Damma then Fatha, and similar in place names is 'Uranah' in [Mecca].\n4. Al-Asma'i, Abu Ubaydah and others said: Bustan Ibn Amir actually belongs to Umar bin Ubayd Allah bin Ma'mar bin Uthman bin Amr bin Ka'b bin Sa'd bin Taym bin Murrah bin Ka'b bin Lu'ay bin Ghalib, but people erred and said Bustan Ibn Amir and Bustan Banu Amir, while it is Bustan Ibn Ma'mar. Some say: attributed to Hadrami bin Amir, and others say: attributed to Abdullah bin Amir bin Kurayz. All of that is conjecture and guessing. Al-Batalyawsi said in Al-Iqtidab: Bustan Ibn Ma'mar is different from Bustan Ibn Amir. As for Bustan Ibn Ma'mar, it is the one known as Batn Nakhlah, and Ibn Ma'mar is Umar bin Ubayd Allah bin Ma'mar al-Taymi. As for Bustan Ibn Amir, it is another place near Al-Juhfah, and this Ibn Amir is Abdullah bin Amir bin Kurayz. From Yaqut.\n5. Yaqut: Al-Hijaz are mountains separating Tihamah and Najd. Their top is called Al-Sarat just as the back of a beast is called Al-Sarat. Al-Sarat: Mountains extending from Yemen to the outskirts of the deserts of Sham.\n6. I found a comment by Sheikh Hamad in his handwriting on Mr. Rashad Abdul-Muttalib's copy of Al-Maymani's edition, text: 'Qarqad is a mountain you leave while heading to [Taif] after passing the village of Al-Zaymah on your left. The people of that area call it Qardad, corruptly'.\n7. Thus in Sifat Jazirat al-Arab 121 and Mu'jam al-Buldan (7: 35, 56) and in Yaqut (in entry Ma'dan al-Baram) and Al-Zamakhshari in Kitab al-Jibal 155 'Al-Baram' with the weight of 'Qufl'. Yaqut recited for Al-Quhayf: I have settled in Ma'dan al-Barakah a settlement ... So with difficulty, yes difficulty, from Adakh I moved. And recited in Al-Lisan for Abu Sakhr al-Hudhali: Even if what I carried, its load was borne by ... The peaks of Radwa or the summits of Baram. Al-Zamakhshari said: 'Wadakh is a market with buildings and a group of people belonging to Banu 'Amilah, and it is Ma'dan al-Baram'. And 'Wadakh' which Al-Zamakhshari mentioned is a dialect for 'Adakh'. See Al-Zamakhshari 5 and Mu'jam al-Buldan (Adakh). It will come before the discussion on ([Taif]) with the wording 'Al-Baram'.\n8. Al-Bakri mentioned it in entry (Sin Muhmalah), 765 and casually with Sin Muhmalah also in 788. Al-Zamakhshari mentioned it 88 in Sin Muhmalah. As for Yaqut, he mentioned it in Shin Mu'jamah once, and another in Sin Muhmalah, and appeared to think it a misspelling. In Al-Hamdani 172 'Shawan' with dotted letter [Shin].",
    "book_id": "992",
    "new_page_number": 43
  },
  {
    "serial_number": "6266335",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 417,
    "volume_number": 1,
    "text": "one of which is Shawan. All these mountains belong to Ghamid, Khath'am, Salul, Sawa'ah bin Amir, and Anzah. All these mountains grow Acacia (*Qaraz*); they are leading mountains with gaps between them. The poet said describing a rain: A Ghori [cloud] went to Najd and its Tihami part moaned / And its dark clouds rushed between its first drops (1) / And the edges of Al-Sarat watered. In the Sarat mountains there are grapes, sugarcane, Acacia (*Qaraz*), and *Ishil*. In all these mountains there is vegetation and trees of *Gharb* and *Basham*, except Yasum and Qarqad, for they grow nothing but *Nab'* and *Shawhat*. Hardly anyone ascends them except after effort. Monkeys take shelter in them, and their spoiling of the sugarcane (2) owners is frequent. In these mountains are fresh water seepages and springs, except Qarqad and Yasum, for there is nothing in them except what gathers in the rock pools (*Qilat*) (3) from rainwater, such that it cannot be reached nor its place known. The poet said about Yasum and Qarqad: I heard, while my companions were urging their mounts ... With us between a corner of Yasum and Qarqad (4) / So I said to my companions: Stop - may you have no father! - ... The chests of the mounts, for indeed this is the voice of Ma'bad (5). The road from Bustan Ibn Amir to [Mecca] is via (Qufl). Qufl: The pass that",
    "foot_note": "1. *Istanna*: Went quickly. *Al-Rayyiq*: The first of a thing. *Rayyiq al-matar*: The first of its downpour. *Al-Hantam*: Clouds. In the original: 'Antamah', corrected in Yaqut (Al-Sarat).\n2. Yaqut: 'Sugarcane which grows in the mountains of Al-Sarat'.\n3. *Al-Qilat*: Plural of *Qalt* with Fatha; it is like a hollow in the mountain where water stagnates.\n4. Al-Bakri 788: 'Their mounts trot ... from Yasum and Badbad'.\n5. Yaqut in entry (Qarqad): 'Indeed it is the voice of Ma'bad'.",
    "book_id": "992",
    "new_page_number": 44
  },
  {
    "serial_number": "6266336",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 418,
    "volume_number": 1,
    "text": "brings you out to (Qarn al-Manazil [As Sayl al Kabir, Saudi Arabia]) facing [Taif]. It pushes (1) you from your left while you aim for [Mecca]. Leading mountains, they are high red mountains, most of their vegetation is Acacia (*Qaraz*). Among the mountains of [Mecca] is (Abu Qubays (2)). And among them are (Al-Safa) and (The Red Mountain (3)), and a high black mountain called (Al-Hayla) from which stones are cut for building and millstones. (Al-Marwah) is a mountain that tends towards redness (4). (Thabir (5)) is a towering mountain, faced by (Hira) which is a towering mountain higher than Thabir. At its top is a slippery, high peak (6). They mentioned that the Messenger of Allah, peace be upon him, ascended its summit with a group of Companions, and it shook. So the Messenger of Allah, peace be upon him, said to it: \"Be still, Hira, for upon you is none but a Prophet, or a Siddiq (Truthful), or a Shahid (Martyr) (7).\" [There is no vegetation on them nor in all the mountains of [Mecca] except a little of",
    "foot_note": "1. The origin of *Lahz* is pushing and hitting. *Al-Lahiz*: The mountain pushes the road and hits it, likewise the hill hits the road.\n2. Yaqut cited in (1: 94) many sayings regarding the reason for its naming.\n3. Yaqut mentioned it in entry (Al-Ahmar).\n4. This is a rare expression, and 'ma' in it is extra, meaning 'to redness it is'. Similar to what appeared in Mashariq al-Anwar by Qadi Iyad Vol 1 p 324 regarding his saying in the Hadith of Tamim al-Dari about the Dajjal: 'No, rather from the direction of the East he is (*ma huwa*)'. He said: 'Ma here is a connective and not negative, meaning from the direction of the East he is'.\n5. In [Mecca] there are other Thabirs: Thabir of the Zanj where they used to play, Thabir al-Khadra', Thabir al-Nas' which is the mountain of Muzdalifah, and Thabir al-Ahdab. From Yaqut.\n6. *Al-Zaluj*: Smooth, one who ascends it slips.\n7. See Mu'jam al-Buldan (Hira). In Mu'jam al-Bakri 432: 'Be firm Hira, for upon you is only a Prophet or a Siddiq or a Shahid'. What is in Sahih al-Bukhari in the Virtues of the Companions of the Prophet, peace be upon him, from Anas bin Malik, may Allah be pleased with him, is that the Prophet, peace be upon him, ascended Uhud and Abu Bakr, Uthman and Umar were with him, so it shook with them. He said: 'Be firm Uhud, for upon you is a Prophet, a Siddiq, and two Martyrs'. It came in Fath al-Bari (7: 33) commenting on it: 'It is the well-known mountain in [Medina]. In a narration by Muslim and Abu Ya'la from another path via Sa'id: Hira. The first is more correct. Were it not for the unity of the exit [narrator], I would have allowed the multiplicity of the story. Then it appeared to me that the difference is from Sa'id; for I found it in the Musnad of Al-Harith bin Abi Usama from Ruh bin Ubadah from Sa'id, saying in it: Uhud or Hira, with doubt. Ahmad extracted it from the Hadith of Buraydah with the wording: Hira, and its chain is authentic, so the probability of the story's multiplicity is strengthened. It preceded in the ends of the Waqf from the Hadith of Uthman similarly, and in it Hira. Muslim extracted from the Hadith of Abu Hurayrah -",
    "book_id": "992",
    "new_page_number": 45
  },
  {
    "serial_number": "6266337",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 419,
    "volume_number": 1,
    "text": "*Dahya'* which exists in the towering mountain (1)], and there is no water in any of them. Then the mountains of (Arafat) connect to the mountains of [Taif]. In them are many waters, seepages, and *Fuqar* channels (2), among them (3) (Al-Mashash), which comes out at Arafat and connects to [Mecca]. [From Qu'ayqa'an to [Mecca] (4)] is twelve miles on the road of Al-Harf (5) to Yemen. (Qu'ayqa'an) [in Mecca]: a village with waters, crops, palms, and fruits; it is the Yamaniyah (6). Between [Mecca] and [Taif] is a village called (Rasib) belonging to Khath'am, and (Al-Jawnah (7)): a village for the Ansar, and Al-Ma'dan (Ma'dan al-Baram (8)), which has many palms and crops. The waters are well waters,",
    "foot_note": "1. - what supports the multiplicity of the story, mentioning he was on Hira and those mentioned here were with him, and added others with them. And Allah knows best.'\n1. The completion is from Yaqut in entry (Hira). Al-Maymani did not establish it. See for *Al-Dahya'* what preceded on p. 396.\n2. *Fuqar*: Plural of *Faqir*, previously explained by Arram. Al-Maymani read it 'Yafir' corruptly, and interpreted it saying 'increases', thinking it from 'Wafara', an illusion.\n3. In the original: 'Kada'im' corruption. *Al-Kaza'im*: Plural of *Kazimah* with Kasra, which is a channel inside the earth in which water flows. Al-Asma'i said: They are aligned wells dug and spaced out, then a channel is pierced between every two wells leading the water from the first to the next underground, so their waters gather flowing, then emerge at their end flowing on the surface of the earth. *Al-Fuqar* was previously explained on p. 413. The text is corrupted in Yaqut in entry (Al-Mashash).\n4. Completion from Yaqut in (Qu'ayqa'an). Al-Maymani did not establish it.\n5. Thus. In Yaqut 'Al-Hawf' with Waw.\n6. Thus in Yaqut's transfer: Meaning the Yemeni fruits.\n7. Thus Yaqut established it in its entry and said: 'A village between Mecca and Taif'. It was written in the original 'Al-Jawiyah' with pointed letters, and Al-Maymani read it 'Al-Jawbah'. Sheikh Hamad said: 'It is, as I see, Al-Hawiyah with unpointed Ha, broken Waw, doubled Ya underneath, and feminine Ta: A village among the most famous villages of Taif still known by this name even if not mentioned in ancient dictionaries like many places in the land of the Arabs'. But Yaqut's restriction of it, and its being between Mecca and Taif not in Taif itself, contradicts what the Sheikh imagined.\n8. Previously discussed in footnotes of p. 416.",
    "book_id": "992",
    "new_page_number": 46
  },
  {
    "serial_number": "6266338",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 420,
    "volume_number": 1,
    "text": "they irrigate their crops with *Zaraniq* (1). ([Taif] (2)) possesses farms, palms, bananas, grapes, and other fruits. It has flowing waters and valleys pouring from it to Tabalah. Most of the people of [Taif] are Thaqif and Himyar, and a group from Quraysh, and Ghawth from Yemen (3). It is one of the mother (4) villages. (Matar (5)): a village among its villages with many crops and bananas. (Tabalah) is larger than it,",
    "foot_note": "1. Plural of *Zarnuq* with Damma or Fatha. The *Zarnuqan*: Two walls built at the head of the well on its two sides, upon which the *Na'amah* is placed, which is a piece of wood laid across them, then the pulley is suspended in it, the rope of the bucket runs in it to draw water. One says *zarnaqa zarnaqah*, meaning watered with the *Zarnuq*... The verb 'tazarnaqa' is also used. In the Hadith of Ali: 'I will not abandon Hajj even if I *tazarnaqtu*', meaning even if I serve the well pulleys and draw water to gather the expense of Hajj.\n2. Yaqut listed many explanations for its naming. Al-Bakri said: It was named after the wall they built around it and encompassed (*atafu*) it with for fortification. Its name was Wajj. Umayyah bin Abi al-Salt said: We built a fortified Taif ... Striking down heroes defending our sons. Its summer resort status is known from ancient times. Al-Numayri said about Zaynab bint Yusuf, sister of Al-Hajjaj, describing her luxury: She winters in Mecca in luxury ... And her summer resort is in Taif.\n3. 'And Ghawth from Yemen' did not appear in what Yaqut quoted from Arram (6: 11). In Yemen there are Aghwath: one is Ghawth bin Anmar bin Arash bin Amr bin Lihyan bin Amr bin Malik bin Zayd bin Kahlan. Another is Ghawth bin Tayy bin Udad bin Zayd bin Yashjub bin Arib bin Zayd bin Kahlan. Likewise Al-Ghawth bin Nabt bin Malik bin Zayd bin Kahlan. And Al-Ghawth bin Udad bin Zayd bin Kahlan. Nihayat al-Arab (2: 296, 310) and Al-Ma'arif 53 and Al-Sihah, Al-Taj, and Al-Lisan (Ghawth).\n4. In the original 'Ummayat', but *Umm* is pluralized as *Umat* and *Ummahat*; the first plural prevails for non-rational things. But the known usage in such expression is *Ummahat*, as the author himself used before when discussing (Waddan) p. 405.\n5. Al-Bakri: 'Abu Hanifa said: Abu Ishaq al-Bakri informed me that in Matar there are always ripe date palms, palms being harvested, palms turning red/yellow, and palms being pollinated'. He and Yaqut vocalized it with Damma on the Mim. See Al-Hamdani 121, 241.",
    "book_id": "992",
    "new_page_number": 47
  },
  {
    "serial_number": "6266339",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 421,
    "volume_number": 1,
    "text": "between them is two nights. In [Taif] there is a pulpit, and in Tabalah there is a pulpit. Its people are Salul, Uqayl, Ghamid, Amir bin Rabi'ah, and Qays Kubbah (1). At the border of Tabalah is a village called (Ranyah (2) [Ranyah, Saudi Arabia]), and a village called (Bishah (3) [Bishah, Saudi Arabia]), and (Tathlith [Tathlith, Saudi Arabia]), and (Yabambam (4)), and (Al-Aqiq, Aqiq Tamrah (5)). All of them belong to Uqayl. Their waters are *Buthur* (6). *Al-Bathr* resembles *Al-Ahsa'* (shallow wells), flowing under the pebbles at a depth of a cubit, two cubits, or less than a cubit; sometimes beasts expose it with their hooves.",
    "foot_note": "1. Qays Kubbah: A tribe from Bajilah, as in Al-Lisan (2: 192). In Mu'jam Ma Ista'jam 61: 'And Qays Kubbah - and Kubbah was a horse of his - son of Al-Ghawth bin Anmar, among Banu Ja'far bin Kilab'.\n2. Yaqut and Al-Bakri created an entry for it, with Fatha on Ra, then Yaqut returned and created an entry for it in (Zabyah) with Fatha on the dotted Zay, and said: 'Thus it is recorded in the book of Arram'.\n3. Al-Ahwas deleted the Ha from it saying: She settles in Khakh or the slope of Suwayqah ... And my journey is in Bish or Tihamah or Najd. It is different from the Lion-infested place (*Ma'sadah*) to which lions are attributed; that is Bishah of Al-Samawah about which Muzarrid says: High peaks in it as if their father ... In Bishah is a lion thick of forearms. This is what Al-Bakri mentioned, but Yaqut made the *Ma'sadah* Bishah of Tihamah not Bishah of Al-Samawah. Sheikh Muhammad bin Bulayhid did the same in Sahih al-Akhbar (1: 176) and said: 'In this era, two tribes reside in it, Banu Salul and Banu Mu'awiyah. There are two cities in it, the city of Banu Salul called Al-Rawshan, and the city of Banu Mu'awiyah called Nimran'.\n4. Hamid bin Thawr al-Hilali mentioned this place and the two places before it in his saying: If she wished she sang to me in the winding valleys of Bishah ... Or the palms of Tathlith or of Yabambam.\n5. Every watercourse cut by a torrent in the earth, forming a riverbed and widening it is called: (*Aqiq*). In the land of the Arabs there are many Aqiqs, among them this Aqiq, and Aqiq al-Yamamah, and Aqiq al-Madinah which is famous - named so because it cut (*'aqqa*) from its Harrah meaning cut off - and Al-Aqiq which is in the belly of Wadi Dhu al-Hulayfah, and Aqiq al-Qanan, in which the torrents of the peaks of Najd and its mountains flow. In Iraq there is Aqiq al-Basra.\n6. See what preceded regarding *Al-Buthur* on p. 410 line 7.",
    "book_id": "992",
    "new_page_number": 48
  },
  {
    "serial_number": "6266340",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 423,
    "volume_number": 1,
    "text": "The Border of Hijaz",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 49
  },
  {
    "serial_number": "6266341",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 424,
    "volume_number": 1,
    "text": "The Border of Hijaz\nArram said: The border of Hijaz is from (Ma'dan al-Naqrah (1)) to [Medina]; half of [Medina] is Hijazi and half is Tihami (2). Among the Hijazi villages is (Batn Nakhl). Opposite Batn Nakhl is a mountain called (Al-Aswad); half of it is Najdi and half is Hijazi. It is a towering mountain, and grows nothing but herbage (3), like *Silliyan* (4), *Ghadur*, and *Gharaz* (5). Then (Al-Taraf (6)) for one aiming for [Medina], flanked by three mountains: One is (Zulum), a black towering mountain growing nothing, and (Hazm Bani Awwal); both belong to Ghatafan (7). In Awwal there are wells, among them (Bir Alyah) - the name of the sheep's tail - and (Bir Harmah),",
    "foot_note": "1. Yaqut: Al-Naqrah, with Fatha on Nun and Sukun on Qaf. Al-Azhari narrated it with Fatha on Nun and Kasra on Qaf. In Al-Lisan: 'Ibn al-A'rabi: Every land descending into a depression is *Naqrah*, and from it Naqrah on the road to Mecca was named, which is called Ma'dan al-Naqrah'. Yaqut said: This is what is relied upon for the name of this spot.\n2. Ibn Abi Shaybah mentioned that [Medina] is Hijazi. As for [Mecca] it is Tihami, and [Taif] is Hijazi.\n3. In the original: 'ghayra kala', corrected from Yaqut. Omission of the Lam of definition occurs often in the handwriting of the original scribe.\n4. With Kasra on Sad, doubling of the broken Lam, and lightening of Ya. About it is the proverb: 'He uprooted it like the wild ass uproots the Silliyanah'. See Al-Lisan (Sall).\n5. This word was not established by Yaqut from Arram in entry (Al-Aswad). The Ghayn in the original was drawn resembling Kha, so I read it in the first edition 'Al-Kharaz', then I found Al-Maymani had corrected it: 'Al-Gharaf'. Sheikh Hamad said: The correct word is Al-Gharaz with Ghayn not Kha, and it is so in the original. Al-Gharaz: A type of plant resembling *Thumam*, described in language dictionaries and known in the land of the Arabs.\n6. Al-Taraf, with movement [voweling], as Yaqut recorded in its entry.\n7. He did not mention the third mountain. The investigator Sheikh Sulayman al-Sani' pointed this out. He said: 'The third is Al-La'ba', Yaqut mentioned it in his dictionary from Ibn Musa'. See entry (Awwal) in Mu'jam al-Buldan. Sheikh Hamad said commenting on what I wrote: 'I say: Al-Samhudi pointed this out in Wafa' al-Wafa Vol 2 p 347 before Professor Al-Sani''.",
    "book_id": "992",
    "new_page_number": 50
  },
  {
    "serial_number": "6266342",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and their Inhabitants, Villages, Trees, and Water",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa Al-Babi Al-Halabi and Sons Library and Printing Company in Egypt",
    "page_number": 425,
    "volume_number": 1,
    "text": "and (Bir Umayr), and (Bir al-Sidrah (1)); there is no useful water in these (2). And (Al-Sadd) is rainwater; the Messenger of Allah, peace be upon him, ordered it to be dammed. And among them is (Al-Qarqarah (3)), which is rainwater. These waters do not cease due to the abundance that gathers in them. From Al-Sadd there is a canal to (Quba). Surrounding [Medina] among the mountains is ('Ayr): two red mountains on your right when you are in the belly of Al-Aqiq (4) intending for [Mecca] (5). On your left is (Shawran (6)), which is a mountain overlooking Al-Sadd, large and high. To the south (Qibli side) of [Medina] is a mountain called (Al-Sari), which is one (7), not upon this...",
    "foot_note": "1. In Al-Bakri 1326: 'Hafirat al-Sidrah'.\n2. The phrase is clear in the original despite neglecting the final Hamza in 'ha'ula'' and 'ma''. Al-Maymani made it: 'wa laysa biha ma yuntafa'u [bihi]'.\n3. In the original: 'wa huwa al-qarqar', corrected to 'Al-Qarqarah', which is what is called 'Qarqarat al-Kudr'.\n4. This is Aqiq of [Medina].\n5. Yaqut said: 'Some people of Hijaz mentioned to me that in [Medina] there are two mountains called: 'Ayr al-Warid (The Arriving 'Ayr) and the other 'Ayr al-Sadir (The Departing 'Ayr), and they are close to each other. This agrees with Arram's statement'.\n6. Shawran with Fatha on Shin. Among the news mentioned about it is that (Al-Baghum), the companion of Rayhan al-Khudari, vowed to walk from Shawran until she entered all the gates of the Mosque, led by a rein of gold. A poet said: Would that I were among them on the morning of their arrival ... From the pass of Shawran, possessing two earrings, reined. Walking on hard ground, her fingertips bleeding ... And around her are the Qibtriyyah (Egyptian linen) dark-lipped women. The people of Naqi' al-Dar spent the night, filled by ... A pungent musk, while a gazelle walks among them.\n7. Meaning not two mountains as 'Ayr is two mountains. Yaqut said: 'Al-Sari in the language of Egyptian merchants is the ship's mast. Al-Jawhari said: Al-Sari is the sailor'. Yaqut's statement that it is the language of Egyptian merchants ..., for this meaning was known to the Arabs of old. In the Hadith of Ibn al-Zubayr: 'He ordered a *sawar* (mast/pole) so it was set up around the Kaaba'. I see its derivation is from *sara yasri*, if it rose high. They say: The she-camel *sarat* her neck, if she raised it from the heaviness of the load. He recited: * And the white camels between lowering and raising high (*sari*) *",
    "book_id": "992",
    "new_page_number": 51
  },
  {
    "serial_number": "6266343",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 426,
    "volume_number": 1,
    "text": "vegetation nor water, except for Shawran, for in it are many rainwater sources called Al-Bajarat (1), 'Karam' (2), 'Ayn', and 'Am'awhum ma yakun al-Sanan' (3). In all of them are black fish, the size of an arm or less than that, the best fish there is. A mountain opposite this Shawran is called (Maytan (4)); in it is well water called (Daffah (5)), and it has no vegetation at all; it belongs to Sulaym and Muzaynah. Opposite it is a mountain called (Sann (6)) and large, lofty mountains called (Al-Hula' (7)), singular Hula'ah (8)",
    "foot_note": "1. Yaqut: 'With movement (vowels), and it is said: Al-Bujayrat, using the diminutive form.' In Al-Bakri 906, it is (Al-Bahrat) with an un-dotted Ha, and likewise in Wafa' al-Wafa' 2:331.\n2. See its entry in Al-Bakri.\n3. This phrase appeared as such in the original, and it is clear that the context is a listing of names of springs. Sheikh Hamad commented on it with a strange comment, may Allah preserve him: 'The Professor has an excuse for being ignorant of some locations he has not traversed and for which he found no texts to clarify their locations completely, but what is his excuse for being ignorant of linguistic words—he being the linguist who undertook the publication of some linguistic dictionaries—and we mean by words what we find circulated in printed language dictionaries? On p. 55—of the first edition—is this text: (wa-am'awhum ma yakun al-sanan), and the Professor commented saying: Thus this phrase appeared in the original. Had he referred to language books, he would have found that Al-Am'a' are places where water collects and remains for a long time' (Thus. I do not know which printed dictionaries this strange text cited by the Sheikh appeared in). Then the Sheikh said: 'Therefore, the sentence is (wa Am'a' wa huwa ma' yakun al-sanin)!? [And Am'a', which is water that lasts for years/is stagnant!?]. And thus this sentence appeared in what Al-Samhudi quoted in Wafa' al-Wafa' vol 2 p 331 from 'Arram.' I leave the comment on this comment to the fair reader.\n4. Yaqut vocalized it with a Fatha on the Meem, and Al-Bakri with a Kasra. Ma'n bin Aws Al-Muzani says about it: As if there never was, O Umm Haqqah, before this ... at Maytan, a summer resort for us and spring camps.\n5. In the original: 'Da'ah', its correction is from Al-Bakri's dictionary in its entry and in (Zulm) as well.\n6. This matches what is in Yaqut where he says in its entry: 'And Al-Sann is also: a mountain in Medina near Uhud.' He also said in (Al-Hula'ah): 'Arram said: Opposite Maytan, among the mountains of Medina, is a mountain called Al-Sann.' But in Al-Bakri 819, 906 it is 'Shiyy', with a Kasra on the Sheen.\n7. With Fatha on the Ha and Kasra, as mentioned by Yaqut. In Al-Bakri 389, 906 it is: 'Al-Jalah' with a Kasra on the first letter, on the wording of the plural of Jalhah). Al-Fayruzabadi said: 'And with Kasra, singular Al-Hula', for mountains near Maytan from which millstones are hewn.' It is vocalized in Al-Lisan with Fatha.\n8. Al-Zamakhshari recited in Kitab al-Jibal 50 for Ibn al-Riqa': -",
    "book_id": "992",
    "new_page_number": 52
  },
  {
    "serial_number": "6266344",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 427,
    "volume_number": 1,
    "text": "that grow nothing and are of no use, except for what is cut for millstones and building, which is transported to Medina [Medina, Saudi Arabia] and its surroundings. Then to (Al-Rahdiyah (1)), a village belonging to the Ansar and Banu Sulaym, from Najd (2); it has wells with many crops and palm trees. Opposite it is a village or land called (Al-Hijr (3)), and it has water from springs and wells belonging to Banu Sulaym. Opposite it is a small mountain, not lofty, called (Qunnat Al-Hijr (4)). There is a high valley called (Dhu Rawlan (5)) belonging to Banu Sulaym, containing many villages that grow palm trees, among them (Qulha (6)), which is a large village, and (Taqtad (7)), also a village. Between them is a mountain called (Adimah). At the top of this valley are meadows called (Al-Fallaj), gathering people during the days of spring. In it are many holding places (ponds) (8) which suffice them for their summer and spring if",
    "foot_note": "1. - She used to settle, when the rain came to her in the morning ... the belly of Al-Hula'ah, then Al-Amrar, then Al-Surara\n1. Thus Yaqut vocalized it. As for Al-Bakri, he made it 'Al-Ruhaydah' in the form of the diminutive of (Al-Rahdah). See 645, 874, 908.\n2. And likewise in Yaqut (Al-Qunnah). Al-Bakri: 'And it is from Najd.'\n3. With a Kasra on the Ha, but it is vocalized in Al-Bakri (Al-Hajar) with movement (Fatha on Ha and Jim), which is an error.\n4. The poet says about it: Oh, would that I knew, has there changed after us ... Arum, then Aram, then Shabah, then Al-Hadr? And have my camels left the blackness of its mountains ... And has Al-Hijr departed after me from its small peak?\n5. In the original: 'Dawrlan', a distortion, and its correction is from Yaqut in its entry and Al-Zamakhshari 69. It is also called (Dhu Warlan) with a Kasra on the Waw as in Al-Bakri 1378, 907. Al-Warlan: plural of Waral, with movement, which is a beast with the creation of a lizard (Dabb) but larger than it.\n6. With a Fatha on the Lam, Yaqut and Al-Bakri 1093. Al-Bakri said in its derivation: Al-Asma'i said: The Arabs say: A 'Qulha' pond, meaning full.\n7. With a Fatha on the second Ta and a Damma, as mentioned by Yaqut; the Damma is attributed to Al-Zamakhshari according to what Yaqut quoted from him, and Al-Bakri 317.\n8. In the original: 'masak kathirah' (many holding places), a distortion, its correction is from Yaqut in (Taqtad), and it appeared in Yaqut (Al-Fallaj): 'masak kabir' (a large holding place), and he only means the plural, because he will list many ponds afterwards. The explanation of (Al-Masak) appeared previously on p. 397 line 7.",
    "book_id": "992",
    "new_page_number": 53
  },
  {
    "serial_number": "6266345",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 428,
    "volume_number": 1,
    "text": "it rains. There are no wells or springs in it. Among them is a pond called (Al-Mukhtabi (1)) because it is between thorny trees ('idah), lote trees (sidr), salam trees, and willows (khilaf) (2). It can only be approached from its two ends, not its sides, because it has an edge that no one can manage (3). Among them is a rock hollow (qalt) (4) called (Dhat Al-Qarnayn) because it is between two small mountains, and water is only extracted from it by drawing with buckets if it drops (5) a little. Among them is a pond called (Ghadir Al-Sidrah), having some of the purest water, with no trees around it. Then you proceed ascending towards Mecca [Makkah, Saudi Arabia], and you turn to a valley called ('Urayfitan Ma'n (6)), which has no water or pasture. Opposite it are mountains called (Ubla (7)), and opposite it is a peak called (Al-Sudah (8)) belonging to Banu Khafaf from Banu Sulaym, and their water is",
    "foot_note": "1. In Al-Bakri 907, 1187: 'Al-Mujanni', and the correct one is what is here as understood from the reasoning, which matches what is in Yaqut in (Al-Fallaj).\n2. Al-Khilaf: Willow trees, also called 'Al-Sawjar', and its varieties are many, all of them soft and weak. Al-Aswad said: As if you are a branch of willow seen to have ... a beauty, while weakness comes to it from above.\n3. Sheikh Hamad mentioned in a comment that in Wafa' al-Wafa' 2:369 quoting 'Arram: 'because it has two edges that cannot be managed from their direction.'\n4. The explanation of (Al-Qalt) appeared previously on p. 417.\n5. I made it 'inkhafada' (masculine) in my first edition relying on Yaqut in (Al-Qarnayn): As for Al-Maymani, he made it 'inkhafadat' (feminine) correcting what was in the original which was 'inkhafazat' (with Zaa). The virtuous Sheikh said correcting and commenting: 'I say: The correct reading—in my view—is what appeared in the original (meaning the correctness of the original word structure, which is 'inkhafadat' not 'inkhafazat'), for the water as understood from 'Arram's speech is between two small mountains, so the one coming to it needs to descend a little to reach it and extract it with the bucket.'\n6. In the original: 'Ma'ran' un-dotted, its correction is from Yaqut in ('Urayfitan, Ubla). Al-Maymani read it 'Urayfitan Ma'rifah', which is an oversight in reading and investigation.\n7. This Ubla is shortened (Alif Maqsura), and it is different from (Ubla) like 'Kursi', which is a known mountain near Aja' and Salma. Al-Maymani read it by mistake: 'a mountain called Ubla'.\n8. Thus it was vocalized in Mu'jam al-Buldan. In Al-Bakri 99, 815 it is (Al-Shawrah) with a Fatha on the Sheen.",
    "book_id": "992",
    "new_page_number": 54
  },
  {
    "serial_number": "6266346",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 429,
    "volume_number": 1,
    "text": "(Al-Sa'biyyah (1)), which are wells drawn from; it is fresh water and vast land. There used to be a spring there called (Al-Naziyah (2)) shared between Banu Khafaf and the Ansar, but they fought (3) and blocked it. It is a spring with abundant fresh water, and many people were killed for that reason. The Sultan of the land requested it multiple times for a large price (4), but they refused that. In Ubla, there are waters including (Bi'r Ma'unah) [Bi'r Ma'unah, Saudi Arabia], (Dhu Sa'idah (5)), (Jamajim) or (Hamahim) - doubt (6) -, and (Al-Wasba'). These belong to Banu Sulaym, and they are connected peaks, one to another. The poet said about them:\nOh, would that I knew, has there changed after us ... Arum, then Aram, then Shabah, and Al-Hadr (7)?\nAnd have my camels left the blackness of Ubla's mountains ... [And has Al-Hijr departed after me from its small peak?] (8)",
    "foot_note": "1. In the original: 'Al-Sa'idah', corrected from Yaqut in its entry and the entry of (Al-Surah), and likewise Al-Qamus (Sa'b) where it says: 'And Al-Sa'biyyah: a water for Banu Khafaf.'\n2. Al-Bakri said: 'On the pronunciation of Fa'ilah from Naza Yanzu.' And Naza Yanzu: to jump and leap.\n3. The virtuous Sheikh said in a comment: 'In Wafa' al-Wafa' vol 2 p 380: fa-tadarrau (they harmed each other), and in Yaqut: fa-tadaddu (they opposed each other), with Dal is a misspelling. The Professor chose the word tadarabu (they fought/struck each other) like Professor Al-Maymani, but I see fa-tadarrau as more correct.' I say: The writing of the original allows both my reading and his reading, for the word was drawn as 'tadarabu' but placed above the Ra in the original is what looks like a Shadda and above the Ba a Damma. There is no doubt that Tadrarub, meaning conflict and disagreement, is closer to the strength of the phrase than 'Mudarrah' meaning exchanging harm.\n4. The word 'bi-althaman' (for the price) is fixed in the original. I do not know how Professor Al-Maymani missed it, so he established it as an addition to the original relying on Yaqut's Dictionary entry (Al-Sa'biyyah) and Mu'jam Ma Asta'jam p. 60, and mentioned with that that 'The original is blank' despite its clear presence in the original.\n5. Sa'idah, originally, is one of the names of the lion.\n6. This word was drawn in the original with poor drawing such that the reader might think it a slip of the pen. Therefore, I did not establish it in the first edition, but I found after finding Professor Al-Maymani's edition this time that he was able to read it and said commenting on it: 'Thus with doubt from Al-Sakuni in Yaqut's Dictionary and Mu'jam Ma Asta'jam 60, 22244'.\n7. Yaqut in the entry of (Ubla): 'fa-al-Hadr'.\n8. The completion is from Yaqut. In the original: 'And has Layla left'.",
    "book_id": "992",
    "new_page_number": 55
  },
  {
    "serial_number": "6266347",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 430,
    "volume_number": 1,
    "text": "[Opposite Ubla is a mountain called (Dhu al-Mawqa'ah (1)) to its east, and it is the mountain of (2)] the Mine of Banu Sulaym [Mahd adh Dhahab, Saudi Arabia], in which mountain goats (3) are numerous. In the lower part of its east is a well called [(it)] (Al-Shaqiqah (4)). Opposite it, on its right from the direction of the Qibla, is a mountain called (Bartham) and a mountain called (Ta'ar). They are two high mountains that grow nothing, in which leopards (5) are numerous. At the base of Bartham is a water called (Dhanaban Al-'Iys (6)), and there is no water near Ta'ar. And [Al-Kharb]: a mountain between it and the Qibla, which grows nothing stable (7). The poet said:\nI have worn out, but Ta'ar does not wear out, nor do I see ... Yaramram except stable, renewing itself (8)\nNor Al-Kharb the near one, as if its peaks ... are Bactrian camels upon which imply coverings, sleeping (9)",
    "foot_note": "1. It is in Al-Bakri (Al-Mawqa'ah) in its entry and on p. 199.\n2. And this completion is also from Yaqut in the entry of (Al-Mawqa'ah).\n3. In Yaqut, quoting 'Arram, it is replaced by (Al-Lazaward / Lapis Lazuli), and the correct face is what is in the original and Al-Bakri 99. Lapis Lazuli: A stone among the precious stones. Dawud said in his Tadhkirah: A famous mineral generated independently in the mountains of Armenia and Persia, and found in the faces of minerals, and the purest of it is that which is in gold. The best of it is the clear, heavy, transparent one whose blueness leans towards some greenness and redness.\n4. Ibn Muqbil says about it: So the basins of Dhu Baqar, then the rugged ground of Shaqiqah ... a wasteland, and other than wastelands may enrich. Yaqut made it with the wording (Al-Shafiqah) in its entry.\n5. In the original: 'Al-Namir Kathir' (The leopard is numerous), and its correction is from Yaqut in (Bartham) and (Ta'ar): Al-Nimran is plural of Nimr (leopard), and likewise Dhi'b and Dhu'ban (wolf).\n6. And likewise in Yaqut. In Al-Bakri 616, 814: 'Dhanabah Al-'Iys'.\n7. It appeared distorted in the first edition: 'nabitan' (growing) due to a typographical error.\n8. The word (thabitan) is not clear in the original. Its establishment is from Yaqut's Dictionary in (Yaramram).\n9. Qilal: plural of Qullah, which is the summit of the mountain. Al-Bukhati: plural of Bukhti like Kursi, which are camels with long necks. Al-Ajillah: plural of Jilal, and Al-Jilal, with Kasra: is the cover of everything, and it is also the plural of Jull (cloth) of the beast which it wears to be protected. Hujjad: plural of Hajid and Hajidah (sleeping). In the original: 'jahd', corrected from Yaqut (Yaramram, Al-Kharb). Al-Bakri 99 narrated the two verses with a different narration.",
    "book_id": "992",
    "new_page_number": 56
  },
  {
    "serial_number": "6266348",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 431,
    "volume_number": 1,
    "text": "He passes the spring of (Al-Naziyah (1)) and comes to waters (2) called (Al-Hudabiyyah (3)), which are three wells with no farms, palm trees, or trees upon them. It is a large low ground (Qa') (4) that is three farsakhs in length, whatever Allah wills (5). It belongs to Banu Khafaf between two black volcanic tracts (Harratayn), and their water is not fresh; the vegetation there is mostly salty plants (Hamd). Then he ends up at (Al-Sawarqiyyah (6)) [Al Suwayriqiyah, Saudi Arabia] at three miles from it. It is a thriving village with many people, containing a pulpit, a congregational mosque (7), and a large market to which merchants come from the regions; it belongs to Banu Sulaym especially. Everyone [of (8)] Banu Sulaym has a share in it. In its water is some saltiness. They seek fresh water (9) from wells in a valley called (Sawariq), and a valley called (Al-Abtan (10)), light fresh water. They have farms and many palm trees and fruits, including bananas, figs, pomegranates, grapes, quinces, and peaches, which are called Firsik (11). They have",
    "foot_note": "1. The word Al-Naziyah did not appear in the original except for (Al-Na).\n2. In the original (miyah), and its correction is in Al-Bakri, and in Yaqut (Al-Hudabiyyah): 'ma'ah' (a water source).\n3. In the original: 'Al-'Adamah', corrected from Yaqut and Al-Bakri 99.\n4. Al-Qa': A vast, easy, low, level land with no ruggedness or elevation, from which mountains and hills part. In Yaqut: 'biqa' kabirah', plural of Buq'ah, and likewise in Al-Bakri 99: 'in vast biqa''.\n5. In the original: 'ma sala minhu' (what flowed from it), corrected from Yaqut and Al-Bakri.\n6. With Damma on the Seen and Fatha. It is also said: 'Al-Suwayriqiyah', in the diminutive form.\n7. Yaqut quoting 'Arram: 'Jami'' (Congregational).\n8. The completion is from Yaqut.\n9. Isti'dhab: drawing fresh water. In the Hadith, it is said that 'water used to be sought fresh (yusta'dhab) for him from the houses of Al-Suqya', meaning fresh water was brought to him from there.\n10. Thus vocalized with Damma on the Ta in Yaqut (Al-Sawarqiyyah) and Al-Bakri (Ubla).\n11. It is said to be a fruit like the peach in size. Al-Jawhari said: 'A type of peach that does not split from its stone.' It is said: It is the fig. Shamir said: 'I heard an eloquent Himyari woman whom I asked about her land, and she said: The palm trees are few, but our living is am-qamh (wheat), am-firsik, am-hamat (figs). Tub - meaning good -. So I said to her: What is Al-Firsik? She said: It is am-tin (figs) to you.' The word Firsik appeared in Persian meaning peach: A Peach. Steingass 618.",
    "book_id": "992",
    "new_page_number": 57
  },
  {
    "serial_number": "6266349",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 432,
    "volume_number": 1,
    "text": "horses, camels, and many sheep. They are Bedouins (1) except for those born there, for they are residents (2) in it, while the others are Bedouins around it. They provision the road of Hejaz [Hejaz] and Najd [Najd] on the two pilgrim roads. The border is (Dariyya) [Dariyah, Saudi Arabia], and their border ends there at seven stages. They have villages around them, including a village called (Al-Qayya) whose water is salty bitter (Ma'j) (3) like the water of Al-Sawarqiyyah; between them is three farsakhs. It has many inhabitants, palm trees, farms, and trees. The poet said:\nHow good is the milk mixed with water (Madhq) with the water of Al-Qayya (4) ... when I have eaten Barni dates (5) after it.\nAnd a village called (Al-Malha' (6)), which is in the belly of a valley called (Qawran) that flows from the Harrah (7). It has many waters and wells, fresh and good, and palm trees and trees. Around it are the hills of (Dhu Majr (8)). The poet said about them:\nAt Dhu Majr, I was watered by the downpour of the morning clouds (9) ...",
    "foot_note": "1. In the original 'thalatha'??? without dots, corrected from Yaqut. However, the phrase before it is distorted in his text, as it is 'wa sha' wa kubara'uhum badiah' (and sheep, and their elders are Bedouins).\n2. Thus in the original. I had read it in the first edition 'thabitun' (firm/staying). The virtuous Sheikh Hamad said: The meaning of 'tanun' is staying/resident, from 'tana'a', and the Hamza was eased. Professor Sheikh Abd al-Rahman al-Mu'allimi al-Yamani pointed this out.\n3. Al-Ma'j: The salty. Yaqut: 'Ujaj' (bitter/salty). Al-Maymani made it 'Ujaj' and did not note the original, even though what is in the original is correct.\n4. Al-Madhq: Milk mixed with water. Al-Bakri: 'bi-ma' Qayya'.\n5. Al-Bakri: 'qablahu' (before it) instead of 'ba'dahu' (after it). Al-Barni: A type of yellow round date.\n6. Al-Bakri said: 100 'It was named after Al-Malhah, a branch of Haydan.'\n7. It is Harrat Sulaym which is called Harrat al-Nar.\n8. Yaqut vocalized it with Fatha on Meem and Sukun on Jim, and considered its movement in poetry later due to necessity. As for Al-Bakri, he vocalized it with movement (Fatha on both).\n9. Yaqut: 'ghawadi'.",
    "book_id": "992",
    "new_page_number": 58
  },
  {
    "serial_number": "6266350",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 433,
    "volume_number": 1,
    "text": "And Dhu Majr is a large pond in the belly of this valley of Qawran. At its top is a water called (Laqaf (1)), water of many wells, fresh, with no farms or palm trees upon them due to the roughness and ruggedness of its location. Above that is a water called (Shass (2)), water of fresh wells. Above that is a well called (Dhat Al-Ghar), fresh with abundant water that irrigates their valley. The poet—who is 'Adhirah bin Qitab (3) Al-Sulami—said:\nYou terrified me on the day of Dhat Al-Ghar with a fright ... with bad news, before which was my graying.\nYou announced the death of the youth of Qays bin 'Aylan in the morning ... and its knight, you announce his death to a beloved (4).\nOpposite it is a mountain called (Aqrah (5)), lofty, elevated, barren, growing nothing, with many leopards and mountain goats. Then you proceed from Al-Malha' and end up at a mountain called (Maghar (6)), inside which",
    "foot_note": "1. In Al-Bakri 100 it is replaced by: 'Layth'. In the first edition, it appeared as 'Al-Qafa', inadvertently.\n2. The original meaning of Al-Shass is hard ground that is like a single stone, plural Shisas and Shusus.\n3. Yaqut and likewise Ibn Taghri Birdi: 'Ghazirah bin Qitab'. In Al-Bakri 100: 'Ibn Qitab said'. In Al-Tabari: ''Azizah'. Ghazirah bin Qitab Al-Sulami was the leader of Sulaym in their revolt against the Sultan during the caliphate of Al-Wathiq. He used to charge reciting Rajaz poetry saying: There must be crowding even if the door is narrow ... I am I, Ghazirah bin Qitab / For death is better for the youth than shame. He continued fighting until he was killed and crucified. That was in the year 230. Al-Nujum Al-Zahirah (2: 257-258) and Al-Tabari (11: 12-14).\n4. Yaqut did not narrate it. In Al-Bakri: ''Uqwah' instead of 'Ghadwah'. Li-Habib means you announce his death to one who loves him. In Al-Bakri: 'Li-Habibi', interpreted as the estimation: He is indeed my beloved.\n5. Yaqut did not create an entry for it, but Al-Bakri did and discussed it in 'Ubla'.\n6. In Al-Bakri 100: 'Ma'an'.",
    "book_id": "992",
    "new_page_number": 59
  },
  {
    "serial_number": "6266351",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 434,
    "volume_number": 1,
    "text": "are seeping waters (Ahsa'), among them a seeping water called (Al-Haddar (1)) which gushes with abundant water, and it is in a salt marsh (Sabakh) (2). Opposite it are two black protected tracts (Hamiyatayn) (3); inside one of them is a salty water (4) called (Al-Rafdah (5)). Its valley is named ('Urayfitan), and upon it are small palms and thickets (Ajam) where the passerby seeks shade; singular Ajam (6), and they are like palaces. Around it are Humud (salty plants) (7), and it belongs to Banu Sulaym. It is on the road of (Zubaida) [Darb Zubaydah, Saudi Arabia/Iraq]; Banu Sulaym call it (Manfa Zubaida (8)). Opposite it is a mountain called (Shawahit), with many leopards and many mountain goats. In it are springs (Awshal) growing Ghadur and Thagham. Opposite it is a valley called (Barak) with abundant vegetation of Salam, 'Urfut, and varieties of trees. In it is a water called (Al-Buwayrah (9)), which is fresh and good, from (Bi'r Shakk) and it is",
    "foot_note": "1. The word is not clear in the original, appearing as 'Al-Madar' without dots. Its establishment is from Yaqut in (Maghar, Al-Haddar) and Al-Bakri 101 and the entry (Al-Haddar). Al-Haddar is also: from the regions of Al-Yamamah where Musaylimah the Liar was born. Yaqut said: 'It is possible that it is from Al-Hadr, which is the invalidation of blood, or from the braying (hadr) of the camel, when it rumbles in its throat.'\n2. Al-Sabakh, with movement: The place becomes salty (yasbakh) so salt grows in it and feet sink in.\n3. The explanation of 'Al-Hamiyah' appeared previously on p. 413.\n4. Yaqut quoting 'Arram: 'Malihah'. Al-Malihah and Al-Milhah mean the same.\n5. Thus Al-Bakri vocalized it with letters in its entry, and Yaqut did not vocalize it. It is vocalized in Al-Qamus with a Fatha on the Ra.\n6. Al-Ujum, with two Dammas: The fortress. And with a Damma and two Dammas: Every square flat-roofed house. They recited for that the saying of Imru' al-Qays: And Tayma, He left not a palm trunk within it ... Nor a fortress (Utum) except built with stones.\n7. In the original: 'Hamus' with un-dotted letters, correct is with Dad (dotted). Al-Humud: plural of Hamd, as in Al-Qamus. Al-Hamd, with Fatha: What is salty and bitter of plants.\n8. Thus in the original. In Yaqut's Dictionary: 'Manqa Zubaida'. See entry (Maghar). Al-Maymani read it 'Maghfa', inadvertently.\n9. Yaqut said: 'Diminutive of the well (Al-Bi'r) from which water is drawn.'",
    "book_id": "992",
    "new_page_number": 60
  },
  {
    "serial_number": "6266352",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 435,
    "volume_number": 1,
    "text": "the saddening Ghayqah (1), but it does not run dry. There is (Bartham), a lofty mountain with many leopards and mountain goats, with little vegetation except what is of Thagham, Ghadur, and the like. Opposite it is a valley called (Baydan (2)) containing many water wells and many trees; wheat, barley, and alfalfa (Qatt) (3) are grown on these wells. Opposite it is a valley called (Al-Sahn). The poet said about it:\nWe brought from the south of Al-Sahn short-haired horses ... noble, lean, offspring of offspring (4)\nSo we came with them on the two days of Hunayn to ... the Prophet of Allah, sharply, not in jest.\nIn it is a water called (Al-Haba'ah), which consists of mouths of many wells with pierced bottoms; some empty into others of the water place, fresh and good (5). Wheat, barley, and the like are grown on it. And another water, a single well, called (Al-Rassas (6)), abundant in water, not planted (7) upon due to the narrowness of its location.",
    "foot_note": "1. Thus appeared 'Bi'r Shakk wa hiya Al-Ghayqah Al-Shajwah'. It is worth mentioning that 'Shajwah' is a valley in Tihamah, and 'Ghayqah' is between Mecca and Medina.\n2. Al-Bakri created an entry for it, and Yaqut did not.\n3. The word is un-dotted in the original. Al-Qatt: Alfalfa (Fisfisah) and fresh pasture (Ratbah), which is what is called 'Barsim' in the tongue of the Egyptians. See Dawud's Tadhkirah.\n4. Al-Jurd: plural of Ajrad and Jar'da', which is the short-haired horse. Al-Nasl: verbal noun of Nasala Yansilu, meaning to speed. Yaqut: 'Sarrah naslan li-nasl'. Al-Bakri: 'Sayyaraha naslan li-nasl'. Shuzaban: plural of Shazib, which is lean. In the original: 'sarban???' un-dotted. Sheikh Hamad has the credit for this correction which I missed in the first edition.\n5. Yaqut: 'some into others, the good fresh water'.\n6. Thus Al-Bakri vocalized it in its entry, and mentioned it also in 'Shawahit', and Yaqut did not create an entry for it. In the original: 'Arsas', and the scribe of the copy often omits the definite article Lam.\n7. Al-Bakri in (Shawahit): 'la yuzdara'' (is not cultivated).",
    "book_id": "992",
    "new_page_number": 61
  },
  {
    "serial_number": "6266353",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 436,
    "volume_number": 1,
    "text": "At the bottom of this Baydan is a place called (Al-'Iys) containing water called (Dhanaban Al-'Iys (1)). Al-'Iys: Where the trees of Salam and Dal become numerous, it is called 'Iys and Khays (2). Opposite it is a mountain called (Al-Harras (3)), black with no good vegetation. At its base is a pond (Adah) (4) called Al-Hawaq (5) which holds much water from the sky; it all belongs to Banu Sulaym. Opposite that is a village called (Sufaynah (6)) [Sufaynah, Saudi Arabia], containing farms and many palm trees (7), all of that on wells. It has a mountain called (Al-Sitar). It is on the road of (Zubaida (8)); the pilgrims turn to it if they are thirsty. Opposite it are other waters called (Al-Nujayr), [and opposite it is a water source called (Al-Nujarah), a single well (9)], and both contain saltiness but not severe (10).",
    "foot_note": "1. See previous footnotes on p. 430.\n2. Al-Khays and Al-Khaysah: Many entangled trees. In the original: 'Habs' distorted.\n3. Al-Bakri mentioned it in its entry, and in (Al-Sitar), and in (Shawahit). In one of the copies of his original: 'Al-Hurad'. Yaqut did not create an entry for it, nor did he mention it, tracing Wüstenfeld's indices.\n4. Al-Adah: The pond, and water stagnant from a torrent or otherwise, plural Adawat and Ida.\n5. In the original: 'Al-Haqa'iq' omitting dots. Its correction is from Al-Bakri in its entry and in (Shawahit), Al-Zamakhshari 49, and Al-Qamus (Hawq). It is like Kitab and Ghurab, as mentioned by Al-Bakri and the author of Al-Qamus.\n6. Yaqut created an entry for it, and Al-Bakri did not, nor did he mention it. It is like the sack ('aybah) in which a man's belongings and tools are kept.\n7. In Al-Maymani's copy: 'wa Nakhil' (and palms) distorted from what is in the original.\n8. Yaqut: 'Al-Zubaydiyah'.\n9. The completion is from Yaqut in the entry (Al-Nujayr), and from what follows. In Al-Bakri 721 and 336, 'Al-Thujjar' and 'Al-Thujjir'. Yaqut did not create entries for them under Tha, but made them 'Al-Nujarah' and 'Al-Nujayr' with Nun, in their entry and in 'Najl'.\n10. Thus in the original and it has a validity. In Yaqut: 'wa laysat bi-l-shadidah' (feminine).",
    "book_id": "992",
    "new_page_number": 62
  },
  {
    "serial_number": "6266354",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 437,
    "volume_number": 1,
    "text": "Below them in a level desert are two tall pillars (1) which no one can ascend unless he is a bird. One of them is called ('Amud Al-Ban), and (Al-Ban (2)) is a place, and the other is ('Amud Al-Safh). It is to the right of the road ascending from Kufa [Kufa, Iraq] (3) at a mile from (Ufay'iyah). (Afa'iyah (4)) [Afa'iyah, Saudi Arabia] is a large, lofty plateau, but the name of the village is (Dhu Al-Nakhl (5)), and it is one of the stages of the road. It has salt. Fresh water is sought for it from this Al-Nujarah and Al-Nujayr (6), and from a water called (Dhu Mahbalah (7)). To its left is a water source called (Al-Subhiyyah (8)), which is a single well with no farms upon it,",
    "foot_note": "1. The phrase appeared identically in Yaqut (Al-Ban, and 'Amud) from 'Arram. In Al-Bakri 721, without declaring the transfer: 'And below them are two tall plateaus'. This is an explanation of the two pillars, meaning they are two high plateaus, each resembling the pillar of a house. The application of (Al-'Amud) to a plateau is not known in language dictionaries.\n2. Al-Ban with the wording of that known plant in Yaqut. In Al-Bakri in its entry and in (Al-Sitar): 'Alban' as if plural of Laban (milk).\n3. In Al-Bakri 722: 'From Kufa to Mecca'.\n4. Al-Bakri vocalized it with Damma on the Hamza, then said: 'Thus narrated from 'Umarah bin 'Aqil. Others narrate it Afa'iyah with Fatha on the Hamza. Both examples exist in Names and Attributes, and the Damma on the Hamza in Ufa'iyah is more established, and it is what Abu Hatim and others chose.'\n5. Thus in the original. Al-Bakri 314 recited for Jamil: And the likes of Al-Muqattam intervened before her ... and Dhu Al-Nakhl from the valley of Qatah and Ta'niq. In Yaqut: 'Dhu Al-Najl' with Jim, and likewise in Al-Zamakhshari 67.\n6. The explanation of Isti'dhab (seeking fresh water) appeared on p. 431. Al-Nujarah and Al-Nujayr were discussed on the previous page.\n7. Yaqut created an entry for it, and mentioned it also in (Najl), and Al-Bakri did not mention it. In the original: 'Majilah'. Al-Maymani thought it 'Dhu Nukhaylah'.\n8. Al-Bakri created an entry for it, and Yaqut did not create an entry for it nor mention it in his dictionary, tracing Wüstenfeld's index.",
    "book_id": "992",
    "new_page_number": 63
  },
  {
    "serial_number": "6266355",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 438,
    "volume_number": 1,
    "text": "and water is sought from it for the people of Afa'iyah. Opposite it is a large plateau called (Khatmah (1)), and a lava field (Labah) (2) - which is a rough (3) black volcanic tract that grows nothing - called (Manihah (4)); it belongs to Jasr and Banu Sulaym. And a village called (Marran) [Marran, Saudi Arabia], a large thriving village, with many springs, wells, palm trees, and farms. It is on the Basra road [from Iraq] belonging to Banu Hilal and Jasr (5), and to Banu Ma'iz (6). It has a fortress and a pulpit, and many people. The poet says about it (7):\nAfter the tall, lofty ones of the family of Ma'iz, does a wayfarer hope for hospitality at Marran (8)?",
    "foot_note": "1. What is in Al-Bakri 722: 'Hadmah' with Damma and two Dammas.\n2. Al-Labah: The Harrah (volcanic tract), plural La'b and Lub.\n3. Al-Harshafah: Rough ground.\n4. In the original: 'Sahah' un-dotted, establishing it from Al-Bakri 722.\n5. This word fell from the first edition.\n6. Yaqut in the entry of (Marran): 'And a part to Banu Ma'iz'.\n7. The virtuous Sheikh said: The Professor did not extract the two verses appearing in (Marran), and they are from a poem among the finest elegies consisting of 18 verses cited by Al-Hajari in full, mentioning its author and the one eulogized. He said: Abu Kulayb Hamr bin Al-Ashhab, from Banu Amir bin Rabi'ah, recited to me for Al-Tamimi, regarding Ma'iz bin Malik Al-Baka'i, and it is complete here: News of the death of the noble Ibn Malik came to me ... so I spent the night while the night in Iraq was long / I spent the night consoling myself lest the enemies rejoice ... while in the soul there is burning thirst from grief over him. Abu Tammam cited some of it in Al-Hamasah. I say: See also Sharh Al-Marzuqi p. 1062 - 1063.\n8. In the original: 'Hayy bi-Marran Al-Qura', corrected from Yaqut.",
    "book_id": "992",
    "new_page_number": 64
  },
  {
    "serial_number": "6266356",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 439,
    "volume_number": 1,
    "text": "We passed by Marran at night and did not turn ... to the people of thickets and palm trees therein (1).\nBehind it is a village called (Quba (2)) [Quba, Saudi Arabia], large and populated, belonging to Jasr, Muharib, and Amir ibn Rabi'ah of Hawazin. It has many farms on wells, and not many palm trees. Opposite it is a mountain called (Hakran), and a mountain called [it] ('Ann). The poet said:\nPeaks of Hakran, the dark ones (3) ...\nIt has little vegetation. At its base is a water called (Al-Sanw (4)). This 'Ann has waters and springs inside it. The poet said about it:\nSo they said: We are Hilalis, we came from our land ... for a need for which we crossed the night as a cloak (5)\nAnd they said: We went out filling Qafa and its south ... and 'Ann, so the heart was about to crack (6).\n(Al-Qafa (7)): A mountain belonging to Banu Hilal opposite this 'Ann. Opposite it is another mountain",
    "foot_note": "1. Yaqut: 'Ajam biha' (thickets in it).\n2. This Quba is the one on the road from Mecca to Basra. It is different from Quba of Medina.\n3. A'yan, with Nun in the original copy, matching what Yaqut narrated from 'Arram in (Hakran). In Al-Bakri 722: 'A'yar' plural of 'Ayr. Al-Khudari with Damma on Kha: The black, used to describe clouds, eagles, camels, and hair.\n4. Neither Al-Bakri nor Yaqut created an entry for it. The first mentioned it in (Al-Sitar) and the other in (Hakran).\n5. Meaning we entered inside it as the wearer enters his cloak (Mydra'). Al-Mydra' like Minbar: A jubbah split in the front.\n6. This narration matches Yaqut's narration in ('Ann). Al-Bakri's narration: 'fi Al-Faqa'.\n7. Al-Bakri created an entry for it and said: 'On the wording of the Qafa (back of neck) of a human.' Yaqut did not create an entry.",
    "book_id": "992",
    "new_page_number": 65
  },
  {
    "serial_number": "6266357",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 440,
    "volume_number": 1,
    "text": "called (Bass (1)). At its base is a water called (Baq'a' (2)) belonging to Banu Hilal, a well with much water, having no crops. Opposite it is another called (Al-Khudud (3)). 'Ukaz is a call's distance from it (4). ('Ukaz) [Souq Okaz, Saudi Arabia] is a level desert with no mountain or landmark (5) except what used to be of the idols that were in the Jahiliyyah. In it are blood [stains] from the blood of sacrificial animals like great millstones (6). Opposite it is a spring called (Khulays) belonging to the Amriyyin (7). This Khulays is a man",
    "foot_note": "1. In the original, a sign of neglect (no dots) was placed over the Seen appearing to be three dots, so I thought it was 'Baysh'. The virtuous Sheikh pointed out this correction.\n2. Al-Bakri: 'Naq'a''. In Yaqut with Ba, as here. He said: 'Naq'a' is between Hejaz and Rukbah, and it is from the land of Rukbah.'\n3. Yaqut: 'Al-Khudud: A Mikhlif (province) of the Mikhlifs of Taif.' In Al-Bakri: 'Al-Jaru'.\n4. Al-Bakri: 'A call's distance and a little more.'\n5. Sheikh Muhammad bin Bulayhid investigated the location of Souq Okaz today in an extensive research at the end of the second part of his book 'Sahih Al-Akhbar', but he quoted from 'Arram a strange text I do not know from where he quoted it, which is his saying: 'It is in a level land with no mountains. If you are in 'Ukaz, the sun rises upon you over a black Harrah (volcanic tract), containing white stones ('Ubaylat), around which the Arabs used to circle in their Jahiliyyah and sacrifice.'\n6. In the original: 'Ka-l-adkhal', and in one of Al-Bakri's copies: 'Ka-l-arhal', and the correct face is what I established from Al-Bakri's originals. See entry ('Ukaz).\n7. And likewise in Al-Bakri 960. The word (Al-'Amriyyin) was vocalized in Al-Bakri's dictionary with Damma then Fatha. In Sifat Jazirat al-Arab by Al-Hamdani 120: 'And east of Taif dwell a people from the descendants of Amr ibn al-Aas.'",
    "book_id": "992",
    "new_page_number": 66
  },
  {
    "serial_number": "6266358",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Names of the Mountains of Tihamah and Their Inhabitants, and What Villages Are In Them, and What Trees Grow On Them, and What Waters Are In Them",
    "edition": "Second, 1393 AH - 1972 AD",
    "publisher": "Mustafa al-Babi al-Halabi and Sons Library and Printing Company in Egypt [Egypt]",
    "page_number": 441,
    "volume_number": 1,
    "text": "and it is in a land called (Rukbah (1)) [Rukbah, Saudi Arabia]. The poet said:\nI say to a caravan one day [I met them] ... driving lean, bare-footed, limping camels (2)\nWho are you? For we have desired your coming ... and that you inform us of the state of Rukbah entirely (3).\n\nThe book of the names of the mountains of Mecca and Medina and what connects to them is completed, by the praise of Allah, His aid, and His good success. And may Allah bless our Master Muhammad whenever the rememberers remember him, and the heedless overlook mentioning him.",
    "foot_note": "1. Rukbah with the wording of the knee (Rukbah) in the leg. It is between Mecca and Taif. In Al-Lisan: 'Between Ghamrah and Dhat 'Irq.' It is said: Rukbah is the highest of all lands. It is said: It is the one about which Noah's son said: 'I will take refuge on a mountain to protect me from the water.' In Fada'il Makkah by Al-Hamdani, Umar bin Al-Khattab said: To commit seventy sins in Rukbah is more beloved to me than to commit one sin in Mecca. Malik narrated in Al-Muwatta' that Umar bin Al-Khattab said: 'A night in Rukbah is more beloved to me than ten nights in Al-Sham.' Malik said: 'He means for the length of lives and survival, and for the severity of the plague in Al-Sham.'\n2. I did not find a reference to verify these two verses despite long searching. The word 'laqituhum' (I met them) is not in the original, and with something like it, the speech becomes coherent. Tazjiyah: Driving. Anda': plural of Nidw, with Kasra, which is the emaciated camel. Hawafi: Those whose feet have become bare/worn from walking. Zali': One who has Zala', which is a limp similar to lameness.\n3. The first hemistich of the verse appeared in the original in this form: 'Min ism yaya qad hawyna majikum'. I established it likewise in the first edition. After seeing Al-Maymani's edition this time, I found he read it this close reading. So credit belongs to him. And praise be to Allah for what He has bestowed.",
    "book_id": "992",
    "new_page_number": 67
  }
]