[
  {
    "text": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm\nAuthor: علي بن لالي بالي بن محمد القسطنطيني الحنفي ويعرف بمنق\nYear: 992",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "new_page_number": 1
  },
  {
    "text": "sn: 7135\nbook_title: خير الكلام في التقصي عن أغلاط العوام\nbook_link: https://shamela.ws/book/310\nbook_id: 310\nauthor_name: علي بن لالي بالي بن محمد القسطنطيني الحنفي ويعرف بمنق\nauthor_year: 992\nnickname: Null\nauthor_link: https://shamela.ws/author/1173\nauthor_ID: 1173\neditor: الدكتور حاتم صالح الضامن [ت ١٤٣٤ هـ]\npublisher: عالم الكتب - بيروت\nedition: الأولى، 1407 هـ / 1987 م\npages: 62\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الغريب والمعاجم\ncategory_id: 30",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "new_page_number": 2
  },
  {
    "serial_number": "6366583",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Unfamiliar Words and Dictionaries\nBook: Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm (The Best Speech in Investigating the Errors of the Common People)\nAuthor: Ali bin Lali Bali bin Muhammad Al-Qustantini Al-Hanafi, known as Manq (d. 992 AH)\nEditor: Dr. Hatem Saleh Al-Dhamin [d. 1434 AH]\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nBook: Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm\nAuthor: Ali bin Lali Bali bin Muhammad Al-Qustantini Al-Hanafi, known as Manq (d. 992 AH)\nEditor: Dr. Hatem Saleh Al-Dhamin [d. 1434 AH]\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nAuthor: Ali bin Lali Bali bin Muhammad Al-Qustantini Al-Hanafi, known as Manq (d. 992 AH)\nEditor: Dr. Hatem Saleh Al-Dhamin [d. 1434 AH]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nEditor: Dr. Hatem Saleh Al-Dhamin [d. 1434 AH]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "310",
    "new_page_number": 3
  },
  {
    "serial_number": "6366584",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "(1b) In the name of Allah, the Most Gracious, the Most Merciful\nGlory be to Him whose majesty of essence transcends the impurities of forgetfulness and error, and whose perfect attributes are sanctified from the marks of falsehood and excess. We send blessings upon the pride of the Messengers and the guide of the paths, Muhammad, who never deviated from the path of truth nor ever did wrong.\nTo proceed, these are pages I have drafted and words I have cited from books of language and treatises of trustworthy Imams, which were authored in refutation of those who committed errors in their speech, and rode the mount of excess in the deserts of illusions, and opened their mouths with myths, and were deceived by their trifles and went astray. [This is] to manifest the truth and correctness, and to articulate what people of intellect have spoken. I have named it \"Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm\" (The Best Speech in Investigating the Errors of the Common People). Then I honored it by dedicating it to the sublime master, who is in no need of titles and names, may Allah adorn him with luxurious knowledge and increase him in honor in the first life and the Hereafter.\nHere I begin with the intended purpose, with the help of the Worshiped King, acknowledging my short reach and little knowledge, asking Allah for correctness; indeed, He is the Guardian of success and guidance.\n\nLetter Alif\nAl-Hariri said in \"Durrat al-Ghawwas\" (1): They delete the Alif from (Ibn) in every place it occurs after a name, title, or kunya (nickname). This is not a general rule; rather, it must be affirmed in five places:\nFirst: If (Ibn) is annexed to a pronoun, as in your saying: This is Zaid, your son (Zaidun ibnuka).\nSecond: If it is annexed to other than his father, as in your saying: Al-Mu'tadid Billah, the son of the brother of Al-Mu'tamid 'Ala Allah (Ibn Akhi).\nThird: If it is annexed to the grandfather (higher father), as in your saying: Al-Hasan, the son (descendant) of Al-Muhtadi Billah.",
    "foot_note": "1. (1) p. 200. Al-Hariri is Al-Qasim bin Ali, author of the Maqamat, d. 516 AH. (Al-Ansab 4/138, Nuzhat al-Alba 379, Inbah al-Ruwat 3/23).",
    "book_id": "310",
    "new_page_number": 4
  },
  {
    "serial_number": "6366585",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "Fourth: If it is shifted from being an adjective to an interrogation, as in your saying: Is Tamim the son of Murr? (Hal Tamimun Ibnu Murrin).\nFifth: If it is shifted from being an adjective to a predicate (Khabar), as in your saying: Indeed, Ka'b is the son of Lu'ay (Inna Ka'ban Ibnu Lu'ayyin).\nAl-Safadi (2) added two other places: One is if (Ibn) occurs at the beginning of a line. And the second is if it falls between two descriptions without two proper nouns, as in your saying: The virtuous one, son of the virtuous one (Al-Fadil Ibn Al-Fadil).\nI say: A hideous error has spread in our lands, which is not safe even among the common people and most of the elite, which is that they make quiescent what precedes the word (Al-Ibn) from the proper noun, break its Ba (3), and make its end quiescent.\nImam Abu Bakr Al-Zubaydi (4) said in his book \"Ma Talhanu Fihi Al-Awamm\" (What the Common People Err In) (5): They say: 'Allahumma salli 'ala Muhammadin wa 'ala alihi' (O Allah, send blessings upon Muhammad and upon his family). [Abu] Ja'far bin Al-Nahhas (6) rejected the annexation of (Al) to a pronoun.",
    "foot_note": "1. (2) Tashih al-Tashif 48. Al-Safadi is Salah al-Din Khalil bin Aybak, d. 764 AH. His most famous books: Al-Ghayth al-Musjam, Nukat al-Himyan, Al-Wafi bil-Wafiyat (See: Tabaqat al-Shafi'iyyah 10/5-32, Al-Durar al-Kaminah 2/176, Al-Nujum al-Zahirah 11/19). In the book (Tashih al-Tashif wa Tahrir al-Tahrif), Al-Safadi relied on nine books, giving each a symbol as follows: (1) Durrat al-Ghawwas by Al-Hariri (H). 2. Al-Takmila by Al-Jawaliqi (Q). 3. Thaqif al-Lisan by Al-Siqilli (S). 4. Ma Talhanu Fihi Al-Awamm by Al-Zubaydi (Z). 5. Taqwim al-Lisan by Ibn al-Jawzi (W). 6. Ma Sahhafa Fihi Al-Kufiyyun by Al-Suli (K). 7. Huduth al-Tashif by Hamza al-Isfahani (Th). 8. Al-Tashif by Al-Askari (S). 9. Al-Awraq by Al-Diya Musa Al-Nasikh (M). All these books have reached us except the sixth and ninth. 3. In the original: Ba'ihi. 4. He is Muhammad bin Al-Hasan Al-Andalusi, author of (Tabaqat al-Nahwiyyin wa al-Lughawiyyin), d. 379 AH. (Mu'jam al-Udaba 18/119, Al-Muhammadun min al-Shu'ara 286, Wafiyat al-A'yan 4/372). 5. p. 14. See: Al-Radd 'ala Al-Zubaydi 30, Tashih al-Tashif 45. 6. He is Ahmad bin Muhammad Al-Nahwi Al-Masri, has many works including: I'rab al-Quran, Sharh al-Qasa'id al-Tis', Al-Qat' wa al-I'tinaf. d. 338 AH. (Tabaqat al-Nahwiyyin wa al-Lughawiyyin 220, Nuzhat al-Alba 291, Mu'jam al-Udaba 4/224).",
    "book_id": "310",
    "new_page_number": 5
  },
  {
    "serial_number": "6366586",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "Al-Hariri (7) said: They say: 'Ibda' bihi awwalan' (Start with it firstly). The correct way is: 'Ibda' bihi awwalu' (Start with it first).\nHe also said (8): Among their illusions is that they make the Lam of definition quiescent in cases like 'Al-Ithnayn' (The two) (2a) and cut the Alif of connection (Hamzat al-Wasl). The correct way in that is to drop the Hamzat al-Wasl and break (Kasra) the Lam of definition.\nHe also said (9): They say to the standing person: 'Ijlis' (Sit). The choice is to say to him: 'Uq'ud' (Sit down), and to the reclining person and the like: 'Ijlis' (Sit up). For 'Qu'ud' is moving from high to low, and 'Julus' is the opposite.\nHe also said (10): They say: 'Ja'a al-qawmu bi-ajma'ihim' (The people came all together), opening the Mim, thinking it is 'Ajma'u' used for emphasis. It is not so because the preposition does not enter it. Rather, it is with Damma on the Mim, a plural like 'Abd' and 'A'bud'.\nAl-Zamakhshari said in (Al-Asas) (11): Their saying: 'Kana fi al-azali qadiran aliman' (He was in eternity powerful, knowing), and 'Ilmuhu azaliyyun' (His knowledge is eternal) and 'Lahu al-azaliyyatu' (He has eternality), is fabricated and not from the speech of the Arabs. Imam Jamal al-Din [Abd al-Rahman bin] Ali al-Jawzi (12) and Abu Bakr al-Zubaydi (13) also considered it a grammatical error.\nSheikh Umar bin Khalaf al-Siqilli said in (Tathqif al-Lisan) (14): They say: 'Itrifal'. The correct way is: 'Itriful', with Damma on the Fa.",
    "foot_note": "1. (7) Durrat al-Ghawwas 126. See: Sharh Durrat al-Ghawwas 167. \n8. Durrat al-Ghawwas 188-189. \n9. Durrat al-Ghawwas 143. \n10. Durrat al-Ghawwas 167. \n11. Asas al-Balagha 5 (Azal). Al-Zamakhshari is Mahmoud bin Umar Al-Mu'tazili, author of Tafsir al-Kashshaf, d. 538 AH. (Inbah al-Ruwat 3/265, Bughyat al-Wu'ah 2/279, Tabaqat al-Mufassirin 2/314). \n12. Taqwim al-Lisan 97. Ibn al-Jawzi is the author of many works, d. 597 AH. (Wafiyat al-A'yan 3/140, Ghayat al-Nihayah 1/375, Tabaqat al-Mufassirin 1/270). \n13. Lahn al-Awamm 11. \n14. p. 271. Al-Siqilli d. 501 AH. (Inbah al-Ruwat 2/329, Al-Bulgha fi Tarikh A'immat al-Lugha 171, Bughyat al-Wu'ah 2/218).",
    "book_id": "310",
    "new_page_number": 6
  },
  {
    "serial_number": "6366587",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "He said (15): [They say: Kitab Iqlidis (Book of Euclid). It is] 'Uqlidus', with Damma on the Hamza and Dal. In Al-Qamus (16): 'Uqlidis', with Damma and adding a Waw: Name of a man who wrote a book in this known science.\nAl-Hariri said (17): They say: 'Qara'tu al-Hawamim wa al-Tawasin' (I read the Hawamim and the Tawasin). The correct way is: 'Qara'tu Al Ha-Mim wa Al Ta-Sin' (I read the family of Ha-Mim and the family of Ta-Sin). The author of Al-Qamus follows this view (18).\nImam Abd al-Rahman Jamal al-Din [bin] Ali al-Jawzi said in (Taqwim al-Lisan) (19): The common people say: 'Milh Andarani' (Andarani salt). The correct way is: 'Dhara'ani' (20), with Fatha on the Ra and Hamza.\nIbn al-Sa'ati (21) said in his Amali: Whatever is from the lands of the Romans and ends with a Ya followed by a Ha (22), it is lightened (without Shadda), like 'Antakiya' (Antioch), 'Malatiya', 'Quniya', and 'Qaysariya', but the common people stress the Ya (add Shadda).\nAl-Hariri (23) and Al-Jawzi (24) said: They say for the plural of 'Ard' (earth/land): 'Aradin', so they err because 'Ard' is triliteral and is not pluralized on 'Afa'il'. The correct way is: 'Aradun', with Fatha on the Ra.",
    "foot_note": "1. (15) Tathqif al-Lisan 141. The text between brackets is from it. \n16. Al-Qamus al-Muhit 2/242. \n17. Durrat al-Ghawwas 15. \n18. Al-Qamus al-Muhit 4/101 and 244. \n19. p. 128. See: Islah al-Mantiq 172, Adab al-Katib 298, Al-Zahir 2/345. \n20. In the original: Andarabi and Dhara'abi, with Ba in both. This is a misspelling. \n21. In the original: Ibn al-Saghani. This is a misspelling. The correct is what Al-Safadi mentioned in Tashih al-Tashif 82. As for Ibn al-Sa'ati, he is Ahmad bin Ali, who died in 694 AH most likely, and was a teacher at Al-Mustansiriyah: (See: Mir'at al-Jinan 4/227, Al-Jawahir al-Mudiyyah 1/80, Hadiyat al-Arifin 100). \n22. In the original: Ma'kusa biha. What we established is from Tashih al-Tashif. \n23. Durrat al-Ghawwas 50. \n24. Taqwim al-Lisan 91. See: Bahr al-Awamm 170.",
    "book_id": "310",
    "new_page_number": 7
  },
  {
    "serial_number": "6366588",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "Al-Jawhari (25) said: And 'Al-Aradi' is contrary to analogy, as if they pluralized 'Arud'.\nAl-Hariri (26) said: They say: 'Habbat al-Aryah' (The winds blew). The correct way is: 'Al-Arwah', because the origin of 'Rih' is 'Riwh', but the Waw was changed to Ya due to the Kasra before it. So if pluralized as 'Arwah', that cause is removed. Al-Zubaydi followed him (27), except that the author of Al-Qamus (27a) mentioned it as well.\nAl-Hariri (28) said: They say: 'Fulan ansafu min fulan' (So-and-so is more just than so-and-so), intending his superiority in justice (Nasafah), so they alter the meaning (29), because the verb for justice (Insaf) is 'Ansafa' (to be just), and 'Af'al' [of preference] is not built from a quadrilateral verb.\nI say: Al-Radi (30) said: According to Sibawayh (31), it is analogical from the form 'Af'ala' even though it has an addition, but according to others it is based on hearing (Sama'i). He reported from Al-Akhfash (32) and Al-Mubarrad (33) the permissibility of forming 'Af'al' of preference from all triliteral verbs with additions by analogy.",
    "foot_note": "1. (25) Al-Sihah (Ard). Al-Jawhari is Isma'il bin Hammad, d. 393 AH. (Nuzhat al-Alba 334, Mu'jam al-Udaba 6/151, Inbah al-Ruwat 1/194). \n26. Durrat al-Ghawwas 40-41. See: Risalat al-Rih 222. \n27. His book missed it. It is in Tashih al-Tashif 61 quoting Al-Zubaydi and Al-Hariri. The editor of Lahn al-Awamm appended it to the book quoting Tashih al-Tashif. (See: Lahn al-Awamm 253). (27a) He is Al-Firuzabadi, Majd al-Din Muhammad bin Ya'qub, d. 817 AH. (Al-Daw' al-Lami' 10/79, Bughyat al-Wu'ah 1/273, Al-Badr al-Tali' 2/280). His statement on wind is in Al-Qamus 1/224. \n28. Durrat al-Ghawwas 119. \n29. In the original: Fayamiluna ila al-ma'na (They incline to the meaning). What we established is from Al-Durra. \n30. Sharh al-Kafiyah 2/213-214. Al-Radi is Muhammad bin Al-Hasan Al-Astarabadhi the grammarian, d. 686 AH (Bughyat al-Wu'ah 1/567, Miftah al-Sa'adah 1/183, Khizanat al-Adab 1/12). \n31. He is Amr bin Uthman, stuck to Al-Khalil and transmitted his views in (Al-Kitab), d. 180 AH. (Maratib al-Nahwiyyin 65, Tabaqat al-Nahwiyyin wa al-Lughawiyyin 66, Inbah al-Ruwat 2/346). \n32. He is Abu Al-Hasan Sa'id bin Mas'adah, took grammar from Sibawayh, d. 215 AH. (Maratib al-Nahwiyyin 68, Nuzhat al-Alba 133, Inbah al-Ruwat 2/36). \n33. He is Abu Al-Abbas Muhammad bin Yazid, the Imam of the Basrans in grammar and language, d. 285 AH. (Akhbar al-Nahwiyyin al-Basriyyin 72, Tahdhib al-Lugha 1/27, Nur al-Qabas 324).",
    "book_id": "310",
    "new_page_number": 8
  },
  {
    "serial_number": "6366589",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "Al-Hariri (34) said: They say: 'Indafa al-shay'u [ilayhi]' (The thing was added [to it]) and 'Infasada al-amru 'alayhi' (The matter became spoiled for him). The correct phrasing is: 'Udifa ilayhi' and 'Fasada al-amru 'alayhi' (2b), because 'Infa'ala' is the passive form (Mutawa'a) of transitive triliteral verbs, like 'Jadhabtuhu fanjadhaba' (I pulled it so it was pulled). 'Dafa' and 'Fasada', when made transitive by the Hamza of transport (Naql) [so it is said: Adafa and Afsada], become quadrilateral [so for this reason building Infa'ala from them is prevented]. If it is said: Words have been transmitted from the Arabs of passive verbs built from 'Af'ala', so they said: 'Inza'aja', 'Intalaqa', ['Inqahama'], and 'Injahara', and their origins are: 'Az'aja', 'Atlaqa', ['Aqhama'], and 'Ajhara'. [The answer to it is that] these deviated from the [consistent] analogy [and established principle, just as their saying: 'Insaraba al-shay'u', from 'Saraba', which is intransitive, deviated], and anomalies are restricted to hearing (Sama'), [and are not used for analogy by consensus].\nAl-Jawzi (35) said: The common people say: 'Hadhihi al-ni'matu al-awwalatu' (This first blessing). The correct way is 'Al-Ula'. In Al-Durra (36): Attaching Ha to (Af'al) has not been heard in the languages of the Arabs, neither on that which is an adjective, like 'Abyad' (white) and 'Ahmar' (red), nor on that which is for preference, like 'Afdal' (best) and 'Awwal' (first).\nI say: I have seen many sons of this time reciting the saying of Abu Al-Najm (37): (Poetry) (Ana Abu al-Najmi wa shi'ri shi'ri...) without pronouncing the Alif of 'Ana'. The correct way is pronouncing it.\nIbn Jinni (38) said in the explanation of Al-Mazini's Tasrif (39): The origin in 'Ana' is to stop",
    "foot_note": "1. (34) Durrat al-Ghawwas 38-39. The text between brackets is from it. \n35. Taqwim al-Lisan 86, and in it: Hadhihi al-na'jatu (This ewe). Similarly in Tashih al-Tashif 84. \n36. p. 127, and Torbecke wrote it in the margin. It is in the main text in the Jawa'ib edition 77. \n37. He is Al-Fadl bin Qudamah, an Umayyad Rajiz poet, d. 130 AH. (Tabaqat Fuhul al-Shu'ara 745, Al-Shi'r wa al-Shu'ara 603, Al-Aghani 10/150). The verse is in Sharh al-Mufassal 1/98 and Al-Mughni 366. \n38. He is Abu Al-Fath Uthman bin Jinni, the grammarian and linguist. His most famous works: Al-Khasai's, Sirr Sina'at al-I'rab, Al-Muhtasib, Al-Munsif fi Sharh Tasrif al-Mazini etc., d. 392 AH. (Tarikh Baghdad 11/311, Nuzhat al-Alba 332, Inbah al-Ruwat 2/335). \n39. Al-Munsif 1/9-10. Al-Mazini is Abu Uthman Bakr bin Muhammad, one of the scholars of grammar and language, d. 248 AH (Akhbar al-Nahwiyyin al-Basriyyin 57, Nuzhat al-Alba 182, Mu'jam al-Udaba 7/107).",
    "book_id": "310",
    "new_page_number": 9
  },
  {
    "serial_number": "6366590",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "on it with Alif, and the Alif is not pronounced in connection (Wasl). However, it has been treated in connection as it is in pause in his saying: (Ana sayfu al-ashirati fa'rifuni...) (40) and his saying: (Ana Abu al-Najmi wa shi'ri shi'ri...).\nAmong their illusions is the word (Al-Ibaqah), thinking it is from the form 'If'al' like 'Ifaqah' (41), but it is triliteral. In Al-Qamus (42): 'Abaqa al-abdu', like 'Sami'a', 'Daraba', and 'Mana'a', 'Abqan', and with movement (Abaqan), and 'Ibaqan'.\nAmong their corrupt inventions is the word (Al-Ananiyyah) (Egoism), for it has no origin in the speech of the Arabs (43).\nAmong their shameful errors is the word (Al-Iba'), and the correct is: 'Al-Iba'' (Refusal), which is the source (Masdar) of 'Aba Ya'ba' (44).\nAmong them is the word (Al-Itman) with Ta, for it is with Dal Muhmalah (Idman). In Al-Qamus (45): 'Admana al-shay'a' means he perpetuated it.\nAmong them is their saying: (Mughaylan) for the tree that grows in the deserts of Hijaz. The correct is: 'Umm Ghaylan' (46). In Al-Qamus (47): And 'Umm Ghaylan': The Samur tree.",
    "foot_note": "1. (40) The beginning of a verse by Humayd bin Bahdal, and its second half is: (Hamidan qad tadharraytu al-sanama...) (Khizanat al-Adab 2/390, Sharh Shawahid al-Shafiyah 323). \n41. Al-Tanbih 'ala Aghlat al-Jahil wa al-Nabih 11. I will suffice with the name (Al-Tanbih) in other footnotes. \n42. Al-Qamus al-Muhit 3/208. \n43. Al-Tanbih 12. \n44. Al-Tanbih 11. \n45. Al-Qamus al-Muhit 4/223. \n46. Al-Tanbih 12. \n47. Al-Qamus al-Muhit 4/27.",
    "book_id": "310",
    "new_page_number": 10
  },
  {
    "serial_number": "6366591",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "Among them is their saying: 'Rumman Millisi' (Smooth pomegranate). The correct is: 'Imlisi' (48). In Al-Qamus (49): 'Al-Iqlisi', and with Ha: The desert with no vegetation, and the Imlisi pomegranate is as if attributed to it.\nAmong what they are deluded in is the word (Al-Idh'an), as they use it meaning perception/comprehension (Idrak), so they say: 'Adh'antuhu' meaning I understood it. The correct is that its meaning is submission and compliance. This was mentioned by some scholars (50).\nYou see them saying for the famous Companion: Ka'b al-Akhbar (51), with Kha Mu'jamah (dotted). In Al-Qamus (52): And Ka'b al-Habr is known, and do not say Al-Akhbar.\nThey say: Fatawa Al-Astarushani, with a Ta having three dots between Sin and Ra. In (Al-Jawahir al-Mudiyyah) (53): Al-Usrushani (54) with Damma on Alif, Sukun on Sin Muhmalah (undotted), Damma on Ra, Sukun on Waw, Fatha on Shin Mu'jamah, and at its end a Nun, attributed to Usrushana, a large town beyond Samarkand and Sayhun (55).",
    "foot_note": "1. (48) Fasih Tha'lab 52, Tathqif al-Lisan 172, Taqwim al-Lisan 87, Shifa' al-Ghalil 236. Written in the original: Amlasi, without Ya. This is an error. \n49. Al-Qamus al-Muhit 2/252. \n50. He is Ibn Kamal Pasha in his book Al-Tanbih 'ala Aghlat al-Jahil wa al-Nabih 22. \n51. He is Ka'b bin Mati' Al-Himyari, a Mukhadram Tabi'i, caught the time of the Prophet but did not see him, d. 32 AH. (Hilyat al-Awliya 5/364, Al-Isabah 5/647, Taj al-Arus: Habr). \n52. Al-Qamus al-Muhit 2/3 and in it ... And do not say: Al-Ahbar. With Ha Muhmalah, not Mu'jamah as the author mentioned. Al-Farra' used to say: He is Ka'b al-Hibr, with Kasra on Ha, because he was attributed to the ink (Hibr) used for writing, as he was a man of books and sciences (Gharib al-Hadith 1/87). \n53. Al-Jawahir al-Mudiyyah fi Tabaqat al-Hanafiyyah 2/282. In the original: Al-Mudi'ah. And he cited it so in other places. The correct is what we established, and we did not point it out in other places. (54, 55) In Al-Jawahir al-Mudiyyah: Al-Astarushani, Astarushana. I say: In Mu'jam al-Buldan 1/197 and Al-Rawd al-Mi'tar 60: Ashrushana. And Astarushana appeared in Mu'jam al-Buldan 1/77. It came in Al-Ansab 1/220: (Ta may be added, so it is attributed as Al-Asrushanti, but the correct is the first). i.e., Al-Asrushani.",
    "book_id": "310",
    "new_page_number": 11
  },
  {
    "serial_number": "6366592",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "Letter Ba\nAl-Zubaydi (56) said: (3a) [Al-Buhar with Damma is a load of goods] specifically, and it is for weight also, and Al-Jawhari's speech supports this.\nImam Abd al-Rahman al-Jawzi (57) said: The common people say: 'Bukhor', with Damma on Ba. The correct is Fatha.\nI say: Likewise 'Al-Sahur', with Damma on Sin, for with Fatha it is the name of what one eats for Sahur (58).\nAl-Siqilli (59) said: And they say: 'Bid'at lahm' (A piece of meat), with Kasra on Ba. The correct is Fatha. In Al-Qamus (60): And it may be broken (Kasra).\nAl-Jawzi (61) said: The common people say: 'Battikh' (Melon), with Fatha on Ba. The correct is Kasra.\nAl-Siqilli (62) said: They say: 'Al-Buhtari' (63), for the famous poet, with Fatha on Ta. The correct is Damma.\nHe said (64): They say: 'Buzrujumhur'. The correct is: 'Buzrujumihr', with Damma on Ba (65), Sukun on Za (66), Damma on Ra and Jim, Kasra on Mim, and Sukun on Ha.",
    "foot_note": "1. (56) His book missed it. The text between brackets is required by the context, and it is a blank in the original. See: Al-Sihah (Bahar), Al-Mu'arrab 110-111, Taqwim al-Lisan 99, Al-Lisan (Bahar), Shifa' al-Ghalil 66. It is noted that the common people open it (Fatha) as in Taqwim al-Lisan. \n57. Taqwim al-Lisan 98. See: Takmilat Islah Ma Taghlutu Fihi Al-Awamm 50. \n58. Al-Tanbih 25. See: Al-Jumanah fi Izalat al-Ratanah 3. \n59. Tathqif al-Lisan 130 and 134. \n60. Al-Qamus al-Muhit 3/5. In the original: Wa qad yuksaru. \n61. Taqwim al-Lisan 98. \n62. Tathqif al-Lisan 138. \n63. He is Al-Walid bin Ubayd Al-Ta'i, d. 284 AH. (Tabaqat al-Shu'ara by Ibn al-Mu'tazz 394, Tarikh Baghdad 13/476, Mu'jam al-Udaba 19/248). \n64. Tathqif al-Lisan 141. See: Tashih al-Tashif 95. \n65. In the original: Al-Ra. This is an error. \n66. Al-Za is a dialect for Al-Zai, and the author used both languages.",
    "book_id": "310",
    "new_page_number": 12
  },
  {
    "serial_number": "6366593",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "Al-Zubaydi (67) said: They say for the wood used for dyeing: (Baqam), lightening the Qaf. The correct is stressing (Shadda) it.\nI say: Similar to it is: (Al-Summaq), for they lighten the Mim, and it is stressed. The author of Al-Qamus mentioned it (68).\nAl-Siqilli (69) said: They say: 'Balqis', with Fatha on Ba. The correct is Kasra.\nI say: They say for the known stone 'Billur' (Crystal), with Kasra on Ba and Damma on Lam (70). In Al-Qamus (71): 'Al-Ballur' like 'Tannur' and 'Sinnawr'.\nThey say for the known wise man: 'Batalmiyus' (Ptolemy), putting Mim before Ya. I saw it in copies of Al-Qamus (72) reversed.\nThey say for the person who destroyed Jerusalem: 'Bakht al-Nasr' (73). In Al-Qamus (74): 'Bukhtu Nassara'. Its origin is 'Bukht' meaning son, and 'Nassar' like 'Baqqam': an idol, and he was found near the idol and no father was known for him.\nThey use 'Al-Basharah', with Fatha on Ba, out of place, while it is with Kasra (75). Mentioned in Mukhtar al-Sihah (76).",
    "foot_note": "1. (67) Lahn al-Awamm 107. See: Al-Mu'arrab 107. \n68. Al-Qamus al-Muhit 3/247. \n69. Tathqif al-Lisan 141. \n70. Al-Tanbih 13. \n71. Al-Qamus al-Muhit 1/377. \n72. Al-Qamus al-Muhit 2/201. \n73. In Muruj al-Dhahab 1/251: And the common people call him: Al-Bakht Nasir. \n74. Al-Qamus al-Muhit 1/143. \n75. Al-Tanbih 13. \n76. Mukhtar al-Sihah (Bashara) and in it: Al-Bisharah with Kasra on Ba and Damma.",
    "book_id": "310",
    "new_page_number": 13
  },
  {
    "serial_number": "6366594",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "They say: 'Dakhalna fi al-bariyya' (We entered the wilderness), lightening the Ra. The correct is stressing it because it is attributed to 'Al-Barr' (land) opposite of sea (77).\nThe common people say for the brother of Joseph, peace be upon him: Ibn Yamin. This is an error (78). In Al-Qamus (79): And 'Binyamin' like 'Israfil' is the brother of Joseph, peace be upon him, and do not say: Ibn Yamin.\nThey say for the known book 'Bidayah', with Ya at the end after Alif (80). Al-Jawhari (81) and the author of Al-Qamus did not mention it among the sources (Masadir) of 'Bada'a', rather it is with Hamza. [In Al-Qamus]: And for you 'Al-Bad'', 'Al-Bad'ah', and 'Al-Bada'ah', and they can have Damma (82).\n\nLetter Ta\nAl-Hariri (83) said: They say: 'Al-Tawaddi', 'Al-Tabati', 'Al-Tabarri', [and 'Al-Tahazzi']. The correct is: 'Al-Tawaddu'', 'Al-Tabatu'' (84), 'Al-Tabarru'', [and 'Al-Tahazzu''], because the source of 'Tafa''ala' [or 'Tafa'ala' which ends with Hamza] is on [the pattern] 'Al-Tafa''ul' [and 'Al-Tafa'ul'].\nI say: Similar to that is their saying: 'Tasalla', 'Taqada', and 'Tajalla', with Fatha before the Ya in them. The correct is Kasra (85).",
    "foot_note": "1. (77) Al-Tanbih 13. \n78. Al-Tanbih 14. \n79. Al-Qamus al-Muhit 4/279. \n80. In Al-Ubab 1/5 (Bada'a): And the saying of the common people: Al-Bidayah, is a grammatical error. See: Shifa' al-Ghalil 75. \n81. Al-Sihah (Bada'a). \n82. Al-Qamus al-Muhit 1/8. The text between brackets is required by the context. \n83. Durrat al-Ghawwas 97. The text between brackets is from Al-Durra. In the original: Hayatuka wa hayatuna. \n84. In the original: Al-Tawatu'. This is a distortion. \n85. Al-Tanbih 26.",
    "book_id": "310",
    "new_page_number": 14
  },
  {
    "serial_number": "6366595",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "Contrary to that is the word (Al-Af'a) (Viper), for they put Kasra on 'Ayn, while it is open (Fatha) (86). Also, they err in putting Damma on Jim in the word (Al-Tarjamah) (Translation), for it is open (87). As for the word (Al-Tarjuman) (Translator) (88), the author of Al-Qamus (89) (3b) said: 'Al-Tarjuman' like 'Unfuwan', 'Za'faran', and 'Rayhuqan'.\nI say: [The common people say] (90): 'Tabashur'. The correct is: 'Tabashir'. The author of Al-Qamus mentioned it (91). [And they think that Talkhis does not imply] (92) except the meaning of abbreviation. In Al-Qamus (93): 'Al-Talkhis': Clarification, explanation, and summarization. He did not add to that. Similarly, Al-Jawhari (94) did not add to it. Yes, the author of Al-Ramuz (95) mentioned that meaning which people understand after mentioning the meaning of explanation, and there is what there is in that.\n\nLetter Tha\nAl-Zubaydi (96) said: They think that the word (Al-Thayyib) is specific to the woman whose husband divorces her, while it applies to the male as well.\n\nLetter Jim\nAl-Jawzi (97) said: The common people say: 'Al-Jabin', for what a person prostrates upon. The correct is that it is 'Al-Jabhah' (Forehead), and 'Al-Jabinan' (98) are what surround it. Al-Jawhari (99) and the author of Al-Qamus (100) support this.\nAl-Siqilli (101) said: They say for that which houses are plastered with: 'Jir'. The correct is: 'Jayyar'.\nI say: They say for Abu Al-Fath Uthman, the famous grammarian: Ibn Janni, with Fatha (102) on Jim, which is an error. Ibn Khallikan (103) said in his biography: And 'Jinni': with Kasra (104) on Jim, Shadda on Nun and followed by Ya. Al-Damamini (105) said in Sharh Mughni al-Labib (106) that it is with Sukun on Ya, and it is not an attribution (Nisba), but rather it is Arabized from 'Kinni'.",
    "foot_note": "1. (86) Al-Tanbih 32. \n87. Al-Tanbih 15. \n88. Al-Tanbih 15. \n89. Al-Qamus al-Muhit 4/83. And Rayhuqan means saffron (Al-Lisan: Rahaqa) (In the original: Zayhuqan, with Zay). \n90. Required by context, and it is a blank in the original. \n91. Al-Qamus al-Muhit 2/77. And Tabashir: a medicine. In Al-Taj it is Arabized. Al-Lisan neglected it. \n92. Required by context, and it is a blank in the original. \n93. Al-Qamus al-Muhit 2/317. \n94. Al-Sihah (Lakhkhusa). \n95. He is Sayyid Muhammad bin Sayyid Hasan bin Ali, d. 860 AH. His book: Al-Ramuz fi al-Lugha, includes all languages of Al-Jawhari, Al-Mughrib, Al-Fa'iq, and Al-Nihaya. (Kashf al-Zunun 831). \n96. His book missed it, and it is in Tashih al-Tashif 120 quoting Al-Zubaydi, and the editor of Lahn al-Awamm did not point to it. See: Tathqif al-Lisan 212. \n97. Taqwim al-Lisan 110. \n98. In the original: Al-Janban. This is a distortion. \n99. Al-Sihah (Jabana). \n100. Al-Qamus al-Muhit 4/208. \n101. Tathqif al-Lisan 112. \n102. In the original: With Kasra. \n103. Wafiyat al-A'yan 3/248. Ibn Khallikan is Judge Shams al-Din Ahmad bin Muhammad, d. 681 AH. (Fawat al-Wafiyat 1/110, Al-Nujum al-Zahirah 5317, Shadharat al-Dhahab 5/371). \n104. In the original: With Fatha. \n105. He is Badr al-Din Muhammad bin Abi Bakr, the grammarian and litterateur, d. 827 AH (Al-Daw' al-Lami' 7/171, Bughyat al-Wu'ah 1/66, Shadharat al-Dhahab 7/181). \n106. Titled (Tuhfat al-Gharib) 1/272. Al-Shamanni quoted it in Al-Munsif min al-Kalam 1/141.",
    "book_id": "310",
    "new_page_number": 15
  },
  {
    "serial_number": "6366596",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "The Best Speech in Investigating the Common People's Mistakes",
    "edition": "First Edition, 1407 AH / 1987 CE",
    "publisher": "Aalam Al-Kutub – Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "Letter Thā’: Al-Zubaidi (96) said: People think that the word (al-thayyib) is restricted to a woman whom her husband has divorced, whereas it is also used for a male.\n\nLetter Jīm: Al-Jawzi (97) said: Common people say *al-jabeen* to refer to the part a person prostrates on. The correct word is *al-jabha* (the forehead), and the two *jabeen*s (98) are the sides that flank it. This is supported by the statements of Al-Jawhari (99) and the author of *Al-Qamus* (100).\n\nAl-Saqalli (101) said: They call the material used to plaster houses ‘jeer’. The correct form is *jayyar*.\n\nI say: They pronounce the name of Abu Al-Fath ‘Uthman the grammarian—famous as Ibn Jinnī—with an open (102) jīm, and this is incorrect. Ibn Khallikan (103) said in his biography: ‘Jinnī’ is with a kasrah (104) on the jīm, a doubled nūn, followed by a yā’. Al-Dammamini (105) said in his commentary on *Mughni al-Labīb* (106) that its yā’ is quiescent. It is not a nisbah (attributive name); rather, it is the Arabized form of ‘Kinnī.’",
    "foot_note": "1. (96) The author omitted it from his book, but it is found in *Tashih al-Tashhif*, p.120, quoting Al-Zubaidi, and the editor of *Lahn al-‘Awwām* did not reference it. See also: *Tathqif al-Lisan*, p.212.\n97. *Taqwim al-Lisan*, p.110.\n98. In the original: ‘al-janbān,’ which is an error.\n99. *Al-Sihah*, entry (j-b-n).\n100. *Al-Qamus al-Muhit*, 4/208.\n101. *Tathqif al-Lisan*, p.112.\n102. In the original: ‘with a kasrah.’\n103. *Wafayat al-A‘yan*, 3/248. Ibn Khallikan is Qadi Shams al-Din Ahmad ibn Muhammad, d. 681 AH. (See: *Fawat al-Wafayat* 1/110; *Al-Nujum al-Zahirah* 5/317; *Shadharāt al-Dhahab* 5/371.)\n104. In the original: ‘with a fatḥah.’\n105. He is Badr al-Din Muhammad ibn Abi Bakr, the grammarian and scholar, d. 827 AH. (See: *Al-Daw’ al-Lami‘* 7/171; *Bughyat al-Wu‘āt* 1/66; *Shadharāt al-Dhahab* 7/181.)\n106. Titled *Tuhfat al-Ghareeb*, 1/272. Al-Shamni quoted it in *Al-Munsif min al-Kalam*, 1/141.",
    "book_id": "310",
    "new_page_number": 16
  },
  {
    "serial_number": "6366597",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "They say for the head of the Mu'tazila Abu Ali Al-Juba'i (107) with light Ba and Hamza after Alif. Ibn Khallikan (108) said in the biography of his son Abu Hashim Abd al-Salam Al-Jubba'i, with Damma on Jim and Shadda on Ba (109), attributed to a village from the villages of Basra.\n\nLetter Ha (Unpointed)\nAl-Siqilli (110) said: They say: 'Humman shadidatun' (A severe fever), with Tanwin. The correct is without it.\nAl-Hariri (111) said: They write 'Al-Hayat', 'Al-Zakat', and 'Al-Salat' with Waw in every place. This is not general, for it is permissible to fix the Alif upon annexation and duality, as in your saying: 'Hayatuka' [and 'Zakatuka', 'Salatuka', 'Salatani', and 'Zakatani'].\nAl-Hariri (112) and Al-Jawzi (113) said: They say for the plural of 'Hajah' (Need): 'Hawa'ij'. The correct is to pluralize it in small numbers as 'Hajat', and in larger [numbers as] 'Haj'.\nI say: In Al-Sihah (114): 'Hawa'ij' is also contrary to analogy, as if they pluralized 'Ha'ijah'. Al-Asma'i (115) used to deny it and say: It is post-classical (Muwallad). He denied it only for its deviation from analogy, otherwise it is abundant in the speech of Arabs. He recites: (Verse)",
    "foot_note": "1. (107) He is Muhammad bin Abd al-Wahhab, d. 303 AH. (Al-Ansab 3/186, Wafiyat al-A'yan 4/267, Tabaqat al-Mu'tazila 80). \n108. Wafiyat al-A'yan 3/183. In the original: Ali al-Jubba'i, which is an error. Abd al-Salam died 321 AH. (Tarikh Baghdad 11/5, Mizan al-I'tidal 2/618, Tabaqat al-Mu'tazila 94). \n109. Following it is an interpolated phrase: 'And after the Alif is Nun', copied inadvertently from the line following his lineage. \n110. See: Tathqif al-Lisan 104. \n111. Durrat al-Ghawwas 202. The text between brackets is from it. In the original: Hayatuka wa hayatuna. \n112. Durrat al-Ghawwas 54. See: Tahdhib al-Khawass min Durrat al-Ghawwas 36. \n113. Taqwim al-Lisan 117. See: Al-Addad 20, Al-Muzhir 1/307. \n114. Al-Sihah (Hawaja). See: Bahr al-Awamm 171. \n115. He is Abd al-Malik bin Qurayb, the linguist, narrated from Nafi' and Al-Kisa'i, d. 216 AH. (Maratib al-Nahwiyyin 46, Al-Jarh wa al-Ta'dil 2/2/363, Ghayat al-Nihaya 1/470).",
    "book_id": "310",
    "new_page_number": 17
  },
  {
    "serial_number": "6366598",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "(Naharu al-mar'i amthalu hina tuqda ... hawa'ijuhu mina al-layli al-tawili (116)) (The day of a person is better when his needs are fulfilled than the long night).\nI say: They say for the known profession: 'Al-Hajama' (Cupping), with Fatha on Ha, while it is with Kasra. In Al-Qamus (117): And his profession is 'Al-Hijamah' like 'Kitabah'. In Al-Mukhtar (118): The noun is 'Al-Hijamah', with Kasra. Also, they do not verify its meaning, for it is sucking, and it was named so because he sucks the blood after cutting. So in Al-Qamus (119).\nThey say: 'Al-Haywan' (Animal), with Sukun on Ya (120). The correct is moving it (Fatha), for the origin in every source implying commotion (4a) is moving its middle to indicate the meaning of commotion and movement like 'Dawaran'.\nThey say for the bubbles rising on water: 'Hubab', with Damma on Ha, while it is with Fatha (121), stated in Mukhtar al-Sihah (122).\n\nLetter Kha (Pointed)\nAl-Jawzi (123) said: The common people say: 'Al-Khatmi' (Marshmallow), with Fatha on Kha. The correct is Kasra.",
    "foot_note": "1. (116) Without attribution in Al-Lisan (Hawaja) and Bahr al-Awamm 172. \n117. Al-Qamus al-Muhit 4/93. \n118. Mukhtar al-Sihah (Hajama). \n119. I did not find this saying in Al-Qamus with this wording. \n120. Al-Tanbih 20. \n121. Al-Tanbih 19. \n122. Mukhtar al-Sihah (Hababa). \n123. Taqwim al-Lisan 121, and in it: It is Al-Khitmi, with Kasra on Kha and Shadda on Ya, and the common people open the Kha and do not stress the Ya. See: Al-Takmila 53. \n124. In the original: Al-Khatmi, with Ta. This is a distortion.",
    "book_id": "310",
    "new_page_number": 18
  },
  {
    "serial_number": "6366599",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "Al-Zubaydi (125) said: They say for the known cane (126): (Khayzaran), with Fatha on Za. The correct is Damma. Every tender and soft branch is 'Khayzuran'.\nI say: Most people in our lands say: 'Hazaran' (127).\nI say: [They say] (128) So-and-so was given the 'Khatabah' (Preachership) of such-and-such mosque, with Kasra on Kha. This is not from the speech of Arabs. Al-Jawhari (129) said: 'Khatuba', with Damma, 'Khatabah', with Fatha, meaning became a preacher (Khatib). In Al-Qamus (130): 'Khataba' on the pulpit 'Khatabatan', with Fatha.\nAmong their shameful errors: 'Al-Khajil' and 'Al-Khashin', for the correct is omitting the Ya (131).\n\nLetter Dal\nAl-Hariri (132) said: The choice is to write words like 'Dawud' and 'Tawus' [and 'Nawus'] with one Waw for lightening, and write (Dhawu) with two Waws so it is not confused with its singular [which is Dhu].\nAl-Jawzi (133) said: The common people say (134): 'Dimishq', with Kasra on Mim. The correct is Fatha. In Al-Qamus (135): And its Mim may be broken.",
    "foot_note": "1. (125) Lahn al-Awamm 54. \n126. In the original: Li-al-qadib. What we established is from Lahn al-Awamm. \n127. Al-Tanbih 21. \n128. Required by context. \n129. Al-Sihah (Khataba). \n130. Al-Qamus al-Muhit 1/63. \n131. Al-Tanbih 20-21. \n132. Durrat al-Ghawwas 205. The text between brackets is from it. \n133. Taqwim al-Lisan 123? (134) In the original: Yaqul. \n135. Al-Qamus al-Muhit 3/232. In the original: Yuksar. I established the phrase of Al-Qamus.",
    "book_id": "310",
    "new_page_number": 19
  },
  {
    "serial_number": "6366600",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "I say: They break (Kasra) the Waw of 'Al-Da'awi' (Claims), and the correct is Fatha like 'Fatawa' (136).\n\nLetter Dhal (Pointed)\nIbn Barhan (137) faulted those who apply the word 'Al-Dhat' to Allah Almighty because it is the feminine of (Dhu), and it is incorrect to apply what has a feminine sign to Him Almighty. He also faulted those who say: 'Al-Sifat Al-Dhatiyyah', because the attribution to 'Dhat' is 'Dhawawiyy' (138).\nI say: His answer is that they made the word 'Al-Dhat' a name for the reality of everything, and agreed upon it so the femininity was removed from it, then they applied it (139) to Him Almighty. And that which we pointed to, they did not change in attribution.\n\nLetter Ra\nAl-Hariri (140) said: They write (Al-Rahman) deleting the Alif in every place, while deletion is only upon entering the Lam of definition. As for annexation, like your saying: 'Ya Rahman al-dunya wa al-akhirah' (O Merciful of the world and Hereafter), the Alif is affirmed.\nHe also said (141): The choice is to write (Al-Harith) deleting the Alif with the Lam of definition and affirming it when indefinite so it is not confused with 'Harth'.\nHe said in another place (142): Among what the Alif is affirmed in one place,",
    "foot_note": "1. (136) Al-Tanbih 21. I say: Kasra is also permissible. (See verification of that in Al-Misbah al-Munir 1/209). \n137. He is Abu Al-Qasim Abd al-Wahid bin Ali bin Barhan (with Fatha on Ba) Al-Ukbari, the grammarian, d. 456 AH. (Al-Ikmal by Ibn Makula 1/246, Inbah al-Ruwat 2/213, Bughyat al-Wu'ah 2/120). His saying is in Al-Takmila 12 and Shifa' al-Ghalil 131. \n138. Al-Takmila 12, Shifa' al-Ghalil 131. \n139. In the original: Atlaqu. \n140. Durrat al-Ghawwas 201. \n141. Durrat al-Ghawwas 201. \n142. Durrat al-Ghawwas 201. The speech is connected to the previous speech and not in another place.",
    "book_id": "310",
    "new_page_number": 20
  },
  {
    "serial_number": "6366601",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "and deleted in another place: 'Salih', 'Malik', [and 'Khalid']. It is affirmed if they occur as descriptions, as in your saying: 'Zaidun Salihun' (Zaid is righteous), 'Hadha Maliku al-dari' (This is the owner of the house), and 'Al-mu'minu Khalidun fi al-jannati' (The believer is eternal in Paradise). And it is deleted if they occur as pure names.\nI say: Among their errors is the word (Al-Riqqiyyah), for 'Al-Riqq' (Slavery) is a source that does not need the insertion of the Masdari Ya (143). In Al-Qamus (144): And 'Al-Raqiq': The slave, clearly in 'Riqq', with Kasra.\nSimilarly their stressing (Shadda) the Ya of (Rafahiyah), for it (4b) is lightened (145). Likewise 'Al-Salahiyah' and 'Al-Karahiyah'. As for (Al-Ariyah), lightening and stressing were permitted in it, and stressing was made higher (146).\nThey say for the known island: 'Ridus', placing Dal Muhmalah before Waw. In Al-Qamus (147): 'Rudis', with Damma on Ra and Kasra on Dal: An island in the Roman Sea opposite Alexandria.\n\nLetter Zay\nAl-Siqilli (148) said: They say: 'Zarnikh', with Fatha on Zay. The correct is Kasra.\nHe said (149): They say for the known star: 'Al-Zuhrah' (Venus), with Sukun on Ha. The correct is Fatha.",
    "foot_note": "1. (143) Al-Tanbih 24. \n144. Al-Qamus al-Muhit 3/237. \n145. Al-Tanbih 24. \n146. Tathqif al-Lisan 172. \n147. Al-Qamus al-Muhit 2/219. See: Mu'jam Ma Ista'jam 683. In Bahr al-Awamm 201: Some people apply Damma to its Dal, which is a grammatical error as far as I know. \n148. Tathqif al-Lisan 271. \n149. Tathqif al-Lisan 119.",
    "book_id": "310",
    "new_page_number": 21
  },
  {
    "serial_number": "6366602",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "Al-Hariri (150) said: They say: 'Zumurrud' (Emerald), with Dal Muhmalah, while it is with Dhal Mu'jamah. Al-Siqilli (151) said: It is with Fatha on Ra. In Al-Qamus (152): 'Al-Zumurrud', with Dal Muhmalah: 'Al-Zumurrud' (Emerald). In it also (153): 'Al-Zumurrud', with Dammas and stressing Ra: 'Al-Zabarjad' (Peridot/Chrysolite), Arabized.\nI say: I have not seen anyone who spoke about stones saying: Zumurrud is Zabarjad. Ibn al-Wardi (154) said in (Jazirat al-Aja'ib) (155): Zabarjad is a green transparent stone resembling ruby. Then he said: Zumurrud is a green transparent stone used in medicinal treatments. Ibn Sa'id al-Ansari (156) said in (Nukhab al-Dhakha'ir) (157), after speaking about Zumurrud at length: Zabarjad: It is a single type, pistachio-colored, transparent but quickly extinguished [due to its softness], and it was said: Its mine is near the mine of Zumurrud. It is not hidden that this is a text on difference.",
    "foot_note": "1. (150) Durrat al-Ghawwas 35. \n151. Tathqif 61 and in it: The correct is: Zumurrudh, with Dhal and Fatha on Ra, and may have Damma. In the original: With Fatha on Zay. This is a distortion. \n152. Al-Qamus al-Muhit 1/298. \n153. Al-Qamus al-Muhit 1/354. \n154. He is Siraj al-Din Umar bin al-Wardi the Shafi'i jurist, d. 861 AH. (See: Encyclopedia of Islam 1/302, Al-A'lam 5/229 (margin) and 10/162). \n155. So. The name of the printed book: (Kharidat al-Aja'ib wa Faridat al-Ghara'ib). \n156. He is Muhammad bin Ibrahim bin Sa'id al-Ansari known as Ibn al-Akfani, d. 749 AH. (Al-Durar al-Kaminah 3/366, Dhayl Tadhkirat al-Huffaz by Al-Husayni 22, Al-Badr al-Tali' 2/79). \n157. Nukhab al-Dhakha'ir fi Ahwal al-Jawahir 53-54. In the original: Nujab. This is a misspelling. The text between brackets is from Nukhab al-Dhakha'ir.",
    "book_id": "310",
    "new_page_number": 22
  },
  {
    "serial_number": "6366603",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "Al-Hariri (158), Al-Jawzi (159), and Al-Diya Musa al-Ashrafi (160) agreed that if it is said for two: 'Indi Zawj' (I have a pair), it is an error, because 'Zawj' in Arab speech is the individual paired with its companion. As for the two companions, they are called: 'Al-Zawjan'. In Mukhtar al-Sihah (161): 'Al-Zawj' is the husband, and 'Al-Zawj' is also the woman. She is called: 'Zawjah'. 'Al-Zawj' is opposite of individual, and each of them is called 'Zawj' also.\nI say: They say for the known dye: 'Zinjufr' (Cinnabar), with Kasra on Zay. The correct is Damma. So in Al-Qamus (162).\nSimilarly, some saying: 'Al-Zi'amah' (Leadership), with Kasra on Zay, is an error. The correct is Fatha (163).\nLike their saying: 'Al-Zimakhshari' (164), for the correct is Fatha on Zay.\n\nLetter Sin (Unpointed)\nAl-Jawhari (165) mentioned the word (Al-Sa'ir) in (Sayara) meaning 'the whole' after mentioning it in (Sa'ara) (166) meaning 'the remainder'.",
    "foot_note": "1. (158) Durrat al-Ghawwas 185. \n159. Taqwim al-Lisan 136. \n160. I did not find a biography for him. Al-Safadi quoted his saying in Tashih al-Tashif 177. \n161. Mukhtar al-Sihah (Zawj). See: Bahr al-Awamm 185. \n162. Al-Qamus al-Muhit 2/41. \n163. Al-Tanbih 24. \n164. Attributed to Zamakhshar: a village of Khwarazm, to which Al-Zamakhshari is attributed, whose biography preceded in footnote (11). \n165. See Al-Sihah (Sa'ara, Sayara). See: Hashiyat al-Baghdadi 'ala Sharh Ibn Hisham 'ala Banat Su'ad 2/35-39. \n166. In the original: Sa'ir. This is a distortion.",
    "book_id": "310",
    "new_page_number": 23
  },
  {
    "serial_number": "6366604",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "People were fond of faulting it, among them: Al-Hariri (167), Al-Zubaydi (168), and Ibn Hisham (169) where he said: I do not know anyone of the Imams of language who mentioned that it means 'the whole' except the author of Al-Sihah, which is an illusion. (5a) Mulla Hasan (170) Chalabi, may Allah rest his soul, narrated from some Imams of language in (Hashiyat al-Talwih) that it means 'the whole', then said: And the truth is that both meanings are established linguistically. In Al-Qamus (171): And 'Al-Sa'ir' is the remainder, not the whole as groups imagined, or it may be used for it, and from it is the saying of Al-Ahwas (172): (Poetry) (Fajalatha lana Lubabatu lamma ... waqadha al-nawmu sa'ira al-hurrasi) (Lubaba revealed it to us when ... sleep overcame the rest [all] of the guards).\nImam Abu Mansur Al-Jawaliqi (173) said: They say: 'Sitti'. The correct is: 'Sayyidati' (My lady).\nAl-Jawzi (174) said: The common people say: 'Nahnu fi si'atin' (We are in plenty), with Kasra on Sin. The correct is Fatha.",
    "foot_note": "1. (167) Durrat al-Ghawwas 3. \n168. Tashih al-Tashif 180 and the original of his book missed it. See also: Taqwim al-Lisan 142. \n169. Sharh Qasidat Banat Su'ad 33. Ibn Hisham is Abdullah bin Yusuf Al-Ansari, has many works, d. 761 AH. (Tabaqat al-Shafi'iyyah 6/33, Al-Durar al-Kaminah 2/415, Husn al-Muhadarah 1/536). \n170. He is Hasan Chalabi bin Muhammad Shah Al-Hanafi, d. 879 AH. (Al-Shaqa'iq al-Nu'maniyyah 114, Shadharat al-Dhahab 7/324, Hadiyat al-Arifin 1/288 states he died 886 AH). Al-Talwih, which he annotated, is by Al-Taftazani. \n171. Al-Qamus al-Muhit 2/43. \n172. His poetry: 111. Al-Ahwas is Abdullah bin Muhammad Al-Ansari, Umayyad, d. 105 AH (Tabaqat Ibn Salam 96, Al-Shi'r wa al-Shu'ara 518, Al-Aghani 4/224). \n173. Takmilat Islah Ma Taghlutu Fihi Al-Awamm 29. See Taqwim al-Lisan 143. Al-Jawaliqi is Mawhub bin Hamad, author of Al-Mu'arrab and Sharh Adab al-Katib, d. 540 AH. (Nuzhat al-Alba 396, Mu'jam al-Udaba 19/205, Inbah al-Ruwat 3/335). \n174. Taqwim al-Lisan 138. See: Al-Takmila 48.",
    "book_id": "310",
    "new_page_number": 24
  },
  {
    "serial_number": "6366605",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "Al-Hariri (175) said: They say for this type of scented plant: 'Susan' (Lily), with Damma on Sin. The correct is Fatha.\nI say: The common people say: 'Fulan salas al-bawl' (So-and-so has incontinence of urine), with Fatha on Lam. The correct is Kasra like 'Kadir' and 'Khashin' (176).\nAmong their errors is the word (Al-Sabaqah) (Precedence/Race), for the source of 'Sabaqa yasbiqu' is without Ta (177).\nAmong them is their saying: 'Ghabat al-Suruji', with Damma on Sin. It is with Fatha, attributed to (Saruj), a city in the regions of Khorasan. Thus in Al-Jawahir al-Mudiyyah (178).\nAmong them is their saying: 'Sibawayh', with Kasra on Ba. It is with Fatha. Ibn Khallikan (179) said: And 'Sibawayh' with Kasra on Sin Muhmalah, Sukun on Ya with two dots below, Fatha on Ba, Waw, Sukun on Ya with two dots below, and after it a silent Ha. It is a Persian nickname meaning in Arabic 'scent of apples'. This is how Arabic scholars vocalize this name and its likes such as 'Niftawayh' and 'Amrawayh' [and others]. The Persians say: 'Sibuyah', with Damma on Ba, Sukun on Waw, and Fatha on Ya (180). It was said (181): He was named Sibawayh because his cheeks were like two apples, and he was extremely beautiful.",
    "foot_note": "1. (175) Durrat al-Ghawwas 128. \n176. Al-Tanbih 26. \n177. Al-Tanbih 25. And in it: (The word 'Sabq' is the source of 'Sabaqa' from the form 'Daraba', and people add Ta to it saying: 'Al-Sabaqah', claiming it is the source of 'Sabaqa', so it is a grammatical error from them. Yes, it can be said: It is permissible for the Ta to be for singular occurrence (Marrah) like 'Darbah' for example, meaning one race. But whoever traces their usage knows they do not intend Marrah and the meaning of Marrah does not cross their minds at all, rather they use it meaning source only, saying 'it is like a slip of the tongue' (Sabqat al-lisan) and there is no meaning for considering Marrah here). \n178. Al-Jawahir al-Mudiyyah 2/316. See: Mu'jam Ma Ista'jam 737. \n179. Wafiyat al-A'yan 3/465. The text between brackets is from it. \n180. Following it in Al-Wafiyat: because they dislike (Wayh) occurring at the end of the word because it is for lamentation. \n181. The speaker is Ibrahim al-Harbi, in Al-Wafiyat.",
    "book_id": "310",
    "new_page_number": 25
  },
  {
    "serial_number": "6366606",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "Among them is some people saying: (Sufrah) for what the dining table is placed upon. This is an error, it is with Sin (Sufrah). Al-Jawhari (182) said: 'Al-Sufrah' with Damma is food taken for a traveler, hence 'Al-Sufrah' was named.\nThe common people say for the known town: 'Siwas'. The correct is: 'Siwas', with Ya after Sin. Mentioned in Al-Qamus (183).\n\nLetter Shin (Pointed)\nA group of Imams of Arabic agreed that (Al-Sha'm) (Levant/Syria) has Hamza and is masculine. Al-Jawhari (184) mentioned it in the chapter of Mim before (Shaym), indicating it has Hamza, and said: Al-Sha'm is a land, masculine and feminine. The author of Al-Qamus (185) permitted both aspects: with and without Hamza, and said: It may be masculine.\nSimilarly, they agreed that the Shin of the word (Al-Shitranj) (Chess) is with Kasra, and Fatha is an error (186), and they corrected it with Sin (Muhmalah) and Shin (Mu'jamah) (187).\nAl-Jawaliqi (188) said: The common people say: 'Al-Shahnah', with Fatha on Shin. The correct is Kasra.\nAl-Siqilli (189) said: They say: [The sun settled in] 'Al-Shurutayn', with Damma on Shin (5b) and Ra. The correct is Fatha on both. [And neither is used in singular].",
    "foot_note": "1. (182) Al-Sihah (Safara). See: Shifa' al-Ghalil 154. \n183. Al-Qamus al-Muhit 2/222. Yaqut did not mention it in Mu'jam al-Buldan, nor Al-Himyari in Al-Rawd al-Mi'tar. \n184. Al-Sihah (Sha'ama). See: Tashih al-Tashif 195. \n185. Al-Qamus al-Muhit 4/134. \n186. Tathqif al-Lisan 246. \n187. Al-Qamus al-Muhit 1/196, and in it: And Sin is a dialect in it. \n188. Al-Takmila 48. \n189. Tathqif al-Lisan 132. The text between brackets is from it. See: Al-Anwa' 17, Jana al-Jannatayn 65.",
    "book_id": "310",
    "new_page_number": 26
  },
  {
    "serial_number": "6366607",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "Al-Hariri (190) and Al-Jawzi (191) said: The common people say: 'Shawwashtu al-shay'a' (I confused the thing), if you mixed it, so it is 'Mushawwash'. The correct is: 'Hawwashtuhu' and it is 'Muhawwash'. In Al-Qamus (192): 'Al-Tashwish', 'Al-Mushawwash', and 'Al-Tashawwush', all are grammatical errors, and Al-Jawhari erred (193). The correct is: 'Al-Tahwish', 'Al-Muhawwash', and 'Al-Tahawwush'.\nAl-Jawzi (194) said: The common people say: 'Shattana ma baynahuma' (How different is what is between them). The correct is: 'Ma huma' (How different they are).\nI say: Among their errors is their saying for the author of Al-Milal wa Al-Nihal: Muhammad Al-Shahristani (195) with Kasra on Ra. It is with Fatha, attributed to (Shahristan), a town near (Nasa) in Khorasan. Thus in Al-Jawahir al-Mudiyyah (196).\nAmong them is their saying: 'Al-Shabahah', for linguists only mentioned 'Al-Shabah', with two Fathas (197). Similarly, they did not mention the word (Al-Faraghah), but what they mentioned is: 'Al-Faragh' and 'Al-Furugh' (198). Likewise (Al-Sakhawah), for the source of 'Sakhiyy' is: 'Sakha'', 'Sakhan', 'Sukhuwwah', and 'Sukhuww' (199).\nAmong their most hideous sayings: 'Al-Falakah' meaning poverty (200), and 'Al-Nazakah' meaning elegance, for they have no origin in the speech of Arabs.",
    "foot_note": "1. (190) Durrat al-Ghawwas 37. See: Al-Zahir 1/450, Diwan al-Adab 3/432. \n191. Taqwim al-Lisan 204-205. See: Al-Misbah al-Munir 1/351, Shifa' al-Ghalil 160. \n192. Al-Qamus al-Muhit 2/276-277. \n193. In Al-Sihah (Shawsha). \n194. Taqwim al-Lisan 148. In the original: (Shattana baynahuma, wa al-sawab: ma baynahuma). What we established is from Taqwim al-Lisan and Tashih al-Tashif 198. See: Al-Zahir 1/602. \n195. In the original: Shahristan. Al-Shahristani is Muhammad bin Abd al-Karim, d. 548 AH. (Mu'jam al-Buldan 3/377, Wafiyat al-A'yan 4/232, Lisan al-Mizan 5/263). \n196. Al-Jawahir al-Mudiyyah 2/322. In the original: Nishapur instead of Nasa, which is a distortion. \n197. Al-Tanbih 27. \n198. Al-Tanbih 32. \n199. See Al-Lisan and Al-Taj (Sakha). In Al-Lisan: Al-Sakhawah and Al-Sakha': Generosity. \n200. Al-Tanbih 32.",
    "book_id": "310",
    "new_page_number": 27
  },
  {
    "serial_number": "6366608",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "Just as there is no origin for their saying (Tarzin) for false speech.\nAmong them: 'Al-Shafqah', with Sukun on Fa. The correct is moving it (Fatha). Thus I found it regulated in two authentic copies of Al-Sihah (201).\n\nLetter Ta (Unpointed)\nAl-Siqilli (202) said: They say: 'Akhadhtu bi-tarfi thawbihi', with Sukun on Ra. The correct is moving it (Fatha).\nAl-Jawzi (203) said: The common people say: 'Tarsus', with Sukun on Ra. The correct is Fatha.\nAl-Siqilli (204) said: They say: 'Hatim Tay'. The correct is: 'Hatim Tayyi'' (205), with Hamza after a stressed Ya.\nI say: Similarly they err in it and say: 'Khatam', with Kha Mu'jamah and Fatha on Ta. It is with Muhmalah (H) and Kasra on Ta. Thus in Al-Qamus (206).\n\nLetter 'Ayn (Unpointed) (207)\nAl-Siqilli (208) said: They say: Every day its night is before it except the day of Ashura, its night is after it. It is not so, rather it is Arafa.",
    "foot_note": "1. (201) Al-Sihah (Shafaqa). \n202. Tathqif al-Lisan 121. \n203. Taqwim al-Lisan 153. \n204. Tathqif al-Lisan 158. \n205. He is Hatim bin Abdullah Al-Ta'i, a pre-Islamic poet proverbial for his generosity. (Al-Akhbar al-Muwaffaqiyyat 103, Al-La'ali 606, Khizanat al-Adab 1/491 and 2/162). (206) Al-Qamus al-Muhit 4/93. \n207. In the original: Ghayn Mu'jamah, which is an illusion. \n208. Tathqif al-Lisan 204.",
    "book_id": "310",
    "new_page_number": 28
  },
  {
    "serial_number": "6366609",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "He also said (209): They say: 'Ajuzah'. The correct is: 'Ajuz'.\nAl-Jawzi (210) said: The common people apply (Al-Asas) to the singular, while it is for the group, plural of 'Ass'.\nAl-Siqilli (211) said: What is confusing is their saying: 'Uman', with Damma on 'Ayn and lightening Mim: a country on the seashore between Basra and Aden. And 'Amman', with Fatha on 'Ayn and stressing Mim: a country in the Levant (212).\nI say: As for what is famous in our lands of applying (Al-Umman) with Damma on 'Ayn and stressing Mim meaning the great sea, I found no support for it in Arabic books.\nAl-Jawaliqi (213) said: The common people say: This is 'Umraniyyah' language. The correct is: 'Ibraniyyah' (Hebrew).\nAl-Zubaydi (214) said: They say: 'Bihi umyun'. The correct is: 'Aman', with Fatha on 'Ayn and Mim.\nI say: Al-Jawhari and the author of Al-Qamus did not differentiate between 'Al-Am' and 'Al-Sanah' (Year). Al-Jawaliqi (215) said: The correct is that every 'Sanah' is an 'Am' without the reverse, for if we count (6a) from a day to its like, it is a 'Sanah' which includes half of winter and half of summer, while 'Al-Am' is only summer and winter.",
    "foot_note": "1. (209) Tathqif al-Lisan 102. See: Taqwim al-Lisan 161. \n210. Taqwim al-Lisan 159. In the original: Jami' 'As. \n211. Tathqif al-Lisan 166. \n212. See regarding Uman and Amman: Mu'jam Ma Ista'jam 970, Mu'jam al-Buldan 4/150-151, Al-Rawd al-Mi'tar 412. \n213. Al-Takmila 45. See: Taqwim al-Lisan 158. \n214. His book's original missed it, it is in Tashih al-Tashif 231, and the publisher appended it on 283 of Lahn al-Awamm quoting it. \n215. Al-Takmila 8.",
    "book_id": "310",
    "new_page_number": 29
  },
  {
    "serial_number": "6366610",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "I say: Among their shameful errors is their saying: (Alaniyan) with Alif after Ya. The correct is: 'Alaniyah', with Ha after Ya (216).\nSimilar to that is their saying: (Haliyan) inserting Ya between Lam and Alif. The correct is 'Halan'.\nAmong their illusions is breaking the 'Ayn of the word (Al-Aysh) (Life), for it is open (217). Conversely, their saying: (Al-Ayan) with Fatha on 'Ayn, for it is broken (Kasra) (218).\nAmong them is their saying: 'Ami', lightening the Mim. It is stressed because it is an attribution to the word 'Al-Ammah' (Common people) (219).\n\nLetter Ghayn (Pointed)\nImam Abu Abdullah Hamza bin Hasan Al-Asbahani (220) said: Among their errors: 'Al-Ghulam' and 'Al-Jariyah', they think they mean slave and slave-girl. It is not so, 'Al-Ghulam' and 'Al-Jariyah' are: the young ones (221). It was said: 'Al-Ghulam': One whose mustache is growing.\nI say: Among those mistaken in the word (Al-Ghulam) is Ibn Firishtah (222) in the first verse of his poem in which he interpreted Arabic into Turkish.",
    "foot_note": "1. (216) Al-Tanbih 30. \n217. Al-Tanbih 31. \n218. Al-Tanbih 30. \n219. Al-Tanbih 30. \n220. Died around 360 AH, was prejudiced against Arabs. (Al-Fihrist 205, Inbah al-Ruwat 1/335, Al-A'lam 2/309). \n221. See: Taqwim al-Lisan 110 and 162. \n222. His name is Abd al-Majid, known as Ibn Malak, one of the Hanafi scholars, has a book (Ishq Namah), d. 874 AH. (Lughat Namah 17 (Letter Fa), Encyclopedia of Islam in Turkish vol 36/652). Professor Dr. Hussein Ali Mahfouz graciously provided me with his biography.",
    "book_id": "310",
    "new_page_number": 30
  },
  {
    "serial_number": "6366611",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "Al-Hariri (223) said: They say: 'Fa'ala al-ghayru dhalik' (The other did that), introducing the definition article to (Ghayr), and verifiers among grammarians forbid that.\nThey say to the commentator of Al-Kafiyah (224): 'Ghujduwani', with Damma on Dal, while it is with Fatha, attributed to Ghujdawan: a village of the villages of Bukhara. Thus in Al-Jawahir al-Mudiyyah (225).\nAmong their distortions is their saying: 'Al-Ghada'', with Dal Muhmalah, for what causes growth and sustenance of the body. It is with Dhal Mu'jamah (226). In Al-Sihah (227): 'Al-Ghidha'': What one is nourished (yughtadha) (228) by of food or drink.\nThe common people say: 'Al-Ghaybah', with Fatha on Ghayn, for mentioning faults of others. It is with Kasra (229).\n\nLetter Fa\nAl-Siqilli (230) said: 'Farat al-Misk' (Musk vesicle) is without Hamza, and 'Al-Fa'rah' (Mouse) of animals is with Hamza. In Al-Qamus (231): 'Al-Fa'r' is known, and 'Al-Fa'rah' (232) is for male and female. And 'Nafijat al-Misk' [and without Ha: Al-Misk] or the correct is citing 'Farat al-Misk' (233) under (Fara) for the diffusing of its scent.",
    "foot_note": "1. (223) Durrat al-Ghawwas 43. \n224. He is Jalal al-Din Ahmad bin Ali bin Mahmoud Al-Ghujduwani Al-Hanafi the grammarian, d. around 730 AH (Kashf al-Zunun 1371, Hadiyat al-Arifin 1/107). \n225. Al-Jawahir al-Mudiyyah 2/231. \n226. Al-Tanbih 31. \n227. Al-Sihah (Ghadha). \n228. In the original: yataghaddha. Correction from Al-Sihah. \n229. Al-Tanbih 31. \n230. Tathqif al-Lisan 159. \n231. Al-Qamus al-Muhit 2/107. The text between brackets is from it. \n232. In the original: Al-Fa'r. \n233. (Or the correct is citing Farat al-Misk): repeated in the original.",
    "book_id": "310",
    "new_page_number": 31
  },
  {
    "serial_number": "6366612",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "Al-Jawaliqi (234) said: 'Al-Fata' is not in the meaning of youth and young man, rather it means the complete, judicious of men. In Al-Sihah (235): 'Al-Fata': The young man and the generous noble.\nAl-Siqilli (236) said: They say: 'Firz' of chess. Its correct form is: 'Firzan'.\nHe said (237): They say: 'Al-Fustuq'. The correct is: 'Al-Fustaq', with Fatha on Ta. The author of Al-Qamus (238) permitted Damma as well.\nHe said (239): They say for the Prophet's sword: 'Dhu al-Fiqar', with Kasra on Fa. The correct is Fatha.\nHe said (240): They say: 'Fihrisat al-kitab', making the Ta in it for feminine, and pausing on it with Ha. The correct is: 'Fihrist' (241), with Sukun on Sin, and the Ta in it is original (242), and its meaning in Persian: Total number. (6b)\nI say: In Al-Qamus (243): 'Al-Fihris', with Kasra on Fa: The book in which books are collected, Arabized from 'Fihrist'. In Diwan al-Adab (244): 'Al-Fihris': Water divider, on the weight of (Al-Fi'lal), it is Greek language so they Arabized it and used it in the collection of chapters, and the Ta in it is a gross error, and abandoning it is obligatory on all people.\nAl-Siqilli (245) said: They say: People of 'Al-Falahah' (Agriculture), with Fatha on Fa. The correct is Kasra,",
    "foot_note": "1. (234) Al-Takmila 16 quoting Ibn Qutaybah. \n235. Al-Sihah (Fata). \n236. Tathqif al-Lisan 113. \n237. Tathqif al-Lisan 123. See: Al-Radd 'ala Ibn Makki 40-41. \n238. Al-Qamus al-Muhit 3/276. \n239. Tathqif al-Lisan 131. \n240. Tathqif al-Lisan 54. See: Shifa' al-Ghalil 204. \n241. In the original: Fahras. \n242. In the original: Asl. \n243. Al-Qamus al-Muhit 2/238. \n244. I did not find this saying in Diwan al-Adab by Al-Farabi. \n245. Tathqif al-Lisan 137. In the original: Al-Jawzi said. This is an illusion, as it is not in his book.",
    "book_id": "310",
    "new_page_number": 32
  },
  {
    "serial_number": "6366613",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "because it is a craft of crafts like 'Zira'ah' and 'Hirathah', and 'Al-Falh' is splitting the earth. In Al-Qamus (246) 'Al-Falahah', with Fatha: Plowing. In Mukhtar al-Sihah (247): And 'Al-Filahah', with Kasra: Plowing. Perhaps it is the truth.\nI say: They say: So-and-so died 'Fuj'atan', with Damma on Fa, Sukun on Jim, and open Hamza. The correct is Damma on Fa, Fatha on Jim, followed by Alif then open Hamza. It is mentioned in language books (248).\n\nLetter Qaf\nAl-Hariri (249) said: They say: I bid farewell to 'Qafilat al-Hajj' (Caravan of Hajj), speaking what contradicts speech, because farewell is only for one leaving for travel, and 'Al-Qafilah' is a name for the group returning to the homeland.\nI say: There is a discussion in it, because some major linguists like the author of Al-Qamus (250) stated that 'Al-Qafilah' is the returning group (251) and the group starting the journey, in optimism for return. By this appears what is in the saying of whoever made Al-Hariri's speech a support to refute Al-Jawhari (252) in interpreting 'Al-Qayrawan' as 'Al-Qafilah'.\nAl-Siqilli (253) said: They say: 'Qalib' and 'Tajin', with Kasra on Lam and Jim. The correct is Fatha on both.",
    "foot_note": "1. (246) Al-Qamus al-Muhit 1/241. \n247. Mukhtar al-Sihah (Falaha). \n248. See: Taqwim al-Lisan 164. \n249. Durrat al-Ghawwas 119. See: Adab al-Katib 20, Al-Zahir 2/76, Tahdhib al-Lugha 9/160-161, Al-Takmila wa al-Dhayl wa al-Sila 5/490, Tahdhib al-Khawass min Durrat al-Ghawwas 181. \n250. Al-Qamus al-Muhit 4/39. \n251. In the original: Al-Qaffalah. \n252. Al-Sihah (Qara). See: Al-Takmila by Al-Jawaliqi 49. \n253. Tathqif al-Lisan 134.",
    "book_id": "310",
    "new_page_number": 33
  },
  {
    "serial_number": "6366614",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "He said (254): The common people say: 'Al-Qustantiniyyah', stressing the Ya. The correct is lightening it.\nI say: The author of Al-Mughrib (255) supports this. Ibn Khallikan (256) said in the biography of Yusuf bin Waharah (257): 'Al-Qustantiniyyah' with Damma on Qaf, Sukun on Sin Muhmalah, Fatha on Ta Muhmalah, Sukun on Nun, Kasra on second Ta, Sukun on Ya with two dots below, Kasra on Nun, Fatha on second Ya, and at its end Ha (258). He did not mention stressing the second Ya, although his habit is to mention such things. He said in the biography of Abu Firas (259) after saying: (With two dots below) And after it Nun. So two languages are summarized from him in that name. In Al-Qamus (260): And 'Qustantinah' or 'Qustantiniyyah' with adding a stressed Ya, and the first Ta may have Damma: The abode of the King of the Romans, and its conquest is among the signs of the Hour, and it is called in Roman [Buzantiya].\nAl-Siqilli (261) said: They say: 'Al-Qal'ah' (262), with Sukun on Lam. The correct is Fatha.\nI say: Some linguists mentioned Sukun as well.\nThey say: 'Al-Qatar' and 'Al-Qantar', with Fatha on Qaf in both. The correct (7a) is Kasra (263).",
    "foot_note": "1. (254) See: Tathqif al-Lisan 238. What the author quoted is Al-Safadi's text in Tashih al-Tashif 253 from Al-Siqilli, and there is a difference between them. \n255. Al-Mughrib fi Tartib al-Mu'arrab 382. Its author is Al-Mutarrizi Nasir bin Abd al-Sayyid, d. 610 AH. (Inbah al-Ruwat 3/339, Wafiyat al-A'yan 5/369, Mir'at al-Jinan 4/20). \n256. Wafiyat al-A'yan 7/78. \n257. In the original: Maradah. Yusuf bin Ayyub bin Waharah, d. 530 AH. (Al-Muntazam 10/94, Al-Ibar 4/97, Shadharat al-Dhahab 3/110). \n258. In the original: Ya. This is a distortion. \n259. Wafiyat al-A'yan 2/64. Abu Firas al-Hamdani is Al-Harith bin Sa'id, cousin of Saif al-Dawla, d. 357 AH. (Yatimah al-Dahr 1/48-103, Al-Muntazam 7/68, Zubdat al-Halab 1/157). \n260. Al-Qamus al-Muhit 2/379-380. The text between brackets is from it. \n261. Tathqif al-Lisan 119. \n262. In the original: Al-Ammah. This is a distortion. \n263. Al-Qamus al-Muhit 2/119 and 122.",
    "book_id": "310",
    "new_page_number": 34
  },
  {
    "serial_number": "6366615",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "Among what the common people are confused about is the word (Al-Qulanj) (Colic). In Al-Qamus (264): 'Al-Qulanj', and its Lam may be broken, or it is broken Lam and Qaf is opened and Damma. It was said (265): The common people are deluded in its meaning as they use it for back pain, while it is an intestinal disease with which passing wind is difficult.\nThey say for the known island: 'Qibris' (Cyprus), with Kasra on Qaf. The correct is Damma. Thus in Al-Qamus (266).\n\nLetter Kaf\nAl-Hariri (267) said: Abu Al-Qasim said: I asked Abu Bakr bin Durayd (268) about 'Al-Kaghad' (Paper). He said: It is said with Dal, Dhal, and Za Mu'jamah. Tha'lab (269) concurred with him.\nAl-Jawzi (270) said: They say: 'Kaffat al-mizan', with Fatha on Kaf. The correct is Kasra. In Al-Qamus (271): And it is opened.",
    "foot_note": "1. (264) Al-Qamus al-Muhit 1/204. \n265. The speaker is Ibn Kamal Pasha in Al-Tanbih 34. \n266. Al-Qamus al-Muhit 2/238. See: Mu'jam al-Buldan 4/305. \n267. Durrat al-Ghawwas 36. Abu Al-Qasim is Al-Hasan bin Bishr Al-Amidi, author of Al-Muwazanah and Al-Mu'talif wa Al-Mukhtalif, d. 370 AH. (Mu'jam al-Udaba 8/75, Inbah al-Ruwat 1/285, Bughyat al-Wu'ah 1/500). \n268. He is Muhammad bin Al-Hasan Al-Azdi, author of Al-Jamharah fi al-Lugha and Al-Ishtiqaq etc., d. 321 AH. (Tabaqat al-Nahwiyyin wa al-Lughawiyyin 183, Nuzhat al-Alba 256, Nur al-Qabas 342). \n269. He is Abu Al-Abbas Ahmad bin Yahya, Imam of the Kufans in grammar and language, d. 291 AH. (Tarikh Baghdad 5/204, Inbah al-Ruwat 1/138, Tabaqat al-Mufassirin 1/94). \n270. Taqwim al-Lisan 174. \n271. Al-Qamus al-Muhit 3/191. Ibn Hisham al-Lakhmi said in his book (Al-Madkhal ila Taqwim al-Lisan) s 23: And Kaffat al-Mizan, it has two languages: Kiffah, with Kasra on Kaf, which is the eloquent one. Al-Kisa'i narrated: Kaffat al-Mizan, with Fatha, which is weaker.",
    "book_id": "310",
    "new_page_number": 35
  },
  {
    "serial_number": "6366616",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "Similar to it is the word (Karman), name of the country, in the permissibility of two vowels (272).\nAl-Zubaydi (273) said: They say for the tool used to extract teeth (Kalba-tan). The correct is: 'Kalalib'.\nI say: The author of Al-Qamus (274) mentioned it.\nAl-Siqilli (275) said: They say: 'Al-Kahanah' (Divination), with Fatha on Kaf. The correct is Kasra.\nI say: Conversely, their saying: 'Al-Kifaf', with Kasra on Kaf. The correct is Fatha. Al-Jawhari (276) mentioned it.\nThey say for the known animal that carries the elephant on its horn: 'Karkadan' (Rhinoceros), lightening the Dal. The correct is stressing it. The author of Al-Qamus (277) mentioned it.\nThey say for Abu Sakhr Al-Khuza'i, the famous poet, companion of Azza (278), who says about her (Verse): (Li-Azzata muhishan talalun qadimu (279)), 'Kathir' on the weight of 'Khalil'. The correct is: 'Kuthayyir', with Damma on Kaf, Fatha on Tha with three dots, and Shadda on Ya, diminutive of Kathir on the weight of Fu'ayl. He was diminutized because he was small, extremely short, and for that he was nicknamed (Zubb al-Dhubab). Ibn Khallikan (280) mentioned it.",
    "foot_note": "1. (272) Mu'jam al-Buldan 4/454 and in it: Karman with Fatha then Sukun and ends with Nun, and perhaps broken (Kasra), and Fatha is more famous. \n273. Lahn al-Awamm 164. \n274. Al-Qamus al-Muhit 1/125. \n275. Tathqif al-Lisan 128. \n276. Al-Sihah (Kafafa). And Al-Kafaf: Sustenance. \n277. Al-Qamus al-Muhit 4/263. \n278. He is Kuthayyir bin Abd al-Rahman, Umayyad, d. 105 AH. (Tabaqat Ibn Salam 540, Al-Shi'r wa al-Shu'ara 503, Mu'jam al-Shu'ara 242). \n279. The beginning of a verse attributed to Kuthayyir once and to Dhu al-Rumma another time with the narration: Li-Mayyata, and its second half: (Afa'u kulli ismin mustadimi...). See: Diwan Kuthayyir 536. \n280. Wafiyat al-A'yan 4/113.",
    "book_id": "310",
    "new_page_number": 36
  },
  {
    "serial_number": "6366617",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "They say: 'Al-Karrubiyyun' (Cherubim), stressing the Ra. In Al-Qamus (281): And 'Al-Karubiyyun', lightening the Ra: Masters of Angels.\n\nLetter Lam (282)\nAl-Siqilli (283) and Al-Jawzi (284) said: They make 'Al-Laban' (Milk) for daughters of Adam like animals, and they say 'Tadawaytu' (285) (I treated myself) with women's milk, and that is wrong. It is said: 'Laban' of the sheep, and 'Liban' of the woman.\nAl-Zubaydi (286) said: They say: 'Liqqat al-midad', so they stress the Qaf. The correct is: 'Liqah'.\nAl-Jawzi (287) differentiated between 'Al-Lahmah' and 'Al-Luhmah', saying: With Fatha on Lam it is used in cloth, and with Damma in lineage. Both vowels were permitted in each of them (288).\n\nLetter Mim\nAl-Safadi (289) faulted the word (Al-Mahsusat), because its origin is: 'Uhissa bi-kadha', so the passive participle from it is: 'Muhass', with Damma on Mim, Fatha on Ha, and Shadda on Sin.",
    "foot_note": "1. (281) Al-Qamus al-Muhit 1/123. \n282. The text between brackets is not in the original. \n283. Tathqif al-Lisan 215. See: Al-Radd 'ala Ibn Makki 27. \n284. Taqwim al-Lisan 179. \n285. In the original: Tadawaltu. This is a distortion. \n286. His book's original missed it, and it is in Tashih al-Tashif 270 by him, and from him in Ziyadat Lahn al-Awamm 293. \n287. Taqwim al-Lisan 178. \n288. See: Al-Nihayah fi Gharib al-Hadith wa al-Athar 4/240. In the original: Wa juwwiza al-harakatan fi kulli minha. \n289. Tashih al-Tashif 56. See: Al-Takmila 13, Taqwim al-Lisan 190.",
    "book_id": "310",
    "new_page_number": 37
  },
  {
    "serial_number": "6366618",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "I say: In Al-Qamus (290): And 'Hassastu lahu' 'Ahissu' with Kasra [Raqqaqtu lahu like Hasistu with Kasra] 'Hassan' [and 'Hissan'] (7b), and 'Hasastu al-shay'a' 'Ahsastuhu'.\nAl-Hariri (291) said: Most of the elite imagine that (Al-Ma'tam) is the gathering of mourning, while among Arabs it is women gathering in good and evil. In Al-Qamus (292): 'Al-Ma'tam' is every gathering in sadness or joy, or specific to women or young women. In Al-Sihah (293): And among the common people: The calamity. Upon this is the saying of Mufti Abu Al-Su'ud (294): (Poetry) (Labista al-thiyaba al-bida ba'di wa-innani ... 'ala ma'tamin mudh suqtu 'anka al-rawahila) (You wore white clothes after me while I ... am in mourning since I drove the riding camels away from you).\nAl-Siqilli (295) said: They say: The 'Masikah' (Holding) power. The correct is: 'Al-Mumsikah'. The author of Al-Qamus (296) mentioned 'Masaka' meaning 'Amsaka'.\nAl-Hariri (297) said: They say: 'Mabyu'' (Sold) and 'Ma'yub' (Defective). The correct is 'Mabi'' and 'Ma'ib'. In Al-Sihah (298): Every object (Maf'ul) from triliteral roots, if it is from Ya-roots, comes with deficiency and completeness. As for Waw-roots, nothing came complete except two words:",
    "foot_note": "1. (290) Al-Qamus al-Muhit 2/207. The text between brackets is from it. \n291. Durrat al-Ghawwas 142. See: Al-Fakhir 244, Al-Zahir 1/262, Tahdhib al-Khawass 180. \n292. Al-Qamus al-Muhit 4/72. \n293. Al-Sihah (Atama). \n294. He is Muhammad bin Muhammad, of Arabized Turk scholars, author of the Tafsir known by his name, d. 982 AH. (Shadharat al-Dhahab 8/398, Al-Fawa'id al-Bahiyyah 81, Al-A'lam 7/288). \n295. Tathqif al-Lisan 271. \n296. Al-Qamus al-Muhit 3/319. \n297. Durrat al-Ghawwas 60. \n298. Al-Sihah (Dawafa). And Madwuf: Wet or crushed.",
    "book_id": "310",
    "new_page_number": 38
  },
  {
    "serial_number": "6366619",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "'Miskun madwufun' and 'Thawbun maswunun', for these two came (299) rarely. Some grammarians analogize that.\nAl-Hariri (300) said: They say: 'Al-Miqrad' (Scissors) and 'Al-Miqass' (Shears). The correct is: 'Miqradan' and 'Miqassan', because they are two.\nI say: There is a discussion in it, because by composition they were made one tool, so the singular name should be applied to them.\nAl-Siqilli (301) said: They say: So-and-so is an 'Alim Mubarraz', with Fatha on Ra. The correct is Kasra.\nAl-Jawzi (302) said: The common people say: 'Mabghud'. The correct is: 'Mubghad'. Also: 'Mat'ub'. The correct is: 'Mut'ab'. Because the object of the quadrilateral is 'Muf'al'. Al-Jawhari (303) also mentioned (Al-Mubagghad).\nAl-Jawzi (304) said: The common people say: So-and-so is 'Mutafannin'. Meaning weak. The correct is: 'Muftann'. And 'Iftanna' in the matter: Took from every art.\nAl-Hariri (305) and Al-Jawzi (306) said: They do not differentiate between [the meaning of] 'Makhuf' and 'Mukhif'. The difference between them is that if you say: The thing is 'Makhuf', it is information about what fear arises from, as in your saying: The lion is 'Makhuf', and the road is 'Makhuf'. If you say: 'Mukhif', it is information about what generates fear, as in your saying: A 'Mukhif' illness, meaning it generates fear for whoever sees it.",
    "foot_note": "1. (299) In the original: Hadha ja'a. Correction from Al-Sihah. \n300. Durrat al-Ghawwas 185. See: Taqwim al-Lisan 192. \n301. Tathqif al-Lisan 168. \n302. Taqwim al-Lisan 190. \n303. Al-Sihah (Baghada). \n304. Taqwim al-Lisan 188. \n305. Durrat al-Ghawwas 195. \n306. Taqwim al-Lisan 186. Both sayings are in Tashih al-Tashif 281.",
    "book_id": "310",
    "new_page_number": 39
  },
  {
    "serial_number": "6366620",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "I say: In their saying (as in your saying: The lion is 'Makhuf') there is a discussion, for according to the mentioned rule the lion would be 'Mukhif' not 'Makhuf'. Al-Jawhari (307) said: 'Al-Ikhafah': Intimidation. It is said: A 'Mukhif' pain, meaning it frightens whoever sees it. And a 'Makhuf' road, because it does not frighten, rather the highwayman in it frightens. So it appears from it that the lion is 'Mukhif'. In Al-Qamus (308): And 'Al-Mukhif': The lion.\nAl-Jawzi (309) said: The common people say: 'Marwahah' and 'Marrikh', with Fatha on Mim in both. The correct is Kasra.\nThere is disagreement on the word (Al-Mashwarah) on 'Maf'alah'. Al-Hariri (310) did not validate it and said: The correct is: 'Mashurah' on the weight of 'Mathubah' and 'Ma'unah'. Al-Jawhari (311) validated both forms. Al-Zamakhshari (312) said in the interpretation of Surat Al-Ma'idah (313): (8a) And it was read: 'Mathubah' [and 'Mathwabah'] and their example (314): 'Mashurah' and 'Mashwarah'.\nLike it, in being disputed, is the word (Al-Ma'lul) from 'Illah', for Al-Hariri (315) denied it and said: The correct is: 'Mu'all'.",
    "foot_note": "1. (307) Al-Sihah (Khawafa). \n308. Al-Qamus al-Muhit 3/140. \n309. Taqwim al-Lisan 185 (Marwahah), 18 (Marrikh). 'Al-Mirwahah', with Kasra on Mim: The tool used for fanning. 'Al-Marwahah', with Fatha on Mim: The desert, and the place where winds blow through. \n310. Durrat al-Ghawwas 22. See: Taqwim al-Lisan 196, Bahr al-Awamm 166, Shifa' al-Ghalil 250. \n311. Al-Sihah (Shawara). In Diwan al-Adab 3/350: Al-Mashwarah is a dialect in Al-Mashurah. \n312. Al-Kashshaf 1/625. The text between brackets is from it. See: Al-Muhtasib 1/213. \n313. Verse 60: {Say, \"Shall I inform you of [what is] worse than that as penalty from Allah?\"} \n314. In the original: Mithaluha. What we established is from Al-Kashshaf. \n315. Durrat al-Ghawwas 165. See: Tathqif al-Lisan 170, Taqwim al-Lisan 190.",
    "book_id": "310",
    "new_page_number": 40
  },
  {
    "serial_number": "6366621",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "Ibn Hisham (316) quoted from Ibn al-Qutiyyah (317), Qutrub (318), and others, and refuted Al-Hariri.\nAl-Siqilli (319) said: They say: 'Ana mu'jib bika', with Kasra on Jim. The correct is Fatha. As for the one with Kasra, it is the one who admires you.\nAl-Jawzi (320) said: They say: I read 'Al-Mu'awwidhatayn', with Fatha on Waw. The correct is Kasra.\nHe also said (321): 'Malatiya': name of the city, its Ya is light, not stressed.\nHe said (322): The common people say: I haven't seen him 'Min amsi' (from yesterday), and 'Min ayyam' (from days). This is an error, and the correct is: 'Mudh amsi', and 'Mudh ayyam', because (Min) is specific to place, and (Mudh and Mundhu) are specific to time.",
    "foot_note": "1. (316) Sharh Qasidat Banat Su'ad 19, and in it: (Al-Hariri claimed that 'Al-Ma'lul' is not used except in this meaning and that people applying it to one afflicted by illness is an illusion, and one should only say for that: 'Mu'all', from 'A'allahu Allah'. Ibn Makki and others said the same, and faulted Hadith scholars for saying: 'Hadith Ma'lul', saying: The correct is 'Mu'all' or 'Mu'allal' ended. The correct is that it is permissible to say: 'Allahu fahuwa Ma'lul', from 'Al-Illah', although it is rare. Among those who reported this are Al-Jawhari in his Sihah, Ibn al-Qutiyyah in his Af'al, and Qutrub in his book Fa'altu wa Af'altu. Ibn Sidah mentioned in Al-Muhkam that in Abu Ishaq's book on Prosody is 'Ma'lul', then said: I am not confident about it. ended. He said: This language is supported by their saying: 'Alil', just as they say: 'Jarih' and 'Qatil' ended). See: Hashiyat al-Baghdadi 'ala Sharh Ibn Hisham 'ala Banat Su'ad 1/423. \n317. He is Abu Bakr Muhammad bin Umar Al-Andalusi, d. 367 AH. (Tarikh Ulama' Al-Andalus 2/76, Bughyat al-Multamis 112, Mu'jam al-Udaba 18/273). The text he referred to is in Kitab al-Af'al 17, 187. \n318. He is Muhammad bin Al-Mustanir, one of the scholars of language and grammar, d. 206 AH. (Akhbar al-Nahwiyyin al-Basriyyin 38, Tabaqat al-Nahwiyyin 99, Inbah al-Ruwat 3/219). His book (Fa'altu wa Af'altu) did not reach us. \n319. Tathqif al-Lisan 167. \n320. Taqwim al-Lisan 184. \n321. Taqwim al-Lisan 182. In the original: La yushaddad. \n322. Taqwim al-Lisan 192. See: Durrat al-Ghawwas 76.",
    "book_id": "310",
    "new_page_number": 41
  },
  {
    "serial_number": "6366622",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "Al-Zubaydi (323) said: They say for the lead used for wicks: 'Mishkat'. 'Al-Mishkat' is: The niche that is not a window. It is in the Abyssinian language.\nI say: Al-Jawhari (324) and the author of Al-Qamus (325) did not mention for 'Al-Mishkat' (326) other than what he mentioned for it in the second meaning, but it occurred in the speech of late scholars with the first meaning also, and they filled poems and treatises with it.\nAl-Siqilli (327) said: They say: 'Hadith muzad fihi'. The correct is: 'Mazid fihi'.\nI say: Similarly their saying: The so-and-so thing is 'Muzid' for yellow bile for example (328). For Al-Jawhari (329) and the author of Al-Qamus and other trustworthy ones did not mention other than (Zada). The author of Al-Qamus (330) said: 'Zadahu Allahu khayran'. That implies the non-existence of (Azada).\nAl-Hariri (331) and Al-Jawzi (332) said: [They say] for the plural of 'Mir'ah' (Mirror): 'Maraya'. The correct is: 'Mara'in' on the weight of 'Mara'in'. As for 'Maraya' [it is] the plural of the she-camel 'Mariy' (333).\nAl-Siqilli (334) said: They say for [plural of] 'Mir'ah': 'Amriyah'. The correct is: 'Mara'in', on the weight of 'Ma'anin', and the frequent (335) is: 'Maraya'.",
    "foot_note": "1. (323) His book's original missed it, and it is in Tashih al-Tashif 289 by him, and from him in Ziyadat Lahn al-Awamm 295. See: Al-Mu'arrab 351. \n324. Al-Sihah (Shaka). \n325. Al-Qamus al-Muhit 4/349-350. \n326. Written in the original: Al-Mishkat. This is an illusion. \n327. Tathqif al-Lisan 168. \n328. Al-Tanbih 24. \n329. Al-Sihah (Zada). \n330. Al-Qamus al-Muhit 1/299. \n331. Durrat al-Ghawwas 166. The text between brackets is from it. \n332. Taqwim al-Lisan 193. See: Al-Lisan and Al-Taj (Ra'a). \n333. In the original: Mara'. This is a distortion, correct is what is in Al-Durra. \n334. Tathqif al-Lisan 188. \n335. In the original: Wa al-kasr. This is a distortion.",
    "book_id": "310",
    "new_page_number": 42
  },
  {
    "serial_number": "6366623",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "I say: They say for the known stone: 'Al-Mas' (Diamond), with Alif after Mim. In Al-Qamus (336): 'Al-Mas' is a valuable stone, biggest is rarely like a walnut, and do not say 'Almas' (337) for it is a grammatical error.\nAmong their errors: 'Al-Marthiyyah', stressing the Ya. The correct is lightening it (338). Stated in Al-Qamus (339). Similarly, they err in applying it to the poem used for eulogy, for it is 'Marthiyy biha' (340).\nThey say: 'Al-amru mubtani ala kadha', in the active voice form, thinking it is intransitive. The correct is [to say: 'Al-amru mubtana ala kadha'] in the passive voice, because linguists agree that 'Bana al-dara' and 'Ibtanaha' mean the same (341).\nSome virtuous scholars (342) said: It is not permissible to apply the word (Al-Matruk) to one who left knowledge for a time, and said: The correct is (Tarik), and it is not permissible to be an object meaning subject like His saying Almighty {Hijaban masturan} (343), because it is auditory and analogy is not permissible in it.\nI say: Perhaps it is like the saying of Jurists: (8b) Whoever a prayer escaped (Fatat-hu). And what became famous of directing it is directing for 'Al-Matruk'. As for (Al-Mashghul), there is no doubt in its correctness (344). Al-Jawhari (345) said: 'Shughiltu anka bi-kadha', in the passive voice.",
    "foot_note": "1. (336) Al-Qamus al-Muhit 2/252. \n337. i.e., cutting the Hamza. See: Al-Taj (Masa). \n338. Al-Tanbih 23-24. \n339. Al-Qamus al-Muhit 4/332. \n340. Al-Tanbih 24. \n341. Al-Tanbih 14. The text between brackets is from it and is unclear in the original. \n342. He is Ibn Kamal Pasha in his book Al-Tanbih 16. \n343. Al-Isra 45. \n344. Al-Tanbih 16. \n345. Al-Sihah (Shaghala).",
    "book_id": "310",
    "new_page_number": 43
  },
  {
    "serial_number": "6366624",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "Among their errors: 'Al-Mustahkam', with Fatha on Kaf, meaning 'Al-Muhkam'. The correct is Kasra, because it is intransitive. It is said: 'Ahkamahu fastahkama', i.e., became 'Muhkam' (346).\nAmong them is their saying for the known liar: 'Musaylamah', with Fatha on Lam. The correct is Kasra (347).\nAmong them is their saying: 'Al-Masraf', with Fatha on Ra. The correct is Kasra, for it is from the form 'Daraba' (348).\nAmong them is (Al-Mazlamah) with Fatha on Lam, for it is broken (Kasra) (349). Thus in Al-Sihah (350).\nWhat must be noted is that the real source of 'Zalama' is 'Al-Zalm', with Fatha on Za. Mentioned in Al-Qamus (351). As for 'Al-Zulm', with Damma, apparently it is a noun from it whose usage became common in place of the source (352). This resembles 'Al-Fi'l' and 'Al-Fa'l', for they use it with Kasra on Fa in place of the source, while it is with Fatha (353). In Al-Qamus (354): 'Al-Fi'l', with Kasra: movement of human, or metonymy for every transitive act. And with Fatha is source of 'Fa'ala'.\nAmong them: 'Al-Mu'dalat', with Fatha on Dad. The correct is Kasra, for it is from 'A'dala al-amru': if it became severe (355).\nConversely, their saying: 'Murtabit', with Kasra on Ba, meaning tied. The correct is Fatha, because 'Irtabatahu' and 'Rabatahu' have the same meaning. Linguists agreed on it (356).",
    "foot_note": "1. (346) Al-Tanbih 20. \n347. Tathqif al-Lisan 140. (348, 349) Al-Tanbih 28. \n350. Al-Sihah (Zalama). \n351. Al-Qamus al-Muhit 4/145. \n352. Al-Tanbih 28. \n353. Al-Tanbih 32. \n354. Al-Qamus al-Muhit 4/32. \n355. Al-Tanbih 29. \n356. Al-Tanbih 23.",
    "book_id": "310",
    "new_page_number": 44
  },
  {
    "serial_number": "6366625",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "Conversely: 'Al-Maqsad' [with Fatha on Sad. The correct is Kasra] because it is from the form 'Daraba' (357).\nSimilarly: 'Al-Ma'dan', with Fatha on Dal. The correct is Kasra (358). As for (Al-Maghsil), Fatha was also narrated in it (359).\nAmong what the common people are confused about is the word (Al-Ma'idah) (Stomach) (360). In Al-Qamus (361): 'Al-Ma'idah' like 'Kalimah' and with Kasra.\nSome virtuous scholars (362) said: The common people say: 'Al-Manbar', with Fatha on Mim. The correct is Kasra.\nI say: The apparent is the permissibility of both aspects as said in 'Al-Mirqah', nay 'Al-Manbar' is more deserving of Fatha. Al-Safadi (363) said: 'Al-Marqah', with Fatha: The step, so whoever broke it likened it to the tool used. And whoever opened it said: This is a place where action is done.\nThey say for the tool made of iron to move fire: 'Masha'. The correct is: 'Mihashshah'. In Al-Qamus (364): 'Al-Mihashsh': An iron with which fire is stirred, i.e., moved, like 'Al-Mihashshah'.\nAmong what must be noted is their saying: 'Madd al-basar'. In Al-Sihah (365): [It is said: A piece of land] the extent of 'Mada al-basar', and the extent of 'Madd al-basar' [also], from Ya'qub (366).",
    "foot_note": "1. (357) Al-Tanbih 33. The text between brackets is required by context. \n358. Taqwim al-Lisan 182. See: Al-Tanbih 29. \n359. Al-Tanbih 34. \n360. Al-Tanbih 35, and in it: They err in it by adding Ya, saying: Al-Ma'idah. \n361. Al-Qamus al-Muhit 1/338. \n362. He is Ibn Kamal Pasha in his book Al-Tanbih 35. \n363. Tashih al-Tashif 284. See: Islah al-Mantiq 120. \n364. Al-Qamus al-Muhit 2/269. \n365. Al-Sihah (Madaya). Al-Jawhari said in (Madada): It is said there is a piece of land the extent of 'Madd al-basar', i.e., 'Mada al-basar'. \n366. He is Ya'qub bin Ishaq known as Ibn al-Sikkit, among his works: Islah al-Mantiq, Al-Alfaz, Al-Qalb wa Al-Ibdal ..., d. 244 AH. (Tarikh Baghdad 14/273, Mu'jam al-Udaba 20/5, Inbah al-Ruwat 4/50).",
    "book_id": "310",
    "new_page_number": 45
  },
  {
    "serial_number": "6366626",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "The words of the author of Al-Qamus contradicted in it, as he said in (Mada) (367): And do not say 'Madd al-basar'. And he said in (Madda) (368): And the extent of 'Madd al-basar', i.e., 'Madahu'.\nSome said: People's saying: 'Al-Maqta', for the tool on which the pen is cut. He said: The correct is: 'Al-Miqattah' like 'Midhabbah'. In Al-Qamus (369): 'Al-Miqattah' is a small bone on which the scribe cuts his pens.\nI say: In each of the two sayings (9a) there is a perspective. As for the first, because cutting has a general meaning applied to cutting across and lengthways and otherwise. So whoever applies the word (Al-Maqta') to something on which anything is cut whatever it is, should not be faulted, for it is not necessary in usage that it be a proper name for it. As for the second, 'Al-Miqattah' is not exclusive to the pen.\nThey say for the famous Successor: Sa'id bin Al-Musayyib (370), with Fatha on the stressed Ya. Ibn Khallikan (371) said: It was narrated from him that he used to say: It is with Kasra, and say: May Allah leave (Sayyaba) whoever left (Sayyaba) my father.\nThey say: 'Al-Mudara' is good. The correct is: 'Al-Mudarah', with Ta, because it is source of 'Daraytuhu' (372).\nThey say: This meaning is 'Munfahim' from this word. The author of Al-Qamus (373) said: And 'Infahama' is a grammatical error.",
    "foot_note": "1. (367) Al-Qamus al-Muhit 4/389 (Mada). (368) Al-Qamus al-Muhit 1/337 (Madda). \n369. Al-Qamus al-Muhit 2/381. In the original: 'Azm. What we established is from Al-Qamus. \n370. From the Successors, d. 94 AH. (Hilyat al-Awliya 2/161, Tadhkirat al-Huffaz 1/54, Tahdhib al-Tahdhib 4/84). \n371. Wafiyat al-A'yan 2/378. \n372. See: Al-Sihah (Daraya). \n373. Al-Qamus al-Muhit 4/161.",
    "book_id": "310",
    "new_page_number": 46
  },
  {
    "serial_number": "6366627",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "Letter Nun\nAl-Jawzi (374) said: The common people say: 'Nukhbat al-qawm', with Sukun on Kha. The correct is Fatha. In Al-Qamus (375): 'Al-Nukhbah' with Damma, and like 'Humazah': The chosen.\nAl-Hariri (376) said: The common people say: 'Hum ishruna nafaran'. Arabs do not use 'Al-Nafar' for more than ten.\nAl-Hariri (377) and Al-Jawzi (378) said: [They say]: 'Mi'ah wa nayf', with Sukun on Ya. The correct is stressing it.\nI say: It can be lightened on the example of 'Sayd' and 'Mayt', and its likes are many. The author of Al-Qamus (379) said: And it may be lightened.\nAl-Siqilli (380) said: They say: 'Ninufar'. The correct is: 'Ninawfar', with Fatha on the second Nun, and 'Nilufar', with Lam also. In Al-Qamus (381): 'Al-Nilufar' [and it is said: Al-Ninufar]: A type of basil growing in stagnant waters.\nI say: Restricting it to stagnant waters is questionable, for in our lands it grows in flowing waters.\nAl-Siqilli (382) said: They say: 'Lahm nay'. The correct is: 'Ni'', with Hamza and Kasra on Nun. As for 'Al-Nay', it is fat.",
    "foot_note": "1. (374) Taqwim al-Lisan 199. See: Al-Takmila 55. \n375. Al-Qamus al-Muhit 1/130. \n376. Durrat al-Ghawwas 52. \n377. Durrat al-Ghawwas 172. In Tahdhib al-Lugha 15/477: From Nafa it is said: Hadhihi mi'atun wa nayyif. Stressing the Ya, meaning excess. Common people lighten it saying: Wa nayf, which is an error according to the eloquent. \n378. Taqwim al-Lisan 199. \n379. Al-Qamus al-Muhit 3/203. In Al-Lisan (Nawafa): And Al-Nayyif and Al-Nayf, like Mayyit and Mayt: The excess. \n380. Tathqif al-Lisan 219. \n381. Al-Qamus al-Muhit 2/147. \n382. Tathqif al-Lisan 157. See: Al-Zahir 1/476, Lahn al-Awamm 103, Al-Iqtidab 349, Al-Jumanah 10.",
    "book_id": "310",
    "new_page_number": 47
  },
  {
    "serial_number": "6366628",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "I say: They say: So-and-so is 'Nisaburi', with Kasra on Nun. The correct is Fatha. Ibn Khallikan (383) mentioned it, and said: It was named Naysabur because Sabur Dhu al-Aktaf, one of the Persian kings, when he reached its place, he liked it, and it was a reed bed, so he ordered cutting the reeds, and built the city. So it was said: 'Nay Sabur', and 'Nay': Reed, in Persian.\nAmong their shameful errors is their saying: 'Nazul', for what is prepared for the prince and guest. It is (Nuzul) with two Dammas without Waw (384).\nSimilar to that is their adding Ya in (Niqris), while it is (Niqris) with Kasra on Nun, Sukun on Qaf, Kasra on Ra followed by Sin Muhmalah (385).\nPeople are confused about the word (Al-Nazlah) (Catarrh), so some say 'Nazilah'. The correct is: 'Nazlah', with Fatha on Nun, Sukun on Zay without Alif (386).\nAmong their shameful (9b) illusions is their saying: 'Irq al-Nisa' (Sciatica), for the known disease, breaking the Nun and extending the Alif. The correct is opening it (Fatha) and shortening the Alif (387). Al-Jawhari (388) and the author of Al-Qamus (389) mentioned it.\nAmong them is Damma on Nun of (Al-Nukat) in plural of 'Nuktah' (390). The correct is Kasra. Or deleting the Alif (391).",
    "foot_note": "1. (383) Wafiyat al-A'yan 1/80. \n384. Al-Tanbih 35. \n385. Al-Tanbih 36. \n386. Al-Tanbih 36. In the original: Fa-ba'duhum yaqulun. \n387. Al-Tanbih 37. \n388. Al-Sihah (Nasa) and in it: (Ibn al-Sikkit said: It is Irq al-Nasa. He said: And Al-Asma'i said: It is Al-Nasa, and do not say: It is Irq al-Nasa) (389) Al-Qamus al-Muhit 4/395 and in it: Al-Nasa is a vein from the hip to the ankle. Al-Zajjaj: Do not say: Irq al-Nasa, because a thing is not annexed to itself. \n390. Al-Tanbih 37. \n391. i.e., Nukat, with Damma on Nun and Fatha on Kaf.",
    "book_id": "310",
    "new_page_number": 48
  },
  {
    "serial_number": "6366629",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "Among them is their saying: 'Nishat', with Kasra on Nun, for the correct is Fatha. The author of Al-Qamus (392) stated it.\nAmong them is their saying: 'Namrudh', with Fatha on Nun, for it is with Damma. The author of Al-Qamus (393) mentioned it.\nAmong them is their saying: 'Fabiha wa ni'ma'. The correct is: 'Ni'mat' (394).\n\nLetter Waw\nAl-Jawzi (395) said: The common people say: 'Al-Wida'', with Kasra on Waw. The correct is Fatha.\nAl-Zubaydi (396) said: They say: 'Wahabtu fulanan malan'. The correct is: 'Li-fulanin', because (Wahabtu) is not transitive except with a preposition, [and it is in that like (Marartu), not transitive except with a preposition] Sibawayh (397) mentioned it.\n\nLetter Ha\nAl-Hariri (398) said: They say: 'Hawan' and 'Rawaq' [so they are deluded in them since there is no (Fa'al) in Arab speech where its 'Ayn is Waw]. The correct is: 'Hawun' and 'Rawuq'.\nAl-Siqilli (399) said: What is confusing is (Hamdan) with Dal, Fatha on Ha and Sukun on Mim:",
    "foot_note": "1. (392) Al-Qamus al-Muhit 2/388. \n393. Al-Qamus al-Muhit 1/342, and it is with Dal Muhmalah. Narrated with Muhmalah and Mu'jamah. \n394. See: Al-Zahir 2/318. \n395. Taqwim al-Lisan 201. \n396. Lahn al-Awamm 201. The text between brackets is from it. \n397. I did not find his saying in Al-Kitab. \n398. Durrat al-Ghawwas 177, the text between brackets is from it. See: Al-Takmila 30, Taqwim al-Lisan 205 and in it (Hawan and Fa'al, with Damma on Waw and 'Ayn, which is wrong), Bahr al-Awamm 207. \n399. Tathqif al-Lisan 65.",
    "book_id": "310",
    "new_page_number": 49
  },
  {
    "serial_number": "6366630",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "A tribe from Yemen (400). And (Hamadhan) with Dhal Mu'jamah and Fatha on Ha and Mim (401): A place in Khorasan.\nI say: The common people say: 'Al-Hijw' and 'Al-Hijr', with Kasra on Ha in both. The correct is Fatha (402). And they say: So-and-so is 'Hirawi', with Kasra on Ha. The correct is Fatha, because it is attributed to (Harat) with Fatha on Ha. Ibn Khallikan (403) mentioned it.\n\nLetter Ya\nAl-Jawaliqi (404) [said]: The common people think that (Al-Yatim) is: The boy whose father or mother died, and it is not so. 'Al-Yatim' [among humans] is only the one whose father died specifically. If his mother dies, he is called: 'Ajiyy' (405), and 'Al-Yatim' among animals is the one whose mother died.\nAl-Hariri (406) and Al-Jawzi (407) said: They say: So-and-so 'Yasta'hilu' (deserves) honor, and he is 'Musta'hil' for favors (408), and these two words have not been heard in the speech of Arabs nor validated (409) by anyone of the scholars of literature. [And] the correct speech is: 'Yastaḥiqqu' honor, and he is 'Ahl' for that.",
    "foot_note": "1. (400) See: Jamharat Ansab al-Arab 392, Qala'id al-Juman 99. \n401. In the original: And Sukun on Mim which is an error. See: Mu'jam al-Buldan 5/410. \n402. See: Al-Sihah (Haja, Hajara). \n403. Wafiyat al-A'yan 3/347. See: Mu'jam al-Buldan 5/396. \n404. Al-Takmila 20, the text between brackets before it is required by context. \n405. (If his mother dies he is called: Ajiyy): This phrase is not from Al-Jawaliqi, but from Ibn Barri. (See: Al-Takmila 21). In the original: Mata ummuhu, Ajami. \n406. Durrat al-Ghawwas 11. See: Sharh Durrat al-Ghawwas 23. \n407. Taqwim al-Lisan 77. \n408. In the original: Al-An'am. \n409. In the original: Sawwabaha.",
    "book_id": "310",
    "new_page_number": 50
  },
  {
    "serial_number": "6366631",
    "category_id": "30",
    "category": "Linguistic Rarities and Dictionaries",
    "book_title": "Khayr al-Kalam fi al-Taqassi 'an Aghlat al-Awamm",
    "edition": "First, 1407 AH / 1987 AD",
    "publisher": "Alam al-Kutub - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "I say: Al-Jawhari (410) supports this where he said: They say: So-and-so is 'Ahl' for such-and-such, and do not say: 'Musta'hil', [but the common people say it]. The author of Al-Qamus (411) said: And 'Ista'halahu': He deserved it, good language, and Al-Jawhari's denial is invalid. In Al-Kashshaf (412), in Surat Al-Ankabut (413): And that he does not deserve ('Yasta'hilu') what they deserve.\nI say: The common people say for the sect of Jews: 'Yahuda', with Alif after Dal. This is an error, for (Yahuda) is the brother of Joseph, peace be upon him (414).\n\nThe one in need of Allah the Rich, Ali bin Bali Al-Husayni Al-Qustantini said: I made this treatise, and concluded this hasty work in the month of Rabi' al-Awwal blessed by Allah Almighty, in the year nine hundred and seventy-eight, and the beginning and conclusion were facilitated within three days.",
    "foot_note": "1. (410) Al-Sihah (Ahala). The text between brackets is from it. \n411. Al-Qamus al-Muhit 3/331. \n412. Al-Kashshaf 3/205. \n413. In the explanation of Verse 32 of Al-Ankabut. \n414. See: Al-Qamus al-Muhit 1/349.",
    "book_id": "310",
    "new_page_number": 51
  }
]