[
  {
    "text": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other\nAuthor: أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار البغدادي الدارقطني\nYear: 385",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "category_id": "26",
    "category": "Biographies and Generations",
    "new_page_number": 1
  },
  {
    "text": "sn: 6333\nbook_title: أسماء الصحابة التي اتفق فيها محمد بن إسماعيل البخاري ومسلم بن الحجاج بن مسلم القشيري رحمهما الله تعالي وما انفرد به كل واحد منهما دون صاحبه\nbook_link: https://shamela.ws/book/597\nbook_id: 597\nauthor_name: أبو الحسن علي بن عمر بن أحمد بن مهدي بن مسعود بن النعمان بن دينار البغدادي الدارقطني\nauthor_year: 385\nnickname: أبو الحسن\nauthor_link: https://shamela.ws/author/223\nauthor_ID: 223\neditor: نسخهما وعلق عليهما وقدم لهما: جابر بن عبد الله السريع\npublisher: دار العاصمة - الرياض\nedition: الأولى، 1433 هـ - 2012 م\npages: 59\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التراجم والطبقات\ncategory_id: 26",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "category_id": "26",
    "category": "Biographies and Generations",
    "new_page_number": 2
  },
  {
    "serial_number": "5531761",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Biographies and Classes. Book: Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other. Author: Abu Al-Hasan Ali bin Umar Al-Daraqutni. Transcribed, annotated, and introduced by: Jabir bin Abdullah Al-Sari'. Publisher: Dar Al-Asimah - Riyadh. Edition: First, 1433 AH - 2012 AD. Number of pages: 59 [Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\nBook: Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other. Author: Abu Al-Hasan Ali bin Umar Al-Daraqutni. Transcribed, annotated, and introduced by: Jabir bin Abdullah Al-Sari'. Publisher: Dar Al-Asimah - Riyadh. Edition: First, 1433 AH - 2012 AD. Number of pages: 59 [Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\nAuthor: Abu Al-Hasan Ali bin Umar Al-Daraqutni. Transcribed, annotated, and introduced by: Jabir bin Abdullah Al-Sari'. Publisher: Dar Al-Asimah - Riyadh. Edition: First, 1433 AH - 2012 AD. Number of pages: 59 [Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\nTranscribed, annotated, and introduced by: Jabir bin Abdullah Al-Sari'. Publisher: Dar Al-Asimah - Riyadh. Edition: First, 1433 AH - 2012 AD. Number of pages: 59 [Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\nNumber of pages: 59 [Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\n[Book numbering matches the printed version]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442.\nPublication date on Shamela: 28 Dhu al-Qa'dah 1442",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 3
  },
  {
    "serial_number": "5531762",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 1,
    "volume_number": 1,
    "text": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other. Authored by the Imam, the Hafiz, Abu Al-Hasan Ali bin Umar Al-Daraqutni (may Allah have mercy on him). Followed by: Mention of the names of those whom Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj agreed upon correcting the narration from among the Companions (may Allah be pleased with them), thus narrating from them in their books, each titled 'Al-Sahih', and mention of the names of those whose hadith each one narrated uniquely without the other. Authored by the Imam, the Hafiz, Abu Al-Fath Muhammad bin Ahmed bin Abi Al-Fawaris (may Allah have mercy on him). Transcribed, annotated, and introduced by Jabir bin Abdullah Al-Sari'.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 4
  },
  {
    "serial_number": "5531763",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 5,
    "volume_number": 1,
    "text": "The Treatise of the Imam, the Hafiz, Abu Al-Hasan Ali bin Umar Al-Daraqutni",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 5
  },
  {
    "serial_number": "5531764",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 7,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, Lord of the Worlds, and may Allah send peace and blessings upon our Prophet Muhammad, and upon his family and all his Companions. To proceed: The scholars of Islam have paid outstanding attention to the Two Sahihs (Bukhari and Muslim), and their writings regarding them have varied. The Imam, the Hafiz, Abu Al-Hasan Ali bin Umar Al-Daraqutni (died 385 AH, may Allah have mercy on him) had a share in this. He authored several treatises on the narrators of the Two Sahihs and on critiquing them, including: 1- Al-Tatabbu' (Tracking), explaining what was narrated in the Two Sahihs or one of them that has a defect. 2- A part explaining hadiths that Al-Bukhari deposited in his Sahih book which contain defects. 3- Al-Ilzamat (Bindings), mentioning hadiths they did not narrate, though they narrated similar ones, and hadiths of a group of Companions narrated through paths in which there is no challenge, yet they narrated nothing from them. 4- Mention of the Companions whose narration is authentic but are not in the Two Sahihs. 5- Names of the Companions agreed upon by Bukhari and Muslim, and what each narrated individually without the other. 6- Mention of the names of the Tabi'in and those after them whose narration is authentic among the trustworthy narrators according to Bukhari and Muslim, and whom they mentioned in their Sahih books or one of them. 7- Mention of people narrated by Bukhari and Muslim, whom Al-Nasa'i narrated in Kitab Al-Du'afa (The Book of the Weak), which is the part known as 'Su'alat Ibn Bukayr'. In your hands - dear reader - is the fifth treatise of these messages, printed for the first time. It is a treatise authored by Al-Daraqutni to enumerate the male and female Companions whose mention appeared in the Two Sahihs or one of them, complementing his other treatise authored on the names of the Tabi'in in the Two Sahihs; together they form a single book collecting the narrators of the Two Sahihs.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 6
  },
  {
    "serial_number": "5531765",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 8,
    "volume_number": 1,
    "text": "Authorship regarding the names of the Companions narrated from in the Two Sahihs: I did not find anyone who preceded Al-Daraqutni in writing on this subject. Rather, scholars wrote on it after Al-Daraqutni, the most famous of whom are his two students: Al-Hakim Abu Abdullah (died 405 AH), who dedicated a chapter in his book 'Al-Madkhal ila Al-Sahih' to mentioning those narrated by Bukhari and Muslim or one of them, beginning with the mention of the Companions. And Abu Al-Fath bin Abi Al-Fawaris (died 412 AH), who has a specific treatise on this titled: 'Mention of the names of those whom Bukhari and Muslim agreed upon correcting the narration from among the Companions, thus narrating from them in their books, each titled Al-Sahih, and mention of the names of those whose hadith each one narrated uniquely without the other.' Abu Masoud Al-Dimashqi (died 401 AH) and Khalaf Al-Wasiti (died after 400 AH) wrote 'Atraf Al-Sahihayn', and they dedicated a Musnad for each Companion, explaining his hadiths with their paths in the Two Sahihs. Building upon their work, Abu Abdullah Muhammad bin Abi Nasr Al-Humaydi (died 488 AH) in his book 'Al-Jam' bayn Al-Sahihayn', paid attention to the Companions who have Musnads in the Two Sahihs or one of them, mentioning in every Musnad the hadiths of its owner and their number, distinguishing what the two Sheikhs agreed upon from what one narrated uniquely from the other. He also benefited from Abu Bakr Al-Ismaili (died 371 AH) and Abu Bakr Al-Barqani (died 425 AH) in their Mustakhraj works on the Two Sahihs. Most of those who wrote on this subject afterward relied on Al-Humaydi's book, summarizing the names and the number of narrations for each Companion. Some added brief biographies for each Companion, the total number of hadiths narrated in general, and mentioned who among the authors of the four Sunan narrated from him. Among these is Abu Al-Faraj bin Al-Jawzi (died 597 AH), who has two works on this: First: A chapter he included in his book 'Talqih Fuhum Ahl Al-Athar fi Uyoun Al-Tarikh wa Al-Siyar', titled: 'Names of the Companions from whom narrations were made in the Two Sahihs, and the number of hadiths narrated from them'.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 7
  },
  {
    "serial_number": "5531766",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 9,
    "volume_number": 1,
    "text": "The other: Chapters he dedicated in his book 'Al-Mujtana min Al-Mujtaba' (1), beginning with a chapter titled: 'Reference to some news of the Ten (Promised Paradise)', then: 'Chapter on their Musnads', then: 'Reference to the famous Companions mentioned after the Ten, and the number of their Musnads', then: 'Reference to the news of the famous female Companions, and mention of their Musnads', starting with the wives of the Prophet (peace be upon him), then his daughters, and concluding with a chapter titled: 'Mention of the famous female Companions'. In every chapter, he provided biographies for the Companions included, mentioning the total number of hadiths narrated from each generally, and the number of what Bukhari and Muslim narrated from that. Abu Sa'id Al-Ala'i (died 761 AH) wrote on this subject his book 'Kashf Al-Niqab 'amma Rawa Al-Shaykhan lil-Ashab', stating in its introduction that he summarized it from Al-Humaydi's book. After him, Yahya bin Abi Bakr Al-Amiri (died 893 AH) wrote his book 'Al-Riyad Al-Mustatabah fi Jumlat man Rawa fi Al-Sahihayn min Al-Sahabah', in which he provided a biography for each Companion and mentioned the number of his narrations in the Two Sahihs and the four Sunan. Scholars also paid attention to this subject within their books authored on the narrators of Bukhari and Muslim, such as Abu Nasr Al-Kalabadhi (died 398 AH) in his book 'Rijal Al-Bukhari', Abu Bakr bin Manjuwayh (died 428 AH) in his book 'Rijal Muslim', Abu Al-Fadl bin Tahir Al-Maqdisi (died 507 AH) in his book 'Al-Jam' bayn Rijal Al-Sahihayn', which is a combination of the books of Al-Kalabadhi and Ibn Manjuwayh, and Abu...",
    "foot_note": "1. It was printed by Dr. Ali bin Hussein Al-Bawwab in 1409 AH by Dar Al-Fa'iz, relying on two manuscripts. One is preserved in the Ahmet III Library in Turkey within collection 588, located between folios (167-225), copied in 632 AH, with disordered arrangement but no missing parts; a copy is at Imam University under number 10438 F, and I have a copy of it.",
    "book_id": "597",
    "new_page_number": 8
  },
  {
    "serial_number": "5531767",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 10,
    "volume_number": 1,
    "text": "Al-Walid Al-Baji (died 474 AH) in his book 'Al-Ta'dil wa Al-Tajrih liman Kharraja lahu Al-Bukhari fi Al-Jami' Al-Sahih'. Abdul Ghani Al-Maqdisi (died 600 AH) also paid attention to this subject within his book 'Al-Kamal fi Asma' Al-Rijal', which concerns the narrators of the Six Books. He was followed by Abu Al-Hajjaj Al-Mizzi (died 742 AH), who addressed this subject within his books 'Tahdhib Al-Kamal' and 'Tuhfat Al-Ashraf'. Then came those who added to Al-Mizzi's work, such as Al-Dhahabi, Al-Iraqi, Mughlatay, Abu Zur'ah Ibn Al-Iraqi, Ibn Hajar, Sibt Ibn Al-Ajami, Al-Khazraji, and others, pointing out his illusions. Attribution of the treatise to Al-Daraqutni, its Manuscripts, and its Title: I did not find anyone who attributed this treatise to Al-Daraqutni before the later manuscript catalogs which attributed it to him based on what is in the manuscripts. However, I found quotes from it by scholars explicitly attributing what they quoted to Al-Daraqutni, including: Ibn Abi Al-Fawaris in his treatise on the names of Companions in the Two Sahihs, Abu Al-Walid Al-Baji in his book 'Al-Ta'dil wa Al-Tajrih', and Ibn Al-Jawzi in his books 'Talqih Fuhum Ahl Al-Athar' and 'Al-Mujtana'. I have indicated these quotes in the footnotes of the treatise. I relied on six manuscripts to produce this treatise; here is their description: First (T): Located in four folios (187a - 190b) within collection 2947 preserved in the Manisa National Library in Turkey. It is the fifteenth treatise in it, copied in 968 AH, and the scribe is not mentioned. I obtained a copy of it from the website of the Turkish Ministry of Culture and Tourism via Sheikh Abdullah bin Hamad Al-Mansour, may Allah reward him. Second (S): Located in two folios (35b - 37a) within collection 620 preserved in the Serez Library affiliated with the Süleymaniye Library in Turkey. It is the fifth treatise in it, and neither the copying date nor...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 9
  },
  {
    "serial_number": "5531768",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 11,
    "volume_number": 1,
    "text": "...the scribe is mentioned. I obtained a copy of it via brother Abu Abdullah Muayyad bin Muhammad Al-Tayyib, may Allah reward him. Third (K): Located in three and a half folios (1-4) within collection 801 preserved in the Egyptian National Library (Dar al-Kutub) in Cairo. It is the first treatise in it, copied by Ismail bin Muhammad Al-Maliki Al-Adawi in the year eighty-eight (1). Brother Abu Hatim Al-Masri gifted me a copy, may Allah reward him. Fourth (F): Located in four and a half folios (1-5) within collection 1966 preserved in the King Faisal Center for Research and Islamic Studies in Riyadh. It is the first treatise in it, copied approximately in the thirteenth century as per the catalog card, and the scribe is not mentioned. I obtained a copy from the center itself, may Allah reward those in charge of it (2). Fifth (Y): Located in three folios (241b - 244a) at the end of the book 'Taqyid Al-Muhmal wa Tamyiz Al-Mushkil' by Abu Ali Al-Jayyani, preserved under number 2327 in the Awqaf Library at the Great Mosque in Sana'a. Copied in 695 AH, and the scribe is not mentioned. I obtained a copy from the Wadod Center for Manuscripts website, may Allah reward those in charge. Sixth (H): Located in two folios (157a - 158b) within collection 2276 Kh preserved at Imam Muhammad bin Saud Islamic University in Riyadh. It is the fifteenth treatise in it, copied by Zain Al-Abidin Al-Arawi Al-Shah Abadi Al-Bihari in 1320 AH. I obtained a copy from...",
    "foot_note": "1. This is how it appeared at the end of the copy. Perhaps the meaning is: after one thousand (1088 AH), so the scribe abbreviated the date. Sezgin quoted from the Dar al-Kutub catalog that it was copied in 1060 AH. \n2. In my photocopy, side (a) of folio five fell out, which contains the end of the copy. I also found it missing from the microfilm preserved at the center, photographed from the original copy, replaced by a page containing a collection of poems unrelated to the treatise.",
    "book_id": "597",
    "new_page_number": 10
  },
  {
    "serial_number": "5531769",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 12,
    "volume_number": 1,
    "text": "...the university itself, may Allah reward those in charge of it. The second and third copies were mentioned by Fuat Sezgin in his book 'History of Arabic Heritage' 1/422, 423, under numbers 17 and 19. The fourth was mentioned by Sheikh Najm bin Abdul Rahman Khalaf in his book 'Istidrakat ala Tarikh Al-Turath Al-Arabi fi Ilm Al-Hadith' p. 534. The fifth was mentioned by Sheikhs Rida Bu Shama and Abdul Bari Abdul Hamid in their references for the verification of the book 'Al-Ima' ila Atraf Ahadith Kitab Al-Muwatta' by Abu Al-Abbas Al-Dani 5/563. The sixth was mentioned by the authors of 'Al-Fihris Al-Shamil' 2/820, quoting the catalog of manuscripts and photocopies at Imam University 1/400 (1). Al-Daraqutni stated the title of his treatise in its introduction, saying: 'These are the names of the Companions regarding whom...",
    "foot_note": "1. Sheikh Abdullah Al-Ruhayli mentioned in his book 'Imam Abu Al-Hasan Al-Daraqutni and his Scientific Works' pp. 213, 214 a copy of this treatise by Al-Daraqutni preserved in the Asafiya Library in India under number (172 Rijal), within a book titled 'Rijal Al-Bukhari wa Muslim'. He said: 'This book is divided into three books,' stating that the first is this treatise on the names of Companions, and that the beginning of the treatise in the copy reads: 'The Companions whom Al-Bukhari narrated for in his Sahih, from what Al-Humaydi took care of and pointed out,' and its end: 'Whatever number is in red is in the Two Sahihs, and what is not red is in Bukhari.' He said: 'No number appeared in the photocopied version at all,' and added nothing more. Sheikh Khalid bin Muhammad Basamah critiqued him in his thesis 'Ahadith of Abu Ishaq Al-Sabi'i in which Al-Daraqutni mentioned differences in his book Al-Ilal', saying on p. 137 about what Al-Ruhayli quoted from the beginning of the treatise: 'This text cannot be by Al-Daraqutni, for Al-Humaydi had not been born yet.' Consequently, he cast doubt on the authenticity of attributing this treatise to Al-Daraqutni and placed it among 'Books attributed to him with questionable attribution.' I obtained a copy of this manuscript, and it became clear that it is not by Al-Daraqutni. Rather, it is an abstraction of the names of Companions whom Al-Humaydi mentioned in his book 'Al-Jam' bayn Al-Sahihayn' that Bukhari narrated for. The compiler is unknown, and the scribe copied it before another treatise by Al-Daraqutni, which is: 'Mention of the names of Tabi'in and those after them whose narration is authentic among the trustworthy narrators according to Bukhari'.",
    "book_id": "597",
    "new_page_number": 11
  },
  {
    "serial_number": "5531770",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 13,
    "volume_number": 1,
    "text": "...Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) agreed upon, and what each of them narrated individually without the other.' As for the title in the manuscripts, it varied slightly. In (T) and (S): 'The Part containing what Bukhari and Muslim (may Allah have mercy on them) agreed upon, and what one narrated individually from the other, of the names of the Companions (may Allah be pleased with them all).' In (K) and (F): 'This is a treatise on the names of the Companions agreed upon by Bukhari and Muslim in their Sahihs, and what each of them narrated individually without the other.' No title appeared for the treatise in (Y) and (H); rather, they began directly with Al-Daraqutni's words. I adopted the title Al-Daraqutni mentioned at the beginning of the treatise because it is the one he approved as its title. Study of the Manuscripts: None of the copies of this treatise rise to the level of a reliable original, as they are all late copies, their origins from which they were copied were not indicated, and none contain a chain of transmission to Al-Daraqutni. Rather, they all begin with 'Al-Daraqutni said' - except for what is in copy (Y), which will be discussed. They all share numerous misspellings and distortions indicating they are not precise copies. I found similarities in phrasing and misspellings between copies (T) and (S), and likewise between copies (K) and (F), to the extent that there are identical marginal notes written in copies (K) and (F) on their covers and pages, with some similarity occasionally between copy (K) and copies (T) and (S). As for (Y) and (H), there is similarity between them to some extent, and they differ from the rest. After studying the manuscripts, it became clear to me that they are branches tracing back to two different origins. Copies (Y) and (H) trace back to one origin, and the rest trace back to another origin. Each origin differs from the other: additions...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 12
  },
  {
    "serial_number": "5531771",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 14,
    "volume_number": 1,
    "text": "...and deletions in the names of Companions, differences in arrangement, and in categorizing some Companions as agreed upon by the two Sheikhs or unique to one. The origin from which copies (Y) and (H) were transcribed contained an increase of seventeen names over the other origin, and the other origin contained an increase of one name over the first. The two origins differed regarding eight names: they appeared in the first as agreed upon, and in the other as unique to one; one name appeared conversely; one name appeared in Bukhari's unique narrations in the first and in Muslim's unique narrations in the other. The two origins differed in the arrangement of three names, while agreeing on placing them in the same category: either agreed upon or unique to one. This difference between the two origins could be: from Al-Daraqutni himself, or from the narrators. Al-Daraqutni might have authored the treatise first, and it was narrated from him, then he reviewed it and added things, so it was narrated from him a second time. Or one of the narrators might have corrected things in what he narrated, added, and adjusted, so it was narrated from him as being from Al-Daraqutni. Or the difference might be due to another matter, but it cannot be from the scribes because the multiplicity and variety do not allow for that. Facing this difference between the two origins, I found reasons to prefer each: What favors adopting the origin of (Y) and (H) is that the Yemeni copy (Y) is based on it, and it has two features distinguishing it from the other copies: its beginning contains a chain of transmission to Al-Daraqutni, and it is the oldest copy in writing, having been copied in 695 AH. The chain at the beginning of (Y) after the Basmalah reads: 'Abu Al-Hasan Ali bin Fahd, I read to Abu Al-Fath Muhammad bin Ahmed bin Abi Al-Fawaris, Abu Al-Hasan Al-Daraqutni informed you, saying: These are the names of the Companions...'. Beyond the linguistic errors and distortions this chain contains, there is a problem with it, summarized as: The narrator from Al-Daraqutni - who is Ibn Abi Al-Fawaris, one of the Hafiz...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 13
  },
  {
    "serial_number": "5531772",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 15,
    "volume_number": 1,
    "text": "...students of Al-Daraqutni - authored a treatise similar to Al-Daraqutni's and attributed eight names in it to Al-Daraqutni's treatise by saying: 'The Sheikh Abu Al-Hasan said.' Among those he attributed to Al-Daraqutni in Muslim's unique narrations is: Abu Habba - also said: Hayya - Al-Badri, whereas in copy (Y) narrated from Ibn Abi Al-Fawaris from Al-Daraqutni, he is mentioned among those agreed upon. If that copy were truly from his narration, he would have attributed Abu Habba Al-Badri to the agreed-upon category, as is established in that copy from him. This casts doubt on this chain. Another matter: In this origin are two Companions mentioned followed by the phrase: 'Al-Hakim mentioned it.' This is definitely not Al-Daraqutni's speech, because Al-Hakim refers to Abu Abdullah Ibn Al-Bayyi', one of Al-Daraqutni's students, and what is mentioned from him exists in his book 'Al-Madkhal ila Al-Sahih'. It is unlikely that Al-Daraqutni would quote one of his students in a small treatise like this. I noticed that the names of Companions added in this origin over the other origin are all mentioned by Al-Hakim; perhaps they were added from him in addition to what Al-Daraqutni had, then scribes later inserted them into the main text. However, the problem remains regarding those whose placement changed between the two origins from agreed-upon to unique, or vice versa; this is difficult to change while maintaining attribution to Al-Daraqutni, and scribes have no scope to change it without indication. These two matters make adopting this origin not definitive. The early date of copy (Y) is not enough to prioritize it over other copies, because it is early relative to the other copies, but relative to Al-Daraqutni, the copy date is four centuries later. This is alongside the fact that copy (Y) in its larger part - which is the book 'Taqyid Al-Muhmal' at the end of which it appears - is full of misspellings, distortions, and omissions, as described in the introduction to the verification of the book by Sheikhs Ali bin Muhammad Al-Imran and Muhammad Uzair Shams in 1/137. What favors adopting the origin of (T), (S), (K), and (F) is that the quotes of scholars from Al-Daraqutni in...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 14
  },
  {
    "serial_number": "5531773",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 16,
    "volume_number": 1,
    "text": "...this treatise - which I have found - are consistent with it and differ - in some places - from the first origin, as you see in the footnotes of the treatise regarding the mention of 'Al-Harith bin Awf Abu Waqid Al-Laithi, Al-Rumaysa Umm Sulaym, Lubaba Al-Kubra Umm Al-Fadl, Abu Habba Al-Badri, and Abu Dawood'. Al-Daraqutni's words in some of his other books also align with this origin and contradict the first origin. For example: 'Salamah bin Yazid Al-Ju'fi' is mentioned only in the origin of (Y) and (H), yet Al-Daraqutni listed him in Al-Ilzamat p. 99 among those whose hadiths are authentic but nothing was narrated for them in the Two Sahihs. And 'Huwaytib bin Abdul Uzza, Abdullah bin Amir bin Rabi'ah, and Abdullah bin Safwan' were mentioned only in the origin of (Y) and (H), yet Al-Daraqutni mentioned them in his book: 'Mention of names of Tabi'in and those after them whose narration is authentic among trustworthy narrators according to Bukhari and Muslim' 1/120, 1/189, 2/138, and 2/134; so they are Tabi'in according to him, although he did mention in this book others upon whom the two origins agreed. Deciding to rely on one of these two origins is not easy due to the absence of strong preponderators. However, due to the previously mentioned existence of two matters casting doubt on adopting the origin of (Y) and (H), I relied in the names of Companions on the origin of (T), (S), (K), and (F). It has support, and is closer in my view to being authored by Al-Daraqutni. I recorded in the footnotes what is in the origin of (Y) and (H) of additional names or names mentioned in places other than where they were mentioned in the adopted origin. Al-Daraqutni's Methodology in his Treatise: Al-Daraqutni introduced his treatise with a preface explaining its content, saying: 'These are the names of the Companions regarding whom...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 15
  },
  {
    "serial_number": "5531774",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 17,
    "volume_number": 1,
    "text": "...Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) agreed upon, and what each of them narrated individually without the other.' He concluded it by saying: 'This is the sum of what they both narrated from the hadith of the Companions, men and women (may Allah be pleased with them), in both their books.' He arranged the names alphabetically, making a chapter for each letter. He presented the one named Muhammad first, who is Muhammad bin Maslamah alone. In each letter, he presented those agreed upon, then Muslim's unique narrations, then Bukhari's unique narrations, though he sometimes deviates from this order. He mixed men with women, not dedicating a separate chapter for them, mostly mentioning them at the end of the section for each letter. At the end of the treatise, he dedicated a chapter for Kunyas of men, followed by another for Kunyas of women. He repeated in the Kunyas some of those he mentioned in the names, namely: Abu Sa'id bin Al-Mu'alla - noting that he was previously mentioned -, Umm Sulaym, and Umm Atiyyah. I found the Companions mentioned by Al-Daraqutni in his treatise to be of three types: First: Those who have a connected (Musnad) hadith in the Two Sahihs or one of them narrating from the Prophet (peace be upon him), and this is the majority. Second: Those who have a narration from Companions in the Two Sahihs or one of them, or a Mawquf narration (stopped at the Companion) of his saying or action, and do not have a connected hadith narrating from the Prophet (peace be upon him) in them or one of them. Among them: Uhban bin Aws, Tha'labah bin Abi Malik, Abdullah bin Al-Musayyib, and Amr bin Salimah. Third: Those who are mentioned in the hadiths of the Two Sahihs or one of them, in the texts or chains, but those hadiths are not from their Musnad nor their narration, nor from their saying or action, and they do not have a connected hadith in the Two Sahihs or one of them narrating from the Prophet (peace be upon him) or from the Companions. Among them: Iyas bin Al-Bukayr, Salim Mawla Abi Hudhayfah, Amir bin Hudhayfah Abu Al-Jahm, Asim bin Thabit bin Abi Al-Aqlah, Qudamah bin Maz'un, and Umm Salit. All of these - as appears from Al-Daraqutni's behavior - are covered by the title of the treatise...",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 16
  },
  {
    "serial_number": "5531775",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 18,
    "volume_number": 1,
    "text": "...and its content, which is 'The Companions for whom Bukhari and Muslim or one of them narrated.' Thus, two things must combine: Companionship must be established - even if from outside the Two Sahihs - and the two Sheikhs or one of them must narrate for the Companion in any of the previous types. The first and second types enter into the content of the treatise primarily, and they are the intended purpose of its authorship. As for the third type, it enters only secondarily, and is not the purpose of authorship here. I think Al-Daraqutni did not intend to cover this type comprehensively, for in the texts of the hadiths of the Two Sahihs there are a group of Companions he did not mention, including: Zaid bin Al-Dathinah, Khubayb bin Adi, Al-Tufayl bin Amr Al-Dawsi, Uthman bin Maz'un, Hilal bin Umayyah, Murarah bin Al-Rabi', Hamzah bin Abdul Muttalib, Mus'ab bin Umayr, Zaid bin Harithah, Simak bin Kharshah, Julaybib, Abdullah bin Amr bin Haram Al-Ansari, and others. This belongs to the chapter of notables mentioned in texts, and perhaps Ibn Hajar's book: 'Al-I'lam bi-man dhukira fi Al-Bukhari min Al-A'lam' covers this type in Sahih Al-Bukhari specifically. Comparison between what Al-Daraqutni wrote in this treatise and what Al-Hakim, Ibn Abi Al-Fawaris, and Al-Humaydi wrote, and what Al-Daraqutni wrote in his other books related to the subject: I found in what Al-Hakim, Ibn Abi Al-Fawaris, and Al-Humaydi wrote on this subject a group of Companions Al-Daraqutni did not mention: Al-Hakim mentioned: Khawlah bint Qays - it was said: She is Khawlah bint Thamir whom Al-Daraqutni mentioned and Al-Hakim did not -, Sa'd bin Ubadah, Sulayk Al-Ghatafani, Al-Dahhak bin Sufyan Al-Kilabi - Al-Hakim erred in mentioning him -, and Uthman bin Talhah. Ibn Abi Al-Fawaris mentioned: Bilal bin Al-Harith - and erred in mentioning him -, Abdullah bin Hudhafah, and Muhammad bin Iyas bin Al-Bukayr - and said: 'from his father', and Al-Daraqutni mentioned his father.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 17
  },
  {
    "serial_number": "5531776",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 19,
    "volume_number": 1,
    "text": "Al-Humaydi mentioned: Suraqah bin Malik, Abdullah bin Hudhafah, Abdullah bin Rawahah, and Muhammad bin Iyas bin Al-Bukayr - noting that he is a Tabi'i and that his father is mentioned but not narrated from in Bukhari, and Al-Daraqutni mentioned his father. Al-Daraqutni did not fully cover noting the ambiguous Musnads (where the Companion is not named), while Ibn Abi Al-Fawaris and Al-Humaydi mentioned them. As for the names added in the origin of (Y) and (H) - which are seventeen names - Al-Hakim, Ibn Abi Al-Fawaris, and Al-Humaydi mentioned among them: Khuwaylid bin Amr Abu Shurayh Al-Adawi, 'A'idh bin Amr Al-Muzani, Amr bin Abasah Al-Sulami, Abdullah bin Sarjis, Ma'mar bin Abdullah Al-Adawi, and Nufay' Abu Bakrah Al-Thaqafi. Al-Hakim alone mentioned: Huwaytib bin Abdul Uzza, Salamah bin Yazid Al-Ju'fi, Al-Dahhak bin Qays Al-Fihri, Abdullah bin Al-Sa'di, Abdullah bin Abdul Asad Abu Salamah, Abdullah bin Safwan, Fatimah bint Abi Hubaysh, Abu Al-Shamus Al-Balawi, Abu Las Al-Khuza'i, and Umm Habibah bint Jahsh. Copy (Y) of this origin solely mentioned: Abdullah bin Amir bin Rabi'ah, and none of them mentioned him. As for the names where the origin of (Y) and (H) differed from the origin of (T), (S), (K), and (F) - which are ten names - six of them appeared in Ibn Abi Al-Fawaris and Al-Humaydi (1) agreeing with what is in the origin of (Y) and (H). These are: Al-Harith bin Awf Abu Waqid Al-Laithi, Al-Rumaysa Umm Sulaym - in the first place...",
    "foot_note": "1. Al-Hakim did not commit in the chapter he dedicated to Companions in his book to distinguish those narrated for by both Sheikhs from those narrated for by one, but only indicated that occasionally. Therefore, I did not include him in the comparison here. I did not find anything in his work contradicting what Al-Daraqutni mentioned, except in \"A'idh bin Amr Al-Muzani,\" whom he listed in Muslim's unique narrations, while he is among the additions of origin (Y) and (H) in the agreed-upon section.",
    "book_id": "597",
    "new_page_number": 18
  },
  {
    "serial_number": "5531777",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 20,
    "volume_number": 1,
    "text": "...(1) -, Sa'd bin Mu'adh, Al-Sa'b bin Jaththamah, Suhayb bin Sinan, and Lubaba Umm Al-Fadl. Three names among them appeared in their works agreeing with what is in the origin of (T), (S), (K), and (F). These are: Abdullah bin Yazid Al-Ansari (2), Amr bin Hurayth, and Amr bin Al-Harith bin Al-Mustaliq. 'Abu Habba Al-Badri' appeared in Ibn Abi Al-Fawaris alone - attributed to Al-Daraqutni - agreeing with what is in the origin of (T), (S), (K), and (F). Both origins agreed on seven names that appeared in Ibn Abi Al-Fawaris and Al-Humaydi contradicting what is in Al-Daraqutni. These are: Khawlah bint Hakim, Sawdah bint Zam'ah, Abdullah bin Zam'ah, Abu Ubaydah Amir bin Abdullah, Fatimah bint Qays, Mahmoud bin Al-Rabi', and Al-Nu'man bin Muqarrin. I have mentioned regarding each one of these in its place what clarifies his case. Their listing is in the following table:",
    "foot_note": "1. Al-Daraqutni mentioned her twice: in Names and in Kunyas. In Names, she appeared in the first origin under agreed-upon, and in the second under Muslim's unique narrations. In Kunyas, she appeared in both origins under agreed-upon. \n2. This is something (H) uniquely contained, contradicting (T), (S), (K), and (F), and it did not appear in (Y).",
    "book_id": "597",
    "new_page_number": 19
  },
  {
    "serial_number": "5531778",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 21,
    "volume_number": 1,
    "text": "Name | (Y, H) | (T, S, K, F) | Ibn Abi Al-Fawaris | Al-Humaydi\n--- | --- | --- | --- | ---\nAbu Waqid Al-Laithi | Kh (Bukhari) M (Muslim) | M | Kh M | Kh M\nAl-Rumaysa | Kh M | M | Kh M | Kh M\nSa'd bin Mu'adh | Kh M | Kh | Kh\nAl-Sa'b bin Jaththamah | Kh M | M | Kh M | Kh M\nSuhayb bin Sinan | M | Kh | M | M M\nUmm Al-Fadl Lubaba | Kh M | M | Kh M | Kh M\nAbdullah bin Yazid | Kh M | Kh | Kh | Kh\nAmr bin Hurayth | Kh M | M | M | M\nAmr bin Al-Harith | Kh M | Kh | Kh | Kh\nAbu Habba Al-Badri | Kh M | M | M | ×\nKhawlah bint Hakim | Kh M | M | M\nSawdah bint Zam'ah | Kh | Kh | M | Kh\nAbdullah bin Zam'ah | Kh | Kh | M | Kh M\nAbu Ubaydah Amir bin Abdullah | Kh | M | M\nFatimah bint Qays | M | Kh | M | Kh M\nMahmoud bin Al-Rabi' | Kh | M | Kh | Kh\nAl-Nu'man bin Muqarrin | Kh | M | Kh | Kh M\n\nI found Al-Daraqutni mentioned: Zaid bin Al-Khattab, and he has a connected hadith in the Two Sahihs, yet Al-Hakim, Ibn Abi Al-Fawaris, and Al-Humaydi did not mention him.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 20
  },
  {
    "serial_number": "5531779",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 22,
    "volume_number": 1,
    "text": "He mentioned Abu Raja' Imran bin Milhan Al-Utardi and said: \"He is a Mukhadram (lived in Jahiliyyah and Islam but didn't meet the Prophet),\" signaling the incorrectness of his Companionship status. He has a hadith in Bukhari attributed to the time of the Prophet (peace be upon him). Al-Hakim and Ibn Abi Al-Fawaris did not mention him, while Al-Humaydi mentioned him with a note. Al-Daraqutni added names mentioned by some of these but not others: He added over Al-Hakim: Asma' bint Abi Bakr, Iyas bin Al-Bukayr, Tha'labah bin Abi Malik, Al-Hakam bin Amr Al-Ghifari, Hazn bin Abi Wahb, Sunayn Abu Jamila, Safiyyah bint Shaybah - though he preferred she wasn't a Companion -, Abdullah bin Abi Awfa, Abdullah bin Qays Abu Musa Al-Ash'ari, Utbah bin Ghazwan, Ammarah bin Ruwaybah, Abdullah bin Al-Musayyib, Abdullah bin Unays, Amir bin Hudhayfah Abu Al-Jahm, Abu Amir Al-Ash'ari, Amir bin Abdullah Abu Ubaydah, Amr bin Salimah Al-Jarmi, Asim bin Thabit bin Abi Al-Aqlah, Al-Adda' bin Khalid, Qudamah bin Maz'un, Marwan bin Al-Hakam, Al-Nu'man bin Muqarrin, Nusaybah Umm Atiyyah, Wa'il bin Hujr, Abu Habba Al-Badri, Umm Haram bint Milhan, and Umm Mubashshir. He added over Ibn Abi Al-Fawaris: Bilal bin Rabah, Abdul Rahman bin Abza, and Mujalid bin Masoud. He added over Al-Humaydi (1): Al-Ash'ath bin Qays, Hassan bin Thabit, Salimah Al-Jarmi father of Amr, Abdul Rahman bin Abza, Al-Adda' bin Khalid, Marwan bin Al-Hakam, Nawfal bin Mu'awiyah, and Abu Habba Al-Badri.",
    "foot_note": "1. I mentioned only those who have a connected (Musnad) hadith, because they fit Al-Humaydi's criteria. As for others, they do not fit his criteria. Al-Daraqutni mentioned among them: Tha'labah bin Abi Malik, Salim Mawla Abi Hudhayfah, Abdullah bin Al-Musayyib, Amir bin Hudhayfah Abu Al-Jahm, Asim bin Thabit bin Abi Al-Aqlah, Qudamah bin Maz'un, and Umm Salit, whom Al-Humaydi did not mention.",
    "book_id": "597",
    "new_page_number": 21
  },
  {
    "serial_number": "5531780",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 23,
    "volume_number": 1,
    "text": "Al-Daraqutni mentioned three not mentioned by these, and I did not find a mention for them in what he attributed them to: Al-Bara' bin Malik and Abu Dawood (1), he listed them in Bukhari's unique narrations, and Abdullah bin Rabi'ah, he listed him in Muslim's unique narrations. By comparing what Al-Daraqutni mentioned in this treatise with what he mentioned in his book: 'Al-Ilzamat', I found his statements consistent in both. He mentioned in both as agreed upon: Al-Musayyib bin Hazn, Itban bin Malik, Amr bin Awf, Malik bin Sa'sa'ah, and Mu'ayqib. And as unique to Bukhari: Mirdas Al-Aslami, Zahir father of Mujza'ah, Hazn bin Abi Wahb, Abdullah bin Hisham, Abdullah bin Tha'labah bin Su'ayr, Amr bin Taghlib, Khawlah bint Thamir, Suwayd bin Al-Nu'man, Abu Sa'id bin Al-Mu'alla, Sunayn Abu Jamila, Shaybah bin Uthman, Abu Abs bin Jabr, and Umm Al-Ala. And as unique to Muslim: Tariq bin Ashyam father of Abu Malik Al-Ashja'i, Muti' bin Al-Aswad, Zuhayr bin Amr, Qabisah bin Al-Mukhariq, Sabrah bin Ma'bad, Judamah bint Wahb, Dhu'ayb father of Qabisah, Al-Agharr Al-Muzani, Abu Rifa'ah Al-Adawi, Rafi' bin Amr Al-Ghifari, Rabi'ah bin Ka'b Al-Aslami, Qutbah bin Malik, Nafi' bin Utbah, and Umm Mubashshir. Al-Daraqutni also mentioned in his book: 'Mention of the names of Tabi'in and those after them whose narration is authentic among trustworthy narrators according to Bukhari and Muslim' a group he mentioned in this treatise. He listed in Bukhari's narrators and Muslim's narrators: Safiyyah bint Shaybah, Abu Raja' Imran bin Milhan Al-Utardi, and Zainab bint Umm Salamah. And he listed in Bukhari's narrators alone: Tha'labah bin Abi Malik, Abdullah bin Yazid Al-Khatmi Al-Ansari, and Mahmoud bin Al-Rabi'. I have mentioned regarding each one of them in his place what might explain this repetition.",
    "foot_note": "1. \"Abu Dawood\" was not mentioned in (K), (Y), and (H).",
    "book_id": "597",
    "new_page_number": 22
  },
  {
    "serial_number": "5531781",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Methodology Followed in Producing the Treatise: 1 - I relied for the names of Companions on what appeared in the origin of (T), (S), (K), and (F). I recorded in the footnotes the names added in the origin of (Y) and (H) in their places, and pointed out every name where a difference occurred between the two origins, mentioning its place of occurrence in the origin of (Y) and (H). As for the phrasing, I selected the correct version from the copies and established what I deemed correct of the additions therein. 2 - I divided the treatise into paragraphs and numbered them sequentially, linking each number to a footnote explaining the differences in copies within each paragraph. 3 - I noted those mentioned by Al-Daraqutni who do not have connected (Musnad) hadiths in the Two Sahihs or one of them, but rather have narrations from Companions, or Mawquf traditions attributed to them, or a mention in the hadiths without narration, or those Al-Daraqutni mentioned as agreed upon but only one narrated for them, or vice versa. 4 - I commented on some places to clarify them, and corrected in the footnotes what I saw as an error in the text. I ask Allah Almighty for success in word and deed; He is All-Hearing, Responsive. Written on 19 Shawwal 1430. jaberaddosary@hotmail.com",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 23
  },
  {
    "serial_number": "5531782",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 25,
    "volume_number": 1,
    "text": "Samples of Manuscript Images",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 24
  },
  {
    "serial_number": "5531783",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 27,
    "volume_number": 1,
    "text": "The first and last pages of Manuscript (T)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 25
  },
  {
    "serial_number": "5531784",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 28,
    "volume_number": 1,
    "text": "The first and last pages of Manuscript (S)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 26
  },
  {
    "serial_number": "5531785",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 29,
    "volume_number": 1,
    "text": "The first and last pages of Manuscript (K)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 27
  },
  {
    "serial_number": "5531786",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 30,
    "volume_number": 1,
    "text": "The first and last pages of Manuscript (F) which I possess",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 28
  },
  {
    "serial_number": "5531787",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions agreed upon by Muhammad bin Ismail Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri (may Allah have mercy on them both) and what each of them narrated individually without the other",
    "edition": "First, 1433 AH - 2012 AD",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 31,
    "volume_number": 1,
    "text": "The first and last pages of Manuscript (H)",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 29
  },
  {
    "serial_number": "5531788",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 32,
    "volume_number": 1,
    "text": "The first and last pages of the manuscript copy (Y).",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 30
  },
  {
    "serial_number": "5531789",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 33,
    "volume_number": 1,
    "text": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other. Authored by the Imam, the Hafiz, Abu Al-Hasan Ali bin Umar Al-Daraqutni, may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "597",
    "new_page_number": 31
  },
  {
    "serial_number": "5531790",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 35,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. 1 - (1) Praise be to Allah, Lord of the Worlds, and may Allah bless our Master Muhammad, and his family, and his companions, and grant them peace. 2 - (2) The Sheikh, the Hafiz, Abu Al-Hasan Ali bin Umar Al-Daraqutni, may Allah have mercy on him, said: 3 - (3) These are the names of the Companions upon whom Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, may Allah have mercy on them, agreed [to narrate from], and what each of them narrated uniquely without the other: 4 - (4) They agreed upon Muhammad bin Maslamah, may Allah be pleased with him.",
    "foot_note": "1. 1 - \"Praise be to Allah...\" is from copies K, F / \"may Allah bless our Master Muhammad\" is from copies T, S, K, F / \"and his family and companions and grant them peace\" is from F; in K: \"and his family and companions and grant them peace\"; in Y: \"may Allah bless Muhammad the Prophet and his family and grant them peace\". \n2. 2 - \"Al-Hafiz\" is from K, F; in H: \"Al-Imam\" / \"may Allah have mercy on him\" is from T, S, K, F; in Y: \"Abu Al-Hasan Ali Ibn Fahd said: I read to Abu Al-Fath Muhammad bin Ahmad bin Abi Al-Fawaris: Abu Al-Hasan Al-Daraqutni told you, saying\". His saying \"Abu Al-Hasan Ali bin Fahd\" is likely a mistake for: Abu Al-Qasim bin Ali bin Fahd, who is Abdul Wahid bin Ali bin Muhammad bin Fahd, Abu Al-Qasim Al-Allaf, the last to narrate from Ibn Abi Al-Fawaris, died in 486 AH. And his saying \"Aba\" (Accusative) should grammatically be \"Abi\" (Genitive). \n3. 3 - \"Al-lati\" (which - feminine) in H is \"Al-ladhina\" (who - masculine plural) / \"Al-Bukhari\" is from T, S, K, F / \"bin Muslim\" is from S, K, F; in T: \"min Muslim\" / \"Al-Qushayri may Allah have mercy on them\" is from T, S, K, F / \"Ta'ala\" (Almighty) is from F / \"without the other\" in Y: \"without the other s- companion\". \n4. 4 - \"fi\" (in/upon) is not in Y / \"may Allah be pleased with him\" is from T, S.",
    "book_id": "597",
    "new_page_number": 32
  },
  {
    "serial_number": "5531791",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 36,
    "volume_number": 1,
    "text": "Chapter: Alif (A) 5 - (1) They agreed upon Usamah bin Zayd bin Harithah * and Anas bin Malik * and Ubayy bin Ka'b * and Usayd bin Hudayr * and Aslam Abu (2) Rafi' * and Al-Ash'ath bin Qays * and Asma' bint Abi Bakr. 6 - (3) Muslim bin Al-Hajjaj was unique in [narrating from] Abu Umamah bin Tha'labah Al-Harithi, and his name is Iyas * and Al-Agharr Al-Muzani. [ (4) ] 7 - And Al-Bukhari was unique in [narrating from] Uhban bin Aws (5) * and Iyas bin Al-Bukayr (6). Chapter: Ba (B) 8 - (7) They agreed upon Buraydah bin Al-Husayb Al-Aslami * and Al-Bara' bin Azib Al-Ansari * and Bilal bin",
    "foot_note": "1. 5 - \"bin Harithah\" is from T, S, K, F / \"and Aslam\" in Y: \"and Aslamah\" / \"Abu\" in Y, H: \"bin\". \n2. The phrasing \"Abu\" (Nominative) should grammatically be \"Abi\" (Genitive/Appositive). \n3. 6 - \"bin Al-Hajjaj\" is from T, S, K, F / \"Al-Harithi\" in T, S: \"Al-Muzani\" / \"Iyas\" in F: \"Al-Iyas\". \n4. [] Ibn Abi Al-Fawaris (66) and Ibn Al-Jawzi in Al-Talqih (p. 207) and Al-Mujtana (f 190a) attributed to Al-Daraqutni here in Muslim's unique narrations: \"Asma' bint Umays\". Bukhari and Muslim narrated from Abu Musa Al-Ash'ari the hadith of the ship owners who came from Abyssinia, which contains the conversation of Umar bin Al-Khattab with Asma', and she is mentioned in Muslim in other hadiths, but they did not narrate anything from her Musnad (direct chain) nor from her narration. Ibn Al-Jawzi said in Al-Mujtana: \"Al-Daraqutni said: Muslim was unique in narrating from her, and he did not mention the number of what he narrated for her.\" \n5. Al-Bukhari did not narrate anything from his Musnad, but narrated (4174) regarding his action in a suspended (mawquf) manner, and that he was one of the Companions of the Tree. \n6. Al-Bukhari did not narrate anything from his Musnad, but narrated (3991) that he was a Badr warrior. \n7. 8 - \"Chapter Ba\" in Y: \"Letter Ba\", and likewise what follows until Chapter Kha / \"Al-Husayb\" in T, S: \"Al-Khasib\" / \"Al-Aslami\" is from Y, T, S; in K, F: \"Al-Sulami\" / \"Al-Ansari\" is from T, S, K, F.",
    "book_id": "597",
    "new_page_number": 33
  },
  {
    "serial_number": "5531792",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 37,
    "volume_number": 1,
    "text": "Rabah. 9 - (1) Al-Bukhari was unique in [narrating from] Al-Bara' bin Malik (2). Chapter: Ta (T) 10 - (3) Muslim narrated from Tamim Al-Dari the hadith of: \"Advice (Al-Nasihah)\" (4) * and [from] Abu Rifa'ah Tamim bin Usayd Al-Adawi, and it is said: Asid, and it is said: Abdullah bin Al-Harith. Chapter: Tha (Th) 11 - (5) Muslim was unique in narrating from Thawban, the freed slave of the Messenger of Allah, peace and blessings be upon him. 12 - (6) And Al-Bukhari was unique in [narrating from] Thabit bin Qays bin Shammas.",
    "foot_note": "1. 9 - \"wa infarada\" (and was unique) in T, S, Y, H: \"infarada\" (was unique). \n2. Muslim narrated (1496) in the story of the mutual imprecation (Li'an), from Anas: \"That Hilal bin Umayyah accused his wife of [adultery with] Sharik bin Sahma', who was the brother of Al-Bara' bin Malik through his mother.\" I did not find a mention of him in Al-Bukhari. It was narrated from Al-Daraqutni by: Ibn Abi Al-Fawaris (7), Ibn Al-Jawzi in Al-Talqih (p. 198), and Al-Baji said (1/437): \"Abu Al-Hasan Al-Daraqutni mentioned that Al-Bukhari was unique in narrating from Al-Bara' bin Malik, but I did not see a mention of him in the book.\" \n3. 10 - \"kharraja\" (narrated) in H: \"akhraja\" / \"Hadith Al-Nasihah\" is from T, S, K, F / \"wa abi\" in T, S, K, F: \"wa abu\" / \"Al-Adawi\" is from T, S, K, F / \"wa yuqal Usayd\" in H: \"wa yuqal Ibn Usayd\" / \"wa qila Abdullah bin Al-Harith\" is from T, S, K, F. \n4. Meaning: What he narrated in Hadith 55 raised to the Prophet: \"Religion is Advice.\" We said: To whom? He said: \"To Allah, His Book, His Messenger, the leaders of the Muslims, and their common folk.\" \n5. 11 - \"Infarada... wa sallam\" in Y: \"Li-Muslim Thawban\" (Thawban belongs to Muslim), in H: \"Akhraja Muslim 'an Thawban\" (Muslim narrated from Thawban). \n6. 12 - \"wa infarada Al-Bukhari bi-Thabit\" in Y: \"Al-Bukhari Thabit\", in H: \"wa Thabit\".",
    "book_id": "597",
    "new_page_number": 34
  },
  {
    "serial_number": "5531793",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 38,
    "volume_number": 1,
    "text": "13 - (1) They agreed on narrating from Thabit bin Al-Dahhak. 14 - (2) Al-Bukhari was unique in [narrating from] Tha'labah bin Abi Malik; he narrated a hadith for him from Qays bin Sa'd (3). Chapter: Jim (J) 15 - (4) They agreed upon Abu Dharr Jundub bin Junadah Al-Ghifari * and Jundub bin Sufyan Al-Bajali * and Jubayr bin Mut'im * and Jarir bin Abdullah Al-Bajali * and Jabir bin Samurah * and Jabir bin Abdullah * and Jurhum, also said to be Jurthum, Abu Tha'labah Al-Khushani * and Juwayriyah bint Al-Harith. 16 - (5) Muslim narrated, without Al-Bukhari, from Judamah bint Wahb. Chapter: Ha (H) 17 - (6) They agreed on narrating from Hakim bin Hizam * and Hudhayfah bin Al-Yaman * and Al-Harith bin Rib'i, Abu",
    "foot_note": "1. 13 - \"wa ittafaqa\" (and they agreed) in Y: \"ittafaqa\" (they agreed). \n2. 14 - \"wa infarada\" is from T, S, K, F; in H: \"infarada\" / \"bi-Tha'labah\" in Y: \"Tha'labah\" / \"Abi\" is from Y / \"Sa'd\" in Y: \"Sa'id\". \n3. Al-Baji said in the biography of Tha'labah (1/451): \"Sheikh Abu Al-Hasan mentioned his hadith from Qays bin Sa'd specifically.\" He is among those whose Companionship is disputed. Al-Bukhari did not narrate anything from his Musnad, but narrated his narration from Umar bin Al-Khattab (2881, 4071) and Qays bin Sa'd (2974). Al-Daraqutni mentioned him among the trustworthy Tabi'in (Successors) whose narration is authentic in Al-Bukhari (1/89). \n4. 15 - \"Al-Ghifari\" is from T, S, K, F / \"Jurthum\" in Y, H: \"Jurthum\" / \"Abi Tha'labah\" in T, S, K, F: \"Abu Tha'labah\" / \"wa Juwayriyah\" in K, F: \"wa Juwayrah\". \n5. 16 - \"wa kharraja Muslim duna Al-Bukhari\" in Y, H: \"wa li-Muslim wahdahu\" (and to Muslim alone) / \"Judamah\" in T, S, K, F: \"Judhamah\" / \"bint\" in T, S: \"bin\". \n6. 17 - \"ikhraj\" (narrating) is from T, S, K, F / \"Hizam\" in K: \"Judham\", in F: \"Hudham\" / \"Abi Qatadah\" in T, S, K, F: \"Abu Qatadah\" / \"wa Harithah\" in T, S: \"wa Al-Harith\", in K, F: \"wa Harith\" / Hassan precedes Hafsah in Y, H.",
    "book_id": "597",
    "new_page_number": 35
  },
  {
    "serial_number": "5531794",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 39,
    "volume_number": 1,
    "text": "Qatadah * and Harithah bin Wahb Al-Khuza'i * and Hafsah bint Umar bin Al-Khattab * and Hassan bin Thabit. 18 - (1) Muslim was unique in [narrating from] Hudhayfah bin Asid Abu Sarihah Al-Ghifari * and Humayl bin Basrah Abu Basrah Al-Ghifari * and Al-Harith bin Awf Abu Waqid Al-Laythi (2) * and Hanzalah the Scribe * and Hamzah bin Amr Al-Aslami (3). 19 - (4) Al-Bukhari was unique in narrating from Al-Hakam bin Amr Al-Ghifari * and Hazn bin Abi Wahb. [ (5) ]",
    "foot_note": "1. 18 - \"Asid\" in Y: \"Asad\" / \"Abi Sarihah\" in F: \"Abu Sarihah\" / \"Abi Basrah\" not in H / \"Awf\" in K, F: \"Azw\" / \"Abi Waqid\" in K, F: \"Awaqid\" / \"wa bi-Hanzalah\" in Y: \"wa Hanzalah\" / \"wa bi-Hamzah\" in Y: \"wa Hamzah\" / \"Amr\" in F: \"Umar\" / \"Al-Aslami\" in K, F: \"Al-Sulami\". \n2. Mentioned in Y, H under agreed upon. Al-Baji said in his biography (2/512): \"Abu Al-Hasan Al-Daraqutni said: Muslim was unique in narrating from him, and I think he did not recall this hadith,\" meaning: what Al-Bukhari narrated from him (66, 474) regarding sitting in the mosque, which is in Muslim (861, 2176). \n3. Al-Mundhiri said - as in the footnote of \"Al-Jam' bayna Rijal Al-Sahihayn\" by Ibn Tahir (1/106) -: \"Al-Bukhari cited Hamzah bin Amr Al-Aslami as evidence at the beginning of the Book of Kafalah.\" Ibn Hajar gave him the code \"Kha Ta\" in Al-Taqrib. The intent is: what Al-Bukhari narrated (2290) in a suspended manner (mu'allaq), containing a story of Hamzah bin Amr with Umar bin Al-Khattab. Al-Bukhari narrated (1942, 1943) from Aisha, that Hamzah bin Amr Al-Aslami said..., and Muslim narrated it from the Musnad of Hamzah bin Amr. \n4. 19 - \"Abi\" is from T, S, K, F. \n5. [] Added here in Y, H: \"and Huwaytib bin Abd Al-Uzza\". Al-Bukhari narrated his hadith (7163) via Amr ibn Al-Harith, from Al-Zuhri, from Al-Sa'ib bin Yazid, from him, from Abdullah bin Al-Sa'di, from Umar. Muslim also narrated it (1045 Abd Al-Baqi ed., 3/98 Turkish ed.) via Amr. Al-Mizzi listed it in Al-Tuhfah (8/39) linked to Al-Bukhari's chain mentioning Huwaytib, but Huwaytib is dropped from Muslim's chain. Scholars noted this omission, such as Abu Ali Al-Jayyani in Taqyid Al-Muhmal (3/833), Al-Maziri in Al-Mu'lim (2/20), Iyad in Sharh Muslim (3/580) and Mashariq Al-Anwar (2/349), Al-Rashid Al-Attar in Ghurar Al-Fawa'id (p. 192), Al-Nawawi in Sharh Muslim (7/136), and Al-Suyuti in Al-Dibaj (3/125). Al-Iraqi critiqued Al-Mizzi on this in Al-Itraf (p. 156), as did Ibn Hajar in Al-Nukat (8/39) and Al-Fath (Hadith 7163). Furthermore, Al-Daraqutni mentioned Huwaytib among the trustworthy Tabi'in whose narration is authentic in Al-Bukhari (1/120), and said: \"He has companionship, from Ibn Al-Sa'di, from Umar,\" and did not list him in the narrators of Muslim. Al-Hakim mentioned him (2/23) among the Companions, and in the unique narrations of Al-Bukhari from the Tabi'in (2/239). Ibn Abi Al-Fawaris did not list him in his treatise. However, Ibn Manjuwayh mentioned him in the narrators of Muslim (1/177), followed by Ibn Tahir (1/114), listing him among those from whom both Sheikhs narrated. Al-Mizzi coded him in Al-Tahdhib (Kha Mim Sin), followed by his abbreviators, except that Ibn Hajar said in Al-Tahdhib (2/44): \"Both Sheikhs and Al-Nasa'i narrated from him... then the mention of Huwaytib dropped from Muslim's book in all copies.\"",
    "book_id": "597",
    "new_page_number": 36
  },
  {
    "serial_number": "5531795",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 40,
    "volume_number": 1,
    "text": "Chapter: Kha (Kh) 20 - (1) They agreed on narrating from Khabbab bin Al-Aratt * and Khalid bin Zayd Abu Ayyub Al-Ansari * and Khalid ibn Al-Walid * [ (2) ] and Khawlah bint Hakim (3).",
    "foot_note": "1. 20 - \"Zayd Abi\" in F: \"Zayd bin Abi\" / \"wa Khawlah\" in H: \"wa Khuwaylah\". \n2. [] Added here in Y, H: \"and Khuwaylid bin Amr Abu Shurayh Al-Adawi\". \n3. Al-Baji said in her biography (3/1282): \"Sheikh Abu Al-Hasan mentioned that they agreed on narrating from her,\" but Al-Bukhari did not narrate anything from her Musnad nor from her narration, but narrated (5113) from Urwah: Khawlah bint Hakim was one of those who gifted themselves to the Prophet, peace and blessings be upon him.",
    "book_id": "597",
    "new_page_number": 37
  },
  {
    "serial_number": "5531796",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 41,
    "volume_number": 1,
    "text": "21 - (1) Muslim was unique in [narrating from] Khufaf bin Ima' bin Rahadah * and Khuzaimah bin Thabit (2). 22 - (3) Al-Bukhari was unique in [narrating from] Khawlah bint Thamir * and Khansa bint Khidham. Chapter: Dhal (Dh) 23 - (4) Muslim narrated, without Al-Bukhari, from Dhu'ayb, the father of Qabisah bin Dhu'ayb. Chapter: Ra (R) 24 - (5) They agreed upon Rifa'ah bin Abd Al-Mundhir Abu Lubabah * and Rafi' bin Khadij * and Al-Rubayyi' bint Mu'awwidh bin Afra' * and Ramlah Umm Habibah bint Abi Sufyan. 25 - (6) Al-Bukhari was unique in [narrating from] Rafi' bin Al-Mu'alla Abu Sa'id * and Rifa'ah bin Rafi' Al-Zuraqi. 26 - (7) Muslim was unique in [narrating from] Rafi' bin Amr Al-Ghifari * and Rabi'ah bin Ka'b Al-Aslami *",
    "foot_note": "1. 21 - \"Rahadah\" in F: \"Rakhsah\". \n2. Ibn Hajar corrected Al-Mizzi (3/123) in the Musnad of Khuzaimah regarding what Al-Bukhari narrated (2807 and others) from Zayd bin Thabit, that when he collected the Quran he found the end of At-Tawbah with Khuzaimah bin Thabit. \n3. 22 - \"bi-Khawlah\" in H: \"bi-Khuwaylah\" / \"Thamir\" in Y: \"Tamir\" / \"wa Khansa\" in K, F: \"wa bi-Khansa\" / \"Khidham\" in T, S: \"Haram\", in K, F: \"Khuzam\", in Y: \"Hidam\". \n4. 23 - \"walid Qabisah bin Dhu'ayb\" is not in T. \n5. 24 - \"Chapter Ra Agreed\" is not in T / \"Abd\" is from Y, H / \"Abi\" is from Y, H, in T, S: \"bin\" / \"Lubabah\" is not in K, F. \n6. 25 - \"bin Rafi'\" in H: \"bin Abi Rafi'\" / \"Al-Zuraqi\" is from Y, H. \n7. 26 - \"Amr\" in K, F: \"Ams\" / \"wa bi-Al-Rumaysa\" in T, S: \"wa bi-Al-Rumayda\" / \"Umm\" in T: \"min\", in S: \"bin\" / \"Wallahu A'lam\" is from H.",
    "book_id": "597",
    "new_page_number": 38
  },
  {
    "serial_number": "5531797",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 42,
    "volume_number": 1,
    "text": "and Al-Rumaysa Umm Sulaym (1). And Allah knows best. Chapter: Zay (Z) 27 - (2) They agreed on narrating from Zayd bin Thabit * and Zayd bin Arqam * and Zayd bin Sahl Abu Talhah * and Zayd bin Khalid Al-Juhani * and Al-Zubayr bin Al-Awwam * and Zaynab bint Umm Salamah (3) * and Zaynab bint Jahsh * and Zaynab Al-Thaqafiyyah, wife of Abdullah bin Mas'ud. 28 - (4) Muslim was unique in [narrating from] Zayd bin Al-Khattab (5) * and Zuhayr bin Amr.",
    "foot_note": "1. Mentioned in Y, H here under what they agreed upon, but Al-Daraqutni mentioned her correctly later in the Chapter of Women with Kunyas under what they agreed upon. Al-Baji said (3/1284): \"Sheikh Abu Al-Hasan mentioned that Muslim was unique in narrating from Al-Rumaysa Umm Sulaym, he said: And it is said with Shin, then he said in the Chapter of Kunyas of Women: They agreed on narrating from Umm Sulaym.\" His saying quoting Al-Daraqutni: \"And it is said with Shin\" perhaps should be: And it is said with Ghayn, i.e., Al-Ghumaysa, and I did not find this statement of Al-Daraqutni. \n2. 27 - \"Al-Zay\" in T, S: \"Al-Za'\" / \"wa Al-Zubayr bin Al-Awwam\" in T: \"wa Al-Zubayr Al-Awwam\" / \"wa Zaynab bint Umm\" in T: \"wa Zaynab Umm\" / \"Abdullah\" is from T, S, K, F. \n3. Al-Daraqutni mentioned her in the trustworthy Tabi'in whose narration is authentic in the two Sahihs (1/146, 2/303), perhaps because most of her narrations are from the Companions, but her Companionship is established, and she has a Musnad hadith in the two Sahihs. \n4. 28 - \"wa infarada\" in T, S, K: \"infarada\" / \"Muslim\" is not in T / \"wa Zuhayr\" in T, S: \"wa Zubayr\". \n5. Al-Mizzi coded him \"Kha Ta\" (Bukhari suspended), and his abbreviators followed him - except Al-Dhahabi in Al-Kashif who omitted him -. Al-Bukhari (3297) and Muslim (2233) narrated his hadith via Al-Zuhri, from Salim, from Ibn Umar, regarding the command to kill snakes, wherein: Abu Lubabah Al-Ansari informed Ibn Umar about the prohibition of killing house snakes; there was a difference regarding Al-Zuhri in this; it was said from him thus, and it was said: Abu Lubabah or Zayd bin Al-Khattab informed him - with doubt -, and it was said: Both of them informed him. Al-Bukhari narrated the first mode - in places - as connected (Musnad), and the other two modes as suspended (Mu'allaq), while Muslim narrated them all as connected.",
    "book_id": "597",
    "new_page_number": 39
  },
  {
    "serial_number": "5531798",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 43,
    "volume_number": 1,
    "text": "29 - (1) Al-Bukhari was unique in [narrating from] Zahir Al-Aslami, father of Majza'ah bin Zahir. Chapter: Sin (S) 30 - (2) They agreed upon Sahl bin Sa'd Al-Sa'idi * and Sahl bin Hunayf * and Sahl bin Abi Hathmah * and Salman Al-Farisi * and Salamah bin Al-Akwa' * and Sa'ib bin Yazid * and Samurah bin Jundub * and Sufyan bin Abi Zuhayr * and Subay'ah Al-Aslamiyyah * and Sulayman bin Surad. 31 - (3) Muslim was unique in [narrating from] Sabrah bin Ma'bad * and Sa'd bin Mu'adh (4) [ (5) ] * and Samurah bin Mi'yar Abu Mahdhurah * and Sufyan bin Abdullah Al-Thaqafi * and Suwayd bin Muqarrin * and Safinah, freed slave of the Messenger of Allah,",
    "foot_note": "1. 29 - \"Al-Aslami\" is from T, S, K, F / \"bin Zahir\" is from Y, H. \n2. 30 - \"ittafaqa\" is from F, Y, H / \"fi\" is from F, H, in Y: \"ala\" / \"Sahl bin Sa'd\" in K, F: \"Suhayl bin Sa'id\" / the conjunction 'waw' between names is not in T, S, K / \"Sahl\" in K, F: \"Suhayl\" / \"Sahl bin Abi\" in T: \"bin Abi\" / \"Hathmah\" in Y: \"Haythamah\" / \"Sa'ib\" in Y, H: \"Al-Sa'ib\" / \"Yazid\" in K, F: \"Zayb\" / \"bin Abi Zuhayr\" in T, S, K, F: \"bin Zuhayr\". \n3. 31 - \"wa Samurah\" in H: \"wa Salamah\", and in its footnote: \"It is said: Samurah, and said: Aws\" / \"Mi'yar\" in T, S: \"Mughir\", in K, F: \"Ma'ib\" / \"Abi\" in T, S: \"Abu\" / \"Mahdhurah\" in Y: \"Ma'darah\", in S: \"Mahrurah\", and in its footnote: \"Perhaps: Abu Mahdhurah is correct\". \n4. Mentioned in Y, H in Bukhari's unique narrations. Al-Bukhari narrated (3950) a hadith from Ibn Masud about the story of Sa'd, and narrated before that (3632) from the Musnad of Ibn Masud. Sa'd is mentioned in Muslim in several hadiths, but he did not narrate anything from his Musnad nor from his narration. \n5. [] Added here in Y, H: \"and Salamah bin Yazid Al-Ju'fi\". Muslim did not narrate anything from his Musnad nor narration, but narrated (1846) from Wa'il bin Hujr who said: Salamah asked the Messenger of Allah, peace and blessings be upon him.",
    "book_id": "597",
    "new_page_number": 40
  },
  {
    "serial_number": "5531799",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 44,
    "volume_number": 1,
    "text": "peace and blessings be upon him. 32 - (1) They agreed upon Sa'd bin Abi Waqqas * and Sa'd bin Malik Abu Sa'id Al-Khudri * and Sa'id bin Zayd bin Amr bin Nufayl. 33 - (2) Al-Bukhari was unique in [narrating from] Salman bin Amir Al-Dabbi * and Suwayd bin Al-Nu'man * and Salimah Al-Jarmi, father of Amr (3) * and Sunayn Abu Jamilah * and Salim, freed slave of Abu Hudhayfah (4), mentioned in the hadith of Abdullah bin Amr (5), and it has been said: that Salim saw the Prophet, peace and blessings be upon him (6) *",
    "foot_note": "1. 32 - \"wa ittafaqa\" in T, S, K: \"ittafaqa\" / \"Al-Khudri\" in S: \"Al-Khudhri\" / \"wa Sa'id\" in F: \"wa Sa'd\" / \"Nufayl\" in S: \"Nufanl\". \n2. 33 - \"wa Sunayn\" in K, F: \"wa Sufyan\" / \"Abi Jamilah\" in T, S: \"bin Jamilah\", in F: \"bin Abi Jamilah\" / \"Abdullah\" is from T, S, K, F / \"bin Amr\" in H: \"bin Umar\" / \"wa qad qila ... wa sallam\" is from T, S, K, F / \"wa Sawdah\" in K, F: \"wa Surah\". \n3. Attributed to Al-Daraqutni by: Ibn Al-Jawzi in Al-Talqih (p. 200). \n4. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (26), Ibn Al-Jawzi in Al-Talqih (p. 200), and Al-Mujtana (f 212a). \n5. Meaning: What he narrated (3758 and others) from Abdullah bin Amr bin Al-As raised to the Prophet: \"Learn the Quran from four,\" and he mentioned Salim among them. He also narrated (692, 7175) from Abdullah bin Umar bin Al-Khattab: Salim used to lead the first emigrants in prayer. Muslim narrated (2464) the hadith of Abdullah bin Amr, and narrated another hadith (1453, 1454) mentioning the breastfeeding of Salim when he was an adult. \n6. The statement: \"saw the Prophet, peace and blessings be upon him\" might properly be: narrated from the Prophet, peace and blessings be upon him. This points to the weakness of what is narrated from Salim as Marfu' (raised) hadiths to the Prophet. Ibn Al-Jawzi said in Al-Mujtana (f 212a): \"And he narrated from the Messenger of Allah, and we cannot count how much he narrated.\"",
    "book_id": "597",
    "new_page_number": 41
  },
  {
    "serial_number": "5531800",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 45,
    "volume_number": 1,
    "text": "and Sawdah bint Zam'ah (1). Chapter: Shin (Sh) 34 - (2) Al-Bukhari was unique in [narrating from] Shaybah bin Uthman. 35 - (3) Muslim was unique in [narrating from] Sharid bin Suwayd Al-Thaqafi. 36 - They agreed on narrating from Shaddad bin Aws. Chapter: Sad (S) 37 - They agreed upon Abu Umamah Suday bin Ajlan * and Suhayb bin Sinan (4) * and Abu Sufyan Sakhr ibn Harb * and Safiyyah bint Huyayy (5) bin Akhtab. 38 - (6) Muslim was unique in [narrating from] Safwan bin Umayyah Al-Jumahi (7) * and Al-Sa'b bin",
    "foot_note": "1. She is mentioned in Muslim in several hadiths, but he did not narrate anything from her Musnad nor from her narration. \n2. 34 - \"bi-Shaybah\" in T: \"bi-Shayb\". \n3. 35 - \"Al-Thaqafi\" is from Y, H. \n4. Mentioned in Y, H in Muslim's unique narrations. Al-Mizzi coded him \"Ayn\" (Agreed upon), followed by his abbreviators. Al-Khazraji added in Al-Khulasah: \"Al-Bukhari was unique for him in one hadith, and Muslim in three.\" Al-Bukhari did not narrate from his Musnad anything, but narrated (2219, 1287, 1290) from his saying as suspended (mawquf). \n5. Above it in K, and in footnote F: \"diminutive of Hayy\". \n6. 38 - \"bin Jaththamah\" is from H, in Y: \"bin Hathamah\". \n7. Al-Mizzi coded him \"Kha Ta\" (Bukhari suspended), followed by his abbreviators. Al-Bukhari narrated before 2423 as suspended: \"Nafi' bin Abd Al-Harith bought a house for prison in Mecca from Safwan bin Umayyah.\" Al-Baji said (2/789): \"Sheikh Abu Al-Hasan said: Muslim was unique in narrating from Safwan bin Ya'la, and all of that is among those he narrated from among the Companions in narrating from the Prophet, peace and blessings be upon him, while Al-Bukhari only narrated from him from his father, and Allah knows best.\" Perhaps Safwan bin Ya'la bin Umayyah was confused with Safwan bin Umayyah Al-Jumahi for Al-Baji; Al-Daraqutni did not mention the first here in the Companions, but mentioned him in his book: \"Mention of the Names of the Tabi'in\" (1/179), and he mentioned the second here in the Companions, and did not mention him in \"Mention of the Names of the Tabi'in\", while Al-Baji did not mention in his book except Safwan bin Ya'la.",
    "book_id": "597",
    "new_page_number": 42
  },
  {
    "serial_number": "5531801",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 46,
    "volume_number": 1,
    "text": "Jaththamah (1). 39 - (2) Al-Bukhari was unique in narrating from Safiyyah bint Shaybah, and it is among the hadiths counted in what he narrated of the Mursals (disconnected chains), and her seeing the Prophet, peace and blessings be upon him, is not authentic, and there is disagreement regarding that (3). [ (4) ]",
    "foot_note": "1. Mentioned in Y, H under agreed upon. Al-Bukhari narrated for him (1825 and others) and Muslim (1193, 1194, 1745). \n2. 39 - \"wa huwa fi\" (and it is in) in Y, H: \"wa huwa min\" (and it is from), in K: \"wa huwa\" / \"fima\" in Y, H: \"mimma\" / \"bi-sahih\" in H: \"yasihh\" / \"ru'yatuha\" (her seeing) in T, S, K, H: \"riwayatuha\" (her narration), in Y: \"wayati\" / \"li-l-Nabi\" in Y: \"ila al-Nabi\" / \"wa ukhtulifa\" in Y, H: \"ikhtulifa\". \n3. Al-Baji (3/1290) and Al-Ayni in Umdat Al-Qari (20/156) quoted Al-Daraqutni's words here verbatim. A group - including Iyad in Mashariq Al-Anwar (2/342), Al-Mizzi in Al-Tahdhib (35/211), Al-Dhahabi in Al-Siyar (6/7), Ibn Hajar in Al-Fath (Hadith 5172), Al-Tahdhib (6/548), Al-Taqrib (8622), and Abu Zur'ah Ibn Al-Iraqi in Tuhfat Al-Tahsil (p. 634) - quoted Al-Daraqutni saying that Safiyyah bint Shaybah has no authentic sighting (of the Prophet). Al-Daraqutni mentioned her in the trustworthy Tabi'in whose narration is authentic in the two Sahihs (1/181, 2/302). Al-Daraqutni only mentioned her here because she has a Musnad hadith. \n4. [] Added here in Y, H: \"Chapter: Dad. They agreed on narrating from Al-Dahhak bin Qays Al-Fihri.\" Al-Bukhari and Muslim did not narrate anything from his Musnad. I did not find a mention of him in Al-Bukhari. Muslim narrated (878) from Ubaydullah bin Abdullah, saying: Al-Dahhak bin Qays wrote to Al-Nu'man bin Bashir.",
    "book_id": "597",
    "new_page_number": 43
  },
  {
    "serial_number": "5531802",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 47,
    "volume_number": 1,
    "text": "Chapter: Ta (T) 40 - They agreed on narrating from Talhah bin Ubaydullah. 41 - (1) Muslim bin Al-Hajjaj was unique in [narrating from] Tariq bin Ashyam bin (2) Abi Malik Al-Ashja'i. Chapter: Zha (Zh) 42 - They agreed upon Zuhayr bin Rafi'. Chapter: Ayn (A) 43 - (3) They agreed on narrating from Abdullah bin Uthman, who is Abu Bakr Al-Siddiq * and on Umar bin Al-Khattab",
    "foot_note": "1. 41 - \"bin Al-Hajjaj\" is from T, S, K, F / \"Ashyam bin Abi\" in Y, H: \"Ashyam Abi\". \n2. The phrase \"bin\" (son of) should correctly be: Abi (father of), or: Walid (father of); because Abu Malik is Sa'd bin Tariq bin Ashyam, and the Kunya of his father Tariq is: Abu Abdullah. \n3. 43 - \"ittafaqa fi\" is not in T, S, K / \"ikhraj\" is from Y, H / \"ikhraj Abdullah\" in H: \"ikhraj Abi Bakr Abdullah\" / \"wa huwa\" is from F / \"Abu Bakr\" in Y: \"bin Abi Bakr\", in H: \"Abi Quhafah\" / \"wa fi\" is from F, in Y, H: \"wa\", and the conjunction 'waw' between names is not in T, S, K / Abdullah bin Ja'far precedes Ibn Abbas in H / Abdullah bin Umar comes before Abdul Rahman bin Awf in F / \"bin Al-Awwam\" is from T, S, K, F / \"wa Abdullah bin Zayd\" in T: \"Abd bin Zayd\" / \"Mughaffal\" is from T, S, K, H, in Y: \"Ma'qil\", name missing from F / \"Buhaynah\" in Y: \"Anbah\", in H: \"Ghaniyah\" / \"wa Abdullah bin Busr\" came after Abu Musa Al-Ash'ari in H / \"Busr\" in T, K, F, Y: \"Bashir\", in S: \"Bishr\" / \"Abdullah bin Amr\" is not in H, in Y came after subsequent additional names / \"bin Al-As\" is from Y / \"wa Abdullah bin Qays\" in K, F: \"bin Qays\" / \"Abi Musa\" in T, S, K: \"Abu Musa\" / \"Samurah wa Abdul Rahman bin\" in F: \"Samurah bin\" / \"Abza\" in T, S: \"Atwa\" / \"wa Abdul Rahman bin Sa'd\" in K: \"Abdul Rahman bin Amr bin Sa'd\", in F: \"wa Abdul Rahman bin Samurah bin Abdul Rahman bin Abi Bakr Al-Siddiq wa Abdul Rahman bin Amr bin Sa'd\" / \"Abi Humayd\" in T, S, K: \"Abu Humayd\" / \"Al-Sa'idi\" in T: \"Al-Sa'id\" / \"wa Abi Hurayrah\" in T, S, K: \"Abu Hurayrah\", in F: \"wa Abdul Rahman bin Hurayrah\" / \"wa ismuhu Abd\" not in F, in Y, H: \"ismuhu Abd\" / \"Hatim wa Al-Ala\" in T, K: \"Hatim bin Amr Al-Ala\", in F: \"Hatim bin Amr wa Al-Ala\", in S: \"Hatim bin Amr bin Al-Ala\" / \"wa Uqbah ... Al-Ansari\" is not in Y / \"Abi Mas'ud\" in T, S, K: \"Abu Mas'ud\" / \"wa Umar bin Abi Salamah\" came after Abu Al-Darda in Y, H, in K: \"Amr bin Abi Salamah\", in F: \"wa Amr bin Abi Salamah\" / \"bin Umayyah\" in F: \"bin Amr bin Umayyah\" / \"Al-Damri\" is from Y, H / \"Al-As\" in K, F: \"Al-Asi\" / \"wa Amr bin Awf wa Uwaymir\" in T, S: \"Umar bin Awf Awf bin Malik Uwaymir\", in K: \"Umar bin Awf bin Malik Uwaymir\", in F: \"wa Umar bin Awf bin Malik wa Uwaymir\" / \"Abi Al-Darda\" in T, S, K: \"Abu Al-Darda\" / \"Radhiya Allahu Anhum\" is from T, S, K, F.",
    "book_id": "597",
    "new_page_number": 44
  },
  {
    "serial_number": "5531803",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 48,
    "volume_number": 1,
    "text": "* and Uthman bin Affan * and Ali bin Abi Talib * and Abdul Rahman bin Awf * and Abdullah bin Abbas * and Abdullah bin Ja'far bin Abi Talib * and Abdullah bin Umar bin Al-Khattab * and Abdullah ibn Mas'ud * and Abdullah bin Al-Zubayr bin Al-Awwam * and Abdullah bin Salam (1) * and Abdullah bin Zayd ibn Asim * and Abdullah bin Mughaffal * and Abdullah ibn Buhaynah * and Abdullah bin Abi Awfa * and Abdullah bin Busr * and Abdullah bin Amr bin Al-As * and Abdullah bin Qays Abu Musa Al-Ash'ari * [ (2) ] and Abdul Rahman bin Samurah * and Abdul Rahman bin Abi Bakr Al-Siddiq *",
    "foot_note": "1. Above it in K: \"With light Lam (single L)\", and in footnote F: \"Lightened Lam\". \n2. [] Added here in Y, H: \"and Abdullah bin Zayd Al-Ansari\". He is Abdullah bin Zayd bin Asim mentioned just before. Then mentioned after him in H is Abdullah bin Yazid Al-Ansari coming in Bukhari's unique narrations. Then added in Y: \"and Abdullah bin Malik ibn Buhaynah\". He is Abdullah ibn Buhaynah mentioned just before, and Buhaynah is his mother. Then mentioned in it after him is Abdullah bin Amr bin Al-As mentioned just before. Then added in it: \"and Abdullah bin Al-Shammari, and he is Abdullah bin Waqdan\". His saying: \"Al-Shammari\" is correctly: Al-Sa'di. Al-Bukhari and Muslim did not narrate anything from his Musnad, but narrated his narration from Umar bin Al-Khattab. Then added in it: \"and Abdullah bin Amir bin Rabi'ah\". He is among those born during the time of the Prophet, peace and blessings be upon him. Al-Bukhari and Muslim did not narrate anything from his Musnad, but narrated his narration from his father and others. Al-Daraqutni mentioned him in the trustworthy Tabi'in whose narration is authentic in the two Sahihs (1/189, 2/138). Then added in Y, H: \"and Abdullah bin Abd Al-Asad Abu Salamah, Muslim narrated for him, from Umm Salamah, from him.\" Al-Bukhari and Muslim did not narrate anything from his Musnad nor from his narration, but he is mentioned in both in several hadiths. Al-Tirmidhi, Al-Nasa'i, and Ibn Majah narrated from Abu Salamah raised to the Prophet: \"If a calamity strikes one of you...\", and Muslim narrated it from the Musnad of Umm Salamah.",
    "book_id": "597",
    "new_page_number": 45
  },
  {
    "serial_number": "5531804",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 49,
    "volume_number": 1,
    "text": "and Abdul Rahman bin Abza (1) * and Abdul Rahman bin Sa'd Abu Humayd Al-Sa'idi * and Abu Hurayrah Al-Dawsi, and his name is: Abd * and Ubadah bin Al-Samit * and Amir bin Rabi'ah * and Al-Abbas bin Abd Al-Muttalib * and Adi bin Hatim * and Al-Ala bin Al-Hadrami * and Itban bin Malik * and Imran ibn Husayn * and Uqbah bin Amr Abu Mas'ud Al-Ansari * and Uqbah bin Amir Al-Juhani * and Urwah Al-Bariqi * and Ammar bin Yasir * and Awf bin Malik * and Umar bin Abi Salamah * and Amr ibn Umayyah Al-Damri * and Amr bin Al-As * and Amr bin Awf * and Uwaymir Abu Al-Darda * [ (2) ] and Aisha bint Abi Bakr. May Allah be pleased with them. 44 - (3) Muslim was unique in [narrating from] Utbah bin Ghazwan * and Iyad bin Himar * and Umarah bin Ruwaybah *",
    "foot_note": "1. Muslim did not narrate anything from his Musnad, but narrated several hadiths from his narration. \n2. [] Added here in Y, H: \"and A'idh bin Amr Al-Muzani\". Muslim narrated for him (1830, 2504), and Al-Bukhari narrated (4176) from his saying as suspended, and did not narrate anything from his Musnad nor from his narration. \n3. 44 - \"wa infarada\" in T, S, K: \"infarada\" / \"bi-Utbah bin Ghazwan\" in S: \"bi-Utaybah bin Azwan\" / \"wa Iyad\" in K, F: \"wa Ayyash\" / \"Himar\" in F: \"Jumar\" / \"wa Umarah\" in Y: \"wa Ammar\", in T: \"wa Ubadah\" / \"wa Umayr\" in H: \"wa Umar\" / \"Akhtab\" in Y: \"Al-Akhtab\" / Utbah bin Ghazwan repeated in T, S after Amr ibn Akhtab / \"bin Shurayh\" is from Y, H, in K, F: \"bin As'ad\" / \"wa Adi\" in S: \"wa Abdi\" / \"Al-Kindi\" is from T, S, K, F / \"Al-As\" in T, S: \"Al-Asi\" / \"wa Abd Al-Muttalib\" in T, S, K: \"Abd Al-Muttalib\" and likewise the conjunction 'waw' dropped between following names therein, and correction mark \"sahh\" placed between every two names in S / \"wa Abdul Rahman bin Uthman ... Rabi'ah\" is not in Y / \"Al-Abidi\" is from Y, in H: \"Al-Ghamidi\" / \"Jahm\" in T, S, K, F: \"Ja'far\".",
    "book_id": "597",
    "new_page_number": 46
  },
  {
    "serial_number": "5531805",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 50,
    "volume_number": 1,
    "text": "[ (1) ] and Umayr, freed slave of Abi Al-Lahm * and Amr bin Hurayth (2) * and Amr bin Akhtab * and Arfajah ibn Shurayh * and Adi bin Amirah Al-Kindi * and Uthman bin Abi Al-As * and Abd Al-Muttalib bin Rabi'ah * and Abdul Rahman bin Uthman Al-Taymi (3) * and Abdullah bin Rabi'ah (4) * and Abdullah bin Al-Sa'ib (5) * and Abdullah bin Al-Shikhkhir * and Abdullah bin Al-Musayyib Al-Abidi (6) * and Abdullah bin",
    "foot_note": "1. [] Added here in Y, H: \"and Amr bin Abasah Al-Sulami\". \n2. Mentioned in Y, H in what they agreed upon. Al-Bukhari did not narrate anything from his Musnad, but narrated several hadiths from his narration. \n3. Attributed to Al-Daraqutni by: Ibn Al-Jawzi in Al-Talqih (p. 203), and he named him: Abdullah bin Uthman, and in Ibn Abi Al-Fawaris (38): \"Abdullah bin Uthman\", and the correct in both is: Abdul Rahman bin Uthman. \n4. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (38), and Ibn Al-Jawzi in Al-Talqih (p. 203), and I did not find a mention of him in the two Sahihs. \n5. Al-Bukhari narrated his hadith before 775 as suspended. \n6. Ibn Hajar said in Al-Taqrib: \"He is an illusion of whoever mentioned him among the Companions.\" Muslim did not narrate anything from his Musnad, but narrated (455) his narration from Abdullah bin Al-Sa'ib.",
    "book_id": "597",
    "new_page_number": 47
  },
  {
    "serial_number": "5531806",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 51,
    "volume_number": 1,
    "text": "Unays (1) * [ (2) ] and Amir bin Hudhayfah, nicknamed Abu Jahm (3) * [ (4) ] and Amir bin Wathilah Abu Al-Tufayl. 45 - (5) Al-Bukhari was unique in [narrating from] Abdullah bin Zam'ah (6) * and Abdullah bin Tha'labah bin Su'ayr * and Abdullah",
    "foot_note": "1. Al-Bukhari narrated his hadith before 7481 as suspended. \n2. [] Added here in Y, H: \"and Abdullah bin Sarjis\". \n3. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (38). Muslim did not narrate anything from his Musnad nor narration, but he (556) and Al-Bukhari (373, 752, 5817) narrated from Aisha regarding the Khamisah: \"Take it to Abu Jahm.\" \n4. [] Added here in Y, H: \"and Abdullah bin Safwan, narrated from: Hafsah and Umm Salamah, Mothers (in Y: Mother) of the Believers, mentioned by Al-Hakim\". His companionship is disputed. Muslim did not narrate anything from his Musnad, but narrated (2882, 2883) his narration from the Mothers of the Believers: Umm Salamah and Hafsah. Al-Hakim mentioned him in Al-Sahabah (2/59), and Al-Daraqutni mentioned him in the trustworthy Tabi'in whose narration is authentic in Muslim (2/134). \n5. 45 - \"Zam'ah\" in T, S, K, F: \"Rabi'ah\" / \"wa Abdullah bin Hisham\" in T, S, K: \"wa bi-Abdullah bin Hisham\" / \"jadd\" in T, S, K, F: \"bin\" / \"bin Ma'bad\" is from Y, H / \"Abi Abs bin Jabr\" in H: \"bin Abi Abs ibn Jabr\", in T, S, K, F: \"bin Isa\" / \"wa bi-Abi Amir\" in Y, H: \"wa Abi Amir\" / \"wa ismuhu\" is not in H / \"wa yuqal Amr\" is from T, S, in K, F: \"wa yuqal lahu Amr\" / \"wa bi-Abi Ubaydah\" in K, Y, H: \"wa Abi Ubaydah\" / \"wa bi-Uqbah\" in Y, H: \"wa Uqbah\", in S: \"wa bi-Utaybah\" / \"bin Al-Harith\" in T: \"Al-Harith\", in H: \"bin Amir bin Abdullah wa Uqbah bin Al-Harith\" / \"wa bi-Amr\" in Y, H: \"wa Amr\" / \"Taghlib\" in Y: \"Tha'labah\", in K, F: \"Tha'lab\" / Uqbah bin Al-Harith repeated in T, S, K, F before Asim bin Thabit / \"bin Abi Al-Aqlah\" in H: \"bin Al-Aflah\", in T, S, K, F: \"bin Al-Aqlah\" / \"wa Al-Adda\" in K: \"wa Al-Adi\", in F: \"wa Al-Adawi\", in H: \"wa Al-Abbas\" / Blank space amount of a word between \"hadith\" and \"bila\" in Y. \n6. Muslim also narrated for him (2855).",
    "book_id": "597",
    "new_page_number": 48
  },
  {
    "serial_number": "5531807",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 52,
    "volume_number": 1,
    "text": "ibn Hisham, grandfather of Zuhrah bin Ma'bad * and Abdullah bin Yazid Al-Ansari (1) * and Abdul Rahman Abu Abs bin Jabr (2) * and Abu Amir Al-Ash'ari (3), and his name is: Ubayd, and it is said: Amr (4) * and Abu Ubaydah bin Al-Jarrah Amir bin Abdullah (5) * and Uqbah bin Al-Harith * and Amr bin Taghlib * and Abu Raja Imran Al-Utaridi, and he is a Mukhadram (6) * and Amr bin Salimah Al-Jarmi (7) * and Amr ibn Al-Harith bin Al-Mustaliq (8) * and Asim bin Thabit bin Abi Al-Aqlah (9) * and Al-Adda bin ...",
    "foot_note": "1. Not mentioned in Y, and mentioned in H under agreed upon. Al-Bukhari narrated for him (2474, 5516), and he (1022) and Muslim (1254) narrated from his action as suspended. Al-Daraqutni mentioned him in the trustworthy Tabi'in whose narration is authentic in Al-Bukhari (1/189), perhaps because he is among the younger Companions. \n2. Muslim narrated (1801) from Jabir the story of Abu Abs bin Jabr killing Ka'b bin Al-Ashraf. \n3. Al-Bukhari narrated his hadith (5590) suspended, with doubt between him and Abu Malik Al-Ash'ari. \n4. The one whose name is said to be Amr is Abu Malik Al-Ash'ari.. \n5. Muslim narrated his hadith (1935). Al-Bukhari did not narrate anything from his Musnad nor his narration, but he is mentioned in both in several hadiths. \n6. His companionship is not established. Al-Daraqutni mentioned him in the trustworthy Tabi'in whose narration is authentic in the two Sahihs (1/271, 2/187). Al-Daraqutni only mentioned him here because he has a hadith in Al-Bukhari that he linked (asnad) to the time of the Prophet, peace and blessings be upon him. \n7. Al-Bukhari did not narrate anything from his Musnad, but narrated (4302) his narration from his father. \n8. Mentioned in Y, H under agreed upon, and in H: \"and Amr bin Al-Harith Al-Mustaliqi\". Al-Bukhari narrated for him (2739 and others), but I did not find a mention of him in Muslim. \n9. Al-Bukhari did not narrate anything from his Musnad nor narration, but narrated (3045 and others) from Abu Hurayrah the story of Quraysh capturing Asim bin Thabit and the members of the expedition with him.",
    "book_id": "597",
    "new_page_number": 49
  },
  {
    "serial_number": "5531808",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 53,
    "volume_number": 1,
    "text": "Khalid, a suspended (Ta'liq) narration, a hadith without chain (1). Chapter: Fa (F) 46 - (2) They agreed upon Al-Fadl bin Abbas * and Umm Hani, and her name is: Fakhitah bint Abi Talib * and Fatimah daughter of the Messenger of Allah, peace and blessings be upon him, and may Allah be pleased with her. 47 - Muslim was unique in [narrating from] Fadalah bin Ubayd * and Fatimah bint Qays (3) [ (4) ]. Chapter: Qaf (Q) 48 - (5) They agreed upon the hadith of Qays bin Sa'd. 49 - (6) Muslim was unique in [narrating from] Qutbah bin Malik * and Qabisah bin Mukhariq. 50 - Al-Bukhari was unique in [narrating from] Qudamah bin Maz'un (7) * and Qatadah bin Al-Nu'man.",
    "foot_note": "1. It is Al-Bukhari's saying before Hadith 2039: \"And it is mentioned from Al-Adda bin Khalid, he said: The Prophet, peace and blessings be upon him, wrote for me.\" \n2. 46 - \"Al-Fadl\" in S: \"Al-Fudayl\" / \"Abbas\" in Y: \"Al-Abbas\" / \"wa radhiya 'anha\" is from H. \n3. Al-Bukhari narrated (5322) from Aisha the story of Fatimah's divorce, but did not narrate anything from her Musnad nor from her narration. \n4. [] Added here in H: \"and Fatimah bint Abi Hubaysh\". Muslim did not narrate anything from her Musnad, but he and Al-Bukhari narrated from Aisha her story regarding Istihadah (irregular bleeding). \n5. 48 - \"hadith\" is from T, S, K, F. \n6. 49 - \"wa Qabisah\" in T, S: \"wa Qastah\" / \"Mukhariq\" in Y, H: \"Al-Mukhariq\". \n7. Al-Bukhari did not narrate anything from his Musnad, but narrated (4011) from Abdullah bin Amir bin Rabi'ah that Qudamah witnessed Badr, and that Umar employed him over Bahrain.",
    "book_id": "597",
    "new_page_number": 50
  },
  {
    "serial_number": "5531809",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 54,
    "volume_number": 1,
    "text": "Chapter: Kaf (K) 51 - They agreed upon Ka'b bin Malik * and Ka'b bin Ujrah. 52 - (1) Muslim was unique in [narrating from] Abu Marthad Kannaz bin Husayn Al-Ghanawi, a Badr warrior * and Abu Al-Yasar Ka'b bin Amr * and Ka'b bin Asim Abu Malik Al-Ash'ari (2). Chapter: Lam (L) 53 - Muslim narrated from Umm Al-Fadl, and her name is: Lubabah, and Al-Bukhari did not narrate anything for her (3). Chapter: Mim (M) Whoever's name is Muhammad, we have mentioned him in the beginning of what we mentioned. 54 - (4) They agreed upon Malik bin Al-Huwayrith * and Malik bin Rabi'ah Abu Usayd Al-Sa'idi * and Malik bin",
    "foot_note": "1. 52 - \"Kannaz\" in K, F: \"Kinan\" / \"Husayn\" in Y, H: \"Hisn\" / \"Al-Ghanawi\" in F: \"Al-Fanawi\" / \"Al-Yasar\" in Y: \"Al-Sukkr Bishr\" / \"wa Ka'b\" in T, S: \"wa bi-Ka'b\" / \"Abi Malik\" is from T, S, K, F. \n2. He is different from Abu Malik Al-Ash'ari whose hadith Al-Bukhari narrated with doubt between him and Abu Amir Al-Ash'ari. \n3. Placed in Y, H under what they agreed upon, so it appeared in them: \"They agreed upon Umm Al-Fadl, and her name is: Lubabah (in Y: Umm Lubabah)\". Al-Bukhari narrated for her (763, 4429, 1658 and others) and Muslim (462, 1123, 1451). Al-Baji said (3/1287): \"Sheikh Abu Al-Hasan said: Muslim was unique in narrating from Umm Al-Fadl Lubabah, and Al-Bukhari did not narrate anything for her, and I think he forgot or interpreted.\" \n4. 54 - \"fi awwal\" in Y, H: \"awwal\" / \"dhakarna\" in Y, H: \"dhakarnahu\" / \"Abi Usayd\" in Y: \"Abi Asad\", in T, K, F: \"bin Usayd\", in S: \"Usayd\" / \"wa akhihi\" in K: \"wa akhuhu\", and in footnote S: \"in the original: wa akhuhu\" / \"wa Mughirah\" in K, F: \"wa Al-Mughirah\" / \"wa Mu'ayqib\" in Y, F: \"wa Mu'ayqab\" / \"Al-Aswad\" in S, H: \"wa Al-Aswad\" / \"tabannahu\" in F: \"bayynahu\" / \"wa abuhu\" in Y: \"abuhu\", in T: \"wa Abu\" / \"wa Mu'awiyah\" in T, S, K, F: \"bin Mu'awiyah\".",
    "book_id": "597",
    "new_page_number": 51
  },
  {
    "serial_number": "5531810",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 55,
    "volume_number": 1,
    "text": "Sa'sa'ah * and Al-Miswar bin Makhramah * and Mahmud bin Al-Rabi' (1) * and Mujashi' bin Mas'ud * and his brother Mujalid * and Mu'adh bin Jabal * and Musayyib bin Hazn * and Mughirah bin Shu'bah * and Mu'ayqib * and Ma'qil bin Yasar * and Miqdad bin Amr - Al-Aswad adopted him, and his father is: Amr - * and Mu'awiyah bin Abi Sufyan * and Maymunah bint Al-Harith. 55 - (2) Muslim was unique in [narrating from] Mu'awiyah bin Al-Hakam * and Muti' bin Al-Aswad * and Al-Mustawrid Al-Fihri. [ (3) ] 56 - (4) Al-Bukhari was unique in [narrating from] Al-Miqdam bin Ma'dikkarib * and Mirdas Al-Aslami * and Ma'n bin Yazid Al-Sulami * and Marwan bin Al-Hakam. Chapter: Nun (N) 57 - (5) They agreed upon Abu Barzah Nadlah bin Amr Al-Aslami, and it is said: Ibn Ubayd * and Al-Nu'man bin Bashir",
    "foot_note": "1. Muslim did not narrate anything from his Musnad, but narrated several hadiths from his narration. Al-Daraqutni mentioned him in the trustworthy Tabi'in whose narration is authentic in Al-Bukhari (1/361), perhaps because most of his narration is from the Companions, and he is among their younger ones. \n2. 55 - \"wa Muti'\" in Y: \"wa bi-Muti'\" / \"wa Al-Mustawrid\" in T, S, K, F: \"wa bi-Al-Miswar\". \n3. [] Added here in Y, H: \"and Ma'mar bin Abdullah Al-Adawi (in Y: Al-Udhri)\". \n4. 56 - Bukhari's unique entries preceded Muslim's in Y / \"wa bi-Mirdas\" in Y, H: \"wa Mirdas\" / Marwan precedes Ma'n in H / \"wa bi-Ma'n\" in T: \"wa bi-Mughni\", in Y, H: \"wa Ma'n\" / \"Al-Sulami\" in T, S, K, F, H: \"Al-Aslami\". \n5. 57 - Chapter Nun follows Chapter Waw in H / \"Ubayd\" in T, S, K, F: \"Umayr\" / \"Al-Ansari\" is from T, S, K, F / \"wa Nawfal\" in K, F: \"wa Nufayl\".",
    "book_id": "597",
    "new_page_number": 52
  },
  {
    "serial_number": "5531811",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 56,
    "volume_number": 1,
    "text": "Al-Ansari * [ (1) ] and Nawfal bin Mu'awiyah (2) * and Al-Nu'man bin Muqarrin (3) * and Nusaybah Umm Atiyyah Al-Ansariyyah. 58 - (4) Muslim was unique in [narrating from] Nafi' bin Utbah * and Al-Nawwas bin Sam'an * and Nubayshah - a man's name. Chapter: Waw (W) 59 - (5) They agreed upon Abu Juhayfah, and his name is: Wahb * and on Wathilah bin Al-Asqa'. 60 - (6) Muslim was unique in narrating from Wa'il bin Hujr, from the narration of his son Alqamah bin Wa'il alone from him (7). 61 - Al-Bukhari was unique in [narrating from] Wahshi bin Harb.",
    "foot_note": "1. [] Added here in Y, H: \"and Nufay' Abu Bakrah Al-Thaqafi\". \n2. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (49), and Ibn Al-Jawzi in Al-Talqih (p. 205). Al-Bukhari (3602) and Muslim (2886) narrated a hadith \"like the hadith before it,\" but did not quote his text. \n3. Al-Bukhari narrated for him and Al-Mughirah bin Shu'bah in one hadith (3159), and Muslim narrated for him (1731) within a hadith of Buraydah bin Al-Husayb. \n4. 58 - \"wa bi-Al-Nawwas\" in H: \"wa Al-Nawwas\" / \"wa bi-Nubayshah\" in H: \"wa Nubayshah\", in K, F: \"wa bi-Nubaythah\", and in S above it is the correction mark \"sahh\". \n5. 59 - \"Abi\" is from K, F, Y, H / \"Juhayfah\" in K, F: \"Wahibah\" / \"Wathilah\" in F: \"Wa'ilah\" / \"bin\" is not in Y. \n6. 60 - \"bi-ikhraj\" in T, S, K: \"fi ikhraj\" / \"anhu\" is from T, S, K, F. \n7. However, it came in Muslim (401) from Abd Al-Jabbar bin Wa'il, from Alqamah bin Wa'il and a freed slave of theirs, that they both narrated to him from his father Wa'il bin Hujr.",
    "book_id": "597",
    "new_page_number": 53
  },
  {
    "serial_number": "5531812",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 57,
    "volume_number": 1,
    "text": "Chapter: Ha (H) 62 - (1) They agreed upon Abu Burdah Hani' bin Niyar * and upon Umm Salamah Hind bint Abi Umayyah, wife of the Prophet, peace and blessings be upon him. 63 - Muslim was unique in [narrating from] Hisham bin Amir * and Hisham bin Hakim (2). Chapter: Ya (Y) 64 - They agreed upon Ya'la bin Umayyah. Chapter: Kunyas (Nicknames) 65 - (3) They agreed upon Abu Jahm (4) bin Al-Harith * and Abu Bashir. 66 - (5) Muslim was unique in [narrating from] Abu Habbah Al-Badri (6). [ (7) ]",
    "foot_note": "1. 62 - \"Burdah\" in T, S: \"Barzah\" / \"Niyar\" in Y, F: \"Dinar\" / \"wa fi\" in H: \"wa\" / \"wa sallam\" in Y: \"wa sallam al-salam\". \n2. Al-Bukhari narrated (2419 and others) from Umar bin Al-Khattab the story of his disagreement with Hisham bin Hakim regarding the recitation of Surah Al-Furqan. \n3. 65 - \"Bab\" (Chapter) is from T, S, K, F / \"Jahm\" in Y: \"Al-Jahm\" / \"bin Al-Harith\" is not in Y / \"Bashir\" in T, S: \"Yasir\". \n4. Thus in Muslim: \"Jahm\", correctly: Juhaym - in diminutive form -, as it is in Al-Bukhari and others. \n5. 66 - \"Habbah\" in K, F: \"Hayyah\" / \"Al-Badri\" in S: \"Al-Barzi\". \n6. Mentioned in Y, H under agreed upon. Al-Bukhari narrated for him (349, 3342) and Muslim (163). Attributed to Al-Daraqutni in Muslim's unique narrations by: Ibn Abi Al-Fawaris (60), and Ibn Al-Jawzi in Al-Talqih (p. 205), and in them: \"Abu Hayyah\", with Ya, which is an opinion. \n7. [] Added here in Y, H: \"and Abu Rifa'ah Al-Adawi, and he was mentioned previously in Chapter Ta.\" His name is: Tamim bin Usayd.",
    "book_id": "597",
    "new_page_number": 54
  },
  {
    "serial_number": "5531813",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 58,
    "volume_number": 1,
    "text": "67 - (1) Al-Bukhari was unique in [narrating from] Abu Sa'id bin Al-Mu'alla, and he was mentioned previously in Chapter Ra (2) * and Abu Dawud (3). [ (4) ] Chapter: Women with Kunyas 68 - (5) They agreed upon Umm Sulaym (6) * and Umm Kulthum bint Uqbah bin Abi Mu'ayt * and Umm Atiyyah (7) * and Umm Qays bint Mihsan * and Umm Sharik * and Umm Haram bint Milhan. [ (8) ]",
    "foot_note": "1. 67 - \"Bab\" is from T, S, K, F / \"Al-Ra\" in H: \"Al-Riwayat\", and what follows is missing in F until the end of the book / \"wa bi-Abi Dawud\" is from T, S. \n2. His name is: Rafi' bin Al-Mu'alla. \n3. Not mentioned in Y, H, K. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (59), and Ibn Al-Jawzi in Al-Talqih (p. 205). He is Abu Dawud Al-Mazini Al-Ansari Al-Badri. I did not find a mention of him in the two Sahihs. \n4. [] Added here in Y, H: \"and Abu (in H: Abu) Amir Al-Ash'ari, and Abu (in H: Abu) Al-Shamus Al-Balawi, and Abu (in H: Abu) Las Al-Khuza'i (in Y: Al-Abtar Al-Judhami)\". Abu Amir Al-Ash'ari was mentioned previously in Chapter Ayn, and he said there: \"His name is: Ubayd, and it is said: Amr.\" Al-Bukhari narrated the hadith of Abu Al-Shamus (3378) suspended, coupled with Sabrah bin Ma'bad. He also narrated the hadith of Abu Las before 1468 suspended. \n5. 68 - \"Qays\" in S: \"Qaysar\". \n6. She is Al-Rumaysa mentioned previously in Muslim's unique narrations in Chapter Ra. \n7. She is Nusaybah mentioned previously in Chapter Nun. \n8. [] Added here in Y, H: \"and Umm Habibah bint Jahsh, mentioned by Al-Hakim.\" I did not find a mention of her in Al-Bukhari. Muslim narrated (334) from Aisha the story of her Istihadah, but did not narrate anything from her Musnad nor from her narration. Al-Hakim mentioned her in Al-Sahabiyyat (2/97).",
    "book_id": "597",
    "new_page_number": 55
  },
  {
    "serial_number": "5531814",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Names of the Companions Agreed Upon by Muhammad bin Isma'il Al-Bukhari and Muslim bin Al-Hajjaj bin Muslim Al-Qushayri, May Allah Have Mercy on Them, and What Each of Them Narrated Uniquely Without the Other",
    "edition": "First Edition, 1433 AH - 2012 CE",
    "publisher": "Dar Al-Asimah - Riyadh",
    "page_number": 59,
    "volume_number": 1,
    "text": "69 - (1) Muslim was unique in [narrating from] Umm Mubashir * and Umm Al-Husayn * and Umm Hisham bint Harithah, sister of Amrah. 70 - (2) Al-Bukhari was unique in [narrating from] Umm Ruman (3) * and Umm Khalid bint Khalid bin Sa'id * and Umm Al-Ala (4) * and Umm Salit (5). 71 - (6) This is the totality of what they both narrated of the hadith of the Companions, men and women, may Allah be pleased with them, in both their books.",
    "foot_note": "1. 69 - \"Mubashir\" in S: \"Muyassar\". \n2. 70 - \"Ruman\" in T: \"Rumman\" / \"bint Khalid bin Sa'id\" is from Y, H. \n3. Muslim narrated (1422) from Aisha the story of Umm Ruman preparing her for her marriage. \n4. Muslim narrated (936) from Umm Atiyyah that Umm Al-Ala was among those who pledged allegiance not to wail, and she fulfilled it. \n5. Attributed to Al-Daraqutni by: Ibn Abi Al-Fawaris (65), Al-Baji (3/1301), and Ibn Al-Jawzi in Al-Talqih (p. 207). Al-Bukhari did not narrate anything from her Musnad nor from her narration, but narrated (2881 and others) from Umar bin Al-Khattab that Umm Salit used to carry waterskins on the day of Uhud. \n6. 71 - \"hadith\" is from T, S, K, in Y: \"min\" / \"radhiya Allahu anhum\", \"jami'an\" - the second one - is from T, S. At the end of T: \"And Allah is the Helper, He is sufficient for me and the best Disposer of affairs, completed on 13 Dhu Al-Qa'dah, on a Friday, at the time of Asr, year 968.\" At the end of S: \"And Allah is the Helper, He is sufficient for me and the best Disposer of affairs, its end, and praise be to Allah, Lord of the Worlds, and may Allah bless our Master Muhammad, and his family, and grant abundant peace, completed.\" At the end of K: \"And Allah is the Helper, and praise be to Allah, Lord of the Worlds, and may Allah bless our Master Muhammad, and his family, and his companions, and grant peace, all of them. Written on the eighth of Jumada Al-Thani, year eighty-eight, by the hand of the one in need of the mercy of his Strong Lord: Isma'il bin Muhammad Al-Maliki Al-Adawi, may Allah treat him with His hidden kindness, Amen.\" At the end of Y: \"And praise be to Allah.\" At the end of H: \"And Allah knows best, the section on the Companions from whom the two Sheikhs or one of them narrated is completed, by the praise of Allah and His grace, and may Allah bless His Messenger, our Master Muhammad the Unlettered Prophet, and his family, and his companions, and grant peace, Sunday, one night remaining of Sha'ban, year 1320. Scribe: Zayn Al-Abidin Al-Arawi Al-Shah Abadi Al-Bihari.\"",
    "book_id": "597",
    "new_page_number": 56
  }
]