[
  {
    "text": "Adab al-Muwakalah (Etiquette of Eating with Others)\nAuthor: محمد بن محمد بن محمد الغزي العامري الدمشقي أبو البركات بدر الدين ابن رضي الدين\nYear: 984",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5439\nbook_title: آداب المواكلة\nbook_link: https://shamela.ws/book/466\nbook_id: 466\nauthor_name: محمد بن محمد بن محمد الغزي العامري الدمشقي أبو البركات بدر الدين ابن رضي الدين\nauthor_year: 984\nnickname: أبو البركات\nauthor_link: https://shamela.ws/author/651\nauthor_ID: 651\neditor: المحقق : عمر موسى باشا ، رئيس قسم اللغة العربية وآدابها - كلية الآداب ، جامعة دمشق\npublisher: دار ابن كثير للطباعة والنشر والتوزيع، دمشق ، بيروت\nedition: الأولى ، 1407 هـ - 1987 م\npages: 54\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4927441",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquettes, and Adhkar\nBook: Adab al-Muwakalah (Etiquette of Eating with Others)\nAuthor: Badr al-Din, Abu al-Barakat Muhammad bin Muhammad bin Muhammad al-Ghazzi (Deceased: 984 AH)\nInvestigator: Omar Musa Basha, Head of the Arabic Language and Literature Department - Faculty of Arts, University of Damascus\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nBook: Adab al-Muwakalah\nAuthor: Badr al-Din, Abu al-Barakat Muhammad bin Muhammad bin Muhammad al-Ghazzi (Deceased: 984 AH)\nInvestigator: Omar Musa Basha, Head of the Arabic Language and Literature Department - Faculty of Arts, University of Damascus\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nAuthor: Badr al-Din, Abu al-Barakat Muhammad bin Muhammad bin Muhammad al-Ghazzi (Deceased: 984 AH)\nInvestigator: Omar Musa Basha, Head of the Arabic Language and Literature Department - Faculty of Arts, University of Damascus\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nInvestigator: Omar Musa Basha, Head of the Arabic Language and Literature Department - Faculty of Arts, University of Damascus\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 3
  },
  {
    "serial_number": "4927442",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, and peace be upon His servants whom He has chosen.\nThis is a collection of faults; whoever knows them is an expert in the etiquette of eating with others. They number eighty-one faults, as we have transmitted them dispersedly, and Allah is the Grantor of success. They are:\n\n**Al-Hakkak (The Scratcher):**\nHe is the one who scratches his head and a spot on his body after washing his hands and before eating. It has been narrated by some that a man washed his hands with Al-Ma'mun, and the food was delayed, so his hand went to his head. Al-Ma'mun said to him, \"Wash your hand again.\" He washed it, then it wasn't long before his hand went to his beard. He said to him, \"Wash it again,\" and added, \"Nothing should follow the washing of the hand except the bread.\"\n\n**Al-Zahif (The Crawler):**\nHe is the one who, when the food is presented, crawls towards the table before the group [is ready]. Perhaps the arrangement of the food is not yet complete, or the host is anticipating the arrival of someone he expects. If those present crawl to the table",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 4
  },
  {
    "serial_number": "4927443",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "because of his crawling, he has marked himself with gluttony. If they hesitate to join him, he remains at the table alone and becomes embarrassed. Perhaps the person the host is expecting among his brothers is the one intended for that food, so if he rushes to beat him to it, his presence becomes burdensome to the host.\n\n**Al-Muja'wi' (The Starver):**\nHe is the host who keeps his fellow eaters waiting for his food to be ready until he starves them. It is told that Muhammad bin Abdullah bin Tahir was invited by a man from his companions to a banquet. He was meticulous about it and celebrated it. When Muhammad arrived, he asked for the food, but the host delayed him so that [the spread] would be complete and successive according to what he loved of abundance and grandeur, until the day passed and hunger touched Muhammad, spoiling his day. Later, Muhammad intended to travel, and this man saw him off. When he drew near to bid him farewell, he asked, \"Do you command anything?\" He said, \"Yes! Go and make your path on your return pass by Ahmad bin Yusuf the Scribe, and tell him: The Prince has sent me to you so you may teach me hospitality.\" He did so. When Ahmad heard this, he laughed and said to his servant, \"Bring what is present.\" He brought a large tray with three loaves of",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 5
  },
  {
    "serial_number": "4927444",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "the cleanest bread, and small bowls of *murri* (fermented sauce), vinegar, salt of the best quality, and what is taken from these varieties. He started eating. Then he brought a goose from his kitchen, and the cook followed it up with his dishes (Tabahajah), and another portion arrived from his harem's quarters, and some of his servants gifted him a bowl of sweets. Thus, the meal was organized with something elegant and light, without formality or waiting.\n\n**Al-Mushanni' (The Defamer):**\nHe is the one who places what he discards from his food, such as bones or date pits and the like, in front of his neighbor to defame him [by implying] he ate too much. It is told that two people who were bantering attended the table of some chiefs. Fresh dates were presented to them. One of them, every time he ate, placed the pit in front of the other until there gathered in front of him what was not in front of anyone else present. The first turned to the host and said, \"Do you not see, O Master, how much",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 6
  },
  {
    "serial_number": "4927445",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "fresh dates so-and-so has eaten! For in front of him are pits exceeding the group.\" His companion turned to him and said, \"As for me, may Allah amend you, I have eaten a lot of fresh dates as he said, but this fool has eaten the fresh dates with their pits!\" The group laughed, and the Defamer was embarrassed.\n\n**Al-Mutathaqil (The Sluggish/Delayer):**\nHe is the one who is invited and accepts, and his fulfillment is trusted, then he delays coming to the eager host until he starves him, starves his brothers, and spoils their mood. The recompense for this person, after prevailing over him with arguments and sending the messenger back to him, is for the brothers to proceed with eating without him, relying on [the fact] that he deserves it, to discipline him if he has any restraint, or to alert him if he has any intelligence. It has come in the tradition regarding answering the inviter and avoiding delay, his saying (peace be upon him): \"Whoever is invited to food, let him answer; if he is not fasting, let him eat, and if he is fasting, let him pray (supplicate).\" If the fasting person is commanded to answer, then what about the one not fasting, and the one who accepts but then delays?! This happened to Jahza al-Barmaki from a young man,",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 7
  },
  {
    "serial_number": "4927446",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "so he wrote to him:\n\"You delayed until you troubled the messenger,\nAnd until I grew weary of waiting.\nYou alienated your brothers who were ready,\nAnd distressed them like the youths of the day.\nYou ignited hunger in their bowels,\nWith a fire that exceeds every fire.\"\nAnd it is said: Three things cause emaciation (or distress): A lamp that does not light, a slow messenger, and a table waiting for someone to come.\n\n**Al-Mudammi' (The Tear-Shedder):**\nHe is the one who takes hot food and does not wait for it to cool. He takes the bite, and his estimation of bearing its heat fails him, so his eyes tear up when his mouth burns. He may be forced to spit it out of his mouth or to swallow it with a gulp of cold water despite the burning it causes to his stomach.\n\n**Al-Muballi' (The Swallower):**\nHe is the one who does not chew the morsel in his mouth properly before swallowing it, prior to",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 8
  },
  {
    "serial_number": "4927447",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "it being fully ground. This, besides being one of the greatest signs of gluttony and greed, is harmful in two ways:\nFirst: If food is not finely ground by the molars, it provides less nutrition and strength.\nSecond: Burdening the stomach to digest what has not been crushed and whose parts have not separated. He might also choke, needing to drink water while eating, thus making the vessel greasy (if he drinks from a shared vessel).\n\n**Al-Muqatti' (The Cutter):**\nAlso called *Al-Qatta'*. He is the one who, when he takes a bite with his hand, finds it too large, so he bites off half of it, and dips the other half back into the food and eats it.\n\n**Al-Muba'bi' (The Babbler):**\nHe is the one who, if he wants to speak, does not wait until he swallows the bite; instead, he speaks while chewing, babbling like a camel. His speech can hardly be understood, especially with a large bite.\n\n**Al-Mufarqi' (The Popper):**\nHe is the one who does not close his lips when chewing, so a sound is heard",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 9
  },
  {
    "serial_number": "4927448",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "from his jaws [that can be heard] from the door of his house. Perhaps the food scatters from his jaws. The etiquette is that the person closest to him should not hear him.\n\n**Al-Rashshaf (The Sipper):**\nHe is the one who puts the morsel (or soup) in his mouth and sips it, so a sound is heard from him at the moment of swallowing that is hidden from no one.\n\n**Al-Daffa' (The Pusher):**\nHe is the one who, when he puts the bite in his mouth, inserts part of his index finger with it, as if pushing it in with it.\n\n**Al-Latta' (The Licker):**\nAlso called *Al-Lahhas*. He is the one who licks his fingers to remove the grease of the food before he finishes eating, then returns them to the food. As for after finishing, there is no harm in it, provided he does not return [to the communal dish]. The best of both conditions is to tend to the fingers by wiping them with whatever is used for wiping at any time, like the table napkin.\n\n**Al-Mi'tash (The Thirsty):**\nHe is the one who, if he gets thirsty while there is a bite in his mouth, does not wait",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 10
  },
  {
    "serial_number": "4927449",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "until he swallows it, then drinks. Rather, he holds it in his cheek, then drinks the water, then returns to chewing it.\n\n**Al-Mu'arrid (The Alluder):**\nHe is the one who alludes by mentioning what the host omitted from the foods, even in a story he tells. For in that, there is a kind of belittling of the host's ambition if he cannot provide it, and a burden on him if he undertakes to provide it at the time. Like one who eats rice with milk and says: \"This food is beneficial, and if eaten with sugar, it would be quick to digest and very nutritious.\" So the host becomes agitated and forced to bring sugar. Similarly, if there is a type of what he alluded to in the food, but it was little, the host needs to add more, and it embarrasses him if he doesn't have it.\nIt is told that Al-Ma'mun asked Ali bin Hisham to prepare a banquet for him, and he did not give him",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 11
  },
  {
    "serial_number": "4927450",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "the time in which he could celebrate/prepare [properly] for his invitation. When Al-Ma'mun entered Ali's house, he saw equipment of beautification that pleased him. He said, \"I did not think that anyone could reach this extent from Al-Ma'mun.\" Ali said, \"O Commander of the Faithful, Ali sensed that we would surprise him, so he prepared for us, and borrowed.\" Ali did not understand his intent, and thought he was going towards diminishing his chivalry, so he hastened and swore by Al-Ma'mun's head that he had not sought help from anyone in his preparation, nor borrowed anything.\nWhen they sat for the food, Al-Ma'mun winked at Abu Ahmad, the son of Al-Rashid. Abu Ahmad said, \"I desire marrow.\" So bowls of marrow were transported, and he ate and asked for more. When the cook sensed his intent, he said to the steward of Ali bin Hisham, \"Woe to you! It is not that; they only intended to mock the chivalry of our master",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 12
  },
  {
    "serial_number": "4927451",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "and his nobility, and we should not enable that. I have slaughtered everything I have and filled the bowls with their marrow, yet they are not satisfied. Nothing will fill their eyes except the marrow of the colt.\" Ali had a colt that outstripped the wind, which he had bought for ten thousand dirhams. The steward said to him, \"Why are you waiting with it?\" He said, \"We should ask his permission.\" He replied, \"This is not the time for permission!\" So the cook hastened to the foal, slaughtered it, removed its bones, boiled them, and extracted the marrow. He began supplying them with bowls of marrow while they ate, and Abu Ahmad asked for more until Al-Ma'mun became shy and winked at Abu Ahmad, so he stopped.\n\n**Al-Naffakh (The Blower):**\nHe is the one who takes a hot bite and blows on it with his mouth seeking to cool it down. His path should have been to refrain from the food until he could eat it.\n\n**Al-Mumtadd (The Stretcher):**\nHe is the one who eats from a dish far from him, so he needs",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 13
  },
  {
    "serial_number": "4927452",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "to extend his arm and shift towards it.\n\n**Al-Jarraf (The Scooper):**\nHe is the one who puts the bite on one side of the bowl and scoops with it to the other side.\n\n**Al-Muzaffir (The Greaser):**\nHe is the one who calls for water while eating and grabs the handle of the vessel. The etiquette is to wipe his fingers well with the napkin, then grab",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 14
  },
  {
    "serial_number": "4927453",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "the handle of the vessel with his pinky finger, or hold its base, or take the vessel with both pinky fingers and ring fingers together.\n\n**Al-Mudassim (The Greaser - of Sauce/Dip):**\nHe is the one who fills the [dipping] place with grease by dipping the meat into it.\n\n**Al-Mughthi (The Nauseating One):**\nHe is the one who fills his chin with grease due to not controlling his mouth or his hand when putting it in his mouth, so you see the grease dripping from his mustache. Or the one whose nostril clears its throat; sometimes he blows, sometimes he sniffs, and sometimes he blows his nose.\n\n**Al-Muqazziz (The Revolting One):**\nHe is the one who talks at the table about things that disgust the souls of his fellow eaters to hear, like someone who mentions news of the sick, those with diarrhea, boils, pus, vomit, feces, mucus, and the like. [Also] the one who frequently",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 15
  },
  {
    "serial_number": "4927454",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "blows his nose, clears his throat, spits, and wipes his eye when he sits to eat.\n\n**Al-A'ib (The Critic):**\nHe is the one who points out some defects of the food, saying: \"This is a roast that the griller burnt,\" or \"This is good Harisa (a meat and wheat dish), were it not brown,\" or \"This cooked dish has too much salt, or too little sourness or sweetness.\"\n\n**Al-Mustabidd (The Monopolizer):**\nHe is the one who monopolizes the spoon excluding his fellow eaters, or other things that run this course.\n\n**Al-Muhmil (The Neglectful):**\nHe is the one who does not observe the person next to him. The etiquette is to prefer him",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 16
  },
  {
    "serial_number": "4927455",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "with some of what is desirable, like meat and the like, and to offer him drink before himself when taking the vessel. As for the leader (head of the table), part of his etiquette in eating together is offering morsels to his fellow eaters.\n\n**Al-Jamali (The Camel-Like):**\nHe is the one who, out of fear of dripping broth on his clothes, extends his neck and stretches forward like a camel, so that what drips from his mouth falls on the table or the napkin.\n\n**Al-Wathib (The Jumper/Restless):**\nHe is the one who rises, jumps, and moves when placing the morsel, so that his turban almost falls off. He is also called *Al-Mukhtall* (The Imbalanced).\n\n**Al-Mukharrib (The Destroyer):**\nHe is the one who, if he eats from a dish that has nothing left but bones, eats any piece of meat he sees and the best of the food, and does not pay attention to others as if there is no one else at the food but him.\n\n**Al-Musaffif (The Arranger):**\nHe is the one who stands and rolls up his sleeves when the table arrives,",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 17
  },
  {
    "serial_number": "4927456",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "and arranges the bowls and foods, giving the impression that this is service for those present, while it is not so; rather, it is to look at the colors [of food] to place the good stuff in his place.\n\n**Al-Fuduli (The Meddler):**\nHe is the one who cannot control himself when he sees the roasted lamb, so he grabs it with his hands, tears it apart, and throws it piece by piece, thinking that he has done good and been kind to those present. In that, there is a burden on the host; perhaps he preferred to send half of it intact to someone he wants. It is - in general - one of the faults. Perhaps the intention of the doer is to gather the best meat in front of himself. He is also the one who hastens to break the bread and throws it on the table, and perhaps his intention by that is to gather the best of the broken pieces in front of himself. He is also the one who puts spices and salt in the bowl, perhaps spoiling it for the one eating with him due to excess salt, or because his fellow eater does not like salt, or he takes the *murri* or vinegar and the like and pours it on the Harisa and the like. Perhaps there is someone among those present who dislikes that because he is not used to it. The etiquette is not to go beyond fixing what he eats alone. The Arranger (*Al-Musaffif*) may also be called *Fuduli*.\n\n**Al-Tufayli (The Parasite/Uninvited Guest):**\nAl-Tufayli is well-known: He is the one who attends an invitation without being",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 18
  },
  {
    "serial_number": "4927457",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "invited, and intruding (Tatfil) is forbidden. Among what is narrated of the anecdotes of parasites regarding their terminologies for names of foods is that bread is named 'Jabir' (Comforter), the dining sheet 'Bisat al-Rahmah' (Carpet of Mercy), the cooking pot 'Umm al-Khayr' (Mother of Goodness), the bowls 'Ikhwan al-Safa' (Brethren of Purity), the foods 'Qut al-Qulub' (Nourishment of Hearts), rice 'Al-Sheikh al-Zahir' (The Backing Sheikh), Madira (sour milk stew) 'Qadi al-Qudah' (Chief Judge), Rishta with lentils 'Abd al-Rahim', the roasted tortured lamb 'Ibn al-Shahid' (Son of the Martyr), the chicken 'Umm Hafs', the young chickens 'Banat Na'sh' (Daughters of the Bier - a constellation), and the washbasin before food 'Bishr and Bashir', and it is said 'Al-Mubashshiran' (The Two Harbingers), and after food 'Munkar and Nakir', and it is said 'Al-Murjifan' (The Two Shakers).\nAmong their commandments is: If you are at a table, do not speak while eating. If someone speaks to you who must be spoken to, do not answer him except with 'Yes', for it",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 19
  },
  {
    "serial_number": "4927458",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "does not distract from eating. Someone said to a Tufayli, \"Advise me.\" He said, \"Do not encounter any food and lift your hand saying: 'Perhaps I will encounter better than it.'\" He said, \"Increase me.\" He said, \"If you find food, eat from it the eating of one who has never seen it, and stock up from it for Allah Almighty.\"\nAmong their stories is that a Tufayli came to a wedding but was prevented from entering. He went and took one of his sandals in his hands and took a toothpick to pick his teeth, and knocked on the door. The doorman said, \"Who is it?\" He said, \"I exchanged my sandal.\" So the door was opened for him, and he entered and ate with the people.\nIt is told that a Tufayli came to a banquet but was prevented from entering. He took a white piece of paper, folded it, sealed it with clay, and came to the door. He knocked and said, \"I have a letter for the owner of the house from a friend of his.\" So he entered and gave the paper to the owner of the house. When he saw the clay was wet, he said, \"I wonder at the wetness of the clay!\" He [the Tufayli] said, \"O my master! More amazing than that is that he didn't write a single letter in it!\" So his matter was known, and that [wit] was appreciated from him. Their stories do not belong in this place. End.\n\n**Al-Jardabil:**\nHe is the one who, if he sees a decrease in the bread, seizes the opportunity,",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 20
  },
  {
    "serial_number": "4927459",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "and carries a large crust from it, making it a reserve for himself to eat after he finishes.\n\n**Al-Mushaghghil (The Occupier/Distractor):**\nHe is the one who occupies a loaf to prevent others from eating it. If he sees the bread has decreased, he hastens to swallow, even if he almost chokes.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 21
  },
  {
    "serial_number": "4927460",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "**Al-Mulaqquw (The Cheek-Stuffer/Face-Twister):**\nHe is the one who eats a large bite, so from the outside, his jaw looks like a huge goiter/lump. His jaw remains twisted. If he made the bites smaller, he would be safe from that and would have followed the Sunnah.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 22
  },
  {
    "serial_number": "4927461",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "**Al-Nahim (The Glutton):**\nHe is the one who eats bites in rapid succession. The group leaves the table while he is still in his state of eating. Perhaps he chews with both cheeks, so his one bite is like two bites!!\n\n**Al-Nathir (The Scatterer):**\nHe is a type of Glutton. He is the one who scatters pieces of bread in front of him due to greed.\n\n**Al-Musabiq (The Racer):**\nHe is also a type of Glutton. He is the one who holds a bite in his hand that he has prepared before chewing the one in his mouth. So his jaw is never seen empty of chewing, nor his hand empty [of food], and perhaps his eye is on another bite.\n\n**Al-Samit (The Silent):**\nHe is also a type of Glutton. He is the one who does not utter a word; rather, he bends over and lowers his head onto the food, occupying himself with chewing, swallowing, taking bites,",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 23
  },
  {
    "serial_number": "4927462",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "and placing them continuously without interruption.\n\n**Hatib Layl (Night Wood-Gatherer / Indiscriminate Eater):**\nHe is the one who does not fully investigate what he eats. He might eat a fly that happened to fall into the vessel without realizing it, so the attendees wink at each other about it. If he eats fish, he does not thoroughly clean it of bones, so you see him most times with a bone stuck in his throat, on the verge of harm. Bones of chickens and the like, especially pigeons and sparrows, might also get stuck in the throat, so he remains for a long time unable to enjoy eating or drinking, tasting torment, as happened to Sheikh Al-Najib Yusuf bin Ya'qub, head of construction works, for he neared death from that for twenty days until the bone was cleared from his throat.\n\n**Al-Sa'b (The Difficult/Messy):**\nHe is the opposite of Hatib Layl. He is the one who picks the bite in",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 24
  },
  {
    "serial_number": "4927463",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "his hand from things that do not require picking, like chickpea skins, chard veins, and the like, and places them scattered in front of him.\n\n**Al-Bahhath (The Searcher/Digger):**\nHe is the one who digs through the food, separates it, and looks into its parts until he nauseates the soul of whoever sees him, and the mind of whoever forbids him deems him wrong.\n\n**Al-Bahhat (The Starer/Astounder):**\nHe is the one who stares at the faces of his fellow eaters until he confounds them, and takes the meat from right in front of them.\n\n**Al-'Abith (The Fidgeter/Toy-er):**\nHe is the one who fidgets with the table or bowl and the like, before the food is fully presented and people eat, as if fixing it, or throwing something",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 25
  },
  {
    "serial_number": "4927464",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "he finds on it which is not permissible to throw. This is from baseness of soul and foolishness of mind.\n\n**Al-Hamid (The Praiser):**\nHe is the one who praises Allah Almighty loudly in the middle of the meal, especially the host. For in doing so, he is attributed to alerting those present to refrain from food. As Jahza narrated about himself, saying: Some jesters ate at my place. He heard me praising Allah, Mighty and Majestic, in the middle of the food for something that crossed my mind of His countless blessings. So he stood up and said: \"I give Allah a covenant if I return! What is the meaning of praising (Tahmid) in this place? As if you wanted to inform us that we are full!\" Then he leaned towards the inkwell and wrote:\n\"Praising Allah is good at all times,\nBut not at the beginning of the food.\"",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 26
  },
  {
    "serial_number": "4927465",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "\"Because you embarrass the guests with it,\nAnd command them to rise quickly.\nYou harm them while they are not full with satiety,\nAnd that is not from the character of the noble.\"\n\n**Al-Mubaqqi (The Saver/Withholder):**\nLike what is told that a man invited a guest. When he presented the food, he presented with the food a single chicken, while on the side of his house were three fat scalded chickens hanging. It was as if he saved them, or his ambition was too small to cook all that was present with him. [Also] like the one who presents a little food that does not suffice those present, while meat is hanging in his house facing his brothers.\n\n**Al-Mustazhir (The Precautionary/Hesitant):**\nLike some rich people; one apologized for leaving celebration [in food] with an excuse that was never good except from the likes of him. He said, \"Nothing prevents me from celebrating except precaution (Istizhar).\" It was said to him, \"How is that?\" He said,",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 27
  },
  {
    "serial_number": "4927466",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "\"I hate to celebrate (prepare a feast) and then have the one I invited delay coming due to work or an obstacle, so I would have burdened myself with something I did not benefit from.\" So one of his brothers said regarding that:\n\"If you do not leave the celebration\nExcept because you are taking precaution,\nThen do not invite anyone at all,\nFor this is the most abundant view.\nEspecially me among them,\nFor by your right, I will not attend.\"\nAnother man would not start anything of the invitation's preparation until his brothers arrived and he was secure from their delay. So his food would not be ready until their day had passed, and the fire of hunger raged in their bowels. Someone said about him:\n\"Fear of waste regarding something he hastens,\nOf food, if his brothers are heavy (slow).\nSo his pot does not rise upon the stove,\nUntil it is seen that they have arrived in the house.\"",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 28
  },
  {
    "serial_number": "4927467",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "**Al-Mustahlik (The Destroyer):**\nHe is the one who destroys his molars by drinking water after sweets, or drinking extremely cold water after hot food unless from a pitcher (with a spout to bypass teeth). Likewise drinking upon Harisa, trotters, and the like, and wet fruits. It is not from the etiquette of eating together, because the doer of that is attributed to ignorance, and his companions criticize him for that.\n\n**Al-Muhtami (The Dieter/Restrictor):**\nHe is the host if he makes the bites very small, or spaces",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 29
  },
  {
    "serial_number": "4927468",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "them out for a long time, and talks about the preference of dieting (Hamiyah), or advises those present who complain of pain to diet. He is in that regard a miser.\n\n**Al-Murannikh (The Soaker):**\nHe is the one who soaks the bite in the broth, and does not swallow the first bite until the second softens.\n\n**Al-Mumal'iq (The Spooner):**\nHe is the one who makes spoons out of bread to carry the broth with, and he rarely escapes soiling his clothes and beard.\n\n**Al-Mutatawil (The Longing/Reacher):**\nHe is the one who persists in looking at the cooked dishes in front of others, as if he is reaching for them or wishing for them.\n\n**Al-Mushayyi' (The Escorter/Eye-Follower):**\nHe is the one whose eye is on the bites of those present and their eating. So his eye is on taking this, gathering that, swallowing that, chewing that, and placing that.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 30
  },
  {
    "serial_number": "4927469",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "**Al-Mutalaffit (The Turner/Looker-Around):**\nHe is the one who keeps turning to the direction from which the food is brought, as if he expects another food. If the food is removed, he remains turning towards its bowls as if escorting them with his gaze as if he is not full.\n\n**Al-Munaqqit (The Dripper):**\nKnown.\n\n**Al-Murashshish (The Splatterer):**\nHe is the one who takes a tough piece of meat with his hands and attempts to cut it, or twists a chicken thigh to detach it, so he splatters on his table companions.\n\n**Al-Muwwassikh (The Dirtying One):**\nHe is the one who dirties the bread in front of him, the clothes of his table companions, the dining sheet, and the like.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 31
  },
  {
    "serial_number": "4927470",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "**Al-Darib (The Beater):**\nAlso called *Al-Daqqaq*. He is the one who hits the edge of the table, the dining sheet, or the spoon with the bone to get its marrow out, so he sprays the clothes of his table companions with grease. Perhaps he dents the table or spoon, or cuts the dining sheet.\n\n**Al-Massas (The Sucker):**\nHe is the one who cannot control himself if he sees a bone from extracting its marrow, pounding it, and sucking it, and follows it in the food.\n\n**Al-Akta' (The One-Handed):**\nHe is the one who eats only with one hand, without necessity. So he twists the bread when breaking it, and may crumble it with his fingernail.\n\n**Al-Muwhim (The Deceiver):**\nHe is the one who, when he extends his hand to the food, extends a finger, creating the illusion that he is eating with three fingers, while he gathers behind it with the rest [of the fingers] and his palm as well.\n\n**Al-Mutaqayyi' (The Vomiter/Finger-Inserter):**\nHe is the one who inserts his hand into his mouth when placing the bite up to the knuckles or thereabouts, as if he is vomiting. After he takes it out",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 32
  },
  {
    "serial_number": "4927471",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "he shakes it into the food, or wipes it on the herbs or the dining sheet.\n\n**Al-Muwazzi' (The Distributor):**\nHe is also a *Fuduli* (Meddler). He is the one who distributes most of the food to the host's servants. This is not from the etiquette of eating together, rather it is contrary to the Sunnah. It is also contrary to the Sunnah to feed a cat and the like; for that is the job of the host.\n\n**Al-Muwaffir (The Economizer/Delayer):**\nHe is the one who presents at the beginning of his meal what is cheap for him, like vinegar and herbs, prolongs the eating, and delays bringing good foods until those present are full from what is below that, in order to save them.\n\n**Al-Muhaddith (The Talker):**\nHe is the host who distracts his fellow eaters with continuous conversation that requires an answer, distracting them by listening to him from eating. That is counted as miserliness. As for conversation that does not require an answer, it is better from the owner of the table than from the invitee and visitor. Someone who encountered food and conversation that was desired said: \"Conversation is a method of hospitality.\" It is considered good what some modern poets said:\n\"What is my trick to relieve the guest of embarrassment,\nAt the food, for my tricks have narrowed with him.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 33
  },
  {
    "serial_number": "4927472",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "I fear repeating any obscene saying,\nAnd the guest attributes it from me to miserliness.\"\n\n**Al-Musta'thir (The Selfish/Preferential):**\nHe is the host who invites a man, eats with him, then gluttony overcomes him, so he keeps the best meat for a meal without him. If it happens that the food does not suffice both of them, his own satiety is more important to him than satisfying his guest.\nThe best that has been said regarding preferring the fellow eater is the saying of Hatim:\n\"And I am ashamed for my companion to see\nThe place of my hands from the place of provisions as empty.\nAnd you, if you give your belly its request\nAnd your private parts, they attain the utmost blame together.\"\nAl-Mubarrad said: Mutammim bin Nuwayrah used to delay dinner until the night",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 34
  },
  {
    "serial_number": "4927473",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "waiting for a guest or a night-visitor to eat with him. Qays bin Asim Al-Minqari addressed his wife saying:\n\"O daughter of Abdullah, and daughter of Malik,\nAnd O daughter of the owner of the two cloaks and the roan horse.\nIf you prepare the provisions, adopt for it\nAn eater [partner], for I will not eat it alone.\nWhether a night-visitor or a neighbor of the house, for I\nFear the blame of conversations after me.\"\nSo she answered him:\n\"The man Qays refused to taste his food\nWithout an eater [partner]; indeed he is generous.\"",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 35
  },
  {
    "serial_number": "4927474",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "\"So you are blessed alive, O son of Asim, possessor of generosity,\nAnd you are blessed dead, having been contained by stone piles (graves).\"\nAnd for another:\n\"I laugh with my guest before bringing down his saddle,\nAnd he finds abundance with me while the place is barren.\nAbundance for guests is not that you increase the meal,\nBut rather the face of the generous one is abundant.\"\n\n**Al-Muta'addi (The Transgressor):**\nHe is the one who eats what is in front of someone else.\n\n**Al-Laffaf (The Wrapper):**\nHe is the one who wraps for himself wrap after wrap of bread, each one about a third of a loaf, and bites it several times. This is not considered good among brothers if a man does it for himself; but it is good for the host",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 36
  },
  {
    "serial_number": "4927475",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "to do it for others, especially for women, for adopting that with them is something that brings one closer to them, especially after they refrain from eating.\n\n**Al-Ghassas (The Choker/Water-Neglecter):**\nHe is the one who neglects preparing water before eating, so if one of his fellow eaters chokes, he does not find what to give him to drink.\n\n**Al-Naththar (The Sprayer):**\nHe is the one who laughs excessively while the bite is in his mouth, so his table companions see what is chewed inside his cheek, and what was crushed scatters out.\n\n**Al-Baqqar (The Cow-Like):**\nHe is the one who sticks out his tongue like a cow time after time to lick his lips, outside his mouth.\n\n**Al-Mumtahin (The Tester):**\nAlso called *Al-Muhassis* and *Al-Muhtal*. He is the one who places his finger on a visible piece of meat. If he sees it is a bone, he closes his finger and sucks it, pretending the food is hot and it burned him. If he sees it is meat, he takes it. Then if it is large he eats it, or if small he pushes it to his neighbor as if preferring him with it.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 37
  },
  {
    "serial_number": "4927476",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "**Al-Muhtal (The Trickster):**\nHe is the one who moves a lot of meat in succession and puts it in front of the one next to him. He says to him, \"Eat, O my master,\" so the person becomes shy and abstains, so he [the trickster] returns to eat it. It is a trick to obtain that for himself.\n\n**Al-Mughali (The Exaggerator/High-Value Seeker):**\nAlso called *Al-Mustaghnim*. He is the one who does not intend in his eating anything except what is expensive in price, even if it is harmful, and even if other things are better than it.\n\n**Al-Mufarriq (The Separator):**\nHe is the one who separates the meat and kebab in the food to hide it from the eyes of the companions, then dives behind it with the spoon, hastening to take it secretly. He is also called *Al-Mukhtalis*.\n\n**Al-Mukhtalis (The Snatcher):**\nThis name is also given to one who cuts the meat into small pieces, then snatches them between bites so that he is not noticed, to carry to himself from the meat as well, while they think he has not obtained any.\n\n**Al-Mu'azzil (The Isolator/Vomiter):**\nHe is the one who, if he is full and other food arrives, vomits, and eats from it as well.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 38
  },
  {
    "serial_number": "4927477",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "**Al-Muwahish (The Alienator):**\nHe is the host who gets angry at his servants, or threatens the cook, or beats a maid or servant in his house when his drinking companions gather or attend their table.\n\n**Al-Mutashakki (The Complainer):**\nHe is the host if he complains about the year (drought/hardship) and the high prices, and apologizes to his guest about the severity of his straits. The ugliest of that is what happens during eating or before it. Abu Al-Ayna narrated, saying: I was hosted by some Arabs, and it was a barren year. I apologized to him (or he apologized to me) and mentioned high prices, and spoke much of that. So I lifted my hand and said: It is not from chivalry to mention high prices to guests when food is present. So I apologized to him (or he to me), and begged him by Allah to eat, but he did not, and left the next day.\n\n**Al-Musta'dhin (The Permission Seeker):**\nHe is the one who asks his guest's permission to bring the food, as Abu Al-Ala said:\n\"Do not ask the guest if you fed him at noon,\nAt night: Do you have a need for some hospitality?",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 39
  },
  {
    "serial_number": "4927478",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "For that is from speech dictated to him:\n'I do not desire provisions,' while he is hungry and deprived.\nPresent to him what comes, do not consult him\nAbout it, even if it is *Turthuth* (bitter plant) and sour milk.\"\n\n**Al-Mughtanim (The Opportunist):**\nHe is the one who, if the leader (host/chief) offers him to wash his hands in his presence as a courtesy, seizes that opportunity and hastens to it. Even if he refused that and etiquette prevailed, it would be lighter on the heart, and he would gain favor and be safe from being burdensome. For a person cannot thoroughly wash and clean hands and mouth in the presence of the leader, and if he does that in his presence, it is bad manners from him, so concealing that is better.\n\n**Al-Mutakhallil (The Picker):**\nHe is the one who picks his teeth with his fingernails or beard hair and the like. And Allah is the Grantor of success.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 40
  },
  {
    "serial_number": "4927479",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Adab al-Muwakalah (Etiquette of Eating with Others)",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir for Printing, Publishing and Distribution, Damascus, Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "This is the last of what was present with us regarding the faults of eating. The wise person avoids that to his capacity. Praise be to Allah alone, and peace be upon the one after whom there is no prophet.",
    "foot_note": "None",
    "book_id": "466",
    "new_page_number": 41
  }
]