[
  {
    "serial_number": "5008941",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquettes, and Remembrances\nBook: The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']\nAuthor: Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi al-Hanbali (630 AH - 699 AH)\nCared for and adjusted by: Muhammad bin Nasir al-Ajmi\nPublisher: Dar Al-Basha'er Al-Islamiyyah - Beirut\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nBook: The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']\nAuthor: Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi al-Hanbali (630 AH - 699 AH)\nCared for and adjusted by: Muhammad bin Nasir al-Ajmi\nPublisher: Dar Al-Basha'er Al-Islamiyyah - Beirut\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nAuthor: Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi al-Hanbali (630 AH - 699 AH)\nCared for and adjusted by: Muhammad bin Nasir al-Ajmi\nPublisher: Dar Al-Basha'er Al-Islamiyyah - Beirut\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nCared for and adjusted by: Muhammad bin Nasir al-Ajmi\nPublisher: Dar Al-Basha'er Al-Islamiyyah - Beirut\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nPublisher: Dar Al-Basha'er Al-Islamiyyah - Beirut\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nEdition: Second, 1421 AH - 2000 AD\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nNumber of Verses: 947\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nNumber of Pages: 100\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nPublication date in Al-Shamela: 6 Sha'ban 1442",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008942",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Millenary Poem on Legal Manners (Al-Alfiyyah fi Al-Adab Al-Shar'iyyah)\nAuthored by Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi al-Hanbali (630 AH - 699 AH)\nCared for and adjusted by: Muhammad bin Nasir al-Ajmi\nDar Al-Basha'er Al-Islamiyyah",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008943",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 2,
    "volume_number": 1,
    "text": "All rights reserved\nFirst Edition 1418 AH - 1998 AD\nSecond Edition 1421 AH - 2000 AD\nDar Al-Basha'er Al-Islamiyyah for Printing, Publishing and Distribution\nPhone: 702857 - Fax: 009611/ 704963\nBeirut - Lebanon\nP.O. Box: 14/ 5955\nE-mail:bashaer@cyberia.net.lb",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008944",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction to the Second Edition\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah alone, and peace and blessings be upon him after whom there is no Prophet.\nAs for what follows:\nThis is the second edition of this unique poem after the first edition went out of print. The most important aspect of this edition is the correction of errors that occurred in the first one, especially in the diacritical adjustment (Tashkil) of words; for no matter how much the typesetter tries, something of that is bound to be missed, especially if the book is voweled. Furthermore, I have removed from it what related to Major Sins (Al-Kabair) in the first edition from pages 68-71, after it was proven to me that it is not by Ibn Abd al-Qawi, but rather by Imam Sharaf al-Din al-Hajjawi. It was mentioned and attributed to him by Imam Shams al-Din al-Saffarini in his book (Ghidha' al-Albab li-Sharh Manzumat al-Adab) (1/354), where he said: (...severing ties of kinship is among the major sins, and Al-Hajjawi mentioned it in his poem containing the Major Sins located in his [book] Al-Iqna', and I have explained it in a concise commentary...).\nAlso, Ibn Humayd al-Hanbali al-Makki mentioned that it belongs to Al-Hajjawi in his book (Al-Suhub al-Wabilah) (3/1135), and Sheikh Ibrahim Ibn Duwayan followed him in that in his book (Raf' al-Niqab 'an Tarajim al-Ashab) (p. 353).",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008945",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 4,
    "volume_number": 1,
    "text": "This is what I wished to indicate in this place. Finally, I must express my sincere thanks to the noble brother, the dignified Sheikh Muhammad Talha Bilal, for the notes he kindly provided regarding the adjustment of the book; may Allah reward him with the best reward on my behalf. And praise be to Allah, Lord of the Worlds.\nMuhammad bin Nasir al-Ajmi\nBeirut the Guarded\n20/4/1420 AH\n2/8/1999 AD",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008946",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 5,
    "volume_number": 1,
    "text": "A Word by His Eminence Sheikh Ahmed bin Ghannam Al-Rashid\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah alone, and peace and blessings be upon him after whom there is no Prophet, and upon his family and companions.\nAs for what follows:\nThe poem of Major Manners (Manzumat al-Adab al-Kubra) by the scholar Ibn Abd al-Qawi, may Allah have mercy on him, is worthy of attention. It was printed previously with its commentary (Ghidha' al-Albab Sharh Manzumat al-Adab). The virtuous brother, the skilled researcher Muhammad bin Nasir al-Ajmi, informed me that the scholar Al-Saffarini did not explain it completely, but rather explained most of its verses. It was printed alone [before], but that edition lacked verification (Tahqiq), as it was filled with typographical errors and others. Therefore, our virtuous brother Muhammad bin Nasir al-Ajmi thankfully undertook its verification in a manner befitting it, adjusting its diacritics, and caring for it with utmost care as much as possible, until it became like the sun in the middle of the day. He clothed it in the garment of beauty and splendor, so it became like a bride surpassing the gazelles in beauty, and in its elevation, it rivaled the distant stars, with illuminating notes as clear as the sun at noon.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008947",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 6,
    "volume_number": 1,
    "text": "Indeed, the poem of Major Manners has gathered immense benefits and important legal rulings. Students of knowledge should take care to memorize it, for it is the desired goal for whoever memorizes and masters it. The Hafiz Sheikh Abdul Rahman bin Muhammad bin Khalaf al-Dawsari, may Allah have mercy on him, used to have it memorized, for he was, may Allah have mercy on him, a miracle in memorization. Our Sheikh, the venerable scholar Muhammad bin Sulayman al-Jarrah (1), may Allah have mercy on him, named him 'Al-Hafiz'.\nThis, and may Allah send blessings and peace upon our Master Muhammad, and his family and companions.\nAhmed bin Ghannam Al-Rashid Al-Hanbali\nKuwait - Al-Fayha\n9 Safar 1418 AH corresponding to 14/6/1997 AD",
    "foot_note": "1. Our Sheikh Al-Jarrah, may Allah have mercy on him, had a great interest in this poem, to the extent that he copied it in his own handwriting, as did his brother the poet Dawood Al-Jarrah. I heard him more than once citing some verses from it, may Allah have mercy on everyone. (The Editor).",
    "book_id": "54"
  },
  {
    "serial_number": "5008948",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 7,
    "volume_number": 1,
    "text": "Introduction to the Verification\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, Revealer of the Book, and I bear witness that there is no god but Allah, the One, the Bestower, and I bear witness that Muhammad is His servant and Messenger, may Allah bless him and his family and companions who are adorned with the best morals and manners.\nAs for what follows:\nThe scholar, the Imam, the Grammarian Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi has composed [in poetry] the manners and morals that every Muslim should adorn themselves with in their day and night, indeed in all their life and their private and public affairs.\nThe scholar Sheikh Musa al-Hajjawi, author of (Al-Iqna'), says: (And when he - meaning Ibn Abd al-Qawi - composed the long poem in jurisprudence (Fiqh), he followed it with this poem on manners, following the method of a group of the companions [of the Madhhab] like Ibn Abi Musa, Al-Qadi, Ibn Hamdan in his (Ri'ayah), the author of (Al-Mustaw'ib), and others in following the book with a conclusion on manners; so he followed his book with this poem) (1).\nBecause of the importance of this poem, Hanbali scholars have taken care to explain and comment on it. Among those who explained it: The scholar and editor of the Madhhab Ala' al-Din al-Mardawi, and the scholar, the seal of the investigators among the Hanbalis, Sheikh Musa al-Hajjawi. Then, it was explained with a sufficient, lengthy commentary by",
    "foot_note": "1. (Ghidha' al-Albab) (1/ 7).",
    "book_id": "54"
  },
  {
    "serial_number": "5008949",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 8,
    "volume_number": 1,
    "text": "the oft-turning [to Allah] scholar Al-Saffarini. He collected and encompassed much in this explanation of his, and relied in his explanation on several great volumes from the books of the Madhhab and other sources from the collections of knowledge; however, he omitted a number of verses from the poem. Therefore, I saw it appropriate to publish this majestic poem complete and separate after caring for it and adjusting it; hoping that the people of knowledge and its students will benefit from it.\nI ask Allah for success in what He loves and is pleased with, and may Allah bless His Prophet, his family, and his companions and grant them peace.\nMuhammad bin Nasir al-Ajmi\nThe Hanbali Mosque in Salhiyah, Damascus the Guarded\nOn the twenty-ninth of Muharram al-Haram 1418 AH (1)",
    "foot_note": "1. I wrote this small word in the Hanbali Mosque in front of the pulpit, remembering that Ibn Qudamah, Al-Hajjawi, and Al-Balbani used to preach on the steps of this pulpit, may Allah have mercy on them all. May He return to this nation its ancient glory and past might, and Allah is the One sought for help.",
    "book_id": "54"
  },
  {
    "serial_number": "5008950",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 9,
    "volume_number": 1,
    "text": "Biography of the Author (1)\nHe is the Imam, the Jurist, the Hadith Scholar, the Grammarian, Shams al-Din Abu Abdullah Muhammad bin Abd al-Qawi bin Badran bin Abdullah al-Maqdisi, al-Mardawi, al-Salihi, al-Dimashqi, al-Hanbali.\nHe was born in the village of (Marda) one of the villages of Nablus in Palestine, in the year 630 AH. He received his primary education in his village and heard Hadith from the preacher of (Marda)",
    "foot_note": "1. See his biography in: (Al-Muqtafi) by Alam al-Din al-Barzali (2/ 5 - Ahmet III copy 2951), (Al-Ibar) by Al-Dhahabi (5/ 403), (Tadhkirat al-Huffaz) by him (4/ 1486), (Al-Mu'jam al-Mukhtass) by him p. 241, (Barnamaj al-Wadi Ashi) p. 128, (Al-Wafi bi al-Wafiyat) by Al-Safadi (3/ 278), (Tadhkirat al-Nabih) by Ibn Habib (1/ 222), (Dhayl Tabaqat al-Hanabilah) by Ibn Rajab (2/ 332), (Al-Nujum al-Zahirah) by Ibn Taghri Bardi (8/ 192), (Al-Maqsad al-Arshad) by Ibn Muflih (2/ 459), (Bughyat al-Wu'at) by Al-Suyuti (1/ 161), (Al-Manhaj al-Ahmad) by Al-Ulaymi (4/ 357), (Al-Qala'id al-Jawhariyyah) by Ibn Tulun (1/ 242), (Al-Daris fi Tarikh al-Madaris) by Al-Nuaymi (2/ 83), (Shadharat al-Dhahab) by Ibn al-Imad (5/ 452), and (Munadamat al-Atlal) by Ibn Badran p. 238. (Note): Ibn Abd al-Qawi was mentioned in some of these sources without a biography provided for him, except for his birth or death year, and some sources quote from others without addition, so his biography remained brief, and we did not find his complete news.",
    "book_id": "54"
  },
  {
    "serial_number": "5008951",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 10,
    "volume_number": 1,
    "text": "Abu Abdullah Muhammad bin Ismail al-Maqdisi al-Nabulsi, Uthman Ibn Khatib al-Qarafa, and Muhammad bin Abd al-Hadi. He heard in Jerusalem from Taj al-Din bin Asakir... and other Sheikhs.\nHe sought knowledge and read by himself, studied Fiqh under Sheikh Shams al-Din bin Abi Umar and others, excelled in Arabic and language, worked, taught, issued fatwas, and wrote books.\nAl-Hafiz Alam al-Din al-Barzali said, and Ibn Habib followed him: (He was a virtuous Sheikh in Fiqh, Grammar, and Language, memorized much, issued fatwas, and held the professorship of Al-Sahiba (1) for a period. He heard much by himself, read to the Sheikhs, and has much poetry...) (2).\nAl-Hafiz Shams al-Din al-Dhahabi said: (He was of good religiosity, gentle character, very beneficial, casting aside affectation. He held the professorship of Al-Sahiba for a period, used to attend Dar al-Hadith and work there, and in the Mountain - meaning Mount Qasioun. He has stories and anecdotes, and was among the beauties of the Sheikhs) (3).",
    "foot_note": "1. This school was established by Rabi'a Khatun Al-Sahiba, the sister of Saladin Ayyubi. Her brother Saladin married her to Prince Sa'd al-Din Anar, and when he died, he married her to Prince Muzaffar al-Din Kokburi, the Prince of Erbil, who built the Hanbali Mosque in Salhiyah. This school is located at the foot of Mount Qasioun from the east, and it is close to the Hanbali Mosque towards the east of it. The scholar Ibn Badran said in (Munadamat al-Atlal) p. 237: (It is one of the monuments that indicate the advancement of architectural art in that time). I have stood at this school more than once; and the panel of its title was written in his exquisite calligraphy by the master calligrapher of the Levant, Mamdouh al-Sharif.\n2. (Al-Muqtafi) by Al-Barzali (2/ 5), and (Tadhkirat al-Nabih) by Ibn Habib (1/ 222).\n3. (Dhayl Tabaqat al-Hanabilah) by Ibn Rajab (2/ 342).",
    "book_id": "54"
  },
  {
    "serial_number": "5008952",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 11,
    "volume_number": 1,
    "text": "He also said: (The scholar, the Mufti, the Grammarian, the remnant of the predecessors... He read to the Sheikhs, then excelled in the Madhhab and Arabic. I sat with him, heard his speech, and I have an Ijazah (license) from him) (1).\nThe scholar Al-Saffarini said: (The unique scholar Imam, the glorious understanding role model, the Sibawayh of his time, nay the Quss [bin Sa'ida] of his era and the Sahban [Wail] of his time, who shamed pearls with his poetry and the forenoon with his eloquence, the sea with the overflow of his knowledge, and the rain cloud with the flow of his fingertips, the Imam, the Role Model, Shams al-Din Abu Abdullah Muhammad bin Abd al-Qawi al-Mardawi, the Jurist, the Hadith Scholar, the Grammarian, the Athari Hanbali) (2).\nA group of scholars graduated under him, and among those who read Arabic to him was Sheikh al-Islam Ibn Taymiyyah (3).\n• He has works, most of which are in verse, including:\n1 - (Tabaqat al-Hanabilah).\n2 - (Iqd al-Fara'id wa Kanz al-Fawa'id), which is a poem rhyming in 'Dal' in Fiqh, printed in two volumes at the expense of Sheikh Ali Al Thani, may Allah have mercy on him, at the Islamic Office in 1384 AH - 1964 AD.\n3 - (Al-Furuq).\n4 - (Majma' al-Bahrain), which he did not complete.\n5 - (Manzumat al-Adab al-Sughra).",
    "foot_note": "1. Al-Mu'jam al-Mukhtass by him p. 341.\n2. (Ghidha' al-Albab) by him (1/ 3 - Al-Najah edition year 1324 AH).\n3. (Dhayl Tabaqat al-Hanabilah), and (Al-Maqsad al-Arshad) by Ibn Muflih (2/ 460).",
    "book_id": "54"
  },
  {
    "serial_number": "5008953",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 12,
    "volume_number": 1,
    "text": "6 - (Manzumat al-Adab al-Kubra).\nHe died, may Allah Almighty have mercy on him, on the twelfth of Rabi' al-Awwal, in the year six hundred and ninety-nine, and was buried at the foot of Mount Qasioun.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008954",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 13,
    "volume_number": 1,
    "text": "Description of the Copies Relied Upon in Verification\nI had available to me - praise be to Allah - in verifying this blessed poem, three manuscript copies and one printed copy, and this is their description:\n1 - A copy from Princeton University in America under number (4566). It consists of 34 pages, with 15 lines per page. It is written in clear Naskh script. The name of the copyist and the year of copying are not mentioned. Perhaps this copy is from the manuscripts of the 8th or 9th century. It is a correct copy that almost aligns with the Zahiriyah copy except for a very small amount. I symbolized it with the letter (B).\n2 - A copy from Dar al-Kutub al-Zahiriyah in Damascus under number (186 - General). It consists of 32 pages, with 17 lines per page. It is written in a customary Naskh script with vowel points (Tashkil); however, the copyist was not correct in some places. Its copyist - whose name is not mentioned at the end - finished copying on Friday in the month of Rajab in the year (1189 AH). On its title page, there is an ownership note by legal purchase for Muhammad Abd al-Majid al-Dumani al-Hanbali in the year (1295 AH). It is a good copy, and I symbolized it with the letter (Z).\n3 - A copy in the handwriting of the majestic scholar Sheikh Abdullah bin Khalaf bin Duhayan al-Hanbali, which is in my possession. It consists of 6 pages, with 24 lines per page.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008955",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 14,
    "volume_number": 1,
    "text": "The scholar Ibn Duhayan extracted it from the printed version within (Ghidha' al-Albab) by Al-Saffarini. Note that Al-Saffarini did not explain the entire poem, as we indicated in the introduction. This copy in the handwriting of Sheikh Abdullah was finished in the year 1326 AH. I did not rely on it except to consult it in some places, and I symbolized it with the letter (A).\n4 - The Printed Copy\nIt was printed at the Modern Riyadh Library in Riyadh within a collection without a mention of the printing date. It is a photocopy of an old print that I have not seen. This printed version is full of errors and typos; yet, credit goes to the one who printed it first.\nI have taken care of this poem, adjusted it, and edited its text, asking Allah for benefit through it, and He is the Guardian of Success.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008956",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "Images of Manuscripts",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008957",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "First page of the Princeton University copy",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008958",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "Last page of the Princeton University copy",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008959",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 18,
    "volume_number": 1,
    "text": "First page of the Zahiriyah copy",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008960",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "Last page of the Zahiriyah copy",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008961",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "Last page of the copy in the handwriting of the scholar Ibn Duhayan",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008962",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Millenary Poem on Legal Manners\nBy Imam Shams al-Din Muhammad bin Abd al-Qawi al-Mardawi al-Hanbali (630 - 699 AH)\nCared for and adjusted by Muhammad bin Nasir al-Ajmi",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008963",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "The Imam, Sheikh al-Islam, Pillar of Jurists, the Pious, the Ascetic, the Worshipper (\"Shams al-Din Abu Abdullah Muhammad bin Abd al-Qawi\") said:\nIn the name of Allah, the Most Gracious, the Most Merciful\n1 - With Your praise, O Allah, I end and begin ... For Your praise is a duty upon every existing being.\n2 - You are exalted above a peer, and a child, and ... A partner, and what every atheist fabricates.\n3 - We affirm without doubt that You are One ... And we believe in the caller to You, Muhammad.\n4 - Your Messenger, the purest of those You sent to mankind ... And the best of those You extracted from the best lineage.\n5 - Upon him be the blessings of Allah, then His peace ... A prayer for us that decrees eternal success.\n6 - And [upon] every Prophet to the people, and it is doubled ... For the most noble creature of the most noble origin.\n7 - And his Companions, and the illustrious ones of Banu Hashim ... And whoever is guided by their guidance throughout the ages.\n8 - And I bear witness that Allah, there is no Lord but Him ... And I ask Him for pardon and the completion of what was begun.\n9 - And a good ending that grants the youth satisfaction ... And conveys him in victory to the most noble seat.\n10 - And we praise Him with a praise befitting His bounty ... And we ask Him for sincerity in every intention.\n11 - To proceed, I shall compose a collection ... Of the etiquette transmitted from the Best Guide.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008964",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "12 - From the radiant Sunnah or from the Book of the One ... Who is sanctified above the sayings of the misguided and deniers.\n13 - And from the sayings of the people of virtue among our scholars ... The Imams of the people of peace (Islam), from every glorious one.\n14 - Perhaps the God of the Throne will benefit us with it ... And settle us in the Gathering in the best seat.\n15 - O you who has desire for knowledge and religion ... Listen with a present, attentive heart.\n16 - And accept advice from one compassionate toward people ... Eager to deter mankind from destruction.\n17 - For I have a trust from the Hadith ... I will exert my effort to deliver it, so I guide and be guided.\n18 - So take it, may Allah guide you, do not neglect it ... For in it are all arranged goods.\n19 - I say, beginning in poetry and its composition ... So be a listener to my poem without refutation.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008965",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "Guarding the Limbs\n20 - Indeed, everyone who seeks safety should guard ... His limbs from what Allah forbade, he will be guided.\n21 - The harvest of his tongue throws the youth into the Fire ... So maintain control of the tongue and restrain it.\n22 - Abandon excess speech, so do not be prolific ... In speech other than the remembrance of Allah, you will be happy.\n23 - For excess speech is a hardening ... For the heart of the youth, causing reverence to be distant from it.\n24 - For a word may cast its speaker into the Fire ... And releasing one's gaze is more harmful, so restrain it.\n25 - And the gaze of the youth, O friend, is the scout of his private parts ... And his tire-er, so lower it as much as you can, you will be guided.\n26 - For whoever extends a gaze or commits adultery, his family will be adulterated ... So be chaste, and he will be chaste; the Best Guide said it.\n27 - For whoever is chaste out of piety regarding the prohibitions of others ... Protects his family truly, and if he commits adultery, he corrupts.\n28 - Even if the act of Zina (adultery) were not a major sin ... And the person of intellect did not fear its consequences tomorrow.\n29 - It would be worthy to protect his womenfolk ... By abandoning Zina for fear of retribution as it began.\n30 - So listen and guard the limbs, each has a Zina ... But the Zina of the private parts is the Major sin, so count it.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008966",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "31 - For Allah has paired Zina with calling upon ... A lord alongside Allah in eternal punishment.\n32 - And discipline and punish (Ta'zir) the one who comes to an animal ... And support the one who seduces a beauty against her will [for punishment].\n33 - If you kill him, there is no liability ... And whoever sees a youth with a spouse, let him draw,\n34 - A sword to kill them, and let him kill them together ... There is no Qisas (retribution) upon him nor blood money.\n35 - If this was a claim from him and the guardian denied it ... Let him swear, and affirm the Qisas.\n36 - And looking at beardless youths (Amrad) is forbidden with desire only ... And it was said even with fear [of fitnah], and affirm it for dislike.\n37 - So beware of youths, do not approach them ... And do not send your gaze among them, but restrain it.\n38 - And do not belittle a glance from you ... For within it is an arrow kindled with fire.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008967",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "Prohibition of Backbiting and Gossip\n39 - And slander, backbiting, gossip are forbidden ... And revealing a secret, then restrict cursing.\n40 - And obscenity, plotting, foul language, deception ... And ridicule, mockery, and restrict lying.\n41 - Except for deceiving disbelievers in their war ... And for weddings or reconciling people in dispute.\n42 - And make obligatory the restraining of limbs from the forbidden ... And recommended from the disliked without being harsh.\n43 - And it was said that backbiting and gossip are minor sins ... But both are major sins according to the text of Ahmad.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008968",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "Commanding Good and Forbidding Evil\n44 - And make your commanding of good and forbidding, O youth ... Of evil an individual obligation (Fard Ayn), you will be guided.\n45 - Upon the one knowing the prohibition and the act, if no one ... Else has undertaken it, with safety from the aggression of an aggressor.\n46 - Even if he is immoral and ignorant. And in other than ... What was said to be a communal obligation (Fard Kifaya), limit it.\n47 - And scholars are specialized in what knowledge is specific ... To them and by whom they seek victory.\n48 - And the weakest of it is with the heart, then his tongue ... And the strongest is the denial of the strong youth with the hand.\n49 - And deny upon children every forbidden act ... By disciplining them, and knowledge in the Law comes by repelling.\n50 - So whoever strikes children, the strike of a discipliner ... And his wife upon rebellious disobedience.\n51 - And the strike of the leader of Muslims upon subjects ... To discipline them by Law, without being harsh.\n52 - And the strike of a guardian or teacher of boys ... Without transgression, there is no liability for what was initiated.\n53 - And whoever hands over a son to be taught swimming ... And he drowns, he is not liable, like handing over a mature one.\n54 - Himself to him to be guided in swimming ... And he drowns. And it was said the son perishes by a distant one.\n55 - And if a human orders a non-accountable person ... To go down a well or says to him ascend,",
    "foot_note": "1. In the printed version: (Kadha).",
    "book_id": "54"
  },
  {
    "serial_number": "5008969",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "56 - To a palm tree, judge with liability for the commander ... But if he was of reason, an adult, then no hand [liability].\n57 - And if the authority was the one commanding him to it ... Then there are two views regarding his liability, establish it thus.\n58 - And one is liable for causing a pregnant woman to miscarry by discipline ... And whoever caused her to miscarry by medicine for her illness, pay blood money.\n59 - And if the Dhimmi openly commits abominations in the Sharia ... He is rebuked, unlike the one hiding in a resting place.\n60 - And begin with the easiest, then increase according to need ... If it does not cease with the effective command, then repel.\n61 - If you do not fear injustice in that command ... If that denial was confirmed as obligatory.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008970",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "Ruling on Musical Instruments, Singing, and Poetry\n62 - And there is no fine for breaking a cross, nor vessels ... Of silver, nor an eye [idol] for males and females.\n63 - And no fine for the tambourine with cymbals if you broke it ... Nor for images either, nor instruments of play (Dad) (1).\n64 - And instruments of astrology, magic, and the like ... And tear up books that contain this and its likes.\n65 - And eggs and walnuts for gambling, to the extent that ... Removes the intent of corruption from the denounced item.\n66 - And slashing wine containers and jugs absolutely ... Even if they are useful for something else in the established view.\n67 - And the flute and reed pipe are forbidden, and what ... Resembles them of instruments of diversion and rejection.\n68 - Even if singing does not accompany all of them ... And among them are string instruments without restriction.\n69 - And the prohibition of singing is what the majority judged ... And from the two Abu Bakrs, an Imam and role model,\n70 - Its permissibility, not its dislike. And Imam Abu Ya'la ... Permitted it with dislike, so recite (2).\n71 - So whoever becomes famous for it, does it much, and takes ... A singing slave girl for it, is not considered among witnesses.\n72 - And there is no harm in permissible poetry, memorizing it ... And composing it; whoever dispraises that transgresses.",
    "foot_note": "1. Meaning: Amusement and play, (Ghidha' al-Albab) (1/ 211).\n2. After this verse, there are six verses not found in the manuscripts. Abu Ya'la is Muhammad bin al-Husayn al-Baghdadi, Ibn al-Farra', died in the year (458 AH).",
    "book_id": "54"
  },
  {
    "serial_number": "5008971",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "73 - For the Chosen One heard the poetry of his Companions ... And their amorous verses without specifying maidens.\n74 - And there was no denier of that in any era ... So how [can it be denied] when there is wisdom in it? So narrate and recite.\n75 - And affirm the prohibition of satire, praise with falsehood and obscenity ... And erotic verses about specific foreign women.\n76 - And describing adultery, wine, beardless youths, and singing women ... And wailing due to discontent is cited [as forbidden].",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008972",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "Shunning Sinners\n77 - And shunning the one who shows disobedience is Sunnah ... And it was said: If it deters him, make it obligatory and confirm it.\n78 - And it was said: Absolutely, as long as he is publicizing it ... And meet him with a frowning, dusty face.\n79 - And spying on one concealing his sin is forbidden ... And past sin if he does not renew it.\n80 - And shunning the one who calls to a misleading matter or ... One causing immorality, mandate it without hesitation.\n81 - Except for the one strong enough to refute his saying ... And repel the harm of the misleader with a defense.\n82 - And fulfills people's needs by coming to him ... And there is no shunning [allowed] regarding his customary greeting.\n83 - And prohibition of denying greeting for more than three [days] ... Confirm it for other than the one we said to shun.\n84 - And it is disliked for a person to sit with a vile person ... And with the immoral or the hypocrite, the rejected one.\n85 - Likewise with a foolish person, who is one of weak mind ... And with the player of Chess, Backgammon (Nard), and rejection.\n86 - And one accused in his religion or honor ... Ibn Hamdan gave fatwa with this, so follow him and imitate (1).",
    "foot_note": "1. Ibn Hamdan is Ahmed bin Hamdan bin Shabib al-Harrani, died in the year (695 AH).",
    "book_id": "54"
  },
  {
    "serial_number": "5008973",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "Greeting, Handshaking, and Permission\n87 - And be aware that greeting is for Sunnah ... And your reply is Obligatory, not merely recommended with certainty.\n88 - And the greeting of one person from a group suffices ... And the reply of a youth among them on behalf of all, O Adi (1).\n89 - And the greeting of the few, the young, the passerby ... And riders upon the opposite, support this.\n90 - And if the one ordered to reply among them greets ... Then the Sunnah is achieved since he is an initiator.\n91 - And greet when you stand from the presence of a person ... And greet when you come to your house, you follow [the Sunnah].\n92 - And your spreading of Salam necessitates love ... From people; aim for the unknown and the known.\n93 - And making it definite with the word 'Al-Salam' is permitted ... And making it indefinite [Salam] also according to the text of Ahmad.\n94 - And it was said it is disliked, and it was said it is a greeting ... For a dead person. And make the farewell definite like a repeater.\n95 - And seeking permission to enter is Sunnah ... Upon others, from relatives and strangers.\n96 - Three times. And entering suddenly is disliked ... Especially from a journey and being far away.\n97 - And his standing should be facing a door or window ... If he is not answered, he leaves, and if he fears [prying], he increases [distance].\n98 - And moving his sandals and showing his sound ... For his entry, witness this even for his own home.\n99 - And if a human looks through the crack of his door ... Without his permission, if he pokes out his eyes, no blood money.",
    "foot_note": "1. In (Z): (Ba'idi), and the established text is from (B), the printed version, and (Ghidha' al-Albab).",
    "book_id": "54"
  },
  {
    "serial_number": "5008974",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "100 - It is the same from a path, or from the property of an observer ... Or from a window, or from a built wall.\n101 - Even with the possibility of repelling without it ... And the absence of women or the presence of an aggressing Mahram.\n102 - And do not throw at the blind. Abu al-Wafa (1) said ... Yes, if he can hear, let him be thrown at and repelled.\n103 - And every standing up, except for a ruler, a scholar ... His parent, or a master, establish its dislike.\n104 - And shake hands with every Muslim you meet ... Your sins will scatter as in the Musnad.\n105 - And prostration to other than Allah is not lawful for us ... And kissing the ground is disliked with strictness.\n106 - And bowing when greeting is disliked from you ... And kissing a person's head is lawful, and on the hand.\n107 - And hugging is lawful for the one meeting out of religiosity ... And kissing the mouth is disliked, understand and record.\n108 - And withdrawing the hand quickly from one shaking hands ... And for a group to whisper excluding a single person.\n109 - And for a person to sit by someone speaking ... Secretly. And it was said: Attend, and if he permits, sit.\n110 - And looking at an old woman is not rejected, nor shaking her hand ... And being alone with her, dislike it, but not her greeting, witness this.\n111 - And saying 'Yarhamuk Allah' (Tashmit) to her. And dislike both traits for ... The youth of both genders, very far and farthest.\n112 - And greeting is disliked upon one occupied ... With Dhikr, Quran, and the saying of Muhammad.\n113 - A preacher, one giving a lesson, and those discussing ... Sciences, and one giving a sermon to benefit the monotheist.\n114 - One repeating Fiqh, the Muazzin, after him the ... One praying, and one purifying for an act of worship.\n115 - And leave the eater, with the one defecating, then the one ... Fighting enemies in a war of deniers.\n***",
    "foot_note": "1. Abu al-Wafa is Ali bin Aqil bin Muhammad bin Aqil, Al-Baghdadi, died in the year (513 AH).",
    "book_id": "54"
  },
  {
    "serial_number": "5008975",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "Connecting Ties of Kinship, Kindness to Parents, and Equity between Children\n116 - And be a joiner of ties of kinship even to a hater ... You will be increased in lifespan and provision and be happy.\n117 - And do not sever ties of kinship, for severing ... A relative is a major sin, distancing from Allah.\n118 - So do not join a people where Allah's mercy does not cover them ... A severer resides [there], this has come with a threat.\n119 - And improving character and companionship is good ... Especially for the parent, which is emphasized.\n120 - Even if he is a disbeliever. And obedience to him is obligatory ... Except in forbidden things or for a confirmed command.\n121 - Like seeking knowledge that does not harm them ... And divorcing wives based on mere opinion.\n122 - And be kind to his friends after his death ... And execute wills from him in a good manner.\n123 - And honor him by your seeking forgiveness if you are righteous ... For this is the remains of his accustomed kindness.\n124 - And equity is obligatory between his sons in ... Giving, like inheritance, from every origin.\n125 - And a mother with children is like their father ... Make equity obligatory upon her in distribution, you will be guided.\n126 - And the father, in prioritizing some of his children ... For a valid intent, is not sinful, rather praised (1).",
    "foot_note": "1. In (Z): (Yuhammadi).",
    "book_id": "54"
  },
  {
    "serial_number": "5008976",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "127 - And it is not permissible for a giver to take back a gift ... Even if he was not rewarded, or a completely voluntary giver.\n128 - Except the father regarding the first, and a grandfather regarding a distant one ... And a mother according to a view they extracted well.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008977",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "Prohibition of Astrology, Magic, and Incantations\n129 - And do not follow the science of stars except that which ... Guides to a direction and time of worship.\n130 - For its limit is knowing eclipses, and there is no benefit ... In it for a person of intellect, nor a good purpose.\n131 - And the eclipse of the two luminaries is not a cause ... For anything except frightening us and threatening.\n132 - So do not listen to the fear-mongering of every fabricator ... And deny the judgments of the astrologer and reject.\n133 - And pray the Eclipse Prayer, for it is ... The most established of what every narrator narrates to us.\n134 - And whoever shows magic, like riding ... An inanimate object so it travels under him like a strong horse.\n135 - And claiming the gathering of Jinn in obedience to him ... By his incantations wherever he wills, obediently helped.\n136 - And that the planets in the sky, according to his claim ... Speak to him; he disbelieves, so cut [him] with the sword.\n137 - And two views if nothing appears from his action except ... A mere claim of doing that, attribute it.\n138 - And the magician of the People of the Covenant (Dhimma), keep him with the better ... Of maintaining Ibn al-A'sam the rebellious.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008978",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "139 - And the one who does magic by fumigation or by medicine or ... By potions, if he does not apostatize, discipline him severely.\n140 - And Qisas is taken from him if he committed what warrants it ... And if he does not repent, imprison him, a prison of blocking.\n141 - And from him [Ahmad]: Like a fortune teller, let him be imprisoned, and a soothsayer ... Those of magic absolutely without restriction.\n142 - And the ruling of those with incantations is the rulings of a magician ... And it was said regarding what benefits the monotheist.\n143 - Like dissolving [magic] and incantations, they are tolerated ... For the prohibition is only against the harmful and corrupting.\n144 - And the condition of that which they permitted among those ... Is if it was with permissible, customary speech.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008979",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "Renting Bathrooms, Reading in Them, and Rulings on the Mushaf\n145 - And every reading in the Hammam (bathhouse) is disliked ... And verbal Dhikr, and greeting for an initiator.\n146 - And the rent of a Hammam is lawful [though] disliked ... Like its price, and the contract is not void.\n147 - And raising your voice in supplication or with ... The funeral or in war during intensification.\n148 - And dotting and vowel-marking in a speech for a Mushaf ... And do not write other than it in it, and strip it [of extras].\n149 - And forbid, and from him dislike, renting a Mushaf ... Like selling, and regarding exchange, attribute two views.\n150 - And a prohibition without difference is traveling with a Mushaf ... To a land of wars, like giving ownership to an atheist.\n151 - And forbid leaning on that which ... Contains it, along with books of Hadith, and be strict.\n152 - And permissible is hiring for copying the Quran and ... Hadith and books of Fiqh and poetry, not rejection.\n153 - By a period or estimating its pages with ... Lines and describing the script and margin, limit it.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008980",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "Oiling, Applying Kohl, Tattooing, and Growing Beards, etc.\n154 - And oil yourself intermittently, and apply kohl an odd number of times, you will do right ... Upon every eye in the strong one with Ithmid.\n155 - And change grey hair with other than black, and leave it ... And do not pluck it, for it is the light of the monotheist.\n156 - And that is the warner of a person announcing his departure ... And dislike Qaza' (shaving part of head) then deception of young women.\n157 - Due to a curse upon it, forbid it, like tattooing and filing teeth ... And plucking eyebrows and joining hair with hair, restrict it.\n158 - And men removing hair from the face is disliked absolutely ... And shaving the nape also regarding people, so witness.\n159 - And growing beards is recommended, and it was said: take what ... Is near the throat along with what exceeds the fist hold.\n160 - And cutting, and it was said the best is trimming mustaches ... Contrary to Magians and beardless Rafidis.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008981",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "Circumcision, Covering Vessels, Clipping Nails, and Blessing the Sneezer\n161 - And be knowledgeable that circumcision is obligatory ... With safety in the stronger view, and a decided worship.\n162 - And it is legislated that he does not reach ten uncircumcised ... And doing the act of Jews on the seventh [day] is disliked.\n163 - And do not circumcise the dead without doubt ... And his mustache and armpit and nail, cut them.\n164 - And tying the water skin and covering the vessel is legislated ... And closing doors and extinguishing the fire.\n165 - And clipping nails and plucking his armpit ... And aim for shaving or depilatory agents for the pubes.\n166 - And its remaining after forty [days] is disliked ... And burying all of it is Sunnah, so narrate and follow.\n167 - And perfume with apparent scent is recommended for our males ... And apparent color is sufficient perfume for young women.\n168 - And lowering the voice is good from a sneezer and that ... He covers a face for concealment from the bad.\n169 - And he praises aloud and let a hearer bless him ... For his praising, and let him show the reply of the returner.\n170 - And say to the youth 'May you be healed' after three ... And to the child 'May you be blessed' and order him to praise.\n171 - And cover a mouth and suppress, you will do right in yawning ... For that is Sunnah by the command of the Guide.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008982",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "Medicine and Related Matters, and Warning the One in Whom Greyness Appears\n172 - And trusting People of Dhimma is disliked ... For protecting wealth or for its division, witness.\n173 - And seeking medical treatment from them is disliked without necessity ... And what they compounded of thickened medicine.\n174 - And giving the front seat to a disbeliever in a gathering is forbidden ... And in paths, force him to the narrow part and constrain.\n175 - And say 'Wa Alaykum' if some of them greet ... Answering obligatorily, do not allow it for an initiator.\n176 - And do not ask about the ruling of their children, and if ... You are asked, say Allah knows best regarding a corrupter.\n177 - And there is no harm legally if a Muslim treats you ... And you complain of what you encounter, but begin with praise.\n178 - And leaving medicine is better, and your action is permissible ... In what the prohibition of a single component is not certain.\n179 - For in sickness and afflictions is the greatest wisdom ... Awakening the person of intellect upon inspection.\n180 - The state of affairs calls out: Strive to depart ... From the lean dwelling of much distress.\n181 - The warner of greyness came to you with sickness informing ... That you follow the people today or tomorrow.\n182 - So take preparation in provision, for death is inevitable ... There is no escape from it nor any deviation.\n183 - For this abode of yours is not an abode of residence ... But it is an abode of trial and taking provision.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008983",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "184 - Did there not come to you from your Lord {And take provisions} ... So what is the excuse of the one who met Him without provision?\n185 - For these days are but stages ... Bringing every distant one closer to the Abode of Meeting.\n186 - And whoever travels towards the two obliterated abodes a year ... Then the meeting has drawn near from him, as if it has occurred.\n187 - For people are but like travelers following each other ... A resident for a nap following one leaving in the morning.\n188 - And whoever Azrael is the guarantor of his soul ... If he misses him today, he will not escape tomorrow.\n189 - And whoever's soul in the body is a trust from Him ... Then farfetched is safety hoped for from a returner.\n190 - So what is the right of a person of intellect to spend a night ... Without writing a will and the witnessing of witnesses?\n191 - And making a will is obligatory on a person if there are ... Upon him rights obligatory to return.\n192 - And whoever bequeaths in sin like creating a church ... And writing a Torah and Gospel is rejected.\n193 - And a drinker of wine or a singer and the like of this ... Of help in doing sins for an aggressor.\n194 - And the bequest of the pious and the sinner is the same ... In this, and the bequest of a Dhimmi and a monotheist.\n195 - And there is no harm if the youth hides a shroud for himself ... From lawful means and traces of satisfaction and worship.\n196 - So anticipate the attack of death in earning that by which ... You succeed on the Day of Resurrection, and strive.\n197 - For how cheated is the one cheated of the blessing of health ... And the blessing of the possibility of earning worship.\n198 - So make yourself your own executor, increasing ... For the journey of the Day of Gathering, good provision.\n199 - And imagine the arrival at the grave whenever you see it ... Beneficial for yourself, so send it forth, you will be happy.\n200 - For nothing benefited the human like his earning ... On a Day when a person flees from every origin.\n201 - Sufficient as a deterrent for a person is a definite death ... And a grave and horrors witnessed tomorrow.\n202 - And a blazing Fire Allah promised whoever disobeyed ... So among them is one exiting after misery and one eternal.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008984",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "203 - And the youth is asked in the grave about his Prophet ... And about his Lord and the Religion, the action of a threatened one.\n204 - So whoever Allah makes steadfast answers as a monotheist ... And whoever He does not make steadfast is not a monotheist.\n205 - And that, by my life, is the last of the trials which ... When you escape from it, you have won an eternal victory.\n206 - So we ask Him for steadfastness in this world and the Hereafter ... And an ending that decrees eternal success.\n207 - And announcing death generally is disliked ... 'Attention, Zayd has died', not to the people of affection.\n208 - And sitting of comforters beside him is recommended ... Like slaughtering a camel between a weeper and one helped.\n209 - And the grave robber is [hand] cut for his taking ... The shrouds from the dead from the custody of a grave.\n210 - And beware of prohibited wealth, inheriting it ... You will return with clear loss and grief.\n211 - So you will be miserable with it altogether and burn with it in Hell ... While another enjoys it and is happy tomorrow.\n212 - And hasten to discharge grievances obediently ... And search the era of youth and inspect.\n213 - So woe to you, the most miserable of people, one taking burden ... For others, gathering if you do not take provision.\n214 - And prioritize hope over fear at his despair ... And meet your Lord with good opinion, you will be happy.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008985",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "Visiting the Sick, Prompting the Dead, and Visiting Graves\n215 - And visiting the sick is legislated, so go to them ... You will wade in mercy that covers the gatherings of visitors.\n216 - For seventy thousand angels of satisfaction ... Pray upon the one who visits the sick until the next day.\n217 - And if he visits him at the beginning of the day, they continue ... Upon him the prayer until the night, so attribute it.\n218 - So visit them intermittently and lighten [the stay], and among them is ... The one who prefers lengthening from a loving friend.\n219 - So think and observe in visiting the condition of whom ... You visit, and do not increase questioning, causing distress.\n220 - And remind the one you come to of sincere repentance ... And prompt him at death with the saying of the monotheist.\n221 - And (Yasin) if recited, his death is lightened ... And the burden is lifted from him at burial.\n222 - And pay the debts of the dead legally and distribute ... The bequest of a just person, then intend his preparation.\n223 - And the trustworthy and knowledgeable is chosen for washing ... With the rulings of washing even by following authority.\n224 - And do not reveal a secret the dead prefers concealing ... Except for one of immorality and accustomed innovation.\n225 - And the surplus of what is collected for a dead person belongs to his owner ... And if they are unknown, spend it on another, you will be guided.\n226 - And do not prevent his family from seeing the dead ... And kissing him is the act of the good lover.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008986",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "227 - And consoling the afflicted person is a virtue ... Indicated by the supported Hadith.\n228 - And every crying that is not accompanied by wailing ... Nor listing virtues [lamenting], the one doing it is not an aggressor.\n229 - And tearing the pocket (garment) is forbidden, and slapping afterwards ... Wailing along with lamenting, and count their likes.\n230 - And visiting graves is legislated for males ... And regarding the first [visiting], dislike the speech for young women.\n231 - And he gifts to them what is easy to do ... Of righteousness and Quran, it benefits the one guided.\n232 - And what has been narrated about the visited one regarding his speech ... For how many Mursal and Musnad [hadiths] have come regarding it.\n233 - And perfuming graves and lighting lamps on them is disliked ... And repel from kissing them and taking from their soil.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008987",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "Encouragement to Learn Inheritance Laws and the Ruling on Looking and Related Matters\n234 - And people are but dead and delayed ... So knowledge of the one who has died is half for him, intend it.\n235 - So hasten to the science of inheritance laws, for it is ... The first knowledge to be erased and lost.\n236 - For in establishing the rulings of inheritance is a wisdom ... That guides every directed one to the rulings.\n237 - And if a female falls ill and they find no ... Doctor for her except a man, permit him and facilitate.\n238 - And whatever contains the ailment from her entire body ... Then judge with looking for the proficient doctor.\n239 - And her slave looks at the face of the beauty and the palm ... And the one who has no desire in the confirmed view.\n240 - Due to disease, effeminacy, and old age, so analyze ... And there is no covering from a child for young women.\n241 - And our female child among men is like our male child ... With women, understand what I say and guide.\n242 - And if a female child becomes discerning, then like ... The discerning [boy], the ruling in her applies for the inspector.\n243 - And whatever appears from old women ... Whoever looks at it is not distant [from right].\n244 - Likewise the ruling in the ugly woman and the face of strangers ... And palms, let him look safely in a distant one.\n245 - And everyone has the right to look at his own gender at ... Other than the shameful Awrah, with excess.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008988",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "246 - Likewise regarding a Dhimmi woman with a free woman ... With Muslim women, transmit them, the transmission of the most intended.\n247 - And does [a Muslim] woman look at what is not apparent ... Usually seen from us? Attribute two views.\n248 - And look at the face of the young woman if you are proposing ... And what appears from her usually in the confirmed view.\n249 - And from him: at a face. And from him: and her palm ... Like her Mahram without seclusion, keep away.\n250 - And a bargainer [buyer] looks at every apparent part ... Usually seen, and the head with the leg of young women.\n251 - Likewise in a saying, those with Mahrams ... So be aware and guard yourself and strive.\n252 - And it was said: Let him look at other than what is between a knee ... To a navel in the two forms, so restrict.\n253 - And restricting this to slave girls is prioritized ... Fearing a hidden intentional defect.\n254 - Likewise the ruling of the discerning [boy] without desire ... Otherwise like her Mahram, and from him like a distant one.\n255 - And look at the face of the young woman if you are a witness ... Against her, and if you transacted with her, look at it and conclude.\n256 - And it is forbidden if the looking is for desire ... At everyone I named in the enumeration.\n257 - And everyone has the right to touch all of a wife ... With looking, understand it without restriction.\n258 - Likewise the permissibility of slave girls to their master ... And if she is married, he looks at other than the Awrah.\n259 - And giving an enema to a person is disliked except for necessity ... And he looks at what the injector needs.\n260 - Like a midwife, it is lawful for her to look at ... The place of women's births during delivery.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008989",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "Cutting Hemorrhoids, Cauterization with Fire, Ruqyah, Hanging Bells, Amulets, Treating with Prohibited Things, and Rulings on Animals\n261 - And it is disliked if it doesn't spread, the cutting of hemorrhoids ... And lancing the harm is lawful like a good cutting.\n262 - For gangrene spreading in a limb, amputate it if ... You fear its outcome and do not hesitate.\n263 - And before the harm, not after it, dislike cauterization ... And from him absolutely without restriction.\n264 - Likewise Ruqyah except with verses and what was narrated ... And hanging that is lawful like writing for childbirth.\n265 - And every medicine containing a forbidden mixture ... Is forbidden like Theriac without restriction.\n266 - And branding animals is lawful on other than the face ... And in the [sacred] months dislike cutting an extended tail.\n267 - Like the mane, strictly because of its harm to what ... By your cutting what it defends with, for the distressed one.\n268 - And in other than sheep, they disliked castration ... Because of its torture forbidden in a Musnad [Hadith].\n269 - And cutting horns and ears and splitting them ... Without harm is changing a customary creation.\n270 - And forbid castration of humans, all of them ... Except in retribution from an oppressor and aggressor.\n271 - And it is good in Ihram and non-Ihram to kill what ... Harms without benefit like a leopard and snake.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008990",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Millenary Poem on Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Basha'er Al-Islamiyyah - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "272 - And crows other than [those of] the crops also and their likes ... Likewise insects of the earth without restriction.\n273 - Like bedbugs, fleas, mice, scorpions ... Wasps, snakes, and the like of what is enumerated.\n274 - And killing ants is disliked except with harm ... From them, and dislike burning a spoiler with fire.\n275 - Even if prohibition was said, then permitted with ... Harm that is not removed except by it, I would not consider it far [from correct].\n276 - And throwing fish into fire while not dead is forbidden ... And eat it with what it contains even if not jerked.\n277 - And the companions permitted sun-drying their silk worms ... And smoking out wasps and grilling [locusts] with fuel.\n278 - And it is disliked due to the Sharia's prohibition to kill a frog ... And shrikes, birds like these two, and the hoopoe.\n279 - And water animals are lawful other than frogs ... And crocodile is forbidden in the confirmed view.\n280 - And a confined animal is forbidden and the ... Caged bird for the purposes of an aggressor.\n281 - And if you see a dead fetus in the belly of the slaughtered ... It is lawful. And forbid the seeds in dung more strictly.\n282 - And killing a cat is disliked except with harm ... And if it is owned, then forbid it then, [if it is] not a spoiler.\n283 - And what has harm and benefit like a hawk ... And a dog and a cheetah for the economy of hunting.\n284 - If it is not property, then you have the choice ... And if it is owned, forbid [killing], and if it harms, then kill.\n285 - And what has no benefit nor harm ... Like worms and flies, if it doesn't harm, confirm its dislike.\n286 - And what is lawful for the compelled (Mudtarr) is lawful for the coerced (Mukrah) ... And what is not, then no, other than wines more strictly.\n287 - And with coercion, the actions of the coerced are void ... Except killing and Islam, then Zina, judge.\n***",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008991",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "The Ruling on Eating and Mosques\n288 - Blowing onto hot food is disliked, as is breathing [into the vessel] ... and the wandering of hands in a single [type of] food.\n289 - But if it is of various types, there is no harm, for what ... was forbidden in unity is pardoned in multiplicity.\n290 - Eat with three fingers while sitting ... and dislike eating while standing or reclining.\n291 - And dislike your eating with two fingers or one finger ... and with a foul smell, dislike coming to a mosque.\n292 - Taking, giving, eating, and drinking ... with the left hand, dislike it; and while reclining, add [to the dislike].\n293 - If you build a mosque on a wide road ... with the permission of an Imam, it does not harm; you will be guided.\n294 - Do not build it without excuse, more emphatically ... so stand with the decrees of the Sharia, you will be guided.\n295 - Introducing planting [trees] in a mosque is forbidden ... if you are stopped with its confirmed endowment [conditions].\n296 - If it [the mosque] is in no need of their price, then eat ... otherwise, sell it for its repair and return [the money to the mosque].\n297 - Whoever builds a mosque for Allah, the Dominant ... with lawful money for bowing and prostrators,\n298 - A house will be built for him in the Paradise of his Lord ... so protect it from dirt and bad filth.\n299 - And protect it from a speck, or mucus, and spit ... and decoration from silver and gold.\n300 - Selling in it is forbidden, then buying it [is too] ... and there are two views regarding the validity of a contracted sale.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008992",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "301 - And if a mosque is built between graves ... then forbid it; and in the one built before them [the graves], prostrate.\n302 - There is no harm if one prays for a dead person in a mosque ... and the reciting of poetry from what is permissible for a reciter.\n303 - And eat sitting upon the left [leg] and keeping upright the ... right one; say Bismillah, then at the end, praise [Allah].\n304 - It is disliked to race the people to eat out of greed ... but the master of the house may begin if he wishes.\n305 - And before wiping, lick the hand and the vessel ... it will be blessed, and the dish will ask forgiveness for you; rely [on this].\n306 - And be one who lifts the food before standing; indeed ... standing before lifting the laid-out food is forbidden.\n307 - Gathering the family over provisions increases growth ... for them; and forbid them from eating in isolation.\n308 - There is no harm if a young man stores the nourishment of his family ... for a year; and in this, emulate the Prophet.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008993",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "Hoarding Food and Honoring the Guest and Neighbor\n309 - Do not hoard food, for that is forbidden ... and in other than food, it is not forbidden as emphatically.\n310 - The condition for prohibition is the restricting of a buyer ... upon the people in a time of severe hardship.\n311 - But without harming, it is not forbidden ... like one saving up during cheap prices; witness this possessor of benefit.\n312 - And price-fixing is forbidden, for my Lord is the Price-Setter ... and perhaps price-fixing is a cause for increase [in prices].\n313 - If you eat at a person's house, then supplicate for him ... for the Guide [Prophet] commanded it and supplicated; bear witness.\n314 - Be honoring of bread, not humiliating it ... and make loaves small, and improve the kneading.\n315 - Honor your guest and hasten his meal ... and say 'Welcome'; in this, emulate Ahmad [the Prophet].\n316 - Every person who endures travel knows the right of the guest ... prolonging the journey in every desert.\n317 - He came cold, and the night showing its frown ... aiming for the light of a fire belonging to a good fire-lighter.\n318 - So he comforted him with provisions and showed cheerfulness ... and removed the cold from him by preparing a sleeping place.\n319 - How great is the difference between this and a man whose guest spent the night ... lying down with hunger, kept awake and sipping [on nothing].\n320 - There is no good in one who does not host guests like this ... it was narrated with a chain from the best guide, Muhammad.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008994",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "321 - May Allah fight the miser for his stinginess ... for the guest has a provision arriving that will not be decreased.\n322 - For the Muslim passing by a brother in villages ... and it was said also in cities and hamlets; like a guided one.\n323 - Make hospitality obligatory for a day and a night ... and it was said three [days], and it is recommended with the best [food].\n324 - It is not upon him to house him without ... necessity, other than the lack of shelter such as a mosque.\n325 - If he fears him, it is not obligatory at all except ... if he is compelled absolutely; and let him be cautious for fear of a corrupter.\n326 - Gabriel continued to advise our Prophet ... regarding his neighbors, from relatives and distant ones.\n327 - Until he thought the neighbor would inherit, O young man ... and the closest of them is most deserving of kindness, so do good.\n328 - Whoever's house towers over the neighbor, must ... build [a screen] that covers the lower one from one seeking to climb.\n329 - It is also binding to block a high window even if ... it was there before; and a claim of 'I do not see' do not imitate.\n330 - Whoever refuses, force him to build with his neighbor ... if they are equal in height, with the best [solution].\n331 - There is no liability in the demolition of a wall feared to fall ... that is harmful; and if it is secured, let the aggressor guarantee it.\n332 - Whoever believes in the King, our God ... let him not harm a righteous neighbor, being non-corrupt.\n333 - And prevent him from everything harmful to his neighbor ... like a latrine, a bathhouse, and a burning oven.\n334 - And a blacksmith's shop, and the beating of bleaching ... and a tannery that harms with a distressing smell.\n335 - And from planting that whose roots extend ... to the water well of the neighbor in the established [property].",
    "foot_note": "1. This verse was missing from copy (Z), and affirmed from copy (B) and the printed version.",
    "book_id": "54"
  },
  {
    "serial_number": "5008995",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "336 - Equal are the harmers of self and wealth, O young man ... and hold him liable for what his obstructing action destroyed.\n337 - It is disliked to eat the 'Hajm' (uninvited food) if he watches/waits ... with permission; but without it, present him and then expel him.\n338 - Smile at the guests and joke over the meal ... to remove from him the embarrassment of the distressed.\n339 - Be altruistic if there is scarcity in the provisions ... and do not burden yourself lest you become unable and be blamed.\n340 - With the sons of the world, if you eat, be modest ... and with their poor, prefer them, you will be guided.\n341 - And with the brothers, if you eat, be expansive ... and socialize, and do not mention words that distress.\n342 - Do not tell funny things so they choke ... and do not mention urine or bad filth.\n343 - Do not belittle anything presented for hospitality ... and hastening a small amount is an adornment for the one with little.\n344 - Eating soil is disliked except for medication ... and eating foul-smelling things unless cooked.\n345 - And dislike your eating of the heart's ear (auricle) and glands ... and forbid buying gambling nuts and drive [them] away.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008996",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "Rulings on Fruits, Jallalah (Filth-eating animals), and Etiquette of Drinking and Sleeping\n346 - If a person passes by the fruits of a garden ... without a wall or a watching guard.\n347 - Let him eat, but not carry, even from the branches ... and from Ahmad, forbid [taking] from it other than what is fallen/scattered.\n348 - And from Ahmad, forbid it absolutely without need ... and with it [need], without penalty, eat but do not take provisions.\n349 - There is no penalty on him regarding the permissible ... like eating due to harm [hunger] from a fenced [garden] is excluded.\n350 - Do not eat from the milk of an absent person's cattle ... and crops; regarding the grains, the green ones [are forbidden] more emphatically.\n351 - Crops or fruits you watered with impurity ... are forbidden, or if you fertilized them [with it], most firmly.\n352 - If it was watered after that with pure [water] ... it is permitted; and it was said: dislike it only, do not be harsh.\n353 - Whoever's fodder was mostly from impurity ... and it was said: much of it; forbid it emphatically.\n354 - Its milk and eggs, forbid them ... and from him [Ahmad]: rather dislike it before confining it [quarantine], imitate [this].\n355 - Do not forbid if its fodder was mostly pure ... and do not dislike after a restricted confinement.\n356 - Three days, and it is fed pure food ... and it is disliked before confinement if ridden; witness.\n357 - Whoever does not intend to slaughter the sacrificial animal quickly ... it is permissible to feed it occasionally with bad impure [feed].",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5008997",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "358 - Feeding it meat prohibited [for humans] is permissible ... based on his text, with dislike of all [such acts] being emphasized.\n359 - Coupling dates and the like is disliked ... and it was said: with sharing, not in solitude.\n360 - There is no harm in the youth's satiety when eating ... but extravagance is disliked, and [stopping at] one-third is emphasized.\n361 - It is good before wiping to lick fingers ... and eating fallen crumbs by picking them up.\n362 - It is good for the youth to make the food morsel small ... and after swallowing, take a second, and chew well.\n363 - And picking what is between the places [teeth/fingers] after it ... and cast away and avoid what Allah forbade, you will be guided.\n364 - Washing the hand before food and after it ... is disliked with [using] edible things unrestricted.\n365 - A person's sleep is disliked before washing ... grease and milk from the mouth and hand.\n366 - Eat good things or the opposite, and wear what ... you encounter from lawful things and do not restrict yourself.\n367 - What you dislike, leave it without rebuking ... nor faulting provision, and emulate the Lawgiver.\n368 - Do not drink from the mouth of the water-skin or the crack of the ... vessel, and look into it, and sip by sucking.\n369 - Remove the vessel from your mouth and drink in three [breaths] ... it is more wholesome, healthier, and more quenching for the thirsty.\n370 - Taking, giving, eating, and its drinking ... with his left hand, dislike it; and while reclining, increase [the dislike].\n371 - Handling harm [filth] with the right hand is disliked ... and its dirt, along with blowing the nose's bad contents.\n372 - Likewise removing his sandals with it, and his leaning ... on his left hand behind his back; witness.\n373 - Sleeping after Fajr and Asr, or on ... your back and lifting one leg over the other; extend [the prohibition/dislike].\n374 - Sitting between the shade and the heat is disliked ... and sleeping on the face of the stretched youth.\n375 - Killing the snakes of houses without saying ... three times to it: 'Go safely', is unjust.",
    "foot_note": "1. In the printed version: (Fingers).",
    "book_id": "54"
  },
  {
    "serial_number": "5008998",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "376 - Kill the one with two stripes and the short-tailed snake ... and what is seen after warning or in the desert.\n377 - Sleeping on a roof not surrounded ... by a wall is disliked for fear of destruction.\n378 - Likewise riding the sea during its turbulence ... and taking women on ships in the text of Ahmad.",
    "foot_note": "1. In copy (Z): (Strive).",
    "book_id": "54"
  },
  {
    "serial_number": "5008999",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "Vows, Testimony, Ruling on False Witness and Wine Drinker\n379 - Do not make vows, vows are not Sunnah ... due to their absence from every guide and director.\n380 - Do not think that vows bring good ... rather vows are the extraction from the stingy tight-fisted one.\n381 - The act is not forbidden since fulfillment is recommended ... in the Book of Allah with honest narration.\n382 - Be aware that testimony is a position ... of religion to protect rights from rejection.\n383 - In it is benefit for both parties; the right of this one ... is preserved, and the conscience of the denier is cleared.\n384 - Be cautious of false testimony ... it leads to the wrath of the Dominant [Allah] tomorrow.\n385 - And it necessitates for the one who commits it a standing in the ... Hellfire; Ibn Majah narrated this, trace it back.\n386 - How often the Guide warned the people against testimony ... of falsehood, with threats that came and warnings.\n387 - Did he not say false speech is the highest major sin ... along with Shirk in the text of the two Sahihs? Record it.\n388 - So four [people] perish by falsehood: himself ... and the oppressor, the oppressed, and the judge; be deliberate.\n389 - Sufficient as a deterrent from that for every rational person ... is the fall of the false witness from the eyes of witnesses.\n390 - Taking wages is forbidden in both cases [performing/testifying], and it was said: no ... for poverty; and it was said: if they specified, then follow the performance.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009000",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "391 - Whoever has knowledge of a Hadd (punishment) of his Lord ... then leaving harm is better, but if he wishes, let him testify.\n392 - And if it is a claim [of rights], the reverse; if you fear abundance of ... obscenity or he refuses advice, then obligate it with the best.\n393 - It is recommended for guidance, not for reward ... witness every contract other than what is obligatory.\n394 - Forbidding the testimony of a youth regarding other than what ... he knows at the times of request, imitate this.\n395 - Reject the singer and the jester with those of ... mockery and the dancer; be guided and directed.\n396 - And the player of chess and backgammon for his doing the ... forbidden, and the player of cooing pigeons.\n397 - If he toys with them or gambles ... and steals, prevent him from testimony and reject.\n398 - Whoever keeps them for company or their chicks ... or letters is not prevented due to the validity of purpose.\n399 - And the revealer of secrets regarding intercourse and the like ... and the unveiler of what is customarily protected in public.\n400 - And whoever enters the bathhouse without a waist-wrapper ... and eats among people what is not customary.\n401 - And whoever stretches his legs without necessity ... and addresses women with obscenity in a gathering.\n402 - And the claimer of gathering Jinn, then the astrologer ... and the geomancer, or story-teller, and the renter of the rejected.\n403 - And the player of swings and weight lifting and the ... racer in swimming and customary running.\n404 - If play contains compensation from the ... sides or from some of them, forbid it and block it.\n405 - That is gambling (Maysir); regarding avoiding it ... the command came in the Quran, a threatening command.\n406 - If it is free of betting, some of it is forbidden ... like backgammon and chess and count their likes.\n407 - And it was said: dislike chess, do not forbid; so by ... excess in it reject him, not by a little.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009001",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "408 - There is no harm in play without harm or ... baseness in it like the customary fencing.\n409 - Beware of drinking wines, for they ... blacken the face of the servant today and tomorrow.\n410 - Indeed, drinking wine is a major sin ... removing the attributes of the guided human.\n411 - He is joined with cattle, nay he is lower ... confusing his actions, unguided.\n412 - Every observer mocks him due to the evil of what ... he witnesses of his confusion and dissipation.\n413 - It removes modesty from him and takes away wealth ... and drops into obscenity and the killing of the brawler.\n414 - All attributes of blame are gathered in it ... thus it was named the Mother of Vice; attribute this.\n415 - How many verses inform of its prohibition for one who ... contemplates the verses of the Glorified Book.\n416 - The Chosen One has cursed nine regarding wine ... Abu Dawood narrated it from the best guide.\n417 - And the Lord of the Throne swore He would surely punish ... for it; Ahmad narrated it from Muhammad.\n418 - What has come regarding its prohibition reaches, if ... you contemplate it, the level of Tawatur; be guided.\n419 - Every Muslim has agreed on its prohibition ... so declare Kafir the one who permits it, and make him eternal in the Fire.\n420 - Addiction to it is one of the major sins, so avoid ... perhaps you will attain success and be guided.\n421 - A little of it is forbidden like a lot of it ... and it is not a cure, rather it is the disease; keep away.\n422 - For Allah the Great did not make our cure ... in what is forbidden in the religion of Ahmad.\n423 - Every drink, if a large amount intoxicates ... a little of it is forbidden; count it as wine.\n424 - From whatever thing it was, it is absolutely forbidden ... even if it was cooked without restriction.",
    "foot_note": "1. In (B): (Like culture/fencing).",
    "book_id": "54"
  },
  {
    "serial_number": "5009002",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "425 - Except for the thirst of the desperate if mixed with what ... quenches; and for the one choking, add by consensus.\n426 - Prohibition is not established in what you brewed (Nabidh) ... just before three [days]; drink it as long as it doesn't foam.\n427 - There is no harm in Fuqqa' (barley water/beer) as it is not intoxicating ... nor leading [to it], but if he keeps it, it spoils.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009003",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "Masturbation, Oaths, Slandering Chaste Women and Its Consequences\n428 - Punish (Ta'zir) whoever masturbates without fearing Zina ... nor harm to his body, and threaten.\n429 - And from Ahmad: rather in it, with lack of fear ... is dislike of propriety (Makruh Tanzihi) without strictness.\n430 - Al-Banna transmitted the Takfir of whoever holds the view of ... insulting the Companions of the Prophet Muhammad.\n431 - Beware of the false oath, for it ... surely necessitates Allah's wrath if intentional.\n432 - Obligate [oaths] to save a perishing person from injustice ... and recommendation for a recommended act to reform a corrupter.\n433 - Whoever swears a lying oath to cut off ... the right of a person, anger will be upon him and he will be distanced.\n434 - There is nothing in the Ila' (oath of abstinence) of the one in the right with certainty ... and if he ransoms the Ila', it is more pious; so do good.\n435 - Do not make Allah a shield for yourself ... with lying oaths like the hypocrite, transgressing.\n436 - Increasing and excess of the truthful ... oath is disliked for fear of lying upon repetition.\n437 - Whoever's breaking [of oath] is better, it is Sunnah ... and recommended before the Judge for the rightful owner to ransom.\n438 - There is no harm in his oaths with his truthfulness ... and interpretation (tawryia) does not benefit every aggressor.\n439 - Forbid, and it was said dislike, swearing by other than the ... God; whether you attributed to him or did not restrict.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009004",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "440 - Expiation is not obligatory for the breaking of a swearer ... except the one swearing by Allah, my Lord and Originator.\n441 - Oaths of the non-competent (Mukallaf) are not binding ... [even if] intending its consequence, even if not accustomed.\n442 - Recommendation, and it was said obligate, fulfilling the oath of a swearer ... without harm; or outwardly show it, imitate.\n443 - Whoever seeks means (Tawassul) by the God, answer, you will be right ... without harm, what the best Guide enacted.\n444 - Indeed, slandering chaste women is a major sin ... the text came regarding its gravity with threat.\n445 - O Nation of the Guide, will you not desist from ... sins in which is the confinement of customary modesty?\n446 - That is the consequence of injustice from every oppressor ... and the consequence of Zina, then Usury and excess.\n447 - It encompasses with what the punishment reaps others besides us ... here and tomorrow; every aggressor suffers by it.\n448 - The slanderer of the Mother of the Chosen One, kill him absolutely ... even if he was a Muslim or a Jew.\n449 - And his slanderer too, and that is apostasy ... and Islam does not drop killing, most emphatically.\n450 - If he was a disbeliever then accepted Islam, spare him ... in the first [instance], and with Allah he who is guided succeeds.\n451 - Whoever repents from slandering a person before his knowledge ... and his analyzing (forgiving), is not absolved in the confirmed view.\n452 - Fear Allah regarding oppressing people and beware of it ... and fear the Day of the oppressors biting on the hand.\n453 - Do not think Allah is unaware of that ... but He gives respite to whom He wills until tomorrow.\n454 - Do not be deceived by forbearance toward the oppression of an oppressor ... He will seize him with a severe seizure and with power.\n455 - Indeed, oppressing people is a grave sin ... the text came regarding its prohibition with threat.\n456 - Forgiveness is hoped for other than oppression tomorrow ... and if the oppressed wishes, he takes retribution tomorrow.\n457 - Whoever was stingy with his wealth in the world ... how will he be on the Day of eternal punishment?\n458 - Do not be deceived by who is forgiven in the worlds ... and fulfill the rights of people, you will be safe and guided.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009005",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "459 - If a person's debt is by consent ... when not fulfilled, it remains; how then with a witness?\n460 - Whoever kills the adulterer with his wife, there is no ... retribution (Qisas) upon him regarding the wrongdoer nor blood money.\n461 - If the guardian does not believe him nor does he bring ... evidence of the aggression, make him liable and guide.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009006",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "Killing Unjustly and Its Consequences and Returning to Allah Almighty\n462 - Beware of intentional killing of a believer unjustly ... for that is, after Shirk, the greatest corruption.\n463 - Sufficient as a deterrent from it is the threat of the Capable ... with Fire and Curse then eternal abode for the aggressor.\n464 - For Abdullah [Ibn Abbas] has spoken regarding it interpreting ... negating the repentance of the intentional killer.\n465 - And his eternal abode in the Fire without exit ... and other than him said: if he is recompensed, he is eternal.\n466 - Otherwise, Allah's pardon for other than a polytheist ... is vast as He informed in numbered verses.\n467 - You seek forgiveness from Allah the Great with repentance ... and raise the palm of the exhausted seeker of aid.\n468 - And pray the prayer of the humble with desire ... the prayer of a drowning person alone in the darkness of the night.\n469 - For the One you call upon provides for the one who disobeyed ... and is the Opener of a door for the obedient and the aggressor.\n470 - But sincerity of hope is the keys of the ... treasures, so call and seek the Bounty and strive.\n471 - And say with brokenness knocking on the door of a Merciful ... Near, Responsive, Who begins with favors.\n472 - My God, the sinners have come to Your door as a refuge ... hoping for pardon from You, my Lord and Master.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009007",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "473 - To You we have fled from Your punishment in dread ... so do not drive us away from Your side, and make happy.\n474 - We called You for the matter which You are guarantor ... of answering, O You who never breaks a promise.\n475 - To You we have extended our palms with hope ... far be it from You to return the youth empty-handed.\n476 - Whoever weeps from fear of Allah, say to him ... you have extinguished a blaze and acquired all worship.\n477 - For an eye that wept from fear of Allah is forbidden ... to the Fire in the text of the correct Hadith.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009008",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "Prayer and Related Matters; Whoever Denies It or a Pillar of Islam, or Denies Allah's Lordship, Mocks Him, or Claims Prophethood\n478 - Maintain the five prayers, for they ... are the most emphasized obligation on every guided person.\n479 - There is no license in leaving them for a competent person ... and the first thing one is held accountable for tomorrow.\n480 - By neglecting them, a person necessitates his joining ... with Pharaoh along with Haman in the worst abode.\n481 - Our Prophet continued to advise regarding prayer ... at death until the tongue became weary of speech.\n482 - Order the seven-year-olds with it, and at ten, strike ... and from him [Ahmad]: thus obligate them and be strict.\n483 - And obligate their guardian to order them with it ... and validate the prayer of the conscious among them, you will be right.\n484 - Missing it or part of it by a competent person ... is forbidden except for combining or a missing condition.\n485 - Whoever denies the obligation, declare him Kafir if he wills ... in the Abode of Guidance among the people of worship.\n486 - Likewise everything agreed upon regarding its ruling when ... it is apparent, not the hidden remote one.\n487 - So whoever denies the Pillars or the prohibition of Zina ... and wine, and denies the lawfulness of water and bread.",
    "foot_note": "1. In copy (B): (One).",
    "book_id": "54"
  },
  {
    "serial_number": "5009009",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "488 - And their likes from apparent rulings agreed ... upon; for ignorance, inform him and guide.\n489 - So whoever does not repent or is not ignorant of the like ... regarding what he denied, he disbelieves; so cut with the sword.\n490 - And the abandoner of one of the five out of laziness, and his fasting ... and Hajj, Zakat, intending eternal abandonment.\n491 - And postponing it while thinking death comes before it ... if he does not repent, kill him as a disbeliever according to the furthest [view].\n492 - Whoever denies the Creator or an Attribute of His ... or some of the Books of the One God.\n493 - Or the Messengers, or whoever insults Him or His Messenger ... even if joking, he disbelieves like the intentional one.\n494 - And one who mocks Allah or a verse of His ... or the Messengers, declare him Kafir and punish even if guided.\n495 - Claiming a partner or a father or a consort ... for Him or a child; count all this as Kufr.\n496 - A claimant to Prophethood also disbelieves ... and everyone who assists in believing him disbelieves.\n497 - Whoever makes lawful the forbidden without ambiguity ... regarding life and wealth, declare him Kafir, you will be guided.\n498 - If he made it lawful by interpretation ... there is no Kufr until it is clarified by a guide.\n499 - Whoever eats pork or the like, do not ... declare him Kafir, O this one, by mere eating.\n500 - Whoever shows Islam while Kufr is internal ... that is a Zindiq (heretic); when he repents, reject [or accept].\n501 - Likewise the ruling of one whom they declared Kafir due to his magic ... and one whose Kufr repeats after being guided.\n502 - Whoever insults the Lord of Creation or a Messenger of His ... confirm the killing of these without hesitation.\n503 - From Ahmad: accept the repentance of the group if ... truthfulness appears to you, like original Kufr, be guided.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009010",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "Adhan, Voluntary Prayer, Quran Recitation, and Friday Prayer\n504 - Say like the Mu'adhin when you hear him ... and say 'Hawqala' (La Hawla...) when he says 'Hay'ala' (Come to prayer...), you will be rewarded and guided.\n505 - Upon finishing it, ask for Wasila ... for the best of mankind, you will be given intercession tomorrow.\n506 - After the call, before the Iqamah, supplicate ... the supplication is answered in this without hesitation.\n507 - Of the best of it is that you ask for pardon, O young man ... and well-being in this world and the Hereafter; strive.\n508 - The virtue of a person's Adhan exceeds Imamate ... and the reverse was said; choose and do well.\n509 - The best of a person's voluntary prayer is at night in his house ... so stand after half like David, and prostrate.\n510 - Do not leave the night empty of an obedient one's Wird (portion) ... with your Hizb reciting silently, improving it.\n511 - If you wish, recite aloud in it as long as you don't fear harm ... to drive away Satan and wake the sleepers.\n512 - Take the amount of the soul's capacity, do not bore it ... and take a nap to help with sleep for Tahajjud.\n513 - If you do not pray, remember Allah striving ... and repent and ask relief from what you committed, and be right.\n514 - There is no good in a servant who sleeps until Duha ... is he not shy of a Master who is Watchful in observation?\n515 - Calling him: Is there a requester to be given his request ... and a seeker of forgiveness to be forgiven and supported?",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009011",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "516 - Finish [the Quran] in seven [days], it is better, and do not increase ... over a third in a day, you will hit the Sunnah of Ahmad.\n517 - For a little with the contemplation of a reciter ... is more pious, so do not rush like poetry and narrate quickly.\n518 - Do not recite, if you lead, contrary to what ... the people of that time are upon; you will be detested and distanced.\n519 - Avoid Hamza and Al-Kisa'i's letter (recitation style) ... for both are disliked in the confirmed [view].\n520 - Reading with melodies like singing is disliked ... and if you change a letter, forbid and be strict.\n521 - Read however you wish without ritual impurity ... and with purity is better, and dislike the bad place.\n522 - Substituting speech with a verse is forbidden ... benefitting the one you addressed to attain a goal.\n523 - Delaying completing [the Quran] beyond forty [days] is disliked ... without excuse according to the text of Ahmad.\n524 - If he fears forgetting it, forbid; and it is Sunnah ... to complete in the beginning of the night in winter, O Adi.\n525 - In summer, reverse; then gathering his family ... at the completion is beloved, and he supplicates and praises.\n526 - Prostration is prescribed for gratitude for a pure person ... for repelled evil or renewed favor.\n527 - Pray the Istikhara prayer if you intend a matter ... and if you supplicate afterwards with the reported [Dua], you will be guided.\n528 - Whatever need arises, pray and supplicate ... for how many Mursal and Musnad [hadiths] came regarding this.\n529 - Maintain six [Rak'ahs] between the two 'Isha's (Maghrib/Isha) ... and pray with Tasbih as came, you will be praised.\n530 - Cutting voluntary prayer without need is disliked ... and from Ahmad: forbidden like a confirmed obligatory [prayer].\n531 - Hasten to erase sins with the two Rak'ahs of ... Repentance as came, and supplicate, you will be guided.\n532 - Indeed, the pillar of religion is sincerity of intention ... otherwise, one turns away with fatigue, empty-handed.\n533 - Beware of preceding the Imam, for it is ... the snatching of Satan during worship.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009012",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "534 - He strove in negligence, then when you disobeyed him ... he rectified by striving in arts of corruption.\n535 - In the five [prayers], bind men in the most correct view to the ... congregation, not a slave; and [as] a condition most emphatically.\n536 - The prayer of old women in congregation is not disliked ... with us, rather for the sake of benefit.\n537 - A person's supplication after his prayer is recommended ... whatever he wills for the world and religion; so strive.\n538 - Beware of negligence in Friday [prayer] by which ... the Lord of the Throne distinguished the nation of Ahmad.\n539 - In its day, He gives increase to a winner ... so he sees Him without 'how'; so record.\n540 - In leaving it without excuse three times ... rust covers the heart of the heedless distanced one.\n541 - Ghusl is prescribed on its day when intending it ... and perfume, cleaning, and wearing new clothes.\n542 - And coming early walking, approaching his Imam ... praying and increasing in arts of worship.\n543 - Supplicating and reading Surah Al-Kahf, increasing ... prayers upon the best of mankind, Muhammad.\n544 - No one steps over people except their Imam ... or seeing an empty place in the confirmed [view].",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009013",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "Zakat, Fasting, and Related Rulings\n545 - Take the knowledge of Zakat rulings, the peer of Prayer ... in the verses of the Glorified Book.\n546 - Sufficient for you in its preference is the benefit of others ... by conquering desire whose whisper is not repeated.\n547 - Separating what you love in compliance by giving it ... releases the youth from seventy blaming jaws.\n548 - Pay the Zakat of wealth while alive, willingly ... and do not leave it for gloaters and enviers.\n549 - It is prescribed for your relatives who are not heirs ... according to needs and closeness, to be supported.\n550 - After them, prioritize the scholar and neighbor ... and observe those with needs and modesty, you will be guided.\n551 - Paying it to his partner is not sufficient ... nor to whom he supports from relative or distant one.\n552 - Nor the shroud of the dead, nor for their debts ... nor like blocking a breach or repairing a mosque.\n553 - It is strictly forbidden to protect his wealth with it ... or repel blame or to acquire praise.\n554 - That is voluntary charity secretly with surplus ... from the self along with the confirmed sustenance of the family.\n555 - It is Sunnah, and in needs or their month of fasting ... and for the neighbor and relatives, even if they harm; emphasize.\n556 - He sins in harming self and dependents ... and delaying a creditor in demanding payment, procrastinating.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009014",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "557 - If you are patient and have good trust ... and leave asking, give all of it if you wish.\n558 - Otherwise, you sin by giving all of it ... and restricting the unaccustomed is disliked.\n559 - Allow a person to ask for what is permissible to take ... and from him [Ahmad]: forbid regarding the one with dinner and lunch; imitate.\n560 - What comes without looking forward to it or asking ... is Sunnah, and acceptance is not obligatory most emphatically.\n561 - It is disliked with looking forward to it; and permissible ... upon Kufr is giving charity in the text of Ahmad.\n562 - Take in explaining Fasting without falling short ... a secret worship contrary to accustomed nature.\n563 - And patience for losing the familiar from the state of childhood ... and weaning from the beloved and habitual.\n564 - So He fulfills the ancient promise for the one who ... Fasting is His, He rewards without breaking a promise.\n565 - Maintain the month of Fasting for it is ... the fifth pillar of the religion of Muhammad.\n566 - The gates of Hell are closed when it comes ... and the gates of Paradise are opened for the happy.\n567 - Punishment is lifted from the people of graves ... and every aggressive devil is chained in it.\n568 - Provision is expanded in it for all creation ... and doing every act of worship becomes easy in it.\n569 - The Gardens of Bliss and their Hoor are decorated ... for the people of satisfaction in it and the people of Tahajjud.\n570 - Allah the Great distinguished it with a night ... favored over a thousand months, so let it be watched for.\n571 - Rub in dust the nose of the one cutting the month in negligence ... and honor the reward of the sincere worshiper.\n572 - Stand its night and cut your day fasting ... and protect its fast from every distortion and spoiler.\n573 - Abandoning false speech among people is obligatory ... but from a fasting person, it is confirmed.\n574 - If he is insulted, legislate his saying 'I am fasting' ... to remind self or to preach to an aggressor.\n575 - Whoever fears hunger, thirst, or ... harm of lust, breaks fast and makes up, and pays no ransom.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009015",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "576 - If you seek the highest Fasting voluntarily to fast ... then a day and a day, aim for David's fast.\n577 - And from every month, fast its three white [days] ... and a Thursday then the Mondays; intend.\n578 - And following the month of Fasting with fasting six ... suffices for a year, consecutive or separated.\n579 - Fasting the Day of Arafah suffices for two years ... and attribute regarding the Day of Ashura with a year.\n580 - In Arafat, breaking fast is prescribed for strength ... for supplications at the best scene.\n581 - Fasting the Ten and the month completely is prescribed ... if you seek, so the Muharram, continue it.\n582 - If you restrict, fast its tenth, then if it is easy ... its ninth with the tenth, or follow this.\n583 - Perpetual fasting and Saturday alone are disliked ... and singling out Rajab and Friday alone.\n584 - Completing voluntary [fast] absolutely is good ... and allow breaking it; if you make up, do well.",
    "foot_note": "1. This verse fell from (Z), and affirmed from (B) and the printed version.",
    "book_id": "54"
  },
  {
    "serial_number": "5009016",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "Hajj, Jihad, Related Matters, and Repelling the Aggressor from Family and Wealth\n585 - Hasten with the life's obligation before its expiry ... with Hajj to the Ancient House, emphasized.\n586 - Hajj is nothing but the Intent, a specific intent ... worship of submission and pure devotion.\n587 - Hearts whose supplication is answered yearn ... for the Truthful, the Pious, the Friend [Abraham], the Glorified.\n588 - He came with a specific [call] in the supplication, partial ... and had he generalized, longing would have flown with people immediately.\n589 - Hearts yearn for the landmarks of Mecca always ... going and returning to the Caller.\n590 - Men and riders on every lean mount ... answering the Call of Truth from every source.\n591 - Longing flies with them to that Sanctuary ... to obtain the promise of benefit in the best scene.\n592 - For all of them, a dear self became easy ... and family and wealth from new and old.\n593 - They accepted crossing deserts over extended shade ... where the expert remains unguided.\n594 - Hot wind in a featureless desert was sweet to them ... alongside what they seek.\n595 - The scorch of midday heat becomes easy for them ... like the desertion of a lover hoping for a true promise.\n596 - Every lover who met desertion with contentment ... will harvest what pleases him from every goal.\n597 - How many of easy living, love moved him ... so he stood with burdens of hope, hungry and thirsty.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009017",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "598 - Nothing bends his resolve from his quest ... when the Caller announced the connection of maidens.\n599 - Sleep flew from them hoping for their union ... and longing for the grave of the Prophet Muhammad.\n600 - May Allah forgive me, how often I bid farewell traveling ... to him, while my sin imprisons and binds me.\n601 - I carried burdens weighing down my rise ... but I hope for the overlooking of my Master.\n602 - My thought of the Generous is beautiful, and my provision ... is the Intercessor of mankind in the standing of Gathering tomorrow.\n603 - Even if destinies bent my resolve from travel ... my longing for him is constant and confusing.\n604 - My hope is that He grants a visit ... so I reach my goal from those rites.\n605 - And kiss the traces of the Prophets humbly ... and spread my palm for supplication and strive.\n606 - Whoever performs Hajj with forbidden wealth repeats it ... likewise an apostate who returned, more emphatically.\n607 - Abandon obscenity and sin, and likewise ... arguing, and reduce your speech, you will be praised.\n608 - Mecca is more deserving of preference, and from him: nay ... the city of the best of creation, the resting place of Muhammad.\n609 - Raise both your hands upon seeing the Kaaba ... magnified, high, and say Takbir and Tamjid.\n610 - Call with a humble heart, supplicating ... whatever you wish of all Dua without transgression.\n611 - Ask Him for acceptance of Hajj and pardon, and call Him ... say Takbir and Tahlil facing the Black Stone.\n612 - It is recommended for him to enter the House barefoot ... and increase voluntary prayers in it and worship.\n613 - Glance at it as much as possible there with his eye ... and increase performing Umrah and strive.\n614 - Drink from Zamzam whatever you wish, indulging ... say Bismillah and ask what you seek and take provision.",
    "foot_note": "1. May Allah forgive the poet, would that he had not mentioned such speech. See the following comment on p. 82.",
    "book_id": "54"
  },
  {
    "serial_number": "5009018",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "615 - Upon leaving, perform the Tawaf of Farewell ... and stand afterwards between the Door and the Corner [Multazam], be guided.\n616 - Call a Generous One who invited His delegation to ... His prizes in His House, so call and strive.\n617 - Say: O my God, we have come to You hoping for ... promises of truth from a Generous Accistomer.\n618 - This is the station of those seeking refuge from Hellfire ... by Your pardon, O Bestower, O Coverer.\n619 - By Your aid we came over every subjected thing ... so grant satisfaction, O Lord, before distancing.\n620 - This is the time of marching from Your House which ... we leave unwillingly; whenever You wish, we ransom.\n621 - A separation of necessity, not a separation of asceticism ... nor desire away from it nor from You, my Master.\n622 - We have no desire, praise be to Allah ... other than You; so we have become rich with provision.\n623 - Do not make it the last covenant between us ... and ease the travel for us in every desert.\n624 - Ask all that you desire of religion and world ... you will attain it whenever you call with true intent.\n625 - Send blessings upon the best of Prophets whenever ... you supplicate, it will be another [means] to achieve the goal.\n626 - After finishing Hajj, intend a visit ... to the best of creation with his two bedfellows, so aim.\n627 - Touching the grave is disliked, O friend, absolutely ... stand facing Qibla and limit the pulpit to the left.\n628 - Send blessings and peace in the sanctuary of his shrine ... upon them and ask seeking intercession by Muhammad.",
    "foot_note": "1. May Allah have mercy on the poet, he followed what the later scholars of the Madhhab followed, and they have no proof for the correctness of what they said. Whatever hadiths narrated regarding visiting his grave (peace be upon him) are all weak by consensus of scholars, rather fabricated. Setting out solely to visit his grave (peace be upon him) is not permissible by consensus of the people of the preferred centuries. As for his mosque, it is one of the best deeds. If a Muslim enters the Prophetic Mosque, he greets the Prophet (peace be upon him) and his two companions (from the margin of the printed version).\n2. Like saying: O Allah, grant intercession to Your Prophet regarding me. Likewise seeking intercession by his love and following him. As for by his essence (peace be upon him), none of the Salaf said it (from the margin of the printed version).",
    "book_id": "54"
  },
  {
    "serial_number": "5009019",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "629 - Upon him is Allah's blessing then His peace ... and his Companions and the Family from every noble one.\n630 - Jihad against Kufr is a collective obligation ... and after the obligation, it excels every worship.\n631 - Because in it is fortification of Ahmad's religion ... and the virtue of general benefit over the restricted.\n632 - To Allah belongs he who sold his self to Allah ... and a youth's generosity with self is the utmost generosity.\n633 - Whoever goes out, if he gains spoils, it is reward and spoil ... and if he perishes, he wins eternal bliss.\n634 - No doer of good desires return when he dies ... except the martyrs so they may strive in increase.\n635 - For the virtue of what they were given and attained of satisfaction ... exceeds wishes in eternal bliss.\n636 - Sufficient is that they are alive with Allah; their soul ... goes and returns in the Gardens of Bliss.\n637 - A morning or evening journey of a Mujahid ... is better than the world by the saying of Muhammad.\n638 - Expiated from the seeker of martyrdom on land is everything except ... the rights of people; and everything in the sea; so strive.\n639 - The Chosen One was asked about the pain of their killing ... he said: he sees it like a single pinch.\n640 - The wounds of Allah's warriors, their bleeding colors ... are blood, and like musk is their scent wafting tomorrow.\n641 - The dust of Jihad does not gather in a person's nostril, O youth ... with the smoke of Hell of the thirsty.\n642 - Like one who fasted and did not break, and stood and did not sleep ... is the Jihad of the youth in virtue when counted.\n643 - How different is the one lying in his bed ... and the wakeful-eyed whose night is on a barren [horse back].\n644 - Defending the people of guidance and their sanctities ... and their wealth with self, wealth, and hand.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009020",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "645 - Whoever fights enemies to elevate our religion ... this is in the path of Allah, no other; record.\n646 - Naval raids excel desert raids ... and with a corrupt [leader] take precaution, so raid like a guided one.\n647 - Whoever seeks a person's life or his wealth or the ... harem, beast or youth seeking rejection.\n648 - Obligate defense of the harem for the capable, not ... of wealth; and cite two views regarding life.\n649 - Our Sheikh preferred surrender during civil strife (Harj) ... and verify the defense against the thief and imitate immunity.\n650 - He defends with the least when he thinks he can repel him ... with that; otherwise let him increase and be severe.\n651 - Start with advice, then hit with a stick ... if it does not avail, cut him with the sharp [weapon].\n652 - Fight him with arrows if you fear his plot ... if he comes close, defend with whatever you wish and drive away.\n653 - If you hit him after sufficiency of his evil ... you are liable for what arises from the excess.\n654 - There is nothing [penalty] regarding the aggressor killed while attacking ... and whoever killed the aggressor is to be counted a martyr.\n655 - There is no difference between the thief entering his house ... and one attacking aggressively in a desert.\n656 - Nor between his minimal wealth and much of it ... and whoever defended the compelled person is an aggressor.\n657 - Obligate in the stronger [view] defense of her wealth for the one ... compelled to it like eating from it with the best.\n658 - It is binding on one capable of repelling an aggressor ... against another to repel for safety from destruction.\n659 - There is nothing in what aggression permitted killing ... competent person or animal, fools and ...\n660 - No fine in the killed for repelling his evil ... if the killer did not neglect in excess.",
    "foot_note": "1. This word fell from (Z).",
    "book_id": "54"
  },
  {
    "serial_number": "5009021",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "661 - Whoever ties an animal in narrow ... paths, let him guarantee what it destroyed; do not restrict.\n662 - Two views regarding absolute [liability] if it was wide ... likewise in acquiring a biting dog in the best [view].\n663 - Likewise the ruling in a cat hunting birds, not ... if it urinated in something and licking of the initiated.\n664 - If a person lights a fire in his property ... and runs his water on it without aggression.\n665 - There is no fine of damaged [property] to his neighbor ... by it, except with his negligence and excess.\n666 - Creating what is harmful to his neighbor is prevented ... and he guarantees what he destroyed with renewed prohibition.\n667 - No fine in throwing [water] in a passage in muddy [ground] ... and its likes from beneficial non-harmful.\n668 - The creator of what harms a path guarantees ... and from melon peels and spilled water.\n669 - Whoever brings a person in to host him ... and he falls into a well at his place not marked.\n670 - And he did not see due to blindness or its covering ... guarantee him as long as the man did not warn; be guided.\n671 - Whoever usurps land, forbid entry to it ... to other than the owner of the land if fenced; emulate.\n672 - If not fenced, entry into it is permissible ... and taking grass from it according to Ahmad's text.",
    "foot_note": "1. Meaning: Damaged.",
    "book_id": "54"
  },
  {
    "serial_number": "5009022",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "Usury, Loan, Endowment, and Manumission\n673 - Beware, beware of Usury, for a dirham ... involves punishment more severe than your Zina with buxom women.\n674 - Wealth of Usury is obliterated even if it grows ... and a little of the lawful grows in true promise.\n675 - Its eater with its feeder with its scribe ... cursing them came regarding it along with witnesses.\n676 - If you lend something, it is double recommended ... like two times except five [part] giving of generosity.\n677 - If you borrow, be best in repayment to a lender ... for the best of people is the best in return.\n678 - Borrowing is disliked for the one bad in repayment ... and for the easy one there is no harm, and emulate the Lawgiver.\n679 - How excellent is lawful wealth for one guided ... to spending in accustomed doors of righteousness.\n680 - That is Allah's bounty He gives to whom He wills ... and of a man's best righteousness is perpetual endowment (Waqf).\n681 - If a youth's acts of righteousness cease, it comes ... to him as a companion at the loneliness of the solitary.\n682 - Of the greatest recommended acts is manumission, and best is ... male slaves; and from him: nay, female slaves for maidens.\n683 - It is worthy to strive for freeing a slave ... to be freed from the Fire of Hell and emulate.\n684 - Recommended without dispute is freeing a religious ... strong one with earnings, trustworthy in solitude.\n685 - Do not be a hoarder, preventer, multiplier ... and hasten to spend wealth in obligation and begin.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009023",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "Earning Lawful Wealth, Avoiding Unlawful, and Blaming Miserliness\n686 - Beware of unlawful wealth as inheritance ... for its spender in righteousness, you suffer and he is happy.\n687 - You are counted, by my life, the loser of people in deal ... and most of them in fraud and biting the hand.\n688 - Hasten to offer your wealth obediently ... healthy, stingy [with life], desiring provision.\n689 - Do not fear missing provision, for Allah guarantees ... provision for you as long as He keeps you today and tomorrow.\n690 - Indeed, these monies in the earth are a gift ... like the gift of one who gives bounties and begs.\n691 - By it the generous man is known from the ... stingy youth, and the greedy from the ascetic.\n692 - Possessors of trusts are known by it ... and every traitor wears affectation.\n693 - He shows people doors of asceticism as an ornament ... and strives to acquire the asceticism-inducing debris.\n694 - He has leaps in acquiring his debris ... even if he owned the flood, he would not be given drink from thirst.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009024",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "695 - Exalted is the Generous Allah that there be seen for Him ... a stingy ally, clutching palm and hand.\n696 - The worst of a man's traits is greed and his miserliness ... distances him from Allah, so woe to the distanced.\n697 - Indeed, the generous of people is beloved among them ... close to goodness, far from badness.\n698 - His generosity covers the man's faults among people ... and miserliness obscures the mention of the noble; keep away.\n699 - Hasten to gain heights and leave a youth ... who slackened from heights to gain small amounts.\n700 - Wealth is nothing but like shadows in movement ... so hasten to spend before dispersion.\n701 - Do not think spending decreases what came ... nor miserliness is bringer of wealth and increase.\n702 - Do not hoard lest it be hoarded against you, and spend ... Allah will expand provision for you and you will support.\n703 - Do not leave a door of righteousness closed ... you will meet tomorrow the door of satisfaction not locked.\n704 - Transferring ownership of a man's wealth during his life ... without compensation is called gifts of generosity.\n705 - That, by my life, is a recommended gift ... uniting people despite distance.\n706 - It extracts rancor of hearts and plants ... love in them for the generous youth.\n707 - Specifying a scholar with it and kinship ... is more pious; and whoever boasts with it, dislike and criticize.",
    "foot_note": "1. This verse fell from (Z).",
    "book_id": "54"
  },
  {
    "serial_number": "5009025",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "Judiciary, Etiquette of Clothing and Sleep, Wearing Wool and Silk\n708 - Be aware that judges are three ... a judge worthy of eternal bliss.\n709 - That is one who became knowledgeable of the truth ... and is just in judging cases, so he is guided.\n710 - And a judge who became knowledgeable of the rule of truth ... but he is unjust in it and transgresses.\n711 - And another judges ignorantly; both ... have the Fire in the text of the correct Hadith.\n712 - Every ignorant one regarding judiciary ... it is forbidden for him, so let him be warned and threatened.\n713 - Take a path for safety and avoid ... assuming judgeship, protect yourself and retreat.\n714 - All mandates of people are regret ... except whom Allah, the Dominant, protects tomorrow.\n715 - Sufficient as a deterrent for a youth hoping safety ... is questioning about the flock; understand, be guided.\n716 - Did not Umar, the correct scholar, say ... 'I wish I could escape evenly from destruction?'\n717 - Be aware that judiciary is a virtue ... and great reward for the supported truthful one.\n718 - For enjoining good and uncovering injustice ... and reconciling between people with rebuking the aggressor.\n719 - If he expended rightful effort, if correct he wins ... two rewards, and the mistaken has one; emulate.\n720 - Forbid bribery for him and accepting it ... and you, to repel injustice, bribe to ransom.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009026",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "721 - Clothing of fame is disliked for the wearer ... and what describes skin, not for a husband and master.\n722 - If it reveals Awrah to others ... that is prohibited without hesitation.\n723 - The best of man's traits combined is moderation of ... matters and a state between worse and better.\n724 - Clothing with a living being depicted is forbidden ... embroidery and dye in the most correct of hesitation.\n725 - It is disliked in a curtain, ceiling, and wall ... and no harm in what is trodden and pillowed.\n726 - It is disliked for a person to prostrate with his face ... on an image depicted in a carpet.\n727 - With that, the Grandson of Al-Majd gave fatwa due to its resemblance ... to idol worshippers; prostrate on other than it.\n728 - Whatever has a cross depicted is disliked ... and all this for men and buxom women.\n729 - Wearing waist-wrappers and leather socks standing is disliked ... likewise touching of two naked in a bed.\n730 - And two [women]; and separate in beds between them ... even brothers after ten, be guided.\n731 - Say in waking, morning, and evening ... and sleep, from the narrated whatever you wish, be guided.\n732 - Whether in travel or residence, do not ... leave the litany of good narrated from Muhammad.\n733 - It is good at sleep to shake his bedding ... and sleep on the right and kohl with Ithmid.\n734 - Travel barefoot or shod, walk and ride ... live roughly (Tam'adad) and toughen up, and do not get accustomed.\n735 - For the servants of Allah are not soft ones ... beware of softness with the dress of deniers.\n736 - Be thankful to Allah and satisfied with His portion ... you will be rewarded and increased in provision and spite of enviers.\n737 - The longest of a man's tail is to the ankle, and women ... without waist-wrappers a span or cubit to add.\n738 - The most noble clothing is to mid-calf ... and what is below ankle, dislike it and raise.\n739 - To the wrist was the sleeve of the Chosen One; if loose ... it ended at the tips of his fingers properly.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009027",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "740 - For a man, forbid female clothing and vice versa ... due to curse on him, and dislike it remotely.\n741 - There is no harm in wearing trousers as covering ... more complete than wrapping; wear it and emulate.\n742 - With the Sunnah of Abraham in it and Ahmad ... and his Companions; and make waist-wrappers famous and confirm.\n743 - The turban of one leaving his chin empty of turning (Tahanuk) ... according to Ahmad is definitely disliked.\n744 - It is good to let the tail hang behind him ... even a span or less according to Ahmad's text.\n745 - The best clothing is white for dead ... and living; so whiten absolutely, do not blacken.\n746 - There is no harm in dyed [cloth] before washing it ... with ignorance regarding dyes of Jewish people.\n747 - It was said: dislike it like used vessels ... and if you know impurity, wash it, be guided.\n748 - Deep red and safflower-dyed, dislike ... for men's wear only in Ahmad's text.\n749 - Do not dislike in his text what you dyed ... with pure saffron, color of rose.\n750 - There is no harm in wearing wool nor the Qaba (outer garment) ... even for women, and the Burnus; understand and emulate.\n751 - It is good to clean clothes and fold them ... and wearing your bad [clothes] with long wealth is disliked.\n752 - What resembles the Zunnar is disliked absolutely ... and what is disgraceful or resembles Jewish dress.\n753 - Dragging clothes for arrogance is forbidden for ... a youth absolutely, but in prayer confirm [prohibition].\n754 - What resembles the Zunnar is disliked absolutely ... and there is no harm in tightening the Izar for prostrators.\n755 - Forbid wearing silk for every adult ... except for itch, lice, or scabies of deniers.\n756 - Permit it in the first, and forbid it in the correct view ... for these boys; from solid [silk] add.\n757 - Selling to men for their wearing ... and sewing it and weaving is forbidden in Ahmad's text.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009028",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "Selling Juice, Grapes, Drinks, Musical Instruments, and Dealing with One Who Mixed Haram\n758 - Selling juice to a winemaker is void ... likewise grapes with every aid to a corrupter.\n759 - Like a candle for drinkers, and food, and gambling ... nut, chess, and sword for an aggressor.\n760 - And tambourine, flute, singing girl ... and Oud; and refrain from leasing that.\n761 - Likewise sale of one commanded to strive for Friday [prayer] ... if the second [Adhan] was called; and from him: that which began.\n762 - Likewise the ruling regarding what became tight of time for other [prayers] ... and correct from the excused regarding it more firmly.\n763 - Leasing dogs and selling them is forbidden ... without dispute with us, not restricted.\n764 - Dislike without prohibition is trading with a person ... who acquired wealth from lawful and distressed forbidden.\n765 - What is known forbidden of it, forbid; and his lawful ... is permissible; and count his ambiguous among doubtful matters.\n766 - Its doubtfulness increases sometimes or decreases ... but reject the buyer's claim of prohibition.\n767 - Selling and buying in the place of injustices ... is disliked, or usurpation intending asceticism.",
    "foot_note": "1. In (Z): (Testimony).",
    "book_id": "54"
  },
  {
    "serial_number": "5009029",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 89,
    "volume_number": 1,
    "text": "768 - The wisdom of sale and purchase for the intelligent ... connects the poor to every goal.\n769 - Blessed is the Possessor of Rulings and Wisdoms which ... the minds of creation are baffled by, then guided.\n770 - In everything is wisdom and indication ... calling to His Oneness and Singularity.\n771 - He permitted acquiring wealth from its lawful paths ... so He was the best Guide to its acquisition.\n772 - From His wisdom is our initiation and our affairs ... possess connection, not possess singularity.\n773 - Every person is not independent in his affair ... so He enacted paths of cooperation for us, be guided.\n774 - Sometimes by agency and sometimes by wage ... specified in doing a restricted thing.\n775 - Sometimes He permitted ignorance when specification is ... impossible; and from this count Mudaraba.\n776 - To Him end the causes in every being ... and from Him all matters end and begin.\n777 - He attaches people's hopes to gain ... for which they ride terror in every destination.\n778 - Risking himself is easy for this one ... and this one with wealth desiring increase.\n779 - To bring provisions whose acquisition is difficult ... to one incapable of them, lying in a bed.\n780 - Glory be to Him who initiated and perfected His making ... and Exalted is He above falsehoods of an atheist.\n781 - Gifts of our kings are not forbidden ... for Ahmad's Companions accepted from them.\n782 - The Chosen One dealt with some Jews ... a youth, and ate when they invited him; so imitate.\n783 - Whoever gives charity or returns like ambiguous ... forbidden he has, its remainder is lawful; witness.",
    "foot_note": "1. This word fell from (Z).",
    "book_id": "54"
  },
  {
    "serial_number": "5009030",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 90,
    "volume_number": 1,
    "text": "Regarding What is Permissible to Wear and What is Forbidden of Silver, Silk, Wearing Rings, Ruling of Gold and Silver Vessels, Disobedience to Parents, and Giving the Road its Right\n784 - Forbid for males what they wove from ... silver and pure gold or plated.\n785 - Forbidden in Ahmad's text is the waistband of ... silk, likewise a tassel; do not hesitate.\n786 - Permissible for males is a silver ring ... and sword decoration with a gold pommel.\n787 - And a nose and binding a tooth with it out of necessity ... and Abu Bakr's saying permits the ascetic.\n788 - Take two views regarding the youth's belt jewelry ... from white silver, and attribute two aspects.\n789 - Silver is permitted in sword sheaths ... and boot, legging, helmet, armor; confirm.\n790 - In a curtain or what is a place of disrespect ... writing the Glorified Quran is disliked.\n791 - Writing other than it is not disliked ... from Dhikr in what is not trodden and paved.\n792 - Scratching off images is permissible for the house renter ... like the bathhouse for the entrant; witness.\n793 - Buying a doll without a head is permissible for the orphan's guardian ... if she asks; but with the head, block.\n794 - He does not buy what was an image ... from his money, not hers in the abstract [view].\n795 - Depicting a living being completely is forbidden ... and count it a major sin for the threat.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009031",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "796 - There is no harm in wearing furs and buying them ... skins of lawful [animals], its death not confirmed.\n797 - Like meat in the first [view], forbid fox skin ... and from him [Ahmad]: let it be worn, but block prayer in it.\n798 - Ahmad disliked sable and fennec fox ... and their squirrel and ermine too; let him increase.\n799 - In his text there is no harm in rabbit skin ... and forbid all predators like a cat firmly.\n800 - There is no harm in a ring of silver and ... agate and crystal and similar to what is listed.\n801 - Brass, lead, and their iron are disliked ... and gold ring is forbidden for males.\n802 - It is good in the left like Ahmad and his companions ... and disliked in the middle and index finger of the hand.\n803 - Whoever did not remove it entering the toilet ... block writing Quran and Dhikr with it.\n804 - Forbid kohl container, probe from cash (gold/silver) ... and decoration of mirror and comb encased.\n805 - And decoration of lamp, inkwell, Quran ... saddle and collar for beasts imitated.\n806 - Disobedience to parents is a major sin ... so treat them kindly as reward and be praised.\n807 - Arrogant walk and its like is disliked ... a place of arrogance except in war against deniers.\n808 - Do not dislike drinking standing nor putting on ... shoes for a youth in the most correct confirmed view.\n809 - It is good to start putting on shoes with the right ... and reverse in removing; and dislike the reverse, be guided.\n810 - A person walking in a single sandal is disliked by ... choice, most correct, even to fix a spoiler.\n811 - There is no harm in a sandal you pray in without ... harm, and check them at mosque doors.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009032",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "812 - Istirja' (Saying Inna lillahi...) is good when his shoelace breaks ... and restricting barefoot walking to paved roads.\n813 - If you find stones one day in the road ... or thorns or bone, remove [them] and likewise the bad.\n814 - Be wary of sitting in the road, it was ... forbidden except with conditions numbered.\n815 - They are enjoining good and forbidding evil ... and returning Salam to the Muslim initiating.\n816 - Lowering gaze and refraining from harm ... and guiding one who seeks directions to a destination.\n817 - Ambiguous mud in streets is pure ... otherwise a little of it is pardoned with better [view].\n818 - Rain purifies all graves of the ... ancients if no moist bone remains in them.\n819 - He wore the Sibti [shoes] which are free ... of hair with his Companions; imitate them.\n820 - Sindi sandals are disliked for their vanity ... their squeaking is Jewish fashion, so keep away.\n821 - In his text dislike for men and women the ... thin [clothing] except for husband in private and master.\n822 - If it reveals Awrah to others ... that is prohibited without hesitation.\n823 - Shortening clothing and lengthening it is disliked ... without need out of arrogance and leaving habit.\n824 - For men dislike wide collar in his text ... and linen is not disliked in the established [view].\n825 - Praising Allah is good in every state ... especially in wearing a new garment.\n826 - Say to a brother: Wear out and replace, and the ... God will replace; thus say: Live praiseworthy, be guided.\n827 - Whoever is content with lowest clothing in humility ... will be clothed in magnificent garments tomorrow.\n828 - Blessed is the Bestower managing His creation ... with what He willed without restricted prevention.\n829 - How many wisdoms in the fold of His rulings for Him ... He manages them, clearing hearts so they are guided.\n830 - He is not questioned, but questioning ... His creation about what they say tomorrow.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009033",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "Marriage, Treating the Wife, Etiquette of Intercourse and Apportionment\n831 - He permitted the act of marriage for us and enacted it ... for what He willed in us of customary growth.\n832 - Our Madhhab is its recommendation, and it is obligatory ... on one fearing hardship, burning [with desire].\n833 - Take from an advisor, O my brother, advice ... and be firm and beware with a supported heart.\n834 - Do not marry, if you are an old man, a young girl ... you will live a life of harm or accept rejection.\n835 - Do not marry one who exceeds you in rank ... you will always be under her rule in distress.\n836 - This, by my life, is a summary in conditioning ... compatibility, for in it is perfection of affection.\n837 - Do not desire her wealth and furniture ... if you are poor, you will be humiliated and oppressed.\n838 - Do not live in her house with her family ... you will hear then types of numbered reminders of favors.\n839 - There is no good in one who was in his wife's bounty ... going in humility to her and returning.\n840 - Do not deny the giving of little out of distress ... and forgive, you gain reward and good affection.\n841 - Do not ask about what you knew and overlook ... faults if the Law did not blame; be guided.\n842 - Be mindful that women are trusts ... captives with us; keep the advice of a guide.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009034",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "843 - Do not increase denial lest you be accused ... and do not lift the whip from every aggressor.\n844 - Do not hope to straighten her crookedness ... for she is nothing but like a repeated rib.\n845 - A youth dwelling in a room over a street ... leads to suspicion of the innocent guided one.\n846 - Beware, O this one, of the green manure (beautiful woman of bad origin) ... she will return soon to her bad origin.\n847 - Forbid for all marrying the one who committed Zina ... until repentance then add expiry of waiting period.\n848 - From Ahmad: if the one who committed Zina with her wants her ... his repentance is a condition for a knotted contract.\n849 - Do not marry in poverty except for necessity ... and seek refuge in the shield of fasting, you will be guided and directed.\n850 - Be aware that women are toys for us ... so improve then whatever you can and do well.\n851 - The best of women is who pleased the husband in sight ... and who protected him in absence and presence.\n852 - Short of words, short of her house [staying in] ... short of eye glance from every distant one.\n853 - Stick to the religious one, you win wishes ... the loving, fertile, of origin, possessor of worship.\n854 - Noble of origin from generous ones, you win then ... noble children; and aim for virginity.\n855 - One is closer to justice so be content ... and if you wish reach four, do not increase.\n856 - Announcing marriage is prescribed and their beating ... for it with a Duff contrary to a corrupter.\n857 - Ask the Merciful for her good then seek refuge in Him from ... the harm of her evil at the wedding, be guided.\n858 - It is a right on spouses to live together ... with kindness and giving rights not with distress.\n859 - Intercourse with a concubine is not lawful nor ... his wife in menstruation and anus; block.",
    "foot_note": "1. This verse does not exist in (Z) and (B), and it is in the printed version and the copy in the handwriting of Sheikh Abdullah Al-Khalaf Al-Dahyan.",
    "book_id": "54"
  },
  {
    "serial_number": "5009035",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "860 - Whoever wishes between the buttocks for pleasure ... if he does not penetrate, he is not distanced.\n861 - It was said intercourse is Sunnah once a month ... otherwise in the week if he increases.\n862 - Increase is not Sunnah upon him except ... at the urge of desire and seeking offspring.\n863 - Say Bismillah and say 'O Allah keep away from us and what ... You provided the Devils'; supplicate for intercourse, be guided.\n864 - Increasing speech during intercourse is disliked ... and block his withdrawing before her completion.\n865 - It is also prescribed to foreplay before it ... and his intercourse with her naked is disliked.\n866 - And a person's Wudu along with washing his private part ... if he desires return is recommended; do well.\n867 - Intercourse with the maiden is disliked with another seeing ... even a co-wife consenting and gathering in a bed.\n868 - Obligate obedience of enjoyment for the husband ... by angering him, anger is upon her and she is distanced.\n869 - Whomever you angered as husband by her disobedience spends the night ... angels of the Merciful cursing her; attribute.\n870 - Your permission is recommended for visiting a Mahram ... and her presence for the dead not with strictness.\n871 - If she goes out in adornment or perfumed ... she is to be prevented, and if you fear harm prevent and be strict.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009036",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "Individual Obligation and Collective Obligation, and Obligation of Advice to Allah, His Messenger, and the Ummah\n872 - Be aware that obligations are divided ... into individual like Fasting with prayer of worship.\n873 - And collective obligations (Fard Kifaya); when some perform ... it, sin falls from every individual.\n874 - Like repelling harm from Muslims for the capable ... like satisfying a hungry deprived poor person.\n875 - And covering a naked person, visiting a sick person ... and washing a dead person then burying the interred.\n876 - And shrouding him then praying over him with ... following the carried to the grave; be happy.\n877 - Among them are industries permitted, important ... for interest people need; be supported.\n878 - Farming and planting, digging a river and its well ... and organizing them then block the breaches.\n879 - Building a bridge then a wall and repairing them ... and an arch needed then a mosque.\n880 - Our Great Imamate, establishing a call ... and repelling doubts of the stubborn misguider.\n881 - Jihad and Hajj every year, likewise Judiciary ... and Fatwa and teaching the Glorified Book.\n882 - And teaching what the best Messenger enacted ... and all science in Sharia leading to happiness.\n883 - Arithmetic and morphology and grammar, reading ... and with language with medicine science; not distanced.\n884 - Stick to piety of Allah in every state ... you win the canes of the race today and tomorrow.\n885 - And advice to the Book of Allah with advice to Ahmad ... your Prophet, best of Messengers, Muhammad.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009037",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "886 - And advice to all Muslims, their leader ... and their subjects; accept the will of a guide.\n887 - There ceased not to be Imams among us every era ... defending the religion of guidance with the sword.\n888 - Negating the distortion of the deviants and showing the ... correct from the defective in every scene.\n889 - So four in the beginning of the matter are a pillar ... and four in the end of the matter; imitate.\n890 - Each came in religion with his utmost effort ... and the most praised (Ahmad) of them in critique is the Madhhab of Ahmad.\n891 - Due to excessive following of the Prophet and his Companions ... so for this reason he did not respond to a threatener.\n892 - They called him to the saying of misguidance but he did not answer ... and replied to them the reply of the best guided one.\n893 - He gave himself to support the truth patiently ... over flogging and threat from every aggressor.\n894 - He returned by Allah's praise with victory and guidance ... and they returned with loss and eternal humiliation.\n895 - The outcome continued to be for whoever feared [Allah] ... such is Allah's promise in the Most Glorious Remembrance.\n896 - Beware of opinions of every embellisher ... of his speech, for poison is within it, the bad.\n897 - The best of people died and the religion is complete ... rich without need for clarification from any atheist.\n898 - The seeker of true religion in opinion is lost ... and whoever delved into Ilm al-Kalam was not guided.\n899 - Sufficient deficiency for them is the contradiction of their speech ... and each says 'The truth is with me', so imitate.\n900 - Had it been truth, it would not be contradictory ... nor would its owner shift, confused.\n901 - Truth is nothing but its night is like its day ... removing light free of hesitation.\n902 - By it the heart is reassured not shaken ... nor fearful but safe from distress.\n903 - Whoever imitates opinions strays from guidance ... and whoever imitates the Infallible in religion is guided.\n904 - Religion is nothing but following what came ... from Allah and the Bashir Guide Muhammad.",
    "foot_note": "None",
    "book_id": "54"
  },
  {
    "serial_number": "5009038",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "905 - Thus said Al-Shafi'i and others ... of the supporters of truth from every guided one.\n906 - Pure reception with acceptance for it without ... interpretation or likening or rejection of deniers.\n907 - So struggle until you convey to the self its excuse ... and be in acquiring knowledge a climber of highlands.\n908 - Do not let life go from you in vain ... and do not be cheated in the two blessings, but strive.\n909 - Whoever abandons pleasures attains wishes and whoever ... devotes to pleasures bites on the hand.\n910 - In suppressing souls' desires is their glory ... and in attaining what they desire is eternal humiliation.\n911 - Do not busy yourself except with what earns heights ... and do not accept for the precious soul the bad.\n912 - In a person's solitude with knowledge is his comfort ... and a person's religion is safe in isolation.\n913 - He is safe from gossip and from harm of ... a sitter and from a hateful slanderer and enviers.\n914 - Be a saddle (companion) of the house, for it covers a fault ... and is the youth's fortress from every deviator and corrupter.\n915 - The best companion of a man is books benefitting him ... sciences and manners like a supporting intellect.\n916 - Mix if you mix with every successful one ... of scholars, people of piety and correctness.\n917 - He benefits you with knowledge and forbids you from desire ... so accompany him, you will be guided by his guidance and directed.\n918 - Beware of the backbiter if you leave him and the ... foul-mouthed, for a person imitates a person.\n919 - Do not accompany fools, for the person of ignorance if he intends ... reform of a matter, O brother of firmness, corrupts.\n920 - The best companions with your Lord are their best ... to his companion, and the neighbor is like what I began.",
    "foot_note": "1. In (Z) and (B): (Sitter), and affirmed from the printed version and copy (A). \n2. In (Z) and (B): (Mocker), and affirmed from (A), the printed version and Ghidha' al-Albab.",
    "book_id": "54"
  },
  {
    "serial_number": "5009039",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "921 - The best place you stood in and ornament ... you adorned with is remembrance of the God in a mosque.\n922 - Restrain your tongue from defect and let it be ... always moist with remembrance of Allah, O my companion.\n923 - Fortify all limbs from obscenity ... they will be for you on the Day of Recompense best witnesses.\n924 - Persist in studying the Quran for it ... softens a heart hard like rock.\n925 - Maintain doing obligations on time ... and take a share in darkness of Tahajjud.\n926 - Call if you stand in the night a Hearer ... Near, Responsive, beginning with favors.\n927 - Extend to Him the palm of your poverty humbly ... with a penitent heart and call, you will be given and guided.\n928 - Do not get bored of knowledge and stay up to attain it ... without boredom you praise the journey's travel tomorrow.\n929 - Be patient with poverty and wear contentment ... with what the Merciful decreed and thank Him and praise.\n930 - Glory is only in contentment and satisfaction ... with lowest obtained sufficiency and asceticism.\n931 - Whoever sufficiency does not satisfy, there is no way ... to his satisfaction; so be content and aim.\n932 - Whoever seeks richness, Allah enriches him; and richness ... is richness of soul not abundance of numbers.\n933 - Do not seek knowledge for money and showing off ... for the crux of the matter is in good intent.\n934 - Be acting upon knowledge in what you can ... so the person who imitates you is guided by you.\n935 - Keen on benefitting people and their guidance ... you attain every good in eternal bliss.\n936 - Beware of vanity and arrogance, you attain ... misery in both abodes; so be guided and guide.",
    "foot_note": "1. In (Z) and the printed version: (You praise). \n2. In (Z) and the printed version: (Happiness).",
    "book_id": "54"
  },
  {
    "serial_number": "5009040",
    "category_id": "23",
    "category": "Heart Softeners, Etiquette, and Adhkar",
    "book_title": "The Millennium in Legal Manners [Famous as 'Manzumat al-Adab']",
    "edition": "Second, 1421 AH - 2000 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 100,
    "volume_number": 1,
    "text": "937 - Here I have expended advice to my effort and indeed I ... admit my shortcoming and by Allah I am guided.\n938 - It is completed, and praise be to Allah alone ... in every state always, not restricted.\n939 - A bride surpassing the morning sun, Hanbali ... wrapping with clear light and wearing it.\n940 - If she attributes herself in knowledge, her attribution is ... to a Mujtahid in supporting religion, imitated.\n941 - Imam of Guidance, Ornament of the Pious, Ibn Hanbal ... upon his love for Allah I am deposited in a grave.\n942 - No garden surrounded by the light of its spring ... with its sweet cool limpid water.\n943 - Is better than its verses and issues ... enclosed by it one day without hesitation.\n944 - Take it by study, not by sleep you attain ... for people of piety and knowledge in every scene.\n945 - Do not refrain from memorizing it, for it is a pearl ... unique, I extracted it in critique.\n946 - Purest blessings of Allah, Exalted is His praise ... and Mighty, upon the best of creation Muhammad.\n947 - And his Companions and the noble of his Family and who ... followed them in goodness, by them he remained imitating.",
    "foot_note": "1. This verse does not exist in (B) and (Z). \n2. I finished caring for this poem and comparing it with its originals on Tuesday the twenty-ninth of Muharram in the Hanbali Mosque in Salihiyah, Damascus, may Allah populate it with knowledge and faith, during one of my trips to protected Damascus. And blessings of Allah be upon our Prophet Muhammad and his family and companions and peace. Muhammad bin Nasir Al-Ajmi.",
    "book_id": "54"
  }
]