[
  {
    "text": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil\nAuthor: أحمد بن محمد بن أحمد بن غالب أبو بكر المعروف بالبرقاني\nYear: 425",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 1
  },
  {
    "text": "sn: 3329\nbook_title: سؤالات أبى بكر البرقانى للدارقطني في الجرح والتعديل\nbook_link: https://shamela.ws/book/1060\nbook_id: 1060\nauthor_name: أحمد بن محمد بن أحمد بن غالب أبو بكر المعروف بالبرقاني\nauthor_year: 425\nnickname: أبو بكر\nauthor_link: https://shamela.ws/author/419\nauthor_ID: 419\neditor: مجدي السيد ابراهيم\npublisher: مكتبة القرآن للطبع والنشر والتوزيع\nedition: Null\npages: 83\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العلل والسؤلات الحديثية\ncategory_id: 9",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 2
  },
  {
    "serial_number": "3331464",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Defects and Questions. Book: Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil (Discrediting and Accrediting). Author: Ahmad bin Muhammad bin Ahmad bin Ghalib, Abu Bakr known as Al-Barqani (Died 425 AH). Investigation and Commentary: Majdi Al-Sayyid Ibrahim. Publisher: Maktabat Al-Quran for Printing, Publishing and Distribution. [Book numbering matches the printed version]. Number of Pages: 83. Date of publishing in Shamela: 8 Dhu al-Hijjah 1431 AH.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 3
  },
  {
    "serial_number": "3331465",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction. Praise be to Allah... We praise Him, seek His help, and seek His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds... Whomever Allah guides, there is no one to misguide him, and whomever He misguides, there is no guide for him. I bear witness that there is no deity worthy of worship but Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger. {O you who have believed, fear Allah as He should be feared and do not die except as Muslims} (1). {O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer} (2). {O you who have believed, fear Allah and speak words of appropriate justice. He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment} (3).",
    "foot_note": "1. (1) Surah Al Imran: 102. \n2. Surah An-Nisa: 1. \n3. Surah Al-Ahzab: 70 - 71. (*)",
    "book_id": "1060",
    "new_page_number": 4
  },
  {
    "serial_number": "3331466",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "[Preface to the Book] Indeed, the science of Jarh and Ta'dil (Discrediting and Accrediting narrators) is among the most noble of sciences and the greatest in value, for by it, authentic Hadiths are distinguished from weak ones, and accepted reports from rejected ones. There is no jurist (Faqih) who is not in need of it, and no Hadith scholar (Muhaddith) who does not resort to it and seek guidance from it. Jarh and Ta'dil is the scale by which the men of Hadith are weighed, and through which the narrator whose Hadith is accepted is known from the one whose Hadith is rejected. The scholars of Prophetic Hadith gave great attention to the science of Jarh and Ta'dil, to the point that the noble Companion Ibn Abbas (may Allah be pleased with them both) said: \"Indeed, this knowledge is religion, so look to whom you take your religion from.\" The science of Jarh and Ta'dil is not claimed by just any person or even every Muhaddith, for conditions must be met in the critic (Al-Jarih) and the accreditor (Al-Mu'addil). Criticism and accreditation are not accepted except from a vigilant, upright person who knows the reasons for discrediting, nor is validation accepted except from one who knows its reasons. The brilliant critics among the Imams and Huffaz (Memorizers) took the lead in this science, such as Imam Ahmad bin Hanbal, Al-Bukhari, Al-Nasa'i, Ibn Ma'in, and Ibn Al-Madini. Among them is the Imam and Hafiz Al-Daraqutni. There is no wonder in that, for he was the unique figure of his era, the peerless one of his time, and the Imam of his age. The knowledge of Hadith, the knowledge of its defects ('Ilal), and the names and conditions of its narrators ended with him, along with truthfulness, trustworthiness, jurisprudence, acumen, correct creed, and soundness of school (Madhhab).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 5
  },
  {
    "serial_number": "3331467",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "These are the questions of Abu Bakr Al-Barqani to the Imam of his time, Abu Al-Hasan Al-Daraqutni, regarding Jarh and Ta'dil... My Generous Lord has guided me to investigate and study them. The \"Questions of Al-Barqani\" is considered one of the very important books in the field of Jarh and Ta'dil, especially since it involves two great Imams famous for Jarh and Ta'dil and the knowledge of men and Hadith defects. Publishing these questions renders a great service to the library of Hadith and the purified Prophetic Sunnah, especially since it completes the series of questions on Jarh and Ta'dil that were posed to Imam Al-Daraqutni. Professor Muwaffaq bin Abdullah bin Abdul Qadir has published (Questions of Al-Hakim to Al-Daraqutni) and (Questions of Hamza Al-Sahmi to Al-Daraqutni). Here we are bringing forth (Questions of Al-Barqani to Al-Daraqutni), and God willing, (Questions of Abu Abdul Rahman Al-Sulami to Al-Daraqutni) is on the way. And success is only from the Lord of the Worlds.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 6
  },
  {
    "serial_number": "3331468",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "Study of the Questions (Su'alat). 1 - General Definition of Su'alat: 'Su'alat' refers to a student asking his Sheikh about men of Hadith, or defects in a text, etc. The Questions of Abu Bakr Al-Barqani to Al-Daraqutni are considered one link in a chain of multiple links. A number of Al-Daraqutni's students from among the senior Huffaz asked him about the defects of Hadith and its men, and he gave his judgment on them regarding discrediting (Jarh) and accrediting (Ta'dil). There is no wonder in that, for we have seen those who praised him saying: (The Hafiz of his era, the unique one of his time; no one like him came after Al-Nasa'i), along with other expressions of praise and commendation said about him. For this reason, a number of senior Huffaz and Muhaddithin turned to Imam Al-Daraqutni asking him about Hadith defects and the knowledge of men. Among these Huffaz were: 1 - Abu Al-Qasim Hamza bin Yusuf Al-Sahmi (Died 427 AH), author of the History of Jurjan, who asked Al-Daraqutni about Hadith defects and Jarh and Ta'dil. Most of those he asked about were actually Al-Daraqutni's own teachers or the teachers of his teachers, so Al-Daraqutni gave his judgment on them. It is worth noting that Professor Muwaffaq bin Abdullah brought these questions to light in a verified and accurately indexed edition. 2 - Questions of Abu Abdullah Al-Hussein bin Ahmad, regarding people whom Al-Bukhari and Muslim included in their Sahihs, but whom Al-Nasa'i weakened in the Book of Weak Narrators.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 7
  },
  {
    "serial_number": "3331469",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "3 - Questions of Abu Abdul Rahman Al-Sulami (Manuscript, Allah facilitated its investigation for us). 4 - Questions of Abu Bakr Ahmad bin Muhammad Al-Khwarizmi (Died 425 AH). 5 - Questions of Abu Nu'aym Ahmad bin Abdullah Al-Isbahani (Died 425 AH). 6 - Questions of Abu Dharr Al-Harawi (Died 434 AH). 7 - Questions of Abu Muhammad Abdul Ghani Al-Azdi (Died 409 AH). 8 - Questions of Al-Hakim Al-Naysaburi, author of Al-Mustadrak (Investigated by Professor Muwaffaq). The Questions of Abu Bakr Al-Barqani are but one link in a series of multiple links in which Imam Al-Daraqutni brought forth for us his opinions and thoughts on Jarh and Ta'dil and Hadith defects. Most of the questions begin with: \"I said to Abu Al-Hasan,\" sometimes: \"I heard Abu Al-Hasan,\" other times: \"And I heard Abu Al-Hasan,\" and rarely: \"And Abu Al-Hasan said.\" Al-Daraqutni's style of criticism in Al-Barqani's questions is the same as his style in the questions of Al-Sahmi and Al-Hakim. Sometimes it is a complete criticism, where he judges the narrator with Jarh or Ta'dil generally, such as saying for example: (Weak - Da'if), or (Abandoned - Matruk)... etc. And sometimes the criticism is of a restricted type, where he judges the narrator with accreditation (Ta'dil) while criticizing him in a specific aspect.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 8
  },
  {
    "serial_number": "3331470",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "Sometimes the criticism is regarding the text (Matn), and this criticism stems from his knowledge of an obscure, hidden cause that flaws the Hadith, and we will see some of that in this book of ours. There is no surprise in Imam Al-Daraqutni pointing out the defects of texts, for he is the expert in that, whose book on 'Ilal (Defects) was described as one of the best books on Hadith defects. By joining this book with the rest of the questions directed to Imam Al-Daraqutni, we attempt to assemble the series he left us of his criticism of men and his discussion on Hadith defects. And Allah is the Granter of success to what is right. [Biography of Imam Al-Daraqutni] (1) His Lineage and Upbringing: He is the proficient Imam and Hafiz, Abu Al-Hasan, Ali bin Umar bin Ahmad bin Mahdi bin Masud bin Al-Nu'man Al-Baghdadi, from the people of the Dar Al-Qutn district in Baghdad, to which he is attributed. He was born in the year 306 AH. From his youth, he began seeking knowledge from the great scholars of his time. He said about himself: \"I wrote [Hadith] in the beginning of the year 315.\" He studied Shafi'i jurisprudence under Abu Sa'id Al-Istakhri, and attended the gathering of Al-Baghawi regularly. After hearing from the Sheikhs of his homeland, he began traveling to other countries, journeying to most regions famous for the high status of Hadith science within them. Among the interesting anecdotes in this regard is that his family and clan hoped for him to be the town's Quran reciter. They used to say: \"Al-Kattani - one of Al-Daraqutni's peers in his town - will emerge as the town's Muhaddith, and Al-Daraqutni will emerge as the town's reciter.\" Al-Daraqutni says: \"So I emerged as a Muhaddith, and Al-Kattani as a reciter.\" Thus, the scholar Al-Daraqutni had a good scientific upbringing which qualified him to be one of the Sheikhs of Islam. (2) Al-Daraqutni's Sheikhs from whom he received knowledge: One cannot enumerate the scholars from whom he received knowledge because that would require a separate book, but I will mention some of these scholars to clarify the intensity of Imam Al-Daraqutni's pursuit of knowledge.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 9
  },
  {
    "serial_number": "3331471",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "The Questions of Abu Bakr al-Burqānī to al-Dāraqutnī on Criticism and Evaluation of Narrators",
    "edition": "None",
    "publisher": "Qur'an Library for Printing, Publishing, and Distribution",
    "page_number": 10,
    "volume_number": 1,
    "text": "[Biography of Imam al-Dāraqutnī]\n\n(1) His lineage and upbringing:\nHe is the precise preserving imam, Abū al-Hasan ʿAlī ibn ʿUmar ibn Aḥmad ibn Mahdī ibn Masʿūd ibn al-Nuʿmān al-Baghdādī, from the district of Dār al-Qaṭan in Baghdad, and he is attributed to it.\nHe was born in the year 306 AH. From his early youth, he began seeking knowledge from the senior scholars of his time. He said about himself: “I wrote (hadith) in the beginning of the year 315 AH.”\nHe studied Shāfiʿī jurisprudence under Abū Saʿīd al-Isṭakhrī, and he would attend the study circle of al-Baghawī regularly.\nAfter listening to the scholars of his homeland, he began traveling to different lands, journeying to most of the regions famous for their high standing in the science of hadith.\n\nAmong the interesting things mentioned here is that his family and relatives hoped he would become the town’s Qur’an reciter. They would say: “Al-Kattānī — one of al-Dāraqutnī’s peers in his town — will become the town’s hadith scholar, and al-Dāraqutnī will become the town’s reciter.”\nAl-Dāraqutnī said: “I ended up becoming the hadith scholar, and al-Kattānī became the reciter.”\n\nThus the scholars raised al-Dāraqutnī with a strong scholarly upbringing that qualified him to be among the great teachers of Islam.\n\n(2) The teachers from whom al-Dāraqutnī learned:\nIt is not possible for one to enumerate all the scholars from whom he learned, as that would require a separate work. But I will mention some of these scholars so that a clear picture appears of the intensity of Imam al-Dāraqutnī’s pursuit of knowledge.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 10
  },
  {
    "serial_number": "3331471",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "Among his teachers from whom he memorized and heard: Abu Ishaq Ibrahim bin Hammad bin Ishaq Al-Azdi, Ibrahim bin Abdul Samad Al-Hashimi, Ibrahim bin Muhammad bin Al-Hasan, Abu Bakr Ahmad bin Ja'far bin Hamdan, Ahmad bin Sa'id bin Sa'd, Abu Bakr Ahmad bin Salman bin Al-Hasan, Ahmad bin Isa bin Al-Khawwas, Ahmad bin Kamil the Judge, Abu Abdullah Ahmad bin Muhammad Al-Sulhi, Abu Sa'id Ahmad bin Muhammad bin Rumayh, Abu Al-Abbas Ahmad bin Muhammad known as Ibn Uqdah (who is mentioned in the book before us), Ahmad bin Muhammad Abu Dharr known as Ibn Al-Baghandi, Abu Talha Ahmad bin Muhammad Al-Ghazari, Ahmad bin Al-Muttalib bin Abdullah Al-Hashimi, Ibn Mujahid (the Sheikh of Reciters in his time), Abu Talib Ahmad bin Nasr Al-Baghdadi, Abu Muhammad bin Ismail bin Ali Al-Khatbi, Abu Muhammad Ja'far bin Ali Al-Duri, Abu Al-Fadl Ja'far bin Al-Fadl known as Ibn Hinzabah, Abu Muhammad Al-Hasan bin Ahmad Al-Hamadani, Abu Sa'id Al-Hasan bin Ali bin Zakariya Al-Adawi Al-Basri, Da'laj bin Ahmad Al-Sijistani (mentioned in this book), Hafiz Ibn Qani' author of (Mu'jam Al-Sahaba), Hafiz Abu Al-Qasim Abdullah bin Ibrahim Al-Anbaduni Al-Jurjani, Abu Bakr Abdullah bin Muhammad bin Ziyad the Shafi'i Jurist, Abu Al-Qasim Abdullah bin Muhammad Al-Baghawi, Umar bin Ahmad bin Mahdi, Abu Al-Hussein Muhammad bin Al-Muzaffar Al-Baghdadi, Abu Ja'far Muhammad bin Al-Hussein Al-Hamadhani, Abu Abdullah Muhammad bin Ismail bin Ishaq Al-Farisi, Abu Bakr Al-Anbari the well-known Grammarian, Abu Ja'far Muhammad bin Ubaidullah Al-Katib, Muhammad bin Umar Al-Tamimi known as Ibn Al-Ji'abi, Abu Abdullah Muhammad bin Al-Qasim Al-Kufi, Abu Ubaidullah Muhammad bin Makhlad Al-Saduri Al-Attar, Muhammad bin Harun Al-Hadrami known as Al-Ba'rani, Abu Bakr Muhammad bin Mazid Al-Khuza'i,",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 11
  },
  {
    "serial_number": "3331472",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 12,
    "volume_number": 1,
    "text": "and known as Ibn Abi Al-Azhar, Abu Al-Hasan Muhammad bin Nuh, Abu Muhammad Yahya bin Muhammad known as Ibn Sa'id, Yaqub bin Musa Al-Ardabili, Abu Talib Ahmad bin Nasr, Ismail bin Al-Abbas Al-Warraq, Al-Fadl bin Ahmad Al-Zubaydi, Abu Bakr bin Abi Dawud, and many others, for he narrated from multitudes and many nations. This clearly indicates without doubt that Imam Al-Daraqutni drank deeply from the scholars and strove earnestly in seeking knowledge. (3) His Students who took from him: Since Al-Daraqutni was the Muhaddith of his era and the Imam of his time in Hadith, students raced to him seeking to acquire high chains of transmission (Sanad 'Ali) and rare texts. They had no one to take this from more than Imam Al-Daraqutni. One is perplexed about whom to mention among his students, for they are very many. But quickly, we mention some of them: Abu Bakr Al-Barqani the author of the Questions in this book, Abu Nu'aym Al-Isbahani, Abu Al-Qasim Ibn Bishran, Al-Azhari, Al-Khallal, Al-Jawhari, Al-Tanukhi, Abu Bakr bin Bishran, Al-Atiqi, Abu Al-Tayyib Al-Tabari, Hamza bin Muhammad bin Tahir, Abdul Aziz Al-Azji, Abu Abdul Rahman Al-Sulami (who has 'Questions' in manuscript form which Allah facilitated for us to investigate), Al-Hakim Al-Naysaburi, Hamza bin Yusuf Al-Sahmi, Abu Muhammad Abdul Ghani Al-Azdi, Abu Dharr Al-Harawi (who has a part called 'Musmu'at' which Allah facilitated for us to investigate), Abu Hamid Ahmad bin Muhammad Al-Isfarayini, Abu Masud Ibrahim bin Muhammad Al-Dimashqi, and many others.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 12
  },
  {
    "serial_number": "3331473",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "(4) His Printed and Manuscript Works: 1 - Book of (Al-'Ilal) in Hadith: A manuscript copy exists in the Egyptian National Library in five volumes, and it was printed recently. Al-Dhahabi said about it: \"If you wish to see the brilliance of this unique Imam, read 'Al-'Ilal' by him, for you will be amazed and your wonder will be prolonged.\" See: Tadhkirat al-Huffaz (3 / 993). 2 - Book of (Al-Sunan): Printed in more than one edition. Al-Khatib said about it: \"The Book of Sunan which he authored indicates that he was among those who paid attention to Fiqh, because no one is capable of compiling what that book contains unless his knowledge of the differences in rulings has preceded.\" See: Tarikh Baghdad (12 / 35). 3 - Book of (Ahadith al-Sifat or Al-Sifat): Printed. 4 - Book of (Ahadith al-Nuzul): Printed. 5 - Book of (Al-Askhiya'): Mentioned by Fuat Sezgin in History of Arabic Heritage (1 / 511). 6 - (Twenty Hadiths from the Book of Attributes): Indicated in the previous source; it appears to be a selection from book number (3). And Allah knows best. 7 - Book of (Al-Ru'ya): Mentioned by Fuat Sezgin (1 / 511) and the author of Tabaqat al-Hanabila (2 / 192). 8 - Book of (Mention of the names of the Tabi'in and those after them whose narration is authentic among the trustworthy in Al-Bukhari): Mentioned by Fuat Sezgin (1 / 511). 9 - Book of (Gharib al-Hadith): Previous source. 10 - Book of (Al-Ilzamat ala Sahihai Al-Bukhari wa Muslim): Printed.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 13
  },
  {
    "serial_number": "3331474",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "11 - Book of (Al-Ghara'ib wa Al-Afrad): Mentioned by Hajji Khalifa in Kashf al-Zunun (1394) and Fuat Sezgin (1 / 512). 12 - Book of (Al-Fawa'id Al-Muntafah min Al-Ghara'ib Al-Hisan): Fuat Sezgin (1 / 513). 13 - Book of (Al-Fawa'id Al-Muntaqah Al-Hisan li Ibn Ma'ruf): Previous source. 14 - Book of (Al-Fawa'id Al-Muntakhabah wa Al-Muntaqah): Previous source. 15 - Book of (Mention of the names of the Tabi'in and those after them whose narration is authentic in Muslim): Printed. 16 - Book of (Names of the Sahaba on whom Al-Bukhari and Muslim agreed, and what one of them narrated exclusively from the other): Mentioned by Fuat Sezgin (1 / 513). 17 - Book of (Men of Al-Bukhari and Muslim): Previous source. 18 - Treatise on (Clarification of what Al-Bukhari and Muslim agreed upon, and what one of them narrated exclusively from the other): Fuat Sezgin (1 / 514). 19 - Book of (Mention of people whom Al-Bukhari and Muslim included in their Sahihs but Al-Nasa'i weakened in the Book of Weak Narrators): Previous source. 20 - Book of (Al-Tatabbu', which is what was critiqued in the Two Sahihs and has a defect): Professor Muwaffaq bin Abdullah indicated that he investigated it as a Master's thesis at the Islamic University of Madinah. 21 - Book of (Al-Mu'talif wa Al-Mukhtalif): Indicated by Fuat Sezgin (1 / 514).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 14
  },
  {
    "serial_number": "3331475",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "22 - Book of (Hadiths in which Imam Malik was contradicted): Being investigated by Professor Muwaffaq bin Abdullah for a Ph.D. from Imam Muhammad bin Saud University in Riyadh. 23 - Book of (Questions of Al-Hakim Al-Naysaburi to Al-Daraqutni): Printed. 24 - Book of (Questions of Hamza bin Yusuf Al-Sahmi to Al-Daraqutni): Printed. 25 - Book of (Questions of Abu Abdul Rahman Al-Sulami to Al-Daraqutni): A manuscript exists in the Institute of Manuscripts in Egypt, Allah facilitated its investigation for us. 26 - Book of (Virtues and Merits of the Companions): Fuat Sezgin (1 / 515). 27 - Book of (News of Amr bin Ubaid): Previous source. 28 - Book of (Clarification of the Descent of the Compeller [Allah] every night of Ramadan, the night of mid-Sha'ban, and the day of Arafat to the lowest heaven): Previous source. 29 - Book of (Brothers and Sisters): Indicated by Al-Hafiz in Al-Tahdhib (8 / 421) and Fuat Sezgin (1 / 515) in History of Arabic Heritage. 30 - Book of (Containing forty Hadiths from the Musnad of Buraid bin Abdullah bin Abi Burdah): Indicated by Fuat Sezgin in the previous source. 31 - Book of (Al-Ahadith Al-Ruba'iyyat): Previous source.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 15
  },
  {
    "serial_number": "3331476",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "32 - Book of (Misspellings of the Muhaddithin): Indicated by Ibn Khayr Al-Ishbili in the Index of what he narrated from his Sheikhs (481). 33 - (Hadith of Abu Ishaq Ibrahim bin Muhammad Al-Muzakki Al-Naysaburi from his Sheikhs): Previous source. 34 - Book of (Al-Mudabbaj): Previous source (487). 35 - Part on (Reciting the Basmala aloud in Prayer): Indicated by Al-Fakhr Al-Razi in the book (Rulings of the Basmala) in our investigation, and see: Tadrib al-Rawi (3 / 336). 36 - Book of (Al-Mustajad min Al-Hadith): Indicated by Hajji Khalifa in Kashf al-Zunun (55). 37 - Book of (Questions of Abu Nu'aym to Al-Daraqutni): Introduction to Atraf al-Ghara'ib by Al-Maqdisi, manuscript in the Egyptian National Library. 38 - Book of (Questions of Abu Dharr Abd bin Ahmad Al-Harawi to Al-Daraqutni): Previous source. 39 - Book of (Questions of Abdul Ghani bin Sa'id Al-Azdi to Al-Daraqutni): Previous source. 40 - Book of (Al-Qira'at - The Readings): Mentioned by Al-Khatib (12 / 34) in his History, and he said about it: \"I heard someone who cares for the sciences of Quran say: Abu Al-Hasan was not preceded to the method he followed in arranging the introductory chapters at the beginning of Al-Qira'at, and reciters after him followed his method in their compilations and walked in his footsteps.\"",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 16
  },
  {
    "serial_number": "3331477",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "41 - Book of (The Weak and Abandoned Narrators): Printed in more than one edition. 42 - Book of (Jarh and Ta'dil): Attributed to him by Ibn Hajar in Al-Tahdhib (2 / 14), (5 / 267, 268). 43 - Book of (Ghara'ib Malik): Attributed to him by Ibn Hajar in Al-Lisan (4 / 60, 77). 44 - (Supplement to the Great History of Al-Bukhari): Attributed to him by Al-Sakhawi in his book Al-I'lan bi al-Tawbikh (220, 222). 45 - Book of (Mention of those who narrated from Al-Shafi'i): Attributed to him by Abu Ishaq Al-Shirazi in his book (Classes of Jurists) (103). (5) Scholars' Praise of Al-Daraqutni: * * Al-Khatib Al-Baghdadi (may Allah have mercy on him) said: (He was the unique of his era, the peerless of his time, unique in his weave, and the Imam of his age. Knowledge of Athar (Reports), knowledge of Hadith defects, names of men, and conditions of narrators ended with him, along with truthfulness, trustworthiness, Fiqh, probity, acceptance of testimony, correctness of belief, soundness of Madhhab, and mastery of sciences other than Hadith, including Readings (Qira'at), knowledge of the schools of jurists, and knowledge of literature and poetry). * * Abu Abdullah Al-Hakim said in the book (Muzakki Al-Akhbar): (Abu Al-Hasan became the unique one of his era in memorization, understanding, and piety, and an Imam in Readers and Grammarians, and he was one of the Huffaz).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 17
  },
  {
    "serial_number": "3331478",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "* * Al-Azhari (may Allah have mercy on him) said: (Al-Daraqutni was intelligent; if any science was mentioned - whatever type it was - he was found to have an abundant share of it). * * Abu Al-Tayyib Al-Tabari (may Allah have mercy on him) said: (Al-Daraqutni was the Commander of the Faithful in Hadith). * * Abdul Ghani Al-Azdi (may Allah have mercy on him) said: (The best people in speaking about the Hadith of the Messenger of Allah (peace be upon him) are three: Ibn Al-Madini in his time, Musa bin Harun in his time, and Al-Daraqutni in his time). * * Shams al-Din Al-Dhahabi (may Allah have mercy on him) said: (An Imam, a Hafiz, proficient, Sheikh al-Islam, the standard of critics, he authored works, and his mention spread in the world. He was among the oceans of knowledge and the Imams of the world. Memorization and knowledge of Hadith defects and its men ended with him, along with advancement in Readings and their paths, and strong participation in Fiqh, disagreement [of scholars], battles, and history of people). * * Al-Sam'ani (may Allah have mercy on him) said: (He was one of the proficient, prolific Huffaz, and he was proverbial in memorization). * * Ibn Al-Jawzi (may Allah have mercy on him) said: (Combined in him, along with knowledge of Hadith and knowledge of Readings, were Grammar, Fiqh, and Poetry, with leadership, probity, and correct creed).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 18
  },
  {
    "serial_number": "3331479",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "* * Ibn Kathir (may Allah have mercy on him) said: (One of the unique Huffaz, critical Imams, and excellent experts. The Imam of his time in names of men, the craft of defects, Jarh and Ta'dil, good classification and authorship, breadth of narration, and complete mastery in understanding. From a young age, he was described as having dazzling memory, piercing understanding, and being a swelling sea [of knowledge]). * * Ibn Al-Imad Al-Hanbali (may Allah have mercy on him) said: (The great Hafiz, the Imam, Sheikh al-Islam; to him belongs the ultimate end in knowledge of Hadith and its sciences, and he was called therein the Commander of the Faithful). * * Hamza Al-Daqqaq said poetry about Abu Al-Hasan Al-Daraqutni, including: \"We made you a mediator between us and our Messenger / So you did not wrong nor commit sin / You are the one without whom mankind would not know / Even if they strove, what a liar has authenticated.\" (6) His Death: Thus, after this life full of service to the Prophetic Sunnah and defending it, the good soul ascended to its Creator, to reward it with the best reward. In the year 385 AH, Imam Al-Daraqutni departed from our world to the abode of the Hereafter, though he remains alive among us through his good works. After his death, visions were seen of him that make one rejoice at his outcome. The very learned scholar, the pontiff Ibn Makula (may Allah have mercy on him) said: \"I saw in a dream on a night of the month of Ramadan as if I was asking about the condition of Abu Al-Hasan Al-Daraqutni in the Hereafter, and what his affair came to? It was said to me: That one is called 'The Imam' in Paradise.\"",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 19
  },
  {
    "serial_number": "3331480",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 20,
    "volume_number": 1,
    "text": "Al-Khatib Al-Baghdadi narrated this story in his History (12 / 40) with his chain of transmission, and Allah knows best. For more detail, you should refer to the following references and sources: 1 - Tarikh Baghdad: (12 / 34). 2 - Al-Ansab by Al-Sam'ani: (2 / 438). 3 - Wafiyat al-A'yan: (3 / 297). 4 - Tadhkirat al-Huffaz: (3 / 991). 5 - Al-'Ibar: (3 / 28). 6 - Al-Bidaya wa Al-Nihaya: (11 / 317). 7 - Siyar A'lam al-Nubala: (16 / 449). 8 - Al-Nujum al-Zahirah: (4 / 172). 9 - Shadharat al-Dhahab: (3 / 116). 10 - Hadiyat al-'Arifin: (1 / 683). And others.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 20
  },
  {
    "serial_number": "3331481",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "[Introduction to Imam Abu Bakr Al-Barqani] (1) His Lineage and Upbringing: He is the very learned Imam, the Jurist, the Firm Hafiz, Sheikh of Jurists and Muhaddithin, Abu Bakr, Ahmad bin Muhammad bin Ahmad bin Ghalib, Al-Khwarizmi, then Al-Barqani, Al-Shafi'i, author of works. Al-Barqani: with a Fatha on the Ba', relative to a village of the villages of Kath in the regions of Khwarazm, most of which was ruined. He began listening [to Hadith] in the year 350 AH in Khwarazm, then he arrived in Baghdad and heard from the senior scholars there. He traveled to Jurjan, Isfarayin, Nishapur, Herat, and Marw, then returned to Baghdad, settled there, and narrated Hadith there. He was eager for knowledge, devoting his ambition to it. (2) His Sheikhs from whom he received knowledge: In Khwarazm, he heard from: Ibn Hamdan Al-Hiri, Muhammad bin Al-Durays, and others. In Herat, he heard from: Abu Al-Fadl bin Khumayrawayh. In Jurjan from Imam Abu Bakr Al-Ismaili. In Baghdad, he heard from: Abu Ali bin Al-Sawwaf, Muhammad bin Ja'far Al-Bundar, Abu Bakr Al-Qati'i, Ibn Kaysan, and others. In Damascus, he heard from: Abu Bakr bin Abi Hadid. In Egypt from Hafiz Abdul Ghani and Abdul Rahman bin Umar Al-Maliki. In Nishapur from Abu Amr bin Hamdan and Abu Ahmad Al-Hakim.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 21
  },
  {
    "serial_number": "3331482",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 22,
    "volume_number": 1,
    "text": "(3) His Students who took from him: A large crowd narrated from him. Among those who narrated from him: Abu Abdullah Al-Suri, Abu Bakr Al-Bayhaqi, the Jurist Abu Ishaq Al-Shirazi, Sulaiman bin Ibrahim Al-Hafiz, Abu Al-Qasim Ali bin Abi Al-Ala Al-Masisisi, Abu Tahir Ahmad bin Al-Hasan Al-Karji, Abu Al-Fadl bin Khayrun, Yahya bin Bundar Al-Baqqal, and Muhammad bin Abdul Salam Al-Ansari. He settled in Baghdad for a long time, so students came to him from all lands. (4) Scholars' Praise of him: Al-Khatib Al-Baghdadi (may Allah have mercy on him), who is one of Al-Barqani's students, said: (Al-Barqani was trustworthy, pious, firm, understanding; we did not see among our Sheikhs anyone more firm than him. He was knowledgeable in Fiqh, had a share of Arabic knowledge, and was prolific in Hadith). Muhammad bin Yahya Al-Karmani the Jurist said: (I have not seen among the people of Hadith anyone more worshipful than Al-Barqani). Al-Sam'ani (may Allah have mercy on him) said: (The Jurist, Hafiz, Writer, Poet; he had complete knowledge of Hadith). Al-Azhari (may Allah have mercy on him) said: (If Al-Barqani dies, this affair [Hadith science] will go. I have not seen anyone more precise than him). Al-Isnawi (may Allah have mercy on him) said: (He was an Imam, Hafiz, pious, diligent in worship, a memorizer of the Quran).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 22
  },
  {
    "serial_number": "3331483",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "(5) His Poetry: It bears the characteristic of scholars' poetry in terms of its poetic features. Perhaps among the closest verses that clarify this direction for us, which are the most famous of what he left of his poetry: \"I amuse myself with books of Hadith / And I make the appointment with it beautiful / And I busy myself with classifying it / And extracting it always, eternally / Sometimes I classify it by Sheikhs / And sometimes I classify it as Musnad / And I follow Al-Bukhari in what he intended / And classify it striving diligently / And Muslim, for he was the adornment of mankind / With his classification, a submissive guide / And I have nothing in it except that I / See it as a passion that met a purpose / And I hope for reward by writing prayers / Upon the Master, the Chosen One, Ahmad / And I ask my Lord, God of the servants / Proceeding upon what He has accustomed me to.\" (6) His Scientific Works: 1 - Al-Musnad: A summary of Sahih Al-Bukhari and Muslim, attributed to him by more than one scholar like Al-Dhahabi, Al-Baghdadi, and others. A manuscript copy exists in Asafiyah 1/67, Hadith 5959, written in the year 1131 AH. 2 - Al-Takhrij li Sahih Al-Hadith: Manuscript in Chester Beatty 3890, in (10) pages, written in the script of 709 AH. 3 - Questions of Abu Bakr Al-Barqani to Al-Daraqutni: This is the book before us.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 23
  },
  {
    "serial_number": "3331484",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 24,
    "volume_number": 1,
    "text": "4 - Biographers mentioned that he collected the Hadiths of Al-Thawri, Mis'ar, and others. (7) His Death: He died (may Allah have mercy on him) in the beginning of Rajab in the year 425 AH in Baghdad. For more detail on the Sheikh's biography, you should refer to the following references: 1 - Tarikh Baghdad: (4 / 373). 2 - Al-Ansab by Al-Sam'ani: (2 / 156). 3 - Tadhkirat al-Huffaz: (3 / 1074). 4 - Al-'Ibar: (3 / 156). 5 - Al-Wafi bi al-Wafiyat: (7 / 331). 6 - Al-Bidaya wa Al-Nihaya: (12 / 36). 7 - Siyar A'lam al-Nubala: (17 / 464). 8 - Shadharat al-Dhahab: (3 / 228). 9 - Hadiyat al-'Arifin: (1 / 74). 10 - Tarikh al-Turath al-Arabi: (1 / 384).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 24
  },
  {
    "serial_number": "3331485",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "[Description of the Book's Manuscripts] and authentication of its attribution to the author. Perhaps these questions are considered among the most authentic questions attributed to Imam Al-Daraqutni, may Allah have mercy on him. Huffaz and Muhaddithin quoted from them in their books, and transmitted Imam Al-Daraqutni's words about narrators through his student Al-Barqani. Indeed, some of them mentioned it with their chain of transmission to Imam Al-Barqani, as Al-Khatib Al-Baghdadi did in his History. Others transmitted those opinions and attributed them to Al-Daraqutni, mentioning that his student Al-Barqani is the one who transmitted them; this occurred with Hafiz Al-Dhahabi and Ibn Hajar. For example: Hafiz Al-Baghdadi quoted from those questions in the following places in his History: (4 / 24), (5 / 22), (12 / 396), (13 / 220). Imam Al-Dhahabi quoted in Siyar A'lam al-Nubala in the following places: (12 / 15), (14 / 99), (15 / 354), and in Al-Mizan in the following places: (3 / 344), (4 / 574). Imam Ibn Hajar Al-Asqalani quoted in his Tahdhib in the following places: (1 / 15), (1 / 113), (1 / 312), (2 / 19), (3 / 253), (6 / 163), (8 / 260), (9 / 501), (10 / 125), (10 / 159), (10 / 398), (11 / 305), (12 / 15), and in Lisan al-Mizan in the following places: (1 / 264), (4 / 213), (7 / 108).",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 25
  },
  {
    "serial_number": "3331486",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "This demonstrates, by way of example, the importance of those questions, and documents on the other hand the correctness of their attribution to their author. Indeed, biographers mentioned - as passed previously - that Al-Barqani used to ask Al-Daraqutni about defects and Jarh and Ta'dil and write them down; the wonder was that Imam Al-Daraqutni dictated them from memory. As for the description of the manuscript copies of the book that we found, I found by the grace of Allah two copies of the book, but it became clear that the second is taken and copied from the first identically, the difference being only the time factor and the quality of the script as we will explain. As for the first manuscript, it is in (4) folios, i.e., in (8) pages. In each of its pages, there are (27) lines on average, as some pages are (28) lines, and others (27) lines, except for the first page, which is (22) lines, perhaps due to the presence of the part's title. The last page is (33) lines. There are - generally - (17) words in a single line. This manuscript exists under number (1558) under the code (Hadith) on microfilm number (25059). It is the original copy, written in a very fine script that is difficult to read, as it is interlaced, and its words are mostly devoid of dots. It has many audition notes (Sama'at), including one in the year 574 AH before Abu Tahir Al-Silafi, and the writer of the audition is Abdul Malik bin Muhammad bin Abu Al-Qasim",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 26
  },
  {
    "serial_number": "3331487",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "Al-Tawzari; in the year 617 AH before Al-Fakhr Muhammad bin Ibrahim Al-Farisi, and the writer of the audition is Hafiz Abdul Azim Al-Mundhiri; in the year 757 AH before Judge Izz al-Din Abdul Aziz bin Muhammad, known as Ibn Jama'ah, at the Salihiyya School in Cairo; in the year 810 AH before Al-Sharaq Muhammad bin Muhammad bin Abdul Latif Al-Kuwayk; and in the year 814 AH. This copy came to us documented with its chain connected to the author, as we will show in the investigation of the book. This copy was written in the eighth Hijri century, and it is within a collection, taking page numbers (539 - 546). As for the second copy, it is written in beautiful script, in the year 1351 AH, corresponding to 1932 AD. It was copied by the famous copyist Mahmoud Abdul Latif Fakhr Al-Din, the copyist at the Egyptian National Library. That copy is in about (8) folios, as it is (17) pages, with (21) lines on each page. It is un-dotted in many proper names as it is taken from the first copy. It falls under code (B) number (25580), on microfilm (24148). I have attached images of the mentioned manuscripts at the end of the introduction.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 27
  },
  {
    "serial_number": "3331488",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "[My Work on the Book] 1 - I matched the two copies and transcribed one copy from them, then checked the transcription against the manuscript to achieve complete accuracy, as much as possible. 2 - I performed Takhrij (referencing) for the Hadiths that appeared in the part, stating their grade, through the sayings of the scholars of Jarh and Ta'dil. 3 - I provided biographies for the notables mentioned in the book, mentioning the sources of the biography for those who wish to return to them and benefit. I left out biographies for the Companions due to their fame. 4 - I mentioned who extracted the author's sayings or benefited from them. 5 - I introduced the book with a study of the book, its author, and a description and authentication of the linear copies. 6 - I prepared scientific indexes that serve the book. Finally... with pages from our precious heritage, with the words of the righteous predecessors, I leave you hoping for success and correctness in what I have presented. Praise be to Allah first and last. (Majdi Fathi Al-Sayyid Ibrahim)",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 28
  },
  {
    "serial_number": "3331489",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "First page of the manuscript",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 29
  },
  {
    "serial_number": "3331490",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 30,
    "volume_number": 1,
    "text": "Last page of the manuscript",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 30
  },
  {
    "serial_number": "3331491",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Part containing the Questions of Abu Bakr Al-Barqani to the Hafiz Abu Al-Hasan Ali bin Ahmad Al-Daraqutni. Narration of Abu Ghalib Muhammad bin Al-Hasan bin Ahmad Al-Karji Al-Baqillani from Al-Barqani. Narration of Hafiz Abu Tahir Ahmad bin Muhammad bin Ahmad Al-Silafi Al-Isbahani. Narration of Abu Abdullah Muhammad bin Ibrahim bin Ahmad Al-Farisi Al-Fayruzabadi from him. Narration of Abu Al-Fadl Abdul Rahim bin Abdul Mun'im bin Khalaf Al-Damiri from him. Narration of Imam Abu Umar Abdul Aziz bin Muhammad bin Ibrahim bin Jama'ah from him by Ijazah (license). Narration of Umm Abdullah Aisha daughter of Ali bin Muhammad Al-Kinaniyyah Al-Hanbaliyyah from him by Ijazah. Narration of Abu Al-Fadl Abdul Rahman bin Ahmad bin Ismail bin Al-Qalqashandi from her by reading. Praise be to Allah... It was heard before the original Sheikhah, the benevolent, the writer, the centenarian, the Musnidah (transmitter) Umm Abdullah Aisha daughter of the Sheikh, the Imam, Chief Judge Ala' al-Din Ali bin Muhammad Al-Asqalani Al-Kinani Al-Hanbali with her chain of transmission in her seclusion, by the reading of Abu Al-Fadl Abdul Rahman bin Ahmad bin Ismail bin Muhammad Al-Qalqashandi Al-Shafi'i, may Allah be kind to him. This is his handwriting. [Also hearing were] the virtuous Shams al-Din Muhammad bin Ahmad bin Hasan bin",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 31
  },
  {
    "serial_number": "3331492",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "Al-Ghanami, Al-Bistami, and the Muhaddith Najm al-Din Muhammad, called Umar bin Muhammad bin Muhammad bin Fahd Al-Makki, and the independent Shams al-Din Muhammad bin Muhammad bin Muhammad Al-Sanbati. This was validated on Sunday, the ninth of Shawwal, year eight hundred and thirty-eight, at the home of the auditor, next to the Salihiyya School in Cairo. She gave license. They heard from him by my reading a part containing the Hadith of Wahshi regarding the killing of Hamza bin Abdul Muttalib, graduated by Judge Izz al-Din bin Jama'ah with his license from him. Praise be to Allah alone, and peace and blessings of Allah be upon Muhammad, his family, and his companions. Allah suffices us, and He is the best disposer of affairs. Praise be to Allah: - It was heard before the Sheikh, the Imam, Hafiz of the Era, Chief Judge, Shihab al-Din Abu Al-Fadl Ahmad bin Ali bin Hajar Al-Asqalani Al-Shafi'i by his reading to Abu Al-Tahir Muhammad bin Muhammad bin Abdul Latif Al-Takriti by his hearing from Judge Abdullah bin Abdul Aziz bin Jama'ah with his chain by reading. Our Sheikh said: I read it with a high chain (Aliyan) to Abu Al-Ma'ali Abdullah bin Umar bin Ali Al-Halawi, and Sarah daughter of Imam Taqi al-Din Ali bin Abdul Kafi Al-Subki. They said: Zainab bint Al-Kamal informed us. The first said: by Ijazah, and the other: by Sama' (hearing). Al-Halawi added: And Abu Bakr bin Muhammad bin Al-Dhahabi. They said: Abu Al-Qasim bin Makki Al-Tarabulsi informed us by Ijazah; Al-Silafi informed us with his chain in it by the reading of Sheikh Ni'matullah bin Muhammad bin Abdul Rahman Al-Jarhi, and Imam Burhan al-Din Ibrahim bin Khidr Al-Uthmani, and Abu Al-Fadl Abdul Rahman bin Ahmad bin Ismail bin Al-Qalqashandi, and this is his handwriting, and Muhibb al-Din Abdullah bin",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 32
  },
  {
    "serial_number": "3331493",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "Abdul Latif bin Imam Al-Mahalli, Yunus bin Faris Al-Qadiri, and others. It was validated on the night of Sunday, the twelfth of Jumada Al-Awwal year eight hundred and thirty-nine at the Salihiyya School in Cairo, and he gave license. Praise be to Allah.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 33
  },
  {
    "serial_number": "3331494",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. My Lord, increase me in knowledge. I read to the Sheikhah, the Musnidah, the Original, the Writer, Umm Abdullah Aisha daughter of the Judge of Muslims Ala' al-Din Ali bin Muhammad bin Abu Al-Fath Al-Asqalani Al-Hanbali (1) on Sunday, ninth of Shawwal year eight hundred and thirty-eight at her home next to the Salihiyya School in Cairo, by her license from the Judge of Muslims Izz al-Din Abu Umar Abdul Aziz bin Judge of Muslims Badr al-Din Muhammad bin Ibrahim bin Sa'd bin Jama'ah (2), he said: Sheikh Muhyi al-Din Abu Al-Fadl Abdul Rahim bin Abdul Mun'im bin Khalaf Al-Damiri (3) informed us, he said: Al-Fakhr",
    "foot_note": "1. (1) Granddaughter of Al-Qalanisi. Born 761 AH. Attended her grandfather Fath al-Din Al-Qalanisi, heard from Al-Izz bin Jama'ah, Judge Muwaffaq al-Din Al-Hanbali, Nasir al-Din Al-Harawi. She has Ijazah from Muhibb al-Din Al-Khalati and a group of Syrians and Egyptians. Students took much from her. She was benevolent, wrote good handwriting. Died 840 AH. See: Shadharat al-Dhahab (7 / 234 - 235).\n2. Originally from Hama, born in Damascus, Egyptian [by residence], Shafi'i. Wrote parts, read major books himself, heard high and low chains. Taught, gave fatwas, assumed Chief Judgeship in Egypt. Performed Hajj and stayed in Mecca often. Was benevolent, righteous, good-mannered, with many virtues. Nothing shameful in his religion was memorized against him. Died 767 AH. See: Dhail Tadhkirat al-Huffaz (p. 41 - 43), Tabaqat al-Shafi'iyyah by Al-Subki (6 / 123 - 124), Al-Bidaya wa Al-Nihaya (14 / 319), Al-Aqd Al-Thamin (5 / 457), Al-Nujum Al-Zahirah (11 / 89), Husn Al-Muhadarah (1 / 359), Shadharat al-Dhahab (6 / 208 - 209), Hadiyat al-'Arifin (1 / 582), Al-Risalah Al-Mustatrafah (p. 100 - 101), Al-A'lam by Zirikli (4 / 151).\n3. Al-Damiri: Relative to Damira, a village in Egypt. Took from Hafiz Ali bin Al-Mufaddal and Abu Talib bin Hadidah, and took much from Al-Fakhr Al-Farisi. He was a virtuous, religious Imam. Died in Muharram 695 AH. See: Shadharat al-Dhahab (6 / 431). (*)",
    "book_id": "1060",
    "new_page_number": 34
  },
  {
    "serial_number": "3331495",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "Abu Abdullah Muhammad bin Ibrahim bin Ahmad Al-Farisi Al-Fayruzabadi (1) by hearing from him on the seventh of Jumada Al-Awwal year six hundred and seventeen, he said: Hafiz Abu Tahir Ahmad bin Muhammad bin Ahmad bin Muhammad Al-Silafi Al-Isbahani (2) informed us in Alexandria on the fourth of Sha'ban year five hundred and seventy-four, he said: I read to Sheikh Abu Tahir (3) Ahmad (4) bin Al-Hasan bin Ahmad Al-Karji (5) in the month of Rabi' Al-Awwal year four hundred and ninety-six in Baghdad from Hafiz Abu Bakr Ahmad bin Muhammad bin Ghalib Al-Barqani (6) who said:",
    "foot_note": "1. (1) Shafi'i, resident of Egypt, Sufi. Has works on the signals of the folk (Sufis) containing clear deviation from the Sunnah. He had sweet delivery, memorized much. Heard much from Al-Silafi, wrote and acquired. In Damascus from Ibn Asakir. Lived long until he died on 16 Dhu al-Hijjah 622 AH. See: Al-'Ibar (5 / 91), Al-Wafi bi al-Wafiyat (2 / 9), Al-Nujum Al-Zahirah (6 / 263), Husn Al-Muhadarah (1 / 259), Shadharat al-Dhahab (5 / 101).\n2. He is the very learned Imam, Mufti, Hafiz, Muhaddith, Sheikh al-Islam, Abu Tahir Al-Silafi. Wrote high and low chains, copied countless parts. Produced (Al-Arba'in Al-Baldiyyah) which had no precedent. He is one of the trustworthy, was pious, of good understanding and insight, commanding right and forbidding wrong. Died 576 AH. See: Tahdhib Tarikh Dimashq (1 / 449), Al-'Ibar (4 / 227), Tadhkirat al-Huffaz (4 / 1298), Al-Mizan (1 / 155), Tabaqat al-Shafi'iyyah by Al-Subki (6 / 32), Al-Bidaya wa Al-Nihaya (12 / 307), Lisan al-Mizan (1 / 299).\n3. In Manuscript (B): Abu Talib. Correct is what we established from (A).\n4. In Manuscript (B) Muhammad. Correct is what we established from (A).\n5. Muhaddith Imam, authority. Was a chaste Sheikh, ascetic, devoted to Allah, trustworthy, understanding. Heard Kitab Al-Sunan of Sa'id bin Mansur from Ibn Shadhan. Died 489 AH. See: Al-Muntazam (9 / 98), Al-'Ibar (3 / 324), Tadhkirat al-Huffaz (4 / 1227), Al-Wafi bi al-Wafiyat (6 / 306), Shadharat al-Dhahab (3 / 392).\n6. Jurist Imam, Firm Hafiz, Sheikh of Jurists and Muhaddithin, author of works. Was trustworthy, pious, understanding, had a share of Arabic knowledge, prolific in Hadith. Compiled a (Musnad) including what Bukhari and Muslim contained. Was eager for knowledge, narrated from... = (*)",
    "book_id": "1060",
    "new_page_number": 35
  },
  {
    "serial_number": "3331496",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "1 - I asked the Great Hafiz Abu Al-Hasan Ali bin Umar bin Ahmad bin Mahdi Al-Daraqutni (1), I said: (In the Hadith of Amr bin Dinar (2) from Ata' bin Yasar (3) from Abu Huraira: \"When the prayer is established, there is no prayer except the obligatory one\" (4), there is an addition: It was said, 'O Messenger of Allah, not even the two rak'ahs of Fajr?' He said: \"Not even the two rak'ahs of Fajr\" (1). He said: Only Muslim bin Khalid (2) narrated it, and from him Nasr bin Hajib (3). Then he said to me: So this Nasr bin Hajib, what is he? He said: I said: They said he is a Marwazi (from Merv). 2 - I said to him: In the Hadith of Sharik (4) (\"No marriage except with a guardian",
    "foot_note": "1. = Al-Daraqutni, and said: Al-Daraqutni used to dictate defects to me from his memory. Al-Khatib Al-Baghdadi said: I asked Al-Barqani: Did Abu Al-Hasan - Al-Daraqutni - dictate defects to you from his memory? He said: Yes, I am the one who collected them, and people read from my copy. Al-Barqani died in early Rajab 425 AH. See: Tarikh Baghdad (4 / 373), Al-Muntazam (8 / 79), Tadhkirat al-Huffaz (3 / 1074), Al-'Ibar (3 / 156), Al-Wafi bi al-Wafiyat (7 / 331), Tabaqat Al-Subki (4 / 47), Al-Bidaya wa Al-Nihaya (12 / 36), Al-Nujum Al-Zahirah (4 / 280), Shadharat al-Dhahab (3 / 228), Hadiyat al-'Arifin (1 / 74). Detailed biography preceded.\n1. The Author, biography preceded.\n2. The Great Imam, Hafiz, Abu Muhammad Al-Jumahi, Sheikh of the Haram in his time. Trustworthy, firm. His Hadith is in the Six Books. Gave Fatwa in Mecca for thirty years. Was a vessel of knowledge. Died 216 AH. See: Tabaqat Ibn Sa'd (5 / 479), Al-Tarikh Al-Kabir (6 / 328), Al-Jarh wa Al-Ta'dil (6 / 231), Al-Tahdhib (8 / 28), Shadharat al-Dhahab (1 / 171).\n3. Al-Hilali, Abu Muhammad Al-Madani, Mawla of Maymunah. Trustworthy, virtuous, master of sermons and worship. From the younger ones of the third generation. His Hadith is in the Six Books. Died 94 AH. See: Tabaqat Ibn Sa'd (5 / 173), Al-Tarikh Al-Kabir (6 / 461), Tadhkirat al-Huffaz (1 / 84), Al-'Ibar (1 / 125), Al-Tahdhib (7 / 217), Al-Taqrib (2 / 23), Shadharat al-Dhahab (1 / 125).\n4. Authentic (Sahih). Narrated by Ahmad (2 / 455), Muslim (493), Abu Dawud (1266), Al-Tirmidhi (421), Al-Nasa'i (2 / 116, 117), Ibn Majah (1151), Abdul Razzaq (3989), Ibn Khuzaima (1123), Ibn Hibban (3 / 308), (4 / 82), Al-Tabarani (1 / 16), (1 / 192) in Al-Mu'jam Al-Saghir, Abu Nu'aym (8 / 138), (9 / 222) in Hilyat al-Awliya, Al-Khatib in his History (1 / 315), (4 / 52), (5 / 197), Al-Bayhaqi (2 / 482) in Al-Sunan Al-Kubra, Al-Baghawi (804) in Sharh al-Sunnah. He said: The Marfu' (elevated) is more correct, and most scholars from the Companions and Tabi'in and those after them hold: That prayer... = (*)",
    "book_id": "1060",
    "new_page_number": 36
  },
  {
    "serial_number": "3331497",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "and two just witnesses\") (1). Regarding the Hadith of Abu Musa from the Prophet (peace be upon him), is the saying (\"and two just witnesses\") preserved (Mahfuz)? He said: Who [narrated it] from Sharik? I said: Ali bin Hajar (2).",
    "foot_note": "1. = if established, he is prevented from the two rak'ahs of Fajr and other Sunan except the obligatory one.\n1. Al-Bayhaqi (2 / 483) in his Sunan. Ibn Adi said: I do not know of anyone mentioning this addition in his text other than Yahya bin Nasr from Muslim bin Khalid from Amr. The Sheikh said: It has been said from Ahmad bin Sayya... Nasr bin Hajib, and it is a delusion. Nasr bin Hajib Al-Marwazi is not strong, and his son Yahya likewise. * Then Al-Bayhaqi (2 / 483) narrated the Hadith from another path and said this addition has no basis.\n2. He is Muslim bin Khalid Al-Zanji, Meccan jurist, had many delusions. Abu Dawud and Ibn Majah narrated from him. Died 179 AH. Al-Daraqutni said about him: Munkar al-Hadith (Rejected in Hadith). See: Al-Tarikh Al-Kabir (7 / 260), Al-Jarh wa Al-Ta'dil (8 / 183), Al-Mizan (4 / 102), Al-Du'afa by Al-Nasa'i (569), Al-Du'afa by Al-Daraqutni (342), Al-Taqrib (2 / 245).\n3. He is Nasr bin Hajib Al-Khurasani, from Nishapur, settled in Al-Mada'in. Narrated from Abu Nahik, Al-Ala' bin Abdul Rahman, Jarir bin Zaid. Anbasah the Judge of Rayy narrated from him. Abu Hatim said: Salih al-Hadith (Good in Hadith). Abu Zur'ah said: Truthful, no harm in him. Reports from Yahya differ: sometimes \"Trustworthy,\" other times \"He is nothing.\" Abu Awana said: Truthful, no harm in him. As for Al-Nasa'i, he said in Al-Tamyiz: Not trustworthy. I say: This does not prevent him from being truthful. See: Al-Jarh wa Al-Ta'dil (8 / 466), Al-Mizan (4 / 250), Al-Lisan (6 / 152).\n4. He is Sharik bin Abdullah Al-Nakha'i, Abu Abdullah, the Judge. Truthful but errs much. His memory changed since he assumed judgeship in Kufa. He was just, virtuous, worshipping, severe against people of innovation. Muslim and the Four [Sunan authors] narrated from him. Died 177 or 178 AH. See: Al-Tarikh Al-Kabir (2 / 2 / 237), Al-Mizan (2 / 270), Al-Tahdhib (4 / 333), Al-Taqrib (1 / 351). (*)",
    "book_id": "1060",
    "new_page_number": 37
  },
  {
    "serial_number": "3331498",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "He said: Allah forbid! This is false (Batil). It is only his saying: (\"No marriage except with a guardian\") (1). Al-Barqani said: But they have narrated it with the addition (\"and two just witnesses\"). 3 - I heard Abu Al-Hasan say: Al-Burani (2) died on the first day of Muharram, year [two hundred] twenty-one (3). And Ahmad bin Mani' (4) died in the year two hundred forty-four (1). 4 - And I heard Abu Al-Hasan say: Ibn Makhlad (2) and Ibn Abdul Majid (3) both told us from Abbas (4) from Yahya (5) who said:",
    "foot_note": "1. (1) Authentic (Sahih). It has paths from Abu Musa, Aisha, Imran, Ibn Abbas, and others. * Hadith of Abu Musa Al-Ash'ari: Narrated by Al-Tabarani in (Al-Awsat) and (Al-Kabir). It contains Abu Bilal Al-Ash'ari, who is weak. Al-Haythami said this in Majma' al-Zawa'id (4 / 286). * Hadith of Aisha: Narrated by Ibn Hibban (6 / 152), Al-Daraqutni (3 / 226), Al-Bayhaqi (7 / 125) from paths from Ibn Jurayj from Sulaiman bin Musa from Al-Zuhri from Urwa from her, Marfu'. Al-Daraqutni said: Likewise, Sa'id bin Khalid narrated that Abdullah bin Amr bin Uthman, Yazid bin Sinan, Nuh bin Darraj, and Abdullah bin Hakim [narrated] from Hisham bin Urwa from his father from Aisha with it. Abbas said: I said to Yahya: Does Ibn Jurayj narrate the Hadith (No marriage except with a guardian)? He said: Only the Hadith of Sulaiman bin Musa is authentic. * Hadith of Ibn Abbas: Narrated by Al-Shafi'i (2 / 317), and from him Al-Bayhaqi (7 / 112), and he said: Adi bin Al-Fadl narrated it, and he is weak; the correct is Mawquf. Al-Daraqutni (3 / 221 - 222) said: Adi bin Al-Fadl elevated it, and no one else elevated it. * Hadith of Ibn Umar: Narrated by Al-Daraqutni (3 / 225). In its chain is Thabit bin Zuhair; Al-Bukhari said about him: Munkar al-Hadith. * Hadith of Ibn Masud: Narrated by Al-Daraqutni (3 / 225). In its chain is Abdullah bin Muhriz, and he is abandoned (Matruk). * Hadith of Imran bin Husain: Narrated by Al-Bayhaqi (7 / 125), containing Ibn Al-Muhriz. * Hadith of Abu Huraira: Narrated by Al-Bayhaqi (7 / 125). In its chain is Al-Mughira bin Musa, Basri; Al-Bukhari said: Munkar al-Hadith. * Mursal of Al-Hasan Al-Basri: Narrated by Al-Bayhaqi (7 / 125) via Al-Shafi'i. Al-Shafi'i said: Although this is disconnected (Munqati') below the Prophet (pbuh), most scholars hold it. \n2. He is Ali bin Hajar bin Iyas, Al-Sa'di Al-Marwazi, resident of Baghdad. Trustworthy Hafiz, from the younger ones of the ninth generation. The two Sheikhs (Bukhari/Muslim), Abu Dawud, and Al-Nasa'i narrated from him. Died... = (*)",
    "book_id": "1060",
    "new_page_number": 38
  },
  {
    "serial_number": "3331499",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "(We were with Abu Dawud Al-Tayalisi (1) and he said: Shu'ba (2) told us from Abdullah bin Dinar (3) from Ibn Umar: (\"The Messenger of Allah, peace be upon him, forbade Qaza' [shaving part of the head]\") (4). He [Yahya] said: So it was said to him: O Abu Dawud, is this the Hadith of Shababa (5)? He said: So leave it.",
    "foot_note": "1. = 244 AH. See: Al-Tarikh Al-Kabir (6 / 272), Al-Saghir (2 / 379), Al-Jarh wa Al-Ta'dil (6 / 173), Tarikh Baghdad (11 / 416), Tadhkirat al-Huffaz (2 / 450), Al-'Ibar (1 / 443), Al-Tahdhib (7 / 293), Al-Nujum Al-Zahirah (2 / 318), Shadharat al-Dhahab (2 / 105).\n1. Authentic by its paths and supporting evidences. Narrated by Ahmad (4 / 294, 413, 418), Abu Dawud (2085), Al-Tirmidhi (1102), Ibn Hibban (6 / 152, 153, 154, 156), Al-Bayhaqi (7 / 107), Al-Baghawi (2261) in Sharh al-Sunnah. Al-Hakim (2 / 169 - 170) spoke on its paths saying: In this chapter, there are reports from Ali bin Abi Talib, Abdullah bin Abbas, Mu'adh bin Jabal, Abdullah bin Umar, Abu Dharr Al-Ghifari, Al-Miqdad bin Al-Aswad, Abdullah bin Masud, Jabir bin Abdullah, Abu Huraira, Imran bin Husain, Abdullah bin Amr, Al-Miswar bin Makhrama, Anas bin Malik, and from Aisha, Umm Salamah, and Zainab bint Jahsh, may Allah be pleased with them all. See: Al-Mustadrak (2 / 172).\n2. He is Al-Hasan bin Al-Rabi' Al-Bajali, Abu Ali Al-Kufi. Was trustworthy, firm, worshipping. His Hadith is in the Six Books. From the tenth generation. Al-Burani: relative to making and selling 'Bawari'. Bariyah: woven mat. See: Al-Tarikh Al-Kabir (1 / 2 / 294), Al-Jarh wa Al-Ta'dil (3 / 13 - 14), Tarikh Baghdad (7 / 307 - 309), Al-Tahdhib (2 / 278), Al-Taqrib (1 / 166), Shadharat al-Dhahab (2 / 48).\n3. Regarding Al-Bukhari: died year (220) or thereabouts. Regarding Ibn Sa'd: year (221) in Ramadan. Ibn Al-Imad placed him in deaths of year (221). See previous references.\n4. The Trustworthy Hafiz, Abu Ja'far Al-Baghawi, Al-Baghdadi. From the tenth generation. His Hadith is in the Six Books. Traveled, collected, and compiled the (Musnad). See: Al-Tarikh Al-Kabir (2 / 6), Al-Saghir (2 / 379), Al-Jarh wa Al-Ta'dil (2 / 77), Tarikh Baghdad (5 / 160), Tadhkirat al-Huffaz... = (*)",
    "book_id": "1060",
    "new_page_number": 39
  },
  {
    "serial_number": "3331500",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "Abu Al-Hasan said: No one narrated this except Shababa, and this is a story of a great disaster regarding Abu Dawud) (1). 5 - I said to Abu Al-Hasan: Nafi' (2) from Ibn Umar that the Prophet (peace be upon him) (\"used to go out for Eid taking a different path\") (3).",
    "foot_note": "1. = (2 / 481), Al-'Ibar (1 / 442), Al-Wafi bi al-Wafiyat, Al-Bidaya wa Al-Nihaya (10 / 346), Al-Tahdhib (1 / 84), Shadharat al-Dhahab (2 / 105).\n1. No one contradicted what Imam Al-Daraqutni said except what Ibn Hajar mentioned in Al-Tahdhib (1 / 84) that it was said: (243) AH.\n2. He is Muhammad bin Makhlad bin Hafs, Imam, Hafiz, Trustworthy. Kunya Abu Abdullah, Al-Duri, Al-Baghdadi. Wrote indescribably much, with understanding and knowledge, and good compilations. Was described with knowledge, righteousness, truthfulness, and diligence in seeking. Died 231 AH. See Tarikh Baghdad (7 / 282 - 283).\n3. (Note: Missing footnote 3 text in source, assumed context: Ibn Abdul Majid is a narrator).\n4. He is the Imam, Hafiz, Trustworthy, Author, Abbas bin Muhammad Al-Duri. From the eleventh generation. Abu Al-Fadl Al-Baghdadi. His Hadith is in the Six Books. Died 271. See: Al-Jarh wa Al-Ta'dil (6 / 216), Tarikh Baghdad (1 / 144, 146), Tadhkirat al-Huffaz (2 / 579), Siyar A'lam al-Nubala (12 / 522), Al-Tahdhib (5 / 129), Al-Taqrib (1 / 399), Shadharat al-Dhahab (2 / 161).\n5. He is the Commander of the Faithful in Hadith, the Great Imam, Yahya bin Sa'id bin Farrukh, Abu Sa'id Al-Tamimi. Trustworthy, proficient, exemplary Imam. From the seniors of the ninth generation. His Hadith is in the Six Books. Died 198 AH. See: Tabaqat Ibn Sa'd (7 / 293), Al-Tarikh Al-Kabir (8 / 276), Al-Saghir (2 / 283), Al-Jarh wa Al-Ta'dil (9 / 150), Hilyat al-Awliya (8 / 380), Tarikh Baghdad (14 / 135), Al-'Ibar (1 / 327), Tadhkirat al-Huffaz (1 / 298), Al-Tahdhib (11 / 16), Shadharat al-Dhahab (1 / 355). (*)",
    "book_id": "1060",
    "new_page_number": 40
  },
  {
    "serial_number": "3331501",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "Did anyone other than Al-Umari - meaning Abdullah bin Umar (1) - narrate it from Nafi'? He said: From a path that is not established, no. He said: It was narrated from Malik (2) from Nafi', and narrated from Al-Sha'bi (3) from Jabir, but it is not established. 6 - I said to him: Al-A'mash (4) from Abu Zabyan (5), is he the father of",
    "foot_note": "1. (1) The Great Hafiz, author of Al-Musnad, the Trustworthy Imam, Sulaiman bin Dawud bin Al-Jarud, known as Abu Dawud Al-Tayalisi. He erred (may Allah have mercy on him) in Hadiths, but they are submerged in the sea of his flowing knowledge. His Hadith is in the Six Books. Died 204 AH. See: Tabaqat Ibn Sa'd (7 / 298), Al-Tarikh Al-Kabir (4 / 10), Al-Saghir (2 / 299), Al-Jarh wa Al-Ta'dil (4 / 111), Tarikh Baghdad (9 / 24), Al-'Ibar (1 / 345), Al-Mizan (2 / 203), Tadhkirat al-Huffaz (1 / 351), Al-Tahdhib (4 / 176), Shadharat al-Dhahab (2 / 12).\n2. He is the Commander of the Faithful in Jarh and Ta'dil, the Noble Hafiz, Shu'ba bin Al-Hajjaj bin Al-Ward. Was among the trustworthy worshippers. His Hadith is in the Six Books. Died 160 AH. See: Tabaqat (7 / 280), Al-Tarikh Al-Kabir (4 / 244), Al-Saghir (2 / 135), Al-Jarh wa Al-Ta'dil (1 / 126), Hilyat al-Awliya (7 / 144), Tarikh Baghdad (9 / 255), Wafiyat al-A'yan (2 / 469), Tadhkirat al-Huffaz (1 / 193), Al-'Ibar (1 / 234), Al-Tahdhib (4 / 338), Shadharat al-Dhahab (1 / 247).\n3. The Muhaddith Imam, Sheikh of his time, Abu Abdul Rahman Al-Madani, Mawla of Ibn Umar. One of the trustworthy. His Hadith is in the Six Books. Died 130 AH. See: Al-Tarikh Al-Saghir by Bukhari (2 / 31), Al-Jarh wa Al-Ta'dil (5 / 46), Tadhkirat al-Huffaz (1 / 126), Al-Mizan (2 / 417), Al-Tahdhib (5 / 201).\n4. Authentic (Sahih). Narrated by Al-Bukhari (5920), (5921), Muslim (2120), Ahmad (2 / 4, 54), Abu Dawud (4196), Al-Nasa'i (8 / 134, 135), Ibn Majah (3637), Al-Bayhaqi (9 / 305) in Al-Sunan Al-Kubra, Al-Baghawi (3185) in Sharh al-Sunnah. The phrase (Qaza'): If a boy is shaved, leaving hair here and here. The origin of Qaza' is pieces of scattered cloud; patches of hair on his head were likened to them.\n5. He is the Hafiz, Proof, Shababa bin Sawwar, Abu Amr Al-Fazari. His Hadith is in the Six Books. One of the trustworthy. Died 206 AH. See: Tabaqat Ibn Sa'd (7 / 340), Al-Tadhkira (1 / 361), Al-Tahdhib (4 / 300). (*)",
    "book_id": "1060",
    "new_page_number": 41
  },
  {
    "serial_number": "3331502",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 42,
    "volume_number": 1,
    "text": "Qabus (1)? He said: Yes (2). I said: What is his name? He said: Husain bin Jundub, Trustworthy (3). 7 - I said to him: Qatada (4) from Anas: (\"The reading of the Prophet, peace be upon him, was elongated [Madd]\") (5). Did anyone other than Jarir bin Hazim (6) narrate it from Qatada?",
    "foot_note": "1. (1) This report clarifies that Abu Dawud Al-Tayalisi has mistakes, but is there a Muhaddith or Hafiz free from mistake?! Therefore Ahmad bin Al-Furat said: I haven't seen anyone proliferate regarding Shu'ba more than Abu Dawud. I asked Ahmad bin Hanbal about him, he said: Trustworthy, Truthful. I said: Does he err? He said: It is tolerated from him. See: Tahdhib al-Kamal (538). Ibn Adi said: Trustworthy, errs. Then he said: And he is to me and others nothing but vigilant, firm. See: Al-Kamil by Ibn Adi (282). Ibn Sa'd said: Trustworthy, prolific in Hadith, perhaps he erred. See: Tabaqat Ibn Sa'd (7 / 298).\n2. The Mufti Imam, Firm Trustworthy, Scholar of Medina, Abu Abdullah Al-Qurashi, Mawla of Ibn Umar and his narrator. His Hadith is in the Six Books. Died 117 AH. See: Al-Tarikh Al-Kabir (8 / 48), Al-Tadhkira (1 / 99), Al-Bidaya wa Al-Nihaya (9 / 319), Al-Tahdhib (10 / 412), Shadharat al-Dhahab (1 / 154).\n3. Authentic (Sahih). Narrated from the Hadith of Ibn Umar by Ahmad (2 / 109), Abu Dawud (1156), Ibn Majah (1299) with its meaning, Al-Daraqutni (2 / 44), Al-Hakim (1 / 296), Al-Bayhaqi (3 / 309). * From the Hadith of Abu Huraira, narrated by Ahmad (2 / 338), Al-Tirmidhi (539), Ibn Majah (1301), Ibn Hibban (4 / 207), Ibn Khuzaima (707), Al-Darimi (1 / 378), Al-Hakim (1 / 296), Al-Bayhaqi (3 / 308) in Al-Sunan Al-Kubra, Al-Baghawi (1108) in Sharh al-Sunnah. * From the Hadith of Jabir, narrated by Al-Bukhari (986), Al-Bayhaqi (3 / 308) in Al-Sunan Al-Kubra. * From the Hadith of Abu Rafi', narrated by Ibn Majah (1300), its chain is weak, but in supporting evidences... = (*)",
    "book_id": "1060",
    "new_page_number": 42
  },
  {
    "serial_number": "3331503",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "(...)",
    "foot_note": "1. = [Fiqh of Hadith]: The Prophet (pbuh) did that to encompass them in joy with him, and in seeing him, and benefiting from him in fulfilling their needs for fatwa, or learning, following, seeking guidance, or charity, or greeting them, etc. See: Fath al-Bari (2 / 473).\n1. He is Abu Abdul Rahman, Al-Umari Al-Madani, weak, worshipper. From the seventh generation. Died 173 AH. See: Al-Tarikh Al-Kabir (3 / 80), Al-Saghir (2 / 179), Al-Uqayli 844 in Al-Du'afa, Al-Nasa'i (325) in Al-Du'afa, Al-Jarh wa Al-Ta'dil (2 / 45), Al-Majruhin (2 / 6), Al-Du'afa by Al-Daraqutni (325), Al-Mizan (2 / 413), Al-Tahdhib (5 / 198), Al-Taqrib (1 / 434).\n2. The Hafiz Imam, Jurist, Imam of the Abode of Migration (Medina), Head of the Pious, and Leader of the Firm. His Hadith is in the Six Books. Died 179 AH. See: Hilyat al-Awliya (6 / 316), Al-Tadhkira (1 / 207), Al-Bidaya wa Al-Nihaya (1 / 207), Al-Tahdhib (10 / 5), Shadharat al-Dhahab (2 / 12).\n3. He is the Virtuous Jurist, the Famous Trustworthy, Amir bin Sharahil. His Hadith is in the Six Books. From the third generation. Died after 100 AH. See: Tabaqat Ibn Sa'd (6 / 246), Tarikh Al-Bukhari Al-Saghir (1 / 243), Al-Hilya (4 / 310), Tarikh Baghdad (12 / 227), Wafiyat al-A'yan (3 / 12), Tadhkirat al-Huffaz (1 / 74), Al-'Ibar (1 / 127), Al-Bidaya wa Al-Nihaya (9 / 230), Al-Tahdhib (5 / 65), Al-Nujum Al-Zahirah (1 / 253), Shadharat al-Dhahab (1 / 126).\n4. He is the Sheikh of Reciters and Muhaddithin, Sulaiman bin Mahran, Trustworthy Firm. His Hadith is in the Six Books. Kunya Abu Muhammad. Died 148 AH. See: Tarikh Baghdad (9 / 3), Tadhkirat al-Huffaz (1 / 154), Al-Jarh wa Al-Ta'dil (4 / 146), Al-Hilya (5 / 46), Wafiyat al-A'yan (2 / 400), Al-Mizan (2 / 224), Al-Tahdhib (4 / 222), Shadharat al-Dhahab (1 / 220).\n5. He is the Scholar of Kufa, Trustworthy, Husain bin Jundub bin Amr, Al-Janbi. From the second generation. His Hadith is in the Six Books. Died 90 AH. See: Tabaqat Ibn Sa'd... = (*)",
    "book_id": "1060",
    "new_page_number": 43
  },
  {
    "serial_number": "3331504",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Maktabat Al-Quran for Printing, Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "(...)",
    "foot_note": "1. = (6 / 224), Al-Tarikh Al-Kabir (3 / 3), Al-Jarh wa Al-Ta'dil (3 / 190), Al-'Ibar (1 / 105), Al-Tahdhib (2 / 379), Al-Taqrib (1 / 182), Shadharat al-Dhahab (1 / 99).\n1. He is Qabus bin Abu Zabyan, from the sixth generation, has leniency. Al-Bukhari narrated from him in Al-Adab Al-Mufrad, and Abu Dawud, Al-Tirmidhi, and Ibn Majah. See: Al-Tarikh Al-Kabir (7 / 193), Al-Du'afa by Al-Nasa'i (495), Al-Du'afa by Al-Uqayli (1550), Al-Jarh wa Al-Ta'dil (7 / 145), Al-Majruhin (2 / 215), Al-Mizan (3 / 367), Al-Tahdhib (8 / 305), Al-Taqrib (2 / 115).\n2. Abbas Al-Duri said: I asked Yahya about the Hadith of Al-A'mash from Abu Zabyan? He said: Amr said O Abu Zabyan do you find wealth? Yahya said: This is not the Abu Zabyan who narrates from Ali. See: Al-Tahdhib (2 / 380).\n3. Hafiz Ibn Hajar quoted in the previous source Al-Daraqutni's authentication of him, along with Ibn Ma'in, Al-Ijli, Abu Zur'ah, Al-Nasa'i, Ibn Sa'd, and Ibn Hibban.\n4. He is the Noble Imam, Qatada bin Di'amah Al-Sadusi, Abu Al-Khattab Al-Basri. Trustworthy Firm, from the fourth generation. His Hadith is in the Six Books. Died 117 AH. See: Tabaqat Ibn Sa'd (7 / 1), Tadhkirat al-Huffaz (1 / 122), Al-Bidaya wa Al-Nihaya (9 / 352), Tarikh Al-Thiqat (2 / 389), Al-Jam' bayna Rijal Al-Sahihayn (2 / 422), Al-Tahdhib (8 / 351), Al-Taqrib (2 / 123), Shadharat al-Dhahab (1 / 153).\n5. Authentic (Sahih). Narrated by Al-Bukhari (5046), Al-Daraqutni (1 / 308) in his Sunan, Al-Hakim (1 / 237) in his Mustadrak, Al-Bayhaqi (2 / 46) in Al-Sunan Al-Kubra.\n6. He is Jarir bin Hazim bin Zaid Al-Azdi, Kunya Abu Al-Nadr. Trustworthy, but regarding his Hadith from... = (*)",
    "book_id": "1060",
    "new_page_number": 44
  },
  {
    "serial_number": "3331506",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "He said: Hammam (1). I said: Did anyone other than the two of them narrate it? He said: No. 8 - And I heard him say to Ya'la (2), Umar (3), Muhammad (4), and Idris (5),",
    "foot_note": "1. = Qatada is weak, died in the year 170 AH, and his Hadith is in the six books. See: Al-Tarikh Al-Kabir (2 / 213), Al-Saghir (2 / 25), Al-Jarh wa Al-Ta'dil (2 / 52), Al-Jarh wa Al-Ta'dil (2 / 504), Tadhkirat Al-Huffaz (1 / 199), Al-Mizan (1 / 392), Al-Ibar (1 / 258), Al-Tahdhib (2 / 69), Shadharat Al-Dhahab (1 / 270).\n1. He is Hammam bin Yahya bin Dinar Al-Awadhi, a Hafiz, a proof, trustworthy (Thiqah) but perhaps erred; his Hadith is in the six books, from the seventh class, died in the year 164 or 165 AH. See: Tabaqat Ibn Sa'd (7 / 282), Al-Tarikh Al-Kabir (8 / 237), Al-Tarikh Al-Saghir (2 / 154), Al-Jarh wa Al-Ta'dil (9 / 107), Al-Ibar (1 / 242), Al-Tadhkirah (1 / 201), Al-Tahdhib (11 / 67), Shadharat Al-Dhahab (1 / 258) (2) He is Ya'la bin Ubayd bin Abi Umayyah Al-Kufi, Abu Yusuf, trustworthy except in his Hadith from Al-Thawri, in which there is leniency; from the elders of the ninth class, his Hadith is in the six books, and he was the most established of his father's sons in Hadith. See: Al-Tarikh Al-Kabir (8 / 419), Al-Jarh wa Al-Ta'dil (9 / 304), Al-Mizan (4 / 458), Al-Tahdhib (11 / 402), Al-Taqrib (2 / 378).\n3. He is Umar bin Ubayd, authenticated by Ahmad, Ibn Sa'd, and Ibn Hibban. Abu Hatim said: His status is truthfulness, and Al-Ajli said similarly. Ibn Ma'in said: Righteous (Salih). Therefore, Hafiz Al-Dhahabi said: Trustworthy. As for Ibn Hajar, he said: He is truthful (Saduq). His Hadith is in the six books, from the eighth class. See: Al-Tarikh Al-Kabir (7 / 178), Al-Jarh wa Al-Ta'dil (7 / 123), Al-Mizan (3 / 213), Al-Tahdhib (7 / 480), Al-Taqrib (2 / 60).\n4. He is Muhammad bin Ubayd, trustworthy, a Hafiz, from the eleventh class, his Hadith is in the six books, died in the year 204 AH. See Al-Tarikh Al-Kabir (1 / 173), Al-Jarh wa Al-Ta'dil (8 / 10 - 11), Al-Mizan (3 / 639), Al-Tahdhib (9 / 327), Al-Taqrib (2 / 188).\n5. I did not find him. Al-Hafiz quoted Al-Daraqutni's authentication of him in Al-Tahdhib (7 / 481), (9 / 327). (*)",
    "book_id": "1060",
    "new_page_number": 45
  },
  {
    "serial_number": "3331507",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 46,
    "volume_number": 1,
    "text": "and Ibrahim (1), the sons of Ubayd the Tanafisis; all of them are trustworthy (Thiqat), and their father is Ubayd bin Abi Umayyah (2). Abu Al-Hasan said: And I see the scholars of Hadith say: Ibn Abi Umayyah. 9 - I said to Abu Al-Hasan: Why did Abu Abd al-Rahman al-Nasa'i (3) declare Isma'il bin Abi Uways (4) weak?",
    "foot_note": "1. (1) He is Ibrahim bin Ubayd, narrated from his brother Umar, Zuhayr, and Abu Abd al-Rahman al-Dabbi; and from him narrated Muhammad bin Isma'il al-Razi. Abu Hatim said: A Sheikh in whom there is no harm. See: Al-Jarh wa Al-Ta'dil (2 / 113).\n2. Kunya is Abu Al-Fadl Al-Lahham Al-Kufi, truthful (Saduq), authenticated by Ibn Ma'in and Al-Ajli. As for Abu Zur'ah, he said: There is no harm in him. Abu Hatim said: A Sheikh. Ibn Hibban also authenticated him. Al-Bukhari included him in Al-Adab Al-Mufrad, and Al-Tirmidhi. See: Al-Tarikh Al-Kabir (5 / 441), Al-Jarh wa Al-Ta'dil (5 / 401), Ma'rifat Al-Thiqat by Al-Ajli (1192), Al-Tahdhib (7 / 59), Al-Taqrib (1 / 541). See this statement of Al-Daraqutni in Al-Tahdhib (7 / 481), (9 / 327).\n3. He is the Sheikh of Islam, the Imam, the Hafiz, the trustworthy and established, Ahmad bin Shu'ayb Al-Nasa'i, author of the Sunan, Al-Du'afa, and others. He was among the Sheikhs of knowledge in memorization and precision, with good authorship and criticism of men. Muslim narrated from him. Died in the year 303 AH. See: Wafayat Al-A'yan (1 / 77), Tadhkirat Al-Huffaz (2 / 698), Al-Ibar (2 / 123), Al-Wafi bi Al-Wafayat (6 / 416), Tabaqat Al-Shafi'iyah by Al-Subki (3 / 14), Al-Bidaya wa Al-Nihaya (11 / 123), Siyar A'lam Al-Nubala (13 / 125), Al-Tahdhib (1 / 36), Shadharat Al-Dhahab (2 / 239).\n4. He is Isma'il bin Abdullah Al-Asbahi, truthful (Saduq), erred in Hadiths from his memory, from the tenth class. Al-Bukhari, Muslim, Al-Tirmidhi, and Ibn Majah narrated from him. Died in the year 226 AH. Al-Hafiz Ibn Hajar said: The two Sheikhs (Bukhari and Muslim) used him as proof, except that they did not narrate much from him, nor did Al-Bukhari narrate from him what he was solitary in reporting except for two Hadiths. As for Muslim, he narrated from him less than what Al-Bukhari narrated. The rest narrated from him except Al-Nasa'i, for he explicitly declared him weak, and narrated from Salama bin Shabib what necessitates rejecting his narration. The statement of Ibn Ma'in differed regarding him; he said once: There is no harm in him, and once: Weak, and once: He used to steal Hadith... = (*)",
    "book_id": "1060",
    "new_page_number": 46
  },
  {
    "serial_number": "3331508",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "He said: Muhammad bin Musa Al-Hashimi (1) mentioned—Abu Al-Hasan said: And this is one of the Imams, and Abu Abd al-Rahman used to favor him with what he did not favor his own son with—he mentioned from Abu Abd al-Rahman that he said: (Salama bin Shabib (2) told me about him, he said: Then Abu Abd al-Rahman paused. He said: I continued to coax him after that to tell me the story, until he said to me: Salama bin Shabib said to me: I heard Isma'il bin Abi Uways say: I used to fabricate Hadith for the people of Medina when they differed on something among themselves) (3).",
    "foot_note": "1. = and his father. Abu Hatim said: His status is truthfulness, and he was oblivious. Ahmad bin Hanbal said: There is no harm in him. Al-Daraqutni said: I do not choose him in the Sahih. I (meaning Ibn Hajar) say: We narrated in the virtues of Al-Bukhari with an authentic chain that Isma'il brought out his original books (usool) for him and allowed him to select from them, and to mark what he should narrate so he would narrate it, and turn away from what was other than that. This indicates that what Al-Bukhari narrated from him is from the authentic part of his Hadith because he wrote from his original books. Based on this, nothing of his Hadith is used as proof other than what is in the Sahih, because of the criticism leveled by Al-Nasa'i and others, unless someone else shares in narrating it, then it is considered. See: Al-Tarikh Al-Kabir (1 / 364), Al-Du'afa by Al-Nasa'i (42), and by Al-Uqayli (100), Al-Jarh wa Al-Ta'dil (2 / 180), Al-Mizan (1 / 222), Al-Tahdhib (1 / 312), Al-Taqrib (1 / 71), Muqaddimah Fath Al-Bari (p / 391).\n1. He is Muhammad bin Musa bin Nufai' Al-Harashi. Al-Tirmidhi and Al-Nasa'i narrated from him. Abu Hatim said about him: A Sheikh. Ibn Hibban mentioned him in Al-Thiqat. Al-Nasa'i said: I hope he is truthful, and Al-Dhahabi said likewise. As for Abu Dawud, he weakened him. Ibn Hajar said: Lenient. See: Al-Jarh wa Al-Ta'dil (8 / 84), Al-Mizan (3 / 50), Al-Tahdhib (9 / 482), Al-Taqrib (2 / 211).\n2. He is the Imam Salama bin Shabib Al-Masma'i, Al-Naysaburi, resident of Mecca, trustworthy, from the elders of the eleventh class. Muslim and the four authors of the Sunan narrated from him. See: Al-Jarh wa Al-Ta'dil (4 / 164), Tadhkirat Al-Huffaz (2 / 543), Siyar A'lam Al-Nubala (12 / 256), Al-Tahdhib (4 / 146), Al-Taqrib (1 / 316), Shadharat Al-Dhahab (2 / 116).\n3. Ibn Hajar mentioned it in Al-Tahdhib (1 / 312) with the same path, then said: This is what became clear to Al-Nasa'i about him, so he avoided his Hadith and stated absolutely that he is not trustworthy. Perhaps this was = (*)",
    "book_id": "1060",
    "new_page_number": 47
  },
  {
    "serial_number": "3331509",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "I said to Abu Al-Hasan: Who narrated this to you from Muhammad bin Musa? He said: The Wazir (1), I wrote it from his book and read it to him—meaning Ibn Hinzabah (2)—and he mentioned his majesty and virtue. He said to me: Abu Abd al-Rahman al-Nasa'i narrated from him in the Sahih, and perhaps he died twenty years before him. I said: Is his origin Baghdadi? He said: Yes. Then he said to me: I did not acquire a single letter from him, and he died five years after I wrote the Hadith. Then he said: I wrote in the beginning of the year 315. I heard him say: Ibn Abi Umar Al-Adani (3) narrated in Mecca, trustworthy. 10 - I said to him: Sharik (4) from Abu Al-Yaqzan (5) from Adi bin",
    "foot_note": "1. = from Isma'il in his youth, then he reformed. As for the two Sheikhs (Bukhari and Muslim), it is not thought that they narrated from him anything but the authentic of his Hadith, in which trustworthy narrators shared.\n1. He is the Imam, the Hafiz, the Trustworthy, the Wazir, Ja'far bin Al-Fadl, Al-Baghdadi, resident of Egypt. Hinzabah is a servant girl considered his grandmother on his father's side; in the language, Hinzabah means the short stout woman. He narrated from: Al-Khara'iti and Al-Baghawi, and from him: Al-Daraqutni and Abd al-Ghani al-Masri. Died in the year 391 AH. See: Tarikh Baghdad (7 / 234), Mu'jam Al-Udaba (7 / 163), Wafayat Al-A'yan (1 / 346), Tadhkirat Al-Huffaz (3 / 1022), Al-Ibar (3 / 49), Al-Bidaya wa Al-Nihaya (11 / 329), Shadharat Al-Dhahab (3 / 135).\n2. See Al-Tahdhib (1 / 312), for he said: I read to Abdullah bin Umar from Abu Bakr Ibn Muhammad that Abd al-Rahman bin Makki informed them in writing: The Hafiz Abu Tahir Al-Silafi informed us: Abu Ghalib Muhammad bin Al-Hasan bin Ahmad Al-Baqillani informed us: The Hafiz Abu Bakr Ahmad bin Muhammad bin Ghalib Al-Barqani informed us: Abu Al-Hasan Al-Daraqutni told us. Then he mentioned it.\n3. He is Abu Abdallah Muhammad bin Yahya bin Abi Umar. He was a judge in Aden, then lived in Mecca. Muslim, Al-Tirmidhi, and Ibn Majah narrated from him. See: Tadhkirat Al-Huffaz (501), Al-Tahdhib (9 / 518), Shadharat Al-Dhahab (2 / 107) and others.\n4. Previously translated.\n5. He is Uthman bin Umayr Al-Bajali, one of the weak narrators. He used to practice tadlis (concealing defects) and became confused (mixed up). From = (*)",
    "book_id": "1060",
    "new_page_number": 48
  },
  {
    "serial_number": "3331510",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "Thabit (1) from his father (2) from his grandfather (3), how is this Isnad (chain)? He said: Weak (5). I said: From whose side? He said: Abu Al-Yaqzan is weak (6). I said: So it is abandoned?",
    "foot_note": "1. = the seventh class. Abu Dawud, Al-Tirmidhi, and Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (3 / 245), Al-Saghir (2 / 13), Al-Du'afa by Al-Nasa'i (417), and by Al-Uqayli (1214), Al-Jarh wa Al-Ta'dil (6 / 161), Al-Majruhin (2 / 95), Al-Du'afa by Al-Daraqutni (406), Al-Mizan (3 / 50), Al-Tahdhib (7 / 146).\n1. He is Adi bin Thabit Al-Ansari, trustworthy, from the fourth class, his Hadith is in the six books, died in the year 116 AH. See: Al-Tarikh Al-Kabir (6 / 44), Al-Jarh wa Al-Ta'dil (7 / 2), Al-Tahdhib (7 / 165), Al-Taqrib (2 / 16).\n2. He is Thabit Al-Ansari, narrated from his father and from Ali. Neither Al-Bukhari nor Ibn Abi Hatim mentioned any criticism or validation regarding him. Ibn Hibban included him in Al-Thiqat. Ibn Hajar said: His condition is unknown. See: Al-Tarikh Al-Kabir (2 / 161), Al-Jarh wa Al-Ta'dil (2 / 460), Al-Tahdhib (2 / 19), Al-Taqrib (1 / 118).\n3. His name is disputed as the author will mention. Al-Tirmidhi said: I asked Al-Bukhari about my grandfather Adi, what is his name? He did not know his name. It was said: Amr bin Akhtab, and it was said: He is Ibn Qays Ibn Al-Khatim, and it was said: Ubayd bin Azib. See: Previous references.\n4. Narrated through it: The Hadith of the woman with irregular bleeding (Mustahadah), sneezing, drowsiness, and yawning in prayer being from Satan.\n5. Al-Bukhari said in (Al-Tarikh Al-Awsat): His Hadith - meaning Adi bin Thabit - from his father from his grandfather, and from Ali, is not correct. In Al-Kabir: He is not corroborated in it. Al-Tarikh Al-Kabir (2 / 161).\n6. Ahmad and Abdullah bin Numayr weakened him. Ibn Ma'in said: His Hadith is nothing. Al-Bukhari said: Denounced in Hadith (Munkar al-Hadith). Al-Nasa'i said: Not strong. It was reported from Al-Daraqutni that he said: Deviant, not used as proof, and once he said: Abandoned (Matruk). Ibn Hibban said: He became confused until he did not know what he was saying; it is not permissible to use him as proof. Ibn Hajar quoted these statements in Al-Tahdhib (6 / 146), and Al-Dhahabi in Al-Mizan (2 / 550). (*)",
    "book_id": "1060",
    "new_page_number": 49
  },
  {
    "serial_number": "3331511",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 50,
    "volume_number": 1,
    "text": "He said: No, rather it is extracted (recorded); people have narrated it since ancient times. I said to him: Adi bin Thabit is the son of whom? He said: It has been said: Ibn Dinar, and it has been said: It is his grandfather, his mother's father, and that he is Abdullah bin Yazid (1) Al-Khatmi, and none of this is correct (2). 11 - I said: Is it authentic from Hibban (3) and Mandal (4), the sons of Ali? He said: They are both weak (5). 12 - I asked him about Al-Faraj bin Fadalah (6), he said: Weak. I said:",
    "foot_note": "1. (1) Ibn Ma'in, Abu Hatim, Al-Lalaka'i, and many others, the last being Ibn Hajar, held the view that Abdullah bin Yazid is indeed his maternal grandfather.\n2. Ibn Hajar cited it fully in Al-Tahdhib (2 / 19) and added (I said: So it is authentic that his maternal grandfather is Abdullah bin Yazid? He said: That is what Yahya bin Ma'in claimed). I say: Perhaps this addition is in another copy, or it was dropped from our manuscript copy. Al-Dhahabi said in Al-Mizan (3 / 61 - 62): There is disagreement regarding his lineage. The most correct view is that he is attributed to his maternal grandfather, and that he is Adi bin Thabit bin Qays bin Al-Khatim Al-Ansari, as stated by Ibn Sa'd and others. Ibn Ma'in said: Adi bin Thabit bin Dinar. And it was said: Adi bin Thabit bin Ubayd bin Azib, the son of the nephew of Al-Bara' bin Azib.\n3. Al-Anazi, Abu Ali Al-Kufi, weak, from the eighth class, and he possessed jurisprudence and virtue. Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (2 / 88), Al-Du'afa Al-Saghir (37), Al-Du'afa by Al-Nasa'i (163), Al-Jarh wa Al-Ta'dil (3 / 270), Al-Majruhin (1 / 261), Al-Du'afa by Al-Daraqutni (176), Al-Mizan (1 / 449), Al-Tahdhib (2 / 174), Al-Taqrib (1 / 147).\n4. Al-Anazi, Abu Abdallah, and it is said: His name is Amr, and Mandal is a nickname. Weak, from the seventh class. Abu Dawud and Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (8 / 88), Al-Du'afa Al-Saghir (37), Al-Du'afa by Al-Nasa'i (578), Al-Jarh wa Al-Ta'dil (8 / 270), Al-Majruhin (1 / 162), Al-Mizan (1 / 449), Al-Tahdhib (2 / 174).\n5. Al-Dhahabi reported that Al-Daraqutni said: Both are abandoned (Matrukan), and once: Both are weak. See: Al-Mizan (1 / 449).\n6. Ibn Al-Nu'man Al-Shami, weak, from the eighth class. Abu Dawud, Al-Tirmidhi, and = (*)",
    "book_id": "1060",
    "new_page_number": 50
  },
  {
    "serial_number": "3331512",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "So his Hadith from Yahya bin Sa'id Al-Ansari (1) from Muhammad bin Ali (2) from Ali from the Prophet, peace be upon him: (If my Ummah does fifteen habits) (3)? He said: This is baseless (Batil). I said: Because of Al-Faraj? He said: Yes. I said: Is this Hadith extracted (recorded)? He said: No. I said: Then his Hadith from Luqman bin Amir (4) from Abu Umamah? He said: This is somewhat close, and it is extracted (5).",
    "foot_note": "1. = Ibn Majah narrated from him. Died in the year 179 AH. See: Al-Tarikh Al-Kabir (7 / 134), Al-Du'afa by Al-Nasa'i (491), Al-Du'afa by Al-Uqayli (1518), Al-Jarh wa Al-Ta'dil (7 / 85), Al-Majruhin (2 / 260), Al-Mizan (3 / 343), Al-Tahdhib (8 / 260), Al-Taqrib (2 / 108).\n1. Previously translated.\n2. He is Muhammad bin Umar bin Ali bin Abi Talib, truthful (Saduq), from the sixth class. The authors of the four Sunan narrated from him. His narration from his grandfather is interrupted (Mursal). See: Al-Tahdhib (9 / 361), Al-Taqrib (2 / 194). Hafiz Al-Dhahabi raised the possibility that the intended person might be Muhammad bin Ali bin Al-Hanafiyyah.\n3. Weak. Narrated by Al-Tirmidhi (2307), Ibn Abi Al-Dunya in Dhamm Al-Malahi, Ibn Hibban (2 / 207) in Al-Majruhin, and Al-Khatib (3 / 158), (12 / 396) in his History. In its chain is Al-Faraj bin Fadalah, who is one of the weak narrators, and it contains interruption (Irsal) from Muhammad bin Umar bin Ali. * It has a corroborating narration reported by Al-Tirmidhi (2308) from the Hadith of Abu Hurairah, but its chain is weak, containing Rumayh Al-Judhami, who is unknown as stated in Al-Taqrib (1 / 253).\n4. He is Luqman bin Amir Al-Wassabi, Abu Amir Al-Himsi, truthful (Saduq), from the third class. Abu Dawud and Al-Nasa'i narrated from him. See: Al-Tahdhib (8 / 455 - 456), Al-Taqrib (2 / 138) and others.\n5. Al-Khatib Al-Baghdadi reported it (12 / 396) in Tarikh Baghdad, saying: Al-Barqani informed us, = (*)",
    "book_id": "1060",
    "new_page_number": 51
  },
  {
    "serial_number": "3331513",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "13 - I said to him: Al-Rabi' bin Tha'lab (1) has narrations from Abu Bakr bin Ayyash (2) and from Isma'il bin Ayyash (3)? He signaled with his head: Yes. I said: How are they distinguished? He said: Whatever is from the Levantines (Shamiyyin), it is Isma'il bin Ayyash, and if it is from Asim bin Damrah (4), Abu Ishaq Al-Sabi'i (5), and Layth bin Abi",
    "foot_note": "1. = then he mentioned it in full. Al-Dhahabi referred to it in his Mizan (3 / 344) briefly, and Ibn Hajar cited it fully in Al-Tahdhib (8 / 260).\n1. Abu Al-Fadl Al-Marwazi, Al-Baghdadi. Authenticated by Salih Jazarah and the Hafiz Ali bin Umar. Al-Khatib said: He was, as mentioned to me, a righteous man, truthful and pious. Died in the year 238 AH. See: Al-Jarh wa Al-Ta'dil (3 / 456), Tarikh Baghdad (8 / 418).\n2. He is the Imam Abu Bakr bin Ayyash bin Salim, famous by his kunya, and his name is disputed. Trustworthy, a worshiper, except that when he grew old his memory deteriorated. Muslim narrated from him in his introduction, and the four in their Sunan. Died in the year 194 AH. See: Al-Tarikh Al-Kabir (9 / 14), Al-Hilyah (7 / 303), Tadhkirat Al-Huffaz (1 / 265), Al-Mizan (4 / 494), Al-Tahdhib (12 / 34), Al-Taqrib (2 / 399).\n3. He is Isma'il bin Ayyash bin Sulaym Al-Ansi, truthful in his narration from the people of his land, confused in others. His Hadith is with the authors of the Sunan. Died in the year 181 AH. See: Al-Tarikh Al-Kabir (1 / 369), Al-Jarh wa Al-Ta'dil (2 / 191), Al-Du'afa by Al-Uqayli (1 / 30), Al-Majruhin (1 / 124), Al-Tadhkirah (1 / 233), Al-Mizan (1 / 240), Al-Tahdhib (1 / 321).\n4. He is Asim bin Damrah Al-Saluli, Al-Kufi, truthful, from the third class. The authors of the four Sunan narrated from him. Died in the year 174 AH. See: Al-Tarikh Al-Kabir (3 / 2 / 482), Al-Jarh wa Al-Ta'dil (6 / 345), Al-Tahdhib (5 / 45), Al-Taqrib (1 / 384).\n5. He is Amr bin Abdullah, Abu Ishaq Al-Sabi'i, the Sheikh of Kufa, its scholar and Muhaddith. Trustworthy, a worshiper, he became confused at the end of his life. Died in the year 129 AH. See: Tabaqat Ibn Sa'd (6 / 313), Al-Tarikh Al-Kabir (6 / 347), Al-Jarh wa Al-Ta'dil (6 / 242), Al-Tadhkirah (1 / 114), Al-Mizan (3 / 270), Al-Tahdhib (8 / 63), Shadharat Al-Dhahab (1 / 174). (*)",
    "book_id": "1060",
    "new_page_number": 52
  },
  {
    "serial_number": "3331514",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "Sulaym (1), then it is Abu Bakr bin Ayyash. 14 - I said to him: Hammad (2) from Mufaddal bin Fadalah (3)? He said: This is the brother of Mubarak bin Fadalah (4), a Basran; and Mufaddal bin Fadalah the Egyptian did not meet with Hammad. 15 - I heard Abu Al-Hasan say: Abu Talib the Hafiz (5) told us repeatedly,",
    "foot_note": "1. (1) Ibn Zanim, and his father's name is Ayman, and it was said otherwise. Truthful, became confused finally and his Hadith could not be distinguished so it was abandoned. From the sixth class. Al-Bukhari narrated from him in suspension, and Muslim, and the four in their Sunan. See: Al-Tarikh Al-Kabir (4 / 1 / 246), Al-Du'afa by Al-Nasa'i (511), and by Al-Uqayli (1569), Al-Jarh wa Al-Ta'dil (7 / 177), Al-Majruhin (2 / 231), Al-Mizan (3 / 420), Al-Tahdhib (8 / 465), Al-Taqrib (2 / 138).\n2. He is the Trustworthy, Established Imam, the Jurist, Hammad bin Zayd bin Dirham Al-Azdi, Abu Isma'il. His Hadith is in the six books. Died in the year 179 AH. See: Tabaqat Ibn Sa'd (7 / 286), Al-Tarikh Al-Kabir (3 / 25), Al-Jarh wa Al-Ta'dil (1 / 176), Al-Hilyah (6 / 257), Tadhkirat Al-Huffaz (1 / 228), Al-Tahdhib (3 / 2), Al-Taqrib (1 / 195), Shadharat Al-Dhahab (1 / 292).\n3. Ibn Abi Umayyah, Abu Malik Al-Basri, weak, from the seventh class. Abu Dawud, Al-Tirmidhi, and Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (7 / 405), Al-Du'afa by Al-Nasa'i (563), and by Al-Uqayli (1835), Al-Jarh wa Al-Ta'dil (7 / 317), Al-Mizan (4 / 169), Al-Taqrib (2 / 271), Al-Tahdhib (10 / 273).\n4. Abu Fadalah Al-Basri, truthful (Saduq) but practices Tadlis and Taswiyah. From the sixth class. Al-Bukhari narrated from him in suspension, and Abu Dawud, Al-Tirmidhi, and Ibn Majah. Died in the year 166 AH. See: Al-Tarikh Al-Kabir (7 / 426), Al-Du'afa by Al-Nasa'i (574), and Al-Uqayli (1816), Al-Jarh wa Al-Ta'dil (8 / 338), Al-Mizan (3 / 431), Al-Taqrib (2 / 227), Al-Tahdhib (10 / 30). [Benefit] Al-Dhahabi and Ibn Hajar corrected those who said that Al-Mufaddal is the brother of Faraj bin Fadalah.\n5. Precise Hafiz, the Muhaddith of Baghdad, Abu Talib Ahmad bin Nasr bin Talib Al-Baghdadi. Al-Khatib authenticated him in his History, and he has a useful history book. Died in Ramadan in the year 323 AH. See: Tarikh Baghdad (5 / 182), Tadhkirat Al-Huffaz (3 / 832), Al-Ibar (2 / 198), Al-Wafi = (*)",
    "book_id": "1060",
    "new_page_number": 53
  },
  {
    "serial_number": "3331515",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "He said: I heard Abu Dawud Al-Sijistani (1) say: I heard Al-Abbas bin Abd al-Azim Al-Anbari (2) say: (I saw three whom I made a proof between me and Allah the Exalted: Ahmad bin Hanbal (3), Zayd bin Al-Mubarak Al-San'ani (4), and Sadaqah bin Al-Fadl (5)) (6).",
    "foot_note": "1. = bi Al-Wafayat (8 / 212), Shadharat Al-Dhahab (2 / 298).\n1. The Imam, Sheikh of the Sunnah, leader of the Hafizs, Sulayman bin Al-Ash'ath, the Muhaddith of Basra, one of the Imams of the world in jurisprudence, knowledge, memorization, piety, and precision. He authored his book Al-Sunan and others. Died in the year 275 AH. See: Al-Jarh wa Al-Ta'dil (4 / 101), Tarikh Baghdad (9 / 55), Al-Tadhkirah (2 / 591), Al-Bidaya wa Al-Nihaya (11 / 54), Al-Tahdhib (4 / 169), Shadharat Al-Dhahab (2 / 167).\n2. The Imam, the Exemplar, the Hafiz, the Proficient, Abu Al-Fadl Al-Basri. Al-Bukhari narrated from him in suspension, and Muslim, and the four in their Sunan. One of the trustworthy narrators. Died in the year 240 AH. See: Al-Tarikh Al-Kabir (4 / 1 / 6), Al-Saghir (2 / 384), Al-Jarh wa Al-Ta'dil (6 / 216), Tarikh Baghdad (12 / 137), Tadhkirat Al-Huffaz (2 / 524), Al-Tahdhib (5 / 121), Shadharat Al-Dhahab (2 / 112).\n3. Imam of Imams, the Trustworthy Hafiz, the Jurist and Proof, Al-Shaybani Al-Marwazi, Ahmad bin Muhammad bin Hanbal, head of the tenth class. His Hadith is in the six books. Died in the year 241 AH. See: Tarikh Baghdad (4 / 412), Al-Tadhkirah (2 / 431), Tabaqat Ibn Sa'd (7 / 92), Al-Hilyah (9 / 161), Al-Ibar (1 / 435), Wafayat Al-A'yan (1 / 17), Al-Tahdhib (1 / 72), Shadharat Al-Dhahab (2 / 96).\n4. He is the Imam Zayd bin Al-Mubarak Al-San'ani, lived in Ramla. Truthful, a worshiper, from the tenth class. Abu Dawud narrated from him. See: Al-Jarh wa Al-Ta'dil (3 / 573), Al-Tahdhib (4 / 425), Al-Taqrib (1 / 277).\n5. Abu Al-Fadl Al-Marwazi, the Trustworthy, from the tenth class. Al-Bukhari narrated from him. See: Al-Tarikh Al-Kabir (2 / 2 / 298), Al-Jarh wa Al-Ta'dil (4 / 434), Al-Tahdhib (4 / 417), and Al-Taqrib (1 / 366).\n6. Ibn Hajar cited it (3 / 425) in Al-Tahdhib, with the same text, saying: Abu Dawud said: Then he mentioned it similarly. (*)",
    "book_id": "1060",
    "new_page_number": 54
  },
  {
    "serial_number": "3331516",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "16 - And I heard Abu Al-Hasan say: Mutahhar bin Sulayman (1) —meaning the Jurist—is a liar. I said: Why? He said: I heard him one day say: I heard from Al-Firyabi (2), my father took me to him in the year 304. Abu Al-Hasan said: So I said to him: But this is four years after he died. Abu Al-Hasan said: I told Da'laj bin Ahmad (3) about this, and he said: To Allah we belong; had he died before this it would have been better for him. Abu Al-Hasan said: Al-Firyabi ceased narrating Hadith in the month of Shawwal of the year 300, and he died in Muharram of the year 301 (4).",
    "foot_note": "1. (1) He is Al-Mutahhar bin Sulayman bin Muhammad, Abu Bakr Al-Mu'addil. His origin is from Anbar, and he was knowledgeable in inheritance laws, and followed the school of the people of Iraq in jurisprudence. Died on the 13th of Rabi' al-Thani, year 363 AH. See: Tarikh Baghdad (13 / 220), Al-Mizan (4 / 129), Al-Lisan (6 / 50).\n2. Imam, Hafiz, he is Ja'far Muhammad bin Al-Hasan, Sheikh of his time, authored useful works, Judge of Dinawar, trustworthy proof, a vessel of knowledge, met the eminent scholars. Died in the year 301 AH. See: Tarikh Baghdad (7 / 199), Tadhkirat Al-Huffaz (2 / 692), Al-Ibar (2 / 119), Al-Bidaya wa Al-Nihaya (11 / 121), Al-Dibaj Al-Mudhahhab (1 / 321), Shadharat Al-Dhahab (2 / 235).\n3. The Muhaddith, Proof, Jurist Imam, Da'laj bin Ahmad bin Da'laj, Sheikh of the people of Hadith in his era, and he was one of the trustworthy ones. Al-Daraqutni compiled (Al-Musnad) for him. Died in the year 353 AH. See: Tarikh Baghdad (8 / 387), Wafayat Al-A'yan (2 / 271), Tadhkirat Al-Huffaz (3 / 881), Al-Ibar (2 / 291), Tabaqat Al-Shafi'iyah by Al-Subki (3 / 291), Al-Bidaya wa Al-Nihaya (11 / 241), Shadharat Al-Dhahab (3 / 8).\n4. Al-Baghdadi reported it in his History (13 / 220) saying: Al-Barqani informed us. Then he mentioned the report textually. Al-Dhahabi quoted his saying (Al-Firyabi ceased narrating Hadith in Shawwal, year 300) in Siyar A'lam Al-Nubala (14 / 99). (*)",
    "book_id": "1060",
    "new_page_number": 55
  },
  {
    "serial_number": "3331517",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 56,
    "volume_number": 1,
    "text": "17 - And I heard him say: Yahya Al-Qattan (1) is older than Abd al-Rahman (2) by about twenty years, and they both died in one year (3), the year 198, and in it Ibn Uyainah (4) died. 18 - Abu Al-Hasan said to me: I heard Abu Talib (5) say: The brother of Maymun, named Ahmad bin Muhammad bin Zakariya Abu Bakr Al-Baghdadi (6), who resided in Egypt, said to me: (We agreed that the Hadith of three people in Egypt should not be written: Ali bin Al-Hasan",
    "foot_note": "1. (1) Previously translated.\n2. He is the Critic Imam, the Proficient, Master of Hafizs, Abd al-Rahman bin Mahdi, Al-Anbari, the Trustworthy. His Hadith is in the six books. Died in the year 198 AH. See: Tabaqat Ibn Sa'd (7 / 297), Al-Tarikh Al-Kabir (5 / 254), Al-Saghir (2 / 283), Al-Jarh wa Al-Ta'dil (1 / 251), Al-Hilyah (9 / 3), Tarikh Baghdad (10 / 240), Al-Ibar (1 / 326), Tadhkirat Al-Huffaz (1 / 329), Al-Tahdhib (6 / 279), Shadharat Al-Dhahab (1 / 355).\n3. Hafiz Al-Dhahabi said: Yahya bin Sa'id died in Safar, year 198, before the death of Ibn Mahdi and Ibn Uyainah by four months, may Allah Exalted have mercy on them. See: Siyar A'lam Al-Nubala (9 / 187).\n4. He is the Majestic Imam, the Trustworthy Hafiz, Sufyan bin Uyainah bin Abi Imran, a Jurist and Proof. His Hadith is in the six books. Died in the year 198 AH. See: Tarikh Baghdad (9 / 174), Al-Tadhkirah (1 / 262), Al-Hilyah (7 / 270), Tabaqat Ibn Sa'd (5 / 364), Al-Mizan (2 / 170).\n5. Previously translated.\n6. Ibn Abi Attab the Hafiz, lived in Egypt, and narrated there from Nasr bin Ali Al-Jahdami, and from him: Al-Tabarani, Abu Talib, and others. His death was in Egypt in Shawwal year 296 AH. See: Tarikh Baghdad (5 / 8). (*)",
    "book_id": "1060",
    "new_page_number": 56
  },
  {
    "serial_number": "3331518",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 57,
    "volume_number": 1,
    "text": "Al-Sami (1), Rawh bin Salah (2), and Abd al-Mun'im bin Bashir (3)) (4). Then Abu Al-Hasan said to me: And Rawh bin Salah is also called: Rawh bin Sayabah, an Egyptian, and likewise Abd al-Mun'im is Egyptian, and Ali bin Al-Hasan Al-Sami is Egyptian. 19 - I said to Abu Al-Hasan: Is Nabil (5), the narrator of 'The Cloak' trustworthy? He signaled with his mouth, meaning No, then said:",
    "foot_note": "1. (1) From the people of Egypt, narrates from Malik and Sulayman bin Bilal. Ibn Hibban said: It is not lawful to write his Hadith except for amazement. It was reported from Al-Daraqutni that he lies. Al-Hakim and Abu Sa'id Al-Naqqash said: He narrated fabricated Hadiths. Abu Nu'aym said: He narrated denounced (Munkar) Hadiths, he is nothing. Al-Dhahabi placed him among the abandoned. See: Al-Majruhin (2 / 411), Al-Mizan (3 / 119), Al-Lisan (4 / 212).\n2. He is Rawh bin Salah Al-Masri, kunya Abu Al-Harith. Ibn Adi, Al-Daraqutni, and Ibn Makula weakened him. Ibn Hibban mentioned him in Al-Thiqat. Al-Hakim said: Trustworthy, trustworthy (Ma'mun). Died in the year 233 AH. See: Al-Mizan (2 / 58), Al-Lisan (2 / 465).\n3. He is Abd al-Mun'im bin Bashir, Abu Al-Khayr Al-Masri. He narrates from Abdullah bin Umar Al-Umari, and Ya'qub Al-Fasawi narrates from him. Ibn Ma'in criticized and accused him. Ibn Hibban said: Very denounced in Hadith, it is not permissible to use him as proof. His weakening was reported from Al-Daraqutni. Ibn Adi said: Most of what Abd al-Mun'im narrates are denounced reports (Manakir) not corroborated. Ibn Yunus said: Denounced in Hadith. Al-Hakim said: He narrates fabrications. Al-Khalili said: He is a fabricator against the Imams, and Ahmad bin Hanbal called him a liar. See: Al-Majruhin (2 / 158), Al-Mizan (2 / 669), Al-Lisan (4 / 74 - 75).\n4. Ibn Hajar mentioned it in Al-Lisan (4 / 312).\n5. Hijazi, narrated from Abu Hurairah and Ibn Umar, and from him narrated Bukayr bin Abdullah bin Al-Ashajj and Salih bin Ubayd. Al-Bukhari and Ibn Abi Hatim remained silent about him. Al-Nasa'i said: Not famous, and in another place: Trustworthy. Ibn Hibban mentioned him in Al-Thiqat. Ibn Hajar said: Acceptable (Maqbul), meaning check if he has corroboration or witnesses, otherwise he is lenient in Hadith. See: Al-Tarikh Al-Kabir (4 / 2 / 131), Al-Jarh wa Al-Ta'dil (8 / 507), Al-Tahdhib (10 / 397), Al-Taqrib (2 / 294). (*)",
    "book_id": "1060",
    "new_page_number": 57
  },
  {
    "serial_number": "3331519",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 58,
    "volume_number": 1,
    "text": "(And what is it? It is only this Hadith, meaning from Ibn Umar from Suhayb: I passed by the Messenger of Allah, peace be upon him, while he was praying) (1). I said: Does he have anything other than this? He said: And another story (2). 20 - I heard Abu Al-Hasan say: Al-Bukhari (3) narrated from Abu Ma'mar Al-Qati'i (4), and narrated from a man from him, and the man is Sa'iqah (5),",
    "foot_note": "1. (1) Narrated by Ahmad (4 / 332), Abu Dawud (913), Al-Tirmidhi (365), and Al-Nasa'i (3 / 5). Al-Tirmidhi declared it Hasan. Its wording is (I passed by the Messenger of Allah, peace be upon him, while he was praying, so I greeted him, and he replied to me with a gesture).\n2. Ibn Hajar mentioned it (10 / 398) in Al-Tahdhib, summarized to its beginning.\n3. Imam of Huffaz, Sheikh of Islam, Abu Abdallah, Muhammad bin Isma'il Al-Bukhari, author of the most authentic book after the Book of Allah Exalted, jurist of this Ummah, and a mountain of memorization. Died in the year 256 AH. See: Al-Jarh wa Al-Ta'dil (7 / 191), Tarikh Baghdad (3 / 4), Tadhkirat Al-Huffaz (2 / 555), Al-Tahdhib (9 / 47), Muqaddimah Fath Al-Bari, Shadharat Al-Dhahab (2 / 134) and others.\n4. He is the Trustworthy Hafiz, the Trustworthy Proof, Isma'il bin Ibrahim, from the tenth class. Al-Bukhari, Muslim, Abu Dawud, and Al-Nasa'i narrated from him. Died in the year 236 AH. See: Tabaqat Ibn Sa'd (7 / 359), Al-Tarikh Al-Kabir (1 / 342), Al-Saghir (2 / 366), Al-Jarh wa Al-Ta'dil (2 / 157), Tarikh Baghdad (6 / 266), Tadhkirat Al-Huffaz (2 / 471), Al-Ibar (1 / 423), Al-Mizan (1 / 210), Al-Tahdhib (1 / 273), Shadharat Al-Dhahab (2 / 86), Al-Taqrib (1 / 65).\n5. He is the Hafiz Imam, the Proficient, the Trustworthy, Muhammad bin Abd al-Rahim Al-Baghdadi. Al-Bukhari, Abu Dawud, Al-Tirmidhi, and Al-Nasa'i narrated from him. From the eleventh class, died in the year 255 AH. See: Al-Jarh wa Al-Ta'dil (8 / 9), Tarikh Baghdad (2 / 363), Tadhkirat Al-Huffaz (2 / 553), Al-Ibar (2 / 10), Al-Wafi bi Al-Wafayat (3 / 245), Al-Tahdhib (9 / 311), Shadharat Al-Dhahab (2 / 130). [Benefit] He was named Sa'iqah (Thunderbolt) because of his excellent memory. (*)",
    "book_id": "1060",
    "new_page_number": 58
  },
  {
    "serial_number": "3331520",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 59,
    "volume_number": 1,
    "text": "and the name of this Abu Ma'mar is: Isma'il bin Ibrahim Al-Hudhali, originally from Herat, then he resided in Baghdad. 21 - And I heard him say: Ayyub bin Abi Tamima Al-Sakhtiyani (1), Abu Bakr, is a client of Anazah (2), and Abu Tamima's name is Kaysan (3), a Basran, a master among their masters, meaning Ayyub. 22 - Ayyub bin Musa bin Amr bin Sa'id bin Al-As (4) is from the people of Mecca, and Amr bin Sa'id (5) is known as Al-Ashdaq for his eloquence; Abd al-Malik ibn Marwan (6) killed him. And this Ayyub is the cousin of Isma'il bin Umayyah bin Amr bin",
    "foot_note": "1. (1) An Imam, Hafiz, Proof, Trustworthy, Established, from the senior scholars and jurists. His Hadith is in the six books. Died in the year 131 AH. See: Tabaqat Ibn Sa'd (7 / 246), Hilyat Al-Awliya (3 / 2), Tadhkirat Al-Huffaz (1 / 130), Al-Tahdhib (1 / 397), Al-Taqrib (1 / 89), Shadharat Al-Dhahab (1 / 1812).\n2. And it was said: Client of Juhaynah.\n3. It was narrated that Ali, may Allah be pleased with him, was brought people who had apostatized... His son Ayyub narrated from him. See: Al-Jarh wa Al-Ta'dil (7 / 165) where no criticism or praise was mentioned regarding him.\n4. Abu Musa Al-Makki, Al-Umawi, trustworthy, from the sixth class. His Hadith is in the six books. Died in the year 132 AH. See: Al-Tarikh Al-Kabir (1 / 1 / 422), Al-Jarh wa Al-Ta'dil (2 / 257), Al-Tahdhib (1 / 112), Al-Taqrib (1 / 91).\n5. A Tabi'i, held the governorship of Medina for Mu'awiyah and his son. It is a mistake to claim he had companionship (Suhba), rather his father had vision (of the Prophet). He invaded with Ibn Al-Zubayr, then Abd al-Malik killed him. He heard from his father, Umar, Uthman, Aisha, and others. See: Al-Tarikh Al-Kabir (3 / 2 / 338), Al-Jarh wa Al-Ta'dil (6 / 234), Al-Tahdhib (8 / 37), Al-Taqrib (2 / 70).\n6. The Jurist Caliph, Abu Al-Walid Al-Umawi. He was among the devout worshipers before the Caliphate, and witnessed the killing of Uthman when he was ten. Died in Shawwal, year 86 AH. See: Tabaqat Ibn Sa'd (5 / 223), Tarikh Baghdad (10 / 388), Al-Bidaya wa Al-Nihaya (8 / 260), (9 / 61), Al-Tahdhib (6 / 422) and Al-Taqrib (2 / 522), Shadharat Al-Dhahab (1 / 97). (*)",
    "book_id": "1060",
    "new_page_number": 59
  },
  {
    "serial_number": "3331521",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 60,
    "volume_number": 1,
    "text": "Sa'id (1), both are from Mecca, two trustworthy narrators who narrated from Nafi (2). And Sa'id bin Al-As (3), his father was killed on the day of Badr as a disbeliever (4). 23 - Abu Al-Hasan said to me: Al-Rabi' bin Yahya Al-Ushnani (5) narrated from Al-Thawri (6), from Muhammad bin Al-Munkadir (7) from Jabir: (The Prophet, peace be upon him, combined the two prayers) (8).",
    "foot_note": "1. (1) Al-Umawi, trustworthy, established, from the sixth class. His Hadith is in the six books. There is disagreement about the year of his death. See: Al-Tarikh Al-Kabir (1 / 1 / 345), Al-Jarh wa Al-Ta'dil (1 / 159), Al-Tahdhib (2 / 283), Al-Taqrib (1 / 67).\n2. Previously translated.\n3. Al-Umawi, was nine years old at the death of the Prophet, peace be upon him, and is mentioned among the Companions. He held the governorship of Kufa for Uthman, and Medina for Mu'awiyah. Muslim and Al-Nasa'i narrated from him, and Al-Bukhari in Al-Adab Al-Mufrad. See: Al-Tarikh Al-Kabir (2 / 1 / 502), Al-Jarh wa Al-Ta'dil (3 / 48), Usd Al-Ghabah (2 / 293), Al-Isabah (3261), Al-Tahdhib (4 / 48), Al-Taqrib (1 / 299).\n4. Ibn Hajar mentioned it (1 / 113) in Al-Tahdhib briefly on his saying (And this Ayyub is the cousin of Isma'il bin Umayyah bin Amr).\n5. He is Al-Rabi' bin Yahya bin Miqsam, Abu Al-Fadl Al-Basri, truthful (Saduq), has errors, from the elders of the tenth class. Al-Bukhari and Abu Dawud narrated from him. Died in the year 224 AH. See: Al-Tarikh Al-Kabir (2 / 1 / 279), Al-Jarh wa Al-Ta'dil (3 / 471), Al-Mizan (2 / 43), Al-Tahdhib (3 / 252), Al-Taqrib (1 / 246).\n6. Sheikh of Islam, Imam of Huffaz, the Trustworthy, Jurist, Worshiper, Proof, Sufyan bin Sa'id Ibn Masruq Al-Thawri. His Hadith is in the six books. Died in the year 161 AH. See: Tabaqat Ibn Sa'd (6 / 371), Al-Tarikh Al-Kabir (4 / 91), Al-Jarh wa Al-Ta'dil (1 / 55), Al-Hilyah (6 / 356), Tarikh Baghdad (9 / 151), Al-Tadhkirah (1 / 203), Al-Tahdhib (4 / 111), Shadharat Al-Dhahab (1 / 250).\n7. The Great Hafiz, Sheikh of Islam, Imam Muhammad bin Al-Munkadir bin Abdullah Al-Taymi. His Hadith is in the six books. Died in the year 130 AH. See Al-Tarikh Al-Kabir (1 / 219), Al-Jarh wa Al-Ta'dil (8 / 97), Al-Hilyah (3 / 146), Al-Tadhkirah (1 / 127), Al-Tahdhib (9 / 473).\n8. Narrated by Muslim (705), and Abu Dawud (1210) from the Hadith of Abu Al-Zubayr from Sa'id = (*)",
    "book_id": "1060",
    "new_page_number": 60
  },
  {
    "serial_number": "3331522",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 61,
    "volume_number": 1,
    "text": "And this is a Hadith in which Muhammad bin Al-Munkadir has neither a female camel nor a male camel [i.e., nothing to do with it] (1). 24 - And I asked him about the Hadith of Mujahid (2) from Abu Qatada (3), and from Abu Al-Khalil (4), the Hadith of Al-Thawri (5) regarding the virtue of fasting Arafah (6)?",
    "foot_note": "1. = Ibn Jubayr from Ibn Abbas. Abu Hatim said (1 / 105) in Al-Ilal: It is narrated from Ibn Abi Layla from Jabir from the Prophet, peace be upon him, regarding combining prayers, but it is actually Abu Al-Zubayr from Sa'id from Ibn Abbas.\n1. Ibn Hajar mentioned it (3 / 253) in Al-Tahdhib, quoting Al-Daraqutni, may Allah have mercy on him. And he added: (And this invalidates one hundred thousand Hadiths), and Al-Dhahabi also mentioned it in Al-Mizan (2 / 43).\n2. The Imam, Hafiz, Sheikh of Reciters and Exegetes, Abu Al-Hajjaj Al-Makki. His Hadith is in the six books. Trustworthy, an Imam in knowledge. There is disagreement about the year of his death. See: Tabaqat Ibn Sa'd (5 / 466), Al-Hilyah (3 / 279), Al-Tadhkirah (1 / 86), Al-Bidaya wa Al-Nihaya (9 / 224), Al-Tahdhib (10 / 42), Shadharat Al-Dhahab (1 / 125).\n3. He is Abu Qatada Al-Ansari, his name is Al-Harith bin Rab'i. He witnessed the battles, and is counted among the great Companions. His Hadith is in the six books. Died in the year 54 AH. See: Tabaqat Ibn Sa'd (6 / 15), Al-Tarikh Al-Kabir (2 / 258), Al-Jarh wa Al-Ta'dil (3 / 74), Usd Al-Ghabah (6 / 250), Al-Ibar (1 / 60), Al-Tahdhib (12 / 204), Al-Isabah (11 / 302).\n4. He is Salih bin Abi Maryam, Al-Duba'i, Abu Al-Khalil Al-Basri. Ibn Ma'in and Al-Nasa'i authenticated him. Ibn Abd Al-Barr oddly said: He is not used as proof. From the sixth class, his Hadith is in the six books. See: Al-Tarikh Al-Kabir (2 / 2 / 289), Al-Kuna by Al-Dulabi (1 / 165), Al-Jarh wa Al-Ta'dil (4 / 415), Al-Tahdhib (4 / 402), Al-Taqrib (1 / 362).\n5. Previously translated.\n6. Authentic. Wording: (Fasting the Day of Arafah expiates the previous year and the remaining one). * Narrated by Muslim (1162) and Abu Dawud (2425), but the first is from the path of Shu'bah from Ibn Jarir from Abdullah bin Ma'bad, and the second from the path of Hammad bin Zayd from Ibn Jarir likewise. Al-Tirmidhi also narrated it (746) and said: In the chapter there is a report from Abu Sa'id. * Al-Bayhaqi narrated it (4 / 283) in his Sunan from the path of Mujahid from Harmalah bin Iyas Al-Shaybani from Abu Qatada, and from the path of Abu Khalil from Harmalah, then he said: And Al-Thawri narrated it from Mansur from Abu Al-Khalil from Harmalah from a client of Abu Qatada from Abu Qatada. Thus, we find in the naming of = (*)",
    "book_id": "1060",
    "new_page_number": 61
  },
  {
    "serial_number": "3331523",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 62,
    "volume_number": 1,
    "text": "He said: It is not authentic, and it is very inconsistent (Mudtarib); once he says this, and once he says that; it is not established. 25 - And I asked him about the Hadith of Ata Al-Khurasani (1) from Yahya bin Ya'mar (2) from Ammar, the Hadith of applying Saffron (Khaluq) (3)? He said: It is not authentic, because he did not meet Yahya bin Ya'mar... except that Yahya bin Ya'mar is authentic in Hadith from whomever he met (4).",
    "foot_note": "1. = its narrator from Abu Qatada a difference clarified by the following: * Al-Hafiz said in Al-Tahdhib (2 / 228) in the biography of Harmalah bin Iyas: He narrated from Abu Qatada, and it was said from a client of Abu Qatada, regarding fasting Ashura and the Day of Arafah. Salih Abu Khalil and Mujahid narrated from him. Abu Bakr bin Ziyad Al-Naysaburi said: The correct view is they claimed Harmalah bin Iyas.\n1. He is Ata bin Abi Muslim, truthful (Saduq), errs often, practices Irsal and Tadlis. From the fifth class. Muslim and the four in their Sunan narrated from him. Died in the year 135 AH. See: Al-Mizan (3 / 74) and Al-Tahdhib (7 / 212 - 213), Al-Taqrib (2 / 23).\n2. Al-Basri, resident of Merv and its judge. Trustworthy, used to narrate Mursal reports. From the third class. His Hadith is in the six books. Died before year 100 AH, and it was said after. See: Al-Tarikh Al-Kabir (4 / 2 / 311), Al-Jarh wa Al-Ta'dil (9 / 196), Al-Tahdhib (11 / 305), Al-Taqrib (2 / 361).\n3. Weak. Its wording (Ammar said: I came to my family and my hands were cracked, so they anointed me with saffron. I went to the Prophet, peace be upon him, and greeted him, but he did not reply to me, and said: (Go and wash this off you). * Narrated by Ahmad (4 / 320) and Abd al-Razzaq (6145), from the path of Yahya from a man from Ammar, and therein is the obscurity of that man who was not named. However, Abu Dawud narrated it (4176), (4601) from the path of Al-Khurasani from Yahya from Ammar, and it is Mursal, and contains the weakness of Al-Khurasani due to his 'an'ana (saying 'from').\n4. Ibn Hajar mentioned it (11 / 305) in Al-Tahdhib briefly to its end. (*)",
    "book_id": "1060",
    "new_page_number": 62
  },
  {
    "serial_number": "3331524",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 63,
    "volume_number": 1,
    "text": "26 - And I asked him about the Hadith of Yunus (1) from Al-Zuhri (2) from Sahl bin Sa'd (Water is from Water) (3).",
    "foot_note": "1. (1) He is Yunus bin Yazid Al-Ayli, trustworthy, except that in his narration from Al-Zuhri there is a little error (wahm). His Hadith is in the six books. Died in the year 159 AH. See: Al-Tarikh Al-Kabir (4 / 2 / 406), Al-Tahdhib (11 / 450), Al-Taqrib (2 / 386).\n2. He is Muhammad bin Muslim bin Ubaydullah, Abu Bakr the Jurist, agreed upon for his majesty and trustworthiness. Died in the year 124 AH. See: Tadhkirat Al-Huffaz (1 / 108), Al-Hilyah (3 / 306), Wafayat Al-A'yan (1 / 451), Al-Ibar (1 / 158), Al-Tahdhib (9 / 445), Al-Taqrib (2 / 207), Shadharat Al-Dhahab (1 / 162).\n3. Authentic. Narrated by Ahmad (5 / 115, 116), Abu Dawud (214), and Al-Tirmidhi (110) from the Hadith of Al-Zuhri from Sahl bin Sa'd from Ubayy bin Ka'b. Al-Tirmidhi said: Hasan Sahih. Narrated by Abu Dawud (215), Al-Darimi (1 / 194) in his Sunan, Al-Daraqutni (1 / 46), and Al-Bayhaqi (1 / 166) from paths from Muhammad Abu Ghassan from Abu Hazim from Sahl bin Sa'd. Al-Bayhaqi said: We narrated it with a connected authentic chain, then he mentioned it. * Narrated by Al-Darimi (1 / 194) from the Hadith of Abu Ayyub Al-Ansari as raised (Marfu'). * Narrated by Ibn Khuzaymah (225), (226), from the Hadith of Sahl bin Sa'd, and likewise Ibn Hibban (1170) who said: Ma'mar narrated this report from Al-Zuhri from the Hadith of Gundar saying: Sahl bin Sa'd informed me. And Amr bin Al-Harith narrated it from Al-Zuhri, saying: One whom I accept narrated to me from Sahl bin Sa'd. It is likely that Al-Zuhri heard the report from Sahl bin Sa'd as Gundar said, and heard it from someone he accepts from him, so he narrated it once from Sahl bin Sa'd, and another time from the one he accepted... I have tracked the paths of this report to find anyone who narrated it from Sahl bin Sa'd, and I found no one in the world except Abu Hazim. It is likely that the man whom Al-Zuhri said 'One whom I accept told me' from Sahl bin Sa'd, is Abu Hazim narrating from him. End quote. See Sahih Ibn Hibban (2 / 244). Ibn Khuzaymah said: This man whom Amr bin Al-Harith did not name is likely Abu Hazim Salama bin Dinar, because Maysarah bin Isma'il narrated this report from Abu Ghassan Muhammad bin Mutarrif from Abu Hazim from Sahl bin Sa'd from Muslim bin Al-Hajjaj who said: Abu Ja'far Al-Jammal told us. End quote. See: Sahih Ibn Khuzaymah (1 / 114). (*)",
    "book_id": "1060",
    "new_page_number": 63
  },
  {
    "serial_number": "3331525",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 64,
    "volume_number": 1,
    "text": "He said: It is not authentic, because Al-Zuhri did not hear it from Sahl bin Sa'd. I said to him: He did hear from him, so what do you object to him having heard this from him? He said: The proof against it is that Amr bin Al-Harith (1) narrated it from Al-Zuhri, and said in it: One whom I accept told me from Sahl bin Sa'd (2). 27 - And I asked him about the Hadith of Ibn Jurayj (3) from Safwan bin Sulaym (4) from Abu Sa'id, client of Banu Amir (5), from Abu Hurairah (6)?",
    "foot_note": "1. = [Fiqh of the Hadith]: 'Water is from water', this was in the beginning of Islam meaning that if a man has intercourse with his wife and does not ejaculate, no Ghusl (bath) is required. Then this ruling was abrogated by 'If the two circumcised parts meet', then Ghusl becomes obligatory whether he ejaculated or not.\n1. He is Amr bin Al-Harith bin Ya'qub, Al-Masri, Abu Ayyub, trustworthy, jurist, from the seventh class. His Hadith is in the six books. Died before the year 150 AH. See: Al-Tarikh Al-Kabir (3 / 2 / 320), Al-Jarh wa Al-Ta'dil (6 / 225), Al-Tahdhib (8 / 14), Al-Taqrib (2 / 67).\n2. See what we mentioned earlier from Ibn Hibban and Ibn Khuzaymah regarding the investigation of this statement.\n3. He is Abd al-Malik bin Abd al-Aziz, Al-Umawi, trustworthy, jurist, virtuous, but he used to practice Tadlis and Irsal. From the sixth class. His Hadith is in the six books. Died most likely in the year 150 AH. See: Tarikh Baghdad (10 / 400), Al-Tadhkirah (1 / 169), Wafayat Al-A'yan (1 / 286), Al-Ibar (1 / 213), Mizan Al-I'tidal (2 / 659), Al-Lisan (6 / 623), Al-Tahdhib (6 / 402), Shadharat Al-Dhahab (1 / 226).\n4. He is Safwan bin Sulaym Al-Madani, Abu Abdallah, trustworthy, a Mufti, worshiper, from the fourth class. His Hadith is in the six books. Died in the year 132 AH. See: Al-Tarikh Al-Kabir (2 / 2 / 307), Al-Jarh wa Al-Ta'dil (4 / 423), Al-Tahdhib (4 / 425), Al-Taqrib (1 / 368).\n5. Al-Khuza'i, acceptable (Maqbul), from the fourth class. Muslim, Al-Nasa'i, and Ibn Majah narrated from him. See: Al-Tahdhib (12 / 111), Al-Taqrib (2 / 428).\n6. Ibn Hibban said Ibrahim narrated from Safwan bin Sulaym from Sa'id bin Bashar from Abu Hurairah from the Prophet, peace be upon him: (A man follows the religion of his friend, so let one of you consider whom he befriends). I say: The Hadith with this chain is very weak due to what will be mentioned in the biography of Ibrahim bin Abi Yahya. As for the Hadith, it is Hasan. Abu Dawud (4833), Al-Tirmidhi (2379), and Ahmad (2 / 303,",
    "book_id": "1060",
    "new_page_number": 64
  },
  {
    "serial_number": "3331526",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 65,
    "volume_number": 1,
    "text": "He said: He did not hear it from Safwan. He mentioned that he only heard it from Ibrahim bin Abi Yahya (1). As for Abu Sa'id the client of Banu Amir, I do not know him precisely at the moment. 28 - I asked him about the Hadith of Zuhayr (2) from Humayd (3) from Abu Raja (4) from his uncle Abu Idris (5) from Bilal regarding Wiping (Al-Mash)? (6).",
    "foot_note": "1. = 434, and Al-Hakim (4 / 171) narrated it from paths from Zuhayr bin Muhammad Al-Khurasani from Musa bin Wardan from Abu Hurairah. This is a Hasan chain. * Ibn Abi Al-Dunya (37) narrated it in Al-Ikhwan. * Al-Hakim (4 / 171) narrated it from the path of Sadaqah bin Abdullah from Ibrahim bin Muhammad Al-Ansari from Sa'id bin Yasar from Abu Hurairah. Its chain is weak. \n1. Abu Ishaq Al-Madani, abandoned in Hadith (Matruk). Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (1 / 1 / 323), Al-Saghir (2 / 257), Al-Du'afa Al-Saghir (13), Al-Du'afa by Al-Nasa'i (5), and by Al-Uqayli (59), Al-Majruhin (1 / 105), Al-Mizan (1 / 58), Al-Tahdhib (1 / 158), Al-Taqrib (1 / 42).\n2. He is Zuhayr bin Mu'awiyah bin Khudayj, Abu Khaythamah Al-Ju'fi, trustworthy, established, except that his hearing from Abu Ishaq was at the end. From the seventh class. His Hadith is in the six books. See: Tabaqat Ibn Sa'd (6 / 376), Al-Tarikh Al-Kabir (2 / 1 / 427), Al-Jarh wa Al-Ta'dil (3 / 588), Tadhkirat Al-Huffaz (1 / 233), Al-Mizan (2 / 286), Al-Ibar (1 / 263), Al-Tahdhib (3 / 351).\n3. He is Humayd bin Abi Humayd Al-Tawil, Abu Ubaydah Al-Basri, trustworthy but practices Tadlis. His Hadith is in the six books. From the fifth class. He died while standing in prayer. See: Tabaqat Ibn Sa'd (7 / 17), Al-Tarikh Al-Kabir (1 / 2 / 348), Al-Tarikh Al-Saghir (1 / 230), Al-Jarh wa Al-Ta'dil (3 / 221), Tadhkirat Al-Huffaz (1 / 152), Al-Mizan (1 / 610), Shadharat Al-Dhahab (1 / 211).\n4. I could not identify him.\n5. He is A'idhullah bin Abdullah Al-Khawlani. He was among the great scholars of the Levant. His Hadith is in the six books and he is one of the trustworthy narrators. Died in the year 80 AH. See: Tabaqat Ibn Sa'd (7 / 448), Al-Tarikh Al-Kabir (8 / 87). Al-Hilyah (5 / 122), Usd Al-Ghabah (5 / 134), Tadhkirat Al-Huffaz (1 / 53), Al-Ibar (1 / 91), Al-Bidaya wa Al-Nihaya (9 / 34), Al-Isabah (6157), Al-Tahdhib (5 / 85), Shadharat Al-Dhahab (1 / 88).\n6. Narrated by Al-Tabarani (1115) in Al-Kabir, and its wording: From his uncle Abu Idris that he was = (*)",
    "book_id": "1060",
    "new_page_number": 65
  },
  {
    "serial_number": "3331527",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 66,
    "volume_number": 1,
    "text": "He said: Zuhayr is unique in it with the addition of 'Abu Raja'. So I said: Do you extract this Hadith in the Sahih? He said: Yes. And I asked him about the name of Abu Raja, he said: I do not know it. 29 - And I asked him about: Al-Tayyib bin Sulayman (1) from Amrah (2)? He said: A weak Basran Sheikh (3). 31 - I said to him: Isa bin Sadaqah (4) from Abd al-Hamid bin Umayyah (5) from",
    "foot_note": "1. = sitting in Damascus on a cold day performing ablution, and Bilal the caller of the Messenger of Allah, peace be upon him, passed by him. He said: O Bilal, how did the Messenger of Allah, peace be upon him, perform ablution? He said: (He wiped over the socks and the turban). Ahmad narrated it (6 / 15) from the path of Hammad bin Salamah from Ayyub from Abu Qilabah from Abu Idris with similar meaning. See the investigation of this Hadith in the book (Musnad Bilal bin Rabah) by Imam Al-Hasan bin Al-Sabah, for it has very many paths through which it is authenticated.\n1. Narrated from: Mu'adhah Al-Adawiyyah, and narrated from him: Bishr bin Muhammad Abu Muhammad Al-Sukkari. Abu Hatim remained silent about him. Ibn Hibban included him in Al-Thiqat. Al-Tabarani said in Al-Awsat that he is a trustworthy Basran. See: Al-Jarh wa Al-Ta'dil (4 / 496), Al-Mizan (2 / 346), Al-Lisan (3 / 214) (2) She is Amrah bint Abd al-Rahman bin Sa'd, Al-Ansariyah, Al-Madaniyah, the Jurist. Her Hadith is in the six books. Trustworthy, from the third class. See: Tabaqat Ibn Sa'd (8 / 480), Al-Ibar (1 / 117), Al-Tahdhib (12 / 438), Siyar A'lam Al-Nubala (4 / 507), Shadharat Al-Dhahab (1 / 114).\n3. Al-Dhahabi mentioned him in Al-Mizan (2 / 346), and Ibn Hajar in Al-Lisan (3 / 214), and both attributed it to Al-Daraqutni.\n4. He is Isa bin Abbad bin Sadaqah, attributed to his grandfather, so it is said: Isa bin Sadaqah. Narrated from Humayd Al-Tawil and others. They weakened him. Abu Al-Walid narrated from him and weakened him, and Abu Hatim also weakened him. Abu Zur'ah said: A Sheikh. Ibn Hibban said: Denounced in Hadith (Munkar al-Hadith). It was reported that Al-Daraqutni said: Abandoned (Matruk). See: Al-Tarikh Al-Kabir (2 / 2 / 294), Al-Jarh wa Al-Ta'dil (4 / 428), Al-Du'afa by Al-Uqayli (1432), Al-Majruhin (2 / 119), Al-Mizan (3 / 314), Al-Lisan (4 / 398).\n5. Al-Dhahabi reported in Al-Mizan (2 / 538), and Ibn Hajar approved it in Al-Lisan (3 / 395) that Al-Daraqutni said about him: Nothing. (*)",
    "book_id": "1060",
    "new_page_number": 66
  },
  {
    "serial_number": "3331528",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 67,
    "volume_number": 1,
    "text": "Anas? He said: Isa and Abd al-Hamid are both nothing (worthless). 31 - And I asked him about Abu Al-Abbas bin Uqdah (1), so I said to him: What is the greatest thing in your heart against him? He paused, then said: (Excessive narration of denounced reports [Manakir]) (2). 32 - I said to him: Yahya bin Abi Kathir (3) narrated from Ibn Mu'aniq (4), or Abu Mu'aniq? He said: He is nothing, unknown. 33 - I said to him: Abd al-Rahman bin Hassan Al-Kinani (5) narrated from Muslim",
    "foot_note": "1. (1) The Hafiz, the Allamah, one of the luminaries of Hadith, a rarity of the time, and author of works despite weakness in him. He is Ahmad bin Muhammad bin Sa'id, known as Ibn Uqdah. Uqdah is a nickname for his father, the brilliant grammarian, nicknamed so for his complexity in morphology. He was among the acting scholars. Died in the year 332 AH. See: Tarikh Baghdad (5 / 4), Tadhkirat Al-Huffaz (3 / 839), Al-Ibar (2 / 230), Al-Mizan (1 / 136), Al-Wafi bi Al-Wafayat (7 / 395), Al-Bidaya wa Al-Nihaya (11 / 209), Al-Lisan (1 / 263), Siyar A'lam Al-Nubala (15 / 340), Al-Nujum Al-Zahirah (3 / 281), Shadharat Al-Dhahab (2 / 332).\n2. Al-Baghdadi reported it (5 / 22) in his History, and Al-Dhahabi mentioned it (15 / 354) in Siyar A'lam Al-Nubala, and Ibn Hajar in Lisan Al-Mizan (1 / 264).\n3. Al-Ta'i, Abu Nasr Al-Yamami, an Imam, Hafiz, trustworthy, established, but he practices Tadlis and Irsal. From the fifth class. His Hadith is in the six books. Died in the year 132 AH. See: Tabaqat Ibn Sa'd (5 / 555), Al-Tarikh Al-Kabir (4 / 2 / 301), Al-Mizan (4 / 402), Siyar A'lam Al-Nubala (6 / 27), Al-Tahdhib (11 / 268), Al-Taqrib (2 / 356).\n4. Al-Dhahabi reported in Al-Mizan (4 / 574) that Al-Daraqutni said about him: Nothing, and Ibn Hajar approved it in Al-Lisan (7 / 108).\n5. Abu Sa'id Al-Filastini, there is no harm in him, from the seventh class. Abu Dawud and Al-Nasa'i narrated from him, and his authentication was reported from Ibn Ma'in. = (*)",
    "book_id": "1060",
    "new_page_number": 67
  },
  {
    "serial_number": "3331529",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 68,
    "volume_number": 1,
    "text": "bin Al-Harith Al-Tamimi (1) from his father (2) from his father (2) from the Prophet, peace be upon him (3)? He said: Abd al-Rahman is a Homsi, there is no harm in him, and Muslim is unknown (4). 34 - I said to him: Al-Walid bin Abi Malik (5) from the Prophet, peace be upon him (6)? He said: A late Tabi'i from the people of Syria, there is no harm in him. 35 - I said to him: Did anyone narrate the Hadith of Hisham bin Urwah (7) from his father (8)",
    "foot_note": "1. = See: Ma'rifat Al-Thiqat by Al-Ajli (1034), and Al-Tahdhib (6 / 163), Al-Taqrib (1 / 476).\n1. And it is said: Al-Harith bin Muslim narrated the Hadith (If you pray Fajr and Maghrib, say seven times: O Allah protect me from the Fire, for if you die in your night after saying it, protection from Allah is written for you). Narrated by Abu Dawud (5058), (5059), and Al-Nasa'i (111) in 'Amal Al-Yawm wa Al-Laylah, and Al-Bukhari in Al-Tarikh Al-Kabir (4 / 1 / 253), and Ahmad (4 / 234), and Ibn Hibban (2346), and Al-Tabarani (19 / 433) in Al-Kabir, and Ibn Al-Sunni (138) in 'Amal Al-Yawm wa Al-Laylah. And Ibn Al-Athir (5 / 116) in Usd Al-Ghabah. The Hadith is weak. See the discussion on it in: Al-Isabah (6 / 93), Al-Tahdhib (10 / 126), and Al-Silsilah Al-Da'ifah by Sheikh Al-Albani number (1624).\n2. See previous sources.\n3. See previous.\n4. Ibn Hajar mentioned it in Al-Tahdhib (10 / 125) saying: Al-Barqani said. Then he mentioned it in full.\n5. He is Al-Walid bin Abd al-Rahman bin Abi Malik, Al-Hamdani, Abu Al-Abbas Al-Dimashqi. Authenticated by Ahmad, Al-Ajli, Ya'qub bin Sufyan, and Ibn Hibban. Ibn Kharash said: There is no harm in him. Ya'qub bin Shaybah said: There is weakness in his Hadith. As for Ibn Hajar, he authenticated him. Abu Dawud and Al-Nasa'i narrated from him. See: Al-Tahdhib (11 / 139), Al-Taqrib (2 / 333).\n6. A Hadith in this state is Mursal, because he is a Tabi'i as explained.\n7. He is the Trustworthy Jurist, Al-Asadi, Hisham bin Urwah bin Al-Zubayr, but he practiced Tadlis occasionally. From the fifth class. His Hadith is in the six books. See: Tarikh Baghdad (14 / 37), Tadhkirat Al-Huffaz (1 / 144), Tabaqat Ibn Sa'd (7 / 67), Wafayat Al-A'yan (2 / 194), Al-Ibar (1 / 206), Al-Tahdhib (11 / 48), Al-Taqrib (2 / 319), Shadharat Al-Dhahab (1 / 218).\n8. He is the Allamah Imam, the famous Trustworthy Jurist, Urwah bin Al-Zubayr, Abu Abdallah, Al-Madani, from = (*)",
    "book_id": "1060",
    "new_page_number": 68
  },
  {
    "serial_number": "3331530",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 69,
    "volume_number": 1,
    "text": "from Aisha from the Prophet, peace be upon him: (Draw near to the Qiblah [Arhiqu Al-Qiblah]) (1) other than Mus'ab bin Thabit (2)? He said: No. 36 - I said: Thabit is the son of whom? He said: He is Mus'ab bin Thabit bin Abdullah bin Al-Zubayr Al-Madani, not strong (3). 37 - I said: Did anyone narrate it from Mus'ab other than Bishr bin Al-Sari (4)? He said: Sa'id bin Salam (5) and he is weak, meaning Sa'id is weak.",
    "foot_note": "1. = the second class. His Hadith is in the six books. Died in the year 94 AH. See: Tadhkirat Al-Huffaz (1 / 62), Tabaqat Ibn Sa'd (5 / 132), Al-Ibar (1 / 110), Al-Tahdhib (7 / 180) Shadharat Al-Dhahab (1 / 103).\n1. Weak. Narrated by Al-Bazzar as in Al-Matalib Al-Aliyah (311), and Al-Bayhaqi in Shu'ab Al-Iman, and Ibn Asakir in his History, as in Kanz Al-Ummal (19205), all from the Hadith of Aisha, may Allah be pleased with her. It contains Mus'ab who is one of the weak narrators. His saying (Arhiqu): meaning come close to the Qiblah, from it is their saying: A Murahiq boy: meaning close to puberty.\n2. He is Mus'ab bin Thabit bin Abdullah bin Al-Zubayr, Al-Asadi, lenient in Hadith, and he was a worshiper. From the seventh class. Abu Dawud, Al-Nasa'i, and Ibn Majah narrated from him. Died in the year 157 AH. See: Al-Tarikh Al-Kabir (4 / 1 / 253), Al-Jarh wa Al-Ta'dil (8 / 304), Al-Mizan (4 / 118), Al-Tahdhib (10 / 158), Al-Taqrib (2 / 251).\n3. Ibn Hajar mentioned it (10 / 159) in Al-Tahdhib, and attributed it to Al-Daraqutni.\n4. He is Bishr bin Al-Sari Abu Umar, Basran, lived in Mecca, and was a preacher. Trustworthy, proficient. He was criticized for the opinion of Jahm, then he apologized and repented to Al-Humaydi for that. He is truthful (Saduq) in Hadith. From the ninth class. Al-Bukhari narrated from him in Al-Adab Al-Mufrad. Died in the year 195 or 196 AH. See: Al-Jarh wa Al-Ta'dil (2 / 358), Ma'rifat Al-Thiqat (155), Al-Tahdhib (1 / 451), Al-Taqrib (1 / 99).\n5. He is Sa'id bin Salam Al-Attar, from the generation of Abd al-Razzaq. Narrated from Thawr bin Yazid and others. Abu Muslim Al-Kajji narrated from him. Ibn Numayr and Ahmad called him a liar. Al-Bukhari said: He is mentioned = (*)",
    "book_id": "1060",
    "new_page_number": 69
  },
  {
    "serial_number": "3331531",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 70,
    "volume_number": 1,
    "text": "38 - I said to him: What about Bishr bin Al-Sari? He said: Trustworthy, Meccan; they found fault with him regarding the matter of doctrine, so he swore and apologized to Al-Humaydi about that, and he is truthful in Hadith. 39 - I said to him: This Hadith of Mus'ab bin Thabit (1) from his uncle Amir Ibn Abdullah bin Al-Zubayr (2) from his father (3) from Aisha from the Prophet, peace be upon him, regarding the two Rak'ahs after Asr (4), did anyone other than Mus'ab narrate it? He said: No. 40 - I said: Did anyone narrate it from him other than Bishr bin Al-Sari (5)? He said: Yes. 41 - I said to him: Al-Walid bin Muslim (6) from Ibn Jurayj (7) from Ata (8)",
    "foot_note": "1. = for fabricating Hadith. Abu Hatim said: Very denounced in Hadith. Al-Nasa'i and others said: Weak. Al-Dulabi, Al-Saji, Al-Uqayli, Ibn Al-Sakan, and Ibn Al-Jarud mentioned him in Al-Du'afa (The Weak). See: Al-Tarikh Al-Kabir (2 / 1 / 481), Al-Saghir (2 / 343), Al-Du'afa by Al-Nasa'i (269), and by Al-Uqayli (580), Al-Jarh wa Al-Ta'dil (2 / 31), Al-Majruhin (1 / 321), Al-Du'afa by Al-Daraqutni (269), Al-Mizan (2 / 141), Al-Lisan (3 / 31).\n1. Previously translated.\n2. He is Amir Al-Madani, Abu Al-Harith, trustworthy, a worshiper. His Hadith is in the six books. From the fourth class. Died in the year 121 or 122 AH. See: Al-Tarikh Al-Kabir (3 / 2 / 448), Al-Jarh wa Al-Ta'dil (6 / 325), Al-Tahdhib (5 / 74), Al-Taqrib (1 / 388).\n3. Previously translated.\n4. The Hadith of two Rak'ahs after Asr is established in Muslim (835), Ahmad (5 / 185), and with the authors of the Sunan, and it has a well-known story. As for the chain mentioned by the author, it is weak due to the presence of Mus'ab bin Thabit, previously mentioned.\n5. Previously translated.\n6. Previously translated.\n7. Previously translated.\n8. He is the Trustworthy, Jurist, Virtuous, Ata bin Abi Rabah, but he frequently narrates Mursal reports. His Hadith is in the six books. From the third class. Died in the year 114 AH. See: Al-Hilyah (3 / 310), = (*)",
    "book_id": "1060",
    "new_page_number": 70
  },
  {
    "serial_number": "3331532",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 71,
    "volume_number": 1,
    "text": "from Ibn Abbas that a man and his wife brought a dispute to the Prophet, peace be upon him, so he said: (Will you return his garden to him?) (1). I said: Did anyone connect it (give it a continuous chain) other than Al-Walid bin Muslim? He said: No, it is Mursal from Ata (2). 42 - I said to him: Shibl bin Al-A'la (3), whose son is he? He said: The son of Abd al-Rahman bin Ya'qub Al-Huraqi. He said: Not strong. As for Al-A'la (4), he is more beloved to them (5) than Suhayl bin",
    "foot_note": "1. = Tabaqat Ibn Sa'd (5 / 346), Al-Ibar (1 / 141), Al-Mizan (3 / 70), Wafayat Al-A'yan (1 / 318), Al-Tahdhib (7 / 991).\n1. Authentic. Al-Bukhari narrated it (7 / 60) from paths from Ikrimah from Ibn Abbas, and Ahmad (4 / 3) from the Hadith of Sahl bin Abi Hathma, and Al-Daraqutni from the Hadith of Abu Sa'id Al-Khudri (3 / 255) in his Sunan, and its chain contains an abandoned narrator.\n2. Al-Bayhaqi narrated it (7 / 314) in Al-Sunan Al-Kubra, and said: This is not preserved (Mahfuz), and the correct version with this chain is Mursal. Ibn Abi Hatim mentioned it in Al-Ilal (1 / 429) and Abu Hatim said: It is only from Ata from the Prophet, peace be upon him, Mursal, from the Hadith of Al-Walid bin Muslim.\n3. Narrated from him: Abd al-Aziz bin Imran Al-Madani, kunya Abu Al-Fadl. Ibn Adi said: He narrated denounced Hadiths, his Hadiths are not preserved. Ibn Hibban mentioned him in Al-Thiqat and said: Ibn Abi Fudayk narrated a sound copy (Nuskha) from him. Ibn Abi Hatim remained silent about him. See: Al-Jarh wa Al-Ta'dil (4 / 381), Al-Mizan (2 / 260), Al-Lisan (3 / 136).\n4. Client of Al-Huraqah, the Tabi'i, truthful (Saduq), perhaps erred. From the fifth class. Muslim and the four in their Sunan narrated from him. See: Al-Jarh wa Al-Ta'dil (6 / 357), Al-Tahdhib (8 / 186), Al-Taqrib (2 / 93), Ma'rifat Al-Thiqat (1282).\n5. It was reported from Ibn Ma'in that he said: He and Suhayl are close to equal. As for Ahmad, he said: Al-A'la is above Suhayl. Abu Zur'ah said: Suhayl is more established and famous. Abu Hatim Al-Razi said similarly. See: Previous references. (*)",
    "book_id": "1060",
    "new_page_number": 71
  },
  {
    "serial_number": "3331533",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 72,
    "volume_number": 1,
    "text": "Abi Salih (1), except that Abu Salih (2) is more established to them than Abd al-Rahman (3), the father of Al-A'la. 43 - I said to him: Isa bin Mina (4) from Muhammad bin Ja'far (5)? He said: He is the son of Ja'far bin Abi Kathir, the brother of Isma'il bin Ja'far (6), and they are",
    "foot_note": "1. (1) Al-Samman, truthful (Saduq), his memory changed at the end. The authors of the six original books narrated from him. See: Siyar A'lam Al-Nubala (5 / 458), Al-Tahdhib (4 / 264), Al-Tahdhib (1 / 338), Ma'rifat Al-Thiqat (695), Tadhkirat Al-Huffaz (1 / 137), Shadharat Al-Dhahab (1 / 208).\n2. He is Dhakwan, Abu Salih Al-Samman, Madani, Tabi'i, trustworthy, established. From the third class. His Hadith is in the six books. Died in the year 101 AH. See: Tabaqat Ibn Sa'd (5 / 222), Tadhkirat Al-Huffaz (1 / 89) Al-Ibar (1 / 121), Al-Tahdhib (3 / 219), Al-Taqrib (1 / 238).\n3. He is Abd al-Rahman bin Ya'qub, client of Al-Huraqah, Madani, Tabi'i, trustworthy. From the third class. Muslim and the four in their Sunan narrated from him. See: Al-Tarikh Al-Kabir (3 / 1 / 266), Ma'rifat Al-Thiqat (1091), Al-Tahdhib (6 / 301), Al-Taqrib (1 / 503).\n4. He is Qalun Al-Madani, the Reciter, companion of Nafi'. In recitation he is established (Thabt), and in Hadith his Hadith is written in general. Ibn Hibban mentioned him in Al-Thiqat and said: His kunya is Abu Musa. Narrated from him: Muhammad bin Isma'il Al-Bukhari and Isma'il the Judge. Ibn Abi Hatim remained silent about him. Ahmad bin Salih Al-Masri laughed when he was mentioned and said: You write from everyone. Died in the year 220 AH. See: Al-Jarh wa Al-Ta'dil (6 / 290), Al-Mizan (3 / 327), Al-Lisan (4 / 407, 408).\n5. Al-Ansari, trustworthy, from the seventh class. His Hadith is in the six books. See: Al-Tarikh Al-Kabir (1 / 1 / 56), Al-Jarh wa Al-Ta'dil (7 / 220), Al-Tahdhib (9 / 94), Al-Taqrib (2 / 150).\n6. Al-Ansari, Abu Ishaq the Reciter, from the eighth class. Trustworthy, established. His Hadith is in the six books. Died in the year 180 AH. See: Al-Tarikh Al-Kabir (1 / 1 / 349), Al-Jarh wa Al-Ta'dil (2 / 162), Al-Tahdhib (1 / 287), Al-Taqrib (1 / 86). (*)",
    "book_id": "1060",
    "new_page_number": 72
  },
  {
    "serial_number": "3331534",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 73,
    "volume_number": 1,
    "text": "a group: Kathir bin Ja'far (1), Muhammad bin Ja'far (2), Musa bin Ja'far (3), and Yahya bin Ja'far (4). 44 - And I said to him: Ibn Mani' (5), Ibn Abi Dawud (6), and Ibn Sa'id (7) are gathered in a Hadith; who is put forward? He said: Ibn Mani' due to his age, then Ibn Sa'id. I said: Is Ibn Sa'id more beloved to you than Ibn Abi Dawud?",
    "foot_note": "1. (1) He is Kathir bin Ja'far bin Abi Kathir, client of Banu Zurayq, Al-Ansari, brother of Isma'il bin Ja'far. Al-Bukhari and Ibn Abi Hatim remained silent about him. He narrated from Abu Tuwalah and Alaqah, and from him Ibrahim bin Al-Mundhir and Abu Thabit Muhammad bin Abdullah. See: Al-Tarikh Al-Kabir (4 / 1 / 217), Al-Jarh wa Al-Ta'dil (7 / 150).\n2. Previously translated.\n3. He is Musa bin Ja'far Al-Ansari, narrated from his uncle, he is not known, and his report is dropped. Thus said Al-Dhahabi. Al-Uqayli before him said: Unknown in transmission, he is not corroborated in his Hadith, and it is not authentic. Ibn Hajar said: I did not find his name nor know his condition. See: Al-Mizan (4 / 201), Al-Lisan (6 / 113, 114).\n4. Brother of the previous ones. Ibn Abi Hatim mentioned that he narrated from Ibn Abi Labibah, and from him: Isma'il bin Ja'far. He, and Al-Bukhari, did not mention any criticism or praise regarding him. See: Al-Tarikh Al-Kabir (4 / 2 / 265), Al-Jarh wa Al-Ta'dil (9 / 134).\n5. Previously translated.\n6. He is Abdullah bin Sulayman bin Al-Ash'ath, the Allamah Imam, the Hafiz, Muhaddith of Baghdad, trustworthy, author of useful works. Died in the year 316 AH. See: Tarikh Baghdad (9 / 464), Wafayat Al-A'yan (2 / 404), Tadhkirat Al-Huffaz (2 / 767), Al-Mizan (2 / 433), Al-Lisan (3 / 293), Shadharat Al-Dhahab (2 / 273).\n7. Scholar of Ilal (defects) and Men, the Proficient Hafiz, Muhaddith of Baghdad, Yahya bin Muhammad bin Sa'id. Trustworthy, established. Died in the year 318 AH. See: Tarikh Baghdad (14 / 231), Tadhkirat Al-Huffaz (2 / 776), Al-Ibar (2 / 173), Al-Bidaya wa Al-Nihaya (11 / 166), Siyar A'lam Al-Nubala (14 / 501), Shadharat Al-Dhahab (2 / 280). (*)",
    "book_id": "1060",
    "new_page_number": 73
  },
  {
    "serial_number": "3331535",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 74,
    "volume_number": 1,
    "text": "He said: Ibn Sa'id is older, born in the year 228, and Ibn Abi Dawud in the year 230. 45 - I said to him: Muhammad bin Al-Wazir the Damascene (1) and Muhammad bin Wazir the Wasiti (2), which of them is more beloved to you? [He said (3): Both are trustworthy (4)]. 46 - ... (5). He said: This one who narrates from Nafi from Ibn Umar is a Sheikh of Abu Hamza (6), unknown, and the Hadith is denounced (Munkar). 47 - I said to him: The Hadith that the Prophet, peace be upon him (prayed over a fornicatress and her daughter) (7)?",
    "foot_note": "1. (1) Ibn Al-Hakam, trustworthy, from the younger ones of the tenth class. Abu Dawud narrated from him. Died in the year 250 AH. See: Al-Jarh wa Al-Ta'dil (8 / 115), Al-Tahdhib (9 / 500), Al-Taqrib (2 / 215), Al-Mizan (4 / 58).\n2. Ibn Qays, trustworthy, worshiper, from the tenth class. Al-Tirmidhi narrated from him. Died in the year 257 AH. See: Al-Jarh wa Al-Ta'dil (8 / 115), Al-Tahdhib (9 / 500), Al-Taqrib (2 / 215), Al-Mizan (4 / 58).\n3. Dropped from both copies between the brackets.\n4. Ibn Hajar mentioned it in Al-Tahdhib (9 / 501) saying: Al-Barqani said: I said to Al-Daraqutni: Muhammad bin Al-Wazir the Damascene or the Wasiti is more beloved to you? He said: Both are trustworthy.\n5. Dropped in the original. By referring to references of denounced Hadith, it was found that the person Al-Daraqutni will be asked about is Muhammad bin Ziyad, companion of Nafi', and Sheikh of Abu Hamza. Takhrij of the mentioned Hadith will follow.\n6. He is Muhammad bin Maymun Al-Marwazi, Abu Hamza Al-Sukkari, trustworthy, virtuous, from the seventh class. His Hadith is in the six books. Died in the year 167 or 168 AH. See: Al-Tarikh Al-Kabir (1 / 1 / 234), Al-Tahdhib (9 / 486), Al-Taqrib (2 / 212).\n7. Narrated by Al-Tabarani (13428) in Al-Mu'jam Al-Kabir. In its chain is Muhammad bin Ziyad, who is = (*)",
    "book_id": "1060",
    "new_page_number": 74
  },
  {
    "serial_number": "3331536",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 75,
    "volume_number": 1,
    "text": "He said: Yes. I said: Is it to be abandoned? He said: Yes. 48 - I said to him: The Hadith of Al-Fadl bin Musa (1) from Abdullah bin Sa'id bin Abi Hind (2) from Thawr (3) from Ikrimah (4) from Ibn Abbas: (The Prophet, peace be upon him, used to glance in his prayer to the right and left) (5)?",
    "foot_note": "1. = one of the unknown narrators. Al-Haythami mentioned it in Majma' Al-Zawa'id (3 / 41) and said: It contains Muhammad bin Ziyad, companion of Nafi', and I did not find anyone who wrote his biography.\n1. He is Al-Fadl bin Musa Al-Sinani, Abu Abdallah, Al-Marwazi. Trustworthy, established, and perhaps narrated oddities. From the elders of the ninth class. His Hadith is in the six books. Died in the year 192 AH. See: Tabaqat Ibn Sa'd (7 / 372), Al-Jarh wa Al-Ta'dil (7 / 68), Al-Tarikh Al-Kabir (7 / 117), Al-Saghir (2 / 268), Al-Ibar (1 / 307), Al-Mizan (3 / 260), Tadhkirat Al-Huffaz (1 / 296), Al-Tahdhib (8 / 286).\n2. Abu Bakr Al-Madani, authenticated by more than one Imam. Ibn Hajar said: Truthful (Saduq) perhaps erred. From the sixth class. His Hadith is in the six books. See: Al-Tarikh Al-Kabir (5 / 104), Al-Jarh wa Al-Ta'dil (5 / 70 - 71), Al-Tahdhib (5 / 239), Al-Taqrib (1 / 420).\n3. He is Thawr bin Zayd Al-Dili, trustworthy, from the sixth class. His Hadith is in the six books. Died in the year 135 AH. See: Al-Tarikh Al-Kabir (1 / 2 / 181), Al-Jarh wa Al-Ta'dil (2 / 268), Al-Tahdhib (2 / 32), Al-Taqrib (1 / 120).\n4. The Allamah, Hafiz, Exegete, Abu Abdallah, client of Ibn Abbas. His Hadith is in the six books, and he is trustworthy, established. Died in the year 107 AH. See: Tabaqat Ibn Sa'd (5 / 287), Al-Jarh wa Al-Ta'dil (7 / 7), Hilyat Al-Awliya (3 / 326), Al-Tadhkirah (1 / 95), Al-Tahdhib (7 / 263).\n5. Authentic. Narrated by Ahmad (1 / 275, 306), Al-Tirmidhi (584), (585), Al-Nasa'i (4 / 9), Ibn Khuzaymah (480), Ibn Hibban (4 / 24), Al-Hakim (1 / 236) who authenticated it, and Al-Dhahabi approved, and Al-Tabarani (11559) in Al-Kabir. Its completion is (and he did not twist his neck behind his back). It has a witness from the Hadith of Sahl bin Al-Hanzaliyah, narrated by Abu Dawud (916), and Al-Hakim (1 / 237) who authenticated it, and Al-Dhahabi approved. = (*)",
    "book_id": "1060",
    "new_page_number": 75
  },
  {
    "serial_number": "3331537",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 76,
    "volume_number": 1,
    "text": "He said: It is not authentic. 49 - I said: Its chain is Hasan (good), a group narrated it from Al-Fadl? He said: Yes, by Allah, it is Hasan, except that it has a defect (Illah). Waki' (1) narrated it from Abdullah",
    "foot_note": "1. = Al-Tirmidhi said: In the chapter there is a report from Anas and Aisha. [Meaning and Benefits of Hadith]: His saying: (He used to glance in prayer): meaning looking with the outer corner of his eyes, and 'Lihaz' is looking with the edge of the eye next to the temple. His saying: (Right and left): meaning sometimes to the right side, and sometimes to the left side. His saying: (And he did not twist his neck): meaning he did not turn or incline his neck. His saying: (Behind his back): meaning to his direction (behind him). Al-Tibi said: 'Layy' is twisting a rope... and he twisted his head meaning inclined it. Perhaps this turning was in voluntary prayer for it is easier, as in the Hadith of Anas. Ibn Abd al-Malik said: It is said his turning, peace be upon him, once or a few times was to show that it does not invalidate prayer, or it was for something necessary. If one twists his neck behind his back, meaning turns his chest away from the Qiblah, it invalidates the prayer. Hafiz Ibn Hajar said: Several Hadiths were reported regarding the dislike of turning explicitly, not meeting Al-Bukhari's conditions, including what is in Ahmad and Ibn Khuzaymah from the Hadith of Abu Dharr raised (Marfu'): (Allah continues to face the servant in his prayer as long as he does not turn; if he turns his face away, He turns away from him). And from the Hadith of Al-Harith Al-Ash'ari similarly, adding (So if you pray do not turn). The first was also narrated by Abu Dawud and Al-Nasa'i. The intended turning mentioned is as long as he does not turn his back to the Qiblah with his chest or his entire neck. The reason for the dislike of turning is possibly due to lack of khushu' (humility), or leaving the facing of the Qiblah with part of the body. See: Tuhfat Al-Ahwadhi (3 / 195 - 196), Fath Al-Bari (2 / 234).\n1. He is the Trustworthy, Worshiper, Hafiz Imam, Waki' bin Al-Jarrah, Abu Sufyan, from the elders of the ninth class. His Hadith is in the six books. Died in the year 196 AH. See: Tarikh Baghdad (13 / 466), Al-Tadhkirah (1 / 306), Al-Hilyah (8 / 368), Tabaqat Ibn Sa'd (6 / 275), Al-Ibar (1 / 324), Al-Mizan (4 / 335), Siyar A'lam Al-Nubala (9 / 152), Al-Tahdhib (11 / 123), Al-Taqrib (2 / 331), Shadharat Al-Dhahab (1 / 349). (*)",
    "book_id": "1060",
    "new_page_number": 76
  },
  {
    "serial_number": "3331538",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 77,
    "volume_number": 1,
    "text": "bin Sa'id (1) from Thawr (2) from a man from the Prophet, peace be upon him. 50 - I said: Only Al-Fadl (3) connected it? He said: [Definitively] (4). 51 - And I asked him about the Hadith of Sa'd bin Sa'id (5) from his brother (6) from his grandfather (7) from Ali from Abu Bakr regarding the virtue of Wudu (8)?",
    "foot_note": "1. (1) Previously translated.\n2. Previously translated.\n3. Previously translated.\n4. Thus in the original.\n5. Al-Madani, Abu Suhayl, lenient in Hadith, from the eighth class. Ibn Majah narrated from him. See: Al-Mizan (2 / 120), Al-Tahdhib (3 / 470), Al-Taqrib (1 / 286).\n6. He is Abdullah bin Sa'id, Abu Abbad Al-Laythi, Al-Madani, abandoned (Matruk), from the seventh class. Al-Tirmidhi and Ibn Majah narrated from him. See: Al-Tarikh Al-Kabir (3 / 105), Al-Saghir (2 / 105), Al-Du'afa Al-Saghir (65), Al-Du'afa by Al-Nasa'i (343), and by Al-Uqayli (810), Al-Jarh wa Al-Ta'dil (5 / 71), Al-Majruhin (3 / 9), Al-Du'afa by Al-Daraqutni (310), Al-Mizan (2 / 429), Al-Tahdhib (5 / 238).\n7. He is Sa'id bin Abi Sa'id, Abu Sa'd Al-Madani, trustworthy, changed before his death. His Hadith is in the six books. He is called Al-Maqburi because he lived next to the Baqi' cemetery. Died in the year 125 AH. See: Al-Tarikh Al-Kabir (3 / 474), Al-Jarh wa Al-Ta'dil (4 / 75), Tadhkirat Al-Huffaz (1 / 116), Al-Mizan (2 / 139), Al-Tahdhib (4 / 38), Siyar A'lam Al-Nubala (5 / 126), Shadharat Al-Dhahab (1 / 163).\n8. Al-Dhahabi mentioned (2 / 120) in the biography of Sa'd bin Sa'id this Hadith which he narrates from his brother Abdullah from his father from Abu Hurairah raised (Marfu'): (There is no share in Islam for one who has no prayer, and no prayer for one who has no ablution). Its chain is very weak, its defect is Abdullah bin Sa'id Al-Maqburi. * Al-Muttaqi Al-Hindi mentioned the Hadith in Kanz Al-Ummal (19098) and attributed it to Al-Bazzar, from the Hadith of Abu Hurairah. (*)",
    "book_id": "1060",
    "new_page_number": 77
  },
  {
    "serial_number": "3331539",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 78,
    "volume_number": 1,
    "text": "He said: Sa'd and Abdullah bin Sa'id bin Abi Sa'id Al-Maqburi are both weak, abandoned, and Abdullah is in a worse state than his brother. 52 - And I asked him about the Hadith of Ibn Jurayj (1) from Ata (2) from Ibn Abbas from the Prophet, peace be upon him: (The ears are part of the head) (3)? He said: This was narrated by no one but Abu Kamil (4) from Gundar (5) from him, and it is an error (Wahm) from him",
    "foot_note": "1. (1) Previously translated.\n2. Previously translated.\n3. Authentic. Narrated by Al-Daraqutni (1 / 98 - 99), Al-Khatib in his History (6 / 384), and Al-Tabarani (10784) in Al-Kabir, all from the Hadith of Ibn Abbas. * Narrated by Ahmad (5 / 268, 285), Abu Dawud (134), Al-Tirmidhi (37), Ibn Majah (444), and Al-Daraqutni (2 / 103) in his Sunan, all from the Hadith of Abu Umamah. * Narrated by Ibn Majah (445) and Al-Daraqutni (1 / 102) in his Sunan from the Hadith of Abu Hurairah. * Narrated by Ibn Majah (443) from the Hadith of Abdullah bin Zayd. * Narrated by Al-Daraqutni (1 / 97, 98) and Al-Khatib (14 / 161) in his History from the Hadith of Abdullah bin Umar. * Narrated by Al-Daraqutni (1 / 100) from the Hadith of Aisha. * Narrated by Tammam Al-Razi in (Musnad Al-Thaqalayn) number (3) from the Hadith of Samurah bin Jundub. * Narrated by Al-Daraqutni (1 / 102) from the Hadith of Abu Musa, then he repeated it (2 / 103). With the sum of these paths, we find that the Hadith is authentic.\n4. He is the Hafiz Al-Basri, Al-Fudayl bin Husayn, Abu Kamil Al-Jahdari. Al-Bukhari narrated from him in suspension, and Muslim, Abu Dawud, Al-Nasa'i, and Al-Tirmidhi. One of the trustworthy Hafizs. Died in the year 237 AH. See: Al-Jarh wa Al-Ta'dil (7 / 71), Al-Ibar (1 / 425), Al-Tahdhib (8 / 290), Siyar A'lam Al-Nubala (11 / 111), Al-Taqrib (2 / 112), Shadharat Al-Dhahab (2 / 88).\n5. He is the Hafiz Imam, Muhammad bin Ja'far Al-Madani, Al-Basri known as Gundar. Trustworthy, = (*)",
    "book_id": "1060",
    "new_page_number": 78
  },
  {
    "serial_number": "3331540",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 79,
    "volume_number": 1,
    "text": "against Gundar; no one narrated it from Gundar other than him (1). 53 - I said to him: Rashid bin Sa'd (2)? He said: Abu Al-Muhallab, Homsi, weak, not to be considered. 54 - And I asked him about Isam bin Qudamah Al-Bajali (3)? He said: Kufan, can be considered. 55 - I said: Malik bin Numayr Al-Khuza'i (4) from his father (5)?",
    "foot_note": "1. = his book is authentic. From the ninth class. His Hadith is in the six books. Died in the year 193 or 194 AH. See: Tabaqat Ibn Sa'd (7 / 296), Al-Tarikh Al-Kabir (1 / 57), Al-Saghir (2 / 395), Al-Jarh wa Al-Ta'dil (7 / 221), Tarikh Baghdad (2 / 152), Tadhkirat Al-Huffaz (1 / 300), Al-Mizan (3 / 502), Al-Tahdhib (9 / 96), Shadharat Al-Dhahab (1 / 333).\n1. See: Sunan Al-Daraqutni (1 / 99). Imam Al-Daraqutni has been refuted on this, so refer to Nasb Al-Rayah, Talkhis Al-Habir, and others.\n2. He is Rashid bin Sa'd Al-Miqra'i, trustworthy, authenticated by Ibn Ma'in, Abu Hatim, Al-Nasa'i, Ya'qub bin Shaybah, Al-Ajli, Ibn Sa'd, and Ibn Hibban, but he narrates many Mursal reports. From the third class. Al-Bukhari narrated from him in Al-Adab Al-Mufrad, and the four in their Sunan. Died in the year 108 AH. See: Al-Jarh wa Al-Ta'dil (3 / 483), Al-Mizan (2 / 35), Al-Tahdhib (3 / 225 - 226), Al-Taqrib (1 / 240).\n3. Abu Muhammad Al-Kufi, truthful (Saduq), from the seventh class. Abu Dawud, Al-Nasa'i, and Ibn Majah narrated from him. Al-Nasa'i and Ibn Hibban authenticated him. Ibn Ma'in said: Righteous (Salih). Abu Zur'ah and Abu Hatim said: There is no harm in him. See: Al-Jarh wa Al-Ta'dil (7 / 25), Al-Mizan (3 / 67), Al-Tahdhib (7 / 196), Al-Taqrib (2 / 21).\n4. He is Malik bin Numayr, Al-Khuza'i Al-Basri, acceptable (Maqbul), from the fourth class. Abu Dawud, Al-Nasa'i, and Ibn Majah narrated from him. He narrated from his father, and from him: Isam bin Qudamah. Ibn Al-Qattan said: The condition of Malik is not known, and Al-Dhahabi said likewise. See: Al-Mizan (4 / 429), Al-Tahdhib (10 / 23), Al-Taqrib (2 / 227).\n5. He is Numayr bin Abi Numayr, lived in Basra, and has companionship (suhba). Al-Nasa'i narrated (3 / 38) that he = (*)",
    "book_id": "1060",
    "new_page_number": 79
  },
  {
    "serial_number": "3331541",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 80,
    "volume_number": 1,
    "text": "He said: No one narrated from him except his son. 56 - I asked him about Quran bin Tammam (1)? He said: Abu Tammam, Kufan, trustworthy (2). 57 - And Abu Al-Hasan Al-Daraqutni said to us: Al-Zubayri (3) is weak, Al-Bukhari mentioned him in argumentation. And Abu Hudhafah (4) is strong in hearing from Malik (5). Al-Mahamili (6) said to us:",
    "foot_note": "1. = said: (I saw the Messenger of Allah, peace be upon him, sitting in prayer, placing his right hand on his right thigh). Narrated by Ibn Khuzaymah (715), (716), and Al-Bayhaqi (2 / 931) in Al-Sunan Al-Kubra. Its chain is weak due to the obscurity of Malik bin Numayr as previously mentioned, but the Hadith has many witnesses. See: Al-Jarh wa Al-Ta'dil (8 / 497 - 498), Usd Al-Ghabah (5 / 361), Al-Isabah (6 / 255), Al-Taqrib (1 / 307), Al-Tahdhib (10 / 477).\n1. Al-Asadi, resident of Baghdad, truthful (Saduq) perhaps erred. From the eighth class. Abu Dawud, Al-Tirmidhi, and Al-Nasa'i narrated from him. Died in the year 181 AH. See: Al-Mizan (3 / 386), Al-Tahdhib (8 / 367), Al-Taqrib (2 / 124).\n2. Ibn Hajar reported that in Al-Tahdhib (8 / 367).\n3. He is Muhammad bin Abdullah bin Al-Zubayr, Abu Ahmad Al-Zubayri of Kufa, trustworthy, established, except that he may err in the Hadith of Al-Thawri. From the ninth class. His Hadith is in the six books. Died in the year 203 AH. See: Tabaqat Ibn Sa'd (6 / 402), Al-Tarikh Al-Kabir (1 / 133), Al-Saghir (2 / 298), Al-Jarh wa Al-Ta'dil (7 / 297), Al-Mizan (3 / 595), Al-Tadhkirah (1 / 357), Al-Tahdhib (9 / 254), Al-Taqrib (2 / 176).\n4. The Muhaddith Imam, the Long-lived Jurist, Ahmad bin Isma'il bin Muhammad Al-Sahmi. Ibn Majah narrated from him. His hearing of Al-Muwatta is authentic, but he confused other things. From the tenth class. Died in the year 259 AH. See: Tarikh Baghdad (4 / 22), Al-Mizan (1 / 83), Al-Ibar (2 / 18), Al-Tahdhib (1 / 15), Al-Taqrib (1 / 11), Shadharat Al-Dhahab (2 / 139).\n5. Previously translated.\n6. The Judge, Muhaddith, Trustworthy, Musnid of his time, Abu Abdallah Al-Husayn bin Isma'il bin Muhammad, author of the Sunan. Al-Mahamili is attributed to 'Al-Mahamil' (litters) in which people are carried on camels to Mecca. = (*)",
    "book_id": "1060",
    "new_page_number": 80
  },
  {
    "serial_number": "3331542",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 81,
    "volume_number": 1,
    "text": "I asked my father (1) about him, he said: I asked Abu Mus'ab (2) about him, he said: He used to attend the presentation (Al-Ard) with us before Malik (3). Abu Al-Hasan said: Except that negligence overtook him, I read to him Hadiths which he did not have.",
    "foot_note": "1. = Ten thousand men used to attend his assembly. Died in the year 330 AH. See: Tarikh Baghdad (8 / 19), Tadhkirat Al-Huffaz (3 / 824), Al-Ibar (2 / 222), Al-Bidaya wa Al-Nihaya (11 / 203), Shadharat Al-Dhahab (2 / 326).\n1. He is Isma'il bin Muhammad bin Isma'il, Al-Mahamili Al-Dabbi, lived in Baghdad, and narrated there from Al-Fayd bin Wathiq and Abdullah bin Awn. His two sons Al-Husayn and Al-Qasim narrated from him. See Tarikh Baghdad (6 / 280).\n2. He is the Allamah Imam, the Truthful Jurist, Ahmad bin Abi Bakr Al-Zuhri. His Hadith is in the six books. From the tenth class. Died in the year 242 AH. See: Tadhkirat Al-Huffaz (2 / 60), Al-Ibar (1 / 436), Al-Tahdhib (1 / 20), Siyar A'lam Al-Nubala (11 / 436), Al-Taqrib (1 / 12).\n3. Al-Baghdadi reported it (4 / 24) in his History, and Al-Dhahabi mentioned it in Siyar A'lam Al-Nubala (12 / 25), and Al-Asqalani in Al-Tahdhib (1 / 15). (*)",
    "book_id": "1060",
    "new_page_number": 81
  },
  {
    "serial_number": "3331543",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 82,
    "volume_number": 1,
    "text": "[End of the Part] Praise be to Allah alone, and may Allah send blessings and peace upon our Master Muhammad and his Family and Companions. Heard by Abu Tahir Al-Silafi through the reading of Abu Abdallah Muhammad bin Abd al-Rahman Ibn Ali Al-Tujibi Al-Makin, Abu Al-Haram Makki bin Abd al-Rahman bin Abi Sa'd Ibn Atiq Al-Adl, and attended by the son of Abu Al-Qasim the grandson of the Listener, and Abu Abdallah Muhammad bin Ibrahim bin Ahmad Al-Fayruzabadi, and Abdullah bin Zafir Al-Kanai, and the writer of the hearing (Sama'): Abd al-Malik bin Muhammad bin Abi Al-Qasim Al-Tuzi, and others. And it was validated on Thursday the fourteenth of Sha'ban, year five hundred and seventy-four (574 AH) in Alexandria. Praise be to Allah. And heard by Al-Fakhr Muhammad bin Ibrahim bin Ahmad Al-Farisi by his hearing transmitted from Al-Silafi through the reading of the writer of the hearing Abd al-Azim bin Abd al-Qawi Al-Mundhiri, Abu Al-Fadl Abd al-Rahim bin Abi Al-Barakat Abd al-Mun'im bin Khalaf Al-Dumayri and others. On the seventh of Jumada Al-Ula, year six hundred and seventeen (617 AH). And heard by the Chief Judge Izz al-Din Abu Umar Abd al-Aziz bin Muhammad bin Ibrahim bin Jama'ah by his license (Ijaza) from Abd al-Rahim bin Abd al-Mun'im bin Khalaf Al-Dumayri, by his hearing through the reading of Abu Al-Abbas Ahmad bin Abd al-Qadir bin Ahmad bin Maktum Al-Qaysi Al-Hanafi Sharaf al-Din Abu Al-Tahir Muhammad bin Al-Qadi Izz al-Din bin Abi Al-Yumn, Muhammad bin the Allamah Siraj al-Din, Abd al-Latif bin Ahmad bin Mahmud bin Al-Kuwayk Al-Raba'i, and others.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 82
  },
  {
    "serial_number": "3331544",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Al-Barqani to Al-Daraqutni regarding Jarh and Ta'dil",
    "edition": "None",
    "publisher": "Quran Library for Printing, Publishing and Distribution",
    "page_number": 83,
    "volume_number": 1,
    "text": "On Sunday the thirteenth of Sha'ban year seven hundred and forty-seven (747 AH) at the house of the Listener at the Salihirrh School in Cairo. And he authorized. And heard by Al-Sharaf Muhammad bin Muhammad bin Abd al-Latif bin Al-Kuwayk by his hearing through the reading of Taqi al-Din Ahmad bin Muhammad bin Muhammad bin Hasan Al-Shumunni through the reading of his father at the beginning of Dhu al-Hijjah year eight hundred and ten (810 AH) at his house in Harat Barjwan in Cairo. And he authorized. And heard by him through the reading of Abu Muhammad Abd al-Salam bin Ahmad bin Abd al-Mun'im Al-Baghdadi Al-Hafni, Abu Al-Na'im Ridwan bin Muhammad bin Yusuf Al-Uqbi, and Muhammad and Ahmad the sons of Al-Muhib Muhammad bin Muhammad bin Ahmad, and Nur al-Din Ali bin Abi Bakr Al-Ashmuni bin Al-Tabbakh, and Badr al-Din Hasan bin Husayn Ibn Hasan Al-Hurini among others. And it was validated on Thursday the twenty-first of Jumada Al-Akhirah, year eight hundred and fourteen (814 AH) at the house of the Listener, and he authorized. With the help of Allah Almighty, copying of this part was completed on the morning of Sunday corresponding to the 14th of the unique month of Rajab of the year 1351 Hijri, and the 13th of November year 1932 Gregorian at the expense of the Egyptian National Library (Dar Al-Kutub Al-Misriyyah) copied from the manuscript copy preserved at the Egyptian National Library under number 1558 Hadith. Written by the one hoping for the pardon of the Firm One, Mahmoud Abd al-Latif Fakhr al-Din. And may Allah send blessings and peace upon our Master Muhammad, and upon his Family and Companions.",
    "foot_note": "None",
    "book_id": "1060",
    "new_page_number": 83
  }
]