[
  {
    "text": "The Miracle of the Quran\nAuthor: محمد متولي الشعراوي\nYear: 1418",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Miracle of the Quran",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1364\nbook_title: معجزة القرآن\nbook_link: https://shamela.ws/book/1120\nbook_id: 1120\nauthor_name: محمد متولي الشعراوي\nauthor_year: 1418\nnickname: Null\nauthor_link: https://shamela.ws/author/17\nauthor_ID: 17\neditor: Null\npublisher: المختار الاسلامي للطباعة والنشر والتوزيع ص. ب ١٧٠٧ - القاهرة\nedition: الأولى، 1398 هـ - 1978 م\npages: 80\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Miracle of the Quran",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1129090",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Quranic Sciences and Principles of Exegesis. Book: The Miracle of the Quran. Author: Muhammad Metwally Al-Shaarawy (d. 1418 AH). Publisher: Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo. Edition: First, 1398 AH - 1978 AD. [Book pagination matches the printed version]. Number of Pages: 80. Publishing Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Miracle of the Quran. Author: Muhammad Metwally Al-Shaarawy (d. 1418 AH). Publisher: Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo. Edition: First, 1398 AH - 1978 AD. [Book pagination matches the printed version]. Number of Pages: 80. Publishing Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Muhammad Metwally Al-Shaarawy (d. 1418 AH). Publisher: Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo. Edition: First, 1398 AH - 1978 AD. [Book pagination matches the printed version]. Number of Pages: 80. Publishing Date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book pagination matches the printed version]. Number of Pages: 80. Publishing Date in Shamela: 8 Dhu al-Hijjah 1431.\nPublishing Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 3
  },
  {
    "serial_number": "1129091",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction\nThe miracle of the Holy Quran is an eternal miracle remaining until the Day of Judgment... The Quran is the seal of the heavenly books... It has no specific era for its miraculous nature nor a specific time; it is a guidance for all humanity... It did not come as a science book... This is a fact we must keep in our minds... But at the same time, it came as an eternal, lasting miracle... Hence, it contains miraculousness for all ages... Miraculousness for those who lived before us, miraculousness for this age of ours, and miraculousness for those who will come after us... Until the world and what is in it ends.\nThe Quran came to warn whoever is alive... Hence, it is directed to the living... Its challenge is for those residing on this earth... Not for those who have moved from it to the other world... For those see with the eye of certainty... And know the truth after leaving the world.\nWhen His Eminence Sheikh Muhammad Metwally Al-Shaarawy, Minister of Endowments and Al-Azhar Affairs, began writing his articles in Akhbar Al-Youm about the miraculous nature of the Quran... These articles caused a great stir... For they addressed the miraculous nature of the Quran from the creation of the world until now.\nHis Eminence Sheikh Muhammad Metwally Al-Shaarawy spoke in them about Adam... And how God taught him the names... What is the meaning of God teaching the names to Adam... Then he discussed after that how when a human learns now... he must learn the names first...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 4
  },
  {
    "serial_number": "1129092",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 4,
    "volume_number": 1,
    "text": "His Eminence Sheikh Al-Shaarawy then discussed... Why the Quran was revealed as a comprehensive book for all humanity... And why previous heavenly books were revealed to a specific nation or people to treat a specific ailment... Whereas the Quran is a remedy for the problems of all humanity.\nThen he narrated in detail how the Quran tore through the three veils of the unseen... The veil of the past... The veil of the present... And the veil of the future... Indeed, it entered into the human soul... To reveal what a human hides... And does not disclose... And which only God knows.\nThe Quran then tore through the veils of the near and distant future... Foretelling things the mind did not believe would happen... Or that they could happen... It predicted the outcomes of wars and the destinies of peoples.\nIt told us that the earth is spherical... And revealed embryology to us before the world knew it... It challenged humanity to create a single fly... And revealed what is smaller than an atom... Note that the word 'smaller' means utmost precision in smallness of size... Because there is small and smaller.\nIt said: 'And what is beneath the soil,' indicating that there are vast riches in the depths of the earth... Then it informed us about the miracle of creation... And how it happens... And clarified things we have reached through earthly science... And things we have not reached until now.\nAll of this was explained by His Eminence Sheikh Muhammad Metwally Al-Shaarawy, Minister of Endowments and Al-Azhar Affairs, in an easy, beautiful style... And in a way understandable to every human.\nThe truth is that this book is considered an important and profound scientific interpretation of some of the Quran's miracles... It is an interpretation that no Imam has addressed until now in this form... And has not been presented in this easy, enjoyable style... It adds to the Quranic library... The library of exegesis, important additions that every Muslim takes pride in...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 5
  },
  {
    "serial_number": "1129093",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 5,
    "volume_number": 1,
    "text": "I said to His Eminence Sheikh Muhammad Metwally Al-Shaarawy that I hope he interprets the entire Quran... And that an interpretation be issued in his name... And he promised that... And I hope from God that he fulfills his promise soon.\nI am proud to present this book written by His Eminence Sheikh Muhammad Metwally Al-Shaarawy... I am proud to present it to every Muslim... And I hope from God that His Eminence Sheikh Metwally Al-Shaarawy presents the interpretation of the entire Quran soon... And that God blesses him until this great work is completed.\nAhmed Zein",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 6
  },
  {
    "serial_number": "1129094",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Miracle of the Quran\nCan Muhammad, peace be upon him, predict the result of a military battle that will happen after seven or eight years... And determine who will win... And who will be defeated... What makes him enter into an unseen matter like this... How does he inform the disbelievers... About what their chests hide... And what their lips have not whispered... And tell the enemies of Islam what will happen to them... And speak about matters of the unseen... What could have happened to the entire issue of faith... If the Quran had not been truthful in every letter it said? But the Speaker is God and the Doer is God.\nThe Quran is the word of God revealed to His Messenger, our master Muhammad, may God bless him and grant him peace... Recited as an act of worship... And challenging [humanity] with it.\nThe Quran carries more than one miracle... God challenged the Arabs with it first... Then He challenged mankind and jinn with it... God did not challenge the angels with it... Because angels do not have choices to act upon... Meaning they do only what they are commanded by God... Hence, the Quran challenges all forces that have choice or possess free will... Those whom God distinguished... With the capacity of reason, thought, and choice.\nBefore we talk about the miracle of the Quran... We must define the meaning of the word 'miracle'.\nWhen a person comes and says he is a messenger from God coming to convey His methodology... Do we believe him... Or do we demand proof of what he says... Therefore, a miracle had to come with every messenger to prove his truthfulness in his message and in his conveyance from God... And the miracle must be something no one else can bring... And...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 7
  },
  {
    "serial_number": "1129095",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 7,
    "volume_number": 1,
    "text": "it must also be in what his people excelled in... Why?... So that it is not said that the messenger challenged his people with something they do not know and have no talent in... The challenge must be in a matter in which the people excelled so that the challenge has value.\nTherefore, we notice in the miracle of every messenger that it came in what his people excelled in... And that it came to destroy what they took as a god besides God.\nFor example, the miracle of Abraham, peace be upon him, came among people who worshipped idols... Prostrating to them and sanctifying them... Therefore, when they wanted to burn Abraham, they brought him before their gods to throw him into the fire... It was assumed that these gods would avenge themselves against the one who destroyed them if they could benefit or harm themselves... But when they threw Abraham, who ridiculed their beliefs, into the fire, the fire did not burn him... And their gods failed them.\nMoreover, the choice of fire could have another meaning... How many people worshipped fire in the past... Even during this period... You find some people still taking fire as a holy god.\nBut Abraham's miracle is not just escaping the fire... For if God wanted to save him from the fire, He would not have enabled them to capture him... Or rain would have fallen to extinguish the fire... But God willed that the fire remain a raging fire... burning... destroying... And that Abraham be taken visibly before all people... And thrown into the fire... And here its burning law or property is suspended ('We said, O Fire, be coolness and safety upon Abraham')...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 8
  },
  {
    "serial_number": "1129096",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 8,
    "volume_number": 1,
    "text": "If Abraham had survived by escaping, for example... they would have said, 'If we had caught him, we would have burned him.' And if rain had fallen, they would have said, 'If the rain hadn't fallen, we would have burned him.' But Abraham did not escape... And the rain did not fall... And the fire was raging... Yet it did not burn Abraham.\nSo it was as if their gods, whom they claimed would take revenge for themselves... were not gods as they claimed... They were merely idols that neither harm nor benefit.\nEverything in this universe is subject to God's will... and God's decree. When you say ('O Fire, be coolness and safety'), the property of burning is suspended, and the laws of the universe stand helpless before God's power... And their gods stand helpless to say: 'O fire, burn the one who smashed us.'\nJesus, peace be upon him, came when people knew medicine... So he brought them a miracle of the same kind they excelled in... He healed the blind and the leper... And ascended to something else they did not reach... He raised the dead... So the miracles of the messengers are a breach of the laws or norms of the universe... Fire with Abraham has its burning property suspended... And water with Moses loses its laws... The law of water is leveling (seeking its own level)... It cannot be high in one place and low in another... Its surface must be level... But when Moses struck the sea with his staff... It split, and each part became like a great mountain, standing high to breach all the laws of water.\nBut why did this happen? Why did the sea split into two parts... And all the laws of water were suspended... Because Moses referred the matter to God... How?... When Pharaoh's people followed Moses' people... Moses' people said, 'Indeed, we are to be overtaken.'... This is realistic talk... Because the sea is in front of them... And Pharaoh's people are behind them. The matter in human law is clear and needs no explanation... But Moses said: 'No'...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 9
  },
  {
    "serial_number": "1129097",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 9,
    "volume_number": 1,
    "text": "He said it with his full mouth... He said it while completely confident... Why?... Because he did not claim he would be saved by human means... He didn't say, 'I will be saved because we will climb such-and-such mountain... or we will cross the sea in such-and-such way.' Rather, he said: ('No, indeed with me is my Lord; He will guide me')... He transferred the matter from human law to God's power... And here God said ('Strike the sea with your staff')... So it split.\nThe Miracle of the Quran and How it Differs\nHowever, it is noted that the miracle of the Quran differs from the miracles of previous messengers... The miracles of the messengers breached natural laws... challenged... and proved that the one at whose hands they occurred was a truthful messenger from God... But they were cosmic miracles... Whoever saw them believed in them... And whoever did not see them, they became news to him... If he wished, he believed, and if he wished, he did not believe... Had they not been mentioned in the Quran, it might have been said that they never happened.\nThus, the tangible cosmic miracle... meaning the one a human senses and sees... happens once... Whoever saw it believed in it... And for whoever did not see it, it becomes news afterwards... But the miracle of the Prophet, peace be upon him, is a rational, remaining, eternal miracle... Everyone can say Muhammad is the Messenger of God... And this is a miracle, which is the Quran... Another thing, if we look at previous miracles... we find these miracles were an act of God... And an act of God can end after God does it; the sea split for Moses then returned to its nature... The fire did not burn Abraham but returned to",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 10
  },
  {
    "serial_number": "1129098",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 10,
    "volume_number": 1,
    "text": "its property afterwards. But the miracle of the Prophet, peace be upon him, is an attribute of God... which is His speech... And an act remains as long as the Doer maintains it... And an attribute remains with the existence of the Doer Himself.\nIt is also noted regarding the miracle of the Quran... that it differed from the miracles of the messengers in another way... Every messenger had a miracle... and he had a book of methodology (Manhaj)... Moses' miracle was the staff... and his methodology was the Torah... Jesus' miracle was medicine... and his methodology was the Gospel... But the Messenger of God, peace be upon him, his miracle is the very essence of his methodology... So that the methodology remains guarded by the miracle... And the miracle remains within the methodology.\nHence, the books preceding the Quran fell within the scope of assignment (Taklif)... meaning that God Almighty assigned His servants to preserve the Book... As for the Quran, God Almighty said about it: ('Indeed, it is We who sent down the Dhikr [Quran] and indeed, We will be its guardian'). Why?... First: Because the Quran is a miracle... And being a miracle, it must remain with this text, otherwise the miraculousness is lost... Second: Because God tested His servants in preserving previous books... So they forgot a portion of what they were reminded of... And what they didn't forget, they concealed some of it... And what they didn't conceal, they twisted their tongues with it and distorted it from its place... Thus we see there was more than one type of alteration, forgetting, and distortion... Then they brought things from themselves and said they were from God to exchange them for a small price.\nHence, God Almighty decided to preserve the Quran... If we take two lines... The line of applying the Quran... and acting upon its teachings... and the line of preserving the Quran... We see that the line of applying the Quran weakens as time passes... while the line of preserving the Quran increases as time passes... If we were applying",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 11
  },
  {
    "serial_number": "1129099",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 11,
    "volume_number": 1,
    "text": "the methodology correctly, this would have been natural... But our negligence of the Quran's teachings as conduct in life does not align with the increasing preservation of the Quran... We find the Quran everywhere... In every home, office, and car... Even the non-Muslim preserves the Quran and carries it... We find a German person, for example, thinking of writing the Quran on a single page... beautifully... Why does he do that with the Quran... before doing it with other heavenly books... And what makes countries like Japan and Italy excel in printing the Quran in a beautiful, elegant form... That happens because God Almighty wants to prove to us that He preserves the Quran... And the further we move away from the methodology... the more we increase in preserving the Quran and caring for it... To prove that the One preserving it is God... not those in charge of the methodology.\nThe Miracle of the Quran for the Whole World\nIf we define these three elements that characterize the miracle of the Quran... We then move to another point... The Quran is the word of God recited as worship... It came from the same genre the Arabs excelled in... The people among whom it was revealed... The people of Muhammad, peace be upon him... Known for eloquence and rhetoric... Good performance... Beautiful logic... And fluent expression... So the Quran challenges them in this... When they heard it, they were dazzled... But stubbornness stopped them... They said, 'A magician'... And the response here is very simple... Does the bewitched possess a choice with the magician... If Muhammad was a magician... He bewitched people... So why didn't he bewitch you so that you would follow him... The bewitched does not submit to the magician by his own will... Nor does he come to say",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 12
  },
  {
    "serial_number": "1129100",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 12,
    "volume_number": 1,
    "text": "to him, 'I will believe this magic... and disbelieve that magic.' Rather, the bewitched is stripped of will before the magician... So the fact that you say he is a magician while you do not believe in him is proof that you are liars.\nThen they said, 'A poet'... Muhammad never recited poetry in his life... And you know that... So why suddenly accuse him of poetry? Then they said, 'Madman'... Is a madman of such character that you don't know what he will do to you in the next minute?... Would a madman be of great moral character like the Prophet, peace be upon him... Whose character they knew well... And whom they nicknamed 'The Trustworthy' (Al-Amin) before the message?\nWhat happened is that they were dazzled... Stunned... They are the kings of rhetoric and eloquence and its pillars... Then came speech that incapacitated them... They found themselves helpless... So they floundered... They said magician... They said madman... And they said things not subject to any logic... Because from the force of the surprise, they lost argument and logic.\nThe Quran continues the challenge for them to bring something like it... Then it deepens the challenge to say ten surahs... Then it deepens the challenge to say one surah like it... This was the first miracle of the Quran... A miracle that challenged the people among whom it was revealed in what they excelled in... But the challenge in the Quran and its miracles are not for the Arabs alone... Rather, they are for the whole world... Hence, the linguistic miraculousness of the Quran... was its challenge to the Arabs in what they excelled in... But the challenge did not come for the Arabs alone... And the Quran came for all races... And all tongues... So where is the challenge... for non-Arabs... Furthermore, this Book will remain until the Hour is established...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 13
  },
  {
    "serial_number": "1129101",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 13,
    "volume_number": 1,
    "text": "So it must carry a miracle for the world in every time and place. Hence, there were miracles of the Quran... at the time of its revelation and during the period of its revelation... and after its revelation... and they are ongoing... until our present day... They will continue until the Hour strikes to show us God's signs on earth.\nThe Quran Tore Through the Barriers of the Unseen\nWhen the Quran came, it challenged in many things... First, it tore through the barriers of the unseen... It tore through the barriers of time and space... How so?\nThe barriers of the unseen are three... First, the barrier of place... Meaning things happen at the same moment... But I know nothing about them... Because they happen in a place... And I exist in another place... Then there is the barrier of past time... Which is something a past time has hidden from me... For I did not witness it... And the barrier of the future, which is what will happen tomorrow... Because the barrier of future time has hidden it from me, so I did not witness it... Thus, the barriers of the unseen are three... The barrier of place... The barrier of past time... And the barrier of future time.\nIf we read the Quran, we find that it tears through the barrier of past time... It informs us of what happened to previous nations... It narrates to us the stories of previous messengers... It tells us things no one knew... And on whose tongue... On the tongue of an unlettered prophet... Who does not read or write... He tells, then, the secrets of the past... And challenges those who deny... God tore through the veil and barrier of past time for him...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 14
  },
  {
    "serial_number": "1129102",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 14,
    "volume_number": 1,
    "text": "It is sufficient for you to read in the Quran... ('And you were not', 'And you were not', 'And you were not')... to know how much God informed His Messenger of news from the unseen past... ('And you were not on the western side when We decreed the command to Moses')... ('And you were not with them when they cast their pens as to which of them should take care of Mary')... Meaning you were not there, O Muhammad... But God is the One who informed you and tore through the veil of past time for you... ('And you were not a resident among the people of Madyan reciting Our verses to them... And you were not on the western side when We decreed the command to Moses... And you were not on the side of the mount when We called, but [it is] a mercy from your Lord')...\nThus we see that the Quran tore through the veil of past time on more than one occasion to inform Muhammad, peace be upon him, of the correct news about the messengers and prophets who preceded him and to correct what was distorted from the heavenly books that God revealed and which the monks and rabbis distorted... Indeed, the miraculousness here came in correcting what happened of distortion to the heavenly books that preceded the Quran.\nMuhammad, peace be upon him, used the Quran to challenge the Jewish rabbis and Christian monks... telling them this is from God... in the Torah or the Gospel... and this is what you distorted in the Torah or the Gospel... And they could not face this challenge or respond to it... That is because the challenge of the Quran in tearing through the veil of past time... reached the most minute secrets of past heavenly messages and corrected them for them... And showed what they distorted and concealed... And challenged them to deny what came in the Quran, but they could not... Among that is His saying in Surat Maryam ('That is Jesus, the son of Mary - the word of truth about which they are in dispute')...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 15
  },
  {
    "serial_number": "1129103",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 15,
    "volume_number": 1,
    "text": "Then came the second matter... God tore through the veil of place for Muhammad, peace be upon him... And it came regarding one of the most precise matters, which is the internal dialogue of the self... Here, before we start... I want us to keep firmly in mind that the Quran is the word of God recited as worship... And that it remains without modification or change, no one dares to touch or burn it... Hence, this speech is an argument binding upon Muhammad, peace be upon him, held against him... If the Quran reported something... and it turned out to be incorrect... that would be a destruction of the entire religion.\nThe Quran comes having clarified the danger of what it says... ('And they say within themselves, \"Why does Allah not punish us?\"'). What is the meaning of this speech... It means deepening the challenge... The Quran here does not say to them, 'I have torn through the barrier of the past... and informed you of the news of the ancients'... Nor does it say to them, 'I will tear through the barrier of place and inform you of what is happening in a nearby spot you do not see.' rather it says: 'I will tear through the barrier of the self... and inform you of what is in yourselves... what is inside your chests... what your lips have not whispered.'\nIt would have been sufficient for them to belie Muhammad by saying, 'Our selves did not speak to us about this.' If they hadn't actually said it inside themselves, that would have been the biggest proof to belie Muhammad and announce that he speaks incorrect words... Thus, the Quran, in tearing through the veil of place... entered into the human soul... And into whose souls... into the souls of non-believers who are interested in destroying Islam... And it said in speech recited as worship that will not change or be altered... It said: ('Have you not considered those who were forbidden from private conversation, then they return to that which they were forbidden and converse among themselves about sin and aggression and disobedience to the Messenger? And when they come to you, they greet you with that [word] by which Allah does not greet you and say among themselves, \"Why does",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 16
  },
  {
    "serial_number": "1129104",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 16,
    "volume_number": 1,
    "text": "Allah not punish us for what we say?\" Sufficient for them is Hell, which they will [enter to] burn, and wretched is the destination')... God Almighty has spoken the truth... It said what goes on in the souls of non-believers... Is there a greater challenge than this... to the veil of place... It is a challenge beyond the capacity of all human inventions that science has reached now to penetrate the veils of place.\nIndeed, the challenge appeared in what non-believers are keen to hide... For when a person is keen to hide something... and is a non-believer... he comes to you and swears to you that this is true... while it is untrue within himself only... But his keenness to hide it from people makes him confirm it is true by swearing... And God Almighty comes and makes the Quran tear through the souls of these people... And reveal what is in them, deepening the challenge... God Almighty says: ('And they will swear by Allah, \"If we were able, we would have gone forth with you.\" They destroy themselves, and Allah knows that they are liars')... And He Almighty says: ('They swear to you so that you might be satisfied with them. But if you are satisfied with them - indeed, Allah is not satisfied with a defiantly disobedient people')... And He Almighty says: ('And they swear to untruth while they know')... Thus, the Quran here came to people who were not believers... And tore through the barrier of the self regarding them, bringing out what was in their chests and exposing them before all people... And exposed their lying... And published to the whole world what was in their chests of lies, hypocrisy, and dissimulation... Meaning it humiliated them before the entire society... Had this been incorrect, these people would have said, 'We did not lie... We are truthful'... And the speech that",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 17
  },
  {
    "serial_number": "1129105",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 17,
    "volume_number": 1,
    "text": "Muhammad claims comes from God is incorrect speech... But these people were dumbfounded that the Quran tore through the veil of their souls, so they could not respond... They were dumbfounded because God brought out what was in their chests... And exposed them before all people... So they did nothing more than hide away after their reality was exposed.\nHad this Quran been from other than God, it would not have been able to reach inside the human soul... which is one of the most profound secrets of the world that no one has been able to reach until now... Yet the Quran comes challenging with speech worshipped with until the Day of Judgment, in which no one can change a letter, to reveal what is inside the soul... And expose what it conceals from all people... And what it is keen to conceal... Even to the point that they swear by God falsely so people believe them... The Quran comes and tears all this apart... Do you want a miracle greater than that?\nThen after that, the Quran tore through the veil of the future... The discussion about the future had to be in several stages... The contemporary stage... So that the people of the message, the believers, and the non-believers would know it is the truth... And the stage of the distant future so that every era that comes after the revelation of the Quran knows... that this is the true Book of God... Hence, the challenge was... for contemporaries regarding close events... And for the world regarding the facts of the entire universe.\nHere I would like to draw attention to a very important thing, which is the use of the letter 'Seen' (Sin) in the Quran... The letter 'Sin' as we know in the Arabic language is only used for future events... The Quran is preserved and recited as worship... And will remain preserved until the Day of Judgment... This means it cannot be substituted, changed, or denied by anyone who worships with it... Rather, it will continue to be recited like this as it was revealed... Thus, the Quran's reporting of future events",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 18
  },
  {
    "serial_number": "1129106",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 18,
    "volume_number": 1,
    "text": "records these events against the issue of faith itself... And stabs religion in its core... Especially if it turns out that what the Quran predicted is incorrect... Hence, the speaker of the Quran must be certain that this will happen in the future... Who among humans can be certain of what will happen to him after one hour... let alone after days and years?\nThe answer... No one... That is because human ability to create events is limited... Time has been veiled from them... And place has been veiled from them... If I said, for example, that I will build a building in this spot after a year... I do not guarantee that I will live until the next hour... Thus I cannot judge whether I will be present there or not... This is one thing... Secondly, the government might come, for example, and build a hospital in this place... Or a market or street might be established in this place. So I cannot be certain about a material thing that will happen after a limited period of time.\nBut the one who can say this with certainty is the one who possesses the power... Hence, He can say with certainty that this will happen after a period of time... And the one who possesses that is God Almighty... If the talk is about what will happen after thousands of years, that is beyond the capacity of all humans... The Quran has foretold what will happen after a few years... And what will happen after thousands of years... The one who said this is the Capable, All-Knowing that this will certainly happen, who is God Almighty.\nLook at His saying, Almighty: ('The assembly will be defeated, and they will turn their backs')... This Surah Al-Qamar was revealed in Mecca while the Muslims were few... and humiliated... Even Umar bin Al-Khattab said: 'Which assembly is this that will be defeated when we cannot protect ourselves?' Thus the Quran predicts that Islam will be victorious... in Mecca",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 19
  },
  {
    "serial_number": "1129107",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 19,
    "volume_number": 1,
    "text": "...And that this assembly gathered to fight Islam in Mecca will be defeated and turn their backs... When does it predict this... While Muslims are few... and humiliated... unable to protect themselves... It states it as a fact... Certain that God who said it will fulfill it.\nAfter that, we find a wonder... Al-Walid bin Al-Mughira, the staunch enemy of Islam... famous for his pride, arrogance, and stubbornness... The Quran comes and says about this arrogant, stubborn human... ('We will brand him upon the snout')... Meaning he will be killed by a blow on his nose... And determines the location of the blow... And after that, he comes at Badr... And you see he has been branded on his snout... meaning struck on his nose... Who can determine the location of the blow and its place... Who can be certain... what will happen after one hour?\nFuture Events and the Quran's Challenge\nWe come next to another verse... The Messenger, peace be upon him, comes and recites... ('May the hands of Abu Lahab be ruined, and ruined is he. His wealth will not avail him or that which he gained. He will [enter to] burn in a Fire of [blazing] flame. And his wife [as well] - the carrier of firewood. Around her neck is a rope of [twisted] fiber')... This is Quran... About whom... About the Prophet's uncle... And about whom... About the enemy of Islam... Could Abu Lahab not have fought Islam with this verse... Could he not have used it as a weapon against the Quran... against this religion... The verse said to him, O Abu Lahab, you will die a disbeliever... You will die a polytheist... And you will be tormented in the Fire... It would have been sufficient for Abu Lahab to go to any group of Muslims... And say I bear witness",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 20
  },
  {
    "serial_number": "1129108",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 20,
    "volume_number": 1,
    "text": "that there is no god but God and I bear witness that Muhammad is the Messenger of God... Saying it hypocritically... Saying it out of showing off... Saying it and then standing among the people saying: Muhammad foretold to you that I would die a disbeliever... And said this is speech conveyed to him from God... And I announce my Islam to prove to you that Muhammad is a liar... (If Abu Lahab possessed a single atom of intelligence, he would have done this... But even this thought, Abu Lahab's mind did not dare reach... Rather, he remained a disbeliever, a polytheist... And died while he was a disbeliever... Predicting that Abu Lahab specifically would die a disbeliever... was not a possible matter... Because many polytheists were guided to Islam like Khalid bin Al-Walid, Amr bin Al-Aas, Umar bin Al-Khattab... and others... They were polytheists and became Muslims... So how was it possible to predict that Abu Lahab specifically would not become Muslim even hypocritically... And would die a disbeliever?\nThe miracle here is that the Quran informed of what would happen to an enemy... And challenged him in a matter of choice... He could have said it, yet there is certainty that it would not happen... Why... Because the One who said this Quran... knows that a thought to belie the Quran would not come to Abu Lahab's mind... Is there a miracle greater than this?\nI move after this to the second point... Which is what did the Quran carry for non-Arabs in its era... And for non-Arabs and the whole world after its era... Meaning what did the Quran carry of news of God's laws on earth and His regulations... which were unseen to all humanity in its era and after its era... Here the examples are many... And there is not enough room for all of them... But I will try to clarify a number of them regarding the miraculous nature in the era of the Quran for non-Arabs... There were two great nations, empires, next to the Arabian Peninsula",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 21
  },
  {
    "serial_number": "1129109",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 21,
    "volume_number": 1,
    "text": "...They are the Romans and the Persians... The Romans were a believing nation... People of the Book... Even though they did not believe in Muhammad's message, they had faith in the existence of God and heavenly values... The Persians were people of disbelief and atheism at that time... They did not believe in any religion... So which of them was closer to the hearts of the believers... The Romans, considering they were People of the Book... And which of them was closer to the hearts of the atheists and disbelievers... The Persians, considering they were polytheists and disbelievers... War broke out between the two states... The Romans were defeated and the Persians won... Here the polytheists rejoiced because disbelief had won... And the believers grieved because a type of faith had been defeated... Here God Almighty intervenes to remove this grief from the believers... So He says in preserved speech recited as worship, which no one dares nor is able to change... He says: ('Alif, Lam, Meem. The Romans have been defeated. In the nearest land. But they, after their defeat, will overcome. Within three to nine years. To Allah belongs the command before and after. And that day the believers will rejoice in the victory of Allah. He gives victory to whom He wills, and He is the Exalted in Might, the Merciful')... Then the Quran continues to deepen the challenge... ('[It is] the promise of Allah. Allah does not fail in His promise, but most of the people do not know'). What is this... Can Muhammad, peace be upon him, predict the result of a battle that will happen between the Romans and Persians after a few years... Can a military commander, no matter how great his power, genius... and brilliance, predict the fate of a military battle one hour after it starts... Let alone that someone comes and says that after a few years a battle will occur between the Persians and Romans and the Romans will win in it... Was Muhammad, peace be upon him, secure for himself that he would live a few years to witness this battle... The matter reached the point with Abu Bakr, may God be pleased with him... that he bet on the correctness of what the Quran brought... Thus it became",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 22
  },
  {
    "serial_number": "1129110",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 22,
    "volume_number": 1,
    "text": "a major issue of faith... This is the Quran... God's word... and the basis of all faith... It comes and informs of a near earthly fact that will happen to non-Arabs... And the disbelievers say the Quran is lying... While the believers say this is truth... And a bet occurs between the two... What could have happened if a battle between the Romans and Persians did not take place... Or if a battle took place and the Romans were defeated in it? Would any human believe the Quran or believe in the new religion after that... Then if the Quran was from Muhammad, what made him enter into an unseen issue like this... No one asked him to enter it? Would religion be lost for the sake of a risk no one asked for... And in which no human challenged him... But the Speaker is God... And the Doer is God... Hence, this matter revealed in the Quran would certainly happen... Because its Speaker has no barrier of time... nor barrier of place... nor any barrier, and He is the One who says what He does... From here the war happened... And the Romans actually defeated the Persians... As the Quran predicted... Thus the Quran challenged the disbelievers and non-Muslims at the time of its revelation... Meaning it did not challenge the Arabs alone... Rather, it challenged the disbelievers and believers among non-Arabs... By informing them of what would happen to them seven or eight years before it happened... It challenged them with this so they might believe... If we conclude this, we have proven that the Quran challenged Arabs and non-Arabs at the time of its revelation... But we said that the Quran has no time... And no place... And that it will remain until the Hour is established... So how can it challenge coming generations... It must",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 23
  },
  {
    "serial_number": "1129111",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 23,
    "volume_number": 1,
    "text": "be that the Quran carries a permanent miracle... Giving every generation a gift it did not give to previous generations... And so it was... There came in the Quran things that if anyone had told of them at the time of its revelation... they would have accused those who said them of madness... But they came for future eras... They came to challenge across generations to our day... And to the coming days...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 24
  },
  {
    "serial_number": "1129112",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 24,
    "volume_number": 1,
    "text": "They Bore Witness for the Quran While Being Disbelievers\nThe emergence of the law of chance... and Darwin's theory... and that matter was created before the spirit... and everything we hear today of casting doubt on faith in the existence of God Almighty... The Quran recorded it... And informed us of it... It said that misguiders would come to tell you lies about the creation of the heavens and the earth... And about the issue of human creation... And if the talk about embryos in the Quran... was not with complete certainty... Then the Quran would have provided the means for its own destruction... For this Book will continue until the Day of Judgment... So if science came across thousands of years and proved the incorrectness of what the Quran mentioned, the entire issue of faith would be lost... But the Speaker is God and the Doer is God... The miraculous nature of the Quran has not stopped... And will not stop... And if the Quran challenged the disbelievers in the era of its revelation by informing them of what goes on inside their chests... And informing them of their destinies... It challenges the disbelievers even in this time... In this time we live in, indeed it uses them... For what... To prove the issue of faith... Just as it used them at the time of its revelation to prove the issue of faith... The goal of the disbelievers and those misguiding from the path of God is to deny this religion... And deny the existence of God... But the Quran came... And after fourteen centuries... to use the disbelievers to prove that God's religion",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 25
  },
  {
    "serial_number": "1129113",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 25,
    "volume_number": 1,
    "text": "is true... And that this Book is the word of God revealed to His Messenger Muhammad, peace be upon him... And this is our topic: When God Almighty says ('But most of the people do not know')... And says ('They know what is apparent of the worldly life, but they, of the Hereafter, are unaware')... He has given me that man knows the apparent of life in this world... But he is unaware of the matter of the Hereafter... Meaning that the extent of human knowledge... is the worldly life... And that knowledge is of two types... A type open for you to find your activity in as you wish... Without restrictions or limits... And a type you do not have the freedom to research because you do not know it... And this type is do such-and-such... And do not do such-and-such... Draw near to Me with such-and-such... And leave such-and-such... These are not your own interpretations... Because the Worshipped is the one who proposes to the worshipper how to glorify Him... And debate in a matter must take place between minds of equal or approximate capacity... And who among us possesses a mind approaching the capacity of God Almighty... No one... Therefore, we take 'do' and 'do not do' from God... And what the Sunnah explained to us... As for other life activities... And God's signs in the universe... I am required to research them and reflect... And reach facts I benefit from... If we want to define these subjects... We find them in the Quran... In His Almighty's saying ('Do you not see that Allah sends down rain from the sky, and We produce thereby fruits of varying colors? And in the mountains are tracts, white and red of varying shades and [some] extremely black... And among people and moving creatures and grazing livestock are various colors similarly'). Thus we see that God Almighty spoke about inanimate objects... And spoke about plants... And spoke about animals and humans... Then God Almighty says ('Only those fear Allah, from among His servants, who have knowledge')... Knowledgeable in what...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 26
  },
  {
    "serial_number": "1129114",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 26,
    "volume_number": 1,
    "text": "Regarding God's creation of inanimate objects, animals, plants, and humans... That is why God Almighty brought contradictions present in a single type... If it were one genus, contradictions would not be found in it... His saying ('fruits of varying colors') should have drawn our attention... Why did their colors vary... And what is the relationship between colors and nature... For example, when a plant feeds, studies found it feeds through the property of capillary tubes... And here we pause a little... Do these capillary tubes distinguish... Can they distinguish... If we bring a basin... And put in it a liquid with different dissolved substances... Then bring capillary tubes... We find the water has risen to a level higher than the level of the container... But did each tube distinguish an element it took... Or did every tube take from all elements... while they were dissolved... But plants are not like this... I plant colocynth... next to sugarcane... So this comes out sweet... And this bitter... This takes its elements and this takes its elements from the same soil... So there is choice... Hence appeared what is called the property of selection... Selection means choosing between alternatives... Meaning you leave this and take this... That is why God Almighty said ('Watered with one water but We make some of them exceed others in [quality of] fruit')... But the property of capillary tubes... deals with the whole liquid... without distinction... From here we know that the property is one thing... And the plant's choice of nutritional elements it wants or needs is another thing... We come next to inanimate objects... God Almighty says ('And in the mountains are tracts, white and red of varying shades and [some] extremely",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 27
  },
  {
    "serial_number": "1129115",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 27,
    "volume_number": 1,
    "text": "black')... This is the science of inanimate objects (geology)... which is now a science with volumes... Then after that, humans... All genres of existence... Then after that God said ('Only those fear Allah, from among His servants, who have knowledge')... Knowledgeable in what... In all of these... So the word 'scholars' (Ulama) was applied to those who reflect on God's creation... Whether inanimate, animal, or plant... And the active mind can reach these earthly sciences... Through observation and experimentation... The proof of that is if you review the history of any inventor of inventions in the universe that comforted people... You find they are the result of a human who observed accurately... And the matter did not pass him by like other people. Science's place is the laboratory, observation, and experimentation.\nWe exceed earthly science, but sometimes we exceed the subject of science... The place of experimentation and the laboratory... That is when I say, for example, the spirit was before matter... or matter before the spirit... This is researching the two elements of human composition whose creation we did not witness... And we cannot conduct an experiment on it... This enters into God's knowledge... He is the One who created... And He is the One who can tell us how creation took place... That is why God Almighty says ('I did not make them witness the creation of the heavens and the earth or the creation of themselves')... Thus, this is a matter in which human science cannot reach a result... Why? Because we did not attend the experiment... And did not see it with eyes... And cannot try it or perform it... But by ear we heard from God... And this is a matter unseen to us... And since the matter is unseen to us... God who created me is the One who tells me... How I was created... As for me",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 28
  },
  {
    "serial_number": "1129116",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 28,
    "volume_number": 1,
    "text": "I do not know how I was created... Hence, I cannot speak scientifically about the two elements from which a human is composed... And which came first... And if someone insists on researching this... He has occupied himself with knowledge that does not benefit him over ignorance that harms him... Because he will not be able to prove what he says scientifically... And experimentally I can hold matter and enter it into the laboratory... But I cannot hold the spirit and enter it into the laboratory... And science must be conducted on inert matter... that can enter the inert laboratory... And give inert facts... Isn't this the truth... The proof of that is that conflicting camps do not differ in doctrines of science... But they differ in doctrines of whim and theories... There is no American electricity... And Russian electricity... And there is no German chemistry... And English chemistry... All chemistry science in any country of the world is subject to what the unbiased experiment gives... Thus the result is one... Whether the laboratory is English, American, Soviet, or any laboratory in the world... But disagreement happens when doctrines of whim and theories intervene... If we come to doctrines of whim... Whim of the self... We find they are contradictory... Not different... But contradictory... This is the opposite of that... Capitalism and Communism... Faith... And atheism... And denial of religions. Why? Because the whim of the self entered here and corrupted the scientific issue and lost its facts.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 29
  },
  {
    "serial_number": "1129117",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 29,
    "volume_number": 1,
    "text": "If we take human creation for example... We take this creation from God... Who created... What did God Almighty say... He said I created you from dust... And said from clay... And said from altered black mud... And said from dry clay like pottery... These are not contradictions in creation... Or contradictions in the material of creation itself which is dust... Rather, God Almighty shows us the stages of this material from dust to clay to black mud to dry clay... They are the stages the human body passed through from dust until before the spirit was breathed into it.\nThe Disbelievers Testify to the Truth of the Quran\nWe return to the noble verse ('I did not make them witness the creation of the heavens and the earth or the creation of themselves, and I would not have taken the misguiders as assistants')... What is the meaning of the word 'misguider' (Mudill)... The word 'misguider' implies there is a case of truth... And there is a person who wants to mislead me and give me the opposite of the case... Meaning giving me untruth which is misguidance... This is the meaning of misguider... So God's saying ('and I would not have taken the misguiders as assistants')... Meaning that at the time of creation I did not ask for help, assistance, consultation... or advice... from these misguiders... Otherwise, if that had happened... Then they came to tell you how the heavens and the earth were created... And how you yourselves were created. You would have had an excuse to believe them... But since they did not witness creation... And I did not ask for their help... Then what they will tell you is not real, not correct... It is misguidance... And this is one of the miracles of the Quran... For God told us... there will be misguiders... And that these misguiders will try to tell you untruth regarding the issue of the creation of the heavens and the earth... And regarding the issue of creating",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 30
  },
  {
    "serial_number": "1129118",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 30,
    "volume_number": 1,
    "text": "humans... So do not believe them because I did not seek their help at the time of creation... And they were not present... If it had not happened that people came who mislead from the path of God... We would have said the Quran is incorrect... Because where are the misguiders... And if misguiders existed and addressed an issue other than the creation of the heavens and the earth... and the creation of humans... We would have said the Quran is incorrect... Because there are those who mislead from the path of God... But they do not address in what they say the issue of the creation of the heavens and the earth... Nor the issue of human creation... But the fact that misguiders came and addressed the issue of the creation of the heavens and the earth and the creation of themselves... And is matter before spirit... or spirit before matter... And the law of chance and Darwin's theory and so on... The fact that these came... And addressed the issue of the creation of the heavens and the earth... And human creation... This is proof of what came in the Quran about them... It was as if these misguiders who came to turn people away from God's path... performed a great service to the Islamic call... and the Quran... by proving with their disbelief the validity of the Quran... and the validity of its verses... Do you see a miracle greater than that... God uses the disbelievers who mislead from His path... and try to belie the Quran... God Almighty uses them to unknowingly prove the validity of the religion they try to destroy... And prove the existence of God Almighty... while they want to deny Him... So He says in a Quran revealed fourteen centuries ago... that there are those who will come to mislead from God's path... And take from the issue of the creation of the heavens and the earth and humans material for this misguidance... And all they will say is untrue... And I deny from now what they will say after hundreds... or thousands of years... And I tell you it is incorrect. Thus, the fact that these misguiders came is a proof for the Quran... And the fact that they spoke untruth and could not",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 31
  },
  {
    "serial_number": "1129119",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 31,
    "volume_number": 1,
    "text": "prove it practically... And started launching their theories... Each theory destroying the other... And they strive in attempting to destroy God's methodology... And we tell them you are proving it... Because God told us about you in the Quran fourteen centuries ago... And said you would come... And would do such and such in an attempt to mislead people... And destroy the Quran... Do you see the miraculousness... In using disbelievers to establish the issue of faith in the universe...\nDeath is the Reversal of the Process of Life\nSo the Creator of humans is God... And the Creator of the heavens and the earth is God... And this is an unseen matter we take from the One who created... However, when the Truth Almighty presents an unseen issue, He always illuminates the path of reason with an issue we sense and witness... that brings closer the unseen issue He speaks about... God created me from dust... from clay... from altered black mud... from dry clay like pottery... Then He breathed into me of His spirit.\nIf we take dust... then add water to it, it becomes clay. Then it is left for its elements to interact and becomes altered black mud like that humans use in their industries... Then it dries and becomes dry clay... These are the stages of creating the human body... And humans... Then He created them from clay... from the earth... If we come to reality... Let us ask ourselves: Where do the constituents of human life come from... From the earth... from clay... This fertile earth crust is what gives all the constituents of life I live... So what nourishes the material I was created from...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 32
  },
  {
    "serial_number": "1129120",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 32,
    "volume_number": 1,
    "text": "is from the same type as this material... which is clay... Scientists analyzed the human body and found it composed of 16 elements... The first is oxygen... and the last is manganese... And the fertile earth crust is composed of the same elements... So the elements of fertile clay are the same elements of the human body created from it... This is the first miracle... And this is a laboratory experiment whose goal was not to prove the correctness of the Quran or its incorrectness... But it was research for the sake of earthly science.\nGod Almighty made... death a proof for the issue of creation... Death is the reversal (undoing) of life... Meaning life exists... And I undo it with death... And undoing anything comes opposite to building it... If we want to build a building, we start with the first floor... And if we want to demolish it, we start with the last floor... If I arrived at a place and wanted to return... I start from the last point I reached... It represents the first step in returning... We know nothing about the creation of life... Because we were not present at the time of creation... But we witness death every day... And death is the undoing of life... So it happens in reverse to it... The first thing that happens in a human at death. The spirit exits... Which is the last thing that entered it... First thing is the exit of the spirit... So the last thing that entered the body is the spirit... Then the stages of reversing the creation process begin... The body stiffens... This is the dry clay (Salsal)... Then it rots and becomes decayed matter... This is the altered black mud (Hama' Masnun)... Then the water evaporates from the body and the clay becomes dust... And returns to the earth... So the stages of annihilation that I see and witness every day are the opposite of the stages of creation... There is truthfulness in the material of creation... And truthfulness",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 33
  },
  {
    "serial_number": "1129121",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 33,
    "volume_number": 1,
    "text": "in the manner of creation... As is clear before me from the issue of undoing life... which is death... Another thing... God Almighty says ('And I breathed into him of My spirit')... And the meaning of blowing (Nafkh) is breath (Nafas)... Meaning there is a breath that went out from the Blower to the blown into... So life began... And how does life end? With the exit of this breath... If you doubt that any person has departed life... It suffices to be told that he is not breathing... To be certain he died. So the entry of life into the body is the entry of this breath... Confirming His Almighty's saying ('And I breathed into him of My spirit')... And its exit is the exit of this breath... So the matter is certainly as God said...\nIf we want more miraculousness... Let us look at what the Quran said in embryology... The science of embryo formation in its mother's womb... Did anyone address this issue before the Quran or the era of the Quran... Or a period after... Never... The first to speak about it is the Quran giving me what is hidden from me... Because my creation is unseen to me... The fact that God Almighty comes in His Quran and gives me the stages of embryo formation... This is a sign of His greatness, power... and knowledge...\nGod says regarding the stages of the embryo: ('...Then We placed him as a sperm-drop in a firm lodging. Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh')... Embryology was only known to people recently... And the Quran, as I said, is speech recited as worship... No alteration in it or change... Meaning the issue it mentions will remain as it is until the end of the world... When the Quran comes and informs of this, it is as if it challenges science and scientists... Until the Day of Judgment... Saying to them, this is",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 34
  },
  {
    "serial_number": "1129122",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 34,
    "volume_number": 1,
    "text": "the formation of the embryo in its mother's womb... And I mention it to you and mention its stages in detail... No human witnessed it until the hour of this Quran's revelation... Nor even hundreds of years after its revelation... But I record it so you know when I give you knowledge by which you can know the stages of the embryo... To know that the Speaker is the Creator... Because no one could say these words... And challenge with their validity throughout the ages and penetrate the veils to narrate something humanity did not know or was aware of... Except that it be God... Otherwise, how could any human... any mortal, no matter how much knowledge he attained, be secure that after tens of years... or hundreds of years... something contradicting this talk would not come... And proving its incorrectness... If the speech here was not from God... And if it was not with complete certainty... Then the Quran would have provided with it the means of its own destruction... It would have been sufficient for a person to say the Quran says this about the stages of the embryo... And scientific progress has proven it incorrect... It would have been sufficient for this to be said to destroy the issue of religion from its foundation... And the Quran would have given the disbelievers the strongest weapon to destroy it with... But the one who revealed embryology is completely certain that what He says is the Truth... And that the development of science, whatever comes, will not come to contradict this speech... The latest research on the embryo has proven... the correctness of what the Quran mentioned fourteen centuries ago... And did not differ from it... in any detail... Although this was an unseen matter... And a matter no human spoke about before the Quran came... Yet the Quran mentioned it in detail... And defined its stages... And science came afterwards to prove this fact... So the Speaker of the Quran must be God... Because the One who knows with certainty is God alone...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 35
  },
  {
    "serial_number": "1129123",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 35,
    "volume_number": 1,
    "text": "God's Signs on Earth\nWe come after this to points I will pass over quickly... Because God's signs are very many on earth... And all of them speak of the Quran's miraculousness... God Almighty says ('Every time their skins are roasted through We will replace them with other skins so they may taste the punishment'). This verse is about the disbelievers on the Day of Judgment... And the goal of it is for God to say that the punishment will continue in the Hereafter... They used to say that sensation centers are located in the brain... And that the skin does not have sensation centers... This was the talk until a short while ago... As for the days of the Quran's revelation, no one knew anything about that at all... Then God Almighty comes and says ('Every time their skins are roasted through We will replace them with other skins so they may taste the punishment')... So punishment was connected to the skin... And the sensation of punishment comes from the skin... Then science finally discovers that pain sensation centers are actually located in the skin... And they are what sense the punishment.\nWe come to the Quran and find it was perhaps the first book in the whole world... that informed: that there is something smaller than the atom... Almighty says ('So whoever does an atom's weight of good will see it, And whoever does an atom's weight of evil will see it')... Because the atom is the most precise scale in the world... Then He comes in another verse and says about the atom ('And not smaller than that nor larger except in a clear register'). So there is something smaller than the atom... And this thing is recorded in a book with God and written down... And God says ('So I do not swear by the Lord of [all] risings and settings')... Which risings and which settings in the era of the Messenger of God, peace be upon him, when all people knew about the sun was that it rises from a place... and sets in another place... So they say",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 36
  },
  {
    "serial_number": "1129124",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 36,
    "volume_number": 1,
    "text": "for example, the sun rises from the direction of this mountain... and sets from the direction of this tree... But now every country has a rising and a setting... The sun rises for me from the direction of the mountain... And after minutes it rises in another country... And after minutes in a third town... And after minutes in a fourth town... And it sets from there and after minutes sets from my town... And after minutes sets from a neighboring town... Meaning it has risings and settings... And prayer for example... Prayer is continuous on earth day and night... The time of Dhuhr for example is with me... And after minutes in another town... And after minutes in a third town... And half the earth is sleeping... And the second half is glorifying God... Some people are praying Fajr... And at the same moment others are praying Dhuhr... And at the same moment others are praying Asr... And at the same moment others are praying Isha... Prayer is here in Cairo for example and after two minutes in Banha... And after another two minutes it is in Damanhur... And after two minutes it is in Alexandria... And after two or three minutes it is in another town... And so on... Such that the mention of God does not cease from the whole world for a single second.\nGod Almighty comes to show us how He treats another issue... Treating it in a way suitable for the minds of those contemporary to the Quran's revelation on earth... And the thinking of all future generations... He comes and says ('And the horses, mules and donkeys for you to ride and [as] adornment')... Meaning while talking about His blessings He defined for humans what He created for them to help them move on earth... But is this the end of the line... If I were thinking with the thinking of that era... The era in which the Quran was revealed... I would have said it is the end of the line... But God knows that man will ride the car, the rocket, and the airplane... And that every generation will differ from the other generation in means of transportation... So how does He record that without saying what is above the minds of people",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 37
  },
  {
    "serial_number": "1129125",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 37,
    "volume_number": 1,
    "text": "at that time... which might remove faith from their souls... God Almighty says ('And the horses, mules and donkeys for you to ride and [as] adornment And He creates that which you do not know')... Do you see the eloquence of the Quran... It recorded God's knowledge and at the same time kept it hidden from those contemporary to the Quran's revelation... ('And He creates that which you do not know')... Here it means that what I mentioned is not the end of the line. Therefore, I tell you from now that these are your means of transportation... But I will create in future generations what you do not know... I will create for generations after them what future generations do not know... And so on until the end of the world... From here the Quran recorded the development that will happen... And at the same time kept its phrasing at the level of the era in which it was revealed.\nThe whole world comes... And accuses women of having a part in giving birth to females and males... And God Almighty informs that He created females and males from the man's sperm... And the woman has no part in that... Then science finally comes... And discovers this cosmic fact... And announces that the two elements of humanity, male and female, are present together in the man... And that gender determination comes from the man and the woman has no part in it... And God Almighty says ('And how many a sign within the heavens and earth do they pass over while they, therefrom, are turning away')... Meaning there are wondrous things God created in the heavens and earth requiring man to look closely at them... But he does not look closely at them... Even though God Almighty asked us to look closely at His signs... And use the mind's activities to discover the universe's activities...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 38
  },
  {
    "serial_number": "1129126",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 38,
    "volume_number": 1,
    "text": "Chapter Three\nThe Quran and Science\n(The miracle in the Quran is that it uses words that express accurately what is intended... And do not clash in their concept with any element... God says ('And the earth We have spread out')... And that matches what the eye sees since eternity... that the earth is spread out... But at the same time it is the biggest proof of the earth's sphericity... And describing the mountains as passing like clouds... confirms to us that mountains do not move by themselves... but rotate with the earth's movement... just like clouds must be pushed by winds to move... And when God says ('Nor does the night outstrip the day') He denies that day precedes night... or night precedes day... Meaning they exist together on the surface of the globe... No race between them... And when the Quran speaks about the atom... It mentions what is smaller than the atom before the world knew it...)\nWhen the Quran was revealed, it had more than one miracle... It challenged the Arabs in their rhetoric... Then it tore through the three barriers of the unseen... It tore through the veil of past time and narrated to us in detail the history of messengers and events of nations preceding us... And challenged in them... Then it tore through the veil of place... And narrated to us what goes on inside the souls of disbelievers and those fighting Islam and what they plot for Muslims... It narrated to us what goes on inside their souls... Which their lips did not utter... And not one of them dared to belie the Quran and say my self did not whisper this... Then it tore through the veil",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 39
  },
  {
    "serial_number": "1129127",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 39,
    "volume_number": 1,
    "text": "of the near future... And predicted events that would happen after months... And events that would happen after years and challenged... And everything the Quran predicted happened... This is what I explained in the previous chapter in detail... And gave examples for.\nThen after that, the Quran tore through the veil of the distant future... To give coming generations of its miraculousness what makes them believe the Quran and prostrate to its Speaker who is God... But the Quran was revealed in a time where if these future miracles came in detail, a number of believers would have disbelieved... And others would have turned away... Because the talk was above the capacity of minds at that time... Hence, so that the believer does not leave his faith... And the miraculousness continues... The Quran came with the conclusions of theories... With the peak of cosmic laws... If recited to believers at that time... They passed over them... And did not pay attention to their true scientific significance... And if said afterwards to coming generations... They knew the miraculousness in them... And said this talk cannot be said by a person who lived thousands of years ago... Thus this Quran must be truth from God... And its Speaker is God the Creator.\nA point remains... Does this apply to rulings (Ahkam)? The Answer: No... Religious rulings of 'do' and 'do not do' were revealed complete, clear, with no ambiguity, no addition, no alteration, and no obscurity... God's methodology is complete, explained by Hadith Qudsi and Prophetic Hadith... And explained and interpreted in the era of the Prophet, peace be upon him, completely... So that it became clear to every human wanting to worship God... And live on earth according to God's laws: 'do' and 'do not do' came clear and were completed and interpreted in the era of the message... And the Halal became distinct... And the Haram distinct... And the religion distinct.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 40
  },
  {
    "serial_number": "1129128",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 40,
    "volume_number": 1,
    "text": "As for God's signs in the universe... We notice they were not fully interpreted in the era of the Prophet, peace be upon him... So they would not be binding on Muslims... Why? Because they have a giving that renews in every generation... These signs are what we will talk about some of... The Quran challenged the Arabs with linguistic miraculousness... Asked them to bring the like of the Quran... Then increased the challenge and said a surah like it... But the challenge to the world cannot be linguistic... For languages are different... So with what did He challenge them... With science... And the challenge was absolute... Until the Day of Judgment... He said you all will not be able to create anything... Until the end of the world... Then He challenged them to create what?! To create a universe like the one He created... No... To create a solar system like the tens of solar systems present in the universe... No... To create a sun or moon or star... No... So did He challenge them to create the globe for example... Never... He must have challenged them to create a human... Never... He challenged them to create flies... As if He says I am God telling you I will give you knowledge... And show you My signs in the horizons... But you will not create a fly... Even if all scientists of the earth in all ages gathered for that... Thus God challenged all humanity until the Day of Judgment to create a fly... And said that the science you will worship besides God... And which you will believe in... This science and all those upholding it... Will not be able to create a fly even if they gathered... Indeed, those you call upon besides Allah will never create a fly, even if they gathered together for it... Then God Almighty said: ('Weak is the pursuer and pursued')... And added ('They have not appraised Allah with true appraisal')... And the wonder is that man has reached the moon... And might reach Mars... And might explore further than that... But he is unable to create a fly's wing until now... And it is a very weak request relative",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 41
  },
  {
    "serial_number": "1129129",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 41,
    "volume_number": 1,
    "text": "to God Almighty's power in creating millions of creatures. Therefore God said ('Weak is the pursuer and pursued')... Then Almighty added ('They have not appraised Allah with true appraisal') meaning God Almighty's power exceeds all limits and imaginations that might cross your minds... And you do not know God's power... Then God challenged after that in His Quran... Challenged regarding the continuity of life... Water from which every living thing was created... God Almighty said ('And have you seen the water that you drink... Is it you who brought it down from the clouds, or is it We who bring it down?') And Almighty said ('He sends down the rain') meaning God Almighty is the One who sends rains to you... And water comes pouring to water the whole world... Humans, birds, beasts, plants, and every living thing... This water from which all humanity gulps down... You find man unable to make a river... Although the elements forming water exist in the universe... Before scientists... And vast areas of deserts on earth need a drop of water... Then God Almighty challenged after that... Challenged us to escape death... He said ('Wherever you may be, death will overtake you, even if you should be within towers of lofty construction')... Meaning God Almighty challenges... No matter how much science you reach... You will not be able to escape death... You say in earthly science that death happens because of such germs and such diseases etc... Fine, build a tower and put a human in it... And keep away from him all dangers which in your opinion and view and science cause death... So he does not fight nor walk anywhere to be injured in an accident... Does not breathe polluted air but breathes pure air... And eats food sterilized by the latest health means... And drinks water without a single germ...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 42
  },
  {
    "serial_number": "1129130",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 42,
    "volume_number": 1,
    "text": "And the atmosphere he lives in is purified to the highest degrees of science... Here we would have removed from this human all causes of death we know... Yet can immortality be written for such a human even though we prevented all apparent causes of death from him... The answer of course is impossible... Because God is the One who gives life and causes death... And causes do not act by themselves but act by God's will.\nThen God challenged the whole world in the Quran with five unseen matters... ('Indeed, Allah [alone] has knowledge of the Hour... and sends down the rain and knows what is in the wombs... And no soul perceives what it will earn tomorrow... And no soul perceives in what land it will die...') God challenged with these unseen matters... Challenged all humans... So the Quran, just as it challenged the Arabs in language when it was revealed... Carried challenges to the whole world... And said to them: You will not reach such and such etc... Tens of challenges the Quran cited for all humanity... It said you will not reach such... You will not do such... You will not create such... And these challenges were for all humanity... And for all ages.\nThe Quran Informed Us of the Universe's Facts\nAfter God challenged all humans... He said: ('We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth'). He said ('in the horizons') meaning God Almighty will reveal to His servants some of His signs so it becomes clear to them that this Quran is the truth... And how does it become clear to them that it is the truth... Because the facts of the universe... which they will reach after hundreds or thousands of years",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 43
  },
  {
    "serial_number": "1129131",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 43,
    "volume_number": 1,
    "text": "with the activities of the mind... they will find the Quran has alluded to them... and then it will become clear to them that this Quran is the Truth... because the One who spoke is Allah... and the One who created is Allah. Hence, it came in the Quran that the Earth is spherical... and that it rotates... and it contains the manner of man's creation... and how he learned speech... and it states there is something smaller than the atom... and it contains a precise description of what happens to the fetus while in its mother's womb... and it states that night and day exist on Earth simultaneously... and many other facts that space does not allow us to discuss... However, before we proceed with this subject, we must define the meaning of Science... Science must pass through two stages... the stage of Conceptualization (Tasawwur) and the stage of Verification/Assent (Tasdiq)... The meaning of Conceptualization is that before we speak about any issue, proving or negating it... we must have a concept of the terms from which we will form our speech... Meaning, the word \"sky\" for example... what does it mean... and the word \"earth\", what is its meaning... and what is the meaning of the word \"blue\" and so on... This is Conceptualization... and there is no attribution (Nisba) in this... But when Attribution comes... which is to judge one thing by another... it must be preceded by the knowledge of Conceptualization. We move after that, very briefly, to the stage of Verification... So when you tell me about a scientific fact, I ask you: Is it actual/real? If you say yes, I ask you: Are you certain of it? If you say yes... I ask you: Can you provide evidence for it? If you say yes... then this is Science. So, Science is an attribution that is factual, certain, and supported by evidence... But suppose I am certain of the attribution... yet it is not factual... This",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 44
  },
  {
    "serial_number": "1129132",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 44,
    "volume_number": 1,
    "text": "is Ignorance... an attribution that one is certain of, yet it is not factual... The bane of the entire world is ignorance... For he who does not know an attribution or a scientific fact can learn it... but the calamity lies in the one who is certain or believes in a false issue... then raises the world trying to prove something that is not real... This is what humanity suffers from... And if we speak about the Quran and Science... then Science here refers to human knowledge found in the various corners of the universe... (They know what is apparent of the worldly life). Sometimes we claim a scientific fact... which is not a scientific fact... or we claim a Quranic fact which is not a Quranic fact... The first is claiming a scientific fact while it is merely a theory and conjecture... But regarding our claim of a Quranic fact which is not a Quranic fact... what is it? For example, a person comes and says the Earth is flat... and uses as evidence that Allah Almighty says (And the earth We spread out)... meaning We flattened it... because \"Al-Madd\" means flattening/spreading... And he understood this to be a Quranic fact, to the point that after man went outside the Earth's atmosphere and saw it as spherical... this man refuses to believe science... and says no... the Earth is flat... thus the Quran said... and anything else is disbelief. We say to him: You have erred in understanding the Quranic fact... and the evidence you brought does not serve what you claim... rather it is against what you claim... For if the Earth were flat (mabsuta), it would not be outside of certain shapes... either square... or triangular... or rectangular... or parallel... or trapezoidal... or a shape with different sides... In short, I leave it to you to imagine any position for the Earth other than the position of a sphere... or the shape of a sphere.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 45
  },
  {
    "serial_number": "1129133",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 45,
    "volume_number": 1,
    "text": "\"And the earth We spread out\" while it is a sphere. Therefore, as long as the Earth is flat (in his view)... it must have a boundary... so if you come to the end of the surface... you must reach an edge... But Allah Almighty says (And the earth We spread out)... And the meaning of \"We spread it out\" is that wherever you go on the surface of the globe... you see it extended before you... meaning flattened/spread out before you... If you go to the North Pole, you see the Earth spread out... and if you speed to the South Pole, you see the Earth spread out... and if you go to the Equator, you find the Earth spread out before you... Anywhere we go, we see the Earth spread out... And this cannot happen unless the Earth is spherical... Therefore, the saying of Allah Almighty (And the earth We spread out) is evidence for the sphericity of the Earth... But a human erred and interpreted that term as evidence that the Earth is flat... and concluded that this is a Quranic fact... while it is not a Quranic fact. So when it was proven that the Earth is spherical, an illusory conflict began between a cosmic fact... and a Quranic fact... And here emerges the role of ignorance in attempting to undermine the Book of Allah... Had some people contemplated a little, they would have known that the sphericity of the Earth and the rotation of the Earth are present in the Quran... and this is what we will return to in another place... Likewise, for example, the saying of Allah Almighty (And He knows what is in the wombs). A person comes to say that the meaning of \"And He knows what is in the wombs\"... is that Allah knows whether the child in his mother's womb is male or female... So if scientific activity comes along stating that they can, by some method, know before the birth of the newborn by a period whether it is male or female... some say",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 46
  },
  {
    "serial_number": "1129134",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 46,
    "volume_number": 1,
    "text": "that (And He knows what is in the wombs) has exited the five unseen things which Allah Almighty reserved for His knowledge to challenge all of humanity... And here the argument begins... But the question that should have been directed to the sayer of such words is: Who told you that knowing the gender of the fetus, whether male or female... is the meaning of the noble verse (And He knows what is in the wombs)? Who restricted the word (Ma - what) to male or female... while it is absolute in generality... You claimed that (Ma) is male and female... and said that this is the Quranic fact... But the indication of (Ma) is much more than that... Male and female is one fact... and tall or short is another fact... and dark or white or blond is a third fact... and happy or wretched is a fourth fact... and intelligent or stupid is a fifth fact... rich or poor is a sixth fact... and sick or healthy is a seventh fact... and I can go on to hundreds... nay, thousands of facts which Allah Almighty expressed with the word (Ma) in the noble verse (And He knows what is in the wombs). Furthermore, that which science attempts to reach through analysis... is still in the phase of guessing and has not reached certainty yet... For regarding the girl and boy... there is a 50%... pre-given ratio... meaning if you see a pregnant woman... and say she will give birth to a girl... your statement is truthful by a ratio of 50%... Science came to add to this 50%... a 20%... or 30% only... But let science tell us what the descriptions of the fetus are... or anything about it that does not have a pre-given ratio... However, here I would like to pause a little around the noise raised by some scientific theories... For example, when experiments were conducted on what they called producing children in test tubes of selection... and talk began about children who would be born from test tubes...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 47
  },
  {
    "serial_number": "1129135",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 47,
    "volume_number": 1,
    "text": "to the end of this talk... then it ended in nothing... and into abject failure... Likewise, the talk about creating living matter and so on... The Quran has challenged man to create a fly... Allah gave knowledge to man to reach the moon... but He did not give him the knowledge to create the wing of a fly. The Collision Between the Quran and Science: Therefore, the collision occurs between the facts of the universe and the Quran... if there is a collision... it exists when we claim a scientific fact in the universe... and it is not a scientific fact... or we claim a Quranic fact and it is not a Quranic fact. It is impossible to ever clash with a scientific fact proven by experiment... because the Speaker of the Quran is Allah. And the Doer (Creator) is Allah. If we conclude this... we must clarify a small point before we proceed with our talk... Those who say that the Quran did not come as a book of science... are truthful... Because it is a book that came to teach me rulings... and did not come to teach me geography or chemistry or physics... And at the same time, when we say that the Quran mentioned miracles to me that science has not reached some of yet... this is also true... These miracles are what the facts of the universe eventually lead to... For the Quran, even if it did not come to teach me medicine for example... yet it touches upon a medical issue and informs me of its intricacies... and medical science does not reach it except after hundreds or thousands of years... It comes in geography, for example, and touches upon an important issue we do not know except after hundreds of years... And likewise in all the sciences of the world... Meaning that what the facts eventually lead to... the basic issues of the universe",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 48
  },
  {
    "serial_number": "1129136",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 48,
    "volume_number": 1,
    "text": "...the facts upon which the universe was created, the Quran touches upon them as scientific facts, whether you reached them by science or did not reach them... Let us begin by reviewing some of these facts. The First Fact: The sphericity of the Earth... I believe that in the era of the Prophet, peace be upon him, no human knew anything about the sphericity of the Earth... or that had not reached anyone's knowledge... Here comes the Quran and says (And the earth We spread out). Note the precision of the Quran's expression in its words... It chose the only word suitable for the era in which it was revealed and the coming eras, for the word \"We spread it out\" (Madadna-ha) gives the meaning to both together. When He says (And the earth We spread out) meaning We flattened it... no problem arises because the Earth appears before people as flat at that time... But as time passes and it is proven that the Earth is spherical... we find this word is perfectly suitable which precisely describes the sphericity of the Earth. Then contemplate the saying of Allah Almighty (He wraps/coils (Yukawwiru) the night over the day)... Why did Allah Almighty use the word \"Yukawwiru\"... Why did Allah use the term \"Yukawwiru\"... and did not say He spreads the night and day... as long as the Earth is flat... or changes the night and day... or any other term... If you brought something and wrapped it around a ball (Kura)... you say you \"Kawwarta\" (coiled/wrapped) this cloth for example... meaning you made it take the shape of the ball it is wrapped around... And if you wanted a person to make something for you in the shape of a ball... you say to him take this and \"Kawwirhu\"... meaning make it in the shape of a ball... And the meaning of Allah Almighty's saying \"He coils the night over the day\"... means He makes them surround the globe of the Earth... And from the miracle of the Quran is that the night and day are coiled around the globe of the Earth at all",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 49
  },
  {
    "serial_number": "1129137",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 49,
    "volume_number": 1,
    "text": "times... Meaning that Allah did not say He coils the night then coils the day... but He said He coils the night *over* (Ala) the day. The use of the word \"over\" (Ala) here deserves a pause... to visualize the extent of its applicability to the sphericity of the Earth... (He coils the night and the day) meaning they exist at the same time around the globe of the Earth. This is what the Quran foretold fourteen centuries ago and did not reach human knowledge except in the recent period. The issue of the Earth's sphericity was touched upon by the Quran in more than one place... Why? Because it is a major cosmic fact... Then let us contemplate after that His saying Almighty (Nor does the night outstrip the day). What is the meaning of the noble verse \"Nor does the night outstrip the day\"... It means He is replying to them regarding an issue in their era to correct it for them... For they say that the day precedes the night... The day begins with sunrise and ends with sunset, then after that comes the night, meaning the day precedes the night... So Allah Almighty comes and says (Nor does the night outstrip the day)... From here He replies to their saying that the day precedes the night saying No... Neither does the day precede the night nor does the night precede the day... And this is an announcement to them that the Earth is spherical. And that night and day exist at one time on its surface... For if the Earth were flat, the matter would not go beyond two cases... The first case... that Allah created the sun facing the flat Earth... and in this case, the day would exist first... then Allah makes the sun set so the night comes second... Or that He created the sun not facing the surface of the Earth... and in this case, the night would exist first... then the sun rises on the surface so the day comes... The matter does not go beyond these two things... So when Allah comes and says (Nor does the night outstrip the day), meaning that He denies entirely that the day",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 50
  },
  {
    "serial_number": "1129138",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 50,
    "volume_number": 1,
    "text": "precedes the night... or that the night precedes the day... since neither of them precedes the other since when... since the beginning of the Earth's creation... or since Allah created the Earth... And this can never happen in the world of volumes unless the Earth is spherical... So when Allah created the sun and the Earth, night and day existed together... So the half of the Earth facing the sun became day... and the other half became night... then the Earth rotated... so the night became day... and the day night and so on... Thus the noble verse (Nor does the night outstrip the day)... gives me that the Earth is created in this spherical image. Rotation of the Earth in the Quran: We come after that to another issue... which is the rotation of the Earth... Can anyone judge a place he is sitting in... while the whole place is moving with him in it... You cannot perceive that it is moving... Why?... Because you do not know the movement of the moving object unless you measure it against something fixed, and nothing is fixed because the whole Earth rotates... and the locations on its surface are fixed [relative to each other]... For example, when we sit in a completely closed room which is rotating with all of us... and our location in it is fixed and does not change... we do not feel the rotation of this room unless we open a window for example... and measure the movement of the room against something fixed like a pole for instance or a tree... Hence we cannot know the movement of the moving object unless we measure it against something fixed... And who can measure the Earth as [a moving object] against something fixed to know its movement... No one can... As long as I do not perceive the movement... Allah Almighty comes to tell me (And you see the mountains, thinking them rigid, while they pass as the passing of",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 51
  },
  {
    "serial_number": "1129139",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 51,
    "volume_number": 1,
    "text": "clouds). \"Thinking them\" means that was a supposition/assumption and not reality... because these mountains that you see before you as rigid, fixed, not moving, are not so... For Allah wants to tell us that these firmly rooted mountains, the pegs of the Earth, which appear before you as rigid, fixed, solid, which you cannot crumble or remove... these terrible mountains pass before you as the passing of clouds and you do not know... Then when you marvel and say while hearing this verse: How do these mountains pass as the passing of clouds... when they are fixed before me like this not moving from their place... Allah Almighty says to you... Do not marvel... [It is] the work of Allah, who perfected all things... If a sayer says that this happens in the Hereafter... we say to him that the Earth will not be the same Earth... and that the mountains will sway/move... confirming His Almighty's saying: The Day the earth will be changed to another earth, to the end of the noble verse... Furthermore, is there \"supposition\" (Hasban) in the Hereafter... Never... In the Hereafter we see facts... We see everything therein with the eye of certainty... And we know everything for what it really is... Heaven and Hell. Reward and Account and everything... So the saying of Allah Almighty (Thinking them rigid)... means... that you, while in front of these mountains, are deluded... because you think they are rigid while they pass as the passing of clouds. Then comes after that Allah Almighty's use of the phrase \"passing of clouds\"... And as I said, the choice of words in the Quran is very precise. Passing of clouds. Why did Allah Almighty not say for example the passing of winds... or passing of storms... or passing of waves... or any other term... Because clouds do not move by themselves... but are pushed",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 52
  },
  {
    "serial_number": "1129140",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 52,
    "volume_number": 1,
    "text": "by a self-power which is the power of the wind. So when clouds move from one place to another... they do not launch by themselves and go... rather the winds come and carry them from the place they are in to another place and so on... It is as if Allah Almighty wants to say to us: Pay attention... the movement of the mountains is not a self-movement like the movement of the Earth... nor a self-movement like the movement of winds... For they do not move by themselves... meaning they do not transfer from their place on the surface of the Earth to another place on the surface of the Earth... No... their place is fixed... but they pass before you as the passing of clouds... meaning they move with the movement of the Earth... exactly as the winds move the clouds... Otherwise, why did Allah not say... And you see the mountains thinking them rigid while they walk... or while they run... or while they move... or while they pass from one place to another... Never... He excluded all words that give the mountains self-movement... Meaning that what moves essentially is the Earth... and the mountains follow this movement while passing before you as the passing of clouds which possess no self-movement... Do you see the precision of expression... and the precision of portraying the Earth's rotation in the Quran... Was it possible for Muhammad to say this speech... or reach this science... Is this not considered a miracle when scientists say that the Earth rotates around itself, so we say to them: The Quran touched upon this fact... nay, gave details in it... that everything on Earth follows the Earth in its self-movement, including the huge, towering mountains... That is in this world of course... because in the Hereafter Allah blows away the mountains entirely... and there is no supposition... but there is certainty... So the fact that the Quran pierces the veil of the future... and after that touches upon cosmic issues proving the activity of the mind after fourteen",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 53
  },
  {
    "serial_number": "1129141",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 53,
    "volume_number": 1,
    "text": "centuries. This indicates that the Quran pierced the veil of the future for all humanity... But some people argue about the creation of man... which is an attempt to mislead... and deny the signs of Allah in the universe... This is also from the miracle of the Quran... The existence of these misleaders in the world and their attempt to mislead... and fight the religion of Allah... is a Quranic miracle because Allah Almighty informed us about them before they existed... and I explained that in detail in the second chapter.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 54
  },
  {
    "serial_number": "1129142",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 54,
    "volume_number": 1,
    "text": "And We have not sent you, [O Muhammad], except as a mercy to the worlds (The month of Ramadan... is the month of the Quran... and it is the month of Mercy, Forgiveness, and Repentance... It is the month in which the Message descended upon Muhammad, peace be upon him, and it is a mercy... a mercy to the worlds... confirming His saying Almighty (And We have not sent you except as a mercy to the worlds...) And this subject is about interpreting the meaning of this noble verse). It is noted that the procession of Messengers when Allah Almighty sends them to His servants... every Messenger comes with a mercy... How is that... If we look at the first human... and look at the world now... we come out with an important fact... that what increases in the future... if you return to it in the past, it decreases... If we look at the population for example... and their multiplication... we find that in the seventies they increased over the sixties... and in the sixties they increased over the fifties and forties... Thus multiplication increases with the passing of years... So if we walk in a reverse line... opposite to time... then this line must decrease... and continue to decrease... until we reach the starting point... a point from which this human multiplication we witness must have started... And this point is the beginning of creation... or Adam and Eve... Because the descending graph we will prepare about population increase must lead us to the starting point... And for these people to multiply... and increase in number... there must be a male and a female... For if the beginning was a male alone or a female alone...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 55
  },
  {
    "serial_number": "1129143",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 55,
    "volume_number": 1,
    "text": "this multiplication would not have happened... And this is what the Holy Quran informed us about regarding the beginning of creation... Created you from one soul... and created from it its mate... and dispersed from both of them many men and women... Dispersed from the male and female... And from their offspring were men and women who also performed the process of dispersing... And thus every male and female through whom a new creation was added to humanity until this multiplication occurred... And from their offspring were men and women who carried out this multiplication process... And over thousands of years. Or tens of thousands of years, humanity reached this huge number of creation living on Earth now... We come after that to a very important point... That this human whom Allah created... who populated the Earth... and established all that we see now of civility and civilization... there had to be some means of understanding between these humans... For without a means of understanding, no civilization can be established... nor can true coexistence take place... And this means was language or the word, as scientists say, is the daughter of imitation... What the ear hears, the tongue speaks... And if a human is born deaf not hearing... he does not speak... So language is not a blood type... nor is it environment... nor is it race... nor is it heredity... Rather, what the ear hears, the human speaks... If I brought a French or American or Dutch or African human... or from any nationality in the world... brought him as a child and placed him in an environment that speaks Arabic... and left him without hearing other than the Arabic language... he would speak this language... even though his origin, race, blood, and heredity are not Arabic... And if the child was in an Arab country...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 56
  },
  {
    "serial_number": "1129144",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 56,
    "volume_number": 1,
    "text": "and of Arab origin... and does not hear the Arabic language... he will speak the colloquial language his ear heard. What the ear hears, the tongue imitates... So there is no use ever in uttering words that have indication and meaning unless they were heard first... If you brought a foreigner who has not heard the Arabic language... and uttered Arabic words before him... he understands nothing... And the same applies to the Arab before whom you utter non-Arabic words... he understands nothing either. And He taught Adam the names - all of them: We return after that to the beginning of the world... If the world started from a male and female... as we demonstrated... how did they speak... how did they understand each other... They must have heard something their ears got used to... so their tongues pronounced it... and they spoke with it... But how did they hear when they are the first and the beginning... and from whom did they hear... Thus there must be a hearing not from their own kind... because they are the origin... in the human race that he who does not hear does not speak... as we all know... Therefore, another teacher must have taught them... So belief in the existence of Allah is a linguistic necessity... Because Allah Almighty must have spoken to Adam so he heard... and spoke to Adam [and] Eve so she heard... and language began... the language of discourse and understanding transmitted from what Allah taught them. This is a fact as long as all this humanity started from a male and female... and there was understanding between this male and this female... they must have heard speech.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 57
  },
  {
    "serial_number": "1129145",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 57,
    "volume_number": 1,
    "text": "Here comes the saying of Allah Almighty... (And He taught Adam the names - all of them). To explain to us what happened... So Allah Almighty taught Adam the names... meaning the language with which he converses and understands... and speaks... And from the miracles of the Quran is that this is still followed until now despite the passage of this long time... and this huge scientific progress in learning... For we now, when we want to teach a child to speak, we start by teaching him names... We do not start by teaching him events (verbs)... or anything else... Rather we teach him names first... The first thing we say to him is this is a pen... and this is a notebook... and this is a lion... and this is a cup... and this is food... and this is a road... and this is light... and this is darkness... We teach him names first... And after he learns names, derivations from names... or taking events from them becomes an easy process... So when He Almighty says: (And He taught Adam the names - all of them)... we must know that Allah taught Adam the language of speech first... and that the language of speech until our era begins with teaching names as Allah Almighty informed us in the Holy Quran... Religion began with the creation of man. Then we proceed after that... after Allah Almighty informed us of the story of teaching Adam the names... so he would know how to speak and understand on Earth... He said... (Get down from it, all of you) which is the mission for man... which Allah Almighty defined by His saying (Indeed, I will make upon the earth a vicegerent)... And Allah Almighty completed His speech to Adam saying: (And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve)... And in another verse",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 58
  },
  {
    "serial_number": "1129146",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 58,
    "volume_number": 1,
    "text": "(And whoever follows My guidance will neither go astray nor suffer). So after Allah created man... and taught him the means of expressing what is in himself to others... Religion or the Methodology came... This religion is to organize the movement of man's vicegerency on Earth... And it is assumed that Adam conveys the religion to his children through what Allah taught him of the language of speech... and that the sons in turn convey the religion to their sons and so on... However, the science of religion differs from all other sciences... Because education in other aspects... or in worldly sciences... like chemistry, physics, engineering, and others... does not require man to change his behavior in life... according to what he learned... meaning it is sufficient to comprehend the theory, understand it, and apply it, but regarding his life he is free in it... he does what he wants... and does not do what he wants... Meaning I do not ask him for anything that restricts his movement in life... But when I teach him religion... I teach him something that affects his behavior and life... and I say to him: Do this and do not do this... And the word \"do not do\" comes to clash with the desire of the self and its lusts... So the mission of other sciences is to transfer the known to the learner... And I demand man to mold his movement in life according to what Allah decided of \"do\" and \"do not do\"... Therefore when it is said that religious science has failed... it does not mean that people do not know the rulings of religion... but it means they do not apply these rulings. And given that religion intervenes in the movement of life to organize it with \"do\" and \"do not do\"... and the self always does not accept what restricts its whims and lusts... so the sons who heard from Adam and those after them from their offspring begin",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 59
  },
  {
    "serial_number": "1129147",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 59,
    "volume_number": 1,
    "text": "they begin to forget something of what Allah commanded. And with the passage of time, this forgetfulness and laxity in what Allah requested of His creation increases... So Allah Almighty sends a messenger to them to remind them that messengers originally did not come... to start the message or start transferring Allah's teachings to His creation... because Allah Almighty had given them the methodology with Creation... And had they remained preserving the religion as Allah sent it down... humans would not have needed messengers... But a messenger comes to remind... then people forget... and a period of time passes in which they leave Allah's religion... so another messenger comes to remind... and so on... Indeed, in some times Allah sends more than one messenger at the same time... as happened with Abraham and Lot... they were sent at one time... And a messenger may come to an environment needing reminder of Allah's methodology... and no messenger comes to other people living in the same time... but in another spot and following Allah's methodology properly... Thus, all religions... aim at the continuity of the divine methodology that accompanied the first human... to organize his movement on Earth... And messengers come to remind those who forgot or deviated... or violated this methodology from Adam's offspring... And that is because the methodology requires behavior that conflicts with the self's desires, so heedlessness, forgetfulness, and deviation occur. The Prophet, peace be upon him, expressed this as \"sleep\"... which is heedlessness of the methodology or teachings of religion... He said: \"A man sleeps a sleep, and the trust (Amanah) is taken from his heart... and its trace remains like the trace of a blister (wakt) which is a slight burn...\" Meaning that",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 60
  },
  {
    "serial_number": "1129148",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 60,
    "volume_number": 1,
    "text": "the man becomes heedless of his religion... so the trust is taken from his heart... meaning the radiance of faith... and its trace remains like the trace of a blister... then he sleeps a sleep meaning becomes heedless again... and its trace remains like the trace of a callus (majl) - which is what happens when you place a burning ember on your hand - like an ember you rolled on your leg so it blistered, and you see it swollen with nothing in it... This is how heedlessness enters the human soul... He sleeps on this a little... and neglects this a little... And in another Hadith: \"Temptations are presented to hearts as a reed mat (is woven), stick by stick... meaning in the manner of weaving a mat, the first stick then the second then the third... Any heart that absorbs them will have a black spot marked in it... and any heart that rejects them will have a white spot marked in it... until they become two hearts... one white like a smooth stone, no temptation will harm it as long as the heavens and earth endure... and the other black, dusty... recognizing no good and denying no evil...\" And that is the \"Ran\" (rust/covering)... about which Allah Almighty said (No! Rather, the stain has covered their hearts) meaning their connection with Allah has ended by their complete heedlessness of the rulings of religion. So, the processions of all Messengers came to remind of the First Covenant given to Adam, which Allah Almighty expressed by His saying (And when guidance comes to you from Me)... But heedlessness befalls the heart... And from Allah's mercy, He sends a messenger to remind people of the methodology... for every time and every place. And our Master Muhammad, peace be upon him... came after an interval of messengers... You notice that his message, peace be upon him, was not to a specific people... nor to a specific human race unlike previous messengers... So Allah Almighty says to His Prophet...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 61
  },
  {
    "serial_number": "1129149",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 61,
    "volume_number": 1,
    "text": "(And We have not sent you, [O Muhammad], except as a mercy to the worlds). Then Allah says (to all people)... The message of the Prophet, peace be upon him, took universality here... universality of place... Then Allah Almighty says Seal of the Prophets... So the message here took universality of time as well... It took universality for time and place... Therefore, the legislation must come for every time... and every place... But why did the message come... the message of the Prophet, peace be upon him... having universality of place... and universality of time... This is also from the miracle of the Quran... That is because Allah Almighty, in His knowledge, knew that the ills of all humanity would become one ill... For the more the world advances and its connection increases... the ills it complains of become unified... Before the message of Muhammad, peace be upon him... there was isolation in the world... no connections between human societies... And every human society lived and ended... without another human society in a far place knowing about it... That is because connections between different human societies... were almost non-existent due to distance... and weakness or lack of means of transportation... and lack of scientific progress enabling humans to contact each other in short times... Hence, every society had its own special ills... and diseases... and deviations... and heedlessness of religion... And messengers used to come to these societies to remind of Allah's methodology but they were sent to a specific society like Aad, Thamud, the people of Lot and others... Indeed, as I said, sometimes Allah Almighty would send more than one messenger at the same time... one to treat the ills of a society... and another to treat another society... as happened with Lot and Abraham for example...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 62
  },
  {
    "serial_number": "1129150",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 62,
    "volume_number": 1,
    "text": "There was isolation... and this isolation made the ailments different... and messengers were sent to every society to remind its people... But now, after the world met and advanced... the ailments united... or became all around one circle... something happens in America and it is with you after one hour... there is almost a unity of ills in the whole world... the ill of humanity is one in advanced countries... and in developing countries... because a human meeting occurred... and when an event happens the whole world knows it after minutes... As long as the ills have united as a result of the great human connection that took place... there must be a unity of treatment... And thus Allah Almighty foretold us in the Holy Quran since the time of its revelation... that the world would advance to become one unit... and that the ills in the world would almost unite as a result of rapid connection between its parts... Therefore there must be unity of treatment... So He sent this religion as a mercy to the worlds... And this is the meaning of the word mercy to the worlds... Meaning to the whole world which unifies its ailments and ills... And the Healer must be one encompassing everyone. And as long as the Messenger of Allah, peace be upon him, is the Seal of Prophets... it means that the religion he brings will treat the ills of the world... and that it will be a mercy to the worlds in every time until the Hour is established... The meaning of healing and meaning of mercy and meaning of this noble verse... is that there is no issue in the world touching humanity's life... except that there exists in Allah's methodology what treats",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 63
  },
  {
    "serial_number": "1129151",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 63,
    "volume_number": 1,
    "text": "this issue... We say treats... because legislations when they come, treat a reality existing in society... and corruption that has spread... Therefore it treats it to heal people from it... And after that when we follow Allah's teachings... corruption does not come to us... nor ills... nor diseases of society... And in this case, this religion is a prevention for us from society's ills and deviations... Therefore Allah Almighty says in the Quran... (And We send down of the Quran that which is healing and mercy) Healing means it will treat the deviations and corruption present in society... and mercy means it prevents these ailments from coming to society... and that is the essence of mercy... The Messenger of Allah, peace be upon him, came to the worlds generally... in time and place... with principles... These principles are mercy... and the meaning of mercy is that if we followed them... corruption would not occur in society... forcing us to treat... And when we neglect these principles... this negligence has harmful effects on society... we start thinking of treatment... so we discover that we left principle so-and-so and principle so-and-so... of what Allah commanded... so treatment begins with Allah's methodology... Thus God's saying (And We have not sent you except as a mercy to the worlds)... means you came with a methodology from Us to convey to people... if they followed this methodology... mercy would encompass them such that there is no human misery in society nor corruption... And religion's subject is not only the Hereafter... rather it organizes man's movement in the world... organizes the movement of his life... As for the Hereafter, in it is the Recompense... The Recompense for your following the methodology... regarding what Allah commanded... or your lack of following it... Applying religion... and teachings of religion",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 64
  },
  {
    "serial_number": "1129152",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 64,
    "volume_number": 1,
    "text": "...intended by it are those present in the world... confirming His Almighty's saying (To warn whoever is alive)... And the recompense for a thing is not the subject itself... Therefore religion is not limited to metaphysical matters only... for the metaphysical is believed by he who believes in Allah... because it came from Allah. As for the non-believer, he has nothing but the reality of life. And the reality of life must show us that this methodology which came from Allah... if followed as Allah wants, misery will disappear from society... Therefore we find the Quran interprets this precisely... (So whoever follows My guidance will neither go astray nor suffer... And whoever turns away from My remembrance - indeed, he will have a depressed life)... This is in the world... Then He Almighty said: (And We will gather him on the Day of Resurrection blind)... God's saying a depressed life... indicates that Allah's teachings descended to protect man from the hardship and misery of living in the world... And human misery is not merely economic... not related to money alone... But the meaning of 'hardship of living' (Dank) is constriction... in living... And this has multiple causes... A man may possess vast wealth... yet be constricted in his life... That is because the aspects of the human soul are diverse... Money might satisfy one aspect... while other aspects remain in constriction and misery... Therefore we find a man owning vast wealth... a circumstance might force him to commit suicide... Why?... I gave an example of Sweden... which is the highest country in the world in per capita share of life's luxury... Yet statistics say it is among the highest countries in the world in suicide and nervous and psychological diseases... The issue is not just a material issue... And the misery of life should not be taken as only the aspect of money... rather there are other aspects causing their owner human misery more than lack of money...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 65
  },
  {
    "serial_number": "1129153",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 65,
    "volume_number": 1,
    "text": "If We Disobey, the Nakedness is Exposed: We have now reached that the Messenger of Allah, peace be upon him, came universally for all times and places with principles that are Mercy... If followed, we would be saved from misery in the world... and take the Recompense in the Hereafter... And this is Mercy... All this explains to us what happened to Adam... that Allah Almighty forbade him to approach the tree, so when they tasted the tree... their nakedness appeared to them... Meaning the nakedness appeared upon violation... So any nakedness (defect) in any society... if you search for its causes you find it happened due to a principle of Allah's principles being disabled on Earth... And had that not happened, beauty would not exist in the universe... If the upright and the non-upright were equal in life... this would not be beauty... If the diligent student and the student who doesn't study succeeded, this would not be beauty in life... rather it would be beauty that inherits ugliness... because the one who worked hard and the one who didn't became equal... and thus no one would work hard... So if misery and corruption did not exist in environments that distance themselves from Allah's methodology... that would not be beauty nor a testimony for religion... The testimony for religion is that the group which distances itself from Allah's methodology encounters misery, ills, corruption, and deviations... And thus Allah Almighty proves in the worldly life... and from the reality of its experience, the truth of His methodology and teachings... Opening Repentance before Humans: But there is a broader meaning I would like to add... That Heaven before the Muhammadan Message... did not ask of Messengers except mere notification... And It undertook the discipline... discipline",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 66
  },
  {
    "serial_number": "1129154",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 66,
    "volume_number": 1,
    "text": "of the violators... And Allah Almighty mentioned this in the Quran... Among them were those We drowned... and among them were those We caused the earth to swallow... and among them were those seized by the blast... Heaven was the one disciplining the disobedient... And Messengers only had to convey... But in the era of the Prophet, peace be upon him... Allah entrusted Islam to be the one undertaking the discipline of the violator... So he who disobeys Allah's teachings... has a depressed life in the world besides the punishment of the Hereafter... Therefore the message of Muhammad, peace be upon him, was a mercy to the worlds... to the disbeliever and believer among them... That is because Heaven did not hasten their punishment in the world... as used to be hastened for the violators of Messengers in previous nations... It left them the opportunity for repentance... (But Allah would not punish them while you, [O Muhammad], are among them, and Allah would not punish them while they seek forgiveness)... So Allah Almighty sent His Prophet as a mercy to the whole world without distinction between believer and non-believer, mercy from the punishment of Heaven in the world... and to open before them the doors of repentance for sins so He forgives them in the Hereafter... And this is the meaning of the noble verse: (And We have not sent you except as a mercy to the worlds).",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 67
  },
  {
    "serial_number": "1129155",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 67,
    "volume_number": 1,
    "text": "Laylat al-Qadr (Laylat al-Qadr is the night in which the Quran was revealed... and the Quran is eternal because it is an attribute of Allah Almighty... Therefore, the Quran descended on this night from the Preserved Tablet to the Lower Heaven to begin its mission with \"do\" and \"do not do\"...) If we take the difference of the lunar year from the solar year, we would find that Laylat al-Qadr... came in every day of the year... For Ramadan comes in Spring, Autumn, Summer, and Winter... Meaning it rotates through the whole year... in every season of its seasons... There is no month of the solar year except that it witnessed Ramadan or part of Ramadan... And with the length of time, we find that Laylat al-Qadr also has passed through the whole year... in every day of its days... And choosing the night here is because it is the time when worship is for Allah alone... it has purity and calmness... and truthfulness of expression... For he who shows off with worship of Allah cannot stand the night in prayer... And he who wants it said of him that he is a righteous man... out of showing off or hypocrisy cannot stand the night in prayer... But he who stands the night is the humble before Allah Almighty, believing in Him. And when Allah chooses a time among times... or a place among places or a person among persons to bestow upon him whatever He wills... and chooses him for His message or to convey His methodology to His creation... this choice is good for all humanity... For choosing Mecca for example as a place for the Sacred House of Allah is at the same time an honor for the whole world... For people from all parts of the world go there to perform Hajj and perform rituals and repent to Allah and seek His forgiveness and return to their countries forgiven",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 68
  },
  {
    "serial_number": "1129156",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 68,
    "volume_number": 1,
    "text": "of sin... Thus, the good here was not limited to Mecca alone... rather it extended to include Allah's mercy for the whole world. And the Messenger of Allah, peace be upon him, was sent as a mercy to the worlds, and we all pray for his elevation and the Praised Station (Maqam Mahmud)... We pray for ourselves... because by the Praised Station which he will occupy on the Day of Resurrection... he will intercede for us all... so good and mercy will befall us at his hands. Likewise, the choice of Laylat al-Qadr... is to encompass the whole world with bounty from Allah and mercy... For the human soul to live safe in the worldly life, it must get rid of several things... First is Fear, and Fear is of something known... Then Worry and Grief that enters the heart... and this might come from something unknown to you... Then Plotting, that others plot against you... And Laylat al-Qadr is Peace and Security... because it reminds us of the Quran which if we followed, fear, worry, and grief would go away from us... Imam Jafar Al-Sadiq used to say... I wonder at him who fears, how does he not flee to the saying of Allah Almighty: (Sufficient for us is Allah, and [He is] the best Disposer of affairs)... For Allah follows it with His saying (So they returned with favor from Allah and bounty, no harm having touched them). And I wonder at him who is grieved, how does he not flee to the saying of Allah Almighty (There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers) for Allah follows it with His saying: (So We responded to him and saved him from the distress. And thus do We save the believers...). And I wonder at him who is plotted against, how does he not flee to the saying of Allah Almighty (And I entrust my affair to Allah. Indeed, Allah is Seeing of [His] servants) for Allah follows it with His saying (So Allah protected him from the evils they plotted). And I wonder at him who seeks the world and its adornment, he does not flee to the saying of Allah Almighty",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 69
  },
  {
    "serial_number": "1129157",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 69,
    "volume_number": 1,
    "text": "(What Allah willed [has occurred]; there is no power except in Allah) for I heard Allah following it with His saying (Although you see me less than you in wealth and children... It may be that my Lord will give me [something] better than your garden). Every thing in this universe, to happen... implies there must be a Doer to perform it... and implies there must be an Object (acted upon)... And the Doer and Object might exist... but the Cause for which the action arises is absent... Thus Action implies the existence of these three elements... Doer, Object, and Cause... Therefore Allah Almighty disciplined us regarding events... and commanded us not to say for something we want to do tomorrow... except \"If Allah wills\"... (And never say of anything, \"Indeed, I will do that tomorrow,\" Except [when adding], \"If Allah wills\")... You must say If Allah wills... Why?... Because you do not own a single element of the elements of the action... You do not own the existence of the Doer which is yourself tomorrow... or after hours... and you do not own the existence of the Object tomorrow... and you do not own the remaining of the Cause tomorrow... and you do not own the remaining of Time tomorrow... and you do not own the remaining of Place tomorrow... But your saying that you will do that tomorrow... is metaphorical... Therefore you must attribute it to the One who owns the existence of these things... and say Except if Allah wills... In this case, you have exited from lying to truth... and to reality... As events have these elements... so when we want the event of the Quran's descent, it requires a Sender... and a Recipient... and a Cause for sending... and a Place for sending and a Time for sending... Laylat al-Qadr addressed the time of sending... But the Quran, if we look at it, we find it descended in Laylat al-Qadr and in other than Laylat al-Qadr... because it descended piecemeal according to events... and descended at night... and descended at day... and descended at all times... But",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 70
  },
  {
    "serial_number": "1129158",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 70,
    "volume_number": 1,
    "text": "the Descent in Laylat al-Qadr... means the Will of the Truth (God) to bring forth the Quran from its treasure where it was hidden to the Earth to begin its mission in existence... from the world of the Unseen... to the world of the Witnessed... And the sending down of the Quran is attributed to Allah Almighty confirming His saying (And with the truth We have sent it down, and with the truth it has descended)... But it also comes attributed to Gabriel... The Trustworthy Spirit brought it down... So he who brought it down... is the Trustworthy Spirit... but the One who sent it down is Allah Almighty... The verb \"Anzala\" (sent down) was not attributed except to Allah Almighty... So God's saying (Indeed, We sent it down in the Night of Decree)... Meaning We brought it out from the Preserved Tablet from the world of the Unseen where it was covered to begin its mission in existence... And since He sent it down in Laylat al-Qadr... and the sending down is for the Quran... the sending down is not for notification alone but for the Quran to begin practicing its mission... Thus, what they said that it descended from the Preserved Tablet to the World to practice its mission... is correct... And after that it is possible that the first portion of it descended in this night... And what we must understand is that Allah Almighty when He attributed the Quran to His Essence... and the descent with it to Gabriel... means that Gabriel carried it as it is... as Allah sent it down... to the Prophet, peace be upon him... And that no alteration or change occurred in it... rather it is as Allah Almighty sent it down... So Laylat al-Qadr remains... the night in which Allah Almighty sent it down to practice its mission in existence, sent it down to the Lower Heaven for Gabriel to take from it... to send it down upon Muhammad, peace be upon him... The Quran was, until Gabriel took from it, in the fold of Allah's Unseen... And after that when Gabriel delivered it to the Messenger of Allah, it was in the fold of the Unseen from the Messenger of Allah... Then when the Messenger of Allah took it... and conveyed it to people, it was in the fold of the Unseen from us... So God's saying",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 71
  },
  {
    "serial_number": "1129159",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 71,
    "volume_number": 1,
    "text": "Almighty (Indeed, We sent it down in the Night of Decree)... indicates that the meaning of descent is the beginning of the Quran practicing its mission in existence... with \"do\" and \"do not do\"... and that is by descending all at once to the Lower Heaven... then Gabriel descends with it after that piecemeal according to events... The meaning of Time is not standing by itself. It is noted here that the pronoun in God's saying (Indeed, We sent it down) is a plural pronoun... and in the Sender (Hu - it) is the ha of absence. If you read the Quran, you find that the Truth Almighty in every act He performs uses the plural pronoun of absence... because the act requires the joining of multiple attributes of Allah Almighty... Wisdom, Mercy, Power, Knowledge, and so on... But if the Truth speaks about the Essence... He speaks in the singular... He Almighty did not say \"We are Allah\"... but He said \"Indeed, I am Allah\"... In this case, He speaks of His Oneness and He has no partner... But when He speaks about an event requiring several combined attributes... He uses the plural form... Indeed, We sent it down. So the Sender is Allah and the Sent is the Quran and the time in which it descended is Laylat al-Qadr... When Allah specifies a time among times with a choice... and He is the Creator and chooses what He wills... He chooses from the angels messengers... and chooses from humans messengers... and chooses from the earth a place... and chooses from time a time... He knows best what He created... This choice is not for the specificity of the time itself... but the specificity came with what happened in it... Allah's choice of a time or place or human or angels, does not mean anything except that the selection therein permeates or spreads or encompasses everything... It is not favoritism for time... nor favoritism for place... nor favoritism for humans... nor favoritism for angels... because",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 72
  },
  {
    "serial_number": "1129160",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 72,
    "volume_number": 1,
    "text": "favoritism here is because of the event that descended... and we do not want for this event except that it spreads and encompasses all humanity... The Messenger of Allah, peace be upon him, when Allah Almighty chose him, He wants this choice to encompass all humanity... When He chooses angels... He wants their choice and illumination to encompass every place... When He chooses a night He wants its choice to encompass all time... So all choices, whether the choice was time or place... the intent is for the choice to encompass every time... and every place... and every human... The Prophet, peace be upon him, when Allah chose him and favored him over the messengers... and asked us to pray for him the Praised Station... as an increase in honoring him... But in reality, when we pray for the Messenger of Allah, peace be upon him, we pray for ourselves... because when the Messenger of Allah, peace be upon him, takes the Praised Station, his first act will be to intercede for us on the Day of Resurrection... So when I pray... for the Messenger of Allah, peace be upon him, I pray for myself. We return to Laylat al-Qadr... Since the Quran descended in it... and the Quran carries Allah's guidance to all humans... it must be a place of celebration for what was revealed in it... And man when he celebrates a time... celebrates what happened in this time... Time is not noticed... but what happened in time is what is noticed... When man revives Laylat al-Qadr... he does not revive it except because Allah honored it... because it was the birth of the Quran... So honoring it is honoring the event that occurred in it which is the Quran... And man does not honor an event occurring in a time except because he is happy with the effects of this event itself... So God's saying (Indeed, We sent it down in the Night of Decree)... means bringing forth the Quran from the Preserved Tablet... in which it was hidden into existence to practice its mission.",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 73
  },
  {
    "serial_number": "1129161",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 73,
    "volume_number": 1,
    "text": "But did Laylat al-Qadr have existence... in another sense so that Allah Almighty chose it to send down the Quran in it... Possibly... It is the time of original Decree (Taqdir) of events... The time of descending Allah's decree to the Lower Heaven was happening in this night... Because it is the time for decreeing things, Allah chose it for the birth or sending down of the greatest event for humanity... So the word Laylat al-Qadr was taken from what... That it was of \"Qadr\" (value/decree) before Allah sent down the Quran in it... so Allah chose it to send down the greatest Decree in it... Or that it took the \"Qadr\" by the descent of the Quran in it... (The angels and the Spirit descend therein by permission of their Lord for every matter)... Based on this, this night could be a time for manifestations of the Truth Almighty and His gifts to His servants... And after that He took it to be a place for manifestations of the Truth upon the last thing He shines upon His servants... which is the Quran... So Laylat al-Qadr here can mean Honor... and can mean Decree/Estimation of things... If taken as Honor... it took it from the Quran... And if it means Decree of things... there is no objection for it to be a place for decreeing things... and the best thing decreed in it is the Quran. Laylat al-Qadr took the \"Qadr\" from two sides... Estimation and Honor... Then Allah magnifies the Night... And what can make you know what is the Night of Decree... What can make you know... \"Adraka\" here is a past verb... and it means no one has made you know Laylat al-Qadr... And as long as Allah denied that anyone made His Prophet know Laylat al-Qadr... it is as if no one knows its value except Allah Almighty... So if you want to know its value, listen from Allah. A thousand months why? When the Quran speaks in \"Adraka\" (made you know - past) or \"Yudrika\" (will make you know - present/future)... we must notice something... \"Ma Adraka\" means no one has made you know",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 74
  },
  {
    "serial_number": "1129162",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 74,
    "volume_number": 1,
    "text": "that no one has made you know before now... And \"Yudrika\" means that no one realized in the past... and no one will make you know in the future... So \"Ma Yudrika\" cannot be realized or known... Whereas \"Ma Adraka\" in the past tense... means no one told you anything about it until now... but Allah will make you know now... And here Allah made him know and said Laylat al-Qadr is better than a thousand months... So if you read in the Quran \"Ma Adraka\" know that Allah will make you know... and if you read \"Ma Yudrika\" know that it is from the secrets of the Unseen... and that Allah will not make you know it... And this phrase... And what can make you know what is Laylat al-Qadr... is not said unless the value (Qadr) is great and no one can encompass it by his diligence or knowledge... except Allah... This is an aggrandizement of Laylat al-Qadr... The good in it was more than humans can realize... rather He who chosen it to reveal the best of what was revealed realizes it... Then Allah Almighty says (The Night of Decree is better than a thousand months)... Here, preferring the Night over a thousand months must be paused at... Since it is a thousand months and the year is 12 months... the thousand months is eighty years... i.e., eighty Nights of Decree... So it is better than a thousand months... but is it preferred over its recurrence... meaning that during the coming eighty years Laylat al-Qadr will recur eighty times... so is the Laylat al-Qadr we are in now better than eighty coming Nights of Decree... And why was the thousand chosen specifically... Because Almighty was addressing the Arabs with their minds... And the Arabs believed that the thousand is the end of numbers... Therefore if they increased upon it they repeated so many thousands... They did not know for example the million or billion... So the thousand is the peak of number... As if Allah wanted to say (Indeed, the Night of Decree is better than a thousand months)... Meaning it is better than the hugest thing they know by",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 75
  },
  {
    "serial_number": "1129163",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 75,
    "volume_number": 1,
    "text": "standards of numbers... Thus it means that Laylat al-Qadr is better than all time however long... But better than a thousand months in what... That is for the Messenger of Allah, peace be upon him, and his nation... For the Messenger of Allah, peace be upon him, heard that a man carried the sword in the cause of Allah for a thousand years... so he deemed the lifespan of his nation short... It is as if Allah wanted to give him glad tidings... so He said to him... You have a night... if you do well in standing in it and worshipping Allah, it will suffice you over a thousand months... And a thousand months in what... in carrying a sword in the cause of Allah... The meaning in that is that Allah Almighty compensated the nation of Muhammad in the short time... what fits what others took in the long time... But Allah wanted to give us something else about Laylat al-Qadr... It is that it is a place for the descents of angels with Allah's mercy on Earth... The descents of Allah's mercy on Earth are by laws... and regulations... And reason does not conflict that for every law or regulation there is a type of angel... Angels are a creation of Allah's unseen creation... Every law like provisions, mercy... and death... has angels... Evidence is that Allah says about the angels (And those who arrange [each] matter)... meaning He created unseen angels... to undertake a specific unseen mission in life... And it is possible that Laylat al-Qadr was specialized by the descent of the Quran in it... because Allah specialized it from ancient times... as a place for His descents to the Earth... Rulings descend to the angels... then they undertake them throughout the whole year... Then Allah Almighty says (Peace it is until the emergence of dawn). What indicates to us that the descents in Laylat al-Qadr included other than the Quran... is His saying Almighty (The angels and the Spirit descend therein)... The Trustworthy Spirit is Gabriel who descended with the Quran... and the angels... descended for Allah's good on Earth... Meaning angels are for other descents besides the Quran for every angel to undertake",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 76
  },
  {
    "serial_number": "1129164",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 76,
    "volume_number": 1,
    "text": "his mission among people which Allah assigned to him... And after that He said (Peace it is until the emergence of dawn)... Meaning nothing descends in it except all that is good... and all that is peace... because Allah's descents of good in His laws came as good for people in everything related to their lives... This is regarding material life... And regarding spiritual matters... the best that descends in this night is the Quran which set the final methodology for the movement of human life on Earth... And since the matter is so... if we receive what descended in this night... and make it a methodology... in this life, peace, mercy, and blessing will fill the universe... So the peace of Laylat al-Qadr is peace for all times... Peace is never disturbed... Peace descended in Laylat al-Qadr... But we are the ones who implement it or do not implement it... If we implement it, the peace of Laylat al-Qadr extends to all times... And if we take it and disable its mission... Peace would have descended in Laylat al-Qadr... and we are the ones who refrained from benefiting from that peace. It is assumed that we spend Laylat al-Qadr in sincere servitude to Allah... So if we spent this night worshipping Allah with true worship... it meant that we repeated the time in which what you love descended... which is the Quran... The methodology that clarified to us the purity of servitude to the Truth Almighty... So our celebration of Laylat al-Qadr... is our joy in that night... for what descended in it... And we do not rejoice in what descended in it unless the effects of what descended in it have exuded purity upon our souls... and supplication upon our behavior... And here Allah Almighty manifests: (As long as My servant rejoiced in My methodology a joy that made him honor the night of the beginning of this methodology's descent, he has no reward with Me except that I forgive him)",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 77
  },
  {
    "serial_number": "1129165",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 77,
    "volume_number": 1,
    "text": "Determining the Night in Ramadan: After that we come to determining the Night... the Unique one in the month of Ramadan... because Allah Almighty said (Indeed, We sent it down in the Night of Decree) and the Quran descended in Laylat al-Qadr... and in another verse (The month of Ramadan [is that] in which was revealed the Quran). The Quran descended in Ramadan... and in other than Ramadan... Therefore, the beginning of the descent or permission for the Quran to practice its mission in the universe must be... in the month of Ramadan... But Laylat al-Qadr circulates in time... meaning it passed in every day of the days of time... The difference between the lunar year and solar year is eleven days... This difference for example makes Ramadan come in Winter... and in Summer... in Autumn... and in Spring... Meaning it is divided over the days of the whole year. And over all its seasons... So if we calculate the difference with the length of time... we find that Laylat al-Qadr has come since the beginning of creation until now at least once in every day of the days of the year... Laylat al-Qadr rotates in the world to include every day in it... to include all time. It is for us in Ramadan... but regarding the calculation of time, it rotates in every day of it... And he who says seek it in the last ten nights... or in the odd nights of the last ten of Ramadan... If he said seek it in something relative to the twenties... there would be disagreement... But in the last ten of Ramadan, Ramadan might be thirty days... and might be 29 days... When Ramadan is 29 days and he seeks it in the last ten, it starts from 20... thus being twenty, 22, 24, etc... If Ramadan is thirty days... the beginning is 21, thus we seek it on days 21, 23, 25, and so on... Here a question arises... Who tells us while we are in the twentieth of Ramadan if",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 78
  },
  {
    "serial_number": "1129166",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 78,
    "volume_number": 1,
    "text": "Ramadan will be twenty-nine days or thirty days... Who tells us that... Of course we do not know that in advance... From here if we are seeking the last ten of Ramadan... we must seek it in every night of the last ten... Or in the odd of the last ten... we say to him that the even precedes the odd... and the odd precedes the even depending on the end of the month of Ramadan... and is it 29 days... or 30 days... From here we must seek it in the last ten of Ramadan... and there is no disagreement on that. We come after that to another point... which is anticipating day 21, 23, 25, 27. This is an effect of evil exuding on good... The Prophet, peace be upon him, went out and said I had come out to inform you of Laylat al-Qadr... but so-and-so and so-and-so quarreled... meaning argued in the mosque... so it was lifted from me... so seek it in the last ten... It is as if the one who came to the Messenger of Allah, peace be upon him, to inform him of the determination of Laylat al-Qadr specifically... then after that the quarrel that arose between two in the mosque happened so Laylat al-Qadr was hidden... It is as if Allah wants to tell us that quarreling is the field of Satan for battles of evil... and that prevents good... And purity calls for purity... So when Allah Almighty finds a gathering all pure... angels of mercy descend in it... Why... because Allah Almighty loves brotherhood and purity from His creation... Allah Almighty says about them (And those who are guided, He increases them in guidance)... But when Allah wants to send down general good on people... then comes and finds they are not fit for this mercy... or this good... their reception devices are damaged... then He withholds the good from them... So if we want to be fit for Allah's gift... we must always be in purity...",
    "foot_note": "None",
    "book_id": "1120",
    "new_page_number": 79
  },
  {
    "serial_number": "1129167",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 79,
    "volume_number": 1,
    "text": "to be able to receive Allah's gift... And after that Allah willed as a mercy from Him not to deprive us of all good... so He tired us a little... He said it is in the last ten of Ramadan... instead of defining the night... And in that is a wisdom from Allah Almighty in that He wants people to stand in the face of evil whatever this evil is so they can receive Allah's gift and mercy... And in this case holding onto good is man's defense of his own self confirming His saying Almighty: (And fear a trial which will not strike those who have wronged among you exclusively)...\n\nto be able to receive Allah's gift... And after that Allah willed as a mercy from Him not to deprive us of all good... so He tired us a little... He said it is in the last ten of Ramadan... instead of defining the night... And in that is a wisdom from Allah Almighty in that He wants people to stand in the face of evil whatever this evil is so they can receive Allah's gift and mercy... And in this case holding onto good is man's defense of his own self confirming His saying Almighty: (And fear a trial which will not strike those who have wronged among you exclusively)...",
    "foot_note": "None\n\nNone",
    "book_id": "1120",
    "new_page_number": 80
  },
  {
    "serial_number": "1129168",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "The Miracle of the Quran",
    "edition": "First, 1398 AH - 1978 AD",
    "publisher": "Al-Mukhtar Al-Islami for Printing, Publishing and Distribution P.O. Box 1707 - Cairo",
    "page_number": 80,
    "volume_number": 1,
    "text": "is the field of Satan for battles of evil... and that prevents good... And purity calls for purity... So when Allah Almighty finds a gathering all pure... angels of mercy descend in it... Why... because Allah Almighty loves brotherhood and purity from His creation... Allah Almighty says about them (And those who are guided, He increases them in guidance)... But when Allah wants to send down general good on people... then comes and finds they are not fit for this mercy... or this good... their reception devices are damaged... then He withholds the good from them... So if we want to be fit for Allah's gift... we must always be in purity...\n\nAl-Mukhtar Al-Islami Presses Dar Al-Salam",
    "foot_note": "None\n\nNone",
    "book_id": "1120",
    "new_page_number": 81
  }
]