[
  {
    "text": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah\nAuthor: نوال بنت عبد العزيز العيد\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4857\nbook_title: التيسير على النساء في الحج في ضوء السنة النبوية\nbook_link: https://shamela.ws/book/1062\nbook_id: 1062\nauthor_name: نوال بنت عبد العزيز العيد\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/195\nauthor_ID: 195\neditor: Null\npublisher: دار الحضارة للنشر والتوزيع\nedition: الأولى، 1434 هـ - 2013 م\npages: 93\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4596032",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues. Book: Facilitation for Women in Hajj in the Light of the Prophetic Sunnah. Author: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 93 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nBook: Facilitation for Women in Hajj in the Light of the Prophetic Sunnah. Author: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 93 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nAuthor: Nawal bint Abdul Aziz Al-Eid. Publisher: Dar Al-Hadara for Publishing and Distribution. Edition: First, 1434 AH - 2013 AD. Number of Pages: 93 [Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\n[Book pagination matches the print]. Publishing Date in Shamela: 27 Rabi' al-Awwal 1444.\nPublishing Date in Shamela: 27 Rabi' al-Awwal 1444.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 3
  },
  {
    "serial_number": "4596033",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon the most noble of Prophets and Messengers. To proceed:\nIndeed, among Allah's blessings upon His servants is that He sent His Prophet to them with the tolerant Hanifiyyah (monotheism), and He made ease one of the characteristics of this final message. He said: {Those who follow the Messenger, the unlettered prophet, whom they find written in what they have of the Torah and the Gospel, who enjoins upon them what is right and forbids them what is wrong and makes lawful for them the good things and prohibits for them the evil and relieves them of their burden and the shackles which were upon them. So they who have believed in him, honored him, supported him and followed the light which was sent down with him - it is those who will be the successful.} [Al-A'raf: 157].\nThis verse has outlined the features of this eternal message through the description of His Messenger, peace and blessings be upon him, and stated that he was sent to remove burdens and shackles. It is a depiction of the state of distress and hardship that this Sharia has removed through tolerance and ease.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 4
  },
  {
    "serial_number": "4596034",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 6,
    "volume_number": 1,
    "text": "Al-Isr (burden) is described by al-Nadheer ibn Shumail as: the heavy covenant. Every heavy thing is an isr, because it binds its owner, meaning it restricts him from movement. Al-Aghlāl (chains) — plural of ghil, with a ḍammah — are iron fetters that are placed around the neck and hands. Murtada, in his book 'Al-Tāj', says about al-aghlāl: 'They are repeatedly mentioned in the Qur’an and Sunnah, and refer to difficult obligations and demanding acts, not to facilitation.'\n\nFacilitation and the removal of hardship is not merely a juristic principle, expressed by the jurists with sayings like: “Hardship brings ease,” and Imam al-Shāfi‘ī’s statement: “When a matter becomes tight, it is made wide.” Rather, facilitation and removal of hardship are objectives of the higher purposes of Shariah. The Qur’an and Sunnah explicitly indicate this in several places. Allah, the Exalted, says: {Allah does not burden any soul beyond its capacity. It will have the reward of what it earns, and it will bear the consequences of what it does. Our Lord, do not punish us if we forget or make mistakes. Our Lord, do not place upon us a burden like that which You placed upon those before us. Our Lord, do not impose upon us that which we have no strength to bear.} [Al-Baqarah: 286].",
    "foot_note": "1. See: Taj al-‘Arus (101/2), Lisan al-‘Arab (4/22), entry (A-S-R).\n2. See: Taj al-‘Arus (3/208), entry (G-L-L), and also: Al-Durr al-Manthur by Al-Suyuti (7/43).\n3. Al-Ashbah wa al-Nazair by Al-Suyuti (83).",
    "book_id": "1062",
    "new_page_number": 5
  },
  {
    "serial_number": "4596035",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 7,
    "volume_number": 1,
    "text": "And it was stated in the Musnad (1) from the Hadith of Abu Umamah in a Marfu' narration: 'I was not sent with Judaism or Christianity, but I was sent with the tolerant Hanifiyyah (Monotheism).' Al-Bukhari reported (2) from the Hadith of Aisha, may Allah be pleased with her, who said: 'The Messenger of Allah, peace and blessings be upon him, was never given a choice between two matters but that he chose the easier of the two, as long as it was not a sin. If it was a sin, he was the furthest of people from it.' She only said: 'as long as it was not a sin' because there is no hardship in avoiding sin. The legitimacy of definitively established concessions, such as shortening prayers for the traveler combined with joining them, and consuming forbidden things in cases of necessity, is nothing but definitive proof of the absolute removal of difficulty and hardship. If the aforementioned legal texts came to establish the rule of facilitation and the removal of hardship in matters of religion in general, then the intent of facilitation appears in Hajj specifically. Here is the Messenger of Allah, peace and blessings be upon him, declaring it in the Farewell Pilgrimage, as reported by Al-Bukhari (3) and Muslim (4) from the Hadith of Abdullah bin Amr bin",
    "foot_note": "1. (5/ 266) 22345, and Al-Albani authenticated it in Al-Sahihah (6/ 122) 2924.\n2. (5/ 5775, 2269).\n3. (1/ 43) 83.\n4. (2/ 948) 1036.",
    "book_id": "1062",
    "new_page_number": 6
  },
  {
    "serial_number": "4596036",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 8,
    "volume_number": 1,
    "text": "Al-Aas, that the Messenger of Allah, peace and blessings be upon him, stood at the Farewell Pilgrimage in Mina for the people to ask him questions. A man came to him and said: 'I did not realize, so I shaved before I slaughtered.' He said: 'Slaughter, and there is no harm.' Another came and said: 'I did not realize, so I slaughtered before I threw [the pebbles].' He said: 'Throw, and there is no harm.' The Prophet, peace and blessings be upon him, was not asked about anything done before or after [its order] except that he said: 'Do it, and there is no harm.' Since Hajj is an act of worship explicitly linked to capability, and Hajj in many of its rulings is based on choice, and choice is the foundation of facilitation, this is a general ruling for all pilgrims. So how much more so for women, for whom the Messenger of Allah, peace and blessings be upon him, counted Hajj as Jihad? He said in what was reported by Imam Ahmad (1) and Ibn Majah (2) from the Hadith of Aisha, who said: I said: 'O Messenger of Allah, is there Jihad upon women?' He said: 'Yes, upon them is a Jihad in which there is no fighting: Hajj and Umrah.' The wording is Ahmad's, and Al-Albani authenticated it in Al-Irwa (3). And in Al-Bukhari in the Chapter of Women's Hajj (4) from the Hadith of Aisha, she said:",
    "foot_note": "1. (6/ 165) 25361.\n2. (2/ 968) 2901.\n3. (4/ 101) 981.\n4. (2/ 658) 1762.",
    "book_id": "1062",
    "new_page_number": 7
  },
  {
    "serial_number": "4596037",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 9,
    "volume_number": 1,
    "text": "I said: 'O Messenger of Allah, shall we not go on expeditions and fight [Jihad] with you?' He said: 'But the best and most beautiful Jihad is Hajj: an accepted Hajj (Hajj Mabrur).' Aisha said: 'So I will not leave Hajj after hearing this from the Messenger of Allah.' Indeed, Hajj is the Jihad of every weak person, as reported by Ibn Majah (1) from the Hadith of Umm Salamah who said: The Messenger of Allah, peace and blessings be upon him, said: 'Hajj is the Jihad of every weak person.' Al-Albani graded it Hasan. And in Al-Nasa'i (2) with a chain that has no harm (La ba'sa bihi) from the Hadith of Abu Huraira in a Marfu' narration: 'The Jihad of the elderly, the young, the weak, and the woman is Hajj and Umrah.' There is no doubt that the choice of the word 'Jihad' by the Messenger of Allah, peace and blessings be upon him, has its significance and meanings. 'Jihad' is a state in which the exertion of effort and the occurrence of hardship are visualized. It is a word that serves as a premise for results regarding forms of facilitation and mitigation for those in this state, as you will see, God willing. In the research, the approach to dealing with hardships in Hajj will become clear to you, especially with the existence of ongoing disagreement and the absence of definitive text.",
    "foot_note": "1. (2/ 968) 2902.\n2. (5/ 113) 2626.",
    "book_id": "1062",
    "new_page_number": 8
  },
  {
    "serial_number": "4596038",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 10,
    "volume_number": 1,
    "text": "Ibn al-Qayyim says regarding the change of times, places, and conditions: 'This is a chapter of very great benefit. Due to ignorance of it, a great error has occurred against the Sharia, necessitating difficulty, hardship, and the imposition of what is impossible, which it is known that the magnificent Sharia, which is at the highest levels of welfare, would not bring. For the Sharia is built and founded upon wisdom and the welfare of the servants in their livelihood and their afterlife. It is all justice, all mercy, all benefit, and all wisdom. So every issue that departs from justice to injustice, from mercy to its opposite, from benefit to corruption, and from wisdom to futility, is not from the Sharia, even if it is entered into it by interpretation. The Sharia is Allah's justice among His servants, His mercy among His creation, and His wisdom pointing to Him and to the truthfulness of His Messenger' (1). The change of time referred to is the change in people's conditions; pilgrims who used to be counted in thousands are now counted in millions, and the few souls that used to die during the Hajj season are now counted in hundreds. The point is that maintaining rulings on minor details that contradict the objectives of the Sharia, leading to hardship and distress, is contrary to the spirit of the Sharia and is a mistake.",
    "foot_note": "1. I'lam al-Muwaqqi'in (3/ 11).",
    "book_id": "1062",
    "new_page_number": 9
  },
  {
    "serial_number": "4596039",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 11,
    "volume_number": 1,
    "text": "And what hardship is greater than the loss of lives in crowds, being afflicted with wounds and pains, and causing harm to the servants of Allah? Does the matter not deserve Ijtihad (juridical reasoning), especially regarding the incapable and the weak? (1) I was pleased to address the topic of 'Facilitation for Women in Hajj in the Light of the Prophetic Sunnah.' I divided the research into an introduction, two chapters, and a conclusion. Introduction: Includes the importance of the research and the research plan. Chapter One: Manifestations of Facilitation Before Hajj. It contains five topics: Topic One: The capability that makes Hajj obligatory for the Afaqi (one coming from outside the sanctuary limits). Topic Two: The husband's permission for his wife for the obligatory Hajj. Topic Three: The obligation of Hajj [frequency]. Topic Four: The Ihram of the menstruating woman for Hajj. Topic Five: Stipulating a condition (Ishtirat) for the pilgrim. Chapter Two: Manifestations of Facilitation During Hajj. It contains two topics:",
    "foot_note": "1. See the commentary of Sheikh Abdullah bin Bayyah on the book (If'al wa la Haraj) by Dr. Salman al-Ouda (7 - 23).",
    "book_id": "1062",
    "new_page_number": 10
  },
  {
    "serial_number": "4596040",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 12,
    "volume_number": 1,
    "text": "Topic One: Facilitation in the Pillars of Hajj: It contains two issues: Issue One: Facilitation in Standing at Arafat. Issue Two: Facilitation in Tawaf al-Ifadah. Topic Two: Facilitation in the Duties of Hajj: It contains three issues: Issue One: Hastening the departure from Muzdalifah. Issue Two: Facilitation in throwing the pebbles (Ramy). Issue Three: Dropping of the Farewell Tawaf for menstruating and postpartum women. Conclusion. I was keen to clarify the opinions of jurists related to the issue, citing their evidence and reasoning, relying on the scientific method followed in research regarding referencing verses and opinions, and grading Hadiths. Asking Allah for success and correctness.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 11
  },
  {
    "serial_number": "4596041",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 13,
    "volume_number": 1,
    "text": "Chapter One: Manifestations of Facilitation Before Hajj. Topic One: The Capability That Makes Hajj Obligatory for the Afaqi. There is no doubt that the obligation of Hajj has conditions according to scholars; some are conditions for obligation and validity, some are conditions for obligation and fulfillment, and some are conditions for obligation only. The Imams have elaborated on these in their books. In this issue, I will discuss one of the conditions of obligation, which is capability (Istita'ah), as it contains the first manifestation of Allah's facilitation for His servants in Hajj. There is no disagreement among scholars that capability is a condition for the obligation of Hajj (1), due to His saying: {In it are clear signs [such as] the standing place of Abraham. And whoever enters it shall be safe. And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds.} [Al Imran: 97]. However, scholars differed in defining the reality of this capability and its conditions, noting that capability is of two types:",
    "foot_note": "1. See: Al-Tamhid (9/ 125), Al-Majmu' (7/ 63), Al-Mughni (3/ 87), Al-Bahr Al-Ra'iq (2/ 335).",
    "book_id": "1062",
    "new_page_number": 12
  },
  {
    "serial_number": "4596042",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 14,
    "volume_number": 1,
    "text": "Physical capability (by oneself), and capability through others. What concerns us in this issue is the first type, which is physical capability for the Afaqi (one living outside the Miqat boundaries) who has a distance between them and Mecca that qualifies as travel. Scholars have mentioned conditions to clarify the reality of capability; some are common to both men and women, and others are specific to women. I will detail what is specific to women. Among the conditions shared by men and women in defining the reality of capability are: 1. Health of the body, such that one is not sick and unable to stay stable on the mount (1). 2. Safety of the road, such that safety is the prevailing assumption (2). 3. Availability of necessary provisions. 4. Availability of a mount (transportation), either by ownership or by rental (3).",
    "foot_note": "1. See: Bada'i al-Sana'i (2/ 122), Al-Majmu' (7/ 41), Al-Mughni (3/ 91).\n2. See: Al-Majmu' (7/ 50), Al-Mubdi' (97/ 3), Al-Bahr Al-Ra'iq (2/ 338).\n3. See the third and fourth opinions: Al-Majmu' (7/ 41), Al-Mughni (3/ 88), Al-Bahr Al-Ra'iq (2/ 337).",
    "book_id": "1062",
    "new_page_number": 13
  },
  {
    "serial_number": "4596043",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 15,
    "volume_number": 1,
    "text": "As for the condition specific to women: The presence of a Mahram. A woman's Mahram is her husband or someone she is permanently forbidden to marry. Scholars have differed regarding this condition with several opinions, the most famous of which are: The First Opinion: Hajj is not obligatory for a woman who has no Mahram. This was stated by Al-Hasan, Al-Nakha'i, the Hanafis, the Hanbalis in their school, Ishaq, Ibn Al-Mundhir, and Al-Baghawi (1). They used the following as evidence: What Al-Bukhari (2) and Muslim (3) reported from the Hadith of Abu Huraira, who said: The Prophet, peace and blessings be upon him, said: 'It is not lawful for a woman who believes in Allah and the Last Day to travel a distance of a day and a night unless she has a Mahram with her.' The wording is Muslim's. Scholars interpreted this Hadith according to its general meaning; because 'a woman' (imra'ah) in the Hadith is indefinite in the context of negation, so it implies generality. Accordingly, Al-Nawawi titled a chapter in his explanation of Sahih Muslim: 'Chapter: A Woman's Travel with a Mahram for Hajj and Other Purposes.'",
    "foot_note": "1. See: Masa'il Ahmad by Abu Dawud (106), Sharh al-Sunnah (7/ 20), Tuhfat al-Fuqaha (2/ 287), Sharh Fath al-Qadir (2/ 491).\n2. Chapters: Shortening Prayer, Chapter: In what distance is prayer shortened (1/ 368) 1036.\n3. Book of Hajj, Chapter: A Woman's Travel with a Mahram for Hajj and Other Purposes (2/ 977) 1338.",
    "book_id": "1062",
    "new_page_number": 14
  },
  {
    "serial_number": "4596044",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 16,
    "volume_number": 1,
    "text": "2. What Al-Bukhari (1) and Muslim (2) reported from the Hadith of Ibn Abbas, may Allah be pleased with him, who said: The Prophet, peace and blessings be upon him, said: 'A woman should not travel except with a Mahram, and no man should enter upon her unless she has a Mahram.' A man said: 'O Messenger of Allah, I want to go out in such-and-such army, and my wife wants to perform Hajj.' He said: 'Go out [for Hajj] with her.' The wording is Al-Bukhari's. Al-Bukhari titled it: 'Chapter: Hajj of Women.' Al-Hafiz said: 'Meaning, is there an extra condition required for it compared to the Hajj of men or not?' (3). Al-Nawawi said: 'This indicates giving priority to the more important of conflicting matters; because when his travel for fighting conflicted with Hajj with her, he prioritized Hajj with her' (4), especially since Sa'id bin Mansur reported it from Hammad bin Zayd with the wording: A man said: 'O Messenger of Allah, peace and blessings be upon him, I vowed to go out in such-and-such army.' If it were not a condition, he would not have permitted him to abandon the vow (5). 3. What Al-Daraqutni (6) reported from the Hadith of Ibn Abbas who said: The Messenger of Allah said:",
    "foot_note": "1. Book of Hajj: Chapter of Women's Hajj (2/ 658) 1763.\n2. Book of Hajj: Chapter of A Woman's Travel with a Mahram for Hajj and Other Purposes (2/ 978) 1341.\n3. Al-Fath: (4/ 76).\n4. Sharh Al-Nawawi: (9/ 110).\n5. Al-Fath: (4/ 75).\n6. Al-Sunan (2/ 222), 30.",
    "book_id": "1062",
    "new_page_number": 15
  },
  {
    "serial_number": "4596045",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Messenger of Allah, peace and blessings be upon him, said: 'A woman should not perform Hajj except with a Mahram.' Al-Hafiz Ibn Hajar authenticated its chain in Al-Dirayah fi Takhrij Ahadith Al-Hidayah (1). Ibn Qudamah said: 'This is explicit in the ruling, and it contains a prohibition, and prohibition implies unlawfulness' (2). 4. They argued that a woman initiating travel in the Abode of Islam is not permitted without a Mahram, like voluntary Hajj, and that there is fear of temptation (Fitnah) for a woman without a Mahram. (3) The Second Opinion: That a Mahram is not a condition for obligatory Hajj, and she must go out for Hajj if she finds trustworthy company of men or women. This was stated by Malik (4), Al-Awza'i (5), Al-Shafi'i in his school (6), and Ahmad in one narration (7). They used the following as evidence:",
    "foot_note": "1. (2/ 4).\n2. Al-Mughni (3/ 98).\n3. See: Previous source, Al-Hidayah with Sharh Fath Al-Qadir: (2/ 420).\n4. See: Al-Muwatta (224), Al-Muntaqa Al-Baji (3/ 83).\n5. See: Al-Majmu' (7/ 86), Al-Mughni (3/ 237).\n6. See: Al-Umm (2/ 117).\n7. See: Al-Mughni (3/ 237), and Al-Insaf (3/ 411).",
    "book_id": "1062",
    "new_page_number": 16
  },
  {
    "serial_number": "4596046",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 18,
    "volume_number": 1,
    "text": "1. What Al-Bukhari reported (1), from the Hadith of Adi bin Hatim, who said: While I was with the Prophet, peace and blessings be upon him, a man came to him complaining of poverty, then another came complaining of banditry. He said: 'O Adi, have you seen Al-Hirah?' I said: 'I have not seen it, but I have been informed about it.' He said: 'If you live long enough, you will see a woman traveling in a litter (Dha'inah) from Al-Hirah until she circumambulates the Kaaba, fearing no one but Allah...'. The point of evidence is that it is a report in the context of praise and the elevation of Islam, so it is interpreted as permissibility (2). It was answered: Not everything the Prophet, peace and blessings be upon him, foretold would happen implies prohibition or permissibility, because he stated its occurrence, not its permissibility. And since mere reporting of the unseen does not imply permissibility, how can obligation be derived from it? According to those who say it is obligatory when company is available (3). 2. What Al-Bukhari reported in his Sahih (4) via Ibrahim bin Sa'd, from his father, from his grandfather: Umar permitted the wives of the Prophet, peace and blessings be upon him, in his last Hajj",
    "foot_note": "1. Book of Virtues, Chapter: Signs of Prophethood in Islam (3/ 1316) 3400.\n2. Al-Fath: (4/ 76).\n3. Al-Majmu': (7/ 86).\n4. Book of Hajj, Chapter: Hajj of Women (2/ 658) 1763.",
    "book_id": "1062",
    "new_page_number": 17
  },
  {
    "serial_number": "4596047",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 19,
    "volume_number": 1,
    "text": "to perform Hajj, so he sent Uthman bin Affan and Abd al-Rahman bin Awf with them. Al-Hafiz said: 'Among the evidences for the permissibility of a woman traveling with trustworthy women if the road is safe is the first Hadith of the chapter, due to the agreement of Umar, Uthman, Abd al-Rahman bin Awf, and the wives of the Prophet, peace and blessings be upon him, on that, and the lack of objection from other Companions against them regarding it' (1). It was answered that the wives of the Prophet, peace and blessings be upon him, are the Mothers of Believers, so this is interpreted as a special case. This was countered by saying they are specific in terms of prohibition of marriage, not in terms of being Mahrams. It was also answered: This absolute narration came restricted in Ibn al-Jawzi's Al-Muntazam (2) stating that he sent their guardians with them, and sending Uthman and Abd al-Rahman was for extra care for them. 3. That the presence of someone she trusts stands in place of a Mahram (3). It is answered that no one is more trustworthy than the Companions, yet the Messenger, peace and blessings be upon him, forbade their women",
    "foot_note": "1. Al-Fath: (4/ 76).\n2. (4/ 327).\n3. Al-Ishraf by Abd al-Wahhab (1/ 217).",
    "book_id": "1062",
    "new_page_number": 18
  },
  {
    "serial_number": "4596048",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 20,
    "volume_number": 1,
    "text": "from traveling except with their Mahrams. Considering the evidence and instructions presented, it appears—and Allah knows best—that Hajj is not obligatory for a woman unless there is a husband or Mahram, for the following reasons: 1. The Hadiths used by the majority are authentic and explicit, and there is nothing contradicting them. Ibn Al-Mundhir said: 'They abandoned the apparent meaning of the Hadith, and each of them stipulated a condition for which he has no proof' (1). 2. The Hadith of Adi bin Hatim, may Allah be pleased with him, used by the proponents of the second opinion, indicates she travels alone, yet they stipulated the company of men and women, so they did not follow their own evidence nor the evidence of the first opinion. Topic Two: Permission of the Husband for the Woman in the Obligatory Hajj. If the Hajj is voluntary, scholars do not differ that a woman may not enter Ihram without her husband's permission. If she enters Ihram without his permission, he is permitted to make her exit Ihram if he wishes. Consensus on this has been reported (2).",
    "foot_note": "1. See: Al-Mughni (3/ 534).\n2. Reported by Ibn Al-Mundhir in Al-Ijma' (16). See also: Al-Kafi by Ibn Abd al-Barr (1/ 413), Al-Majmu' (8/ 323), Al-Mughni (3/ 533), Hashiyat Ibn Abidin (2/ 465).",
    "book_id": "1062",
    "new_page_number": 19
  },
  {
    "serial_number": "4596049",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 21,
    "volume_number": 1,
    "text": "However, if the Hajj is obligatory (Fard), there are two opinions regarding the ruling on a husband preventing his wife from Ihram: The First Opinion: The husband does not have the right to prevent his wife from proceeding to the obligatory Hajj if the conditions of obligation are met. This is the view held by the Hanafis (1), the Hanbalis (2), the Shafi'is in a less preferred view (3), and Ibn Hazm (4). The Malikis have two views based on the opinion regarding the immediacy of Hajj. Some said: Hajj is obligatory immediately (Ala al-Fawr), chosen by Qadi Abd al-Wahhab (5), and based on this, the husband has no right to prevent her. Others said: Hajj is obligatory with delay allowed (Ala al-Tarakhi), chosen by Al-Qurtubi. According to this view, there is a disagreement on preventing her, with two opinions: one is that he does not have the right to prevent her. They used the following as evidence:",
    "foot_note": "1. See: Al-Mabsut (4/ 112), Al-Durr Al-Mukhtar Sharh Tanwir Al-Absar (2/ 465).\n2. See: Al-Mughni (3/ 532), Al-Insaf (3/ 399).\n3. See: Al-Umm (2/ 117), Nihayat Al-Muhtaj (3/ 368).\n4. See: Al-Muhalla (7/ 47).\n5. See: Al-Ishraf (1/ 211).",
    "book_id": "1062",
    "new_page_number": 20
  },
  {
    "serial_number": "4596050",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 22,
    "volume_number": 1,
    "text": "1. What Al-Bukhari and Muslim (1) reported from the Hadith of Ibn Umar, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: 'Do not prevent the female servants of Allah from the mosques of Allah.' They said: If she is not prevented from the mosque for prayer, she should not be prevented from intending the Sanctuary for Hajj. The Hadith was answered by saying it is interpreted as a prohibition of dislike (Tanzihi) or applied to unmarried women; because unmarried women do not have an immediate right attached to them [by a husband], such as a daughter or sister and the like, and that the meaning is 'do not prevent them from the mosques of Allah for prayers' (2) (3). 2. That Hajj is obligatory, and he has no right to prevent her from obligations, just as he has no right to prevent her from prayer and fasting. The Shafi'is answered that the duration of Hajj is long, unlike fasting and prayer. The Second Opinion: The husband may prevent his wife from going out for the obligatory Hajj.",
    "foot_note": "1. See: Tafsir Al-Qurtubi (4/ 114).\n2. Sahih Al-Bukhari Book of Friday Prayer, Chapter: Is Ghusl required for women who do not attend Friday prayer... (1/ 305) 858, and Muslim in his Sahih in Chapters on Prayer, Chapter: Women going out to mosques... (1/ 326) 442.\n3. See: Al-Majmu' (8/ 330).",
    "book_id": "1062",
    "new_page_number": 21
  },
  {
    "serial_number": "4596051",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 23,
    "volume_number": 1,
    "text": "This is the view of the Shafi'is in the more correct of the two opinions (1), and the second opinion of some Malikis (2) who held that Hajj is obligatory with delay allowed. They used the following as evidence: 1. What Al-Tabarani reported in Al-Saghir (3) and Al-Awsat (4), and Al-Daraqutni in Al-Sunan (5), Ibn Adi in Al-Kamil (6), and Al-Bayhaqi in Al-Kubra (7) through paths from Hassan bin Ibrahim, from Ibrahim bin Al-Sa'igh, from Nafi', from Ibn Umar from the Messenger of Allah, peace and blessings be upon him, regarding a woman who has a husband and has wealth, but he does not permit her to perform Hajj: 'She has no right to go except with her husband's permission.' The wording is Al-Daraqutni's. Al-Tabarani said: Only Hassan narrated it from Ibrahim. Ibn Adi said likewise.",
    "foot_note": "1. See: Previous source, Mughni Al-Muhtaj (1/ 536).\n2. See: Al-Qawanin Al-Fiqhiyyah (123), Minah Al-Jalil (2/ 162).\n3. (1/ 439) 582.\n4. (4/ 296) 4247.\n5. (2/ 223) 31\n6. (2/ 373) 501.\n7. (5/ 224) 9906.",
    "book_id": "1062",
    "new_page_number": 22
  },
  {
    "serial_number": "4596052",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 24,
    "volume_number": 1,
    "text": "Al-Haythami said in Majma' Al-Zawa'id (1): 'Al-Tabarani narrated it in Al-Saghir and Al-Awsat, and its narrators are trustworthy.' Al-Suyuti indicated it as Hasan in Al-Jami' Al-Saghir (2), and Al-Hafiz cited it in Al-Fath (3) and remained silent about it. Al-Albani weakened the Hadith in Da'if Al-Jami' Al-Saghir (4). 2. The proponents of this view mentioned that the husband's right is immediate, and Hajj allows for delay, so what is immediate takes precedence, just as the waiting period (Iddah) takes precedence over Hajj without disagreement (5). The majority answered that the husband's right is continuous forever; if he possessed the right to prevent her this year, he would possess it every year, leading to the nullification of one of the pillars of Islam, unlike the waiting period which does not last forever (6).",
    "foot_note": "1. (3/ 215).\n2. (1/ 101) 4919, See: Fath Al-Qadir by Al-Munawi (5/ 278).\n3. (4/ 77).\n4. 4919.\n5. See: Al-Majmu' (8/ 329), Mughni Al-Muhtaj (1/ 536).\n6. See: Al-Mughni: (3/ 531)",
    "book_id": "1062",
    "new_page_number": 23
  },
  {
    "serial_number": "4596053",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 25,
    "volume_number": 1,
    "text": "The preferred view is the first one, which is that a wife may perform the obligatory Hajj without the husband's permission if the conditions are met. This is because the opinion allowing the husband to prevent his wife from performing the obligation of Hajj leads to the abandonment of Hajj in many cases. Here, you observe that some husbands abuse their authority (Qawamah), understanding it in an inverted manner; to hinder the Muslim woman from performing her obligations under the pretext of the obligation to listen and obey him. If he knew the evidence and Allah intended good for him and gave him understanding of religion, he would not have done what he did, and would have refrained from much of what is before him. There is no power or strength except with Allah. Topic Three: The Obligation of Hajj. One of the manifestations of facilitation in Hajj is that Allah made it obligatory upon His capable servants once in a lifetime, and the Ummah has agreed upon this. Ibn Qudamah says in Al-Mughni: 'The Ummah has agreed on the obligation of Hajj upon the capable person once in a lifetime (1).' Among the evidences for this: 1. What Muslim reported in the Chapter: Obligation of Hajj Once in a Lifetime (2) from",
    "foot_note": "1. (3/ 15).\n2. Book of Hajj (2/ 5/ 216) 1337.",
    "book_id": "1062",
    "new_page_number": 24
  },
  {
    "serial_number": "4596054",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 26,
    "volume_number": 1,
    "text": "the Hadith of Abu Huraira who said: The Messenger of Allah, peace and blessings be upon him, addressed us saying: 'O people, Allah has made Hajj obligatory upon you, so perform Hajj.' A man said: 'Every year, O Messenger of Allah?' He remained silent until the man said it three times. Then the Messenger of Allah, peace and blessings be upon him, said: 'If I said yes, it would have become obligatory, and you would not have been able to do it.' Then he said: 'Leave me as I have left you, for those before you were destroyed by their excessive questioning and their disagreement with their prophets. So if I order you to do something, do of it what you can, and if I forbid you from something, leave it.' 2. What Ahmad (1), Abu Dawud (2), and Ibn Majah (3) reported from the Hadith of Ibn Abbas, who said: The Messenger of Allah, peace and blessings be upon him, addressed us saying: 'O people, Hajj has been prescribed for you.' Al-Aqra' bin Habis stood up and said: 'Is it every year, O Messenger of Allah?' He said: 'If I said it, it would have become obligatory, and if it became obligatory, you would not act upon it, and you would not be able to act upon it. Hajj is once, so whoever adds more, it is voluntary.' The wording is Ahmad's, and Al-Albani authenticated it (4). Reflect—may Allah guide you—on the words of the Hadith. In the first Hadith: 'If I said",
    "foot_note": "1. (1/ 290) 2642.\n2. (2/ 139) 1721.\n3. (2/ 963) 2885.\n4. Sahih Sunan Abi Dawud: (2/ 139) 172.",
    "book_id": "1062",
    "new_page_number": 25
  },
  {
    "serial_number": "4596055",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 27,
    "volume_number": 1,
    "text": "yes, it would have become obligatory,' then he explained the reason for Hajj being obligatory once in a lifetime: 'and you would not have been able to do it.' In the other narration: 'you would not act upon it, and you would not be able to act upon it.' Then he clarified the ruling: 'Hajj is once, so whoever adds more, it is voluntary.' Allah spoke the truth when He said: {There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you and to the believers is kind and merciful.} [At-Tawbah: 128]. It should be noted here that there are voluntary acts specific to the individual himself, such as prayer and fasting; these return to the volunteer alone. Others benefit people, and their righteousness and good extend to them, such as voluntary charity and benevolence; the more a person does of these, the more merit it is for him and benefit for others, and there is no extravagance in good. The third category of voluntary acts does not relate to the person alone but relates to others due to crowding in the place or otherwise. Hajj is of the third category, for the ritual sites are limited and the time is narrow. (Every person of intellect knows that if a small percentage of Muslims who have not performed Hajj at all—let it be 1%—performed Hajj, the number of those standing at Arafat would be 12 million pilgrims. The place would not accommodate them, many would miss Hajj, and they would necessarily harm one another.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 26
  },
  {
    "serial_number": "4596056",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 28,
    "volume_number": 1,
    "text": "Therefore, pilgrims now are (0.1%) of the population ratio (i.e., one in a thousand). This means a people like Indonesia (200 million) would need a thousand years to be able to perform Hajj, and this is a purely theoretical assumption. Add to that the annual suffering from massive overcrowding which strips the obligation of its spirituality and sanctity, turning it into clamor, noise, fighting, and arguing. The scene repeats periodically, and hundreds die under the feet of their brothers while they are all engaged in performing one of Allah's obligations! Oh, the deep sorrow; it is assumed that the motive for this blessed journey is faith. So how can a Muslim living nearby in these lands ignore the difficult effects caused by repeating Hajj every year, or every other year, upon his Muslim brothers coming from afar, performing the obligation—not the voluntary one—including elders, women, the weak, and the sick? He does not care about them nor concern himself with their suffering; the important thing is that he continues what he is used to regarding Hajj! Many people repeat: 'What harm does my presence do, as I am a single individual? And what good does my absence do?' This is strange logic suggesting rampant selfishness and an absence of a sense of responsibility. If everyone who read these lines took it upon themselves to donate the value of",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 27
  },
  {
    "serial_number": "4596057",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 29,
    "volume_number": 1,
    "text": "the voluntary Hajj to his Muslim brothers, and also donate the space he would occupy if he performed Hajj in Mina, Arafat, or Muzdalifah, we could effectively contribute to alleviating congestion, facilitating Hajj, and sparing Muslims the consequences of confusion and killing at the ritual sites. Giving charity with the value of Hajj is better in such times when people's need for money increases, as in disasters striking Islamic lands such as earthquakes, famines, or wars that have not ceased for decades (1). Ibn Muflih mentioned in Al-Furu' that Imam Ahmad was asked: 'Should one perform voluntary Hajj or connect with his relatives?' He said: 'If they are needy, connecting with them is more beloved to me.' Ibn Hani reported in this issue that Imam Ahmad said: 'He places it in hungry livers' (2). In Al-Zuhd by Imam Ahmad, from Al-Hasan, he said: 'One of them says: I will perform Hajj, I will perform Hajj, while he has already performed Hajj! Connect a womb (relative), give charity to a distressed person, do good to a neighbor' (3).",
    "foot_note": "1. If'al wa la Haraj by Sheikh Salman al-Ouda (42 - 43).\n2. Al-Furu' (2/ 497).\n3. 261.",
    "book_id": "1062",
    "new_page_number": 28
  },
  {
    "serial_number": "4596058",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 30,
    "volume_number": 1,
    "text": "Sheikh al-Islam Ibn Taymiyyah said in Al-Fatawa Al-Kubra: 'Hajj in the prescribed manner is better than charity which is not obligatory. However, if he has needy relatives, charity given to them is better. Likewise, if there are people desperate for his spending (1).' In such conditions where pilgrims suffer from overcrowding and many issues in the rites, we need to present the obligation of Hajj as once in a lifetime, and weigh the preference between voluntary Hajj and charity, especially since it is established that he, peace and blessings be upon him, performed Hajj only the Farewell Pilgrimage. He, peace and blessings be upon him, said to his wives in the Farewell Pilgrimage: 'This, then sticking to the mats [i.e., staying home]' (2). And his saying, peace and blessings be upon him, to Umar: 'O Umar, you are a strong man, do not crowd at the Stone and harm the weak. If you find a space, touch it; otherwise, face it, say Tahlil (La ilaha illa Allah) and Takbir (Allahu Akbar)' (3). This requirement specifically offers ease to every weak person, be it an elder, a woman, or a sick person. If the strong people sufficed with the obligation of",
    "foot_note": "1. / 382.\n2. Abu Dawud (2/ 140, 1722), and Al-Albani authenticated it in Al-Sahihah (5/ 525) 2401.\n3. Reported by Ahmad (1/ 28) 190, and it is a strong Hadith.",
    "book_id": "1062",
    "new_page_number": 29
  },
  {
    "serial_number": "4596059",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 31,
    "volume_number": 1,
    "text": "Hajj and did not indulge themselves by consecutively performing voluntary Hajj, and gave the value of their Hajj in charity to every Muslim who has not performed his obligation, they would have given charity with their place before their wealth. And much harm would not have befallen many of the weak while performing the rituals. The one who sees with eyesight before insight sees thousands of strong people harming the weak, oblivious to His saying: {Do not violate the rites of Allah or [the sanctity of] the sacred month or [neglect the marking of] the sacrificial animals and garlanding [them] or [violate the safety of] those coming to the Sacred House seeking bounty from their Lord and [His] approval} [Al-Ma'idah: 2] and the aforementioned saying of the Prophet, peace and blessings be upon him, to Umar: 'O Umar, you are a strong man, do not crowd at the Stone and harm the weak; if you find a space, touch it; otherwise, face it, say Tahlil, and Takbir.' Topic Four: Ihram of the Menstruating Woman for Hajj or Umrah. Scholars have agreed on the permissibility and legitimacy of Ihram for a menstruating woman (1), and it is recommended for her, if she wishes to enter Ihram, to bathe (Ghusl) just as the non-menstruating woman bathes (2); rather, it is more emphasized for the menstruating woman due to the report concerning her. Among the evidences of scholars for this requirement:",
    "foot_note": "1. Al-Nawawi cited consensus in Sharh Muslim (5/ 249).\n2. Al-Mughni (3/ 133).",
    "book_id": "1062",
    "new_page_number": 30
  },
  {
    "serial_number": "4596060",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 32,
    "volume_number": 1,
    "text": "1. The Hadith of Jabir in Sahih Muslim, in which he said: '...until we came to Dhu al-Hulayfah, Asma bint Umays gave birth to Muhammad bin Abi Bakr. She sent to the Messenger of Allah, peace and blessings be upon him: How shall I act? He said: Bathe, wrap a cloth around yourself (Istithfar) (1), and enter Ihram (2).' The menstruating woman follows the same ruling as the woman with postpartum bleeding; indeed menstruation is a type of it. 2. What Abu Dawud (3) and Al-Tirmidhi (4) reported from the Hadith of Ibn Abbas, from the Prophet, peace and blessings be upon him, who said: 'The menstruating woman and the woman with postpartum bleeding, when they come to the appointed time (Miqat), should bathe, enter Ihram, and perform all the rites except Circumambulation (Tawaf) of the House.' Al-Albani authenticated it in Al-Sahihah (5). 3. The Prophet, peace and blessings be upon him, commanded Aisha to bathe for the Hajj Ihram while she was menstruating. Al-Bukhari (6) and Muslim (7) reported from the Hadith of Aisha who said: We went out coinciding",
    "foot_note": "1. Istinfar/Istithfar: To tie something around her waist, take a broad cloth, place it over the site of blood, and tie its two ends from her front and back to what is tied around her waist. See: Al-Mughni (1/ 421), Al-Nihayah by Ibn Al-Athir (4/ 235).\n2. Book of Hajj, Chapter: The Hajj of the Prophet, peace be upon him (2/ 887) 1218.\n3. (2/ 144) 1744.\n4. Book of Menstruation, Chapter: A woman combing her hair when bathing after menstruation (1/ 120) 311.\n5. (4/ 332) 1818.\n6. (3/ 282) 945.\n7. Book of Hajj, Chapter: Explanation of the types of Ihram (2/ 870) 1211.",
    "book_id": "1062",
    "new_page_number": 31
  },
  {
    "serial_number": "4596061",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 33,
    "volume_number": 1,
    "text": "with the crescent of Dhu al-Hijjah. It contains: 'So the Day of Arafah came upon me while I was menstruating. I complained to the Prophet, peace and blessings be upon him, and he said: Leave your Umrah, undo your hair, comb it, and enter Ihram for Hajj. So I did.' 4. Because it is a bath intended for the ritual, so the menstruating woman and the pure woman are equal in it. However, scholars said: If the menstruating woman hopes for purity before leaving the Miqat, it is recommended for her to delay the bath until she becomes pure; so it is more perfect for her (1). In this topic, you will see that the Messenger of Allah, peace and blessings be upon him, established a rule for the menstruating and postpartum woman, which they carry with them in all rites, which is his saying: 'And they perform all the rites except Circumambulation of the House' and his saying which will come later to Aisha: 'Do what the pilgrim does except do not circumambulate the House until you are pure.' So the menstruating woman is equal to others in all rites, including standing at Arafat, moving to Muzdalifah, throwing pebbles, or remembrance. Indeed, some used this Hadith as evidence for the permissibility of a menstruating woman reading the Quran, and this was the view of Sheikh al-Islam (2). This is nothing but the greatest proof of the tolerance and ease of Islam, and its consideration for the conditions of the servants and kindness to them.",
    "foot_note": "1. See: Al-Majmu' (7/ 212), and Al-Mughni (5/ 109).\n2. Majmu' Al-Fatawa (21/ 460). See also: Al-Awsat (2/ 97), Al-Majmu' (2/ 356), and Al-Mughni (2/ 199).",
    "book_id": "1062",
    "new_page_number": 32
  },
  {
    "serial_number": "4596062",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 34,
    "volume_number": 1,
    "text": "Topic Five: Stipulating a Condition (Ishtirat) for the Pilgrim. Ishtirat is for the person in Ihram to say: 'If something detains me, then my place of release is where You detain me.' A Hadith regarding this was reported by Al-Bukhari (1) and Muslim (2) from the Hadith of Aisha, who said: 'The Messenger of Allah, peace and blessings be upon him, entered upon Duba'ah bint Al-Zubayr and said to her: Perhaps you intended to perform Hajj? She said: By Allah, I do not find myself except in pain. He said to her: Perform Hajj, stipulate a condition, and say: O Allah, my place of release is where You detain me.' She was married to Al-Miqdad. In a narration by Al-Nasa'i: 'For you have from your Lord what you stipulated' (3). The benefit for those who uphold stipulation is that if one is blocked, they become released immediately, and nothing is upon them (4). Scholars differed on whether stipulation is recommended for every person intending Hajj and Umrah, with three opinions:",
    "foot_note": "1. Book of Marriage, Chapter: Suitability in Religion (5/ 1957) 4801.\n2. Book of Hajj, Chapter: Permissibility for the Muhrim to Stipulate Release due to Sickness and the Like (2/ 867) 1207.\n3. (5/ 167) 2766.\n4. See: Al-Istidhkar (4/ 410).",
    "book_id": "1062",
    "new_page_number": 33
  },
  {
    "serial_number": "4596063",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 35,
    "volume_number": 1,
    "text": "The First Opinion: The recommendation of stipulation absolutely. This is the well-known view of the Hanbali school and the correct view of the Shafi'i school (1); based on the aforementioned Hadith of Duba'ah. The point of evidence from it is: consideration is given to the generality of the wording, not the specificity of the cause. So if the Prophet, peace and blessings be upon him, directs a ruling to a person, it is general for that person and for the Ummah; because it is not possible for the Prophet, peace and blessings be upon him, to address every person individually. If he addresses one of the Ummah with a legal ruling, the rest of the Ummah shares in that ruling. Also, the pilgrim performing Hajj or Umrah is not safe from an excuse befalling them. Second: That stipulation is not recommended. This was stated by Malik and Abu Hanifa (2). They answered the Hadith of Duba'ah by saying it was a specific case, evidenced by the fact that the Prophet, peace and blessings be upon him, did not guide all the Companions to do so, including at least Asma bint Umays who gave birth to Muhammad bin Abi Bakr at Dhu al-Hulayfah, since the postpartum period usually lasts long and she might arrive in Mecca before becoming pure, yet the Prophet, peace and blessings be upon him, did not guide her to that. Third: Stipulation is recommended for those whose condition is like that of Duba'ah bint Al-Zubayr. So if a person enters Ihram while sick, or fearing",
    "foot_note": "1. See: Al-Mughni (3/ 127), Sharh Al-Nawawi (8/ 131).\n2. See: Al-Istidhkar (4/ 410), Mufid Al-Anam (1/ 87), Awn Al-Ma'bud (5/ 135).",
    "book_id": "1062",
    "new_page_number": 34
  },
  {
    "serial_number": "4596064",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 36,
    "volume_number": 1,
    "text": "an enemy, or fearing missing Hajj, or loss of provisions. This is the opinion of Sheikh al-Islam Ibn Taymiyyah (1); because he, peace and blessings be upon him, did not command everyone who performed Hajj to do so, nor was it reported from him, peace and blessings be upon him, that he stipulated a condition. Rather, he ordered it for the one who complained of pain. So others who fear the occurrence of an obstacle preventing them from completing the ritual are analogized to her. This opinion is the most correct, as it combines the evidences, and applying two evidences is better than applying one and neglecting the other.",
    "foot_note": "1. Mansak Sheikh Al-Islam (18).",
    "book_id": "1062",
    "new_page_number": 35
  },
  {
    "serial_number": "4596065",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 37,
    "volume_number": 1,
    "text": "Chapter Two: Manifestations of Facilitation During Hajj. Perhaps, O virtuous one, you have clearly noticed Allah's facilitation for His servants in the obligation of Hajj. In this chapter, by Allah's permission, you will find that facilitation was not limited to the obligation of Hajj only, but appeared clearly in the rites of Hajj and what relates to it. This chapter will address two topics: Topic One: Manifestations of Facilitation in the Pillars of Hajj, containing two issues: Issue One: Facilitation in Standing at Arafat. Issue Two: Facilitation in Tawaf al-Ifadah. Topic Two: Manifestations of Facilitation in the Duties of Hajj, containing three issues: Issue One: Hastening the departure from Muzdalifah. Issue Two: Facilitation in throwing the pebbles (Ramy). Issue Three: Dropping of the Farewell Tawaf for the menstruating woman.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 36
  },
  {
    "serial_number": "4596066",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 38,
    "volume_number": 1,
    "text": "Topic One: Manifestations of Facilitation in the Pillars of Hajj. Scholars agreed that Hajj has two pillars: Standing at Arafat and Tawaf (Circumambulation). They differed on others. Issue One: Facilitation in Standing at Arafat: It is a pillar by consensus, as reported by Ibn Al-Mundhir, Al-Kisa'i, Ibn Al-Arabi, Ibn Qudamah, Al-Nawawi, Ibn Taymiyyah, and others (1); due to his saying, peace and blessings be upon him: 'Hajj is Arafat' (2). Among the manifestations of facilitation in standing at Arafat: Standing at Arafat is sufficient at any hour, night or day, from the rising of the sun to the break of dawn on the Day of Sacrifice (3). Sheikh al-Islam says: 'Whoever does not reach Arafat except at night, the standing suffices him even for a moment in some of its corners... and there is no blood penalty (Dam) upon him; because the Prophet, peace and blessings be upon him, mentioned that he",
    "foot_note": "1. See: Al-Ijma' by Ibn Al-Mundhir (1/ 54), Al-Istidhkar (4/ 283), Al-Mujtahid (2/ 140), Al-Majmu' (8/ 103), Sharh Al-Umdah (3/ 572).\n2. Its citation will follow.\n3. See: Al-Kafi fi Fiqh Ibn Hanbal (1/ 442), Al-Majmu' (8/ 101), Sharh Fath Al-Qadir (2/ 483).",
    "book_id": "1062",
    "new_page_number": 37
  },
  {
    "serial_number": "4596067",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 39,
    "volume_number": 1,
    "text": "catches the Hajj, and that his Hajj is complete, and he has completed his prescribed duties, and he did not mention that he owes a blood penalty. Delaying clarification past the time of need is not permissible, especially in a great ruling followed by someone announcing it among the people in the Farewell Pilgrimage' (1). The evidence for this is what Ahmad (2) and the Four (3) reported from the Hadith of Urwa bin Mudarris Al-Ta'i, who said: I came to the Prophet, peace and blessings be upon him, while he was at Jam' (Muzdalifah). I said: 'O Messenger of Allah, I came to you from the mountain of Tayy; I exhausted myself and tired my mount. By Allah, I did not leave any hill except that I stood upon it. Do I have a valid Hajj?' He said: 'Whoever witnessed this prayer with us (meaning: the Fajr prayer) at Jam', and stood with us until we departed from it, and had departed before that from Arafat by night or day, then his Hajj is complete, and he has completed his prescribed duties.' The wording is Ahmad's, and its chain is authentic. And the Hadith of Abd al-Rahman bin Ya'mar Al-Dili who said: I witnessed the Messenger of Allah, peace and blessings be upon him, while he was standing at Arafat, and people from Najd came to him and said: 'O Messenger of Allah, how is the Hajj?' He said: 'Hajj is Arafat. So whoever comes before the Fajr prayer of the night of Jam' (Muzdalifah)",
    "foot_note": "1. Sharh Al-Umdah (3/ 578).\n2. (4/ 15) 1653.\n3. Al-Tirmidhi (3/ 238) 891 and said: Hasan Sahih Hadith, Abu Dawud (2/ 196) 1950, Al-Nasa'i (5/ 263) 4039, and Ibn Majah (2/ 1004) 306.",
    "book_id": "1062",
    "new_page_number": 38
  },
  {
    "serial_number": "4596068",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 40,
    "volume_number": 1,
    "text": "then his Hajj is complete (1).' The Hadith. In the narration of Al-Tirmidhi: Then he ordered a caller who proclaimed: 'Hajj is Arafat.' And in Al-Tirmidhi also: 'And he had a man ride behind him and proclaim.' If someone says: Whoever stood during the day and departed before sunset, is he obligated to do anything? This issue is based on the ruling of departing before sunset for one who stood at Arafat during the day. Scholars differed on this with two opinions: - The First Opinion: It is obligatory to stand at Arafat until sunset. This is the view of the Hanafis (2), a view among the Shafi'is (3), and the [official] Madhhab of the Hanbalis (4). They used the following as evidence: 1. That the Prophet, peace and blessings be upon him, remained standing at Arafat until the sun set, and the yellowness disappeared slightly until the disk disappeared, then he departed. And he, peace and blessings be upon him, said: 'Take your rites from me,' reported by Muslim (5) from the Hadith of Jabir. So obligation is derived from his action",
    "foot_note": "1. Al-Tirmidhi: (3/ 237) 889, Abu Dawud (2/ 196) 1950, and Al-Albani authenticated it in Al-Irwa (4/ 259) 1067.\n2. Al-Mabsut by Al-Sarakhsi (4/ 63).\n3. See Al-Majmu' (8/ 101).\n4. See: Al-Insaf (2/ 108).\n5. (2/ 943) 1297.",
    "book_id": "1062",
    "new_page_number": 39
  },
  {
    "serial_number": "4596069",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 41,
    "volume_number": 1,
    "text": "-peace and blessings be upon him; because it occurred as an explanation for a general command, and a command implies obligation when absolute. This evidence is discussed [and countered] by saying that obligation is only validly ruled if it is free from opposing evidence. However, here the Hadith of Urwa bin Mudarris refutes this deduction. It contains: 'Whoever witnessed this prayer of ours, and stood with us until we depart, and stood before that at Arafat by night or day, then his Hajj is complete, and he has completed his prescribed duties.' This Hadith diverts the implication of the action from obligation to recommendation, especially since he, peace and blessings be upon him, did not order anyone to adhere to standing until sunset, nor did he forbid departing before sunset, despite the need for clarification due to the large number of the Ummah and the variance in their understanding. Delaying clarification past the time of need is not permissible. 2. What Ibn Khuzaymah reported (1) from the Hadith of Ibn Abbas who said: 'The people of Jahiliyyah used to stand at Arafat until the sun was on the tops of the mountains like turbans on men's heads, then they would depart.' Ibn Khuzaymah said: 'I absolve myself of responsibility for Zam'ah bin Salih.' Al-Hafiz said about him in Al-Taqrib (2): 'Weak.' The Hadith has other witnesses mentioned by",
    "foot_note": "1. (4/ 262) 2838.\n2. 2035.",
    "book_id": "1062",
    "new_page_number": 40
  },
  {
    "serial_number": "4596070",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 42,
    "volume_number": 1,
    "text": "Al-Zayla'i in Nasb Al-Rayah (1), so the Hadith is Hasan due to the sum of its witnesses. The point of evidence from it is that departing after sunset opposes the action of the polytheists, and it is obligatory because it is commanded. However, it was discussed [and countered] that even if it were authentic, opposing the polytheists would be prescribed but not restricted to sunset; because restricting it to sunset is an addition not found in the text. It was also said: Opposing here is interpreted as recommendation due to the Hadith of Urwa, for it came in a context of generality, absoluteness, and legislation for the entire Ummah. According to this opinion, whoever departs from Arafat before sunset must return to it at night, otherwise he owes a blood penalty (Dam), and his Hajj is valid, except according to Imam Malik who said: He has no Hajj. Ibn Abd al-Barr said (2): We do not know anyone among the scholars who held Malik's view. The basis of his view is what Ibn Umar narrated that the Messenger of Allah, peace and blessings be upon him, said: 'Whoever catches Arafat by night has caught Hajj, and whoever misses Arafat by night has missed Hajj, so let him dissolve it into an Umrah, and Hajj is upon him the following year.' Reported by Al-Daraqutni (3). Al-Hafiz said:",
    "foot_note": "1. / 66.\n2. See: Al-Tamhid (9/ 276), Al-Istidhkar (4/ 282).\n3. (2/ 124) 21.",
    "book_id": "1062",
    "new_page_number": 41
  },
  {
    "serial_number": "4596071",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 43,
    "volume_number": 1,
    "text": "'It contains Ibn Abi Layla, who had poor memory' (1). Even assuming the Hadith is authentic, it does not negate the validity of standing at Arafat during the day for one who did not stand at night. Rather, the most it implies is that the time of standing extends to the end of the night as indicated by the Hadith of Urwa bin Mudarris. The evidence for those who mandate a blood penalty, despite their disagreement on distinguishing between the ignorant and the intentional, and between one who returns to Arafat and one who does not, is the saying of Ibn Abbas, may Allah be pleased with him: 'Whoever forgets any of his rites or abandons it, let him shed blood' (2). Al-Nawawi authenticated it (3). The Second Opinion: It is recommended to stand at Arafat until sunset. If one stood there during the day and then departed before sunset, there is nothing upon him. This is the more correct view according to the Shafi'is (4), and a narration in the Hanbali school (5). It was chosen by Al-Nawawi and Al-Shanqiti (6).",
    "foot_note": "1. Al-Talkhis Al-Habir (2/ 291).\n2. Al-Muwatta (419) 940.\n3. (8/ 101).\n4. Al-Majmu' (8/ 101).\n5. Al-Insaf (4/ 30).\n6. Adwa' Al-Bayan (4/ 438).",
    "book_id": "1062",
    "new_page_number": 42
  },
  {
    "serial_number": "4596072",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 44,
    "volume_number": 1,
    "text": "They used the following as evidence: First: The aforementioned Hadith of Urwa bin Mudarris. The point of evidence: 'and stood before that at Arafat by night or day, then his Hajj is complete, and he has completed his prescribed duties' indicates the sufficiency of standing for one who stood during the day and then departed before sunset, as the Prophet, peace and blessings be upon him, ruled that his Hajj was complete and his duties fulfilled. The majority answered that 'standing during the day' in the Hadith means standing until sunset; due to the action of the Prophet, peace and blessings be upon him, and the Rightly Guided Caliphs, as they did not depart until after sunset. If one departs before sunset, his Hajj is valid according to Urwa's Hadith, but blood is obligatory upon him due to the report of Ibn Abbas. Al-Shanqiti says: 'His saying, peace and blessings be upon him: 'then his Hajj is complete' arranged with 'Fa' (then) upon his standing at Arafat by night or day, indicates that the one standing during the day completes his Hajj by that. The expression using the word 'complete' (Tam) is apparent in the lack of necessity for compensation by blood. No explicit text has been established contradicting the apparent meaning of this Hadith. The lack of necessity for blood for the one who limits himself to the day is the correct view in the Shafi'i school, due to the indication of this Hadith for that as you see, and knowledge is with Allah (1).",
    "foot_note": "1. Previous source.",
    "book_id": "1062",
    "new_page_number": 43
  },
  {
    "serial_number": "4596073",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 45,
    "volume_number": 1,
    "text": "Second: No evidence has been established necessitating standing until sunset, and the evidences mentioned by the majority are not accepted for deduction, either due to generality of indication or lack of authenticity. Third: The original state is freedom from liability (Bara'at al-Dhimmah), and there is no text transferring from this original state, so it remains. Fourth: The possibility of reconciling the Hadiths by interpreting what appears to be a command as recommendation; because a command indicates obligation and recommendation, and implies obligation only when absolute and without opposing evidence, which is not the case here. Fifth: The hardship involved in the opinion of obligation, especially with severe overcrowding and frequent accidents, and hardship brings facilitation. Add to that the issue is one of Ijtihad, and there is nothing in the texts supporting the view of obligation, so it remains on recommendation due to the removal of harm and lifting of difficulty it contains. If it is said: This hardship existed during the time of the Prophet, peace and blessings be upon him, yet he did not depart before sunset, indicating obligation. The answer: The hardship in his time, peace and blessings be upon him, was easier than the hardship present in Hajj in later eras, especially with the existence of the Hadith of Urwa bin Mudarris and Abd al-Rahman Al-Dili.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 44
  },
  {
    "serial_number": "4596074",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 46,
    "volume_number": 1,
    "text": "Sixth: If standing at night is permitted without blood penalty by consensus of scholars; then standing during the day without the night is permitted a fortiori. Whoever differentiates between night and day has differentiated between two likes, which the aforementioned Hadith of Urwa equated. The preferred view, looking at the evidences, is the obligation of standing at Arafat until sunset; because it is established from the action of the Prophet, peace and blessings be upon him, his command to his Ummah to take the rites from him, and his command to oppose the polytheists, and opposing the polytheists is an objective of the Sharia. The Hadith of Urwa is specific to those in a similar condition to him, for the narrations mention his saying: 'I exhausted my mount and tired myself, I did not leave any hill except that I stood upon it.' So the fatwa came considering the state of the questioner by saying: 'and came to Arafat before that by night or day, then his Hajj is complete, and he has completed his prescribed duties.' Otherwise, the one who says departing before sunset is permissible relying on Urwa's Hadith would have to permit the distressed and others to stand at any hour of day or night. Despite this, if a man departs before sunset due to ignorance, forgetfulness, or necessity, there is no blood penalty upon him according to the preferred view; because his condition is like that of Urwa, and the Messenger of Allah, peace and blessings be upon him, did not obligate him with blood. It is known that Qiyas (analogy) is attaching a branch to a root in ruling due to their unity in the effective cause (Illah).",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 45
  },
  {
    "serial_number": "4596075",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 47,
    "volume_number": 1,
    "text": "Issue Two: Tawaf al-Ifadah: The second pillar is Tawaf al-Ifadah, also called Tawaf al-Hajj and Al-Ziyarah. It can only be done after standing at Arafat and spending the night at Muzdalifah without disagreement among scholars (1). This is the apparent meaning of the Holy Quran, due to His saying, Glory be to Him: {Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House} [Al-Hajj: 29], making Tawaf the last of them (2). Among the manifestations of facilitation in Tawaf al-Ifadah: 1. The time for Tawaf begins after midnight (the night of Muzdalifah) for those permitted to depart from it among the weak, women, and those in their ruling. Does it begin after Fajr or after midnight? There are two opinions among scholars, and the matter is broad due to the lack of text on this issue. 2. The 'Four Schools' agreed (3) that Tawaf al-Ifadah suffices",
    "foot_note": "1. See Sharh Al-Nawawi (8/ 192), Al-Mughni (3/ 98), and Tabyin Al-Haqa'iq by Al-Zayla'i (2/ 19).\n2. Sheikh Siddiq Hasan Khan erred in 'Al-Rawdah Al-Nadiyyah' when he thought that Tawaf al-Hajj, which is the pillar, could be before standing at Arafat. He relied on an ambiguous narration in Sahih Al-Bukhari. The wordings of the Hadith should be referred to one another to know its meaning and origin.\n3. See: Sharh Al-Nawawi (8/ 192), Al-Mughni (3/ 98), Tabyin Al-Haqa'iq by Al-Zayla'i (2/ 19).",
    "book_id": "1062",
    "new_page_number": 46
  },
  {
    "serial_number": "4596076",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 48,
    "volume_number": 1,
    "text": "at any time from the dawn of the Day of Sacrifice until the end of the days of Dhu al-Hijjah, and even if done after the month, it suffices. 3. He may delay Tawaf al-Ifadah to combine with the Farewell (Wada') (1), making it one Tawaf to alleviate hardship on himself and overcrowding on his brothers. Al-Nawawi said: 'Al-Shafi'i said in Al-Umm, and Sheikh Abu Hamid, Qadi Abu al-Tayyib, and all the companions said: Whenever Tawaf al-Ifadah is upon him, and he intends another for himself, or for another voluntarily, or for farewell, it counts as Tawaf al-Ifadah. Just as if he entered Ihram for voluntary Hajj or Umrah while owing their obligation, the obligation is convened' (2). You notice from Al-Nawawi's text that if the pilgrim forgets Ifadah and performs Tawaf for Farewell without intending Ifadah, or out of ignorance of the obligation of Tawaf, his Tawaf suffices for both. This is a good aspect, and part of facilitation and concession. 4. Is purity (Taharah) a condition for Tawaf? Scholars differed on this issue with two opinions: The First Opinion: They stipulated purity from [minor] ritual impurity and filth. This is the view of",
    "foot_note": "1. Previous sources.\n2. Al-Majmu' (8/ 60).",
    "book_id": "1062",
    "new_page_number": 47
  },
  {
    "serial_number": "4596077",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 49,
    "volume_number": 1,
    "text": "most scholars such as Malik, Al-Shafi'i, and their companions, and it is the well-known view of Ahmad's school (1). Accordingly, the menstruating and postpartum woman must remain until she becomes pure. They used the following as evidence: 1. What Al-Bukhari and Muslim (2) reported from the Hadith of Aisha: The first thing the Prophet, peace and blessings be upon him, started with when he arrived was that he performed ablution, then circumambulated the House. If it is said: His ablution, peace and blessings be upon him, mentioned in Aisha's Hadith is an absolute action, and it does not indicate obligation, let alone being a condition for Tawaf. The Answer: His ablution for his mentioned Tawaf is indicated by two proofs to be necessary and indispensable: First: That he, peace and blessings be upon him, said: 'Take your rites from me.' This command implies obligation and necessity. Since he performed ablution for Tawaf, we are obliged to take it from him; in compliance with his command, peace and blessings be upon him. Second: It has been established in the principles (Usul) that the action of the Prophet, peace and blessings be upon him, if it is",
    "foot_note": "1. See: Al-Tamhid (19/ 262), Al-Majmu' (8/ 106), and Al-Mughni (3/ 586).\n2. Book of Ablution, Chapter: Tawaf with Ablution (2/ 591) 1560, and Muslim in Book of Hajj, Chapter: What is required of one who circumambulates the House (2/ 906) 1235.",
    "book_id": "1062",
    "new_page_number": 48
  },
  {
    "serial_number": "4596078",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 50,
    "volume_number": 1,
    "text": "to explain a text from the Book of Allah, then it is for necessity and obligation. The text is His saying: {And let them circumambulate the ancient House.} It was answered that it is an action, and an action does not indicate obligation. 2. What Al-Bukhari and Muslim (1) reported from the Hadith of Aisha who said: We went out with the Prophet, peace and blessings be upon him, mentioning nothing but Hajj. When we came to Sarif, I menstruated... The Hadith, in which it says: 'Do what the pilgrim does except do not circumambulate the House until you become pure.' In Muslim's wording: 'until you bathe.' They said: In the Hadith, the Prophet, peace and blessings be upon him, explicitly forbade Aisha, may Allah be pleased with her, from Tawaf until a limit, which is purity; due to his saying 'until you become pure' and 'until you bathe.' It was answered that its purpose is to prevent one with major ritual impurity, and the answer to this will come. 3. What Al-Tirmidhi (2) and Al-Hakim (3) reported from the Hadith of Ibn Abbas in a Marfu' narration: 'Circumambulation around the House is like prayer except that you speak in it. So whoever",
    "foot_note": "1. Book of Menstruation, Chapter: How Menstruation Began (1/ 113) 290, and Muslim in Book [of Hajj], Explanation of the types of Ihram (2/ 870) 1211.\n2. (3/ 293) 960.\n3. (1/ 630) 1687",
    "book_id": "1062",
    "new_page_number": 49
  },
  {
    "serial_number": "4596079",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 51,
    "volume_number": 1,
    "text": "speaks in it, let him speak only good.' Al-Tirmidhi said: 'This Hadith was narrated from Ibn Tawus and others, from Tawus, from Ibn Abbas as a Mawquf (statement of companion), and we do not know it as Marfu' except from the Hadith of Ata bin Al-Sa'ib.' Al-Hakim said: 'Authentic in chain, and they did not extract it, and a group classified it as Mawquf.' Al-Albani authenticated the Marfu' version in Al-Irwa (1). This deduction was answered by saying the correct view is it is Mawquf on Ibn Abbas. Even assuming its authenticity, the exception according to Usulis is a criterion of generality. Tawaf around the House differs from prayer in many things other than speech, including: standing is not a condition for it, nor Takbir, and eating and drinking and other things are permitted in it. 4. They used as evidence His saying: {Purify My House for those who perform Tawaf and those who stay (for worship) and those who bow and prostrate} [Al-Baqarah: 125]. It was answered that purifying the Mosque from filth does not necessitate that the one circumambulating the House be pure from ritual impurity. If this were binding, we would say one must be pure to enter the Sacred Mosque. The Second Opinion: It is the view of Abu Hanifa, who said: Purity is not a condition for Tawaf,",
    "foot_note": "1. (4/ 102) 1102.",
    "book_id": "1062",
    "new_page_number": 50
  },
  {
    "serial_number": "4596080",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 52,
    "volume_number": 1,
    "text": "so if one performs Tawaf while Junub (major impurity) or having minor impurity, his Tawaf is valid (1). As for his companions, they differ on the obligation of purity for Tawaf while agreeing that it is not a condition for it (2). Accordingly, the Tawaf of the impure person, such as the menstruating woman, the postpartum woman, and the Junub, is valid, but blood penalty (Dam) is required for it. Imam Ahmad (3) went in a narration from him to the view that purity is not a condition, and Sheikh al-Islam chose this (4). They used the following as evidence: 1. His saying: {And let them circumambulate the ancient House} [Al-Hajj: 29]. The point of evidence is that Allah commanded Tawaf absolutely, and did not restrict it with the condition of purity, and this is a definitive text. 2. That the original state is freedom from liability. 3. That the Messenger of Allah, peace and blessings be upon him, did not obligate purity upon those circumambulating, nor avoidance of",
    "foot_note": "1. See Al-Mabsut (4/ 139), Sharh Fath Al-Qadir (19/ 3).\n2. The difference between purity being obligatory for Tawaf and it not being a condition for it, is that if it were a condition, Tawaf would not be valid without it. But if it is obligatory and not a condition, Tawaf is valid, but it is compensated by blood according to them.\n3. Al-Mughni (5/ 223), Al-Furu' (3/ 221).\n4. Majmu' Al-Fatawa (26/ 312).",
    "book_id": "1062",
    "new_page_number": 51
  },
  {
    "serial_number": "4596081",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 53,
    "volume_number": 1,
    "text": "impurity. Obligating them with purity is obligating what Allah did not obligate them with. 4. What Sa'id bin Mansur reported via Ata who said: A woman menstruated while she was circumambulating with Aisha, the Mother of Believers, so Aisha completed the rest of her Tawaf with her (1). Sheikh Muhammad bin Uthaymeen, may Allah have mercy on him, says: 'Accordingly, the preferred view which the soul is reassured by is that purity from minor ritual impurity is not a condition in Tawaf. However, it is undoubtedly better and more complete; following the Prophet, peace and blessings be upon him. A person should not neglect it to oppose the majority of scholars in that. But sometimes a person is compelled to the view held by Sheikh al-Islam, such as: if he breaks wind during his Tawaf in severe crowding. To say that he must go and perform ablution, then come back into this severe crowding, especially if only part of a round remains for him, implies severe hardship. Whatever involves severe hardship, and the text does not appear clearly regarding it, people should not be bound by it. Rather, we follow what is easier and simpler; because binding people to what involves hardship without clear evidence contradicts His saying: {Allah intends for you ease and does not intend for you hardship} [Al-Baqarah: 185].",
    "foot_note": "1. Ibn Hazm attributed it to him in Al-Muhalla (7/ 180).",
    "book_id": "1062",
    "new_page_number": 52
  },
  {
    "serial_number": "4596082",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 54,
    "volume_number": 1,
    "text": "If you ask: What is the preferred view regarding the Tawaf of a menstruating woman who fears missing her group? Ibn al-Qayyim, may Allah have mercy on him, says: 'The Sixth Example: The Prophet, peace and blessings be upon him, forbade the menstruating woman from circumambulating the House until she is pure, and said: 'Do what the pilgrim does except do not circumambulate the House' (1). Some thought this is a general ruling in all conditions and times, and did not differentiate between the state of ability and inability, nor between the time when remaining is possible for her until she becomes pure and circumambulates, and the time when that is not possible. They held to the apparent meaning of the text, and saw menstruation as incompatible with Tawaf just as it is incompatible with prayer and fasting, since the menstruating woman is forbidden from all equally. [They saw] the incompatibility of menstruation with the worship of Tawaf like its incompatibility with the worship of prayer. Two groups disputed with them on this: One group: Validated Tawaf with menstruation, and did not make menstruation an impediment to its validity. Rather, they made purity obligatory, compensated by blood, and Tawaf is valid without it. This is what Abu Hanifa and his companions say, and Ahmad in one of the two narrations from him, which is the more explicit text from him. These did not make the link of purity to Tawaf like its link to prayer—a link of condition to conditioned—but",
    "foot_note": "1. Its extraction has passed.",
    "book_id": "1062",
    "new_page_number": 53
  },
  {
    "serial_number": "4596083",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in the Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 55,
    "volume_number": 1,
    "text": "they made it one of its duties, and its link to it like the link of Hajj duties to it; doing it is valid with omission, and blood compensates for it. The Second Group: Made the obligation of purity for Tawaf, and its conditionality, like the status of covering oneself (Satr), and its conditionality is rather like the status of other conditions and duties of prayer which are obligatory and stipulated with ability, and drop with inability. They said: Conditioning purity for Tawaf or its obligation for it is not greater than conditioning it for prayer. So if it drops due to inability in prayer, its dropping in Tawaf due to inability is more appropriate. They said: In the time of the Prophet, peace and blessings be upon him, and his Rightly Guided Caliphs, Hajj leaders used to be detained for menstruating women until they became pure and performed Tawaf. That is why the Prophet, peace and blessings be upon him, said regarding Safiyyah when she menstruated: 'Is she detaining us?' They said: 'She has performed Ifadah (Tawaf).' He said: 'Then let her depart' (1). At that time, purity was within her ability, she could perform Tawaf with it. As for these times when it is impossible for the rider (traveler) to stay due to menstruation, it does not fall outside of eight categories:",
    "foot_note": "1. Reported by Al-Bukhari in Book of Hajj, Chapter: If a woman menstruates after performing Ifadah (2/ 625) 1670, and Muslim in Book of Hajj, Chapter: Obligation of Tawaf al-Hajj and its dropping for the menstruating woman (2/ 963) 1211.",
    "book_id": "1062",
    "new_page_number": 54
  },
  {
    "serial_number": "4596084",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 56,
    "volume_number": 1,
    "text": "The first: That it is said to her, 'Stay in Mecca, even if the caravan leaves, until you become pure and perform Tawaf.' In this, there is exposing her to staying alone in a foreign land, along with the extreme harm that entails.\nThe second: That it is said, 'The Tawaf al-Ifadah is waived due to the inability to fulfill its condition.'\nThe third: That it is said, 'If she knows or fears the onset of menstruation at its time, it is permissible for her to perform it before its time.'\nThe fourth: That it is said, 'If she knows by habit that her menses come during the days of Hajj, and that if she performs Hajj she will get her period there, the obligation falls from her until she reaches menopause and her menses stop completely.'\nThe fifth: That it is said, 'Rather, she performs Hajj, and if she menstruates and cannot perform Tawaf or stay, she returns home. She remains in her state of Ihram, refraining from marriage and intercourse with her husband until she returns to the House and performs Tawaf while pure,' even if there is a distance of years between her and it. Then, if she gets her period in the year of return, she goes back as she is, and continues like this until she encounters a year in which she is pure.\nThe sixth: That it is said, 'Rather, she decomposes (Tahallul) if she is unable to stay until she becomes pure, just as a besieged person (Muhsar) decomposes, with the Hajj remaining as a debt upon her. So whenever she is able to perform Hajj...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 55
  },
  {
    "serial_number": "4596085",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 57,
    "volume_number": 1,
    "text": "...it becomes binding upon her. Then, if that [menstruation] happens to her again, she decomposes, and so on forever until she can perform Tawaf while pure.'\nThe seventh: That it is said, 'She must appoint someone to perform Hajj on her behalf.'\nThe eighth: That it is said, 'Rather, she does what she is capable of from the rituals of Hajj, and whatever conditions and duties she is incapable of are waived for her, just as the Farewell Tawaf (Tawaf al-Wada') is waived for her by text.'\nThe speech of the Imams and Jurists is general, as they speak regarding its likes. They did not address such specific scenarios which have become a widespread affliction (Umum al-Balwa). This was not the case in the time of the Imams; rather, they mentioned that the camel-renter is obliged to wait for the first period and be detained for her so she can become pure and then perform Tawaf. This was possible, indeed actual, in their time, so they issued fatwas that she does not perform Tawaf until she becomes pure because she was able to do so, and there is no dispute in this. As for these times, it is not possible. Obligating two complete journeys for Hajj without negligence from the pilgrim, nor a cause originating from her, implies obligating two pilgrimages to the House, whereas Allah Almighty only obligated one pilgrimage. This is unlike one who invalidates the Hajj, for he has been negligent by committing a prohibition. And it is unlike one who abandoned the Tawaf of Visitation (Ziyarah) or standing at Arafah, for he did not do what completes his Hajj. As for this woman, she was not negligent and did not abandon what she was commanded to do,",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 56
  },
  {
    "serial_number": "4596086",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 58,
    "volume_number": 1,
    "text": "for she was not commanded to do what she is incapable of, and she has done what she is capable of. She is in the position of a person in a state of major impurity (Junub) if he is unable to perform the original purification or the substitute, so he prays according to his condition, and there is no repetition upon him according to the most correct of opinions...\" Then he refuted the estimation of the seven mentioned cases, then said: \"...So if these estimations are invalid, the eighth estimation becomes determined: which is that it be said she performs Tawaf of the House in this state. This is a necessity requiring entering the Mosque with menstruation and performing Tawaf with it. There is nothing in this that contradicts the rules of the Sharia; rather, it agrees with them as mentioned, since its ultimate result is the dropping of a duty or condition due to inability to fulfill it. There is no duty in the Sharia with inability, nor is there a prohibition with necessity.\" ... And regarding whether a penalty (Dam/Blood) is binding upon her or not, he said: \"Our Sheikh said: If she performs Tawaf while menstruating without an excuse, the view that a penalty is obligatory is valid. But with inability, the most likely view is that no penalty is obligated; because purification is a duty commanded with ability, not with inability. The obligation of a penalty is for abandoning a command or committing a prohibition. This woman did not abandon a command in this state, nor did she commit a prohibition. For if she threw the Jamrah and shortened her hair, everything prohibited to her by Ihram becomes lawful except marriage. Thus, after the first decomposition (Tahallul), no prohibition remains for which doing it requires a penalty. And purification is not commanded with inability such that abandoning it would require a penalty.\"",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 57
  },
  {
    "serial_number": "4596087",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 59,
    "volume_number": 1,
    "text": "Then he concluded the issue by saying: \"In summary, the speech regarding this incident is in two chapters. First: That the rules of Sharia require it, not contradict it, and this has been clarified sufficiently. Second: That the speech of the Imams and their fatwas regarding conditions and obligations is only in the state of ability and capacity, not in the state of necessity and inability. So issuing a fatwa permitting this does not contradict the text of the Lawgiver, nor the saying of the Imams. The utmost action of the Mufti in this case is restricting the absolute speech of the Lawgiver with the rules and principles of His Sharia, and the absolute speech of the Imams with their rules and principles. Thus, the one issuing a fatwa permitting this is in agreement with the principles of the Sharia and its rules, and with the rules of the Imams\" (1). From this, you learn that the preferred view (Rajih) is that if a woman is compelled to perform Tawaf al-Ifadah while in her menses, it is permissible for her, and there is nothing [no penalty] upon her. However, she must guard against what is feared regarding soiling the Mosque, by binding herself tightly. But if she is capable of performing Tawaf after becoming pure, the Imams are agreed that she does not perform Tawaf until she is pure.",
    "foot_note": "1. I'lam al-Muwaqqi'in (3/14 - 30). His teacher Ibn Taymiyyah preceded him with precious words on the issue; refer to it in Majmu' al-Fatawa (26/136 - 167), and see Dalil al-Masalik li Awamir al-Manasik by Sheikh Abdul Ghani bin Yasin al-Labadi (54).",
    "book_id": "1062",
    "new_page_number": 58
  },
  {
    "serial_number": "4596088",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 60,
    "volume_number": 1,
    "text": "The Second Requirement: Facilitation in the Duties of Hajj\nIt contains several issues:\nThe First Issue: You may have noticed, O noble reader, during the research, Islam's constant eagerness to lighten the burden on women in many rulings, considering in that the nature of her creation and the weakness and femininity she was formed with, which prepares her to perform her function in life connected to her home and residence. We also note Islam's eagerness to protect the woman and keep her away from crowding with men. From this premise, do not be surprised when you do not find disagreement that a woman may hasten and depart from Muzdalifah after the moon sets. It is not a condition that she be sick; rather, she has that right even if she has no ailment, so that she can proceed to Mina and throw the Jamrah without crowding with men (1). The scholars have evidences from the Prophetic Sunnah, including:",
    "foot_note": "1. See: Bada'i' al-Sana'i' (2/154), Al-Mughni (8/121), Al-Mubdi' (3/237), Sharh Fath al-Qadir (2/480), Hashiyat Ibn Abidin (2/503), Hawashi al-Sharwani (4/117).",
    "book_id": "1062",
    "new_page_number": 59
  },
  {
    "serial_number": "4596089",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 61,
    "volume_number": 1,
    "text": "1. What Al-Bukhari and Muslim (1) narrated from the hadith of Ibn Abbas (may Allah be pleased with them), who said: \"I am among those whom the Prophet, peace and blessings be upon him, sent ahead on the night of Muzdalifah among the weak of his family.\" The wording is Al-Bukhari's.\n2. What Al-Bukhari and Muslim (2) narrated via Abdullah, the freed slave of Asma, from Asma: That she camped at Muzdalifah on the night of Jam' (gathering). She stood to pray and prayed for an hour. Then she said: \"O my son, has the moon set?\" I said: \"No.\" So she prayed for an hour. Then she said: \"Has the moon set?\" I said: \"Yes.\" She said: \"Then depart.\" So we departed and went on until she threw the Jamrah, then she returned and prayed Fajr in her residence. I said to her: \"O you (3), I see that we have moved while it is still dark (Ghalas).\" She said: \"O my son, indeed the Messenger of Allah, peace and blessings be upon him, gave permission for the Za'n (women in litters) (4).\" The wording is Al-Bukhari's.",
    "foot_note": "1. Book of Hajj, Chapter: Those who send the weak of their family ahead at night stand at Muzdalifah and supplicate, and proceed when the moon sets (2/603) 1593. Book of Hajj / Chapter: Desirability of sending the weak women and others ahead from Muzdalifah to Mina in the late nights before the crowding of people, and the desirability of staying for others until they pray Fajr at Muzdalifah (2/941) 1293.\n2. Hadith number (1594), Hadith number (12191).\n3. Meaning: O this woman. See Mashariq al-Anwar (2/271), Al-Fath (3/528).\n4. 'Al-Za'n' with a Damma on the dotted Za', plural of Za'inah, which is a woman in a howdah, then applied generally to women later. See: Al-Nihayah (3/157) entry (Z A N), Sharh al-Nawawi ala Muslim (9/40), Al-Fath (3/527).",
    "book_id": "1062",
    "new_page_number": 60
  },
  {
    "serial_number": "4596090",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 62,
    "volume_number": 1,
    "text": "3. What Al-Bukhari and Muslim (1) narrated via Al-Qasim, from Aisha, that she said: Sawdah asked permission from the Messenger of Allah, peace and blessings be upon him, on the night of Muzdalifah to depart before him and before the crush (Hatamah) of the people (2). She was a slow woman. Al-Qasim says: 'Thabitah' means heavy. He said: So he gave her permission, and she left before his departure. We were detained until we reached morning, then we departed with his departure. And that I had asked permission from the Messenger of Allah, peace and blessings be upon him, as Sawdah did, so I could depart with his permission, would be more beloved to me than anything permissible [and joyful]. The wording is Muslim's.\n4. What Muslim (3) narrated via Salim bin Shawwal that he entered upon Umm Habibah and she informed him that the Prophet, peace and blessings be upon him, sent her from Jam' (Muzdalifah) at night.\nThe Second Issue: Facilitation in Stoning (Ramy):\nStoning is a great act of worship in which submission to Allah's command and establishing His remembrance are manifested. I will present to you some issues revolving around the rule \"Hardship brings ease\" and the rule \"If a matter becomes constricted, it widens\" regarding Stoning.",
    "foot_note": "1. Hadith number (1596), Hadith number (1290).\n2. Hatamah: With a Fatha on Ha and Sukun on Ta. Meaning crowding/crushing. See: Al-Nihayah (1/402) entry (H T M), Al-Fath (3/530).\n3. Book of Hajj / Chapter: Desirability of sending the weak women and others ahead... (2/940) 1292.",
    "book_id": "1062",
    "new_page_number": 61
  },
  {
    "serial_number": "4596091",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 63,
    "volume_number": 1,
    "text": "1. Facilitation in the time of stoning Jamrat al-Aqabah:\nThe scholars differed regarding the time in which it is permissible to stone Jamrat al-Aqabah for the weak and others—while agreeing that whoever throws after sunrise, it suffices him—into three opinions:\nThe First Opinion: The opinion of Al-Shafi'i, Ahmad, and a group of scholars (1). They said: The first time in which stoning Jamrat al-Aqabah suffices is the beginning of the second half of the night of Nahr (Sacrifice) for both the capable and the incapable.\nThey used as evidence what Abu Dawood (2) narrated from Aisha (may Allah be pleased with her) that she said: The Prophet, peace and blessings be upon him, sent Umm Salamah on the night of Nahr, so she threw the Jamrah before Fajr, then went on and performed Tawaf al-Ifadah. That was the day the Messenger of Allah was to be with her.\nImam Ahmad rejected this (3), and Al-Albani classified it as weak in Al-Irwa. Also, since it is a time for departing from Muzdalifah, it is likewise a time for Stoning.",
    "foot_note": "1. See: Al-Mughni (3/419), Al-Majmu' (8/125).\n2. Al-Sunan (2/194) 1942. [Note: Reference in text says Abu Dawood, but footnote 3 points to Talkhis Al-Habir. The numbering suggests confusion in source citations in the original text].\n3. Al-Talkhis Al-Habir (2/257) 1053.\n4. Irwa al-Ghalil (4/108) 1942.",
    "book_id": "1062",
    "new_page_number": 62
  },
  {
    "serial_number": "4596092",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 64,
    "volume_number": 1,
    "text": "The Second Opinion: The opinion of Malik and Abu Hanifa (1). They said: Its starting time begins after sunrise.\nTheir argument is that the Prophet, peace and blessings be upon him, threw it at Duha (forenoon) time and said: \"Take your rituals from me.\" They also argued with what the Four (2) narrated from the hadith of Ibn Abbas who said: \"The Messenger of Allah, peace and blessings be upon him, used to send the weak of his family ahead in the darkness (Ghalas), and command them not to throw the Jamrah until the sun rose.\" The wording is Abu Dawood's. Al-Tirmidhi said: Hasan Sahih. The practice is according to this hadith among the people of knowledge. Al-Nawawi, Ibn al-Qayyim, and Al-Albani declared it authentic (3).\nThe Third Opinion: What some scholars went to, and chosen by Ibn al-Qayyim (4). They said: Its first time for the weak is from the break of dawn (Fajr), and for others, it is after sunrise. They used two hadiths as evidence for this:",
    "foot_note": "1. See: Sharh Fath al-Qadir (2/500), Al-Istidhkar (4/289).\n2. Al-Tirmidhi (3/240) 893, Abu Dawood (2/194) 1940, Al-Nasa'i (5/272) 3065, and Ibn Majah (2/1007) 3025.\n3. Al-Majmu' (8/132), Al-Zad (2/250), Al-Irwa (2/194).\n4. Al-Zad (2/246).",
    "book_id": "1062",
    "new_page_number": 63
  },
  {
    "serial_number": "4596093",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 65,
    "volume_number": 1,
    "text": "The First: The agreed-upon hadith of Asma (1), wherein it says \"So we departed and went on until she threw the Jamrah, then she returned and prayed Fajr in her residence,\" and wherein she said: \"O my son, indeed the Messenger of Allah gave permission to the Za'n.\" Its implication is that he did not give permission to the strong males.\nThe Second: What Al-Bukhari and Muslim (2) narrated from the hadith of Salim who said: Abdullah bin Umar used to send the weak of his family ahead, so they would stand at the Sacred Monument (Al-Mash'ar Al-Haram) at Muzdalifah at night, mentioning Allah as much as they could. Then they would return before the Imam stood and before he departed. Some of them would arrive at Mina for Fajr prayer, and some would arrive after that. When they arrived, they would throw the Jamrah. Ibn Umar used to say: The Messenger of Allah, peace and blessings be upon him, granted a concession to those. This indicates permitting the weak to throw Jamrat al-Aqabah after Fajr, but he did not permit others.\nThe preferred view (Rajih) upon examining the evidence is the permissibility of throwing for the weak and the strong who arrive with them, due to the hadith of Aisha, and because the weak need someone to accompany them for the rest of the Hajj rituals. Unless we take the concessions, especially with the great crowding...",
    "foot_note": "1. Its citation has passed.\n2. Al-Bukhari, Book of Hajj, Chapter: Who sent the weak of his family ahead at night (2/603) 1593, and Muslim in Hajj, Chapter: Desirability of sending the weak women ahead (2/941) 1295.",
    "book_id": "1062",
    "new_page_number": 64
  },
  {
    "serial_number": "4596094",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 66,
    "volume_number": 1,
    "text": "...we would place many Muslims in hardship. Thus, the throwing of Jamrat al-Aqabah has two times: a time of virtue, and a time of validity. The time of virtue is after sunrise due to the hadith of Ibn Abbas, and the time of validity is after the break of dawn due to the hadith of Asma (1).\n2. Facilitation in the time of Stoning (General):\n• It is permissible for the pilgrim to throw at night: This is the saying of Ibn Umar, and the Hanafis went to it, as well as Malik, and one of the two sayings of the Shafi'is. The Constituent Council of the Muslim World League, headed by Sheikh Abdul Aziz bin Baz (may Allah have mercy on him), issued a fatwa for this when the crowding at the Jamarat became severe (2).\nThey used as evidence:\n1. What Al-Bukhari narrated (3) from Ibn Abbas who said: The Prophet, peace and blessings be upon him, was asked: \"I threw after evening came?\" He said: \"No harm.\" [Another] said: \"I shaved before I sacrificed?\" He said: \"No harm.\" The name \"evening\" (Masa') applies to part of the night.",
    "foot_note": "1. See: Al-Mughni (3/219), Adwa' al-Bayan (4/439).\n2. See: Al-Muwatta (921), Bada'i' al-Sana'i' (3/124), Al-Muhalla (7/176), Al-Majmu' (8/180), Bidayat al-Mujtahid (2/145), Adwa' al-Bayan (5/299), Majmu' Fatawa wa Maqalat Mutanawwi'ah (17/268).\n3. Book: Hajj, Chapter: If he throws after evening comes (2/618) 1648.",
    "book_id": "1062",
    "new_page_number": 65
  },
  {
    "serial_number": "4596095",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 67,
    "volume_number": 1,
    "text": "2. What Malik narrated in Al-Muwatta from Nafi' that a daughter of the brother of Safiyyah bint Abi Ubayd gave birth at Muzdalifah. So she and Safiyyah stayed behind until they arrived at Mina after the sun had set on the Day of Nahr. Abdullah bin Umar ordered them to throw, and he did not see anything [penalty] upon them. This is evidence from the action of Ibn Umar (may Allah be pleased with him) that throwing at night is permissible.\n• It is permissible for the pilgrim to throw before Zawal (noon/zenith) on all days: This is reported from Ibn Abbas, and is the saying of Tawus, and Ataa in one of the two narrations from him, and Muhammad al-Baqir. It is a non-famous narration among the Hanafis: Throwing before Zawal is permissible on the third day absolutely, and on the second day for the one hastening (Muta'ajjil). Ibn Aqil and Ibn al-Jawzi from the Hanbalis went to this, as did Al-Rafi'i from the Shafi'is. Among contemporaries: Sheikh Abdullah Al-Mahmood and Sheikh Mustafa Al-Zarqa, and Sheikh Al-Sa'di strengthened it, may Allah have mercy on them all (1). They used as evidence:",
    "foot_note": "1. See: Al-Muwatta (1/409), Al-Mabsut (4/23), Bada'i' al-Sana'i' (2/137), Al-Mughni (5/328), Al-Majmu' (8/296), Bidayat al-Mujtahid (1/258), Fath al-Bari (3/580), Al-Insaf (4/46), Majmu'at Rasa'il Sheikh Abdullah Al Saud (1/22).",
    "book_id": "1062",
    "new_page_number": 66
  },
  {
    "serial_number": "4596096",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 68,
    "volume_number": 1,
    "text": "1. What Al-Daraqutni narrated (1) from the hadith of Amr bin Shu'ayb, from his father, from his grandfather, that the Messenger of Allah, peace and blessings be upon him, granted a concession to shepherds to throw at night, or any hour of the day they wished. Its chain is weak. Ibn Qudamah said in 'Al-Kafi': \"Everyone with an excuse of illness or fear for himself or his wealth is like the shepherds in this; because they are in their meaning [condition]\" (2).\n2. What Al-Bukhari and Muslim narrated from the hadith of Abdullah bin Amr bin Al-Aas that the Messenger of Allah, peace and blessings be upon him, stood at Mina during the Farewell Pilgrimage for the people asking him. A man came and said: \"I didn't realize, so I shaved before I sacrificed?\" He said: \"Sacrifice and no harm.\" Another came and said: \"I didn't realize, so I sacrificed before I threw?\" He said: \"Throw and no harm.\" The Prophet, peace and blessings be upon him, was not asked about anything done before or after [its order] except that he said: \"Do it and no harm.\" The point of evidence is that the Prophet, peace and blessings be upon him, did not make the order between Hajj duties a condition, and in this is an indication of not strictly observing the time.\n3. Among their evidences is the lack of explicit evidence prohibiting throwing before...",
    "foot_note": "1. (2/276) 184.\n2. Al-Kafi (1/195).",
    "book_id": "1062",
    "new_page_number": 67
  },
  {
    "serial_number": "4596097",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 69,
    "volume_number": 1,
    "text": "...Zawal, neither from the Book, nor the Sunnah, nor Consensus.\n4. As for the Messenger of Allah throwing after Zawal, it is like his standing at Arafah after Zawal until sunset. It is known that standing does not end with that limit; rather, the entire night is also a time for standing.\n5. If throwing before Zawal were prohibited, the Messenger of Allah, peace and blessings be upon him, would have clarified it with a sufficient, explicit clarification when he answered the questioner who asked about throwing after evening. Delaying clarification past the time of need is not permissible.\n6. From the evidences is His Almighty's saying: {And remember Allah during [specific] numbered days} [Al-Baqarah: 203]. Stoning is part of Remembrance, based on what Abu Dawood narrated (1) from the hadith of Aisha (Marfu'): \"Indeed, circumambulating the House, [going] between Safa and Marwa, and stoning the Jamarat were ordained for establishing the remembrance of Allah.\" Al-Albani weakened it (2). So He made the entire day a place for remembrance, and Stoning is part of it. Upon contemplation, this appears to be like a textual proof in the issue, and Sheikh Abdul Rahman bin Sa'di used it as evidence.",
    "foot_note": "1. (2/179) 188.\n2. Da'if Sunan Abi Dawood (1888).",
    "book_id": "1062",
    "new_page_number": 68
  },
  {
    "serial_number": "4596098",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 70,
    "volume_number": 1,
    "text": "7. What Al-Bukhari narrated (1) via Wabrah who said: I asked Ibn Umar: When do I throw the Jamarat? He said: When your Imam throws, throw. I repeated the question to him. He said: We used to wait for the time, so when the sun passed its zenith (Zalat), we threw. If throwing before Zawal were obligatory [prohibited], he would have clarified it to the questioner initially.\n8. That stoning Jamrat al-Aqabah was advanced from sunrise to before Fajr in consideration of facilitation and kindness to the weak, even though spending the night in Mina is incumbent upon pilgrims during the days of Tashreeq. So how about the one hastening on the twelfth day? Adopting this opinion contains a concession for women and the weak, especially on the twelfth day for those hastening.\n• He may delay throwing the Jamarat, except for the day of Eid, to the last day; because the days of Tashreeq are like a single day. Thus, throwing in all of them is performance (Ada'). So if he throws for the first day on the second, or for the second on the third, or for the first and second on the third, there is nothing [penalty] upon him; because it is a time for throwing, like a single day. However, he misses the Sunnah by doing so. This was said by Al-Shafi'i, Ahmad, Abu Thaur, Abu Yusuf, and Muhammad. Al-Shanqeeti chose this opinion (2).",
    "foot_note": "1. Book of Hajj, Chapter: Stoning the Jamarat (2/621) 1659.\n2. See: Al-Istidhkar (4/353), Al-Majmu' (8/176), Al-Mughni (3/256), Adwa' al-Bayan (4/46).",
    "book_id": "1062",
    "new_page_number": 69
  },
  {
    "serial_number": "4596099",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 71,
    "volume_number": 1,
    "text": "They used as evidence what the Four (1) narrated from the hadith of Asim bin Adi: \"That the Messenger of Allah, peace and blessings be upon him, granted a concession to the shepherds regarding spending the night [in Mina], that they throw on the Day of Nahr, and for the two days after it, they combine them in one of them.\" The wording is Al-Nasa'i's. According to Abu Dawood, Al-Nasa'i, and Ibn Majah: \"He granted a concession to the shepherds to throw one day and leave one day.\" Al-Tirmidhi said: A Hasan Sahih hadith, and Al-Albani authenticated it in Al-Irwa (2).\nSo it is permissible for one who is in the meaning/condition of shepherds—those occupied during the days of throwing with work that leaves no time for throwing, and whose residence is far from the Jamarat, and for whom visiting them repeatedly is difficult, especially women—to delay throwing the Jamarat until the last day of the days of Tashreeq, but not delay it beyond that.\nIbn Qudamah says: \"People with excuses other than shepherds, such as the sick, and those who have wealth they fear losing, and the like, are like shepherds in omitting the overnight stay; because the Prophet, peace and blessings be upon him, granted a concession to these as an alert for others. Or you say: The meaning stipulated for them exists in others, so it is obligatory to append them to them\" (3).",
    "foot_note": "1. Abu Dawood (2/202) 1975, Al-Tirmidhi (3/289) 955, Al-Nasa'i (5/273) 3068, 3069, Ibn Majah (2/1015) 3037.\n2. (4/108) 1080.\n3. Al-Mughni (3/256).",
    "book_id": "1062",
    "new_page_number": 70
  },
  {
    "serial_number": "4596100",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 72,
    "volume_number": 1,
    "text": "Delaying to avoid crowding, hardship, and fighting is one of the greatest considered objectives. Human life is more worthy of care than the life of livestock as in the case of shepherds. Preserving souls is one of the five objectives agreed upon in the Sharia.\n3. Facilitation regarding Deputyship (Proxy) in Stoning:\nWhoever is unable to throw by himself due to illness or the like, permitted for him to appoint someone to throw on his behalf. There is nothing [no penalty] upon him according to the Hanafis, Shafi'is, and Hanbalis (1), with a difference among them regarding repeating the throw if his inability ceases before the last of the days of Tashreeq.\nAs for Imam Malik, he was asked: Does one throw on behalf of a child and a sick person? He said: Yes, and the sick person should seek the time when he throws for him, so he says Takbir while in his residence, and he must shed blood (sacrifice) (2). So he permitted deputyship with inability but obligated the incapable person to sacrifice.\nIn Al-Mughni: \"Ibn al-Mundhir said: Everyone I have memorized from among the people of knowledge sees [permissibility of] throwing on behalf of the child who cannot throw. Ibn Umar used to do that, and Ataa, Al-Zuhri, Malik, Al-Shafi'i, and Ishaq said so\" (3).",
    "foot_note": "1. See: Al-Majmu' (8/174), Al-Mughni (3/256), Al-Bahr Al-Ra'iq (2/375).\n2. Al-Muwatta (407), and see: Al-Dhakhira (3/280).\n3. (3/108).",
    "book_id": "1062",
    "new_page_number": 71
  },
  {
    "serial_number": "4596101",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 73,
    "volume_number": 1,
    "text": "Abu Ishaq al-Shirazi said: \"Whoever is unable to throw by himself, whether the illness is hopeless or not, it is permissible for him to appoint someone to throw for him; because its time is tight and might pass before he can throw...\" (1).\nIbn Qudamah said: \"If a man is sick, or [a woman] is detained/imprisoned, and has an excuse, it is permissible to appoint someone to throw on his/her behalf\" (2).\nFrom this, it becomes clear to you that the criterion for deputyship is the excuse that renders its owner incapable of throwing, such as illness, youth, imprisonment, weakness, and others. It is not permissible to appoint a proxy for throwing without an excuse; whoever does so sins and owes a sacrifice.\nThey used as evidence:\n1. What Ibn Abi Shaybah narrated in Al-Musannaf (3), and Ibn Majah in Al-Sunan (4) from the hadith of Jabir who said: \"We performed Hajj with the Messenger of Allah, peace and blessings be upon him, and with us were women and children. So we said Talbiyah on behalf of the children, and we threw on their behalf.\" Its chain is weak due to the weakness of Ash'ath bin Yasar and the 'an'anah (transmission using 'from') of Abu al-Zubayr.",
    "foot_note": "1. Al-Muhadhdhab (1/231).\n2. Al-Mughni (3/256).\n3. (3/242) 13841.\n4. (2/1010) 3038.",
    "book_id": "1062",
    "new_page_number": 72
  },
  {
    "serial_number": "4596102",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 74,
    "volume_number": 1,
    "text": "Al-Albani weakened the narration in 'Hajjat al-Nabi' (1). The proponents of this narration used analogy, comparing those other than children to them based on the common factor of inability in all.\n2. Deputyship in throwing is the utmost that the incapable person can do, and Allah Almighty says: {So fear Allah as much as you are able} [At-Taghabun: 16].\n3. Analogy of deputyship in throwing to deputyship in the Hajj itself. They said: Throwing is more deserving of permissibility.\n4. Among the evidence of the majority for the dropping of the sacrifice from the incapable person who appoints another is what the Messenger of Allah, peace and blessings be upon him, dropped from the incapable regarding duties, such as the Farewell Tawaf for the menstruating woman, and the overnight stay for shepherds. He did not mandate a sacrifice, and it is known that delaying clarification past the time of need is not permissible.\nThe Third Issue: Dropping of Farewell Tawaf (Tawaf al-Wada') for the Menstruating Woman and Woman with Postnatal Bleeding:\nFarewell Tawaf is obligatory, and abandoning it requires a sacrifice. This is the saying of the majority of scholars, and the Hanafis, a narration from the Shafi'is, and the Hanbalis went to it (2).",
    "foot_note": "1. (49).\n2. See: Mukhtasar Ikhtilaf al-Ulama (3/164), Al-Majmu' (8/204), Al-Mughni (3/239).",
    "book_id": "1062",
    "new_page_number": 73
  },
  {
    "serial_number": "4596103",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 75,
    "volume_number": 1,
    "text": "Is the Farewell Tawaf obligatory on the menstruating woman and the one with postnatal bleeding? Does it drop? And if it drops, is it compensated by a sacrifice or not?\nIbn al-Mundhir said: \"The general body of jurists in the regions said: There is no Farewell Tawaf upon the menstruating woman who has already performed Tawaf al-Ifadah\" (1).\nIbn Qudamah said: \"If a woman menstruates before she bids farewell, she departs, and there is no farewell [Tawaf] upon her nor a ransom (Fidyah). This is the saying of the general jurists of the regions. It was narrated from Umar and his son that they ordered the menstruating woman to stay for the Farewell Tawaf, and Zaid bin Thabit used to say that, but he retracted it\" (2).\nThe authentic, explicit evidences for the majority opinion are many, including:\n1. What Al-Bukhari and Muslim (3) narrated from the hadith of Ibn Abbas who said: The people were commanded that their last time be at the House, except that it was lightened for the menstruating woman.\n2. What Al-Bukhari and Muslim (4) narrated from the hadith of Aisha who said: Safiyyah bint Huyayy menstruated after she had performed Ifadah. Aisha said:",
    "foot_note": "1. Al-Hafiz reported it from him in Al-Fath (3/686).\n2. Al-Mughni (3/238).\n3. Al-Bukhari in Book of Hajj, Chapter: Farewell Tawaf (2/624) 1668, and Muslim in Book of Hajj, Chapter: Obligation of Farewell Tawaf, and its dropping for the menstruating woman (2/963).\n4. Al-Bukhari Book of Hajj, Chapter: If a woman menstruates after performing Ifadah (2/624) 1668, and Muslim Book of Hajj, Chapter: Obligation of Farewell Tawaf... (2/963) 13128.",
    "book_id": "1062",
    "new_page_number": 74
  },
  {
    "serial_number": "4596104",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 76,
    "volume_number": 1,
    "text": "So I mentioned her menstruation to the Messenger of Allah. The Messenger of Allah, peace and blessings be upon him, said: \"Is she holding us back?\" She said: I said: \"She had performed Ifadah and circumambulated the House, then she menstruated after Ifadah.\" The Messenger of Allah, peace and blessings be upon him, said: \"Then let her depart.\" The wording is Muslim's.\n3. What Al-Bukhari narrated via Ikrimah, and Muslim (1) via Tawus who said: I was with Ibn Abbas when Zaid bin Thabit said: \"You give a fatwa that a menstruating woman may depart before her last time is at the House?\" Ibn Abbas said to him: \"If not, then ask So-and-so, the Ansari woman, did the Messenger of Allah, peace and blessings be upon him, command her to do that?\" He said: So Zaid bin Thabit returned to Ibn Abbas laughing, saying: \"I do not see but that you have spoken the truth.\"",
    "foot_note": "1. Previous location, Al-Bukhari hadith number 1671, and Muslim (1329).",
    "book_id": "1062",
    "new_page_number": 75
  },
  {
    "serial_number": "4596105",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 77,
    "volume_number": 1,
    "text": "Conclusion\nPraise be to Allah by Whose grace good deeds are completed. Praise be to Allah who legislated the easiest of religion and the most complete of creeds. Prayers and peace be upon the Imam of the pure monotheists, whom his Lord sent as a facilitator and bringer of glad tidings. To proceed:\nIndeed, this research has only touched upon a very small amount of the manifestations of facilitation regarding the jurisprudence of women. These pages are but drops from a sea and grains from a basket. In the authentic Sunnah, thousands of pages would fail to highlight its tolerance regarding Hajj. But it is the effort of one with little, asking Allah to accept it.\nAlong with the manifestations of facilitation that appeared clearly regarding women and those in their ruling in the obligation of Hajj—to lift physical hardship—there are great matters through which Islam's care for intangibles appears, and its satisfaction of the soul's needs before the body. This is seen through the dealing of the great Messenger of Allah, peace and blessings be upon him, personally with his nine wives who performed Hajj with him. There is no doubt in the wisdom of his actions and his virtuous character; for he understands the nature of woman, her flowing emotion, and her being the dwelling of the parent and the incubator of the child. How [could he not], when he likened women to glass vessels (Qawarir) in delicacy, gentleness, and weakness of constitution? Thus, the rulings of the spirit and body came in a way...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 76
  },
  {
    "serial_number": "4596106",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 78,
    "volume_number": 1,
    "text": "...appropriate to creation and formation. So you see him ordering Abdul Rahman to go out with Aisha, after she expressed her desire for Umrah saying to him: \"O Messenger of Allah, all your companions return with Hajj and Umrah except me\" (1). So he fulfills what she wanted and sends her brother Abdul Rahman with her.\nHafsa menstruates in the last moments of Hajj, and his saying is nothing but an expression of the woman's status and her high value: \"Is she holding us back?\" (2). He and his companions in a large company would be detained for the sake of the woman who menstruated. The contemplator of the guidance of the Messenger of Allah, peace and blessings be upon him, in Hajj and elsewhere stands upon his good companionship, noble nature, and his great goodness to his family.\nAt the end of the research, I conclude with a set of Results and Recommendations:\n1. Publishing authentic Prophetic hadiths related to honoring women and facilitating for them.\n2. Serving jurisprudential topics from a Hadith perspective.\n3. The need to highlight the disagreement of jurists regarding issues of Facilitation in Hajj, especially in times like these, and not binding people to a saying when...",
    "foot_note": "1. Al-Bukhari (2/325) 1673.\n2. Al-Bukhari (2/325) 1673.",
    "book_id": "1062",
    "new_page_number": 77
  },
  {
    "serial_number": "4596107",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 79,
    "volume_number": 1,
    "text": "...there exists another considered opinion that has its share of consideration.\n4. Publishing fatwas related to aspects of facilitation, in which the jurisprudence of the jurists and the understanding of the scholars becomes clear in observing: the evidence, the new reality from all its aspects, the increasing numbers of pilgrims, the tightness of place and time, and the almost constant loss of lives.\n5. Forming specialized scientific committees and councils at the level of the Islamic world to study the differences between jurists regarding Hajj issues specifically, and extracting what has strong evidence and is closer to the objectives (Maqasid) of the Sharia and its universals.\n6. Undertaking educational advocacy activities for pilgrims by community institutions and media outlets to highlight the sayings of scholars and prefer what is supported by evidence regarding issues of facilitation, presented by senior scholars and students of knowledge.\n7. Activating the role of Imams and preachers, and giving them sermons during Hajj seasons prepared by a competent body, pointing out the most important issues of Facilitation in Hajj.\n8. Issuing specialized scientific journals regarding Facilitation in...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 78
  },
  {
    "serial_number": "4596108",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 80,
    "volume_number": 1,
    "text": "...Hajj, translating and distributing them as widely as possible, supervised by scholars known at the global level.\n9. Generalizing such seminars and intensifying their establishment all over the globe during these blessed days.\n10. Establishing a media channel during the Hajj period supervised by the Ministry of Hajj, with Facilitation in Hajj being among its programs.\nFinally, there is no success for the whole world except by returning to the Book of Allah and the Sunnah of the Messenger of Allah, peace and blessings be upon him, facilitating for people, and employing the disagreement of scholars to lift embarrassment and hardship from people, especially if it appears that some opinions lead to difficulty and hardship. The jurisprudential rule states that \"Prevalence of hardship drops the command.\"\nThis, and may Allah send prayers and peace upon our Prophet Muhammad.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 79
  },
  {
    "serial_number": "4596109",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 81,
    "volume_number": 1,
    "text": "Index of Sources and References\n1. Abhath Hay'at Kibar al-Ulama (Researches of the Council of Senior Scholars), Riyadh, Dar Uli al-Nuha.\n2. Athar al-Ikhtilaf fi al-Qawa'id al-Usuliyyah fi Ikhtilaf al-Fuqaha (The Effect of Difference in Usul Principles on the Difference of Jurists) by Dr. Mustafa Sa'id al-Khin, Mu'assasat al-Risalah.\n3. Adab al-Mufti wa al-Mustafti (Etiquette of the Mufti and the Questioner), printed within Fatawa Ibn al-Salah Abu Amr Uthman al-Shahrazuri, investigation: Abdul Mu'ti Qal'aji, 1st Ed: 1402 AH, Dar al-Ma'rifah, Beirut.\n4. Irwa' al-Ghalil fi Takhrij Ahadith Manar al-Sabil by Muhammad Nasir al-Din al-Albani, Al-Maktab al-Islami, 1st: 1399 AH.\n5. Al-Ashbah wa al-Naza'ir (Similarities and Analogies): Rules and Branches of Shafi'i Jurisprudence, by Jalal al-Din Abd al-Rahman al-Suyuti 911 AH, Dar al-Kutub al-Ilmiyyah, Beirut.\n6. I'lam al-Muwaqqi'in, Shams al-Din Muhammad bin Abi Bakr bin Qayyim al-Jawziyyah, investigation: Muhammad Muhyi al-Din Abd al-Hamid, Dar al-Baz for Publishing and Distribution.\n7. Al-Umm by Imam al-Shafi'i - corrected by Muhammad Zuhri al-Najjar - Dar al-Ma'rifah for Printing and Publishing - Beirut 1393 AH.\n8. Al-Bahr al-Ra'iq Sharh Kanz al-Daqa'iq by Zayn al-Din Ibn Nujaym...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 80
  },
  {
    "serial_number": "4596110",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 82,
    "volume_number": 1,
    "text": "...Al-Hanafi, Publisher: Dar al-Ma'rifah, Beirut.\n9. Bidayat al-Mujtahid wa Nihayat al-Muqtasid by Abu al-Walid Muhammad bin Ahmad bin Muhammad bin Ahmad bin Rushd al-Qurtubi al-Andalusi, Beirut, Dar al-Fikr.\n10. Bada'i' al-Sana'i' fi Tartib al-Shara'i' by Ala' al-Din al-Kasani, Beirut, Dar al-Kitab al-Arabi: 1982 AD.\n11. Taj al-Arus min Jawahir al-Qamus by Muhammad bin Muhammad bin Abd al-Razzaq al-Husayni Abu al-Fayd, nicknamed Murtada al-Zabidi, investigation by a group of investigators, Publisher: Dar al-Hidayah.\n12. Tuhfat al-Fuqaha by Muhammad bin Ahmad al-Samarqandi, Dar al-Kutub al-Ilmiyyah, First Edition, 1405 AH.\n13. Al-tarakhkhus bi Masa'il al-Khilaf: Dawabituhu wa Aqwal al-Ulama Fihi (Seeking Concessions through Issues of Disagreement: Its Rules and Scholars' Sayings therein) by Khalid al-Arusi.\n14. Al-Talkhis fi Usul al-Fiqh, Abu al-Ma'ali Abd al-Malik bin Abdullah al-Juwayni, investigation: Abdullah al-Nibali and Shabir al-Umari, Dar al-Basha'ir, and Dar al-Baz, First Edition, 1417 AH, Beirut.\n15. Al-Tamhid lima fi al-Muwatta min al-Ma'ani wa al-Asanid by Abu Umar Yusuf bin Abdullah bin Abd al-Barr al-Nimari, investigation: Mustafa Ahmad al-Alawi, Muhammad Abd al-Kabir al-Bakri, Ministry of Endowments and Islamic Affairs - Morocco, 1387 AH.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 81
  },
  {
    "serial_number": "4596111",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 83,
    "volume_number": 1,
    "text": "16. Al-Istidhkar al-Jami' li Madhahib Fuqaha al-Amsar wa Ulama al-Aqtar by Ibn Abd al-Barr died 463 AH, Dar Ihya' al-Turath al-Arabi, Beirut, First Edition, 1421 AH - 2001 AD.\n17. If'al wa La Haraj (Do it and No Harm) by Sheikh Dr. Salman bin Fahd al-Ouda, introduction by His Eminence Sheikh Abdullah bin Jibreen, Islam Today Foundation.\n18. Tahdhib al-Tahdhib by Ahmad bin Ali bin Hajar al-Asqalani, Beirut, Dar Ihya' al-Turath, Second: 1413 AH.\n19. Hashiyat al-Rawd al-Murbi' li Ibn Qasim by Abd al-Rahman bin Muhammad bin Qasim al-Asimi al-Najdi al-Hanbali.\n20. Al-Hashiyah ala al-Sharh al-Kabir, Al-Dasuqi: Muhammad Arafah: - Beirut - Dar al-Fikr.\n21. Al-Durar al-Saniyyah, by Sheikh Ibn Qasim, Al-Nur.\n22. Radd al-Muhtar, Ibn Abidin: Muhammad Amin, Dar al-Kutub al-Ilmiyyah.\n23. Risalat Abi Ubaydah Muslim bin Abi Karima al-Tamimi to Imam Abu al-Khattab al-Ma'afiri - Sultanate of Oman, Ministry of National Heritage and Culture, 1982 AD.\n24. Raf' al-Malam an al-A'immah al-A'lam by Sheikh al-Islam Ibn Taymiyyah, within Majmu' Fatawa Sheikh al-Islam, compiled by Abd al-Rahman bin Qasim.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 82
  },
  {
    "serial_number": "4596112",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 84,
    "volume_number": 1,
    "text": "25. Rawdat al-Afkar wa al-Afham, by Ibn Ghannam, Al-Maktabah al-Salafiyyah in Riyadh.\n26. Rawdat al-Talibin, Yahya bin Sharaf al-Nawawi, investigation: Zuhair al-Shawish, Al-Maktab al-Islami, Ed: Third 1412 AH Beirut.\n27. Riyad al-Salihin by Al-Nawawi.\n28. Subul al-Salam by Amir al-San'ani - Dar al-Ma'rifah - Third Edition: 1410 AH.\n29. Al-Silsilah al-Sahihah by Muhammad Nasir al-Din al-Albani, Maktabat al-Ma'arif - Riyadh.\n30. Sunan Abi Dawood, authored by Sulaiman bin al-Ash'ath al-Sijistani, commentary by Muhammad Muhyi al-Din Abd al-Hamid, Dar al-Fikr.\n31. Sunan al-Imam al-Nasa'i by Ahmad bin Shu'ayb al-Nasa'i investigation: Abd al-Fattah Abu Ghuddah, Printed - Aleppo - Islamic Publications Office, Second Edition, 1406 AH.\n32. Sunan al-Tirmidhi - Dar Ihya' al-Turath - investigation Ahmad Shakir.\n33. Sunan al-Darimi - Al-Darimi - Al-Kutub al-Ilmiyyah - investigation Fawaz Ahmad and Khalid al-Sab'.\n34. Al-Sunan al-Kubra - Al-Nasa'i - Dar al-Kutub al-Ilmiyyah - investigation Abd...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 83
  },
  {
    "serial_number": "4596113",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 85,
    "volume_number": 1,
    "text": "...Al-Ghaffar Sulaiman al-Bundari and Sayyid Kasrawi Hasan.\n35. Siyar A'lam al-Nubala, Muhammad bin Ahmad bin Uthman bin Qaymaz al-Dhahabi, investigation: Shu'aib al-Arna'ut, Muhammad Na'im al-Arqasusi, Edition: Ninth 1413 AH, Mu'assasat al-Risalah - Beirut.\n36. Sharh al-Ahkam al-Shar'iyyah fi al-Ahwal al-Shakhsiyyah, Al-Abyani: Muhammad Zaid, - Beirut - Maktabat al-Nahdah.\n37. Sharh al-Jami' al-Sahih Musnad al-Imam al-Rabi', Nur al-Din Abdullah bin Humaid al-Salimi, corrected and commented on by Izz al-Din al-Tanukhi - Sultanate of Oman: Maktabat Muscat.\n38. Sharh Fath al-Qadir, Kamal al-Din Muhammad bin Abd al-Wahid known as Ibn al-Humam, Dar al-Kutub al-Ilmiyyah, Beirut, Lebanon, 1st Ed, 1995 AD.\n39. Sharh al-Nil wa Shifa' al-Alil, Sheikh Muhammad bin Yusuf Atfiyyash - Jeddah, Maktabat al-Irshad, Third Edition, 1405 AH - 1985 AD.\n40. Sharh Muslim by Imam al-Nawawi.\n41. Shifa' al-Ghalil fi Takhrij Ahadith Manar al-Sabil: Nasir al-Din al-Albani - Beirut - Al-Maktab al-Islami.\n42. Sahih Ibn Hibban - with Al-Ihsan - by Ibn Hibban, investigation: Shu'aib al-Arna'ut. - Beirut - Mu'assasat al-Risalah, First Edition, 1412 AH.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 84
  },
  {
    "serial_number": "4596114",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 86,
    "volume_number": 1,
    "text": "43. Sahih Ibn Hibban, arranged by Ibn Balban, investigation: Shu'aib al-Arna'ut, Mu'assasat al-Risalah, Second Edition 1993 AD.\n44. Sahih Ibn Khuzaymah, investigation: Mustafa al-A'zami, Al-Maktab al-Islami, Second Edition 1421 AH.\n45. Sahih al-Adab al-Mufrad, Al-Albani, Al-Maktab al-Islami.\n46. Sahih al-Bukhari - with Fath al-Bari - by Imam al-Bukhari. Publisher Dar al-Ma'rifah.\n47. Sahih al-Bukhari, authored by Muhammad bin Isma'il al-Bukhari, Al-Maktabah al-Islamiyyah, Istanbul.\n48. Sahih al-Targhib wa al-Tarhib, Al-Albani, Al-Maktab al-Islami.\n49. Sahih al-Jami' al-Saghir, Al-Albani, Al-Maktab al-Islami.\n50. Al-Sahih al-Musnad min Asbab al-Nuzul, by Muqbil bin Hadi al-Wadi'i - Riyadh - published by Maktabat al-Ma'arif, 1400 AH.\n51. Sahih Sunan Ibn Majah, by Nasir al-Din al-Albani. Al-Maktab al-Islami, Third Edition, 1408 AH.\n52. Sahih Muslim, by Imam Muslim, investigation: Muhammad Fu'ad Abd al-Baqi. Dar Ihya' al-Turath al-Arabi.\n53. Sifat al-Fatwa wa al-Mufti wa al-Mustafti, Ahmad bin Hamdan al-Nimari...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 85
  },
  {
    "serial_number": "4596115",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 87,
    "volume_number": 1,
    "text": "...investigation: Muhammad Nasir al-Din al-Albani, Al-Maktab al-Islami, Ed: Third, 1397 AH Beirut.\n54. Al-Du'afa by Al-Uqayli: Abu Ja'far Muhammad bin Amr bin Musa bin Hammad - Beirut - Dar al-Kutub al-Ilmiyyah 322 AH.\n55. Da'if al-Tirmidhi, Al-Albani, Arab Bureau of Education for the Gulf States. Ilal al-Hadith - Ibn Abi Hatim - Beirut Lebanon - Dar al-Ma'rifah.\n56. Al-Ilal al-Mutanahiyah: Abd al-Rahman bin Ali bin al-Jawzi, Dar Nashr al-Kutub al-Islamiyyah, 597 AH.\n57. Al-Ilal al-Waridah fi al-Ahadith al-Nabawiyyah - by Abu al-Hasan al-Daraqutni - Riyadh - Saudi Arabia, Dar Taybah.\n58. Awn al-Ma'bud, Shams al-Haqq al-Azim Abadi, Dar al-Kutub.\n59. Ghayat al-Maram fi Takhrij Ahadith al-Halal wa al-Haram, Muhammad Nasir al-Din al-Albani - Beirut - Lebanon, Al-Maktab al-Islami.\n60. Gharib al-Hadith by Al-Khattabi investigation: Dr. Abd al-Karim al-Izbawi, Umm Al-Qura University in Makkah Al-Mukarramah.\n61. Gharib al-Quran: Abu Bakr Muhammad bin Uzayr al-Sijistani \"died 330 AH\" investigation Muhammad Adib Abd al-Wahid - Dar Qutaybah 1416 AH - 1995 AD.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 86
  },
  {
    "serial_number": "4596116",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 88,
    "volume_number": 1,
    "text": "62. Fatawa of the Permanent Committee for Scholarly Research and Ifta.\n63. Al-Fatawa by Sheikh Shaltut, printed by Dar al-Shuruq, Beirut, Eighth Edition, year 1395 AH.\n64. Fath al-Bari: Ahmad bin Ali bin Hajar al-Asqalani, Al-Salafiyyah Press and Library - Cairo - Second Edition 773 AH - 852 AH.\n65. Fath al-Qadir, Al-Shawkani, - Beirut - Dar Ihya' al-Turath al-Arabi.\n66. Fath al-Qadir Sharh al-Hidayah, Kamal al-Din Muhammad bin Abd al-Wahid al-Siwasi known as Ibn al-Humam, Ed: Second, Dar al-Fikr, Beirut.\n67. Fath al-Ma'bud bi Tartib Musnad al-Tayalisi.\n68. Fiqh al-Islam Sharh Bulugh al-Maram by Sheikh Abd al-Qadir Shaybah al-Hamad.\n69. Al-Fawa'id al-Majmu'ah fi al-Ahadith al-Mawdu'ah. Muhammad bin Ali al-Shawkani. Beirut - Lebanon. Al-Maktab al-Islami.\n70. Al-Qamus al-Muhit, Hamd bin Ya'qub bin Muhammad bin Ibrahim al-Shirazi al-Fairuzabadi, arrangement: Al-Tahir bin Ahmad al-Zawi, First Edition: 1399 AH, Dar al-Kutub al-Ilmiyyah, Beirut.\n71. Al-Qamus al-Muhit, by Majd al-Din Muhammad bin Ya'qub al-Fairuzabadi, Beirut Lebanon, Arab Foundation for Printing and Publishing, 817 AH.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 87
  },
  {
    "serial_number": "4596117",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 89,
    "volume_number": 1,
    "text": "72. Qabas min Hady al-Islam (A Glimpse of the Guidance of Islam), by Sheikh Abd al-Muhsin bin Hamad al-Abbad, Al-Rashid Presses in Madinah, First Edition, 1401 AH.\n73. Al-Qawanin al-Fiqhiyyah: by Muhammad bin Ahmad bin Juzayy al-Kalbi, Dar al-Qalam, Beirut, no date of publication.\n74. Al-Kafi fi Fiqh al-Imam Ahmad, Muwaffaq al-Din Abdullah bin Qudamah, investigation: Zuhair al-Shawish, Ed: Fifth, Al-Maktab al-Islami, Beirut.\n75. Al-Kafi fi al-Fiqh ala Madhhab Ahl al-Madinah, Yusuf bin Abd al-Barr al-Maliki (463 AH) Mu'assasat al-Nida' - Abu Dhabi - 1424 AH / 2004 AD.\n76. Al-Kamil fi Du'afa' al-Rijal, by Imam Hafiz Abu Ahmad Abdullah bin Adi al-Jurjani, Beirut, Lebanon, Dar al-Fikr, Second Edition, 1405 AH.\n77. Kitab al-Fiqh ala al-Madhahib al-Arba'ah, authored by Sheikh Abd al-Rahman bin Muhammad bin Awad al-Jaziri.\n78. Kashshaf al-Qina' an Matn al-Iqna', Al-Bahuti: Mansur bin Idris, Makkah, 1394 AH.\n79. Kashf al-Khafa, Isma'il al-Ajluni, Dar al-Kutub al-Ilmiyyah.\n80. Lisan al-Arab - Ibn Manzur - Dar Sadir.\n81. Majallat al-Buhuth al-Islamiyyah: Issued by the General Presidency...",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 88
  },
  {
    "serial_number": "4596118",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 90,
    "volume_number": 1,
    "text": "...for Departments of Scholarly Research, Ifta, Da'wah and Guidance, Riyadh - Kingdom of Saudi Arabia, Issue [13] and [29].\n82. Majallat al-Bayan: A monthly Islamic magazine, comprehensive, issued by Al-Muntada Al-Islami, London, Issue [41].\n83. Majallat al-Hikmah for Islamic Research: Britain - Leeds, Issue [9.5].\n84. Al-Majmu' by Al-Nawawi: Yahya bin Sharaf, Dar al-Fikr.\n85. Majmu' Fatawa Sheikh Abdul Aziz bin Baz, may Allah have mercy on him.\n86. Majmu' Fatawa Sheikh al-Islam Ibn Taymiyyah.\n87. Majmu' Fatawa wa Maqalat: by Sheikh Abdul Aziz bin Baz, compilation and supervision: Muhammad bin Sa'd al-Shuway'ir, Maktabat al-Ma'arif for Publishing and Distribution in Riyadh 1413 AH.\n88. Majmu'at al-Rasa'il wa al-Masa'il al-Najdiyyah, Al-Manar Press, Egypt, 1344 AH.\n89. Al-Madkhal al-Fiqhi al-Amm, Al-Zarqa, Sheikh Mustafa Ahmad - Damascus - Dar al-Qalam, First Edition, 1998 AD.\n90. Al-Madkhal ila Madhhab al-Imam Ahmad bin Hanbal, Badran: Abd al-Qadir bin Ahmad bin Mustafa, Dar al-Fikr al-Arabi.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 89
  },
  {
    "serial_number": "4596119",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 91,
    "volume_number": 1,
    "text": "91. Al-Misbah al-Munir, Ahmad bin Muhammad bin Ali al-Fayyumi.\n92. Al-Mu'jam al-Kabir, Al-Tabarani - Maktabat al-Ulum wa al-Hikam - investigation Hamdi al-Salafi - Second Edition.\n93. Ma'rifat Ilm al-Khilaf al-Fiqhi: Nazrah ila Tahqiq al-Wifaq al-Islami, Dr. Zakariya Abd al-Razzaq al-Ma'ri - Beirut - Mu'assasat al-Risalah, 1410 AH.\n94. Al-Mughni Sharh Mukhtasar al-Khiraqi, Ibn Qudamah: Abu Muhammad Abdullah bin Ahmad - Beirut - Dar al-Fikr First Edition, 1404 AH.\n95. Mughni al-Muhtaj Sharh al-Minhaj, Sheikh Muhammad bin Ahmad al-Shirbini al-Khatib, Publisher Al-Maktabah al-Islamiyyah.\n96. Al-Muqni' fi Fiqh al-Imam Ahmad bin Hanbal, Muwaffaq al-Din Abdullah bin Ahmad bin Qudamah, Dar al-Kutub al-Ilmiyyah, Beirut.\n97. Al-Muntaqa Sharh al-Muwatta by Sulaiman bin Khalaf al-Baji, Dar al-Kitab al-Islami.\n98. Al-Munqidh min al-Dalal: by Imam Abu Hamid Muhammad bin Muhammad al-Ghazali, investigation: Dr. Samih Dughaym. Dar al-Fikr al-Lubnani, 505 AH.\n99. Manhaj al-Talibin wa Balagh al-Raghibin, Sheikh Khamis bin Sa'id al-Shaqsi - Sultanate of Oman, Ministry of National Heritage and Culture, 1403 AH, 1983 AD.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 90
  },
  {
    "serial_number": "4596120",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 92,
    "volume_number": 1,
    "text": "100. Minah al-Jalil ala Mukhtasar Khalil, by Abu Abdullah Ahmad Ulaish, died in the year 1299 AH, Al-Matba'ah al-Amirah in Cairo, 1294 AH.\n101. Mawahib al-Jalil Sharh Mukhtasar Khalil, Muhammad bin Muhammad al-Hattab (954 AH) Matba'at al-Sa'adah - Egypt - 1st Ed - 1329 AH.\n102. Al-Muhadhdhab, Abu Ishaq Ibrahim al-Shirazi, investigation: Zakariya Umayrat, Dar al-Kutub al-Ilmiyyah, Ed: First: 1416 AH Beirut.\n103. Al-Mawsu'ah al-Fiqhiyyah, Kuwait: Ministry of Endowments and Islamic Affairs, First Edition, 1412 AH - 1992 AD.\n104. Muwatta al-Imam Malik bin Anas, narration of Yahya bin Yahya al-Laythi, preparation Ahmad Ratib Armoush, Tenth Edition - Beirut, Dar al-Nafa'is, 1407 AH - 1987 AD.\n105. Official Website of Sheikh Abdul Aziz bin Baz on the Internet link: http://www.binbaz.org.sa\n106. Al-Nihayah fi Gharib al-Hadith wa al-Athar, by Ibn al-Athir, investigation Al-Tanahi, Al-Maktabah al-Islamiyyah, Beirut.\n107. Nayl al-Awtar by Al-Shawkani.\n108. Al-Nil wa Shifa' al-Alil, Sheikh Abdul Aziz bin Ibrahim al-Thamini, commentary by Bakli Abd al-Rahman Umar, 2nd Ed, 1387 AH - 1967 AD.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 91
  },
  {
    "serial_number": "4596121",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Facilitation for Women in Hajj in Light of the Prophetic Sunnah",
    "edition": "First, 1434 AH - 2013 AD",
    "publisher": "Dar Al-Hadara for Publishing and Distribution",
    "page_number": 93,
    "volume_number": 1,
    "text": "109. Computer Programs: Library of Hadith Parts, Heritage Center, Version 1.5 1420 AH. The Millennial Library, Heritage Center, Version 1.5, 1420 AH. Library of Jurisprudence and Principles, Heritage Center, Version 1.5, 1420 AH. The Golden Encyclopedia, Heritage Center, 1418 AH. The Grand Library - Heritage Center, Al-Maktabah Al-Shamilah.",
    "foot_note": "None",
    "book_id": "1062",
    "new_page_number": 92
  }
]