[
  {
    "text": "مختصر المختصر في بيان عقيدة أهل السنة والأثر\nالمؤلف: عبد الهادي بن عوض العمري\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "category_id": "1",
    "category": "العقيدة",
    "new_page_number": 1
  },
  {
    "text": "sn: 746\nbook_title: مختصر المختصر في بيان عقيدة أهل السنة والأثر\nbook_link: https://shamela.ws/book/599\nbook_id: 599\nauthor_name: عبد الهادي بن عوض العمري\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/2532\nauthor_ID: 2532\neditor: Null\npublisher: Null\nedition: الأولى، 1441 هـ - 2019 م\npages: 67\nvolumes: Null\npagination: [كتاب إلكتروني]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "category_id": "1",
    "category": "العقيدة",
    "new_page_number": 2
  },
  {
    "serial_number": "112040",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: العقيدة الكتاب : مختصر المختصر في بيان عقيدة أهل السنة والأثر المؤلف : الدكتور عبد الهادي بن عوض العمري الطبعة : الأولى ، 1441 هـ - 2019 م عدد الصفحات : 67 [ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالكتاب : مختصر المختصر في بيان عقيدة أهل السنة والأثر المؤلف : الدكتور عبد الهادي بن عوض العمري الطبعة : الأولى ، 1441 هـ - 2019 م عدد الصفحات : 67 [ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالمؤلف : الدكتور عبد الهادي بن عوض العمري الطبعة : الأولى ، 1441 هـ - 2019 م عدد الصفحات : 67 [ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nالطبعة : الأولى ، 1441 هـ - 2019 م عدد الصفحات : 67 [ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nعدد الصفحات : 67 [ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\n[ كتاب إلكتروني ] تاريخ النشر بالشاملة : 28 ذو القعدة 1442\nتاريخ النشر بالشاملة : 28 ذو القعدة 1442",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 3
  },
  {
    "serial_number": "112041",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "مختصر المختصر في بيان عقيدة أهل السنة والأثر تأليف الدكتور عبد الهادي بن عوض العمري عضو الجمعية العلمية السعودية لعلوم العقيدة والأديان والفرق والمذاهب بالجامعة الإسلامية بالمدينة النبوية الطبعة الأولى 1441 هـ - 2019 م",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 4
  },
  {
    "serial_number": "112042",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 5
  },
  {
    "serial_number": "112043",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم  مقدِّمة \"الحمدُ للهِ الذي جعل في كلِّ زمانٍ ثُلَّةً من أهلِ العلمِ يدعون من ضلَّ إلى الهدى، ويصبرون منهم على الأذى، يُحيون بكتابِ الله الموتى، ويُبَصِّرون بنورِ الله أهل العمى، فكم من قتيلٍ لإبليسَ قد أحيوه! وكم من تائهٍ ضالٍّ هدوه! فما أحسن أثرهم على النَّاس وأقبح أثر النَّاس عليهم، ينفون عن كتاب الله تحريف الغالين، وانتحال المبطلين، وتأويل الجاهلين، الذين عقدوا ألوية البدعة، وأطلقوا عنان الفتنة، فهم مختلفون في الكتاب، مخالفون للكتاب، متفقون على مفارقة الكتاب، يقولون على الله وفي الله وفي كتاب الله بغير علم، يتكلَّمون بالمتشابه من الكلام، ويخدعون جهَّال الناس بما يلبسون عليه فنعوذ بالله من فتن المضلِّين\" (1) . والصَّلاة والسَّلام على إمام المتقين، وقائد الغرِّ المحجَّلين نبيِّنا محمَّدٍ وعلى آله وصحبه أجمعين. أمَّا بعد: فلقد دأب نبيُّنا محمَّدٌ صلى الله عليه وسلم على تقرير العقيدة منذ أن نُبِّئ بـ {اقرأ} وأُرسل بالمدثِّر، ولكن بعد انتقاله إلى الرفيق الأعلى وبعد مُضيِّ عصر الخلافة",
    "foot_note": "1. خطبة الإمام أحمد في كتابة: الرد على الزنادقة والجهمية، ص 6.",
    "book_id": "599",
    "new_page_number": 6
  },
  {
    "serial_number": "112044",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "الراشدة ظهرت الفرق المخالفة لما كان عليه صلى الله عليه وسلم وأصحابه حتى التبس على كثيرٍ من النَّاس ما كان عليه هدي نبيِّها، وسلفها الصالح؛ بفعل أئمَّةٍ ضُلَّال، وسفهاء جُهَّال؛ فأصبح لزامًا على كلِّ من أراد النجاة لنفسه والسلامة لدينه أن يعلم ما يجلو به عن نفسه ذلك اللَّبس؛ ليتبيَّن له الحقُّ ويعمل على هدى ونور. ومن هنا بدأت فكرة هذه الورقات المختصرة لبيان عقيدة أهل السُّنَّة والجماعة ومنهجهم المستقيم، وتمييزها عمَّا لبَّسه المخالفون، وانتهجه المبطلون. وبعد أن كتبتُ مباحثها، وراجعتُ مادَّتها وقع الاختيار على تسمية تلك الورقات بـ (مختصر المختصر في بيان عقيدة أهل السُّنَّة والأثر)، وجاءت في مقدِّمة، وفصلين، وخاتمة، ثم ثبت المصادر والمراجع، وفهرس الموضوعات. المقدِّمة: توطئة بين يدي البحث. الفصل الأول: التعريف بأهل السُّنَّة والجماعة. وفيه خمسة مباحث: المبحث الأول: تعريف أهل السُّنَّة لغةً واصطلاحًا. المبحث الثاني: تعريف السُّنَّة لغةً واصطلاحًا. المبحث الثالث: تعريف الجماعة لغةً واصطلاحًا. المبحث الرابع: نشأة مصطلح أهل السُّنَّة والجماعة. المبحث الخامس: أدلة التسمية بأهل السُّنَّة والجماعة.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 7
  },
  {
    "serial_number": "112045",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "الفصل الثاني: سمات أهل السُّنَّة والجماعة والجماعة. وفيه ثلاثة مباحث: المبحث الأول: الأسماء التي عُرف بها أهل السُّنَّة تمييزًا عن غيرهم. المبحث الثاني: خصائص أهل السُّنَّة والجماعة. المبحث الثالث: مصادر التلقِّي عند أهل السُّنَّة والجماعة. الخاتمة: وفيها تلخيصٌ لأهمِّ نتائج البحث. وأسال الله تعالى أن ينفع بهذا البحث كاتبه وقارئه، وأن يجعله خالصًا لوجهه الكريم.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 8
  },
  {
    "serial_number": "112046",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "الفصل الأول: التعريف بأهل السنة والجماعة وفيه خمسة مباحث: المبحث الأول: تعريف أهل السَّنَّة لغة واصطلاحا. المبحث الثاني: تعريف السَّنَّة لغة واصطلاحا. المبحث الثالث: تعريف الجماعة لغة واصطلاحا. المبحث الرابع: نشأة مصطلح أهل السَّنَّة والجماعة. المبحث الخامس: أدلة التسمية بأهل السَّنَّة والجماعة.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 9
  },
  {
    "serial_number": "112047",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "المبحث الأول: التعريف بأهل السُّنَّة أهل الشيء هم أخصُّ الناس به، ويأتي في المعنويات وفي المحسوسات يقال في اللُّغة: أهل الرجل: أخصُّ الناس به، وأهلُ البيت: سكَّانه، وأهل الأمر: ولاته، وأهل المذهب: مَن يدين به (1) . وإذا أُطلق مصطلح أهل السُّنَّة فالمراد به أحد معنيين: المعنى الأول: معنى عامٌّ فيدخل فيه كل ما سوى الرافضة (2) ، من الطوائف المنتسبة للإسلام. فيقال المنتسبون للإسلام قسمان: أهل السُّنَّة والشيعة، كما بيَّن ذلك شيخ الإسلام رحمه الله: \"هو المعنى المشهور عند العامَّة، فإنهم لايعرفون ضد السنِّي إلا الرافضي، فإذا قال أحدهم: أنا سنِّيٌّ فإنما معناه عندهم: لست رافضيًّا\" (3) .",
    "foot_note": "1. مقاييس اللغة، لابن فارس 1/ 150، ولسان العرب، لابن منظور 11/ 29، مادة (أهل). \n2. ينظر: مقالات الإسلاميين 1/ 89، ومنهاج السُّنَّة النبوية 2/ 96، وأصول مذهب الشيعة الإمامية 1/ 108. \n3. مجمل الاعتقاد، لابن تيمية ضمن مجموع الفتاوى 3/ 356، ومنهاج السُّنَّة النبوية 1/ 121.",
    "book_id": "599",
    "new_page_number": 10
  },
  {
    "serial_number": "112048",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "وقد ورد عن بعض السلف هذا المعنى، فقد سُئل سفيان الثوري رحمه الله يا أبا عبد الله ما موافقة السُّنَّة؟ فقال: \"القرآنُ كلام الله غير مخلوق منه بدأ وإليه يعود من قال غير هذا فهو كافر، والإيمان قولٌ وعملٌ ونيَّة يزيد وينقص، يزيد بالطاعة وينقص بالمعصية، ولا يجوز القول إلا بالعمل، ولا يجوز القول والعمل إلا بالنيَّة، ولا يجوز القول والعمل والنيَّة إلا بموافقة السُّنَّة. فقال شعيبٌ فقلتُ له: يا أبا عبد الله وما موافقة السُّنَّة؟: قال تقدمة الشيخين أبي بكر وعمر رضي الله عنهما \" (1) . المعنى الثاني: معنى خاصٌّ، وهو ما يقابل المبتدعة وأهل الأهواء، وهو الأكثر استعمالًا وعليه كتب الجرح والتعديل (2) . قال أبو حاتم الرازي رحمه الله عما ما وُصِف به الإمام مالك رحمه الله من أنه جمع بين السُّنَّة والحديث، فأجاب رحمه الله: \"سمعت أحمد بن سنان الواسطي يقول: سمعت عبد الرحمن بن مهدي يقول: سفيان الثوري إمامٌ في الحديث، وليس بإمام في السُّنَّة، والأوزاعي إمامٌ في السُّنَّة وليس بإمامٍ في الحديث، ومالك إمامٌ فيهما جميعًا\" (3) .",
    "foot_note": "1. رواه اللالكائي في شرح أصول الاعتقاد 1/ 152. \n2. مجموع الفتاوى 2/ 7 - 8. \n3. ينظر: مجمع الأحباب وتذكرة أولي الألباب، محمد بن الحسن بن عبد الله الحسيني الواسطي 3/ 330.",
    "book_id": "599",
    "new_page_number": 11
  },
  {
    "serial_number": "112049",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "المبحث الثاني: تعريف السُّنَّة لغةً واصطلاحًا السُّنَّة في اللغة: مشتقَّةٌ من سنَّ الشيء: إذا أرسله، قال ابن فارس: «السين والنون أصلٌ واحدٌ مطرد، وهو جريان الشيء واطرادُهُ في سهولة، والأصل قولهم سَنَنْتُ الماءَ على وجهي أسُنُّهُ سَنًّا: إذا أرسلتُه إرسالًا» (1) ، وهي الطريقة والسيرة (2) . قال الأزهري: السُّنَّة: الطريقة المحمودة المستقيمة، ولذلك قيل فلان من أهل السُّنَّة معناه: من أهل الطريقة المستقيمة المحمودة (3) . أما في اصطلاح المحدثين فهي: ما أُثر عن النبي صلى الله عليه وسلم من قول أو فعل أو تقرير أو صفة خَلْقيَّة أو خُلُقيَّة أو سيرة، سواءً كان قبل البعثة أو بعدها (4) . وفي اصطلاح الأُصوليين تُطلق السُّنَّة \"على ما جاء منقولًا عن النَّبي",
    "foot_note": "1. مقاييس اللغة، ابن فارس 3/ 60. \n2. ينظر: النهاية، ابن الأثير 2/ 409. \n3. ينظر: تهذيب اللغة، الأزهري، 12/ 72. \n4. ينظر: توجيه النظر إلى أصول الأثر، طاهر الدمشقي، ص 3، واليواقيت والدرر في شرح نخبة أهل الفكر، ابن حجر 2/ 193.",
    "book_id": "599",
    "new_page_number": 12
  },
  {
    "serial_number": "112050",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "- صلى الله عليه وسلم على الخصوص مما لم ينص عليه في الكتاب العزيز بل إنما نص عليه من جهته عليه الصلاة والسلام، كان بيانًا لما في الكتاب أولًا، وتطلق على ما جاء عن النبي صلى الله عليه وسلم من قول أو فعل أو تقرير\" (1) . وتطلق السُّنَّة في مقابلة البدعة، قال الشاطبي رحمه الله: \"ويُطلق - أي لقب السُّنَّة- في مقابلة البدعة فيقال: فلانٌ على سُنَّة إذا عمل على وفق ما عليه النبي صلى الله عليه وسلم كان ذلك مما نص عليه في الكتاب أولًا ويقال: فلان على بدعة: إذا عمل على خلاف ذلك\" (2) . وقال ابن رجب رحمه الله: \"السُّنَّة: هي الطريق المسلوك فيشمل ذلك التمسك بما كان عليه النبي صلى الله عليه وسلم وخلفاؤه الراشدون من الاعتقادات والأعمال والأقوال، وهذه هي السُّنَّة الكاملة، ولهذا كان السلف قديمًا لايطلقون السُّنَّة إلا على ما يشمل ذلك كله، وروي ذلك عن الحسن، والأوزاعي، والفضيل بن عياض\" (3) .",
    "foot_note": "1. الموافقات، للشاطبي 4/ 3. \n2. المرجع نفسه 4/ 4. \n3. جامع العلوم والحكم، ص 262.",
    "book_id": "599",
    "new_page_number": 13
  },
  {
    "serial_number": "112051",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "المبحث الثالث: تعريف الجماعة لغةً واصطلاحًا الجماعة في اللغة، من (جمع)، قال في الصَّحاح: \"الجمعُ: مصدرٌ مؤكّد جَمَعتُ الشيء، وقد يكون اسمًا لجماعة الناس، والجمع على جموع … \" (1) . وفي لسان العرب: \"الجمعُ: اسمٌ لجماعةِ الناس، والجَمْعُ مصدرٌ مؤكّد جمعت الشيء والجمع: المجتمعون، وجمعه: جموع، والجماعة والجميع والمجْمع، كالجمع\" (2) . وفي الاصطلاح: هي لزوم الحق ولو كنت وحدك (3) ، قال الإمام البربهاري رحمه الله في تعريفه للجماعة:",
    "foot_note": "1. الصحاح، للجوهري 3/ 1198. \n2. لسان العرب، لابن منظور 2/ 200. \n3. مات زيد بن عمرو بن نفيل قبل أن يبعث رسول الله صلى الله عليه وسلم، فقال رسول الله صلى الله عليه وسلم: يبعث يوم القيامة أُمَّةً وحده، أخرجه أحمد في مسنده 1/ 189، رقم 1642، والنسائي في الكبرى، رقم 8131، وأبو يعلى في مسنده 4/ 42، رقم 2047، والحاكم في مستدركه 3/ 239، رقم 4956، والطبراني في معجمه 1/ 151، رقم 350، قال: الهيثمي: فيه مجالد، وهذا مما مدح من حديث مجالد، وبقيَّة رجاله رجال الصحيح، وإسناده حسن. ينظر: مجمع الزوائد 9/ 416 - 417.",
    "book_id": "599",
    "new_page_number": 14
  },
  {
    "serial_number": "112052",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "\"والجماعة ما اجتمع عليه أصحاب رسول الله صلى الله عليه وسلم في خلافة أبي بكر وعمر وعثمان رضي الله عنهم \" (1) . وقال أيضًا: \"والأساس الذي بيَّنا عليه الجماعة هم أصحاب محمد صلى الله عليه وسلم رحمهم الله أجمعين وهم أهل السُّنَّة والجماعة\" (2) . وقال العلامة عبد الرحمن بن إسماعيل المعروف - بأبي شامه- \"وحيث جاء الأمر بلزوم الجماعة فالمراد به لزوم الحق وأتباعة، وإن كان المستمسك بالحق قليلًا، والمخالف كثيرًا؛ لأن الحق هو الذي كانت عليه جماعة الجماعة الأولى من النبي صلى الله عليه وسلم وأصحابه رضي الله عنهم، ولانظر إلى كثرة أهل الباطل بعدهم\" (3) . وقال القاضي ابن أبي العز الحنفي: \"والجماعة جماعة المسلمين وهم الصحابة رضي الله عنهم والتابعون لهم بإحسان إلى يوم الدين\" (4) . ونلحظ أن هناك علاقةً وطيدةً بين مصطلح السُّنَّة ومصطلح الجماعة. قال ابن عباس رضي الله عنهما في قول الله تعالى: \" {يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ",
    "foot_note": "1. شرح السُّنَّة، الإمام البربهاري، ص 105. \n2. المرجع نفسه، ص 21. \n3. الباعث على إنكار البدع والحوادث، ص 34. \n4. شرح العقيدة الطحاوية 1/ 326.",
    "book_id": "599",
    "new_page_number": 15
  },
  {
    "serial_number": "112053",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "وُجُوهٌ} (1) \"فأمَّا الذين ابيضَّت وجوههم فأهل السُّنَّة والجماعة\" (2) . وقال شيخ الإسلام ابن تيمية رحمه الله: \"والبدعة مقرونة بالفرقة، كما أن السُّنَّة مقرونة بالجماعة، فيقال أهل السُّنَّة والجماعة؛ كما يقال أهل البدعة والفرقة\" (3) .",
    "foot_note": "1. سورة آل عمران، آية 106. \n2. شرح أُصول اعتقاد السُّنَّة 1/ 72. \n3. الاستقامة، ابن تيمية 1/ 42.",
    "book_id": "599",
    "new_page_number": 16
  },
  {
    "serial_number": "112054",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "المبحث الرابع: نشأة مصطلح أهل السُّنَّة والجماعة يرجع تاريخ إطلاق هذا اللفظ إلى صدر الإسلام عصر النبوة والقرون المفضَّلة، قال ابن عباس رضي الله عنهما في قوله تعالى: {يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ} (1) : \"فأما الذين ابيضت وجوههم فأهل السُّنَّة والجماعة وأولوا العلم، وأما الذين اسودَّت وجوههم فأهل البدع والضلالة\" (2) . وقال الشيخ الدكتور محمد الخميس- حفظه الله-: \"ومصطلح أهل السُّنَّة والجماعة مصطلحٌ قديم، ويُقصد به: المتمسِّكون بسُنَّة النبي صلى الله عليه وسلم وأصحابه رضي الله عنهم وتابعيهم، المتمسكون بما كان عليه جماعة المسلمين في الصدر الأول، وقد استنبط هذا المصطلح من الأحاديث التي تحض على اتباع السُّنَّة والتمسك بها والأمر بلزوم الجماعة وترك التفرُّق والاختلاف، فمن ذلك قوله صلى الله عليه وسلم: «افترقت اليهود والنصارى على إحدى وسبعين أو ثنتين وسبعين فرقة كلها في النار، وستفترق أمتي على ثلاث وسبعين فرقة كلها في النار، إلا واحدة وهي الجماعة» (3) ، فهذا أصل التسمية، وقد استعمل هذا المصطلح",
    "foot_note": "1. سورة آل عمران، آية 106. \n2. شرح أصول اعتقاد السُّنَّة 1/ 72. \n3. أخرجه أحمد في المسند 4/ 102، والطبراني 19/ 377، والحاكم 1/ 218، وأبو داود 4/ 198، وابن أبي عاصم في السنة 1/ 7، وصححه الألباني في السلسلة الصحيحة 1/ 404.",
    "book_id": "599",
    "new_page_number": 17
  },
  {
    "serial_number": "112055",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "عند السلف حيث كانوا يدوّنون ما ينقلونه من عقائد أهل السُّنَّة كالإمام أحمد وابنه عبد الله وابن أبي عاصم والخلال وغيرهم، وسُمي أهل السُّنَّة بذلك؛ لأنهم الآخذون بسُنَّة رسول الله صلى الله عليه وسلم العاملون بها و بمقتضاها المتبعون لقول رسول الله صلى الله عليه وسلم: «عليكم بسُنَّتي» (1) ، وأما تسميتهم؛ فلأنهم اجتمعوا على الحق وأخذوا به\" (2) . ولقد أُطلق هذا اللَّقب على كثيرٍ من أئمة السلف وسأذكر بعضًا منهم على سبيل المثال لا الحصر. قال أيوب السختياني: \"إني أخبر بموت الرَّجل من أهل السُّنَّة وكأني أفقد بعض أعضائي\". وقال أيضًا: \"إن من سعادة الحدث والأعجمي أن يوفقهما الله لعالم من أهل السُّنَّة\" (3) . وقال ابن جرير الطبري رحمه الله: \"وأما الصواب من القول في رؤية المؤمنين",
    "foot_note": "1. أخرجه أحمد في المسند 4/ 126، وأبو داود 5/ 13، والترمذي وقال: هذا حديثٌ حسنٌ صحيح، والترمذي مع تحفة الأحوذي 7/ 438، وقال الألباني: سنده صحيح، ونقل تصحيحه عن الضياء المقدسي، مشكاة المصابيح 1/ 58، رقم 165. \n2. التوضيحات الجلية على شرح الطحاوية 1/ 33. \n3. التوضيحات الجلية 1/ 60 - 61.",
    "book_id": "599",
    "new_page_number": 18
  },
  {
    "serial_number": "112056",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "ربهم عز وجل يوم القيامة وهو ديننا الذي ندين الله به، وأدركنا عليه أهل السُّنَّة والجماعة فهو أن أهل الجنة يرونه على ما صحَّت به الأخبار عن رسول صلى الله عليه وسلم \" (1) . وذكر هذا أيضًا أبو جعفر أحمد بن محمد الطحاوي بقوله: \"هذا ذكر بيان اعتقاد أهل السُّنَّة والجماعة\" (2) .",
    "foot_note": "1. صريح السُّنَّة، ابن جرير، ص 20. \n2. عقيدة أهل السُّنَّة والجماعة، ص 5.",
    "book_id": "599",
    "new_page_number": 19
  },
  {
    "serial_number": "112057",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "المبحث الخامس: أدلة التسمية بأهل السُّنَّة والجماعة أما تسمية أهل السُّنَّة والجماعة بهذا الاسم فهي ثابتةٌ بالنصوص الشرعية. أولًا: من القرآن قال تعالى: {وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا} (1) . قال الشيخ السعدي رحمه الله: هذه الآية فيها الحثُّ على التمسُّك بحبل الله الذي أوصله إليهم، وجعله السبب بينهم وبينه وهو دينه وكتابه، والاجتماع على ذلك وعدم التفرُّق، وأن يستديموا ذلك إلى الممات (2) . وقوله تعالى: {إِنَّ الَّذِينَ فَرَّقُوا دِينَهُمْ وَكَانُوا شِيَعًا لَسْتَ مِنْهُمْ فِي شَيْءٍ إِنَّمَا أَمْرُهُمْ إِلَى اللَّهِ ثُمَّ يُنَبِّئُهُمْ بِمَا كَانُوا يَفْعَلُونَ} (3) . قال الشيخ السعدي رحمه الله: \"دلَّت الآية الكريمة أن الدين يأمر بالاجتماع والائتلاف وينهى عن التفرُّق والاختلاف في أهل الدين وفي سائر مسائله الأصوليَّة والفروعيَّة\" (4) .",
    "foot_note": "1. سورة آل عمران، آية 103. \n2. ينظر: تيسير الكريم الرحمن 1/ 231. \n3. سورة الأنعام، آية 159. \n4. تيسير الكريم الرحمن 1/ 528.",
    "book_id": "599",
    "new_page_number": 20
  },
  {
    "serial_number": "112058",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "وقال تعالى: {وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّى وَنُصْلِهِ جَهَنَّمَ وَسَاءَتْ مَصِيرًا} (1) . وجه دلالة الآية أن الله تعالى جمع بين مشاقة الرسول صلى الله عليه وسلم وبين مخالفة سبيل المؤمنين في الوعيد، فلو كان اتباع غير سبيل المؤمنين مباحًا لما جمع بينه وبين المحظور ومتابعة غير سبيلهم تقع بمخالفة أقوالهم أو أفعالهم (2) . وقال تعالى: {وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ} (3) . قال الشيخ السعدي رحمه الله في بيان الاستدلال بالآية: \"وهم المؤمنون بالله وملائكته ورسله، المستسلمون لربهم، المنيبون إليه، واتِّباع سبيلهم أن يسلك مسلكهم في الإنابة إلى الله عز وجل\" (4) . ثانيًا: من السُّنَّة عن معاوية بن أبي سفيان رضي الله عنه أنه قال: قال رسول الله صلى الله عليه وسلم: «إن أهل الكتاب افترقوا في دينهم على اثنتين وسبعين ملة وإن هذه الأمة ستفترق على ثلاث وسبعين ملة -يعني الأهواء- كلها في النار إلا واحدة وهي: الجماعة",
    "foot_note": "1. سورة النساء، آية 115. \n2. أنوار التنزيل، للبيضاوي 1/ 243 - . 244. \n3. سورة لقمان، آية 15. \n4. تفسير الكريم الرحمن 3/ 1351.",
    "book_id": "599",
    "new_page_number": 21
  },
  {
    "serial_number": "112059",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "وإنه سيخرج في أمتي أقوامٌ تجارى بهم تلك الأهواء كما يتجارى الكَلَبُ (1) بصاحبه، لايبقى منه عرق ولا مفصل إلادخله\" (2) . وفي هذا تشبَّيه من النبي صلى الله عليه وسلم لحال الزائغين من أهل البدع في استيلاء تلك الأهواء عليهم، وذهابها في كلِّ وادٍ مُرْدي، وفي سريان تلك الضلالة منهم إلى الغير يدعونهم إليها، ثم تنفرهم من العلم، وامتناعهم من قبوله حتى يهلكوا جهلًا -بحال صاحب الكَلَب، وسريان تلك العلَّة في عروقه ومفاصله، وحصول شبه الجنون منه ثم تعديه إلى الغير- بعقره إياه، وتنفره من الماء، وامتناعه عنه حتى يهلك عطشًا (3) . وقال صلى الله عليه وسلم لحذيفة بن اليمان رضي الله عنه: «تلزمُ جمَاعةَ المسلمين وإمامَهم» (4) .",
    "foot_note": "1. داءٌ يعرض للإنسان من عضِّ الكَلْبِ الكَلِب، فيصيبه شبه الجنون، فلا يعض أحدًا إلا كُلب وتعرض له أعراض رديئة ويمتنع من شراب الماء حتى يموت عطشًا. ينظر: النهاية ابن الأثير، 4/ 195. \n2. رواه أحمد 4/ 102، وأبو داود، 5/ 5 - 6، والحديث صحيح بشواهده صححه الحاكم في المستدرك ووافقه الذهبي، ينظر: المستدرك مع التلخيص 1/ 128، وقال الألباني في ظلال الجنة في تخريج السُّنَّة: \"حديثٌ صحيحٌ بما قبله وما بعده\" انظر: السُّنَّة، لابن أبي عاصم مع ظلال الجنة. \n3. ينظر: شرح الطيبي على مشكاة المصابيح، باب الاعتصام بالكتاب والسُّنَّة 2/ 641. \n4. أخرجه البخاري، كتاب المناقب، باب علامات النُّبوَّة في الإسلام 2/ 529 - 530.",
    "book_id": "599",
    "new_page_number": 22
  },
  {
    "serial_number": "112060",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "وقوله: «تلزم جماعة المسلمين»، أُخذ منه لفظ: أهل السُّنَّة والجماعة، وذلك لكون الحق في جماعة المسلمين في الأغلب (1) . وفي الصحيحين عن أنس رضي الله عنه في قصة الثلاثة الذين جاءوا بيوت النبي صلى الله عليه وسلم فقال أحدهم: أُصلي اليل أبدًا، وقال الآخر: أصوم الدهر ولا أفطر، وقال الآخر: أنا اعتزل النساء فلا أتزوج، فقال رسول الله صلى الله عليه وسلم لهم: «أما والله إني لأخشاكم لله وأتقاكم له، لكنِّي أصوم وأفطر وأُصلِّي وأرقد وأتزوج النساء فمنْ رغب عن سنَّتي فليس منِّي» (2) . وهذا دليلٌ على أنَّ المشروع هو الاقتصاد في الطاعات؛ لأن إتعاب النفس فيها والتشديد عليها يفضي إلى ترك الجميع، والدين يسر، ولن يشاد الدين أحدٌ إلا غلبه، والشريعة المطهَّرة مبنيَّةٌ على التيسير وعدم التنفير، وقوله: «فمن رغب عن سنَّتي فليس منِّي» المراد بالسُّنَّة: الطريقة، والرغبةُ: الإعراض، وأراد صلى الله عليه وسلم أن التارك لهديه القويم المائل إلى الرهبانية خارج عن الاتباع إلى الابتداع (3) .",
    "foot_note": "1. ينظر: فتح الباري على صحيح البخاري، باب علامات النبوة في الإسلام 4/ 455. \n2. أخرجه البخاري، كتاب النكاح، باب الترغيب في النكاح، 3/ 354. \n3. ينظر: نيل الأوطار 6/ 123.",
    "book_id": "599",
    "new_page_number": 23
  },
  {
    "serial_number": "112061",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "وهناك أصول من التزم بها كان من أهل السُّنَّة والجماعة، قيل لسهل ابن عبد الله التستري متى يعلم الرجل أنه على السُّنَّة والجماعة؟ قال: إذا عرف من نفسه عشر خصال: لا يترك الجماعة، لا يسب أصحاب النبي صلى الله عليه وسلم، لا يخرج على هذه الأمه بالسيف، ولا يكذِّب بالقدر، لا يشك في الإيمان، لا يماري في الدين، لا يترك الصلاة على من يتوب من أهل القبلة بالذنب، لا يترك المسح على الخفين، لا يترك الجمعة خلف كل والٍ جَار أوعدل (1) . وقال الإمام أحمد رحمه الله: \"أصول السُّنَّة عندنا: التمسُّك بما كان عليه أصحاب رسول الله صلى الله عليه وسلم … \" (2) ، ثم ذكر جملة من عقائد السلف. ويقول ابن حزم رحمه الله: \"وأهل السُّنَّة الذين نذكرهم أهل الحق، ومن عداهم فأهل البدعة، فإنهم الصحابة رضي الله عنهم، ومن سلك نهجهم من خيار التابعين، ثم أصحاب الحديث ومن اتبعهم من الفقهاء جيلًا فجيلًا إلى يومنا هذا، ومن اقتدى بهم من العوام في شرق الأرض وغربها رحمهم الله\" (3) . وقال الأصبهاني بعد كلامه عن أهل الأهواء: \"وأما أهل الحق فجعلوا",
    "foot_note": "1. شرح أصول اعتقاد أهل السُّنَّة والجماعة 1/ 138. \n2. المرجع نفسه 1/ 155 - 156. \n3. الفصل في الملل والنحل 2/ 271.",
    "book_id": "599",
    "new_page_number": 24
  },
  {
    "serial_number": "112062",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "الكتاب والسُّنَّة إمامهم، وطلبهم الدين من قبَلهما، وما وقع لهم من معقولهم وخواطرهم عرضوه على الكتاب والسُّنَّة فإن وجدوه موافقًا لهما قبلوه، وشكروا الله حيث أراهم ذلك ووفقهم إليه، وإن وجدوه مخالفًا لهما تركوا ما وقع لهم، وأقبلوا على الكتاب والسُّنَّة، ورجعوا بالتهمة على أنفسهم\" (1) . وقال السجزي رحمه الله: \"فأهل السُّنَّة: هم الثابتون على اعتقاد ما نقله إليهم السلف الصالح رحمهم الله عن الرسول صلى الله عليه وسلم؛ لأنهم رضي الله عنهم أئمة، وقد أُمرنا باقتفاء آثارهم واتباع سُنَّتهم، وهذا أظهر من أن يحتاج فيه إلى إقامة برهان، والأخذ بالسُّنَّة واعتقادها مما لامرية في وجوبه\" (2) . وللإمام البربهاري رحمه الله عبارة وَصَف بها أهل السُّنَّة فقال: \"اعلم أن الإسلام هو السُّنَّة، والسُّنَّة هي الإسلام ولا يقوم أحدهما إلا بالآخر، فمن السُّنَّة لزوم الجماعة، ومن رغب غير الجماعة وفارقها فقد خلع ربقة (3) الإسلام من عنقة وكان ضالًا مضلًا\" (4) .",
    "foot_note": "1. الحجة في بيان المحجة وعقيدة أهل السُّنَّة، الأصبهاني 2/ 238. \n2. رسالة الإمام السجزي في الرد على من أنكر الحرف والصوت، ص 99. \n3. الرِّبْقُ بالكَسْرِ: حَبْل فيه عِدة عُرىً يُشَدُّ بهِ البَهْمُ الصِّغارُ من أَعْنُقِها أَو يَدِها لِئلاّ تَرْضَعَ، ينظر: تاج العروس 25/ 329. \n4. شرح السُّنَّة، ص 21.",
    "book_id": "599",
    "new_page_number": 25
  },
  {
    "serial_number": "112063",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "وفي تحديده لضابط صاحب السُّنَّة قال: \"أصل اثنين وسبعين هوى: أربعة أهواء، فمن هذه الأربعة الأهواء تشعبت الاثنان وسبعون هوى: القدرية، والمرجئة، والشيعة، والخوارج، فمن قدَّم أبا بكر وعمر وعثمان وعليًّا على أصحاب رسول الله صلى الله عليه وسلم ولم يتكلَّم في الباقين إلا بخير ودعا لهم فقد خرج من التشيُّع أوله وآخره، ومن قال: الإيمان قولٌ وعملٌ يزيد وينقص فقد خرج من الإرجاء أوله وآخره، ومن قال: الصلاةُ خلف كلِّ برٍّ وفاجر، والجهاد مع كلِّ خليفة، ولم ير الخروج على السلطان بالسيف، ودعا لهم بالصلاح، فقدخرج من قول الخوارج أوله وآخره، ومن قال: المقادير كلُّها من الله سبحانه وتعالى خيرها وشرها، يضل من يشاء ويهدي من يشاء، فقد خرج من قول القدرية أوله وآخره وهو صاحب سُنَّة\" (1) . ووصفهم شيخ الإسلام رحمه الله بأنهم وسط في سائر أبواب السُّنَّة؛ \"لأنهم متمسِّكون بكتاب الله وسُنَّة رسول الله صلى الله عليه وسلم وما اتفق عليه السابقون الأولون من المهاجرين والأنصار والذين اتبعوهم بإحسان إلى يوم الدين\" (2) . وقال أيضًا: «فمن قال بالكتاب و السُّنَّة والإجماع كان من أهل السُّنَّة والجماعة\" (3) .",
    "foot_note": "1. شرح السُّنَّة، ص 57. \n2. مجموع الفتاوى 3/ 375. \n3. المرجع نفسه 3/ 346.",
    "book_id": "599",
    "new_page_number": 26
  },
  {
    "serial_number": "112064",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "فمن سلم من البدع وتمسَّك بهدي النبي صلى الله عليه وسلم كان من أهل السُّنَّة والجماعة. قال الشيخ عبد الرحمن السعدي رحمه الله: «فأهل السُّنَّة المحضة السالمون من البدع الذين تمسكوا بما كان عليه النبي صلى الله عليه وسلم وأصحابه في الأصول كلها، أصول التوحيد والرسالة والقدر ومسائل الإيمان وغيرها، وغيرهم من خوارج ومعتزلة وجهمية وقدرية ورافضة ومرجئة ومن تفرَّع عنهم كلهم من أهل البدع الاعتقادية\" (1) . ووصفهم الشيخ بكر أبو زيد رحمه الله فقال: \"أهل السُّنَّة والجماعة الذين درجوا على منهاج النبوة، ولم ينفصلوا عنها ولا لحظة واحدة لا باسم ولا برسم، فليس لهم شخص ينتمون إليه سوى منهاج النبوة (الكتاب والسُّنَّة) إذ الأصل لا يحتاج إلى سمة خاصة تميّزه، إنما الذي يحتاج إلى اسمٍ معيَّن هو الخارج من هذا الأصل من تلكم الجماعات التي انشقت من الأصل\" (2) .",
    "foot_note": "1. الفتاوى السعدية، للشيخ عبد الرحمن الناصر السعدي، ص 63 - 64. \n2. حكم الانتماء إلى الفرق والأحزاب والجماعات الإسلامية، ص 28.",
    "book_id": "599",
    "new_page_number": 27
  },
  {
    "serial_number": "112065",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "الفصل الثاني: سمات أهل السنة والجماعة وفيه ثلاثة مباحث: المبحث الأول: الأسماء التي عرف بما أهل السنة تمييزا عن غيرهم. المبحث الثاني: خصائص أهل السَّنَّة والجماعة. المبحث الثالث: مصادر التلقي عند أهل السَّنَّة والجماعة.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 28
  },
  {
    "serial_number": "112066",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "المبحث الأول: الأسماء التي عُرف بها أهل السُّنَّة تمييزًا عن غيرهم كان الصحابة رضي الله عنهم يتسمّون بما سمَّاهم الله سبحانه وتعالى ممتثلين قول الله تعالى: {وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ} (1) ، بل كان السلف يحذرون من التسمِّي بغير الإسلام والسُّنَّة، قال ميمون بن مهران: \"إياكم وكل اسم يسمَّى بغير الإسلام\" (2) ، ولكن لما ظهرت البدع وتعددت فرق الضلال وأخذ كل صاحب بدعه يدعو إلى بدعته مع انتسابهم في الظاهر إلى الإسلام أصبح لزامًا على أهل الحق المتمسِّكين بهدي النبي صلى الله عليه وسلم أن يُعرفوا بأسماء تميزهم عن أهل الأهواء والبدع، ومن تأمل أسماء أهل السُّنَّة وجدها تدلُّ على الإسلام، ولا ينتسبون لشخصيات كحال أهل البدع، كالجهمية نسبةً إلى الجهم، والزيدية نسبةً إلى زيد بن على بن الحسين، … وغيرهم. فأسماء أهل السُّنَّة مستنبطة من الإسلام وسأذكر بعضًا من أسمائهم.  1 - الفرقة الناجية أُخذ هذا اللقب من قول النبي صلى الله عليه وسلم لما سأله الصحابة رضي الله عنهم قالوا: يا رسول الله مَنْ الفرقة الناجية؟ قال رسول الله صلى الله عليه وسلم: \"إن أمتي ستفترق على اثنتين",
    "foot_note": "1. سورة الزمر، آية 12. \n2. الإبانة الصغرى، ابن بطة، ص 137، والكبرى 1/ 342، 354.",
    "book_id": "599",
    "new_page_number": 29
  },
  {
    "serial_number": "112067",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "وسبعين فرقة كلها في النار إلا واحدة وهي الجماعة\" (1) . ويقول شيخ الإسلام في جوابه لسؤال عن حديث افتراق الأمه: \"الحمد لله الحديث مشهور في السنن والمسانيد كسنن أبي داود، والترمذي والنسائي وغيرهم، وفي رواية قالوا: يا رسول الله مَنْ الفرقة الناجية؟ قال: «مَنْ كان على مثل ما أنا عليه وأصحابي»، وفي رواية قال: «هي الجماعة يد الله على الجماعة» (2) . وعلى كل فإن التسمية سواء أُخذت من منطوق الحديث أو مفهومه فهي تسمية شرعية. ولقد عقد البغدادي بابًا في كتابه عَنْونَ له بـ (بيان أوصاف الفرقة الناجية، وتحقيق النجاة لها، وبيان محاسنها) (3) . ويقول الشيخ حافظ حكمي رحمه الله: \"وقد أخبر الصادق المصدوق أن الفرقة الناجية هم من كان على مثل ما كان عليه هو وأصحابه وإنما تصلح هذه الصفة لحملتها وحُفَّاظها المنقادين لها المتمسِّكين بها، أعني بذلك أئمة الحديث وجهابذة السُّنَّة\" (4) .",
    "foot_note": "1. أخرجه ابن ماجه 2/ 1322، رقم 3993، وابن جرير في تفسيره 4/ 32، وأبو يعلى 7/ 32، رقم 3938. \n2. مجموع الفتاوى 3/ 345. \n3. الفرق بين الفرق، ص 313. \n4. معارج القبول 2/ 159.",
    "book_id": "599",
    "new_page_number": 30
  },
  {
    "serial_number": "112068",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "2 - الطائفة المنصورة وهذا دلَّ عليه قول النبي صلى الله عليه وسلم: «لاتزال طائفةٌ من أمَّتي منصورين لا يضرُّهم من خذلهم حتى تقوم الساعة» (1) . وقال صلى الله عليه وسلم: «لاتزال طائفةٌ من أمَّتي ظاهرين حتى يأتيهم أمر الله وهم ظاهرون» (2) .  3 - أهل الحديث والأثر سُمُّوا بذلك لاشتغالهم بحديث رسول الله صلى الله عليه وسلم وآثار صحابته رضي الله عنهم، قال الإمام أحمد: دين النَّبي محمَّدٍ أخبارُ … نعم المطيَّة للفتى آثارُ لا ترغبنَّ عن الحديثِ وآلِهِ … فالرأيُ ليلٌ والحديثُ نهارُ (3) وقال السَّفَّاريني رحمه الله: اعلم هديتَ أنَّه جاء الخبرْ … عن النَّبي المقتفى خير البشرْ",
    "foot_note": "1. أخرجه أحمد في المسند 4/ 436، والترمذي وقال: حديثٌ حسنٌ صحيح، والحديث صحَّحه الألباني في السلسلة الصحيحة 4/ 619. \n2. أخرجه البخاري في صحيحه، كتاب الاعتصام بالكتاب والسُّنَّة، باب قول النبي صلى الله عليه وسلم (لا تزال طائفة) فتح الباري 13/ 239، ومسلم في صحيحه، كتاب الإماره 3/ 1523. \n3. جامع بيان العلم وفضله وما ينبغي في روايته وحمله، ابن عبد البر 2/ 43.",
    "book_id": "599",
    "new_page_number": 31
  },
  {
    "serial_number": "112069",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "بأنَّ ذي الأمة سوف تفترقْ … بضعًا وسبعين اعتقادًا والمحقْ ما كان في نهجِ النَّبي المصطفَى … وصحبه من غير زيغٍ وجفَا وليس هذا النصُّ جزمًا يعتبرْ … في فرقةٍ إلا على أهلِ الأثرْ (1) وقال أيضًا: \" … الذين يأخذون عقيدتهم عن كتاب الله عز وجل أو سنة نبيه صلى الله عليه وسلم أو ما ثبت وصحَّ عن السلف الصالح من الصحابة رضي الله عنهم والتابعين\" (2) . وهم في ذلك يجمعون بين رواية الحديث، واعتقاده والعمل به، قال ابن تيمية رحمه الله:\"ونحن لا نعني بأهل الحديث: المقتصرين على سماعه أو كتابته أو روايته بل نعني بهم: كل من كان أحقَّ بحفظه، ومعرفته، وفهمه: ظاهرًا، وباطنًا، واتباعه: باطنًا وظاهرًا، وكذلك أهل القرآن، وأدنى خصلة في هؤلاء: محبَّة القرآن والحديث والبحث عنهما، وعن معانيهما، والعمل بما علموه من موجبهما … \" (3) . وقال أيضًا: \"فهم أعلم الناس بأقواله صلى الله عليه وسلم وأحواله، وأعظمهم تمييزًا",
    "foot_note": "1. لوامع الأنوار البهية 1/ 74، 76. \n2. لوامع الأنوار البهية 1/ 64، وللاستزاده ينظر: الرد على من أنكر الحرف والصوت، السجزي ص 175، 177 - 178، ودرء تعارض العقل والنقل 6/ 266. \n3. مجموع الفتاوى 4/ 95.",
    "book_id": "599",
    "new_page_number": 32
  },
  {
    "serial_number": "112070",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "بين صحيحهما، وسقيمهما، وأئمتهم فقهًا فيها، وأهل معرفة بمعانيها، واتباع لها تصديقًا، وعملًا، وحبًّا وموالاة لمن والاها، وبغضًا ومعاداة لمن عاداها\" (1) .  4 - الجماعة قال رسول الله صلى الله عليه وسلم: «إن أهل الكتاب افترقوا في دينهم على ثنتين وسبعين ملَّة، وإن هذه الأمة ستفترق على ثلاث وسبعين ملَّة كلها في النار إلا واحدة وهي: الجماعة وإنه سيخرج في أُمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكَلَب بصاحبه، لا يبقى منه عرق ولا مفصل إلا دخله … » (2) . وقال ابن أبي العز: \"والجماعة جماعة المسلمين وهم الصحابة رضي الله عنهم والتابعون لهم بإحسان إلى يوم الدين\" (3) .",
    "foot_note": "1. مجموع الفتاوى 3/ 347. \n2. أخرجه أحمد 4/ 102، وأبو داود 5/ 5 - 6، رقم 4597، والدارمي 2/ 314، والمروزي في السُّنَّة 15، وابن أبي عاصم في السُّنَّة، وصحَّحه الحاكم في المستدرك 1/ 128، وقال الألباني في ضلال الجنة في تخريج السُّنَّة: \"حديثٌ صحيحٌ بما قبله ومابعده\" ينظر: السُّنَّة لابن أبي عاصم مع ظلال الجنة، ص 33. \n3. شرح العقيدة الطحاوية 3/ 326.",
    "book_id": "599",
    "new_page_number": 33
  },
  {
    "serial_number": "112071",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "المبحث الثاني: خصائص أهل السُّنَّة والجماعة لأهل السُّنَّة خصائص كثيرة تميزهم عن أهل الأهواء والبدع منها:  أولًا: أهل السُّنَّة لا يبدِّع بعضهم بعضًا بمجرَّد خطأ في الاجتهاد هذه المسألة من المسائل العظيمة التي قرَّرها أهل السُّنَّة والجماعة، وخالفوا فيها أهل البدع من الخوارج والمعتزلة ومن نحا نحوهم، والأدلة على ذلك مستفيضة من الوحيين وكلام العلماء. أولًا: من القرآن قال تعالى: {لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} (1) . ولقد أمر الله سبحانه وتعالى بتقواه بقدر الاستطاعه، قال تعالى: {فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ} (2) .",
    "foot_note": "1. سورة البقرة، آية 286. \n2. سورة التغابن، آية 16.",
    "book_id": "599",
    "new_page_number": 34
  },
  {
    "serial_number": "112072",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "وحرَّر شيخ الإسلام ابن تيمية رحمه الله هذه المسألة قائلًا: \"دلَّت هذه النصوص على أنه لايكلِّف نفسًا ما تعجز عنه، خلافًا للجهمية المجبرة، ودلَّت على أنه لا يؤاخذ المخطئ والناسي خلافًا للقدرية والمعتزلة، وهذا فصل الخطاب في هذا الباب، فالمجتهد المستدل من إمام وحاكم وعالم وناظر ومفت وغير ذلك إذا اجتهد واستدل فاتقى الله سبحانه وتعالى ما استطاع كان هذا هو الذي كلفه الله سبحانه وتعالى إياه، وهومطيع لله سبحانه وتعالى مستحق للثواب إذا اتقاه ما استطاع، ولا يعاقبه الله البته خلافًا للجهمية المجبرة\" (1) . ثانيًا: من السُّنَّة حديث حذيفة رضي الله عنه فيما رواه عن النبي صلى الله عليه وسلم أنه قال: إن رجلًا حضره الموت لما أيس من الحياة أوصى أهله: إذا مت فاجمعوا لي حطبًا كثيرًا ثم أوروا نارًا حتى إذا أكلت لحمي وخلصت إلى عظمي فخذوها فاطحنوها فذروني في اليم في يومٍ حارٍّ- أو راح- (2) فجمعه الله سبحانه وتعالى فقال: لم فعلت؟ قال: خشيتك، فغفر له\" (3) .",
    "foot_note": "1. مجموع الفتاوى 19/ 216 - 217. \n2. يوم راح: أي ذو ريح، قيل يوم راح، وليلة راحة: إذا اشتدت الريح فيهما، النهاية، ابن الأثير 2/ 237. \n3. أخرجه البخاري، كتاب أحاديث الأنبياء، باب ما ذُكر عن بني إسرائيل 2/ 419.",
    "book_id": "599",
    "new_page_number": 35
  },
  {
    "serial_number": "112073",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "قال الخطابي عند شرحه لهذا الحديث: \"قد يستشكل هذا فيقال كيف يغفر له وهو منكر للبعث والقدرة على إحياء الموتى؟ والجواب: أنه لم ينكر البعث وإنما جهل فظن أنه إذا فُعل به ذلك لا يُعاد فلا يعذب، وقد ظهر إيمانه باعترافه بأنه إنما فعل ذلك من خشية الله\" (1) . وكذلك خالد بن ذكوان عن الربيع بنت معوذ رضي الله عنهما أنها قالت: \"جاء النبي صلى الله عليه وسلم يدخل حين بُني عليَّ فجلس على فراشي كمجلسك منِّي، فجعلت جويريات لنا يضربن بالدفِّ ويندبن من قُتل من آبائي يوم بدر إذ قالت إحداهن: وفينا نبيٌّ يعلم ما في غد، فقال: دعي هذا وقولي بالذي كنت تقولين\" (2) . فعذر النبي صلى الله عليه وسلم الجارية التي نسبت إليه علم الغيب. وهذا لا يعني عدم التنبيه على أخطاء العلماء ومناصحتهم، بل يكون النصح من عالم متمكّن في العلم وقصد ذلك ومراده بيان الحق مع احترام المخالف، ويكون الكلام منصبًّا على القول دون القائل، فإنه لا يتعرض له بشيءٍ إلا إذا دعت الحاجة لذلك، والله أعلم.",
    "foot_note": "1. فتح الباري 6/ 522. \n2. أخرجه البخاري، كتاب النكاح، باب ضرب الدُّف في النكاح والوليمة 3/ 374.",
    "book_id": "599",
    "new_page_number": 36
  },
  {
    "serial_number": "112074",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "ثانيًا: أهل السُّنَّة يحسنون الظنَّ ويبغضون أهل البدع بقدر ما عندهم من البدع إن الله سبحانه وتعالى لم يجعل أحكام الدنيا على السرائر بل على الظواهرِ والسرائرُ تبعٌ لها، وأما أحكام الآخرة فعلى السرائرِ والظواهرٌ تبعٌ لها، فإذا أظهر المسلم سلامة الاعتقاد مع العمل بمقتضاه حُكم عليه بأنَّه من أهل السُّنَّة، وليس لنا أن ننقِّب عمَّا في قلبه. ذكر سعيد الخدري رضي الله عنه قصَّة الرجل الذي راجع النبي صلى الله عليه وسلم في الزكاة وقال له يا رسول الله: اتق الله … أنَّ خالد بن الوليد رضي الله عنه استأذن النَّبي صلى الله عليه وسلم في ضرب عنقه قال النبي صلى الله عليه وسلم: «لعلَّه أن يكون يصلي»، فقال خالد: وكم من مصلٍّ يقول بلسانه ما ليس في قلبه، قال رسول الله صلى الله عليه وسلم: «إني لم أومر أن أنقِّب قلوب الناس ولا أشقّ بطونهم» (1) . فيجب على كل من نصح نفسه ألا يعامل الناس بغير ما ظهر منهم، امتثالًا لفعل النبي صلى الله عليه وسلم واقتداءً بأصحابه رضي الله عنهم الذين جعلوا هذا أصلًا في تعاملهم مع غيرهم.",
    "foot_note": "1. أخرجه البخاري، كتاب المغازي، باب بعث علي بن أبي طالب وخالد بن الوليد إلى اليمن،3/ 162 - 163.",
    "book_id": "599",
    "new_page_number": 37
  },
  {
    "serial_number": "112075",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "وفي حديث عمر بن الخطاب رضي الله عنه أنه كان يقول: «إنَّ أناسًا كانوا يؤخذون بالوحي في عهد رسول الله صلى الله عليه وسلم وإن الوحي قد انقطع، وإنما نأخذكم الآن بما ظهر لنا من أعمالكم فَمَنْ أظهر لنا خيرًا أمِنَّاهُ وقرَّبناهُ، وليس إلينا من سريرته شيء، الله يحاسب سريرته، ومَنْ أظهر لنا سوءًا لم نأْمَنْه ولم نصدِّقه وإن قال إن سريرته حسنه» (1) . وفي الشق الآخر فأهل السُّنَّة يبغضون أهل البدع بقدر ما عندهم من البدع، وهذا أصلٌ عندهم متفرِّعٌ عن مسألة الإيمان، وهو أن الإيمان إذا ذهب بعضه لا يذهب كلُّه، وهم بذلك خالفوا أهل البدع كالجهمية، والمرجئة، والخوارج، والمعتزلة. وقرَّر شيخ الإسلام ابن تيمية رحمه الله هذه المسألة بقوله: \"وإذا اجتمع في الرجل الواحد خيرٌ وشر، وفجورٌ وطاعةٌ ومعصية، وسُنَّةٌ وبدعة: استحق من الموالاة بقدر ما فيه من الخير، واستحق من المعاداة والعقاب بحسب ما فيه من الشر، فيجتمع في الشخص الواحد موجبات الإكرام والإهانة، فيجتمع له من هذا وهذا كاللص الفقير تقطع يده لسرقته، ويعطى من بيت المال ما يكفيه لحاجته، هذا هو الأصل الذي اتفق عليه أهل السُّنَّة والجماعة، وخالفهم الخوارج والمعتزلة ومن وافقهم عليه، فلم يجعلوا الناس لا مستحقًّا",
    "foot_note": "1. أخرجه البخاري، كتاب الشهادات، باب الشهداء العدول، 2/ 264.",
    "book_id": "599",
    "new_page_number": 38
  },
  {
    "serial_number": "112076",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "للثواب فقط، ولامستحقًّا للعقاب فقط، وأهل السُّنَّة يقولون: إن الله سبحانه وتعالى يعذِّب بالنار من أهل الكبائر من يعذِّبه، ثم يخرجهم منها بشفاعة من يأذن له في الشفاعة، بفضل رحمته كما استفاضت بذلك السُّنَّة عن النبي صلى الله عليه وسلم \" (1) .  ثالثًا: اتفاق أهل السُّنَّة والجماعة في مسائل الاعتقاد مهما تباعدت ديارهم قال الأصبهاني رحمه الله: \"ومما يدل على أن أهل الحديث أهل الحق أنك لو طالعت جميع كتبهم المصنَّفة من أولهم إلى آخرهم، قديمهم وحديثهم، مع اختلاف بلدانهم وزمانهم، وتباعد ما بينهم من الديار، وسكون كل واحد منهم قطرًا من الأقطار؛ وجدتهم في بيان الاعتقاد على وتيرة واحدة ونمط واحد، يجرون على طريقة لا يحيدون عنها، ولا يميلون فيها، قولهم في ذلك واحد، ونقلهم واحد، لا ترى فيهم اختلافًا، ولا تفرُّقًا في شيءٍ ما وإن قل، بل لو جمعت جميع ما جرى على ألسنتهم ونقلوه عن سلفهم، وجدته كأنه جاء عن قلبٍ واحد، وجرى على لسانٍ واحد، وهل على الحق دليلٌ أبين من هذا؟ \" (2) .  رابعًا: أهل السُّنَّة لا يكفِّرون مخالفيهم بغير دليل ذكر ذلك شيخ الإسلام ابن تيمية رحمه الله في أكثر من موضع من كتبه في",
    "foot_note": "1. مجموع الفتاوى 28/ 209 - 210. \n2. الحجة في بيان المحجة 2/ 239.",
    "book_id": "599",
    "new_page_number": 39
  },
  {
    "serial_number": "112077",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "الرد على مَنْ قال بتكفير المتأولين: \"وهذا القول لا يُعرف عن أحدٍ من الصحابة والتابعين لهم بإحسان ولا عن أحدٍ من أئمَّةِ المسلمين، وإنما هو في الأصل من أقوال أهل البدع الذين يبتدعون بدعةً ويكفِّرون من خالفهم كالخوارج والمعتزلة والجهمية\" (1) . وقال أيضًا: \"والخوارج تكفِّر أهل الجماعة، وكذلك المعتزلة يكفِّرون مَنْ خالفهم، وكذلك الرافضة، ومن لم يكفَّر فسَّق، وكذلك أكثر أهل الأهواء يبتدعون رأيًا ويكفِّرون من خالفهم، وأهل السُّنَّة يتبعون الحق من ربهم الذي جاء به الرسول صلى الله عليه وسلم ولا يكفِّرون من خالفهم فيه، بل هم أعلم بالحق وأرحم بالخلق\" (2) . وقال الشيخ عبد اللطيف بن عبد الرحمن آل الشيخ رحمهم الله وقد سئل عمَّن كفَّر بعض مخالفيه: \"والجواب أنِّي لا أعلمُ مستندًا شرعيًّا ولا برهانًا مرضيًّا يخالف ما عليه أئمَّة العلم من أهل السُّنَّة والجماعة، وهذه الطريقة هي طريقةُ أهل البدع والضلال\" (3) .",
    "foot_note": "1. منهاج السُّنَّة النبوية 5/ 239 - 240 \n2. المرجع نفسه 5/ 158. \n3. مجموع الرسائل والمسائل النجديه 3/ 20.",
    "book_id": "599",
    "new_page_number": 40
  },
  {
    "serial_number": "112078",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "خامسًا: حبهم لأهل السُّنَّة إحدى علامات أهل السُّنَّة حبهم لأئمة السُّنَّة وعلمائها، وأنصارها وأوليائها، وقد زيَّن الله سبحانه وتعالى قلوب أهل السُّنَّة ونوَّرها بحبِّهم لعلماء أهل السُّنَّة والجماعة. قال الحاكم أبو عبد الله الحافظ -أسكنه الله وإيانا الجنَّة- حدثنا محمد بن إبراهيم بن الفضل، حدثنا أحمد بن سلمة، قرأ علينا أبو رجاء قتيبة بن سعيد كتاب الإيمان له فكان في آخره: \"فإذا رأيت الرَّجل يحب سفيان الثوري، ومالك بن أنس، والأوزاعي، وشعبه، وابن المبارك، وأبا الأحوص، وشريكًا، ووكيعًا، ويحيى بن سعيد، وعبد الرحمن بن مهدي، فاعلم أنه صاحب سنَّة\" (1) .  سادسًا: يوجبون الطاعة للسلطان ويحرِّمون الخروج عليه قال تعالى: {يَاأَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الْأَمْرِ مِنْكُمْ} (2) . فهذه الآية صريحةٌ في وجوب طاعة ولي الأمر، وعدم الخروج عليه، فقد صحَّت الأخبار عن رسول الله صلى الله عليه وسلم بالأمر بطاعة الأئمَّة والولاة فيما كان لله عز وجل طاعة وللمسلمين مصلحة (3) .",
    "foot_note": "1. ينظر: عقيدة أهل السلف وأصحاب الحديث، الصابوني، ص 307. \n2. سورة النساء، آية 59. \n3. ينظر: تفسير الطبري 8/ 205.",
    "book_id": "599",
    "new_page_number": 41
  },
  {
    "serial_number": "112079",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "وجاءت سنَّة النبي صلى الله عليه وسلم مبيِّنة ومفصِّلة ومفسِّرة لهذا الأمر، فعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: «من أطاعني فقد أطاع الله، ومن عصاني فقد عصى الله، ومن يطع الأمير فقد أطاعني، ومن يعص الأمير فقد عصاني» (1) . والخروج على السلطان خطير ويترتَّب عليها فساد عظيم، قال شيخ الإسلام ابن تيمية رحمه الله: \"ولعله لا يكاد يعرف طائفة خرجت على ذي سلطان إلا وكان في خروجها من الفساد ما هو أعظم من الفساد الذي أزالته\" (2) . وقال الشيخ ابن عثيمين رحمه الله: \"تجب طاعة وليِّ الأمر ولو كان من أفسق عباد الله عز وجل؛ وذلك لعموم الأدلة الدالة على وجوب طاعة ولاة الأمور، والصبر عليهم وإن رأينا منهم ما نكره في أديانهم وعدلهم واستئثارهم، فإننا نسمع ونطيع فنؤدي الحق الذي أوجب الله عز وجل علينا، ونسأل الله الحق الذي لنا، هكذا أمر النبي صلى الله عليه وسلم، وهكذا جرى عليه سلف هذه الأمة\" (3) .",
    "foot_note": "1. أخرجه البخاري، كتاب الجهاد والسير، باب يُقاتل من وراء الإمام ويتقى به 2/ 347. \n2. منهاج السُّنَّة النبوية 3/ 391. \n3. الشرح الممتع 8/ 18.",
    "book_id": "599",
    "new_page_number": 42
  },
  {
    "serial_number": "112080",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "والخروج على وليِّ الأمر ليس مقصورًا على السلاح فقط، بل كل كلام أدَّى إلى تأجيج الرَّعية على الإمام فهو خروج. قال الشيخ صالح الفوزان -حفظه الله-: \"الخروج على الإمام ليس مقصورًا على السلاح، بل الكلام في حقِّ وليِّ الأمر وسبابه خروجٌ وتحريضٌ عليه وسببُ فتنةٍ وشر، فالكلام لا يقل خطورةً عن السلاح … ، فالخروج على الإمام يكون بالسلاح، ويكون بالكلام، ويكون بالاعتقاد، ولو لم يتكلم فإذا اعتقد أنه يجوز الخروج على ولي الأمر فقد شارك الخوارج في عقيدتهم\" (1) .",
    "foot_note": "1. موقف المسلم من الفتن والمظاهرات، ص 20.",
    "book_id": "599",
    "new_page_number": 43
  },
  {
    "serial_number": "112081",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "المبحث الثالث: مصادر التلقِّي عند أهل السُّنَّة والجماعة إنَّ مصادر التلقِّي عند أهل السُّنَّة والجماعة تنقسم إلى قسمين: 1 - مصادر رئيسة: وهي الكتاب والسُّنَّة والإجماع. 2 - مصادر ثانوية: وهي العقل الصحيح -الفطرة السليمة- وهي تابعة للقرآن والسُّنَّة؛ فلذا يتضح أن المصادر الأساسية لأهل السُّنَّة والجماعة هي القرآن والسُّنَّة والإجماع المبنيّ عليهما (1) .  المصدر الأول: القرآن فأهل السُّنَّة والجماعة اعتمدوا على كتاب الله عز وجل وجعلوه مصدرًا أساسيًّا وأوليًّا في استمداد المعتقد والاستدلال عليه، فلا ترد مسألةٌ في العقيدة ولا غيرها ولها دليل من القرآن إلا ويوردونه أولًا ويقدمونه على غيره، ومما ساعدهم على ذلك، أن الله عز وجل قد يسَّر مفهومه، فلا خلل في أسلوبه، ولا غرابة في تعبيره بحيث ينفر منها صاحب الذوق السليم. ومن هنا كانت معرفة مقاصده مقدورة لكل البشر لا يختص بها أحد دون أحد، بل لكل أحد حظٌّ من فهمه وإدراك مراد الله عز وجل منه …",
    "foot_note": "1. ينظر: الفتاوى 3/ 296.",
    "book_id": "599",
    "new_page_number": 44
  },
  {
    "serial_number": "112082",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "وبذلك يظهر بطلان زعم أهل البدع وكذبهم وقولهم بالتعارض بين الأدلة النقلية والعقلية (1) .  المصدر الثاني: السُّنَّة إن السلف رحمهم الله يجعلون كلام الله وكلام رسوله صلى الله عليه وسلم هو الأصل الذي يُعتمد عليه، وإليه يُرد ما تنازع الناس فيه، فما وافقهما كان حقًّا وما خالفهما كان باطلًا (2) . يقول ابن حزم رحمه الله: \"فلم يسمع مسلمًا يقرُّ بالتوحيد أن يرجع عند التنازع إلى غير القرآن والخبر عن رسول الله صلى الله عليه وسلم ولا أن يأبى عمَّا وجد فيهما، فإن فعل ذلك بعد قيام الحجَّة عليه فهو فاسق، وأمَّا من فعله مستحلًا للخروج عن أمرهما وموجبًا لطاعة أحد دونهما فهو كافر\" (3) . وقال ابن أبي العز رحمه الله: \"فالواجب كمال التسليم للرسول صلى الله عليه وسلم والانقياد لأمره وتلقِّي خبره بالقبول والتصديق دون أن يعارضه بخيال باطل يسميه معقولًا، أو يُحَمِّلَهُ شبهة، أو شكًّا، أويقدِّم عليه آراء الرجال وزبالة أذهانهم، فيوحده بالتحكيم، والتسليم، والانقياد والإذعان\" (4) ، فالسُّنَّة عند السلف",
    "foot_note": "1. ينظر: المدخل لدراسة العقيدة، البريكان، ص 18. \n2. ينظر: درء تعارض العقل والنقل، ابن تيمية 1/ 277. \n3. الإحكام في أصول الأحكام، ابن حزم، ص 988. \n4. شرح العقيدة الطحاوية، تحقيق التركي 1/ 288.",
    "book_id": "599",
    "new_page_number": 45
  },
  {
    "serial_number": "112083",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "وحيٌ لا يعارض القرآن أبدًا كما قال تعالى: {وَمَا يَنْطِقُ عَنِ الْهَوَى إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى} (1) . وهي تفسِّر القرآن وتبيِّنه، وتفصِّل ما أجمل من أحكامه (2) ، قال ابن القيم رحمه الله: \"ونحن نقول قولًا كُليًّا نُشهد الله تعالى عليه وملائكته، أنه ليس في حديث رسول الله صلى الله عليه وسلم ما يخالف القرآن، ولا يخالف العقل الصريح، بل كلامه بيانٌ للقرآن وتفسيرٌ له وتفصيلٌ لما أجمله\" (3) وقال رحمه الله: \"وأصل كلِّ فتنة إنما هو من تقديم الرأي على الشرع والهوى على العقل\" (4) .  المصدر الثالث: الإجماع وهو في اللغة يعود إلى أمرين: 1 - الاجتماع والتضام والاتفاق، قال ابن فارس: \" الجيم والميم والعين أصلٌ واحد، يدلُّ على تضامِّ الشيء، يقال: جمعتُ الشيء جمعًا … وَجمْعُ مكَّة (5) ، سُمِّيَ لاجتماع الناس به، وكذلك يوم الجمعة، وأجمعت على الأمر إجماعًا وأجمعته\" (6) .",
    "foot_note": "1. سورة النجم، آية 4. \n2. ينظر: الإحكام، لابن حزم 1/ 98 - 100. \n3. مختصر الصواعق المرسلة على الجهمية والمعطلة، ابن القيم الجوزية 2/ 441. \n4. إغاثة اللهفان في مصائد الشيطان، ابن القيم 2/ 167. \n5. المقصود به مزدلفة. \n6. مقاييس اللغة 1/ 479 - 480.",
    "book_id": "599",
    "new_page_number": 46
  },
  {
    "serial_number": "112084",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "2 - العزيمة على الأمر، نقل الجوهري عن الكسائي: يقال: أجمعت الأمر وعلى الأمر: إذا عزمت عليه، والأمر مُجمعٌ، ويقال: اجمع أمرك ولا تدعه منتشرًا\" (1) . وفي الاصطلاح: هو اتفاقُ مجتهدي الأُمَّة بعد وفاة الرسول صلى الله عليه وسلم في عصرٍ من العصور على أيِّ أمرٍ كان (2) . فخرج بقولنا (اتفاق مجتهدي الأُمَّة): اتفاقُ العوام، فلا عبرة بوفاقهم ولا خلافهم، واتفاق بعض المجتهدين، واتفاق الأمم السابقة، وقولنا: (بعد وفاة الرسول صلى الله عليه وسلم) قيدٌ لا بدَّ منه؛ لأن الإجماع لا ينعقد في زمانه صلى الله عليه وسلم، وقولنا: في (في عصرٍ من العصور)؛ لرفع وهم من يتوهَّم أن المراد بالمجتهدين من يوجد إلى يوم القيامة، وهذا التوهُّم باطلٌ، فإنه يؤدي إلى عدم تصوُّر الإجماع. ومن كان من أهل الاجتهاد في الوقت الذي حدثت فيه المسألة وظهر الكلام فيها، فهو من أهل ذلك العصر، ومن بلغ هذا بعد حدوثها فليس من أهل ذلك العصر (3) . والإجماعُ حجَّةٌ عند الجمهور خلافًا للنظَّام، والشيعة، والخوارج (4) ، وإقامة الحجة على حجية الإجماع من الكتاب والسُّنَّة والعقل:",
    "foot_note": "1. الصحاح 3/ 1199، تهذيب اللغة 1/ 253، المحصول، للرازي 4/ 19، لسان العرب 8/ 53. \n2. ينظر: روضة الناضر وجنَّة المناظر 1/ 376، وشرح مختصر الروضة 3/ 5. \n3. ينظر: البحر المحيط في أصول الفقه 6/ 379. \n4. ينظر: منهاج السُّنَّة النبوية 8/ 340.",
    "book_id": "599",
    "new_page_number": 47
  },
  {
    "serial_number": "112085",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "قال تعالى: {وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ} (1) . قال شيخ الإسلام ابن تيمية رحمه الله: \"فإذا كان الرَّبُّ عز وجل قد جعلهم شهداء، لم يشهدوا بباطل، فإذا شهدوا أن الله أمر بشيءٍ فقد أمر به، وإذا شهدوا أن الله نهى عن شيءٍ فقد نهى عنه\" (2) . وقال تعالى: {كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ} (3) . وقال تعالى: {وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّى وَنُصْلِهِ جَهَنَّمَ وَسَاءَتْ مَصِيرًا} (4) . فهاتان الآيتان توجبان اتباع سبيل المؤمنين وتثبتان الوعيد على المخالفة لهم، ووجه الاستدلال أن الله سبحانه وتعالى جمع بين مشاقة الرسول صلى الله عليه وسلم وبين مخالفة المؤمنين في الوعيد، فلو كان اتباع غير سبيل المؤمنين مباحًا لما جمع بينه وبين المحظور، ومتابعة غير سبيلهم تقع بمخالفة أقوالهم وأفعالهم (5) .",
    "foot_note": "1. سورة البقرة، آية 143. \n2. الفتاوى، 19/ 177 - 178. \n3. سورة آل عمران، آية 110. \n4. سورة النساء، آية 115. \n5. ينظر: الإبهاج شرح المنهاج، يعلى بن عبد الكافي وولده 2/ 353، ومفتاح الجنَّة في الاحتجاج بالسُّنَّة، السيوطي، ص 24 - 25.",
    "book_id": "599",
    "new_page_number": 48
  },
  {
    "serial_number": "112086",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "وأمَّا السُّنَّةُ فقد تظافرت الرواية عن رسول الله صلى الله عليه وسلم بألفاظٍ مختلفة مع اتفاق المعنى في عصمة هذه الأمة من الخطأ، بل قد تواترت عنه صلى الله عليه وسلم أنه قال: «لاتزال طائفةٌ من أُمَّتي ظاهرة على الحق حتى تقوم الساعة» (1) . وأخبر صلى الله عليه وسلم «أنَّ الله لا يجمع هذه الأمة على ضلالة» (2) . وأما الأدلة من العقل على حجية الإجماع فقد ثبت قطعًا أنَّ نبيَّنا صلى الله عليه وسلم خاتم الأنبياء وأن شريعته دائمة إلى قيام الساعة، ثم وقعت حوادث ليس فيها نصٌّ قاطعٌ من كتاب الله أو سنة نبيه صلى الله عليه وسلم، لكن أجمعت الأمة على حكمها، فلو قيل إن إجماعهم ليس بحجة وإن الحق قد خرج عنهم، أو أنهم أجمعوا على الخطأ، للزم أن تكون شريعته غير دائمة وهذا يؤدي إلى انقطاعها وعدم بقائها واستمرارها (3) .",
    "foot_note": "1. أخرجه البخاري، كتاب الاعتصام، باب قول النبي صلى الله عليه وسلم لاتزال طائفة من أمتي، 13/ 250. \n2. أخرجه الترمذي، كتاب الفتن، باب ما جاء في لزوم الجماعة، رقم (2167)، 4/ 466، وقال: هذا حديثٌ غريبٌ من هذا الوجه، وللحديث شواهد في مستدرك الحاكم، 1/ 115 - 116، وأخرجه ابن أبي عاصم في السُّنَّة رقم (80، 83 - 84 - 85)، 39، 41 - 42، وصحَّحه السيوطي في الجامع الصغير، 1/ 278، رقم 1818، وقال: حديثٌ حسن. \n3. ينظر: المستصفي من علم الأصول 1/ 175 - 176، روضة الناظر وجنَّة المناظر 1/ 341 - 342.",
    "book_id": "599",
    "new_page_number": 49
  },
  {
    "serial_number": "112087",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "الخاتمة يمكن تلخيص أهم نتائج هذا البحث فيما يلي: 1 - إذا أُطلق مصطلح أهل السُّنَّة فالمراد به أحد معنيين: أ معنى عامٌّ، يدخل فيه كل ما سوى الرافضة من الطوائف المنتسبة للإسلام. ب معنى خاصٌّ، وهو ما يقابل المبتدعة وأهل الأهواء، وهو الأكثر استعمالًا وعليه كتب الجرح والتعديل. 2 - السُّنَّة في اصطلاح المحدثين هي: ما أُثر عن النبي صلى الله عليه وسلم من قول أو فعل أو تقرير أو صفة خَلْقيَّة أو خُلُقيَّة أو سيرة، سواءً كان قبل البعثة أو بعدها. 3 - السُّنَّة في اصطلاح الأُصوليين هي \"ما جاء منقولًا عن النَّبي صلى الله عليه وسلم على الخصوص مما لم ينص عليه في الكتاب العزيز بل إنما نص عليه من جهته عليه الصلاة والسلام، كان بيانًا لما في الكتاب أولًا، وتطلق على ما جاء عن النبي صلى الله عليه وسلم من قول أو فعل أو تقرير\". 4 - وتُطلق السُّنَّة في مقابل البدعة. 5 - الجماعة هي: لزوم الحق ولو كنت وحدك، وهي كما قال الإمام البربهاري رحمه الله: \"ما اجتمع عليه أصحاب رسول الله صلى الله عليه وسلم في خلافة أبي بكر وعمر وعثمان رضي الله عنهم \".",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 50
  },
  {
    "serial_number": "112088",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "6 - يرجع تاريخ إطلاق مصطلح (أهل السُّنَّة والجماعة) إلى صدر الإسلام عصر النبوة والقرون المفضلة، قال ابن عباس رضي الله عنهما في قوله تعالى: {يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ} \"فأما الذين ابيضت وجوههم فأهل السُّنَّة والجماعة وأولوا العلم، وأما الذين اسودَّت وجوههم فأهل البدع والضلالة\". 7 - دلَّت النصوص الشرعية الثابتة على تسمية أهل السُّنَّة والجماعة بهذا الاسم. 8 - كان الصحابة رضي الله عنهم يتسمّون بما سمَّاهم الله سبحانه وتعالى ممتثلين قول الله تعالى: {وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ}، بل كان السلف يحذرون من التسمِّي بغير الإسلام والسُّنَّة، ولكن لما ظهرت البدع وتعددت فرق الضلال وأخذ كل صاحب بدعه يدعو إلى بدعته مع انتسابهم في الظاهر إلى الإسلام أصبح لزامًا على أهل الحق المتمسِّكين بهدي النبي ج أن يُعرفوا بأسماء تميزهم عن أهل الأهواء والبدع، فتسمَّوا بأسماء تدلُّ على الإسلام، وهي: الفرقة الناجية، والطائفة المنصورة، وأهل الحديث والأثر، والجماعة. 9 - لأهل السُّنَّة والجماعة خصائص كثيرة تميُّزهم عن أهل الأهواء والبدع، منها: - لا يبدِّع بعضهم بعضًا بمجرَّد خطأ في الاجتهاد.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 51
  },
  {
    "serial_number": "112089",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "- يحسنون الظنَّ ويبغضون أهل البدع بقدر ما عندهم من البدع. - اتفاقهم في مسائل الاعتقاد مهما تباعدت ديارهم. - لا يكفِّرون مخالفيهم بغير دليل. - حبهم لأهل السُّنَّة. - يوجبون الطاعة للسلطان ويحرِّمون الخروج عليه. 10 - مصادر التلقِّي عند أهل السُّنَّة والجماعة هي القرآنُ والسُّنَّةُ والإجماع. وصلى الله وسلَّم على نبيِّنا محمد وعلى آله وصحبه أجمعين",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 52
  },
  {
    "serial_number": "112090",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "ثبت المصادر والمراجع - القرآن الكريم. (أ) 1 - الأحكام، لابن حزم، تحقيق: محمدأحمد عبد العزيز، مكتبة عاطف، ط 1، 1398 هـ. 2 - الاستقامة، أحمد بن عبد الحليم بن تيمية الحراني أبو العباس، تحقيق: د. محمد رشاد سالم، جامعة الإمام محمد بن سعود، ط 1، 1403 هـ. 3 - أصول مذهب الشعية الإمامية الإثني عشرية عرض ونقد، ناصر بن عبد الله بن علي القفاري، دارالرضا، ط 4، 1431 هـ. 4 - إعلام الموقعين عن رب العالمين، محمد بن أبي بكر أيوب الزرعي أبو عبد الله، تحقيق: طه عبد الرءوف سعد، دار الجيل - بيروت، 1973 م. 5 - إغاثة اللهفان عن مصائد الشيطان، ابن القيم، شمس الدين ابن القيم الجوزية، تخريج العلامة المحدث محمد ناصر الألباني، دار ابن الجوزي، ط 2، 1427 هـ. 6 - أنوار التنزيل وأسرار التأويل، لأبي الخير عبد الله بن عمر البيضاوي، مطبعة مصطفى البابي الحلبي، مصر، ط 2، 1388 هـ، 1968 م. (ب) 7 - الباعث على إنكار البدع والحوادث، أبو شامة، شهاب الدين عبد",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 53
  },
  {
    "serial_number": "112091",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "الرحمن بن إسماعيل بن إبراهيم الدمشقي، المعروف بأبي شامة، (تـ 665 هـ)، تحقيق: عثمان أحمد عنبر، دار الهدى، القاهرة، ط 1، 1398 هـ، 1978 م. (ت) 8 - تاج العروس من جواهر القاموس، محمد مرتضى الحسيني الزبيدي، دارالهداية، تحقيق: مجموعة من المحققين، مطبعة الكويت، ط 2، 1408 هـ. 9 - تهذيب اللغة، لأبي منصور محمد بن أحمد الأزهري، (تـ 370 هـ)، تحقيق الأستاذ: أحمد عبد العظيم البردوني، والأستاذ: محمد علي البيجاوي، الدار المصرية للتأليف. 10 - توجيه النظر إلى أصول الأثر، للشيخ طاهر بن صالح الدمشقي، المكتبة العلمية، بالمدينة المنورة. 11 - التوضيحات الجلية على شرح العقيدة الطحاوية، د. محمد بن عبد الرحمن الخميس، دار ابن الجوزي ط 1، 1429 هـ. 12 - تيسير الكريم الرحمن في تفسير كلام المنان = تفسير السعدي، للشيخ عبد الرحمن بن ناصر السعدي، دار ابن الجوزي، ط 3، 1433 هـ. (ج) 13 - جامع بيان العلم وفضله وما ينبغي في روايته وحمله، للإمام العلامة أبي عمر يوسف بن عبد البر النمري القرطبي (تـ 463 هـ)، دار",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 54
  },
  {
    "serial_number": "112092",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "الكتب الإسلامية، ط 2، 408 هـ. (ح) 14 - الحجة في بيان المحجة وشرح عقيدة أهل السُّنَّة، للحافظ قوام السُّنَّة أبي القاسم إسماعيل بن محمد بن الفضل الأصبهاني، تحقيق: د. محمد بن ربيع المدخلي (ج 1)، والشيخ محمد بن محمود أبو رحيم (ج 2)، دار الراية، ط 1، 1411 هـ 15 - حكم الانتماء إلى الفرق والأحزاب والجماعات الإسلامية، الشيخ بكر بن عبد الله أبو زيد، مطابع الدرعية، ط 1، 1410 هـ. (د) 16 - درء تعارض العقل والنقل، أحمد بن عبد الحليم بن تيمية الحراني أبو العباس، تحقيق: محمد رشاد سالم، دار الكنوز الأدبية، الرياض، 1391 هـ. (ر) 17 - رسالة الإمام أبي نصر السجزي إلى أهل زبيد في الرد على من أنكر الحرف والصوت، تحقيق: محمد كريم با عبدالله، دار الراية، ط 1، 1404 هـ 18 - رفع الملام عن الأئمة الأعلام، لشيخ الإسلام أبي العباس أحمد بن عبد الحليم ابن تيمية (تـ 728 هـ)، مؤسسة مكة للطباعة والإعلام، ومطبوعات الجامعة الإسلامية، ط 5، 1396 هـ",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 55
  },
  {
    "serial_number": "112093",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "19 - روضة الناظر وجنة المناظر في أصول الفقه على مذهب الإمام أحمد بن حنبل، للشيخ موفق الدين عبد الله بن أحمد بن قدامه (تـ 620 هـ)، مكتبة المعارف، بالرياض، ط 2، 1404 هـ (ش) 20 - شرح السُّنَّة، لأبي محمد بن الحسن بن علي بن خلف البربهاري، تحقيق: د. محمد بن سعيد بن سالم القحطاني، دار ابن القيم، ط 1، 1408 هـ 21 - شرح أصول اعتقاد أهل السُّنَّة والجماعة، أبو القاسم هبة الله بن الحسن بن منصور الطبري الرازي اللالكائي، تحقيق: أحمد بن سعد بن حمدان الغامدي، دار طيبة، السعودية، ط 8، 1423 هـ، 2003 م. 22 - الشرح والإبانة على أصول السُّنَّة والديانة ومجانبة المخالفين ومباينة أهل الأهواء المارقين، لعبيد الله محمد بن بطة العكبري (تـ 387 هـ)، تحقيق: رضا نعسان معطي، المكتبة الفيصلية بمكة المكرمة. (ص) 23 - صحيح البخاري، الإمام الحافظ أبو عبد الله محمد بن إسماعيل البخاري (تـ 256 هـ)، المطبوع مع فتح الباري لابن حجر العسقلاني، ترقيم محمد فؤاد عبد الباقي وتصحيح محب الدين الخطيب، دار المعرفة، بيروت. 24 - صحيح سنن ابن ماجه، محمد ناصر الألباني، مكتب التربية العربي لدول الخليج، ط 1، 1407 هـ.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 56
  },
  {
    "serial_number": "112094",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "25 - صحيح مسلم، للإمام أبي الحسين مسلم بن الحجاج القشيري النيسابوري، (تـ 261 هـ)، تحقيق: محمد فؤاد عبد الباقي، المكتبة الإسلامية، اسطنبول، تركيا. (ع) 26 - عقيدة السلف وأصحاب الحديث، للإمام أبي عثمان إسماعيل الصابوني، (تـ 449 هـ)، المطبوع ضمن مجموع الرسائل المنيرية، نشر إدارة الطباعة المنيرية، لصاحبها محمد منير عبده، 1970 م. 27 - العقيدة الطحاوية، لأبي جعفر أحمد بن محمد بن سلامة الأزدي الطحاوي (تـ 321 هـ)، المطبوع مع شرح العقيدة الطحاوية لابن أبي العز، تحقيق: بشير محمد عيون، نشر مكتبة دار البيان، ط 1، 1405 هـ. (ف) 28 - الفتاوى السعدية، للشيخ عبد الرحمن بن ناصر السعدي، مكتبة المعارف، الرياض، ط 2. 29 - الفرق بين الفرق وبيان الفرقة الناجية، عبد القاهر بن طاهر بن محمد البغدادي أبو منصور، دار الآفاق الجديدة، بيروت. 30 - الفصل في الملل والأهواء والنحل، للإمام أبي محمد بن علي بن أحمد المعروف بابن حزم الأندلسي، تحقيق: د. محمد إبراهيم نصر، ود. عبد الرحمن عميرة، دار الجيل، بيروت، 1405 هـ.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 57
  },
  {
    "serial_number": "112095",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "(ل) 31 - لسان العرب، محمد بن مكرم بن على، أبو الفضل، جمال الدين ابن منظور الأنصاري الرويفعى الإفريقى (تـ 711 هـ)، دار صادر، بيروت، ط 3، 1414 هـ. (م) 32 - مجموع فتاوى شيخ الإسلام ابن تيمية، جمع وترتيب: عبد الرحمن بن محمد بن قاسم، وابنه محمد، ط 1، 1398 هـ. 33 - مختصر الصواعق المرسلة على الجهمية والمعطلة، لابن القيم الجوزية، اختصار: محمد الموصلي، مكتبة الرياض الحديثة، وطبعة أخرى، تحقيق: سيد إبراهيم، دار الحديث، القاهرة، ط 2، 1407 هـ 1987 م. 34 - مدارج السالكين بين منازل إياك نعبد وإياك نستعين، محمد بن أبي بكر أيوب الزرعي أبو عبد الله، تحقيق: محمد حامد الفقي، دار الكتاب العربي، بيروت، ط 2، 1393 هـ، 1973 م. 35 - المدخل لدراسة العقيدة الإسلامية، د. إبراهيم محمد البريكان، دار السُّنَّة، الخبر، ط 2، 1414 هـ 1993 م. 36 - المستصفي في علم الأصول، لأبي حامد الغزالي، الطبعة الأميرية، وطبعة أخرى، دار إحياء التراث العربي، بيروت. 37 - معارج القبول بشرح سلم الوصول إلى علم الأصول، حافظ بن",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 58
  },
  {
    "serial_number": "112096",
    "category_id": "1",
    "category": "العقيدة",
    "book_title": "مختصر المختصر في بيان عقيدة أهل السنة والأثر",
    "edition": "الأولى، 1441 هـ - 2019 م",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "أحمد حكمي، تحقيق: عمر بن محمود أبو عمر، دار ابن القيم، الدمام، ط 1، 1410 هـ، 1990 م. 38 - مقاييس اللغة، لأبي الحسين أحمد بن فارس بن زكريا، (تـ 390 هـ)، تحقيق: عبد السلام محمد هارون، ط 2، شركة مطبعة ومكتبة مصطفى البابي الحلبي. 39 - منهاج السُّنَّة النبوية، أحمد بن عبد الحليم بن تيمية الحراني أبو العباس، تحقيق: د. محمد رشاد سالم، مؤسسة قرطبة، ط 1، 1406 هـ. 40 - الموافقات في أصول الفقه، إبراهيم بن موسى اللخمي الغرناطي المالكي، دار المعرفة، بيروت، تحقيق: عبد الله دراز.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 59
  }
]