[
  {
    "text": "Rihlat al-Sirafi (Al-Sirafi's Journey)\nAuthor: أبو زيد حسن بن يزيد السيرافي\nYear: 330",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6866\nbook_title: رحلة السيرافي\nbook_link: https://shamela.ws/book/11269\nbook_id: 11269\nauthor_name: أبو زيد حسن بن يزيد السيرافي\nauthor_year: 330\nnickname: أبو زيد\nauthor_link: https://shamela.ws/author/1933\nauthor_ID: 1933\neditor: Null\npublisher: المجمع الثقافي، أبو ظبي\nedition: 1999 م\npages: 139\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6277842",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 0,
    "volume_number": 1,
    "text": "Category: Countries and Journeys\nBook: Rihlat al-Sirafi (Al-Sirafi's Journey)\nAuthor: Abu Zayd Hasan ibn Yazid al-Sirafi (died after 330 AH)\nYear of Publication: 1999 AD\n[Repeated metadata omitted for brevity]\n\nSulayman al-Sirafi was an Iranian merchant from the port of Siraf [Bandar Siraf, Iran] overlooking the Persian Gulf. He traveled to China [China] and recorded the memories of his journey in a book he authored in Arabic. Abu Zayd Hasan ibn Yazid al-Sirafi received it from him, narrated it, and refined it. We know nothing about his life or the date of his birth and death, except that he lived in the first half of the fourth century [AH]. Abu Zayd spent his childhood and adolescence in his hometown of Siraf, then migrated in 330 AH to Basra [Basra, Iraq] and resided there. He was not, in fact, a traveler or a scholar, but apparently one of those fond of such stories, of which it was easy to collect many narrations whether in his hometown Siraf or in Basra. He was an excellent example of the Arab and Persian merchants who headed to China. The French orientalist Ferrand examined what was reported from him and followed his steps in light of modern maps, finding them of high status in terms of accuracy and scientific honesty.",
    "foot_note": "None\n\nNone",
    "book_id": "11269",
    "new_page_number": 3
  },
  {
    "serial_number": "6277844",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction\nRegarding trade via the sea and travel stories of Arab and Persian sailors with the lands of India [India], the Malay Archipelago [Malaysia/Indonesia], and China [China], those Arab merchants followed the ancient traditions of the southern Iraq region and the coasts of the Arabian Gulf since the Sassanian era. It is said that when the Arabs seized the port of Al-Ubullah near Basra during the caliphate of Umar ibn al-Khattab, the Muslims found Chinese ships there. Until the era of Arab sovereignty, the Persians were the most daring people in sailing the sea. It was clear since a long time ago that the Arab-Persian colony in the port of Canton [Guangzhou, China] in China had reached a limit of power whereby in the year 758 AD they laid their hands on the city, controlled it, then looted it and left the country by sea. In the late nineteenth century AD, some orientalists were lucky to find tombstones proving the visit of some Arabs to China in that ancient era in a cemetery proving the presence of a group from the people of Oman [Oman] and the Arabian Gulf. This proof was reinforced by another historical source, a book by Abu Sufyan Mahbub al-Abdi who died in the first half of the ninth century AD, where it stated that one of the Ibadi sheikhs, Abu Ubaydah Abdullah ibn al-Qasim from the people of Oman, was...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 4
  },
  {
    "serial_number": "6277845",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 4,
    "volume_number": 1,
    "text": "...a great scholar in his time and a well-known merchant engaged in the trade of myrrh, and he had traveled with a trade of aloe and myrrh to China. The orientalist Kratchkovsky says: But the date of that journey is unknown to us, although for several considerations it can be said that it undoubtedly occurred before the looting of Canton mentioned earlier in 758 AD. As for the other Omani merchant, he is Al-Nadr ibn Maymun who lived in Basra apparently around the eighth and ninth centuries AD, and from there he traveled to China, but we do not possess precise details about that journey of his. In any case, those Omani merchants, including the people of the Emirates [UAE], can be considered pavers of the way for other great merchants, like the author of this journey in your hands, the merchant Sulayman and his companion Ibn Wahb, whose journey was received by a geographer historian, Abu Zayd al-Sirafi, who transmitted it from them and scrutinized their narration, which is the one we are publishing now within the publications of the Cultural Foundation bearing the mentioned name. We return to what we were discussing, and we see that Arab travelers formed brief material about the countries of the Far East and others since early eras dating back to the ninth century AD, relying on what adventurous travelers circulate, who are mostly purely Arab figures who participated in some commercial travels. Ibn Rustah mentions in his book \"Al-A'laq al-Nafisa\" important facts about India narrated from a person unknown to historians, Abu Abdullah Muhammad ibn Ishaq, who is different from Ibn Ishaq the well-known author of Al-Sirah and Al-Maghazi. This...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 5
  },
  {
    "serial_number": "6277846",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 5,
    "volume_number": 1,
    "text": "...man had spent nearly two years on the island of Qumar (i.e., Khmer, which is the old name for Cambodia [Cambodia]), and that was most likely in the early ninth century. Most European researchers among orientalists in geography believe that this man is almost the sole source for both Ibn Rustah and Ibn Khordadbeh, and he is the one from whom Yaqut quotes specific paragraphs in some entries of his book. This is regarding the sea route by Arab merchant travelers. As for if we return to their land journeys in the early eras, we will find them represented in narrations derived by Arab geographers from the mouths of other Arab travelers who passed through the land route penetrating Central Asia to China. We find that in the description provided by Tamim ibn Bahr al-Mutawwi'. As appears from his title, the man was not from the category of well-known merchants, and most likely he lived the life of Jihad and garrison duty (Murabata) in the Islamic frontiers, which extend over all the borders of the Islamic Caliphate. The mentioned person had headed to the Khaqan of the Turks (Toquz Oghuz) on a diplomatic mission as it appears. Barthold believes it dates back to the period between 760 AD - 800 AD. Yaqut cited in his book (Mu'jam al-Buldan) the most important piece of this journey through which we were able to infer the personality of the journey's author. Thus, Tamim ibn Bahr al-Mutawwi' is the first Arab geographer to mention to us the description of the land route to China. We can find the trace of the mentioned Tamim in the texts cited from him by great geographers and known travelers...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 6
  },
  {
    "serial_number": "6277847",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 6,
    "volume_number": 1,
    "text": "...such as Abu Dulaf, Qudamah, and also Al-Idrisi, the author of the most famous book in geography, (Nuzhat al-Mushtaq fi Ikhtiraq al-Afaq), and even Ibn Khordadbeh and Yaqut as we mentioned previously. Tamim is the first Arab to give us important information about the Toquz Oghuz based primarily on direct personal information he witnessed himself. He describes for us the capital of the Toquz Oghuz (Qamju) near (Turfan) [Turpan, China] and mentions information about the rain stone among the Turks, and so on.\n\nSulayman the Merchant\nWe return to the author of this journey of ours, the merchant Sulayman, which Abu Zayd al-Sirafi received from him, narrated, and refined. The mentioned person is one of the ancient travelers known for their strange journeys and interesting narrations about the countries they visited. We know nothing about his life except what reached us from the narration he mentioned about his journey, which mostly dates back to around the year 237 AH. He traveled repeatedly for the purpose of trade to India and China. The French orientalist Ferrand examined what was reported from him and followed his steps in light of modern maps, finding them of high status in terms of accuracy and scientific honesty. He says: He is the best example of Arab and Persian merchants who headed to China. He sailed from (Siraf) [Bandar Siraf, Iran] to (Muscat) [Muscat, Oman] on the Arabian Gulf, and from there to (Kulam) [Kollam, India] on the Malabar Coast [India], then passed through the (Palk) Strait north of the island of (Ceylon) [Sri Lanka], then crossed the Bay of Bengal reaching the island of (Lanjabalus) (one of the Nicobar Islands [India]), then advanced to (Kalah Barh) on the western Malay coast [Malaysia], and passed from there to the island of (Tioman) [Malaysia] located southwest of (Malacca) [Malaysia], and from there to Cape...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 7
  },
  {
    "serial_number": "6277848",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 7,
    "volume_number": 1,
    "text": "...St. James near (Saigon) [Ho Chi Minh City, Vietnam], and from there to the island of (Hainan) [China], crossing the strait separating it from the land of China to reach the port of (Khanfu) or modern (Canton) [Guangzhou, China] in China. The sea journey from (Muscat) to China used to take more than four months. Sulayman did not limit his description to mentioning the stages and estimating distances in days and sometimes in parasangs, but also left a vivid description of the coasts, islands, various ports, cities and their inhabitants, crops, products, and trade goods. It was also proven that the information he cited about (Canton) is characterized by detail and accuracy. Kratchkovsky says in discussing the attribution of those journeys to Sulayman the Merchant: Given the lack of information about Sulayman himself, some major Sinologists such as Yule and Pelliot doubted the attribution of the stories to him. Another opinion also appeared seeing that these stories belong to an Arab who visited India. However, Ferrand drew attention to the fact that Ibn al-Faqih explicitly attributes the stories to Sulayman, and therefore the issue of his authorship of them is beyond any doubt. Added to the stories attributed to Sulayman, twenty years after the mentioned journey, was another traveler, Ibn Wahb, whose lineage goes back to Quraysh. He was one of the wealthy notables and left his city Basra when it fell into the hands of the Zanj rebels in the year 257 AH. He decided to undertake a long journey from Siraf to China, and success was his ally as he reached the capital of China, which was then (Khamdan) [Xi'an, China]. His description has special importance because after that, in the year 264 AH, the...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 8
  },
  {
    "serial_number": "6277849",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 8,
    "volume_number": 1,
    "text": "...Arab colony in (Canton) was eliminated as a result of internal wars, thus cutting direct links between the Arabs and China. The last port reached by Arab ships became (Mina Kalah) and Kalah Barh on the Malay Peninsula. Contact with China was not renewed until the second half of the thirteenth century AD. The stories of Sulayman and Ibn Wahb were recorded at the beginning of the tenth century AD by Abu Zayd al-Hasan al-Sirafi from the people of Basra, who gave them the form known to us now. The mentioned Al-Sirafi was not in fact a traveler or a scholar, but was apparently one of those fond of such stories, of which it was easy to collect many narrations whether in his hometown (Siraf) or in (Basra). Al-Mas'udi met him in the year 303 AH and benefited from him regarding the narration of Ibn Wahb mentioned in this journey of ours. The manuscript of Abu Zayd al-Sirafi's journey that reached us in a unique single copy is the one present in the National Library in Paris [France]. Copyists added an introduction to it that has absolutely no relation to the book's contents. Complicating the problem further is that the manuscript bears a title completely inappropriate and inconsistent with the book's subject, which is the title (Silsilat al-Tawarikh / Chain of Histories). Reinaud's edition was issued in 1811 AD bearing this title. Due to the importance of the journey of the merchant Sulayman, this work caught the attention of major orientalists in the eighteenth century, so a French translation of it appeared since 1718 AD. This translation led to its embezzlement and the addition of things by some adventurers who attributed it to...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 9
  },
  {
    "serial_number": "6277850",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 9,
    "volume_number": 1,
    "text": "...themselves. The credit for studying this journey and editing its texts goes to the French orientalist Reinaud, then after him came the French orientalist also Ferrand who re-edited and translated it with a methodology worthy of mention. We have benefited from both editions and tried to present it in this mold with the addition of some necessary comments compatible with this journey and in terms of heritage character as the reader will see. And with God is success.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 10
  },
  {
    "serial_number": "6277851",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 11,
    "volume_number": 1,
    "text": "[The First Book] This is a book containing the chain of histories, countries, seas, types of fish, astronomy, wonders of the world, measurement of countries and the inhabited parts thereof, wild animals, and other wonders. It is a precious book.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 11
  },
  {
    "serial_number": "6277852",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 13,
    "volume_number": 1,
    "text": "Chapter on the Sea that is between the lands of India and Sindh",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 12
  },
  {
    "serial_number": "6277853",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 15,
    "volume_number": 1,
    "text": "and Ghuz and Maghuz (1), and Mount Qaf, and the lands of Serendib [Sri Lanka]. And Abu Hubaysh opened [?], who is the man who lived two hundred and fifty years and in some years stayed in Al-Maghuz. Abu Hubaysh the wise traveler saw, so he was brought to the sea and shown (2) a fish like a sail (3). Sometimes it raises its head [out of the water] (4) so you see it like a huge thing. Sometimes it blows water from its mouth like a great minaret. If the sea calms, the fish gather, so it corrals them with its tail, then opens its mouth, and the fish are seen sinking into its belly as if sinking (5) into a well. The ships that are in the sea fear it, so they ring bells at night like the bells of Christians for fear that it might lean on the ship and drown it. In this sea [is a fish we caught] (6) whose length is twenty cubits. We split its belly and took out from it also a fish of its kind, then we split the belly of the second and found inside its belly one like it. All this is alive and wriggling, resembling each other in form.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 13
  },
  {
    "serial_number": "6277854",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 16,
    "volume_number": 1,
    "text": "For this large fish called Al-Wal (Whale) (1), despite the greatness of its creation, there is a fish called Al-Lashak (2) whose length is about a cubit. If this [large] fish becomes tyrannical and aggressive and harms the fish in the sea, this small fish is empowered over it. It settles at the root of its ear (3) and does not leave it until it kills it. It sticks (4) to the ship, so this large fish does not approach the ship out of fear of the small one. In this sea also is a fish whose face resembles the face of a human that flies over the water; the name of this fish is Al-Mij (5). And another fish from under the water...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 14
  },
  {
    "serial_number": "6277855",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 17,
    "volume_number": 1,
    "text": "...watches it until it falls, then swallows it. This fish is called Al-'Anqatus (1). All fish eat one another.\n[Sea of Harkand]\nThe third sea is the Sea of Harkand (2). Between it and the Sea of Dalarwi (3) are many islands said to be one thousand nine hundred islands. They are the separation between these two seas, Dalarwi and Harkand. These islands are ruled by a woman. In these islands, ambergris of great quantity falls; a piece falls like a house (4) or similar. This ambergris grows at the bottom of the sea like a plant. When the sea's agitation intensifies, it casts it from its bottom like mushrooms and truffles. These islands ruled by the woman are populated with coconut palms (5). The distance...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 15
  },
  {
    "serial_number": "6277856",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 18,
    "volume_number": 1,
    "text": "...between island and island is two (1), three, or four parasangs. All of them are populated with people and coconut palms. Their wealth is cowrie shells (Wada') (2). This queen hoards cowrie shells in her treasuries. It is said that the people of this island (3) are the most skilled, so much so that they make a shirt woven complete with two sleeves, two gores (4), and a collar. They build ships and houses and do all work in this manner of craftsmanship. The cowrie shells come to them on the surface of the water containing a spirit (living organism). So a palm branch from coconut palms is taken and thrown on the water surface, and the cowrie shells cling to it. They call it Al-Kabtah (5).",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 16
  },
  {
    "serial_number": "6277857",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 19,
    "volume_number": 1,
    "text": "The last of these islands is Serendib (1) [Sri Lanka] in the Sea of Harkand. It is the head of all these islands. They call them Al-Dubayjat (2). In Serendib (3) there are pearl diving places; its sea is all around it. In its land is a mountain called Al-Rahun (4) [Adam's Peak] on which Adam, peace be upon him, descended. His footprint is in a rock (5) at the top of this mountain sunken into the stone: at the top of this mountain is a single footprint. It is said that he, peace be upon him, took another step into the sea. It is said: This footprint on top of the mountain is about seventy cubits. Around this mountain are mines of precious stones: red and yellow ruby (sapphire) and sky-blue (6). In this island there are two kings. It is a great, wide island containing aloe wood, gold, and gems. In its sea are pearls and the shank (chank shell), which is here...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 17
  },
  {
    "serial_number": "6277858",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 20,
    "volume_number": 1,
    "text": "...(the trumpet) into which one blows, among what they store. In this sea, when sailing to Serendib, there are islands not many, but they are vast and uncontrollable. Among them: an island called Al-Ramni (1) [Sumatra, Indonesia] containing several kings. Its width is said to be eight hundred or nine hundred parasangs. In it are gold mines, and in it are mines called Fansur (2) [Barus, Indonesia] from which comes good camphor. Adjacent to these islands are islands following them, among them: an island called Al-Niyan (3) [Nias, Indonesia]. They have much gold and their food is coconut, which they use as condiment and oil. If one of them wants to marry, he is not married unless with the skull (top of the head) of a man from their enemies. If he kills two, he marries two; likewise, if he kills fifty, he marries fifty women with fifty skulls. The reason for that is that their enemies are many, so whoever is more daring in killing is more desired among them. In these islands, meaning Al-Ramni, are many elephants, and in it is Brazilwood (4)...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 18
  },
  {
    "serial_number": "6277859",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 21,
    "volume_number": 1,
    "text": "and Al-Khayzuran (bamboo) «1». In it are: a people who eat men, and it opens onto two seas: Harkand [Bay of Bengal] and Salahit [Straits of Malacca] «2». After this are islands called Lanjbalus [Nicobar Islands] «3», and in them are many people, the men and women among them are naked, except that on the private parts of the woman is a leaf from the leaves of trees. If ships pass by them, they come to them in small and large boats and trade with their people ambergris and coconut for iron and what they need of clothing, because there is no heat or cold among them. Beyond these are two islands with a sea between them called «4» Andaman [Andaman Islands] «5». Their people eat men alive; they are black, with peppercorn hair, hideous faces and eyes, long legs, and the foot-span «6» of one of them is like a cubit [meaning...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 19
  },
  {
    "serial_number": "6277860",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 22,
    "volume_number": 1,
    "text": "its mention] naked. They have no boats; if they had them, they would have eaten everyone who passed by them. Perhaps ships slow down in the sea and their travel is delayed due to the wind, so the water in the ships runs out, and they approach these people to seek water. Sometimes they capture some of them, but mostly they escape. After this island are mountains not on the route; it is said: in them are silver mines, but they are uninhabited. Not every ship that wants them finds them. A mountain among them called Al-Khushnami «1» indicated it. A ship passed by it and they saw the mountain and headed for it. When morning came, they descended to it in a boat to gather firewood. They lit a fire, and the silver melted, so they knew it was a mine. They carried what they wanted from it, but when they boarded, the sea became rough against them, so they threw away all that they had taken from it. Then people equipped themselves after that for this mountain, but they did not know it. Like this in the sea are many uncounted islands that are forbidden, unknown to the sailors; some of them they are unable to reach. Perhaps a white cloud is seen in this sea shading the ships, and a long, thin tongue extends from it until that tongue sticks to the sea water. Then the sea water boils because of it like a tornado (waterspout). If the tornado overtakes the ship, it swallows it. Then that cloud rises and rains a rain containing the filth of the sea. I do not know if the cloud draws water from the sea or how this is. Every sea of these seas has a wind that rages in it, stirring it and agitating it until it boils like the boiling of pots, casting what is in it onto the islands within it, and breaking...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 20
  },
  {
    "serial_number": "6277861",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 23,
    "volume_number": 1,
    "text": "the ships, and casting out dead fish, huge and great. Perhaps it casts out rocks and mountains just as a bow casts an arrow. As for the Sea of Harkand [Bay of Bengal], it has a wind other than this, between the West and Banat Na'sh (Ursa Major/North), and the sea boils because of it like the boiling of pots, and it casts out much ambergris. The deeper the sea and the further its bottom, the better the ambergris. This sea—I mean Harkand—when its waves become great, you see it like fire burning. In this sea are fish called Al-Lakhm «1» (sharks/sea monsters), which is a beast that swallows men «2». In [their hands is all this] «3», so goods decrease. Among the reasons for the scarcity of goods is a fire that perhaps occurred in (Khanfu) [Guangzhou, China] «4», which is the port of the ships and the gathering place of the trades of...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 21
  },
  {
    "serial_number": "6277862",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 24,
    "volume_number": 1,
    "text": "the Arabs and the people of China [China], so the fire consumes the goods. That is because their houses there are of wood and split bamboo «1». Among the reasons for that is that the departing and arriving ships break, or they are looted, or they are forced to stay for a long time, so they sell the goods in lands other than the lands of the Arabs. Perhaps the wind throws them to Yemen [Yemen] or elsewhere, so they sell the goods there. Perhaps they prolong the stay to repair their ships and other causes. Sulayman the Merchant mentioned that in (Khanfu) [Guangzhou], which is the gathering place of merchants, is a Muslim man whom the Ruler of China appoints to judge between the Muslims who head to that region. The King of China desires that. If it is the Eid, he leads the Muslims in prayer, delivers the sermon, and prays for the Sultan of the Muslims. The Iraqi merchants do not deny anything of his authority in his judgments and his knowledge of the truth and what is in the Book of Allah, Mighty and Majestic, and the rulings of Islam. As for the places they arrive at and ascend to, they mentioned that most of the Chinese ships load from Siraf [Bandar Siraf, Iran] «2» and that goods are carried from Basra [Basra, Iraq], Oman [Oman], and elsewhere to Siraf, then packed into the Chinese ships at Siraf. That is due to the frequency of waves in this sea and the shallowness of the water in places of it. The distance between Basra and Siraf by water is one hundred and twenty parasangs. When the goods are packed at Siraf, they fetch fresh water from there, and they 'snatch' (khatifu)—and this is a term...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 22
  },
  {
    "serial_number": "6277863",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 25,
    "volume_number": 1,
    "text": "used by the people of the sea meaning they set sail—to a place called Muscat [Muscat, Oman] «1», which is the last administration of Oman. The distance from Siraf to it is about two hundred parasangs. In the east of this sea, between Siraf and Muscat among the lands, is the Coast of Banu al-Saffaq «2» and the Island of Ibn Kawan [Qeshm/Lavan] «3». In the west of this sea are the Mountains of Oman, and in them is the place called Al-Durdur [Strait of Hormuz/Musandam] «4», which is a narrow pass between two mountains «5» traversed by small ships but not traversed by Chinese ships. In it are the two mountains called Kusayr and Uwayr «6», and only a little of them appears above the water. When we pass «7» the mountains, we come to a place called...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 23
  },
  {
    "serial_number": "6277864",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 26,
    "volume_number": 1,
    "text": "Sohar [Sohar, Oman] «1» of Oman. Fresh water is fetched from Muscat from a well there. There is [a mountain] «2» there with sheep belonging to the land of Oman. The ships set sail ('snatch') from there to the land of India [India] and head to Kulam Mali [Kollam, India] «3». The distance from Muscat to Kulam Mali is a month with moderate wind. In Kulam Mali is a garrison «4» belonging to the land of Kulam Mali where Chinese ships come. It has fresh water from wells. One thousand dirhams are taken from the Chinese [ships], and from other ships between ten dinars to [twenty] «5» dinars. Between Muscat and Kulam Mali and Harkand is about a month. At Kulam Mali they fetch fresh water, then the ships set sail to the Sea of Harkand [Bay of Bengal]. When they pass it, they come to a place called Lanjbalus [Nicobar Islands] «6». They do not understand the language of the Arabs nor what the merchants know of languages. They are a people who do not...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 24
  },
  {
    "serial_number": "6277865",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 27,
    "volume_number": 1,
    "text": "wear clothes, white, beardless «1». They mentioned that they did not see women among them «2». That is because their men come out to them from the island in skiffs hollowed out from a single piece of wood, carrying coconuts, sugar cane, and bananas. Coconut drink: it is a white drink; if drunk after an hour, it is taken from the coconut and is sweet like honey. If left for an hour, it becomes wine «3», and if it remains for days, it becomes vinegar. They sell that for iron. Perhaps a little ambergris falls to them, so they sell it for pieces of iron. They only trade by signaling, hand to hand, since they do not understand the language. They are skilled in swimming; perhaps they steal the iron from the merchants and give them nothing. Then the ships set sail to a place called Kalah Bar [Kedah, Malaysia] «4». The kingdom and the coast are all called Kalah Bar. It is the Kingdom of Zabaj [Srivijaya] «5» on the right from...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 25
  },
  {
    "serial_number": "6277866",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 28,
    "volume_number": 1,
    "text": "the land of India, united by a king. Their clothing is waist wrappers (Fuwat) «1»; the noble «2» and the lowly among them wear a single waist wrapper. They fetch water there from fresh wells, and they prefer well water over spring and rain water. The distance between Kulam, which is near Harkand, to Kalah Bar is a month. Then the ships travel to a place called Batuma [Tioman Island, Malaysia] «3», and in it is fresh water for whoever wants it; the distance to it is ten days. Then the ships set sail to a place called Kadranj [Phan Rang, Vietnam] «4», ten days. In it is fresh water for whoever wants it. Likewise are the islands of India; if wells are dug in them, fresh water is found. In it is a high mountain, and perhaps fugitive slaves and thieves are in it «5».",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 26
  },
  {
    "serial_number": "6277867",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 29,
    "volume_number": 1,
    "text": "Then the ships travel «1» to a place called Sanf [Champa/Central Vietnam] «2», a journey of ten days. In it is fresh water, and from it comes the Sanfi Oud (aloeswood). It has a king, and they are a brown people; each one of them wears two waist wrappers. When they have fetched fresh water from there, they set sail to a place called Sandar Fulat [Con Dao Islands, Vietnam] «3», which is an island in the sea. The distance to it is ten days. In it is fresh water. Then the ships set sail to a sea called Sanji [South China Sea] «4», then to the Gates of China «5». These are mountains in the sea; between every two mountains is a gap through which the ships pass [then to China]. If Allah grants safety from Sandar Fulat «6», the ships set sail to China [China] in a month, except that the mountains through which the ships pass take a journey of seven days.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 27
  },
  {
    "serial_number": "6277868",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 30,
    "volume_number": 1,
    "text": "When the ship passes the Gates and enters the estuary «1», it comes to fresh water at the place where it anchors in the land of China. It is called Khanfu [Guangzhou]: a city. The rest of China has fresh water from fresh rivers, valleys, garrisons, and markets in every region. In it are high tide and low tide twice in the day and night, except that the high tide in what follows Basra to the Island of Banu Kawan «2» is when the moon is in the middle of the sky [and when it is opposite the middle of the sky] «3», and the low tide is at the rising of the moon and at its setting. But the high tide in the region of China to near the Island of Banu Kawan «4» is when the moon rises; when it is in the middle of the sky, the water ebbs, and when it sets, there is high tide, and when it is opposite the middle of the sky, it ebbs. [Island of Maljan] They mentioned: that in an island called Maljan «5», between Sarandib [Sri Lanka] and Kalah [Kedah], and that is among the lands of India in the east of the sea, are a people of the Blacks (Sudan), naked...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 28
  },
  {
    "serial_number": "6277869",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 31,
    "volume_number": 1,
    "text": "if they find a human from other than their lands, they hang him upside down, cut him up, and eat him raw. Their number is many, and they are on one island. They have no king. Their food is fish, bananas, coconuts «1», and sugar cane. They have [places they shelter in] «2» resembling thickets and marshes. [Water Locust] They mentioned that in the region of the sea is a small flying fish that flies over the face of the water called the Water Locust (Jarad al-Ma'). And they mentioned that in the region of the sea is a fish that comes out until it climbs the coconut tree and drinks the water inside the coconut, then returns to the sea «3». [The Kohl Animal] They mentioned: that in the sea is an animal resembling the crab; if it comes out of the sea, it becomes a stone. He said: Kohl is made from it for some ailments of the eye. [Mountain of Fire] They mentioned that near Zabaj [Srivijaya] «4» is a mountain called the Mountain of Fire (Volcano) which cannot be approached. Smoke appears from it by day, and a flame of fire by night. From its bottom exits a cold fresh spring and a hot fresh spring «5». The clothing «6» of the people of China, small and large, is silk, in winter...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 29
  },
  {
    "serial_number": "6277870",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 32,
    "volume_number": 1,
    "text": "and summer. As for the kings, it is fine silk, and for those below them, it is according to their status. When it is winter, the man wears «1» two pairs of trousers «2», three, four, five, and more than that according to what is possible for them. Their intention is only to keep their lower parts warm due to the excess of dampness and their fear of it. As for the summer, they wear a single shirt of silk and the like. They do not wear turbans. Their food is rice; perhaps they cook a sauce (Kushan) «3» with it and pour it over the rice and eat it. As for their kings, they eat wheat bread and meat from all animals, pigs, and others. They have fruits: apples, peaches, citrons, pomegranates, quinces, pears, bananas, sugar cane, melons, figs, grapes, cucumbers, snake melons, nabq (lotus jujube), walnuts, almonds, hazelnuts «4», pistachios, plums, apricots, service berries (Ghubayra) «5», and coconuts. They do not have many palm trees, except for a palm tree in the house of one of them. Their drink is wine made from rice. There is no grape wine in their lands, nor is it brought to them, nor do they know it or drink it. From rice, vinegar is made...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 30
  },
  {
    "serial_number": "6277871",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 33,
    "volume_number": 1,
    "text": "and wine and confection (natif) «1» and what resembles that. They have no cleanliness, and they do not clean themselves with water when they defecate; rather, they wipe that with Chinese paper. They eat carrion and what resembles it of what the Majus (Zoroastrians/Pagans) do, for their religion resembles the religion of the Majus. Their women uncover their heads and place combs in them; perhaps there are twenty combs of ivory and other things in a woman's head «2». The men cover their heads with something resembling caps. Their law regarding thieves is that the thief is killed if caught «3». News of the Lands of India and China also and their Kings: The people of India and China are agreed that the counted kings of the world are four. The first whom they count of the four: The King of the Arabs, and this is a consensus among them with no difference among them, that he is the king of the greatest of kings, the most abundant in wealth, the most splendid in beauty, and that he is the king of the great religion above which there is nothing. Then the King of China counts himself after [the King Balhara], the King of the Arabs. Then the King of the Romans (Byzantines), then Balhara «4», the King of Those with Pierced Ears...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 31
  },
  {
    "serial_number": "6277872",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 34,
    "volume_number": 1,
    "text": "As for this Balhara [Rashtrakuta Dynasty], he is the most noble of India, and they acknowledge his nobility. Every king of the kings of India is independent in his kingdom, except that they acknowledge this one. If his messengers arrive at the other kings, they bow to his messengers out of reverence for him. He is a king who gives gifts as the Arabs do. He has many horses and elephants and much wealth. His wealth consists of dirhams called Tatariyyah «1»; the weight of each dirham is a dirham and a half by the minting of the King. His date is in the year of the reign «2» of the one who was before him, not like the year of the Arabs from the era of the Prophet, peace be upon him; rather, their dating is by the kings. Their kings live long; perhaps one of them reigns for fifty years. The people of the Kingdom of Balhara claim: the duration of their reign and their lives in kingship is only long because of their love for the Arabs. Among the kings, there is none with a stronger love for the Arabs than him, and likewise are the people of his kingdom. Balhara is a name for every king of theirs, like Kisra (Chosroes) and the like; it is not a personal name. The King Balhara and his land: its beginning is the seacoast, and it is a land called Al-Kumkum [Konkan Coast] «3» connected on the land to China. Around him are many kings who fight him, yet he prevails over them. [King of Al-Jurz] Among them is a king called the King of Al-Jurz [Gujarat/Gurjara-Pratihara] «4». He has a large army; no one in India has the like of his cavalry. He is an enemy of the Arabs, yet he acknowledges that the King of the Arabs is the greatest of...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 32
  },
  {
    "serial_number": "6277873",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 35,
    "volume_number": 1,
    "text": "kings, and no one in India is more hostile to Islam than him. He is on a tongue of the land. Their wealth is great, and their camels and livestock are many. They trade with silver dust (Tibr). It is said that they have mines, and there is no place in the land of India safer from theft «1» than it. [King of Al-Tafiq] To his side is the King of Al-Tafiq, who has a small kingdom. Their women are white, the most beautiful women of India. He is a king at peace with those around him due to the smallness of his army, and he loves the Arabs like the love of Balhara. [The King Rahmi] Next to these is a king called Darharum (Dharma) «2» [Pala Empire]. The King of Al-Jurz fights him. He has no nobility in kingship, and he also fights Balhara just as the King of Al-Jurz fights him. This Rahmi [Rahmi] has a larger army than the King Balhara, the King of Al-Jurz, and the Taqi (Tafiq) «3». It is said: when he goes out to fight, he goes out with about fifty thousand elephants «4». He only goes out in winter because elephants cannot endure thirst, so he can only go out in winter. It is said: the laundrymen of his army are about ten thousand to fifteen thousand. In his land are clothes the like of which no one has; a garment of it enters into a ring due to its fineness and beauty. It is of cotton, and we have seen some of it. That which circulates in his land is Cowrie shells (Wada'), which is the 'eye' of the land, meaning its money.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 33
  },
  {
    "serial_number": "6277874",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 36,
    "volume_number": 1,
    "text": "In his land are gold, silver, aloeswood, and Samar (Sable/Fly-whisk) «1» clothes from which fly-whisks «2» are made. [The Rhinoceros Animal] In his land is the marked Bashan, which is the Karkaddan (Rhinoceros). It has a single horn on the front of its forehead. In its horn is a mark «3», a picture of its creation like the picture of a human in its representation. The horn is all black and the picture is white in the middle of it. This Rhinoceros is smaller than the elephant in creation; it is closer to blackness. It resembles the buffalo. It is strong; no animal has strength like its strength. It has no joint in its knee or in its foreleg; from its foot to its armpit, it is one piece. The elephant flees from it. It ruminates as cows and camels ruminate. Its meat is halal; we have eaten it. It is abundant in this kingdom in their thickets, and it is in the rest of the lands of India, except that the horns of this one are better. Perhaps there is in the horn the picture of a man, [the picture of a peacock], the picture of a fish, and other pictures. The people of China make belts from them. The belt «4» reaches two thousand dinars and three thousand and more in the land of China, according to the beauty of the picture. All this is bought from the land of Dahram (Rahmi) with Cowrie shells, which is the 'eye' (money) of the land.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 34
  },
  {
    "serial_number": "6277875",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 37,
    "volume_number": 1,
    "text": "[King of the Kashbin] After him is an interior king having no sea called the King of the Kashbin [Kashmir?] «1». They are a white people with pierced ears. They have beauty, and they are people of the desert and mountains. [King of Al-Qiranj] After him is a sea upon which is a king called Al-Qiranj «2». He is a poor, boastful king. Much ambergris falls to him. He has elephant tusks, and he has pepper which is eaten fresh due to its scarcity. [Other Kings] After this are many kings whose number only Allah, Blessed and Exalted, knows. Among them is Al-Mujah [Yunnan/Nanzhao?] «3». They are a white people resembling the Chinese in dress. They have much musk, and in their lands are white mountains; nothing is taller than them. They fight many kings around them. The musk that is in their lands is of high quality. [Kings of Al-Mabad] Beyond them are the Kings of Al-Mabad. Their cities are many. They are towards where Al-Mujah is, and more [numerous] than Al-Mujah, except that the Mabad «4» are more similar to the Chinese than them. They have eunuch servants like the Chinese who are workers over them. Their lands connect to the lands of China, and they are at peace with the Ruler of China, except that they do not listen to him. The Mabad have messengers to the King of China every year and gifts, and likewise, the King...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 35
  },
  {
    "serial_number": "6277876",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 38,
    "volume_number": 1,
    "text": "of China gives gifts to him. Their lands are vast. When the messengers of Al-Mabad enter the lands of China, they are guarded for fear that they might conquer their lands due to their large numbers, and there is nothing between them and the lands of China except mountains and passes. It is said that the King of China has more than two hundred main cities (mothers of cities). Each city has a king and a eunuch «1». Under each city are cities. Among their cities is Khanfu [Guangzhou], which is the port of ships; under it are twenty cities. It is only called a city if it has the Jadim. [The Jadim] The Jadim «2» is like the trumpet blown into. It is long, and its thickness is what two palms can gather together. It is coated with the medicine (lacquer/varnish) of the Chinese women «3». Its length is three or four cubits, and its head is thin, the size of what a man can put in his mouth. Its sound travels about a mile. Each city has four. At every gate of it are five Jadims blown at times of the night and day. At every [gate] «4» of a city are ten drums beaten with it. This is only done so that their obedience to the King is known, and by it, they know the times of the night and day. They have signs and weights for the hours. [Transactions of the People of China] Their transactions are with Fulus (copper coins), and their treasuries are like the treasuries of kings, and no king has Fulus other than them. It is the 'eye' (money) of the land. They have gold, silver...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 36
  },
  {
    "serial_number": "6277877",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 39,
    "volume_number": 1,
    "text": "pearls, brocade, and silk; all that is abundant among them, except that these are goods, and the Fulus are the currency. Ivory, frankincense, copper ingots, and Dhabl «1» from the sea—which is the skins of the backs of turtles—are brought to them. And this Bashan which we described «2», which is the Rhinoceros; they make belts from its horns. Their animals are many. They have no Arabian horses, but others. They have donkeys and many camels having two humps. They have good porcelain (Ghadar); cups are made from it with the thinness of glass bottles, the light of water is seen in it, and it is of clay «3». [Treatment of Merchants by the People of China] When the sailors enter from the sea, the Chinese seize their goods, put them in houses, and guarantee the protection for six months until the last of the sailors enter. Then three out of every ten are taken, and the rest is handed over to the merchants. What the Sultan needs, he takes at the highest price and pays promptly, and no injustice is done in it. Among what they take is camphor—the Mann «4» for fifty Fakujj, and the Fakujj is a thousand Fulus. This camphor, if the Sultan does not take it, is worth half the price outside. [Custom of the People of China in Death] If a man from the people of China dies, he is not buried until the day he died...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 37
  },
  {
    "serial_number": "6277878",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 40,
    "volume_number": 1,
    "text": "on the like of it in the following year. They put him in a coffin and leave him in their homes. They put lime «1» on him, so it absorbs his water and he remains. The kings are put in aloe and camphor. They weep over their dead for three years. Whoever does not weep is beaten with wood; likewise the women and men, and they say: 'Your dead did not sadden you.' They are buried in a tomb like the tomb of the Arabs. They do not cut off food from him; they claim that he eats and drinks. That is because they place food near him at night, and in the morning they find nothing of it, so they say he has eaten. They do not cease weeping and feeding as long as the dead is in their house, so they become impoverished over their dead; no cash or estate remains for them unless they have spent it on him. Before this, they used to bury the king and what he owned of his household tools, clothes, and belts—and their belts amount to much money—but they have abandoned that now. That is because some of their dead were exhumed and what was with them was taken. [Care of the People of China for Learning Calligraphy and Writing] The poor and the rich of the people of China, and the small and the large, learn calligraphy and writing. [Names of their Kings and their Custom in Kingship] The name of their kings is according to the status and the size of the cities. Whoever is of a small city, its king is called Tusanj «2», and the meaning of Tusanj is 'Establisher of the City'. And whatever...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 38
  },
  {
    "serial_number": "6277879",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 41,
    "volume_number": 1,
    "text": "was from a city like Khanfu [Guangzhou, China], its king is Qasim Difu, and the eunuch is called Al-Tuqam, and their eunuchs are castrated from among them. The Chief Judge is called Laqshi Mamkun (1) and similar names which we cannot accurately record. None of them reigns for less than forty years; they say: 'Experience has seasoned him.' As for the lesser kings, if one of them sits, he sits in his city on a chair in a great hall, and before him is a chair, and books containing the judgments of the people are presented to him. Behind the king is a standing man called Linjun (2); if the king slips in something he orders and makes a mistake, he [Linjun] corrects him. They do not pay attention to the speech of anyone who presents [a petition] to them unless he writes it in a book. Before the owner of the story [petitioner] enters upon the king, a man standing at the door of the house looks into his book; he looks into the books of the people, and if there is an error in them, he returns it. No one writes to the king except a scribe who knows the judgment. The scribe writes in the book: 'Written by So-and-so son of So-and-so.' If there is an error in it, the blame returns to the scribe, and he is beaten with wood. The king does not sit for judgment until he eats and drinks so that he does not make mistakes. The stipends of every king are from the treasury of his city. As for the Greatest King, he is not seen except every ten months; he says: 'If people see me, they will belittle me, and leaderships are not established except with haughtiness, because the common people do not know justice, so it is necessary to use haughtiness with them so we are magnified in their eyes.'",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 39
  },
  {
    "serial_number": "6277880",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 42,
    "volume_number": 1,
    "text": "There is no land tax (kharaj) on their land, but there is a poll tax (jizya) on the male heads according to what they see of conditions. If there is an Arab or other [foreigner] among them, a tax is taken from his wealth to safeguard his wealth. If prices rise (1), the Sultan brings out food from his treasuries and sells it cheaper than the market price, so no inflation remains among them. What enters the treasury is only from the poll tax on their heads. I think that what enters the treasury of Khanfu [Guangzhou] every day is fifty thousand dinars, although it is not the greatest of their cities. The King exclusively controls from the minerals salt, and a herb which they drink with hot water. It is sold in every city for great money, and it is called Al-Sakh (2) [Tea]. It has more leaves than clover (3) and is slightly better [scented], and it has bitterness. Water is boiled and sprinkled upon it; it benefits them for everything. All that enters the treasury is the poll tax, salt, and this herb. In every city there is something called Al-Dara, which is a bell on the head of [the residence of] the king of that city, tied with a cord extending on the surface of the road for all the common people. Between the king and it is about a parasang. If the extended cord is moved the slightest movement, the bell moves...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 40
  },
  {
    "serial_number": "6277881",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 43,
    "volume_number": 1,
    "text": "...so whoever has a grievance moves this cord, and the bell moves from it over the head of the king, so he is permitted to enter until he reports his case himself and explains his grievance. All the cities have the like of that. Whoever wants to travel from one of them to another takes two documents from the king and from the eunuch (1). As for the king's document, it is for the road, with the name of the man, the name of who is with him, his age and the age of who is with him, and from which tribe he is. All who are in the lands of China, of its people, the Arabs, and others, must belong to something by which they are known. As for the eunuch's document, it is regarding the money and the goods he has with him. That is because on their road are guard posts (2) who look into the two documents. If a traveler arrives at them, they write: 'So-and-so son of So-and-so the Such-and-such arrived at us on such day, such month, and such year, and with him is such and such,' so that nothing of the man's money nor his goods goes to waste. So whenever something of it is lost or he dies, it is known how it was lost, and it is returned to him or to his heirs after him. \n\n[Fairness of the People of China in Transactions]\n\nThe people of China are fair in transactions and the Divan. If a man has a debt against another man, he writes a document against him, and the one who owes the debt also writes a document, and marks it with a mark between his middle finger and index finger. Then the two documents are gathered and folded together, then written upon their separation, then separated, so the one who owes the debt is given his document with his acknowledgment. So whenever one of them denies his creditor, it is said to him: 'Bring your document.' If the one who owes the debt claims he owes nothing and presents his document with his handwriting...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 41
  },
  {
    "serial_number": "6277882",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 44,
    "volume_number": 1,
    "text": "...and his mark, and the document of the rights holder is lost, it is said to the denier who owes the right: 'Bring a document that this right is not upon you.' So whenever the rights holder whom you denied proves it against you, upon you are twenty strokes of wood on the back, and twenty thousand Fakkuj of Fils (copper coins). The Fakkuj is a thousand Fils; that amounts to nearly two thousand dinars. The twenty strokes of wood contain his death. So hardly anyone in the lands of China gives this of himself for fear of loss of life and wealth, and we did not see anyone agree to that. They are fair among themselves, and no right is lost for anyone, and they do not transact with witness or oath. If a man goes bankrupt with the money of a group, and the creditors imprison him with their money at the Sultan's, his acknowledgment is taken. If he stays in prison for a month, the Sultan brings him out and proclaims about him: 'This So-and-so son of So-and-so went bankrupt with the money of So-and-so son of So-and-so. If he has a deposit with anyone, or has real estate or slaves or what covers his debt, let it be brought out.' In every month he is beaten with strokes of wood on his buttocks, because he stayed in prison eating and drinking while having money. He is beaten whether someone acknowledges money for him or does not acknowledge for him; he is beaten in any case. It is said: 'You have no work except taking people's rights and going off with them.' And it is said to him: 'Manage the rights of these people.' If he has no stratagem and it is proven to the Sultan that he has nothing, the creditors are called and given from the treasury of the Baghbun (1), who is the Greatest King. He was named Baghbun, and its meaning is Son of Heaven, and we call him Al-Maghbun. Then it is proclaimed: 'Whoever trades with this one, upon him is death.' So hardly any money is lost for anyone. And if it is known that he has...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 42
  },
  {
    "serial_number": "6277883",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 45,
    "volume_number": 1,
    "text": "...money with someone and the depositary does not acknowledge the money, he is killed with wood. Nothing is said to the owner of the money, so the money is taken and divided among the creditors, and no trade is done [with him] after that.\n\n[The Stone Mentioning Medicines]\n\nThey have an erected stone ten cubits long, written on it by carving into the stone the mention of medicines and diseases: such disease, its medicine is such. If the man is poor, he is given the price of the medicine from the treasury. There is no land tax on their estates, but it is taken from the heads according to their wealth and estates. If a male is born to someone, his name is written with the Sultan. When he reaches eighteen years, the poll tax is taken from him. If he reaches eighty years, the poll tax is not taken from him, and he is provided for from the treasury. They say: 'We took from him as a young man and provide (1) for him as an old man.' In every city there is a school (Kuttab) and a teacher teaching the poor, and their children eat from the treasury. Their women have uncovered hair, and the men cover their heads. In it is a village called Taywa in the mountain; they are short, and every short person in the lands of China is attributed to it. The people of China are people of beauty, height, and pure whiteness tinged with redness. They have the blackest hair, and their women shear their hair.\n\n[Mention of the Lands of India]\n\nAs for the lands of India [India], if a man makes a claim against another involving death, it is said to the claimant: 'Will you carry the fire?' He says: 'Yes.' So a piece of iron is heated...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 43
  },
  {
    "serial_number": "6277884",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 46,
    "volume_number": 1,
    "text": "...intensely until fire appears in it. Then it is said to him: 'Extend your hand.' Seven leaves of a tree of theirs are placed on his hand, then the iron is placed on his hand over the leaves. Then he walks with it back and forth until he throws it off his hand. A leather bag is brought, and he inserts his hand into it, then it is sealed with the Sultan's seal. When it is after three [days], unhusked rice is brought and it is said to him: 'Rub it.' If there is no trace on his hand, he has succeeded and there is no killing upon him. The one against whom the claim was made is fined a maund (mann) of gold which the Sultan seizes for himself. Sometimes they boil water in an iron or copper pot until no one can approach it, then an iron ring is thrown into it, and it is said: 'Insert your hand and take the ring.' I have seen one who inserted his hand and brought it out healthy. The claimant is also fined a maund of gold.\n\n[Custom of the People of Serendib regarding the Death of their Kings]\n\nIf the King dies in the lands of Serendib [Sri Lanka], he is placed on a low carriage close to the ground, and hung at its rear lying on his back, the hair of his head dragging in the dust from the ground. A woman with a broom in her hand throws dust on his head and calls out: 'O people, this is your king; yesterday he owned you and his command was effective among you. He has come to what you see of leaving the world, and the Angel of Death has taken his soul. So do not be deceived by life after him.' And speech like this for three days. Then sandalwood (1), camphor, and saffron are prepared for him, and he is burned with it. Then his ashes are thrown into the wind (2). All of India burn their dead with fire.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 44
  },
  {
    "serial_number": "6277885",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 47,
    "volume_number": 1,
    "text": "[Customs of the People of India in Burning their Dead and their Worships]\n\nSerendib (1) is the last of the islands and is of the lands of India. Perhaps the King is burned, so his wives enter the fire and burn with him, and if they wish, they do not do so. In the lands of India are those attributed to wandering (Siyahah) in forests and mountains; they rarely associate with people and sometimes eat herbs and forest fruits. He puts an iron ring on his penis so he does not approach women. Among them is the naked one, and among them is one who sets himself up to the sun facing it naked, except that upon him is something of leopard skins. I saw a man of them as I described, then I departed and returned after sixteen years, and saw him in that state. I marveled how his eye did not melt from the heat of the sun.\n\n[Their Inheritance of Kingship and Crafts]\n\nThe people of the royal house in every kingdom are people of one house; kingship does not leave them, and they have heirs apparent. Likewise, the people of writing (scribes) and medicine are people of houses; that craft is not except among them. The kings of India do not submit to a single king, but rather each one is king of his lands. The Ballahara is the King of Kings in India. As for China, they do not have heirs apparent.\n\n[Abstention of the Kings of India from Amusement and Wine]\n\nThe people of China are people of amusements. The people of India fault amusements and do not adopt them, nor do they drink wine nor eat vinegar because it is from wine. That is not religion but disdain. They say: 'Any king who drinks wine is not a king.' That is because around them are kings who fight them, so they say:",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 45
  },
  {
    "serial_number": "6277886",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 48,
    "volume_number": 1,
    "text": "'How can one who is drunk manage the affair of his kingdom?' (1). Perhaps they fight over kingship, and that is rare. I have not seen anyone conquer anyone over his kingdom except a people following the lands of pepper. If a king conquers a kingdom, he appoints over it a man from the household of the conquered king, and he is under his authority; the people of that kingdom are not satisfied except with that.\n\n[The People of China Eating the Flesh of their Kings]\n\nAs for the lands of China, perhaps the king who is under the authority of the Greatest King acts unjustly, so they slaughter him and eat him. Everyone killed by the sword, the Chinese eat his flesh. The people of India and China, if they want to marry, congratulate each other, then exchange gifts, then publicize the marriage with cymbals and drums. Their gift is of money according to ability. If a man among them brings a woman and she commits adultery, killing is upon her and upon the one who committed adultery with her in all the lands of India. If a man commits adultery with a woman forcing her, the man alone is killed. If he commits adultery with a woman with her consent, they are both killed.\n\n[Their Judgment in the Penalty of Theft]\n\nTheft (2) in all the lands of China and India, in little of it and much, is killing. As for India, if the thief steals a fils (penny) or more, a long piece of wood is taken, its end sharpened, then he is impaled upon it from his buttocks until it comes out of his throat.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 46
  },
  {
    "serial_number": "6277887",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 49,
    "volume_number": 1,
    "text": "The people of China sodomize boys who have been set up for that like the prostitutes of the idolaters (Al-Badadah) (1).\n\n[Buildings of the People of China and India]\n\nThe walls of the people of China are wood. The building of the people of India is stone, gypsum, baked brick, and clay. Likewise, perhaps it was in China too. Neither China nor India are people of carpets. A man from China and India marries whatever he wishes of women. The food of India is rice, and the food of China is wheat and rice. The people of India do not eat wheat. Neither India nor China practice circumcision.\n\n[Religion of the People of China and India]\n\nThe people of China worship idols, pray to them, and humble themselves before them. They have religious books.\n\n[Miscellaneous Wonders]\n\nThe Indians lengthen their beards; perhaps the beard of one of them exceeds three cubits. They do not trim their mustaches. Most of the people of China have no beards by nature for most of them. The people of India, if one of them has a death, he shaves his head and beard. The Indians, if they imprison a man or detain him, prevent him from food and drink for seven days while they are detaining him. The people of China have judges who judge between them other than the governors, and likewise the people of India.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 47
  },
  {
    "serial_number": "6277888",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 50,
    "volume_number": 1,
    "text": "Leopards and wolves are in all the lands of China. As for lions, they are not in either of the two provinces. The highway robber is killed. The people of China and India claim that the idols (Al-Badadah) speak to them, but it is their worshippers who speak to them. China and India kill what they want to eat and do not slaughter it; they strike its skull until it dies. Neither India nor China wash themselves from major ritual impurity (Janabah). The people of China do not clean themselves after defecation except with paper. The Indians wash themselves every day before lunch then eat. The Indians do not approach women during menstruation and expel them from their homes out of disgust for them. The Chinese approach them during menstruation and do not expel them. The people of India use the toothstick (Siwak); one of them does not eat until he uses the toothstick and washes. The people of China do not do that. The lands of India are vaster than the lands of China and multiples of it, and the number of their kings is greater. The lands of China are more populated. Neither China nor India have palm trees, but they have other trees and fruits not with us. The Indians have no grapes, and it is scarce in China. Other fruits are abundant with them, and pomegranates are more in India. The people of China have no science; the origin of their religion is from India. They claim that the Indians established the idols for them, and that they are the people of religion. Both countries return to reincarnation (transmigration of souls) and differ in the branches of their religion (1). Medicine is in India, and philosophers. The people of China also have medicine, and most of their medicine is...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 48
  },
  {
    "serial_number": "6277889",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 51,
    "volume_number": 1,
    "text": "...cauterization. They have knowledge of astronomy, and that is more in India. I do not know anyone of the two groups who is Muslim or speaks Arabic. India has few horses, and they are more for China. China has no elephants, and they do not leave them in their lands considering them bad omens. The armies of the King of India are numerous and are not paid; rather, the King calls them to Jihad, so they go out spending from their own wealth; nothing of that is on the King. As for China, their giving is like the giving of the Arabs. The lands of China are more pleasant and beautiful. Most of India has no cities, while the people of China in every place have a great fortified city. The lands of China are healthier, with fewer diseases and better air; a blind or one-eyed person or one with a defect is hardly seen there, and this is frequent in the lands of India. The rivers of both countries are great, some greater than our rivers. Rains in both countries are frequent. In the lands of India are many deserts, while China is all populated. The people of China are more beautiful than the people of India, and more similar to the Arabs in clothing and beasts. In their appearance in their processions, they are similar to the Arabs; they wear tunics (Qaba') (1) and belts. The people of India wear two wraps (Futa) and adorn themselves with gold bracelets and gems, men and women. Behind the lands of China on the earth are the Taghazghuz (Toquz Oghuz) (2), and they are from the Turks,",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 49
  },
  {
    "serial_number": "6277890",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 52,
    "volume_number": 1,
    "text": "and the Khaqan (1) of Tibet (2). This is adjacent to the lands of the Turks. As for what is adjacent to the sea, there are the islands of Al-Sila (Korea); they are white and send gifts to the ruler of China. They claim that if they did not gift him, the sky would not rain on them. None of our companions has reached it to recount about them. They have white falcons.\n\nThe First Book is Completed.\nThe poor [servant] Muhammad looked into this book in the year one thousand and eleven [1011 AH]. May Allah improve its outcome and what is after it. Amen. O Allah, forgive its scribe, his parents, and the Muslims.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 50
  },
  {
    "serial_number": "6277891",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 53,
    "volume_number": 1,
    "text": "The Second Book of the Reports of China and India\nAbu Zayd al-Hasan al-Sirafi said: I looked into this book, meaning the First Book, which I was ordered to examine and record what I learned of the matter of the sea, its kings, and their conditions, and what I knew of their stories which did not enter into it. I found the date of the book to be in the year two hundred and thirty-seven. The matters of the sea at that time were stable due to the frequent coming and going of merchants to it from Iraq.\n\n[The Author's Refutation of the Myth that the Dead Eat Food]\n\nI found all that was recounted in the book to be on the path of truth and honesty, except what was mentioned therein of the food which the people of China present to their dead, and that if it is placed at night near the deceased, they wake up and it is not found, claiming that he eats it. This had reached us until one whom we trusted with his news arrived from their region, so we asked him about that and he denied it. He said: 'It is a claim with no basis, like the claim of the idolaters that they speak to them.' The matter of China specifically changed after this date, and incidents occurred in it for which the equipment (shipping) (1) to them was cut off, the country was ruined, its customs vanished, and its affair dispersed. I will explain what I learned of the reason for that, Allah willing:\n\nThe Reason for the Change of the Affair of China from what it was of Judgments and Justice,",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 51
  },
  {
    "serial_number": "6277892",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 54,
    "volume_number": 1,
    "text": "and the cutting off of shipping to it from Siraf: A rebel rebelled among them not from the royal house known as Banshu (Huang Chao) (1). His beginning was villainy (2), bravado, carrying arms, causing corruption, and the gathering of fools to him until his power intensified, his numbers increased, and his greed became established. He targeted Khanfu [Guangzhou] among the cities of China, which is the city intended by Arab merchants. Between it and the sea is a journey of a few days, and it is on a great river and fresh water. Its people held out against him, so he besieged them for a long time, and that was in the year two hundred and sixty-four, until he conquered it. He put the sword to its people. Those knowledgeable about their affairs mentioned that he killed of the Muslims, Jews, Christians, and Magians, excluding who was killed of the people of China, one hundred and twenty thousand men who had settled in this city and become merchants in it. The number of these four communities was only known because of the levy on the people of China by their number. He cut down the mulberry trees and other trees that were in it. We mentioned the mulberry trees specifically because the people of China prepare its leaves for silkworms until the worm spins. So it became a cause for the cutting off of silk specifically from the lands of the Arabs. Then, after destroying Khanfu, he targeted city after city and destroyed it. The King of China was incapable against him until he approached the capital city, known as Khamdan [Xi'an] (3). The King fled...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 52
  },
  {
    "serial_number": "6277893",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 55,
    "volume_number": 1,
    "text": "...from him to the city of Bamdhu [Chengdu?] bordering the lands of Tibet and stayed there. The days of this rebel lasted, and his affair became great. His intent and aim were destroying cities and killing their people since he was not from a royal house nor one who hopes for the order to be consistent for him. He reached in that an extent by which the affair of China was corrupted to this time of ours. That remained the condition of this rebel until the King of China wrote to the King of the Taghazghuz of the lands of the Turks - and between them is neighborliness and marriage relations - and sent messengers to him asking him to remove this man from him. The King of the Taghazghuz sent a son of his to this rebel (1) with a large number and ample crowds, so he removed him after continuous wars and great battles. Some claimed he was killed, and others claimed he died. The King of China returned to his city known as Khamdan, which he [the rebel] had ruined for him, and in a state of weakness in himself, decrease in his wealth, and the perishing of his commanders, brave men, and capable ones. Along with that, a usurper prevailed over every region, withholding its wealth and holding on to what was in his hand of it. Necessity called the King of China, due to the shortness of his hand (lack of power), to accept pardon from them by [their] showing obedience and praying for him without hearing and obeying regarding wealth. The Kings used to have influence in it. So the lands of China became in the way the conditions of the Kisras (Persian Kings) went when Alexander killed Darius (2) the Great and the land of Persia was divided among the Kings of the Sects (Muluk al-Tawa'if). Some of them began to support others for domination without the permission of the King or his command. If the strong one among them knelt upon the weak, he conquered his lands, eradicated what was in it, and ate all its people. That is permissible for them in their law because they trade human flesh in their markets. Their hands extended with that to oppressing the merchants who intended [to visit] them.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 53
  },
  {
    "serial_number": "6277894",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 56,
    "volume_number": 1,
    "text": "When this happened among them, the appearance of injustice and aggression in the Nakhudas (shipmasters) (1) of the Arabs and the ship owners joined it. They obligated the merchants with what was not due upon them, overcame them regarding their wealth, and permitted what was not the custom of old in any of their actions. So Allah, may His mention be exalted, removed blessings from all of them, the sea withheld its side, and destruction occurred by the decree flowing from the Disposer, blessed be His name, among the captains (Rubbanah) (2) and guides (Adilla') in Siraf and Oman.\n\n[Some of the Judgments of the People of China regarding Felonies]\n\nA part of the sunan (laws/customs) of the people of China was mentioned in the book, and others did not mention it, which is: the path of the married man and married woman among them if they commit adultery is killing, and likewise the thief and the murderer. Their path in killing is that the hands of the one they want to kill are tied tightly, then his hands are thrown to his head until they are on his neck. Then his right leg is inserted into what passes through his right hand, and his left leg into what passes through his left hand. Both his feet become behind him, and he is contracted and remains like a ball; he has no stratagem for himself and does not need a holder to hold him. At that, his neck displaces from its joint, his vertebrae displace from their belly, his hips differ, some of him enters into others, his breath narrows, and he becomes in a state that if left as he is for a short time, he would perish. When he reaches [this state], he is beaten with a known piece of wood of theirs on his fatal spots with known blows that do not...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 54
  },
  {
    "serial_number": "6277895",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 57,
    "volume_number": 1,
    "text": "...exceed [the limit], so there is nothing short of his soul (death). Then he is given to one who eats him.\n\n[Divan of Prostitutes]\n\nAmong them are women who do not want chastity (marriage) and desire adultery. The path of such is to attend the council of the Chief of Police and mention her abstinence from chastity and her desire to enter into the group of prostitutes, and ask to be treated according to the custom for her likes. It is their custom for whoever of the women wants that, to have her lineage, description, and place of residence written and recorded in the Divan of Prostitutes. A cord is placed on her neck with a copper ring stamped with the King's seal. A decree is given to her mentioning her entry into the group of prostitutes and that she owes the treasury such and such fils every year, and that whoever marries her is subject to killing. So she pays what she owes every year, and disapproval is removed from her. This class of women go out in the evenings wearing colorful clothes without covering, proceeding to those strangers who have come to those lands, people of debauchery and corruption, and the people of China. They stay with them and leave in the mornings. We praise Allah for what He has purified us from these trials (Fitnahs).\n\n[Transactions of the People of China with Fulus (Copper Coins) and Trade]\n\nAs for their dealing with Fulus, the reason for it is their disapproval of those dealing with Dinars and Dirhams: That if a thief entered the house of a man of the Arabs dealing with Dinars and Dirhams, it would be possible for him to carry ten thousand Dinars and the like of silver on his neck, which would be the ruin of the owner of the money. But if a thief entered upon a man of them, he would not carry more than ten thousand fils, and that is only ten mithqals of gold.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 55
  },
  {
    "serial_number": "6277896",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 58,
    "volume_number": 1,
    "text": "[Fulus of the People of China]\n\nThese Fulus are made of copper and mixtures of other things kneaded with it. The Fils among them is the size of the Baghli Dirham (1). In its center is a wide hole to pass a cord through. The value of every thousand fils of it is a mithqal of gold. The cord strings a thousand fils of them, with a knot at the head of every hundred. If a buyer buys estates, goods, or vegetables and above, he pays from these Fulus according to the price. They are present in Siraf and have an inscription in their writing.\n\n[Method of the People of China in Building their Houses]\n\nAs for fire in the lands of China and building and what was mentioned therein: The country is built as was said of wood and latticed bamboo like split reeds with us, plastered with clay and a treatment of theirs which they take from hemp seed (Shahdanaj) (128) (2), so it becomes whiter than milk. The walls are painted with it so they shine with a wondrous shine. Their houses have no thresholds (129) (3) because their possessions, treasures, and what their hands contain are in chests mounted on wheels with which they move. If a fire occurs, those chests with what is in them are pushed, and thresholds do not prevent them from quick passage.\n\n[Servants of the Kings of China and their Eunuchs]\n\nAs for the matter of servants, it was mentioned briefly. They are only the governors of the land tax and the gates of wealth. Some of them are captured from the borders and castrated, and some are castrated by...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 56
  },
  {
    "serial_number": "6277897",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 59,
    "volume_number": 1,
    "text": "...their father from the people of China and gifted to the King seeking closeness to him. The affairs of the King in his private matters, his treasuries, and whoever heads to the city of Khanfu which Arab merchants intend, are the servants. Among their customs in the riding of these servants and the kings of other cities if they ride: Men precede them with wood resembling bells (Semantrons) which they strike. It is heard from afar, so no one of the subjects stands in any part of that road which the servant or king wants to pass through. Whoever is at the door of a house enters it and locks the door, until the passing of the servant or the King ruling over that city is done, and there is no one of the common people in his path, for intimidation and haughtiness, and lest the gaze of the common people at them increases, and lest the tongue of anyone extends to speak with them. (1)\n\n[Skill of the People of China in the Silk Industry and Others]\n\nThe clothing of their servants and the notables of their commanders is luxurious silk, the like of which is not brought to the lands of the Arabs, due to their keeping it and their exaggeration in its prices. A man from the notable merchants, whose report is not doubted, mentioned: That he went to a eunuch whom the King had sent to the city of Khanfu to select what he needed of goods arriving from the lands of the Arabs. He saw on his chest a mole showing through from under silk clothes he was wearing. He estimated that he had doubled two garments of it. When he persisted in looking, the eunuch said to him: 'I see you staring at my chest, why is that?' The man said to him: 'I marveled at a mole showing through from under these clothes.' The eunuch laughed, then threw the sleeve of his shirt to the man and said to him: 'Count what is on me of them.' He found them to be five tunics one over another, and the mole showed through from under them. Silk of this description is raw, not bleached. What...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 57
  },
  {
    "serial_number": "6277898",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 60,
    "volume_number": 1,
    "text": "[Skill of the People of China in Precision Industries] (1)\n\nThe people of China are of the most skilled of Allah's creation in hand at engraving, manufacturing, and every work; no one from other nations precedes them in it. A man of them makes with his hand what he estimates others are incapable of, then heads with it to the King's gate seeking reward for the intricacy of what he invented. The King orders it to be set up at his gate from that time for a year. If no one finds a flaw in it, he rewards him and enters him into the group of his craftsmen. If a flaw is found in it, he discards it and does not reward him. A man of them depicted an ear of grain with a sparrow on it in a silk cloth; the viewer does not doubt that it is an ear of grain and that a sparrow is on it. It remained for a period. A hunchbacked man passed by it and faulted it. He was brought to the king of that city, and its maker attended. He asked the hunchback about the flaw. He said: 'It is known among all people that a sparrow does not land on an ear of grain without bending it, and this artist depicted the ear of grain standing straight with no bend, and fixed the sparrow upright on top of it, so he erred.' He was believed, and the King did not reward its maker with anything. Their intent in this and similar things is disciplining those who make these things to compel them to extreme caution and applying thought in what each of them makes with his hand.\n\n[Story of Ibn Wahb al-Qurashi and what happened to him with the King of China] (2)\n\nThere was in Basra a man from Quraysh known as Ibn Wahb from the descendants of Habbar (3) ibn al-Aswad. He left it when it was ruined and ended up in Siraf. There was a ship wanting the lands of China, so his ambition moved him by the decree flowing upon...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 58
  },
  {
    "serial_number": "6277899",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 61,
    "volume_number": 1,
    "text": "He embarked on that ship to the lands of China, then his ambition led him to aim for its Great King. He traveled to Khamdan in about two months from the city known as Khanfu. He stayed at the King's gate for a long period, presenting petitions (Ruqa') and mentioning that he was from the family of the Prophethood of the Arabs. After this period, the King ordered him to be lodged in one of the residences and his needs to be fulfilled. The King wrote to the governor acting as deputy residing in Khanfu, ordering him to investigate and ask the merchants about what the man claimed of kinship to the Prophet of the Arabs, peace be upon him. The ruler of Khanfu wrote confirming his lineage, so he permitted him [audience] and gave him ample wealth with which he returned to Iraq. He was an understanding old man. He told us: When he reached him [the King], he asked him about the Arabs and how they removed the kingdom of the Persians. He said to him: By Allah, may His mention be exalted, and because of what the Persians were upon of worshipping fires and prostrating to the sun and moon instead of Allah. He said to him: The Arabs have conquered the most majestic of kingdoms, the most extensive in fertile lands, the most abundant in wealth, the most intelligent in men, and the furthest in fame. Then he said to him: What is the rank of the rest of the kings with you? He said: I have no knowledge of them. He said to the interpreter: Tell him we count the kings as five. The most extensive of them in kingdom is the one who rules Iraq, because he is in the middle of the world, and the kings surround him; we find his name with us to be the King of Kings. After him is this king of ours, and we find him with us to be the King of People, because no one of the kings is more politic than us, nor more controlling of his kingdom than our control of our kingdom, nor are any subjects more obedient to their kings than our subjects; so we are the Kings of People. After us is the King of Beasts, who is the King of the Turks adjacent to us. After them is the King of Elephants, who is the King of India; we find with us [he is] the King of Wisdom because its origin is from them. After him is the King of the Romans (Byzantines), and he is with us the King of Men, because there is no one on earth more perfect in physique among his men nor more beautiful in faces. These are the notables of kings, and the rest are below them.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 59
  },
  {
    "serial_number": "6277900",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 62,
    "volume_number": 1,
    "text": "Then he said to the interpreter: Tell him, do you know your Companion (the Prophet) if you saw him? Meaning the Messenger of Allah, peace be upon him. I said: How can I see him when he is with Allah, Mighty and Majestic? He said: I did not mean this; I only meant his image. He said: Yes. So he ordered a chest to be brought out and placed before him. He took a scroll from it and said to the interpreter: Show him his Companion. I saw in the scroll images of the Prophets, so I moved my lips in prayer upon them. He did not know that I recognized them. He said to the interpreter: Ask him about the moving of his lips. He asked me, and I said: I am praying upon the Prophets. He said: From where did you know them? I said: From what is depicted of their affair. This is Noah in the Ark, saved with those with him when Allah, may His mention be exalted, commanded the water and it flooded the whole earth with whoever was in it, and He saved him and those with him. He laughed and said: As for Noah, you have spoken the truth in naming him. As for the drowning of the whole earth, we do not know it; the Flood only took a piece of the earth and did not reach our land nor the land of India. Ibn Wahb said: I feared refuting him and establishing the argument because of my knowledge of his rejection of that. Then I said: This is Moses and his staff and the Children of Israel. He said: Yes, despite the smallness of the land he was in and the corruption of his people against him. I said: And this is Jesus on a donkey and the Disciples with him. He said: He was short in duration; his affair was only a little more than thirty months. He enumerated of the affair of the rest of the Prophets what we have limited ourselves to mentioning some of. He claimed that he saw above every image of a Prophet a long writing which he estimated contained the mention of their names, the locations of their countries, and the reasons for their prophecies. Then he said: I saw the image of the Prophet, peace be upon him, on a camel and his companions surrounding him on their camels, with Arab sandals on their feet and tooth-sticks (Siwak) tied at their waists. So I wept. He said to the interpreter: Ask him about his weeping. I said: This is our Prophet and our Master and my cousin, peace be upon him. He said:",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 60
  },
  {
    "serial_number": "6277901",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 63,
    "volume_number": 1,
    "text": "You have spoken the truth. He and his people have possessed the most majestic of kingdoms, except that he did not see what he possessed, but those after him saw it. I saw images of Prophets of a large number; some of them pointing with their right hand, joining the thumb and index finger as if indicating the truth in their gesture; and some standing on their feet pointing with their fingers to the sky; and other things. The interpreter claimed they were from their prophets and the prophets of India. Then he asked me about the Caliphs, their attire, and many of the laws and their aspects to the extent of what I knew of them. Then he said: How old is the world according to you? I said: It is differed upon. Some say: six thousand years, some say less than that, and some say more than that but by a little. He laughed a great laugh, and his vizier also standing indicated his denial of that. He said: I do not reckon your Prophet said this. I slipped and said: Yes, he said that. I saw denial in his face. Then he said to the interpreter: Tell him to watch his words, for Kings are not spoken to except with verification. As for what you claimed that you differ in that, you only differed in the saying of your Prophet; and what the Prophets said should not be differed upon, but rather it is accepted. So beware of narrating this and its like. He mentioned many things that have escaped me due to the length of time. Then he said to me: Why did you turn away from a King who is closer to you than us in abode and lineage? I said: Because of what happened to Basra and my ending up in Siraf, and my seeing a ship departing to China, and what reached me of the majesty of the King of China and the abundance of good in him, so I loved to fall upon that region and witness it. I am returning from it to my country and the kingdom of my cousin, informing of what I witnessed of the majesty of this King and the vastness of these lands. I will speak with every goodness and praise with every beauty. That pleased him, and he ordered for me a splendid gift, and for me to be carried on post mules to the city of Khanfu. He wrote to its king to honor me and put me ahead of all who are...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 61
  },
  {
    "serial_number": "6277902",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 64,
    "volume_number": 1,
    "text": "...in his region of other kings, and to provide accommodation for me until the time of my departure. So I was in the most fertile and comfortable living until I left the lands of China.\n\n[The City of Khamdan and the Seat of the King]\n\nWe asked him about the city of Khamdan where the King is, and its description. He mentioned the vastness of the city and the large number of its people, and that it is divided into two sections separated by a long wide street. The King, his vizier, his soldiers, the Chief Judge, the King's eunuchs, and all his retinue are in the right section of it and what follows the East. No one from the common people mixes with them, nor are there any markets in it. [It has] flowing rivers in their lanes, trees arranged upon them, and spacious houses. In the left section which follows the West: the subjects, merchants, provisions, and markets. When the day becomes bright, you see the stewards (1) of the King, his retinue, the slave-boys of his house, and the slave-boys of the commanders and their agents, riding and walking, entering the section where the markets and merchants are. They take their allowances and needs, then depart, and none of them returns to this section except on the second day (2). In this city is every pleasure, beautiful forest, and flowing rivers, except for palm trees, for they are non-existent.\n\n[Connection of the Sea of China and India with the Sea of Sham (3)]\n\nAmong what happened in our time and was not known by those who preceded us, is that no one...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 62
  },
  {
    "serial_number": "6277903",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 65,
    "volume_number": 1,
    "text": "estimated that the sea on which is the Sea of China and India connects to the Sea of Sham (Mediterranean), nor did it arise in their minds until it was in this age of ours. It reached us that wood from the stitched Arab ships, which had broken with their people, was found in the Sea of Rome (Mediterranean). The waves cut it up and the winds drove it with the waves of the sea, casting it into the Sea of the Khazars (Caspian/Black Sea?), then it flowed into the Gulf of Rome (Constantinople/Bosporus?) and passed from it to the Sea of Rome and Sham. This indicated that the ocean circles the lands of China and Silla (1) and the back of the lands of the Turks and Khazars, then pours into the Gulf and leads to the lands of Sham. That is because stitched wood (2) is only for the ships of Siraf specifically, while the ships of Sham and Rome are nailed, not stitched. It also reached us that Ambergris was found in the Sea of Sham, and this is among the strange things and what was not known in ancient times. It is not possible, if what was said is true, that the Ambergris fell into the Sea of Sham except from the Sea of Aden and Qulzum (Red Sea), which is the sea connected to the seas where Ambergris is found, because Allah, may His mention be exalted, has placed a barrier between the two seas. Rather, if it is true, it is from what the Sea of India casts to the rest of the seas one after another until it leads with it to the Sea of Sham.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 63
  },
  {
    "serial_number": "6277904",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 66,
    "volume_number": 1,
    "text": "[Mention of the City of Zabaj]\n\nThen we begin by mentioning the city of Zabaj (1) as it is opposite the lands of China. Between them is a month's journey by sea, and less than that if the winds assist. Its king is known as the Maharaja (2). It is said: Its area (3) is nine hundred parasangs. This king is king over many islands; the extent of the distance of his kingdom is a thousand parasangs and more. In his kingdom is an island known as Sarirah (4), its area as they mention is four hundred parasangs. And an island also known as Rami (5), its area is eight hundred parasangs; in it are plantations of Brazilwood, Camphor, and others. In his kingdom is the island of Kalah, which is the midpoint between the lands of China and the land of the Arabs; its area as they mention is eighty parasangs. In Kalah is the gathering of goods from Aloeswood, Camphor, Sandalwood, Ivory, Tin (Rasas Qal'i), Ebony, Brazilwood, and all spices, and other things whose explanation would be vast and long. Shipping from Oman at this time to it, and from it to Oman, is happening. The command of the Maharaja is effective in these islands. His island where he is, is in...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 64
  },
  {
    "serial_number": "6277905",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 67,
    "volume_number": 1,
    "text": "utmost fertility and its population is organized. Someone whose word is trusted mentioned: That when the roosters crow at dawn for the times as they crow with us, they answer each other for up to a hundred parasangs and more, answering one another due to the connection of villages and their regularity. There are no deserts in it, nor ruins. The traveler in their lands, if he travels and rides a mount, travels if he wishes, and if he tires and the mount is weary, he stops where he wishes.\n\n[The Rule of the Maharaja in Storing Gold and Distributing It]\n\nAmong the wonders that reached us from the stories of this island known as Zabaj is that a king of their kings in ancient times, who is the Maharaja - and his palace is on a Thalaj [estuary/inlet] taking from the sea. The meaning of Thalaj is a valley like the Tigris of the City of Peace (1) and Basra; the sea water overcomes it at high tide and the fresh water recedes from it at low tide. From it is a small pond adjacent to the King's palace. When it is the morning (2) of every day, the King's steward enters carrying a brick he has cast from gold containing a Mana (3) [weight], the amount of which is hidden from me. He throws it before the King into that pond. When it is high tide, the water covers it and what was gathered with it of its likes, submerging it. When it is low tide, the water recedes from it, revealing it, so it shines in the sun. The King looks upon it when sitting in the council overlooking it. That remains the case, a brick of gold is thrown every day into that pond as long as...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 65
  },
  {
    "serial_number": "6277906",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 68,
    "volume_number": 1,
    "text": "that King lives for a time; nothing is touched of it. When the King dies, the successor after him takes it all out and leaves nothing of it. It is counted, then melted and distributed among the people of the royal house, their men, women, children, commanders, and servants, according to their ranks and customs for each class of them. What remains after that is distributed among the poor and weak. Then the number of gold bricks and their weight is recorded, and it is said that So-and-so reigned for such-and-such years, and left of gold bricks in the Pond of Kings such-and-such bricks, and that they were distributed after his death among the people of his kingdom. Pride among them is for he whose days of reign extended and the number of gold bricks in his legacy increased.\n\n[The King of Qumar]\n\nAmong their news in the ancient past is that a king of the kings of Qumar (1) - which is the land from which Qumari Aloeswood (2) is imported, and it is not an island but rather on what follows the land of the Arabs; there is no kingdom with a greater population than the people of Qumar. They are travelers. All of them forbid adultery and all wines, so there is nothing of it in their lands and kingdom. It is opposite the kingdom of the Maharaja and the island known as Zabaj. Between them is a distance of ten days to twenty days across the sea if the wind is moderate.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 66
  },
  {
    "serial_number": "6277907",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 69,
    "volume_number": 1,
    "text": "[Story of the King of Qumar, His Vizier, and His Story with the King of Zabaj]\n\nIt was said that this King assumed kingship over Qumar in ancient days, and he was a hasty youth. He sat one day in his palace overlooking a valley flowing with fresh water like the (Tigris) of Iraq. Between his palace and the sea is a day's journey. His vizier was before him. He said to his vizier - and the mention of the kingdom of the Maharaja, its majesty, its large population, and the islands under his hand had occurred - 'There is a desire in my soul I would love to attain.' The vizier - who was sincere and knew of his haste - said: 'What is it, O King?' He said: 'I would love to see the head of the Maharaja, King of Zabaj, in a basin before me.' The vizier knew that envy had stirred this thought in his soul. He said: 'O King, I would not like the King to speak to himself of the likes of this, since there has not occurred between us and these people, neither in deed nor in speech, any wrong (1), nor have we seen evil from them. They are in a distant island not neighboring us in our land, nor coveting our kingdom. It is not appropriate for anyone to know of this speech, nor for the King to repeat a saying in it.' He became angry and did not listen to the sincere adviser. He broadcast that to his commanders and those present of his notable companions. Tongues transmitted it until it spread and reached the Maharaja. He was prudent (2), active, and seasoned, having reached a middle age. He called for his vizier and informed him of what reached him. He said to him: 'It is not right, from what has spread of the affair of this ignorant one and his wishing what he wished due to his young age and delusion, and the spread of that from his speech, that we refrain from him. For that weakens the King's strength, diminishes him, and lowers him.' He ordered him to conceal what passed between them, and to prepare for him a thousand ships...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 67
  },
  {
    "serial_number": "6277908",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 70,
    "volume_number": 1,
    "text": "...of medium ships with their equipment, and to assign to each ship from the weaponry and brave men what it can carry. He pretended that he wanted to tour the islands in his kingdom. He wrote to the kings in these islands who were under his obedience, informing them of his intent to visit them and tour their islands, until that spread. The king of every island prepared what was suitable for the Maharaja. When his affair was set and organized, he boarded the ships and crossed with them and the army to the kingdom of Qumar. He and his companions were people of constant use of the tooth-stick (Siwak); a man of them does that times a day, and each one's Siwak is with him, not leaving him, or with his slave-boy. The King of Qumar did not sense him until he attacked the valley leading to the palace of the King of Qumar. He landed his men and they surrounded him by surprise. He seized him and took possession of his palace. The people of the kingdom fled before him. He ordered a proclamation of safety. He sat on the throne on which the King of Qumar used to sit. He had taken him prisoner, so he brought him and brought his vizier. He said to the King of Qumar: 'What prompted you to wish for what is not in your power, nor do you have fortune in it if you attained it, nor did a cause necessitate facilitating the way to it?' He did not return an answer. Then the Maharaja said to him: 'Had you wished, from what you wished of looking at my head in a basin before you, for the permissibility of my land and its ownership or corruption in any of it, I would have applied all that to you. But you wished for a specific thing, so I am doing it to you and returning to my country without extending a hand to anything of your country, large or small, so it may be a lesson for those after you, that everyone should not exceed his measure and what is allotted to him, and that he should seize safety from his confusion.' Then he struck off his neck. Then he turned to his vizier and said to him: 'May you be rewarded well for a vizier. It has been proven to me that you advised your master with an opinion if only he had accepted from you. So look for who...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 68
  },
  {
    "serial_number": "6277909",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 71,
    "volume_number": 1,
    "text": "...is suitable for kingship after this ignorant one and install him in his place.' He departed immediately returning to his country without him or any of his companions extending a hand to anything from the land of Qumar. When he returned to his kingdom, he sat on his throne and looked over his pond. He placed the basin before him with the head of the King of Qumar in it. He summoned the notables of his kingdom and told them his news and the reason that led him to what he undertook. The people of his kingdom prayed for him and rewarded him with good. Then he ordered the head to be washed and perfumed, placed it in a container, and returned it to the King who took charge in the land of Qumar after the killed King. He wrote to him: 'What led me to what we did to your master was his transgression against us, and our disciplining of his likes. We have achieved from him what he wanted for us. We saw fit to return the head to you as we have no benefit in keeping it, nor pride in what we gained from him.' The news reached the kings of India and China, so the Maharaja became great in their eyes. The kings of Qumar after that, whenever they woke up, stood and turned their faces towards the land of Zabaj, prostrated, and bowed to the earth for the Maharaja in veneration. The rest of the kings of India and China believe in reincarnation and profess it. Someone whose report is trusted mentioned that a king of theirs had smallpox (1). When he recovered from smallpox, he looked in the mirror and found his face ugly. He saw a son of his brother and said to him: 'The likes of me does not stay in this body with its change; it is only a vessel for the spirit. Whenever it leaves it, it returns in another. So take charge of the kingdom, for I am separating between my body and my spirit until I descend into another body.' Then he called for a dagger of his...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 69
  },
  {
    "serial_number": "6277910",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 72,
    "volume_number": 1,
    "text": "...sharp and cutting. He ordered it, and his head was severed, then burned.\n\nReturn to the News of China and Mention of Some of Their Affairs\n\nThe people of China, in the intense inspection of their affair in their ancient days and before its change in this time, were in a state the like of which has not been heard.\n\n[Story of the Khurasani Merchant with the King's Eunuch]\n\nA man from the people of Khorasan (1) arrived in Iraq, bought many goods, and went out to the lands of China. He had stinginess and severe miserliness. A dispute occurred between him and a eunuch of the King whom he had sent to Khanfu - which is the city intended by Arab merchants - to take what he needed of what arrives in ships. This eunuch was among the most majestic servants of the King, and to him belonged his treasuries and wealth. The dispute was over ivory goods and others; he refused to sell them until the matter became choked between them. The eunuch carried himself to snatch the best of goods that were with him and disdained his affair. He [the merchant] departed in secret until he reached Khamdan, which is the city of the Great King, in a period of two months and more. He went out to the chain that I described in the book. The path of one who moves it for the Great King is to be removed to a distance of ten days' journey by way of exile, and ordered to be imprisoned there for two months. Then the king of that region brings him out and says: 'You have exposed yourself to what (2) contains your ruin and the shedding of your blood if you are lying. Since the King has brought near to you and your likes, from his viziers and kings, those with whom justice is not lacking...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 70
  },
  {
    "serial_number": "6277911",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 73,
    "volume_number": 1,
    "text": "...for you, know that if you reach the King and what you complained of is not something for the likes of which access to him is obligatory, there is nothing short of your blood (death), so that everyone who intends the like of it does not dare to do what you did. So withdraw your move and go about your business.' If he withdraws, he beats him fifty strokes of wood and exiles him to the lands from which he came. If he persists in his grievance, he reaches [the King]. That was done with the Khurasani. He persisted in his grievance and sought access. He was sent and reached the King. The interpreter asked him about his affair. He informed him of what happened to him from the servant and his snatching from his hand what he snatched. The matter concerning it had spread in Khanfu and circulated. The King ordered the imprisonment of the Khurasani and the provision for his needs in food and drink. He instructed his vizier to write to the governors in Khanfu to investigate what the Khurasani claimed, uncover it, and tell the truth about it. He ordered the Commander of the Right, the Left, and the Commander of the Center the same. Upon these three, after the vizier, revolves the matter of his armies, and he trusts them with himself. If he rides with them in war or otherwise, each of them is in his rank. Each one of them wrote, having uncovered the matter, with what stood as proof of the validity of the Khurasani's claim. The reports reached the King successively from every side. He summoned the eunuch. When he arrived, he seized his wealth and stripped his treasuries from his hand. He said to him: 'Your right was death when you exposed me to a man who traveled from Khorasan - and it is on the border of my kingdom - and went to the lands of the Arabs, and from there to the kingdoms of India, then to my country seeking profit. You wanted him to return passing through these kingdoms and those in them saying: I was wronged in the lands of China and my wealth was usurped. But I refrain from your blood due to your old sanctity, and I appoint you to the management of the dead since you were incapable of managing the living.' He ordered him and placed him in the cemeteries...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 71
  },
  {
    "serial_number": "6277912",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 74,
    "volume_number": 1,
    "text": "...of the Kings to guard them and attend to them.\n\n[Mention of Who Assumes the Judiciary and Their Testing of His Affair]\n\nAmong the wonders of their management in ancient days, not this time, is the matter of judgments and their majesty in their chests, and their choosing for them one whose knowledge of their laws, truthfulness of tongue, upholding of right in all his states, and avoidance of leniency towards the high-ranking so that right falls in its place, doubt does not trouble their hearts. He must be chaste regarding the wealth of the weak and what passes through his hand. If they decide to invest a Chief Judge, they send him before his investiture to all the towns which are the pillars of their lands, so he stays in every town for a month or two months searching into the affair of its people, their news, and their customs. He learns whose word among them must be accepted with a knowledge that dispenses with asking. When he has traveled these metropolises, and no majestic town remains in the kingdom but that he has trodden it, he travels to the Abode of the Kingdom. He is appointed the Judiciary of Judges and entrusted with their selection, so he governs them. With his knowledge of the whole kingdom and who should be invested in every town from its people or others, he knows who suffices with his knowledge without referring to one who might lean in it or speak untruthfully in what he is asked about. It is not possible for any of his judges to write to him with something he knows the contrary of, or to divert him from his direction. The Chief Judge has a crier every day calling (1) at his door saying: 'Is there anyone with a grievance against the King concealed from the eyes of his subjects, or against any of his retinue, his commanders, and the rest of his subjects? For I deputize in all that for him due to what he has extended my hand in and invested me with.' He says that three times. Because the King, in their belief, is that the King does not leave his position until letters are executed from...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 72
  },
  {
    "serial_number": "6277913",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 75,
    "volume_number": 1,
    "text": "...the divans of kings with explicit injustice, and that he neglects the matter of judgment and judges. Whenever he guards against these two matters, and letters are not executed from the divans except with justice, and judgment is not administered except by one who upholds the truth, the kingdom is organized. As for Khorasan and its bordering the lands of China, what is between it and Sogdia is a two-month journey, except that it is in an impregnable desert and continuous sands with no water in them, no valleys, and no habitation near them. This is the reason preventing the attack of the people of Khorasan on their country. As for what is of China following the setting of the sun, which is the place known as Madhu [?], it is on the borders of Tibet and wars between them are continuous. We have seen among those who entered China one who mentioned: That he saw a man carrying musk in a skin on his back, who arrived from Samarkand on foot, crossing town by town of the cities of China until he reached Khanfu, which is the gathering place of merchants intending from Siraf.\n\n[Mention of Musk Extraction]\n\nThat is because the land containing the Chinese musk deer and Tibet is one land, no difference between them. The people of China attract what is near them of the deer, and the people of Tibet what is near them. Tibetan musk is superior to Chinese in two conditions: One of them is that the musk deer in the border of Tibet grazes on spikenard (Sunbul al-Tib), while in what follows the land of China its grazing is the rest of the herbs.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 73
  },
  {
    "serial_number": "6277914",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 76,
    "volume_number": 1,
    "text": "The other condition: The people of Tibet leave the pods in their state, while the people of China adulterate what falls to them of it. Also their traveling by sea and the harm that befalls them. If the people of China leave the musk in its pods and deposit it in jars, secure it, and it arrives in the land of the Arabs, it is like the Tibetan in its quality. The best of all musk is what the deer rubs on the stones of the mountains, as it is a substance that forms in its navel and fresh blood gathers like the gathering of blood in what occurs of boils. When it matures, it itches and annoys it, so it resorts to stones to rub it until it bursts and what is in it flows. When it exits from it, it dries and heals, and the substance returns to gather in it as before. Tibet has men who go out seeking this; they have knowledge of it. If they find it, they pick it up, gather it, deposit it in pods, and carry it to their kings. It is the ultimate musk since it matured in its pods on its animal. It has superiority over other musk like the superiority of what matures of fruits on a tree over the rest of what is plucked from it before its maturation. Other than this musk is only hunted by set traps or arrows. Perhaps the pods are cut from the deer before the maturation of the musk in them. Even if it is cut from its deer, it is foul-smelling for a period of time until (1) it dries over long days. Whenever it dries, it transforms until it becomes musk. The musk deer is like the rest of the deer with us in stature and color, thinness of legs, separation of hooves, erection of horns and their curvature. It has two thin white fangs in the jaws standing in the face of the deer; the length of each one is the amount of a span (Fitr), and less, in the form of the tusk of...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 74
  },
  {
    "serial_number": "6277915",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 77,
    "volume_number": 1,
    "text": "...the elephant. This is the difference between it and the rest of the deer. The correspondence of the kings of China to the kings of their metropolises and their eunuchs is on post mules with docked tails in the manner of post mules with us on known routes. The people of China, whatever we described of their affair, urinate standing up, and likewise the rest of their subjects from the people of their lands. As for the kings, commanders, and notables, they have painted wooden tubes, the length of each piece of wood is a cubit. At the two ends are two holes; the upper one widens for the glans. He stands on his leg when he wants to urinate, distances it from himself, and urinates in it. They claim that this is healthier for their bodies, and that the rest of what afflicts of bladder pain and urine stone formation (1) therein is only from sitting to urinate, and that the bladder does not clear what is in it except with standing for that. The reason for their leaving the hair on their heads, meaning the men, is their abstention from rounding the head of the newborn and shaping it as the Arabs use. Their saying is that this is what removes the brain from the state it was created upon, and that it corrupts the known sense. So their heads are irregular, covered by hair and concealed. As for marriages in the lands of China, they are peoples and tribes like the tribes of the Children of Israel (2) and the Arabs and their clans; they know that among themselves. None of them marries a relative or one of kin. They exceed that so that the tribe does not marry within its tribe. The example of that is that Banu Tamim do not marry into Tamim, and Rabi'ah does not...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 75
  },
  {
    "serial_number": "6277916",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 78,
    "volume_number": 1,
    "text": "...marry into Rabi'ah. Rather, Rabi'ah marries into Mudar, and Mudar into Rabi'ah. They claim that this is more productive for offspring.\n\nSome News of India\nIn the kingdom of Balhara and others of the kings of India are those who burn themselves with fire. That is because of their belief in reincarnation, its establishment in their hearts, and the removal of doubt in it from them.\n\n[Mention of the People of India Burning Themselves]\n\nAmong their kings is one who, when he sits for kingship, rice is cooked for him then placed before him on banana leaves. Three hundred or four hundred of his companions volunteer by their own choice, not by compulsion from the King for them. The King gives them from that rice after he eats from it. Man after man of them approaches and takes a small amount from it and eats it. It becomes binding on everyone who ate from this rice, if the King dies or is killed, to burn themselves with fire to the last of them on the day he died; they do not delay from it so that no eye or trace of them remains. If a man resolves to burn himself, he goes to the King's gate and asks permission. Then he goes around the markets while fire has been kindled for him in much large firewood, with men tending to its ignition until it becomes like agate in heat and inflammation. Then he runs, with cymbals before him, circling in the markets, surrounded by his family and relatives. Some of them place on their head a wreath of basil filled with embers, and pour Sandarac (1) on it. He is with the fire...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 76
  },
  {
    "serial_number": "6277917",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 79,
    "volume_number": 1,
    "text": "...like naphtha. He walks while the crown of his head burns and the smells of the flesh of his head waft. He does not falter in his walk, nor does anxiety appear from him, until he comes to the fire and throws himself into it, becoming ashes. Some of those who attended a man of them wanting to enter the fire mentioned: That when he looked over it, he took a dagger and placed it on the top of his heart, then split it with his hand to his pubis. Then he inserted his left hand and grasped his liver, pulling from it what he could while speaking. Then he cut a piece of it with the dagger and gave it to his brother, in disdain of death and patience over pain. Then he threw himself into the fire to the curse of Allah. (1) This recounting man claimed: That in the mountains of this region are a people of India whose path is the path of the Kanifiyya (2) and Jalidiyya (3) with us in seeking falsehood and ignorance. Between them and the people of the coast is partisanship. A man from the people of the coast ceases not to enter the mountain and challenge one to endure with him in mutilating (4) himself, and likewise the people of the mountain to the people of the coast. A man from the people of the mountains went to the people of the coast for the like of that. People gathered to him, between onlookers and partisans. He demanded of the people of partisanship to do like what he does; if they are incapable of it, they acknowledge defeat. He sat at the head of a bamboo grove and ordered them to pull a stalk from those bamboos. Its path is the path of reeds in...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 77
  },
  {
    "serial_number": "6277918",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 80,
    "volume_number": 1,
    "text": "...its wrapping, and its base is like a jar (1) and thicker. If the head of the stalk is pulled down, it responds until it approaches the ground. If released, it returns to its state. He pulled the head of a thick stalk until it came near him, then he tied his braids to it firmly. Then he took the dagger, which was like fire in its speed, and said to them: 'I am cutting my head with it. If it separates from my body, release it [the bamboo] immediately. I will laugh when the stalk returns with my head to its place, and you will hear a slight chuckle.' The people of the coast were incapable of doing the like of that. We have been told this by one whom we do not suspect, and it is known today as these lands of India are close to the lands of the Arabs, and their news is connected to them at all times. It is of their affair that if age takes their men and women and their senses weaken, the one who reaches this state among them demands his family to throw him into the fire or drown him in water, out of confidence from them in the return. The path of their dead is burning. In the island of Serendib, where the Mountain of Gems and the pearl diving places and other things are, an Indian man dares to enter the market with the Jarbi, which is a dagger of theirs of wondrous make, sharpened. He strikes with his hand the most majestic (2) merchant he can, grabs him by his collar, brandishes the dagger over him, and takes him out of the town in a gathering of people who can devise no stratagem for him. That is because if it is desired to snatch it from him, he kills the merchant and kills himself. If he exits the town, he demands ransom, and someone follows the merchant to ransom him with much money. That continued with them for a period of...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 78
  },
  {
    "serial_number": "6277919",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 81,
    "volume_number": 1,
    "text": "time passed until a king ruled them who ordered that whoever did that [attacked merchants] from the Indians be taken in whatever state he was. So that was done; the Indian merchant was killed, and he killed himself. This happened to a group of them, and lives of Indians and Arabs were lost in it. When the severity occurred, that ceased, and the merchants became safe for themselves. The red, green, and yellow gems are extracted from the mountain of Sarandib [Sri Lanka], which is an island. Most of what appears to them is at the time of the tides «1»; the water rolls it onto them from caves, grottos, and water streams where they have guards for the king. Sometimes they also excavate it just as mines are excavated, so the gem comes out attached to the stones and is broken off from it. [Mention of the religions of the people of the Island of Sarandib and their laws] The king of this island has a law and sheikhs who have assemblies like the assemblies of our hadith scholars. The Indians gather to them, and they write down from them the biographies of their prophets and the sunnahs of their laws. In it is a great idol of pure gold; the sailors exaggerate the amount of its weight, and temples upon which great wealth has been spent. In this island is a large gathering of Jews and of other sects, and in it also are Thanawiyyah (Dualists) «2», and the king permits each group of them to practice their religion. Adjacent to this island are wide aghbab (inlets/bays)—and the meaning of ghubb is a great valley if it is excessive in its length and width and its mouth is into the sea. Those passing through this ghubb, known as the Ghubb of Sarandib, travel for two months and more in...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 79
  },
  {
    "serial_number": "6277920",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 82,
    "volume_number": 1,
    "text": "thickets, meadows, and temperate air. At the mouth of this Ghubb is the sea known as Harkand [Bay of Bengal]. It is a place of nazzah (pure/recreational spot?); a sheep there costs half a dirham. A group of men drink a drink cooked from bee honey with fresh grain of Dhadhi «1» for the like of that amount. Most of their activities are gambling with roosters (cockfighting) and backgammon (Nard). The roosters among them have huge bodies and abundant spurs «2»; they use small, sharp daggers for them which are tied to their spurs, then they are released. Their gambling is for gold, silver, lands, plants, and other things, so the winning rooster wins a sum of gold. Likewise, their playing with backgammon is always for high stakes, so that the weak among them and those with no money, from those who go seeking vanity and chivalry (futuwa), might gamble with his fingertips. He plays, and by his side is something in which walnut oil or sesame oil has been put—since olive oil is nonexistent among them—and under it is a fire heating it. Between them is a small, sharpened axe. If one of them defeats his companion, he places his hand on a stone, and the gambler strikes the fingertip of the defeated with the axe, severing it. The defeated places his hand in the oil while it is at the height of heat to cauterize it. That does not stop him from returning to play; so perhaps they part ways having lost all their fingertips. Some of them take a wick, soak it in oil, then place it on a limb of their body and light a fire in it so it burns, and the smell of flesh wafts while he plays backgammon, showing no anxiety.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 80
  },
  {
    "serial_number": "6277921",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 83,
    "volume_number": 1,
    "text": "Corruption (promiscuity) in this place is widespread among women and men, not prohibited, so that a sea merchant might invite the daughter of their king, and she comes to him in their thickets with the knowledge of her father. The sheikhs of the people of Siraf [Bandar Siraf, Iran] used to forbid sending merchandise to this region, especially the young men. Regarding the matter of 'Al-Yasarrah' which occurs in the lands of India—and its interpretation is 'The Rain' (Monsoon)—it lasts upon them in the summer for three months consecutively, night and day; the sky «1» does not withhold from them at all. They prepare their provisions before that. When the Yasarrah comes, they stay in their houses because they are made of wood with swept roofs shaded by grasses of theirs. No one of them appears except for an important matter, although the craftsmen work on their crafts in these places during this period. Perhaps the bottoms of their feet rot during this time. By this Yasarrah is their livelihood; if it did not happen, they would perish because their agriculture is rice—they know nothing else and have no sustenance other than it. It (the rice) is during this time in 'Haramat' «2» of theirs, cast down, needing no watering or labor. The meaning of Haramat is rice nurseries among them. When the sky clears from them, the rice reaches the limit in yield and abundance. It does not rain on them in winter. [Mention of the Ascetics of India, its Poets, and Philosophers] India has worshippers and people of knowledge known as Brahmins, poets who visit kings, astrologers, philosophers, soothsayers, and people who interpret the flight of crows and others. In it are sorcerers and people who manifest illusions and innovate in them, and that...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 81
  },
  {
    "serial_number": "6277922",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 84,
    "volume_number": 1,
    "text": "is in Qinnawj [Kannauj, India] «1» especially, and it is a great land in the Kingdom of Al-Jurz. [Mention of the Bikarjiyeen] In India, there are a people known as the Bikarjiyeen (Bhikshus/Yogis?), naked; their hair has covered their bodies and private parts, and their fingernails are long like spears because they are not cut, only what breaks off from them. They are on a path of wandering. Around the neck of every man of them is a string with a skull from the skulls of humans. If hunger becomes severe for him, he stands at the door of some Indians, and they hasten to him with cooked rice, rejoicing in him. He eats in that skull, and when he is satisfied, he departs and does not return to ask for food except at the time of his need. [Mention of the Budd] India has varieties of laws by which they draw near, as they claimed «2», to their Creator—exalted is Allah and glorious above what the oppressors say by a great height. Among them: A man builds a khan (inn) on their roads for travelers and installs a grocer in it from whom passersby buy their needs. He installs in the khan a promiscuous woman from the women of India, paying her so that passersby may obtain her, and that is considered by them as something they are rewarded for. In India, there are whores known as the Whores of the Budd (Idol). The reason for this is that when a woman makes a vow, if a beautiful girl is born to her, she brings her to the Budd—which is the idol they worship—and dedicates her to it. Then she takes a house for her in the market, hangs a curtain on it, and seats her on a chair so that the people of India and others from...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 82
  },
  {
    "serial_number": "6277923",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 85,
    "volume_number": 1,
    "text": "other religions who are permissive in their religion pass by her. She makes herself available for a known wage, and whenever she collects something from that, she hands it to the custodians of the idol to be spent on the maintenance of the temple. We praise Allah, Mighty and Majestic, for what He chose for us and for purifying us from the sins of those who disbelieve in Him. [Mention of the Idol of Multan] As for the idol known as Al-Multan [Multan, Pakistan], which is near Al-Mansurah, it is sought from a journey of many months. A man among them carries Indian Qamaruni Oud (aloeswood)—and Qamarun «1» [Kamrup/Assam or Khmer] is a land where fine aloeswood is found—until he brings it to this idol and gives it to the custodians for the incense of the idol. Among this aloeswood is that of which a Mann is worth two hundred dinars. Sometimes it is sealed, and the seal leaves an impression in it due to its softness «2». The merchants buy it from these custodians. [Mention of the Coconut and what is made from it] In India, there are worshippers in their laws who go to islands that appear in the sea, plant coconuts in them, and dig for water in them for reward and so that ships may pass by them and obtain [supplies] from them. In Oman, there are those who go to these islands containing coconuts with carpentry tools and other things. They cut from the coconut wood what they want, and when...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 83
  },
  {
    "serial_number": "6277924",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 86,
    "volume_number": 1,
    "text": "it dries, they cut it into planks. They spin from the coconut fiber what they use to sew that wood together, making a vessel from it. They carve masts «1» from it, weave sails from its leaves, and make ropes (Kharrabat) «2», which are the cables (Qulus) «3» for us, from its fiber. When they finish all of it, the ships are laden with coconuts and taken to Oman, where they are sold. Its blessing and benefit are great since everything made from it does not require anything else. [Mention of the Land of the Zanj] The land of the Zanj [East Africa] is vast. Everything that grows in it of durra (sorghum)—which is their staple food—sugar cane, and other trees is black among them. They have kings who raid one another. With their kings are men known as the 'Mukhazzamun' (Nose-pierced); their noses have been pierced and rings placed in them, and chains attached to the rings. When there is war, they advance, and a man holds the end of each chain, pulling it and preventing him from advancing until the ambassadors mediate between them. If peace occurs, [fine], otherwise those chains are tied around their necks and they are left to the war; no standing remains for him, and one of them does not leave his post unless he is killed. The Arabs have a great awe in their hearts; if they see a man from them, they prostrate to him and say: 'This is from a kingdom where the date palm tree grows,' due to the majesty of dates among them and in their hearts.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 84
  },
  {
    "serial_number": "6277925",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 87,
    "volume_number": 1,
    "text": "[Mention of their Orators] They have sermons, and there is no one among the nations like their orators in their tongues. Among them is one who worships by covering himself with a leopard skin or a monkey skin, taking a staff in his hand, and coming towards them. A crowd of them gathers to him, and he stands on his feet from day until night preaching to them, reminding them of Allah, Exalted is His mention, and describing to them the affairs of those of them who perished. From them, Zanj leopards are exported; they have redness and whiteness and are large and wide. [Mention of the Island of Socotra] In the sea is an island known as Socotra [Socotra, Yemen] «1». In it are the growing places of Socotran Aloe. Its location is near the land of the Zanj and the land of the Arabs. Most of its inhabitants are Christians. The reason for that is that when Alexander conquered the kingdom of Persia, his teacher Aristotle used to correspond with him, informing him of the lands he encountered. He wrote to him emphasizing the search for an island in the sea known as Socotra, and that in it are the growing places of Aloe, which is the greatest medicine without which purgatives (Iyarijat) «2» are not complete, and that the correct thing is to expel whoever is on this island and settle a group of Greeks in it to guard it so that Aloe may be transported from it to Syria, Rome, and Egypt. So Alexander sent and expelled its inhabitants from it and settled a gathering of Greeks in it. He commanded the Kings of the Sects (Muluk al-Tawa'if)—since...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 85
  },
  {
    "serial_number": "6277926",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 88,
    "volume_number": 1,
    "text": "they were, at his killing of Darius the Great, obedient to his hand—to preserve them. So they remained in protection until Allah sent Jesus, peace be upon him. His matter reached those Greeks on these islands, so they entered into the entirety of what the Romans entered into of Christianity. Their remnants are there to this time along with others who inhabited it, and it was not mentioned in this book. [Mention of Al-Shehr and the Land of the Arabs] —Meaning the first book—what is on the right of the sea upon the exit of ships from Oman and the land of the Arabs and their traversing the Great Sea. He only explained in it what was accessible of it since it contained the Sea of India and China, and in it was the destination of the one on whose behalf that book was written. In this sea, which is on the right of India going out from Oman, are the lands of Al-Shehr [Ash Shihr, Yemen], which are the growing places of Frankincense «1», and a land of the lands of Ad, Himyar, Jurhum, and the Tubba's. They have ancient Adite tongues in Arabic which most Arabs do not know. They have no villages, and they are in squalor and straitened living until their land ends at the land of Aden, the coasts of Yemen, and to Jeddah. And from Jeddah to Al-Jar [near Yanbu, Saudi Arabia] to the coast of Syria, then it leads to Al-Qulzum [Suez, Egypt] and the sea ends there. It is where Allah, Exalted is His mention, says: 'And He made between the two seas a barrier.' Then the sea turns from Al-Qulzum to the land of the Berbers, then connects to the western side facing the land of Yemen until it passes the land of Abyssinia, from which Berber leopard skins are imported; they are the best skins...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 86
  },
  {
    "serial_number": "6277927",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 89,
    "volume_number": 1,
    "text": "and the purest. And Zayla [Zeila, Somalia], in which are ambergris and Dhabl «1», which is turtle shells. [Mention of the Sea of Al-Qulzum] When the ships of the people of Siraf arrive in this sea which is on the right of the Sea of India and come to Jeddah, they stay there, and the goods in them that are carried to Egypt are transferred to the ships of Al-Qulzum [Red Sea ships]. That is because it is not possible for the ships of the Sirafis to traverse that sea due to its difficulty and the abundance of mountains (reefs) growing in it. There are no kings on any of its coasts and no habitation. If a ship traverses it, it needs to seek a place to shelter in every night for fear of its mountains; so it travels by day and stays by night. It is a dark sea with foul smells; there is no good in its belly or its back. It is not like the Sea of India and China, in whose belly are pearls and ambergris, in its mountains are gems and gold mines, in the mouths of its beasts is ivory, and in its vegetation places are ebony, brazilwood, bamboo, aloeswood trees, camphor, nutmeg, cloves, sandalwood, and all good, fragrant spices «2». Its birds are parrots (fafagha), peacocks, and the creeping things of its earth are civet (civet cats), musk gazelles, and what no one can count due to the abundance of its goodness. [Mention of what the Sea of Al-Qulzum casts of Ambergris] As for ambergris and what falls of it to the coasts of this sea, it is something the waves cast to it, and its origin is from the Sea of India, although its source is not known, except that the best of it is what falls to Barbara [Berbera, Somalia], the borders of the land of the Zanj, Al-Shehr, and what is adjacent to it, which is the round blue [ambergris].",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 87
  },
  {
    "serial_number": "6277928",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 90,
    "volume_number": 1,
    "text": "The people of these regions have trained camels (nujub) which they ride on moonlit nights, traveling with them on their coasts. They have been trained and know how to seek ambergris on the coast. If the camel sees it, it kneels with its owner, and he takes it. Some of it is found floating on the sea and weighs a great weight. Perhaps it is like the shape of a bull or smaller. If the whale (Hut) known as Al-Bal «1» sees it, it swallows it. When it settles in its belly, it kills it, and the whale floats on the water. There are people who watch for it in boats who know the times when these whales that have swallowed ambergris are found. If they see any of them, they drag it to the land with iron hooks having stout ropes that snag into the back of the whale. They cut it open and extract the ambergris from it. What was next to the belly of the whale is the 'Mand' which has a fishy smell (sahuka); its thickness is found with the perfumers in the City of Peace [Baghdad] and Basra «2». What the fishy smell of the whale did not reach is very pure. This whale known as Al-Bal: sometimes chairs are made from the vertebrae of its back upon which a man sits and settles. They mentioned that in a village ten parasangs from Siraf known as Al-Tayin are ancient houses with small roofs made from the ribs of this whale. I heard someone say that in ancient days one of them fell near Siraf, so he went to look at it and found people climbing to its back with a small ladder. When the fishermen secure it, they cast it in the sun, cut its meat, and dig pits for it in which the grease (Wadak) «3» collects. It is scooped from its source when the sun melts the grease with heat. It is collected and sold to the masters of ships...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 88
  },
  {
    "serial_number": "6277929",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 91,
    "volume_number": 1,
    "text": "and mixed with mixtures of theirs with which sea ships are anointed to seal their seams. It also seals what splits of their seams, so the grease of this whale is sold for a sum of money. [Mention of Pearls] The beginning of the creation of the pearl is by the subtle management of Allah, blessed be His name, and He, Mighty and Majestic, says: (Glory be to Him who created all the pairs, of what the earth grows, and of themselves, and of what they do not know) «1». The pearl starts at the size of the Anjudhan seed «2», in its color, shape, smallness, lightness, thinness, and weakness. It flies on the face of the water, a weak flight, and falls on the sides of the divers' boats. Then it hardens over days, grows, and becomes stony. When it becomes heavy, it sticks to the bottom of the sea and feeds on what Allah knows best. There is nothing in it but a red piece of flesh like a tongue at its base; it has no bone, no nerve, and no vein in it. They have differed regarding the origin of the pearl. A group said: When rain falls, the oyster appears on the surface of the sea and opens its mouth so that rain drops into it, becoming a grain. Others said: It is generated from the oyster itself. This is the more correct of the two reports because it is sometimes found in the oyster while it is growing and has not detached, so it is plucked out. This is what the sea merchants call 'Al-Lu'lu' Al-Qal'' (Plucked Pearl), and Allah knows best. [Mention of the Pearls of Bahrain] Among the wonders we heard regarding the doors of provision: A Bedouin arrived at...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 89
  },
  {
    "serial_number": "6277930",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 92,
    "volume_number": 1,
    "text": "Basra in ancient days having with him a pearl grain worth a sum of money. He went with it to a perfumer he was familiar with, showed it to him, and asked him about it, not knowing its value. He informed him that it was a pearl. He said: 'What is its value?' He said: 'One hundred dirhams.' The Bedouin considered that a lot and said: 'Is there anyone who would buy it from me for what you said?' The perfumer paid him one hundred dirhams, and he bought provisions for his family with it. The perfumer took the grain and went with it to the City of Peace [Baghdad], selling it for a sum of money, and the perfumer expanded his trade. The perfumer mentioned that he asked the Bedouin about the cause of the pearl. He said: 'I passed by Al-Summan [Summan Plateau] «1»—which is part of the land of Bahrain, between which and the coast is a short distance—and I saw in the sand a dead fox with something clamped on its mouth. I got down and found something like a plate whose inside shone with whiteness, and I found this round thing in it, so I took it.' He knew that the cause of that was the exit of the oyster to the coast to inhale the wind—and that is a habit of oysters. The fox passed by it, and when he saw the flesh in its belly while it had its mouth open, he leaped with his speed and inserted his mouth into the oyster and grabbed the flesh. The oyster clamped onto his mouth. It is its nature that if it clamps on something and senses a hand touching it, it does not open its mouth by any trick until it is split from its rear with iron, out of stinginess for the pearl and protecting it like a woman protects her child. When it seized the breath of the fox, he ran wildly striking the ground right and left with it until it took his breath, so he died and it died, and he [the Bedouin] won a provision. [Custom of the Kings of India in wearing earrings and the like] The Kings of India wear earrings of precious gems in their ears...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 90
  },
  {
    "serial_number": "6277931",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 93,
    "volume_number": 1,
    "text": "set in gold, and place around their necks precious necklaces containing fine red and green gems and pearls of great value and majestic worth. It is today their treasures and stores, and their commanders and notables wear it. The leader among them rides on the neck of a man among them, wearing a waist-wrapper (futa) with which he covers himself, and in his hand is something known as the Jatra «1», which is a parasol of peacock feathers he holds in his hand to protect himself from the sun, and his companions surround him. Among them is a class where no two of them eat from one bowl nor at one table; they find that an obscene defect. If they arrive in Siraf and a notable of the merchants invites them, and they are a hundred souls or less or more, he needs to place before every man of them a plate containing what he eats, with no one else sharing it. As for their kings in their lands and their notables, tables are made for them every day; coconut palm leaves are woven tightly and made into the shape of bowls and platters. When the meal is presented, they eat the food in those woven leaves. When they finish their meal, that table and the woven leaf bowl are thrown away into the water with whatever food remains, and they start anew the next day with the like of it. [Sindhi Dinars] Sindhi Dinars used to be carried to India in the past; the dinar was sold...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 91
  },
  {
    "serial_number": "6277932",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 94,
    "volume_number": 1,
    "text": "for three dinars and more. Emeralds arriving from Egypt set in rings and kept in boxes are carried to them, as well as Busad «1»—which is coral—and a stone called Dahnaj (Malachite) «2», then they abandoned it. Most of their kings show their women; when they sit for those of the people of their country and others who enter upon them, they are not veiled from looking at them. This is the most beautiful of what mention has caught in that time regarding the breadth of the news of the sea, while avoiding the recounting of anything about which sailors lie «3» and whose truth does not stand in a person's soul. Limiting each report to what is authentic of it, even if little, is worthier. And Allah is the Granter of success for what is right, and praise be to Allah, Lord of the Worlds, and His blessings be upon the best of His creation, Muhammad, and all his family. He is sufficient for us and the best Helper and Assistant. It was compared with the copy in Safar, year 594. And Allah is the Granter of success. Completed. Survey of some lands currently in the possession of the Just King Nur al-Din Abu al-Qasim Mahmud ibn Zanki ibn Aqsunqur, may Allah the Exalted have mercy on him and illuminate his tomb, in the year five hundred and sixty-four [1169 AD]. [Aleppo] Aleppo [Aleppo, Syria]: The circumference of the wall of its citadel: one thousand one hundred and forty-three and a half Qasimi cubits. Its towers: forty-nine towers. The Large Courtyard: seven hundred and fourteen and a half Qasimi cubits. The Small Courtyard: sixty-nine cubits, four towers. The wall of the town entirely with the Citadel of the Sharif: «1» seven thousand and nine Qasimi cubits. Its towers: one hundred and thirty-nine towers. The gates are six: Gate of Iraq, Qinnasrin, Antioch [Antakya] «2», Al-Jinan, The Jews (forty?). Length of the Green Square (Al-Maydan Al-Akhdar): five hundred and sixty-two and a half Qasimi cubits. Its width: one hundred and sixty-five and a half Qasimi cubits from the north, and from the south (Qibla) one hundred and five by hand-cubit.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 92
  },
  {
    "serial_number": "6277933",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 95,
    "volume_number": 1,
    "text": "Square of Bab Qinnasrin: Its length is seven hundred and eighty-nine and a half Qasimi cubits. Its width is two hundred and twenty-five; from the east one hundred cubits, from the west two hundred by hand-cubit. Square of Bab al-Iraq: Its length is three hundred and ninety-three and a half Qasimi cubits. Its width is one hundred and sixty-six Qasimi cubits. The Mosque of the City [Great Mosque of Aleppo]: Its length from east to west is one hundred and fifteen and a half Qasimi cubits. Its width from south (Qibla) to north is sixty-nine Qasimi cubits and a half and a quarter. The Southern Hall (Bayt): Its width is thirty-eight cubits. The Eastern Hall: twenty-nine cubits. The Minaret of the Mosque: ninety-two cubits; the width of its top at the circle is eleven and a half hand-cubits; its steps are one hundred and fifty-seven. The Northern Hall: of the Mosque, its width is twenty-one hand-cubits. Width of the Western Hall: eleven hand-cubits. The gates of the Mosque are five: two from the east and one from each [other] side. Distance of lands near Aleppo: 'Azaz [Azaz, Syria] «1», between them is nine and a half parasangs. Tell Bashir [Turbessel/Tilbeshar, Turkey] «2» fourteen parasangs.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 93
  },
  {
    "serial_number": "6277934",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 96,
    "volume_number": 1,
    "text": "Harim [Harem, Syria] «1»: ten [thousand?] one hundred twenty-nine thousand seven hundred hand-cubits, ten and a half and a third parasangs. Distances between Manbij and Aleppo: ten and a half and an eighth parasangs. To Buzaa [Biza'ah, Syria] «2»: five parasangs and two-thirds and eight hundred cubits. Al-Ma'arrat [Maarat al-Numan, Syria]: ten [thousand?] one hundred sixty-nine thousand six hundred hand-cubits, fourteen parasangs. Hama [Hama, Syria]: ten [thousand?] two hundred forty-nine thousand two hundred hand-cubits, twenty and a half parasangs. That is to Hadir Qinnasrin [al-Hader, Syria]: four parasangs and an eighth and a quarter and an eighth of a parasang. To Tell al-Sultan «3»: four parasangs and a quarter and half a tenth of a parasang. To Tamna': five parasangs and a half and a quarter approximately. To Duwayr Sawran: three and a half parasangs approximately. To Hama: three and a half parasangs approximately. Sarmin [Sarmin, Syria]: ten: five thousand cubits, seven parasangs and two-thirds and a quarter parasang. Qalat Ja'bar [Qal'at Ja'bar, Syria] «4». Between Tell Bashir and Aintab [Gaziantep, Turkey]: four parasangs and a third of an eighth of a parasang. Between Aintab and Ra'ban [Araban, Turkey]: nine parasangs and a sixth of a tenth.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 94
  },
  {
    "serial_number": "6277935",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 97,
    "volume_number": 1,
    "text": "Between Ra'ban and Kaysun [Keysun, Turkey]: three and a half parasangs and thirteen [cubits/parts?]. Manbij [Manbij, Syria]: Circumference of the town wall nine thousand Rami [cubits?] and ... hand-cubits. The Towers: one hundred and one towers. Distance between Manbij «1» and Qalat Najm [Qalat Najm, Syria]: four and a half parasangs and three parasangs [sic]. From Manbij to Badaya: four parasangs approximately. Al-Ma'arra: circumference of its wall nine thousand cubits. [City of Shayzar] Shayzar [Shaizar, Syria]: Circumference of the Citadel wall from Burj al-Maqta (Tower of the Quarry) to the Courtyard: ten [thousand?] one hundred and fifty Qasimi cubits, two hundred hand-cubits. Length of the Courtyard: six hundred hand-cubits. From the Courtyard to the Citadel: one hundred and an eighth hand-cubits. The Citadel from corner to corner: one hundred and thirty-five hand-cubits. From Burj al-Jisr (Tower of the Bridge) to Burj al-Sakhrah (Tower of the Rock): one hundred and twenty hand-cubits. From Burj al-Sakhrah to the end of Burj al-Qata'if: three hundred hand-cubits. From Burj al-Maqta to the corner of the Citadel from the east: one thousand and twenty hand-cubits. The Citadel: individually one hundred and fifty hand-cubits. From Burj al-Qata'if to the Citadel: one hundred eight hand-cubits. Courtyard of the New Citadel Gate: one hundred and twenty hand-cubits.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 95
  },
  {
    "serial_number": "6277936",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 98,
    "volume_number": 1,
    "text": "The Northern Courtyard: under Burj al-Sakhrah one hundred and twenty cubits. Circumference of the Citadel from the north: twelve 'Su' «1» [hundred?] hand-cubits. Its circumference from the east and west: four hundred and five cubits. The Courtyard which is under the Citadel: ninety hand-cubits. City of the Romans (Madinat al-Rum): in it are one thousand twenty hand-cubits. Courtyard of the City of the Romans: five hundred 'Su' hand-cubits. The Outer City: one thousand seven hundred and fifty hand-cubits. Distance between Shayzar and Hama on the Aqaba road in the rock: two parasangs and a half and a fifth. [City of Hama] Hama [Hama, Syria]: Circumference of the wall of the Upper City from the Gate of Ibn al-Thaqafi to the Gate of al-Umyan (The Blind): three thousand seven hundred and five Qasimi cubits. Circumference of the wall of the Lower City from the Gate of al-Minshar (The Saw) to the Gate of Ibn al-Thaqafi: two thousand two hundred and five Qasimi cubits. Circumference of the Citadel wall: one thousand one hundred and eighty-five cubits. The Green Square: in it, its length is three hundred and eighty-four Qasimi, its width one hundred and thirty-eight Qasimi cubits. Distance between Hama and Homs [Homs, Syria]: ... seventy thousand and fifty Qasimi cubits, five parasangs and thirteen ... Detail of it: from the Gate of Homs to the Rastan Bridge: three hundred thousand six hundred and five 'Su' Qasimi cubits, two parasangs and a half approximately.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 96
  },
  {
    "serial_number": "6277937",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 99,
    "volume_number": 1,
    "text": "From Rastan Bridge [Rastan, Syria] to the Gate of the City of Homs known as the Gate of the Mosque: one thousand three hundred and sixty-five Qasimi cubits, two parasangs and a half and a quarter and a quarter of an eighth. [City of Homs] City of Homs: Circumference of the Citadel from inside on the walkway: nine hundred and sixty Qasimi cubits. Circumference of the outer faussebraye (fasil) of the Citadel on the walkway: one thousand six hundred and a half and a quarter Qasimi cubits. Circumference of the old City wall: nine thousand one hundred and fifty Qasimi cubits. Circumference of the new wall: ... Distance between Homs and Damascus: twenty-four and a third parasangs. [City of Damascus] City of Damascus [Damascus, Syria]: Circumference of the Citadel: nine hundred Qasimi cubits. Circumference of the City: five thousand seven hundred Qasimi cubits. Detail of it: from the corner of the Citadel from the southern side to Bab al-Jabiyah: seven hundred cubits. And to Bab al-Saghir: one thousand and fifty cubits. And to Bab Sharqi (Eastern Gate) «1»: two thousand four hundred and fifty cubits. And to Bab Tuma (Thomas Gate): one thousand one hundred cubits. And to Bab al-Salamah: one thousand one hundred and fifty cubits.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 97
  },
  {
    "serial_number": "6277938",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "The Journey of Al-Serafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 100,
    "volume_number": 1,
    "text": "From Al-Rastan Bridge to the gate of the city of Homs known as Bab Al-Jami', it measures 365 cubits, Qasimi, or two and a half farsakhs, plus a quarter and one-eighth. [City of Homs] The city of Homs, the inner circumference of the citadel along the walkway is 960 Qasimi cubits. The outer circumference of the citadel along the walkway is 1,600 and a half plus a quarter Qasimi cubits. The circumference of the old city wall is 9,150 Qasimi cubits. The circumference of the renewed wall … The distance between Homs and Damascus is 24 and one-third farsakhs. [City of Damascus] The city of Damascus, the circumference of the citadel is 900 Qasimi cubits. The circumference of the city is 5,700 Qasimi cubits, detailed as follows: from the corner of the citadel on the northern side to Bab Al-Jabiya, 700 cubits; to Bab Al-Saghir, 1,050 cubits; to Bab Sharqi, 2,450 cubits; to Bab Touma, 1,100 cubits; and to Bab Al-Salama, 1,150 cubits.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 98
  },
  {
    "serial_number": "6277939",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 101,
    "volume_number": 1,
    "text": "and to Bab al-Faradis is four hundred and fifty cubits. And to Bab al-Faraj is seven hundred cubits. The Mosque: Length is two hundred and eighty-eight cubits, Width is one hundred and eighty cubits, Height of the Eagle (Al-Nasr - dome) is ninety cubits. Maydan al-Hasa (Pebble Square): Length is six hundred and fifty-three cubits and a half and an eighth Qasimi (cubits), Width is two hundred and fourteen cubits and a half and a quarter and an eighth Qasimi. The Large Green Square (Al-Maydan al-Akhdar al-Kabir): Length is eight hundred and sixty-nine cubits and a half and a quarter Qasimi, Width is two hundred and forty cubits and a half Qasimi. The Small Green Square (Al-Maydan al-Akhdar al-Saghir): Its length is six hundred and eighty cubits and a half and an eighth Qasimi, its width is two hundred and fifty-three cubits and a half and an eighth Qasimi. The height of the Dome of the Eagle is ninety-three Qasimi cubits. The distance between Darayya and Damascus is ten thousand (1) and five hundred Qasimi cubits. The distance between Damascus and Homs is twenty-four parasangs and a third. Its details: from Bab Tuma to opposite Harasta is six thousand eight hundred Qasimi cubits, and to Funduq al-Qusayr is sixteen thousand two hundred cubits, a parasang and a third and a sixth of a tenth. And to Nahr Yazid, the junction of the Qutayfah road from the main road, is approximately three parasangs.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 99
  },
  {
    "serial_number": "6277940",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 102,
    "volume_number": 1,
    "text": "And to Hubb al-Qastal (1) is approximately four parasangs. And to Nahr al-Nabk is a parasang and a half and a third. And to Khan Baqara (2) is two parasangs and an eighth of a tenth. And to Burj al-Ghasulah is four parasangs and a half and a quarter. And to Khirbat al-Qibli is approximately two parasangs. And to Shamsin ... one thousand three hundred Qasimi cubits. And to Kafarya is two parasangs and a third. And to Homs is a parasang and a sixth.\n[City of Baniyas]\nThe distance between Baniyas and Damascus is ten parasangs and a half and a tenth. Baniyas: Circumference of the Citadel is five hundred and sixty cubits by hand, the City is one thousand seven hundred and ten cubits by hand. The distance between Damascus and Salkhad (Sarkhad) (3) is twenty parasangs and a quarter and a sixth of a tenth via the Hit road. And via Zara is twenty-two parasangs and a third and an eighth. The Citadel of Salkhad is six hundred and twenty-five cubits. Circumference of the Fasl (outer wall/barrier) is seven hundred and sixty-nine cubits. Circumference of the large pool in it is seven hundred and sixty cubits, the small one, east of it, is six hundred and fifty cubits.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 100
  },
  {
    "serial_number": "6277941",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 103,
    "volume_number": 1,
    "text": "The distance between Damascus and Bosra: to Al-Kiswah (1) is thirty-four thousand six hundred and eight cubits, two parasangs and a third and half a tenth; and to Al-Hubb (2) is a parasang and three-tenths; and to Al-Sanamayn (3) is two parasangs and a half and a quarter. And to (Al-Qa'a) (4) is two parasangs and a third and a quarter. And to Al-Fawwar (5) is four parasangs and a sixth. And to Bosra is eight parasangs and a fifth and a sixth of a tenth.\n[City of Bosra]\nCity of Bosra: Circumference of the Citadel is seven hundred and thirty cubits by hand, six towers. The pool of the Citadel is fifty-eight cubits and a half. The pool which is in the water vault, i.e., the eastern one, its length is sixty-five cubits, its width thirteen cubits. The western vault is like the eastern one, except for the outer pool outside the Citadel, its length from west to east is three hundred and twenty cubits, and from south to north two hundred and fifty cubits, its circumference is one thousand one hundred and forty-two cubits. Also in the courtyard are three springs, and [in] the ditch another spring.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 101
  },
  {
    "serial_number": "6277942",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 104,
    "volume_number": 1,
    "text": "Amman [Amman, Jordan]: The Citadel of Amman, its circumference is two thousand two hundred and eighty-three cubits by hand.\nBaalbek [Baalbek, Lebanon]: Baalbek, circumference of the city is seven thousand nine hundred and forty cubits by hand. The Green Square is six hundred cubits by hand, its width is one hundred and sixty-one cubits by hand. The distance between Baalbek and Damascus is twelve parasangs and a quarter and a sixth of a tenth. From Damascus to Al-Zabadani is six parasangs and a sixth and a sixth of a tenth. And to Baalbek is six parasangs and a quarter.\n[Jazirat Ibn Umar]\nThe Jaziran Lands (Al-Jazira / Upper Mesopotamia)\nEdessa (Al-Ruhā) [Şanlıurfa, Turkey]: Circumference of the Inner Citadel is four hundred and sixty cubits. Its towers: fourteen cubits, its towers are seven. The Outer Citadel is six hundred and seventy cubits, its towers are sixteen. Circumference of the center of Edessa is one hundred and eighty-five cubits. The area between the Citadel of Al-Sinn and Edessa is four parasangs and a half and a third and a quarter of a tenth. Between Edessa and Seruj [Suruç, Turkey] is six parasangs, an eighth and half a sixth.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 102
  },
  {
    "serial_number": "6277943",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 105,
    "volume_number": 1,
    "text": "Between Seruj and Qal'at Najm [Qal'at Najm, Syria] is a tenth, ninety-five thousand cubits, seven parasangs and two-thirds and a quarter of a parasang.\n[Harran]\nHarran [Harran, Turkey]: Circumference of its wall is seven thousand six hundred and twelve cubits, one hundred and eighty-seven towers. Circumference of the Citadel is five hundred and twenty-eight cubits.\nAl-Raqqah [Raqqa, Syria]: Circumference of its wall is nine thousand and thirty-three cubits, one hundred and thirty-two towers.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 103
  },
  {
    "serial_number": "6277944",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 107,
    "volume_number": 1,
    "text": "Appendix (1) - 1",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 104
  },
  {
    "serial_number": "6277945",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 109,
    "volume_number": 1,
    "text": "After this is a sea whose depth cannot be realized and whose width cannot be measured; ships traverse it with good wind in two months. There is also no sea among the seas outside the Ocean larger than it nor more severe in terrors. In its width are the lands of Waq Waq and plantations of reeds and bamboo. In it also are wonders and fish, the length of a fish among them is four hundred cubits, more or less. This fish is called Al-Wal (Whale). In it is a small fish the size of a cubit; if this large fish tyrannizes and transgresses and harms the beasts of the sea and its ships, this small fish is empowered over it, so it lodges in its ear and does not leave it until it kills it. Perhaps the large one does not approach the ship out of fear of the small one. In it is a fish whose face resembles the face of a human that appears on the water. In it are flying fish that fly at night and roam in the wilderness; when it is before sunrise, they return to the water. In it is a fish with whose bile writing is written and read at night. In it is a green fatty fish; whoever eats from it is protected from food for many days, not needing it. In it is a fish that has two horns as if they are the two horns of a crab; it is the one that throws fire at night. In it is a round fish called Al-Mash, upon its back is like a pillar, sharp-headed; no fish in the sea can stand against it because it meets it with this horn and kills it. Perhaps it meets ships with it and splits them. Its horn is yellow like gold, variegated; it is said it is a type of onyx. In it is a fish called Mulabban, from its head to its chest is like a shield with eyes by which it looks, and the rest of it is long like a snake, about twenty cubits long. It has many legs like the teeth of a saw from its chest to its tail. It does not...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 105
  },
  {
    "serial_number": "6277946",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 110,
    "volume_number": 1,
    "text": "...see anything but destroys it, and its tail does not wrap around anything but destroys it with it. It is said that its flesh cures all pains, but it is rarely found. In this sea is much ambergris. Another sea is called Al-Kind; in it are many islands and in it are fish upon whose backs grass and shells might grow. Perhaps the people of ships anchor on them thinking they are an island, then when they realize, they depart from them. Perhaps this fish spreads one of its fins which is in its backbone so it becomes like a sail. Perhaps it raises its head from the water so it becomes like a huge mountain. Perhaps it blows water so it becomes like a huge mountain. Perhaps it blows water from its mouth into the air so it becomes like a huge minaret. If the sea calms, it drags fish with its tail then opens its mouth so the fish descend into its throat as if plunging into a well. It is called Al-'Andar, and its length is three hundred cubits. The people of ships fear it and perhaps strike bells at night for fear that it leans on the ship and drowns it. In it are huge snakes that go out to the land and swallow elephants, then wrap around rocks on the land and break their bones inside their bellies so a terrifying sound is heard from them. In it is a snake called Al-Malik (The King) that does not feed except once a year. Perhaps the kings of Zanj use a stratagem against it, take it, cook it until its grease comes out, and oil themselves with it, so it increases their strength and vigor. This snake has fur; if a person with tuberculosis sits on its skin, he is safe from tuberculosis and cured so it never afflicts him again. Perhaps it fell into the hands of the kings of India so they used its skin and it was in their treasuries. The wind of this sea is from its bottom, and perhaps its agitation casts fire with intense light.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 106
  },
  {
    "serial_number": "6277947",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 111,
    "volume_number": 1,
    "text": "[Chapter on Mention of the Fourth Sea] It is said that it is called Wanjal. Between it and the Sea of Kind are many islands said to be a thousand and nine hundred islands. Among these islands falls much ambergris, a piece of it being like a house. This is ambergris that grows at the bottom of the sea; when the agitation of the sea intensifies, it uproots it from its bottom and casts it, so it rises on the water like cotton plants, and it is blameworthy ambergris. I read in the Book of Perfume (Kitab al-Tib) authored by Ibrahim ibn al-Mahdi that Ahmad ibn Hafs al-Attar said: I was in the assembly of Abu Ishaq while he was straining ambergris he had melted and extracting what was in it of grass which resembles in its creation the beaks of birds. He asked me about that, so I said: These are the beaks of birds that eat ambergris when beasts excrete it. Abu Ishaq laughed and said: This is a saying the common people say. God did not create a beast that excretes ambergris; ambergris is only something that is at the bottom of the sea. Al-Rashid was concerned with asking about that and ordered Hammad al-Barbari to investigate that. A group from Aden Abyan wrote to him that it comes out of springs in the land of the sea, then the wind uproots it with waves so it floats on the water, and the wind throws it onto the land, just as bitumen (Qar) comes out in the land of Hit and Roman pitch (Zift) in the land of the Romans. The last of the islands of this sea is Serendib [Sri Lanka]. Serendib is in the Sea of Kind and is the head of all these islands. In Serendib are most of the pearl diving places and gem plants. In the Sea of Serendib are routes between two mountains which are paths for one wanting the lands of China. In the mountains of this sea are mines of gold and silver and pearl diving places. In them are wild cows and various creatures. One travels from this sea to the lands of the Maharaja. Perhaps clouds shade this sea so that neither day nor night is clear...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 107
  },
  {
    "serial_number": "6277948",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 112,
    "volume_number": 1,
    "text": "...and rain does not cease from it, nor do its whales or beasts appear. One exits from it to the Sea of Sanf (Champa?), where the Aloeswood tree and others are found. It has no known limit; its head comes out from near the northern darkness and passes to the lands of Waq Waq as well. In it is the King of the Islands who is called Al-Mahra. He has islands and provinces whose number cannot be counted. If a ship of the sea wanted to tour his islands, it would not tour them in several years. It is a sea whose wonders cannot be counted. Its king has of all good spices Camphor, Ambergris, Cloves, Sandalwood, Nutmeg, Mace, Cardamom, and Aloeswood. No king of the kings has what the king of this sea has of varieties of perfume.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 108
  },
  {
    "serial_number": "6277949",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 113,
    "volume_number": 1,
    "text": "Appendix (1) - 2",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 109
  },
  {
    "serial_number": "6277950",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 115,
    "volume_number": 1,
    "text": "We mentioned previously in this book summaries of the arrangement of connected and separated seas. We mention in this chapter summaries of the news of what reached us from the Abyssinian Sea, the kingdoms and kings, summaries of their arrangement, and other types of wonders. We say that the Sea of China, India, Fars (Persia), and Yemen have connected waters, not separated, as we mentioned, except that their agitation and stillness differ due to the difference of the blowing of their winds and the time of their eruption and other things. The Sea of Fars increases in waves and becomes difficult to sail when the Sea of India is soft, sailing in it is straightforward, and its waves are few. The Sea of Fars softens, its waves decrease, and sailing it becomes easy when the Sea of India is agitated, its waves turbulent, dark, and difficult to sail. The beginning of the difficulty of the Sea of Fars is upon the sun entering Virgo and the approach of the Autumnal Equinox; it continues like that, its waves increasing every day until the sun reaches the sign of Pisces. The severest it gets is at the end of Autumn when the sun is in Sagittarius. Then it softens until the sun returns to Virgo. The last of that is at the end of Spring when the sun is in Gemini. The Sea of India continues like that until the sun returns to Virgo, so it is sailed then; the calmest it gets is when the sun is in Sagittarius. The Sea of Fars is sailed the rest of the year from Oman to Siraf [Bandar Siraf, Iran], which is one hundred and sixty parasangs, and from Siraf to Basra [Iraq], one hundred and forty parasangs. Sailing it does not go beyond what we mentioned of these two places and their likes.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 110
  },
  {
    "serial_number": "6277951",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 116,
    "volume_number": 1,
    "text": "Abu Ma'shar the Astronomer recounted in his book titled \"The Great Introduction to the Science of Astronomy\" what we mentioned of the turbulence of these seas and their calmness when the sun is in what we mentioned of the signs. The Sea of India is hardly crossed from Oman in Tir Mah (July) except by a reckless ship with light load. These ships are called in Oman, if they cross to the land of India at this time, Al-Tir-Mahiyah. That is because the lands of India and the Sea of India are in ease, which is winter and continuous rain in Kanun (December/January); Kanun and Shubat (February) with us are summer and with them winter, just as with us the heat is in Haziran (June), Tammuz (July), and Ab (August). So our winter is their summer, and their summer is our winter. Likewise the rest of the cities of India and Sindh and what is connected to that to the furthest parts of this sea. Whoever winters in our summer in the land of India, it is said 'So-and-so yusirr (winters/eases?) in the land of India', meaning he wintered there. That is due to the nearness of the sun and its farness. Pearl diving in the Sea of Fars is only from the beginning of Nisan (April) to the end of Aylul (September); other than that of the months of the year, there is no diving. We have covered in what preceded of our books the rest of the diving places in this sea, as seas other than it have no pearls in them; it is specific to the Abyssinian Sea from the lands of Kharg [Kharg Island, Iran], Qatar [Qatar], Oman [Oman], Serendib [Sri Lanka], and others of this sea. We mentioned how pearls are formed and people's dispute over that, those among them who held that it is from rain, and those among them who held it is from something else. And the foolishness of the pearl oyster, the old of it and the new called Mahhar and known as Bulbul. And the flesh in the shell and the fat, which is an animal that fears for what is in it of pearls and gems from the divers like a mother's fear for her child. We have covered the mention of the method of diving, and that the divers hardly...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 111
  },
  {
    "serial_number": "6277952",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 117,
    "volume_number": 1,
    "text": "...eat any meats except fish and dates, no other sustenance. And what afflicts them of slitting the bases of their ears for breath to exit from there instead of the nostrils, because they put something of tortoiseshell (Dhabl) on the nostrils - which are the backs of sea turtles from which combs are made - or from horn which pinches them like a arrowhead (Mashqas), not from wood. Cotton with some oil is put in their ears; some of that oil is squeezed out at the bottom of the water, illuminating the sea for them with a clear light. And what they paint their feet and legs with of blackness, for fear of sea beasts swallowing them and their aversion to blackness. And the shouting of divers at the bottom of the sea like dogs, and sound piercing the water so they hear each other's shouting. Divers and the diver have wondrous news. And regarding pearls and its animal, we have covered descriptions of that and the qualities of pearls, their signs, prices, and weight measures in what preceded of our books. The beginning of this sea adjacent to Basra, Al-Ubullah, and Bahrain is from the Planks (Khashabat) of Basra. Then the Sea of Larwi, and upon it are the lands of Saymur (Chaul?), its times [?], Sopara, Thane, Sindan, Cambay, and others of India and Sindh. Then the Sea of Harkand. Then the Sea of Kalah Bar, which is the Sea of Kalah and the Islands. Then the Sea of Kardanj. Then the Sea of Sanf, to which Sanfi Aloeswood is attributed and to its lands. Then the Sea of China, which is the Sea of Sanji, after which there is no sea. The beginning of the Sea of Fars, as we mentioned, is the Planks of Basra and the place known as Al-Kankala, which are signs set up of wood in the sea, trellised signs for ships to Oman. The distance is three hundred parasangs. Upon that is the coast of Fars and the lands of Bahrain. From Oman - and its capital is called Sinjar (Suhar?), and the Persians call it Marun (Mazun?) -...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 112
  },
  {
    "serial_number": "6277953",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 118,
    "volume_number": 1,
    "text": "...to Muscat [Muscat, Oman], which is a village of it where ship masters draw water from sweet wells there, is fifty parasangs. From Muscat to Ras al-Jumjumah [Ras al-Hadd?] is fifty parasangs. This is the end of the Sea of Fars, and its length is four hundred parasangs; this is the determination of sailors and ship masters. Ras al-Jumjumah is a mountain connected to the lands of Yemen from the land of Shihr [Ash Shihr, Yemen] and Al-Ahqaf. The sand of it is under the sea; its end in the water is not known where it terminates, I mean the mountain known as Ras al-Jumjumah. When what we described of the mountain is on land and some under the sea, it is called in the Roman Sea (Mediterranean) 'Al-Safalah' (The Shoal/Shelf). From that Safalah in the place known as the coast of Seleucia of the land of the Romans and its connection under the sea is towards the island of Cyprus. Upon it is the damage of most Roman ships and their destruction. We only express in the language of the people of every sea and what they use in their speech in what they know among themselves. From Ras al-Jumjumah ships launch to the Second Sea. From the Sea of Fars, which is known as Larwi, its bottom cannot be realized, nor can the multitude of its ends be counted, nor its limits controlled due to the abundance of its water and the vastness of its space. Many sailors claim that description cannot encompass its regions due to what we mentioned of its branching. Ships traverse it in two months, three, and in a month, according to the blowing of winds and safety. There is not in these seas, meaning what the Abyssinian Sea included, larger than this Sea of Larwi nor more severe. In its width is the Sea of Zanj and their lands. The ambergris of this sea is little. That is because ambergris mostly falls to the lands of Zanj and the coast of Shihr from...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 113
  },
  {
    "serial_number": "6277954",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 119,
    "volume_number": 1,
    "text": "...the land of the Arabs. The people of Shihr are people from Quda'a bin Malik bin Himyar and others of the Arabs. Those who inhabit this land of the Arabs are called Al-Mahrah [Mahra], people of hair and manes. Their language is contrary to the language of the Arabs; that is, they make Shin instead of Kaf. An example of that is their saying: 'Hal lash fima qultu li wa qultu lash an taj'ali alladhi ma'i fi alladhi ma'ash' (Do you have [an interest] in what I said to me [sic] and I said to you to put what is with me in what is with you), and other such speech and anecdotes of their talk. They are people of poverty and need. They have thoroughbred camels (Nujub) they ride at night known as the Mahrah Nujub; they resemble in speed the Beja Nujub, or rather according to a group they are faster than them. They travel on them on the coast of their sea. If these Nujub sense ambergris has been cast by the sea, they kneel on it, having been trained for that and accustomed to it, so the rider takes it. The best ambergris is what falls to this region and to the islands of Zanj and its coast. It is the round blue rare one like ostrich eggs or less than that. Among it is what the whale known as Al-Awal (Al-Wal/Whale), mentioned previously, swallows. That is because when the sea's agitation intensifies, it casts ambergris from its bottom like pieces of mountains or smaller as we described. If this whale swallows ambergris, it kills it, so it floats on the water. Therefore, people from Zanj and others watch for it in boats. They throw hooks and ropes into it, slit its belly, and extract the ambergris from it. What comes out of its belly is thick and perfumers in Iraq and Fars know it as Al-Nadd. What touched the back of the whale from it is pure and good according to its stay in the whale's belly. Between the Third Sea which is Harkand and the Second Sea which is Larwi as mentioned are many islands which are a separation between these two seas. It is said they are about...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 114
  },
  {
    "serial_number": "6277955",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi (Al-Sirafi's Journey)",
    "edition": "None",
    "publisher": "Al-Majma' al-Thaqafi, Abu Dhabi",
    "page_number": 120,
    "volume_number": 1,
    "text": "...two thousand islands, and in the saying of the verifier one thousand nine hundred islands, all populated with people. The queen of all these islands is a woman; their custom has run like that from ancient times that no man rules them. Ambergris is found in these islands cast by the sea, and is found in its sea as large as pieces of rock can be. More than one of the Sirafi and Omani shipmasters in Oman and Siraf and other merchants who used to frequent these islands told me that ambergris grows at the bottom of this sea. It forms like the formation of types of mushrooms, white and black, truffles, and morels and the like. When the sea becomes malignant and intense, it casts from its bottom rocks, stones, and pieces of ambergris. The people of all these islands are united in word; numbers cannot count them due to their abundance, nor can the armies of this female ruler over them be counted. Between island and island is about a mile, a parasang, two parasangs, and three. Their palm trees are coconut palms; they do not miss anything from the palm tree except dates. Some people who concerned themselves with animal breeding and tree grafting claimed that this coconut is the Doum Palm (Muql), but the soil of India influenced it when it was planted there so it became coconut, while it is only the Doum Palm. We have mentioned in our book titled 'Book of Issues and Experiments' what every spot of the earth's spots and its air influences in its animals, speaking and others, and what spots influence in growing plants that are not growing [sic] like the donkey [? likely corruption, maybe referring to plants/animals]. Like the influence of the land of the Turks on their faces and the smallness of their eyes until that influenced their camels (jamal/jamalahum?), so their legs shortened, their necks thickened, and their fur whitened. And the land of Yajuj and Majuj (Gog and Magog) in their forms and other...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 115
  },
  {
    "serial_number": "6277956",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 121,
    "volume_number": 1,
    "text": "That is something that, if a person of knowledge investigates the inhabitants of the earth from the East and the West, he will find it as we mentioned. There is not found in the islands of the sea anyone with finer craftsmanship than the people of these islands in all trades and crafts, in clothes, tools, and other things. The treasuries of this queen are cowrie shells (Wada'), for the cowrie shell contains a type of animal. If her wealth decreases, she orders the people of these islands, and they cut palm branches of the coconut with their leaves and cast them on the face of the water. That animal piles up on them, then it is collected and cast upon the sand of the coast. The sun burns the animal inside it, and the cowrie shell remains empty of what was in it, and the treasuries are filled with that. All these islands are known as Al-Dabajat [Maldives/Laccadives], and from them, most of the Naranj—which is the coconut—is carried. The last of these islands is the Island of Sarandib [Sri Lanka]. Following Sarandib are other islands, about one thousand parasangs, known as Al-Ramni [Sumatra, Indonesia]; they are inhabited and have kings and many gold mines. Following them is the land of Fudur [Pansur/Barus, Sumatra], and to it, the Fuduri Camphor is attributed. In the year in which there are many thunderbolts, lightning, tremors, upheavals, and earthquakes, the camphor is abundant in it; and if that is little, its existence decreases. The food of most of those we mentioned in these islands is coconut. From these islands, Brazilwood (Baqqam), bamboo (Khayzuran), and gold are carried. Their elephants are many, and among them are those who eat human flesh. These islands connect to the Islands of Al-Najmalus [Nicobar Islands]. They are strange nations, naked; they come out in boats when ships pass by them carrying ambergris...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 116
  },
  {
    "serial_number": "6277957",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 122,
    "volume_number": 1,
    "text": "...and coconut and other things. They barter with iron and some clothes, and they do not sell that for dirhams or dinars. Following them are islands called Abraman [Andaman Islands], in which are black people of strange forms and appearances, with peppercorn hair. The foot of one of them is larger than a cubit. They have no boats. If a shipwrecked person from those broken in the sea falls to them, they eat him. Likewise is their action with ships if they fall to them. A group of Nakhudas (shipmasters) mentioned to me that they sometimes saw in this sea white clouds, small pieces, from which a long white tongue exits until it connects to the sea water. When it connects to it, the sea boils because of that, and great tornadoes (waterspouts) rise from it; no tornado from them passes by anything without destroying it. Following that, they rain a rain smelling of fish (Zahak), containing types of filth from the sea. As for the Fourth Sea, it is Kalah Bar [Kedah, Malaysia] according to what we mentioned, and the explanation of that is the Sea of Kalah. It is a sea with little water (shallow), and if the sea water is little, its calamities are more and its malice is more severe. It has many islands and 'Sara'ir'—singular is 'Sarr'—for the people of the ships call what is between the two gulfs, if their path is in it, 'Al-Sarr'. This sea has types of strange islands and mountains; our purpose is only to hint at flashes of news about them, not to elaborate. Likewise, the Fifth Sea known as Kardanj [Gulf of Thailand/South China Sea] has many mountains and islands; in it are camphor and camphor water. It has little water (shallow) and much rain, hardly ever free of it. In it are races of nations; among them is a race called the Fanjab, their hair is peppercorn-like and their forms are strange. They appear in boats; they have small [boats] for the ships when they pass by them, and they shoot a type of strange arrow that has been soaked in poison. Between this nation and the land of Kalah [Kedah] are mines of white lead (tin)...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 117
  },
  {
    "serial_number": "6277958",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 123,
    "volume_number": 1,
    "text": "...and mountains of silver. In it also are gold mines and lead that can hardly be distinguished. Then follows the Sea of Sanf [Champa/Vietnam] according to what we arranged previously. In it is the Kingdom of the Maharaja [Srivijaya], the King of the Islands. His kingdom cannot be defined due to its multitude, nor can his soldiers be counted. No one among people can tour his islands in the fastest of ships in two years. This king possesses types of spices and perfumes. No other king possesses what he has or what is exported from his lands. From his land are carried camphor, aloeswood, cloves, sandalwood, nutmeg, mace, cardamom, cubeb, and other things which we have not mentioned. His islands connect to a sea whose limit cannot be realized and whose end is not known, and it is adjacent to the Sea of China. In the extremities of his islands are many mountains in which are people with pierced ears, white faces like shields hammered out. They shear their hair as hair is sheared from a skin, in layers. Fire appears from their mountains by night and day; its day is red fire, and by night it turns black and reaches the clouds of the sky in its height and its going into the atmosphere, throwing out the most severe sounds of thunder and thunderbolts. Perhaps a strange, terrifying sound appears from it warning of the death of their king, and perhaps it is lower than that, warning of the death of some of their leaders. It has become known what that warns of due to the length of customs and experiences over ancient time, and that does not vary. This is one of the great wonders of the earth. Following it is the island from which is heard at all times the sounds of drums, oboes (Surnay), lutes, and all other types of delightful musical instruments. The rhythm of dancing and clapping is heard, and whoever hears that can distinguish between the sound of every type of delightful musical instrument and others.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 118
  },
  {
    "serial_number": "6277959",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 124,
    "volume_number": 1,
    "text": "The sailors among those who passed by those lands claim that the Dajjal (Antichrist) is in that island. In the Kingdom of the Maharaja is the Island of Sarira [Sumatra/Java?]; its distance in the sea is about four hundred parasangs, and its habitations are continuous. He has the islands of Al-Ranj and Al-Rami and others which cannot be fully mentioned among his islands and his kingdom. He is the master of the Sixth Sea, which is the Sea of Sanf. Then the Seventh Sea, which is the Sea of China [China] according to what we arranged previously. It is known as the Sea of Sanji. It is a malicious sea with many waves and 'Khabb'—and the explanation of Khabb is great severity in the sea. We only report the expression of the people of every sea and what they use in their speech. In it are many mountains (reefs/islands) between which ships must pass. That is because when the sea's Khabb becomes great and its waves numerous, black figures appear from it; the height of one of them is about five spans or four, as if they are the children of the Abyssinians, small, of one shape and one size. They climb onto the ships, and their climbing is frequent without harm. When people witness that, they become certain of the severity, for their appearance is a sign of the Khabb (storm), so they prepare for that—some afflicted and some safe. When that happens, perhaps the safe one sees—among them at the top of the mast (Daqal), and the masters of ships in the Sea of China and elsewhere call it Daqal, and the men of the Roman Sea [Mediterranean] call it Sari—something in the image of a bird, kindling and glowing. The onlooker among them cannot look at it fully nor perceive how it is. If it settles on the top of the mast, they see the sea calm down, the waves become small, and the Khabb subside. Then that light vanishes, and it is not known how it came or how it went. That is the sign of salvation and the proof of rescue. What we mentioned is not denied by the people of the ships and the merchants from the people of Basra [Basra, Iraq], Siraf [Bandar Siraf, Iran], and Oman [Oman]...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 119
  },
  {
    "serial_number": "6277960",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 125,
    "volume_number": 1,
    "text": "...and others who have traversed these seas. What we mentioned from them is possible, not impossible, nor obligatory, since it is permissible within the power of the Creator, Mighty and Majestic, to save His servants from destruction and rescue them from tribulation. In this sea is a type of crab that comes out of the sea like a cubit, a span, smaller than that, or larger. When it leaves the water with a quick movement and gets on the land, it becomes stone, and the animal nature departs from it. Those stones enter into eye kohls and medicines, and its matter is also well-known. After the land of China towards the sea, there are no known kingdoms or described lands except the land of Al-Sila [Silla/Korea] and its islands. No one from the strangers from Iraq or elsewhere reached it and left it, due to the health of its air, the thinness (purity) of its water, the goodness of its soil, and the abundance of its good things, except for rare people. Its people are in a truce with the people of China and its kings, and gifts from them hardly cease. It has been said that they are a tribe from the children of Amur who settled there according to what we mentioned about the settlement of the people of China in their lands. China has large rivers like the Tigris and the Euphrates flowing from the lands of the Turk [Turkic lands], Tibet [Tibet], and Al-Sogd [Sogdia], who are between Bukhara [Bukhara, Uzbekistan] and Samarkand [Samarkand, Uzbekistan]. There are the mountains of Nushadir (Sal Ammoniac). If it is summer, you see fires at night rising from those mountains from about one hundred parasangs. By day, smoke appears from them, overcome by the rays of the sun, its light, and the light of day. From there Nushadir is carried. If it is the beginning of winter, whoever wants from the land of Khorasan to travel to the land of China goes to what is there. There is a valley between those mountains whose length is forty miles or fifty miles. He comes to people there at the mouth of the valley and encourages them with a precious wage, so they carry what is with him...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 120
  },
  {
    "serial_number": "6277961",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 126,
    "volume_number": 1,
    "text": "...on their shoulders. In their hands are sticks with which they beat his sides for fear that he might freeze and stop, then die from the distress of the valley. He runs in front of them until they exit to that head of the valley. There are forests and swamps belonging to it, so they throw themselves into that water because of the severity of the distress and the heat of the Nushadir that has afflicted them. No animals travel that road because the Nushadir flares up as fire in the summer, so no caller or answerer travels that valley. When it is winter and snows and moisture are abundant, that falls on the place and extinguishes the heat of the Nushadir and its flame. People then travel that valley. Animals have no patience for what we mentioned of its heat. Likewise, whoever arrives from the land of China, the beating is done to him just as is done to the passerby. The distance between the land of Khorasan [Khorasan] at the place we mentioned to the land of China is about forty days between inhabited and uninhabited lands, soft ground, and sands. In other than this road which animals travel, it is about four months, except that it is under the protection of types of Turks. I saw in Balkh [Balkh, Afghanistan] a handsome sheikh of opinion and understanding who had entered China many times and never rode the sea. I saw a number of people who traveled from the land of Al-Sogd over the mountains of Nushadir to the land of Tibet and China in the land of Khorasan. The land of India is connected to the land of Khorasan and Al-Sindh [Sindh, Pakistan] adjacent to Al-Mansura [Mansura, Pakistan] and Al-Multan [Multan, Pakistan]. Caravans are continuous from Al-Sindh to Khorasan, and likewise to India, until these lands connect to the land of Zabilistan [Zabulistan].",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 121
  },
  {
    "serial_number": "6277962",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 127,
    "volume_number": 1,
    "text": "General Index of Proper Names, Countries, and Scientific and Cultural Terms",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 122
  },
  {
    "serial_number": "6277963",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 129,
    "volume_number": 1,
    "text": "Ajur (Brick): 49. Adam: 19. Al-Ibil (Camels): 36, 39. Al-Abnus (Ebony): 66, 89. Abwab al-Sin (Gates of China): 92. Al-Utrujj (Citron): 32. Al-Ajjass (Plum): 32. Ihraq Ahl al-Hind anfusahum (Burning of the people of India of themselves): 78. Adqal (Masts): 86. Al-Adilla' (Guides): 56. Arbab al-Marakib (Masters of Ships): 56. Al-Aruz (Rice): 32, 33, 83, 78. Aristutalis (Aristotle): 87. Ard al-Arab (Land of the Arabs): 68. Al-Asad (Lion): 50. Banu Isra'il (Children of Israel): 62, 77. Al-Iskandar (Alexander): 75, 78. Al-Asmanjuni (Sky Blue/Lapis Lazuli): 19. Al-Aswaq (Markets): 64, 78. Al-Asnam (Idols): 49. Al-Afawiya (Spices): 66. Al-Afwah (Spices/Fragrances): 89. Aqbiya (Tunics): 51, 59. Al-Aqras (Tablets/Discs): 92. Al-Akasira (Chosroes/Sassanids): 55. Anabib (Pipes/Tubes): 77. Al-Anbiya' (Prophets): 62, 63. Al-Anjudhana (Asafoetida seed?): 91. Andaman: 21. Ahl al-Sahil (People of the Coast): 79, 80. Ahl al-Sina'at (People of Crafts): 83. Ahl al-Sin (People of China): 60. Al-Anhar (Rivers): 51. Al-Iyarijat (Purgatives): 87. Bashu: 54. Al-Bal (Whale): 90. Al-Babaghawat (Parrots): 89. Batuma: 28. Al-Bihar (Seas): 55. Bahr al-Rum (Sea of the Romans/Mediterranean): 65. Bahr al-Sham (Sea of Syria): 64, 65. Bahr al-Sin (Sea of China): 64, 65. Bahr Aden (Sea of Aden): 65. Bahr al-Qulzum (Sea of Al-Qulzum/Red Sea): 65, 89. Bahr al-Hind (Sea of India): 64, 65, 89. Al-Bahrain: 91, 92.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 123
  },
  {
    "serial_number": "6277964",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 130,
    "volume_number": 1,
    "text": "Al-Bahriyyun (Sailors): 39. Al-Budd (Buddha/Idol): 84. Al-Badadah (Buddhist Monks): 49, 50. Al-Barrani (Outer): 75. Al-Barahima (Brahmins): 83. Barbara [Berbera]: 89. Al-Barbar (Berbers): 88. Buzah (Falcons): 92. Al-Busad (Coral): 94. Al-Basra [Basra]: 24, 63, 67, 90, 93. Al-Batikh (Melon): 32. Bighal al-Barid (Postal Mules): 63, 77. Al-Baghbun: 44. Al-Baqar (Cattle): 36. Al-Baqqam (Brazilwood): 20, 66, 89. Bilad al-Arab (Land of the Arabs): 59. Balhara: 34, 35, 78. Bamdhu: 55, 75. Al-Banna: 81. Banat Na'sh (Ursa Major): 23. Banu Kawan: 30. Al-Buq (Trumpet): 20, 38. Bayt al-Mal (Treasury): 57, 58. Bayt Nubuwwat al-Arab (House of Arab Prophethood): 61. Al-Bikarjiyyin: 84. Buyut (Houses): 58. Al-Tajir (The Merchant): 80. Al-Tajir al-Khurasani (The Khorasani Merchant): 72, 73. Tayu: 45. Al-Tababi'a (Tubba' Kings): 88. Tibet: 52, 55, 75, 76. Al-Tibr (Gold/Silver Dust): 35. Tujjar al-Arab (Arab Merchants): 54. Al-Tarjuman (Translator): 61, 62, 63. Al-Turk (Turks): 51, 55, 65. Al-Tuffah (Apple): 32. Al-Tamr (Dates): 86. Banu Tamim: 77. Al-Tanasukh (Reincarnation): 50, 55. Al-Tut (Mulberry): 54. Al-Tin (Fig): 32. Tha'lab (Fox): 92. Thallaj: 67. Thanawiyya (Dualists): 81. Thiyab (Clothes). Thawb al-Harir (Silk Garment): 59, 60.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 124
  },
  {
    "serial_number": "6277965",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 131,
    "volume_number": 1,
    "text": "Al-Thiyab al-Sumr (Sable Clothes?): 36. Al-Jadim: 68. Al-Jar [Al-Jar]: 88. Ja'iza (Prize): 63. Jabal Qaf (Mount Qaf): 15. Jabal al-Nar (Mountain of Fire/Volcano): 31. Al-Jatra (Parasol): 93. Jaddar: 71. Jeddah [Jeddah]: 88, 89. Al-Jarbi: 80. Jaras (Bell): 42, 43. Jurhum: 88. Al-Jaza'ir (Islands): 85. Al-Jazar (Carrots/Islands?): 34, 35, 65, 67. Juzur al-Hind (Islands of India): 28. Jazirat Ibn Kawan (Island of Ibn Kawan): 25. Jizya (Poll Tax): 42. Julud al-Namir (Leopard Skins): 88. Al-Jalluz (Hazelnut): 32. Al-Julaydiyyah: 79. Al-Jamajim (Skulls): 42, 84. Jannaba [Genaba]: 50. Junud (Soldiers): 51. Al-Jihaz (Merchandise/Equipment): 53, 83. Al-Jawz (Walnut): 32. Al-Jawzbu (Nutmeg): 89. Al-Jawhar (Gem): 81, 92, 93. Al-Habasha (Abyssinia): 88. Habl (Rope): 39. Abu Hubaysh: 15. Hajar al-Adwiyah (Medicine Stone): 45. Al-Hadid (Iron): 27. Al-Haramat (Rice Nurseries): 83. Harashat (Insects/Reptiles): 89. Al-Harir (Silk): 31, 32, 54, 59. Al-Hiqaq (Boxes): 94. Himyar: 39, 88. Al-Hinta (Wheat): 32, 49. Al-Hawariyyun (Disciples): 62. Al-Hayd (Menstruation): 50. Haywan al-Kuhl (Kuhl Animal): 31. Khatim (Ring): 35. Khaqan: 52. Khanfu [Guangzhou]: 23, 30, 38, 42, 54, 59, 61, 63, 71, 73, 75.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 125
  },
  {
    "serial_number": "6277966",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 132,
    "volume_number": 1,
    "text": "Khitan (Circumcision): 49. Khadam (Servants): 58, 59, 68. Kharrabat (Ropes): 86. Kharaj (Land Tax): 42, 58. Khorasan: 71, 73, 75. Al-Khazina (Treasury): 45. Khashab (Wood): 49. Khashab al-Marakib (Ship Wood): 65. Al-Khushnami: 22. Khasi (Eunuch): 38, 41, 43, 58, 59, 71, 73, 74. Khisyan al-Malik (King's Eunuchs): 64. Khatafu (Set sail): 25. Al-Khall (Vinegar): 32. Al-Khalij (Gulf): 65. Khamdan [Chang'an/Xi'an]: 54, 55, 64, 61, 71. Khamr (Wine): 32. Al-Khanazir (Pigs): 32. Khanjar (Dagger): 71, 79, 80. Al-Khawatim (Rings): 94. Al-Khawr (Estuary): 30. Khus al-Narjil (Coconut Palm Leaves): 93. Al-Khiyar (Cucumber): 89. Khayl (Horses): 51. Al-Dhadhi (Honey/Grain): 81. Dara (Darius): 55. Al-Dabijat: 19. Dijla (Tigris): 67. Al-Dakhris: 18. Daraj (Steps): 62. Al-Durdur: 25. Al-Darak (Protection/Guarantee): 39. Dirham. Darahim: 35, 36, 57. Al-Dirham al-Baghli: 58. Al-Dann (Jar): 80. Al-Dananir al-Sindiyyah (Sindhi Dinars): 93, 94. Al-Duhn (Oil/Fat): 38. Duhn al-Jawz (Walnut Oil): 82. Duhn al-Simsim (Sesame Oil): 82. Al-Dahnaj (Malachite): 94. Al-Dawawin (Administrative Offices): 75. Dud al-Qazz (Silkworm): 54. Al-Dunatah: 85. Al-Dika (Roosters): 67, 82. Difu: 41.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 126
  },
  {
    "serial_number": "6277967",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 133,
    "volume_number": 1,
    "text": "Dinar: 85. Al-Diwan: 43. Diwan al-Zawani (Bureau of Prostitutes): 57. Al-Dhabl (Turtle Shell): 39, 89. Dhira' (Cubit): 49. Al-Dhi'ab (Wolves): 50, 57. Al-Ramni [Sumatra]: 20. Al-Rami: 66. Al-Rababina (Captains): 56. Rabi'a: 77, 78. Al-Rasas al-Qal'i (Tin): 66. Al-Ratbah (Fresh Dates/Rank?): 42. Al-Ra'iyya (Subjects): 64. Al-Riqa' (Notes/Patches): 61. Al-Rihan (Betting): 32. Al-Rahun (Mount): 19. Al-Rum (Romans/Byzantines): 87. Al-Rayhan (Basil): 78. Al-Zabaj [Srivijaya]: 31, 66, 68, 69, 71. Al-Zabad (Civet): 89. Al-Za'faran (Saffron): 45. Al-Zumurrud (Emerald): 94. Al-Zanj [Zanj]: 86, 89. Al-Zawaj (Marriage): 49. Al-Zawariq (Skiffs): 27. Al-Zayt (Oil): 82. Zayla' [Zeila]: 89. Al-Sakh: 42. Saba'ik al-Nahas (Copper Ingots): 39. Sabika (Ingot): 67. Al-Sihr (Magic): 89. Al-Sahara (Sorcerers): 73. Al-Sadanah (Custodians): 85. Al-Sarawil (Trousers): 32. Sarbaza (Island): 66. Al-Sariqa (Theft): 48. Sarandib [Sri Lanka]: 15, 19, 20, 30, 45, 46, 80, 81. Al-Si'r (Price): 42. Al-Safarjal (Quince): 32. Al-Sufun (Ships): 24. Al-Sufun al-Siniyya (Chinese Ships): 25. Safina (Ship): 62. Socotra [Socotra]: 78. Al-Suquf (Roofs): 83.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 127
  },
  {
    "serial_number": "6277968",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 134,
    "volume_number": 1,
    "text": "Al-Sukkar (Sugar): 27. Sikak (Coins/Mints): 64. Al-Salahif (Turtles): 89. Salasil (Chains): 86. Al-Silsila (Chain): 71. Samarqand [Samarkand]: 75. Samak (Fish): 31. Sunbul al-Tib (Spikenard): 75. Al-Sandarus (Sandarac): 78. Siwak (Toothstick): 50, 70. Siraf [Bandar Siraf]: 24, 25, 54, 56, 57, 60, 63, 65, 75, 83, 89, 90, 90, 93. Al-Sirafi (Abu Zayd al-Hasan): 53. Al-Sayf (Sword/Coast): 54. Sayf bin al-Saffaq: 25. Al-Sila [Silla/Korea]: 52, 65. Shari' (Street): 64. Al-Sham (Syria): 65, 87. Al-Shihr [Ash Shihr]: 88. Al-Shattar (Rogues): 54. Al-Shu'ara' (Poets): 83. Shalahit: 21. Al-Shank: 19. Al-Shahdhanij (Hemp seed?): 58. Al-Sabr (Aloe): 39, 78, 89. Suhar [Sohar]: 26. Al-Sadaf (Shell/Oyster): 91. Al-Sufr (Brass/Yellow Copper): 75. Al-Summan: 92. Al-Sina'at (Crafts): 60. Sanadiq (Boxes): 58. Sanji: 29. Al-Sandal (Sandalwood): 89. Sandar Fulat: 29, 45, 66. Sanf [Champa]: 28. Sanam (Idol): 81, 85. Al-Sunuj (Cymbals): 48. Sur [Tyre?]: 60. Suwar al-Anbiya' (Images of Prophets): 62. Al-Sayasi (Spurs): 82. Al-Sin (China): 24, 30, 30, 31, 33, 36, 37, 38, 43, 44, 45, 47, 48, 50, 52, 53, 54, 55, 56...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 128
  },
  {
    "serial_number": "6277969",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 135,
    "volume_number": 1,
    "text": "...58, 59, 60, 61, 63, 64, 65, 66, 71, 72, 75, 77. Al-Siniyyat (Chinese Women/Porcelain?): 38, 48, 49. Al-Siniyyun (Chinese People): 39. Al-Tatariyya (Tatari Coins): 34. Al-Tafin: 35. Al-Tafi: 35. Al-Tibb (Medicine): 50. Al-Tubul (Drums): 38, 48. Tast (Basin): 70. Al-Tawa'if (Sects/Factions): 87. Tusanj: 40. Al-Tawawis (Peacocks): 89, 93. Al-Tufan (Flood): 62. Al-Tuqam: 41. Al-Tin (Clay): 58. Ziba' al-Misk (Musk Gazelles): 75, 89. Zabi al-Misk (Musk Gazelle): 49. Al-Aj (Ivory): 66, 70, 89. Ad (Ad Tribe): 88. Al-Ammah (Commoners): 64. Atab (Threshold?): 58. Ijl (Calf/Cart): 58. Al-Ajam (Non-Arabs/Persians): 61. Aden [Aden]: 88. Al-Iraq [Iraq]: 61, 71. Al-Arab (Arabs): 42, 56, 50, 86, 87. Asal (Honey): 32, 50. Al-Ama'im (Turbans): 33. Imara (Architecture/Building): 50. Oman [Oman]: 24, 25, 56, 66, 85, 88. Al-Inab (Grape): 32. Al-Anbar (Ambergris): 17, 21, 23, 37, 65, 88, 89, 90. Al-Anqatus: 17. Al-Ud (Aloeswood): 89. Al-Ud al-Qamari (Khmer Aloeswood): 68. Isa alayhi al-salam (Jesus, peace be upon him): 62, 88. Al-Ghubb (Inlet/Bay): 81. Al-Ghubayra' (Service Berry): 32. Al-Ghadir (Pool): 67. Al-Ghadar (Porcelain/Clay): 39. Ghadara (Bowl): 93.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 129
  },
  {
    "serial_number": "6277970",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 136,
    "volume_number": 1,
    "text": "Ghilman al-Dar (House Boys/Pages): 64. Ghilman al-Quwwad (Commanders' Pages): 64. Ghuz: 15. Faris [Persia]: 55. Fas: 82. Fidya (Ransom): 80. Farasikh, Farsakh (Parasangs): 18, 42, 66, 90. Al-Fustuq (Pistachio): 32. Al-Fidda (Silver): 35. Al-Fitr (Mushrooms?): 17. Al-Fagha'i: 89. Al-Fakujj (Currency): 39, 44. Al-Falasifa (Philosophers): 50, 83. Fals, Fulus (Fals Coin): 38, 44, 57, 58. Fansur [Pansur]: 20. Al-Fuwad, Al-Futa (Waist Wrapper): 28, 29, 51. Al-Fil, Al-Fiyala (Elephant, Elephants): 36, 61, 82. Qamarun (Country) [Khmer/Assam?]: 85. Al-Qiththa' (Cucumber): 32. Qihab al-Budd (Whores of the Idol): 84. Al-Qaratis (Paper/Papyrus): 50. Al-Qaratis al-Siniyya (Chinese Paper): 33. Al-Qaranful (Clove): 89. Quraysh: 60. Qasab al-Sukkar (Sugar Cane): 31, 32. Qasr (Palace): 67. Al-Qada', Al-Qudah (Judiciary, Judges): 49, 74. Al-Qalanis (Caps): 33. Al-Qulzum (Bahr) [Red Sea]: 88, 89. Al-Qulus (Cables): 86. Al-Qamar (Country) [Khmer Empire]: 68, 70, 71. Al-Qimar (Gambling): 82. Al-Qamis (Shirt): 33, 59. Qanat (Spear/Canal): 79, 80, 58. Qinnawj [Kannauj]: 84. Qaharima (Stewards): 64. Qahraman (Steward): 67. Quwwad (Commanders): 68. Al-Qawarir (Glass Bottles): 39. Al-Qiranj: 37. Al-Kashibin: 37. Al-Kafur (Camphor): 20, 38, 39, 45, 66, 89.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 130
  },
  {
    "serial_number": "6277971",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 137,
    "volume_number": 1,
    "text": "Al-Kabtah: 18. Kattan (Linen/Flax): 45. Kadranj: 28. Karasi (Chairs): 90. Al-Karkaddan (Rhinoceros): 36, 39. Kisra (Chosroes): 34. Kusayr wa Uwayr: 25. Kalah Bar [Kedah]: 27, 28. Kalah (Island): 66. Kumm al-Qamis (Shirt Sleeve): 59. Al-Kam'a (Truffle): 17. Al-Kummathra (Pear): 32. Al-Kumkum: 34. Al-Kanifiyya: 79. Al-Kuhhan (Soothsayers): 83. Kawasij (Beardless): 27. Al-Kushan: 32. Kulam [Kollam]: 26. Al-Kayy (Cauterization): 50. Larwi: 17. Al-Luban (Frankincense): 88. Al-Laban al-Dhahabiyya (Golden Bricks): 68. Lihya (Beard): 49. Al-Lakhm (Shark): 23. Al-Lashk: 16, 19. Laqsha: 41. Lanjbalus [Nicobar]: 21, 26. Al-Lu'lu' (Pearl): 19, 39, 89, 91, 92, 93. Lif al-Nar (Fire Fiber? Coconut Fiber?): 86. Linjun: 41. Al-Mabad: 37. Al-Majus (Zoroastrians/Pagans): 33, 54. Al-Muhassan: 56. Al-Mukhazzamun al-Unuf (Nose-pierced): 86. Al-Madd, Al-Mudud (Tide, Tides): 67, 81. Mada'in (Cities): 51. Madinat al-Salam [Baghdad]: 90. Al-Mar'a (The Woman): 71. Marakib al-Khassa (Private Ships): 91. Marakib al-Rum (Roman Ships): 65. Marakib al-Sham (Syrian Ships): 65. Al-Marakib al-Makhzuma (Sewn Ships): 65. Al-Marjan (Coral): 94. Markab, Marakib (Ship, Ships): 60, 61...",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 131
  },
  {
    "serial_number": "6277972",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 138,
    "volume_number": 1,
    "text": "...63, 70, 71, 91. Masawik (Toothsticks): 62. Masalih (Garrisons): 43. Muscat [Muscat]: 25, 76. Al-Misk al-Sini (Chinese Musk): 75. Muslim: 51. Musht (Comb): 33. Al-Mishmish (Apricot): 32. Misr [Egypt]: 78, 87, 89. Al-Matar (Rain): 83. Maghas al-Lu'lu' (Pearl Diving Place): 80. Mafawiz (Deserts): 51. Maljan: 30. Al-Milh (Salt): 42. Al-Malik (The King): 59, 60, 61, 63, 64, 74, 78. Malik al-Turk (King of the Turks): 61. Malik al-Rum (King of the Romans): 61. Malik al-Ajam (King of the Persians): 61. Malik al-Iraq (King of Iraq): 61. Malik al-Qamar (King of Khmer): 68, 69, 71. Malik al-Hind (King of India): 51, 61. Muluk al-Sin (Kings of China): 77. Muluk al-Tawa'if (Kings of Sects): 55. Muluk al-Hind (Kings of India): 92. Mamlakat al-Jawz (Kingdom of Al-Jawz/Jurz): 84. Mann, Manna (Weight Unit): 45, 67, 85. Al-Manazil (Houses/Stops): 64, 83. Al-Manaṭiq, Manaṭiq (Belts): 39, 50. Al-Mand: 90. Al-Mansuriyya [Mansura?]: 85. Al-Mujah: 37. Al-Mawz (Banana): 27, 32. Musa alayhi al-salam (Moses, peace be upon him): 62. Multan (Idol) [Multan]: 85. Al-Maharaj [Maharaja/Srivijaya]: 66, 67, 68, 69, 70, 71. Al-Mij: 16. Al-Mira (Provisions): 64. Nab al-Fil (Elephant Tusk): 77. Al-Narjil (Coconut): 17, 18, 20, 21, 27, 31, 32, 85, 93. Al-Natif (Confection): 33. Al-Nabq (Lotus Jujube): 32. Al-Nabi salla Allahu alayhi wa sallam (The Prophet, peace be upon him): 62.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 132
  },
  {
    "serial_number": "6277973",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Rihlat al-Sirafi",
    "edition": "None",
    "publisher": "Cultural Foundation, Abu Dhabi",
    "page_number": 139,
    "volume_number": 1,
    "text": "Al-Nabidh (Wine): 32, 33. Nahas (Copper): 85. Al-Nakhl (Palm Trees): 64. Al-Nasara (Christians): 15, 54. Al-Ni'al al-Arabiyya (Arab Sandals): 62. Al-Naft (Naphtha/Petroleum): 79. Al-Numur (Leopards): 50, 87. Al-Nawakhidha (Shipmasters): 56. Nawafij al-Misk (Musk Pods): 75, 76. Nawaqis (Bells): 59. Nuh alayhi al-salam (Noah, peace be upon him): 62. Al-Nura (Lime): 39. Al-Niyan (Island): 20. Habbar bin al-Aswad: 60. Al-Harraba (Pirates?): 28. Harkand [Bay of Bengal]: 17, 19, 21, 23, 26, 28, 81. Al-Hind [India]: 28, 30, 33, 34, 35, 36, 45, 46, 49, 50, 51, 53, 62, 71, 73, 78, 79, 80, 81, 85. Haykal, Hayakil (Temple, Temples): 81, 85. Al-Wal: 16. Al-Wada' (Cowrie Shell): 18, 35, 36. Al-Wadak (Grease/Fat): 90, 91. Waraq al-Mawz (Banana Leaf): 78. Al-Wuzara' (Ministers): 70, 71. Wulat al-Kharaj (Tax Governors): 58. Ibn Wahb: 60, 62. Al-Yaqut (Ruby/Sapphire): 19. Al-Yasarrah (Monsoon): 83. Al-Yaman [Yemen]: 88. Al-Yahud (Jews): 54, 81.",
    "foot_note": "None",
    "book_id": "11269",
    "new_page_number": 133
  }
]