[
  {
    "text": "Kashf al-Shubuhat (Removal of Doubts)\nAuthor: عبد المحسن بن محمد القاسم\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "new_page_number": 1
  },
  {
    "text": "sn: 7984\nbook_title: كشف الشبهات (متون طالب العلم - الإضافية - ٤)\nbook_link: https://shamela.ws/book/1097\nbook_id: 1097\nauthor_name: عبد المحسن بن محمد القاسم\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/2750\nauthor_ID: 2750\neditor: د عبد المحسن بن محمد القاسم (محقق على نسخ نفيسة عتيقة)\npublisher: Null\nedition: الأولى، 1441 هـ - 2020 م\npages: 96\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الجوامع\ncategory_id: 36",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "new_page_number": 2
  },
  {
    "serial_number": "7130115",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Comprehensive Works. Book: Kashf al-Shubuhat (Student of Knowledge Texts - Additional - 4). Author: Muhammad bin Abd al-Wahhab bin Sulaiman al-Tamimi (1115 AH - 1206 AH). Editor: Dr. Abdul Muhsin bin Muhammad Al-Qasim. Verified based on precious ancient manuscripts. Note: The editor said: I have stripped this version of the footnotes regarding differences between manuscript copies and other matters to make memorization easier for the student, and I have established all of that in another version. Edition: First, 1441 AH - 2020 AD. Number of Pages: 96 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Rabi' al-Thani 1444.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 3
  },
  {
    "serial_number": "7130116",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Student of Knowledge Texts verified on (230) manuscripts. The Additional Texts (4). Kashf al-Shubuhat (Removal of Doubts). Verified based on precious ancient manuscripts. By the Imam of the Call, Sheikh Muhammad bin Abd al-Wahhab bin Sulaiman al-Tamimi, may Allah have mercy on him (1115 AH - 1206 AH). Verification by Dr. Abdul Muhsin bin Muhammad Al-Qasim, Imam and Khateeb of the Prophet's Noble Mosque.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 4
  },
  {
    "serial_number": "7130117",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. INTRODUCTION. Praise be to Allah, Lord of the Worlds, and prayers and peace be upon our Prophet Muhammad, and upon all his family and companions. To proceed: Allah the Almighty has clarified the religion, established proofs and evidences for it, and made it clear to creation. Then, groups of people deviated from the religion of Allah and cast doubts upon it. The Almighty informed us that the arguments of the people of falsehood are invalid, and that whatever doubts they cast, the truth will destroy them. He, the Glorified, said: {And they do not come to you with an argument except",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 5
  },
  {
    "serial_number": "7130118",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "We bring you the truth and the best explanation} [Al-Furqan: 33]. Ibn Kathir (may Allah have mercy on him) said: \"{And they do not come to you with an argument} meaning: a proof or a doubt {except We bring you the truth and the best explanation} meaning: They do not say a saying by which they oppose the truth, except that We answer them with what is the truth in the matter itself, and is clearer, more evident, and more eloquent than their statement\" (1). The doubts of the falsifiers have varied; from attacking the Essence of Allah, His religion, and His Prophet Muhammad (peace be upon him). Among the things they disputed was the Monotheism of Worship (Tawhid al-Uluhiyyah), so they stirred up doubts against the people of truth and falsely clothed their polytheism and association of partners with the garment of Monotheism.",
    "foot_note": "1. Tafsir al-Quran al-Azim (6/ 337).",
    "book_id": "1097",
    "new_page_number": 6
  },
  {
    "serial_number": "7130119",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Great scholars throughout the ages rose to refute these doubts. Among those unique figures was the Imam of the Call, Sheikh Muhammad bin Abd al-Wahhab (may Allah have mercy on him). He called to the Tawhid of Worship for more than seventy years. The people of falsehood opposed him and stirred up flimsy doubts regarding the Tawhid of Worship. He enumerated them and then answered every doubt with what clears its darkness in a work he named: \"Kashf al-Shubuhat\" (The Removal of Doubts). You can hardly find a doubt raised throughout the times regarding Tawhid al-Uluhiyyah except that the answer to it is inscribed in this book. Thus, it became a unique book in its field, clarifying the truth, and refuting every doubt by responding to it from the Quran, the Sunnah, Consensus (Ijma'), the sayings of the Companions, and other sources.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 7
  },
  {
    "serial_number": "7130120",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Due to its importance, I verified it within the series of verification of the \"Additional Texts\" of the \"Student of Knowledge Texts,\" relying on precious manuscript copies; so that it may be an aid to the firmness of the people of truth, their adherence to their religion, and an increase in their certainty regarding the correctness of the true belief they hold; and so that it may be a call to the people of misguidance to follow the path of guidance. I have stripped this version of the footnotes regarding differences between manuscript copies and other matters to make memorization easier for the student, and I have established all of that in another version. I ask Allah to make it beneficial and to make our work in it purely for His Noble Face.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 8
  },
  {
    "serial_number": "7130121",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "May Allah send prayers and peace upon our Prophet Muhammad, and upon his family and all his companions. I finished it on 16/11/1441 AH.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 9
  },
  {
    "serial_number": "7130122",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Kashf al-Shubuhat (The Removal of Doubts). By the Imam of the Call, Sheikh Muhammad bin Abd al-Wahhab bin Sulaiman al-Tamimi, may Allah have mercy on him (1115 AH - 1206 AH).",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 10
  },
  {
    "serial_number": "7130123",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "* The Manuscripts relied upon in verifying this text: - A manuscript at King Saud University - Saudi Arabia, number (1063), date of copying: (1213 AH). - A manuscript at the King Abdulaziz Foundation - Saudi Arabia, number (6338 - Muhibb al-Din al-Khatib Collection 578 - 1), date of copying: (1216 AH). - A manuscript at the King Abdulaziz Library in the Prophet's City (Al-Mahmudiyah Library Collection) - Saudi Arabia, number (1920), date of copying: (1216 AH). - A manuscript at the King Abdulaziz Foundation - Saudi Arabia, number (1504 - Al Abd al-Latif Collection 7 - 2), date of copying: (1217 AH). - A manuscript at the King Abdulaziz Foundation - Saudi Arabia, number (1081 - Abdul Aziz Al-Mani' Collection 30 - 4), date of copying: (1218 AH).",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 11
  },
  {
    "serial_number": "7130124",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "- A manuscript at the King Faisal Center - Saudi Arabia, number (2727), date of copying: (1223 AH). - A manuscript at the Library of the Meccan Haram - Saudi Arabia, number (1341), date of copying: (1228 AH). - A manuscript at the King Abdulaziz Foundation - Saudi Arabia, number (5407 - Al-Muhanna Collection 17), date of copying: (1228 AH). - A manuscript at the King Abdulaziz Foundation - Saudi Arabia, number (2396/ 58 - 5), date of copying: Not mentioned; but there is a marginal note on the copy dated (1237 AH), so the date of copying is in the mentioned year or before. - A manuscript at the King Abdulaziz Public Library in Riyadh, number (3687/ 3), date of copying: Not mentioned, but it is within a collection where some treatises are dated (1281 AH).",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 12
  },
  {
    "serial_number": "7130125",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "- A manuscript at the King Faisal Center - Saudi Arabia, number (13467), date of copying: (1282 AH). - A manuscript at the Grand Mosque in Unaizah - Saudi Arabia, number (389), date of copying: (1307 AH). - A manuscript at King Saud University (Manuscripts Department) - Saudi Arabia, number (1072), date of copying: (1307 AH).",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 13
  },
  {
    "serial_number": "7130126",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. [Introduction explaining the reality of the religion of the Messengers and what they called to, and the reality of the religion of the polytheists and what they were upon]. Know - may Allah have mercy on you - that Tawhid (Monotheism) is: singling out Allah in worship. It is the religion of the Messengers with which Allah sent them to His servants. The first of them was Noah, peace be upon him; Allah sent him to his people when they went to extremes regarding the righteous people - Wadd, Suwa', Yaghuth, Ya'uq, and Nasr. And the last of the Messengers was Muhammad, peace be upon him, and he is the one who smashed the images of these righteous people.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 14
  },
  {
    "serial_number": "7130127",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Allah sent him to a people who devote themselves to worship, perform Hajj, give charity, and remember Allah frequently. However, they make some creatures intermediaries between them and Allah - they say: \"We want from them nearness to Allah, and we want their intercession with Him\" - such as the Angels, Jesus, Mary, and other righteous people. So Allah sent Muhammad, peace be upon him, to renew for them the religion of their father Abraham, and to inform them that this seeking nearness and this belief is purely the right of Allah; nothing of it is fitting for a close Angel, nor for a sent Prophet, let alone anyone else.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 15
  },
  {
    "serial_number": "7130128",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Otherwise, these polytheists - whom the Messenger of Allah (peace be upon him) fought - testify that Allah is the Creator alone with no partner, and that no one provides sustenance except Him, no one gives life or causes death except Him, no one manages the affair except Him, and that all the seven heavens and whoever is in them, and the seven earths and whoever is in them, are all His servants and under His disposal and dominance.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 16
  },
  {
    "serial_number": "7130129",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "If you want proof that these polytheists - whom the Messenger of Allah (peace be upon him) fought - testified to this, then read His saying: {Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?\" They will say, \"Allah,\" so say, \"Then will you not fear Him?\"} [Yunus: 31]. And His saying: {Say, \"To whom belongs the earth and whoever is in it, if you should know?\" * They will say, \"To Allah.\" Say, \"Then will you not remember?\" * Say, \"Who is Lord of the seven heavens and Lord of the Great Throne?\" * They will say, \"[They belong] to Allah.\" Say, \"Then will you not fear Him?\" * Say, \"In whose hand is the realm of all things - and He protects while none can protect against Him - if you should know?\" * They will say, \"[All belongs] to Allah.\" Say, \"Then how are you deluded?\"} [Al-Mu'minun: 84-89]. And other verses besides these.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 17
  },
  {
    "serial_number": "7130130",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "So if you verify that they affirmed this, and [yet] it did not enter them into the Tawhid to which the Messenger of Allah (peace be upon him) called them; and you know that the Tawhid they denied was the Tawhid of Worship - which the polytheists in our time call \"The Belief\" (Al-I'tiqad) - as they used to call upon Allah, Glorified and Exalted, night and day, then some of them would call upon the Angels because of their righteousness and nearness to Allah to intercede for them, or call upon a righteous man - like Al-Lat -, or a Prophet - like Jesus -. And you know that the Messenger of Allah (peace be upon him) fought them over this Shirk (polytheism) and called them to make worship purely for Allah alone; as the Almighty said: {So do not invoke with Allah",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 18
  },
  {
    "serial_number": "7130131",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "anyone} [Al-Jinn: 18], and He said: {To Him is the supplication of truth. And those they call upon besides Him do not respond to them with a thing} [Ar-Ra'd: 14].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 19
  },
  {
    "serial_number": "7130132",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "And [if] you realize that the Messenger of Allah (peace be upon him) fought them so that all supplication would be for Allah, all sacrifice for Allah, all vows for Allah, all seeking of aid for Allah, and all types of worship entirely for Allah. And you know that their affirmation of Tawhid al-Rububiyyah (Lordship) did not enter them into Islam, and that their intent towards the Angels, Prophets, and Saints - wanting their intercession and nearness to Allah thereby - is what made their blood and wealth lawful [to be taken in war]. Then you have known the Tawhid to which the Messengers called, and which the polytheists refused to acknowledge.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 20
  },
  {
    "serial_number": "7130133",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "This Tawhid is the meaning of your saying: \"La Ilaha Illa Allah\" (There is no deity worthy of worship except Allah). For \"Al-Ilah\" (the deity) to them is the one intended for these matters; whether it is an Angel, a Prophet, a Saint, a tree, a grave, or a Jinn. They did not mean that \"Al-Ilah\" is the Creator, the Provider, the Manager [of affairs], for they know that this belongs to Allah alone - as I presented to you -. Rather, by \"Al-Ilah\" they mean what the polytheists in our time mean by the word \"Al-Sayyid\" (The Master/Saint). So the Prophet (peace be upon him) came to them calling them to the word of Tawhid, which is: \"La Ilaha Illa Allah\". The intended meaning of this word is its meaning, not merely its utterance.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 21
  },
  {
    "serial_number": "7130134",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "The ignorant disbelievers knew that the intent of the Prophet (peace be upon him) by this word was singling out Allah in attachment [worship] and disbelieving in what is worshipped besides Him and disavowing it. For when he said to them: \"Say: La Ilaha Illa Allah,\" they said: {Has he made the gods [only] one God? Indeed, this is a curious thing} [Sad: 5]. So if you know that the ignorant among the disbelievers knew that, then how strange is the one who claims Islam while he does not know of the explanation of this word what the ignorant disbelievers knew! Rather, he thinks that it is merely uttering its letters without the heart believing in any of its meanings. The clever among them thinks its meaning is: \"No one creates, provides, or manages the affair except Allah.\" There is no good in a man whom the ignorant disbelievers are more knowledgeable than regarding the meaning of \"La Ilaha Illa Allah\".",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 22
  },
  {
    "serial_number": "7130135",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "If you know what I told you with a knowledge of the heart, and you know Shirk (polytheism) against Allah about which Allah said: {Indeed, Allah does not forgive that you associate partners with Him} [An-Nisa: 48]. And you know the religion of Allah with which He sent the Messengers from the first of them to the last of them - which He accepts from no one other than it -. And you know what the majority of people have fallen into regarding ignorance of this; it will benefit you two benefits: First: Joy in the grace of Allah and His mercy; as the Almighty said: {Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate\"} [Yunus: 58]. And it will benefit you - also -: Great Fear. For if you know that a person may disbelieve by a word he utters from his tongue,",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 23
  },
  {
    "serial_number": "7130136",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "and he may say it while ignorant, yet he is not excused due to ignorance, and he may say it thinking it brings him closer to Allah - as the disbelievers thought -. Especially if Allah inspires you with what He narrated about the people of Moses - despite their righteousness and knowledge - that they came to him saying: {Make for us a god just as they have gods} [Al-A'raf: 138]. Then your fear and eagerness for what saves you from this and its likes will increase.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 24
  },
  {
    "serial_number": "7130137",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Know that Allah, Glorified be He, in His wisdom, did not send a Prophet with this Tawhid except that He made enemies for him; as the Almighty said: {And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion} [Al-An'am: 112]. The enemies of Tawhid may have much knowledge, books, and arguments; as the Almighty said: {And when their messengers came to them with clear proofs, they rejoiced in what they had of knowledge} [Ghafir: 83].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 25
  },
  {
    "serial_number": "7130138",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "If you know that, and know that the path to Allah must have enemies sitting upon it - people of eloquence, knowledge, and arguments -; then it is obligatory upon you to learn from the religion of Allah that which becomes a weapon for you to fight these devils, whose leader and chief said to your Lord, Mighty and Majestic: {He said, \"Because You have put me in error, I will surely sit in wait for them on Your straight path. * Then I will come to them from before them and from behind them and on their right and on their left, and You will not find most of them grateful.\"} [Al-A'raf: 16-17]. But if you turn to Allah and listen to Allah's arguments and evidences; then do not fear nor grieve {Indeed, the plot of Satan has ever been weak} [An-Nisa: 76]. And a commoner from the monotheists can defeat a thousand of the scholars of these polytheists; as the Almighty said: {And indeed, Our soldiers will be those who overcome} [As-Saffat: 173]; so the soldiers of Allah are",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 26
  },
  {
    "serial_number": "7130139",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "the victors by argument and tongue, just as they are the victors by sword and spear. The only fear is for the monotheist who walks the path without a weapon. Allah has favored us with His Book which He made an explanation for everything, and guidance and mercy and good tidings for the Muslims. No follower of falsehood comes with an argument except that in the Quran there is what refutes it and clarifies its falsehood; as the Almighty said: {And they do not come to you with an argument except We bring you the truth and the best explanation} [Al-Furqan: 33]. Some exegetes said: \"This verse is general regarding every argument brought by the people of falsehood until the Day of Resurrection.\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 27
  },
  {
    "serial_number": "7130140",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "[A General Answer regarding the Polytheists' Argument using Ambiguous Verses] I will mention to you things - from what Allah mentioned in His Book - as an answer to speech used by the polytheists in our time against us. We say: The answer to the people of falsehood is of two paths: General and Detailed. As for the General: It is a great matter and a huge benefit for the one who understands it, and that is His Almighty saying: {It is He who has sent down to you the Book; in it are verses [that are] precise - they are the foundation of the Book - and others unspecific. As for those in whose hearts is deviation [from truth], they follow that which is unspecific thereof, seeking discord and seeking an interpretation [suitable to them]. And no one knows its [true] interpretation except Allah} [Al Imran: 7].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 28
  },
  {
    "serial_number": "7130141",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "It has been authentically reported from the Messenger of Allah (peace be upon him) that he said: \"If you see those who follow what is unspecific of it, then those are the ones Allah has named, so beware of them.\" An example of that: If some of the polytheists say to you: {Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve} [Yunus: 62]. Or: \"Intercession is true.\" Or: \"The Prophets have status with Allah.\" Or: He mentions speech of the Prophet (peace be upon him) deducing from it something for his falsehood, and you do not understand the meaning of the speech he mentioned.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 29
  },
  {
    "serial_number": "7130142",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Answer him by saying: Allah mentioned that those with deviation in their hearts leave the decisive verses (Muhkam) and follow the ambiguous ones (Mutashabih). What I mentioned to you - that Allah stated the polytheists affirmed Rububiyyah, yet He declared them disbelievers due to their attachment to Angels, Prophets, and Saints, while saying: {These are our intercessors with Allah} - this is a clear, decisive matter that no one can change the meaning of. Whatever you mentioned to me - O polytheist! - from the Quran or the speech of the Prophet (peace be upon him), I do not know its meaning, but I am certain that the speech of Allah does not contradict itself, and the speech of the Prophet (peace be upon him) does not contradict the speech of Allah.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 30
  },
  {
    "serial_number": "7130143",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "This is a good, sound answer, but no one understands it except he whom Allah Almighty grants success. So do not underestimate it; for it is as the Almighty said: {And no one will be granted such goodness except those who exercise patience and self-restraint, - none but persons of the greatest good fortune} [Fussilat: 35].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 31
  },
  {
    "serial_number": "7130144",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "[Detailed Answer regarding the Doubts] [First Doubt: That whoever affirms Tawhid al-Rububiyyah and only seeks status and intercession from the righteous is not a polytheist]. As for the Detailed Answer: The enemies of Allah have many objections against the religion of the Messengers by which they turn people away from it. Among them is their saying: \"We do not associate partners with Allah; rather, we testify that no one creates, provides, benefits, or harms except Allah alone with no partner, and that Muhammad (peace be upon him) does not possess benefit or harm for himself, let alone Abd al-Qadir or others. But I am a sinner, and the righteous have status with Allah, so I ask Allah *through* them!\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 32
  },
  {
    "serial_number": "7130145",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Answer him with what preceded; which is: That those whom the Messenger of Allah (peace be upon him) fought affirmed what you mentioned, and affirmed that their idols did not manage anything, but they only wanted status and intercession. Read to him what Allah mentioned in His Book and clarified.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 33
  },
  {
    "serial_number": "7130146",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "[Second Doubt: Their restriction of worshipping other than Allah to idols, excluding the righteous]. If he says: \"These verses were revealed regarding those who worship idols; so how can you make the righteous like idols?! Or how can you make the Prophets idols?!\" Answer him with what preceded. For if he admits that the disbelievers testified that Rububiyyah belongs entirely to Allah, and that they sought nothing from those they turned to except intercession, but he wanted to differentiate between their action and his action by what he mentioned. Then mention to him that among the disbelievers were those who called upon idols,",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 34
  },
  {
    "serial_number": "7130147",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "and among them were those who called upon the Saints (Awliya) about whom Allah said: {Those whom they invoke seek means of access to their Lord, [striving as to] which of them would be nearest} [Al-Isra: 57]. And they call upon Jesus the son of Mary and his mother, and Allah the Almighty has said: {The Messiah, son of Mary, was not but a messenger; [other] messengers have passed on before him. And his mother was a supporter of truth. They both used to eat food. Look how We make clear to them the signs; then look how they are deluded. * Say, \"Do you worship besides Allah that which holds for you no [power of] harm or benefit while it is Allah who is the Hearing, the Knowing?\"} [Al-Ma'idah: 75-76]. And mention to him His saying: {And [mention] the Day when He will gather them all and then say to the angels, \"Did these [people] used to worship you?\" * They will say, \"Exalted are You! You, [O Allah], are our protector not them. Rather, they used to worship the jinn; most of them were believers in them.\"} [Saba: 40-41].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 35
  },
  {
    "serial_number": "7130148",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Say to him: You know that Allah declared as disbelievers those who sought idols, and He declared as disbelievers - also - those who sought the righteous, and the Messenger of Allah (peace be upon him) fought them.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 36
  },
  {
    "serial_number": "7130149",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "[Third Doubt: That seeking intercession from them is not Shirk]. If he says: \"The disbelievers want *from them*, but I testify that Allah is the One who Benefits, Harms, and Manages. I want nothing except *from Him*, and the righteous possess no part of the affair, but I turn to them hoping for their intercession from Allah.\" The answer: This is exactly the saying of the disbelievers. Read to him His saying: {We only worship them that they may bring us nearer to Allah in position} [Az-Zumar: 3], and His saying: {And they say, \"These are our intercessors with Allah\"} [Yunus: 18].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 37
  },
  {
    "serial_number": "7130150",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Know that these three doubts are the biggest they have. So if you know that Allah clarified them in His Book, and you understand them well, then what follows is easier than them.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 38
  },
  {
    "serial_number": "7130151",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "[Fourth Doubt: Their denial of worshipping the righteous, even though they call upon them or sacrifice to them]. If he says: \"I worship only Allah, and this seeking refuge in the righteous and calling upon them is not worship.\" [First Answer] Say to him: Do you affirm that Allah obligated you to make worship purely for Him? If he says: \"Yes.\" Say to him: Explain to me this obligation which Allah imposed upon you - which is making worship pure, and is His right upon you -.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 39
  },
  {
    "serial_number": "7130152",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "For he does not know worship nor its types. So explain it by saying: Allah the Almighty said: {Call upon your Lord in humility and privately} [Al-A'raf: 55]. If you inform him of this, say to him: Is this worship of Allah? He must say: \"Yes,\" and \"Supplication is the essence of worship.\" Say to him: If you admitted it is worship, and you called upon Allah night and day, in fear and hope, then you called upon a Prophet or someone else for that need; did you associate someone else in the worship of Allah? He must say: \"Yes.\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 40
  },
  {
    "serial_number": "7130153",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Say to him: Allah the Almighty said: {So pray to your Lord and sacrifice [to Him alone]} [Al-Kawthar: 2]. If you prayed to Allah and sacrificed to Him; is this worship? He must say: \"Yes.\" Say to him: If you sacrificed to a creature - a Prophet, a Jinn, or other than them -; did you associate someone other than Allah in this worship? He must admit and say: \"Yes.\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 41
  },
  {
    "serial_number": "7130154",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "[Second Answer] Say to him - also -: The polytheists regarding whom the Quran was revealed; did they used to worship the Angels, the righteous, Al-Lat, and others? He must say: \"Yes.\" Say to him: Was their worship of them anything other than supplication, sacrifice, seeking refuge, and the like? Otherwise, they affirmed that they are His slaves and under His dominance, and that Allah is the One who manages the affair, but they called upon them and sought refuge in them for status and intercession. This is very clear.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 42
  },
  {
    "serial_number": "7130155",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "[Fifth Doubt: That whoever denies Shirk has denied the intercession of the Prophet (peace be upon him)]. If he says: \"Do you deny the intercession of the Messenger of Allah (peace be upon him) and disavow it?\" Say: I do not deny it, nor do I disavow it. Rather, he (peace be upon him) is the Intercessor whose intercession is accepted, and I hope for his intercession. However, intercession belongs entirely to Allah; as the Almighty said: {Say, \"To Allah belongs [the right to allow] intercession entirely\"} [Az-Zumar: 44]. And it does not occur except after Allah's permission; as the Almighty said: {Who is it that can intercede with Him except by His permission?} [Al-Baqarah: 255]. And he does not intercede for anyone except after Allah permits it regarding him; as the Almighty said: {And they cannot intercede except on behalf of one whom He approves} [Al-Anbiya: 28].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 43
  },
  {
    "serial_number": "7130156",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "And He is not pleased with anything except Tawhid; as the Almighty said: {And whoever desires other than Islam as religion - never will it be accepted from him} [Al Imran: 85]. So if intercession belongs entirely to Allah, and does not occur except after His permission, and neither the Prophet (peace be upon him) nor anyone else intercedes for anyone until Allah permits it, and He does not permit except for the people of Tawhid; it becomes clear that intercession belongs entirely to Allah, and I seek it from Him. So I say: \"O Allah, do not deprive me of his intercession! O Allah, grant him intercession for me!\" and the likes of this.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 44
  },
  {
    "serial_number": "7130157",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "[Sixth Doubt: That the Prophet (peace be upon him) was given intercession, and it is sought from him]. If he says: \"The Prophet (peace be upon him) was given intercession, and I ask him for what Allah gave him!\" [First Answer] The answer is: Allah gave him intercession, but He forbade you from calling upon anyone with Allah; He said: {So do not invoke with Allah anyone} [Al-Jinn: 18]. Your asking Allah for the intercession of His Prophet (peace be upon him) is worship, and Allah forbade you from associating anyone in this worship. So if you call upon Allah to grant him intercession for you; then obey Him in His saying: {So do not invoke with Allah anyone}.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 45
  },
  {
    "serial_number": "7130158",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "[Second Answer] Also: Intercession was given to other than the Prophet (peace be upon him); it is authentic that Angels intercede, Saints (Awliya) intercede, and children who died young (Afrat) intercede. Do you say: \"Allah gave them intercession, so I ask it from them?\" If you say this; you return to the worship of the righteous which Allah mentioned in His Book. And if you say: \"No\"; your statement: (Allah gave him intercession, and I ask him for what Allah gave him) becomes invalid.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 46
  },
  {
    "serial_number": "7130159",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "[Seventh Doubt: That seeking refuge in the righteous is not Shirk]. If he says: \"I do not associate anything with Allah, God forbid! But seeking refuge in the righteous is not Shirk.\" Say to him: If you affirm that Allah forbade Shirk more strictly than the prohibition of adultery, and you affirm that Allah does not forgive it. Then what is this matter which Allah made grave and mentioned that He does not forgive?! He will not know. Say to him: How can you clear yourself of Shirk when you do not know what it is?",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 47
  },
  {
    "serial_number": "7130160",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "How can Allah forbid this upon you, and mention that He does not forgive it; yet you do not ask about it nor know it? Do you think Allah forbids it and does not clarify it to us?!",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 48
  },
  {
    "serial_number": "7130161",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "[Eighth Doubt: That Shirk is idol worship, and we do not worship idols]. If he says: \"Shirk is worshipping idols, and we do not worship idols!\" [First Answer] Say to him: What is the meaning of worshipping idols? Do you think they believe that those pieces of wood and stones create, provide, and manage the affairs of those who call upon them?! The Quran belies this. If he says: \"It is turning to a piece of wood, a stone, or a structure on a grave or otherwise; calling upon that,",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 49
  },
  {
    "serial_number": "7130162",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "and sacrificing to it; saying: 'It brings us closer to Allah in position, and wards off [harm] from us by its blessing, or gives to us by its blessing.'\" Say: You have spoken the truth, and this is exactly your action at the stones and structures upon graves and others. So he has admitted that their action is the worship of idols; and that is what is sought.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 50
  },
  {
    "serial_number": "7130163",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "[Second Answer] It is also said to him: Your statement: (Shirk is worshipping idols); do you mean that Shirk is restricted to this, and that relying on the righteous and calling upon them does not enter into that? This is refuted by what Allah mentioned in His Book regarding the disbelief of whoever attached himself to the Angels, Jesus, or the righteous. He must admit to you: That whoever associates anyone from the righteous in the worship of Allah; then he is the Shirk mentioned in the Quran; and this is what is sought.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 51
  },
  {
    "serial_number": "7130164",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "The secret of the issue is: If he says: \"I do not associate partners with Allah.\" Say to him: What is Shirk (associating partners) with Allah? Explain it to me! If he says: \"It is worshipping idols!\" Say: And what is the meaning of worshipping idols? Explain it to me! If he says: \"I worship only Allah.\" Say: What is the meaning of worshipping Allah alone? Explain it to me! If he explains it according to what the Quran clarified; then that is what is sought. And if he does not know it; then how can he claim something while he does not know it?",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 52
  },
  {
    "serial_number": "7130165",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "If he explains it with other than its meaning: You explain to him the clear verses regarding the meaning of Shirk with Allah and idol worship; that it is exactly what they are doing in this time. And that worshipping Allah alone with no partner is what they deny from us, and they scream about as their brothers screamed when they said: {Has he made the gods [only] one God? Indeed, this is a curious thing}. So if you know that this which the polytheists in our time call: \"The Belief\" (Al-I'tiqad) is the Shirk regarding which the Quran was revealed, and for which the Messenger of Allah (peace be upon him) fought the people. Then know that the Shirk of the ancients is lighter than the Shirk of the people of our time in two ways:",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 53
  },
  {
    "serial_number": "7130166",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "The first of them is: That the early [polytheists] did not commit shirk or invoke angels, saints, and idols along with Allah except during times of ease. However, during times of hardship, they would make their religion sincere to Allah alone; as the Almighty said: {And when adversity touches you at sea, lost are [all] those you invoke except Him. But when He delivers you to the land, you turn away. And ever is man ungrateful.} [Al-Isra: 67]. And He said: {Say, \"Have you considered: if there came to you the punishment of Allah or there came to you the Hour - is it other than Allah you would invoke, if you should be truthful?\" * No, it is Him you would invoke, and He would remove that for which you invoked Him if He willed, and you would forget what you associate [with Him].} [Al-An'am: 40-41]. And He said: {And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 54
  },
  {
    "serial_number": "7130167",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "your disbelief for a little; indeed, you are of the companions of the Fire.\"} [Az-Zumar: 8]. And He said: {And when waves come over them like canopies, they supplicate Allah, sincere to Him in religion.} [Luqman: 32]. So whoever understands this issue which Allah has clarified in His Book—which is that the polytheists whom the Messenger of Allah (peace be upon him) fought used to invoke Allah and invoke others alongside Him during times of ease, but in times of hardship, they invoked none but Allah alone, with no partner, and they forgot their masters—the difference between the shirk of the people of our time and the shirk of the early people will become clear to him. But where is the one whose heart understands this issue with a firm understanding?! And Allah is the One whose help is sought.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 55
  },
  {
    "serial_number": "7130168",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "The Second Matter: That the early [polytheists] invoked, along with Allah, people who were close to Allah; either angels, prophets, or saints, or they invoked trees and stones that were obedient to Allah and not disobedient. Whereas the people of our time invoke, along with Allah, people who are among the most corrupt of mankind. Those whom they invoke are those about whom immorality is recounted, such as fornication, theft, abandoning prayer, and other than that. And the one who holds a belief in a righteous person or something that does not disobey—like wood and stone—is [relatively] lighter [in their error] than the one who holds a belief in someone whose corruption and immorality are witnessed and attested to. ***",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 56
  },
  {
    "serial_number": "7130169",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "[The Ninth Doubt: How can you equate us with the early polytheists when we testify that there is no god but Allah?] If you have verified that those whom the Messenger of Allah (peace be upon him) fought were sounder in mind and lighter in shirk than these people, then know that these people have a specious argument (shubhah) which they raise against what we have mentioned. It is one of their greatest doubts, so listen attentively to its answer. It is that they say: \"Those regarding whom the Quran was revealed did not testify that there is no god but Allah, and they denied the Messenger of Allah (peace be upon him), denied the Resurrection, denied the Quran, and called it magic.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 57
  },
  {
    "serial_number": "7130170",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "While we testify that there is no god but Allah and that Muhammad is the Messenger of Allah, we believe in the Quran, we believe in the Resurrection, we pray, and we fast; so how can you make us like those people?!\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 58
  },
  {
    "serial_number": "7130171",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "[The First Answer] The answer is: There is no disagreement among all the scholars that if a man believes the Messenger of Allah (peace be upon him) in one thing and denies him in another, he is a disbeliever who has not entered Islam. Likewise, if he believes in some of the Quran and rejects some of it; such as one who acknowledges Tawhid (Monotheism) but rejects the obligation of prayer. Or acknowledges Tawhid and prayer but rejects the obligation of Zakat. Or acknowledges all of this but rejects fasting.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 59
  },
  {
    "serial_number": "7130172",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Or acknowledges all of this but rejects Hajj. And when some people in the time of the Prophet (peace be upon him) did not submit to Hajj, Allah revealed regarding them: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds.} [Al-Imran: 97]. And whoever acknowledges all of this but denies the Resurrection commits Kufr (disbelief) by consensus, and his blood and wealth become lawful; as the Almighty said: {Indeed, those who disbelieve in Allah and His messengers and wish to discriminate between Allah and His messengers and say, \"We believe in some and disbelieve in others,\" and wish to adopt a way in between - Those are the disbelievers, truly.} [An-Nisa: 150-151].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 60
  },
  {
    "serial_number": "7130173",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "So if Allah has explicitly stated in His Book that whoever believes in part and disbelieves in part is the true disbeliever, this doubt is removed. And this is the [doubt] that was mentioned by some people of Al-Ahsa in the letter they sent to us.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 61
  },
  {
    "serial_number": "7130174",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "[The Second Answer] It is also said: If you admit that one who believes the Messenger in everything but rejects the obligation of prayer is a disbeliever whose blood and wealth are lawful by consensus; and likewise if he acknowledges everything except the Resurrection; and likewise if he rejects the obligation of fasting Ramadan while acknowledging it [as a concept but denying its obligation]—no one denies this, nor do the schools of thought differ on it, and the Quran has spoken of it as we presented beforehand—then it is known that Tawhid is the greatest obligation brought by the Prophet (peace be upon him), and it is greater than prayer,",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 62
  },
  {
    "serial_number": "7130175",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "Zakat, fasting, and Hajj. So how can it be that if a person denies one of these matters, he disbelieves—even if he acts upon everything else the Messenger (peace be upon him) brought—but if he denies Tawhid, which is the religion of all the Messengers, he does not disbelieve?! Glory be to Allah! How strange is this ignorance!",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 63
  },
  {
    "serial_number": "7130176",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "[The Third Answer] It is also said: These Companions of the Messenger of Allah (peace be upon him) fought Banu Hanifa, who had embraced Islam with the Prophet (peace be upon him), testified that there is no god but Allah and that Muhammad is the Messenger of Allah, prayed, and made the call to prayer. If one says: \"They said that Musaylimah is a prophet,\" we say: This is the point. If someone who raises a man to the rank of the Prophet (peace be upon him) disbelieves and his blood and wealth become lawful, and the two testimonies and prayer do not benefit him, then what about the one who raises 'Shamsan', or 'Yusuf',",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 64
  },
  {
    "serial_number": "7130177",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "or a Companion, or a Prophet, to the rank of the Compeller of the Heavens and the Earth?! Glory be to Allah! How great is His affair! {Thus does Allah seal over the hearts of those who do not know.} [Ar-Rum: 59].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 65
  },
  {
    "serial_number": "7130178",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "[The Fourth Answer] It is also said: Those whom Ali bin Abi Talib (may Allah be pleased with him) burned with fire all claimed Islam, and they were followers of Ali (may Allah be pleased with him) and learned knowledge from the Companions. However, they held beliefs regarding Ali similar to the beliefs held regarding 'Yusuf', 'Shamsan', and their likes. So how did the Companions agree on killing them and declaring them disbelievers?! Do you think the Companions declare Muslims to be disbelievers?! Or do you think that believing in 'Taj' and his likes does not harm, but believing in Ali bin Abi Talib (may Allah be pleased with him) causes disbelief?!",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 66
  },
  {
    "serial_number": "7130179",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "[The Fifth Answer] It is also said: 'Banu Ubayd al-Qaddah' [the Fatimids] who ruled the Maghreb and Egypt during the time of the Abbasids, all testified that there is no god but Allah and that Muhammad is the Messenger of Allah, claimed Islam, and prayed the Friday and congregational prayers. But when they manifested opposition to the Sharia in matters—which were less than what we are discussing [regarding shirk]—the scholars agreed on their disbelief and fighting them, and that their lands were lands of war. So the Muslims fought them until they rescued what was in their hands of Muslim lands.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 67
  },
  {
    "serial_number": "7130180",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "[The Sixth Answer] It is also said: If the early people did not become disbelievers except by combining shirk, denial of the Messenger and the Quran, denial of the Resurrection, and so on, then what is the meaning of the chapter that scholars in every school of thought mention: \"The Chapter of the Ruling on the Apostate\"—who is a Muslim who disbelieves after his Islam? They then mention many types [of nullifiers], each of which causes disbelief and makes the man's blood and wealth lawful, to the point that they mention simple things—in the eyes of the one who does them—such as a word he mentions with his tongue without believing it in his heart, or a word he mentions in jest and play.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 68
  },
  {
    "serial_number": "7130181",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "[The Seventh Answer] It is also said: Those about whom Allah said: {They swear by Allah that they did not say [anything], but they had said the word of disbelief and disbelieved after their Islam.} [At-Tawbah: 74]; have you not heard that Allah declared them disbelievers due to a word, despite them being in the time of the Messenger of Allah (peace be upon him), fighting alongside him, praying with him, giving Zakat, performing Hajj, and professing Tawhid? Likewise, those about whom Allah said: {Say, \"Is it Allah and His verses and His Messenger that you were mocking?\" * Make no excuse; you have disbelieved after your belief.} [At-Tawbah: 65-66]. These constitute those whom Allah explicitly stated disbelieved after their belief—while they were with the Messenger of Allah (peace be upon him) in the Expedition of Tabuk—because they said a word which they claimed they said in jest.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 69
  },
  {
    "serial_number": "7130182",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "So reflect on this doubt: which is their saying, \"You declare Muslims disbelievers! People who testify that there is no god but Allah, pray, and fast,\" then reflect on its answer; for it is among the most beneficial things in these pages.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 70
  },
  {
    "serial_number": "7130183",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "[The Eighth Answer] Another proof of this is what Allah (Mighty and Majestic) narrated about the Children of Israel—despite their Islam, knowledge, and righteousness—that they said to Moses: {\"Make for us a god just as they have gods.\"} [Al-A'raf: 138]. And the saying of some people among the Companions (may Allah be pleased with them): \"O Messenger of Allah! Make for us a Dhat Anwat [a tree to hang weapons on for blessings].\" The Messenger of Allah (peace be upon him) swore that this was like the saying of the Children of Israel to Moses: {\"Make for us a god.\"}",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 71
  },
  {
    "serial_number": "7130184",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "However, the polytheists have a specious argument they put forward regarding this story. They say: \"The Children of Israel did not disbelieve by that, and likewise, those who said to the Messenger of Allah (peace be upon him) 'Make for us a Dhat Anwat' did not disbelieve.\" The answer is to say: The Children of Israel did not do it. Likewise, those who asked the Prophet (peace be upon him) did not do it. There is no disagreement that if the Children of Israel had done that, they would have disbelieved. Similarly, there is no disagreement that if those whom the Prophet (peace be upon him) forbade had not obeyed him and had taken a Dhat Anwat—after his prohibition—they would have disbelieved. And this is the point.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 72
  },
  {
    "serial_number": "7130185",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "However, this story teaches: That a Muslim—even a scholar—may fall into types of shirk that he is unaware of. It thus teaches the necessity of learning and caution, and realizing that the saying of the ignorant one, \"We have understood Tawhid,\" is among the greatest forms of ignorance and the plots of Satan. It also teaches that if a Mujtahid (striving) Muslim speaks a word of Kufr while unaware, and is then alerted to it and repents immediately, he does not disbelieve; just as the Children of Israel and those who asked the Messenger of Allah (peace be upon him) did.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 73
  },
  {
    "serial_number": "7130186",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "It also teaches that even if he does not disbelieve, he should be spoken to with severe harshness; as the Messenger of Allah (peace be upon him) did. ***",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 74
  },
  {
    "serial_number": "7130187",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "[The Tenth Doubt: That whoever says 'La ilaha illa Allah' is not declared a disbeliever or killed regardless of what he does] The polytheists have another doubt; they say: The Prophet (peace be upon him) rebuked Usama (may Allah be pleased with him) for killing someone who said \"La ilaha illa Allah,\" saying: \"Did you kill him after he said: La ilaha illa Allah?\" And likewise his saying: \"I have been commanded to fight the people until they say: La ilaha illa Allah,\" and other hadiths regarding refraining from [harming] one who says it. The intent of these ignorant people is that whoever says it cannot be declared a disbeliever nor killed—regardless of what he does! It is said to these ignorant polytheists: It is known that the Messenger of Allah (peace be upon him) fought the Jews and took them captive while they were saying: \"La ilaha illa Allah.\"",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 75
  },
  {
    "serial_number": "7130188",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "And the Companions of the Messenger of Allah (peace be upon him) fought Banu Hanifa while they testified that there is no god but Allah and that Muhammad is the Messenger of Allah, prayed, and claimed Islam. Likewise, those whom Ali bin Abi Talib (may Allah be pleased with him) burned with fire. These ignorant people acknowledge that whoever denies the Resurrection is declared a disbeliever and killed—even if he says \"La ilaha illa Allah.\" And that whoever rejects any pillar of Islam is declared a disbeliever and killed—even if he says it. So how can it [the phrase] not benefit him if he rejects a branch [of the religion], yet benefit him if he rejects Tawhid—which is the foundation and head of the religion of the Messengers?!",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 76
  },
  {
    "serial_number": "7130189",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "But the enemies of Allah did not understand the meaning of the hadiths. As for the hadith of Usama (may Allah be pleased with him), he killed a man who claimed Islam because he thought he only claimed it out of fear for his blood and wealth. When a man manifests Islam, it is obligatory to refrain from him until something contradicting that becomes evident from him. Allah revealed regarding this: {O you who have believed, when you go forth [to fight] in the cause of Allah, investigate; and do not say to one who gives you [the greeting of] peace, \"You are not a believer.\"} [An-Nisa: 94]. The verse indicates that it is obligatory to refrain and verify. So if it becomes evident from him—after that—what contradicts Islam, he is killed; due to His saying: {investigate}.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 77
  },
  {
    "serial_number": "7130190",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "If he were not to be killed once he says it, there would be no meaning to verification. Likewise, the other hadith and its likes mean what we mentioned: that whoever manifests Islam and Tawhid, it is obligatory to refrain from him, unless something contradicting that becomes evident from him. The proof for this is that the Messenger of Allah (peace be upon him) who said: \"Did you kill him after he said: La ilaha illa Allah?\" and said: \"I have been commanded to fight the people until they say: La ilaha illa Allah,\" is the same one who said regarding the Kharijites: \"Wherever you find them, kill them,\" and \"If I reach them, I will surely kill them with the killing of 'Aad\"; despite them being among the most worshipful of people and those who most frequently said 'La ilaha illa Allah'—to the extent that the Companions belittled themselves compared to them, and they had learned knowledge",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 78
  },
  {
    "serial_number": "7130191",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "from the Companions. Yet, \"La ilaha illa Allah\" did not benefit them, nor did their abundant worship, nor their claim of Islam, once opposition to the Sharia appeared from them. Likewise, what we mentioned concerning the fighting against the Jews and the Companions fighting Banu Hanifa. Similarly, he (peace be upon him) intended to raid Banu Al-Mustaliq when a man informed him that they withheld Zakat, until Allah revealed: {O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful.} [Al-Hujurat: 6]. The man had lied about them. So all of this indicates that the intent of the Prophet (peace be upon him) in the hadiths they used as proof is what we have mentioned. ***",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 79
  },
  {
    "serial_number": "7130192",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "[The Eleventh Doubt: That seeking aid (Istighatha) from other than Allah is not shirk because seeking aid from Prophets in the Hereafter is permissible] They have another doubt, which is: What the Prophet (peace be upon him) mentioned that people on the Day of Resurrection will seek aid (yastaghithun) from Adam, then Noah, then Abraham, then Moses, then Jesus, and all of them will excuse themselves, until they end up at the Messenger of Allah (peace be upon him). They said: This proves that seeking aid from other than Allah is not shirk. The answer is to say: Glory be to the One who sealed the hearts of His enemies! Indeed, seeking aid from a creature in what he is capable of",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 80
  },
  {
    "serial_number": "7130193",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "we do not deny; as the Almighty said regarding the story of Moses (peace be upon him): {And the one from his faction sought his aid [istaghathahu] against the one from his enemy.} [Al-Qasas: 15]. And just as a person seeks the aid of his companions in war and other things in matters which the creature is capable of. We only denied the seeking of aid as worship (Istighatha al-Ibadah) which they perform at the graves of the saints, or in their absence regarding things that only Allah is capable of. Once this is established: The seeking of aid from the Prophets on the Day of Resurrection is simply people wanting them to ask Allah to judge the people so that the people of Paradise may find relief from the distress of the standing [on Judgment Day].",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 81
  },
  {
    "serial_number": "7130194",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "This is permissible in this world and the Hereafter; that you come to a righteous living man who sits with you and hears your speech, and say to him: \"Pray to Allah for me,\" just as the Companions of the Messenger of Allah (peace be upon him) used to ask him during his life. As for after his death: Impossible, absolutely impossible that they asked him that at his grave! Rather, the Salaf condemned anyone who intended to pray to Allah at his grave, so how about praying to him himself? ***",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 82
  },
  {
    "serial_number": "7130195",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "[The Twelfth Doubt: If seeking aid from Gabriel was shirk, he would not have offered it to Abraham] They have another doubt, which is: The story of Abraham (peace be upon him) when he was thrown into the fire. Gabriel intercepted him in the air and said: \"Do you have a need?\" Abraham said: \"As for from you, no!\" They said: If seeking aid from Gabriel was shirk, he would not have offered it to Abraham. The answer: This is of the same genus as the first doubt. Gabriel offered to benefit him with a matter he was capable of; for he is as Allah described him: {severe in power} [An-Najm: 5]. If Allah had permitted him to take the fire of Abraham and what was around it of earth and mountains and throw it in",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 83
  },
  {
    "serial_number": "7130196",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "the east or the west, he would have done so. If Allah commanded him to place Abraham in a place far from them, he would have done so. If He commanded him to raise him to the sky, he would have done so. This is like a rich man who has much wealth seeing a needy man, so he offers to lend him or give him something to fulfill his need, but that needy man refuses to take it, and is patient until Allah brings him provision in which there is no favor owed to anyone. Where is this compared to the seeking of aid as worship and shirk, if they only understood?!",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 84
  },
  {
    "serial_number": "7130197",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "[Conclusion: Tawhid must be in the heart, tongue, and action] Let us conclude the speech with a great and important issue which is understood from what has preceded, but we will discuss it separately due to the greatness of its importance and the prevalence of error regarding it. We say: There is no disagreement that Tawhid must be in the heart, the tongue, and action. If one of these is missing, the man is not a Muslim. If he knows Tawhid but does not act upon it, he is a stubborn disbeliever—like Pharaoh, Iblis, and their likes. Many people err in this; they say: \"This is the truth, and we understand this, and we testify that it is",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 85
  },
  {
    "serial_number": "7130198",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "the truth, but we are unable to do it, and it is not permissible among the people of our land except for one who agrees with them,\" or other such excuses. The poor soul does not know that the majority of the leaders of Kufr knew the truth and did not abandon it except for some excuse; as the Almighty said: {They exchanged the signs of Allah for a small price} [At-Tawbah: 9], and other verses, such as His saying: {They recognize him as they recognize their sons} [Al-An'am: 20]. If he acts upon Tawhid outwardly while he does not understand it or believe in it with his heart, he is a hypocrite (Munafiq), and he is worse than the pure disbeliever: {Indeed, the hypocrites will be in the lowest depths of the Fire.} [An-Nisa: 145]. This issue is a long one, which becomes clear to you if",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 86
  },
  {
    "serial_number": "7130199",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "you contemplate it on the tongues of people. You see one who knows the truth and leaves acting upon it due to fear of loss of worldly gain or status, or for appeasement. And you see one who acts upon it outwardly but not inwardly, so if you ask him what he believes in his heart, you find he does not know it.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 87
  },
  {
    "serial_number": "7130200",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "But you must understand two verses from the Book of Allah. The first of them: What preceded of His saying: {Make no excuse; you have disbelieved after your belief.} [At-Tawbah: 66]. If you verify that some of the Companions who fought the Romans with the Messenger of Allah (peace be upon him) disbelieved because of a word they said in jest and play, it becomes clear to you that the one who speaks kufr or acts upon it out of fear of loss of wealth or status, or appeasing someone, is greater [in disbelief] than the one who speaks a word joking. The second verse: His saying Almighty: {Whoever disbelieves in Allah after his belief... except for one who is forced while his heart is secure in faith. But those who [willingly] open their breasts to disbelief, upon them is wrath from Allah, and for them is a great punishment *",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 88
  },
  {
    "serial_number": "7130201",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "That is because they preferred the worldly life over the Hereafter.} [An-Nahl: 106-107]. Allah did not excuse any of these except the one who was coerced while his heart remained secure in faith. As for other than this, he has disbelieved after his belief—whether he did it out of fear, appeasement, stinginess with his homeland, family, clan, or wealth, or did it in jest, or for other purposes—except the coerced one. The verse indicates this from two aspects:",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 89
  },
  {
    "serial_number": "7130202",
    "category_id": "36",
    "category": "Comprehensive Collections",
    "book_title": "Kashf al-Shubuhat (Removal of Doubts)",
    "edition": "First, 1441 AH - 2020 AD",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "The first: His saying: {except for one who is forced}; Allah did not make an exception except for the coerced one. And it is known that a person is not coerced except regarding speech or action; as for the belief of the heart, no one can coerce another regarding it. The second: His saying: {That is because they preferred the worldly life over the Hereafter}; He explicitly stated that this disbelief and punishment were not due to belief [in the heart], ignorance, hatred of religion, or love of disbelief. Rather, the cause was that he had a share of worldly fortunes in that [act], so he preferred it over the religion. And Allah knows best. Completed with the praise of Allah.",
    "foot_note": "None",
    "book_id": "1097",
    "new_page_number": 90
  }
]