[
  {
    "text": "Following the Sunnah and Avoiding Innovations\nAuthor: ضياء الدين أبو عبد الله محمد بن عبد الواحد المقدسي\nYear: 643",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 83\nbook_title: اتباع السنن واجتناب البدع\nbook_link: https://shamela.ws/book/178\nbook_id: 178\nauthor_name: ضياء الدين أبو عبد الله محمد بن عبد الواحد المقدسي\nauthor_year: 643\nnickname: أبو عبد الله\nauthor_link: https://shamela.ws/author/603\nauthor_ID: 603\neditor: دراسة وتحقيق: محمد بدر الدين القهوجي، محمد الأرناؤوط\npublisher: دار ابن كثير، دمشق - بيروت\nedition: الأولى، 1407 هـ - 1987 م\npages: 76\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "15150",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Creed\nBook: Following the Sunnah and Avoiding Innovations\nAuthor: Diya al-Din Abu Abdullah Muhammad bin Abd al-Wahid al-Maqdisi (d. 643 AH)\nStudy and verification: Muhammad Badr al-Din al-Qahwaji, Muhammad al-Arnaout\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Repeated information omitted for brevity...]",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 3
  },
  {
    "serial_number": "15151",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 19,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful, and in Him we seek help.\nPart of Following the Sunnah and Avoiding Innovations\nFrom Jabir bin Abdullah, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, used to address the people, praising Allah and extolling Him as He deserves, then he would say: (Whoever Allah guides, there is no misleader for him, and whoever He leaves astray, there is no guide for him. The best discourse is the Book of Allah, and the best guidance is the guidance of Muhammad, peace and blessings be upon him. The worst of matters are newly invented ones, and every innovation is a heresy). From Al-Irbad bin Sariyah al-Sulami, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, preached to us...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 4
  },
  {
    "serial_number": "15152",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 20,
    "volume_number": 1,
    "text": "...a sermon from which eyes shed tears and hearts trembled. We said: O Messenger of Allah, it is as if it is a farewell sermon, so advise us. He said: (I advise you to fear Allah and to listen and obey, even if an Abyssinian slave [is appointed over you]. For whoever among you lives after me will see much difference. So adhere to my Sunnah and the Sunnah of the Rightly Guided Caliphs; hold onto it and bite onto it with your molars. And beware of newly invented matters, for every newly invented matter is an innovation, and every innovation is misguidance). An authentic hadith narrated by Imam Ahmad. From Abdullah bin Masoud, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: (Beware of newly invented matters, for the worst of matters are newly invented ones, and every newly invented matter is an innovation, and every innovation is misguidance). Narrated by Ibn Majah.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 5
  },
  {
    "serial_number": "15153",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 21,
    "volume_number": 1,
    "text": "From Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace and blessings be upon him, said: (Whoever introduces into this affair of ours that which is not part of it, it is rejected). Narrated by Al-Bukhari and Muslim. And his wording is: (in our affair that which is not from it, it is rejected). From Awf bin Malik al-Ashja'i who said: The Messenger of Allah, peace and blessings be upon him, said: (The Jews split into seventy-one sects, one sect in Paradise and seventy sects in the Fire. And the Christians split into seventy-two sects, seventy-one in the Fire and one in Paradise. And by the One in Whose Hand is my soul...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 6
  },
  {
    "serial_number": "15154",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 22,
    "volume_number": 1,
    "text": "...my nation will split into seventy-three sects, one in Paradise and seventy-two in the Fire. It was said: O Messenger of Allah, who are they? He said: The Congregation [Al-Jama'ah]). Narrated by Ibn Majah. From Abu Saeed al-Khudri that the Messenger of Allah, peace and blessings be upon him, said: (You will surely follow the ways of those before you, handspan by handspan and cubit by cubit, so much so that even if they entered a lizard's hole, you would follow them). We said: O Messenger of Allah, the Jews and the Christians? He said: (Who else?). Narrated by Al-Bukhari. From Jabir bin Abdullah who said: We were sitting with the Messenger of Allah, peace and blessings be upon him, so he drew a line like this in front of him and said: (This is the path of Allah) and he drew a line to his right...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 7
  },
  {
    "serial_number": "15155",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "...and a line to his left, and said: (These are the paths of Satan). Then he placed his hand on the middle line, then recited this verse: (And this is My path, straight, so follow it and do not follow [other] ways, lest they separate you from His way. This has He instructed you that you may become righteous) [Al-An'am: 153]. From Abdullah bin Umar who said: The Messenger of Allah, peace and blessings be upon him, said: (For every deed there is a peak of enthusiasm, and for every peak of enthusiasm there is a slackening. So whoever's slackening is towards my Sunnah has been guided, and whoever's slackening is towards other than that has perished).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 8
  },
  {
    "serial_number": "15156",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 24,
    "volume_number": 1,
    "text": "From Ibn Abbas who said: No year comes upon the people but they innovate a bid'ah (innovation) in it and kill a Sunnah in it, until bid'ahs live and Sunnahs die. From Abu Abd al-Rahman al-Sulami who said: Amr bin Utbah...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 9
  },
  {
    "serial_number": "15157",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "...al-Sulami and Mu'adhad were among people of its companions who took a mosque where they would glorify Allah (say Subhan Allah) between Maghrib and Isha like this and praise Allah (say Alhamdulillah) like this. Abdullah bin Masoud was informed of that, so he said to the one who informed him: When they sit, come to me. So when...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 10
  },
  {
    "serial_number": "15158",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "...they sat, he came to him. Abdullah came wearing his burnus (hooded cloak), until he entered upon them, then he uncovered the burnus from his head and said: I am Ibn Umm Abd. By Allah, you have brought a dark innovation, or have you surpassed the companions of Muhammad, peace and blessings be upon him, in knowledge? Mu'adhad said - and he was an eloquent man - By Allah, we have not brought a dark innovation, nor have we surpassed the companions of Muhammad in knowledge. Abdullah said: If you follow the people (companions), you will have preceded [others] greatly, but if you deviate right or left, you will have strayed far astray. From Amir bin Abdullah bin al-Zubayr who said: I came to my father and he said: Where were you? I said: I found people the likes of whom I have never seen, they remember Allah Almighty such that one of them trembles until he faints from the fear of Allah, so I sat with them. He said: Do not sit with them after this. He saw me as if I didn't take that seriously, so he said: I saw the Messenger of Allah, peace and blessings be upon him, reciting the Quran, and I saw Abu Bakr and Umar, may Allah be pleased with them both, reciting the Quran, and this did not happen to them. Do you think they are more fearful of Allah than Abu Bakr and Umar? I saw that it was so, so I left them.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 11
  },
  {
    "serial_number": "15159",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "From Khalaf bin Hawshab that Jawwab al-Taymi used to tremble during dhikr (remembrance), so Ibrahim al-Nakha'i said to him: If you can control it, then I don't mind not counting you [among the righteous?], and if you cannot control it, then you have opposed one who is better than you. From Amr bin Malik who said: While we were one day with Abu al-Jawza' as he was narrating to us, a man fell down and convulsed. Abu al-Jawza' jumped up and ran towards him. It was said to him: O Abu al-Jawza', he is a man who has epilepsy (al-motah). He said: Indeed...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 12
  },
  {
    "serial_number": "15160",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "...I thought he was one of those jumpers. If he were one of them, I would have ordered regarding him and expelled him from the mosque. Allah Almighty only mentioned them saying: (Their eyes overflow [with tears]) and (their skins shiver). Abu al-Jawza's name is Aws bin Abdullah, a companion of Ibn Abbas. From Abd al-A'la who said: I heard Al-Shafi'i say: I left behind in Iraq something they call: Al-Taghbir (a type of singing/poetry recitation), fabricated by the Zindiqs (heretics) to distract thereby from the Quran.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 13
  },
  {
    "serial_number": "15161",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "Hasan al-Jardi said: He said: I heard Al-Shafi'i Muhammad bin Idris say: I left behind in Iraq something called Al-Taghbir, invented by the Zindiqs, they divert people with it from the Quran. From Al-Harith who said: I heard Abu Abdullah Ahmad bin Hanbal asked: What do you say about Al-Taghbir, for it softens the heart? He said: Innovation (Bid'ah). From Yaqub bin Sufyan: That he asked Abu Abdullah about Sama' (listening to music/singing), so he disapproved of it and forbade listening to it. Abu al-Qasim said: Abu Ali al-Rudhabari was asked about someone who listens to...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 14
  },
  {
    "serial_number": "15162",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "...musical instruments and says: It is lawful for me, for I have reached a degree where the variation of states does not affect [me]. He said: Yes, he has reached, by my life, but to Saqar (Hell). From Abu al-Harith al-Awlasi that he said: I saw Iblis (Satan) in sleep in Awlas, sitting with a group on his right and a group on his left. Iblis said to a group of them: Say something - and they were upon something of Sama' (listening/music) - so they started saying. Abu al-Harith said: So goodness overcame me until perhaps I almost threw myself from the roof. Then he turned to another group and said to them: Dance. So I saw them dancing and gesturing in the dance with nice gestures and screaming and shouting until I was bewildered. Then Iblis said to me: O Abu al-Harith, is this not nice? I said: Yes. He said: I have not found anything to enter upon you with to have authority over you except through this. So the desire for Sama' left my heart, and I did not listen [to it] after that. From Abu Saeed al-Kharraz that he said: I saw Abu al-Qasim...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 15
  },
  {
    "serial_number": "15163",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "...al-Ju'i in a dream after his death, so I said to him: What did Allah do with you? He said: He reprimanded me and made me stand, then He forgave me. I said: For what? He said: You do and you listen, and you practice ecstatic states (tawajud), and you compare Me to Layla and Salma. The just witness Abu al-Fadl Abd al-Wahid informed us in Baghdad that the knowledgeable Imam Abu Muhammad Abdullah bin Abdullah bin Ali bin Ahmad bin Abdullah the Reciter and Grammarian, gave them license (ijazah) and recited of his own poetry:\nAbandoning affectation in Sufism is obligatory ... And affectation is impossible for the poor (fuqara').\nA people whom when darkness stretches, I saw them ... bowing the bowing of the reciters (worshippers).\nAnd ecstasy from them, its place is in the faces ... Then listening (Sama') settles in lowering the gaze.\nThey do not raise a loud voice with that ... They avoid the sites of desires.\nAnd they continue with that a loud voice ... In hardship if it comes and in ease.\nAnd you see them among the people when they come ... Like bright stars in the darkness.\nTheir determinations were true and the resolve of their aims ... And their stations rose above Gemini.\nThey served the Deity in truth and resolve ... And observed the rights of Allah at [all] times.\nAnd dancing is a deficiency according to them in their intellects ... Then the rod (qadib) without concealment.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 16
  },
  {
    "serial_number": "15164",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "This is the motto of the righteous and those who passed ... From the masters of ascetics and scholars.\nSo if you see one opposing their actions ... Then judge him with great misguidance.\nHe recited to us of his own poetry and informed of it via the just witness Abu al-Fadl by license:\nThe sanctity of a person remains upright if ... He was upon verification in his religion.\nHe does not see dancing and the rod ... Nor the tambourine as a path to the correctness of the way.\nAnd likewise the Shiza (castanets?) and rushing into it ... With uncovering heads and clapping.\nThis is the biography of the Zanj (East Africans?) possessing deficiency ... When they rise to commit immorality.\nHe said, may Allah have mercy on him: My brother the Jurist Imam Abu al-Abbas Ahmad bin...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 17
  },
  {
    "serial_number": "15165",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "...Abd al-Wahid bin Ahmad bin Abd al-Rahman al-Maqdisi recited to me from his own utterance, he said: Abu al-Abbas Ahmad bin al-Jajah - he was known by that - and he was a righteous man, God willing, recited to me of his own poetry:\nO asker of me about the path of virtue and etiquette ... About a group whose action led to destruction.\nA people who became accustomed to rest and distanced themselves ... From earning among people and from toil.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 18
  },
  {
    "serial_number": "15166",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "They said without cause Allah is our Provider ... And Allah is our Provider through striving and cause.\nDid not the Lord of the Throne say to Maryam: ... Shake toward you the trunk of the ripe date palm.\nAnd had He willed, He would have brought her provision abundantly ... Without any toil from her or fatigue.\nAnd the provision of the Messenger of Allah, the Lord of creation made it ... Under the spear and the reed (cane?).\nAnd they hastened to amusement and pleasures and took ... The amusement of speech as religion for them with mirth.\nIf they come to a house they say to its owner ... Kiss the hand of the Sheikh possessor of honor and etiquette.\nThis one has insight, this one has spiritual ambition ... He has miracles (karamat) among non-Arabs and Arabs.\nHe walks on water, folds the earth entirely ... And opens every locked intricate door.\nSeek the pleasure of the Sheikh and look where his madhhab (way) is ... And his madhhab is nothing but gold.\nThis, and when the food came, they rushed ... Baring hands upon knees.\nEvery man of them in eating is a dilemma ... And a shaker of the earth on the day of fright by fleeing.\nIf their singer sings, you hear from them ... The screaming of a people struck by woe and war.\nTheir night remains dancing, so if they get tired ... They throw themselves in the corners of the house like logs.\nBeating the rod throughout the days is their occupation ... And dancing is their habit and striking upon striking.\nThey said we have a madhhab and it is the Reality (Haqiqa), no ... We do not speak by the Law (Sharia) nor study in books.\nAnd we do not want from the Most Merciful His Paradise ... Nor do we fear a Blaze that came upon anger.\nAnd the Book of Allah did not inform us of this ... And the Messengers came with encouragement and intimidation.\nThey visited women and fraternized with them, were they protected ... From them, or were they safe from the striking of calamities?\nThey forgot the case of Harut and his companion ... Marut when they drank a cup of destruction.\nAnd the intent of Yusuf, had he not seen a wonder ... A proof from his Creator, so wonder at the wonder.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 19
  },
  {
    "serial_number": "15167",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "And a look left Dawud with burning ... Over his sin, weeping, a brother of distress.\nI disassociate myself to Allah from a people whose action is ... This, and from blaming them as long as I live I will not repent.\nHe said: And my brother, may Allah have mercy on him, informed us that the aforementioned Ahmad recited them and did not attribute them, and the apparent - by Allah - is that they are his:\nO walkers of the paths of aggression and accusation ... And followers of the blessings of the Most Merciful with cursings.\nAnd leavers of the paths of known good (ma'ruf) in health ... And takers of the ways of abandonment and regret.\nYou have clothed the religion in shame from your actions ... Which is not good from Arab or non-Arab.\nYou named the religion from amusement and from play ... A religion and nearness to the Most Merciful, Possessor of Generosity.\nO you who resemble the donkeys of the desert kicking ... When they have filled themselves with greenery and rains.\nWas there in the past from the action of your Master ... Beating the rod and kicking the ground with the foot?\nWe ask Allah Almighty to protect us from all innovations, what appeared of them and what was hidden, and to keep us alive on the Sunnah of our Prophet Muhammad, peace and blessings be upon him, and to cause us to die on his religion, and to grant us success for what He loves and is pleased with of speech, intention, action, and guidance, and to inspire us to give thanks for His blessings, and to increase us from His bounty and portion. Indeed, He is over all things competent, and He is sufficient for us and the best disposer of affairs.\nAs for what follows: The Prophet, peace and blessings be upon him, has mentioned in these hadiths what contains sufficiency for whoever Allah wants his guidance and direction to follow the Sunnah of His Prophet Muhammad, peace and blessings be upon him. And the Prophet, peace and blessings be upon him, has informed: That every newly invented matter is an innovation, and that his nation will split into three - from before it (referring to Jews and Christians?) - and seventy sects, all of them in the Fire except one, and that this nation will follow the ways of those before it handspan by handspan and cubit by cubit.\nInnovations have multiplied in this time of ours and appeared, and a large creation of people have acted upon them, and practiced them as a path to Allah Almighty. Among that: attending singing and flutes, dancing, fraternizing with women, and attending with...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 20
  },
  {
    "serial_number": "15168",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "...beardless boys (mardan), until some of them see that as better than prayer and reciting the Quran. So we seek refuge in Allah from abandonment, and we seek His help to perform gratitude and much remembrance at all times, and we ask Him by His generosity not to give Satan authority over us. And He the Almighty has said: (And whoever Allah wants [to put in] fitnah [trial/error], you will never possess for him [the power to do] anything against Allah. Those are the ones for whom Allah does not intend to purify their hearts).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 21
  },
  {
    "serial_number": "15169",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "Chapter: Mention of the Trial (Fitnah) of Women\nFrom Usama bin Zaid and Saeed bin Zaid bin Amr bin Nufayl that the Prophet, peace and blessings be upon him, said: (I have not left after me a trial more harmful to men than women).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 22
  },
  {
    "serial_number": "15170",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "And in the narration of Abu Khalid: (I have not left upon my nation after me a trial...). This is an authentic hadith narrated by Al-Bukhari and Muslim.\nFrom Abu Saeed, from the Prophet, peace and blessings be upon him, that he said: (Indeed, the world is sweet and green, and indeed Allah has made you successors in it, so He looks at how you act. So fear the world, and fear women...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 23
  },
  {
    "serial_number": "15171",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "...for indeed the first trial of the Children of Israel was concerning women). Authentic, narrated by Muslim.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 24
  },
  {
    "serial_number": "15172",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "Chapter: The Gravity of Touching a Non-Mahram Woman\nFrom Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace and blessings be upon him, used to accept the pledge of allegiance from women verbally with this verse: (That they will not associate anything with Allah). And the hand of the Messenger of Allah, peace and blessings be upon him, never touched the hand of a woman, except a woman he owned (wives/slaves?).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 25
  },
  {
    "serial_number": "15173",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "From Ma'qil bin Yasar who said: The Messenger of Allah, peace and blessings be upon him, said: (For one of you to be stabbed in the head with an iron needle is better for him than to touch a woman who is not lawful for him). This hadith is according to the criteria of Muslim, and Allah Almighty knows best.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 26
  },
  {
    "serial_number": "15174",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "Chapter: Regarding the Prohibition of Entering Upon Women, Seclusion with Them, and Travel Except with a Mahram\nFrom Uqbah bin Amir that the Prophet, peace and blessings be upon him, said: (Beware of entering upon women). A man said: What about the Hamu (in-law)? He said: The Hamu is death.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 27
  },
  {
    "serial_number": "15175",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "Narrated by Al-Bukhari and Muslim. It was narrated from Al-Layth that he said: The Hamu is like the husband's brother and similar.\nFrom Ibn Abbas who said: I heard the Messenger of Allah, peace and blessings be upon him, say: (No [man] shall be alone...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 28
  },
  {
    "serial_number": "15176",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "...with a woman except that with her is a Mahram). A man said: O Messenger of Allah, my wife has gone out for Hajj, and I have enlisted in such-and-such expedition. He said: (Go back and perform Hajj with your wife). Narrated by Al-Bukhari and Muslim.\nFrom Jabir bin Samurah al-Suwa'i who said: Umar bin al-Khattab addressed us...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 29
  },
  {
    "serial_number": "15177",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "...at Al-Jabiyah and said: O people, the Messenger of Allah, peace and blessings be upon him, stood among us as I stand among you and said: (Be good to my companions, then those who follow them, then those who follow them. Then falsehood will spread, until a man bears witness without being asked for testimony, and swears an oath without being asked. So whoever among you wants the center of Paradise, let him stick to the Congregation (Jama'ah), for Satan is with the one, and he is further from two. And no man shall be alone with a woman except that Satan is the third of them. Whoever his good deed pleases him and his bad deed displeases him, then he is a believer). Narrated by Al-Nasa'i.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 30
  },
  {
    "serial_number": "15178",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "From Ubadah bin al-Samit that he said: Do you not see me, I do not get up for assistance (?) nor do I eat except what is softened for me? Yahya said: Meaning soft and warm, and my companion died some time ago. Yahya said meaning: his penis. And it does not please me that I be alone with a woman who is not lawful for me, even if I had what the sun rises upon, for fear that Satan would come and move it. Indeed, it has no hearing nor sight.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 31
  },
  {
    "serial_number": "15179",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "Chapter: The Command to Lower the Gaze\nAllah Almighty said: (Tell the believing men to reduce [some] of their vision) [An-Nur: 30].\nFrom Jarir who said: I asked the Messenger of Allah, peace and blessings be upon him, about the sudden glance, so he ordered me to divert my gaze. Narrated by Muslim in his Sahih.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 32
  },
  {
    "serial_number": "15180",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnah and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "From Abdullah bin Abbas who said: Al-Fadl bin Abbas was riding behind the Messenger of Allah, peace and blessings be upon him, when a woman from Khath'am came to him asking for a verdict. Al-Fadl started looking at her, and she looked at him, so the Messenger of Allah, peace and blessings be upon him, started turning Al-Fadl's face to the other side. She said: O Messenger of Allah, the obligation of Allah upon His servants regarding Hajj has overtaken my father while he is a very old man, unable to stay firm on the mount. Shall I perform Hajj on his behalf? He said: (Yes). And that was during the Farewell Pilgrimage. Narrated by Al-Bukhari and Muslim.\nFrom Ali bin Abi Talib, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, stood...",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 33
  },
  {
    "serial_number": "15181",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "at Arafat while having Usama bin Zaid ride behind him, so he said: (This is the standing place [Mawqif], and all of Arafat is a standing place). Then he moved forward at a moderate pace, and the people began moving right and left, while he turned around saying: (Tranquility, tranquility, O people!) until",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 34
  },
  {
    "serial_number": "15182",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "he came to [Wadi] Muhassir, so he tapped his mount and it trotted until he exited it. Then he returned to his initial pace until he threw the pebbles at the Jamrah. Then they came to the place of slaughter, and he said: (This is the place of slaughter [Manhar], and all of Mina is a place of slaughter). Then a young woman from Khath'am came to him and said: 'My father is old and has become senile, and the obligation of Allah regarding Hajj has come upon him, but he cannot perform it. Will it suffice for him if I perform it on his behalf?' The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Yes). And he began turning the face of Al-Fadl bin Abbas away from her. Then a man came to him and said: 'I threw the pebbles, performed Tawaf al-Ifadah, and put on my clothes, but I did not shave.' He said: (No harm, so shave). Then a man came to him and said: 'I threw the pebbles and shaved, but I forgot and did not slaughter.' He said: (No harm, so slaughter). Then the Messenger of Allah, may Allah's peace and blessings be upon him, went forth and asked for a bucket of Zamzam water, drank from it, and performed ablution. Then he said: (Draw water, O Banu Abd al-Muttalib, for were it not that you would be overcome [by people taking over the task], I would have drawn water myself). Al-Abbas said: 'O Messenger of Allah, I saw you turning the face of your nephew away.' He said: (I saw a young boy and a young girl, and I feared for them from Satan). Abdullah, the son of Imam Ahmad bin Hanbal, narrated it like this.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 35
  },
  {
    "serial_number": "15183",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "From Ibn Buraidah from his father, who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Do not follow a glance with another glance, for the first is for you and the last [the second] is not for you). Narrated by Abu Dawood.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 36
  },
  {
    "serial_number": "15184",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "Chapter: Mentioning that the Adultery of the Eyes is Looking. From Ibn Abbas who said: I have not seen anything more resembling minor sins (Al-Lamam) than the statement of Abu Huraira from the Prophet, may Allah's peace and blessings be upon him: (Indeed, Allah, the Mighty and Majestic, has decreed for the son of Adam his share of adultery (Zina), he will inevitably realize that. The adultery of the eyes is looking, the adultery of the tongue is speaking, the self wishes and desires, and the private parts confirm that or deny it). Authentic, narrated by Al-Bukhari and Muslim.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 37
  },
  {
    "serial_number": "15185",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "Chapter regarding the dislike of looking at young beardless boys (Al-Ahdath). From some companions of Ahmad bin Ibrahim who said: We came to Ma'ruf Al-Karkhi and with us was Fadl, the nephew of Aswad bin Salim, and he was a beautiful boy. He said: We returned to Ma'ruf another time, and the boy was not with us. He said: He came until he stood at the door of the mosque and said: Did they not use to dislike walking with a beautiful boy?! From Abu Ali Al-Rudhabari that he heard Junayd say: came",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 38
  },
  {
    "serial_number": "15186",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "a man to Abu Abdullah bin Muhammad bin Hanbal [Ahmad bin Hanbal] accompanied by a handsome boy. So he asked him: 'Who is this?' He replied: 'My son.' So Ahmad said: 'Do not bring him with you another time.' When he stood up, it was said to him: 'May Allah support the Sheikh, he is a man of integrity and his son is better than him.' Ahmad replied: 'What we intended by this matter does not prevent their integrity; upon this we saw our Sheikhs and this is what they informed us about their predecessors.' And from him, he said: Abu Al-Abbas Ahmad Al-Mu'addib said to me: 'O Abu Ali, from where did the Sufis of our time derive this intimacy with young boys?' I said to him: 'O my master, you know them better, and safety may accompany them in many matters.' He said: 'Far from it, O Abu Ali! We have seen those who had stronger faith than them flee from a young boy when they saw him approaching just as they would flee from an advancing army. For this depends on the times when states [of spiritual ecstasy] overcome their people, so they take it based on the disposition of",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 39
  },
  {
    "serial_number": "15187",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "natures. How great is the danger, how great is the error!!' From Abu Sa'id Al-Kharraz who said: I saw Iblis (Satan) in a dream wearing a belt around his waist, fleeing from our circle. I said: 'Come.' He said: 'What can I do with you? I deceive people with the world, and you have abandoned the world.' He walked a little then returned and said to me: 'There is a subtlety among you.' I said: 'What is it?' He said: 'Companionship with young boys.' Then Abu Sa'id said: 'How few are those who are safe from them.' From Mansour bin Ibrahim who said: They used to dislike sitting with the sons of kings because they have a lust like the lust for women. From Fath Al-Mawsili that he said: I accompanied thirty Sheikhs who were believed to be from the Abdal (righteous saints); all of them advised me upon my parting from them and said: 'Beware of associating with young boys.' From Muhammad bin Ibrahim Al-Sufi who said: Akhwas Al-Jarmi was among",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 40
  },
  {
    "serial_number": "15188",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "the best Sufis I saw in Ramla. He said: My father told me, he said: Abu Al-Aswad Muhammad bin Radwan was from the remnants of the early Sufis, and he was among the best of people in speech and the quickest in response. One day he looked at a man in a mosque in Sur (Tyre) teaching a beautiful boy while laughing at him. He hastened towards him and sat by his side and said to him: 'O brother, have you not heard Allah the Almighty say: (Has the time not come for those who believed that their hearts should become humble at the remembrance of Allah and what has come down",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 41
  },
  {
    "serial_number": "15189",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "of the truth?)' He said: 'Yes.' [Abu Al-Aswad] said: 'Have you not heard Him, Exalted is His mention, warning against the action of a people who were deluded by His forbearance, and took comfort in His generosity, so He said: (And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient).' He said: 'Yes.' He said: 'Then why do you not humble yourself at His word, nor return upon His warning and what was revealed of His Book? I saw you drowning in laughter towards this one who is reading to you, as if you will not be asked about your laughter, nor held accountable for your action. By Allah, by Whom the believers do not swear by the like of Him, if He takes you for a doubt He dislikes, He will make you a lesson for the wise and an example for the ignorant.' The man lowered his head and began to weep, so he stood up and left him. From Abu Zahra Al-Ru'ayni, that he looked at a man joking with a boy in the gathering of Abdullah bin Wahb Al-Masri. He threw down his book, went to him, and said: 'O brother, if you only knew Who you have angered, and to Whose punishment you have exposed yourself by this act of yours, your hand would be shackled to your neck. How many a noble angel has testified against you for what you did, and you angered him with what you made. Do you rebel against the One who created you, and created the creation, and spread sustenance upon you and them? Indeed, with His sight upon you, He does not need a witness against you. If you deny something of what He preserved and reject an act He knew, He will say to your hands: speak, and to your feet: talk, and to your eyes: testify. I wish I knew what your argument against Him will be when your limbs have spoken, and your eyes have testified, your hands have spoken, and your feet have talked? Have you not heard His saying, Mighty and Majestic: (On a Day when their tongues will testify against them... the verse). By Allah, He has established against you an opponent from within yourself and witnesses against you. So where is the excuse when the admission has preceded, and you are mute finding no way to denial?' The man wept until he made Abu Zahra and those present weep.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 42
  },
  {
    "serial_number": "15190",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "Chapter on what is disliked regarding singing. From Abu Umamah that the Messenger of Allah, may Allah's peace and blessings be upon him, said: (It is not lawful to buy singing women [slave girls], nor to sell them, nor to teach them, nor to trade in them, and their price is forbidden [Haram]. And he recited this verse: (And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah without knowledge... the verse). Narrated by Al-Tirmidhi and Ibn Majah.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 43
  },
  {
    "serial_number": "15191",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "From Ibn Abbas who said: This verse was revealed regarding singing: (And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah). He said: It is singing. From Sa'id bin Jubayr from Abu Al-Sahba' that he asked Ibn Mas'ud",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 44
  },
  {
    "serial_number": "15192",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "about this verse: (And of the people is he who buys the amusement of speech to mislead [others] from the way of Allah). Abdullah said: It is - by the One besides Whom there is no god -: Singing. From Mujahid, from Ibn Ma'mar, from Ibn Mas'ud who said: If a man rides a beast and does not mention Allah, Satan rides behind him and says to him: 'Sing.' If he is not good at it, he says to him: 'Wish [or fantasize].' From Safwan bin Umayyah, who said: We were with the Messenger of Allah, may Allah's peace and blessings be upon him, when came",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 45
  },
  {
    "serial_number": "15193",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "Amr bin Qurra. He said: 'O Messenger of Allah, misery has been written upon me, and I do not see myself earning except from my tambourine with my hands. So permit me to sing without obscenity.' The Messenger of Allah, may Allah's peace and blessings be upon him, said: (No permission for you, nor honor, nor comfort to the eye. You lied - meaning O enemy of Allah - Allah has provided you with lawful and good things, but you chose what Allah has forbidden of His provision instead of what Allah, Mighty and Majestic, has made lawful of His lawful things. Had I warned you beforehand, I would have done to you such and such. Stand up and leave me, and repent to Allah. For if you do anything after this warning, I will beat you painfully, shave your head as an example, banish you from your family, and make the looting of your property lawful for the youth of Medina). So Amr stood up, having such disgrace and evil that none",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 46
  },
  {
    "serial_number": "15194",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "knows but Allah. When he turned away, the Prophet, may Allah's peace and blessings be upon him, said: (These disobedient ones, whoever dies among them without repentance, Allah, Mighty and Majestic, will gather him on the Day of Resurrection just as he was in the world, effeminate, naked, not covered from people by even a rag; every time he stands, he falls). From Abu Barza who said: We were with the Messenger of Allah, may Allah's peace and blessings be upon him, on a journey, and he heard the voices of two men singing. The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Who are these two?) It was said to him: So-and-so and So-and-so. He said: (O Allah, cast them into sedition (Fitnah) completely, and throw them into the Fire completely).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 47
  },
  {
    "serial_number": "15195",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "From Abu Amir or Abu Malik Al-Ash'ari that he heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: (There will certainly be people among my nation who deem lawful silk, alcohol, and musical instruments. And people will certainly descend to the side of a mountain; their grazing herd returns to them [in the evening], and a man comes to them for a need, but they say to him: 'Return to us tomorrow.' So Allah, Mighty and Majestic, destroys them at night and brings down the mountain upon them, and transforms others into monkeys and pigs until the Day of Resurrection). Narrated by Al-Bukhari with its meaning.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 48
  },
  {
    "serial_number": "15196",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "From Abdullah bin Masoud that he heard the Messenger of Allah, may Allah's peace and blessings be upon him, say: (Singing grows hypocrisy in the heart). From Abdullah bin Ahmad bin Hanbal, he said: My father told me, he said: Ishaq bin Isa Al-Tabba' told us, he said: I asked Malik bin",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 49
  },
  {
    "serial_number": "15197",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "Anas about what the people of Medina are lenient about regarding singing. Malik said: 'Only the immoral (Fussaq) do that among us.' And from him [Abdullah], he said: I asked my father about singing. He said: 'Singing grows hypocrisy in the heart; it does not please me.'",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 50
  },
  {
    "serial_number": "15198",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "Chapter on what is disliked regarding the flute and the drum. From Ubaid bin Umair from Ibn Abbas who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Iblis said to his Lord: 'O Lord, Adam has been sent down, and I know there will be a Book and Messengers. So what is their Book and their Messengers?' He said: 'Their messengers are the Angels and the Prophets among them, and their books are the Torah, the Psalms, the Gospel, and the Criterion [Quran].' He said: 'So what is my book?' He said: 'Your book is tattoo, your Quran is poetry, your messengers are the soothsayers,",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 51
  },
  {
    "serial_number": "15199",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "your food is what the name of Allah has not been mentioned over, your drink is every intoxicant,",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 52
  },
  {
    "serial_number": "15200",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "your truth is lying, your house is the bathhouse, your traps are women, your muezzin is the flute, and your mosque is the markets). From Nafi' who said: We were with Ibn Umar on a journey, and he heard the sound of",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 53
  },
  {
    "serial_number": "15201",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "a shepherd playing a flute. He put his fingers in his ears and diverted from the path, then said: 'This is how I saw the Messenger of Allah, may Allah's peace and blessings be upon him, do.' From Al-Mut'im bin Al-Miqdam Al-San'ani from Nafi' who said: I was riding behind Ibn Umar when he passed by a shepherd playing a flute. He struck the face of the she-camel and turned her away from the path, and put his fingers in his ears while saying: 'Do you hear?' until the sound stopped. I said: 'I do not hear.' So he returned her to the path and said: 'This is how I saw the Messenger of Allah, may Allah's peace and blessings be upon him, do.'",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 54
  },
  {
    "serial_number": "15202",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "Sulayman bin Musa narrated it from Nafi' similarly. And Imam Ahmad narrated it through his path. From Anas who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Two voices are cursed in this world and the Hereafter: the sound of a flute at a grace [joy], and the sound of wailing at a calamity).",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 55
  },
  {
    "serial_number": "15203",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "From Ikrimah from Abbas, that the Messenger of Allah, may Allah's peace and blessings be upon him, said: (I was sent to destroy the flute and the drum). From Ja'far bin Muhammad from his father, from his grandfather, from Ali who said: Said",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 56
  },
  {
    "serial_number": "15204",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "the Messenger of Allah, may Allah's peace and blessings be upon him: (I came to break the flutes. And my Lord swore: No servant drinks wine in the world except that Allah will make him drink boiling water on the Day of Resurrection, suffering punishment thereafter, or being forgiven). Then the Messenger of Allah, may Allah's peace and blessings be upon him, said: (The earnings of a female singer and a male singer are forbidden [Haram], and the earnings of a fornicator are illicit gain [Suht], and it is a right upon Allah not to enter into Paradise a body that grew from illicit gain). From Abu Huraira that the Messenger of Allah, may Allah's peace and blessings be upon him, said: (Allah will transform [people] from my nation at the end of times into monkeys and pigs). He said: 'O Messenger of Allah, are they Muslims?' He said: (Yes, they testify that there is no god but Allah, and that I am the Messenger of Allah,",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 57
  },
  {
    "serial_number": "15205",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "and they give charity and pray). They said: 'Then what is the matter with them, O Messenger of Allah?!' He said: (They took musical instruments, singing girls, and tambourines, and drank these drinks. So they spent the night with their drink and amusement, and became transformed in the morning). From Ibn Abbas from the Messenger of Allah, may Allah's peace and blessings be upon him, that he said: (Indeed Allah Almighty has forbidden for you wine, gambling, and the Kubah [drum]). And he said: (Every intoxicant is forbidden). Thus narrated Imam Ahmad.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 58
  },
  {
    "serial_number": "15206",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "Chapter on what is disliked regarding dancing and the like. From Uqbah bin Amir who said: The Messenger of Allah, may Allah's peace and blessings be upon him, said: (Everything with which a believer amuses himself is void [falsehood] except three: his training of his horse, his shooting with his bow, and his playing with his wife, for they are truth). Narrated by Abu Dawood. From Mu'awiyah, from the Prophet, may Allah's peace and blessings be upon him, said: (I am not",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 59
  },
  {
    "serial_number": "15207",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "from 'Dad' [amusement/play] and 'Dad' is not from me). Al-Dad: Amusement and play.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 60
  },
  {
    "serial_number": "15208",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Following the Sunnahs and Avoiding Innovations",
    "edition": "First, 1407 AH - 1987 AD",
    "publisher": "Dar Ibn Kathir, Damascus - Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "Nay, whoever looks at things capably... Except fasting and Hajj to the Sacred House. Then prayer and giving Zakat together... Then standing [in prayer] to the Lord of the Throne in the darkness. Then Jihad and teaching the obligations and what... People need of action and speech. You made the story of the Abyssinians your proof... And did not turn to the rulings and wisdom. Why did you not consider what your mother heard... If you were truly her sons, O people of suspicion. Their action was not similar to your action... But you increased in eating and gluttony. You made it a trap to eat bread... And for corruption with the free and the slaves. You made the Sheikh your guide so he led you... To misguidance, and you were of the mute. End of the blessed part, and praise be to Allah alone, and may Allah send blessings upon our master Muhammad and his family and companions.",
    "foot_note": "None",
    "book_id": "178",
    "new_page_number": 61
  }
]