[
  {
    "text": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)\nAuthor: شمس الدين محمد بن أحمد بن عبد الهادي الحنبلي\nYear: 744",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3427\nbook_title: شرح قصيدة ابن فرح الإشبيلي (غرامي صحيح)\nbook_link: https://shamela.ws/book/1055\nbook_id: 1055\nauthor_name: شمس الدين محمد بن أحمد بن عبد الهادي الحنبلي\nauthor_year: 744\nnickname: Null\nauthor_link: https://shamela.ws/author/79\nauthor_ID: 79\neditor: عمر بن سليمان الحفيان\npublisher: دار الفلاح - الفيوم، مصر\nedition: الأولى، 1423 هـ - 2002 م\npages: 66\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3368772",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Sciences\nBook: Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)\nAuthor: Shams al-Din Muhammad bin Ahmad bin Abd al-Hadi al-Maqdisi, then al-Dimashqi al-Hanbali (d. 744 AH)\nWith a commentary by Ibn Urwah al-Hanbali: He included in it an important quote from the words of Sheikh al-Islam Ibn Taymiyyah\nInvestigator: Omar bin Sulaiman al-Hafiyan\n[Book numbering corresponds to the printed version]\nPublication date in Shamela: 27 Rabi' al-Awwal 1444",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 3
  },
  {
    "serial_number": "3368773",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, a good and blessed praise, as our Lord loves and is pleased with. And the most complete and perfect peace and blessings be upon our Prophet Muhammad, his family, and his companions, and whoever is guided by his Sunnah and follows his trace.\nTo proceed: This is a brief and gentle explanation of the poem of Ibn Farah al-Ishbili, \"Gharami Sahih\" (My Love is True), by the Imam, the Hafiz, Shams al-Din, Abu Abdullah, Muhammad bin Ahmad bin Abd al-Hadi, al-Maqdisi, al-Hanbali, who died in the year (744 AH), may Allah Almighty have mercy on him.\nThe poem of Ibn Farah, which is the subject of this explanation, is a poem of sweet meanings and wonderful structure, unique in its field. Its author formulated most types of Hadith sciences within it in a delicate romantic (Ghazal) mold, with a smooth and innovative style. Consequently, it met with acceptance and popularity among scholars and students of knowledge, and they held it in high regard.\nTaj al-Din al-Subki said: This poem is eloquent and comprehensive of most types of Hadith.\nIbn Nasir al-Din said: ...A group has memorized it; and upon understanding it, they have relied.\nTherefore, it received a large share of care and attention, from the era of the author—may Allah have mercy on him—to our current era. It was narrated, emulated, memorized, and explained in many commentaries; ranging from brief to extensive, and from detailed to concise.",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 4
  },
  {
    "serial_number": "3368774",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 6,
    "volume_number": 1,
    "text": "I will indicate what commentaries I was able to find, to demonstrate their care for it and its status among them (1):\n1 - An explanation by Shams al-Din, Muhammad bin Ahmad bin Abd al-Hadi, al-Maqdisi, al-Hanbali, died in the year (744 AH). This is the explanation we are currently verifying and publishing. I do not know if it has been printed before, except for what was done by the Orientalist (Reich), as he published parts of this explanation within his commentary on Ibn Jama'ah's explanation \"Zawal al-Tarah\" in Leiden in the year (1885 CE) (2), but I have not seen his work.\n2 - An explanation by Salah al-Din, Khalil bin Aybak al-Safadi, died in the year (764 AH).\n3 - An explanation by Abu al-Abbas, Ahmad bin Hussein bin Ali bin al-Khatib, al-Qusantini, died in the year (810 AH).",
    "foot_note": "1. See: \"A'yan al-Asr\" by al-Safadi (1/311), \"Al-Risalah al-Mustatrafah\" (1/18), \"Kashf al-Zunun\" (2/1865, 1329), \"Al-A'lam\" by Zirikli (1/195).\n2. Encyclopedia of Islam (1/250). It is worth noting that his action caused a number of those who verified some of Ibn Abd al-Hadi's books or cataloged them in public libraries to fall into illusion and confusion. They named this explanation of his \"Zawal al-Tarah\", and then they transmitted this error and agreed upon it. Note that I have not found anyone among the early scholars who wrote biographies of Ibn Abd al-Hadi mentioning that he has a treatise called \"Zawal al-Tarah\". I have before me nine manuscripts of his mentioned explanation; belonging to different eras and origins, including two precious ancient manuscripts close to the author's time, and in the handwriting of scholars who specialized in Ibn Abd al-Hadi and his school. I did not find in any of them the naming of this treatise as \"Zawal al-Tarah\". And Allah knows best.",
    "book_id": "1055",
    "new_page_number": 5
  },
  {
    "serial_number": "3368775",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 7,
    "volume_number": 1,
    "text": "4 - \"Zawal al-Tarah Sharh Manzumat Ibn Farah\" (The Removal of Sorrow: Explanation of Ibn Farah's Poem) by Izz al-Din, Muhammad bin Sharaf al-Din bin Abd al-Aziz bin Jama'ah, died in the year (819 AH). This explanation of his was printed in the year (1412 AH) with verification by Fahd bin Qabil al-Ahmadi, may Allah reward him with good. It is said: Ibn Jama'ah has three explanations of Ibn Farah's poem; this is one of them.\n5 - An explanation by the Hafiz Qasim bin Qutlubugha al-Hanafi, died in the year (879 AH).\n6 - \"Al-Bahjah al-Saniyyah fi Hall al-Isharat al-Saniyyah\" by Muhammad bin Ibrahim bin Khalil al-Tata'i al-Maliki, died in the year (937 AH).\n7 - An explanation by Shams al-Din, Abu al-Fadl, Muhammad bin Muhammad bin Muhammad al-Uthmani al-Shafi'i, died in the year (947 AH).\n8 - An explanation by Yahya bin Abd al-Rahman al-Qarafi, he finished it in (962 AH).\n9 - \"Al-Muqtarah fi Sharh Abyat Ibn Farah\" by Omar bin Abdullah al-Fasi, died in the year (1188 AH).\n10 - An explanation by Muhammad bin Muhammad al-Amir al-Kabir, died in the year (1232 AH).\n11 - An explanation by Badr al-Din al-Hasani, died in the year (1354 AH).",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 6
  },
  {
    "serial_number": "3368776",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 8,
    "volume_number": 1,
    "text": "Biography of Ibn Farah al-Ishbili (1)\nHe is the Imam, the Hafiz, the Ascetic, Shihab al-Din, Abu al-Abbas, Ahmad bin Farah (2) bin Ahmad bin Muhammad al-Lakhmi, al-Ishbili (from Seville), who settled in Damascus, the Shafi'i.",
    "foot_note": "1. See his biography in: \"Tarikh al-Islam\" by al-Dhahabi (52/383), \"Tabaqat al-Shafi'iyyah\" by al-Subki (8/26), \"Al-Wafi bi al-Wafiyat\" (7/286), \"A'yan al-Asr\" (1/309) both by al-Safadi, \"Nafh al-Tib\" by Ahmad bin al-Maqqari al-Tlemceni (2/528). All of them rely on al-Dhahabi for his biography.\n2. With a Fatha on the Fa. Then the sources differed in vocalizing the Ra on two views:\nFirst: With a Fatha on the Ra (Farah). This is the apparent meaning of al-Safadi's words in \"Al-Wafi\" and \"A'yan al-Asr\", and Ibn Hajar in \"Tabsir al-Muntabih\" (3/1072). It is also the apparent implication of Ibn Jama'ah's naming of his explanation \"Zawal al-Tarah Sharh Manzumat Ibn Farah\", and Omar bin Abdullah al-Fihri's naming of his explanation \"Al-Muqtarah fi Sharh Abyat Ibn Farah\". The requirement of the rhyme (Saj') in the two titles is that \"Farah\" be with a Fatha on the Ra.\nSecond: With a Sukoon on the Ra (Farh). The following explicitly stated the Sukoon of the Ra:\n1. Ibn Nasir al-Din in \"Tawdih al-Mushtabah\" (7/65) and he pointed out Ibn Jama'ah's error in \"Zawal al-Tarah\". Al-Zirikli mentioned in \"Al-A'lam\" (1/194) that he saw it in a precise manuscript of \"Al-Tibyan li Badi'at al-Bayan\" by Ibn Nasir al-Din with a Sukoon on the Ra.\n2. Ahmad bin al-Maqqari al-Tlemceni. He said in \"Nafh al-Tib\": What we received from our Sheikhs is that it is with a Sukoon on the Ra. =",
    "book_id": "1055",
    "new_page_number": 7
  },
  {
    "serial_number": "3368777",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 9,
    "volume_number": 1,
    "text": "He was born on the third of Rabi' al-Awwal, in the year six hundred and twenty-five (625 AH) in Seville. (1)",
    "foot_note": "1. Likewise, the Ra appeared with a Sukoon in the printed version of \"Mu'jam al-Shuyukh\" (1/86) and \"Al-Mu'jam al-Mukhtas\" p. (32), both by al-Dhahabi. And the printed version of \"Tabaqat al-Shafi'iyyah\" by al-Subki (8/26), and the printed version of \"Dhayl al-Taqyid\" by Abu al-Tayyib al-Fasi (2/138). It appears: that whoever vocalized it with a vowel (Fatha) did so based on the general rule and fame, and those who vocalized it with a Sukoon relied on oral transmission (Sama'), and this is more appropriate. Al-Zirikli said: Perhaps his fame is with the vowel movement, but the correct form is with the Sukoon \"Al-A'lam\" (1/195).\nNote: The letter Ha in \"Farah\" appeared as a Jeem (Faraj) in the following sources:\n- Manuscript of \"Al-Kawakib al-Darari\" by Ibn Urwah in two places.\n- And the following printed books: \"Al-Ibar\" (3/395), \"Al-I'lam bi Wafiyat al-A'lam\" p. (292), \"Al-Isharah ila Wafiyat al-A'lam\" p. (385), all by al-Dhahabi. \"Tabaqat Fuqaha al-Shafi'iyyah\" by Ibn Kathir (2/940). \"Durrat al-Hijal\" by Ibn al-Qadi p. (36). \"Mir'at al-Jinan\" by al-Yafi'i (4/231). \"Al-Manhal al-Safi\" by Yusuf bin Taghri Bardi (2/59).\nThis is undoubtedly a mistake; because the absence of dots on the Ha (making it Ha, not Jeem) was explicitly stated by:\n- Al-Safadi in \"A'yan al-Asr\" (1/309) and \"Al-Wafi bi al-Wafiyat\" (7/286).\n- Al-Subki in \"Tabaqat al-Shafi'iyyah\" (8/26).\n- Ahmad bin al-Maqqari in \"Nafh al-Tib\" (2/528).\n- Ibn Nasir al-Din in \"Tawdih al-Mushtabah\" (7/95).\n- Ibn Hajar in \"Tabsir al-Muntabih\" (3/1072).\nWhereas no one stated that it is with a dotted Jeem.",
    "book_id": "1055",
    "new_page_number": 8
  },
  {
    "serial_number": "3368778",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Franks captured him in the year six hundred and forty-six (646 AH), then Allah saved him from their hands. He came to the Egyptian lands in the year six hundred and fifty-something, and he studied Fiqh under Sheikh Izz al-Din bin Abd al-Salam for a short while and heard from him, and from Sharaf al-Din al-Ansari al-Hamawi, al-Mu'in Ahmad bin Zain al-Din, and a group. Then he settled in Damascus, and heard from the Sheikh of the time Ibn Abd al-Da'im, Omar al-Kirmani, Firas al-Asqalani, and many people.\nThe Hafiz al-Dhahabi heard from him and narrated from him in his works, as did al-Dimyati, al-Yunini, al-Birzali, al-Muqatili, al-Nabulsi, and Abu Muhammad bin Abi al-Walid, who was one of the students most attached to him.\nAl-Dhahabi said: He took care of Hadith, and mastered its wordings, meanings, and jurisprudence, until he became one of the great Imams. That is in addition to his piety, truthfulness, devotion, religiosity, good conduct, abstinence, and persistence in working and benefiting others.\nHe died on the eve of Wednesday, the ninth of Jumada al-Akhirah, in the year six hundred and ninety-nine (699 AH), and the people escorted his funeral to the Sufi cemetery.\n\nHis Works:\nThe poem \"Gharami Sahih\", by which he became famous.\nAn explanation of Al-Nawawi's Forty Hadith.\nA summary of Al-Bayhaqi's Khilafiyyat - printed in Riyadh in 1417 AH.\n* * *",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 9
  },
  {
    "serial_number": "3368779",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 11,
    "volume_number": 1,
    "text": "Biography of the Commentator Ibn Abd al-Hadi (1)\nHe is Abu Abdullah, Shams al-Din, Muhammad bin Ahmad bin Abd al-Hadi bin Abd al-Hamid bin Abd al-Hadi bin Yusuf bin Muhammad bin Qudamah, al-Maqdisi, originally from Jamma'il, then al-Salihi. The Hafiz, the Muhaddith, the Jurist, the Reciter, the Grammarian, the Polymath.\nHe was born in the year seven hundred and five (705 AH). It was also said: seven hundred and four (704 AH).\nHis Teachers: Sheikh al-Islam Ibn Taymiyyah, al-Dhahabi, al-Mizzi, Abu al-Fadl Sulaiman bin Hamza, Abu Bakr bin Abd al-Da'im, Isa al-Mut'im, and many others.\nHe died in the year seven hundred and forty-four (744 AH), having not yet reached the age of forty.\nIbn Kathir said: He acquired knowledge that the great Sheikhs did not reach, and he mastered Hadith, Grammar, Morphology, Jurisprudence, Exegesis, the Two Principles (Usul al-Fiqh and Usul al-Din), History, and Readings. He has many useful collections and notes.",
    "foot_note": "1. See: \"Al-Mu'jam al-Mukhtas\" by al-Dhahabi (215), \"Al-Bidayah wa al-Nihayah\" by Ibn Kathir (18/466) Hajar edition, \"Al-Dhayl 'ala Tabaqat al-Hanabilah\" by Ibn Rajab (2/436), \"Al-Wafi bi al-Wafiyat\" (2/161), \"Al-Durar al-Kaminah\" (5/61).",
    "book_id": "1055",
    "new_page_number": 10
  },
  {
    "serial_number": "3368780",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 12,
    "volume_number": 1,
    "text": "He was a good memorizer of the names of narrators and the chains of Hadith transmission, knowledgeable in Jarh wa Ta'dil (criticism and praise of narrators), insightful regarding the defects of Hadith, with a good understanding of it. He was excellent in discussion, of sound mind, upright on the path of the Salaf (predecessors), following the Book and the Sunnah, and persevering in doing good deeds.\n\nHis Most Famous Works:\n1 - Al-Sarim al-Munki fi al-Radd 'ala al-Subki (The Hurtful Sharp Sword in Refutation of al-Subki).\n2 - Al-Uqud al-Durriyyah fi Manaqib Sheikh al-Islam Ibn Taymiyyah (The Pearl Necklaces in the Virtues of Sheikh al-Islam Ibn Taymiyyah).\n3 - Al-Muharrar fi Ahadith al-Ahkam (The Edited Collection on the Hadiths of Rulings).\n4 - Tanqih al-Tahqiq fi Ahadith al-Ta'liq li Ibn al-Jawzi.\nAll of these are printed, and he has many others, both manuscripts and printed.\n* * *",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 11
  },
  {
    "serial_number": "3368781",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 13,
    "volume_number": 1,
    "text": "Biography of Ibn Urwah al-Hanbali (1)\nHe is Abu al-Hasan, Ali bin al-Hussein bin Urwah, al-Mashriqi, then al-Dimashqi. He is known as Ibn Zaknun.\nHe was born before the year (760 AH). In the beginning of his life, he was a camel driver. Then he turned away from that, memorized the Quran, and studied jurisprudence. He heard from Ibn al-Muhibb - as he reported about himself - Yahya bin Omar al-Rahbi, and Omar bin Ahmad al-Jurhumi.\nHe devoted himself to Allah Almighty in the Qadam Mosque, and took care to acquire precious books. He arranged the \"Musnad\" of Imam Ahmad according to the chapters of al-Bukhari, and named it \"Al-Kawakib al-Darari fi Tartib Musnad al-Imam Ahmad 'ala Abwab al-Bukhari\" (The Shining Stars in Arranging the Musnad of Imam Ahmad according to the Chapters of al-Bukhari), and he explained it in one hundred and twenty-seven (127) volumes.\nA great evil arose between him and the Shafi'is, and he was harmed because of his belief.\nHe died on Sunday, the twelfth of Jumada al-Akhirah, in the year (837 AH) at his home in his mosque, which is the Qadam Mosque, located south of the city of Damascus, and it is still standing to this day, and he was buried in it.\nIbn Hajar said: He was an ascetic, a worshiper, obedient, benevolent; he would not accept anything from anyone, and would only eat from the earnings of his own hand.",
    "foot_note": "1. See: \"Inba' al-Ghumr\" (8/319), \"Al-Daw' al-Lami'\" (5/214), \"Al-Suhub al-Wabilah\" (2/732).",
    "book_id": "1055",
    "new_page_number": 12
  },
  {
    "serial_number": "3368782",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Sources Relied Upon in Verification\nIn verifying this treatise, I relied on nine manuscripts, distributed among three families:\n\nThe First Family\nIt comprises three manuscript copies:\n1 - The Copy of Al-Kawakib al-Darari \"The Original\": It is a very precise copy, transcribed by Ibn Urwah al-Hanbali, may Allah have mercy on him, in his great book \"Al-Kawakib al-Darari\" in the thirty-fourth volume (34), from plate (117) to plate (121). Its original is preserved in the Zahiriyah Library under number (565) general.\nThe number of its leaves is (230) plates. In each plate there are two pages, meaning the equivalent of (460) large-sized pages; such that the number of lines per page reached approximately (28) lines. The line contains - on average - about (11 - 15) words.\nIts copyist: is Ibrahim bin Muhammad bin Mahmud bin Badr al-Din al-Hanbali. He finished copying it on Monday, the twenty-fifth of the month of Rabi' al-Akhir, in the year eight hundred and twenty-seven (827 AH). He read it to its author Ibn Urwah himself in eleven sessions (1); in the...",
    "foot_note": "1. See: (L 52, 64, 78, 127, 141, 153, 166, 179, 194, =",
    "book_id": "1055",
    "new_page_number": 13
  },
  {
    "serial_number": "3368783",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 15,
    "volume_number": 1,
    "text": "...Umayyad Mosque in Damascus; except for some sessions which were in the Sheikh's mosque; which is the Qadam Mosque. His son Muhammad and others heard it with him. The script is close to Ruq'ah, readable, clear, and mostly pointed (dotted). The verses of the poem are mostly vocalized with diacritics.\n\n2 - The Copy of Rais al-Kuttab (K): It is an ancient and very precise copy, located within a collection preserved in the Rais al-Kuttab Library in the Suleymaniye Library in Istanbul under number (1153). From plate (280) to plate (288).\nIts copyist: Ahmad bin Abi Bakr bin Khalil bin Ali bin Abd al-Rahman al-Tabarani al-Kamili. It was said about him in \"Al-Maqsad al-Arshad\" (1): The scholar, the exemplar Sheikh, he took great care of Hadith and heard it, and he used to go to extremes in his love for Sheikh Taqi al-Din (Ibn Taymiyyah) and adopted his sayings and actions... He died on Saturday, the nineteenth of Safar, in the year eight hundred and thirty-five, and was buried at the foot of Mount Qasioun. End quote.\nHe finished copying it on the fourth of the month of Dhu al-Hijjah, in the year (819 AH). The script is beautiful, readable, clear, and mostly pointed. The words of the poem and most of the explanation are vocalized. The copy was compared against more than one copy, as appears from the indication of differences between copies in the margin.",
    "foot_note": "1. , 221) of the same volume. () (1/81) and see: \"Al-Suhub al-Wabilah\" (1/112).",
    "book_id": "1055",
    "new_page_number": 14
  },
  {
    "serial_number": "3368784",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 16,
    "volume_number": 1,
    "text": "This copy agrees with the \"Kawakib\" copy to a great extent, and matches it even in some margins and omissions. This implies that their origin is one. These two copies - unlike the rest of the copies - are unique in transmitting a long commentary that includes an important statement by Sheikh al-Islam Ibn Taymiyyah. In both of them, after Ibn Abd al-Hadi finishes discussing the ways of knowing fabricated Hadith, it says: \"Section: Its writer said...\".\nThe ambiguous writer referred to by the pronoun; it appears to be Ibn Urwah himself, due to what is known of his extreme care in documentation; and attributing sayings and works to their authors. So he began the treatise by attributing it to Ibn Abd al-Hadi, then he said after that: \"Section: Its writer said...\" meaning: himself, then he said after that: \"Sheikh al-Islam said...\".\nFurthermore, the style of speech, its method, and the spirit of research is the style, method, and spirit of Ibn Urwah. Supporting this: Wonders were reported about Ibn Urwah - may Allah have mercy on him - regarding his truthful intuition (Firasa) and unveiling, knowing the inner realities of matters, and distinguishing truth from falsehood, and this is exactly the subject of the treatise.\nIbn al-Mubarrid said: \"He had a regular session, and he had great intuition... And our Sheikh Shihab al-Din bin Zaid said: No one entered his assembly with something in his heart except that he spoke about that matter. It was told that a person who was in a state of major impurity (Janabah) which he had forgotten, entered his assembly, so the Sheikh called a man and said to him: Tell this person to go and wash himself and then come...\" (1).\nOr it could be Ahmad bin Abi Bakr al-Kamili, the copyist of the Rais al-Kuttab manuscript; because he said at the end of it: \"And I have added margins to it, and in the original, and I indicated that...\" and he, may Allah have mercy on him, is known for adding to the books that...",
    "foot_note": "1. \"Al-Jawhar al-Munaddad\" p. (96, 97) and see the rest of his words for they are very important.",
    "book_id": "1055",
    "new_page_number": 15
  },
  {
    "serial_number": "3368785",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 17,
    "volume_number": 1,
    "text": "...he copies. They mentioned in his biography that he copied \"Tarikh Ibn Kathir\" in his own handwriting and added good things to it. But these additions might have been mentioned by Ibn Kathir in another place (1). So it appears that he transferred this treatise in its entirety from \"Al-Kawakib al-Darari\" by Ibn Urwah - may Allah have mercy on everyone - and Allah knows best.\nThus; regarding the transmission of benefits by Ibn Urwah and al-Kamili:\n- Establishing the attribution of the treatise to its author; due to their closeness in time to him, and being from his city \"Damascus\", and agreeing with him in School of Jurisprudence (Madhhab), Creed, and Dawah. It is no secret the extreme interest and superior care Ibn Urwah - may Allah have mercy on him - had for Ibn Taymiyyah and his school; of which Ibn Abd al-Hadi - may Allah have mercy on him - is considered one of its notables, defenders, and flag bearers. Likewise, what was mentioned in the biography of al-Kamili regarding his fondness and interest in Ibn Taymiyyah and his school.\n- Accuracy and precision in transmitting the treatise; because Ibn Urwah often transmits the treatises and fatwas of Ibn Taymiyyah and his students directly from their handwriting, or from the handwriting of some of their students, or the treatise would be from his narrations.\n\n3 - The Leiden Copy (L): It is a copy located within a collection preserved in Leiden, Netherlands, from plate (63) to plate (66). I did not identify its copyist, nor the date of its copying. Its script is ordinary Naskh, clear, and pointed. It agrees with the copy of Ibn Urwah and al-Kamili. It falls short of them in accuracy and precision. Although it is a compared copy, there are many omissions and misspellings in it.",
    "foot_note": "1. \"Al-Maqsad al-Arshad\" (1/81).",
    "book_id": "1055",
    "new_page_number": 16
  },
  {
    "serial_number": "3368786",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 18,
    "volume_number": 1,
    "text": "The Second Family\nIt comprises four late manuscript copies, photos of which are in the Manuscripts Department at King Saud University in Riyadh. Their numbers are:\n(S 1): 2503/ 2 M.\n(S 2): 7720/ 2 M.\n(S 3): 7525/ 1 M.\n(S 4): 7780/ 1 M.\nThese are late copies full of omissions and misspellings, and some of them agree with others on a number of omissions and misspellings. Then each copyist took his share of omission and misspelling. However, they are not devoid - collectively - of benefit.\n\nThe Third Family\nIt comprises two manuscripts:\n1 - (Sad): It is located within an original collection preserved in the King Faisal Center for Research and Islamic Studies - Manuscripts Department under number (2939). The seal and the first ownership of the collection were obliterated, and most of its treatises were lost such that I was unable to know the name of the treatise's copyist, or the date of copying. It is a complete copy, and its script is clear, pointed, and readable.\nThis manuscript is distinguished from the rest of the manuscripts by an important matter, which is that it is full of important and useful additions in the explanation; indeed, the wording of some paragraphs differs. Perhaps it is a first output (edition) of the book, then the commentator Ibn Abd al-Hadi - may Allah have mercy on him - returned to it with revision and abbreviation, and the opposite...",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 17
  },
  {
    "serial_number": "3368787",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 19,
    "volume_number": 1,
    "text": "...is possible, although this is more likely; because the Muhaddithun (Hadith scholars) and investigating Imams were more inclined towards abbreviation and revision than towards addition and expansion; as seen by a number of researchers. And Allah knows best.\n\n2 - (S 5): A copy preserved in the Manuscripts Department - at King Saud University under number (5973). It is a patchwork copy from the Second and Third Families. The first three plates of it were written in a large and clear Naskh script consistent with the Second Family. Then some additions from the Third Family were appended to the margin in a different script. This takes up until approximately the end of the \"Mudraj\" (Interpolated) section. Then it was completed in a different script; consistent perfectly with the Third Family (Sad).\n\nHowever; upon comparing the text of the poem found in our originals with some sources that took care to transmit it; I was alarmed by the abundance of differences in the wordings of this poem between the various sources. This is one of the dilemmas of the Arabic script, that it needs pointing with dots, and vocalization with diacritics, just as some letters may resemble each other in drawing, and other issues that are no secret.\nThis matter may lead to misspelling and confusion in reading and transferring from the written text, therefore Muslims since the dawn of Islam relied on oral transmission and receiving from the mouths of men, and they did not rely on \"Wijadah\" (finding a book); except in later eras.\nIt seems that this problem was existing and rampant in the era of the poet, and they were suffering from this matter severely.\nHis student al-Dhahabi said: \"This was done by several Imams (which is burying their books), and it is...",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 18
  },
  {
    "serial_number": "3368788",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 20,
    "volume_number": 1,
    "text": "...indicative that they do not see the transmission of knowledge by 'Wijadah' (finding books), for the script may be misspelled by the transcriber, and it is possible that a letter is added in the script changing the meaning, and the like. But today, the breach has widened, and the acquisition of knowledge from the mouths of men has decreased, and even from books free of errors, and some of those transmitting issues may not know how to spell.\" (1).\nTherefore; I selected the most reliable of those sources, and compared the poem against them, and alerted to the important differences in the footnote. Here is a brief description of them:\n1 - \"Al-Mu'jam al-Latif\" by Imam al-Dhahabi. It is a dictionary of his Sheikhs which he extracted for himself, and he sufficed in it with mentioning one narration from each Sheikh, and did not undertake their biographies; because he exhausted that in his large dictionary... The bulk of the narrations are Hadiths and Athar (traces), and it contains some quotes, and he concluded it with the poem of his Sheikh, the Hafiz Ahmad bin Farah al-Ishbili on the types of Hadith, famous as \"Gharami Sahih\" (2).\nAl-Dhahabi said at the end of it: \"The Hafiz, the Exemplar, Shihab al-Din, Abu al-Abbas, Ahmad bin Farah al-Ishbili recited to us of his own composition; in the year six hundred and ninety-five, he said: ...\" then he quoted the text of the poem completely.\nI have two manuscript copies of it:\nA - The Zahiriyah copy (M 1), which is preserved in the Zahiriyah Library in Damascus under number (12/ 3745) general. It is copied directly from al-Dhahabi's handwriting. Its copyist is Muhammad bin Abi Bakr bin Abi Omar bin Zurayq, dated eight hundred and thirty-seven. (837 AH).",
    "foot_note": "1. \"Al-Siyar\" (11/377).\n2. From the introduction to the verification of \"Al-Mu'jam al-Latif\" p. (7) within the collection \"Six Treatises by Hafiz al-Dhahabi\" verification: Jasim al-Dosari, may Allah reward him with good.",
    "book_id": "1055",
    "new_page_number": 19
  },
  {
    "serial_number": "3368789",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 21,
    "volume_number": 1,
    "text": "B - The copy of the grandson of Ibn Hajar al-Asqalani (M 2), and there is a copy of it on tape at Imam University in Riyadh under number (725/ 2). Its copyist is the grandson of Ibn Hajar al-Asqalani.\n2 - \"Tabaqat al-Shafi'iyyah al-Kubra\" (T) by Taj al-Din, Abu Nasr, Abd al-Wahhab bin Ali bin Abd al-Kafi al-Subki, died in the year (771 AH) (8/ 27) verification: Abd al-Fattah Muhammad al-Helw - Mahmoud Muhammad al-Tanahi. Al-Subki said: \"The Hafiz Abu al-Abbas, Ahmad bin al-Muzaffar bin Abi Muhammad al-Nabulsi recited to us - by my reading to him - I said to him: The Sheikh, the Imam, the Ascetic, Shihab al-Din, Abu al-Abbas, Ahmad bin Farah recited to you of his own composition...\" then he quoted the poem in its entirety.\n3 - \"A'yan al-Asr wa A'wan al-Nasr\" (A) by Salah al-Din, Khalil bin Aybak al-Safadi, died in the year (764 AH) (1/ 310) Dar al-Fikr edition.\n4 - \"Zawal al-Tarah fi Sharh Manzumat Ibn Farah\" (Z) by Izz al-Din, Muhammad bin Sharaf al-Din bin Abd al-Aziz bin Jama'ah, died in the year (819 AH) verification: Fahd bin Qabil al-Ahmadi.\n5 - \"Nafh al-Tib min Ghusn al-Andalus al-Ratib\" (N) by Sheikh Ahmad bin Muhammad bin Ahmad al-Maqqari, died in the year (1041 AH) (2/ 530) verification: Ihsan Abbas.\n* * *",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 20
  },
  {
    "serial_number": "3368790",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 22,
    "volume_number": 1,
    "text": "Verification Methodology:\n1 - I relied on the First Family (the copy of Ibn Urwah, al-Kamili, and Leiden) for reasons previously explained, and I chose the \"Kawakib\" copy as the original, and compared it with the copy of al-Kamili (K) and Leiden (L).\n2 - Then I compared with the copies of the Second Family (S 1, S 2, S 3, S 4).\n3 - Then I compared with the two copies of the Third Family (Sad, S 5) and established their additions in the footnote.\n4 - I referenced the Hadiths and Athar.\n5 - I provided biographies for some of the less famous figures.\n* * *",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 21
  },
  {
    "serial_number": "3368791",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 23,
    "volume_number": 1,
    "text": "Sample from the Al-Kawakib Copy (The Original)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 22
  },
  {
    "serial_number": "3368792",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 24,
    "volume_number": 1,
    "text": "Sample from the Rais al-Kuttab Copy (K)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 23
  },
  {
    "serial_number": "3368793",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 25,
    "volume_number": 1,
    "text": "Sample from Copy (Sad)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 24
  },
  {
    "serial_number": "3368794",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 26,
    "volume_number": 1,
    "text": "Sample from Copy (S 1)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 25
  },
  {
    "serial_number": "3368795",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 27,
    "volume_number": 1,
    "text": "Sample from Copy (S 2)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 26
  },
  {
    "serial_number": "3368796",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 28,
    "volume_number": 1,
    "text": "Sample from Copy (S 3)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 27
  },
  {
    "serial_number": "3368797",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 29,
    "volume_number": 1,
    "text": "Sample from Copy (S 4)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 28
  },
  {
    "serial_number": "3368798",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of the Poem of Ibn Farah al-Ishbili (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 CE",
    "publisher": "Dar Al-Falah - Fayoum, Egypt",
    "page_number": 30,
    "volume_number": 1,
    "text": "Sample from Copy (S 5)",
    "foot_note": "None",
    "book_id": "1055",
    "new_page_number": 29
  },
  {
    "serial_number": "3368799",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 33,
    "volume_number": 1,
    "text": "This is a poem by the Sheikh, the Imam, the Scholar, the Hafiz, Shihab al-Din, Abu al-Abbas, Ahmad bin Farah (1) al-Ishbili, may Allah Almighty have mercy on him. The explanation is by Sheikh Shams al-Din Ibn Abd al-Hadi, regarding the knowledge of Hadith: Sahih (Sound), Hasan (Good), Gharib (Strange), Musalsal (Patterned), Mursal (Hurried/Disconnected), Da'if (Weak), Matruk (Abandoned); and the knowledge of Sama' (Hearing), Mushafahah (Oral Transmission), Mawquf (Suspended), Marfu' (Raised), Munkar (Denounced), Tadlis (Obfuscation), Muttasil (Connected), Munqati' (Cut-off), Mudraj (Interpolated), Mudabbaj (Mutual Narration), Muttafiq and Muftariq (Agreed and Separated), Mu'talif and Mukhtalif (Aligned and Divergent), Musnad (Supported), Mu'an'an (transmitted via 'an'), Mawdu' (Fabricated), Mubham (Vague), Ghamid (Obscure), Aziz (Rare/Strong), Mashhur (Famous), Maqtu' (Severed), 'Ali (High), Nazil (Low), and others.\nThe Sheikh, the Imam, the Scholar, Abu al-Abbas, Ahmad bin al-Farah (1) al-Ishbili, may Allah Almighty have mercy on him and be pleased with him, said:\nMy love (Gharami) is 'Sahih' (True/Sound) and the hope in you (2) is 'Mu'dal' (Perplexing/Problematic) ... And my sadness and tears are 'Mursal' (Flowing/Hurried) and 'Musalsal' (Continuous/Chained).\nThe Sheikh, the Imam, the Allama, Abu Abdullah, Muhammad bin Ahmad (3) bin Abd al-Hadi said: \nThe Sahih Hadith (Sound Hadith) agreed upon for its soundness: It is the Musnad (connected) hadith that...",
    "foot_note": "1. 'Farah': It appeared in the original and (Sad) and (Sin 5) as 'Faraj' with a Jim, and the verification of this has been presented in detail on pp. (8, 9).\n2. 'In you' (Fik): Pointed out in (K) that in one copy it is: 'From you' (Mink).\n3. 'Bin Ahmad': Not in the original, restored from the rest of the copies and biographical sources.",
    "book_id": "1055",
    "new_page_number": 30
  },
  {
    "serial_number": "3368800",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 34,
    "volume_number": 1,
    "text": "...has a connected chain of transmission through the transfer of an upright, accurate narrator from an upright, accurate narrator (1) until its end, and it is neither Shadh (Anomalous) nor Mu'allal (Defective) (2). Some of it is sounder than others; for example, the narration of Malik, from Nafi', from Ibn Umar is sounder than the narration of others.\nThe Mu'dal (Problematic) — with a Fatha on the dotted Dad — is an expression for a chain from which two or more narrators have fallen consecutively. An example is Malik saying: \"The Messenger of Allah, peace and blessings be upon him, said,\" omitting Nafi' and Ibn Umar (3).\nThe Mursal (Hurried): Is what a Tabi'i (Successor) narrates from the Prophet, peace and blessings be upon him. There is a famous disagreement regarding using it as proof. The correct view is that it requires detailed elaboration (4).\nThe Musalsal (Patterned/Chained) of Hadith is like their saying...",
    "foot_note": "1. 'From an upright, accurate narrator': Not in the original and (K), restored from (Sad), (Sin 3), (Sin 4), and (Sin 5).\n2. Added in (Sad) and the margin of (Sin 5) after 'Mu'allal': 'And if it is said \"Sahih\", this means [the requirements are met], not that it is definitively cut [as absolute fact]. And if it is said \"Not Sahih\", it means its chain is not established.'\n3. Added in (Sad) and the margin of (Sin 5) after this location: 'And it is [also] called Munqati' and called Mursal.'\n4. The phrasing of the definition of Mursal in (Sad) is different from the original, (K), and other branches. It says: 'The Mursal: Is the Tabi'i saying: \"The Prophet, peace and blessings be upon him, said.\" If one person is omitted before the Tabi'i, it is Munqati', and if more, it is Mu'dal and Munqati'. There is famous disagreement on using it as proof, and the correct view is detailed elaboration. Furthermore, the Mursal is a weak hadith according to the majority of Muhaddithin, Al-Shafi'i, and the scholars of Usul. Malik and Abu Hanifa, among a group, said: It is Sahih.'",
    "book_id": "1055",
    "new_page_number": 31
  },
  {
    "serial_number": "3368801",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 35,
    "volume_number": 1,
    "text": "...\"I heard So-and-so say, I heard So-and-so,\" to the end of the chain. Or \"News reached us—by Allah—from So-and-so, who said: News reached us—by Allah—from So-and-so,\" to the end.\nAnd my patience regarding you, reason testifies that it is... 'Da'if' (Weak) and 'Matruk' (Abandoned) while my humiliation is more beautiful.\nThe Da'if Hadith (Weak): Is what is neither Sahih nor Hasan. It is a genus under which fall many types, such as the Shadh (1), the Mu'allal, and (2) the Mudtarib (Confused), and others.\nThe Matruk Hadith (Abandoned): Is what is narrated solely by a man upon whose weakness there is consensus. Sometimes a hadith or a man is abandoned by some Imams while others use him as proof. Allah knows best.\nThere is no 'Hasan' (Good/Beautiful) except hearing your hadith... via 'Mushafahah' (Face-to-face/Oral) dictated (3) to me, so I transcribe.\nThe Hasan Hadith (Good); it is said: It is that whose source is known and whose men (narrators) are famous. It is also said: It is the hadith containing a slight (4) tolerable weakness.",
    "foot_note": "1. In the margin of the original and (K) is the following comment: 'The Shadh (Anomalous) of Hadith: That which has only one chain; narrated uniquely by a trustworthy person or otherwise. If it is from a non-trustworthy person, it is Matruk.'\n2. 'And' (Wa): Not in the original, restored from the rest of the copies.\n3. 'Dictated' (Tumli): Thus pointed in the original. In other copies and (M 2): 'Yumli' (He dictates). In (K), (M 1), (Ta), (Ayn), and (Nun): 'Tumla' (Is dictated - passive).\n4. 'Slight' (Qarib): Not in the original, (K), and (Sin 5). Restored from (Sad), (Sin 2), (Sin 3), and (Sin 4).",
    "book_id": "1055",
    "new_page_number": 32
  },
  {
    "serial_number": "3368802",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 36,
    "volume_number": 1,
    "text": "They have differed greatly regarding its definition and have not defined it with a sufficient parameter. It is said: It is what implies that its narrators are truthful, but it did not reach the degree of Sahih because [the narrator] is not a hafiz (perfect memorizer) and (1) precise. The men of a hadith's chain might be agreed (2) upon regarding their trustworthiness, memory, and precision, yet the hadith is not Sahih. Rather, it may be Hasan or Da'if due to an effective defect in it, or Shudhudh (anomaly), or Idtirab (confusion), or otherwise.\n'Mushafahah' is: Hearing from the words of the Sheikh, and it is higher than reading back to him. Allah Glory be to Him knows best.\nAnd my matter is 'Mawquf' (Suspended/Stopped) upon you and I do not have... upon anyone but you any 'Mu'awwal' (Reliance) (3).\nThe Mawquf Hadith: Is what is narrated from the Companions regarding their sayings, actions, and the like (4). It stops at them and does not go beyond them to the Messenger of Allah, peace and blessings be upon him, as Marfu' (Raised) (5).\nAnd if it were (6) 'Marfu'' (Raised) to you, you would be to me... despite my critics, softening and acting justly.",
    "foot_note": "1. 'And' (Wa): In (K) and (Lam): 'Or' (Aw).\n2. 'Agreed' (Muttafaqan): In the original and (Sin 2): 'Muttafaq'. The established text is from the rest of the copies.\n3. 'Mu'awwal': In (Sad), (Sin 3), (M 1), and (Lam): 'Mu'awwil'.\n4. Added in (Sad) after this place: 'Whether connected or disconnected.'\n5. Added in (Sad) after this place: 'And it is used for others with a restriction; so it is said: So-and-so stopped it (waqafahu) at Al-Zuhri, and the like.'\n6. 'Were' (Kana): In (Sad) and (Sin 1): 'Kunta' (You were).",
    "book_id": "1055",
    "new_page_number": 33
  },
  {
    "serial_number": "3368803",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Marfu' Hadith; it is said: It is what is attributed to the Messenger of Allah, peace and blessings be upon him, specifically; whether connected or disconnected. It is also said: It is what the Companion reports regarding the saying or action of the Messenger, peace and blessings be upon him.\nThe blame of my critic is 'Munkar' (Denounced) I do not swallow it... and a falsehood and 'Tadlis' (Deception) rejected and neglected.\nThe Munkar Hadith (1) is (2): What is narrated uniquely by someone who has not reached the level of trust and precision that allows his unique narration to be accepted. Like the hadith of Abu Zakariya Yahya bin Muhammad bin Qais, from Hisham bin Urwah, from his father, from Aisha, that the Messenger of Allah, peace and blessings be upon him, said: \"Eat unripened dates with dried dates, for when the Devil sees that, it enrages (3) him, and he says: The Son of Adam has lived until he ate the new with the old\" (4).",
    "foot_note": "1. Added in (Sad) after this place: 'It is the individual narration where the text is not known except from its narrator. It is also said: It is what is unique...'\n2. 'Is' (Huwa): Not in the original and (K), restored from the rest of the copies.\n3. 'Enrages' (Ghazahu): In the original and (K): 'Ghadahu' (Diminished him? - likely typo), the established text is from (Sad), (Sin 3), (Sin 5), and 'Al-Irshad - Muntakhab' by Al-Khalili.\n4. Narrated by Al-Nasa'i in 'Al-Sunan Al-Kubra' (6724), Ibn Majah (3330), Abu Ya'la 7/(4399), Al-Uqayli in 'Al-Du'afa Al-Kabir' (4/427), Ibn Hibban in 'Al-Majruhin' (3/120), Al-Hakim (4/121), Abu Nu'aym in 'Tarikh Asbahan' (1/134), Al-Khalili in 'Al-Irshad - Muntakhab' (1/172), and Al-Khatib in 'Tarikh Baghdad' (5/353), all from the path of Abu Zakariya (or Zukayr) with it.",
    "book_id": "1055",
    "new_page_number": 34
  },
  {
    "serial_number": "3368804",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 38,
    "volume_number": 1,
    "text": "Abu Zakariya was unique in narrating it, and he is a righteous sheikh; Muslim included him in his book (1), except that he did not reach the level of one whose unique narration is accepted. Indeed, Ibn Ma'in and others spoke against him (2).\nThe Blameworthy Tadlis (Obfuscation): Is when a man narrates a hadith from a sheikh he was contemporary with, or heard from generally, but did not hear that specific hadith from him. Rather, he heard it from a weak narrator whom he omitted, such as the Tadlis of Baqiyyah, Al-Walid bin Muslim, and others (3). This is contrary to the Tadlis of Ibn Uyainah and others who perform Tadlis...",
    "foot_note": "1. Al-Nasa'i said: This hadith is Munkar. Al-Uqayli said: It is not known except through him (i.e., Abu Zukayr). Ibn Hibban said: This speech has no basis from the hadith of the Prophet, peace and blessings be upon him. Ibn Adi said: Most of his hadiths are straight; except for these hadiths which I have indicated. (He mentioned this hadith among them). Al-Dhahabi said: A Munkar hadith. 'Al-Mizan' (7/216), 'Al-Siyar' (9/299). Ibn Hajar said: The correct view is what Al-Nasa'i said, that it is Munkar 'Al-Nukat' (2/680). Muslim narrated from him as a supporting evidence (Mutaba'ah), not as a primary source (Usul), as Al-Dhahabi pointed out in 'Al-Mizan' (7/215).\n2. Yahya bin Ma'in said: Weak. Al-Uqayli said: He is not followed in his hadith. Abu Hatim said: His hadith is written. Abu Zur'ah said: His hadiths are acceptable (Mutaqarib) except two hadiths he narrated. Ibn Hibban said: He used to flip chains of transmission and raise Mursal hadiths without intent; he is not used as proof. 'Tahdhib al-Kamal' 31/525.\n3. The phrase defining Tadlis is formulated differently in (Sad). It says: 'Blameworthy Tadlis is when he narrates a hadith from a sheikh he was contemporary with but did not hear from, naming him in a way that suggests hearing (Tawahhum), or naming his sheikh, or giving him a Kunya, or attributing him in a way he is not known by, like the Tadlis of Baqiyyah, Al-Walid bin Muslim, and others.'",
    "book_id": "1055",
    "new_page_number": 35
  },
  {
    "serial_number": "3368805",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 39,
    "volume_number": 1,
    "text": "...from (1) trustworthy narrators, for that is not blameworthy. Allah Glory be to Him knows best.\nI spend my time regarding you in 'Muttasil' (Connected) sorrow... and 'Munqati'' (Cut off) from that which I try to reach.\nThe Muttasil Hadith (Connected): Is that whose chain is connected, such that every one of its narrators heard it from the one above him, until it reaches its end. Generally, it applies to the Marfu' and Mawquf. An example of the Muttasil Marfu' from 'Al-Muwatta': Malik, from Ibn Shihab, from Salim bin Abdullah, from his father, from the Messenger of Allah, peace and blessings be upon him (2). An example of the Muttasil Mawquf: Malik, from Nafi', from Ibn Umar, from Umar, his saying.\nThe Munqati' (Cut off/Broken): Is the hadith whose chain is not connected, such that a man, or two, or three, or more have fallen from it (3). Allah knows best.\nAnd here I am, in the shrouds of your abandonment, 'Mudraj' (Wrapped/Inserted)... You burden me with what I cannot bear, yet I carry it.\nThe Mudraj Hadith (Interpolated): Is what is inserted into the hadith of the Messenger of Allah, peace and blessings be upon him, from the speech of some of its narrators. Such that the Companion or whoever is after him mentions...",
    "foot_note": "1. 'From' (An): In the original and (K): 'Upon' (Ala), the established text is from the rest of the copies.\n2. 'From the Messenger of Allah, peace and blessings be upon him' is missing from the original and (K), restored from the rest of the copies.\n3. Added in (Sad) after this place: 'It is mostly used for the narration of someone below the Tabi'i from a Companion, like Malik from Ibn Umar, may Allah be pleased with them both.'\n4. In (Z): 'Mudrajan'.",
    "book_id": "1055",
    "new_page_number": 36
  },
  {
    "serial_number": "3368806",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 40,
    "volume_number": 1,
    "text": "...speech from himself following what he narrates of the hadith. Then, whoever comes after him narrates it connected to the hadith, without separating between them by mentioning the speaker. Thus, the matter becomes confused to one who does not know the reality of the situation, and he imagines that it is all from the Messenger of Allah, peace and blessings be upon him. This occurs often in Hadith. Allah knows best.\nI made my tears flow with blood (1) 'Mudabbaj' (Embellished/Mutual)... and it is nothing but my soul dissolving (2).\nThe Mudabbaj in Hadith: Is when peers (3) narrate from each other. Like Abu Hurayrah and Aisha; Malik and Al-Awza'i (4); and Ahmad bin Hanbal and Yahya bin Ma'in (5). If one of the peers narrates from the other, but the other does not narrate from him, it is not called Mudabbaj, like the narration of Sulayman al-Taymi from Mis'ar without the reverse. Allah Glory be to Him knows best.",
    "foot_note": "1. 'With blood' (Bi al-dima'): Thus it appeared in the original, (K), (M), (Ta), and (Nun). Whereas in (Sin 4) and (Z) it is: 'Over my cheek' (Fawqa khaddi). In (Sad) and (Sin 5): 'With hope' (Bi al-raja'), then corrected in the margin of (Sin 5) with a different pen to: 'Over my cheek'.\n2. 'Dissolving' (Tatahallalu): In (Sad): 'Tatajaljalu' (Resounding).\n3. Added in (Sad) and (Sin 5) after this place: 'In age and chain of transmission (Isnad).'\n4. 'Al-Awza'i': In its place in (Sin 5): Sufyan bin Uyainah.\n5. 'Yahya bin Ma'in': Thus in the original and (Sin 1). In its place in (Sad), (Sin 3), (Sin 4), and (Sin 5): 'Ali bin al-Madini'. In (Sin 2): 'Ali bin al-Madini or Yahya bin Ma'in'.",
    "book_id": "1055",
    "new_page_number": 37
  },
  {
    "serial_number": "3368807",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 41,
    "volume_number": 1,
    "text": "So 'Muttafiq' (Agreed) are my eyelid, my sleeplessness, and my tear... and 'Muftariq' (Parted) are my patience and my confused heart (1).\nAnd 'Mu'talif' (Aligned) are my passion, my sorrow, and my anguish... and 'Mukhtalif' (Different/Divergent) is my luck and what I hope from you (2).\nThe Mu'talif and Mukhtalif (Aligned and Divergent): Is what agrees in the form of the script but differs in the pronunciation of the word. Like 'Aththam bin Ali and Ghannam bin Aws (3). And Bashir bin Amr (4) and Bushayr bin Yasar (5). And Hariz bin Uthman and Jarir bin Abd al-Hamid. And Hudayn bin al-Mundhir and Husayn bin Abd al-Rahman.",
    "foot_note": "1. 'The confused' (Al-mubalbal): In the original: 'Mubalbal al-mubalbal', and in (K): 'Mubalbal' and he indicated in the footnote that in another copy it is: 'Al-mubalbal'.\n2. 'From you I hope' (Minka ammal): Thus pointed in the original. In (K): 'Minka ammil'. In (Sin 3), (Sin 4), (M 1), (M 2), (Ta), and (Z): 'Fika amil' (In you I hope). In (Sin 1), (Sin 2), (Sin 5), (Sad), and (Ayn): 'Minka amil'.\n3. See 'Al-Mu'talif wa Al-Mukhtalif' by Al-Daraqutni (4/1763).\n4. 'Bashir bin Amr': In the original and (K): 'Bushayr bin Umar', and a waw was appended after 'Umar' in (K). The established text is from (Sin 2), (Sin 3), and (Sin 4). See: 'Al-Jarh wa Al-Ta'dil' by Al-Razi (2/375), 'Talkhis Al-Mutashabih fi Al-Rasm' by Al-Khatib Al-Baghdadi (1/497), and 'Tawdih Al-Mushtabih' by Ibn Nasir al-Din (1/536).\n5. 'Bushayr bin Yasar': In the original and (K): 'Bashir bin Bashar'. The established text is from the rest of the copies. See: 'Tahdhib al-Kamal' (4/187), and 'Hady al-Sari' p. (210) where 'Yasar' was misspelled as 'Bashar', so be aware.",
    "book_id": "1055",
    "new_page_number": 38
  },
  {
    "serial_number": "3368808",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 42,
    "volume_number": 1,
    "text": "As for the Muttafiq and Muftariq (Agreed and Separated): It is what agrees in script and pronunciation; unlike the Mu'talif and Mukhtalif, which has agreement in the form of the script with separation (difference) in pronunciation. The Muttafiq and Muftariq has many categories. Among its examples: Abu Imran al-Jawni (1), two people. One of them (2): The Tabi'i Abd al-Malik bin Habib. The second, his name is: Musa bin Sahl, a Basran who lived in Baghdad and narrated from Hisham bin Ammar and others. Da'laj bin Ahmad and others narrated from him. Also among them: Muhammad bin Abdullah al-Ansari, two close in class (Tabaqa): One of them: The famous Ansari, the Judge, Abu Abdullah, the Sheikh of Al-Bukhari. The second: His kunya is Abu Salamah, they declared him weak. Also among them: Muhammad bin Ya'qub bin Yusuf al-Naysaburi, two people both in one era, and Al-Hakim Abu Abdullah and others narrate from both of them. One of them is known as Abu al-Abbas al-Asamm. The second is Abu Abdullah al-Akhram al-Shaybani, and he is known as 'The Hafiz' unlike the first. Allah Glory be to Him knows best.",
    "foot_note": "1. See 'Kitab Al-Muttafiq wa Al-Muftariq' by Al-Khatib Al-Baghdadi (3/2117).\n2. 'One of them' (Ahaduhuma): Not in the original and (K), restored from the rest of the copies.",
    "book_id": "1055",
    "new_page_number": 39
  },
  {
    "serial_number": "3368809",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 43,
    "volume_number": 1,
    "text": "Take the passion from me 'Musnad' (Supported/Connected) and 'Mu'an'an' (Transmitted via 'from')... For other than me employs tricks with 'Mawdu'' (Fabricated) love (1).\nThe Hafiz Abu Bakr al-Khatib said: The Musnad according to the people of Hadith: Is what has a connected chain from its narrator to its end. It is mostly used for what is narrated from the Prophet, peace and blessings be upon him, rather than what comes from the Companions and others (2). regarding the Musnad, there is a difference of opinion other than this (3).\nAs for the Mu'an'an Chain: It is that in which it is said: 'From (An) So-and-so, from (An) So-and-so.' Some people considered it a type of Mursal. The correct view held by the majority is that it is a type of Muttasil (Connected). Abu Amr al-Dani narrated consensus on this.\nThe Mawdu' Hadith (Fabricated): Is the invented, created, manufactured hadith; which its fabricator created. It is the worst of weak hadiths. It is not permissible for anyone to narrate it except with an explanation of its condition—if he knows its condition—in any sense whatsoever; unless accompanied by a statement of its fabrication.",
    "foot_note": "1. 'With Fabricated' (Bimawdu'): In the original and (K): 'Mawdu'' (Fabricated). The established text is from the rest of the copies and sources of the poem's extraction, noting that sources and copies have varied in the second hemistich of the verse.\n2. 'Al-Kifayah' p. (58).\n3. 'Regarding the Musnad, there is a difference of opinion other than this': In its place in (Sad) and (Sin 5): 'Ibn Abd al-Barr said: It is what comes from the Prophet, peace and blessings be upon him, specifically, whether connected or disconnected. Al-Hakim and others said: It is not used except for the Marfu' Muttasil.'",
    "book_id": "1055",
    "new_page_number": 40
  },
  {
    "serial_number": "3368810",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 44,
    "volume_number": 1,
    "text": "A hadith is known to be fabricated: By the confession of its fabricator, or by the poorness of its wording (1), or other means (2). Allah Glory be to Him knows best (3).\nAnd these (4) are bits of the 'Mubham' (Vague) love, so 'I'tabir' (Consider/Take warning/Corroborate)... And its 'Ghamid' (Obscure), if you desire an explanation, I will transfer/refer (5).\nThe Mubham (Vague) of Hadith: Is what comes from an unnamed person. Like: Sufyan, from a man, from Al-Zuhri (6).\nAs for Al-I'tibar (Consideration/Corroboration): The Hafiz Abu Hatim Ibn Hibban mentioned that the method of 'I'tibar' of reports is exemplified by: Hammad bin Salamah narrating a hadith for which he is not followed (corroborated), from Ayyub, from Ibn Sirin, from Abu Hurayrah, from the Prophet, peace and blessings be upon him.",
    "foot_note": "1. 'By the poorness of its wording': In its place in (Sad) and (Sin 5): 'By the poorness of the wording in the narration or the narrated text.'\n2. Added in (Sad) and (Sin 5) after this place: 'And among the Fabricated is the hadith narrated from Ubayy bin Ka'b regarding the virtues of the Quran surah by surah. Those commentators who mentioned it were mistaken, and Allah knows best.'\n3. The original and (K) transferred a long, precious text after this place, including an important quote from Sheikh al-Islam Ibn Taymiyyah. I decided to delay it to the end of the explanation, so see p. (49).\n4. 'And these' (Wa dhi): In (Sad), (Sin 3), (M 1), and (M 2): 'Dha' (This).\n5. 'I will transfer/refer' (Uhawwilu): Thus in the original, (K), (Ayn), and (Nun) with an un-dotted Ha. In (Sin 4), (Sin 5), (M 1), (M 2), (Ta), and (Z): 'Utawwilu' (I will lengthen). In (Sad): 'Yatul' (It lengthens).\n6. Added in (Sad) and (Sin 5) after this place: 'And like the hadith of Ibn Abbas that a man said: O Messenger of Allah, is Hajj every year? He is Al-Aqra' bin Habis, and the like.'",
    "book_id": "1055",
    "new_page_number": 41
  },
  {
    "serial_number": "3368811",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 45,
    "volume_number": 1,
    "text": "So it is looked into: Did a trustworthy person other than Ayyub narrate that from Ibn Sirin? If found, it is known that the report has a basis to which it returns. If that is not found, then did a trustworthy person other than Ibn Sirin narrate it from Abu Hurayrah? Otherwise, did a Companion other than Abu Hurayrah narrate it from the Prophet, peace and blessings be upon him? Whichever of that is found, it becomes known by it that the report has a basis to which it returns; otherwise, no (1).\nThe Ghamid (Obscure) of Hadith: Is what appears to have the form of the Connected (Muttasil), but is not so. Example: What Abd al-Razzaq narrated, from Al-Thawri, from Abu Ishaq, from Zayd bin Yuthay', from Hudhayfah who said: The Messenger of Allah, peace and blessings be upon him, said: \"If you entrust it to Abu Bakr, he is strong and trustworthy...\" (2) the hadith. This has the form of the Connected, but it is disconnected (Munqati') in two places; because Abd al-Razzaq did not hear it from Al-Thawri, rather he heard it from Al-Nu'man bin Abi Shaybah al-Janadi, from Al-Thawri. And Al-Thawri also did not hear it from Abu Ishaq, rather he heard it from Sharik, from Abu Ishaq. Allah knows best.",
    "foot_note": "1. 'Sahih Ibn Hibban bi Tartib Ibn Balban' (1/155).\n2. Narrated by Al-Uqayli in 'Al-Du'afa Al-Kabir' (3/110), Ibn Adi in 'Al-Kamil' (6/541) (Bio: Abd al-Razzaq al-San'ani), Al-Hakim in 'Al-Mustadrak' (3/142), and in 'Ma'rifat Ulum al-Hadith' p. (71) Type Nine. See: 'Al-Ilal' by Al-Daraqutni (3/214), 'Al-Hilyah' by Abu Nu'aym (1/64), 'Tarikh Baghdad' (3/302), and 'Al-Ilal Al-Mutanahiyah' (1/253).",
    "book_id": "1055",
    "new_page_number": 42
  },
  {
    "serial_number": "3368812",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 46,
    "volume_number": 1,
    "text": "'Aziz' (Rare/Strong/Precious) with you is a lover, humbled by your 'Izz' (Might)... And 'Mashhur' (Famous) among the descriptions of the lover is humility.\n'Gharib' (Strange/Stranger) suffering distance from you (1) and he has not... by your right (2) any 'Mutahawwal' (Moving away/Shift) from the abode of Passion (3).\nThe Gharib (Strange) of Hadith (4): Is like the hadith of Al-Zuhri, Qatadah, and their likes from the Imams of the people of Hadith; those whose hadith are collected. If a man is unique in narrating a hadith from them, it is called Gharib. If two or three narrate from them, or share in a hadith, it is called Aziz. If a group narrates a hadith from them, it is called Mashhur (5). Allah knows best.",
    "foot_note": "1. 'From you' (Ank): In (Z): 'Ankum' (plural you).\n2. Thus! In Sahih Al-Bukhari (2679) and Muslim (1646) from Abdullah bin Umar from the Messenger of Allah, peace and blessings be upon him, that he said: 'Whoever swears, let him swear by Allah or remain silent.' [Translator's Note: The text is quoting a line of poetry that uses \"By your right\" as an oath, and the footnote references the hadith prohibiting swearing by other than Allah].\n3. 'Passion' (Al-Hawa): Thus in the original, (Sin 2), (Sin 4), (Sad), and (Sin 1). In (Sin 3), (M 1), (M 2), (Ta), and (Z): 'Al-Qila' (Hatred). While the second hemistich in (Ayn) and (Nun) came as: 'And by the right of Passion, from his abode he is shifting.'\n4. Added in (Sad) and (Sin 5) after this place: 'It is what contains in the text of the hadith an obscure word far from understanding due to infrequent usage. It is also said: It is what is unique from Al-Zuhri and Qatadah.'\n5. Added in (Sad) and (Sin 5) after this place: 'And it is divided into Sahih and others, and from it comes the Mutawatir known in Fiqh and its principles (Usul).'",
    "book_id": "1055",
    "new_page_number": 43
  },
  {
    "serial_number": "3368813",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 47,
    "volume_number": 1,
    "text": "So be gentle with the one of 'Maqtu'' (Cut/Severed) means, he has... no way to you; no, nor any 'Ma'dil' (Alternative) from you.\nThe Maqtu' of Hadith is different from the Munqati' (Disconnected). Its plural is Maqati' and Maqati. It is (1) what comes from the Tabi'in (Successors), suspended (Mawquf) upon them from their sayings and actions.\nMay you never cease in forbidden might and elevation... And you never cease (2) to 'Ta'lu' (Rise/Be High) through disdain so I 'Anzil' (Descend/Go Low).\nThe Foundation of Isnad (Chain of Transmission) firstly (3) is a virtuous characteristic from the characteristics of this Ummah, and a profound Sunnah from the confirmed Sunnahs. Ibn al-Mubarak said: The Isnad is from the Religion, and were it not for the Isnad, whoever wished would have said whatever he wished (4). Seeking 'Uluw' (Highness/Elevation) in it is also a Sunnah. Imam Ahmad bin Hanbal said: Seeking the High Isnad is a Sunnah from those who passed (5). It was said to Yahya bin Ma'in during his illness in which he died: What do you desire? He said: An empty house and a High Isnad.",
    "foot_note": "1. In (Sad) and (Sin 5): 'It is the Mawquf upon the Tabi'i in speech or action, and Al-Shafi'i, may Allah Almighty be pleased with him, used it for the Munqati'.' \n2. 'You never cease' (Ma Zilta): In (Sad), (Sin 1), (Sin 2), (Sin 3), (Sin 4), (M 1), and (M 2): 'La Zilta' (May you never cease).\n3. 'The Foundation of Isnad firstly': In its place in (Sad) and (Sin 5): 'Knowledge of the High Isnad.'\n4. Narrated by Muslim in the Introduction to his Sahih: Chapter on the explanation that Isnad is from the Religion. (1/15).\n5. Narrated by Al-Khatib in 'Al-Jami'' (1/123).",
    "book_id": "1055",
    "new_page_number": 44
  },
  {
    "serial_number": "3368814",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 48,
    "volume_number": 1,
    "text": "The High Isnad (1) is of types, including: Closeness to the Messenger of Allah, peace and blessings be upon him, with a clean, non-weak chain. This is among the most majestic types of Elevation (2). Imam Muhammad bin Aslam said: Closeness of the Isnad is closeness to Allah, Mighty and Majestic (3).\nI hint with Su'da, and Al-Rabab, and Zaynab... But you are the one meant, and you are the 'Mu'ammal' (Hoped for).\nSo take the first of the last, then the first... Of the half of it, for it is completed in it.\nMore righteous if I swore that regarding his love... I wander in love, and my heart is ignited with 'Sababah' (Infatuation).\nIf you take the first word from the beginning of the last verse, and the first [letters] from the beginning of its half, it becomes \"Ibrahim\" (4). This is what is intended. Allah knows best. (Completed)",
    "foot_note": "1. 'The High Isnad': Thus in the original and (K). In the rest of the copies: 'And the Elevation' (Wa Al-Uluw).\n2. Added in (Sad) and (Sin 5) after this place: 'Second: Closeness to an Imam from the Imams of Hadith; even if the number [of narrators] after him to the Messenger of Allah, peace and blessings be upon him, is large. Third: Elevation relative to the narration of one of the Five Books, or other reliable ones, which is what the later scholars paid much attention to; such as Muwafaqah (Agreement), Musawah (Equality), and Musafahah (Handshaking/Direct Link).'\n3. Narrated by Al-Khatib in 'Al-Jami'' (1/123).\n4. 'It becomes Ibrahim': In (Sin): 'It becomes the name of the one being courted, who is the riddle in these verses, and he is Ibrahim.'",
    "book_id": "1055",
    "new_page_number": 45
  },
  {
    "serial_number": "3368815",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 49,
    "volume_number": 1,
    "text": "Ibn Urwah al-Hanbali said, commenting on the words of Ibn Abd al-Hadi regarding the ways of knowing the Fabricated Hadith: (Section) Its writer said: The heart, if it is pure, clean, and thriving; possesses discernment between truth and falsehood, honesty and lying, guidance and misguidance. Especially if it has obtained illumination and a taste of the Prophetic Light, for then the hidden aspects of matters, the intrigues of things, and the healthy from the sick appear to it. Even if a correct chain were attached to a text whose words (1) are fabricated against the Messenger, peace and blessings be upon him, or a weak chain to a correct text; he would distinguish that and know it, and taste its flavor, and distinguish between its lean and fat, and its healthy and sick. For the words of the Messenger, peace and blessings be upon him, are not hidden from a sane person who has tasted them. For this reason, the Prophet, peace and blessings be upon him, said: \"Beware the physiognomy (Firasa) of the believer, for he looks with the Light of Allah\" (2). Narrated by Al-Tirmidhi from the hadith of Abu Sa'id.",
    "foot_note": "1. 'Its words' (Alfazuhu): In (K): 'Alfaz' (Words).\n2. Narrated by Al-Tirmidhi (3127), Al-Bukhari in 'Al-Tarikh Al-Kabir' 7/ No. (1529), Al-Tabari in 'His Tafsir' (14/46) Ed/ Al-Babi Al-Halabi (Al-Hijr: 75), Al-Uqayli in 'Al-Du'afa Al-Kabir' (4/129), Abu Nu'aym in 'Al-Hilyah' (10/281-282) and others from Atiyyah al-Awfi, from Abu Sa'id al-Khudri with it. Al-Tirmidhi said: This hadith is Gharib, we only know it from this perspective. See: 'Al-Silsilah Al-Da'ifah' by the Allama Al-Albani, may Allah have mercy on him, number (1821).",
    "book_id": "1055",
    "new_page_number": 46
  },
  {
    "serial_number": "3368816",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 50,
    "volume_number": 1,
    "text": "A group of the Salaf said regarding His saying: {Indeed in that are signs for those who discern (Al-Mutawassimin)} [Al-Hijr: 75], meaning: For those who use physiognomy (Al-Mutafarrisin) (1). Mu'adh bin Jabal said: Indeed, the truth has a beacon like the beacon of the road. And if the disbelievers, when they heard the Quran in the state of their disbelief, said: \"Indeed it has a sweetness, and upon it is a grace, and its bottom is abundant, and its top is leafy, and it has a fruit, and it has a dominance over hearts; it is not the dominance of a falsifier\" (2). Then what is the thought regarding the pious, pure believer, who possesses a complete intellect when...",
    "foot_note": "1. Narrated by Ibn Jarir al-Tabari in 'His Tafsir' (14/45-46) Ed/ Al-Babi Al-Halabi (Al-Hijr: 75) from Qais, Ibn Abi Najih, and Ibn Jurayj, from Mujahid. And narrated by Abu Nu'aym in 'Al-Hilyah' (3/194), and from his path Al-Mizzi in 'Tahdhib al-Kamal' (5/84) from Ja'far bin Muhammad al-Sadiq.\n2. Narrated by Al-Hakim (2/506-507), Al-Bayhaqi in 'Dala'il al-Nubuwwah' (2/198-199), Al-Wahidi in 'Asbab al-Nuzul' p. (295), from the path of Abd al-Razzaq al-San'ani, from Ma'mar, from Ayyub al-Sakhtiyani, from Ikrimah, from Ibn Abbas that Al-Walid bin al-Mughirah came to the Prophet... and he mentioned it. Al-Hakim said: Correct chain (Sahih Isnad) on the condition of Al-Bukhari. And Al-Dhahabi agreed. I say: Thus Ma'mar bin Rashid narrated it from Ayyub connectedly. Yahya bin Ma'in said: If Ma'mar narrates to you from the Iraqis, contradict him; except from Al-Zuhri and Ibn Tawus, for his hadith from them is straight. As for the people of Kufa and the people of Basra, then no. 'Tahdhib al-Tahdhib' 10/245. And Ayyub is Basran! Hammad bin Zayd opposed him regarding Ayyub himself, narrating it from Ayyub, from Ikrimah as Mursal. As narrated by Al-Bayhaqi in 'Al-Dala'il' (2/199). Yahya bin Ma'in said: No one is more established in Ayyub than Hammad bin Zayd. 'Al-Jarh wa Al-Ta'dil' 3/ No. (617). And Ma'mar also narrated it from Abbad bin Mansur, from Ikrimah, as Mursal. =",
    "book_id": "1055",
    "new_page_number": 47
  },
  {
    "serial_number": "3368817",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 51,
    "volume_number": 1,
    "text": "...doubts arrive, and a piercing insight when desires arrive? Some of the Salaf said: A servant intends to lie, and I know his intention before he speaks. Allah Almighty has said: {And you will surely know them by the tone of speech} [Muhammad: 30]. Umar bin al-Khattab had a share of that, like his story with Sawad bin Qarib (1) and others. For the Clear Heart has a sense for deviation and perversion in sayings and actions. If it hears a hadith, it knows its exit (source) from where, even if the Hafiz and critics did not speak on it. So whoever's actions are purely for Allah, agreeing with the Sunnah, he distinguishes between things; their falsehood and their truth, by evidences that appear to him on the pages of faces and the slips of tongues. Shah al-Kirmani (2) said: Whoever populates his inner self with constant observation (Muraqabah), and his outer self...",
    "foot_note": "1. In what Ibn Jarir al-Tabari narrated (29/156) Ed/ Al-Babi Al-Halabi (Al-Muddaththir: 18-25). Al-Bayhaqi said about these Mursal aspects: And all of that confirms one another. Then Al-Bayhaqi narrated it from the path of Ibn Ishaq, Muhammad bin Abi Muhammad told me, from Sa'id bin Jubayr or Ikrimah, from Ibn Abbas with it. This Muhammad bin Abi Muhammad; Al-Dhahabi said in 'Al-Mizan': He is not known. () Al-Bukhari narrated (3866) from Abdullah bin Umar who said: While Umar was sitting, a beautiful man passed by him. Umar said: My guess has erred, or this man is upon his religion of Jahiliyyah, or he was their soothsayer... The hadith. Al-Hafiz said: This man is Sawad bin Qarib 'Al-Fath' 7/179. Al-Hafiz Ibn Hajar elaborated on the paths of the story of Sawad bin Qarib in 'Al-Isabah' (3/219) Ed/ Dar Al-Nahda.\n2. He is Abu al-Fawaris, Shah bin Shuja' al-Kirmani. It is said: His origin is from Marw. From =",
    "book_id": "1055",
    "new_page_number": 48
  },
  {
    "serial_number": "3368818",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 52,
    "volume_number": 1,
    "text": "...with following the Sunnah, and lowers his gaze from prohibitions, and accustoms himself to eating Halal; his physiognomy (Firasa) will not err (1). For Allah Glory be to Him is the one who creates terror and darkness in the hearts of the disbelievers, and light and proof in the hearts of the pious. For this reason, Allah mentioned the Verse of Light immediately following lowering the gaze and restraining the self from prohibitions. Likewise, if a servant is truthful of tongue, he is stronger and more complete in knowing lies and fabrications, for the reward is of the same nature as the deed. So Allah rewards the truthful with the sweetness of truth, and he finds a stinging and bitterness for lying that his hearing recoils from and his intellect does not accept. When the delegation of Hawazin came to the Prophet, peace and blessings be upon him, as Muslims, and asked him to return their captives and wealth, he said to them: \"The most beloved speech to me is the truest of it\" (2). For this reason, Ka'b bin Malik, after he went blind, if a man spoke a lie before him, he would say to him: Be silent; for I find from your mouth the smell of lying. And if he heard a lied-upon hadith, he knew its falsehood. That is because he gathered truthfulness for the Messenger of Allah, peace and blessings be upon him, when he returned from the expedition of Tabuk, and Allah revealed...",
    "foot_note": "1. The Sheikhs of Sufism. Died before three hundred. See: 'Tabaqat al-Sufiyyah' by Al-Sulami p. (192), 'Hilyat al-Awliya' (10/237). () Narrated by Abu Nu'aym in 'Al-Hilyah' (10/237).\n2. Narrated by Al-Bukhari (2307, 2308).",
    "book_id": "1055",
    "new_page_number": 49
  },
  {
    "serial_number": "3368819",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 53,
    "volume_number": 1,
    "text": "...Mighty and Majestic: {O you who have believed, fear Allah and be with the truthful} (1) [Al-Tawbah: 119]. For Allah Glory be to Him inspires the truthful, pure one with the knowledge of truth from falsehood, as in the hadith: \"Truth is tranquility (Tuma'ninah), and lying is doubt (Ribah)\" (2). And he said to Wabisah: \"Consult your heart\" (3). And the Prophet, peace and blessings be upon him, left...",
    "foot_note": "1. The story of the repentance of Ka'b bin Malik and his two companions; narrated by Al-Bukhari (4418) and Muslim (2769). Ka'b said after his repentance was revealed: 'O Messenger of Allah, indeed Allah only saved me through truthfulness, and indeed part of my repentance is that I will not speak except the truth as long as I live. By Allah, I do not know of anyone from the Muslims whom Allah tested in truthfulness of speech since I mentioned that to the Messenger of Allah, peace and blessings be upon him, better than He tested me.'\n2. Narrated by Abu Dawud al-Tayalisi (1178), Abd al-Razzaq 3/(4984), Ahmad (1/200), Al-Nasa'i (8/327), Al-Tirmidhi (2518), Al-Tahawi in 'Bayan al-Mushkil' 5/(2140), Ibn Khuzaymah (2348), Abu Ya'la (6762), Ibn Hibban 2/(722), Al-Hakim (2/13) and (4/99), Al-Quda'i in 'Musnad al-Shihab' (275), and many others, from: Burayd bin Abi Maryam, from Abu al-Hawra al-Sa'di, from Al-Hasan bin Ali bin Abi Talib, from the Prophet, peace and blessings be upon him, with it. The hadith was authenticated by: Al-Tirmidhi, Ibn Khuzaymah, Ibn Hibban, Al-Hakim, and Ibn Hajar. See: 'Nata'ij al-Afkar' (2/139). It has supporting narrations and witnesses which I detailed in the takhrij of the hadiths of 'Shifa' al-Alil' p. (336).\n3. Narrated by Ahmad (4/228), Al-Darimi (2575) Ed/ Husayn Asad, Abu Ya'la (1586, 1587), Al-Tahawi in 'Bayan al-Mushkil' 5/(2139), Al-Tabarani in 'Al-Mu'jam Al-Kabir' 20/(403) from Al-Zubayr Abu Abd al-Salam, from Ayyub bin Abdullah bin Mikraz al-Fihri, from Wabisah bin Ma'bad al-Asadi, with it as Marfu'. Ibn Rajab al-Hanbali said: 'In the chain of this hadith are two matters; each necessitates its weakness: =",
    "book_id": "1055",
    "new_page_number": 50
  },
  {
    "serial_number": "3368820",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 54,
    "volume_number": 1,
    "text": "...his Ummah upon a clear whiteness (path), its night is like its day. This is among the most indicative things of what we have said. A person is only compromised, and counterfeit and falsehood enter upon him, due to the deficiency of his following of the Messenger, peace and blessings be upon him; unlike the believer, the doer of good, the follower of him in his sayings and actions. For the sayings of the Messenger, peace and blessings be upon him, possess a majesty and have a 'Namus' (Law/Aura). I have seen a man who, if he heard a hadith narrated from the Prophet, peace and blessings be upon him, and it was not from what he said, would reject it and say: This is fabricated, or weak, or Gharib. Without having heard anything about it [from critics], then it would be investigated, and behold it was as he said, and he rarely erred in this chapter! If it was said to him: From where did you get this? He would say: The speech of the Messenger, peace and blessings be upon him, has a majesty, and in it is a virility not found in other people, and likewise the speech (1) of his Companions. I used to investigate what he said, and I would find it mostly as he said. He was among the people who followed the Sunnah most, and hated innovations and desires most. Likewise, this used to occur often.",
    "foot_note": "1. One: Its disconnection between Al-Zubayr and Ayyub, for he narrated from a people he did not hear (Thus! And perhaps it is: name). Second: The weakness of this Al-Zubayr. Al-Daraqutni said: He narrated Munkar hadiths. Ibn Hibban also weakened him. This hadith has been narrated from the Prophet, peace and blessings be upon him, from multiple perspectives, and some of its paths are good.' 'Jami' al-Ulum wa al-Hikam' Hadith (27). () 'Speech' (Kalam) in (K): 'La-kalam' (Indeed the speech).",
    "book_id": "1055",
    "new_page_number": 51
  },
  {
    "serial_number": "3368821",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 55,
    "volume_number": 1,
    "text": "For the Religion is doing what Allah commanded, and leaving what Allah forbade. Whoever clothes himself inwardly with sincerity and truthfulness, and outwardly with the Sharia; things become pliable for him, and become clear as they really are. Contrary to the state of the people of misguidance and innovation who speak with lies and distortion, introducing into the religion of Allah what is not from it. Look at the words of the Quran; because they were preserved and transmitted by Tawatur (mass transmission), no falsifier or other person coveted to invalidate anything of it, nor to add anything to it. Unlike the Hadith, or much of it, for the distorters and fabricators acted upon it with addition and subtraction, lying and fabrication in its texts and chains. However; Allah established for it those who expel from it the distortion of the extremists, the plagiarism of the falsifiers, and the interpretation of the ignorant, and protect it from the fabrication of the fabricators. So they clarified what the people of lying and fabrication introduced into it, and the people of distortion into its meanings. Like those who compiled the Sahih; such as Al-Bukhari, Muslim, Ibn Khuzaymah, Abu Hatim Ibn Hibban (1), Ibn Mandah, Al-Hakim, Abu Awanah, and those like them who spoke on the Sahih Hadith. Likewise the people of the Sunan; like Abu Dawud, Al-Nasa'i, Al-Tirmidhi, and Ibn Majah. Likewise the people of the Musnads; like the Musnad of Ahmad and similar ones. And like Malik, Abd al-Razzaq, Sa'id bin Mansur, Ibn Abi Shaybah, and others who spoke on Hadith. Likewise those who spoke on the Narrators (Rijal) and their chains; like Yahya bin Sa'id...",
    "foot_note": "1. Added in the original after this place: 'And Ibn Majah', and it appears the scribe's gaze skipped inadvertently to the line following it.",
    "book_id": "1055",
    "new_page_number": 52
  },
  {
    "serial_number": "3368822",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 56,
    "volume_number": 1,
    "text": "...Al-Ansari, Yahya Al-Qattan, Shu'bah, Sufyan, Sufyan (1), Ibn Ma'in, Ibn al-Madini, Ibn Mahdi, and others. These and their likes are the people who defended the hadiths of the Messenger of Allah, peace and blessings be upon him. Contrary to the state of one who compiled books containing many fabricated narrations, while he does not distinguish or know the fabricated and lied-upon from others. So the naive ignorant one comes, sees a hadith in a compiled book, is deceived by it, and transmits it. These are also many, such as: The author of the book 'Wasilat al-Muta'abbidin' compiled by the Sheikh: Umar al-Mawsili (2). And like: 'Tanaqqulat al-Anwar' by Al-Bakri, who placed in it lies that are not hidden from anyone with the slightest shred of intellect. Indeed, the Scholars have criticized the people of (3) Sufism for much of what they mentioned in their books of hadiths which they know (4) are from the fabrications, and of interpretations of verses they know are contradictory [to the truth], despite them being a people who loved [good] deeds.",
    "foot_note": "1. Thus in the original and (K) 'Sufyan and Sufyan' repeated, interpreted as: Sufyan bin Sa'id al-Thawri, and Sufyan bin Uyainah.\n2. He is the Sheikh of Mosul, Abu Hafs, Mu'in al-Din, Umar bin Khadir al-Irbili, al-Mawsili, al-Malla'. He was righteous and ascetic, having stories with Nur al-Din Zanki. King Nur al-Din Zanki ordered his deputies in Mosul not to conclude a matter until they informed Sheikh Umar al-Mawsili of it. He died in the year (570 AH). Al-Zirikli mentioned that there are some manuscript parts of his book 'Wasilat al-Muta'abbidin fi Sirat Sayyid al-Mursalin' in the Institute of Manuscripts. 'Al-Bidaya wa Al-Nihaya' (16/446) Ed/ Hajar. 'Al-A'lam' (5/60).\n3. In the original: 'Aqal' (Less), the established text is from (K) ['Ahl' - People].\n4. 'They know' (Ya'lamun): In the original and (K): 'Ya'lamu'.",
    "book_id": "1055",
    "new_page_number": 53
  },
  {
    "serial_number": "3368823",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 57,
    "volume_number": 1,
    "text": "Likewise the people of Tafsir (Exegesis), they place fabricated hadiths in their Tafsirs. Likewise many of the Jurists (Fuqaha); they use weak or lied-upon hadiths as evidence for issues in their books. Whoever does not distinguish falls into great error, so Allah is the One sought for help. Allah has separated Truth from Falsehood via the People of Light, Faith, and Criticism; those knowing of Transmission, and those tasting the speech of the Messenger, peace and blessings be upon him, via Intellect. They have authored books on that regarding Jarh and Ta'dil (Discrediting and Endorsing). This science is conceded to them; they have methods and knowledge in it exclusive to them. Imam Ahmad said: Three (1) sciences have no bases (Usul): Maghazi (Campaigns), Malahim (Epics/Apocalyptic Battles), and Tafsir. The meaning of that is: It is predominant upon them that they are Mursal (disconnected). Likewise 'Stories of the Prophets' by Al-Bukhari (2) and Al-Tha'labi (3) contain what they contain. The intent: The truthful person encounters hadiths which his heart cuts off [decisively feels] are fabricated or weak.",
    "foot_note": "1. 'Three' (Thalathah): In the original and (K): 'Thalath'.\n2. 'By Al-Bukhari': Thus in the original. In (K): 'By Al-Kisa'i'. Perhaps it is Ishaq bin Bishr bin Muhammad bin Abdullah bin Salim al-Bukhari, author of the book 'Al-Mubtada', which is a famous book wherein he narrated calamities and fabrications. Ibn al-Madini said: A liar. Al-Daraqutni said: Matruk al-Hadith. See: 'Al-Siyar' 9/477.\n3. He is Abu Ishaq, Ahmad bin Muhammad bin Ibrahim al-Naysaburi. His book referred to is named 'Al-Ara'is fi Qisas al-Anbiya'. He died in the year four hundred and twenty-seven. 'Al-Siyar' 17/435.",
    "book_id": "1055",
    "new_page_number": 54
  },
  {
    "serial_number": "3368824",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 58,
    "volume_number": 1,
    "text": "Sheikh al-Islam Abu al-Abbas Ibn Taymiyyah said: The heart populated with Taqwa (God-consciousness); if it prefers [something] based on mere Dirayah (knowledge/comprehension) (1), then it is a legal preference (Tarjih Shar'i). He said: So whenever it occurs to him, and there settles in his heart what he thinks with it that this matter, or this speech, is more pleasing to Allah and His Messenger; this is a preference based on legal evidence. Those who denied that inspiration (Ilham) is a path to realities absolutely were mistaken. If a servant strives in obedience to Allah and His Taqwa, his preference for what he prefers is stronger than many weak evidences. So the inspiration of such a person is a proof in his regard, and it is stronger than many weak and delusional analogies, and the many apparent meanings (Zawahir) and presumptions of continuity (Istishab) that many of those who delve into Madhhabs, differences, and Usul al-Fiqh use as proof. Umar bin al-Khattab said: Draw near to the mouths of the obedient ones, and listen to what they say, for truthful matters are revealed to them. And the Marfu' hadith of Makhul: \"No servant is sincere in worship to Allah Almighty for forty days, except that Allah causes wisdom to flow from his heart, and makes his tongue speak with it\" (2).",
    "foot_note": "1. 'Dirayah': In K: 'Ra'yibi' (His opinion).\n2. Narrated by Al-Husayn al-Marwazi in 'Zawa'id al-Zuhd' by Ibn al-Mubarak (1014), Hannad bin al-Sari in 'Al-Zuhd' (690), Abu Bakr bin Abi Shaybah in 'His Musannaf' (13/231), Abu Nu'aym in 'Al-Hilyah' (10/70) from Abu Mu'awiyah and Abu Khalid al-Ahmar, from Hajjaj, from Makhul with it. Hajjaj is Ibn Artah: He errs and performs Tadlis. Makhul is a Tabi'i and he narrated it as Mursal. It was narrated from Makhul as Musnad Muttasil. Narrated by Abu Nu'aym in 'Al-Hilyah' (5/189), and from his path Ibn al-Jawzi in =",
    "book_id": "1055",
    "new_page_number": 55
  },
  {
    "serial_number": "3368825",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 59,
    "volume_number": 1,
    "text": "And in a narration: \"Except that the springs of wisdom appear from his heart upon his tongue.\" Abu Sulaiman al-Darani said: Indeed, if hearts agree upon Taqwa, they roam the Malakut (Kingdom of Heavens), and return to their owner with the novelties of benefits, without a scholar conveying knowledge to them (1). The Prophet, peace and blessings be upon him, said: \"Prayer is light, Charity is...",
    "foot_note": "1. ...'Al-Mawdu'at' 3/(1628) from the path of Yazid al-Wasiti, from Makhul, from Abu Ayyub al-Ansari, from the Prophet, peace and blessings be upon him, with it. Abu Nu'aym said: Thus Yazid al-Wasiti narrated it. And Ibn Harun narrated it, and Abu Mu'awiyah narrated it from Al-Hajjaj so he made it Mursal. Ibn al-Jawzi said: Yazid al-Wasiti is Yazid bin Abd al-Rahman, Ibn Hibban said: He was full of error and outrageous delusion, contradicting trustworthy narrators in narrations, and it is not permissible to use him as proof. And Hajjaj is wounded (Majruh)... And the meeting of Makhul with Abu Ayyub is not authentic. It was narrated from the hadith of Ibn Abbas and Abu Musa al-Ash'ari. As for the hadith of Ibn Abbas; Al-Quda'i narrated it in 'Musnad al-Shihab' (466), and from his path Ibn al-Jawzi in 'Al-Mawdu'at' 3/(1630) from the path of Sawwar bin Mus'ab, from Thabit al-Banani, from Miqsam, from Ibn Abbas, with it as Marfu'. Ibn al-Jawzi said: Ahmad, Yahya, and Al-Nasa'i said: Sawwar bin Mus'ab is Matruk al-Hadith. Yahya said once: Not trustworthy; his hadith is not written. As for the hadith of Abu Musa al-Ash'ari; Ibn Adi narrated it in 'Al-Kamil' (6/533) - Bio of Abd al-Malik bin Mahran, and from his path Ibn al-Jawzi in 'Al-Mawdu'at' 3/(1629) from the path of Abd al-Malik bin Mahran, Ma'n bin Abd al-Rahman told us, from Al-Hasan, from Abu Musa al-Ash'ari with it. Ibn Adi said: Its text is Munkar, and Abd al-Malik bin Mahran is unknown (Majhul) not recognized. () Narrated by Abu Nu'aym in 'Al-Hilyah' (10/14) from the path of Ahmad bin Abi al-Hawari, from Abu Sulaiman.",
    "book_id": "1055",
    "new_page_number": 56
  },
  {
    "serial_number": "3368826",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 60,
    "volume_number": 1,
    "text": "...a proof (Burhan), and Patience is an illumination (Diya')\" (1). Whoever has light, proof, and illumination; how can he not know the realities of things from the content of their owners' speech; especially Prophetic Hadiths? For he knows that with complete knowledge; because he intends to act upon them, so these things assist him along with emulation and the love of Allah and His Messenger, until the lover knows from the content of his beloved's speech his intent, by hint not by explicit statement.\nThe eye knows from the eyes of its interlocutor... Whether he is from its party or from its enemies.\nAnd as it was said (2): The illumination of the intellect is eclipsed by obedience to desire... While the intellect of the disobey-er of desire increases in illumination.\nIn the Sahih Hadith: \"My servant does not cease to draw near to Me with voluntary deeds until I love him. So when I love him, I am his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his foot with which he walks\" (3). Whoever's success (4) from Allah is like that, how can he not be of piercing insight and an effective soul? If Sin and Righteousness have a fluctuation and roaming in the chests of creation, then what is the state of one for whom Allah is his hearing and sight, while He is in his heart? Ibn Mas'ud said: Sin is the 'Hawwaz' (5) of...",
    "foot_note": "1. Narrated by Muslim (223) from the hadith of Abu Malik al-Ash'ari.\n2. 'And as it was said' is not in the original, restored from (K).\n3. Narrated by Al-Bukhari (6502) from the hadith of Abu Hurayrah.\n4. In the original: 'Yuwaffaq' (Is granted success). The established text is from (K).\n5. With a Fatha on the un-dotted Ha, and a Shaddah on the Waw; it is what possesses them and overcomes them until they commit what is not good. It is said: With a light Waw and a Shaddah on the Zay, plural of Hazzah, which are matters that =",
    "book_id": "1055",
    "new_page_number": 57
  },
  {
    "serial_number": "3368827",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 61,
    "volume_number": 1,
    "text": "...hearts (1). We have presented that lying is doubt (Ribah) and truth is tranquility (Tuma'ninah). So the truthful hadith, the soul finds tranquility in it, and the heart finds tranquility in it.",
    "foot_note": "1. ...Cut into the hearts, scratch and affect them, and flutter in the hearts lest they be sins. This is more famous. See 'Al-Nihayah' (1/377), and 'Al-Targhib wa Al-Tarhib' (2848). () Narrated by Imam Ahmad [See 'Jami' al-Ulum wa al-Hikam' Hadith (27)], and from his path Abu Nu'aym in 'Al-Hilyah' (1/134, 135) from Jarir. Narrated by Ibn Abi Umar al-Adani in 'His Musnad' [See 'Al-Matalib Al-Aliyah' (1605)] from Sufyan bin Uyainah. Narrated by Al-Tabarani in 'Al-Kabir' 9/(8748) from Za'idah. All of them (Jarir, Sufyan, Za'idah) from Mansur, from Muhammad bin Abd al-Rahman bin Yazid, from Abd al-Rahman bin Yazid, from Ibn Mas'ud, with it as Mawquf. Narrated by Al-Tabarani in 'Al-Kabir' 9/(8749) from Za'idah, from Al-A'mash, from Muhammad bin Abd al-Rahman bin Yazid, from Abu al-Ahwas, from Ibn Mas'ud, with it as Mawquf. Sa'id bin Mansur opposed them. He narrated it from Sufyan, from Mansur, from Muhammad bin Abd al-Rahman bin Yazid, from Abd al-Rahman bin Yazid, from Ibn Mas'ud, from the Prophet, peace and blessings be upon him. With it as Marfu'! As narrated by Al-Bayhaqi in 'Shu'ab al-Iman' 10/(5051). The narration of the group is closer to correctness. Al-Mundhiri said: It is said: Its correct form is Mawquf. 'Al-Targhib wa Al-Tarhib' (2848). Ibn Rajab said: Authentic from Ibn Mas'ud, and Imam Ahmad used it as proof. 'Jami' al-Ulum wa al-Hikam' Hadith number (27). I say: Imam Ahmad used it as proof in several places. See 'Al-Wara'' by him pp. (43, 45, 49). Al-Iraqi said: It is known as the saying of Ibn Mas'ud... and its chain is Sahih. 'Takhrij Ahadith al-Ihya'' Comp/ Al-Haddad, number (80).",
    "book_id": "1055",
    "new_page_number": 58
  },
  {
    "serial_number": "3368828",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 62,
    "volume_number": 1,
    "text": "Also: Allah originated (Fitrah) His servants upon the Truth. So if the Fitrah does not change (1); it witnesses things as they are, rejecting their evil and knowing their good. Umar said: The Truth is bright (Ablaj), not hidden to the intelligent. If the Fitrah is straight upon the reality, illuminated by the light of the Quran, things appear to it as they are in those polished mirrors (2), and the darkness of ignorance is negated (3) from it, so it sees matters with eyesight while they are unseen to others. In the 'Sunan' and 'Al-Musnad' and others from Al-Nawwas bin Sam'an, from the Prophet, peace and blessings be upon him, said: \"Allah struck a parable: A straight path, and on the two sides of the path are two walls, and in the two walls are open doors, and on the doors are loose curtains, and a caller calls at the head of the path, and a caller calls from above [the path] (4). The Straight Path is Islam, the loose curtains are the limits of Allah, and the open doors are the prohibitions of Allah. If the servant wants to open a door from those doors, the caller calls him: O Servant of Allah, do not open it, for if you open it you will enter it. The caller at the head of the path is the Book of Allah, and the caller above the path is the Preacher (Wa'iz) of Allah in the heart of every believer\" (5).",
    "foot_note": "1. In the original: 'Tastahil' (Becomes impossible), the established text is from (K).\n2. 'The polished' (Al-Saqilah): In its place is a blank in the original, while it was appended in the margin of (K) and appeared as: (Al-Sa...q...l...) and perhaps the intent is what I established.\n3. In the original and (K): 'Intaqafat'.\n4. Addition from 'Al-Musnad' of Imam Ahmad.\n5. Narrated by Imam Ahmad (4/182), Al-Tabari in 'His Tafsir' (1/75) Ed/ Al-Babi Al-Halabi - (Al-Fatihah: 6), Al-Tahawi in 'Bayan al-Mushkil' 5/(2141), =",
    "book_id": "1055",
    "new_page_number": 59
  },
  {
    "serial_number": "3368829",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 63,
    "volume_number": 1,
    "text": "He has clarified in this magnificent hadith—which whoever knows it benefits from it profoundly; if success aids him, and he dispenses via it with many sciences—that in the heart of every believer is a Preacher (Wa'iz) (1). The Wa'z (Preaching) is: The command and prohibition, the encouragement and deterrence. If the heart is populated with Taqwa, matters become clear and unveiled to it, unlike the ruined, dark heart. Hudhayfah bin al-Yaman said: Indeed, in the heart of the believer is a lamp that shines (2). In the Sahih Hadith: \"The Dajjal has written between his eyes:",
    "foot_note": "1. And (2142), Ibn Abi Asim in 'Al-Sunnah' (19), Ibn Abi Hatim in 'His Tafsir' (33), Al-Tabarani in 'Musnad al-Shamiyyin' (2024), Al-Ramahurmuzi in 'Al-Amthal' (3), Al-Hakim (1/73) and others. From Mu'awiyah bin Salih, from Abd al-Rahman bin Jubayr, from his father, from Al-Nawwas bin Sam'an, with it. Narrated by Ahmad (4/183), Al-Tirmidhi (2859), Ibn Abi Asim in 'Al-Sunnah' (18), Al-Nasa'i in 'Al-Kubra' 6/(11233), Al-Tahawi in 'Bayan al-Mushkil' 5/(2143) from Baqiyyah bin al-Walid, from Bahir bin Sa'd, from Khalid bin Ma'dan, from Jubayr bin Nufayr, from Al-Nawwas, with it. Al-Tirmidhi said: A Hasan Gharib hadith. Al-Hakim said: A Sahih hadith on the condition of Muslim; I do not know any defect for it. Al-Dhahabi agreed. Ibn Kathir said: Its chain is Hasan Sahih. 'Al-Tafsir' (Al-Fatihah: 6). () In the original and (K): 'Wa'iz' (Preacher).\n2. Narrated by Abdullah bin al-Mubarak in 'Al-Zuhd' (1439), Abdullah bin Ahmad in 'Al-Sunnah' (820) - from his father via Wijadah (found manuscript), Abu Bakr bin Abi Shaybah (11/36) and (15/109), Abu Nu'aym in 'Al-Hilyah' (1/276) from Amr bin Murrah, from Abu al-Bakhtari, from Hudhayfah, with it.",
    "book_id": "1055",
    "new_page_number": 60
  },
  {
    "serial_number": "3368830",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 64,
    "volume_number": 1,
    "text": "Kafir (Disbeliever), every believer reads it, literate and non-literate\" (1). This indicates that the believer perceives what others do not perceive. Especially in tribulations (Fitan), and the condition of the lying fabricator against Allah and His Messenger is unveiled to him. For the Dajjal is the greatest liar of Allah's creation; despite Allah conducting tremendous matters and earth-shaking miracles at his hands, such that whoever sees him is tested by him; Allah unveils them to the believer so he believes in their falsehood and invalidity. Whenever Faith strengthens in the heart; the unveiling of matters to it strengthens, and it knows their truths from their falsehoods. Whenever Faith weakens, the Unveiling (Kashf) weakens. That is like the strong lamp and the weak lamp in a dark house. For this reason, some of the Salaf said regarding His saying Almighty: {Light upon Light} [Al-Nur: 35], he said: It is the believer who speaks with wisdom matching the Truth, even if he did not hear a narration (Athar) regarding it. So if he hears a narration regarding it; it is Light upon Light. So the Faith in the heart of the believer matches the Light of the Quran. Thus, the inspiration of the heart is sometimes of the genus of speech, knowledge, and assumption; that this saying is a lie, and that this deed is invalid, or this is preponderant over this and more correct. In 'Al-Sahih' from the Prophet, peace and blessings be upon him, that he said: \"There were in the nations before you Muhaddathun (Inspired ones), so if there is anyone in my Ummah of them, then it is Umar\" (2).",
    "foot_note": "1. Narrated by Al-Bukhari (1131) from the hadith of Anas bin Malik; without his saying: 'Every believer reads it; literate...'. Narrated by Muslim (2934) from the hadith of Hudhayfah; except that he said: 'Writer and non-writer'. Instead of: 'Literate and non-literate'.\n2. Narrated by Al-Bukhari (3689) from the hadith of Abu Hurayrah. Narrated by Muslim (2398) from the hadith of Aisha.",
    "book_id": "1055",
    "new_page_number": 61
  },
  {
    "serial_number": "3368831",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 65,
    "volume_number": 1,
    "text": "The Muhaddath: Is the one inspired (Mulham), addressed in his secret. Whatever Umar said regarding a thing \"I think it is such and such\"; it was as he thought. They used to consider that Sakinah (Tranquility/Divine Presence) speaks upon his heart and tongue. Furthermore: If cosmic matters can be unveiled to the believing servant due to the strength of his faith, as certainty and assumption, then religious matters—their unveiling to him is easier by priority, for he is in greater need of their unveiling. So the believer, evidences regarding things fall into his heart; he cannot express them in most cases, for not everyone can clarify the meanings established in his heart. If a liar speaks before a truthful person, he knows his lie from the content of his speech. The pride of modest Faith enters upon him preventing him from clarification, but he himself has taken his caution against him. Perhaps he hints or declares it out of fear of Allah, and compassion for Allah's creation; so they may beware of his narration or acting upon it. Many of the People of Faith and Unveiling, Allah casts into their hearts that this food is Haram, or that this man is a Kafir, or Fasiq, or Dayyuth, or Lutiy (sodomite), or Khammar (drunkard), or singer, or liar, without apparent evidence, rather by what Allah casts into his heart. Likewise the reverse, He casts into his heart a plea/argument (1) for a person, and that he is from the Awliya (Allies) of Allah, and that this man is righteous, this food is Halal, and this saying is Truth. This and its likes should not be considered unlikely regarding the righteous believing Awliya of Allah. The story of Al-Khidr with Musa is from this chapter, and that Al-Khidr knew these specific (2) states by what Allah informed him of. This is a wide chapter, expanding on it would take long, we have alerted in it to noble points that will inform you of what is behind them (3).",
    "foot_note": "1. 'Plea/Argument' (Hujjah): In 'Majmu' al-Fatawa': 'Mahabbah' (Love).\n2. 'The specific' (Al-Mu'ayyanah): Thus in the original and (K), perhaps the correct word is: 'Al-Mughayyabah' (The Unseen/Hidden).\n3. 'Majmu' al-Fatawa' (20/42-48).",
    "book_id": "1055",
    "new_page_number": 62
  },
  {
    "serial_number": "3368832",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Explanation of Ibn Farah al-Ishbili's Poem (Gharami Sahih)",
    "edition": "First, 1423 AH - 2002 AD",
    "publisher": "Dar Al-Falah - Faiyum, Egypt",
    "page_number": 66,
    "volume_number": 1,
    "text": "The Intent: The saying of the Author, the Explainer: That the Fabricated Hadith is known to be fabricated either by the confession of its fabricator, or the poorness of its wording, or otherwise. We have indicated in what we wrote previously that the People of Faith, Taqwa, Truthfulness, and Sincerity; they have insights, unveilings, physiognomies (Firasat), and inspirations which Allah casts into their hearts, by which they know the truthfulness of the truthful, the lying of the liar, the fabrication of the fabricators, and the authentic reports from the false ones. Abu Sulaiman al-Darani used to call Ahmad bin Asim al-Antaqi (1): The Spy of the Hearts; due to the sharpness of his physiognomy. So upon you, O my brother, is Truthfulness, and beware of Lying, for it is separate from Faith. Allah Glory be to Him knows best the correct view, and to Him is the return and destination. Praise be to Allah, Lord of the Worlds. Let us return now to the speech we were concerned with regarding the knowledge of Hadith.",
    "foot_note": "1. He is the Imam, the Example, the Preacher, the Ascetic. He was of the class of Al-Harith al-Muhasibi and Bishr al-Hafi. Ibn Kathir said: He has beautiful speech on Asceticism and the transactions of the heart. Al-Dhahabi said: Perhaps he remained until around two hundred and thirty. See: 'Al-Hilyah' (9/280), 'Al-Siyar' (10/487) and (11/409), and 'Al-Bidaya wa Al-Nihaya' (14/357) Ed/ Hajar.",
    "book_id": "1055",
    "new_page_number": 63
  }
]