[
  {
    "text": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men\nAuthor: أبو عبد الله أحمد بن محمد بن حنبل بن هلال بن أسد الشيباني\nYear: 241",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 1
  },
  {
    "text": "sn: 3310\nbook_title: من كلام أحمد بن حنبل في علل الحديث ومعرفة الرجال\nbook_link: https://shamela.ws/book/6044\nbook_id: 6044\nauthor_name: أبو عبد الله أحمد بن محمد بن حنبل بن هلال بن أسد الشيباني\nauthor_year: 241\nnickname: أبو عبد الله\nauthor_link: https://shamela.ws/author/220\nauthor_ID: 220\neditor: صبحي البدري السامرائي [ت ١٤٣٤ هـ]\npublisher: مكتبة المعارف - الرياض\nedition: الأولى، 1409\npages: 203\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العلل والسؤلات الحديثية\ncategory_id: 9",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 2
  },
  {
    "serial_number": "3336124",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Defects and Questions. Book: From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men. Author: Abu Abdullah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad Al-Shaybani (d. 241 AH). Editor: Subhi Al-Badri Al-Samarra'i [d. 1434 AH]. Publisher: Maktabat Al-Ma'arif - Riyadh. Edition: First, 1409 AH. Number of Pages: 203 [Book numbering matches the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.\nBook: From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men. Author: Abu Abdullah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad Al-Shaybani (d. 241 AH). Editor: Subhi Al-Badri Al-Samarra'i [d. 1434 AH]. Publisher: Maktabat Al-Ma'arif - Riyadh. Edition: First, 1409 AH. Number of Pages: 203 [Book numbering matches the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.\nAuthor: Abu Abdullah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad Al-Shaybani (d. 241 AH). Editor: Subhi Al-Badri Al-Samarra'i [d. 1434 AH]. Publisher: Maktabat Al-Ma'arif - Riyadh. Edition: First, 1409 AH. Number of Pages: 203 [Book numbering matches the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.\nEditor: Subhi Al-Badri Al-Samarra'i [d. 1434 AH]. Publisher: Maktabat Al-Ma'arif - Riyadh. Edition: First, 1409 AH. Number of Pages: 203 [Book numbering matches the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.\n[Book numbering matches the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431 AH.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 3
  },
  {
    "serial_number": "3336125",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 33,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Abu Muhammad Al-Husain bin Ali bin Muhammad bin Yahya Al-Tamimi Al-Naysaburi informed us by license (Ijaza), Abu Awanah Ya'qub bin Ishaq Al-Isfarayini told us in Isfarayin—a village thirty farsakhs above Nishapur—he said: Ahmad bin Muhammad bin Al-Hajjaj Abu Bakr Al-Marwazi told us in Tarsus, by reading to him. He said: Tadlis (concealment in narration) was mentioned to him—meaning to Ahmad bin Hanbal, may Allah have mercy on him—so he said: 'A group [of narrators] practiced Tadlis.' Al-A'mash was mentioned, and",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 4
  },
  {
    "serial_number": "3336126",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 34,
    "volume_number": 1,
    "text": "Mujahid and Sa'id were mentioned to him, regarding whether he [Al-A'mash] narrates from them, and he said: 'Yes.' Then he said:\n1 - Abu Hurrah was a practitioner of Tadlis from Al-Hasan; among [his narrations] is the hadith of Sa'd bin Hisham, the hadith of Aisha regarding the two rak'ahs.\n2 - And he said: Ibn Ishaq used to practice Tadlis, except that the book of Ibrahim bin Sa'd clarifies it; if it was by hearing, he said 'He told me' (Haddathani), and if it was not, he said 'He said' (Qala). Then he said: Abu Al-Zinad says 'So-and-so said.' He said: You should look into the book of Yazid bin Harun from Abu Al-Zinad, all of them [are like that].\n3 - And it was said to him: Which is more beloved to you, Musa bin Ubaydah or Muhammad",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 5
  },
  {
    "serial_number": "3336127",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 35,
    "volume_number": 1,
    "text": "bin Ishaq? He said: Muhammad bin Ishaq.\n4 - He said: No one is more established (Athbat) nor more knowledgeable about the hadith of Thabit than Hammad. Then he said: And Sulaiman bin Al-Mughirah. I said: [What about] Ma'mar? He said: Ma'mar is good in hadith from Thabit.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 6
  },
  {
    "serial_number": "3336128",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 36,
    "volume_number": 1,
    "text": "5 - And he said: Ibn Abi Ra'itah, if he said 'Ibn Jurayj said from so-and-so,' then he did not hear it. He used to narrate from Ibn Jurayj but would not bring the [exact] wordings and reports. And likewise was Hafs, by the scale of Yahya. Yahya used to say: Ibn Jurayj [said], 'I heard Abu Al-Zubayr.'\n6 - And he was asked about Attaf bin Khalid, so he said: There is no harm in him.\n7 - And he was asked about Yahya bin Hamzah, so he said: There is no harm in him.\n8 - I asked him, saying: Did Ibn Awn hear anything from Anas? He said: He saw him, but as for hearing, I do not know. Then he said: Ayyub saw him and did not hear [from him]. And Yunus, he said: I do not know.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 7
  },
  {
    "serial_number": "3336129",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 37,
    "volume_number": 1,
    "text": "9 - The hadith of Salim from Ibn Umar from the Prophet, peace be upon him, and the hadith of Nafi' from Ibn Umar 'Whoever sells a slave' were mentioned. I said: Which of them is the established one (Al-Thabt)? He smiled and said: Allah knows best. I said: What does your heart incline towards? He said: I see—and Allah knows best—Nafi'. I said: So if Salim",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 8
  },
  {
    "serial_number": "3336130",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 38,
    "volume_number": 1,
    "text": "and Nafi' differ, for whom do you judge? He said: Nafi' put Salim ahead of himself, and he narrated from him, and he [Salim] was serious/diligent. I said: I did not mean in virtue; I only meant regarding Hadith, if they differ, to which of them is your heart more inclined? He said: Both of them are established (Thabt) to me. And he tended towards not judging in favor of one over the other.\n10 - And he said: Yahya Al-Qattan, Khalid bin Al-Harith, and Mu'adh bin Mu'adh used not to write [while sitting] with Shu'bah. Yahya used to memorize and go to his house and write it down, so there was some omission of reports and wordings in his hadith. And Mu'adh used to sit aside in a corner and write what he memorized; they would not gather together.\n11 - And I asked him about Hafs Al-Farkh, and he said: I did not write from him; he used to follow the Sultan.\n12 - And I asked him about Sulaiman bin Al-Hakam bin Awanah, and he said: This one used to speak of 'that side' (possibly implying a sect or region), and he only had a little [knowledge], or he said: I did not write anything from him.\n13 - And he said regarding Muhammad bin Hamzah Al-Khurasani, whom Ibn Mahdi accepted regarding 'Commanding the Good': I do not know him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 9
  },
  {
    "serial_number": "3336131",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 39,
    "volume_number": 1,
    "text": "14 - And he said: Abu Al-Jamal Al-Yamami, who narrates from Yahya bin Abi Kathir: I do not know how he is, or he said: I do not know him.\n15 - And he said regarding Abu Hammad Al-Hanafi: His name is Al-Mufaddal bin Sadaqah. He spoke about him with weak words (indicating weakness).\n16 - And Dahtham bin Qarran Al-Yamami mentioned to me, so he weakened him.\n17 - And he said regarding Ali bin Hazwar, so he softened him [indicating leniency/weakness].",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 10
  },
  {
    "serial_number": "3336132",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 40,
    "volume_number": 1,
    "text": "18 - And he said regarding Muslim bin Khalid Al-Zanji: He gestured with his hand [indicating weakness] and softened him.\n19 - And he said: Ali bin Hafs is more beloved to me than Shababah.\n20 - And Ma'mar was mentioned, so he said: One day he mentioned a hadith of Al-Thawri, and he [Al-Thawri] erred in it. So Sufyan said to him: 'You have stumbled, O Abu Urwah.' So Ma'mar said words to him that I dislike to recount, as if he said to him: 'You lied.' So he [Ahmad] laughed.\n21 - And Abbad was mentioned, so he said: One day he narrated a hadith and said: 'Fudayl bin Yazid,' while it is actually 'Fudayl bin Zaid.' So he was corrected, but he refused [to accept].\n22 - And I asked him about Ayyu Hafs Al-Shami, and he said: This one had hadiths which we wrote from Sa'id bin Abdul-Aziz, then his affair became clear afterwards, so they abandoned him. He narrated hadiths belonging to Sa'id bin Abi Arubah.\n23 - I said: Who are the famous companions of Abu Ishaq? He said:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 11
  },
  {
    "serial_number": "3336133",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 41,
    "volume_number": 1,
    "text": "Shu'bah and Sufyan. And he said: Sharik is good in narration from Abu Ishaq.\n24 - I said: How is Ma'mar in Hadith? He said: Firm (Thabt), except that there is something in some of his hadith.\n25 - And he said regarding Ibn Wahb: His hadith was partly hearing (Sama'), partly presentation (Ard), and partly 'Munawakah' (handing over). And for what he did not hear, he would say: 'Haywah said,' 'So-and-so said.' And he said: I saw Ibn Wahb but I did not write from him, then I wrote from a man from him. He said: And some of our companions informed me that he saw Ibn Wahb with Ibn Uyainah, and he [Ibn Uyainah] said to him: 'The books which my nephew presented to you, should I narrate them from you?' Yahya said: He informed us that he witnessed Ibn Wahb with Ibn Uyainah.\n26 - And I asked Abu Abdullah about Sufyan bin Husain, so he said: He is not that strong; there is something in his hadith from Al-Zuhri.\n27 - And he said: Khalid bin Al-Harith brings the hadith exactly as",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 12
  },
  {
    "serial_number": "3336134",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 42,
    "volume_number": 1,
    "text": "he heard it, and he says: 'Similar to this' or 'Like this.' And Ibn Mahdi used to bring the hadith as he heard it. And Waki' used to strive to bring the hadith as he heard it, and perhaps he would say regarding a letter or a thing: 'It means such-and-such.'\n28 - And he said: Tadlis (concealment) is from suspicion (Ribah). And he mentioned Hushaim and said: He used to practice ugly Tadlis. Perhaps he would come across a letter he did not hear, so he would mention it in another hadith; when the speech was interrupted, he would connect it.\n29 - And I heard him say: Mu'adh bin Mu'adh is a delight to the eye in Hadith.\n30 - It was said to him: Is Ata' bin Al-Sa'ib more beloved to you or Husain? He said: Both of them are firm (Thabt).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 13
  },
  {
    "serial_number": "3336135",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 43,
    "volume_number": 1,
    "text": "31 - And I heard him say: Yahya bin Sa'id used to attack Hammam until Mu'adh bin Hisham came and agreed with Hammam in his hadiths.\n32 - I heard Abu Abdullah say: The companions of Qatadah are Sa'id, Hisham, and Shu'bah, except that Shu'bah did not reach the knowledge of these [two]. And Sa'id used to write everything down.\n33 - Abu Abdullah said: Shu'bah was strict regarding Tadlis.\n34 - It was said to him: Did Ayyub hear from Al-Zuhri? He said: Yes.\n35 - And he was asked: Which of them is more established (Athbat), Bahz or Sulaiman bin Harb?",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 14
  },
  {
    "serial_number": "3336136",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 44,
    "volume_number": 1,
    "text": "He said: Bahz is more established. How can Sulaiman be compared to Bahz?\n36 - And he was asked about Isa bin Yunus, Abu Ishaq Al-Fazari, and Marwan bin Mu'awiyah: Which of them is more established? He said: There is no one among them except he is firm (Thabt). It was said to him: So who is foremost? He said: There is no one among them except he is trustworthy (Thiqah) and firm, except for Abu Ishaq and his status in Islam.\n37 - And he was asked about Shu'bah [narrating] from Abu Ishaq from Umar bin Abi Husain. He said: It is not Umar; Shu'bah used to flip the names of men.\n38 - And he was asked about Umar bin Harun Al-Balkhi, so he said: I cannot hold onto anything; I wrote a lot of hadith from him. It was said to him: He had a story with Ibn Mahdi. He said: It reached me that Abdul-Rahman used to attack",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 15
  },
  {
    "serial_number": "3336137",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 45,
    "volume_number": 1,
    "text": "him, and I do not know what his story was. So Abu Ja'far said to him: I heard someone narrating from Ibn Mahdi that Umar bin Harun came to them in Basra while he was a young man. Abdul-Rahman discussed with him and wrote three hadiths from him, including a hadith from Yahya bin Abi Amr Al-Saybani from Amr bin Abdullah Al-Hadrami from Abdullah bin Amr regarding drinking juice. And among them [a hadith] from Abdul-Malik from Ata' regarding the grave digger placing the axe in the grave after he finishes with it, and another hadith. When some time had passed, he came to them in Basra again. A man came to Abdul-Rahman and said: 'You wrote things from this man.' He gave him the note, so he [the man] took it to him [Umar bin Harun] and asked him about the hadith of Yahya bin Abi Amr. He said: 'I did not hear anything from Yahya bin Abi Amr; this was only from me in my youth.' And he asked him about the hadith of Abdul-Malik, and he said: 'I did not hear from Abdul-Malik; So-and-so narrated it to me from Abdul-Malik.' So he [the man] came to Ibn Mahdi and informed him, so he criticized him and spoke [against him]. Abu Abdullah said: Most of what he narrated to us was from Ibn Jurayj, and he narrated from Al-Awza'i. It was said to him: So do you narrate from him? He said: I had narrated something from him.\n39 - And he said: A man came here and narrated a hadith to them from Sufyan, so they presented it to Abdul-Rahman. He said: 'This is a lie; there is nothing of this.' So they denounced him for it. He sought help from Waki', so they wrote to him, and behold, the hadith was false.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 16
  },
  {
    "serial_number": "3336138",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 46,
    "volume_number": 1,
    "text": "40 - It was said to him: Is Ubaidullah more established or Malik regarding Nafi'? He said: No one is more established regarding Nafi' than Ubaidullah.\n41 - He was asked about Uqayl and Yunus. He said: Uqayl. Yunus would perhaps raise something from the opinion of Al-Zuhri and make it from Ibn Al-Musayyib. And he said: Yunus has narrated from Uqayl.\n42 - And Abu Abdullah was asked about Shu'ayb, so he said: There is no one among them except",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 17
  },
  {
    "serial_number": "3336139",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 47,
    "volume_number": 1,
    "text": "he is trustworthy (Thiqah). And he began to say: Do you know who is the Trustworthy one? The Trustworthy one is only Yahya Al-Qattan. Do you know who is the Proof (Hujjah)? Shu'bah and Sufyan are Proofs. Malik is a Proof. And I said: And Yahya? He said: And Yahya, Abdul-Rahman, and Abu Nu'aym. The Proof, the Firm (Thabt). Abu Nu'aym was Firm.\n43 - And he mentioned Abda bin Sulaiman and said: He was among the best of Muslims. He was a narrator with Sa'id for a time, and he had a young boy to whom he would narrate. He would say to the boy: 'Read to me.' If he made a mistake, Abda would say to him: 'Repeat it so I can dictate it to you.'\n44 - And he said: Ibn Bishr had good writing from Sa'id; his hearing from them was early. I said: Did Sa'id become mixed up [in memory]? He said: Yes. As for Yahya, he used to say: 'Whoever heard before the year forty-five [is acceptable].' As for Abdul-Wahhab, he had become mixed up—meaning before his hearing. I said: Is Abdul-Wahhab trustworthy? He said: Do you know who is the Trustworthy of the Trustworthy? Yahya Al-Qattan.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 18
  },
  {
    "serial_number": "3336140",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 48,
    "volume_number": 1,
    "text": "45 - I asked him about Khilas, and he said: Whatever he narrated from other than Ali, he saw no harm in it. But as for what he narrated from Ali, it is not [accepted] to me.\n46 - I asked him about Qatadah: Did he hear from Khilas? He said: Yes.\n47 - I asked him about Abu Abdullah Al-Jadali, so he spoke softly/leniently [indicating weakness].\n48 - I said: Who are the companions of Al-Thawri? He said: Yahya, Waki', Abdul-Rahman, and Abu Nu'aym. I said: You put Waki' ahead of Abdul-Rahman? He said: Waki' is a Sheikh.\n49 - I said: Yahya bin Yaman and Mu'ammal, if they differ? He said: Leave this. As if he softened their affair. Then he said: Mu'ammal used to err.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 19
  },
  {
    "serial_number": "3336141",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 49,
    "volume_number": 1,
    "text": "50 - I asked him about Mujalid bin Sa'id: How is he? He said: So-so. And he said: Yahya narrated from him. I said: Do you use him as proof? So he spoke with soft words [indicating weakness].\n51 - I asked him about Muhammad bin Ishaq: How is he? He said: He is good in Hadith, but if he combines from two men... I said: How? He said: He narrates from Al-Zuhri and another man, so he carries the hadith of this one onto that one. Then he said: Ya'qub said: I heard my father say: I heard the Maghazi (campaigns) from him three times, and he would decrease and change them. And he said: Malik said—and mentioned him—'He is a Dajjal (imposter/liar) among the Dajjals.' And Abu Abdullah said: Muhammad bin Ishaq came to Baghdad, and he did not care from whom he narrated; from Al-Kalbi and others.\n52 - I asked him about Muhammad bin Amr, so he said: Yahya has narrated from him. And perhaps he raised hadiths which others stopped. And this is from him. And he said: He came to Al-A'mash, but he did not honor him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 20
  },
  {
    "serial_number": "3336142",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 50,
    "volume_number": 1,
    "text": "53 - I asked him about Thabit and Humaid: Which of them is more established regarding Anas? He said: Thabit. And he said: Humaid used to go with Thabit to the [sessions of] Hadith. And Anas indeed said: 'Thabit is my inkwell.' I love them both.\n54 - And I asked him about Ibn Abi Dhi'b: How is he? He said: Trustworthy. I said: Regarding Al-Zuhri? He said: So-so; he narrated hadiths as if he meant to contradict [others].\n55 - I said to Abu Abdullah: So Abdul-Rahman bin Ishaq, how is he? He said: As for what we wrote of his hadith, he narrated hadiths from Al-Zuhri as if he intended to be unique in them. Then he mentioned the hadith of Muhammad bin Jubayr regarding the alliance, 'The Alliance of the Perfumed Ones' (Hilf al-Mutayyabin), so Abu Abdullah denounced it and said: No one else narrated it.\n56 - And I said to Abu Abdullah regarding Sa'd bin Ibrahim: That Malik did not",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 21
  },
  {
    "serial_number": "3336143",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 51,
    "volume_number": 1,
    "text": "narrate from him. So Abu Abdullah disliked what I said, and said: Sufyan used to say: 'Indeed Sa'd is Sa'd.' And he said: Al-Zuhri said: 'Who has a father like Sa'd?' And he mentioned his virtue, and said: He used to command the good. And he was in need, so he entered into the judiciary. When he was dismissed, the likes of him were still respected even though he was a [former] judge. I said: Malik narrated from Ibn Idris from Shu'bah from Sa'd. He said: Yes, and he wondered. And he said: Malik used to critique men.\n57 - I asked him about Al-Suddi, so he said: There is no harm in him; he is trustworthy to me. Except that Abdul-Rahman bin Mahdi said: Shu'bah told me regarding a hadith he narrated from Al-Suddi which he raised [attributed to the Prophet], 'And I do not raise it.' Ibn Mahdi said: I said: 'Indeed Isra'il narrated it as raised.' So Shu'bah nodded his head, meaning: 'Yes.'\n58 - I asked Abu Abdullah about Matar Al-Warraq, so he spoke softly about him [indicating weakness], and said: He is like Ibn Abi Layla.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 22
  },
  {
    "serial_number": "3336144",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 52,
    "volume_number": 1,
    "text": "59 - I asked Abu Abdullah about Musa Al-Juhani, so he said: There is no harm in him, and he spoke well of him.\n60 - I asked Abu Abdullah about Ali bin Al-Mubarak, so he said: There is no harm in him. Then he said: He used to be accused of Shi'ism.\n61 - I asked Abu Abdullah about Abu Al-Zubayr, so he said: A group narrated from him and tolerated him. Ayyub and more than one narrated from him, except that Shu'bah did not narrate from him. I said: He is soft (Layyin)? So it was as if he softened him. I said: Is Abu Al-Zubayr more beloved to you or Abu Nadrah? He said: Abu Nadrah is more beloved to me.\n62 - I asked him about Ja'far bin Muhammad, so he said: Yahya has narrated from him. And he softened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 23
  },
  {
    "serial_number": "3336145",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409 AH",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 53,
    "volume_number": 1,
    "text": "63 - I asked Abu Abdullah about Salih, the freed slave of Al-Taw'amah, so he said: Malik said: 'I saw him mixed up,' and he did not carry [narrations] from him. Then he said: Whoever heard from him before the confusion, then it is as if [it is acceptable].\n64 - I asked Abu Abdullah about Al-Nadr bin Arabi, so he said: There is no harm in him.\n65 - I asked Abu Abdullah about Al-Wazi' bin Nafi', so he said: I do not know how he is. As if he weakened him.\n66 - I asked him about Ma'qil bin Ubaidullah, so he said: Trustworthy (Thiqah).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 24
  },
  {
    "serial_number": "3336146",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 54,
    "volume_number": 1,
    "text": "67 - I asked Abu Abdullah about Asim al-Ahwal. He said: Trustworthy. I said: Indeed Yahya bin Ma'in spoke against him. He marveled and said: Trustworthy. 68 - I asked Abu Abdullah about Asim bin Abi al-Nujud. He said: He is the teacher of Abu Bakr bin Ayyash, there is no harm in him. And it was as if he softened him (indicated minor weakness). 69 - And I asked him about Jabir al-Ju'fi. He said: I used to not write his hadith, then I wrote it to consider (learn) from it. 70 - I asked Abu Abdullah about Ibn Lahi'ah. He softened his status and said: Whoever heard from him early on...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 25
  },
  {
    "serial_number": "3336147",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 55,
    "volume_number": 1,
    "text": "71 - I asked him about Muhammad bin Abdullah bin Abi Ya'qub. He said: Trustworthy. 72 - I asked him about Hisham bin Hassan. He said: Ayyub and Ibn Awn are more beloved to me. And he spoke well of Hisham's status and said: He narrated hadiths raising them (Marfu') while they stopped them (Mawquf), and their methodology was to shorten the hadith and stop it. 73 - I asked Abu Abdullah about Mubarak bin Fadalah and Abu Hilal. He said: They are close to each other, they are not 'that' (strong). I used to not narrate anything from Mubarak, then afterwards... 74 - And I asked him about Abu al-Ashhab. He said: There is no disagreement regarding him that he is trustworthy.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 26
  },
  {
    "serial_number": "3336148",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 56,
    "volume_number": 1,
    "text": "75 - I asked him about Jarir bin Hazim. He said: In some of his hadith there is something, but there is no harm in him. 76 - I asked him about Yazid al-Nahwi. He said: So-so. 77 - I asked him about Farqad al-Sabkhi. He said: A righteous man, but his hadith is not 'that' (strong). 78 - I asked him about Al-Mughirah bin Ziyad al-Mawsili. He softened his status. 79 - And I asked him about Ibrahim bin Muhajir. He softened his status. I heard him...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 27
  },
  {
    "serial_number": "3336149",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 57,
    "volume_number": 1,
    "text": "say: Yahya bin Ma'in spoke with me in the presence of Abdul Rahman bin Mahdi. Yahya said: Ibrahim bin Muhajir—and he mentioned another man—are weak, despicable. Abdul Rahman attacked him severely. Abu Abdullah started marveling at this speech and saying: Despicable?! 80 - And I said to him: I asked Yahya bin Ma'in about the fasting person getting cupped. He said: There is nothing upon him, no report is established regarding it. Abu Abdullah said: This is reckless speech.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 28
  },
  {
    "serial_number": "3336150",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 58,
    "volume_number": 1,
    "text": "81 - And he said: Yazid al-Raqashi is not among those whose [hadith] is used as proof. 82 - And he said: Ash'ath bin Talq, the one who narrated from Ibn Umar, and he spoke about him with soft words. 83 - And he said regarding Musa bin Dihqan: He softened his status. 84 - And he said regarding Abu Dawud Nufay': He softened his status. 85 - And he said regarding Al-Khazraj bin Uthman al-Sa'di: He said: This one is trustworthy.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 29
  },
  {
    "serial_number": "3336151",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 59,
    "volume_number": 1,
    "text": "86 - And he said regarding Abu Ubaydah al-Naji: He weakened his status. 87 - And he said regarding Khasib bin Jahdar: Abandoned in hadith. 88 - And he said regarding Abu Bakr al-Hudhali: His status is weak. 89 - And he mentioned Al-Rabi' bin Sabih and spoke about him with soft words. 90 - And he said regarding Al-Suddi and Ibn Muhajir: Trustworthy. Then he said: Mansur and Ayyub are more established than them.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 30
  },
  {
    "serial_number": "3336152",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 60,
    "volume_number": 1,
    "text": "91 - I asked him about Qatan, from whom Mughirah narrated. He said: I do not know him except through what Mughirah narrated from him. I said: Jarir mentioned him with evil mention. He said: I do not know, Jarir knows him and his land better. 92 - And he mentioned Amir bin Shaqiq, who narrated from Abu Wa'il, and he spoke somewhat about him. 93 - And he said regarding Dukayn al-Dabbi: Abu Nu'aym narrated to us from him, and he did not approve of him. He said: Al-Thawri narrated three hadiths from him. 94 - I said regarding Haitham, from whom Mughirah narrated. He said: I do not know him except what Mughirah narrated from him. 95 - And he mentioned Umar bin Ya'la and did not approve of him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 31
  },
  {
    "serial_number": "3336153",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 61,
    "volume_number": 1,
    "text": "96 - And he said: Isma'il bin Sami', there is no harm in him. 97 - And he said: Salm bin Abdul Rahman, he is not the brother of Husayn, and there is no harm in him. 98 - And he mentioned Umarah bin al-Qa'qa' and said: Trustworthy. 99 - And he said: Habib bin Abi Amrah is trustworthy. 100 - And he mentioned Abdullah bin Sa'id bin Jubayr and said: Ayyub narrated from him, and there is no harm in him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 32
  },
  {
    "serial_number": "3336154",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 62,
    "volume_number": 1,
    "text": "101 - And he mentioned Suhayl bin Abi Salih and said: There is no harm in him. 102 - And he mentioned Yunus bin Khabbab and spoke against him and did not approve of him. He said: This one used to attack Uthman. Abu Awanah informed us, he said: I heard Ali bin Abdul Aziz saying: Ibrahim bin Ziyad bin Sablan told us, he said: I heard Abbad bin Abbad saying: I came to Yunus bin Khabbab one day at Mina and asked him about the hadith of the grave. He narrated it to me and said: It contains something the Murji'ah concealed: And until he is asked about Ali.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 33
  },
  {
    "serial_number": "3336155",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 63,
    "volume_number": 1,
    "text": "103 - I asked him about Hammam bin Munabbih. He said: Trustworthy. 104 - And he spoke of Yahya bin Sa'id and his two brothers, meaning Abd Rabbih bin Sa'id and Sa'd bin Sa'id, and he weakened Sa'd. 105 - And I asked him about Al-Nu'man bin Rashid. He said: He is from Jazira, he is not 'that' (strong). 106 - He was asked about Abdullah bin Sa'id bin Abi Sa'id. He said: He is not 'that' (strong), though Sufyan narrated from him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 34
  },
  {
    "serial_number": "3336156",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 64,
    "volume_number": 1,
    "text": "107 - And I asked him about Ubaydullah bin Abi Ja'far, a sheikh who narrated from Ata from Ibn Abbas, who said: The gifts of princes are ghulul (stolen). He said: I do not know him. I said: Then Ubaydullah bin Abi Ja'far? He said: It used to be said that he had good understanding (Fiqh), from the people of Medina. I said: How is he in hadith? He said: Trustworthy. 108 - And he mentioned Ibn Sam'an and said: He was abandoned in hadith. He was asked about Ibn Sam'an and said: I heard Ibrahim bin Sa'd swear that he was a liar. He said: He used to say 'I heard Mujahid', so Ibn Ishaq would say: I, by Allah, am older than him and I did not hear from him. 109 - And he was asked about Muhammad bin Amr and Al-Ala'. He said: Al-Ala' is more beloved to me; and that is because Muhammad bin Amr might say 'The Sheikhs' (narrating vaguely).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 35
  },
  {
    "serial_number": "3336157",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 65,
    "volume_number": 1,
    "text": "110 - And he was asked about Kharijah bin Mus'ab, and he weakened him and said: Ibn al-Mubarak did not narrate anything from him in his books. Ibn Abi Rizmah said to him: Yes, one hadith. He said: They spoke to Ibn al-Mubarak about him, and he said: How can I narrate from a man who narrated such and such hadith which is Munkar (rejected)? 111 - And I asked him about Zaid bin Abi Unaysah, how is he? He shook his hand and said: Salih (acceptable), but he is not 'that' (strong). 112 - And he mentioned Abu Isra'il al-Mula'i and said: He was a Shi'i, and Al-Thawri narrated from him his hadith: Whoever wants Hajj from a land, let him proceed early.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 36
  },
  {
    "serial_number": "3336158",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 66,
    "volume_number": 1,
    "text": "113 - And Abu Abdullah said to me: Asim bin Ubaydullah, the Sheikhs used to dread his hadith. 114 - I asked him about Abu Hamzah al-Attar. He said: I do not know how he is. 115 - I asked him about Hakim bin Jubayr. He said: He is not 'that' (strong). 116 - I asked Abu Abdullah about Amr bin Abdullah, the one who narrated...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 37
  },
  {
    "serial_number": "3336159",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 67,
    "volume_number": 1,
    "text": "from Ikrimah. He said: This one is called Amr Barq. Ikrimah stayed with his father, and he heard a book from him. The people of Yemen did not approve of him. Abu Abdullah gestured with his hand implying he used to drink (alcohol), and he smiled. Ma'mar used to narrate from him saying: \"From a man,\" not naming him, except to Ibn al-Mubarak, for he named him; he said: Barq. 117 - And he mentioned Abdullah al-Umari and did not approve of him, and said: Soft in hadith. 118 - And he said regarding Ali bin Ali al-Rifa'i: There was no harm in this Sheikh, except that he raised (made Marfu') hadiths. 119 - And he mentioned Muhammad bin Abi Hafsah and did not approve of him, and I think he mentioned that he held an evil opinion.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 38
  },
  {
    "serial_number": "3336160",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 68,
    "volume_number": 1,
    "text": "120 - And he mentioned Ja'far bin Maymun and did not approve of him. 121 - And he mentioned Hammad bin Abi Sulayman and said: Trustworthy. 122 - And he mentioned Abu al-Rabi' al-Samman and said: His hadith is nothing. 123 - And he said Salih bin Abi al-Akhdar, he did not approve of him, and said: Yahya used to not narrate from him. Abu Abdullah said: He narrated hadiths to them, then said: I did not hear them.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 39
  },
  {
    "serial_number": "3336161",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 69,
    "volume_number": 1,
    "text": "124 - And he said: Abdul Malik bin Umayr, there is disturbance in his hadith. 125 - And he said: Qays bin Sa'd is trustworthy. 126 - And he said: Abu Ma'shar, he did not approve of him and spoke somewhat about him. 127 - And I asked him about Salim bin Abi Hafsah. He said: There is no harm in him, except that he was a Shi'i. 128 - And Abu Abdullah said: Abu Maryam is abandoned in hadith, and he...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 40
  },
  {
    "serial_number": "3336162",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 70,
    "volume_number": 1,
    "text": "used to be accused of Shi'ism. Shu'bah wrote from him; he knew him since youth. Shu'bah said: Abu Maryam said to a man: Did Yahya and Waththab narrate to you that Masruq narrated to them that Abdullah narrated to them? Abu Maryam said: If anyone said to him 'Who narrated to you?' or 'How did you hear?', he would slap his eye. 129 - I asked him about Al-Mughirah bin Al-Nu'man. He said: He is so-so. 130 - I asked Abu Abdullah about Layth bin Abi Sulaym. He said: He is not 'that' (strong). 131 - I asked him about Al-Dahhak bin Yasar, did he hear from Abu Uthman? He said: I do not know, and he spoke about him with soft words.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 41
  },
  {
    "serial_number": "3336163",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 71,
    "volume_number": 1,
    "text": "132 - I asked him about Abu Bakr bin Abi Sabrah. He said: He is nothing. Then he said: Ibn Jurayj narrated from him. Hajjaj said: He said: I have seventy thousand (hadiths) regarding the Halal and Haram. 133 - Abu Abdullah said: We were with Isma'il, and the hadith of Muhammad bin Ishaq from Amr bin Shu'ayb from his father from his grandfather was mentioned to him: \"I said: 'O Messenger of Allah, shall I write what I hear from you?' He said: 'Yes.' I said: 'In anger and pleasure?'\" I heard Isma'il saying: \"I seek refuge in Allah from lying.\" I said: How was the status of Amr bin Shu'ayb with Isma'il? He did not approve of him. He said: He narrated from him. But it was the way of Muhammad bin Sirin, Ayyub, and Ibn Awn not to write (from him). 134 - I said: Did Yahya hear anything from Umar bin Amir? He said: I do not know that he narrated anything from him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 42
  },
  {
    "serial_number": "3336164",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 72,
    "volume_number": 1,
    "text": "135 - I asked him: Who is older, Mansur bin al-Mu'tamir or Ibn Zadhan? He said: I do not know. 136 - He mentioned Jarir bin Hazim and said: He was a Hafiz. And he said once: In his hadith there is something. 137 - Abu Abdullah said: I heard Ibrahim bin Sa'd swear by Allah that Ibn Sam'an is a liar. 138 - And he said regarding Ishaq bin Yahya bin Talhah: His hadith is nothing.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 43
  },
  {
    "serial_number": "3336165",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 73,
    "volume_number": 1,
    "text": "139 - He mentioned Husayn bin Waqid and said: He is not 'that' (strong). 140 - He was asked about Ali bin Ghurab. He said: His hadith was the hadith of the truthful people. 141 - I said to him: Sa'id bin Abdul Jabbar, is he Meccan? He said: No, this one is from the people of Sham. Abu Badr narrated two hadiths from him to us, and I have crossed them out. I said: What is his status? He said: He narrated objectionable hadiths. 142 - I asked him about Asal bin Sufyan. He softened his status.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 44
  },
  {
    "serial_number": "3336166",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 74,
    "volume_number": 1,
    "text": "143 - I asked him about Bishr bin Harb. He said: We are fasting (meaning he refrained from speaking much) and weakened him. 144 - And I asked him about Dawud bin Yazid al-Awdi. He said: This is Al-Za'afiri, and he is the uncle of Ibn Idris. They asked him about the hadith of Al-Sha'bi, 'The dowry shall not be less than ten,' but he did not know it. Then Sharik asked him and prompted him, so he narrated it. And he weakened him. 145 - And I asked him about Azhar bin Sinan. He softened his status and said: He narrated a hadith mentioned in (the chapter of) divorce.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 45
  },
  {
    "serial_number": "3336167",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 75,
    "volume_number": 1,
    "text": "146 - I asked him about Abdullah bin Maysarah, from whom Yazid ibn Harun narrated. He softened his status and said: We narrate from him. [147] - I asked him about Dawud bin Farahij. He said: This one is Medinan, and he softened his status. 148 - And I asked him about Abu Amir al-Khazzaz. He said: He (or I) narrated from him, and he softened his status. 149 - I asked him about Abbad bin Suhayb. He said: He used to be accused of (believing in) Qadar, and his status was close to that of Abu Amir al-Khazzaz.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 46
  },
  {
    "serial_number": "3336168",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 76,
    "volume_number": 1,
    "text": "150 - I asked him about Al-Zubayr bin Sa'id. He softened his status. 151 - I asked him about Isa bin al-Musayyib. He said: This is a Kufan, and he softened him. 152 - I asked him about Abu Dawud Nufay' and about Abu al-Warqa'. He softened the status of Nufay' and weakened Abu al-Warqa', and prioritized Abu Dawud over him and said: He is more exemplary. 153 - I asked him about Harithah bin Abi al-Rijal. He said: He is not 'that' (strong).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 47
  },
  {
    "serial_number": "3336169",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 77,
    "volume_number": 1,
    "text": "154 - And I asked him about his brother Abdul Rahman. He said: There is no harm in him. 155 - I asked him about Ibn Ajlan. He said: Trustworthy. I said: Indeed Yahya has weakened him. He said: He was trustworthy; the hadith of Al-Maqburi only became confused for him. It was from a man, and he started making it from Abu Huraira. 156 - I asked him about Rishdin. He said: He is not experienced in his affair (or I don't know his affair well), I do not know. 157 - I asked him: I said: Shu'bah from Attab the freed slave of Ibn Hormuz, this Attab is the son of whom? He said: I do not know.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 48
  },
  {
    "serial_number": "3336170",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 78,
    "volume_number": 1,
    "text": "158 - I said: Al-Hakam bin Atiyyah, how is he? He said: The Basran? I said: Yes, the one who narrated from Thabit. He said: In my view there was no harm in him, then it reached me that he narrated Munkar (rejected) hadiths. And it was as if he weakened him. 159 - And I asked him about Imran. He said: He is not 'that' (strong), and he weakened him. 160 - I asked him about Isma'il bin Rafi'. He said: I do not know. 161 - Ibn Abi Mulaykah from Abdul Rahman bin al-Sa'ib. He gestured dismissively with his hand and said: This one's hadith is nothing.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 49
  },
  {
    "serial_number": "3336171",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 79,
    "volume_number": 1,
    "text": "162 - And he said regarding the hadith of Abu al-Nadr from Abu Ja'far al-Razi from Burayd bin Abdullah: He said: This is Levantine (Shami). He mentioned the hadith of Wathilah regarding the story of trial. He said: Abu Ja'far did not hear from this one; he only narrated this from Muhammad bin Sa'id, and Allah knows best. So he abandoned Muhammad bin Sa'id and said: From Burayd. 163 - I said: What is the status of Muhammad bin Sa'id? He said: They say that Abu Ja'far crucified him for Zandaqah (heresy), and he is abandoned in hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 50
  },
  {
    "serial_number": "3336172",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 80,
    "volume_number": 1,
    "text": "164 - I said: Then Abu Jabir al-Bayadi, how is he? He said: It reached me from Malik that he used to say he would lie. 165 - I said: Then how about Al-Hasan bin Umarah? He said: Abandoned in hadith. 166 - I asked him about Abu Harun al-Abdi. He said: He is not 'that' (strong). 167 - And I asked him about Abbad bin Kathir. He said: He is not 'that' (strong). I said: Was there anything of Qadar in him? He said: No, except that his hadith is not 'that' (strong).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 51
  },
  {
    "serial_number": "3336173",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 81,
    "volume_number": 1,
    "text": "168 - I said to him: What do you say regarding Sa'id bin Jumhan? He said: Trustworthy. Al-Awwam bin Hawshab narrated from him, and Hammad narrated from him, and I think he mentioned Abdul Warith and others. I said: It is narrated from Yahya al-Qattan that he was asked about him and did not approve of him. He said: False. And he got angry and said: No one said this except Ali bin al-Madini; I did not hear Yahya speak anything about him. 169 - And he mentioned Abdullah bin Uthman bin Khuthaym. He said: He narrated from Ata regarding divorce, forgetting that it becomes binding, and he narrated from Ibn Jurayj from Ata the opposite of it. I said: Then how is Ibn Khuthaym? He said: Ibn Jurayj is more established than him. 170 - Abu Awanah told us: Abu Nasr told us: Abu Abdullah Ahmad bin...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 52
  },
  {
    "serial_number": "3336174",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 82,
    "volume_number": 1,
    "text": "Hanbal told us, he said: I heard Muhammad bin Ja'far al-Warkani say: We were with Hushaim, and a man said to him: Salamah al-Ahmar told us from Hammad from Ibrahim who said: The companions of the Prophet (peace be upon him) used to assume Ihram at the water source. Hushaim said: Spare us from the hadith of liars. Abu Abdullah smiled and said: There is nothing of this. And he said: I have seen Salamah. 171 - And I asked Abu Abdullah about Abu al-Samh. I said: How is he? He said: He narrated hadiths from Abu al-Haytham, and he smiled. I said: How is he? He said: I do not know. I said: Then Abu al-Haytham? He said: Trustworthy. 172 - And he said: Al-Hasan bin Dhakwan is not 'that' (strong), and Yahya narrated from him. 173 - And I asked him about Sufyan bin Husayn, how is he? He said: He is not 'that' (strong), and he weakened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 53
  },
  {
    "serial_number": "3336175",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 83,
    "volume_number": 1,
    "text": "174 - And I asked him about Ishaq bin Rashid. He said: Trustworthy. 175 - And he said regarding Sawwar bin Mus'ab: Not a thing (worthless). 176 - I said to him: Is the hadith of Abu al-Zubayr used as proof? He said: Abu al-Zubayr, he is narrated from and used as proof. 177 - I asked him about Mubarak bin Fadalah. He said: What he narrated from Al-Hasan is used as proof. He said: He entered upon Abu Ja'far and started saying: O...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 54
  },
  {
    "serial_number": "3336176",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 84,
    "volume_number": 1,
    "text": "Commander of the Faithful, I heard Al-Hasan say, and I heard Al-Hasan say. Then Abu Abdullah said: Abu Ja'far used to be impressed by the matter of Al-Hasan. 178 - And I asked him about Muhammad bin Jabir. He said: He is narrated from. He said: Ibn Mahdi used to narrate from Muhammad bin Jabir then left him afterwards. 179 - And he was asked about Al-A'mash from Abu Sabrah al-Hudhali from Abdullah bin Amr from the Prophet (peace be upon him): The Hour will not be established until obscenity and severing of ties appear. He said: I do not know who this is; I do not know him. And it was said to him: This is Yahya bin Malik from whom Qatadah narrated. He said: I do not know. 180 - And I asked him about Usamah bin Zaid. He said: Al-Layth is stronger than this one, meaning Ibn Zaid bin Aslam.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 55
  },
  {
    "serial_number": "3336177",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 85,
    "volume_number": 1,
    "text": "181 - I said: How was Isma'il bin Salim? He said: There is no harm in him. I said: It is reported from Abu Awanah from Isma'il bin Salim that he heard Zubayd saying: He was in the story of Mu'awiyah. He said: And who heard this from Abu Awanah? Then he said: He had Shi'ite hadiths, and Shu'bah looked into his books. 182 - And he was asked about Al-Hasan bin Salih. He said: Trustworthy, except that his sect was 'that' (meaning Shi'ism). 183 - I said: Yazid bin Abdullah or Abdul Malik al-Nawfali? He said: I do not know, this one narrated the hadith of Abu Huraira. I said: Then his son? He said: He came here, and he weakened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 56
  },
  {
    "serial_number": "3336178",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 86,
    "volume_number": 1,
    "text": "184 - And he said regarding Talid bin Sulayman: His sect was Shi'ism, but he saw no harm in him. 185 - And he said: Thawr bin Yazid is trustworthy, except that he held the view of Qadar. 186 - And he said: Hamzah al-Zayyat is trustworthy in hadith, but I dislike his recitation. 187 - And he said: Zakariyya bin Manzur is a sheikh, and he softened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 57
  },
  {
    "serial_number": "3336179",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 87,
    "volume_number": 1,
    "text": "188 - I asked him about Musa bin Uqbah, Ibrahim bin Uqbah, and Muhammad bin Uqbah. He said: Musa is trustworthy trustworthy. And he said: There is no harm in them. 189 - I asked him about Al-Ash'ath, Al-Nu'man, and Sa'id bin Abi Khalid. He said: Sa'id, I do not know him. And he said: Isma'il narrated from Al-Nu'man and Ash'ath. I said: How is he? He said: There is no harm in them; he only narrated one or two hadiths from them.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 58
  },
  {
    "serial_number": "3336180",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 88,
    "volume_number": 1,
    "text": "190 - And I asked him about Umar bin Nafi' and Abdullah bin Nafi'. He said: Umar, I do not know him. And Abu Bakr bin Nafi', he spoke somewhat about him. 191 - I asked him about the nephew of Ibn Shihab, how is he? He said: So-so. 192 - And Abu Abdullah was asked about Abdul Malik bin Umayr. He said: His hadith is disturbed; rarely does anyone narrate from him without differing about him. It was said: Is he more beloved to you or Asim? He said: Asim. 193 - He was asked about Al-Hasan bin Dinar, and he weakened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 59
  },
  {
    "serial_number": "3336181",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 89,
    "volume_number": 1,
    "text": "194 - And he was asked about Abu Shaybah, and he weakened him. 195 - I asked him about Abdullah bin Muslim who narrated from Ibn Buraydah. I said: Who is Abdullah bin Muslim? He said: I do not know him. 196 - And I asked him about Salih bin Hayyan. He said: He is not 'that' (strong), and he rejected his hadith. 197 - I asked him: Did Ma'mar hear from Yahya bin Sa'id? He said: No. 198 - And he said: Sadaqah al-Dimashqi is nothing, weak in hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 60
  },
  {
    "serial_number": "3336182",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 90,
    "volume_number": 1,
    "text": "199 - It was said to him: Does he narrate from Al-Ifriqi? He said: No, he is rejected in hadith. My father Ja'far entered upon him and he spoke with good words, so he said to him: And he improved his preaching. 200 - And I heard him say: Malik bin Anas, in my view, is an Imam from the Imams of the Muslims. 201 - I asked him about Qays bin al-Rabi', and he softened him. I said: Didn't Shu'bah narrate from him? He said: Yes. 202 - And he was asked about Hudayj. He said: I do not know how he is.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 61
  },
  {
    "serial_number": "3336183",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 91,
    "volume_number": 1,
    "text": "203 - I asked him about Sa'id bin Muhammad al-Warraq. He softened him and spoke something about him. 204 - And he said: Al-Hasan bin Dhakwan is not 'that' (strong), and Yahya narrated from him. 205 - I asked him about Al-Darawardi. He said: I do not know what to say to you about him; it is as if he (Ahmad or another scholar) rejects some of his hadiths. 206 - I asked him about Ibn Abi Hazim. He said: There is no harm in him. I said: Is he more pleasing to you than Al-Darawardi? He said: Yes.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 62
  },
  {
    "serial_number": "3336184",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 92,
    "volume_number": 1,
    "text": "207 - And he said: Ibn Jubayr who narrated from Ibn Umar, I do not know him nor do I know who he is. 208 - I asked him about Abdul Majid bin Abdul Aziz bin Abi Rawad, how is he? He said: He was a Murji'. I wrote from him. They used to say: The Murji' corrupted his father. He was opposed to Ibn Uyaynah. Abu Abdullah used to narrate from [someone] if he was not a caller (to his innovation) or argumentative. 209 - I said: What did Yahya al-Qattan say about Sharik? He said: He did not approve of him, and he did not mention things from him based on memory except two hadiths.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 63
  },
  {
    "serial_number": "3336185",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 93,
    "volume_number": 1,
    "text": "210 - I said: Then Abu Bakr bin Ayyash, how was he according to him? He said: He did not approve of him. 211 - And Yahya did not approve of Ibrahim bin Sa'd. I said: And what was his status with him? He said: He was in charge of the Bayt al-Mal (Treasury). 212 - I asked him about Ibrahim bin Al-Hakam bin Aban. He said: There is no harm in him; I wrote from him and stayed with him for days. 213 - And I asked him about Yazid bin Abi Hakim. He said: I wrote...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 64
  },
  {
    "serial_number": "3336186",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 94,
    "volume_number": 1,
    "text": "from him less than what I wrote from Ibrahim. I disapproved of (some things from) Ibrahim, then Ibrahim narrated objectionable hadiths afterwards. He weakened his status and prioritized Yazid bin Abi Hakim over him. 214 - He was asked about Al-Nadr bin Isma'il Abu al-Mughirah. He said: We wrote from him. He is not strong enough to be considered (as a primary source) in his hadith, but (we write) what pertains to Raqa'iq (heart-softening narrations). He had more hadith than Ibn al-Sammak. 215 - And he said: The way (madhhab) of Al-Hasan bin Salih does not please us; he used to abstain from the Friday prayer. 216 - I said to him: Abu Badr, is he...? He said: I hope he is truthful (saduq); he sat with righteous people. 217 - I said to him: What is your view on the hadith of Ubaydullah bin Musa?",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 65
  },
  {
    "serial_number": "3336187",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 95,
    "volume_number": 1,
    "text": "He said: He used to narrate bad hadiths. I used to not narrate anything from him, then I narrated. 218 - He was asked about Ayyub bin Jabir. He said: Some of our companions told me from Isa bin Yunus that he used to accuse him of lying. It was said to him: So what was his status? What did they disapprove of in him? He said: They saw additions (luhoq) in his book. 219 - It was said to him: Did you write from Ahmad bin Ishaq al-Khadrami? He said: No, I left him deliberately. It was said to him: What did you disapprove of in him? He said: In my view, if Allah wills, he was truthful, but I left him because of Ibn Aktham; he got involved with him in something. 220 - He was asked about Yahya bin Sa'id al-Umawi. He said: He did not have much activity in hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 66
  },
  {
    "serial_number": "3336188",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 96,
    "volume_number": 1,
    "text": "221 - It was said to him: Then Abdul Samad bin Abdul Warith? He said: There was no harm in him, and I hope he was opposing his father regarding that opinion (Al-Ra'i). 222 - I asked him about Ya'qub bin Ishaq al-Hadrami. He prioritized his brother Ahmad over him and said: There was no harm in Ahmad, but I left him because of Ibn Aktham. And he said: Ibn Mahdi wrote from him, then Ya'qub bin Ishaq came and spoke harshly to him, so I did not write anything from him. 223 - I asked him about Asim bin Ali. I said: Yahya bin...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 67
  },
  {
    "serial_number": "3336189",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 97,
    "volume_number": 1,
    "text": "Ma'in said: Every 'Asim' in the world is weak. He said: I know nothing but good from him. His hadith was authentic (sahih). The hadith of Shu'bah and Al-Mas'udi, how authentic they were! 224 - And he said: When Qays bin al-Rabi' was mentioned, Waki' would say: Allah is the One sought for help. 225 - And he said: Abu Hudhayfah who was in Basra was among the people who made the most mistakes. 226 - And he mentioned Muhammad bin al-Qasim al-Asadi and said: He does not deserve to have anything narrated from him; he narrated objectionable hadiths.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 68
  },
  {
    "serial_number": "3336190",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 98,
    "volume_number": 1,
    "text": "227 - And he said regarding Ruhayl bin Mu'awiyah, the brother of Zuhair: He is an old man from whom Zuhair narrated. I do not have knowledge of the hadith of Hudayj. It was said to him: He narrated from Abu Ishaq from Al-Bara' that the Prophet (peace be upon him) used to give tasleem (salutation) to his right and to his left. He said: This is Munkar (objectionable). 228 - And Abu Abdullah said: Ali bin Mushir was appointed judge of Mosul, and he was not praised in his judgeship. I said: But people desire his hadith. He said: Because his hadith is the hadith of the truthful people. 229 - And he said: Shu'ayb bin Abi Hamzah hardly narrated...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 69
  },
  {
    "serial_number": "3336191",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 99,
    "volume_number": 1,
    "text": "When death approached him, he said: Gather for me so-and-so and so-and-so. So Baqiyyah gathered, and they say Abu al-Yaman, and they mentioned Ali bin Ayyash—I do not know if he was there or not. He said: These are my books, narrate them from me. So Abu al-Yaman used to say: Shu'ayb told me. I do not know if he was with them or not. 230 - And he mentioned Al-Himmani. I said: He narrated from you the hadith of Ishaq al-Azraq, the hadith of Al-Mughirah bin Shu'bah: \"Cool down by delaying the prayer.\" He claimed he heard it at the door of Ibn Ulayyah. He denied having heard it and said: There is nothing of this. I said: He claimed this was during a revision session. He said: I knew in the days of Isma'il that this was with me; I only brought it out at the end. He said: Tell Harun, and tell Harun al-Hammal to cross out the hadith of Al-Himmani. 231 - It was said to him: Then Tamam bin Najih, what is his status? He said: I do not know.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 70
  },
  {
    "serial_number": "3336192",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 100,
    "volume_number": 1,
    "text": "232 - It was said to him: Then Isma'il bin Mujalid? He said: I do not know; he has been narrated from. 233 - Abu Abdullah said: I was with Yahya bin Ma'in when he met Abu Badr. He said to him: Fear Allah, O Sheikh, and deny these hadiths; let not your son give them to you. Abu Abdullah said: I felt shy and moved aside. It reached me that he said: If I am lying, may Allah do such and such to you. 234 - I asked him about Uthman bin Matar, how is he? He said: So-so. 235 - I asked him about Talhah bin Yazid or Ibn Zaid al-Qurashi. He said: He is not 'that' (strong); he narrated objectionable hadiths.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 71
  },
  {
    "serial_number": "3336193",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 101,
    "volume_number": 1,
    "text": "236 - I said to him: Which is more beloved to you, Al-Hawdhi or Abu al-Walid? He said: Al-Hawdhi is smarter than Abu al-Walid and more established. He was vigilant, although Abu al-Walid had good hadith from Shu'bah. 237 - And he said: Affan said: Hammad bin Zaid said to Shu'ayb bin Harb: O Abu Salih, we have been invited to a feast (Walimah), will you come? Abu Abdullah said: Hammad had a sense of humor. And I heard him say: I heard Mu'ammal say: The hadith scholars in Mecca rioted against Sufyan, and Shu'ayb bin Harb spoke against them until they removed the Mustamli (dictator's assistant). And he said: Ibn Umm Idris (Sufyan) is sufficient; he does not go to a feast until he asks about it—meaning he follows him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 72
  },
  {
    "serial_number": "3336194",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 102,
    "volume_number": 1,
    "text": "238 - And he mentioned Abdul Wahhab. I said: Did you write from Yahya bin Sulaym? He said: I did not write from Yahya bin Sulaym except two hadiths. I said to him: Did he write from Isma'il al-Jalal that hadith or the Kalam (theology)? I said: Did he enter... I think he meant the people of innovation. He said: May Allah pardon him, he looked into it with the light of Allah. He did not deserve to be written from. People set him up on a platform, and Baghdad shook for him, but the people of hadith humiliated him. He said: I hope Allah has mercy on Ibn Zubaydah; when Isma'il was brought to him, he spoke to him with words, and he moved from his place. Isma'il started saying to him: A slip of a scholar, a slip of a scholar. He said: He used to narrate (from) Al-Marisi, except that the wicked one did not show that in those days. 239 - I said to him: Khalaf reported that Abu Usamah dictated...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 73
  },
  {
    "serial_number": "3336195",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 103,
    "volume_number": 1,
    "text": "in Kufa. He said: He lied, nothing of the sort happened. We were not granted provision from him; how little is my writing from him! But my writing from Ibn Numayr is a sound book. 240 - And I heard him praising Duhaym and saying: He is intelligent and steady. 241 - And he mentioned Hisham bin Ammar and said: Flighty (Tayyash), light (Khafif). 242 - And he said: We were at the frontier (Thughur), and a young man was with us. He went to Yusuf bin Asbat and wrote hadiths from him. Among them was from Hisham from Al-Hasan regarding the People of the Covenant (Dhimmah) if they break the covenant; he said: Their offspring are not taken captive. And he narrated from Mughirah from Ibrahim similarly. He narrated both from Sufyan. I said: Not from...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 74
  },
  {
    "serial_number": "3336196",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 104,
    "volume_number": 1,
    "text": "the hadith of Mughirah from Ibrahim is any knowledge from him, and his memory had become confused. 243 - And I heard him being asked about Al-Waqidi. It was said to him: Ibn al-Mubarak said: Leave Al-Waqidi. He said: I witnessed Waki' being asked about a hadith regarding wiping pebbles (during prayer). He said: If I were with Al-Waqidi, he would have narrated it to you like this. 244 - I asked him about Isma'il bin Ayyash. He spoke well of his narration from the Levantines (Shamiyeen) and said: He is in a better state with them than what he narrated from the Medinans and others.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 75
  },
  {
    "serial_number": "3336197",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 105,
    "volume_number": 1,
    "text": "245 - I asked him about Al-Walid. He said: He makes many mistakes. I wrote them from a man from him. He came to Mecca twice; I wrote from him in one of them about four hundred hadiths, and a group had heard about eight hundred from him. 246 - I said: Did you write anything from Ibn Wahb? He said: No. 247 - I said: Then Yahya bin Sulaym? He said: A hadith or two; he used to make many mistakes. And he said: I used to see Al-Ghayr coming due to his many mistakes, so you know that taking (hadith) was strict with Sufyan. 248 - I asked him, saying: Sa'id bin Abi Arubah, when he came to Kufa, did they hear from him while he was confused (Mukhtalit)? He said: No, his hearing is good; he was not confused. 24 - 9",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 76
  },
  {
    "serial_number": "3336198",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 106,
    "volume_number": 1,
    "text": "And Abu Abdullah was asked about the hadith of Abu al-Mubarak from Malik ibn Anas from Ibn al-Munkadir from Anas from the Prophet (peace be upon him): [Whoever] sits with a songstress, molten lead will be poured into his ear on the Day of Resurrection. And it was said to him: A man in Aleppo narrated it and they deemed it good. He said: This is false. 250 - And he looked into the hadith of Asal bin Sufyan from Ibn Abi Mulaykah from Aisha, the Prophet (peace be upon him) said: He is not of us who does not chant the Quran. He said: There is nothing of this; whoever said 'from Aisha' has erred. And he weakened Asal bin Sufyan. 251 - And I asked him about the hadith of Isma'il bin Rafi', he said: Ibn Abi Mulaykah told me from Abdul Rahman bin al-Ghatrif. He shook his hand and said: There is nothing of this. And he weakened him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 77
  },
  {
    "serial_number": "3336199",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 107,
    "volume_number": 1,
    "text": "252 - I said: What is the status of Muhammad bin Sa'id? He said: And Allah knows best, Abu Ja'far crucified him for Zandaqah. 253 - And he said regarding the hadith of Yahya bin Sulaym from Ubaidullah from Nafi' from Ibn Umar, he said: I traveled with the Messenger of Allah (peace be upon him) and Abu Bakr and Umar and Uthman, and they used to pray Zuhr and Asr two rak'ahs two rak'ahs, not praying before it nor after it. He denied it strongly and said: This is from Yahya bin Sulaym. 254 - And he said regarding the hadith of Warqa' from Ibn Abi al-Zinad from Al-A'raj from Abu Huraira 'A'wadi' (my visitors) as Mawquf. He said: Warqa' erred in it, and Ibn Abi al-Zinad was correct; he said 'A'budi' (my slaves) as Mawquf. Then he said: Ibn Abi al-Zinad is more beloved to me than Warqa'.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 78
  },
  {
    "serial_number": "3336200",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 108,
    "volume_number": 1,
    "text": "255 - I said: Then how about Hasan bin Umarah? He said: Abandoned in hadith. 256 - And he said regarding the hadith of Ubaidullah from Nafi' from Ibn Umar in the likes of the story of the Mudabbar (slave promised freedom after death). He said: He used to say—meaning Abu Usamah—from Hisham from Ibn Sirin from Abu Huraira, then he says from Ubaidullah from Nafi' from Ibn Umar similar to it. And he said: Yahya bin Sa'id said: It is only in the book of Ubaidullah as Mursal. And it should only be as Yahya said. And he denied it. 257 - And he said: We were with Isma'il bin Ibrahim, and the hadith of Amr bin Shu'ayb from his father from his grandfather was mentioned to him: I said: O Messenger of Allah, shall I write from you...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 79
  },
  {
    "serial_number": "3336201",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 109,
    "volume_number": 1,
    "text": "what I hear? He said: Yes. He said: In anger and pleasure? Abu Abdullah said: I heard Isma'il saying: I seek refuge in Allah from lying and its people. I said: It is as if he did not approve of Amr bin Shu'ayb. He said: He used to narrate his hadith, but it was the way of Ibn Sirin, Ayyub, and Ibn Awn not to write (from him). 258 - And I mentioned to him the hadith of Al-Hussein al-Ju'fi from Ibn Uyaynah from Amr bin Dinar from Jabir: 'Aslam, Allah made it safe.' He denied it strongly and said: This is Abdullah bin Dinar from Ibn Umar. He denied the error from whoever it came from.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 80
  },
  {
    "serial_number": "3336202",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Kalam Ahmad bin Hanbal fi 'Ilal al-Hadith wa Ma'rifat al-Rijal",
    "edition": "First, 1409",
    "publisher": "Maktabat al-Ma'arif - Riyadh",
    "page_number": 110,
    "volume_number": 1,
    "text": "259 - And I mentioned the hadith of Abbad from Ibn Abi Arubah from Qatadah from Anas that Safiyyah menstruated after she had performed Tawaf. He said: Abbad erred in it; it is only from Qatadah from Ikrimah. 260 - And I asked him about the hadith of Ma'mar from Thabit from Anas that the Prophet (peace be upon him) forbade Shighar (marriage). He said: This is a Munkar hadith from the hadith of Thabit. 261 - And I asked him about the hadith of Asim bin Ubaydullah which he narrates...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 81
  },
  {
    "serial_number": "3336203",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 111,
    "volume_number": 1,
    "text": "...Ibn Jurayj narrated from him, saying: The Sheikhs used to be in awe of Asim bin Ubaid Allah's hadith. 262 - I said to him: Do you know [the hadith] from Al-Walid, from Al-Awza'i, from Yahya, from Abu Salamah, from Abu Hurairah, from the Prophet (peace be upon him): 'When were you [ordained] a Prophet?' He said: This is Munkar (denounced). This is from Al-Awza'i's error. He often makes mistakes regarding Yahya bin Abi Kathir. He used to say 'from Abu Al-Muhajir', but it is actually 'Abu Al-Muhallab'.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 82
  },
  {
    "serial_number": "3336204",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 112,
    "volume_number": 1,
    "text": "263 - I said: Do you know [the hadith] from Ata' bin Muslim Al-Khaffaf, from Muhammad bin Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (peace be upon him): 'The arrogant ones will be gathered in the form of small ants, people will trample them'? He denied it and said: I do not know it; Ata' bin Muslim is Mudtarib (confused/shaky) in Hadith. 264 - I asked him about the hadith of Abd al-Razzaq, from Ma'mar, from Abu Ishaq, from Asim bin Damrah, from Ali, from the Prophet (peace be upon him) that he wiped over splints (bandages). He said: It is not permissible; there is nothing [authentic] in this. Whoever narrated this... I said: They mentioned it from the companion of Al-Zuhri. He spoke about him with harsh words.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 83
  },
  {
    "serial_number": "3336205",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 113,
    "volume_number": 1,
    "text": "265 - I presented to him a hadith they narrated from Muhammad bin Al-Jarrah, from Shu'bah, from Sufyan Al-Thawri, from Ali, in Marfu' form (attributed to Prophet): 'Whoever prays such-and-such gets such-and-such, and whoever recites such-and-such gets such-and-such.' He said: This is Batil (false), Mawdu' (fabricated). I saw Ibn Al-Jarrah, and I saw he possessed hadiths that were fabricated for him; he did not know what Hadith was. 266 - I cast upon [presented to] Abu Abd Allah a hadith narrated by Al-Fadl bin...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 84
  },
  {
    "serial_number": "3336206",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 114,
    "volume_number": 1,
    "text": "...Musa, from Ibrahim bin Abd al-Rahman, from Ibn Jurayj, from Ata', from Ibn Abbas, who said: The Messenger of Allah (peace be upon him) opposed the funeral procession of Abu Talib. He said: This is Munkar; this man is Majhul (unknown). 267 - I said to Abu Abd Allah: Ali bin Al-Madini narrated from Al-Walid bin Muslim the hadith of Umar: 'Leave him to his Creator.' He said: This is a lie. Then he said: We wrote this from Al-Walid; it is actually 'So leave him to the One who knows him better.' This is a lie. 268 - I mentioned to him the hadith of Nafi', from Ibn Umar: 'Whoever sells a slave who has wealth, his wealth belongs to the seller.' He said: Salim contradicted him. Al-Zuhri narrated it like this from Salim, from Ibn Umar, from the Prophet (peace be upon him). I said: Which one is more established?",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 85
  },
  {
    "serial_number": "3336207",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 115,
    "volume_number": 1,
    "text": "He smiled and said: Allah knows best. I said: Which of the two does your heart incline towards? He said: I think—and Allah knows best—towards Nafi'.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 86
  },
  {
    "serial_number": "3336208",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 116,
    "volume_number": 1,
    "text": "269 - He denied the hadith of Talhah bin Zaid, from Musa bin Yasar, from Nafi', from Ibn Umar, who said: The Messenger of Allah (peace be upon him) said: 'In honey, there is the tithe (Ushr).' He said: Talhah bin Zaid used to stay with Shu'bah; he is nothing [unreliable]. He used to fabricate Hadith. 270 - And Bishr bin Numair is nothing. 271 - I showed him a hadith from Kathir bin Hisham, from Isa bin Ibrahim...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 87
  },
  {
    "serial_number": "3336209",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 117,
    "volume_number": 1,
    "text": "...from Sa'id bin Sinan, from Abu Al-Zahiriyah, from Kathir bin Murrah, who said: The Messenger of Allah (peace be upon him) said: 'Two sellers never met but that the blessing was taken from them.' He said: There is nothing [valid] in this. Isa bin Ibrahim and Sa'id bin Sinan are nothing. 272 - He said regarding the hadith of Ya'la, from Ghalib bin Ubaid Allah Al-Uqayli: He is nothing. 273 - I mentioned to him the hadith of Zuhair bin Muhammad, from Al-Ala', from his father, from Abu Hurairah, who said: The Messenger of Allah (peace be upon him) said: 'When it is halfway through Sha'ban...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 88
  },
  {
    "serial_number": "3336210",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 118,
    "volume_number": 1,
    "text": "...then do not fast.' He denied it and said: I asked Ibn Mahdi about it, but he did not narrate it to me, and he used to avoid it. Then Abu Abd Allah said: This is contrary to the hadiths narrated from the Prophet (peace be upon him). 274 - Abu Abd Allah was asked about Sa'id Al-Warraq. He said: He was not all that [strong]. They reported a Munkar hadith from him. I said: What is it? He said: From Yahya bin Sa'id, from Urwah, from Aisha, something about generosity. 275 - Luwain was mentioned, and he said: He narrated a Munkar hadith from Ibn Uyainah that has no basis. I said: What is it? He said: From Amr bin Dinar, from Abu Ja'far, from Ibrahim bin Sa'd, from his father, the story of Ali: 'I am not the one who expelled you, but Allah expelled you.' He denied it strongly and said: It has no basis.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 89
  },
  {
    "serial_number": "3336211",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 119,
    "volume_number": 1,
    "text": "276 - I heard him say: Ibn Wahb's hadith, some of it is hearing (Sama'), some is presentation (Ard), and some is handing over (Munawalah). He used to take the book of what he did not hear and say: Haywah said, so-and-so said. 277 - I heard him say: Salim bin Nuh, there is no harm in him; he is from the people of Basra. I wrote one hadith from him. 278 - I heard him say: There is no one in Kufa like Hannad; he is their Sheikh. 279 - I heard Abu Abd Allah say: Abu Badr did not use to say 'Haddathana' (narrated to us). They wanted him to say 'Haddathana Khasif', but he refused and said: 'This is not what Khasif said.' 280 - I heard him say—and Ibn Abi Rizmah said to him: Any need? He said: Yes, convey my greetings to Ibn Abi Umar, meaning Al-Adani.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 90
  },
  {
    "serial_number": "3336212",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 120,
    "volume_number": 1,
    "text": "281 - He was asked about Luwain. He said: I do not know him. The [book] 'Al-Fawa'id' was mentioned to him. He said: Hadith from weak narrators might be needed at times, but the Munkar is always Munkar. 282 - I asked him about Khalaf Al-Makhrumi. He said: They criticized him for following these hadiths. I said: Is he truthful (Saduq)? He said: I do not know him to lie, although he got involved with Al-Ansari in something; a hateful matter was reported about him. If he ordered a person [to get] something, he would buy it [himself first to sell it back]. I said: Was he practicing 'Inah (a usurious transaction)? He said: 'Inah is better than this. Then he said: I knew him to be chaste in stomach and private parts. 283 - I asked him about Mahmud bin Ghailan. He said: Trustworthy (Thiqah), I know him by Hadith, a man of Sunnah, he was imprisoned because of the Quran [issue].",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 91
  },
  {
    "serial_number": "3336213",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 121,
    "volume_number": 1,
    "text": "284 - I said: Abu Bakr, the mustamli (dictation assistant) of Waki', do you know him? He said: Yes, he used to be with us writing Hadith. He wrote a book for me in his handwriting, I think he said 'The Divorce'. I said: He narrated a hadith they denied; how few are those who have it from Abd al-Razzaq. Do you have it, and did Khalaf have it? He said: He was with us that year. I said: Which one is more pleasing to you, him or Mahmud? He said: No, Mahmud. Other than this, Mahmud is more pleasing to me. 285 - Nuh bin Habib Al-Qumasi was mentioned. He said: He was not a Nakasi. Goodness is evident upon him. I said: Should I write from him? He said: Yes. 286 - I asked him about Husain bin Al-Aswad. He said: I do not know him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 92
  },
  {
    "serial_number": "3336214",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 122,
    "volume_number": 1,
    "text": "287 - I presented to Abu Abd Allah a book containing these names, the brothers: Imran bin Uyainah, Ibrahim bin Uyainah, and Muhammad bin Uyainah. He said: Muhammad was something strange; he was after Sufyan. He used to wear wool. Ibrahim bin Uyainah narrated hadiths that were denied, and speech regarding him was softened [criticized]. 288 - I asked him about Umar bin Ubaid, Muhammad bin Ubaid, and Ya'la bin Ubaid. He declared them trustworthy, then said: Umar did not use to say 'Haddathana' nor 'Akhbarana'.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 93
  },
  {
    "serial_number": "3336215",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 123,
    "volume_number": 1,
    "text": "289 - In it was Abu Bakr bin Nafi'. He said: Abu Bakr bin Nafi' is Abd Allah bin Nafi', and he spoke something [about him]. 290 - In it were Suhail, Abd Allah bin Abi Salih, and Abbad. He said: Suhail, there is no harm in him. Abd Allah is Abbad. 291 - In it were Abd Al-Hakim bin Abd Allah bin Abi Farwah, Abd Al-A'la bin Abd Allah bin Abi Farwah, and Ishaq bin Abd Allah bin Abi...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 94
  },
  {
    "serial_number": "3336216",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 124,
    "volume_number": 1,
    "text": "...Farwah. He said: There is no harm in them, except Ishaq; for he shook his hand [dismissively], weakened him, and denied him. 292 - And Yunus bin Khabbab. He said: It has been reported about him, meaning regarding Uthman, and he softened him [criticized his status]. 293 - In it was Ayyub bin Khalid bin Sadaqah Al-Ansari. He said: I do not know him. 294 - And Ayyub bin Bashir Al-Adawi. He said: I do not know him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 95
  },
  {
    "serial_number": "3336217",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 125,
    "volume_number": 1,
    "text": "295 - In it were Ayyub bin Bashir Al-Ansari, Ayyub bin Kaysan, Ayyub bin Maysarah bin Halbas, Ayyub bin Marthad, Ayyub bin Abd al-Rahman bin Sa'sa'ah, and Ayyub bin Musa Al-Qurashi. He said: Ayyub bin Musa is Thiqah (trustworthy). 296 - And Ayyub bin Thabit, Ayyub bin Abbad, and Ayyub bin...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 96
  },
  {
    "serial_number": "3336218",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 126,
    "volume_number": 1,
    "text": "...Najih. It was as if he did not know these. 297 - It was said to him: Muhammad bin Ishaq and the nephew of Al-Zuhri regarding the hadith of Al-Zuhri? He said: I do not know, and he moved his hand as if he weakened them. 298 - It was said to him: Then Hafs and Abdah? He said: As for Abdah, he is truthful and established (Thabt). As for Hafs, he shook his hand and said: Leave him regarding his hadith. 299 - It was said to him: Then Za'idah and Zuhair? He said: These—Sufyan, Shu'bah, Za'idah, and Zuhair—these are the trustworthy ones (Al-Thiqat).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 97
  },
  {
    "serial_number": "3336219",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 127,
    "volume_number": 1,
    "text": "300 - It was said to him: Then Bishr bin Al-Sari? He said: Established (Thabt). 301 - He said: Shu'aib bin Harb told us, he said: I heard Sufyan say: I would not love to agree with them on the truth, meaning Abu Hanifah. 302 - Abu Abd Allah said: Ismail bin Umayyah and Ayyub bin Musa are from the people of Makkah; they are cousins. Ayyub bin Musa was more beneficial to the people, but Ismail is more trustworthy (Awthaq) than him and more established. 303 - Abu Abd Allah was asked about Abu Al-Salt. He said: He narrated...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 98
  },
  {
    "serial_number": "3336220",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 128,
    "volume_number": 1,
    "text": "...Munkar hadiths. It was said to him: He narrated the hadith of Mujahid from Ali: 'I am the city...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 99
  },
  {
    "serial_number": "3336221",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 129,
    "volume_number": 1,
    "text": "...of knowledge and Ali is its gate.' He said: We have not heard of this. It was said to him: Is this what you deny from him? He said: Other than this. As for this, we have not heard of it. And he narrated from Abd al-Razzaq hadiths we do not know and have not heard. 304 - It was said to Abu Abd Allah: Abd al-Razzaq had some of these bad hadiths. He said: I did not hear anything of them.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 100
  },
  {
    "serial_number": "3336222",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 130,
    "volume_number": 1,
    "text": "Sufyan bin Musa? I asked him about Ubaid Allah bin Musa: Did you extract anything from him? He said: I might have extracted from him, and I might have crossed him out. He narrated from people who were not trustworthy; if it was from the hadith of Al-A'mash, then [it is acceptable] upon that. 306 - I asked him about Abu Bakr Al-Athram. I said: I was forbidden to write from him. He said: I did not say that Hadith should not be written from him; I only dislike these questions [being attributed] to here from Al-Marwadhi.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 101
  },
  {
    "serial_number": "3336223",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 139,
    "volume_number": 1,
    "text": "The Questions (Masa'il) of Salih son of Imam Ahmad",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 102
  },
  {
    "serial_number": "3336224",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 141,
    "volume_number": 1,
    "text": "1 - Abu Awanah Ya'qub bin Ishaq told us, he said: Salih bin Ahmad bin Hanbal Abu Al-Fadl told us in Damascus, he said: My father told us, he said: Affan told us, he said: Yahya bin Sa'id told us, he said: I asked Shu'bah, Sufyan bin Sa'id, Sufyan bin Uyainah, and Malik bin Anas about a man who does not memorize or is accused regarding Hadith. He said: They all said: Clarify his status. 2",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 103
  },
  {
    "serial_number": "3336225",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 143,
    "volume_number": 1,
    "text": "6 - Abu Awanah told us, he said: Salih bin Ahmad told us, he said: My father told me, he said: Affan told us, he said: Mu'adh told us, he said: Al-Ash'ath said: I never saw Hisham with Al-Hasan ever. He said: It was said to him: Indeed, Amr says this, and if you say it, you strengthen him against him, or [he said] he told the truth, or something like this. He said: I will not say this, and I will not return to this.\n7 - He said: My father told me, he said: Affan told us, he said: Hammam told us, he said: Abu Dawud Al-A'ma came to us and narrated to us from Zaid bin Arqam, from Al-Bara' bin Azib, and from the Companions of the Messenger of Allah (peace be upon him). He said: So we said to Qatadah: Indeed, Abu Dawud narrates to us and mentions these [Companions]. He said: This man is a liar; he used to beg from people before the Jarif plague.\n8 - He said: My father told me, he said: Affan told us, he said: Hammam told us, he said: Matar told me: Amr bin Ubaid met me and said: By Allah, indeed I and you are upon one matter. He said: And he lied, by Allah; he only meant regarding the earth [i.e., a worldly dispute]. He said: Matar said: By Allah, I do not believe him regarding anything.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 104
  },
  {
    "serial_number": "3336226",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 144,
    "volume_number": 1,
    "text": "9 - He said: My father told me, he said: Affan told us, he said: Hammad bin Salamah told us, he said: Humaid was among those who restrained themselves most from him. He said: So he came one day to Humaid, and Humaid narrated a Hadith to us. He said: So Amr said to him: Al-Hasan used to say it. He said: So Humaid said to me: Do not take anything from this one, for he lies about Al-Hasan. He used to come to Al-Hasan after he became old and say: O Abu Sa'id, do you not say such-and-such? Regarding something that was not his saying. He said: So the Sheikh would nod his head like this.\n10 - He said: My father told me, he said: Affan told us, he said: Hammad bin Salamah told us from Ali bin Zaid, he said: Al-Hasan did not hear from Abu Huraira.\n11 - He said: My father told me, he said: Affan told us, Wuhaib told us, he said: Ayyub said: Al-Hasan did not hear from Abu Huraira.\n12 - He said: My father told me, he said: Abu Qatan told us, he said: Al-Mas'udi said: We did not catch anyone who spoke more according to the statements of the Shi'a than Adi bin Thabit.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 105
  },
  {
    "serial_number": "3336227",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 145,
    "volume_number": 1,
    "text": "13 - He said: My father told me, he said: Affan told us, he said: Wuhaib told us, he said: When Abdul-Majid died, Ayyub said to us: Stick to this young man - meaning Abdul-Wahhab Al-Thaqafi.\n14 - He said: My father told me, he said: Affan told us, he said: Bishr bin Al-Mufaddal told us, he said: Ibn Awn told us, he said: When Muhammad died, we said: Who do we have? He said: So we said: Ayyub.\n15 - He said: My father told me, he said: Mu'adh told us, he said: Ibn Awn told us, he said: I mentioned to Ibrahim two men from the Saba'iyyah - meaning Al-Mughirah bin",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 106
  },
  {
    "serial_number": "3336228",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 146,
    "volume_number": 1,
    "text": "Sa'id and Abu Abdul-Rahim. So he was alarmed by them and said: Beware of them, for they are liars.\n16 - He said: My father told me, he said: Mu'adh told us, Ismail bin Ibrahim told us, he said: Abdul-Aziz Al-Dabbagh came to me and said: Indeed, I disapproved of [the look on] Ibn Awn's face, and I do not know what is the matter with him. He said: So I went with him to Ibn Awn and said: O Abu Awn, what is the matter with Abdul-Aziz? He said: Qutaibah, the owner of silk, informed me",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 107
  },
  {
    "serial_number": "3336229",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 147,
    "volume_number": 1,
    "text": "149-151 that he saw him walking with Amr bin Ubaid in the market. He said: So Abdul-Aziz said to him: I only asked him about something, and by Allah, I do not praise his opinion. He [Ibn Awn] said: And you ask him too?\n17 - He said: My father told me, he said: Al-Aswad bin Amir told us, he said: Abu Bakr - meaning Ibn Ayyash - informed us, from Asim, he said: Abdul-Rahman used to say: No Haruri (Kharijite) shall sit with me, nor shall a man who sat with Shaqiq Al-Dabbi sit with me. Abu Bakr said: And he was argumentative. He said: And do not sit with the storytellers (Al-Qussas) except Abu Al-Ahwas, for he is not accused [of lying]. From the Companions of Abdullah up to here is from Salih bin Ahmad.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 108
  },
  {
    "serial_number": "3336230",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 151,
    "volume_number": 1,
    "text": "The Narration of Abu Al-Hasan Abdul-Malik bin Abdul-Hamid Al-Maymuni",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 109
  },
  {
    "serial_number": "3336231",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 153,
    "volume_number": 1,
    "text": "Abu Awanah Ya'qub bin Ishaq told us, he said: Abdul-Malik bin Abdul-Hamid bin Maimun bin Mihran Abu Al-Hasan Al-Maymuni told us, and I asked him:\n1 - He said: Ahmad bin Hanbal told us, he said: Abdur-Razzaq told us, from Ma'mar, he said: I mentioned to Amr bin Dinar Abu Al-Sha'tha' and what the Ibadis claim [regarding him]. He said: I never heard anything from him regarding this ever. He said: So a man came to him and said:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 110
  },
  {
    "serial_number": "3336232",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 154,
    "volume_number": 1,
    "text": "O Abu Muhammad, what did Abu Al-Sha'tha' say regarding such-and-such? So he looked at me and smiled and said: 'Iyazi shan ast' [It is their fabrication].\n2 - Al-Maymuni told us, he said: Ahmad bin Hanbal told us, he said: Ibrahim - meaning Ibn Khalid Al-San'ani - told us, from Umayyah bin Shibl, from Ma'mar, from Ayyub, he said: Ikrimah came to us, and people gathered around him until he ascended to the roof of a house.\n3 - Al-Maymuni told us, he said: Ahmad bin Hanbal told us, he said: Ibrahim told us, from Umayyah, from Amr bin Muslim, he said: Ikrimah came to Tawus, so he gave him a meager price, sixty dinars. And he said: Should I not buy the knowledge of this slave for sixty dinars?\n4 - Al-Maymuni told us, he said: Ahmad bin Hanbal told us, he said: Hajjaj told us, he said: I heard Shu'bah from Khalid, he said: Ikrimah said to a man who was asking him: What is wrong with you? Have you become bankrupt (Ajbalta)? Meaning: Have you stopped? Shu'bah said: Then Ayyub told me, he said:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 111
  },
  {
    "serial_number": "3336233",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 155,
    "volume_number": 1,
    "text": "Khalid was asking Ikrimah, then Khalid fell silent. So Ikrimah said: What is wrong with you? Have you become bankrupt (Ajbalta)? Meaning: Have you stopped?\n5 - Al-Maymuni told us, Amr bin Marzuq Al-Basri told us, he said: Shu'bah told us, from Amr bin Murrah, from Sa'id bin Al-Musayyib, he said: A man asked him about something from the Book of Allah, but he did not say anything about it. Then he said to him: Ask about that the one who claims that nothing from the Book of Allah is hidden from him - meaning Ikrimah.\n6 - Al-Maymuni told us, he said: I heard Ahmad bin Hanbal say: I heard Yahya say: Sufyan told me in Kufa during the life of Al-A'mash, from Ibrahim, from Umar regarding ostrich eggs. He said: This is not from his old hadith.\n7 - Al-Maymuni told us, he said: Ahmad bin Hanbal told us, he said: Hajjaj told us, he said: Shu'bah said: Rufay' caught up with Ali, but he did not hear from him - meaning Abu Al-Aliyah.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 112
  },
  {
    "serial_number": "3336234",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 156,
    "volume_number": 1,
    "text": "8 - Al-Maymuni told us, he said: Ahmad told us, he said: Sufyan told us, he said: Ibn Shubrumah said: There is no one in Mecca like him - meaning Hisham bin Hujayr.\n9 - He said: Ahmad told us, he said: Abdul-Samad told us, he said: Harb told us, he said: Yahya said: Everything from Abu Salam is only [from] a book.\n10 - Al-Maymuni told us, he said: And Abu Abdullah [Ahmad] narrated a hadith to us which he deemed good from Muhammad bin Ishaq. So I said: O Abu Abdullah, how beautiful are these stories that Ibn Ishaq brings! So he smiled at me in amazement.\n11 - And a man asked Abu Abdullah about a hadith, so he said: It is from Salih bin Abi Al-Akhdar. What can be done with it? He bid farewell to it with one of two words.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 113
  },
  {
    "serial_number": "3336235",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 157,
    "volume_number": 1,
    "text": "12 - Al-Maymuni told us, he said: Abu Abdullah told us, he said: Abdul-Hamid bin Abdul-Rahman Abu Yahya told us. Then he said to us: He was truthful in Hadith, if Allah wills. And all of us used to come to him in Kufa; he had no one with him but children. And perhaps he would come to Abu Muawiyah, and Abu Muawiyah would say to him words with which he joked. Then Abu Abdullah said: He used foul language with him that I dislike to speak of. So I said: What about this son of his? He said to me: I do not know. Then he shook his hand in his face more than once, rejecting him.\n13 - Al-Maymuni told us, he said: They asked him - meaning Ahmad bin Hanbal - about Abu Tudrus, and he said: I do not know him.\n14 - Al-Maymuni told us, he said: I asked him between me and him, seeking to understand and verify, so I said: O Abu Abdullah, we have been tested with these Jahmiyyah; what do you say",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 114
  },
  {
    "serial_number": "3336236",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 158,
    "volume_number": 1,
    "text": "about the one who says Allah is not above the Throne? He said: Their speech all revolves around Kufr (disbelief). I said: What do you say about one who says Allah did not speak to Moses? He said: A disbeliever, no doubt about it. I said: Whoever says the Names of Allah are created (Muhdathah)? He said: A disbeliever. Then he said to me: 'Allah' is among His Names, so whoever says they are created has claimed that Allah is created. And he began to emphasize the gravity of their affair and declare them disbelievers. He recited: {Allah is your Lord and the Lord of your first forefathers} and mentioned another verse. I said: Whoever says Allah existed but His Knowledge did not? His face changed at all of this, and he was most changed and angry at this. Then he said to me: A disbeliever. And he said: Every day I increase in insight regarding these people.\n15 - Al-Maymuni told us, he said: I heard Abu Abdullah say: Shu'bah said: Qatadah did not meet Abu Rafi'; he only wrote from Khilas from him. And I heard him say: Indeed Qatadah did not hear from Mu'adhah.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 115
  },
  {
    "serial_number": "3336237",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 159,
    "volume_number": 1,
    "text": "16 - Al-Maymuni told us, he said: My strongest assumption is that Abu Abdullah mentioned Abdullah bin Raja', so he declared him trustworthy and favored him. I said: What is his story? He said: He was [good], then he made mistakes and had delusions. He narrated a hadith one day, and it was said to him: You erred in it. So he said: Allah's help is sought regarding our errors in other things as well, or [he admitted] we have erred. Abu Abdullah said to me: So if the Sheikh admits this, know that he is safe. And perhaps something comes out of a person, and the heart testifies to his truthfulness.\n17 - Al-Maymuni told us, he said: I asked him about the two sons of Buraidah. He said: Sulaiman is sweeter to the heart, and it is as if he is the more sound of the two in Hadith. And Abdullah has things that it is as if we denounce them due to their beauty, and he is acceptable (Ja'iz) in Hadith.\n18 - And Al-Furat bin Al-Sa'ib is close to Muhammad bin Ziyad",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 116
  },
  {
    "serial_number": "3336238",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 160,
    "volume_number": 1,
    "text": "Al-Tahhan regarding Maimun; he is accused of what that one is accused of.\n19 - And Al-Furat bin Salman is trustworthy (Thiqah), truthful (Saduq).\n20 - And Abu Al-Malih is trustworthy, precise (Dabit) in his hadith, truthful. And to me, he is more precise than Ja'far bin Burqan. And Ja'far bin Burqan is trustworthy, precise in the hadith of Maimun and the hadith of Burayd bin Al-Asam, but regarding the hadith of Al-Zuhri, he is agitated and inconsistent in it.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 117
  },
  {
    "serial_number": "3336239",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 161,
    "volume_number": 1,
    "text": "21 - And Asim bin Kulaib is trustworthy.\n22 - And Asim bin Bahdalah is trustworthy. He mentioned him with Quran, righteousness, and virtue, and [said] he is Salih al-Hadith (good in Hadith). Al-A'mash is greater than him among the Kufans.\n23 - And Asim Al-Ahwal is among the Huffaz (preservers) of Hadith, trustworthy.\n24 - And he said: Abdul-Wahhab is weak in Hadith, agitated.\n25 - And Ja'far bin Muhammad bin Ali bin Husain is trustworthy, strong in Hadith.\n26 - And his father, Abu Ja'far Muhammad bin Ali bin Husain, is trustworthy, strong in Hadith.\n27 - And Mujalid, from Al-Sha'bi and others, is weak in Hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 118
  },
  {
    "serial_number": "3336240",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 162,
    "volume_number": 1,
    "text": "28 - And Zakariya, from Al-Sha'bi and others, is good (Jayyid) in Hadith, trustworthy.\n29 - And Alqamah bin Marthad used to be accused of Irja', and he was trustworthy in his hadith, precise.\n30 - Al-Maymuni told us, he said: Abu Abdullah said to me: When Ibn Mahdi mentioned Hammad bin Zaid, he would say: Our Sheikh, and our Sheikh was firm in the Sunnah. Abu Abdullah said: And he did not have a book; his hadith was all from memory.\n31 - Al-Maymuni told us, he said: And I heard Abu Abdullah say: Jarir said regarding the hadith of Al-A'mash: We used to stick them [together]",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 119
  },
  {
    "serial_number": "3336241",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 163,
    "volume_number": 1,
    "text": "32 - He said: Sulaiman bin Abi Muslim Al-Ahwal is trustworthy, good in Hadith, and Ibn Uyainah narrated from him.\n33 - Al-Maymuni told us, he said: He told me: And Yahya and Abdul-Rahman used not to narrate anything from Jabir Al-Ju'fi. Abu Abdullah said: And Jabir was deserving of that.\n34 - He said: And Abu Al-Za'ra' is more pleasing to me in Hadith than Abu Sufyan Talhah bin Nafi'.\n35 - And he said to me: Al-Aswad bin Shaiban is among the best of Allah's servants. He used to say when they gathered at his place: As for me, I have a need, I want to pray. He said: You know that there was no showing off in his heart.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 120
  },
  {
    "serial_number": "3336242",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 164,
    "volume_number": 1,
    "text": "36 - He said: And Malik was among the most established of people, yet he used to make mistakes.\n37 - Abu Abdullah said: Al-Mas'udi is Salih al-Hadith (good in Hadith), and whoever took from him early on, then his taking is sound.\n38 - And I asked him about Uqayl. He said: Salih al-Hadith; his narration is like the narration of his companions, there is no harm in him.\n39 - Ali bin Abi Talhah has denounced things (Manakir), and he is a man from the people of Homs.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 121
  },
  {
    "serial_number": "3336243",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 165,
    "volume_number": 1,
    "text": "40 - Ali bin Al-Mubarak, there is no harm in his hadith.\n41 - Sulaiman bin Bilal is Salih al-Hadith.\n42 - Sharik bin Abi Namir is Salih al-Hadith.\n43 - Al-Zubayr bin Abdullah from Ja'far bin Mus'ab: We do not know either of them.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 122
  },
  {
    "serial_number": "3336244",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 166,
    "volume_number": 1,
    "text": "44 - Al-Miqdam bin Shuraih is trustworthy.\n45 - Isra'il is Salih al-Hadith.\n46 - And Ash'ath bin Abi Al-Sha'tha' - he is Ibn Sulaym Al-Muharibi, and his father is a man from the companions of Abdullah - is Salih al-Hadith.\n47 - Abu Atiyah is trustworthy.\n48 - Ibn Al-Asbahani is Salih al-Hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 123
  },
  {
    "serial_number": "3336245",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 167,
    "volume_number": 1,
    "text": "49 - Mujahid bin Wardan has very little [material].\n50 - Abu Al-Rijal, the companion of Amrah, is Salih al-Hadith.\n51 - Muhammad bin Abdul-Rahman bin Zurarah is Salih al-Hadith.\n52 - Salim Al-Dawsi, I do not know [him].\n53 - Muawiyah bin Salih, I know nothing but good [about him].\n54 - Habib Al-Mu'allim is trustworthy.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 124
  },
  {
    "serial_number": "3336246",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 168,
    "volume_number": 1,
    "text": "55 - Abu Al-Muhazzim Yazid: As for Shu'bah, he did not narrate from him, but Hammad bin Salamah narrates from him.\n56 - And Abu Bakr bin Hafs is trustworthy.\n57 - And Ibrahim bin Maimun, we do not know him.\n58 - Talhah bin Yahya is Salih al-Hadith.\n59 - Yazid bin Ibrahim is trustworthy.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 125
  },
  {
    "serial_number": "3336247",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 169,
    "volume_number": 1,
    "text": "60 - Mughirah bin Ziyad, I do not know.\n61 - And Usamah bin Zaid, the general populace is upon him; they have narrated from him, except that Yahya bin Sa'id abandoned him.\n62 - Ibrahim bin Al-Fadl, I do not know.\n63 - Dawud Al-Awdi is weak.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 126
  },
  {
    "serial_number": "3336248",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 170,
    "volume_number": 1,
    "text": "64 - Imran bin Hudair is trustworthy.\n65 - Al-Maymuni told us, he said: And I heard him say: I have not seen anyone more knowledgeable than Yahya bin Sa'id - meaning regarding the rituals (Manasik).\n66 - Al-Maymuni told us, he said: I asked Khalaf: Did anyone refrain from Jabir Al-Ju'fi? He said: I do not know [anyone who did]. Sufyan bin Uyainah was among those strongest in speech regarding him, yet he narrated from him. He only had three hadiths. I said: Is anything authentic from him that he believes in the Return (Raj'ah)? He said: No, but he was from the Shia of Ali. And Shu'bah, Al-Thawri, and the people narrate from him, except that these people do not narrate from him those things in which he combines Al-Qasim, Salim, and a group like this, seven or eight [chains]. For what would he narrate these things from him?\n67 - Al-Maymuni told us, he said: I heard Harun bin Ma'ruf say: I heard Abdullah bin Wahb say: Abdul-Rahman bin Mahdi said to me: Write for me from the hadiths of Amr. So I wrote two hundred hadiths for him, and I narrated them to him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 127
  },
  {
    "serial_number": "3336249",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 171,
    "volume_number": 1,
    "text": "68 - Al-Maymuni told us, he said: I said to Yahya bin Ma'in: The hadiths from the Prophet, may Allah bless him and grant him peace, regarding the dislike of Cupping (Hijama) for the fasting person, how is the source through which they were reported? He said: They are all good (Jiyad). We said: From what they say, [they are] agitated (Mudtarib)? He said: I do not say that these hadiths are agitated.\n69 - Al-Maymuni told us, he said: I heard Yahya say: Muhammad bin Ishaq...\n70 - We asked him about Abdul-Rahman bin Ishaq. He said: The Kufan is weak.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 128
  },
  {
    "serial_number": "3336250",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 172,
    "volume_number": 1,
    "text": "71 - And Abdul-Rahman bin Ishaq Al-Basri, who narrates from Al-Zuhri, there is no harm in him.\n72 - Al-Maymuni told us, he said: I said to Abu Zakariya Yahya: Ismail bin Zakariya from Al-A'mash from Habib bin Abi Thabit from Sa'id bin Jubayr from Ibn Umar and Ibn Abbas, they both said: If a man swears off his wife (Ayla) and four months pass, it is an irrevocable divorce (Talqah Ba'inah). I said: Is the contrary narrated from them? He said: Yes, Sufyan and Shu'bah both narrate the contrary, or [he said] this hadith is a mistake. I said: From whom did it come? He said: Ismail bin Zakariya, he is weak in Hadith. I said: So did it come from him? He said: No, it is famous from Al-A'mash. I said: So did it come from Al-A'mash? He said: Yes, that is what I think, that it came from Al-A'mash.\n73 - Al-Maymuni told us, he said: Layth bin Abi Sulaim was mentioned, he said:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 129
  },
  {
    "serial_number": "3336251",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 173,
    "volume_number": 1,
    "text": "Weak in Hadith from Tawus. And if he combines Tawus and others [adding] an addition, he is weak.\n74 - Al-Maymuni told us, he said: I heard Abu Abdullah Ahmad bin Hanbal say: Marwan bin Shuja' told us. Abu Abdullah said: A truthful Sheikh.\n75 - Al-Maymuni told us, he said: Al-Hisni told us, he said: Ma'qil told us, he said: I came to Muhammad bin Ishaq and heard him speaking about Qadar (freewill/predestination heresy), so I never returned to him.\n76 - Al-Maymuni told us, he said: I heard him say: Mudrik bin Umarah is a known man. And another man named Mudrik was mentioned, he said: He is not known.\n77 - He said: They asked him about the hearing of Abu Salamah from his father. So I heard him",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 130
  },
  {
    "serial_number": "3336252",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 174,
    "volume_number": 1,
    "text": "say: His father died while he was small. Abu Salamah was one of the youngest of them. Then he said: There is no one among the people [who narrates] more than Abu Salamah. I said: In the quantity of narration? He said: In the quantity of what he narrates, and he sat with Ibn Abbas, and the status of Abu Salamah was great on that day.\n78 - I heard Al-Maymuni say: Ahmad bin Hanbal was asked: Narrate to us the hadith of Abdul-Qais from Al-Qati'i? So he said: Ask some of the scholars of Gharib (strange/uncommon words), for I dislike speaking about the saying of the Messenger of Allah, may Allah bless him and grant him peace, based on conjecture and then making a mistake.\n79 - Al-Maymuni told us, he said: And Abu Abdullah mentioned Za'idah, so he prioritized him and favored him in verification and precision.\n80 - Al-Maymuni told us, he said: They asked him: Who narrated most regarding Ayyub? He said: In my view, no one is more knowledgeable about his hadith than Hammad - meaning Ibn Zaid - and he erred in several things.\n81 - I heard Al-Maymuni say: And it is correct to me that he did not attend",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 131
  },
  {
    "serial_number": "3336253",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 175,
    "volume_number": 1,
    "text": "[the funeral of] Abu Nasr Al-Tammar when he died. So I assumed that was due to what he had answered during the Inquisition.\n82 - Al-Maymuni told us, he said: I heard Ahmad bin Hanbal, and he was asked about the hadith of Abu Qais Al-Awdi regarding what he narrated from Al-Mughirah bin Shu'bah from the Prophet, may Allah bless him and grant him peace, that he wiped over the sandals and the socks. So he said to me:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 132
  },
  {
    "serial_number": "3336254",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 176,
    "volume_number": 1,
    "text": "It is known from the Prophet, may Allah bless him and grant him peace, that he wiped over the Khuffs (leather socks). This matter is not [sound]. I mean Qais, that he has denounced things (Manakir).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 133
  },
  {
    "serial_number": "3336255",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 177,
    "volume_number": 1,
    "text": "83 - Al-Maymuni told us, he said: Ibn Hanbal told us, he said: Yahya told us, he said: Zuhair [said]: I saw Ash'ath bin Sawar standing at Abu Al-Zubayr's place, with people between them, and Abu Al-Zubayr was narrating. So Ash'ath would say: How did he say? And what did he say?\n84 - Al-Maymuni told us, he said: Ibn Hanbal told us, he said: Affan told us, he said: Mu'adh told us, he said: Ash'ath said: I never saw Hisham - meaning Ibn Hassan - with Al-Hasan ever. So it was said to him: Indeed Amr says this, so if you say it, you strengthen him against him, [even] if he told the truth or something like this. He said: I will not say this, and I will not return to this.\n85 - He said: Ibn Hanbal told us, he said: Affan told us, Mu'adh told us, he said: Humaid Al-Batty said: If people come to you, one matter carries them? No, but take",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 134
  },
  {
    "serial_number": "3336256",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 178,
    "volume_number": 1,
    "text": "from this one and that one, so reconcile between them. He said: So Al-Batty said: I cannot bear your magic. And Humaid was a reconciler/reformer - look at Al-Basr[a].\n86 - He said: And Ibn Hanbal told us, he said: Affan told us, he said: Yahya bin Sa'id told me, he said: I used to ask Humaid about something from the Fatwa of Al-Hasan, and he would say: I have forgotten.\n87 - He said: Ibn Hanbal told us, he said: Ismail told us, he said: Abu Raja' told us, he said: I said to Al-Hasan: When was your time in Medina? He said: The nights of Siffin. He said: I said: So when did you move? He said: A year after Siffin.\n88 - Al-Maymuni told us, he said: I heard him - and he mentioned Abdul-Warith - so he said: He was older than Ismail bin Ulayyah by two years, and he heard from more than one person",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 135
  },
  {
    "serial_number": "3336257",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 179,
    "volume_number": 1,
    "text": "Ismail did not hear from him. Then he mentioned the precision of Abdul-Warith and that he was a master of grammar. Then he said: And he erred in several things. Then he said: He narrated hadiths from Ayyub that none of his companions narrated, yet despite this, to him [Ahmad], he is firm (Thabt) and precise (Dabit).\n89 - He said: And I heard Abu Abdullah Ahmad bin Hanbal say: Faith is speech and action, it increases and decreases. They said to him: And intention? He said: Intention is a prerequisite in this place.\n90 - Al-Maymuni told us, he said: Yahya - meaning Ibn Ayyub - told us, he said: I heard Humaid Al-Ru'asi say: Zuhair, when he heard a hadith from a narrator, would write upon it: \"I have finished.\"\n91 - Al-Maymuni told us, he said: Yahya told us, he said: I heard Shu'aib bin Harb, and a hadith from Zuhair and Shu'bah was mentioned, so Shu'bah was mentioned to him [as superior], so he said:",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 136
  },
  {
    "serial_number": "3336258",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 180,
    "volume_number": 1,
    "text": "Zuhair is more memorizing than twenty like Shu'bah. Yahya said: He said: I heard Mu'adh bin Mu'adh say: No, by Allah, Sufyan was not more established to me than Zuhair. Yahya said: He said: I heard Mu'adh bin Mu'adh say: If I heard the hadith from Zuhair, I did not mind if I did not hear it from Sufyan.\n92 - He said: Yahya told us, he said: I heard Aswad bin Salim say: I heard Hushaim say: We used to leave the sitting of Shu'bah because he used to involve us in backbiting.\n93 - Al-Maymuni told us, he said: And Abu Abdullah said to me one day: O Abu Al-Hasan, indeed I liken the piety of your grandfather Maimun to the piety of Ibn Sirin.\n94 - Al-Maymuni told us, he said: I asked Abu Abdullah about Aflah bin Humaid. He said: Good/Acceptable, he is tolerable.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 137
  },
  {
    "serial_number": "3336259",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 181,
    "volume_number": 1,
    "text": "95 - I said: Salamah bin Wardan? He said to me: The one who narrates from Anas? I do not know what his hadith is; he has denounced things.\n96 - I said: Dawud bin Qais Al-Farra'? He said: Good in Hadith.\n97 - I said: Muhammad bin Abdullah, the nephew of Al-Zuhri? He said: Tolerable also.\n98 - I said: Usamah bin Zaid narrates from Al-Qasim? He said: And this one also, people tolerate him, except that Yahya Al-Qattan abandoned him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 138
  },
  {
    "serial_number": "3336260",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 182,
    "volume_number": 1,
    "text": "99 - Abdul-Rahman bin Abi Al-Mawwal? He said: I do not see any harm in his hadith; he is among those who are tolerated.\n100 - I said: Fayid, the freed slave of Ubaidullah? He said: This is the one whose hadith people abandoned. Abu Al-Warqa', he is called the companion of Ibn Abi Awfa.\n101 - I said: Hisham bin Sa'd Al-Khashab? He said: He is a man who is tolerated.\n102 - I said: Isa bin Asim? He said: Trustworthy.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 139
  },
  {
    "serial_number": "3336261",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 183,
    "volume_number": 1,
    "text": "103 - I said: Sa'id bin Muslim bin Banak? He said: I also see no harm in him.\n104 - I said: Ibrahim bin Abdullah bin Al-Harith Al-Jumahi? He said: I find myself knowing this one.\n105 - I said: Sulaiman bin Abi Khalid narrates from his father? He said: I do not know him.\n106 - I asked him about Umar bin Nabih Al-Ka'bi. He said: There is no harm in him.\n107 - Al-Maymuni told us, he said: Abu Abdullah said: Husain bin Waqid has denounced things.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 140
  },
  {
    "serial_number": "3336262",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 184,
    "volume_number": 1,
    "text": "108 - I asked him about Abdullah bin Sa'id bin Abi Hind, so he said: Trustworthy.\n109 - I asked him about Dawud bin Bakr bin Abi Al-Furat, so he said: I do not know him.\n110 - And I asked him about Abdullah bin Amir Al-Aslami who narrates from Abu Al-Zubayr. He said: He is not strong in Hadith.\n111 - And I asked him about Nafi' bin Jubayr bin Mut'im, so he said to me: A man from the sons of the Companions, trustworthy; we know nothing but good.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 141
  },
  {
    "serial_number": "3336263",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 185,
    "volume_number": 1,
    "text": "112 - And I asked him about Muhammad bin Amr [narrating] from Abu Salamah. So he said to me: Perhaps he raised some hadith, and perhaps he stopped it. And he is tolerable. And Yahya bin Sa'id is more established in Hadith than him.\n113 - And I asked him about Abdullah bin Dinar from Ibn Umar. So he said to me: Trustworthy, except one hadith he narrates from Ibn Umar, he said: \"Loyalty is not sold nor gifted.\" And Nafi' said in the story of Barirah: \"Loyalty belongs to the one who liberated.\"",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 142
  },
  {
    "serial_number": "3336264",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 186,
    "volume_number": 1,
    "text": "114 - And I asked him about Kulaib bin Wa'il who narrates from Ibn Umar. He said: I see no harm in him.\n115 - I asked him about Amr bin Dinar regarding Ibn Abbas and Ibn Umar. He said: Among the trustworthy ones. It is reported from Shu'bah that he said: I have not seen anyone more established than Amr bin Dinar. I said: He has things he sends (Mursal)? He said: If he says \"I heard\" or \"He told us.\" And he used to narrate things from a man from Ibn Abbas.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 143
  },
  {
    "serial_number": "3336265",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 187,
    "volume_number": 1,
    "text": "116 - Al-Maymuni told us, he said: And I heard Abu Abdullah say: Abdullah bin Zaid bin Aslam is more established than Abdul-Rahman. I said: So Abdul-Rahman? He said: So-so; he is not like him. And he weakened his status a little.\n117 - He said: And I heard Abu Abdullah say: Mahdi is trustworthy. I said: Mahdi bin Maimun? He said: Yes, trustworthy.\n118 - He said: And I heard him say: Abdullah bin Wahb Al-Misri was a righteous man. What [great] Hadith he possessed! I saw him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 144
  },
  {
    "serial_number": "3336266",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 188,
    "volume_number": 1,
    "text": "What [a man]! And he praised him. And Abu Abdullah mentioned his leniency in taking [Hadith methods]. I said to him: Is it like his Egyptian companions or the generality of his companions in leniency in taking? He said to me: Yes.\n119 - And I heard him say: Bishr bin Rafi', I do not see him as strong in Hadith.\n120 - And I heard him say: Haywah bin Shuraih is a righteous man, he has beautiful things. And he increased the praise of Ibn Al-Mubarak regarding him: \"No one was described [to me] except that I saw him to be less than what was described, except Haywah, for I saw him and he fulfilled what was described to me.\"\n121 - I asked him about Abu Abdullah Al-Shaqri. He said: He is not strong to me; he is weak.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 145
  },
  {
    "serial_number": "3336267",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the Speech of Ahmad bin Hanbal on Hadith Defects and Knowledge of Men",
    "edition": "First, 1409",
    "publisher": "Maktabat Al-Ma'arif - Riyadh",
    "page_number": 189,
    "volume_number": 1,
    "text": "122 - And he mentioned Al-Walid bin Muslim, so he said: He was a man of leniency.\n123 - Al-Maymuni told us, he said: Khalid bin Khidash told us: Al-Darawardi, Ma'n, and the generality of the people of Medina said to me: Do not narrate from Abdul-Rahman bin Zaid bin Aslam, for he does not know what he is saying. But stick to Abdullah bin Zaid.\n124 - I asked him about Ata' Al-Sulaimi, so he said to me: This is one of the best of Allah's servants. He has no Hadith; it is only his opinion and his speech.\n125 - And Salm Al-Alawi, he said: I knew nothing but good, but Shu'bah spoke against him. I said: Because of the story of the new moon? He said to me: Yes.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 146
  },
  {
    "serial_number": "3336268",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 190,
    "volume_number": 1,
    "text": "126 - I said: So Al-Rabi' bin Sabih? He said to me: regarding his conduct, he is a righteous man, but he does not possess Hadith that is needed; it is as if he weakened his status. 127 - I said: Hammad bin Abi Sulaiman? He said: As for the hadiths of these trustworthy ones (Thiqat) from him—Shu'bah, Sufyan, and Hisham—they are close [acceptable] hadiths. However, he was the first to speak about Opinion (Ra'y). I said: Did he hold the view of Irja'? He said to me: Yes, he held the view of Irja'. 128 - I said: Jabir Al-Ju'fi? He said to me: He held the view of Tashayyu' (Shi'ism). I said: Is he accused of lying in his Hadith? He said to me: Whoever attacked him only attacked him due to the fear of lying. I said: Lying? He said: Yes, by Allah, and that is evident in his Hadith when you look at it. 129 - I said: Hanzalah bin Abi Sufyan? He said to me: Trustworthy (Thiqah), Trustworthy. The Jumahi.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 147
  },
  {
    "serial_number": "3336269",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 191,
    "volume_number": 1,
    "text": "130 - I said: So Hanzalah Al-Sadusi? He said: He has Munkar (denounced) things. He narrated two hadiths, both of which are Munkar from the Prophet (peace be upon him) via Anas: that the Prophet (peace be upon him) performed Qunut in Witr, and the other: 'He commanded us that when we meet, one should shake hands with his companion, and that we should bow to one another, and embrace one another.' Both are Munkar. 131 - I said: Yusuf Al-Majishun? He said to me: There is no harm in him, and we caught up with him. I said: You narrated from him, and he narrates from his father? He said: Yes. I said: What about his father? He said: There is no harm in him.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 148
  },
  {
    "serial_number": "3336270",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 192,
    "volume_number": 1,
    "text": "132 - He mentioned Abd al-Aziz and said: He is the cousin of Yusuf. He mentioned good about him too. My greatest knowledge and understanding is that he mentioned a brother of Yusuf called Abd Allah, and he mentioned good about him as well. 133 - Al-Maimuni told us, he said: And he said—meaning Ahmad bin Hanbal—and he said to me: Yusuf lived a long life, so I met him with a Juz' (a small volume). 134 - Al-Maimuni told us, he said: Abu Abd Allah said to me: Uthman bin Hakim is a Sheikh. I said: His hadiths? He said: They are close (Muqaribah). 135 - Al-Maimuni told us, he said: He mentioned things from Mujalid, from Al-Sha'bi. He said: How many wonders [oddities] Mujalid has! 136 - Al-Maimuni told us, he said: We discussed something they differed on one day...",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 149
  },
  {
    "serial_number": "3336271",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 193,
    "volume_number": 1,
    "text": "...So a man said: Ibn Abi Shaybah says, from Affan. Abu Abd Allah said: Leave Ibn Abi Shaybah out of this; look at what others say. Abu Abd Allah meant his frequent mistakes. 137 - Al-Maimuni told us, he said: I said: Ismail bin Zakariyya, how is he? He said to me: As for the famous hadiths he narrates, he is close (Muqarib) in them, his Hadith is Salih (good), but the heart is not open to him; he is not known like this in the era of seeking [knowledge]. 138 - I said to Abu Abd Allah: Al-Rabi' bin Sabih? He said: He does not have much that strengthens him. He has things he narrates from Ata' and Al-Hasan, [regarding] issues, and there is no harm in him. I said: A thing he narrates from Yazid? He said to me: He narrates it from Yazid from Anas regarding Raising [hands/voice or elevating hadith]? I said: Yes. Abu Abd Allah smiled at me. I said: Do you remember it? Which one is it? Is it Yazid Al-Raqashi? He said to me: Yes. I said: And this Yazid is weak? He said: Yes, he is weak.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 150
  },
  {
    "serial_number": "3336272",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 194,
    "volume_number": 1,
    "text": "139 - Abu Abd Allah mentioned the hadith of Rawh from Ibn Abi Humaid. He said: If only it were someone other than Ibn Abi Humaid. 140 - Al-Maimuni told us, he said: I heard Abu Al-Walid Hisham bin Abd Al-Malik say: Malik bin Anas had a bad opinion of Ibn Ishaq. 141 - Al-Maimuni told us, he said: Abu Abd Allah said: Ibn Jurayj was one of the vessels of knowledge.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 151
  },
  {
    "serial_number": "3336273",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 195,
    "volume_number": 1,
    "text": "142 - Abu Abd Allah said, and he mentioned Shu'aib Al-Jubba'i: A man who read books and resembled Wahb. 143 - Abu Abd Allah said: Rishdin, there is no harm in him regarding hadiths of Raqa'iq (heart-softeners). 144 - He said: Ahmad bin Hanbal said: Ziyad bin Jubair bin Hayyah is a known man. 145 - He said: I do not know anyone who narrated from Abu Isa Al-Aswari other than Qatadah.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 152
  },
  {
    "serial_number": "3336274",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 196,
    "volume_number": 1,
    "text": "146 - He said: And the statement of Ibn Hanbal: We do not find anyone who raises [marfu' attribution] other than Zuhair, meaning regarding the Muhrim (pilgrim) if he does not find sandals. Zuhair was one of the mines of knowledge. 147 - Al-Maimuni told us, he said: Abu Abd Allah said to me regarding Yahya bin Sa'id in the hadith of Shu'bah: It is nothing. From Mujahid, he said: I heard Aisha. He denied that he heard from Aisha.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 153
  },
  {
    "serial_number": "3336275",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 197,
    "volume_number": 1,
    "text": "148 - He said: Abu Abd Allah said: Ibn Abi Arubah did not hear from Yahya bin Sa'id, nor did Ma'mar hear anything from Yahya. Abu Abd Allah said that. 149 - I heard him say: Bilal bin Sa'd is a righteous man. 150 - He said: And I heard Abu Abd Allah say: Muhammad bin Abd al-Rahman bin Ghunj is a Sheikh, close (Muqarib) in Hadith; Al-Layth narrates from him. 151 - He said: And Abu Abd Allah mentioned Al-Sari bin Ismail, so he said: People abandoned his Hadith. 152 - And Al-Mas'udi: whoever heard from him at the end, then their hearing from him is criticized.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 154
  },
  {
    "serial_number": "3336276",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 198,
    "volume_number": 1,
    "text": "153 - A man asked him about Al-Hajjaj bin Artah: What is his status? He said: His status is that he adds to the hadiths. Al-Maimuni told us, he said: I heard Abu Abd Allah say: Perhaps I saw Al-Hajjaj placing his hand on his head saying: The love of honor has killed me. 154 - Al-Maimuni told us, he said: He said: Ibn Abi Laila was mentioned to Abu Abd Allah. He said: Weak. And Al-Hajjaj is greater in my soul [estimation] than him, except that he—meaning Ibn Abi Laila—in his hadith from Al-Minhal, it is as if he... 155 - A man said to him: Where does Mujalid stand compared to them? He said: This one raises much dust [is very turbulent].",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 155
  },
  {
    "serial_number": "3336277",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 199,
    "volume_number": 1,
    "text": "156 - Abu Abd Allah said: So I wondered at him in that situation, how he used to answer him in such matters. Then he said to us: But he was a man who looked much into the narrators (Rijal) and speech (Kalam). Abu Abd Allah only mentioned Ibn Al-Mubarak in this story because he disliked answering them, but they informed him of the reward he would have in knowing this, so Ibn Al-Mubarak was mentioned at that time. 157 - Al-Maimuni told us, he said: Sa'id bin Bashir, I saw him weakening his status. I said: The one who narrates from Qatadah? He said: He narrated things from Qatadah. 158 - Muhammad bin Salamah Al-Harrani. He said: He is [strong] in his body, and I think he said: There is no harm in his Hadith. 159 - Al-Maimuni told us, he said: I heard him say: Ibn Abi Najih is Trustworthy (Thiqah), and his father was among the best of Allah's worshippers.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 156
  },
  {
    "serial_number": "3336278",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 200,
    "volume_number": 1,
    "text": "160 - Kathir bin Jamhan. He said: I do not know Kathir. 161 - Al-Maimuni told us, he said: I heard him say: Nothing is authentic for Hushaim from Al-Zuhri except four hadiths. 162 - And Ali bin Salih is Salih (good) in Hadith, but Al-Hasan bin Salih is his brother. 163 - Al-Maimuni told us, Ahmad told us, he said: Waki' told us, he said: Sa'id bin Al-Sa'ib is Hasan (good) in Hadith.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 157
  },
  {
    "serial_number": "3336279",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 201,
    "volume_number": 1,
    "text": "164 - Al-Maimuni told us, he said: I heard him say: Ibn Abi Labid is Established (Thabt) in Hadith. 165 - And Rabi'ah bin Abi Abd al-Rahman is Trustworthy (Thiqah). 166 - He said: I heard him say regarding Ghassan bin Mudar: How difficult [strict] of a Sheikh he was! 167 - Al-Maimuni told us, he said: He said: We have not seen anyone more established in [narrating from] Ata' than Amr and Ibn Jurayj.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 158
  },
  {
    "serial_number": "3336280",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 202,
    "volume_number": 1,
    "text": "168 - He said: Ibn Hanbal told us, he said: Yahya told us, Muthanna told us, he said: Qatadah told us. Muthanna is Trustworthy (Thiqah). 169 - Al-Maimuni told us, he said: I heard him say: Abu Al-Zinad is among the Companions of Hadith. 170 - And Ibn Ajlan is Trustworthy (Thiqah). 171 - And his father is Salih (good) in Hadith; he met Abu Hurairah. 172 - I heard him say: Umarah bin Al-Qa'qa' is Trustworthy (Thiqah).",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 159
  },
  {
    "serial_number": "3336281",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "From the speech of Ahmad bin Hanbal regarding the defects of Hadith and knowledge of men",
    "edition": "First, 1409",
    "publisher": "Al-Ma'arif Library - Riyadh",
    "page_number": 203,
    "volume_number": 1,
    "text": "173 - And Ishaq bin Suwaid is Established (Thabt). 174 - Al-Maimuni told us, he said: I heard him say, mentioning the Levantines (Shamiyyin): Sadaqah bin Khalid is Trustworthy (Thiqah), Trusted (Ma'mun). It has not reached me that any of the Levantines writes his hadith with his own hand other than him; that is evident in his Hadith. 175 - And he mentioned Sadaqah Al-Samin, so he said: Weak. 176 - We discussed Salih bin Kaysan. I said to him: How is he? He said: Salih (Good/Righteous). 177 - I heard him say: Amr bin Ubaid was not worthy that one narrates from him. [Ended] to here from Al-Maimuni.",
    "foot_note": "None",
    "book_id": "6044",
    "new_page_number": 160
  }
]