[
  {
    "text": "Terrorism against the Protected Ones and Islam's Stance on it\nAuthor: بدر بن ناصر البدر\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8276\nbook_title: إرهاب المستأمنين وموقف الإسلام منه\nbook_link: https://shamela.ws/book/1170\nbook_id: 1170\nauthor_name: بدر بن ناصر البدر\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/307\nauthor_ID: 307\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 56\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7480660",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: Terrorism against the Protected Ones and Islam's Stance on it. Author: Badr bin Nasser Al-Badr. Publisher: The book is published on the Saudi Ministry of Endowments website without specific data. Number of pages (Printed Book): 36 [The book is automatically numbered, not matching the printed version]. Number of Pages: 56. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Terrorism against the Protected Ones and Islam's Stance on it. Author: Badr bin Nasser Al-Badr. Publisher: The book is published on the Saudi Ministry of Endowments website without specific data. Number of pages (Printed Book): 36 [The book is automatically numbered, not matching the printed version]. Number of Pages: 56. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Badr bin Nasser Al-Badr. Publisher: The book is published on the Saudi Ministry of Endowments website without specific data. Number of pages (Printed Book): 36 [The book is automatically numbered, not matching the printed version]. Number of Pages: 56. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages (Printed Book): 36 [The book is automatically numbered, not matching the printed version]. Number of Pages: 56. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered, not matching the printed version]. Number of Pages: 56. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 3
  },
  {
    "serial_number": "7480661",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Terrorism of the Protected and Islam’s Stance on It",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without publication details",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Terrorism of the Protected and Islam’s Stance on It\nPrepared by Dr. Badr bin Nasser Al-Badr, Associate Professor, Department of Qur’an and Its Sciences, College of Usul al-Din, Imam University\n\nIn the Name of Allah, the Most Gracious, the Most Merciful\n\nIntroduction: All praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge with Allah from the evils of our souls and the bad deeds of our actions. Whomever Allah guides, none can misguide, and whomever He leaves astray, none can guide. I bear witness that there is no deity except Allah alone with no partner, and I bear witness that Muhammad is His servant and Messenger. {O you who have believed, fear Allah as He should be feared and do not die except as Muslims.} [Al-Imran: 102]  {O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed, Allah is ever, over you, an Observer.} [An-Nisa: 1]  {O you who have believed, fear Allah and speak words of appropriate justice. He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment.} [Al-Ahzab: 70-71]  To proceed:",
    "foot_note": "1. Surah Al-Imran, verse 102.\n2. Surah An-Nisa, verse 1.\n3. Surah Al-Ahzab, verses 70-71.",
    "book_id": "1170",
    "new_page_number": 4
  },
  {
    "serial_number": "7480662",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "The religion of Islam came realizing great objectives that every Muslim man and woman must learn, which are the preservation of the Five Necessities, which scholars call the Objectives (Maqasid) of Sharia: the preservation of Religion, Life, Intellect, Honor, and Wealth. Knowledgeable scholars have consistently built rulings and issues connected to these great objectives. However, when knowledge disappeared, and desire and ignorance spread, and doubts multiplied, tribulations (Fitnah), chaos, and killing appeared without regard for these objectives. For this reason, every act of sabotage targeting safe people is contrary to the rulings of the Sharia of the Lord of the Worlds, which came to protect the blood of Muslims and Covenanted people (Mu'ahadin). How much more so if this occurs in a safe Muslim land, the landing place of Revelation, the Message, and the Light that radiates to all corners of the earth!! There is no doubt that this is more strictly prohibited by the consensus of knowledgeable Muslim scholars, in addition to the violation of the sanctity of protected lives and wealth, the violation of the sanctity of those secure in their homes, and the spreading of chaos and instability.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 5
  },
  {
    "serial_number": "7480663",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "He errs who believes or thinks that Muslims do not accept the entry of disbelievers into their lands unless they desire Islam. Likewise, he errs who accuses Muslims of carrying their swords in their hands to unsheathe them against anyone who does not profess their religion, making non-Muslims feel unsafe for themselves and untrusting of stepping foot in their lands. However, the truth contradicts this belief. Neighborly protection (Jiwar) among the Arabs before Islam was of great importance; blood would be shed to protect and preserve the one seeking refuge, and they used to take pride in this and cherish his protection. Then, when Islam came, it affirmed this and sponsored it under its covenant (Dhimmah) and the covenant of the Muslims. It granted security to messengers and covenanted people, whether by a perpetual or temporary treaty. It also granted security to those entering Muslim lands for a benefit, whether for trade, seeking reconciliation and truce, carrying messages or Jizyah payments, or to hear the Quran, learn about the principles of Islam, learn its rulings, and understand its goals and objectives. Thus, he enters safe and reassured and returns likewise to his country.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 6
  },
  {
    "serial_number": "7480664",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "This is what I wished to write about, God Almighty willing, through this international conference on Islam's stance on terrorism, violence, and extremism, supervised by Imam Muhammad bin Saud Islamic University, which is a forerunner to all good, with appreciated efforts and blessed works. The title of the research is (Terrorism against the Protected Ones and Islam's Stance on it), according to the following plan:\n- Introduction.\n- Chapter One: Definition of Terrorism and its Prohibition in Islam.\n- Chapter Two: Definition of Security (Aman), its Pillars, and Formulas.\n- Chapter Three: Evidence for the Legitimacy of Security from the Quran and Sunnah.\n- Chapter Four: The Difference between Security (Aman), Dhimmah (Protection/Citizenship), and Truce (Hudnah).\n- Chapter Five: The Duty of Muslims towards the Protected Ones (Musta'manin).\n- Chapter Six: The Duty of the Protected Ones in Muslim Lands.\n- Conclusion.\n- List of Sources and References.\nI have adhered to the following in writing it:\n- I attributed verses to their Surahs, mentioning the Surah name and verse number.\n- I referenced the Hadiths, sufficing with the two Sahihs or one of them if the Hadith is in them; if not, I referenced it briefly from others.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 7
  },
  {
    "serial_number": "7480665",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "- I did not provide biographies for the notable figures mentioned in the research, fearing prolongation and so as not to exceed the limits set for writing research papers in this conference.\n- I attributed sayings to their authors and documented them from their authors' books; if I could not, I documented them from other sources and references.\n- I listed the details of sources and references in a separate list at the end of the research.\nIn any case, I do not claim comprehensiveness in my writing on this subject nor complete coverage of the research, due to the deficiency, shortcoming, and error that afflicts me, and also due to the complexity and breadth of the subject.\nI ask Him, Blessed and Exalted, to grant us understanding of the religion, to bless us with following the Sunnah of the Master of the first and the last, and to keep us away from tribulations, both apparent and hidden. I also ask Him - the Exalted - to reward those in charge of our university, specifically His Excellency the Director and the Vice-Directors, with the best reward, and to grant us all sincerity and success in speech and action.\nMay Allah's peace and blessings be upon our Prophet Muhammad, his family, and his companions.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 8
  },
  {
    "serial_number": "7480666",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "Chapter One: Definition of Terrorism and its Prohibition in Islam\nIbn Manzur said: (Rahiba - with kasrah - yarhabu rahbatan wa ruhban - with damma - wa rahaban - with movement [fatha], meaning: he feared. And rahiba al-shay' [he feared the thing] rahban wa rahaban wa rahbatan means he feared it... And tarahhaba ghayrahu [he terrorized another] means he threatened him... And arhabahu wa rahhabaahu wa istarhabahu means he frightened him and terrified him) (1).",
    "foot_note": "1. (1) Lisan al-Arab (Rahaba) 1 / 436.",
    "book_id": "1170",
    "new_page_number": 9
  },
  {
    "serial_number": "7480667",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "In these times specifically, the opinions of people, groups, and individuals have differed in defining what is meant by terrorism from a correct, moderate perspective. Appreciated efforts have been made in this regard by people of knowledge and fairness to clarify the meaning of this term. Perhaps the most accurate, complete, and comprehensive definition is what came in the decision of the Islamic Fiqh Council in its 16th session held in the period: 21-27 Shawwal 1422 AH, where the attendees defined terrorism - from a Sharia perspective - as: \"Aggression practiced by individuals, groups, or states, transgressing against the human being in his religion, blood, intellect, wealth, and honor. It includes forms of intimidation, harm, threat, and killing without right, and what relates to forms of Hirabah (banditry/waging war against society), intimidating travelers, and highway robbery. And every act of violence or threat carried out to execute an individual or collective criminal enterprise, aiming to cast terror among people or terrify them by harming them or exposing their lives, freedom, security, or conditions to danger. Among its forms is causing damage to the environment or to one of the public or private facilities or properties, or exposing one of the national or natural resources to danger. All of this is among the forms of corruption in the land which Allah, Glory be to Him and the Exalted, forbade Muslims from, by His saying: {And do not desire corruption in",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 10
  },
  {
    "serial_number": "7480668",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "the land. Indeed, Allah does not like corrupters} (Al-Qasas: 77)\".",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 11
  },
  {
    "serial_number": "7480669",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism Against the Trustful and Islam’s Stance on It",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without publication details",
    "page_number": 9,
    "volume_number": 1,
    "text": "Terrorism is one of the gravest crimes in the view of Islamic law. Banditry and unjust aggression are among the crimes specifically mentioned in Sharia, and terrorism in some of its practical forms falls under these definitions. Allah has prescribed severe punishment for those who commit this crime and follow its path. Therefore, it is no less than necessary that a terrorist should be punished, according to Sharia principles, with the penalty prescribed for combatants, because their action, regardless of its form, is considered corruption on earth. This falls under the meaning of the verse: {And they strive upon the earth [to cause] corruption.} Indeed, Allah prescribes for those who wage war against Him and His Messenger and strive upon the earth [to cause] corruption that they be killed, crucified, have their hands and feet cut off on opposite sides, or be exiled from the land. That is for them a disgrace in this world, and for them in the Hereafter is a great punishment, except for those who repent before you overpower them; so know that Allah is Forgiving and Merciful. [Al-Ma'idah: 33-34] This verse clearly determines the legal punishment for those who wage war and seek corruption on earth, both in this world and the Hereafter.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 12
  },
  {
    "serial_number": "7480670",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "Abu Thawr and the Proponents of Opinion (Ashab al-Ra'y): This verse was revealed regarding those among the Muslims who go out to cut off the highway and strive to cause corruption in the land. By this, they mean that this verse is not specific to apostates or Jews, as some scholars among the exegetes and others believe. Rather, it generally encompasses everyone who commits the crimes of Hirabah (banditry/waging war against society), whether they are Muslims or others; thus, they are judged according to its ruling.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 13
  },
  {
    "serial_number": "7480671",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "Attention must be drawn to two important matters. First: Hirabah is a crime that impacts public security, as it involves instilling terror and fear in souls in an indefinite manner. Taking care of public security is one of the public interests whose preservation and care are entrusted to the rulers of the Muslims. Jurists express public interests as 'Rights of Allah', derived from verses like His saying: {Indeed, the penalty for those who wage war against Allah and His Messenger...} the verse. Thus, He made the crime against public security a war against Allah and His Messenger. Therefore, confronting terrorism, Hirabah, and similar acts is among the duties binding upon the rulers, and the general body of Muslims must support them in achieving this duty. Al-Qurtubi, may Allah have mercy on him, said: \"If the bandits (Muharibun) frighten the travelers and cut off the road, it becomes obligatory for the Imam to fight them... and it is obligatory for the Muslims to cooperate in fighting them and restraining them from harming Muslims.\" He then mentioned after that: \"And the consensus of the scholars is that if a bandit kills a man's brother or father while engaged in banditry, the seeker of blood vengeance (the kin) has no say in the matter of the bandit, and the pardon of the guardian of the blood is not valid. The one responsible for this is the Imam; they established this as one of the Hudud (fixed punishments) of Allah the Almighty\" (1). Second: The practical application of this Hadd contributes...",
    "foot_note": "1. (1) Al-Jami' li-Ahkam al-Quran 6 / 155 - 156.",
    "book_id": "1170",
    "new_page_number": 14
  },
  {
    "serial_number": "7480672",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "...without a doubt significantly to achieving security for people. Conversely, neglecting and wasting it, like all other Sharia limits, reflects negatively on security and stability and opens the way for the aggravation of crime in society. Some enemies of Islam may falsely claim that this religion conceals within its teachings things that urge the adoption of a methodology of violence for change, and that it incites its followers to practice terrorist methods to suppress their enemies and subjugate them to its authority, spreading its call in this manner. They usually cite as evidence for this claim some verses and Hadiths that order Muslims to perform Jihad in the path of Allah. They insist on portraying the reality of Islam through this lens, especially via Western media outlets, and through news, opinion, and analysis. This is contrary to the truth of the religion of Islam. How could it be otherwise, when Allah, Glory be to Him and the Exalted, limited the message of His final Prophet Muhammad, peace and blessings be upon him, to being a mercy to the worlds? He said in His Mighty Book: {And We have not sent you, [O Muhammad], except as a mercy to the worlds} (Al-Anbiya - 107).",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 15
  },
  {
    "serial_number": "7480673",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "Whoever contemplates the stance of the Prophet, peace and blessings be upon him, with his people following his return from Ta'if, or his stance during the Treaty of Hudaybiyyah, will see therein proofs of the Prophet's keenness, peace and blessings be upon him, to deliver guidance to people and his preference for peaceful, secure atmospheres to spread the Call (Da'wah) among them.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 16
  },
  {
    "serial_number": "7480674",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "Chapter Two: Definition of Security (Aman), its Pillars, and Formulas.\nIbn Manzur said: \"Ista'mana ilayhi: He entered into his security (Aman). And ammanahu (he granted him security) and amanahu. Al-Ma'man: The place of safety. Al-Amin: The one seeking protection to be safe for himself\" (1). Al-Jawhari said: \"Al-Aman and Al-Amanah are synonymous. And amantu ghayri (I granted security to another) comes from amn and aman\" (2).\nAman relies on two fundamental pillars: The Grantor (Mu'min) and the Seeker (Musta'man). The Musta'man is the one who requests security for himself to enter Muslim lands for a known period. The Grantor (Mu'min) is the one who gives security. The basis for this is that it is the Imam or his deputy, because he looks into what serves the interest of the Muslims. It is also permissible for the Grantor to be an individual subject from among the competent Muslims, whether male or female; the free and the slave are equal in this regard. This is the view of the majority of scholars. Abu Hanifa disagreed regarding the security granted by a slave, holding that it is not valid unless he is authorized to fight.\nAs for the formulas of Aman, they are not restricted to a specific wording, nor does it have a special term. Rather, any utterance that conveys the intended meaning suffices, whether explicit, such as \"I grant you protection,\" \"I secure you,\" \"No harm shall come to you,\" \"No panic,\" or \"No fear\" and the like; or metaphorically with intention, such as saying: \"Be as you wish,\" or \"You are as you like.\" It is also valid via writing, correspondence, and the like (3).",
    "foot_note": "1. (1) Lisan al-Arab 13 / 22. \n2. Al-Sahah 5 / 2071. \n3. See for the above: Hashiyat Ibn Abidin 3 / 247, 226-227.",
    "book_id": "1170",
    "new_page_number": 17
  },
  {
    "serial_number": "7480675",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "Ibn Qudamah said: \"If a Harbi (person from a land at war) enters the Abode of Islam without [explicit] security (Aman) and claims he is a messenger, it is accepted from him, and it is not permissible to interfere with him; because of the saying of the Prophet, peace and blessings be upon him, to the two messengers of Musaylimah: 'Were it not that messengers are not killed, I would have killed you both.' And because custom dictates this. If he claims he is a merchant, and the custom has been established that their merchants enter among us, he is not interfered with if he has something to sell; because they entered believing they had security, resembling the case if they entered upon the signal of a Muslim. Ahmad said: 'If people travel by sea and are met by polytheist merchants from the enemy land wanting to go to the lands of Islam, they should not interfere with them nor fight them. And anyone who enters the lands of Muslims from the land of war for trade is traded with and is not asked about anything'\" (1).",
    "foot_note": "1. (1) Al-Sharh Al-Kabir 10 / 358, and the Hadith was narrated by Abu Dawood in his Sunan 2 / 76 and Ahmad in his Musnad 1 / 391.",
    "book_id": "1170",
    "new_page_number": 18
  },
  {
    "serial_number": "7480676",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "Chapter Three: Evidence for the Legitimacy of Security (Aman) from the Quran and Sunnah.\nThe basis for Aman is His saying, the Exalted: {And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know} (1).\nIbn Jarir al-Tabari said: \"The Exalted mentions to His Prophet: And if one of the polytheists - whom I commanded you to fight and kill after the passing of the sacred months - seeks your security, O Muhammad, in order to hear the words of Allah from you, which is the Quran that Allah revealed to him; [THEN GRANT HIM PROTECTION] He says: Then secure him {SO THAT HE MAY HEAR THE WORDS OF ALLAH} and you recite it to him. {THEN DELIVER HIM TO HIS PLACE OF SAFETY} He says: Then return him, after he has heard the words of Allah, if he refuses to become Muslim and is not admonished by what you recited to him of Allah's words, so that he is secure in: [HIS PLACE OF SAFETY] He says: To where he is safe from you and from those in your obedience, until he rejoins his abode and his people among the polytheists\" (2).\nIbn Kathir said: \"The Exalted says to His Prophet, peace and blessings be upon him: {AND IF ANY ONE OF THE POLYTHEISTS} whom I commanded you to fight and made lawful for you their lives and wealth [SEEKS YOUR PROTECTION] meaning: seeks security from you, then answer his request until he hears the words of Allah, meaning: the Quran, you read it to him and mention to him",
    "foot_note": "1. (1) Surah At-Tawbah, Verse 6. \n2. Jami' al-Bayan 11 / 346.",
    "book_id": "1170",
    "new_page_number": 19
  },
  {
    "serial_number": "7480677",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "something of the matter of religion by which you establish Allah's proof upon him: {THEN DELIVER HIM TO HIS PLACE OF SAFETY} meaning: and he remains safe, with continuous security, until he returns to his country, his home, and his place of safety. {THAT IS BECAUSE THEY ARE A PEOPLE WHO DO NOT KNOW} meaning: We only legislated security for such people so that they may know the religion of Allah and so that Allah's call may spread among His servants\" (1).",
    "foot_note": "1. (1) Tafsir al-Quran al-Azim 2 / 337.",
    "book_id": "1170",
    "new_page_number": 20
  },
  {
    "serial_number": "7480678",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "The evidence for it from the Sunnah is what Ali, may Allah be pleased with him, narrated that the Prophet, peace and blessings be upon him, said: \"The covenant of protection (Dhimmah) of the Muslims is one; the lowest of them can strive with it (i.e., grant it). So whoever betrays a Muslim (by violating his pledge), upon him is the curse of Allah, the angels, and all people; no obligatory nor voluntary deed will be accepted from him.\" Narrated by Al-Bukhari and Muslim (1).\nThey also narrated on the authority of Umm Hani, may Allah be pleased with her, that she said: \"O Messenger of Allah, I have granted protection to my in-laws and locked them in, but the son of my mother wanted to kill them.\" The Messenger of Allah, peace and blessings be upon him, said to her: \"We grant protection to whom you have granted protection, O Umm Hani. Indeed, the lowest of Muslims can grant protection on their behalf\" (2).\nAnd Zaynab, the daughter of the Messenger of Allah, peace and blessings be upon him and may Allah be pleased with her, granted protection to Abu al-Aas bin al-Rabia, and he (the Prophet), peace and blessings be upon him, ratified it for her (3).\nAnd on the authority of Amr bin Shu'aib, from his father, from his grandfather, from the Prophet, peace and blessings be upon him, that he said: \"The hand of the Muslims is [one] over those other than them; their blood is equal [in value]; the lowest of them grants protection on their behalf; the furthest of them returns [spoils] to them; and they are a single hand against those other than them\" (4).",
    "foot_note": "1. (1) Narrated by Al-Bukhari - Book of the Virtues of Medina - Chapter on the Sanctity of Medina 3 / 46, and Muslim - Book of Hajj - Chapter on the Virtue of Medina 2 / 999. \n2. Narrated by Al-Bukhari - Book of Prayer - Chapter on Praying in a Single Garment Wrapped Around 1 / 100, and Muslim - Book of the Prayer of Travelers and its Shortening - Chapter on the Desirability of Duha Prayer 1 / 498. \n3. Narrated by Abd al-Razzaq in Al-Musannaf - Book of Jihad - Chapter on Neighborhood (protection) 5 / 224-225, and Al-Bayhaqi in Al-Sunan Al-Kubra - Book of Biographies (Siyar) - Chapter on the Protection Granted by a Woman 9 / 95. \n4. Narrated by Ahmad in Al-Musnad 2 / 180, and Ibn Khuzaimah in his Sahih 4 / 26.",
    "book_id": "1170",
    "new_page_number": 21
  },
  {
    "serial_number": "7480679",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "Chapter Four: The Difference between Security (Aman), Dhimmah, and Truce (Hudnah).\nIbn al-Qayyim - may Allah Almighty have mercy on him - has valuable words on the difference between these three terms and the rulings entailed by them, where he says: \"The disbelievers are either people of war (Ahl Harb) or people of covenant (Ahl 'Ahd). The people of covenant are of three categories: People of Dhimmah (Protection/Citizenship), People of Hudnah (Truce), and People of Aman (Security). Jurists have dedicated a chapter for each category, saying: Chapter of Truce, Chapter of Security, Chapter of the Contract of Dhimmah. The terms 'Dhimmah' and 'Ahd' (Covenant) originally encompass all of them. Likewise, the term 'Sulh' (Peace/Reconciliation), for Dhimmah is of the same genus as the terms 'Ahd' and 'Aqd' (Contract). Their saying: 'This is in the Dhimmah of so-and-so' originates from this, meaning: in his covenant and contract, i.e., he bound him by the contract and pact. Then it came to be used for everything from which a right can be taken, whether obligated by his contract or without his contract. Similarly, the term 'Sulh' is general for every reconciliation, covering the reconciliation of Muslims with each other and their reconciliation with disbelievers. However, in the terminology of many jurists, 'Ahl al-Dhimmah' became an expression for those who pay Jizyah. These have a perpetual covenant (Dhimmah). They have made a covenant with the Muslims that the ruling of Allah and His Messenger shall apply to them, as they reside in the Abode (Dar) where the ruling of Allah and His Messenger applies. This is unlike the People of Truce (Ahl al-Hudnah), for they have reconciled with the Muslims to remain in their own abode (Dar), whether the reconciliation is for money or without money;",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 22
  },
  {
    "serial_number": "7480680",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "the rulings of Islam do not apply to them as they apply to the People of Dhimmah, but they must refrain from fighting the Muslims. These are called People of Covenant (Ahl al-'Ahd), People of Reconciliation (Ahl al-Sulh), and People of Truce (Ahl al-Hudnah). As for the Musta'man (one granted security), he is the one who comes to the lands of the Muslims without settling there. These are of four types: messengers, merchants, and seekers of asylum so that Islam and the Quran may be presented to them; if they wish, they enter into it, and if they wish, they return to their lands; and [fourthly] those seeking a need such as a visit or otherwise. The ruling for these is that they are not forced to emigrate, they are not killed, Jizyah is not taken from them, and Islam and the Quran are presented to the asylum seeker among them. If he enters into it, then so be it; if he prefers to rejoin his place of safety, he is escorted to it and is not interfered with before reaching it. Once he reaches his place of safety, he returns to being a Harbi (at war) as he was\" (1).",
    "foot_note": "1. (1) Ahkam Ahl al-Dhimmah 2 / 873.",
    "book_id": "1170",
    "new_page_number": 23
  },
  {
    "serial_number": "7480681",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "In his statement - may Allah have mercy on him - there are several benefits, including: Mentioning the rights of the People of Dhimmah, the People of Truce, and the Musta'manin (Protected Ones). All of them are in a state of covenant. Also: The obligation to fulfill pledges to them as long as they fulfill them. Also: The permissibility of the entry of merchants, messengers, workers, artisans, and manufacturers, and the like. Also: That the rulings of Sharia apply to the Covenanted Ones if they reside in the Abode where the ruling of Allah and His Messenger applies. Also: That the rulings of Islam do not apply to the People of Truce if they reside in their own lands. Also: The permissibility of granting the People of Covenant permission for a visit or a need that benefits the Muslims. Muslims may need others for industry, trade, and the like, such as the sciences necessary to strengthen power and defense, or in matters of agriculture or economy. Thus, there is no harm in the entry of non-Muslims into the Abode of Islam for these purposes under a contract and covenant.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 24
  },
  {
    "serial_number": "7480682",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "Sheikh al-Islam said: \"For this reason, a group of scholars, such as Muhammad bin Jarir al-Tabari, held that disbelievers should not be settled in Muslim lands via Jizyah unless the Muslims have a need for them. If they can do without them, they should be expelled like the people of Khaybar. There is a dispute in this issue which is not appropriate to discuss here. The intended point here is that if people need millers and bakers, this is of two types: First: That they need their craftsmanship, like those who grind and bake for households; these deserve wages, and when needed, they can only demand the standard wage (Ajr al-Mithl) like other artisans. Second: That they need the production and sale, needing someone to buy wheat, grind it, bake it, and sell it as bread for people's needs...\" (1). Sheikh Muhammad bin Uthaymeen said: \"I agree that we do not have 'Ahl al-Dhimmah' [in the classical sense], because Ahl al-Dhimmah are those who submit to the rulings of Islam and pay the Jizyah, and this has been missing for a long time. However, we have Covenanted Ones (Mu'ahidun) and Protected Ones (Musta'manun), and those with general covenants and special covenants. So whoever comes to our country from among the disbelievers for work or trade and has been permitted to do so, is either a Mu'ahid or a Musta'man; it is not permissible to attack him. It has been proven from the Prophet, peace and blessings be upon him, that he said: 'Whoever kills a Mu'ahid (covenanted person) shall not smell the fragrance of Paradise",
    "foot_note": "1. (1) Majmu' al-Fatawa 28 / 89.",
    "book_id": "1170",
    "new_page_number": 25
  },
  {
    "serial_number": "7480683",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "...' Thus, we are Muslims, submissive to the command of Allah Almighty, respecting what Islam requires us to respect regarding the people of Covenant and Security. Whoever violates this has offended Islam and presented it to people in the appearance of terrorism, treachery, and betrayal. And whoever adheres to the rulings of Islam and respects covenants and pacts, he is the one whose goodness and success are hoped for.\" These people and those like them are Musta'manin (protected ones); it is not permissible to fight them, interfere with them, or harm them, as will be explained, God Almighty willing.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 26
  },
  {
    "serial_number": "7480684",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "Chapter Five: The Duty of Muslims towards the Protected Ones (Musta'manin)\nIslam, in its noble Sharia, established rights obligatory for the Musta'manin that must be fulfilled and performed towards them. It guided Muslims on how to deal with them, just as it imposed duties upon them towards the Muslims who granted them security in their lands.\nAmong those rights obligatory upon Muslims towards them:\n1 - Acting justly with them and not transgressing against them in their lives, wealth, or honor. Indeed, it is not permissible to terrify or frighten them; rather, they should be treated with justice and equity. The Exalted said: {O you who have believed, be steadfast maintainers for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness. And fear Allah; indeed, Allah is Acquainted with what you do} (1).",
    "foot_note": "1. (1) Surah Al-Ma'idah, Verse 8.",
    "book_id": "1170",
    "new_page_number": 27
  },
  {
    "serial_number": "7480685",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "Al-Baydawi said: \"Let not your intense hatred for the polytheists drive you to abandon justice towards them, such that you transgress against them by committing what is not lawful, like slandering, killing women and children, and breaking covenants, to satisfy what is in your hearts. {BE JUST; THAT IS NEARER TO RIGHTEOUSNESS} Meaning: Justice is closer to piety. He explicitly commanded them to be just and explained that it is a station of piety, after He forbade them from injustice and explained that it is a requirement of desire (hawa). If this is the justice due to disbelievers, then what do you think of justice with believers?\" (1). Ibn Kathir said: \"And of this nature is the saying of Abdullah bin Rawaha, may Allah be pleased with him, 'When the Prophet, peace and blessings be upon him, sent him to estimate the date harvest (kharasa) of the people of Khaybar regarding their fruits and crops. They wanted to bribe him so he would be lenient with them. He said: By Allah, I have come to you from the most beloved of creation to me, and you are more hated to me than your numbers of apes and swine. Yet, my love for him and my hatred for you will not drive me to not deal justly with you. They said: By this [justice], the heavens and the earth stand'\" (2).",
    "foot_note": "1. (1) Tafsir Al-Baydawi 3 / 222. \n2. Tafsir al-Quran al-Azim 1 / 565, and the Hadith was narrated by Ahmad in his Musnad 2.",
    "book_id": "1170",
    "new_page_number": 28
  },
  {
    "serial_number": "7480686",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "And on the authority of Safwan bin Sulaym, from a number of the sons of the Companions of the Messenger of Allah, peace and blessings be upon him, from their fathers, from the Messenger of Allah, peace and blessings be upon him, who said: \"Beware, whoever wrongs a Mu'ahid (covenanted person), diminishes his right, burdens him beyond his capacity, or takes something from him without his good pleasure, then I am his adversary (pleader against him) on the Day of Resurrection\" (1). And on the authority of Abdullah bin Amr, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever kills a Mu'ahid shall not smell the fragrance of Paradise, though its fragrance can be found from a distance of forty years [travel].\" Narrated by Al-Bukhari (2).",
    "foot_note": "1. (1) Narrated by Al-Bayhaqi in his Sunan 5 / 205. \n2. Narrated by Al-Bukhari - Book of Jizyah and Materials - Chapter on the Sin of One Who Kills a Mu'ahid Without Cause 6 / 269.",
    "book_id": "1170",
    "new_page_number": 29
  },
  {
    "serial_number": "7480687",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "The forms of applying these teachings and rulings in Muslim history are numerous and varied. Umar, may Allah be pleased with him, used to ask those coming to him from the provinces about the condition of the People of Dhimmah and the Mu'ahadin (Covenanted ones), fearing that a Muslim might have caused them harm. They would say to him: \"We know only of fulfillment (Wafa'),\" meaning: fulfillment of the requirements of the contract and covenant between them and the Muslims (1). A Dhimmi from the people of Homs, white-headed and bearded, entered upon Umar bin Abdul Aziz and said: \"O Commander of the Faithful, I ask you by the Book of Allah.\" Umar said: \"What is it?\" He said: \"Al-Abbas bin Al-Walid bin Abdul Malik usurped my land.\" A number of prominent people were in Umar's assembly, including Al-Abbas. Umar asked him: \"O Abbas, what do you say?\" He said: \"Yes, the Commander of the Faithful (Al-Walid) granted it to me, and wrote a document (Sijill) for me regarding it.\" Umar said: \"What do you say, O Dhimmi?\" He said: \"O Commander of the Faithful, I ask you by the Book of Allah Almighty.\" Umar said: \"Yes, the Book of Allah is more worthy to be followed than the book of Al-Walid. Stand up and return his estate to him, O Abbas\" (2).",
    "foot_note": "1. (1) Tarikh al-Umam wa al-Muluk 4 / 218. \n2. Sifat al-Safwah 2 / 115.",
    "book_id": "1170",
    "new_page_number": 30
  },
  {
    "serial_number": "7480688",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "Ibn al-Qayyim, may Allah have mercy on him, said: \"The rulings for the Musta'man (Protected one) and the Harbi (Enemy combatant) are different, because it is forbidden to kill the Musta'man, his life is guaranteed (indemnified), and [a hand] is cut off for stealing his wealth, whereas the Harbi is the opposite\" (1). Sheikh Abdul Aziz bin Baz, may Allah have mercy on him, said: \"It is not permissible to kill the Musta'man disbeliever whom the state has admitted in safety, nor to kill the disobedient (sinners) or transgress against them; rather, they are referred to the Sharia ruling. These are matters governed by Sharia judgement\" (2).",
    "foot_note": "1. (1) Ahkam Ahl al-Dhimmah 2 / 737. \n2. Muraja'at fi Fiqh al-Waqi' al-Siyasi wa al-Fikri 29.",
    "book_id": "1170",
    "new_page_number": 31
  },
  {
    "serial_number": "7480689",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "2 - Inviting them to Islam and clarifying its rulings with knowledge, wisdom, and good manner.\nOne of the characteristics of this religion is that its message is universal, not restricted to a people, a country, or a time. Allah Almighty said: {And We have not sent you except comprehensively to mankind as a bringer of good tidings and a warner. But most of the people do not know} (1). And on the authority of Abu Huraira, may Allah be pleased with him, from the Messenger of Allah, peace and blessings be upon him, that he said: \"By the One in Whose hand is the soul of Muhammad, no one of this nation, Jew or Christian, hears of me and then dies without believing in what I have been sent with, except that he will be among the companions of the Fire\" (2). Al-Nawawi said: \"In this lies the abrogation of all religions by the message of our Prophet, peace and blessings be upon him\" (3).",
    "foot_note": "1. (1) Surah Saba, Verse 28. \n2. Narrated by Muslim - Book of Faith - Chapter on the Obligation of Faith in the Message of Our Prophet Muhammad, peace and blessings be upon him 2 / 186. \n3. Sharh al-Nawawi 'ala Sahih Muslim 2 / 188.",
    "book_id": "1170",
    "new_page_number": 32
  },
  {
    "serial_number": "7480690",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism against the Protected Ones and Islam's Stance on it",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "It is from the tolerance of this religion that it permitted non-adherents among the People of Dhimmah, the Covenanted Ones, and the Protected Ones (Musta'manin) to live in its land while remaining on their religion and not forcing them into Islam. No era has been devoid of the presence of non-Muslims within Muslim society, living among Muslims, enjoying security for their lives, wealth, and honor. Their remaining within Muslim society does not imply, in any way, approval of the disbelief in Allah they adhere to, for Allah - the Exalted - does not approve of disbelief for His servants. Rather, the Lawgiver permitted them to remain for numerous wisdoms, including:",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 33
  },
  {
    "serial_number": "7480691",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "- That they mix with Muslims, contemplate the virtues of Islam and its laws, and look into them; they will find them founded on what minds can tolerate and accept. This invites them to Islam and encourages them towards it, so they may enter it. This is more beloved to Allah than killing them. The purpose of this is that the Word of Allah becomes supreme and the religion is entirely for Allah. Their lack of mixing with Muslims causes the loss of this interest, which is their acquaintance with Islam. Al-Subki, may Allah have mercy on him, said: 'And their lack of mixing distances them from knowing the virtues of Islam. Do you not see that from the Hijrah to the time of Al-Hudaybiyah, only a few entered Islam? Yet, from Al-Hudaybiyah to the Conquest [of Mecca], about ten thousand entered it; because of their mixing with them [Muslims] due to the truce that occurred between them. This is the reason for the legislation of the Contract of Dhimmah (Protection).' (1)",
    "foot_note": "1. (1) Al-Fatawa 2 / 404.",
    "book_id": "1170",
    "new_page_number": 34
  },
  {
    "serial_number": "7480692",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "3 - Disavowal (Bara'ah) of them and not having Loyalty (Wala') to them: Al-Bara' (Disavowal) is distancing, freedom from, and enmity after excuse and warning; it is the opposite of Al-Wala' (Loyalty). Ibn Taymiyyah said: 'Al-Walayah is the opposite of enmity. The root of Walayah is love and closeness, and the root of enmity is hatred and distance.' (1) Allah the Almighty said: {And a declaration from Allah and His Messenger to the people on the day of the greater pilgrimage that Allah is free from obligation to the polytheists.} (2) Ibn Kathir said: 'And a notification from Allah and His Messenger and a preceding warning to the people on the day of the greater pilgrimage—which is the Day of Sacrifice (Nahr), the best, most apparent, and greatest of the ritual days—: {that Allah is free from obligation to the polytheists, and [so is] His Messenger}, meaning: He is innocent of them as well.' (3) Therefore, it is obligatory upon Muslims to disavow those whom Allah and His Messenger have disavowed. Allah the Almighty said: {You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred.} (4)",
    "foot_note": "1. (1) Majmu' al-Fatawa 11 / 160.\n2. Surah At-Tawbah, from Verse 3.\n3. Tafsir al-Qur'an al-Azim 2 / 332.\n4. Surah Al-Mujadila, from Verse 22.",
    "book_id": "1170",
    "new_page_number": 35
  },
  {
    "serial_number": "7480693",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorism Against the Trustful and Islam’s Stance on It",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without publication details",
    "page_number": 33,
    "volume_number": 1,
    "text": "Allah praised His Prophet Ibrahim (peace be upon him) for his innocence from the people of disbelief and polytheism, and commanded that we follow his example. Allah says: {You have indeed in Abraham and those with him a good example when they said to their people: 'Indeed, we are free from you and from whatever you worship besides Allah. We have disbelieved in you, and enmity and hatred have appeared between us and you forever, until you believe in Allah alone,' except for Abraham's saying to his father: 'I will seek forgiveness for you, but I have no power to benefit you against Allah. Our Lord, upon You we rely, and to You we turn in repentance, and to You is the final destination.'} [Al-Mumtahina: 4]",
    "foot_note": "1. Al-Mumtahina: 4.",
    "book_id": "1170",
    "new_page_number": 36
  },
  {
    "serial_number": "7480694",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "At-Tabari said: \"'There has already been for you an excellent pattern' in the action of Abraham and those with him regarding these matters of separating from the disbelievers, opposing them, and abandoning loyalty to them, except in the saying of Abraham: {I will surely ask forgiveness for you}. For there is no pattern (example) for you in that, because that was from Abraham due to a promise he had made to him before it became clear to him that he was an enemy of Allah. But when it became clear to him that he was an enemy of Allah, he disassociated himself from him. So disassociate yourselves from the enemies of Allah among those who associate partners with Him, and do not take allies from among them until they believe in Allah alone and disassociate themselves from worshiping anything other than Him, and show [them] enmity and hatred.\" (1) His Eminence Sheikh Abdul Aziz bin Baz was asked the following: A Christian person lives with me, and he says to me: 'O my brother,' and 'We are brothers,' and he eats and drinks with us. Is this action permissible or not?",
    "foot_note": "1. (1) Jami' al-Bayan 22 / 566-567.",
    "book_id": "1170",
    "new_page_number": 37
  },
  {
    "serial_number": "7480695",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "He (may Allah have mercy on him) answered: \"A disbeliever is not a brother to a Muslim, meaning: in religion. Allah says: {The believers are but brothers} (Al-Hujurat: 10), and the Prophet (peace be upon him) says: 'The Muslim is the brother of the Muslim.' So the disbeliever—whether Jewish, Christian, Pagan, Magian, Communist, or otherwise—is not a brother to the Muslim. It is not permissible to take him as a companion and friend. However, if he eats with you occasionally without you taking him as a companion and friend, but rather it happens that he eats with you, or at a general banquet, then there is no harm.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 38
  },
  {
    "serial_number": "7480696",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "As for taking him as a companion, friend, constant sitter, and eating partner, it is not permissible, because Allah has cut off affection and loyalty (Wala') between us and them. Allah the Glorified and Exalted said in His Great Book: {There has already been for you an excellent pattern in Abraham and those with him, when they said to their people, 'Indeed, we are disassociated from you and from whatever you worship other than Allah. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allah alone'} (Al-Mumtahanah: 4). And He the Glorified said: {You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger}. Meaning: loving them: {even if they were their fathers or their sons or their brothers or their kindred} (Al-Mujadila: 22). Thus, the duty of the Muslim is to disavow the people of polytheism and hate them for the sake of Allah, but he should not harm them, hurt them, or transgress against them without right. However, he does not take them as companions or intimate friends. Whenever it happens that he eats with them at a general banquet or an incidental meal without companionship, guardianship, or affection, there is no harm.\"",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 39
  },
  {
    "serial_number": "7480697",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected People (Musta'minin) and Islam's Position on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "4- The Prohibition of Imitating Them and the Command to Differ from Them: The upright Sharia forbade imitating disbelievers because it creates an inclination towards them in the souls. On the authority of Ibn Umar, may Allah be pleased with them both, he said: The Messenger of Allah (peace be upon him) said: 'Whoever imitates a people is one of them' (1). Ibn Taymiyyah said: \"Resemblance and conformity in outward matters necessitate resemblance and conformity in inward matters by way of stealing in and subtle gradualism. Resemblance in the outward appearance bequeaths a type of affection, love, and alliance in the inward [heart], just as love in the inward bequeaths resemblance in the outward. This is a matter witnessed by sensation and experience. Even if two men are from the same town and meet in a foreign land, there would be a great matter of affection, alliance, and familiarity between them, even if they did not know each other in their own town or were estranged. That is because sharing the [origin of the] town is a type of attribute they are exclusive in, distinct from the foreign land. Indeed, if two men met in travel or a strange town and there was a resemblance between them in turban, clothes, hair, or mount and the like, there would be more familiarity between them than between others. Likewise, you find masters of worldly trades having an affinity for one another that they do not have for others, such that this occurs even with enmity and war\" (2).",
    "foot_note": "1. (1) Narrated by Abu Dawood in his Sunan - Book of Clothing - Chapter on Garments of Fame 4 / 44, and Al-Albani authenticated it in Sahih al-Jami' 2 / 1059.\n2. Iqtida' al-Sirat al-Mustaqim 1 / 488 - 489.",
    "book_id": "1170",
    "new_page_number": 40
  },
  {
    "serial_number": "7480698",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Terrorism of the Protected and Islam’s Stance on It",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without publication details",
    "page_number": 38,
    "volume_number": 1,
    "text": "5 - Doing good to those among them in need through charity and maintaining ties: Allah, the Exalted, says: {Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes from being righteous toward them and acting justly toward them. Indeed, Allah loves the just.} [Al-Mumtahana: 8]  Regarding Asma’ bint Abi Bakr (RA), she said: 'My mother came to me while she was a polytheist during the Quraysh period when they had a treaty with the Messenger of Allah (peace be upon him). I asked the Messenger of Allah about her, and he said: \"Yes, maintain ties with her.\"' Allah also revealed concerning this matter: {Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes from being righteous toward them and acting justly toward them.} [Al-Mumtahana: 8]",
    "foot_note": "1. Surah Al-Mumtahana, verse 8.\n2. Narrated by Al-Bukhari in his Sahih - Book of Manners - Chapter: Maintaining ties with one’s mother while she has a husband, vol. 10 / 413, Hadith 5979.\n3. See: Al-Durr Al-Manthur 8/130-131, ascribed to Ibn Al-Mundhir and others.",
    "book_id": "1170",
    "new_page_number": 41
  },
  {
    "serial_number": "7480699",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "And on the authority of Ibn Umar, may Allah be pleased with them both: «That Umar bin Al-Khattab, may Allah be pleased with him, saw a silken suit at the door of the Mosque, so he said: 'O Messenger of Allah, if only you would buy this and wear it for the people on Friday, and for the delegations when they come to you.' The Messenger of Allah, peace and blessings be upon him, said: 'This is worn only by one who has no portion in the Hereafter.' Later, some suits of the same kind were brought to the Messenger of Allah, peace and blessings be upon him, and he gave Umar one of them. Umar said: 'O Messenger of Allah, you have clothed me in it, yet you said about the suit of Utarid what you said?' The Messenger of Allah, peace and blessings be upon him, said: 'I did not give it to you to wear.' So Umar clothed a brother of his in Mecca who was a polytheist with it» (1). Al-Nawawi said: \"In this is evidence for the permissibility of maintaining ties with disbelieving relatives and treating them kindly, and the permissibility of giving gifts to disbelievers\" (2). And the polytheists in Mecca were people of war (Harbis).",
    "foot_note": "1. (1) Narrated by Al-Bukhari in his Sahih - Book of Friday - Chapter: Wearing the best of what one finds 2 / 373, and Muslim in his Sahih - Book of Clothing - Chapter: Prohibition of using gold and silver vessels etc. 14 / 37- 38. \n2. Sharh Al-Nawawi 'ala Sahih Muslim 14 / 39.",
    "book_id": "1170",
    "new_page_number": 42
  },
  {
    "serial_number": "7480700",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "Among the forms of kindness: Kindness to the prisoner of war (Harbi). Allah Almighty said: {And they give food in spite of love for it to the needy, the orphan, and the captive} {[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude.\"} (1). Qatadah said: \"Allah has commanded that captives be treated kindly, and at that time they were polytheists\" (2). Al-Hasan said: \"The captives were polytheists on the day this verse was revealed\" (3). Al-Tabari said: \"He is the combatant from the people of the Abode of War (Dar al-Harb), taken by force through victory, or from the people of the Qiblah taken and detained by right\" (4). I conclude this section with the statement issued by the Council of Senior Scholars regarding what happened in the city of Riyadh and elsewhere regarding bombings that claimed lives, terrified the safe, and destroyed property. Fatwa of the Council of Senior Scholars:",
    "foot_note": "1. (1) Surah Al-Insan, Verses 8-9. \n2. Mentioned by Al-Suyuti in Al-Durr Al-Manthur 8 / 371, and attributed to Abd bin Humaid. \n3. Mentioned by Al-Suyuti in Al-Durr Al-Manthur 8 / 371, and attributed to Ibn Mardawayh and others. \n4. Jami' al-Bayan 23 / 543 - 544.",
    "book_id": "1170",
    "new_page_number": 43
  },
  {
    "serial_number": "7480701",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "Praise be to Allah alone, and peace and blessings be upon the one after whom there is no Prophet, Muhammad, and upon his family and companions. To proceed: The Council of Senior Scholars, in its extraordinary session held in the city of Riyadh on Wednesday 13/3/1424 AH, reviewed the bombing incidents that occurred in the city of Riyadh on the evening of Monday 11/3/1424 AH, and the resulting killing, destruction, terror, and injuries to many people, both Muslims and others. It is known that the Sharia of Islam came to preserve the Five Necessities and prohibited aggression against them: Religion, Life, Wealth, Honor, and Intellect. Muslims do not disagree on the prohibition of attacking inviolable lives. The inviolable soul in the religion of Islam is either a Muslim soul—so it is not permissible under any circumstance to attack a Muslim soul and kill it without right; whoever does that has committed one of the great major sins. Allah Almighty says: {But whoever kills a believer intentionally - his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and prepared for him a great punishment}.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 44
  },
  {
    "serial_number": "7480702",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "And He, Glory be to Him, says: {Because of that, We decreed upon the Children of Israel that whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely. And whoever saves one - it is as if he had saved mankind entirely}... the verse. Mujahid, may Allah have mercy on him, said: \"[Meaning] In sin.\" This indicates the gravity of killing a soul without right. The Prophet, peace and blessings be upon him, said: «The blood of a Muslim man who testifies that there is no god but Allah and that I am the Messenger of Allah is not lawful except for one of three reasons: a life for a life, the married adulterer, and the renegade from his religion who leaves the community (Jama'ah)» (Agreed upon, and this wording is Al-Bukhari's). And the Prophet, peace and blessings be upon him, said: «I have been commanded to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and pay zakat. If they do that, their blood and wealth are protected from me, except by the right of Islam, and their reckoning is with Allah» (Agreed upon from the hadith of Ibn Umar, may Allah be pleased with them both).",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 45
  },
  {
    "serial_number": "7480703",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "In Sunan Al-Nasa'i, on the authority of Abdullah bin Amr, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, he said: «The passing of the world is lighter to Allah than the killing of a Muslim man.» Ibn Umar, may Allah be pleased with them both, looked one day at the House—or at the Kaaba—and said: \"How great you are, and how great is your sanctity! But the believer has greater sanctity before Allah than you.\"",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 46
  },
  {
    "serial_number": "7480704",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "All these evidences and many others indicate the greatness of the sanctity of a Muslim's blood and the prohibition of killing him for any reason, except what the Sharia texts have indicated. It is not lawful for anyone to transgress against a Muslim without right. Usama bin Zaid, may Allah be pleased with them both, says: «The Messenger of Allah, peace and blessings be upon him, sent us to Al-Hurqa. We attacked the people in the morning and defeated them. I and a man from the Ansar caught up with a man from them. When we overcame him, he said: 'La ilaha illa Allah' (There is no god but Allah). The Ansari held back from him, but I stabbed him with my spear until I killed him. When we returned, the news reached the Prophet, peace and blessings be upon him, and he said: 'O Usama, did you kill him after he said La ilaha illa Allah!!' I said: 'He was only seeking protection.' He kept repeating it until I wished I had not embraced Islam before that day» (Agreed upon, and this is Al-Bukhari's wording). This indicates most significantly the sanctity of blood. This was a polytheist man, and they were Mujahideen on the battlefield; when they overpowered him and had him at their mercy, he pronounced Tawheed. Usama, may Allah be pleased with him, interpreted his killing on the basis that he only said it to stop them from killing him. Yet, the Prophet, peace and blessings be upon him, did not accept his excuse or interpretation. This is among the greatest evidences of the sanctity of Muslim blood and the enormity of the crime of one who violates it.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 47
  },
  {
    "serial_number": "7480705",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "Just as the blood of Muslims is prohibited, their wealth is also prohibited and respected, based on the saying of the Prophet, peace and blessings be upon him: «Verily, your blood and your wealth are sacred to you, like the sanctity of this day of yours, in this month of yours, in this land of yours» (Narrated by Muslim). The Prophet, peace and blessings be upon him, said this in the sermon on the Day of Arafah, and Al-Bukhari and Muslim narrated something similar in the sermon on the Day of Sacrifice. From what preceded, the prohibition of killing an inviolable soul without right becomes clear. Among the inviolable souls in Islam are the souls of the Covenanted (Mu'ahids), the People of the Pact (Ahl al-Dhimma), and the Seekers of Protection (Musta'mins). On the authority of Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, said: «Whoever kills a Mu'ahid (person under a treaty) will not smell the fragrance of Paradise, and indeed its fragrance can be found from a distance of forty years» (Narrated by Al-Bukhari).",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 48
  },
  {
    "serial_number": "7480706",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "And whoever is admitted by the Muslim ruler under a contract of safety and covenant, his life and wealth are inviolable; it is not permissible to harm him. Whoever kills him is as the Prophet, peace and blessings be upon him, said: «He will not smell the fragrance of Paradise.» This is a severe threat to those who harm the Covenanted people. It is known that the People of Islam are one in their pact [of protection]; the Prophet says: «The believers' blood is equal [in value], and the lowest of them is entitled to grant protection on their behalf.» When Umm Hani, may Allah be pleased with her, granted protection to a polytheist man in the Year of the Conquest, and Ali bin Abi Talib, may Allah be pleased with him, wanted to kill him, she went to the Prophet, peace and blessings be upon him, and informed him. He said: «We protect whom you have protected, O Umm Hani» (Narrated by Al-Bukhari and Muslim). The point is that whoever enters under a contract of safety or a covenant from the ruler for an interest he sees, it is not permissible to harm him, nor to transgress against his life or his wealth. Since this is clear, what occurred in the city of Riyadh regarding the bombing incidents is a forbidden matter not sanctioned by the religion of Islam. Its prohibition comes from several aspects: 1 - This act is a violation of the sanctity of Muslim lands and terrorizing those safe within them. 2 - It involves the killing of souls deemed inviolable in Islamic Sharia. 3 - This constitutes spreading corruption in the land. 4 - It involves the destruction of protected wealth.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 49
  },
  {
    "serial_number": "7480707",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "While clarifying the ruling of this matter, the Council of Senior Scholars warns Muslims against falling into destructive prohibitions and warns them against the plots of Satan. For he continues with the servant until he causes him to fall into perils, either by extremism in religion or by negligence and warring against it—we seek refuge in Allah. Satan does not care which of the two he triumphs with from the servant, because both the paths of extremism and negligence are ways of Satan that land their doer in the wrath and punishment of the Most Merciful. As for what those who carried out these operations did by killing themselves through blowing themselves up, it falls under the generality of the Prophet's saying, peace and blessings be upon him: «Whoever kills himself with something in this world will be punished with it on the Day of Resurrection» (Narrated by Abu Awanah in his Mustakhraj from the hadith of Thabit bin Al-Dahhak, may Allah be pleased with him). And in Sahih Muslim from the hadith of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him: «Whoever kills himself with a piece of iron, his piece of iron will be in his hand, stabbing himself with it in his belly in the Fire of Hell, abiding eternally therein forever. And whoever drinks poison and kills himself, he will be sipping it in the Fire of Hell, abiding eternally therein forever. And whoever throws himself down from a mountain and kills himself, he will be falling in the Fire of Hell, abiding eternally therein forever.» It is in Al-Bukhari with a similar wording.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 50
  },
  {
    "serial_number": "7480708",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "Furthermore, let everyone know that the Islamic Ummah today suffers from the domination of enemies from every side. They rejoice at pretexts that justify their domination over the people of Islam, humiliating them, and exploiting their resources. Therefore, whoever aids them in their objective and opens a breach against Muslims and the lands of Islam for them has aided in the diminishment of Muslims and the domination over their lands, and this is among the greatest of crimes. It is also obligatory to pay attention to Sharia knowledge rooted in the Quran and Sunnah, according to the understanding of the Predecessors of the Ummah (Salaf), in schools, universities, mosques, and media outlets. It is also obligatory to care for Enjoining Good and Forbidding Evil and mutual advice towards the truth, for the need—nay, the necessity—calls for it now more than ever before. The youth of the Muslims must think well of their scholars and learn from them. Let them know that one of the things the enemies of the religion strive for is to drive a wedge between the youth of the Ummah and its scholars, and between them and their rulers, so that their strength weakens and it becomes easy to control them. Therefore, it is obligatory to be alert to this.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 51
  },
  {
    "serial_number": "7480709",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "May Allah protect everyone from the plot of the enemies. Muslims must fear Allah in secret and in public and offer sincere, honest repentance from all sins, for no calamity descends except due to a sin, and none is lifted except by repentance. We ask Allah to rectify the condition of Muslims and avert every evil and harm from the lands of Muslims. May Allah send peace and blessings upon our Prophet Muhammad, his family, and his companions. Council of Senior Scholars: Chairman of the Council Abdul Aziz bin Abdullah bin Muhammad Al Sheikh, Saleh bin Muhammad Al-Luhaidan, Abdullah bin Sulaiman Al-Manea, Abdullah bin Abdul Rahman Al-Ghadian, Dr. Saleh bin Fawzan Al-Fawzan, Hassan bin Ja'far Al-Atmi, Muhammad bin Abdullah Al-Subail, Dr. Abdullah bin Muhammad bin Ibrahim Al Sheikh, Muhammad bin Sulaiman Al-Badr, Dr. Abdullah bin Abdul Mohsen Al-Turki, Muhammad bin Zaid Al-Sulaiman, Dr. Bakr bin Abdullah Abu Zaid (did not attend due to illness), Dr. Abdul Wahhab bin Ibrahim Abu Sulaiman (did not attend), Dr. Saleh bin Abdullah bin Humaid, Dr. Ahmed bin Ali Siyyar Al-Mubaraki, Dr. Abdullah bin Ali Al-Rukban, Dr. Abdullah bin Muhammad Al-Mutlaq.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 52
  },
  {
    "serial_number": "7480710",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "Section Six: The Duty of Protected Persons (Musta'mins) in Muslim Lands. As for the rights obligatory upon them towards the Muslims who granted them safety in their homes, I summarize them as follows: Consideration of Muslims' feelings and respect for their rituals. They must observe the prestige of the Islamic State under whose protection and care they shade themselves. It is not permissible for them to insult Islam, its Messenger, or its Book, nor to promote their beliefs and ideas or spread corruption among Muslims. It is not permissible for them to display the drinking of alcohol, eating of pork, and other things prohibited in the religion of Islam, let alone selling and trading them, because of the corruption this causes to Islamic society. They must also not display eating and drinking during the days of Ramadan and the like, out of consideration for the feelings of Muslims. They must also adhere to the regulations and laws of the Muslim State which it organizes for the individuals of its people and applies to them. It is not permissible for them to violate or transgress them. If they violate them, they are deterred and punished with what the Muslim ruler or his deputy sees fit (1).",
    "foot_note": "1. (1) See: Al-Sharh Al-Kabir 10 / 567, Hashiyat Ibn Abidin 3 / 249.",
    "book_id": "1170",
    "new_page_number": 53
  },
  {
    "serial_number": "7480711",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "Conclusion and Recommendations. Praise be to Allah and peace and blessings be upon the Messenger of Allah. To proceed: After writing this research, the following results appeared to me: - Islam's care for preserving the Five Necessities: Religion, Life, Intellect, Honor, and Wealth, and arranging appropriate rulings for them. - The absence of Sharia knowledge and the spread of ignorance is a great cause for the occurrence and spread of tribulations; hence, care must be taken to seek Sharia knowledge from its original, correct sources. - The universality of the message of Islam for all people. This is one of the characteristics of the Prophet, peace and blessings be upon him, who exerted effort and strove in inviting people to this religion and bore dangers and troubles for its sake, thereby being a role model for his Ummah. - The principle is that Safety (Aman) is granted by the Imam or his deputy, and it is also permissible for individual Muslims, men and women, to grant safety to others in matters containing benefit and good, and not involving corruption or evil. - Evidence from the Quran and Sunnah is abundant in explaining the ruling of Safety (Aman), and scholars have explained the desired goal of it. - It is essential to know the differences between Aman (Safety), Dhimma (Pact), and Hudna (Truce), which fall under the name of 'Covenant', and the consequent legal rulings and observed interests, and to know the statements of scholars, both early and late, regarding that.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 54
  },
  {
    "serial_number": "7480712",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "- The obligation of justice with Covenanted people and the impermissibility of transgressing against them regarding their lives, wealth, and honor. Indeed, it is not permissible to terrorize or frighten them. A severe threat has come in the Sunnah for anyone who kills a Mu'ahid (covenanted person) or blows himself up to kill them, and so on. - The obligation of Muslims—leaders, scholars, and peoples—to be concerned with justice towards Covenanted people and to beware of transgressing against them. The pages of our Islamic history, past and present, bear witness to this. What happens from some Muslims that is contrary to Islam is few and rare. - The obligation to invite these Protected Persons (Musta'mins) to Islam and exploit their presence in its lands, doing so with knowledge, complete wisdom, appropriate style, and good treatment within the limits clarified by the Sharia and binding upon us. - Realizing Loyalty and Disavowal (Al-Wala' wal-Bara') with these Protected Persons and others without excess or negligence, and without extremism or harshness, but rather according to what the Book and Sunnah commanded and what the knowledgeable scholars explained from legal texts. - The Sharia of Islam contains a prohibition against imitating disbelievers in general and a command to differ from them, because imitating them involves subservience and submission to them, and attachment and adherence to the misguidance they are upon. It also leads to attachment to them and following them in everything.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 55
  },
  {
    "serial_number": "7480713",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "- The connection of the Ummah to its leaders and scholars and referring back to them is one of the causes of glory, victory, stability, establishment of security, and other blessed fruits and good results. - In exchange for the necessary duties upon Muslims towards Protected Persons, the duties upon Protected Persons towards Muslims are many. Among them is consideration of Muslims' feelings, respect for their rituals, observance of the prestige of the Islamic State, and respect for its regulations. It is also not permissible for them to display drinking alcohol, eating pork, and the like. - Muslims in general, and scholars in particular, must explain the Sharia of Islam and its sublime, just rulings to people in general, including Protected Persons, and refute opponents and clarify the face of truth and correctness through books, lectures, scientific research, and so on.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 56
  },
  {
    "serial_number": "7480714",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "List of Sources and References: * Ahkam Ahl al-Dhimma - Muhammad bin Abi Bakr bin al-Qayyim - Dar al-Ilm lil-Malayin - Beirut - Second Edition - 1401 AH. * Iqtida' al-Sirat al-Mustaqim li-Mukhalafat Ashab al-Jahim - Sheikh al-Islam Ahmad bin Abdul Halim bin Taymiyyah - Edited by Nasser al-Aql - First Edition - 1404 AH. * Taj al-Lughah wa Sihah al-Arabiyyah - Ismail bin Hammad al-Jawhari - Edited by Ahmed Abdul Ghafoor Attar - Dar al-Ilm lil-Malayin - Beirut - Third Edition - 1404 AH / 1984 AD. * Tarikh al-Umam wa al-Muluk - Muhammad bin Jarir al-Tabari - Dar Suwaydan - Beirut - Second Edition. * Tafsir al-Baydawi wa ma'ahu Hashiyat al-Shihab - Dar Sadir - Beirut - [No date]. * Tafsir al-Quran al-Azim - Ismail bin Umar bin Kathir - Dar al-Ma'rifah - Beirut - 1405 AH / 1995 AD. * Jami' al-Bayan 'an Ta'wil Ay al-Quran - Muhammad bin Jarir al-Tabari - Edited by Abdullah al-Turki - Dar Hajr - First Edition - 1422 AH / 2001 AD. * Al-Jami' li-Ahkam al-Quran - Muhammad bin Ahmad al-Qurtubi - Edited by Ahmed al-Bardouni - Dar al-Fikr - Beirut - [No date]. * Al-Durr al-Manthur fi al-Tafsir bi-l-Ma'thur - Jalal al-Din Abdul Rahman bin Abi Bakr al-Suyuti - Dar al-Fikr - Beirut - Second Edition - 1409 AH / 1988 AD.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 57
  },
  {
    "serial_number": "7480715",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "* Radd al-Muhtar 'ala al-Durr al-Mukhtar Sharh Tanwir al-Absar - Muhammad Amin bin Umar Abidin - Dar Ihya al-Turath al-Arabi - [No date]. * Sunan Abi Dawood - Sulaiman bin al-Ash'ath al-Sijistani - Cared for by Muhammad Muhyi al-Din Abdul Hamid - Dar Ihya al-Turath al-Arabi. * Al-Sunan al-Kubra - Ahmad bin al-Hussein al-Bayhaqi - Dar al-Ma'rifah - Beirut - [No date]. * Al-Sharh al-Kabir - Abdul Rahman bin Muhammad bin Qudamah al-Maqdisi - Edited by Abdullah al-Turki - Dar Hajr - First Edition - 1415 AH / 1995 AD. * Sahih al-Bukhari ma'a Fath al-Bari - Muhammad bin Ismail al-Bukhari - Dar al-Fikr - Beirut - [No date]. * Sahih al-Jami' al-Saghir wa Ziyadatuhu - Muhammad Nasir al-Din al-Albani - Al-Maktab al-Islami - Beirut and Damascus - Second Edition - 1406 AH / 1986 AD. * Sahih Ibn Khuzaymah - Muhammad bin Ishaq bin Khuzaymah - Edited by Muhammad Mustafa al-Azami - Al-Maktab al-Islami - [No date]. * Sahih Muslim ma'a Sharh al-Nawawi - Muslim bin al-Hajjaj al-Naysaburi - Dar al-Fikr - Beirut - [No date]. * Sifat al-Safwah - Abu al-Faraj Abdul Rahman bin Ali Ibn al-Jawzi - Edited by Mahmoud Fakhoury - Dar al-Ma'rifah - Beirut - Fourth Edition - 1406 AH / 1986 AD. * Al-Fatawa - Ali bin Abdul Kafi al-Subki - Dar al-Jil - Beirut - [No date].",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 58
  },
  {
    "serial_number": "7480716",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Terrorizing the Protected Ones (Musta'mins) and Islam's Stance on It",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "* Lisan al-Arab - Muhammad bin Mukarram bin Manzur al-Ifriqi - Al-Maktabah al-Faysaliyyah - Makkah Al-Mukarramah - Dar Sadir - Beirut - [No date]. * Majmoo' al-Fatawa - Sheikh al-Islam Ahmad bin Abdul Halim bin Taymiyyah - Collected and arranged by Abdul Rahman bin Muhammad bin Qasim - Maktabat Ibn Taymiyyah - [No date]. * Muraja'at fi Fiqh al-Waqi' al-Siyasi wa al-Fikri - Prepared by Abdullah al-Rifa'i - Dar al-Ma'arij - Riyadh - First Edition - 1414 AH / 1994 AD. * Al-Musnad - Ahmad bin Hanbal - Al-Maktab al-Islami - Beirut - Fifth Edition - 1405 AH / 1985 AD. * Al-Musannaf - Abdul Razzaq bin Hammam al-San'ani - Edited by Habib al-Rahman al-Azami - Al-Maktab al-Islami - Damascus - Beirut - Second Edition 1403 AH / 1983 AD.",
    "foot_note": "None",
    "book_id": "1170",
    "new_page_number": 59
  }
]