[
  {
    "text": "Virtues of Makkah and Dwelling Therein\nAuthor: الحسن بن يسار البصري أبو سعيد\nYear: 110",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 1
  },
  {
    "text": "sn: 1684\nbook_title: فضائل مكة والسكن فيها\nbook_link: https://shamela.ws/book/5722\nbook_id: 5722\nauthor_name: الحسن بن يسار البصري أبو سعيد\nauthor_year: 110\nnickname: أبو سعيد\nauthor_link: https://shamela.ws/author/1623\nauthor_ID: 1623\neditor: سامي مكي العاني\npublisher: مكتبة الفلاح - الكويت\nedition: Null\npages: 40\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب السنة\ncategory_id: 6",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 2
  },
  {
    "serial_number": "1342679",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Books of Sunnah\nBook: Virtues of Makkah and Dwelling Therein\nAuthor: Al-Hasan bin Yasar Al-Basri, Abu Sa'id (died 110 AH)\nInvestigator: Sami Makki Al-Ani\nBook: Virtues of Makkah and Dwelling Therein\nAuthor: Al-Hasan bin Yasar Al-Basri, Abu Sa'id (died 110 AH)\nInvestigator: Sami Makki Al-Ani\nAuthor: Al-Hasan bin Yasar Al-Basri, Abu Sa'id (died 110 AH)\nInvestigator: Sami Makki Al-Ani\nInvestigator: Sami Makki Al-Ani\n[Book numbering matches the printed version]",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 3
  },
  {
    "serial_number": "1342680",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 11,
    "volume_number": 1,
    "text": "Virtues of Makkah\nIn the name of Allah, the Most Gracious, the Most Merciful\nThe Sheikh, the Jurist, the Hafiz Abu Al-Fadl Ja'far bin Al-Hasan Ibn Ja'far Al-Hamadani informed us, he said: The Sheikh, the Imam Abu Tahir Ahmad bin Muhammad Al-Silafi Al-Isfahani informed us by reading to him in Jumada Al-Awwal of the year five hundred and seventy-one, he said: The Judge Abu Ishaq Ibrahim bin Muhammad bin Al-Hussein Al-Ghadairi informed us in (Derbent) by reading to him from me in Shawwal of the year five hundred and thirty, he said: Abu Mansour Muhammad bin Ahmad bin Al-Qasim Al-Isfahani the Reciter wrote to me from the outpost of (Amid) that Abu Al-Hasan Ali bin Al-Hadir bin Ali Al-Baghdadi in Fustat said: Abu Al-Hasan Ali bin Abd Al-Rahman Al-Shafi'i informed us in Makkah, saying: Abu Al-Hasan Ali bin Abdullah Al-Hamadani informed us, saying: Abu Al-Hasan Muhammad Ibn Nafi' informed us, saying: Abu Al-Hasan Muhammad bin Ibrahim bin Ma'ruf Al-Saydalani informed us, saying: Abdullah bin Ahmad bin Salih Al-Tamimi told us, saying: My father told us, saying: Abdullah bin Abd Al-Hamid or Al-Majid Al-Hanafi told us, saying: Ubaydah or Hubayrah Al-Baji Al-Haddad told us",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 4
  },
  {
    "serial_number": "1342681",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 12,
    "volume_number": 1,
    "text": "And Ibn Nafi' said: Abu Al-Qasim Ubaydullah bin Muhammad bin Muhammad informed us, saying: Muhammad Al-Muzaffar bin Ahmad Al-Muzaffar Al-Ashmuni Al-Shammar informed us, saying: Muhammad bin Ibrahim Al-Naysaburi told us, saying: Muhammad bin Ali Al-Hanafi told us, from Abu Hubayrah Al-Baji who said: Al-Hasan bin Abi Al-Hasan Al-Basri (may Allah have mercy upon him) wrote to a man from the ascetics called Abd Al-Rahim or Abd Al-Rahman bin Anas Al-Ramadi, who used to dwell in Makkah (may Allah Almighty honor it), and he possessed virtue, religion, and renown, and he had no work in this world except the worship of Allah Almighty. He intended to leave Makkah for Yemen, and this news reached Al-Hasan, and he was a brother of his for the sake of Allah Almighty. So he wrote a letter to him encouraging him to stay in Makkah (may Allah increase it in honor), the beginning of which was: In the name of Allah, the Most Gracious, the Most Merciful. May Allah preserve you, O my brother, with that by which He preserves the people of faith, and may He protect you from that which is disliked, and grant you success for good deeds, and complete His blessings upon you in all matters, and gather us and you in the Abode of Peace (Paradise)",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 5
  },
  {
    "serial_number": "1342682",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 13,
    "volume_number": 1,
    "text": "in the neighborhood of the Most Merciful, for that is in His Hand, and there is no power and no strength except with Allah, the Most High, the Most Great. As for what follows, O my brother, I have written to you while I and those with me of the people of care, relatives, and brothers are in the best state you would love, and our Lord is Praised. And may Allah send blessings upon our master Muhammad and upon his family and companions and grant them peace. Know, O my brother—may Allah Almighty preserve you—that it has reached me that you have resolved your opinion to leave the Sanctuary (Haram) of Allah Almighty and His security, and to move from it to Yemen. And by Allah, I hated that, and it distressed me, and I felt a severe desolation from it, since Satan wanted to unsettle you from the Sanctuary of Allah Almighty and cause you to slip. So how strange is your reasoning if you intended that in yourself after Allah made you one of its people. If you had praised Allah Almighty for what He bestowed upon you and tested you with regarding His Sanctuary and His security, and made you of its people, it would have been incumbent upon you to thank Him forever as long as you remained alive, and you would have been busy worshipping Allah, Mighty and Majestic, multiples of what you were upon, since He made you one of",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 6
  },
  {
    "serial_number": "1342683",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 14,
    "volume_number": 1,
    "text": "the people of His Sanctuary and His security and neighbors of His House. Beware, then beware of anxiety and annoyance. Adhere to patience, silence, and forbearance, for with them you will defeat the accursed Satan. And beware, then beware, O my brother, of leaving it and moving away from it, for you are in the best land and the most beloved land of Allah Almighty to Him, and the greatest of them in value and the most noble in His sight. So we ask Allah Almighty to grant us and you success for good deeds, for He is the Affectionate, the Bestower. And there is no power and no strength except with Allah, the Most High, the Most Great. Know, O my brother, that Allah Almighty preferred Makkah over all other lands and revealed its mention in His Mighty Book in numerous places. He Almighty said: {Indeed, the first House [of worship] established for mankind was that at Bakkah - blessed and a guidance for the worlds. In it are clear signs [such as] the standing place of Abraham. And whoever enters it shall be safe.} And He Almighty said: {And [mention] when Abraham said, 'My Lord, make this a secure city'}",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 7
  },
  {
    "serial_number": "1342684",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 15,
    "volume_number": 1,
    "text": "{and provide its people with fruits - whoever of them believes in Allah and the Last Day.} And He Almighty said: {Then let them end their untidiness and fulfill their vows and perform Tawaf around the Ancient House.} And He Almighty said: {And [mention, O Muhammad], when We designated for Abraham the site of the House, [saying], 'Do not associate anything with Me and purify My House for those who perform Tawaf and those who stand [in prayer] and those who bow and prostrate.'} And He Almighty said: {And [mention] when We made the House a place of return for the people and [a place of] security. And take, [O believers], from the standing place of Abraham a place of prayer.} And He Almighty said: {And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], 'Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.'} And He Almighty said: {I have only been commanded to worship the Lord of this city, Who made it sacred.} And He Almighty said: {A good land and a forgiving Lord.} And He Almighty said: {Indeed, As-Safa and Al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs 'Umrah - there is no blame upon him for walking between them. And whoever volunteers good - then indeed, Allah is Appreciative and Knowing.} And He Almighty said: {But when you depart from 'Arafat,}",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 8
  },
  {
    "serial_number": "1342685",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 16,
    "volume_number": 1,
    "text": "{remember Allah at al-Mash'ar al-Haram. And remember Him, as He has guided you.} And He Almighty said: {Have We not established for them a secure sanctuary to which are brought fruits of all things as provision from Us?} And He, Blessed and Almighty, said: {Allah has made the Ka'bah, the Sacred House, standing for the people and [has sanctified] the sacred months.} And He Almighty said to His Prophet Abraham, peace be upon him: {And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every distant pass.} And He Almighty said: {Let them worship the Lord of this House, Who has fed them, [saving them] from hunger and made them safe, [saving them] from fear.} And He Almighty said: {Our Lord, I have settled some of my descendants in an uncultivated valley near Your sacred House, our Lord, that they may establish prayer. So make hearts among the people incline toward them and provide for them from the fruits that they might be grateful.}",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 9
  },
  {
    "serial_number": "1342686",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 17,
    "volume_number": 1,
    "text": "And He Almighty said: {We have certainly seen the turning of your face, [O Muhammad], toward the heaven, and We will surely turn you to a qiblah with which you will be pleased. So turn your face toward al-Masjid al-Haram. And wherever you [believers] are, turn your faces toward it [in prayer].} And He Almighty said: {And when you have completed your rites, remember Allah like your [previous] remembrance of your fathers or with [much] greater remembrance.} And He Almighty said: {Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed.} And He Almighty said: {And Allah presents an example: a city which was safe and secure, its provision coming to it in abundance from every location.} And He Almighty said: {Hajj is [during] well-known months, so whoever has made Hajj obligatory upon himself therein [by entering the state of ihram], there is [to be for him] no sexual relations and no disobedience and no disputing during Hajj.} And He Almighty said: {Have you made the providing of water for the pilgrim and the maintenance of al-Masjid al-Haram equal to [the deeds of] one who believes in Allah and the Last Day and strives in the cause of Allah?}",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 10
  },
  {
    "serial_number": "1342687",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 18,
    "volume_number": 1,
    "text": "So these verses, O my brother, Allah Almighty revealed all of them specifically regarding Makkah, and He did not reveal them for any city other than it. Then I will benefit you, O my brother, after this with what has come from the Prophet, may Allah bless him and grant him peace, regarding the reports on the virtues of Makkah and the virtues of its people and whoever dwells near it. Know, O my brother, that the Messenger of Allah, may Allah bless him and grant him peace, said when he left Makkah, standing at Al-Hazwarah and facing the Kaaba, and he said: 'By Allah, indeed I know that you are the most beloved of Allah's cities to me, and that you are the most beloved of Allah's land to Allah Almighty, and that you are the best spot on the face of the earth and the most beloved of it to Allah Almighty. And were it not that your people expelled me from you, I would not have left.' And he, may Allah bless him and grant him peace, said in another Hadith: 'The best city on the face of the earth and the most beloved of it to Allah Almighty is Makkah.'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 11
  },
  {
    "serial_number": "1342688",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 19,
    "volume_number": 1,
    "text": "And the Messenger of Allah, may Allah bless him and grant him peace, said: 'The earth was spread out from Makkah, so Allah Almighty stretched it from underneath it, thus it was named Umm Al-Qura (The Mother of Cities). And the first mountain placed on the earth was Abu Qubais. And the first to circumambulate the House were the Angels, two thousand years before Allah Almighty created Adam, upon him be blessings and peace. And there is no angel that Allah Almighty sends from the heaven to the earth for a need except that he bathes beneath the Throne and descends in a state of Ihram, so he begins with the House of Allah Almighty and circumambulates it for a week (seven times).'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 12
  },
  {
    "serial_number": "1342689",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 20,
    "volume_number": 1,
    "text": "'Then he prays two units of prayer behind the Station (Maqam), then he proceeds to his need and what he was sent for. And every prophet from the prophets, upon them be blessings and peace, when his people rejected him, he would leave from among them to Makkah. And no prophet fled from his nation except that he fled to Makkah, so he worshipped Allah Almighty therein at the Kaaba until certainty came to him, which is death. And indeed around the Kaaba are the graves of three hundred prophets. And between the Yamani Corner and the Black Corner (Black Stone) are the graves of seventy prophets, all of whom were killed by hunger and lice. And the grave of Ishmael and his mother Hagar, may Allah's blessings and peace be upon them both, is in the Hijr under the Mizab (waterspout). And the graves of Noah, Hud, Shu'ayb, and Saleh, may Allah's blessings and peace be upon our Prophet and upon them, are in what is between Zamzam and the Station (Maqam). And there is no city on the face of the earth to which all the prophets, angels, messengers, and the righteous servants of Allah from the inhabitants of the heavens and the earth and the Jinn have come as delegations, except Makkah.'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 13
  },
  {
    "serial_number": "1342690",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 21,
    "volume_number": 1,
    "text": "'And there is no city on the face of the earth where Allah raises (multiplies) a single good deed up to one hundred thousand good deeds except Makkah. And whoever prays a prayer therein, one hundred thousand prayers are raised for him. And whoever fasts therein, the fasting of one hundred thousand days is written for him. And whoever gives a dirham in charity therein, Allah writes for him one hundred thousand dirhams of charity. And whoever completes the Quran therein one time, Allah Almighty writes for him one hundred thousand completions. And all acts of righteousness therein, each one is [multiplied] by one hundred thousand. And I do not know of a city in which Allah Almighty will resurrect on the Day of Resurrection, from the prophets, the chosen ones, the God-fearing, the righteous, the truthful, the martyrs, the pious, the scholars, the jurists, the poor, the wise, the ascetics, the worshippers, the devotees, the good people, and the rabbis, from men and women, the like of what He will resurrect'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 14
  },
  {
    "serial_number": "1342691",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 22,
    "volume_number": 1,
    "text": "from Makkah by Allah Almighty. And indeed, they will be resurrected while they are safe from the punishment of Allah Almighty. And truly, one day in the Sanctuary of Allah Almighty and His security is more hopeful for you and better than fasting for an entire lifetime and standing in prayer during it in other lands. And it has been narrated from the Prophet, may Allah bless him and grant him peace, that he said: 'Journeys are not set out (for religious visitations) except to three mosques: this Mosque of mine, Al-Masjid Al-Haram, and Al-Masjid Al-Aqsa.' And he did not mention any of the mosques other than them. And he, may Allah bless him and grant him peace, said: 'A prayer in this Mosque of mine is worth a thousand prayers in other than it, except Al-Masjid Al-Haram, for a prayer in it is worth one hundred thousand prayers in other than it, and a prayer in Al-Masjid Al-Aqsa is worth five hundred prayers.' \\ 1 \\",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 15
  },
  {
    "serial_number": "1342692",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 23,
    "volume_number": 1,
    "text": "And there is no spot on the face of the earth upon which one hundred and twenty mercies descend every day from Allah Almighty—sixty for those circumambulating, forty for those praying, and twenty for those looking at the Kaaba—except Makkah. And looking at the Kaaba is worship. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever looks at the House of Allah with faith, seeking reward, and confirming [the truth], his past and future sins are forgiven, and he will be resurrected on the Day of Resurrection among the secure ones.' And Allah Almighty will resurrect its people on the Day of Resurrection safe and secure. And there is no city on the face of the earth to which all the gates of Paradise are opened",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 16
  },
  {
    "serial_number": "1342693",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 24,
    "volume_number": 1,
    "text": "except Makkah. And indeed, Paradise has eight gates, all of them open towards it in Makkah until the Day of Resurrection. So a gate from them is for the Kaaba, and a gate from them is under the Mizab (waterspout), and a gate from them is at the Yamani Corner, and a gate from them is at the Black Corner (Black Stone), and a gate from them is behind the Station (Maqam), and a gate from them is at Zamzam, and a gate from them is on Al-Safa, and a gate from them is on Al-Marwah. And no one enters the Kaaba except by the mercy of Allah, and no one exits from it except with the forgiveness of Allah Almighty. He Almighty said: {And whoever enters it shall be safe}, meaning from the Fire. And there is no city on the face of the earth where supplication (Du'a) is answered in fifteen places except Makkah. The first of them is inside the Kaaba, supplication therein is answered; and supplication at the Black Stone is answered; and supplication at the Yamani Corner is answered; and supplication at the Hijr is answered; and supplication behind the Station (Maqam) is answered; and supplication at",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 17
  },
  {
    "serial_number": "1342694",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 25,
    "volume_number": 1,
    "text": "the Multazam is answered; and supplication at the door of the well of Zamzam is answered; and supplication on Al-Safa and Al-Marwah is answered; and supplication between Al-Safa and Al-Marwah is answered; and supplication between the Corner and the Station is answered; and supplication in Mina is answered; and supplication [at Jamarat] is answered; and supplication at Arafat is answered; and supplication at Al-Mash'ar Al-Haram is answered. So these, O my brother, are fifteen places, so seize the opportunity for supplication in them, for they are the places where supplication is not rejected. And they are the great scenes where forgiveness is hoped for. So strive, O my brother, in supplication at these great scenes. And indeed, if you leave the Sanctuary of Allah Almighty and His security, the blessing of these scenes will depart from you. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Indeed, the best of spots,",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 18
  },
  {
    "serial_number": "1342695",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 26,
    "volume_number": 1,
    "text": "and the purest, and the most sanctified, and the closest to Allah Almighty is what is between the Corner and the Station.' And the Messenger of Allah, may Allah bless him and grant him peace, said: 'What is between the Yamani Corner and the Black [Stone] is a garden from the gardens of Paradise.' And he, may Allah bless him and grant him peace, said: 'There is no one who supplicates at the Black Corner except that it is answered for him, and likewise at the Yamani Corner.' And know, O my brother, that no one leaves it except that he regrets. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Residing in Makkah is happiness and leaving it is misery.' \\ 2 \\ So remain firm in your place, and beware of anxiety and annoyance, for that is from the action of Satan. So do not depart. And indeed, if you earn an earning equal to two fils from lawful means therein, it is better and more good than earning two thousand dirhams elsewhere. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever dies as a pilgrim (Hajj)",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 19
  },
  {
    "serial_number": "1342696",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 27,
    "volume_number": 1,
    "text": "or performing Umrah, will not be presented [for judgment] nor held to account, and it will be said to him: Enter Paradise in peace with the secure ones.' And the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever fasts the month of Ramadan in Makkah, Allah Almighty writes for him [the reward of] one hundred thousand months in other lands, and a prayer in the Sacred Mosque is worth one hundred thousand prayers. If he prays it in congregation, it is worth a thousand thousand [one million] prayers. And whoever falls ill in Makkah for one day, Allah, Glorified and Exalted be He, forbids his body and his flesh to the Fire.' He, may Allah bless him and grant him peace, said: 'Whoever falls ill in Makkah for a day, Allah writes for him, from the good deeds he used to do elsewhere, the worship of sixty years. And whoever is patient with the heat of Makkah for an hour of a day, Allah Almighty distances him from the Fire by a journey of five hundred years, and brings him close to Paradise",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 20
  },
  {
    "serial_number": "1342697",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 28,
    "volume_number": 1,
    "text": "by a journey of two hundred years. And indeed, Makkah and Madinah expel their impurities just as the bellows expels the impurities of iron. Verily, Makkah was established upon disliked things and degrees [of trials], and whoever is patient with its severity, I will be an intercessor or a witness for him on the Day of Resurrection. And whoever dies in Makkah or in Madinah, Allah will resurrect him on the Day of Resurrection safe from His punishment; there is no reckoning upon him, nor fear, nor punishment, and he enters Paradise in peace, and I will be an intercessor for him on the Day of Resurrection. Verily, the people of Makkah are the people of Allah Almighty and the neighbors of His House. And there is no city on the face of the earth containing the drink of the righteous and the prayer place of the chosen ones except in Makkah.' It was said to Ibn Abbas, may Allah be pleased with them both: 'What is the prayer place of the chosen ones?' He said: 'Under the Mizab (waterspout).' It was said to him: 'What is the drink of the righteous?' He said: 'The water of Zamzam.'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 21
  },
  {
    "serial_number": "1342698",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 29,
    "volume_number": 1,
    "text": "And the best valley on the face of the earth is the valley of Abraham, peace be upon him. And the best well on the face of the earth is the well of Zamzam. And there is no city in which there is something that, if a human touches it, he exits from his sins like the day his mother gave birth to him, except in Makkah; for whoever touches the Black Stone exits from his sins like the day his mother gave birth to him. And there is no city on the face of the earth where anyone prays where Allah commanded His Prophet except in Makkah, for Allah Almighty said: {And take, [O believers], from the standing place of Abraham a place of prayer.} And whoever prays behind the Station (Maqam) is secure. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever prays two units of prayer behind the Station (Maqam), forgiven for him is what",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 22
  },
  {
    "serial_number": "1342699",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 30,
    "volume_number": 1,
    "text": "preceded of his sin and what will follow. And whoever prays two units of prayer under the Mizab exits from his sins like the day his mother gave birth to him. And whoever prays two units of prayer around the Kaaba exits from his sins like the day his mother gave birth to him. And the most beloved of spots to Allah Almighty is what is between the Station (Maqam) and the Multazam. And looking at the Kaaba is worship and safety from hypocrisy. And there is no spot on the face of the earth where Tawaf, Hajj, and Umrah exist except in Makkah. And looking into the well of Zamzam is worship. And the one circumambulating the House is like the one circumambulating the Throne of the Most Merciful. And the Black Stone is the right hand of Allah Almighty on His earth; He shakes hands with it whom He wills of His servants. And the Black Stone and the Station (Maqam) will come on the Day of Resurrection, each one of them like the mountain of Abu Qubais, having two eyes, a tongue, and two lips, testifying for everyone who came to them with loyalty.'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 23
  },
  {
    "serial_number": "1342700",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 31,
    "volume_number": 1,
    "text": "It was narrated from the Prophet, may Allah bless him and grant him peace, that he said: 'Indeed, the most noble of angels in the sight of Allah Almighty are those who circumambulate His House.' And whoever looks at the House with a glance, even if he has sins like the foam of the sea, Allah forgives them all for him. The Messenger of Allah, may Allah bless him and grant him peace, said: 'Indeed, Allah Almighty has a tablet of red ruby into which Allah looks every day three hundred and sixty times: one hundred and eighty looks of mercy, and one hundred and eighty looks of punishment. And indeed, the first whom Allah Almighty looks at with mercy are the people of His Sanctuary; so whoever He sees standing praying, He forgives him. Then the angels say—and He is more knowledgeable of that—'Our Lord, there remains none but the sleepers.' So He, Blessed and Almighty, says: 'And the sleepers around My House, join them [with the others].' And the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever circumambulates the House for a week (seven rounds), Allah raises him seventy thousand degrees for every foot step,'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 24
  },
  {
    "serial_number": "1342701",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 32,
    "volume_number": 1,
    "text": "'and gives him seventy thousand good deeds, and grants him seventy thousand intercessions for whom he wills from the people of his household from among the Muslims. If He wills, He hastens it for him in this world, and if He wills, He stores it for him in the Hereafter.' And the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever circumambulates the House of Allah seven times on a summer day of intense heat, uncovering his head, and touches the Stone in every round without harming anyone, and reduces his speech except for the remembrance of Allah Almighty, he will have for every foot he lifts or places seventy thousand good deeds, and seventy thousand bad deeds will be erased from him, and he will be raised seventy thousand degrees.' And the merit of the walking pilgrim over the riding pilgrim is like the merit of the moon",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 25
  },
  {
    "serial_number": "1342702",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 33,
    "volume_number": 1,
    "text": "on the night of the full moon over the rest of the stars. And he, may Allah bless him and grant him peace, said: 'If the angels were to shake hands with anyone, they would shake hands with the warrior in the path of Allah, the one dutiful to his parents, and the one circumambulating the House of Allah.' And he, may Allah bless him and grant him peace, said: 'The Kaaba is surrounded by seventy thousand angels asking forgiveness for the one who circumambulates, and sending blessings upon him.' And he, may Allah bless him and grant him peace, said: 'The one circumambulating wades into the mercy of Allah, and indeed Allah boasts to the angels about those circumambulating the House.' And he, may Allah bless him and grant him peace, said: 'Do much of this Tawaf (circumambulation) before a barrier is placed between you and it, for it is as if I am looking at a man from Abyssinia, bald, with distorted wrists, flat-footed, bow-legged, sitting upon it demolishing it'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 26
  },
  {
    "serial_number": "1342703",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 34,
    "volume_number": 1,
    "text": "stone by stone. And he, may Allah bless him and grant him peace, said: 'The pilgrims and those performing Umrah are the delegation of Allah Almighty. If they ask Him, He gives them; and if they call upon Him, He answers them; and if they spend, He compensates them for every dirham seven hundred thousand dirhams' - and in a narration: 'a thousand thousand [million] dirhams and seven hundred thousand dirhams.' By the One in Whose Hand is his soul, no one raising his voice in Tahlil (saying La ilaha illa Allah) nor one saying Takbir (Allahu Akbar) raises it except that every thing until the end of the earth raises its voice with his Tahlil and Takbir. [Then a man said]: 'O Messenger of Allah, and to what [extent] is this multiplication?' He said: 'By the One in Whose Hand is my soul, regarding their spending, Allah will surely compensate them the seven hundred thousand in the abode of this world before they leave it; and as for the thousand thousand, it is stored for them in the Hereafter. And by the One in Whose Hand is my soul, indeed a single dirham is heavier than'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 27
  },
  {
    "serial_number": "1342704",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 35,
    "volume_number": 1,
    "text": "your mountain here,' and he pointed to Abu Qubais. And he, may Allah bless him and grant him peace, said: 'Whoever is able to die in one of the Two Sanctuaries (Haramain), let him die, for I will be the first to intercede for him, and on the Day of Resurrection he will be safe from the punishment of Allah Almighty, and there will be no reckoning upon him nor punishment.' And he, may Allah bless him and grant him peace, said: 'Umrah to Umrah is an expiation for what is between them. and an accepted Hajj (Hajj Mabrur) has no reward except Paradise.' And the Messenger of Allah, may Allah bless him and grant him peace, said: 'Whoever performs Hajj and does not commit obscenity nor wickedness, exits from his sins like the day his mother gave birth to him. And there is no man who bequeaths a Hajj except that three Hajjes are written for him: a Hajj for the one who wrote it, a Hajj for the one who bequeathed it, and a Hajj for the one who assumed Ihram for it'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 28
  },
  {
    "serial_number": "1342705",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 36,
    "volume_number": 1,
    "text": "on his behalf. And whoever performs Hajj on behalf of his parents, two Hajjes are written for him: a Hajj for him and a Hajj for his parents. And whoever performs Hajj on behalf of a deceased person a Hajj without being bequeathed to do so, a Hajj is written for him [the deceased] and seventy Hajjes are written for the one who performed Hajj on his behalf. And indeed, when it is the evening of Arafah, Allah, Glorified and Exalted, descends to the lowest heaven and looks at His servants, and He boasts about them to the angels. He, Glorified is His Majesty, says: 'O My angels, do you not see My servants having come to Me from every deep valley, disheveled and dusty, hoping for My mercy? I call you to witness, O My angels, that I have granted their wrongdoers to their righteous ones, and accepted the intercession of some of them for others, and forgiven them all. Depart, My servants, all of you forgiven for what has passed of your sins, the small of them and the great of them, the old of them and the new of them.' And an accepted Hajj is better than the world and what is in it. And it is said regarding the one from whom it is not",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 29
  },
  {
    "serial_number": "1342706",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 37,
    "volume_number": 1,
    "text": "accepted, that he exits from his sins; and the one from whom Allah accepts, he has indeed succeeded a great success. And it has been narrated from the Prophet, may Allah bless him and grant him peace, that he said: 'Whoever visits me after my death, it is as if he visited me during my life. And whoever did not catch me and did not pledge allegiance to me, then came to Madinah after my death and greeted me and visited me at my grave, then he has pledged allegiance to me.' And whoever comes to the Black Corner (Black Stone) and kisses it, it is as if he has pledged allegiance to Allah Almighty and His Messenger, may Allah bless him and grant him peace. He, may Allah bless him and grant him peace, said: 'Indeed the Corner is the right hand of Allah on the earth; He shakes hands with His servants through it just as one of you shakes hands with his brother. And whoever did not catch the pledge of allegiance to the Messenger of Allah, may Allah bless him and grant him peace, and touches the Stone, then he has pledged allegiance to Allah Almighty and His Messenger, may Allah bless him and grant him peace.' And he, may Allah bless him and grant him peace, said: 'Nothing remains of Paradise except this Black Stone. And were it not for what touched it of the impurities of the polytheists'",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 30
  },
  {
    "serial_number": "1342707",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 38,
    "volume_number": 1,
    "text": "and their filth, no one with an ailment would touch it seeking a cure by it except that he would be healed. And whoever dies in the Sanctuary (Haram), it is as if he died in the fourth heaven. And whoever dies in Bait al-Maqdis (Jerusalem), it is as if he died in the lowest heaven. And whoever performs Hajj to the House of Allah Almighty walking, Allah writes for him for every foot he lifts and places seventy thousand good deeds from the good deeds of the Sanctuary.' Ibn Abbas, may Allah be pleased with them both, said: 'A good deed of the Sanctuary is worth one hundred thousand good deeds.' And he, may Allah bless him and grant him peace, said: 'Indeed, for the riding pilgrim, for every step his camel takes, is a good deed from the good deeds of the Sanctuary.' It was said: 'O",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 31
  },
  {
    "serial_number": "1342708",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 39,
    "volume_number": 1,
    "text": "Messenger of Allah, and what are the good deeds of the Sanctuary?' He said: 'Every good deed is worth one hundred thousand good deeds.' And it was narrated from the Prophet, may Allah bless him and grant him peace, that he said: 'Allah Almighty will resurrect from the graveyard of Makkah seventy thousand martyrs who will enter Paradise without reckoning; their faces will be like the moon on the night of the full moon, and every one of them will intercede for seventy thousand men.' So it was said: 'Who are they, O Messenger of Allah?' He said: 'The strangers.' And whoever dies in the Sanctuary of Allah Almighty or the Sanctuary of the Messenger of Allah, may Allah bless him and grant him peace, or dies between Makkah and Madinah as a pilgrim or performing Umrah, Allah will resurrect him on the Day of Resurrection among the secure ones. Verily, filling oneself with the water of Zamzam is a freedom from hypocrisy. And whoever prays in the Hijr two units of prayer towards the Levantine Corner (Rukn Shami), it is as if",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 32
  },
  {
    "serial_number": "1342709",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Virtues of Makkah and Dwelling Therein",
    "edition": "None",
    "publisher": "Al-Falah Library - Kuwait",
    "page_number": 40,
    "volume_number": 1,
    "text": "he enlivened seventy thousand nights [in worship], and it was like the worship of every believing man and believing woman, and as if he performed forty accepted and received Hajjes. And whoever prays facing the door of the Kaaba four units of prayer, it is as if he worshipped Allah Almighty like the worship of all His creation, multiplied many times over, and Allah Almighty secures him on the Day of Resurrection from the Great Terror, and Allah, Mighty and Majestic, commands Gabriel and Michael and all the angels, peace be upon them, to ask forgiveness for him until the Day of Resurrection. So seize this goodness, O my brother, all of it, and beware lest you miss it. And peace be upon you and the mercy of Allah and His blessings. The message was completed with the praise of Allah Almighty and His good success, and the completion of it coincided with the night of Monday, the nineteenth of Shawwal from the months of the year one thousand and fifty-four. And praise be to Allah alone, and may He send blessings upon the one after whom there is no prophet.",
    "foot_note": "None",
    "book_id": "5722",
    "new_page_number": 33
  }
]