[
  {
    "serial_number":"285027",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":0,
    "volume_number":1,
    "text":"القسم: الفرق والردود الكتاب : دراسة علم الأديان - أهميتها ومناهج الباحثين فيها - المؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 53 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nالكتاب : دراسة علم الأديان - أهميتها ومناهج الباحثين فيها - المؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 53 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nالمؤلف : د . عبد المجيد بن محمد الوعلان عدد الصفحات : 53 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nعدد الصفحات : 53 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\n[ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 25 صفر 1442\nتاريخ النشر بالشاملة : 25 صفر 1442",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285028",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":1,
    "volume_number":1,
    "text":"دراسة علم الأديان أهميتها ومناهج الباحثين فيها د. عبد المجيد بن محمد الوعلان",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285029",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":2,
    "volume_number":1,
    "text":" المقدمة الحمد لله الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون وأشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله خاتم الأنبياء والمرسلين صلى الله عليه وعلى آله وصحبه أجمعين ومن تبعهم بإحسان إلى يوم الدين أما بعد. فإن دراسة علم الأديان، أهميتها وضوابطها الشرعية، ومناهج الباحثين فيها قديمًا وحديثًا، وبيان المنهج الحق من حيث التلقي والاستدلال والعرض، من الموضوعات المتعلقة بالعقيدة التي ينبغي العناية بها، \"وتأتي أهمية الكتابة في هذا الموضوع من خطورة تلك الديانات الضالة والمذاهب والاتجاهات المنحرفة الهدامة على المسلمين وعلى البشرية أجمع، ولأن المسلم، يجب أن يكون على جانب كبير من الإدراك واليقظة والاهتمام بأمر دينه وأمته، وعلى علم وبصيرة بما يدور حوله من الآراء والمناهج والاتجاهات الضالة التي تعصف بالمسلمين وبالبشرية جمعاء، ليكون خير داع إلى الهدى وخير منقذ من الضلالة. فالصراع بين الحق والباطل سنة الله في خلقه، والحق لا ينصره إلا من يعرف الخير ويعمل به ويدعو إليه، ويعرف الشر ويجتنبه ويحذر منه\" (1) . وقد اشتمل هذا البحث على مقدمة وتمهيد وخمسة فصول وخاتمة. أما المقدمة فتشتمل على: - أهمية البحث. - خطة البحث. - منهج البحث. أما التمهيد فيشتمل على: - تعريف علم الأديان ومسمياته. الفصل الأول: - مشروعية دراسة علم الأديان، ويشتمل على ثلاثة مباحث: - المبحث الأول: - الأدلة من القرآن الكريم. - المبحث الثاني: - الأدلة من السنة النبوية. - المبحث الثالث: - الأدلة من آثار الصحابة والسلف.",
    "foot_note":"1. الموجز في الأديان والمذاهب المعاصرة، تأليف ناصر القفاري وناصر العقل ص 6، دار الصميعي، الرياض، الطبعة الأولى، بتصرف يسير. وانظر مقدمات في علم المقالات تأليف د. محمد خليفة التميمي ص 26 - 31، أضواء السلف الرياض - الطبعة الأولى.",
    "book_id":"69"
  },
  {
    "serial_number":"285030",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":3,
    "volume_number":1,
    "text":"الفصل الثاني: - فوائد دراسة علم الأديان، ويشتمل على خمسة مباحث: - المبحث الأول: - حفظ الإسلام. - المبحث الثاني: - دعوة الكفار إلى الإسلام. - المبحث الثالث: - الرد على شبهات أهل الديانات. - المبحث الرابع: - العبرة والعظة. - المبحث الخامس: - استبانة سبيل المجرمين. الفصل الثالث: الضوابط الشرعية لدراسة علم الأديان، ويشتمل على سبعة ضوابط: - الضابط الأول: الإخلاص. - الضابط الثاني: العلم. - الضابط الثالث: تقديم المصلحة والمفسدة في دراسة علم الأديان. - الضابط الرابع: الرجوع إلى المصادر. - الضابط الخامس: التجرد من الهوى. - الضابط السادس: العدل والإنصاف. - الضابط السابع: الالتزام بالمصطلحات الشرعية. الفصل الرابع: مناهج الباحثين في دراسة علم الأديان بصفة عامة، ويشتمل على أربعة مباحث: - المبحث الأول: التعريف بهذا العلم. - المبحث الثاني: أهمية مناهج البحث. - المبحث الثالث: علاقة هذا العلم بعلم الأديان. - المبحث الرابع: مناهج البحث ويشتمل على ستة مطالب: المطلب الأول: المنهج التاريخي الوصفي. المطلب الثاني: المنهج التحليلي النقدي. المطلب الثالث: المنهج المقارن. المطلب الرابع: المنهج العلمي التجريبي. المطلب الخامس: منهج الجدال والرد والمحاجة. المطلب السادس: المنهج العلمي الشامل في دراسة الأديان.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285031",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":4,
    "volume_number":1,
    "text":"الفصل الخامس: منهج أهل السنة في دراسة الأديان، ويشتمل على ثلاثة مباحث: - المبحث الأول: منهج التلقي ومصادر الاستدلال. - المبحث الثاني: منهج الاستدلال. - المبحث الثالث: منهج العرض والرد. الفصل السادس: مناهج المخالفين لأهل السنة في دراسة علم الأديان ونقدها، ويشتمل على أربعة مباحث: - المبحث الأول: مناهج أهل الكلام في دراسة علم الأديان. - المبحث الثاني: الأسس المنهجية لدراسة الأديان عند أهل الكلام ونقدها. - المبحث الثالث: مناهج الكفار في دراسة علم الأديان - المبحث الرابع: مناهج المستشرفين في دراسة علم الأديان والملل وتقويمه وفيه ثلاثة مطالب: المطلب الأول: المسلمات التي انطلق منها المستشرقون. المطلب الثاني: منهج المستشرقين في دراسة الأديان. المطلب الثالث: أساليب المستشرقين في الدراسات الإسلامية. أما الخاتمة فقد ذكرت فيها أهم النتائج التي توصلت إليها. أما منهجي في البحث فهو كالتالي: 1 - عزو الآيات إلى أماكنها في القرآن، وذلك ببيان اسم السورة ورقم الآية ووضعها بين قوسين {}. 2 - تخريج الأحاديث والآثار وذلك بذكر المصدر ورقم الحديث إن وجد ورقم الجزء والصفحة. 3 - عمل فهرس للمراجع. 4 - عمل فهرس للموضوعات. أسأل الله سبحانه وتعالى أن يجعل هذا العمل خالصًا لوجهه الكريم. والله أعلم وصلى الله على نبينا محمد وعلى آله وصحبه وسلم. د: عبد المجيد بن محمد الوعلان awalaan@gmail.com",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285032",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":5,
    "volume_number":1,
    "text":" التمهيد  تعريف علم الأديان ومسمياته: هو العلم الذي يعني بمقالات الأمم الكافرة؛ فالمقالات عموماً تنقسم إلى قسمين: القسم الأول: المقالات الواقعة في هذه الأمة. القسم الثاني: مقالات الأمم الأخرى. ولذلك لما ألف أبو الحسن الأشعري في علم المقالات، أَلفَ كتابا سماه \"مقالات الإسلاميين\" وكتابا آخر سماه \"مقالات غير الإسلاميين\". ولكن الذي استقر عليه الحال في الوقت الحاضر هو الفصل بين هذين النوعين من المقالات، بتسمية مقالات غير الإسلاميين بـ \"علم الأديان\"، وتسمية مقالات الإسلاميين بـ \"علم الفرق\". ومن المعلوم أنه في العصر الراهن شققت بعض العلوم وفرع عنها عدة علوم، ومن ذلك علم المقالات الذي تفرع إلى العلوم التالية: 1 - علم الفرق. 2 - علم الأديان. 3 - علم المذاهب المعاصرة (1) . وعلم الأديان له عدة مصطلحات منها: تاريخ الأديان ومقارنة الأديان، والمقالات، والملل والنحل. ويذكر الباحثون (2) بأن علم الأديان يشتمل على ثلاثة مباحث:  المبحث الأول: تاريخ الأديان: وهي تلك الدراسة الوصفية، التحليلية الخاصة بملةٍ ملة، وهي التي يمكن أن تعرفنا نشأة ديانة ما، وحياة مؤسسها … وأسباب انتشارها وألوان تطورها.  المبحث الثاني: الأسس والمبادئ: ويدرس في هذا المبحث العلاقات بين الأسس التي تستند إليها الأديان المختلفة، من عقيدة وعبادة وشريعة وأخلاق ومعاملات، والغايات التي تهدف إليها، ومن أهم الموضوعات في هذا المبحث موضوع الألوهية.  المبحث الثالث: مقارنة الأديان: ويدرس فيه خصائص ومميزات كل دين، ويوازن بينها وبين خصائص ومميزات الأديان الأخرى (3) .",
    "foot_note":"1. مقدمات في علم المقالات ص 13 - 14. \n2. علم الملل ومناهج العلماء فيه، تأليف أحمد جود ص 11 - 12، دار الفضيلة، الرياض الطبعة الأولى. \n3. الأديان دراسة تاريخية مقارنة -القسم الأول، د. رشدي عليان وسعدون الساموك، ص 18، وزارة التعليم العالي والبحث العلمي، جامعة بغداد.",
    "book_id":"69"
  },
  {
    "serial_number":"285033",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":6,
    "volume_number":1,
    "text":" الفصل الأول: مشروعية دراسة علم الأديان المتأمل في نصوص القرآن الكريم والسنة النبوية يجد أن هناك عناية بجانب علم الأديان، فقد أوردت النصوص عددًا من الأديان وذكرت جانبًا من عقائدها، والتي كان بعضها على الحق ثم حرفت، فذكر على سبيل المثال اليهودية، والنصرانية، والصابئة، وعبادة الأصنام وغيرها. ثم بينت النصوص مخالفتها للحق وزيفها وحذرت منها وذمت أصحابها وسنذكر إن شاء الله تعالى الأدلة على ذلك.  المبحث الأول: الأدلة من القرآن الكريم: لقد جاء ذكر الأديان في القرآن بشكل واضح وكبير وقد جمعت بعض الآيات ستة من الأديان وهي قوله تعالى: {إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا وَالصَّابِئِينَ وَالنَّصَارَى وَالْمَجُوسَ وَالَّذِينَ أَشْرَكُوا إِنَّ اللَّهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ (17)} [الحج: 17] (1) . ومن الآيات التي جاء فيها ذكر الديانات وشيء من عقائدها، والرد عليها قوله تعالى: {مَا كَانَ إِبْرَاهِيمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلَكِنْ كَانَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ (67)} [آل عمران: 67] (2) . وقوله تعالى: {وَقَفَّيْنَا عَلَى آثَارِهِمْ بِعِيسَى ابْنِ مَرْيَمَ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ وَآتَيْنَاهُ الْإِنْجِيلَ فِيهِ هُدًى وَنُورٌ وَمُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ التَّوْرَاةِ وَهُدًى وَمَوْعِظَةً لِلْمُتَّقِينَ (46)} [المائدة: 46] (3) . وقوله تعالى: {وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَكِنْ شُبِّهَ لَهُمْ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِنْهُ مَا لَهُمْ بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ وَمَا قَتَلُوهُ يَقِينًا (157) بَلْ رَفَعَهُ اللَّهُ إِلَيْهِ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا (158)} [النساء: 157 - 158] (4) . إلى غير ذلك من الآيات.",
    "foot_note":"1. سورة الحج الآية: 17. \n2. سورة آل عمران الآية: 67. \n3. سورة المائدة الآية: 46. \n4. سورة النساء الآيات 157 - 158.",
    "book_id":"69"
  },
  {
    "serial_number":"285034",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":7,
    "volume_number":1,
    "text":" المبحث الثاني: - الأدلة من السنة: السنة هي الوحي الثاني وقد جاء فيها من ذكر الأديان مثل ما جاء في القرآن الكريم حتى أن النبي صلى الله عليه وسلم لا يزال يذكر هذه الديانات ويحذر منها حتى عند وفاته حيث يقول صلى الله عليه وسلم: \" لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد\" (1) . وقد عرف النبي صلى الله عليه وسلم أمته \"الأنبياء وأممهم، وما جرى لهم وما جرى عليه معهم، حتى كأنهم كانوا بينهم\" (2) . ولذلك تجد في كتب السنة كتباً وأبواباً تتحدث عن الأنبياء، مثل كتاب أحاديث الأنبياء في صحيح البخاري. ومن الأدلة على ذلك قوله صلى الله عليه وسلم: \"بلغوا عني ولو آية وحدثوا عن بني إسرائيل ولا حرج، ومن كذب علي متعمداً فليتبوأ مقعده من النار\" (3) ، وقوله صلى الله عليه وسلم: تفرقت اليهود على إحدى وسبعين فرقة أو اثنتين وسبعين فرقة، والنصارى مثل ذلك، وستفترق أمتي على ثلاث وسبعين فرقة\" (4) ، إلى غير ذلك من الأحاديث.  المبحث الثالث: الأدلة من آثار الصحابة والسلف: الصحابة هم الجيل الذي اختارهم الله لصحبه نبيه صلى الله عليه وسلم، ولذلك فهم أعلم الناس بمراد الله ومراد رسوله صلى الله عليه وسلم وهم خير القرون بشهادة النبي صلى الله عليه وسلم لهم حيث قال: \" خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم\" (5) . ومواقف الصحابة في ذلك كثيرة منها: محاورة جعفر بن أبي طالب مع النجاشي وفد قريش (6) . وجدال أبي بكر رضي الله عنه مع اليهود (7) ، وجدال عمر رضي الله عنه مع اليهود (8) . تلك بعض الإشارات عما حواه كتاب الله عز وجل وسنة نبيه صلى الله عليه وسلم وهدي أصحابه رضي الله عنهم من ذكر الأديان الباطلة ومجادلة أهلها مما يؤكد ضرورة الاهتمام بتلك الأديان بقصد بيان زيغها وفسادها والرد عليها والتحذير منها ومن الوقوع فيها.",
    "foot_note":"1. رواه مسلم: كتاب المساجد، باب النهي عن بناء المساجد على القبور، واتخاذ الصور فيها، والنهي عن اتخاذ القبور مساجد ص 214، رقم الحديث 529. \n2. اعلام الموقعين لابن القيم 4\/ 285 - 286 - الكتب العلمية، بيروت، الطبعة الأولى. \n3. أخرجه البخاري: كتاب أحاديث الأنبياء، باب ما ذكر عن بني إسرائيل رقم الحديث 3461. \n4. رواه أبو داود رقم 4583. والترمذي الحديث رقم 2778. \n5. أخرجه البخاري: كتاب الشهادات، باب لا يشهد على شهادة جور إذا شهد ص 502، رقم الحديث 2652. \n6. السيرة النبوية لأبي محمد عبد الملك بن هشام مراجعة وتعليق محمد محي الدين عبد الحميد، ص 2\/ 187 - 188 مكتبة التراث، القاهرة. \n7. المصدر السابق ص 2\/ 187 - 188. \n8. جامع البيان عن تأويل آي القرآن، لأبي جعفر محمد بن جرير الطبري، 1\/ 433 - 434، مطبعة مصطفى البابي الحلبي وأولاده، الطبعة الثالثة.",
    "book_id":"69"
  },
  {
    "serial_number":"285035",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":8,
    "volume_number":1,
    "text":" الفصل الثاني: فوائد دراسة علم الأديان  المبحث الأول: حفظ الإسلام: \"لما كان محمد صلى الله عليه وسلم خاتم النبيين، ولم يكن بعده رسول، لم يزل سبحانه وتعالى يقيم لتجديد الدين من الأسباب ما يكون مقتضياً لظهوره، كما وعد به في الكتاب، فيظهر به محاسن الإيمان ومجامعه، ويعرف به مساوئ الكفر ومفاسده. ومن أعظم أسباب ظهور الإيمان والدين، وبيان حقيقة أنباء المرسلين، ظهور المعارضين له من أهل الإفك المبين كما قال تعالى: {وَكَذَلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيَاطِينَ الْإِنْسِ وَالْجِنِّ يُوحِي بَعْضُهُمْ إِلَى بَعْضٍ زُخْرُفَ الْقَوْلِ غُرُورًا وَلَوْ شَاءَ رَبُّكَ مَا فَعَلُوهُ فَذَرْهُمْ وَمَا يَفْتَرُونَ (112) وَلِتَصْغَى إِلَيْهِ أَفْئِدَةُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَلِيَرْضَوْهُ وَلِيَقْتَرِفُوا مَا هُمْ مُقْتَرِفُونَ (113) أَفَغَيْرَ اللَّهِ أَبْتَغِي حَكَمًا وَهُوَ الَّذِي أَنْزَلَ إِلَيْكُمُ الْكِتَابَ مُفَصَّلًا وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْلَمُونَ أَنَّهُ مُنَزَّلٌ مِنْ رَبِّكَ بِالْحَقِّ فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ (114) وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَعَدْلًا لَا مُبَدِّلَ لِكَلِمَاتِهِ وَهُوَ السَّمِيعُ الْعَلِيمُ (115)} [الأنعام: 112 - 115]. (1) وذلك أن الحق - إذا جحد وعورض بالشبهات- أقام الله تعالى- له مما يحق به الحق ويبطل به الباطل من الآيات البينات بما يظهره من أدلة الحق وبراهينه الواضحة، وفساد ما عارضه من الحجج الداحضة\" (2) .  المبحث الثاني: دعوة الكفار إلى الإسلام: \"إن الهدف الأول والأساس من دراسة الأديان عند المسلمين هو دعوة أهله إلى الإسلام وذلك انطلاقاً من الإيمان بوجوب الدعوة، فقد ورد في الأمر بالدعوة نصوص كثيرة منها: قوله تعالى {ادْعُ إِلَى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَجَادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ} [النحل: 125] (3) . وقال تعالى: {(14) فَلِذَلِكَ فَادْعُ وَاسْتَقِمْ كَمَا أُمِرْتَ} [الشورى: 15] (4) .",
    "foot_note":"1. سورة الأنعام الآيات: 112 - 115. \n2. الجواب الصحيح لمن بدل دين المسيح لابن تيمية تحقيق د. علي الألمعي ود. عبد العزيز العسكر ود. حمدان الحمدان ص 1\/ 60 - 61، دار الفضيلة، الرياض، الطبعة الأولى. \n3. سورة النحل الآية: 125. \n4. سورة الشورى الآية: 15.",
    "book_id":"69"
  },
  {
    "serial_number":"285036",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":9,
    "volume_number":1,
    "text":"وقد قام النبي صلى الله عليه وسلم بالدعوة إلى الله امتثالاً لأمر ربه فدعا جميع أهل الأديان إلى الإسلام، فأرسل رسله إلى جميع ملوك الأرض، وحاور جميع الأصناف المخالفين للحق، وخاصة أهل الكتاب قال تعالى: {قُلْ يَاأَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ (64)} [آل عمران: 64] (1) \" (2) .  المبحث الثالث: الرد على شبهات أهل الأديان: في تاريخ الأديان والملل لم يتعرض دين ولا ملة مثلما تعرض له دين الإسلام من خصومه من محاولات لتشويهه وتحريفه، وإثارة الشبهات حوله، فقد تعرضت أصوله وفروعه هجوماً شرساً منذ أن وقف النبي صلى الله عليه وسلم يصدع بدعوة الحق مبلغاً رسالة ربه، ومنادياً للناس أن يدخلوا دين الله الحق، وأن ينبذوا ما سواه من الأديان والملل. من ذلك الوقت أعلن أهل الباطل حربهم على الإسلام، وكانت إثارة الشبهات، والشكوك أهم الأسباب، وأنجع الوسائل عندهم، وكان القرآن يتصدى لشبهاتهم، ويفندها بالحجج، والبراهين القاطعة، قال تعالى: {وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا (33)} [الفرقان: 33] (3) . فالله يخبر رسوله بأنهم لا يأتون بحجة، أو شبهة، ولا يقولون قولا يعترضون به الحق، إلا أجبناهم بما هو الحق في نفس الأمر، وأبين، وأوضح، وأفصح من مقالاتهم (4) . ولما قام أعداء الدين بإثارة الشبهات، والشكوك بين المسلمين، وبدأوا يبتدعون أموراً لا أصل لها في الدين، ويفرقون بين المسلمين، قام علماء المسلمين بحق الله عليهم فكشفوا صنوف المؤامرات التي كانت ضد الإسلام، فردوا الشبهات التي كان أهل الأديان يبثونها بين المسلمين في محاولاتهم اليائسة لوقف زحف الإسلام، وبذلك انتصر الإسلام في ميدان الفكر كانتصاره في ميدان الجهاد بالسنان. إن كشف زيف الباطل، وبيان الشبهات التي يختلقها أهل الباطل، وردها رداً محكماً أصل عظيم من أصول الإسلام، وباب من أبواب الجهاد، قال شيخ الإسلام ابن تيمية: \" فالراد على أهل البدع مجاهد\" (5) . ونقل عن يحيى بن يحيى أنه قال: \"الذب عن السنة أفضل الجهاد\" (6) . وقال الشيخ بكر أبو زيد: \" فالرد على أهل الباطل، ومجادلتهم ومناظرتهم حتى تنقطع شبهتهم، ويزول عن المسلمين ضررهم مرتبة من منازل الجهاد باللسان، والقلم أحد اللسانين\" (7) . وبهذا تتم حماية الدين وحراسته (8) .",
    "foot_note":"1. سورة آل عمران الآية: 64. \n2. انظر: علم الملل ومناهج العلماء فيه ص 157. \n3. سورة الفرقان الآية: 33. \n4. انظر: تفسير ابن كثير 3\/ 298، دار المفيد، بيروت الطبعة الأولى. \n5. انظر: مجموع الفتاوى لشيخ الإسلام ابن تيمية، جمع وترتيب عبدالرحمن بن قاسم، ص 4\/ 13، دار عالم الكتب، الرياض، 1412. \n6. المصدر السابق 4\/ 13. \n7. الرد على المخالف من أصول الإسلام بكر أبو زيد، ص 29، دار الهجرة، الطبعة الثانية. \n8. علم الملل ومناهج العلماء فيه ص 161 - 164.",
    "book_id":"69"
  },
  {
    "serial_number":"285037",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":10,
    "volume_number":1,
    "text":" المبحث الرابع: العبرة والعظة: لقد تحدث القرآن كثيراً عن قصص السابقين، فقال تعالى: {كَذَلِكَ نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ مَا قَدْ سَبَقَ وَقَدْ آتَيْنَاكَ مِنْ لَدُنَّا ذِكْرًا (99)} [طه: 99] (1) . وقال عقب حديثه عن الأمم السابقين: {تِلْكَ الْقُرَى نَقُصُّ عَلَيْكَ مِنْ أَنْبَائِهَا وَلَقَدْ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ} [الأعراف: 101] (2) . وأمر الله -سبحانه- نبيه محمداً صلى الله عليه وسلم أن يقص على الناس {فَاقْصُصِ الْقَصَصَ لَعَلَّهُمْ يَتَفَكَّرُونَ (176) سَاءَ مَثَلًا الْقَوْمُ الَّذِينَ كَذَّبُوا بِآيَاتِنَا وَأَنْفُسَهُمْ كَانُوا يَظْلِمُونَ} [الأعراف: 176 - 177] (3) . ووصف سبحانه وتعالى تلك القصص الواردة في القرآن بأنه قصص حق فقال تعالى: {إِنَّ هَذَا لَهُوَ الْقَصَصُ الْحَقُّ وَمَا مِنْ إِلَهٍ إِلَّا اللَّهُ} [آل عمران: 62] (4) . وذلك لمطابقتها الواقع، ووصف سبحانه تلك القصص بأنها أحسن القصص، فقال: {إِنَّا أَنْزَلْنَاهُ قُرْآنًا عَرَبِيًّا لَعَلَّكُمْ تَعْقِلُونَ (2) نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ بِمَا أَوْحَيْنَا إِلَيْكَ هَذَا الْقُرْآنَ وَإِنْ كُنْتَ مِنْ قَبْلِهِ لَمِنَ الْغَافِلِينَ (3)} [يوسف: 2 - 3] (5) . وفي الآية إشارة تدل بأنه يجب أن نكتفي من القصص السابقين ما ورد في القرآن، لأنه كاف عن كل ما سواه من الكتب (6) . ولأن ما عداه إما كتب غير موثوقة، أو مشكوك فيها، كما أن أخبار السابقين صارت بالنسبة لنا من أمر الغيب الذي لا يمكن الوصول إليه إلا عن طريق مصدر موثوق، قال تعالى: {ذَلِكَ مِنْ أَنْبَاءِ الْغَيْبِ نُوحِيهِ إِلَيْكَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يُلْقُونَ أَقْلَامَهُمْ أَيُّهُمْ يَكْفُلُ مَرْيَمَ وَمَا كُنْتَ لَدَيْهِمْ إِذْ يَخْتَصِمُونَ (44)} [آل عمران: 44] (7) .",
    "foot_note":"1. سورة طه الآية: 99. \n2. سورة الأعراف الآية: 101. \n3. سورة الأعراف الآية: 176 - 177. \n4. سورة آل عمران الآية: 62. \n5. سورة يوسف الآية: 2. \n6. تفسير ابن كثير 2\/ 425. \n7. سورة آل عمران الآية: 44.",
    "book_id":"69"
  },
  {
    "serial_number":"285038",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":11,
    "volume_number":1,
    "text":"فالقصص بما تحوي من الحوادث المتشابهة تساعد الإنسان على معرفة السنن الربانية التي لا تتخلف - إلا أن يشاء الله- وذلك بقياس الحاضر على الماضي، قال ابن تيمية رحمه الله: \" ومن هذا الباب صارت قصص المتقدمين عبرة لنا، ولولا القياس، واطراد فعله وسنته لم يصح الاعتبار بها، لأن الاعتبار إنما يكون إذا كان حكم الشيء حكم نظيره كالأمثال المضروبة في القرآن\" (1) .  المبحث الخامس: استبانة سبيل المجرمين: من أهم الأهداف، وأجل الغايات التي تحصل من دراسة الأديان معرفة سبيل المجرمين، قال تعالى عقب حديثه عن الرسل والرسالات: {(54) وَكَذَلِكَ نُفَصِّلُ الْآيَاتِ وَلِتَسْتَبِينَ سَبِيلُ الْمُجْرِمِينَ} [الأنعام: 55] (2) ، والله قد بين في كتابه سبيل المؤمنين مفصلة، وسبيل المجرمين مفصلة، وعاقبة هؤلاء مفصلة، وعاقبة هؤلاء مفصلة، وأعمال هؤلاء، وأعمال هؤلاء، وأولياء هؤلاء، وأولياء هؤلاء، وخذلانه لهؤلاء، وتوفيقه لهؤلاء، والأسباب التي وفق بها هؤلاء، والأسباب التي خذل بها هؤلاء … والعالمون بالله وكتابه، ودينه، عرفوا سبيل المؤمنين معرفة تفصيلية، وسبيل المجرمين معرفة تفصيلية، فاستبانت لهم السبيلان، كما يستبين للسالك الطريق الموصل إلى مقصوده، والطريق الموصل إلى الهلكة، فهؤلاء أعلم الخلق، وأنفعهم للناس، وأنصحهم لهم، وهم الأدلاء الهداة، وبذلك برز الصحابة على جميع من أتى بعدهم إلى يوم القيامة، فإنهم نشأوا في سبيل الضلال، والكفر، والشرك، والسبل الموصلة إلى الهلاك، وعرفوها مفصلة، ثم جاءهم الرسول، فأخرجهم من تلك الظلمات إلى سبيل الهدى، وصراط الله المستقيم (3) . \"والله -سبحانه- يحب أن تُعرف سبيل أعدائه لتُجتنب، وتُبغض، كما يحب أن تُعرف سبل أوليائه، لتحب وتسلك، وفي هذه المعرفة من الفوائد، والأسرار ما لا يعلمه إلا الله .. \" (4) . إن تميز أهل الحق عن أهل الباطل من أهل الأهواء والبدع، ومن أهل الأديان والنحل الباطلة، قضية في غاية الأهمية، فقد حرص السلف -رضوان الله عليهم- ذلك، وما تسمية أهل الحق بألقاب \"أهل السنة والجماعة\" و\"السلف\" و\"أهل الحديث\" و\"أهل الأثر\" إلا من باب التمايز، وتبين سبيل الحق عن سبل أهل الضلال، وإذا كان التمايز عن أهل البدع الذين هم من أهل القبلة مطلوباً شرعاً فإن غيرهم من أهل الأديان والنحل الباطلة من باب الأولى (5) .",
    "foot_note":"1. جامع الرسائل، لابن تيمية، تحقيق محمد رشاد سالم ص 55، مطبعة المدني، القاهرة، الطبعة الأولى. وانظر: علم الملل ومناهج العلماء فيها 167 - 169. \n2. سورة الأنعام الآية: 55. \n3. انظر: الفوائد لان القيم الجوزية، تحقيق محمد عثمان الخشب ص 161، دار الكتاب العربي - بيروت، ط الرابعة 1410 هـ 1990 م. \n4. المصدر السابق ص 164. \n5. انظر: علم الملل ومناهج العلماء فيه ص 165 - 166.",
    "book_id":"69"
  },
  {
    "serial_number":"285039",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":12,
    "volume_number":1,
    "text":" الفصل الثالث: الضوابط الشرعية لدراسة علم الأديان إن لهذا العلم ضوابط ينبغي الالتزام بها، وهذه الضوابط ليست خاصة به، بل هي عامة في كل أمر يراد بحثه، فمن هذه الضوابط:  الضابط الأول: الإخلاص: وهو أن يبتغي الإنسان بعلمه وعمله وجه الله تعالى، قال تعالى: {فَمَنْ كَانَ يَرْجُو لِقَاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا (110)} [الكهف: 110] فالعمل المتقبل من العبد ما كان موافقاً للشرع، مراداً به وجه الله وحده (1) . وفي الحديث الصحيح عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى\" (2) . فمدار صحة الأعمال أو فسادها النية. والقائم بالدفاع عن الحق، والدعوة إليه، والمجادلة من أجله أشد حاجة إلى الإخلاص من غيره. لذا فإن توفر سلامة النية، والقصد شرط أساسي لمن يشتغل بدراسة الأديان، فلا بد أن يكون قصده في هذا حراسة الدين، والذب عنه، ودلالة الناس على الهدى، وتثبيتهم عليه (3) ، وألا يكون له أي غرض آخر. قال إمام الحرمين الجويني موضحاً آداب الجدل: \"فأول شيء فيه مما على الناظر أن يقصد التقرب إلى الله -سبحانه- وطلب مرضاته في امتثال أمره سبحانه فيما أمر به ويبالغ قدر طاقته في البيان والكشف، عن تحقيق الحق وتمحيق الباطل، ويتقي الله أن يقصد بنظره المباهاة وطلب الجاه والتكسب والممارة، والمحك، والرياء، ويحذر أليم عقاب الله -سبحانه- ولا يكن قصده الظفر بالخصم، والسرور بالغلبة، والقهر، فإنه من دأب الأنعام الفحولة، كالكباش، والديكة\" (4) .",
    "foot_note":"1. انظر: تفسير ابن كثير 3\/ 103. \n2. أخرجه البخاري، كتاب بدء الوحي، باب كيف كان بدء الوحي إلى رسول الله صلى الله عليه وسلم ص 21، رقم الحديث 1. \n3. الرد على المخالف من أصول الإسلام بكر أبو زيد ص 54. \n4. الكافية في الجدل، لإمام الحرمين الجويني، تحقيق د. فوقية حسين محمود ص 529، طبع بمطبعة عيسى البابي، القاهرة 1399 هـ\/ 1979 م. انظر: علم الملل ومناهج العلماء فيه ص 237 - 239.",
    "book_id":"69"
  },
  {
    "serial_number":"285040",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":13,
    "volume_number":1,
    "text":" الضابط الثاني: العلم: العلم من الأمور الضرورية والضوابط المهمة لمن يشتغل بعلم الأديان، وذلك أن المشتغل بدراسة الأديان إذا لم يكن مؤهلاً لها كان ضرره أكثر من نفعه. فالعلم من أهم الشروط التي يجب توفرها على من يقوم بوظيفة الدفاع عن الدين، وذلك أن العلم قبل العمل، قال تعالى: {فَاعْلَمْ أَنَّهُ لَا إِلَهَ إِلَّا اللَّهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَاللَّهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوَاكُمْ (19)} [محمد: 19] (1) ، وقد تنبه الإمام البخاري رحمه الله لهذا، فبوب لهذه الآية بقوله: باب العلم قبل القول والعمل (2) . فالعلم مقدم على القول والعمل، لأنه شرط في صحة القول والعمل، فلا يعتبران إلا به (3) . ومن الأدلة الدالة على ذم القول قبل العلم قوله تعالى: {وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ (8)} [الحج: 8] (4) ، فالآية دلت على ذم المجادل بغير علم، وقال تعالى في ذم أهل الكتاب الذين جادلوا بغير علم: {يَاأَهْلَ الْكِتَابِ لِمَ تُحَاجُّونَ فِي إِبْرَاهِيمَ وَمَا أُنْزِلَتِ التَّوْرَاةُ وَالْإِنْجِيلُ إِلَّا مِنْ بَعْدِهِ أَفَلَا تَعْقِلُونَ (65) هَاأَنْتُمْ هَؤُلَاءِ حَاجَجْتُمْ فِيمَا لَكُمْ بِهِ عِلْمٌ فَلِمَ تُحَاجُّونَ فِيمَا لَيْسَ لَكُمْ بِهِ عِلْمٌ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ (66)} [آل عمران: 65 - 66] (5) . بل نجد أن شيخ الإسلام ابن تيمية يرى أن من يحكم في الملل، والأديان بغير علم، ولا عدل، أولى بالنار، ممن يقضي بين الناس، في الأموال والدماء والأعراض، بغير علم ولا عدل، فيقول: \"ولما كان أتباع الأنبياء هم أهل العلم والعدل، كان كلام أهل الإسلام والسنة مع الكفر وأهل البدع بالعلم والعدل، لا بالظن وما تهوى الأنفس، ولهذا قال النبي صلى الله عليه وسلم: (القضاة ثلاثة: قاضيان في النار، وقاض في الجنة، رجل علم الحق وقضى به فهو في الجنة، ورجل علم الحق وقضى خلافه فهو في النار، ورجل قضى للناس على جهل فهو في النار) (6) .",
    "foot_note":"1. سورة محمد الآية: 19. \n2. صحيح البخاري كتاب العلم، باب العلم قبل القول والعمل ص 39. \n3. انظر: فتح الباري شرح صحيح البخاري، للحافظ ابن حجر العسقلاني، ترقيم محمد فؤاد عبدالباقي، ص 2\/ 193، دار الريان للتراث، الطبعة الثانية. \n4. سورة الحج الآية: 8. \n5. سورة آل عمران الآية: 65 - 66. \n6. أخرجه أبو داود الحديث رقم 3573، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419.",
    "book_id":"69"
  },
  {
    "serial_number":"285041",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":14,
    "volume_number":1,
    "text":"فإذا كان من يقضي بين الناس في الأموال، والدماء، والأعراض -إذا لم يكن عالماً عادلاً - كان في النار، فكيف بمن يحكم في الملل، والأديان، وأصول الإيمان، والمعارف الإلهية، والمعالم الكلية، بلا علم ولا عدل\" (1) . والعلم يشمل في مجال دراسة الأديان العلم بالإسلام من مصادره الأساسية من الكتاب والسنة، وما يفسرهما من أقوال السلف، أو يساعد على فهمهما من علوم الآلة كاللغة العربية، كما يشمل العلم بشبهات أهل الأديان والملل، وطرق الرد عليها (2) .  الضابط الثالث: تقدير المصلحة والمفسدة في دراسة الأديان: فدراسة الأديان، والملل الكفرية، والاشتغال بها لا تخلو من مخاطر ومزالق قد تضر المشتغل بها، كأن تترك شبهات أهل تلك الأديان في قلبه شيئاً، وقد يلحق ضرراً منها بالحق الذي معه، وذلك فيما إذا ضعف عن رد شبهات الخصوم، كما يمكن أن تؤدي دراستها إلى نشرها، وترويج مبادئها، لاسيما إذا لم يحكم الرد عليها. لهذا ينبغي قبل التعرض إلى دراسة أي دين أو ملة أن يقدر في هذه الدراسة المصلحة والمفسدة، والقول المعتمد في تقدير المصلحة والمفسدة: قول العلماء المؤتمنين على دينهم (3) .  الضابط الرابع: الرجوع إلى المصادر: الرجوع إلى مصادر العقائد المبحوثة، ونقل النصوص منها بألفاظها، والدقة في نسبة الآراء إلى أهلها. أما نسبة الأقوال إلى الناس من غير طريق صحيحة، أو من طريق مشكوك في صحتها، أو من طريق لا يعرف مدى التزامها بالصدق والعدل، فإن هذا من باب الظن الذي نهينا عن إتباعه، كما قال تعالى: {يَاأَيُّهَا الَّذِينَ آمَنُوا اجْتَنِبُوا كَثِيرًا مِنَ الظَّنِّ إِنَّ بَعْضَ الظَّنِّ إِثْمٌ} [الحجرات: 12] (4) وذم الله -تعالى- متبعي الظن والهوى فقال: {إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ} [النجم: 23] (5) . وقد التزم هذا علماء السلف، فهذا شيخ الإسلام ابن تيمية -رحمة الله تعالى- يقول في رده على النصارى: \"وأنا أذكر ما ذكروه بألفاظهم بأعيانها فصلاً فصلاً، واتبع كل فصل مما يناسبه من الجواب فرعاً وأصلاً، وعقداً وحلاً\" (6) .",
    "foot_note":"1. الجواب الصحيح 1\/ 107 - 108. \n2. انظر: علم الملل ومناهج العلماء فيه ص 240 - 242. \n3. انظر: علم الملل ومناهج العلماء فيه ص 236. \n4. سورة الحجرات: الآية 12. \n5. سورة النجم: الآية 23. \n6. الجواب الصحيح ص 1\/ 64.",
    "book_id":"69"
  },
  {
    "serial_number":"285042",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":15,
    "volume_number":1,
    "text":" الضابط الخامس: التجرد من الهوى: فإن الهوى يحمل على الاختلاف وقول الإفك، وقد قال الله تبارك وتعالى: {إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ} [النجم: 23] (1) . وقال تعالى: {الْهَوَى فَيُضِلَّكَ عَنْ سَبِيلِ اللَّهِ إِنَّ الَّذِينَ} [ص: 26] (2) .  الضابط السادس: العدل والإنصاف: العدل والإنصاف، والأمانة العلمية من أهم الخصال التي ينبغي أن يتحلى بها المختلفون والمختصمون، لئلا يقع ظلم على أي طرف منهما، قال تعالى: {يَاأَيُّهَا الَّذِينَ آمَنُوا كُونُوا قَوَّامِينَ بِالْقِسْطِ شُهَدَاءَ لِلَّهِ وَلَوْ عَلَى أَنْفُسِكُمْ أَوِ الْوَالِدَيْنِ وَالْأَقْرَبِينَ إِنْ يَكُنْ غَنِيًّا أَوْ فَقِيرًا فَاللَّهُ أَوْلَى بِهِمَا فَلَا تَتَّبِعُوا الْهَوَى أَنْ تَعْدِلُوا} [النساء: 135] (3) وقال تعالى: {وَإِذَا قُلْتُمْ فَاعْدِلُوا} [الأنعام: 152] (4) . وقال شيخ الإسلام ابن تيمية رحمه الله مبيناً وجوب العدل في كل حال، وتحريم الظلم مطلقاً: \"ومعلوم أنا إذا تكلمنا فيمن هو دون الصحابة، مثل الملوك المختلفين على الملك، والعلماء والمشايخ المختلفين في العلم والدين، وجب أن يكون الكلام بعلم وعدل، لا بجهل وظلم، فإن العدل واجب لكل أحد على كل أحد في كل حال، والظلم محرم مطلقاً، لا يباح قط بحال، قال تعالى: {وَلَا يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ عَلَى أَلَّا تَعْدِلُوا اعْدِلُوا هُوَ أَقْرَبُ لِلتَّقْوَى} [المائدة: 8] (5) ، وهذه الآية نزلت بسبب بغضهم للكفار، وهو بغض مأمور به، فإذا كان البغض الذي أمر الله به قد نهى صاحبه أن يظلم من أبغضه فكيف في بغض مسلم\" (6) .",
    "foot_note":"1. سورة النجم: الآية 23. \n2. مجلة الدراسات العربية، مناهج البحث في العقيدة، للشيخ يوسف السعيد، العدد السابع يناير 2002. \n3. سورة النساء الآية: 135. \n4. سورة الأنعام: آية 152. \n5. سورة المائدة الآية: 8. \n6. انظر: تفسير ابن كثير: 2\/ 12، وعلم الملل ومناهج العلماء فيه ص 244 - 246.",
    "book_id":"69"
  },
  {
    "serial_number":"285043",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":16,
    "volume_number":1,
    "text":" الضابط السابع: الالتزام بالمصطلحات الشرعية: قضية ضبط المصطلحات أمر نبه القرآن الكريم عليه المؤمنين في عهد نزول الوحي، فقد نهى الله المؤمنين أن يقولوا {رَاعِنَا} [البقرة: 104] وأمرهم أن يقولوا {انْظُرْنَا} [البقرة: 104] فقال تعالى: {يَاأَيُّهَا الَّذِينَ آمَنُوا لَا تَقُولُوا رَاعِنَا وَقُولُوا انْظُرْنَا} [البقرة: 104] (1) ، وذلك أن اليهود كانت تستخدم كلمة {رَاعِنَا} [البقرة: 104] لمعنى فاسد يحمل مسبة للنبي صلى الله عليه وسلم (2) . وأخبر النبي صلى الله عليه وسلم عن أناس يأتون في أخر الزمان يسمون الخمر بغير اسمها (3) . ويتلخص موقف أهل السنة من أمر المصطلحات التي تنسب إلى الأنبياء أو السلف أو إلى الخصوم بما يلي: 1 - التأكد من صحة نسبة المصطلح ومعناه: قال شيخ الإسلام: \" المنقول عن السلف والعلماء يحتاج إلى معرفة بثبوت لفظه، ومعرفة دلالته، كما يحتاج إلى ذلك المنقول عن الله ورسوله\" (4) والأمر في هذا أن العلم يحتاج إلى نقل مصدق، ونظر محقق (5) . 2 - اتباع المنقول من المصطلحات من الكتاب والسنة: وذلك أن اتباع ألفاظ الكتاب والسنة أولى من أي ألفاظ أخرى في تقرير أمور الدين لأن ذلك يؤدي إلى موافقة النصوص لفظاً ومعناً. 3 - فهم المصطلحات: وذلك بمعرفة دلالة المصطلح ومعرفة مراد المتكلم به، \"وذلك أن دلالة الخطاب إنما تكون بلغة المتكلم وعادته المعروفة في خطابه، لا بلغة وعادة واصطلاح أحدثه قوم آخرون بعد انقراض عصر الذين خاطبهم بلغته وعادته (6) كما قال تعالى: {وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ} [إبراهيم: 4] (7) .",
    "foot_note":"1. سورة البقرة: الآية 104. \n2. انظر: تفسير ابن كثير: 1\/ 374. \n3. سنن أبي داود: كتاب الأشربة، باب في الداذي - شراب الفاسقين- رقم 3688. \n4. مجموع الفتاوى: ص 1\/ 246. \n5. المرجع السابق: ص 1\/ 246. \n6. درء تعارض العقل والنقل: ص 7\/ 123، منهج ابن تيمية في الدعوة د. عبد الله بن رشيد الحوشاني، ص 1\/ 87 - 89، دار أشبيليا، الطبعة الأولى. \n7. سورة إبراهيم: الآية 4.",
    "book_id":"69"
  },
  {
    "serial_number":"285044",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":17,
    "volume_number":1,
    "text":" الفصل الرابع: مناهج الباحثين في دراسة علم الأديان بصفة عامة  المبحث الأول: التعريف بهذا العلم: المنهج لغة: مفعل من مادة نهج ينهج نهجاً، وهو الطريق المستقيم البين. قال الجوهري: \"نهج الطريق: أبانه، وأوضحه، ونهجه: سلكه، والمنهاج: الطريق الواضح\" (1) . وقال الفيروز آبادي: \"استنهج الطريق: صار نهجا، وفلان نهج سبيل فلان، أي: سلك مسلكه\" (2) . أما تعريفه الاصطلاحي: فقد عرف بتعريفات كثيرة منها: 1 - هو الطريق المؤدي إلى التعرف على الحقيقة في العلوم، بواسطة طائفة من القواعد العامة، والتي تهيمن على سير العقل، وتحدد عملياته، حتى يصل إلى نتيجة معلومة. 2 - هو القانون أو القاعدة التي تحكم أي محاولة للدراسة العلمية وفي أي مجال. 3 - القواعد العلمية التي يسلكها العقل في حركته للبحث عن الحقيقة في أي مجال من مجالات المعرفة. وهذه التعريفات واحدة في المعنى وإن اختلف التعبير عنها باللفظ، لأن مدارها على القواعد التي يسير عليها الباحث أو تسير الباحث عند إرادته بحث أي مسألة علمية. \"وكان العلماء المسلمون يعبرون عن المنهج بالأصول والقواعد\". (3) تعريف علم مناهج البحث في العقيدة: هو علم يعني بدراسة دلائل المسائل التي تذهب إليه كل فرقة من الفرق من حيث مصادرها، وطريقة الاستدلال بها، وموقفها من مصادر غيرها، وطريقتها في دراسة العقيدة (4) . ويقال عن تعريف دراسة علم الأديان ما قيل في تعريف علم مناهج البحث في العقيدة؛ لكن يختص بالأديان: هو علم يعني بدراسة دلائل المسائل التي يذهب إليها كل دين من الأديان من حيث مصادرها، وطريقة الاستدلال بها، وموقفها من مصادر غيرها، وطريقتها في دراسة الأديان.",
    "foot_note":"1. الصحاح في اللغة والعلوم للجوهري، تحقيق نديم مرعشلي، وأسامه مرعشلي، ص 1\/ 346، دار الحضارة العربية، بيروت. \n2. القاموس المحيط، محمد بن يعقوب الفيروزآبادي، ص 266، مؤسسة الرسالة، دار الريان للتراث، الطبعة الثانية. \n3. منهج كتابة التاريخ الإسلامي د. محمد بن صامل السلمي، ص 89، دار طيبة، الرياض، الطبعة الأولى. \n4. مناهج البحث في العقيدة للسعيد ص 263.",
    "book_id":"69"
  },
  {
    "serial_number":"285045",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":18,
    "volume_number":1,
    "text":" المبحث الثاني: أهمية مناهج البحث: إن لمناهج البحث في العلوم أهمية كبرى، إذ هي الطريق الموصل إلى أي علم، فالعلوم متعددة في موضوعاتها، وفي أهدافها وعناصرها، وفي مصادرها، وفي مناهج بحثها، والعلوم لا تعرف بموضوعاتها؛ لأن الموضوعات تساعد على البحث في هذا العلم، أو ذاك، ومثلها الأهداف، وإنما الذي يعين على ذلك هو المنهج الصحيح للبحث. فبقدر ما يكون منهج البحث قوياً قويماً قائماً على أساسا منهج سليم، ومناسب للموضوع الذي يبحث فيه، بقدر ما تكون النتائج المتوصل إليها معتبرة من الناحية العلمية (1) . فللمنهج أثره ودوره الكبير في أصالة الفكر وسلامة الأفكار والمعلومات والنظريات والمفاهيم المستنتجة، فما لم يكن منهج البحث والتفكير سليماً أو موافقاً لاتجاهه، فإن النتائج لن تكون صحيحة ومنسجمة. والباحث بدون منهج يقع في متاهات الفوضى، والاضطراب، والتناقض، وارتباك الآراء والنتائج، ويظل البحث مشوشا، وعقيما، وتكون حصيلته الاستنتاجية متناقضة، بلا وحدة في الاتجاه والنتيجة، فيخسر بذلك كثيراً من النتائج التي كان بإمكان البحث أن يعطيها لو أنه سار على أصول وأسس منهجية بحثية سليمة، واضحة الأهداف والمعالم، سليمة الرؤى (2) . ولذا أيضاً كان من الضروري أن يحدد لكل موضوع من موضوعات العلم والمعرفة البشرية منهجه المناسب له، وطريقته الخاصة، فيكون للعلوم الطبيعة منهج معين، وللتاريخ منهج معين ولكل من الفقه والعقائد والرياضيات والفلسفة .. إلخ منهجه الخاص به ضمن إطار منطقي علمي موحد. وذلك أن المنهج يحفظ للعلم نظامه واتساقه (3) ، فتقدم العلم وتأخره مرتهن بمسألة المنهج، يدور معها وجوداً وعدماً (4) . وإذا كان الأمر كذلك، فإنه - أيضاً- من الخطورة بمكان اتخاذ مناهج غير صحيحة، فاتخاذ هذه المناهج كغياب المنهج الصحيح، بل هو أشد خطراً، فإنه إذا اتخذت أمة من الأمم منهجاً، واعتقدته صحيحاً، والتزمت به، وكان هذا المنهج مضللا ولا يوصل إلى الحقيقة المنشودة والعلم المطلوب، فإن هذه الأمة تكون قد أوقعت نفسها في متاهات وأوهام كبيرة تنحرف بها عن المسار المنشود والغاية المطلوبة (5) . وأما أهميته في علم العقيدة والأديان على وجه الخصوص، فإنه ينبغي أن يعلم أن مسألة اختيار المنهج، وطريقة الفهم والتفسير العقائدي، ليست قضية ذاتية ترتبط بالميول الشخصية، أو بالتصورات والأهواء الذاتية، بل أن المنهج العقائدي يرتبط ارتباطاً وثيقاً بالأصول الشرعية، وبمفاهيم العقل الإيمانية التي تدور حول مركز الانطلاق، وقاعدة الفهم والتفكير (عقيدة التوحيد)، كما يرتبط بموضوع البحث وطبيعته.",
    "foot_note":"1. انظر: نظرة عامة في بعض مناهج البحث الإسلامية د\/ طه العلواني بحث منشور في مجلة أضواء الشريعة عدد (8) جمادي الآخرة عام 1397 ص 400. \n2. انظر: مناهج البحث في العقيدة الاسلامية في العصر الحاضر: دراسة لمناهج الفكر الاسلامي المعاصر والعناصر المنهجية في دراسة أصول الدين، تأليف عبدالرحمن بن زيد الزنيدي، ص 18، دار أشبيليا، 1416. \n3. انظر: منهج الاستدلال على مسائل الاعتقاد لعثمان بن على حسن، ص 1\/ 21، مكتبة الرشد، الرياض، الطبعة الثالثة. \n4. انظر: منهج البحث العلمي عند العرب د\/ جلال موسى ص 271، منهج الاستدلال على مسائل الاعتقاد 1\/ 21. \n5. مناهج البحث في العقيدة للسعيد ص 264 - 265.",
    "book_id":"69"
  },
  {
    "serial_number":"285046",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":19,
    "volume_number":1,
    "text":"والباحث في علم العقائد والديانات والملل والنحل والمذاهب يجد نفسه أمام زخم كثير من الآراء المتناقضة، التي سببها التنكب عن الطريق السوي والمنهج المستقيم، وهذا مصداق قول الله تعالى: {أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا (82)} [النساء: 82] (1) وقوله تعالى: {بَلْ كَذَّبُوا بِالْحَقِّ لَمَّا جَاءَهُمْ فَهُمْ فِي أَمْرٍ مَرِيجٍ (5)} [ق: 5] (2) . ولما كان الأمر كذلك، فإنه لا يجمل بالباحث الطالب للحق أن يبحث عن المسائل، ثم يحكم على أصحابها، دون أن يبحث في الدلائل التي نتجت عنها تلك المسائل، إذ لا يمكن معالجة الأخطاء في المسائل دون النظر في الأصول التي بنيت عليها، فالبحث فيها يبقى عقيماً عديم الجدوى. وبمنهج البحث العلمي في العقيدة يستطيع الباحث المسلم إزالة كثير من الإشكالات التي تواجهه اليوم، فإن كثيراً من العلوم والنظريات التي أطلق عليها اسم العلم، قد بحثت وفق مناهج بحث خاصة وصفت بالمنهجية أو الموضوعية والعلمية، واكتسبت ثقة جميع الباحثين في هذه المجالات، بل حازت إيمانهم، والنتائج التي توصل إليها، هي نتائج تصطدم -في أحيان كثيرة- بعقيدة المسلم، ولا تنسجم إلا نادراً مع فكرة المسلم الكلية عن الكون والإنسان والحياة، والاعتراض على ذلك يكاد يكون اعتراضاً على قضايا علمية مسلمة، لأنها بحثت وفق منهج بحث علمي، ومنهج البحث نفسه وراءه فلسفة قوم آخرين لا يستطيع المسلم قبولها كما هي، ولذلك كان لا بد من العمل على تلمس منهج للبحث في هذه العلوم يكون قانوناً يعصم الباحث المسلم فيها من الوقوع فيما يقع فيه غيره من أخطاء، ويساعده على الوصول إلى نتائج تنسجم وعقيدة المسلم ونظرته إلى الكون والإنسان والحياة (3) .",
    "foot_note":"1. سورة النساء: الآية 82. \n2. سورة ق: الآية 5. \n3. نظرة عامة في بعض مناهج البحث الإسلامية د\/ طه جابر العلواني، بحث منشور في مجلة: أضواء الشريعة، العدد 8 عام 1398 (401). وانظر: مناهج البحث في العقيدة ص 266 - 269.",
    "book_id":"69"
  },
  {
    "serial_number":"285047",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":20,
    "volume_number":1,
    "text":" المبحث الثالث: علاقة هذا العلم بعلم الأديان: إن لعلم مناهج البحث في العقيدة ارتباطاً وثيقاً بالعلوم المتعلقة بالاعتقاد، ومن هذه العلوم علم الموازنة بين الأديان، أو المعروف بعلم مقارنة الأديان أو علم الأديان أو الملل والنحل أو علم المقالات إلى غير ذلك. فعلم مناهج البحث في العقيدة يبحث في الأصول التي استقى منها أهل كل دين دينهم وأقوالهم، هل الأصل: الوحي، أو غيره؟ هل هذا الوحي محرف، أو أنه محفوظ من التحريف؟ .. الخ فهذا العلم، أعنى علم المناهج أصل لمعرفة علم الأديان، فلا غني للباحث في هذا العلم عن النظر فيه (1) .  المبحث الرابع: مناهج البحث: للدارسين لعلم العقيدة والأديان مناهج متعددة في دراستها، وذلك تبعاً للغرض من دراستها، وسأذكر هنا أبرز هذه المناهج:  المطلب الأول: المنهج التاريخي الوصفي: هذا المنهج يسلك فيه المؤلفون جانب العرض التاريخي الوصفي السردي، دون حكم على المقولات، أو نقد لها. وهذا النوع سلكه علماء متقدمون، كأبي الحسن الأشعري والشهرستاني. كما أن هناك من غير المسلمين من سلكه، وهو ابن كمونة اليهودي، في كتابه: \"تنقيح الأبحاث للملل الثلاث\". والحقيقة أن هذا المنهج لا يؤدي الدور المطلوب من العالم، بل إن مثل هذا المنهج قد يؤدي إلى ما يسمى بتقارب الأديان، لذا كان هذا المنهج \" أوفر مناهج المسلمين حظاً وإشادة عند علماء الغرب، وبه يرتضون أن يتناول علماء الإسلام الأديان\" (2) . وهذا أمر لا يفرح به، لهذا لم نجد مثل هذا المنهج عند علماء أهل السنة والجماعة، وإنما وجد عند غيرهم.",
    "foot_note":"1. مناهج البحث في العقيدة للسعيد ص 270 - 272. \n2. علم الملل ومناهج العلماء فيه ص 188.",
    "book_id":"69"
  },
  {
    "serial_number":"285048",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":21,
    "volume_number":1,
    "text":" المطلب الثاني: المنهج التحليلي النقدي: التحليل \"عملية يراد بها اكتشاف عناصر موضوع معين من أجل غرض خاص\" (1) . والنقد يراد به عرض تلك العناصر على الموازين الدقيقة، لمعرفة صحتها من فسادها. وجملة هذا المنهج: ملاحظة الظواهر، ثم الحكم عليها، ومناقشتها. ومنهج التحليل والنقد من أبرز الخصائص التي امتاز بها العلماء المسلمون، وعلى وجه الخصوص: علماء السلف أهل السنة والجماعة، فلشمولية العقيدة عندهم جاءت شمولية التحقيق والنقد مصاحبة لها. وهذا المنهج نجده كثيراً في كتب السلف، وبخاصة ما يتعلق منها بالردود على الطوائف والفرق أو من يحملون فكراً مخالفاً. وليس في أهل البدع والأهواء من عني بهذا الأمر عناية أهل السنة والجماعة، وهذا المنهج قد أفاد أهل السنة والجماعة كثيراً، فقد حفظوا عقيدتهم به على مر الدهور وتعاقب القرون، فلا تجد بينهم تناقضاً، ولا اختلافاً (2) .  المطلب الثالث: المنهج المقارن: وهو منهج يسلك سبيل الربط بين الموضوعات المتعددة، لاستخلاص أوجه الشبه أو الخلاف بينها، ثم الخروج من ذلك بحكم تدعمه نتائج العملية (3) . وهذا المنهج في دراسة العقائد والأديان والملل والنحل، منهج فريد يمتاز بنتيجة مهمة وهي الخروج من تلك المقارنة بأوجه الحسن التي تدعو ضمناً إلى وجوب إتباعها، واطراح الباطل. ومن ميزات هذا المنهج: إظهاره نقاط الاتفاق والاختلاف بين الفرق المتفرقة والأديان المختلفة، وهذا بدوره يؤدي إلى النظر الصحيح من قبل عقلاء تلك الطوائف في الحق الذي عند الآخرين، قال الله تعالى: {قُلْ يَاأَهْلَ الْكِتَابِ تَعَالَوْا إِلَى كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ أَلَّا نَعْبُدَ إِلَّا اللَّهَ وَلَا نُشْرِكَ بِهِ شَيْئًا وَلَا يَتَّخِذَ بَعْضُنَا بَعْضًا أَرْبَابًا مِنْ دُونِ اللَّهِ فَإِنْ تَوَلَّوْا فَقُولُوا اشْهَدُوا بِأَنَّا مُسْلِمُونَ (64)} [آل عمران: 64] (4) .",
    "foot_note":"1. منهج أهل السنة والجماعة في الرد على النصارى دراسة علمية من خلال جهود شيخ الإسلام ابن تيمية د. عبد الراضي عبد المحسن، ص 143 مكتبة التربية الإسلامية لإحياء التراث الإسلامي، الطبعة الأولى. \n2. مناهج البحث في العقيدة للسعيد ص 295 - 296. \n3. انظر المعجم الفلسفي من وضع مجمع اللغة العربية، ص 189، القاهرة، 1403. \n4. سورة آل عمران آية: 64.",
    "book_id":"69"
  },
  {
    "serial_number":"285049",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":22,
    "volume_number":1,
    "text":"وقال تعالى: {قُلِ الْحَمْدُ لِلَّهِ وَسَلَامٌ عَلَى عِبَادِهِ الَّذِينَ اصْطَفَى آللَّهُ خَيْرٌ أَمَّا يُشْرِكُونَ (59) أَمَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنْزَلَ لَكُمْ مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا بِهِ حَدَائِقَ ذَاتَ بَهْجَةٍ مَا كَانَ لَكُمْ أَنْ تُنْبِتُوا شَجَرَهَا أَإِلَهٌ مَعَ اللَّهِ بَلْ هُمْ قَوْمٌ يَعْدِلُونَ (60) أَمَّنْ جَعَلَ الْأَرْضَ قَرَارًا وَجَعَلَ خِلَالَهَا أَنْهَارًا وَجَعَلَ لَهَا رَوَاسِيَ وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا أَإِلَهٌ مَعَ اللَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (61) أَمَّنْ يُجِيبُ الْمُضْطَرَّ إِذَا دَعَاهُ وَيَكْشِفُ السُّوءَ وَيَجْعَلُكُمْ خُلَفَاءَ الْأَرْضِ أَإِلَهٌ مَعَ اللَّهِ قَلِيلًا مَا تَذَكَّرُونَ (62) أَمَّنْ يَهْدِيكُمْ فِي ظُلُمَاتِ الْبَرِّ وَالْبَحْرِ وَمَنْ يُرْسِلُ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ أَإِلَهٌ مَعَ اللَّهِ تَعَالَى اللَّهُ عَمَّا يُشْرِكُونَ (63) أَمَّنْ يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَمَنْ يَرْزُقُكُمْ مِنَ السَّمَاءِ وَالْأَرْضِ أَإِلَهٌ مَعَ اللَّهِ قُلْ هَاتُوا بُرْهَانَكُمْ إِنْ كُنْتُمْ صَادِقِينَ (64)} [النمل: 59 - 64] (1) . وهذا المنهج سلكه علماء المسلمين في كتاباتهم وفيما دونوه من مؤلفات (2) .  المطلب الرابع: المنهج العلمي التجريبي: هذا المنهج منهج حديث تبع فيه بعض المسلمين في القرن الهجري الأخير قادة الفكر الأوروبي الحديث الذي انسلخوا من كل معتقد ما عدا المعتقدات الدنيوية، وأتباعه موجودون في البلدان الإسلامية التي احتك أهلها بالمستعمر الغربي وبالتيارات الفكرية الوافدة من الغرب إلى العالم الإسلامي، وكذا من كانت دراساته الدينية والفكرية في بلاد الكفر أو الجامعات المقامة في بعض البلدان الإسلامية والتي تتبع لبلدان كافرة كبعض الجامعات التي تتبع الإرساليات التنصيرية. وهؤلاء لهم آراء غريبة في أدوات المعرفة البشرية، حيث يعتدون بالأساليب الحسية والتجريبية فقط، ويرفضون أي منهج آخر يخالف ما هم عليه، كالمنهج النقلي، والمنهج العقلي، ويحاولون البحث عن المعارف الإلهية والدين بأساليب العلوم العملية والتجربة الميدانية (3) . وقد صارت من آثار هذا المذهب تفسير المعجزات تفسيراً مادياً وتفسير النبوة بالنبوغ والعبقرية البشرية. وقد حمل هؤلاء على هذا: إرادة التجديد ومواكبة التطور العلمي الدنيوي، فرأوا أن تفسير القرآن بالحقائق العلمية والمكتشفات العصرية سبيل قوى لبيان عظمة القرآن، وكونه شاملاً لكل شيء.",
    "foot_note":"1. سورة النمل آية: 59 - 64. \n2. مناهج البحث في العقيدة للسعيد ص 297 - 298. \n3. انظر: التوحيد الخالص أو الإسلام والعقل د\/ عبد الحليم محمود، المقدمة، دار الكتب الحديثة، 1973.",
    "book_id":"69"
  },
  {
    "serial_number":"285050",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":23,
    "volume_number":1,
    "text":"وهذا المنهج منهج خطرٌ على العقيدة الإسلامية، خصوصاً إذا علم أن بعض التنازلات والتأويلات فيه تبلغ بصاحبها إلى الردة عن الإسلام، وقد أثبت خطورة هذا المنهج: ما عم أوروبا من موجة إلحاد عارمة، نتيجة لتطبيقها الخاطئ لهذا المنهج. كما أن في هذا المنهج جناية كبرى على القرآن الكريم والسنة النبوية الشريفة، لما يحمله هذا الأمر من عدم الثقة باللفظ القرآني واللفظ النبوي، وأيضاً، فإن هذا المنهج قصر البحث على الظواهر الكونية، ومعلوم أن هناك أموراً كثيرة غير داخلة تحت التجربة ولا الحس. ثم إن هذا المنهج لا يؤدي الدور المطلوب منه، بل هو سبيل لتسليط الأعداء على كل المسلمات العقدية، وحينئذ يصبح من العسير على من نهج هذا المنهج أن يفرق بين الأمور، إذا ما من أمر من الأمور إلا وهو يحتمل أن يفسر بأي نظرية استحدثها مستحدث كما فسر غيرها بالنظريات الأخرى (1) .  المطلب الخامس: منهج الحوار والجدال والرد والمحاجة: سلك بعض علماء المسلمين في دراستهم للأديان اتجاهاً دفاعياً، يواجه حملات التنصير، والتشكيك التي تتربص بالمجتمع الإسلامي، وتثير الفتنة بين المسلمين، واتخذ هذا الاتجاه شكل مناظرات حية بين علماء المسلمين والكفار، من أصحاب الأديان والنحل المختلفة، وبالمحاورات، والرد على الشبهات المكتوبة في رسائل، أو في كتب، ويمثل هذا المنهج أغلب كتب علماء المسلمين (2) .  المطلب السادس: المنهج العلمي الشامل في دراسة الأديان: والمراد بالمنهج الشامل هو المنهج الذي يشمل جميع المناهج السابقة، حيث يهتم بعرض ما يتناوله بالدراسة عرضاً أميناً، مع المناقشة، والمقارنة، والتحليل النقدي، ورد الباطل وبيانه، وقد يتم ذلك في قالب حوار، أو مناظرة. وهذا المنهج الشامل هو الأمثل في تناول دراسة الأديان، إذ وصف الأديان وحده لا يغني، كما أن المقارنة غير الموجهة غير مجدية، والنقد والردود قبل استيفاء العرض والمناقشة قد يكون فيها مجانبة للأمانة والإنصاف، ومن تتبع كتب المسلمين في دراسة الأديان يجد هذا المنهج الشامل، ولعل خير أنموذج لهذا المنهج كتاب \"الجواب الصحيح لمن بدل دين المسيح\" لشيخ الإسلام ابن تيمية رحمه الله (3) .",
    "foot_note":"1. مناهج البحث في العقيدة للسعيد 299 - 301. \n2. علم الملل ومناهج العلماء فيه ص 189. \n3. المصدر السابق ص 189 - 190.",
    "book_id":"69"
  },
  {
    "serial_number":"285051",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":24,
    "volume_number":1,
    "text":" الفصل الخامس: منهج أهل السنة في دراسة علم الأديان إن المنهج الحق في دراسة علم الأديان هو الذي يعتمد على قواعد وضوابط ترجع إلى ثلاثة أمور: 1 - مصادر الاستدلال في دراسة الأديان. 2 - المنهج في الاستدلال. 3 - طريقة العرض والرد. وسأذكر إن شاء الله تعالى في هذا الفصل منهج أهل السنة في هذه الأمور.  المبحث الأول: مصادر الاستدلال على علم الأديان عند أهل السنة: إن الاختلاف في المصادر يؤدي إلى اختلاف في المناهج والنتائج، فربما يبحث شخصان موضوعاً واحداً مع اختلاف مصادرهما فيكون ذلك سببا لاختلافهما في النتائج، من هنا كان تحديد المصادر من الأمور الضرورية، وقد اتفق أهل السنة على المصادر الت استندوا عليها في دراسات الأديان:  أولاً: القرآن الكريم: القرآن الكريم عند أهل السنة والجماعة هو المصدر الأول لمعرفة الحق والباطل، والخير والشر، وهو الفيصل في كل ما يحدث بين العباد، وقد أمر بالاعتصام به في غير موضع من كتابه وعلى لسان رسوله صلى الله عليه وسلم، ومن ذلك قوله -تعالى-: {وَهَذَا كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ فَاتَّبِعُوهُ وَاتَّقُوا لَعَلَّكُمْ تُرْحَمُونَ (155)} [الأنعام: 155] (1) ، وقوله تعالى: {قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ فَإِنْ تَوَلَّوْا فَإِنَّ اللَّهَ لَا يُحِبُّ الْكَافِرِينَ (32)} [آل عمران: 32] (2) ، وقوله تعالى: {كِتَابٌ أُحْكِمَتْ آيَاتُهُ ثُمَّ فُصِّلَتْ مِنْ لَدُنْ حَكِيمٍ خَبِيرٍ (1)} [هود: 1] (3) ، وقوله تعالى: {(54) وَكَذَلِكَ نُفَصِّلُ الْآيَاتِ وَلِتَسْتَبِينَ سَبِيلُ الْمُجْرِمِينَ} [الأنعام: 55] (4) . لهذا فقد استمد علماء السلف أحكامهم على الأديان الأخرى من القرآن الكريم.",
    "foot_note":"1. سورة الأنعام الآية: 155. \n2. سورة آل عمران الآية: 32. \n3. سورة هود الآية: 1. \n4. سورة الأنعام: 55.",
    "book_id":"69"
  },
  {
    "serial_number":"285052",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":25,
    "volume_number":1,
    "text":"يقول ابن حزم رحمه الله: \"نحن -إن شاء الله تعالى- نذكر صفة وجوه النقل الذي عند المسلمين لكتابهم ودينهم، ثم لما نقلوه عن أئمتهم حتى يقف عليه المؤمن والكافر، والعالم والجاهل، عياناً إن شاء الله فيعرفون أين نقل سائر الأديان من نقلهم\" (1) .  ثانياً: السنة النبوية: والسنة هي كل ما صدر عن النبي صلى الله عليه وسلم من قول، أو فعل، أو تقرير. وهي وحي كالقرآن قال -تعالى-: {وَمَا يَنْطِقُ عَنِ الْهَوَى (3) إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى (4)} [النجم: 3 - 4] (2) وهي كالقرآن في الحجية، قال النبي صلى الله عليه وسلم \"ألا إني أوتيت الكتاب ومثله معه … \" (3) . وبناءً على هذا اعتمدوا عليها في مجال دراسة الأديان.  ثالثاً: الإجماع: الإجماع حجة بدلالة القرآن، والسنة، والعقل، فمن القرآن قوله تعالى: {وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّى وَنُصْلِهِ جَهَنَّمَ وَسَاءَتْ مَصِيرًا (115)} [النساء: 115] (4) . ومن السنة قوله صلى الله عليه وسلم: \" إن الله لا يجمع أمتى أو قال أمة محمد صلى الله عليه وسلم على ضلالة، ويد الله مع الجماعة، ومن شذ شذ في النار\" (5) .",
    "foot_note":"1. انظر: الفصل في الملل والأهواء والنحل، لابن حزم، تحقيق محمد إبراهيم نصر، عبدالرحمن عميرة، 2\/ 219، دار الجيل، بيروت. \n2. سورة النجم الآية 3 - 4. \n3. أخرجه أبو داود، الحديث رقم 4591، انظر: عون المعبود: 12\/ 231. \n4. سورة النساء الآية: 115. \n5. رواه الترمذي، الحديث رقم: 2255 وقال هذا حديث غريب من هذا الوجه. وانظر: تحفة الأحوذي شرح سنن الترمذي، لأبي العلام محمد بن عبدالرحمن المباكفوري، 6\/ 322، دار الكتب العلمية، بيروت، الطبعة الأولى، ومشكاة المصابيح، لمحمد عبدالله الخطيب التبريزي، تحقيق محمد ناصر الدين الألباني، رقم الحديث 24 ص 1\/ 61، المكتب الإسلامي، بيروت، الطبعة الثانية، وصححه الألباني.",
    "book_id":"69"
  },
  {
    "serial_number":"285053",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":26,
    "volume_number":1,
    "text":"يقول شيخ الإسلام ابن تيمية: \"والإجماع هو الأصل الثالث الذي يعتمد عليه في العلم والدين\" (1) . وأهل السنة والجماعة لا يفرقون في حجية الإجماع بين الأمور الاعتقادية وبين غيرها، كما أن الإجماع يدفع احتمال الخطأ الذي قد يتطرق للظنيات، فيرتفع -بفضل الإجماع- إلى مقام القطعيات\" (2) . والمقصود هنا هو بيان أن الإجماع مصدر من مصادر المعرفة الدينية عند أهل السنة والجماعة، وأنه يستند عليه في جميع أبواب الدين، ويدخل ذلك الأحكام الشرعية التي تتعلق بأهل الأديان الأخرى، فينبغي على كل من يشتغل بدراسة الأديان أن يعرف مواطن الإجماع في أحكام أهل الأديان.  رابعاً: العقل: يقول شيخ الإسلام ابن تيمية مبيناً مفهوم العقل عند أهل السنة: \"العقل شرط في معرفة العلوم، وكمال صلاح الأعمال، وبه يكمل العلم والعمل، لكنه ليس مستقلاً بذلك\" (3) . فالعقل إذاً عند أهل السنة عبارة عن غريزة فطرية في الإنسان، يستطيع بها أن يميز بين الحق والباطل في المعتقدات، والصواب والخطأ في الأقوال والأفعال، لكن دون استقلال عن الوحي، وهذا التحديد لمفهوم العقل يدل على أن السلف اهتموا بالعقل إدراكاً منهم بمكانته العظيمة. وقد جعل علماء أهل السنة العقل احد دعائمهم في دراسة الأديان فهذا ابن تيمية يقول موضحاً أسس منهجه في الرد على النصارى: \" ونبين - إن شاء الله- أن ما عليه النصارى من التثليث والاتحاد لم يدل عليه شيء من كتب الله، لا الإنجيل ولا غيره، بل دلت على نقيض ذلك، ولا دل على ذلك عقل، بل العقل الصريح مع نصوص الأنبياء يدل على نقيض ذلك\" (4) .",
    "foot_note":"1. مجموع الفتاوى 3\/ 154. \n2. انظر: منهج الاستدلال على مسائل الاعتقاد 1\/ 151 - 154. \n3. مجموع الفتاوى 3\/ 338 - 339. \n4. انظر: الجواب الصحيح 1\/ 23.",
    "book_id":"69"
  },
  {
    "serial_number":"285054",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":27,
    "volume_number":1,
    "text":" المبحث الثاني: منهج الاستدلال: ومعرفة هذا المنهج مهم، إذ أن كل من ينتسب إلى الإسلام يدعي أنه يستمد أحكامه من الكتاب والسنة، ويعتمد عليها، والاختلاف في منهج الاستدلال هو الفيصل بين منهج أهل السنة في التعامل مع الأدلة، وبين مناهج المخالفين، فلأهل السنة قواعد منهجية تميز منهجهم في الاستدلال وتضبطه، والتزامهم بهذه القواعد جنبهم الاضطراب في المنهج، والحيرة الفكرية التي لازمت الفرق الأخرى ومن أهم هذه القواعد في مجال دراسة الأديان:  1 - الإيمان بجميع نصوص الكتاب والسنة والتسليم لها: قال تعالى: {أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ فَمَا جَزَاءُ مَنْ يَفْعَلُ ذَلِكَ مِنْكُمْ إِلَّا خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَى أَشَدِّ الْعَذَابِ} [البقرة: 85] (1) . وقد التزم أهل السنة والجماعة على هذه القاعدة امتثالاً لأمر الله، واحترازاً من هذا الوعيد الذي وجه إلى من آمن ببعض الكتاب وكفر ببعضه. قال شيخ الإسلام رحمه الله: \"فما جاء في الكتاب والسنة وجب على كل مؤمن الإيمان به وإن لم يفهم معناه\" (2) . وقال ابن أبي العز: \"فالواجب كمال التسليم للرسول صلى الله عليه وسلم والانقياد لأمره، وتلقي خبره بالقبول، والتصديق، دون أن نعارضه بخيال باطل نسميه معقولاً، أو نحمله شبهة، أو نقدم عليه آراء الرجال، وزبالة أذهانهم، فنوحده بالتحكيم والتسليم، والانقياد والإذعان\" (3) .  2 - اشتمال الكتاب والسنة على أصول الدين: يؤمن أهل السنة والجماعة أن الكتاب والسنة وافيان لأمور الدين أصولاً وفروعاً، قال تعالى: {وَنَزَّلْنَا عَلَيْكَ الْكِتَابَ تِبْيَانًا لِكُلِّ شَيْءٍ وَهُدًى وَرَحْمَةً وَبُشْرَى لِلْمُسْلِمِينَ (89)} [النحل: 89] (4) . وقال تعالى: {مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ} [الأنعام: 38] (5) .",
    "foot_note":"1. سورة البقرة الآية: 85. \n2. مجموع الفتاوى 3\/ 41. \n3. شرح العقيدة الطحاوية لابن أبي العز الحنفي تحقيق د. التركي والأرنؤوط، ص 1\/ 228، مؤسسة الرسالة، 1415. \n4. سورة النحل الآية: 89. \n5. سورة الأنعام الآية: 38.",
    "book_id":"69"
  },
  {
    "serial_number":"285055",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":28,
    "volume_number":1,
    "text":"وقد شهد هذا الكمال والوفاء بكل شيء، حتى الخصوم من الأمم الأخرى، فقد قال أحد اليهود لسلمان الفارسي رضي الله عنه: \"قد علّم نبيكم صلى الله عليه وسلم كل شيء حتى الخراءة، فقال: أجل، لقد نهانا أن نستقبل القبلة لغائط أو بول\" (1) ، فإذا كان النبي صلى الله عليه وسلم قد علم الأمة حتى الخراءة فإنه من باب الأولى أن يعلمهم كليات هذا الدين، وهذا ما يعتقده أهل السنة اعتقاداً جازماً، لا تزلزله الشبهات، ولا تزعزعه الفتن، وقد تضافرت أقوالهم على هذا: يقول ابن حزم: \"كتاب الله عز وجل .. هو جامع علوم الأولين والآخرين .. لم يفرط فيه من شيء .. من فهمه كفاه، وسنن رسول الله صلى الله عليه وسلم هي بيان الحق ونور الألباب\" (2) ويقول ابن تيمية: \"فكل ما يحتاج الناس إليه في دينهم فقد بينه الله ورسوله بياناً شافياً\" (3) وقد ظهرت أهمية هذه القاعدة، وفائدتها العظيمة لدى علماء السلف في مجال دراسة الأديان، لا سيما في المقارنة بين الإسلام وبين اليهودية والنصرانية.  3 - أصول الدين واحدة لا نسخ فيها ولا في الأخبار: إن معرفة ما يدخله النسخ مما لا يدخله من الشريعة، أمر في غاية الأهمية، لأنه من خلاله يدرك أن النسخ لا يستلزم على أمر محال؛ وإنما يكون لحكمة ومصلحة، كما يعرف به كذب من يدعي نسخ ما لا يدخله النسخ من أمور الدين، وحقيقة الأمر أن الشريعة نوعان: الأول: خبر: ويدخل فيه كل ما أخبر الله تعالى أنه سيكون، أو كان، أو وعدنا، أو قص علينا من أخبار الأمم الماضية، وما قص علينا من أخبار الجنة والنار، والحساب، والعقاب، والبعث والحشر، وخلق السماوات والأرض .. وكذلك ما أخبرنا الله تعالى به عن ذاته وصفاته، وأفعاله، فهذا وشبهه من الأخبار المحضة لا يجوز دخول النسخ عليه (4) . الثاني: الأوامر والنواهي يجوز دخول النسخ فيها شريطة ألا تتعلق بالاعتقادات، وأمهات الأخلاق وأصول العبادات والمعاملات، لأن الشريعة مبنية على حفظ هذه الكليات (5) .",
    "foot_note":"1. أخرجه مسلم: كتاب الطهارة، باب الاستطابة ص 129، رقم الحديث 262. \n2. انظر: الفصل في الملل والأهواء والنحل 2\/ 234 بتصرف. \n3. مجموع الفتاوى 2\/ 237. \n4. انظر: الإيضاح لناسخ القرآن ومنسوخه أبي محمد مكي ابن أبي طالب القيسي تحقيق أحمد حسن فرحان، ص 57، جامعة الإمام محمد بن سعود الإسلامية، الطبعة الأولى. \n5. المصدر السابق ص 75، مناهل العرفان في علوم القرآن لمحمد عبدالعظيم الزرقاني، ص 2\/ 211، مطبعة عيسى البابي الحلبي. مباحث في علوم القرآن للشيخ مناع القطان، ص 233، مؤسسة الرسالة الطبعة الثانية والثلاثون.",
    "book_id":"69"
  },
  {
    "serial_number":"285056",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":29,
    "volume_number":1,
    "text":"وبناء على هذا فإن الكلام ينصرف إلى النوع الأول عندما يقال أصول الأديان السماوية واحدة لا نسخ فيها، وإلى النوع الثاني عند ما يقال الإسلام ناسخ للأديان السابقة. والمقصود هنا بيان أن علماء المسلمين حددوا ما يدخله النسخ مما لا يدخله، فانحصر ما ينقل عن الأنبياء السابقين إما أن يكون من النوع الذي يدخله النسخ، فإذا خالف هذا حكماً ثابتاً في الإسلام علم إما نسخه أو تبديله، أما إذا نقل شيئاً يخالف الشريعة الإسلامية مما لا يدخله النسخ علم بطلان هذا المنقول قطعاً، وهذا النهج لا يستقيم إلا لمن انطلق من هذه القاعدة.  4 - رد التنازع إلى الكتاب والسنة: تميز منهج أهل السنة بتحكيم الشريعة والتحاكم إليها في ما تنازع الناس فيه من أمور الدين امتثالاً لأمر الله تعالى: {فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ذَلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا (59)} [النساء: 59] (1) . ويقينا منهم أن الكتاب جاء للفصل بين الناس فيما اختلفوا فيه، قال تعالى: {أَلِيمٌ (63) وَمَا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ إِلَّا لِتُبَيِّنَ لَهُمُ الَّذِي اخْتَلَفُوا فِيهِ وَهُدًى وَرَحْمَةً} [النحل: 64] (2) ، قال ابن حزم: \" فلم يسع مسلماً يقر بالتوحيد أن يرجع عند التنازع إلى غير القرآن والخبر عن رسول الله صلى الله عليه وسلم، ولا أن يأبى عما وجد فيهما، فإن فعل ذلك بعد قيام الحجة عليه فهو فاسق، وأما من فعله مستحلاً للخروج عن أمرهما، وموجباً لطاعة أحد دونهما، فهو كافر لا شك عندنا في ذلك\" (3) . وقد استعمل أهل الحق هذه القاعدة مع أهل الأديان، وهم في هذا الأمر مقتدون بالقرآن الذي طالب منهم إقامة دينهم والتحاكم بما أنزل الله إليهم. قال تعالى: {يَاأَهْلَ الْكِتَابِ لَسْتُمْ عَلَى شَيْءٍ حَتَّى تُقِيمُوا التَّوْرَاةَ وَالْإِنْجِيلَ وَمَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ} [المائدة: 68] (4) ، وقال تعالى: {وَلْيَحْكُمْ أَهْلُ الْإِنْجِيلِ بِمَا أَنْزَلَ اللَّهُ فِيهِ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمُ الْفَاسِقُونَ (47)} [المائدة: 47] (5) .",
    "foot_note":"1. سورة النساء الآية: 59. \n2. سورة النحل الآية: 64. \n3. الإحكام: ص 1\/ 99. \n4. سورة المائدة الآية: 68. \n5. سورة المائدة الآية: 47.",
    "book_id":"69"
  },
  {
    "serial_number":"285057",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":30,
    "volume_number":1,
    "text":" 5 - درء التعارض بين نصوص الكتاب والسنة: من منطلقات منهج أهل السنة ومسلماته الجزم على استحالة تعارض نصوص الكتاب والسنة بعضها مع بعض، إذ كلها وحي من عند الله، والله يقول: {أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا (82)} [النساء: 82] (1) . وكذلك السنة وحي بدلالة القرآن، {وَمَا يَنْطِقُ عَنِ الْهَوَى (3) إِنْ هُوَ إِلَّا وَحْيٌ يُوحَى (4)} [النجم: 3 - 4] (2) ، فإن ظن ظان أن ثم تعارضاً بين بعض النصوص فهو في فهم الناظر، وليس في نفس الأمر، قال الشاطبي: \"أدلة الشريعة لا تتعارض في نفس الأمر، ولذلك لا تجد البتة دليلين أجمع المسلمون على تعارضهما، بحيث وجب عليهم الوقوف، لكن قد يقع التعارض في فهم الناظر\" (3) . وقد استخدم المسلمون هذه القاعدة في الرد على أهل الكتاب، وبيان بطلان أديانهم، وذلك بإثبات الاختلافات، والتناقضات الموجودة في كتبهم، والتي تدل على أن هذه الكتب قد حرفت وبدلت، ولا تمثل بأي حال وحياً منزلاً من عند الله.  6 - درء التعارض بين أدلة النقل وأدلة العقل: من الأسس المنهجية في التعامل مع الأدلة عند أهل السنة والجماعة الجزم بعدم التعارض بين الأدلة الشرعية السمعية وبين الأدلة العقلية، ذلك أن النقل الصحيح والعقل الصريح دليلان شرعيان، والأدلة الشرعية كلها جاءت من عند الله، فيستحيل تعارضها، وما توهم من المسائل أنه قد تعارض فيها العقل والنقل، فلا يخلو الأمر: إما أن لا تكون من المسائل البينة المعروفة بصريح العقل، وإما أن يكون النقل المستدل به مكذوباً موضوعاً يعلم أهل النقل أنه كذب، أو يكون النقل صحيحاً، لكن في دلالة ضعيفة غلط المستدل بها على الشرع (4) ، فكل عقل صريح صحيح خالص من الشبهات فإنه يطابق النقل الصحيح الصريح (5) .",
    "foot_note":"1. سورة النساء الآية: 82. \n2. سورة النجم الآية: 3 - 4. \n3. الموافقات في أصول الشريعة، لأبي إسحاق إبراهيم الشاطبي، ص 4\/ 294، المكتبة التجارية الكبرى، القاهرة. \n4. انظر: درء تعارض العقل والنقل 1\/ 148. \n5. انظر: مجموع الفتاوى 18\/ 240.",
    "book_id":"69"
  },
  {
    "serial_number":"285058",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":31,
    "volume_number":1,
    "text":"قال شيخ الإسلام ابن تيمية: \"وقد تأملت ذلك في عامة ما تنازع الناس فيه، فوجدت ما خالف النصوص الصحيحة الصريحة شبهات فاسدة، يعلم بالعقل بطلانها، بل يعلم بالعقل ثبوت نقيضها الموافق للشرع، وتأملته في مسائل الأصول الكبار، كمسائل التوحيد، والصفات ومسائل القدر، والنبوات، والمعاد وغير ذلك، ووجدت ما يعلم بصريح العقل لم يخالفه سمع قط\" (1) . وقال شيخ الإسلام ابن تيمية عند بيان منهجه في الرد على النصارى: \"ونحن -ولله الحمد والمنة- نبين أن كل ما احتجوا به من حجة سمعية من القرآن، أو من الكتب المتقدمة على القرآن، أو عقلية، فلا حجة لهم في شيء منها، بل الكتب كلها مع القرآن، والعقل حجة عليهم لا لهم، بل عامة ما يحتجون به من نصوص الأنبياء، ومن المعقول فهو نفسه حجة عليهم، ويظهر منه فساد قولهم\" (2) .  7 - الجمع بين الإيمان بالمتشابه والعمل بالمحكم: وقف أهل السنة والجماعة موقفاً صحيحاً من المحكم والمتشابه تمَثّل في الإيمان بالكتاب كله، محكمه ومتشابهه، مع العمل بالمحكم، والإيمان بالمتشابه (3) حتى يتبين معناه ويتضح مدلوله، وذلك بالتدبر فيه، ومتابعة النظر، أو برده إلى المحكمات من النصوص، فإن النصوص يفسر بعضها بعضا (4) . وقد استعمل أهل السنة هذه القاعدة بعد تحريرها وتحديدها على هذا الوجه في الرد على أصحاب الأديان من اليهود والنصارى، الذين كان دأبهم إتباع المتشابهات وترك النصوص الصريحة سواء كان ذلك في أديانهم أو فيما احتجوا به من نصوص القرآن على صحة أديانهم.  8 - الأخذ بظواهر النصوص: المراد بظواهر النصوص هو ما يتبادر إلى ذهن المخاطب من المعاني وليس المراد بالظاهر الاصطلاحي عند الأصوليين الذي يقابل النص (5) . والمقصود هنا أن ظواهر النصوص مفهومة لدى المخاطبين (6) . فيجب أخذها، ودليل ذلك أن الله أرسل رسله على لغات أقوامهم قال: {وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ} [إبراهيم: 4] (7) .",
    "foot_note":"1. درء تعارض العقل والنقل 1\/ 147. \n2. الجواب الصحيح 1\/ 104، دار العاصمة. \n3. انظر: مجموع الفتاوى 17\/ 386، الاعتصام 2\/ 336. \n4. انظر: منهج الاستدلال على مسائل الاعتقاد 2\/ 491. \n5. انظر بدائع الفوائد لابن القيم، ص 4\/ 9، دار الكتاب العربي، بيروت. \n6. انظر: منهج الاستدلال على مسائل الاعتقاد 2\/ 437. \n7. سورة إبراهيم الآية: 4.",
    "book_id":"69"
  },
  {
    "serial_number":"285059",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":32,
    "volume_number":1,
    "text":"فعلّة إرسال الرسل على لغات أقوامهم هي أن يحصل التبيين، وهو التوضيح الذي يحصل به المقصود، وتقوم به الحجة، وتنقطع به المعذرة، ويلزم من هذا أن الأنبياء جاءوا بكلام مبين يفهمه المخاطبون به، وعلى هذا مذهب السلف، فلم يصرفوا النصوص عن ظاهرها التي دلت عليها اللغة العربية، وفهموها على حسب معهود العرب من الخطاب.  9 - الإسلام هو الدين المهيمن على غيرة من الأديان: وبناء على هذا فإن الإسلام هو الدين الوحيد الذي من خلاله يعرف حقيقة الأديان السابقة فهو المصدر والوثيقة لها، لذا قال تعالى: {وَأَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ مِنَ الْكِتَابِ وَمُهَيْمِنًا عَلَيْهِ} [المائدة: 48] (1) . فالقرآن هو المهيمن أي الشاهد المؤتمن، يشهد بما في كتب أهل الكتاب من الحق، ويبين ما حرف فيها، ويحكم بما أقره الله، وأمر به من أحكامها، وينسخ ما نسخه الله، وهو مؤتمن عليها في ذلك كله (2) . ولهذا قال ابن جرير: \" القرآن أمين على الكتب المتقدمة قبله، فما وافقه منها فهو حق، وما خالفه منها فهو باطل\" (3) .",
    "foot_note":"1. سورة المائدة الآية: .48 \n2. مناظرة بين الإسلام والنصرانية إعداد جمال عبد الهادي، ص 402، طبعة الرئاسة العامة لإدارات البحوث العلمية والإفتاء والدعوة و 1 لإرشاد. \n3. انظر: تفسير ابن كثير 2\/ 62.",
    "book_id":"69"
  },
  {
    "serial_number":"285060",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":33,
    "volume_number":1,
    "text":" المبحث الثالث: المنهج في العرض والرد: يلاحظ المتأمل في كتب السلف في الأديان والملل أن منهجهم في العرض والنقاش، والرد والمناظرات، قد تميز عن غيره من المناهج بخصائص تمثل قواعد وضوابط في العرض والنقاش، والرد والمناظرة، فهو منهج شمولي، يعرض الأديان المطلوب دراستها، فيناقش مبادئها، ويحللها تحليلاً نقدياً، ثم يرد ما فيها من باطل.  أولاً: العرض وخصائصه: العرض هو الشكل أو القالب الذي يقدم بواسطته المصنف موضوعه، وتختلف أساليب العرض من مصنف إلى مصنف، كما تختلف تبعاً لاختلاف موضوع البحث، وبما أن الاشتغال بعلم الأديان مرتبط بعقيدة المسلم بكونه أداة من أدوات الدعوة إلى الله تعالى والدفاع عن الدين؛ فإنه يجب عليه أن يكون عرضه الأديان والملل عرضاً يحقق الأهداف الشرعية التي من أجلها يدرس هذا العلم، وأن يكون موافقاً لمنهج القرآن في عرض الأديان ونقدها، والملاحظ لكتب السلف يجد أن عرضهم لها يتميز بأمور منها: 1 - الوضوح: والوضوح الذي تميز به منهج السلف في دراسة الأديان يرجع إلى كونهم اتبعوا المنهج القرآني الذي يعرض قضايا الدين بالأسلوب السهل الواضح الذي يفهمه جميع الناس، قال تعالى: {وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (17)} [القمر: 17] (1) ، وبمنهج النبي صلى الله عليه وسلم الذي كان يعالج الأمور بالكلام القليل الواضح الذي يجري مجرى الأمثال والحكم لقلة ألفاظه، وكثرة معانيه، ووضوحه، فإنك لو تأملت قوله صلى الله عليه وسلم: \"ما نهيتكم عنه فاجتنبوه وما أمرتكم به فأتوا منه ما استطعتم، فإنما أهلك الذي من قبلكم كثرة مسائلهم واختلافهم على أنبيائهم\" (2) تبين لك سبب هلاك الأمم السابقة وهو كثرة مسائلهم واختلافهم على أنبيائهم. 2 - الدقة والشمولية في العرض: الدقة والشمولية من مقتضيات الأمانة العلمية، وهي مطلوبة في كل ما يعرض مهما كانت عداوة الخصم، فلا يجوز الكذب عليه، بل يعرض عقيدته، وأفكاره كما هي في المصادر المعتبرة لديه.",
    "foot_note":"1. سورة القمر الآية: 17. \n2. أخرجه مسلم: كتاب الفضائل، باب توقيره صلى الله عليه وسلم وترك إكثار سؤاله عما لا ضرورة إليه، أو لا يتعلق به تكليف، وما لا يقع ونحو ذلك ص 959، رقم الحديث 1337.",
    "book_id":"69"
  },
  {
    "serial_number":"285061",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":34,
    "volume_number":1,
    "text":"وإذا تأملت في كتب الأديان والملل فإنك تجد أن التزامهم إنما هو نتيجة طبيعية لإيمانهم بوجوب العدل مطلقاً، وإدراكهم أن نقد الأديان والملل لا يستقيم لهم مع الإخلال في عرضها، لأن ذلك يتيح للخصم أن يحتج عليهم بان العرض ناقص، والنقد كاذب (1) . يقول ابن تيمية في رده على النصارى: \"وأنا أذكر ما ذكروه بألفاظهم بأعيانها فصلا فصلاً، وأتبع كل فصل بما يناسبه من الجواب فرعاً وأصلاً، وعقداً وحلاً\" (2) . ومن ذلك عدم إطلاق حكم عام على أهل دين وملة ما قبل حصول البحث والاستقراء، فحرصوا على شمولية الاستقراء، وعدم إطلاق الأحكام العامة، إلا بعد التثبت والتدقيق. وبهذه الدقة الناتجة عن سعة الاطلاع، وشمول الاستقراء كان السلف يعرضون عقائد أهل الأديان والملل، وآراءهم. 3 - العرض الموحي بالحكم الشرعي: من خصائص منهج أهل السنة في عرض العقائد، وأفكار المخالفين للإسلام أن الحكم الشرعي للأديان التي تدرس يظهر من خلال العرض، والسياق، الذي يوردون فيه، وما يعرضون من مقدمات ومنطلقات توحي إلى حكم ما سيعرض، ومن خلال الالتزام بالألفاظ الشرعية التي أطلقها الشارع على أهل الأديان والملل كتسميتهم بالكفار، والأعداء، ثم بحرصهم أن يعرض الباطل في صورته الحقيقية التي تظهر فساده، قال شيخ الإسلام ابن تيمية: \"فأما القول الباطل فإذا بين فبيانه يظهر فساده\" (3) .  ثانياً- في المناقشة والرد: إذا كان بعض مؤرخي الأديان والملل اكتفى بوصف الأديان، وعرضها دون بيان صحيحها من فاسدها، فإن علماء السلف كانوا يصفونها، ويعرضونها من أجل المناقشة والنقد. وترجع قدرتهم على المناقشة إلى الأمور الآتية: 1 - كونهم أصحاب منهج واضح سليم من الأخطاء والمتناقضات والاضطراب. 2 - شدة حماسهم وغيرتهم وحرصهم على حماية الدين، وتفانيهم في الدفاع عنه ضد كل الخصوم، وقد دفعهم هذا الحماس والغيرة إلى خوض المناقشات والمناظرات مع المخالفين، وبالتالي أكسبهم خبرة ودراية في أساليب الحوار والمناقشة. 3 - سعة اطلاعهم، وعلو كعبهم في العلوم الشرعية.",
    "foot_note":"1. انظر: مسلمو أهل الكتاب وأثرهم في الدفاع عن القضايا القرآنية، د. محمد السحيم، ص 2\/ 774، دار الفرقان، الطبعة الأولى. \n2. الجواب الصحيح 1\/ 99. \n3. مجموع الفتاوى: ص 2\/ 145. انظر: علم الملل ومناهج العلماء فيه ص 225 - 233.",
    "book_id":"69"
  },
  {
    "serial_number":"285062",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":35,
    "volume_number":1,
    "text":"وقد ناقشوا عقائد الأمم وأفكارها نقاشاً قائماً على العلم والعدل، وبعيداً عن العاطفة المثيرة، أو الادعاء والتشهي، وكان من ركائز هذا النقاش التحليل النقدي: المقارنة العلمية البعيدة عن التعصب الممقوت، والرد المحكم. والمقارنة عند علماء السلف تارة تكون بين الحق والباطل، كالمقارنة بين الإسلام والأديان المحرفة (1) ، وتارة تكون بين حقين كالمقارنة بين الإسلام وبين الديانة اليهودية قبل تحريفها ونسخها، وتارة تكون بين باطلين كالمقارنة بين الأديان الباطلة، وذلك لبيان أن كفر بعضها وفساد عقائدها أشد من بعض، وهو منهج قرآني، قال تعالى: {لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِلَّذِينَ آمَنُوا الْيَهُودَ وَالَّذِينَ أَشْرَكُوا} [المائدة: 82] (2) . والقصد من هذه المقارنات كلها بيان الحق، وكشف الباطل. وقد تميز الرد عند السلف بأمور أهمها: قوة الرد، وإحكام النقض لشبهات أهل الأديان والملل، بحيث لا تقوم قائمة لما يظنه أهل الباطل حججاً، وبراهين، ولأهمية هذا الأمر نهى السلف أن يناظر من ليس له أهليه في المناظرة. قال شيخ الإسلام ابن تيمية: \"وقد ينهون عن المجادلة، والمناظرة إذا كان المناظر ضعيف العلم بالحجة وجواب الشبهة … \" (3) .",
    "foot_note":"1. الجواب الصحيح 2\/ 4، 2\/ 52، 4\/ 46 \n2. سورة المائدة الآية: 82. \n3. درء تعارض العقل والنقل: 7\/ 173. انظر: علم الملل ومناهج العلماء فيه ص 233 - 235.",
    "book_id":"69"
  },
  {
    "serial_number":"285063",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":36,
    "volume_number":1,
    "text":" الفصل السادس: مناهج المخالفين لأهل السنة في دراسة الأديان ونقدها  المبحث الأول: مناهج أهل الكلام في دراسة علم الأديان: إن لبعض الفرق المبتدعة دورٌ في هذا العلم، مما يجعل ضرورة لكل باحث في مناهج علماء المسلمين في دراسة علم الأديان والملل أن يتناولها بالدراسة والنقد والتمحيص ليبين الحق من الباطل، وببيان خطأ مناهج المخالفين لمنهج أهل السنة والجماعة يتضح صواب منهج أهل السنة والجماعة وصحته. وقد تنوعت الاتجاهات المخالفة لمنهج أهل السنة في دراسة الأديان والملل وهي نفس الاتجاهات التي خالفت منهج أهل السنة في أصول الدين، وبناءً على الأسس التي قامت عليها والقواعد التي اتخذتها في الاستدلال وفهم النصوص قامت بدراسة الأديان، مع أن بعض هذه الاتجاهات لم يكن لها جهود واضحة في دراسة الأديان. فالصوفية مثلا ليس لها جهود ظاهرة في مجال علم الأديان والملل كبعض الفرق الكلامية الأخرى؛ وذلك بسب انعزالهم عن المخالطة، ثم منهجهم في اكتساب المعرفة له إسهام في ذلك، إذ إن معظم الصوفية يفرقون بين العلم والمعرفة حيث زعموا أن المعرفة تتطلب اتصالاً مباشراً -أي دون واسطة بين العبد وخالقه- وأن لفظ العلم غير مرادف للفظ المعرفة، والمعنى أن الصوفية لم يعولوا على الحس ولا على العقل والنقل، وإنما اعتمدوا على الأحوال والأذواق والمواجيد التي من قبيل الوجدانيات التي لا تعرف بالعقل وإنما بالقلب فقط، والتي لا تستمد من تجربة ولا معلم ولا كتاب، وإنما عن تجربة ذوقية باطنية، ومعرفة القلب الذي يعرف ويشاهد (1) . فانعزال الصوفية وابتداعهم هذا المنهج الذي أدى بهم إلى إنكار المنهج الشرعي المعتمد على النقل والعقل أدى إلى عدم بروزهم في مجال علم الأديان والملل إذ إن هذا العلم من العلوم التي تعتمد على النقل والعقل. وهذا الاتجاه لا يمكن أن يمثل الإسلام ومنهجه في مجال دراسة الأديان لمخالفته منهج أهل السنة والجماعة مسلكاً ومعتقداً. أما الفلاسفة سواء كانوا من الفلاسفة الخلص أو الذين خلطوا بين الفلسفة والآراء الكلامية لم يكونوا بعيدين عن مجال علم الأديان والملل وأن الفلسفة بطبيعة موضوعها والبيئة العلمية التي كانت سائدة بالفرق الكلامية ساعدا الفلاسفة في الإسلام على الخوض في ميدان علم الأديان والملل. إن علم الأديان والملل عند هذا الاتجاه الذي نزع منزع الفلاسفة الأقدمين وأخذ بطريقتهم في تقرير الحقائق الغيبية والبحث عن أمور الدين والدفاع عنه لم يكن إلا مجموعة من الآراء والأقيسة المنطقية والتعليلات الفلسفية، وعلم الأديان والملل على منهاج هذا القوم غير مجد في تقرير الحق والدفاع عنه لأنه مبني على منهج أجنبي عن الحق، فينبغي استبعاده، ولعل مكمن الخطأ والخطورة في هذا الاتجاه يتلخص فيما يلي: 1 - أن أقوال الفلاسفة في الألوهية والنبوة والمعاد يصطدم بأصول الدين الإسلامي حيث يزعم الفلاسفة بقدم العالم، وأن الله يعلم الكليات دون الجزئيات وحشر الأرواح دون الأجساد، وجعل النبوة من جنس المنامات. 2 - الاعتماد على العقل في تقرير العقائد.",
    "foot_note":"1. انظر: الفرق الكلامية الإسلامية د. علي عبد الفتاح المغربي، ص 119، مكتبة وهبة، القاهرة، الطبعة الثانية.",
    "book_id":"69"
  },
  {
    "serial_number":"285064",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":37,
    "volume_number":1,
    "text":"أما الاتجاه الكلامي وهو من أهم الاتجاهات لكون أغلب الفرق المبتدعة تندرج تحته، فالشيعة، والماتريدية، والكلابية، والمعتزلة، والأشاعرة، وغيرها من الفرق المبتدعة التي نحت منحى عقلياً تصنف في هذا الاتجاه، كما أن هذا الاتجاه يعد من أكثر الاتجاهات اهتماماً بعلم الأديان والملل، ومع أن كل صنف من هذه الأصناف قد تناول تقرير العقيدة الإسلامية، ورد على خصومها وفق المنظار الذي ارتضاه، إلا أن الإطار الذي يجمعها هو المنهج الكلامي. فالمعتزلة مثلا كان لها جهود في علم الأديان والملل: وكان لها جولات وصولات في التصدي لأهل الأديان والملل والنحل قل أن تجد لها نظيراً في الفرق الكلامية الأخرى، وقد شملت جهودهم في الرد على اليهود والنصارى، وعلى الأديان الوضعية المجوسية والصابئة والزرادشية، والبراهمية، وعلى الزنادقة وغيرهم من المخالفين في الإسلام أو في المذهب (1) . وأخطاء المعتزلة في مجال دراسة الأديان حيث تمت دراسة علم الأديان والملل على ضوء أصولهم الخمسة: فقد آمن المعتزلة بالأصول الخمسة (2) وأخضعوا نصوص الوحي لهذه الأصول، إما بالتأويل أو برد السنة التي زعموا أنها أحاديث آحاد، ثم قاموا على ضوء تلك الأصول في مقاومة التحديات العقدية التي كان مصدرها من أهل الأديان المختلفة، فالتوحيد أو التنزيه المطلق لله الذي يقصد عند المعتزلة \"نفي صفات الرب\" كان في مواجهة القول بتعدد الآلهة الذي كان يعتقده النصارى والثنوية، والتجسيم والتشبيه الذي كان معروفاً في عقائد اليهود، والاتحاد والحلول الذي كان مصدره إما عن اليهود وإما عن أديان الهند من البراهمة والبوذية (3) . والخطأ الذي وقع فيه المعتزلة أنهم واجهوا خطأ بخطأ. أما الأشاعرة فقدموا جهوداً كبيرة في مجال علم الأديان والملل وتمثلت هذه الجهود في مصنفات مستقلة لهذا العلم، وفي مباحث ضمنت في العلوم الأخرى، خاصة في علم الكلام وفي الردود والمناظرات التي كانت تحدث بين أعلام الأشاعرة وبين أتباع الأديان والملل والنحل، ولذلك تجد أن أغلب الكتب التي تكلمت عن الملل والنحل والأديان هي من كتب الأشاعرة ومن ذلك الباقلاني الذي رد على جميع أصناف الأديان والملل والنحل وذلك من خلال كتابه التمهيد، والجويني فقدم جهوداً كثيرة من خلال كتبه الكلامية كالشامل والإرشاد ومن خلال كتابه \"شفاء الغليل\"، والغزالي الذي ألف في الرد على النصارى، ثم الشهرستاني صاحب الموسوعة ودائرة المعارف في الأديان والفرق، والبغدادي صاحب كتاب الملل والنحل؛ ولكنهم كذلك ردوا الخطأ بالخطأ بناء على عقائدهم في التوحيد والأسماء والصفات وغيره من العقائد. وسيأتي الكلام عن بيان خطاءهم في ذلك في المبحث التالي.",
    "foot_note":"1. انظر: تاريخ المذاهب الإسلامية لمحمد أبي زهرة، ص 131، دار الفكر العربي 1989 م.، مقدمات العلوم والمناهج لأنور الجندي، ص 2\/ 96 - 99، دار الأنصار، القاهرة. \n2. انظر: الأصول الخمسة عند المعتزلة لعواد المعتق. \n3. مباحث في منهجية الفكر الإسلامي، د. عبدالمجيد النجار، ص 83، دار الغرب الإسلامي، الطبعة الأولى.",
    "book_id":"69"
  },
  {
    "serial_number":"285065",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":38,
    "volume_number":1,
    "text":" المبحث الثاني: الأسس المنهجية لدراسة الأديان والملل عند أهل الكلام ونقدها:  أولاً: مصادر الاستدلال عند المخالفين: المقرر في هذه المسألة عند أغلب الفرق أن مصادر الاستدلال هي: نفس مصادر أهل السنة، قال زعيم المعتزلة واصل مبيناً مصادر الاستدلال: \"إن الحق يعرف من وجوه أربعة: كتاب ناطق، وخبر مجمع عليه، وحجة عقل، أو إجماع من الأمة\" (1) . وورد في شرح الأصول الخمسة: أن الأدلة أربعة: حجة العقل، والكتاب والسنة والإجماع (2) . هذا عند المعتزلة أما إذا جئنا إلى الأشاعرة فنجدهم يزيدون على الأربعة السابقة مصدراً آخر وهو القياس (3) . ولكن بعضهم ردّ القياس إلى النص والإجماع فانحصرت الأدلة عنده بالأربعة الأخرى (4) . وهي من الناحية النظرية قريبة إلى منهج أهل السنة وإن خالفت في التفريق بين الأحاديث المتواترة والآحاد، لكن إذا انتقلنا إلى موقف أهل الأهواء من دلالة النصوص وكيفية ترتيبها والاستدلال بها نجد أنه مخالف لمنهج أهل السنة؛ بحيث قدموا العقل على النقل، عارضوا النصوص الشرعية بالعقل إلى غير ذلك.  ثانياً: تقديم العقل على النقل: يخالف المعتزلة والأشاعرة وغيرهم من المبتدعة أهل السنة في ترتيب مصادر الاستدلال وفي حجية دلالتها، حيث قدموا العقل على النقل. ومن ثم فلا يصح الاستدلال بدليل سمعي على أية مسائل من المسائل الكلامية المتعلقة بوجود الله تعالى وصفاته وكل ما تتوقف عليه صحة النبوة. بل لقد بلغ الشطط ببعض المتكلمين حيث حاولوا توهين الدليل السمعي وإضعافه مطلقاً كتاباً كان أو سنة في قضايا العقيدة، وتقديم الدليل العقلي عليه، كما فعل الرازي حيث قال: \"إن الأدلة السمعية لا تفيد اليقين أو القطع زاعماً أن \"الأدلة اللفظية مبنية على مقدمات ظنية والمبني على المقدمات الظنية ظني: فالاستدلال بالخطاب لا يفيد إلا الظن\" (5) .",
    "foot_note":"1. انظر: نشأة الفكر الفلسفي في الإٍسلام د. علي سامي النشار 1\/ 403، دار المعارف، الطبعة الثلاثة. \n2. شرح الأصول الخمسة، لعبدالجبار بن أحمد المعتزلي، تحقيق عبدالكريم عثمان، ص 88، مكتبة وهبة، القاهرة، الطبعة الأولى. \n3. انظر: الإحكام في أصول الأحكام الآمدي 1\/ 135، تحقيق إبراهيم العجوز، دار الكتب العلمية، بيروت، الطبعة الأولى. \n4. انظر: المصدر السابق 1\/ 136. \n5. المحصول في علم أصول الفقه، للفخر الرازي تحقيق د. طه جابر العلواني، ص 1\/ 547، جامعة الإمام محمد بن سعود الإسلامية 1399.",
    "book_id":"69"
  },
  {
    "serial_number":"285066",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":39,
    "volume_number":1,
    "text":"وعلى ضوء هذا النهج الموهن لنصوص الشرع المفرط في تعظيم العقل ناقش المتكلمون أتباع الأديان الأخرى فهذا القاضي عبد الجبار يقول في معرض نقاشه عقائد النصارى: \"فأما من عول منهم في هذا الباب على إتباع من سلف والرجوع إلى الكتب وتقليد التلاميذ فقوله ساقط، لأن الكلام في صفة القديم عز وجل وما يصح عليه وما لا يصح لا يجوز أن يرجع فيه إلى السمع .. \" (1) . بل نجده يصرح أن استدلاله للنصوص حتى في المسائل التي أورد فيها نصوصاً أنه أوردها من باب الاعتضاد لا الاعتماد، يقول القاضي في فصل \" إثبات أنه صلى الله عليه وسلم مبعوث إلى الناس كافة \"بعد إيراده نصوصاً نقلية كثيرة\" وإنما نذكر هذه الألفاظ تأكيداً والعمدة ما ذكرناه من العلم الضروري بدينه وقصده .. \" (2) .  ثالثاً: التأويل الكلامي: انطلاقاً من وجوب تقديم العقل على النقل ذهب المتكلمون إلى وجوب تأويل النصوص التي رأوا أن ظاهرها يخالف العقل، يقول الغزالي: \"كلّ خبر مما يشير إلى إثبات صفة للباري عز وجل يشعر ظاهره بمستحيل في العقل، نُظِرَ إن تطرق إليه التأويل قُبِل وأول، وإن لم يندرج فيه احتمال تبين على القطع كذب الناقل\" (3) . أما الرازي فقد زعم أن المصير إلى التأويل أمر لابد منه (4) وجاء بـ \"القانون الكلي\" القائل بوجوب تقديم العقل وتأويل النقل أو تفويضه. وقد استعمل طوائف المبتدعة التأويل في مناقشاتهم مع غير المسلمين سواء في أجوبتهم عن الأسئلة الموجهة إليهم أو في النقد الذي كانوا يوجهونه للأديان الأخرى. فانظر أجوبة فخر الدين الرازي في مناظرته مع النصراني حين زعم النصراني أن في القرآن آيات موهمة للتشبيه ومثل بقوله تعالى: {الرَّحْمَنُ عَلَى الْعَرْشِ اسْتَوَى (5)} [طه: 5] (5) وقوله تعالى: {رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا (22)} [الفجر: 22] (6) وقوله تعالى: {وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ} [الزمر: 67] (7) وآيات من الآيات الدالة بصفات الرب الاختيارية (8) ، فقال الفخر الرازي مجيباً وفق مذهب النافي للصفات الاختيارية: \"وأما الجواب عن الأحاديث والآيات الموهمة للتشبيه، فاعلم أنه إذا ثبت عند كلّ عاقل مثلا أن الجدار جماد لا حي ثم يوصف بعد ذلك بالإرادة في قوله تعالى: {جِدَارًا يُرِيدُ أَنْ يَنْقَضَّ} [الكهف: 77] (9) علم قطعاً بضرورة العقل أن وصفه بالإرادة إنما هو على سبيل المجاز لا على سبيل الحقيقة\" (10) .",
    "foot_note":"1. المغني في أبواب التوحيد والعدل للقاضي عبدالجبار المعتزلي، تحقيق محمود محمد الخضري، ص 5\/ 142. \n2. المصدر السابق 16\/ 424، تحقيق أمين الخولي. \n3. المنخول من تعليقات الأصول، لأبي حامد الغزالي تحقيق محمد حسن هيتو ص 286. \n4. انظر: أساس التقديس لفخر الرازي تحقيق د. أحمد حجازي السقا ص 95 دار الجيل - بيروت. \n5. سورة طه الآية: 5. \n6. سورة الفجر الآية: 22. \n7. سورة الزمر الآية: 67. \n8. انظر: مناظرات في الرد على النصارى للرازي، تحقيق عبدالمجيد النجار، ص 57 - 58، دار الغرب الإسلامي، بيروت 1986. \n9. سورة الكهف الآية: 77. \n10. مناظرات في الرد على النصارى ص 69.",
    "book_id":"69"
  },
  {
    "serial_number":"285067",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":40,
    "volume_number":1,
    "text":"واستمر في الإجابة حتى قال: \"فكذلك إذا علم أن الباري تعالى منزه عن الجسمية والعرضية والحد والجهة والأعضاء والجوارح والحركة والسكون ومنزه عن الميل والحظ والنفور والرقة، ثم إنه وصف بعد ذلك بالمحبة والرضا والسخط والهمة أو بالحركة والجارحة علم قطعاً أن إطلاق ذلك عليه مجاز لا حقيقة .. \" (1) . كذلك نجد القاضي عبد الجبار يسلك نفس المنهج مع النصارى فيقول في مناقشته معهم: \"ولو ثبت ما ادعوه سمعا، لوجب أن يتأول على وفق ما يقتضيه العقل\" (2) ، وإذا جئنا إلى الغزالي في كتابه الرد الجميل فإننا نجد لفظ \"التأويل\" تكرر في الكتاب فتجدها في ديباجة الكتاب كما تجدها في خاتمته، بل نجد الغزالي يقرر أصلين ذكر أنهما متفق عليهما بين أهل العلم: أحدهما: أن النصوص إذا وردت فإن وافقت المعقول تركت وظواهرها. وإن خالفت صريح المعقول وجب تأويلها، واعتقاد أن حقائقها ليست مرادة، فيجب ردها إذ ذاك إلى المجاز. الثاني: أن الدلائل إذا تعارضت، فدل بعضها على إثبات حكم، وبعضها على نفيه، فلا نتركها متعارضة، إلا وقد أحسسنا من أنفسنا العجز باستحالة إمكان الجمع بينها، وامتناع جمعها متظافرة على معنى واحد (3) . ثم شرع في نقد عقائد النصارى على ضوء هذين الأصلين حيث أول نصوص الأناجيل التي ظاهرها يدل على ألوهية عيسى عليه السلام مستدلا بالنصوص الدالة على إنسانيته، والمقصود هنا بيان أن التأويل الكلامي الذي بسببه عطل عموم أهل الأهواء والمتكلمون بوجه خاص النصوص الشرعية كان أحد الأسس المنهجية في دراسة الأديان عند المتكلمين.  رابعاً: الاعتماد على المنطق والفلسفة: من الأسس التي يقوم عليها منهج المخالفين: الاعتماد على القواعد المنطقية والطرق الفلسفية واستخدام مصطلحاتها في تقرير العقائد، فقد حاول أصحاب المقالات الدفاع عن الإسلام وحقائقه بالمنطق، واستعملوا الأسلوب الفلسفي لمواجهة الاستدلالات الفلسفية التي استعملها أتباع الأديان، وأهل الإلحاد. وقد لا تجد عناء في ضرب أمثلة تدل على استعمال أهل الكلام الفلسفة في دراسة الأديان؛ إذ أن كلّ كتب أهل الأهواء في المقالات -إلا ما ندر- بنيت على هذا الأساس، فألفاظ: الجوهر، والعرض، والجسم، والمتحيز، والمركب، والأحوال المتضادة هي ما يقابلك في افتتاح تلك الكتب عند أول أصل يجب إثباته وهو وجود الله، فهذا الفخر الرازي يقول في صدر مناظرته مع النصراني: \"فقلت له الكلام في النبوة لابد وأن يكون مسبوقاً بمعرفة الإله، وهذا الذي تقوله باطل، ويدل عليه وجوه: الوجه الأول: أن الإله عبارة عن وجود واجب الوجود لذاته، بحيث لا يكون جسماً ولا متحيزاً ولا عرضا … \" (4) .",
    "foot_note":"1. المصدر السابق ص 70. \n2. المغني في أبواب التوحيد والعدل 5\/ 142. \n3. الرد الجميل لألوهية المسيح، لأبي حامد الغزالي، تحقيق عبدالعزيز عبد الحق حلمي، 242 - 243، الهيئة لشؤون المطابع الأميرية، المكتبة العصرية، بيروت، 1393. \n4. مناظرات في الرد على النصارى ص 22.",
    "book_id":"69"
  },
  {
    "serial_number":"285068",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":41,
    "volume_number":1,
    "text":"النقد لمناهج علم الكلام: يتبين لنا مما سبق أن مناهج علماء الكلام قد انحرفت عن المسار الصحيح بسب انتهاجها ذلك النهج المغرق في الاستدلالات الأرسطية والمقدمات العقلية الموغلة في الجدل والمراء، ولقد وجه إلى هذا المنهج نقد لاذع من قبل أساطين علم الكلام قبل معارضيه وتاب عنه كثير منهم، أمثال أبي حامد الغزالي، وفخر الدين الرازي، وإمام الحرمين الجويني (1) . فعلم أن المنهج الكلامي -وإن قصد به الدفاع عن الإسلام- قد أدى إلى نقيض القصد وانكشفت أخطاؤه للعيان، ولعل أهم هذه الأخطاء تتلخص فيما يلي: أولا: أنه نأى عن منهج القرآن في الدعوة إلى تثبيت العقيدة أو الدفاع عنها وآثر عليه نظريات وبراهين تثير من الشبه أكثر مما ثير من الإقناع فأوقعت أهلها في الحيرة والشك -فضلاً عن غيرهم-، قال شيخ الإسلام: \"إنك تجد أهل الكلام أكثر الناس انتقالاً من قول إلى قول وجزماً بالقول في موضع، وجزماً بنقيضه وتكفير قائله في موضوع آخر، وهذا دليل عدم اليقين\" (2) ، وصرح الشهرستاني كما ذكر ابن تيمية: \"أنه لم يجد عند الفلاسفة والمتكلمين إلا الحيرة والندم\" (3) . ثانياً: إن مناهج المخالفين بعد أن اختلطت فيها طريقة الكلام وطريقة الفلسفة أصبحت مناهج نظرية بحتة تنظم المقدمات وتستخلص النتائج خلافا للمنهج القرآني الذي يخاطب العقل ويستثير العاطفة والفكر في تكوينه للعقيدة. ثالثاً: إن أهل الأهواء باعتمادهم على العقل وحده وتحكيمه في كل شيء حتى فيما لا يقدر عليه كالأمور الغيبية، قد جنوا على العقل والشرع معاً، إذ حرفوا الشرع بسبب التأويل الباطل، وفرقوا الناس كل تفريق، وأوقعوهم في شنئان وبغضاء مما أعطى الأعداء فرصة للشماتة على الإسلام وأهله. رابعاً: إن مناهج أهل الأهواء جنت على الإسلام حيث قدمته إلى الناس في غير حقيقته بسبب تأويل أو رفض بعض النصوص كما جنت على غير المسلمين حيث حجبت عنهم حقيقة الإسلام ودعتهم إلى البدع والآراء المتناقضة.",
    "foot_note":"1. انظر: مجموع الفتاوى 4\/ 72 - 73. \n2. مجموع الفتاوى 4\/ 50. \n3. المصدر السابق 4\/ 73.",
    "book_id":"69"
  },
  {
    "serial_number":"285069",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":42,
    "volume_number":1,
    "text":"خامساً: ضعف مناهج أهل الأهواء في الدفاع عن الحق وقصورهم في الرد على الباطل، قال شيخ الإسلام: \" ومن أعظم أسباب بدع المتكلمين من الجهمية وغيرهم قصورهم في مناظرة الكفار والمشركين، فإنهم يناظرونهم ويحاجونهم بغير الحق والعدل لينصروا الإسلام- زعموا بذلك- فيسقط عليهم أولئك لما فيهم من الجهل والظلم ويحاجونهم بممانعات ومعارضات، فيحتاجون حينئذ إلى جحد طائفة من الحق الذي جاء به الرسول صلى الله عليه وسلم والظلم والعدوان لإخوانهم المسلمين بما استظهر عليهم أولئك المشركون فصار قولهم مشتملا على إيمان وكفر وهدى وضلال ورشد وغي، وجمع بين النقضين وصاروا مخالفين للكفار والمؤمنين كالذين يقاتلون الكفار والمؤمنين .. \" (1) . ومع هذا كله فإن من العدل والإنصاف أن نذكر لعلماء الكلام فضلهم في مجال علم الأديان والملل، فقد كان لهم دور في الرد على الباطل وقطع حجج المبطلين، وهذا مما يحمد لهم، قال شيخ الإسلام: \"وكذلك متكلمة أهل الإثبات مثل الكلابية، والكرامية، والأشعرية، إنما قبلوا واتبعوا واستحمدوا إلى عموم الأمة بما أثبتوا من أصول الإيمان من إثبات الصانع وصفاته، وإثبات النبوة، والرد على الكفار من المشركين وأهل الكتاب وبيان تناقض حججهم .. \" (2) ، لكن هذا الجهد لا يعفيهم عن النقد بسبب أخطائهم المنهجية والعقدية التي سيق ذكرها. كلّ ما سبق يؤكد لنا أن منهج السلف الموافق لمنهج القرآن المنضبط بالضوابط الشرعية هو المنهج الوحيد الذي ينبغي أن تدرس على ضوئه الأديان والملل، وهو المنهج المناسب لمواجهة التحديات المعاصرة في مجال دراسة الأديان والملل (3) .",
    "foot_note":"1. مجموع الفتاوى الكبرى لابن تيمية 5\/ 35، دار القلم، بيروت، الطبعة الأولى. \n2. درء التعارض 8\/ 275. \n3. انظر: علم الملل ومناهج العلماء فيها ص 252 - 343.",
    "book_id":"69"
  },
  {
    "serial_number":"285070",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":43,
    "volume_number":1,
    "text":" المبحث الثالث: مناهج الكفار في دراسة علم الأديان لم يعرف الغرب دراسة علم الأديان والملل بمفهومه العلمي قبل العصر الحديث والسبب في ذلك هو أن النصارى لم يكونوا يعترفون بوجود الديانات الأخرى، بل كانوا يعتبرون ما عدا النصرانية \"هرطقة\" وكان جل اهتمام رجال الدين في ذلك ينصب على الدراسات اللاهوتية، وتفنيد الآراء أو الأديان التي يرون أنها تشكل خطورة على عقائد النصرانية، أضف إلى ذلك أن النصرانية كانت مصونة -حسب زعمهم- بقدسية تمنع توجيه أي انتقاد إليها. لكن بدءا من عصر النهضة الأوروبية - القرن الخامس عشر الميلادي- بدأ تحول كبير فبدأ الإنسان الغربي ينتقد الديانة النصرانية كما بدأ اهتمامه بمعرفة الديانات الأخرى وعقائد الأمم المختلفة. ويحدد بعض العلماء أن ظهور المصطلح \"مقارنة الأديان\" أو \"الدين المقارن\" عند الغربيين كان في نهاية القرن التاسع عشر ليدل عندهم على الدراسة العلمية للأديان للتفريق بين هذا النوع الجديد من الدراسة وبين الدراسات اللاهوتية التي عرفتها النصرانية منذ نشأتها. ثم اتسع نطاق علم مقارنة الأديان في القرن العشرين ليشمل: \"تاريخ الأديان\"، و\"فلسفة الأديان\"، و\"علم الاجتماع الديني\" و\"علم نفس الدين\" و \"فينومولوجيا الدين\". وخلاصة القول: أن علم الأديان في الغرب الحديث كان وليد الصراع بين الدين النصراني وبين رواد النهضة الأوروبية، ولم يكن الذين تبنوه رجال الدين، وإنما كانوا الفلاسفة المناهضين ضد الكنيسة ورجالها.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285071",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":44,
    "volume_number":1,
    "text":" المبحث الرابع: مناهج المستشرفين في دراسة علم الأديان والملل وتقويمه: رغم تعدد اتجاهات المستشرقين واختلاف مشاربهم وتباين مجالاتهم وتفاوت قدراتهم العلمية إلا أنهم في الغالب ينتهون في دراساتهم للملل -خاصة الإسلام- إلى نتائج واحدة، وذلك أنهم ينطلقون من مسلمات واحدة ويصدرون من أسس منهجية خطت لأهداف محددة.  المطلب الأول: المسلمات التي انطلق منها المستشرقون: 1 - الانطلاق من النصرانية المحرفة كمعيار لتقويم الأديان الأخرى التي هي موضع البحث والدراسة -خاصة الإسلام- بحيث لا تكون هذه الأديان مقبولة ما لم تتفق مع المقولات الرئيسة للنصرانية، واعتبار كلّ ما يشذ عن النموذج الروحي النصراني نقصاً أو قصوراً يعبر عن فساد هذا الدين وضعفه وعدم معقوليته. 2 - إنكار نبوة محمد صلى الله عليه وسلم أو اعتبارها خاصة بالعرب، واعتبار القرآن من تأليفه. فالمستشرقون إما علمانيون لا يؤمنون بالغيب، أو أهل كتاب لا يؤمنون بصدق الرسالة التي أعقبت النصرانية. 3 - مساواة الدين الإسلامي بغيره من الأديان الوثنية كأديان الهند والصين، والأديان السماوية المحرفة: يقول المستشرق جب: \"إن الدين الإسلامي في ذاته واحد من مجموعة الأديان التي تشتمل إلى جانب المجوسية واليهودية والمسيحية، وهو يقاسمها نفس المبادئ الأساسية\" (1) . 4 - الانطلاق من نظرة عنصرية عرقية تختزل الإنسانية في عرقين \"نحن\" و \"هم\" حيث قسمت شعوب الأرض إلى أجناس راقية وأخرى متخلفة، فالأولى شعوب آرية والثانية شعوب سامية. 5 - اعتبار الخبرة الأوروبية نموذجاً معياريا للتطور البشري، وقد ساد الدراسات الاستشراقية نوع من المقارنة غير العلمية حيث أخضع تاريخ الإسلام ونظمه الاجتماعية للمعايير الغربية بحيث صارت التجربة الأوروبية تمثل المرجع الذي يجب أن تحتذيه المجتمعات الأخرى. 6 - الانطلاق من الموقف المعادي للإسلام ونبيه صلى الله عليه وسلم والمسلمين، فقد كان أكثر المستشرقين ينطلق من منطلق عقدي يؤججه الحقد الصليبي على الإسلام، والتعصب الذي يعمي الأبصار عن الحقائق. إن الانطلاق من هذه المنطلقات وتلك المسلمات عندهم هي التي أدت بالمستشرقين إلى استخدام أساليب غير علمية ومناهج لا تؤدي إلى نتائج صحيحة في مجال الدراسات الإسلامية.",
    "foot_note":"1. مناهج علم الكلام في مواجهة القضايا الفكرية المعاصرة، لرزق يوسف، ص 202 - 203، رسالة دكتوراه في كلية دار العلوم - القاهرة نقلاً عن كتاب وجهة الإسلام: نظرة في الحركات الحديثة في العالم الإسلامي للمستشرق جب، ترجمة محمد عبد الهادي، المطبعة الإسلامية، 1933.",
    "book_id":"69"
  },
  {
    "serial_number":"285072",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":45,
    "volume_number":1,
    "text":" المطلب الثاني: مناهج المستشرقين في دراسة الأديان والملل: استخدم المستشرقون في دراسة الملل بصفة عامة والدراسات الإسلامية بصفة خاصة مناهج عديدة مجتمعة أو متفرقة وأهم هذه المناهج:  1 - المنهج النقدي التاريخي: فقد بدأ النقد التاريخي للكتب المقدسة عند الغرب في القرن السابع عشر، وذلك بعد نشر الكتب المقدسة بعدة لغات حتى يمكن المقارنة بين النصوص المختلفة … من أجل البحث عن النص الأصلي، فأخضع نصوص العهدين لنقد التاريخي بدءا من نشأتها، واشتمل هذا النقد على كل ما يتعلق بالعهدين من ترجمة أو شروح، وفي القرن التاسع عشر أخذ هذا المنهج يتسع ويتحول إلى ما سموه بالنقد العلمي القائم على تحقيق النصوص والمقارنة بينها، والاعتماد على فقه اللغة، وعلم الأساطير المقارنة في هذا القرن، تم وضع قواعد هذا المنهج وبرزت مدارسه المختلفة. وقد قاد هذا المنهج الغربيين إلى الإلحاد، وذلك عندما عرفوا أن ديانتهم غير صحيحة، ومهما يكن من أمر فإن الغرب ممثلاً بالدراسات الاستشراقية قد طبق هذا المنهج على الدراسات الإسلامية، يقول بارت: \"ونحن في هذا نطبق على الإسلام وتاريخه وعلى المؤلفات العربية التي نشتغل بها المعيار النقدي نفسه، الذي نطبقه على تاريخ الفكر عندنا، وعلى المصادر المدونة لعالمنا نحن\" (1) . ومع هذا الادعاء من \"بارت\" فإن تطبيق هذا المنهج على الدراسات الإسلامية لم يكن كتطبيقه على الدراسات النصرانية أو اليهودية لما ذكر سابقا من أن الغرب انطلق في دراسته من منطلق عدائي للإسلام، ولما كان يحمله المستشرقون من أحكام مسبقة، ولذا يقال: إن أغلب الغربيين لم يخلصوا لهذا المنهج في دراساتهم للإسلام ولو أخلصوا لقواعده لأمكن لهم الوصول إلى نتائج صحيحة.  2 - المنهج التحليلي: المنهج التحليلي هو أحد المناهج التي طبقها المستشرقون على الدراسات الإسلامية، ويعني هذا المنهج تفتيت الظاهرة الفكرية، أو الموضوع المطلوب دراسته إلى مجموعة من العناصر يتم التأليف بينها في حزمة لا متجانسة من العوامل أو الوقائع التي أنشأها، أي أن هذا المنهج يقوم بتفتيت الظاهرة الفكرية وردها إلى عناصرها الأولية كالظروف الاجتماعية أو السياسية أو الدينية، فإذا طبق المستشرق هذا المنهج وهو متأثر بمزاجه وثقافته وبيئته ودينه الذي نشأة فيه فإنه يصل به في الدراسات الإسلامية إلى نتائج غير سليمة. وذلك أنهم من خلال هذا المنهج يأتون بكل تفسير غريب، ويعيدون المفاهيم الإسلامية إلى غير أصول إسلامية.",
    "foot_note":"1. الدراسات العربية والإسلامية في الجامعات الألمانية رودي بارت ترجمة مصطفى ماهر، ص 10، دار الكاتب العربي، القاهرة 1967.",
    "book_id":"69"
  },
  {
    "serial_number":"285073",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":46,
    "volume_number":1,
    "text":" 3 - المنهج الإسقاطي: أعني إسقاط الرؤية الوضعية العلمانية والتأثيرات البيئية المعاصرة على الوقائع التاريخية حيث درس الإسلام، سواء عقيدة أو سيرة وتاريخ بمفاهيم غربية معاصرة، ومقارنته بالمعطيات التاريخية الغربية. فبين الرواسب الدينية والنزعة العلمانية والآراء الفلسفية، درس الإسلام من خلال رؤية وضعية منحصرة على المنظور، ترفض كل ما هو روحي أو غيبي، على أساس أنه سقوط في مظلة الخيال، والخرافة، واللاعلمية. فلم ينتج من تطبيق هذا المنهج على الدراسات الإسلامية إلا أحكام تعسفية لا صلة لها بالتحليل العلمي السليم (1) .  4 - منهج الأثر والتأثر: يرى بعض الباحثين المعاصرين أن من شروط الباحث في علم الأديان أن لا يسرع عند المقارنة في تحديد الصلة بين ظاهرتين في دينين قبل أن يظهر له نوع العلاقة بينهما، أهي مشابهة أم مماثلة أم تضاد أم تناقض حتى لا يقع في الخطأ (2) . وهذا ما يقتضي العدل والإنصاف، لكن عندما نأتي إلى منهج المستشرقين في الدراسات الإسلامية نجدهم يطبقون هذا المنهج بطريقة ماكرة وبدون ضوابط، فهم من خلال هذا المنهج يتوصلون إلى أن الإسلام ليس إلا مزيج مستمد من الأديان الأخرى والنحل الباطلة. إن هذه المناهج التي استخدمها المستشرقون في الدراسات الإسلامية -من النقد التاريخي، والمنهج التحليلي، ومنهج الأثر والتأثر، والمنهج الإسقاطي- تخالف تلك المناهج التي استخدمها علماء المسلمين في مجال دراسة الأديان، وإن تشابهت في الظاهر، أو اتفقت معها في المسمى، ذلك أن الهدف الذي من أجله استخدمه علماء المسلمين يختلف عن أهداف الغرب منه، حيث كانت مناهجهم مبنية على العدل والإنصاف، فلم يحدث من علماء المسلمين أن تقولوا على أهل دين، ولم يحرفوا تاريخ أمة. كما لم يأتوا بتحليلات واستنتاجات ليس لها أساس من الصحة، وكيف يمكن عنهم ذلك وقصدهم معرفة حقيقة الأديان كما هي في الواقع، ليمكن لهم تطبيق شرع الله على أهلها. أما المستشرقون فهم إما قوم أكل الحقد الصليبي أكبادهم، أو يهود ملأ الحقد قلوبهم، وأعماهم الكبر، أو علمانيون، وملحدون ينطلقون من خلفية دينية مع الإلحاد والكفر، فازدادوا كفرا مع كفرهم.",
    "foot_note":"1. انظر: الظاهرة الاستشراقية ص 1\/ 202 - 203. \n2. دراسات في اليهودية بين الملة والنحلة والحركة، د. جبر محمد حسن جبر ص 8 - 9.",
    "book_id":"69"
  },
  {
    "serial_number":"285074",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":47,
    "volume_number":1,
    "text":" المطلب الثالث: أساليب المستشرقين في الدراسات الإسلامية: ومما يكشف لنا حقيقة أهداف المستشرقين من خلال منهجهم هذا، الأساليب التي استخدموها لتحقيق هذه المناهج، أو السمات الدالة على الخيانة المنهجية، وأبرز هذه الأساليب:  1 - الأسلوب الانتقائي: إن المستشرقين لا يدرسون الإسلام كوحدة متكاملة، وإنما يدرسون منه موضوعات انتقوها، فيهتمون بالموضوعات التي يرون أنهم يستطيعون توظيفها على حسب أهوائهم وخاصة الموضوعات التي تمثل جانباً سلبياً في تاريخ الأمة الإسلامية كالفرق المبتدعة \" إن المنهج الغربي الوافد يتحدث في حفاوة ضخمة عن الاعتزال والمعتزلة، ويرى أن سقوطهم كان مصدر خطر كبير على الفكر الإسلامي، وأن منهجهم هو أصدق المناهج التي عرفها هذا الفكر .. \" (1) . ومن الانتقاء أيضاً انتقاء المصادر: فهم ينتقون المصادر التي يعتمدون عليها في الدراسات الإسلامية، هذا إذا لم يلقوها كلياً، فمصادرهم المفضلة هي كتب الأدب، وكتب الفرق المنحرفة عن المنهج الصحيح، ومن ذلك أيضاً انتقاء الأدلة، وذلك أنه قد يرد في الموضوع الذي يدرسونه أدلة صحيحة وأدلة ضعيفة، أو شاذة، فيختارون الأدلة الشاذة لكونها توافق أهواءهم، ويتجاهلون أو يتعامون عن الأدلة الصحيحة، أو يشككون في صحتها.  2 - التحريف وقلب الحقائق: يحرف المستشرقون النصوص … تحريفاً مقصوداً، أو يقلبون معانيها حين لا يجدون مجالاً للتحريف؛ وذلك باستعمال ما يسمى منهج العكس، وهو أن يأتي المستشرق إلى أوثق الأخبار وأصدق الأنباء فيقلبها -متعمداً- إلى عكسها.  3 - الكذب والاختلاق: من الأساليب الماكرة الدالة على سوء الطوية، والمخلة للمنهجية عند المستشرقين: استخدام أساليب الخداع والتمويه، كالعزو إلى مصادر ومراجع غير موجودة، من ذلك ما ذكر الدكتور عبد الرحمن بدوي عن المستشرق لامانس حيث يقول: \"وأبشع ما فعله لامانس خصوصاً في كتابه فاطمة وبنات محمد صلى الله عليه وسلم هو أنه يشير في الهوامش إلى مراجع بصفحاتها وقد راجعت معظم هذه الإشارات في الكتب التي أحال إليها، فوجدت أنه إما أن يشير على مواضع غير موجودة إطلاقاً في هذه الكتب، أو يفهم النص فهماً ملتوياً، خبيثاً أو تستخرج الزامات بتعسف شديد، يدل على فساد الذهن، وخبث النية، ولهذا ينبغي ألا يعتمد القارئ على إشاراته إلى مراجع، فإن معظمها تمويه وكذب وتعسف في فهم النصوص\" (2) .",
    "foot_note":"1. أخطاء المنهج الغربي الوافد ص 130. \n2. موسوعة المستشرقين د. عبد الرحمن بدوي، ص 348، دار العلم للملايين، بيروت 1984.",
    "book_id":"69"
  },
  {
    "serial_number":"285075",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":48,
    "volume_number":1,
    "text":" 4 - الاعتماد على الفرضيات والتخمين: إن الاعتماد على الفرضيات والتخمينات سمة مميزة لمنهج الغربيين لدراسة الأديان، وهو أحد الأسباب التي أوقعتهم في الاضطراب المنهجي، وهو الأسلوب المفضل عند المستشرقين في الدراسات الإسلامية، يقول المستشرق مونتجمري وات: \"لما كانت معارفنا مبتورة تعتمد على مصادر إسلامية ما عدا النقوش، فهناك مكان كبير للافتراض والتخمين، ولن نعالج هنا هذا الموضوع، يكفي أن نذكر بأنه من المتفق عليه عادة أن عبادة الأوثان لم يعد لها تأثير أيام محمد\" (1) .  5 - ادعاء الموضوعية والتجرد: من الأساليب الخادعة التي يستخدمها المستشرقون ادعاء الموضوعية والتجرد عن الأهواء لكن إذا جئنا إلى الواقع لن نجد له أثراً بل العكس هو الصحيح وهو أمر يعترف به المستشرقون أنفسهم، والغريب أنك تجد في أغلب مقدمات مؤلفات المستشرقين الزعم بالتزام الموضوعية في دراستهم للإسلام. بيد أنك لا تخطو خطوة واحدة بعد المقدمة إلا ويفاجئك هذا المستشرق نفسه ما يناقض ادعاءه. إن المستشرقين تناولوا الأديان بهذه المناهج واستخدموا تلك الأساليب في الدراسات الإسلامية خاصة، فجاءت دراساتهم بالنسبة للإسلام مملوءة بالتشكيك والطعن، والقول ببشرية مصدره. ومهما يكن من أمر فإن الاستشرق قد مثل في العصر الحديث رأس الحربة التي استخدمها الأعداء ضد الإسلام. ولا تخفى آثاره الخبيثة في الأمة الإسلامية عن أحد، والمؤسف له أن نجد في المسلمين من يمجد مناهج المستشرقين، ويدعي أن منهجهم هو المنهج العلمي الصحيح، ومن المؤسف أن يملأ إنتاج هؤلاء المتعصبين الساحة الإسلامية، وأن يكون منهجهم معياراً للتقويم وللنقد في كثير من المؤسسات العلمية في العالم الإسلامي، وأن يكون \"علم الأديان والملل\" الذي وظيفته مواجهة تحدي هؤلاء محاكماً في بعض دور العلم على منهج هؤلاء. والمقصود هنا من بيان منهج المستشرقين هو أن هؤلاء المستشرقين أخطر على الإسلام من أي قوة أخرى، وأنهم دخلوا في هذا المجال وهم ليسوا أهلاً له، لأنهم مجردون عن الموضوعية، والأمانة العلمية، ناهيك بما يضمرون أو يعلنون، للإسلام من حقد وكيد نابع عن عداء عقدي قديم قدم هذا الدين، ومع ذلك -وللأسف الشديد- لن نعدم من بين المسلمين من يمجد هذا المنهج، ويجمع له ألواناً من المدح والثناء، ويجعله معياراً وميزاناً للبحوث العلمية، حتى العلوم الشرعية كعلم الأديان والملل الذي وظيفته الدفاع عن الدين. إن الخروج عن تبعية وتقليد الأعداء ليفرض علينا أن نعود إلى أصالتنا، وذلك بالعودة إلى الإسلام، والتحرر عن المناهج الوافدة، وإذا كان من أخطر المناهج الوافدة علينا منهج دراسة الأديان، أو تاريخ الأديان، أو مقارنة الأديان حسب ما يسمونه في الغرب لكونه يهتم دراسة هذا الدين عقيدة، وشريعة، وسياسة وغيرها، فإن ذلك ليضع علم الملل، وتصحيح نهجه في بداية سلم منظومتنا الإسلامية، ولن يتم هذا التصحيح إلا بالعودة إلى الضوابط الشرعية التي قررها أهل العلم، وبالتحرر عن مناهج الغرب جملة وتفصيلاً، ولن يكون التحرر كاملاً إلا إذا جاء بديل في هذا المجال من موسوعات علمية، ودوائر معارف، تغني الباحثين عن المصادر الغربية.",
    "foot_note":"1. محمد في مكة، مونتجمري وات ترجمة شعبان بركات، ص 51، المكتبة العصرية، بيروت.",
    "book_id":"69"
  },
  {
    "serial_number":"285076",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":49,
    "volume_number":1,
    "text":" الخاتمة 1 - تبين أن علم الأديان والملل من العلوم الشرعية التي دلت على مشروعيته الكتاب والسنة ومواقف السلف، وأن مشروعيته منوطة بموافقته للمنهج القرآني. 2 - من خلال مناهج العلماء في علم الأديان والملل اتضح أن علماء السلف التزموا بالمنهج الشرعي. 3 - تبيين من خلال البحث أن هناك مناهج مخالفة لأهل السنة والجماعة في دراسة علم الأديان، وهما منهجان: الأول: مناهج أهل الكلام ومن وافقهم. الثاني: مناهج الكفار والمستشرقين. 4 - أن لبعض المناهج المخالفة لمنهج أهل السنة دور في دراسة علم الأديان كأهل الكلام، والذي يجعل العبء على أهل السنة كبير في أن يقوم بهذا الواجب؛ حتى لا يغتر أحد بالمناهج المخالفة. 5 - أن هذه المناهج تخالف أهل السنة في مصادر ومناهج الاستدلال، وفي طريقة العرض والرد، وفي طريقة البحث. 6 - أن البحث في علم الأديان ودراستها لها عدة مناهج منها: المنهج الوصفي التاريخي، والمنهج التحليلي النقدي، والمنهج المقارن، والمنهج العلمي التجريبي، والمنهج الشامل. 7 - أن أهل السنة استخدموا من هذه المناهج ما يوافق الحق ويوصل إليه، بضوابطه الشرعية، بخلاف المخالفين لهم فإنه استخدموا ما يوافق أهوائهم، ويخدم أهدافهم، ويحقق غاياتهم. هذا وأسأل الله تعالى أن يعز دينه وينصر كلمته وأن يهدينا لما فيه خير وعزة أمتنا ونصرة دينها فهو تعالى الموفق والهادي إلى سواء السبيل. وصلى الله وسلم وبارك على نبينا محمد، الذي بين لنا سبيل الحق وأمرنا بإتباعه، ووضح لنا سبيل الضلال والغي ونهانا عن الوقوع فيه، وآله وصحبه ومن تبعهم بإحسان إلى يوم الدين.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285077",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":50,
    "volume_number":1,
    "text":" فهرس المراجع 1 - الإحكام في أصول الأحكام أبي الحسن علي بن علي الآمدي، تحقيق إبراهيم العجوز، دار الكتب العلمية، بيروت، الطبعة الأولى. 2 - أخطاء المنهج الغربي الوافد، لأنور الجندي، دار الكتاب اللبناني، بيروت. 3 - الأديان دراسة تاريخية مقارنة -القسم الأول، د. رشدي عليان وسعدون الساموك، وزارة التعليم العالي والبحث العلمي، جامعة بغداد. 4 - أساس التقديس لفخر الرازي تحقيق د. أحمد حجازي السقا دار الجيل - بيروت. 5 - الاعتصام لأبي إسحاق إبراهيم بن موسى الشاطبي، دار الفكر. 6 - أعلام الموقعين لابن القيم، الكتب العلمية، بيروت، الطبعة الأولى. 7 - الإيضاح لناسخ القرآن ومنسوخه أبي محمد مكي ابن أبي طالب القيسي تحقيق أحمد حسن فرحان، جامعة الإمام محمد بن سعود الإسلامية، الطبعة الأولى. 8 - بدائع الفوائد لابن القيم، دار الكتاب العربي، بيروت. 9 - تاريخ المذاهب الإسلامية لمحمد أبي زهرة، دار الفكر العربي 1989 م. 10 - تحفة الأحوذي شرح سنن الترمذي، لأبي العلا محمد بن عبدالرحمن المباكفوري، دار الكتب العلمية، بيروت، الطبعة الأولى. 11 - تفسير ابن كثير، دار المفيد، بيروت الطبعة الأولى. 12 - التوحيد الخالص أو الإسلام والعقل د\/ عبد الحليم محمود، دار الكتب الحديثة، 1973. 13 - جامع البيان عن تأويل آي القرآن، لأبي جعفر محمد بن جرير الطبري، مطبعة مصطفى البابي الحلبي وأولاده، الطبعة الثالثة. 14 - جامع الرسائل، لابن تيمية، تحقيق محمد رشاد سالم، مطبعة المدني، القاهرة، الطبعة الأولى. 15 - الجواب الصحيح لمن بدل دين المسيح لابن تيمية، مطبعة المدني، القاهرة، وطبعة دار العاصمة، ودار الفضيلة تحقيق علي الألمعي وعبد العزيز العسكر وحمدان الحمدان، الطبعة الأولى. 16 - درء تعارض العقل والنقل لابن تيمية، تحقيق محمد رشاد سالم، طبعة جامعة الإمام محمد بن سعود الإسلامية 1402. 17 - الدراسات العربية والإسلامية في الجامعات الألمانية رودي بارت ترجمة مصطفى ماهر، دار الكاتب العربي، القاهرة 1967.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285078",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":51,
    "volume_number":1,
    "text":"18 - دراسات في اليهودية بين الملة والنحلة والحركة، د. جبر محمد حسن جبر. 19 - الرد الجميل لألوهية المسيح، لأبي حامد الغزالي، تحقيق عبدالعزيز عبدالحق حلمي، الهيئة لشؤون المطابع الأميرية، المكتبة العصرية، بيروت، 1393. 20 - الرد على المخالف من أصول الإسلام بكر أبو زيد، دار الهجرة، الطبعة الثانية. 21 - سنن ابن ماجه، لأبي عبدالله محمد القزويني، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419. 22 - سنن أبو داود، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419. 23 - سنن الترمذي، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419. 24 - السيرة النبوية لأبي محمد عبد الملك بن هشام مراجعة وتعليق محمد محي الدين عبدالحميد، مكتبة التراث، القاهرة. 25 - شرح الأصول الخمسة، لعبدالجبار بن أحمد المعتزلي، تحقيق عبدالكريم عثمان، مكتبة وهبة، القاهرة، الطبعة الأولى. 26 - شرح العقيدة الطحاوية لابن أبي العز الحنفي تحقيق د. التركي والأرنؤوط، مؤسسة الرسالة، 1415. 27 - الصحاح في اللغة والعلوم للجوهري، تحقيق نديم مرعشلي، وأسامه مرعشلي، دار الحضارة العربية، بيروت، الطبعة الأولى. 28 - صحيح البخاري، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419. 29 - صحيح مسلم، اعتنى به أبو صهيب الكرمي، دار الأفكار، طبعة عام 1419. 30 - الظاهرة الاستشراقية وأثرها على الدراسات الإسلامية، لسياسي سالم الحاج، مركز الدراسات العالم الإسلامي، الطبعة الأولى. 31 - علم الملل ومناهج العلماء فيه، تأليف أحمد جود، الطبعة الأولى، دار الفضيلة، الرياض. 32 - عون المعبود شرح سنن أبي داود، لأبي الطيب محمد شمس الحق العظيم آبادي، دار الكتب العلمية، بيروت، الطبعة الأولى. 33 - الفتاوى الكبرى لابن تيمية، دار القلم، بيروت، الطبعة الأولى. 34 - فتح الباري شرح صحيح البخاري، للحافظ ابن حجر العسقلاني، ترقيم محمد فؤاد عبدالباقي، دار الريات للتراث، الطبعة الثانية. 35 - الفرق الكلامية الإسلامية د. علي عبد الفتاح المغربي، مكتبة وهبة، القاهرة، الطبعة الثانية.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285079",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":52,
    "volume_number":1,
    "text":"36 - الفصل في الملل والأهواء والنحل، لابن حزم، تحقيق محمد إبراهيم نصر، عبدالرحمن عميرة، دار الجيل، بيروت. 37 - فقه التعامل مع المخالف د. عبد الله الطريقي، دار الوطن، الطبعة الأولى. 38 - الفوائد لابن القيم، تحقيق محمد عثمان الخشب، دار الكتاب العربي، بيروت، الطبعة الرابعة. 39 - في الفلسفة الإسلامية: منهج وتطبيق د. إبراهيم مدكور، دار المعارف، القاهرة. 40 - القاموس المحيط، محمد بن يعقوب الفيروزآبادي، مؤسسة الرسالة، دار الريان للتراث، الطبعة الثانية. 41 - الكافية في الجدل، لإمام الحرمين الجويني، تحقيق د. فوقية حسين محمود، طبع بمطبعة عيسى البابي، القاهرة 1399 هـ. 42 - مباحث في علوم القرآن للشيخ مناع القطان، مؤسسة الرسالة الطبعة الثانية والثلاثون. 43 - مباحث في منهجية الفكر الإسلامي، د. عبدالمجيد النجار، دار الغرب الإسلامي، الطبعة الأولى. 44 - مجموع الفتاوى لشيخ الإسلام ابن تيمية، جمع وترتيب عبدالرحمن بن قاسم، دار عالم الكتب، الرياض، 1412. 45 - المحصول في علم أصول الفقه، للفخر الرازي تحقيق د. طه جابر العلواني، جامعة الإمام محمد بن سعود الإسلامية 1399. 46 - محمد في مكة، مونتجمري وات ترجمة شعبان بركات، المكتبة العصرية، بيروت. 47 - المستدرك على الصحيحين لأبي عبدالله الحاكم النيسابوري، مكتب المطبوعات الإسلامية، بيروت. 48 - مسلمو أهل الكتاب وأثرهم في الدفاع عن القضايا القرآنية، د. محمد السحيم، دار الفرقان، الطبعة الأولى. 49 - مشكاة المصابيح، لمحمد عبدالله الخطيب التبريزي، تحقيق محمد ناصر الدين الألباني، المكتب الإسلامي، بيروت، الطبعة الثانية. 50 - المعجم الفلسفي من وضع مجمع اللغة العربية، القاهرة، 1403. 51 - المغني في أبواب التوحيد والعدل للقاضي عبدالجبار المعتزلي، تحقيق محمود محمد الخضري. 52 - مقدمات العلوم والمناهج لأنور الجندي، دار الأنصار، القاهرة. 53 - مقدمات في الأهواء والافتراق، د. ناصر العقل، دار الوطن، الطبعة الأولى. 54 - مقدمات في علم المقالات تأليف د. محمد خليفة التميمي دار أضواء السلف، الرياض، الطبعة الأولى. 55 - مناظرات في الرد على النصارى للرازي، تحقيق عبدالمجيد النجار، دار الغرب الإسلامي، بيروت 1986.",
    "foot_note":"None",
    "book_id":"69"
  },
  {
    "serial_number":"285080",
    "category_id":"2",
    "category":"الفرق والردود",
    "book_title":"دراسة علم الأديان - أهميتها ومناهج الباحثين فيها",
    "edition":"None",
    "publisher":"None",
    "page_number":53,
    "volume_number":1,
    "text":"56 - مناظرة بين الإسلام والنصرانية إعداد جمال عبد الهادي، طبعة الرئاسة العامة لإدارات البحوث العلمية والإفتاء والدعوة والإرشاد. 57 - مناهج البحث في العقيدة الاسلامية في العصر الحاضر: دراسة لمناهج الفكر الاسلامي المعاصر وللعناصر المنهجية في دراسة اصول الدين، تأليف عبدالرحمن بن زيد الزنيدي، دار أشبيليا، 1416. 58 - مناهج البحث في العقيدة، للشيخ يوسف السعيد، مجلة الدراسات العربية، العدد السابع يناير 2002. 59 - مناهج علم الكلام في مواجهة القضايا الفكرية المعاصرة، لرزق يوسف، رسالة دكتوراه في كلية دار العلوم - القاهرة نقلاً عن كتاب وجهة الإسلام: نظرة في الحركات الحديثة في العالم الإسلامي للمستشرق جب، ترجمة محمد عبد الهادي، المطبعة الإسلامية، 1933. 60 - مناهل العرفان في علوم القرآن لمحمد عبدالعظيم الزرقاني، مطبعة عيسى البابي الحلبي. 61 - المنخول من تعليقات الأصول، لأبي حامد الغزالي تحقيق محمد حسن هيتو. 62 - منهج الاستدلال على مسائل الاعتقاد لعثمان على حسن، مكتبة الرشد، الرياض، الطبعة الثالثة. 63 - منهج البحث العلمي عند العرب لجلال موسى، دار الكتاب اللبناني، الطبعة الأولى. 64 - منهج أهل السنة والجماعة في الرد على النصارى دراسة علمية من خلال جهود شيخ الإسلام ابن تيمية د. عبد الراضي عبد المحسن، مكتبة التربية الإسلامية لإحياء التراث الإسلامي، الطبعة الأولى. 65 - منهج كتابة التاريخ الإسلامي د. محمد بن صامل السلمي، دار طيبة، الرياض، الطبعة الأولى. 66 - الموافقات في أصول الشريعة، لأبي إسحاق إبراهيم الشاطبي، المكتبة التجارية الكبرى، القاهرة. 67 - الموجز في الأديان والمذاهب المعاصرة، د. ناصر القفاري ود. ناصر العقل، دار الصميعي، الرياض، الطبعة الأولى. 68 - موسوعة المستشرقين، د. عبد الرحمن بدوي، دار العلم للملايين، بيروت 1984. 69 - نشأة الفكر الفلسفي في الإسلام، د. علي سامي النشار، دار المعارف، الطبعة الثلاثة. 70 - نظرة عامة في بعض مناهج البحث الإسلامية، د. طه العلواني، بحث منشور في مجلة أضواء الشريعة عدد 8 جمادي الآخرة عام 1397.",
    "foot_note":"None",
    "book_id":"69"
  }
]