[
  {
    "text": "Ramadan Gatherings (Majalis Ramadan)\nAuthor: عبد العزيز بن عبد الله بن باز\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5475\nbook_title: مجالس رمضان (من كتب العلامتين ابن باز وابن عثيمين رحمهما الله تعالى)\nbook_link: https://shamela.ws/book/821\nbook_id: 821\nauthor_name: عبد العزيز بن عبد الله بن باز\nauthor_year: 1420\nnickname: Null\nauthor_link: https://shamela.ws/author/67\nauthor_ID: 67\neditor: تقديم: الشيخ عبد العزيز بن محمد الوهيبي، مستشار الدعوة في وزارة الشؤون الإسلامية\npublisher: دار طيبة الخضراء - مكة المكرمة\nedition: 1429 هـ\npages: 64\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "5003258",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Softening of Hearts, Etiquette, and Adhkar\nBook: Majalis Ramadan (From the books of the two great scholars Ibn Baz and Ibn Uthaymeen, may Allah have mercy on them)\nCompiled by: Abdul Rahman bin Muhammad Al-Humaizi\nForeword by: Sheikh Abdul Aziz bin Muhammad Al-Wohaibi, Da'wah Advisor at the Ministry of Islamic Affairs\nYear of Publication: 1429 AH",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 3
  },
  {
    "serial_number": "5003259",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: I have reviewed what the preparing brother has written, which he compiled from the articles and fatwas of our Eminence Sheikh Abdul Aziz bin Abdullah bin Baz, may Allah have mercy on him, as well as our Sheikh Muhammad bin Salih Al-Uthaymeen, may Allah have mercy on him [*], arranged into thirty brief chapters selected from their words, may Allah have mercy on them. May Allah reward him with good and benefit others through him and what he collected. Indeed, He is the best One to ask. Peace and blessings be upon our Prophet Muhammad, his family, and all his companions. Written by Abdul Aziz bin Muhammad Al-Wohaibi, Advisor for Da'wah at the Ministry of Islamic Affairs.",
    "foot_note": "1. [*] (Shamela Comment): All are by Sheikh Ibn Baz except for Session 21 (On the Virtue of the Last Ten Days), which is by Sheikh Ibn Uthaymeen, may Allah have mercy on them both.",
    "book_id": "821",
    "new_page_number": 4
  },
  {
    "serial_number": "5003260",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 4,
    "volume_number": 1,
    "text": "Introduction: In the name of Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who align with him. As for what follows: These are sessions for the blessed month of Ramadan that cover many of the rulings of Fasting (Siyam) and Night Prayer (Qiyam). I arranged them into daily sessions, benefiting from the books of our contemporary scholars. My work on the book was: selecting the titles and coordinating the topics. I strove to ensure that each topic does not exceed two pages, to make it easy to read to sons and daughters at home, or to read to the congregation in the mosque. I ask Allah Almighty to make this work purely for His Noble Face, and to bring benefit through it. Indeed, He is Generous and Kind. Peace and blessings be upon Muhammad, his family, and all his companions.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 5
  },
  {
    "serial_number": "5003261",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 5,
    "volume_number": 1,
    "text": "(The First Session) (A Word on the Occasion of the Entry of the Month of Ramadan) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: I advise my Muslim brothers everywhere on the occasion of the entry of the blessed month of Ramadan to fear Allah Almighty, to race towards every good, to advise one another with the truth and have patience with it, to cooperate in righteousness and piety, and to beware of everything Allah has forbidden of all sins everywhere, especially in this noble month; because it is a great month in which good deeds are multiplied, and sins are forgiven for those who fast it and stand in prayer during it out of faith and hope for reward; due to the saying of the Prophet (peace be upon him): 'Whoever fasts Ramadan out of faith and hope for reward, his past sins will be forgiven' (2), and his saying (peace be upon him): 'When Ramadan enters, the gates of Paradise are opened, the gates of Hell are closed, and the devils are chained' (3). And his saying (peace be upon him): 'Fasting is a shield, so if it is a day of fasting for one of you, he should not speak obscenely nor act ignorantly. If someone insults him or fights him, let him say: I am fasting' (4). And his saying (peace be upon him): 'Allah Almighty says: Every deed of the son of Adam is for him,",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 48 - 50 \n2. Narrated by Al-Bukhari (2014), and Muslim (760). \n3. Narrated by Al-Bukhari (1899), and Muslim (1079) \n4. Narrated by Al-Bukhari (1904).",
    "book_id": "821",
    "new_page_number": 6
  },
  {
    "serial_number": "5003262",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 6,
    "volume_number": 1,
    "text": "a good deed receives a tenfold reward, except fasting; it is for Me, and I shall reward for it. He leaves his desires, food, and drink for My sake. The fasting person has two joyous occasions: one when he breaks his fast, and one when he meets his Lord. And the smell of the fasting person's mouth is more pleasant to Allah than the scent of musk' (1). The Prophet (peace be upon him) used to give glad tidings to his companions about the arrival of Ramadan and say to them: 'The month of Ramadan has come to you, a blessed month in which Allah sends down mercy, erases sins, answers supplications, and Allah boasts about you to His angels. So show Allah good from yourselves; for the wretched one is he who is deprived of Allah's mercy in it' (2). And he (peace be upon him) said: 'Whoever does not give up false speech and acting upon it and ignorant conduct, Allah has no need for him to give up his food and drink' (3), narrated by Al-Bukhari in his Sahih. The Hadiths regarding the virtue of the month of Ramadan and the encouragement to multiply deeds in it are numerous. So I advise my Muslim brothers to remain steadfast during its days and nights and to compete in all acts of good. May Allah grant everyone success in what pleases Him and protect everyone from misleading tribulations and the incitements of the devils. Indeed, He is Generous and Kind.",
    "foot_note": "1. Narrated by Al-Bukhari (1904), and Muslim (1151) \n2. Attributed by Al-Haythami in Majma' Al-Zawa'id (3: 142) to Al-Tabarani in Al-Kabir \n3. Narrated by Al-Bukhari in (Fasting), Chapter: Whoever does not give up false speech, number (1903).",
    "book_id": "821",
    "new_page_number": 7
  },
  {
    "serial_number": "5003263",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 7,
    "volume_number": 1,
    "text": "(The Second Session) (Ramadan is a Great Blessed Month) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: O Muslims, you are in a great blessed month, which is the month of Ramadan, the month of Fasting (Siyam), Night Prayer (Qiyam), and recitation of the Quran; the month of emancipation and forgiveness; the month of charity and benevolence; a month in which the gates of Paradise are opened, good deeds are multiplied, stumbling blocks are removed, supplications are answered, ranks are raised, and sins are forgiven; a month in which Allah, Glory be to Him, bestows upon His servants various honors and grants His allies bountiful gifts; a month which Allah made its fasting one of the pillars of Islam. The Chosen One (peace be upon him) fasted it and ordered the people to fast it, and he informed (peace be upon him) that whoever fasts it out of faith and hope for reward, Allah forgives his past sins, and whoever stands in prayer during it out of faith and hope for reward, Allah forgives his past sins. A month containing a night better than a thousand months; whoever is deprived of its good has indeed been deprived. So honor it, may Allah have mercy on you, with righteous intention and diligence in preserving its fasting and night prayer, racing in it towards good deeds, and hastening in it to sincere repentance from all sins and misdeeds. Strive in advising one another, cooperating in righteousness",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 22, 23",
    "book_id": "821",
    "new_page_number": 8
  },
  {
    "serial_number": "5003264",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 8,
    "volume_number": 1,
    "text": "and piety, advising one another to enjoin good and forbid evil, and calling to every good so that you may win dignity and great reward. Allah is the One asked to rectify the conditions of Muslims everywhere, to fill their hearts with piety, to reform their leaders, and to bestow upon everyone sincere repentance from all sins, and to protect them from the plots of enemies. Indeed, He is capable of all things. Peace and blessings be upon His servant and Messenger Muhammad, and upon all his family and companions (1).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 3/ 155",
    "book_id": "821",
    "new_page_number": 9
  },
  {
    "serial_number": "5003265",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 9,
    "volume_number": 1,
    "text": "(The Third Session) (Striving in Various Acts of Worship in this Noble Month) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: It is prescribed for all Muslims to strive in various acts of worship in this noble month, such as voluntary prayers, reading the Quran with reflection and understanding, increasing in Tasbeeh (Glorification), Tahleel (Declaring Oneness of God), Tahmeed (Praise), Takbeer (Magnification), Istighfar (Seeking Forgiveness), and prescribed supplications, enjoining good and forbidding evil, calling to Allah Almighty, comforting the poor and needy, striving in kindness to parents, upholding ties of kinship, honoring the neighbor, visiting the sick, and other types of good; due to his saying (peace be upon him): 'Allah looks at your competition in it and boasts about you to His angels. So show Allah good from yourselves, for the wretched one is he who is deprived of Allah's mercy in it' (2). And because of what was narrated from him (peace be upon him) that he said: 'Whoever draws near (to Allah) in it with a characteristic of good, is like one who performed a mandatory duty at other times, and whoever performs a mandatory duty in it is like one who performed seventy mandatory duties at other times' (3).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz: 15/ 20, 21 \n2. Attributed by Al-Haythami in Majma' Al-Zawa'id (3: 142) to Al-Tabarani in Al-Kabir. \n3. Narrated by Ibn Khuzaimah in summarized form in his Sahih 3/ 191 number (1887)",
    "book_id": "821",
    "new_page_number": 10
  },
  {
    "serial_number": "5003266",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 10,
    "volume_number": 1,
    "text": "And for his saying (peace be upon him) in the authentic Hadith: 'Umrah in Ramadan is equivalent to Hajj.' Or he said: 'Hajj with me.' (1) The Hadiths and narrations indicating the legitimacy of racing and competing in various types of good in this noble month are numerous. Allah is the One asked to grant us and all Muslims success in everything that pleases Him, to accept our fasting and night prayers, to rectify our conditions, and to protect us all from misleading tribulations. We also ask Him, Glory be to Him, to rectify the leaders of the Muslims and to unite their word on the truth. Indeed, He is the Guardian of that and Capable of it. Peace and blessings be upon His servant and Messenger Muhammad, and upon all his family and companions.",
    "foot_note": "1. Narrated by Al-Bukhari (1863), Muslim (1256), and Ibn Majah (291)",
    "book_id": "821",
    "new_page_number": 11
  },
  {
    "serial_number": "5003267",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 11,
    "volume_number": 1,
    "text": "(The Fourth Session) Upon Whom Fasting is Obligatory (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Fasting Ramadan is obligatory upon every accountable Muslim male and female, and it is recommended for those who have reached seven years or more and are capable of it, both male and female. Their guardians must command them to do so if they are capable, just as they command them to pray. The basis for this is the saying of Allah Almighty: (O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous - [Fasting for] a limited number of days. So whoever among you is ill or on a journey - then an equal number of days [are to be made up]...) until He said: (The month of Ramadan [is that] in which was revealed the Quran, a guidance for the people and clear proofs of guidance and criterion. So whoever sights [the new moon of] the month, let him fast it; and whoever is ill or on a journey - then an equal number of other days) [Al-Baqarah: 183 - 185]. And the saying of the Prophet (peace be upon him): 'Islam is built on five [pillars]: the testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving Zakat, fasting Ramadan, and the pilgrimage to the House' (2). And his saying (peace be upon him) when Gabriel asked him about Islam: 'Islam is to testify that there is no god but Allah and that Muhammad is the Messenger of Allah, to establish prayer, to give Zakat, to fast Ramadan, and to perform pilgrimage to the House if you are able to find a way' (3). Narrated by Muslim in his Sahih from the hadith of Umar bin",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 167 - 169 \n2. Narrated by Al-Bukhari (7), and Muslim (21). \n3. Narrated by Muslim (9)",
    "book_id": "821",
    "new_page_number": 12
  },
  {
    "serial_number": "5003268",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 12,
    "volume_number": 1,
    "text": "Al-Khattab (may Allah be pleased with him), and its meaning was narrated by the two Sheikhs (Bukhari and Muslim) from the hadith of Abu Huraira (may Allah be pleased with him). In the two Sahihs from Abu Huraira (may Allah be pleased with him), from the Prophet (peace be upon him) that he said: 'Whoever fasts Ramadan out of faith and hope for reward, his past sins will be forgiven.' (1) It is confirmed from him (peace be upon him) that he said: 'Allah Almighty says: Every deed of the son of Adam is for him, a good deed receives a tenfold reward up to seven hundred times, except fasting; it is for Me, and I shall reward for it. He leaves his desires, food, and drink for My sake. The fasting person has two joys: a joy when he breaks his fast and a joy when he meets his Lord. And the smell of the fasting person's mouth is more pleasant to Allah than the scent of musk.' (2) Agreed upon. The Hadiths regarding the virtue of fasting Ramadan and fasting in general are numerous and well-known, and Allah is the Grantor of success. Who is Not Obliged to Fast (3) The insane, the one who has lost his mind, the young boy, and the young girl before puberty. As for the menstruating woman and the woman in postpartum bleeding, fasting is obligatory upon them, but it is not permissible for them to fast in Ramadan or other times while in the state of menstruation or postpartum bleeding, and they must make up for the days of Ramadan they missed. As for the sick and the traveler, it is permissible for them to fast or break their fast in Ramadan, but breaking the fast is better, and they must make up for it if they break their fast in Ramadan; due to the saying of Allah: (and whoever is ill or on a journey - then an equal number of other days) Surah Al-Baqarah Verse 185. However, if the sick person is not expected to recover according to the testimony of trustworthy doctors, then fasting and making it up are not required of him, and he must feed a poor person for every day, which is half a Sa' (using the Prophetic Sa') of the country's staple food, amounting to approximately one and a half kilograms. Similarly, the very old man and the very old woman who cannot fast should feed half a Sa' of the country's staple food for every day, and neither fasting nor making it up is required of them. It is permissible to pay the expiation for the entire Ramadan at once at the beginning or end of the month, or during it, to one poor person or more. Likewise is the case for the pregnant and breastfeeding woman if fasting is difficult for them; they break their fast and must make it up like the sick person.",
    "foot_note": "1. Narrated by Al-Bukhari (2014), and Muslim (760) \n2. Narrated by Al-Bukhari (1904), and Muslim (1151). \n3. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 175, 167",
    "book_id": "821",
    "new_page_number": 13
  },
  {
    "serial_number": "5003269",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 13,
    "volume_number": 1,
    "text": "(The Fifth Session) Advice for Welcoming the Month of Ramadan (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: My advice to all Muslims is to fear Allah Almighty, to welcome their great month with sincere repentance from all sins, to gain understanding of their religion, and to learn the rulings of their fasting and night prayers; due to the saying of the Prophet (peace be upon him): 'Whomever Allah intends good for, He gives him understanding of the religion' (2), and the saying of the Prophet (peace be upon him): 'When Ramadan enters, the gates of Paradise are opened, the gates of the Fire are closed, and the devils are chained.' (3) And his saying (peace be upon him): 'When it is the first night of Ramadan, the gates of Paradise are opened, the gates of Hell are closed, and the devils are fettered. A caller calls out: O seeker of good, come forward! O seeker of evil, desist! And Allah has those whom He frees from the Fire, and that is every night.' (4) The Prophet (peace be upon him) used to say to the Companions: 'The month of Ramadan has come to you, a blessed month in which Allah covers you, sends down mercy, and erases sins. (5)",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 51 - 53 \n2. Narrated by Al-Bukhari (71), and Muslim (1037) \n3. Narrated by Al-Bukhari (3277), and Muslim (1079) \n4. Narrated by Al-Tirmidhi (682), and Ibn Majah (1642). \n5. Mentioned by Al-Mundhiri in (Al-Targhib wa Al-Tarhib) number (1490), and he said: Narrated by Al-Tabarani.",
    "book_id": "821",
    "new_page_number": 14
  },
  {
    "serial_number": "5003270",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 14,
    "volume_number": 1,
    "text": "And He answers supplications. So show Allah good from yourselves; for the wretched one is he who is deprived of Allah's mercy in it.' The meaning of 'show Allah good from yourselves' is to hasten to good deeds, rush to acts of obedience, and stay away from sins. And he (peace be upon him) says: 'Whoever fasts Ramadan out of faith and hope for reward, his past sins will be forgiven. And whoever stands in prayer during Ramadan out of faith and hope for reward, his past sins will be forgiven. And whoever stands in prayer on the Night of Decree (Laylat al-Qadr) out of faith and hope for reward, his past sins will be forgiven' (1). And he (peace be upon him) says: 'Allah Almighty says: Every deed of the son of Adam is for him, a good deed receives a tenfold reward up to seven hundred times, except fasting; it is for Me, and I shall reward for it. He leaves his desires, food, and drink for My sake. The fasting person has two joys: a joy when he breaks his fast and a joy when he meets his Lord. And the smell of the fasting person's mouth is more pleasant to Allah than the scent of musk' (2). And he (peace be upon him) says: 'If it is a day of fasting for one of you, he should not speak obscenely nor shout. If someone insults him or fights him, let him say: I am a fasting person' (3). And he (peace be upon him) says: 'Whoever does not give up false speech and acting upon it and ignorant conduct, Allah has no need for him to give up his food and drink.' (4) Narrated by Al-Bukhari in the Sahih. We ask [Allah] to grant us all success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad, his family, and companions.",
    "foot_note": "1. Narrated by Al-Bukhari (1901), and Muslim (760). \n2. Narrated by Al-Bukhari (7492), Muslim (1151), and Ibn Majah (163). \n3. Narrated by Al-Bukhari (1904) \n4. Narrated by Al-Bukhari in (Fasting), Chapter: Whoever does not give up false speech, number (1903)",
    "book_id": "821",
    "new_page_number": 15
  },
  {
    "serial_number": "5003271",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 15,
    "volume_number": 1,
    "text": "(The Sixth Session) (Some Benefits of Fasting) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Fasting has many benefits and great wisdoms: Among them: purifying the soul, refining it, and cleansing it from bad morals and blameworthy traits such as arrogance, ungratefulness, and miserliness, and accustoming it to noble morals such as patience, forbearance, generosity, kindness, and struggling against the self in what pleases Allah and brings one closer to Him. Among the benefits of fasting: it makes the servant know himself, his need, his weakness, and his poverty before his Lord. It reminds him of Allah's great blessings upon him, and it also reminds him of the need of his poor brothers, thus obligating him to thank Allah Almighty, to use His blessings in His obedience, and to comfort his poor brothers and do good to them. Allah Almighty referred to these benefits in His saying: (O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous) [Al-Baqarah: 183]. He clarified that He prescribed fasting upon us so that we may fear Him. This indicates that fasting is a means to Taqwa (piety). Taqwa is: obeying Allah and His Messenger by doing what He commanded and leaving what He forbade out of sincerity to Allah Almighty, love, hope, and fear. By this, the servant protects himself from Allah's punishment and anger. Thus, fasting is a great branch of Taqwa,",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 23, 24",
    "book_id": "821",
    "new_page_number": 16
  },
  {
    "serial_number": "5003272",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 16,
    "volume_number": 1,
    "text": "and an act of nearness to the Lord Almighty, and a strong means to Taqwa in the rest of religious and worldly affairs. The Prophet (peace be upon him) pointed to some benefits of fasting in his saying: 'O young men, whoever among you can afford to marry, let him marry; for it is more effective in lowering the gaze and guarding chastity. And whoever cannot afford it, let him fast, for it is a shield for him' (1). The Prophet (peace be upon him) clarified that fasting is a shield for the fasting person and a means for his purity and chastity. That is only because Satan flows through the son of Adam like blood, and fasting narrows those passages and reminds one of Allah and His greatness. Thus, the authority of Satan weakens, the authority of faith strengthens, and acts of obedience increase among believers while sins decrease. Among the benefits of fasting also: it cleanses the body of bad humors and gives it health and strength. Many doctors have acknowledged this and have treated many diseases with it. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (2).",
    "foot_note": "1. Narrated by Al-Bukhari (5066), and Muslim (1400). \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 17
  },
  {
    "serial_number": "5003273",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 17,
    "volume_number": 1,
    "text": "(The Seventh Session) (Preserving Fasting and Night Prayer from What Allah has Forbidden) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: The most important matter after Prayer and Zakat is the fasting of Ramadan. It is one of the five pillars of Islam mentioned in the saying of the Prophet (peace be upon him): 'Islam is built on five [pillars]: the testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving Zakat, fasting Ramadan, and the pilgrimage to the House' (2). A Muslim must protect his fasting and night prayer from the sayings and deeds that Allah has forbidden him; because the purpose of fasting is obedience to Allah Almighty, magnifying His sanctities, struggling against the self to oppose its desires in obedience to its Master, and accustoming it to patience against what Allah has forbidden. The purpose is not merely abandoning food, drink, and other breakers of the fast. For this reason, it is authentically reported from the Prophet (peace be upon him) that he said: 'Fasting is a shield, so if it is a day of fasting for one of you, he should not speak obscenely nor shout. If someone insults him or fights him, let him say: I am fasting' (3). And it is authentically reported from him (peace be upon him) that he said: 'Whoever does not give up false speech and acting upon it and ignorant conduct, Allah has no need for him to give up his food and drink' (4).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 14 \n2. Narrated by Al-Bukhari (8), and Muslim (16). \n3. Narrated by Al-Bukhari (1904). \n4. Narrated by Al-Bukhari (1903).",
    "book_id": "821",
    "new_page_number": 18
  },
  {
    "serial_number": "5003274",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 18,
    "volume_number": 1,
    "text": "It is known from these texts and others that the fasting person is obliged to beware of everything Allah has forbidden him and to maintain everything Allah has obligated upon him. By doing so, forgiveness, emancipation from the Fire, and acceptance of fasting and night prayer are hoped for him. Allah is the One asked to rectify the conditions of all Muslims, fill their hearts with piety, reform their leaders, and bestow upon everyone sincere repentance from all sins, and steadfastness on the Sharia of Allah Almighty in all matters, and to protect them from the plots of enemies. Indeed, He is capable of all things. Peace and blessings be upon His servant and Messenger Muhammad, his family, and his companions.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 19
  },
  {
    "serial_number": "5003275",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 19,
    "volume_number": 1,
    "text": "(The Eighth Session) (Some Rulings of Fasting) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Among the rulings of fasting: It is obligatory for a Muslim to fast out of faith and hope for reward, not for showing off, reputation, imitating people, or following his family or the people of his country. Rather, it is obligatory that his motivation for fasting be his belief that Allah has obligated it upon him and his hope for the reward from his Lord in doing so. Similarly, the night prayer of Ramadan (Qiyam) must be performed by the Muslim out of faith and hope for reward, not for any other reason. Therefore, he (peace be upon him) said: 'Whoever fasts Ramadan out of faith and hope for reward, his past sins will be forgiven. And whoever stands in prayer during Ramadan out of faith and hope for reward, his past sins will be forgiven. And whoever stands in prayer on the Night of Decree out of faith and hope for reward, his past sins will be forgiven' (2). Among the matters whose ruling might be hidden from some people: what may happen to a fasting person such as wounds, nosebleeds, vomiting, or water or gasoline entering his throat unintentionally. All these matters do not invalidate the fast. However, whoever intentionally vomits, his fast is invalidated; due to the saying of the Prophet (peace be upon him): 'Whoever is overcome by vomiting does not have to make it up, but whoever intentionally vomits must make it up' (3). Also among this: what may happen to a fasting person regarding delaying the Ghusl (ritual bath) for Janabah (sexual impurity) until dawn breaks, and what happens to some women regarding delaying the Ghusl for menstruation or postpartum bleeding until",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz: 15/ 15 - 17 \n2. Narrated by Al-Bukhari (2014), and Muslim (760). \n3. Narrated by Imam Ahmad (10085), and Ibn Majah (1676) and the wording is his.",
    "book_id": "821",
    "new_page_number": 20
  },
  {
    "serial_number": "5003276",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 20,
    "volume_number": 1,
    "text": "dawn breaks. If she sees purity before dawn, then fasting is obligatory upon her, and there is no harm in delaying the Ghusl until after dawn breaks. However, she may not delay it until sunrise; rather, she must perform Ghusl and pray Fajr before sunrise. Similarly, the Junub (person in sexual impurity) may not delay Ghusl until after sunrise; rather, he must perform Ghusl and pray Fajr before sunrise. A man must hasten to do so in order to catch the Fajr prayer with the congregation. Among the matters that do not invalidate the fast: blood analysis (tests) and injections not intended for nutrition. However, delaying that until night is better and safer if possible; due to the saying of the Prophet (peace be upon him): 'Leave what makes you doubt for what does not make you doubt' (1), and his saying (peace be upon him): 'Whoever avoids doubtful matters has cleared himself in regard to his religion and his honor' (2). I ask Allah Almighty to grant us and you and all Muslims understanding of His religion and steadfastness upon it, and to protect us all from the evils of our souls and the bad consequences of our deeds. Indeed, He is the Guardian of that and Capable of it. Peace and blessings be upon His servant and Messenger, our Prophet Muhammad, his family, and his companions.",
    "foot_note": "1. Narrated by Imam Ahmad (11689), and Al-Bukhari in a suspended form (571). \n2. Narrated by Al-Bukhari (52), and Muslim (1599)",
    "book_id": "821",
    "new_page_number": 21
  },
  {
    "serial_number": "5003277",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 21,
    "volume_number": 1,
    "text": "(The Ninth Session) (Some Rulings of Taraweeh) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Among the matters whose ruling is hidden from some people: lack of tranquility (Tuma'ninah) in prayer, whether obligatory or voluntary. Authentic Hadiths from the Messenger of Allah (peace be upon him) have indicated that tranquility is a pillar of prayer without which prayer is invalid. It means stillness in prayer, Khushu' (humility/focus) in it, and lack of haste until every vertebra returns to its place. Many people pray Taraweeh in Ramadan in a way that they do not comprehend nor find tranquility in; rather, they peck it like a bird pecks. This prayer in this manner is void, and its performer is sinful, not rewarded. Among the matters whose ruling might be hidden from some people: some of them think that Taraweeh cannot be less than twenty Rak'ahs, and some think it cannot exceed eleven or thirteen Rak'ahs. All of this is a misplaced assumption; rather, it is an error contrary to evidence. Authentic Hadiths from the Messenger of Allah (peace be upon him) have indicated that night prayer is broad in scope; there is no fixed limit that cannot be violated. Rather, it is confirmed from him (peace be upon him) that he used to pray eleven Rak'ahs at night, and perhaps thirteen Rak'ahs, and perhaps less than that in Ramadan and other times.",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 18, 19",
    "book_id": "821",
    "new_page_number": 22
  },
  {
    "serial_number": "5003278",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 22,
    "volume_number": 1,
    "text": "When he (peace be upon him) was asked about night prayer, he said: 'Two by two, so if one of you fears the dawn, let him pray one Rak'ah to make odd what he has prayed' (1). He did not specify a specific number of Rak'ahs neither in Ramadan nor in other times. For this reason, the Companions (may Allah be pleased with them) during the time of Umar (may Allah be pleased with him) sometimes prayed twenty-three Rak'ahs, and sometimes eleven Rak'ahs. All of that is confirmed from Umar (may Allah be pleased with him) and the Companions in his time. Some of the predecessors used to pray thirty-six Rak'ahs in Ramadan and pray Witr with three. Some prayed forty-one. This was mentioned about them by Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) and other scholars. He (may Allah have mercy on him) also mentioned that the matter in this regard is broad, and he also mentioned that it is better for whoever lengthens the recitation, bowing, and prostration to reduce the number, and whoever lightens the recitation, bowing, and prostration to increase the number. This is the meaning of his words (may Allah have mercy on him). Whoever contemplates his Sunnah (peace be upon him) knows that the best in all of this is praying eleven Rak'ahs, or thirteen Rak'ahs, in Ramadan and other times; because that is in accordance with the action of the Prophet (peace be upon him) in most of his states, and because it is gentler on the worshippers and closer to Khushu' and tranquility. But whoever increases, there is no harm or dislike, as previously mentioned. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (2).",
    "foot_note": "1. Narrated by Al-Bukhari in (Friday Prayer) number (991), and Muslim (74). \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 23
  },
  {
    "serial_number": "5003279",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 23,
    "volume_number": 1,
    "text": "(The Tenth Session) (From the Hadiths of Fasting) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: O Muslims, fasting is a great righteous deed, and its reward is immense, especially the fasting of Ramadan; for it is the fast that Allah obligated upon His servants and made it one of the causes of success with Him. It is confirmed in the authentic Hadith that the Prophet (peace be upon him) said: 'Allah Almighty says: Every deed of the son of Adam is for him, a good deed receives a tenfold reward up to seven hundred times, except fasting; it is for Me, and I shall reward for it. He leaves his desires, food, and drink for My sake. The fasting person has two joys: a joy when he breaks his fast and a joy when he meets his Lord. And the smell of the fasting person's mouth is more pleasant to Allah than the scent of musk' (2). In the Sahih from the Prophet (peace be upon him) that he said: 'When Ramadan enters, the gates of Paradise are opened, the gates of the Fire are closed, and the devils are chained' (3). Al-Tirmidhi and Ibn Majah narrated from the Prophet (peace be upon him) that he said: 'When it is the first night of Ramadan, the devils and rebellious jinn are fettered, the gates of Paradise are opened and not a single gate is closed, and the gates of the Fire are closed and not a single gate is opened. A caller calls out: O seeker of good, come forward! O seeker of evil, desist! And Allah has those whom He frees from the Fire, and that is every night' (4).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 25 - 27 \n2. Narrated by Al-Bukhari in (Fasting) number (1904). \n3. Narrated by Al-Bukhari (1899), and Muslim (1079) \n4. Narrated by Al-Tirmidhi (682), and Ibn Majah (1642)",
    "book_id": "821",
    "new_page_number": 24
  },
  {
    "serial_number": "5003280",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 24,
    "volume_number": 1,
    "text": "And from Ubadah bin Al-Samit (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: 'Ramadan has come to you, a blessed month in which Allah covers you, sends down mercy, erases sins, and answers supplication. Allah Almighty looks at your competition in it and boasts about you to His angels. So show Allah good from yourselves, for the wretched one is he who is deprived of Allah's mercy in it' (1). And from Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: 'Allah has obligated upon you the fasting of Ramadan, and I have enacted for you its night prayer. Whoever fasts it and stands in prayer during it out of faith and hope for reward, exits from his sins as on the day his mother bore him' (2). I ask Allah Almighty to facilitate for this Ummah right conduct in its affairs, protect it from the plots of its enemies, and grant it steadfastness in word and deed so that it becomes as Allah intended for it of glory, strength, and dignity. Indeed, He is the best One to ask. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "1. Attributed by Al-Haythami in Majma' Al-Zawa'id (3: 142) to Al-Tabarani in Al-Kabir \n2. Narrated by Imam Ahmad (1663), and Al-Nasa'i (221).",
    "book_id": "821",
    "new_page_number": 25
  },
  {
    "serial_number": "5003281",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 25,
    "volume_number": 1,
    "text": "(The Eleventh Session) (Some Rulings of Fasting) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: First: Cleaning teeth with toothpaste does not invalidate the fast of the fasting person, just like the Siwak. He must be careful not to let anything go into his stomach, but if something overcomes him without intent, there is no need to make it up. Similarly, eye drops and ear drops do not invalidate the fast according to the most correct of the two scholarly opinions. If he finds the taste of the drops in his throat, making it up is safer but not obligatory; because they are not pathways for food and drink. As for nose drops, they are not permissible; because the nose is a pathway. For this reason, the Prophet (peace be upon him) said: '...and sniff water deeply into the nose unless you are fasting' (1). Whoever does that must make it up based on this Hadith and what carries its meaning, if he finds its taste in his throat. Allah is the Grantor of success. Second: (2) Whoever is overcome by vomiting while fasting; there is no make-up due upon him. However, if he induces vomiting, he must make it up; due to the saying of the Prophet (peace be upon him): 'Whoever is overcome by vomiting does not have to make it up, but whoever intentionally vomits must make it up' (3). Narrated by Imam Ahmad and the authors of the four Sunan with an authentic chain from the hadith of Abu Huraira (may Allah be pleased with him).",
    "foot_note": "1. Narrated by Al-Tirmidhi (788), and Abu Dawood (14). \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 265, 266, 267 \n3. Narrated by Ibn Majah (1676).",
    "book_id": "821",
    "new_page_number": 26
  },
  {
    "serial_number": "5003282",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 26,
    "volume_number": 1,
    "text": "Third: It is permissible to use perfumes such as Oud oil, cologne, and incense during the day of Ramadan, provided that one does not inhale the incense smoke. Fourth: It is forbidden to look at women, and if it is with desire, the prohibition is more severe; due to the saying of Allah Almighty: (Tell the believing men to reduce [some] of their vision and guard their private parts...) the Verse [An-Nur: 30], and because unleashing the gaze is one of the means leading to immorality. So the duty is to lower the gaze while being cautious of causes of temptation. However, his fast is not invalidated if no semen is emitted. As for one who ejaculates, his fast is invalidated, and he must make it up if it was obligatory. Fifth: Saliva does not harm the fast because it is part of the mouth's moisture. If he swallows it, there is no harm, and if he spits it out, there is no harm. [As for phlegm/mucus], which is what comes out of the chest or the nose, called 'Nukha'ah', which is the phlegm that occurs to a person sometimes from the chest and sometimes from the head, this must be spat out by the man and woman and not swallowed. As for normal saliva, there is no harm in it and it does not harm either a man or a woman. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (1).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 27
  },
  {
    "serial_number": "5003283",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 27,
    "volume_number": 1,
    "text": "(The Twelfth Session) (Some Rulings of Fasting) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: First: Ruling on Ordering the Discerning Child to Fast (1) Boys and girls, if they reach seven years or more, are ordered to fast so they get accustomed to it. Their guardians must order them to do so just as they order them to pray. If they reach puberty, fasting becomes obligatory upon them. If they reach puberty during the day, that day suffices them. If we assume a boy completed fifteen years at noon while fasting that day, it suffices him; the first part of the day was voluntary and the last part obligatory, provided he had not reached puberty before that by the growth of coarse hair around the private parts, called pubic hair, or by discharging semen with desire. Similarly for the girl, the ruling is the same, except the girl has a fourth sign by which puberty is attained, which is menstruation. Second: It is recommended to break the fast during travel even if fasting is not difficult (2) Whoever is sick or travels is allowed to break the fast; rather, it is recommended for him; due to the saying of Allah Almighty (So whoever among you is ill or on a journey - then an equal number of other days) [Al-Baqarah: 185] and the saying of the Prophet (peace be upon him): 'Allah loves that His concessions be accepted just as He hates that acts of disobedience to Him be committed' (3). Provided that the sick person finds fasting difficult,",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 180 - 18 \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 234, 235 \n3. Narrated by Ahmad (5600)",
    "book_id": "821",
    "new_page_number": 28
  },
  {
    "serial_number": "5003284",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 28,
    "volume_number": 1,
    "text": "but if it is not difficult for him, he does not have the option to break the fast because he is not considered excused. Allah is the Grantor of success. Third: Whoever sees a Muslim drinking during the day of Ramadan, or eating, or taking any other fast-breakers forgetfully or intentionally, must denounce it; because displaying that during the day of fasting is forbidden (Munkar), even if the person is excused in reality; so that people do not dare to openly commit what Allah has forbidden of fast-breakers during the day of fasting claiming forgetfulness. If the one who showed that was truthful in claiming forgetfulness, there is no make-up due upon him; due to the saying of the Prophet (peace be upon him): 'Whoever forgets while he is fasting and eats or drinks, let him complete his fast, for it is Allah who fed him and gave him drink.' (1) Agreed upon. Similarly, the traveler should not openly consume fast-breakers among residents who do not know his condition; rather, he should conceal that so he is not accused of consuming what Allah forbade him, and so others are not emboldened to do so. Similarly, disbelievers are prevented from openly eating and drinking and the like among Muslims; to block the door of laxity in this matter, and because they are forbidden from displaying the rituals of their false religion among Muslims. Allah is the Grantor of success. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (2).",
    "foot_note": "1. Narrated by Al-Bukhari (1933), and Muslim (1155) and the wording is his. \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 29
  },
  {
    "serial_number": "5003285",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 29,
    "volume_number": 1,
    "text": "(The Thirteenth Session) (Generosity in Ramadan) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: The Messenger of Allah (peace be upon him) was the most generous of people, and he was most generous in Ramadan. So follow his example, may Allah have mercy on you, in multiplying generosity and benevolence in the month of Ramadan. Help your poor brothers in fasting and night prayers, and seek the reward for that from the King, the All-Knowing. Guard your fasting from the burdens and sins Allah has forbidden you; for it is authentically reported from the Prophet (peace be upon him) that he said: 'Whoever does not give up false speech and acting upon it and ignorant conduct, Allah has no need for him to give up his food and drink' (2). And he (peace be upon him) said: 'Fasting is a shield, so if it is a day of fasting for one of you, he should not speak obscenely nor shout. If a person insults him, let him say: I am a fasting person' (3). And it came from him (peace be upon him) that he said: 'Fasting is not [merely] from food and drink, but fasting is from idle talk and obscenity' (4).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz: (15/ 31 - 32) \n2. Narrated by Al-Bukhari (190). \n3. Al-Bukhari (1904). \n4. Narrated by Al-Hakim (1604), and Ibn Khuzaimah (1995).",
    "book_id": "821",
    "new_page_number": 30
  },
  {
    "serial_number": "5003286",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 30,
    "volume_number": 1,
    "text": "Ibn Hibban narrated in his Sahih from Abu Sa'id (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: 'Whoever fasts Ramadan and knows its limits, and guards against what he should guard against in it, it will be an expiation for what came before it' (1). Jabir bin Abdullah Al-Ansari (may Allah be pleased with them both) said: 'If you fast, let your hearing, sight, and tongue fast from lies and prohibitions, leave harming the neighbor, let tranquility and dignity be upon you, and do not make the day of your fasting and the day of your breaking fast equal' (2). I ask Allah Almighty to grant us and you and all Muslims understanding of His religion and steadfastness upon it, and to protect us all from the evils of our souls and the bad consequences of our deeds. Indeed, He is the Guardian of that and Capable of it. Peace and blessings be upon His servant and Messenger, our Prophet Muhammad, his family, and his companions.",
    "foot_note": "1. Narrated by Imam Ahmad (11130). \n2. Mentioned by Ibn Abi Shaybah in his Musannaf (8981).",
    "book_id": "821",
    "new_page_number": 31
  },
  {
    "serial_number": "5003287",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 31,
    "volume_number": 1,
    "text": "(The Fourteenth Session) (Distance from What Wounds the Fast) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Beware, may Allah have mercy on you, of everything that wounds the fast, decreases the reward, and angers the Lord Almighty, of all sins, such as usury, adultery, theft, killing a soul without right, consuming the wealth of orphans, types of injustice against self, wealth, and honor, cheating in transactions, betraying trusts, disobedience to parents, severing ties of kinship, grudge, desertion (of Muslims) without a right for Allah Almighty, drinking intoxicants and various drugs like Qat and tobacco, backbiting, gossip, lying, false testimony, false claims, false oaths, shaving beards or shortening them, lengthening mustaches, arrogance, dragging garments (Isbal), listening to songs and musical instruments, women displaying adornment (Tabarruj) and not covering themselves from men, imitating disbelieving women in wearing short clothes, and other things that Allah and His Messenger (peace be upon him) have forbidden. These sins we mentioned are forbidden in every time and place, but in Ramadan they are more severely forbidden and greater in sin due to the virtue and sanctity of the time. So fear Allah, O Muslims, and beware of what Allah and His Messenger have forbidden you, and remain steadfast in obeying Him in Ramadan and other times. Advise one another regarding that, cooperate on it, enjoin",
    "foot_note": "1. Al-Majmu' vol. 15/ 36 - 37",
    "book_id": "821",
    "new_page_number": 32
  },
  {
    "serial_number": "5003288",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 32,
    "volume_number": 1,
    "text": "good, and forbid evil; so that you may win dignity, happiness, glory, and salvation in this world and the Hereafter. Allah is the One asked to protect us and you and all Muslims from the causes of His anger, to accept from us all our fasting and night prayers, to rectify the leaders of the Muslims, to grant victory to His religion through them and forsake His enemies through them, and to grant everyone success in understanding the religion, remaining steadfast upon it, ruling by it, and seeking judgment from it in everything. Indeed, He is capable of all things. Peace and blessings be upon His servant and Messenger, our Prophet Muhammad, his family, his companions, and those who follow his path until the Day of Judgment.",
    "foot_note": "1. [*] (Shamela Comment): Added here in the electronic version sent by the book's author (Sheikh Abdul Rahman Al-Humaizi), may Allah preserve him: 'Allah is the One asked to rectify the conditions of Muslims everywhere, to fill their hearts with piety, to reform their leaders, and to bestow upon everyone sincere repentance from all sins, and steadfastness on the Sharia of Allah Almighty in all matters, and to protect them from the plots of enemies. Indeed, He is capable of all things. Peace and blessings be upon His servant and Messenger Muhammad, and upon all his family and companions.'",
    "book_id": "821",
    "new_page_number": 33
  },
  {
    "serial_number": "5003289",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 33,
    "volume_number": 1,
    "text": "(The Fifteenth Session) (Ruling on What Some Fasting People Do: Sleeping by Day and Staying Awake by Night) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: There is no harm in sleeping by day or night if it does not result in neglecting any obligations or committing any prohibitions. What is prescribed for a Muslim, whether fasting or otherwise, is not to stay awake at night and to hasten to sleep after what Allah facilitates for him of night prayer, then waking up for Suhoor if it is in Ramadan; because Suhoor is a confirmed Sunnah, and it is the meal of the pre-dawn; due to the saying of the Prophet (peace be upon him): 'Eat Suhoor, for in Suhoor there is blessing' (2). And his saying (peace be upon him): 'The distinction between our fasting and the fasting of the People of the Scripture is the eating of Suhoor' (3). It is also obligatory upon the fasting person and others to maintain all five prayers in congregation and beware of being distracted from them by sleep or anything else. It is also obligatory upon the fasting person and others to perform all deeds that must be performed at their times for the government or others, and not to be distracted from them by sleep or anything else. Similarly, he must strive to seek the lawful sustenance needed by him and his dependents and not be distracted from that by sleep or anything else.",
    "foot_note": "1. Al-Majmu' 15/ 318, 319 \n2. Narrated by Al-Bukhari (1923), and Muslim (1095). \n3. Narrated by Muslim (1096).",
    "book_id": "821",
    "new_page_number": 34
  },
  {
    "serial_number": "5003290",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 34,
    "volume_number": 1,
    "text": "In summary, my advice to everyone, men and women, those fasting and others, is to fear Allah Almighty in all situations, maintain the performance of obligations at their times in the manner legislated by Allah, and be extremely cautious of being distracted from that by sleep or other permissible things or otherwise. If being distracted from that is due to something sinful, the sin is greater and the crime is graver. May Allah rectify the conditions of the Muslims, give them understanding of their religion, establish them on the truth, and reform their leaders. Indeed, He is Generous and Kind. I ask Allah Almighty to grant us and you and all Muslims understanding of His religion and steadfastness upon it, and to protect us all from the evils of our souls and the bad consequences of our deeds. Indeed, He is the Guardian of that and Capable of it. Peace and blessings be upon His servant and Messenger, our Prophet Muhammad, his family, and his companions.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 35
  },
  {
    "serial_number": "5003291",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 35,
    "volume_number": 1,
    "text": "(The Sixteenth Session) (From the Fatwas of Fasting) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: First: Q: What is your opinion regarding those permitted to break the fast: like a very old man, an old woman, and a sick person not expected to recover? Does a ransom (Fidyah) become obligatory upon them for their breaking fast? A: Whoever is unable to fast due to old age or illness not expected to be cured must feed a poor person for every day, if able to do so; as a group of the Companions (may Allah be pleased with them) gave this fatwa, among them Ibn Abbas (may Allah be pleased with them both). Second: Q: A sick person caught part of the month of Ramadan then suffered loss of consciousness and remains so. Should his sons make up for him if he passes away? May Allah bless you. A: In the name of Allah, and praise be to Allah. He does not have to make up [the fast] if something befalls him that takes away his mind or what is called coma. If he regains consciousness, there is no make-up due on him. He is like the insane and the mentally impaired; no make-up is due, unless the coma was for a short period like a day or two or three at most, then making it up is fine as a precaution. But if the period is long, he is like the mentally impaired; no make-up is due. If Allah returns his mind, he begins deeds. Nor is it upon his sons - if he dies - to make up for him. We ask Allah for well-being and safety. Third: Q: I am sick with diabetes and ulcers. If I cannot fast, what must I do? (1)",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 219 - 220",
    "book_id": "821",
    "new_page_number": 36
  },
  {
    "serial_number": "5003292",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 36,
    "volume_number": 1,
    "text": "A: You must consult a specialist doctor. If the specialist doctor decides that fasting harms you, then break your fast. If Allah heals you, make it up after that. If specialist doctors decide that this disease is always harmed by fasting, and as far as they know the disease will continue and cure is not expected, then you break your fast and feed a poor person for every day half a Sa' of the country's staple food, amounting to approximately one and a half kilograms, and praise be to Allah. There is no fasting upon you; due to the saying of Allah Almighty (So fear Allah as much as you are able) [At-Taghabun: 16]. Fourth: Q: What is the ruling if a menstruating woman becomes pure during the day of Ramadan? A: She must abstain (from food and drink) according to the more correct of the two scholarly opinions; due to the removal of the legal excuse. And she must make up that day, just as if the sighting of Ramadan was confirmed during the day; the Muslims abstain for the rest of the day and make up that day according to the majority of scholars. Similarly, the traveler, if he arrives during the day in Ramadan to his town, must abstain according to the more correct of the two scholarly opinions due to the removal of the ruling of travel, along with making up that day. Allah is the Grantor of success. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (1).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 37
  },
  {
    "serial_number": "5003293",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 37,
    "volume_number": 1,
    "text": "(The Seventeenth Session) (1) (Sins are Multiplied in Virtuous Time and Place in Quality not Quantity) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: What is prescribed for a Muslim in Ramadan and other times is to struggle against his soul which commands evil until it becomes a tranquil soul commanding good and desiring it. It is obligatory upon him to struggle against the enemy of Allah, Iblis, until he is safe from his evil and incitements. The Muslim in this world is in a great continuous struggle against the self, desire, and Satan. He must increase in repentance and seeking forgiveness at all times. However, times differ from one another. The month of Ramadan is the best month of the year; it is a month of forgiveness, mercy, and emancipation from the Fire. If the month is virtuous and the place is virtuous, good deeds are multiplied in it, and the sin of evil deeds is magnified. A bad deed in Ramadan is greater in sin than a bad deed in other times, just as an act of obedience in Ramadan has more reward with Allah than an act of obedience in other times. Since Ramadan holds such a great status, obedience in it has great virtue and immense multiplication, and the sin of disobedience in it is more severe and greater than its sin in other times. So the Muslim must seize this blessed month with acts of obedience and righteous deeds and abstaining from sins, hoping that Allah Almighty will bestow acceptance upon him and guide him to steadfastness on the truth. However, a bad deed is always requited with its like and is not multiplied in number, neither in Ramadan nor in other times. As for a good deed, it is multiplied by ten times up to",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 446 - 448",
    "book_id": "821",
    "new_page_number": 38
  },
  {
    "serial_number": "5003294",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 38,
    "volume_number": 1,
    "text": "many multiples; due to the saying of Allah Almighty: (Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged) [Al-An'am: 160]. Verses with this meaning are numerous. Similarly, in a virtuous place like the Two Holy Sanctuaries, [good deeds] are multiplied many times in quantity and quality. As for sins, they are not multiplied in quantity, but they are multiplied in quality (severity) in the virtuous time and the virtuous place, as previously indicated. Allah is the Grantor of success. I ask Allah Almighty to facilitate for this Ummah right conduct in its affairs, protect it from the plots of its enemies, and grant it steadfastness in word and deed so that it becomes as Allah intended for it of glory, strength, and dignity. Indeed, He is the best One to ask. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 39
  },
  {
    "serial_number": "5003295",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 39,
    "volume_number": 1,
    "text": "(The Eighteenth Session) (Advice to One Who is Lazy in Prayer but Maintains Fasting) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: My advice to these people is to think deeply about their affair, and to know that prayer is the most important pillar of Islam after the two testimonies. Whoever does not pray and abandons prayer out of negligence is, according to the correct view I hold which is supported by the evidence of the Quran and Sunnah, a disbeliever with major disbelief that expels one from the religion (Millah), an apostate from Islam. The matter is not light; because whoever is a disbeliever apostate from Islam, neither fasting nor charity is accepted from him, nor is any deed accepted from him; due to His saying: (And what prevents their expenditures from being accepted from them but that they have disbelieved in Allah and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling) [At-Tawbah: 54]. So He, Glory be to Him, clarified that their expenditures, despite having benefit extending to others, are not accepted from them with their disbelief. And He, Glory be to Him, said: (And We will regard what they have done of deeds and make them as scattered dust) [Al-Furqan: 23]. Those who fast but do not pray, their fasting is not accepted; rather, it is rejected from them as long as we say: They are disbelievers, as indicated by the Book of Allah and the Sunnah of His Messenger (peace be upon him). So my advice to them is to fear Allah Almighty and to maintain prayer and perform it at its times and with",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 178 - 179)",
    "book_id": "821",
    "new_page_number": 40
  },
  {
    "serial_number": "5003296",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 40,
    "volume_number": 1,
    "text": "the congregation of Muslims. I guarantee them by the power of Allah that if they do that, they will find in their hearts a confirmed desire in Ramadan and after Ramadan to perform prayer at its times with the congregation of Muslims. For when a human repents to his Lord, turns to Him, and repents sincerely, he may be better after repentance than before it. As Allah Almighty mentioned about Adam (peace be upon him) that after what happened from him of eating from the tree, Allah Almighty said: (Then his Lord chose him and turned to him in forgiveness and guided [him]) [Ta-Ha: 122]. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (1).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 41
  },
  {
    "serial_number": "5003297",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 41,
    "volume_number": 1,
    "text": "(The Nineteenth Session) (Virtue of I'tikaf) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: I'tikaf (seclusion in the mosque) is a Sunnah for men and women; because it is confirmed from the Prophet (peace be upon him) that he used to perform I'tikaf in Ramadan, and finally his I'tikaf settled in the last ten days. Some of his wives used to perform I'tikaf with him, then they performed I'tikaf after him (peace be upon him). The place of I'tikaf is the mosques where congregational prayer is held. If his I'tikaf includes a Friday, it is better for his I'tikaf to be in a Jam'i Mosque (where Friday prayer is held) if possible. There is no specific limit for its time in the most correct opinions of scholars, and fasting is not a condition for it, but with fasting is better. The Sunnah is for him to enter his place of I'tikaf when he intends I'tikaf and leave after the period he intended passes. He may cut it off if a need calls for that; because I'tikaf is a Sunnah and does not become obligatory by starting it if it was not vowed. It is recommended to perform I'tikaf in the last ten days of Ramadan; following the example of the Prophet (peace be upon him). It is recommended for one who performs I'tikaf in them to enter his place of I'tikaf after the Fajr prayer of the twenty-first day; imitating the Prophet (peace be upon him). He leaves when the ten days end. If he cuts it off, there is no harm on him unless it was vowed as previously mentioned. It is better to take a specific place in the mosque to rest in if possible. It is prescribed for the Mu'takif (one in seclusion) to increase in Dhikr, reading Quran, seeking forgiveness, supplication, and prayer at times other than prohibited times. There is no harm if some of his",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 442, 443",
    "book_id": "821",
    "new_page_number": 42
  },
  {
    "serial_number": "5003298",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 42,
    "volume_number": 1,
    "text": "companions visit him and talk to him, as the Prophet (peace be upon him) used to be visited by some of his wives, and they would talk to him. Safiyyah (may Allah be pleased with her) visited him once while he was in I'tikaf in Ramadan. When she stood up, he stood up with her to the door of the mosque. This indicates that there is no harm in that. This action from him (peace be upon him) indicates the perfection of his humility and his good conduct with his wives. Upon him from his Lord be the best prayers and peace. Peace and blessings be upon our Prophet Muhammad, his family, his companions, and their followers in goodness.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 43
  },
  {
    "serial_number": "5003299",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 43,
    "volume_number": 1,
    "text": "(The Twentieth Session) (Laylat al-Qadr is the Best of Nights) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Laylat al-Qadr (The Night of Decree) is the best of nights. Allah sent down the Quran in it, and He informed that it is better than a thousand months, that it is blessed, and that therein every wise matter is determined, as He Glory be to Him said in the beginning of Surah Ad-Dukhan: (Ha, Meem. By the clear Book, Indeed, We sent it down during a blessed night. Indeed, We were to warn. Therein is made distinct every precise matter - [Every] matter [proceeding] from Us. Indeed, We were to send [a messenger] - As mercy from your Lord. Indeed, He is the Hearing, the Knowing) [Ad-Dukhan: 1 - 6]. And He Glory be to Him said: (Indeed, We sent the Qur'an down during the Night of Decree. And what can make you know what is the Night of Decree? The Night of Decree is better than a thousand months. The angels and the Spirit descend therein by permission of their Lord for every matter. Peace it is until the emergence of dawn) [Al-Qadr: 1 - 5]. It is authentically reported from the Messenger of Allah (peace be upon him) that he said: 'Whoever stands in prayer on Laylat al-Qadr out of faith and hope for reward, his past sins will be forgiven.' (2) Agreed upon. Standing in it is by prayer, Dhikr, supplication, reading Quran, and other forms of good. This great Surah has indicated that work in it is better than work in a thousand months other than it. This is a great bounty and mercy from Allah to His servants. So it is worthy for Muslims to honor it and revive it with worship. The Prophet (peace be upon him) informed that it is in the last ten days of Ramadan, and that the odd nights of the ten are more likely than others. He (peace be upon him) said: 'Seek it in the last ten nights of Ramadan, seek it in every odd night.' (3) Authentic Hadiths from",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 425 - 428 \n2. Narrated by Al-Bukhari (1901), and Muslim (7060). \n3. Narrated by Al-Bukhari (1986 and 1992), and Al-Tirmidhi (792).",
    "book_id": "821",
    "new_page_number": 44
  },
  {
    "serial_number": "5003300",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 44,
    "volume_number": 1,
    "text": "the Messenger of Allah (peace be upon him) have indicated that this night moves within the ten nights and is not always on a specific night of them. It may be on the night of the twenty-first, or the twenty-third, or the twenty-fifth, or the twenty-seventh—which is the most likely night—or the twenty-ninth, or it may be on the even nights. So whoever stands in prayer all ten nights out of faith and hope for reward catches this night without doubt and wins what Allah promised its people. The Prophet (peace be upon him) used to single out these nights with more diligence than he did in the first twenty. Aisha (may Allah be pleased with her) said: The Prophet (peace be upon him) used to strive in the last ten days of Ramadan what he did not strive in others. She also said: When the ten days entered, he would revive his night, wake his family, strive hard, and tighten his waistwrapper (1). He (peace be upon him) used to perform I'tikaf in them mostly. Allah Almighty said: (There has certainly been for you in the Messenger of Allah an excellent pattern) [Al-Ahzab: 21]. Aisha (may Allah be pleased with her) asked him saying: 'If I encounter Laylat al-Qadr, what should I say in it?' He said: 'Say: O Allah, You are Pardoning and love to pardon, so pardon me.' (2) The companions of the Prophet (peace be upon him), may Allah be pleased with them, and the predecessors after them used to honor these ten days and strive in them with various types of good. So it is prescribed for Muslims everywhere to follow the example of their Prophet (peace be upon him), his noble companions (may Allah be pleased with them), and the righteous predecessors of this Ummah, by reviving these nights with prayer, reading Quran, and various types of Dhikr and worship out of faith and hope for reward so they may win forgiveness of sins, removal of burdens, and emancipation from the Fire. A bounty from Him, Glory be to Him, generosity and kindness. The Book and Sunnah have indicated that this great promise is obtained by avoiding major sins. As He Glory be to Him said: (If you avoid the major sins which you are forbidden, We will remove from you your lesser sins and admit you to a noble entrance) [An-Nisa: 31]. And the Prophet (peace be upon him) said: 'The five daily prayers, and Friday to Friday, and Ramadan to Ramadan are expiations for what is between them if major sins are avoided.' (3)",
    "foot_note": "1. Al-Bukhari (1920), Muslim (1174), Al-Tirmidhi (796), Al-Nasa'i (1639), Abu Dawood (1376), Ibn Majah (1768), Ahmad bin Hanbal (6/ 68). \n2. Al-Tirmidhi (3513), Ibn Majah (3850). \n3. Narrated by Muslim (233).",
    "book_id": "821",
    "new_page_number": 45
  },
  {
    "serial_number": "5003301",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 45,
    "volume_number": 1,
    "text": "(The Twenty-First Session) (On the Virtue of the Last Ten Days of Ramadan) (1) [*] In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Sheikh Muhammad bin Uthaymeen, may Allah have mercy on him, said: My brothers: The last ten days of Ramadan have befallen you; in them are goodness and great rewards, famous virtues and great characteristics. Among their characteristics: The Prophet (peace be upon him) used to strive in deeds in them more than others. In Sahih Muslim from Aisha (may Allah be pleased with her) that the Prophet (peace be upon him) used to strive in the last ten days what he did not strive in others. In the two Sahihs from her, she said: When the ten days entered, the Prophet (peace be upon him) would tighten his waistwrapper, revive his night, and wake his family. In the Musnad from her, she said: The Prophet (peace be upon him) used to mix the twenty with prayer and sleep, but when the ten came, he rolled up his sleeves and tightened his waistwrapper. In this Hadith is evidence for the virtue of these ten days. Because the Prophet (peace be upon him) used to strive in them more than he strove in others, and this includes striving in all types of worship such as prayer, Quran, Dhikr, charity, and others. And because the Prophet (peace be upon him) used to tighten his waistwrapper, meaning he stayed away from his wives to free himself for prayer and Dhikr, and because the Prophet (peace be upon him) used to revive his night with standing, reading, and Dhikr with his heart, tongue, and limbs due to the honor of these nights and seeking Laylat al-Qadr",
    "foot_note": "1. Majalis Shahr Ramadan by Sheikh Muhammad bin Uthaymeen p. 99 - 100. [*] (Shamela Comment): In the electronic version sent by the author of the book (Sheikh Abdul Rahman Al-Humaizi), may Allah preserve him, the following session appeared here (instead of this session): (The Twenty-First Session) (Virtue of Night Prayer) [Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (11/ 296, 297, 298)]... [Text describes Night Prayer].",
    "book_id": "821",
    "new_page_number": 46
  },
  {
    "serial_number": "5003302",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 46,
    "volume_number": 1,
    "text": "regarding which: whoever stands in it out of faith and hope for reward, his past sins will be forgiven. The apparent meaning of this Hadith is that he (peace be upon him) revived the whole night in worship of his Lord through Dhikr, reading, prayer, preparing for that, Suhoor, and other things. Through this, reconciliation is achieved between it and what is in Sahih Muslim from Aisha (may Allah be pleased with her) who said: 'I do not know that he (peace be upon him) stood a night until morning.' Because reviving the night confirmed in the ten days is by standing and other types of worship, and what she denied was reviving the night in standing (prayer) only. And Allah knows best. Among what indicates the virtue of the ten days from this Hadith is that the Prophet (peace be upon him) used to wake his family in it for prayer and Dhikr, eager to seize these blessed nights with what they are worthy of in worship. For it is the opportunity of a lifetime and a prize for whomever Allah Almighty grants success. So it is not befitting for the wise believer to miss this precious opportunity for himself and his family. They are but numbered nights; perhaps a person catches in them a breeze from the breezes of the Lord and it becomes happiness for him in this world and the Hereafter. It is indeed a great deprivation and heavy loss to see many Muslims spending these precious times in what does not benefit them, staying awake most of the night in vain amusement, then when the time for standing comes, they sleep through it and miss for themselves much good that perhaps they will never catch after this year of theirs. This is from Satan's playing with them, his plotting against them, his blocking them from the path of Allah, and his misleading them. End quote. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "None",
    "book_id": "821",
    "new_page_number": 47
  },
  {
    "serial_number": "5003303",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 47,
    "volume_number": 1,
    "text": "(The Twenty-Second Session) (Khushu' [Humility/Focus] in Prayer) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: It should be known that what is prescribed for a Muslim in the night prayer of Ramadan and all prayers is to turn towards his prayer, have Khushu' in it, have tranquility in standing, sitting, bowing, and prostrating, recite carefully (Tartil), and not hasten. Because the spirit of prayer is turning to it with heart and body and having Khushu' in it, and performing it as Allah legislated with sincerity, truthfulness, desire, fear, and presence of heart; as Allah Almighty said: (Certainly will the believers have succeeded: They who are during their prayer humbly submissive) [Al-Mu'minun: 1, 2]. And the Prophet (peace be upon him) said: 'And the delight of my eye has been made in prayer' (2). And he said to the one who performed his prayer badly: 'When you stand for prayer, perform ablution well, then face the Qiblah and say Takbir, then read what is easy for you of the Quran, then bow until you are tranquil in bowing, then rise until you stand straight up, then prostrate until you are tranquil in prostration, then rise until you are tranquil in sitting, then prostrate until you are tranquil in prostration, then do that in all your prayer' (3).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 29 - 31 \n2. Narrated by Imam Ahmad (13623), and Al-Nasa'i (3940) \n3. Narrated by Al-Bukhari (6251), and Muslim",
    "book_id": "821",
    "new_page_number": 48
  },
  {
    "serial_number": "5003304",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 48,
    "volume_number": 1,
    "text": "Many people pray in the night prayer of Ramadan a prayer they do not comprehend nor find tranquility in; rather, they peck it like a bird pecks. That is not permissible; rather, it is a reprehensible act with which prayer is not valid, because tranquility (Tuma'ninah) is a pillar of prayer, essential as indicated by the aforementioned Hadith. So one must beware of that. In the Hadith from him (peace be upon him) he said: 'The worst of people in theft is the one who steals from his prayer.' They said: 'O Messenger of Allah, how does he steal his prayer?' He said: 'He does not complete its bowing or its prostration' (1). It is confirmed from him (peace be upon him) that he ordered the one who pecked his prayer to repeat it. O assembly of Muslims, honor the prayer and perform it as Allah legislated. Seize this great month and honor it - may Allah have mercy on you - with types of worship and acts of closeness, and hasten in it to acts of obedience. It is a great month Allah made as a field for His servants to race towards Him in acts of obedience and compete in types of good deeds. So increase in it - may Allah have mercy on you - prayers, charities, reading the Noble Quran with reflection and understanding, Tasbeeh (Glorification), Tahmid (Praise), Tahleel (Declaring Oneness), Takbir (Magnification), Istighfar (Seeking Forgiveness), increasing prayers and blessings upon the Messenger of Allah (peace be upon him), and benevolence to the poor, needy, and orphans. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "1. Narrated by Imam Ahmad (22136), Malik in Al-Muwatta' (403), and Al-Darimi (1328)",
    "book_id": "821",
    "new_page_number": 49
  },
  {
    "serial_number": "5003305",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 49,
    "volume_number": 1,
    "text": "(The Twenty-Third Session) (Importance of Zakat) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: The most important matter after Prayer is Zakat: it is the third pillar of Islam, and it is the partner of prayer in the Book of Allah Almighty and in the Sunnah of the Messenger of Allah (peace be upon him). So honor it as Allah honored it, and hasten to pay it at the time of its obligation and distribute it to its rightful recipients out of sincerity to Allah Almighty, willingness of soul, and gratitude to the Bestower Glory be to Him. Know that it is purification and cleansing for you and your wealth, gratitude to the One who blessed you with wealth, and comfort to your poor brothers, as Allah Almighty said (Take, [O, Muhammad], from their wealth a charity by which you purify them and cause them increase): [At-Tawbah: 103]. And He Glory be to Him said: (Work, O family of David, in gratitude. And few of My servants are grateful) [Saba: 13]. The Prophet (peace be upon him) said to Mu'adh bin Jabal (may Allah be pleased with him) when he sent him to Yemen: 'You are going to a people of the Book. So invite them to testify that there is no god but Allah and that I am the Messenger of Allah. If they obey you in that, then inform them that Allah has obligated upon them five prayers in every day and night. If they obey you in that, then inform them that Allah has obligated upon them a charity to be taken from their rich and given back to their poor. If they obey you",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz Vol 15/ 34 - 36",
    "book_id": "821",
    "new_page_number": 50
  },
  {
    "serial_number": "5003306",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 50,
    "volume_number": 1,
    "text": "in that, then beware of (taking) the best of their wealth, and fear the supplication of the oppressed, for there is no veil between it and Allah' (1). Agreed upon. It is appropriate for a Muslim in this noble month to expand in spending and caring for the poor and those who refrain from asking, helping them in fasting and night prayers; following the example of the Messenger of Allah (peace be upon him), seeking the pleasure of Allah Almighty, and thanking His favors. Allah Glory be to Him has promised His spending servants great reward and bountiful replacement. He Glory be to Him said: (And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward) Surah Al-Muzzammil Verse 20. And He Almighty said: (But whatever thing you spend [in His cause] - He will compensate it; and He is the best of providers) [Saba: 39]. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (2).",
    "foot_note": "1. Narrated by Al-Bukhari (1496), Muslim (19), and Al-Nasa'i (252) \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 51
  },
  {
    "serial_number": "5003307",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 51,
    "volume_number": 1,
    "text": "(The Twenty-Fourth Session) (Maintaining Prayer) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Among the most important matters a Muslim must care for and maintain in Ramadan and other times are the five daily prayers at their times; for they are the pillar of Islam and the greatest obligation after the two testimonies. Allah has magnified their status and mentioned them frequently in His Noble Book. He Almighty said: Surah Al-Baqarah (Maintain with care the [obligatory] prayers and [in particular] the middle prayer and stand before Allah, devoutly obedient) [Verse 238]. And He Almighty said: (And establish prayer and give zakah and obey the Messenger that you may receive mercy) [An-Nur: 56]. Verses with this meaning are numerous. The Prophet (peace be upon him) said: 'The covenant that stands between us and them is prayer; whoever abandons it has disbelieved' (2). And it is authentically reported from him (peace be upon him) that he said: 'Whoever maintains the prayer, it will be light, evidence, and salvation for him on the Day of Resurrection. And whoever does not maintain it, he will not have light, evidence, or salvation, and on the Day of Resurrection, he will be with Pharaoh, Haman, Korah, and Ubayy bin Khalaf' (3). One of the most important duties regarding it for men is performing it in congregation; as came in the Hadith from the Prophet (peace be upon him) that he said: 'Whoever hears the call and does not come, there is no prayer for him",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz: 15: (31 - 34) \n2. Narrated by Imam Ahmad (22428), Al-Tirmidhi (2621), and Ibn Majah (1079) \n3. Narrated by Imam Ahmad (6540), (272).",
    "book_id": "821",
    "new_page_number": 52
  },
  {
    "serial_number": "5003308",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 52,
    "volume_number": 1,
    "text": "except with an excuse' (1). A blind man came to him (peace be upon him) and said: 'O Messenger of Allah, I am a man whose house is far from the mosque, and I have no guide to lead me. Do I have a concession to pray in my house?' The Prophet (peace be upon him) said to him: 'Do you hear the call to prayer?' He said: 'Yes.' He said: 'Then answer...' And Abdullah bin Mas'ud (may Allah be pleased with him) said: 'I have seen us [at the time of the Prophet], and no one stayed behind from it except a hypocrite whose hypocrisy was known...' So fear Allah, O servants of Allah, regarding your prayers and maintain them in congregation. Advise one another to do so in Ramadan and other times; you will win forgiveness and multiplied reward, and be safe from Allah's anger and punishment and from resembling His enemies among the hypocrites. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "1. Narrated by Muslim (653), and Al-Nasa'i (850).",
    "book_id": "821",
    "new_page_number": 53
  },
  {
    "serial_number": "5003309",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 53,
    "volume_number": 1,
    "text": "(The Twenty-Fifth Session) (Adhkar Said After Finishing Prayer) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: I am pleased to remind my brothers in Allah that the Sunnah is for a Muslim to say after every obligatory prayer, whether he is an Imam, a follower, or praying alone: 'Astaghfirullah' (I seek forgiveness from Allah) three times, 'Allahumma anta al-Salam wa minka al-Salam tabarakta ya dhal-Jalali wal-Ikram' (O Allah, You are Peace and from You is peace; blessed are You, O Possessor of Majesty and Honor). Then he turns to the people if he is an Imam and faces them. Then he and others among the followers, and likewise the one praying alone, say: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir. La hawla wa la quwwata illa billah. La ilaha illa Allah wa la na'budu illa iyyah, lahun-ni'mah wa lahul-fadl wa lahuth-thana'ul-hasan. La ilaha illa Allah mukhlisina lahud-dina wa law karihal-kafirun. Allahumma la mani'a lima a'tayta wa la mu'tiya lima mana'ta wa la yanfa'u dhal-jaddi minkal-jadd.' And he says after Maghrib and Fajr prayers, along with the above: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd yuhyi wa yumit wa huwa 'ala kulli shay'in qadir' ten times. Then after that he says: 'Subhan Allah', 'Alhamdulillah', and 'Allahu Akbar' thirty-three times, and says to complete the hundred: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir.'",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (11/ 190, 189, 188)",
    "book_id": "821",
    "new_page_number": 54
  },
  {
    "serial_number": "5003310",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 54,
    "volume_number": 1,
    "text": "The Sunnah for the Imam, the one praying alone, and the follower is to recite these Adhkar audibly after every obligatory prayer with a moderate voice without affectation. It is confirmed in the two Sahihs from Ibn Abbas (may Allah be pleased with them both) that raising the voice with Dhikr when people finished the prescribed prayer was during the time of the Prophet (peace be upon him). Ibn Abbas (may Allah be pleased with them both) said: 'I used to know when they finished by that when I heard it' (1). It is not permissible for them to recite loudly in a collective voice; rather, each one remembers (Allah) by himself without regard for the voice of another; because collective Dhikr is an innovation with no basis in the purified Sharia. Then it is prescribed for the Imam, the followers, and the one praying alone to read (Ayat al-Kursi) silently, then each of them reads: (Say, \"He is Allah, [who is] One\"), (Say, \"I seek refuge in the Lord of daybreak\"), and (Say, \"I seek refuge in the Lord of mankind\") silently. After Maghrib and Fajr, (Say, \"He is Allah, [who is] One\"), (Say, \"I seek refuge in the Lord of daybreak\"), and (Say, \"I seek refuge in the Lord of mankind\") are repeated three times. This is best due to the authenticity of everything we mentioned above. Peace and blessings be upon our Prophet Muhammad, his family, his companions, and his followers in goodness until the Day of Judgment.",
    "foot_note": "1. Sahih Al-Bukhari Adhan (805), Sahih Muslim Mosques and Places of Prayer (583), Sunan An-Nasa'i Forgetfulness (1335), Sunan Abu Dawood Prayer (1003), Musnad Ahmad bin Hanbal (1/ 367).",
    "book_id": "821",
    "new_page_number": 55
  },
  {
    "serial_number": "5003311",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 55,
    "volume_number": 1,
    "text": "(The Twenty-Sixth Session) (A Verse and Its Interpretation) (1) Interpretation of His Almighty's saying: (Then, did they feel secure from the plan of Allah?) [Al-A'raf: 99] In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Q: What is the meaning of the saying of the Truth, Blessed and Exalted be He: (Then, did they feel secure from the plan of Allah? But no one feels secure from the plan of Allah except the losing people) [Al-A'raf: 99]. A: In this great verse, Allah Glory be to Him warns His servants against feeling secure from His plan, saying Glory be to Him: (Then, did they feel secure from the plan of Allah? But no one feels secure from the plan of Allah except the losing people) [Al-A'raf: 99]. The intent of this is: warning servants against feeling secure from His plan by persisting in disobeying Him and neglecting His right. The meaning of Allah's plan against them is His granting them respite and increasing blessings and good things for them while they persist in disobeying Him and opposing His command. So they are worthy of being taken in their negligence and punished in their inadvertence; due to their persistence in disobeying Him and their security from His punishment and anger, as He Glory be to Him said: (We will progressively lead them [to destruction] from where they do not know * And I will give them time. Indeed, My plan is firm) [Al-A'raf: 182, 183]. And He Almighty said: (And We will turn away their hearts and their eyes just as they refused to believe in it the first time. And We will leave them in their transgression, wandering blindly) [Al-An'am: 110]. And He Glory be to Him said: (So when they forgot that by which they had been reminded, We opened to them the doors of every [good] thing until, when they rejoiced in that which they were given, We seized them suddenly, and they were [then] in despair) [Al-An'am: 44], meaning: despairing of every good.",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (24/ 232)",
    "book_id": "821",
    "new_page_number": 56
  },
  {
    "serial_number": "5003312",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 56,
    "volume_number": 1,
    "text": "It is obligatory upon Muslims not to despair of Allah's mercy and not to feel secure from His plan and punishment. Rather, every Muslim must journey to Allah Glory be to Him in this world, the transient abode, between fear and hope. He remembers His greatness and the severity of His punishment if he disobeys His command, so he fears Him and dreads His punishment. And he remembers His mercy, pardon, forgiveness, generosity, and kindness, so he thinks good of Him and hopes for His kindness and pardon. Allah is the Grantor of success, Glory be to Him; there is no god but Him and no Lord other than Him. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (1).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 57
  },
  {
    "serial_number": "5003313",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 57,
    "volume_number": 1,
    "text": "(The Twenty-Seventh Session) (Whomever Allah Intends Good For, He Gives Him Understanding of the Religion) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Learning knowledge and seeking knowledge through the Noble Quran and through the Sunnah has a great reward. Knowledge is taken from the Book and from the Sunnah. The Prophet (peace be upon him) says: (The best of you is he who learns the Quran and teaches it) (2). There are many Hadiths regarding reading the Noble Quran, including the saying of the Prophet (peace be upon him): (Read the Quran, for it will come as an intercessor for its companions on the Day of Resurrection) Narrated by Muslim (3). One day, he (peace be upon him) said: (Would one of you like to go to Buthan and bring two large she-camels without sin or severing ties of kinship? They said: We would all love that, O Messenger of Allah. He said: For one of you to go to the mosque and learn two verses from the Book of Allah is better for him than two large she-camels, and three are better than three, and four are better than four, and [any number] of them according to their numbers of camels) (4) or as",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (25/ 56, 57, 58) \n2. Narrated by Al-Bukhari in the Book of Virtues of the Quran, Chapter: The best of you is he who learns the Quran and teaches it, number 4639. \n3. Narrated by Muslim in the Book of Travelers' Prayer and its Shortening, Chapter: Virtue of reading the Quran and Surah Al-Baqarah, number 1337. \n4. Narrated by Muslim in the Book of Travelers' Prayer and its Shortening, Chapter: Virtue of reading the Quran in prayer and learning it, number 1336.",
    "book_id": "821",
    "new_page_number": 58
  },
  {
    "serial_number": "5003314",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 58,
    "volume_number": 1,
    "text": "he (peace be upon him) said, (and Buthan is a valley in Medina). This indicates the virtue of learning the Noble Quran and reading the Noble Quran. In the hadith of Ibn Mas'ud: (Whoever reads a letter from the Quran gets a good deed, and the good deed is multiplied by ten) (1). Similarly, the Sunnah; if the believer learns it, reads the Hadiths, and studies them, he will have a great reward; because this is part of learning knowledge. The Prophet (peace be upon him) says: (Whoever travels a path seeking knowledge, Allah makes easy for him a path to Paradise) (2). This indicates that studying knowledge, memorizing Hadiths, and discussing them are among the causes of entering Paradise and salvation from the Fire. Likewise, the saying of the Prophet (peace be upon him): (Whomever Allah intends good for, He gives him understanding of the religion). Agreed upon (3). Gaining understanding of the religion is through the Book and through the Sunnah. Gaining understanding of the Sunnah is one of the proofs that Allah intended good for the servant, just as gaining understanding of the Noble Quran is evidence of that. The proofs for this are numerous, and praise be to Allah. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "1. Narrated by Al-Tirmidhi in the Book of Virtues of the Quran, Chapter: What came regarding whoever reads a letter from the Quran and his reward, number 2835. \n2. Narrated by Muslim in the Book of Dhikr, Supplication, Repentance and Seeking Forgiveness, Chapter: Virtue of gathering for reading Quran and Dhikr, number 4867. \n3. Narrated by Al-Bukhari in the Book of Knowledge, Chapter: Whomever Allah intends good for He gives understanding of religion, number 69, and Muslim in the Book of Zakat, Chapter: Prohibition of begging, number 1719.",
    "book_id": "821",
    "new_page_number": 59
  },
  {
    "serial_number": "5003315",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 59,
    "volume_number": 1,
    "text": "(The Twenty-Eight Session) (Zakat al-Fitr) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: Zakat al-Fitr is a Sa' of the country's staple food. It is confirmed from the Messenger of Allah (peace be upon him) that he obligated Zakat al-Fitr on Muslims as a Sa' of dates or a Sa' of barley, and ordered it to be paid before people go out to prayer, meaning the Eid prayer. In the two Sahihs from Abu Sa'id al-Khudri (may Allah be pleased with him) who said: We used to give it in the time of the Prophet (peace be upon him) as a Sa' of food, or a Sa' of dates, or a Sa' of barley, or a Sa' of dried yogurt (aqit), or a Sa' of raisins (2). A group of scholars interpreted 'food' in this Hadith as wheat, while others interpreted it as whatever the people of the land eat as staple, whatever it may be, whether wheat, corn, millet, or other than that. This is the correct view; because Zakat is a consolation from the rich to the poor, and it is not obligatory for a Muslim to console with other than his country's staple food. There is no doubt that rice is a staple food in the Kingdom and is good and valuable food; it is better than barley, which the text mentioned as sufficient. Thus, it is known that there is no harm in giving rice for Zakat al-Fitr. The obligation is a Sa' of all types using the Prophet's Sa' (peace be upon him), which is four handfuls with two moderate hands filled, as in Al-Qamus and others. By weight, it is approximately three kilograms. So if a Muslim gives a Sa' of rice or",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (14/ 200, 202) \n2. Narrated by Al-Bukhari (1506), and Muslim (98).",
    "book_id": "821",
    "new_page_number": 60
  },
  {
    "serial_number": "5003316",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 60,
    "volume_number": 1,
    "text": "other staple food of his country, it suffices him, even if it is from other than the categories mentioned in this Hadith, according to the more correct of the two scholarly opinions. It is permissible to give its equivalent by weight, which is approximately three kilograms. It is obligatory to give Zakat al-Fitr for the young and old, male and female, free and slave among Muslims. As for the fetus, it is not obligatory to give it on his behalf by consensus, but it is recommended; due to the action of Uthman (may Allah be pleased with him). It is also obligatory to give it before the Eid prayer, and it is not permissible to delay it until after the Eid prayer, but there is no harm in giving it one or two days before Eid. Thus, it is known that the earliest time to give it according to the most correct scholarly opinions is the night of the twenty-eighth; because the month can be twenty-nine or thirty, and the companions of the Messenger of Allah (peace be upon him) used to give it one or two days before Eid. Its recipients are the poor and needy. It is confirmed from Ibn Abbas (may Allah be pleased with them both) that he said: The Messenger of Allah (peace be upon him) imposed Zakat al-Fitr as purification for the fasting person from idle talk and obscenity, and as food for the poor. Whoever pays it before the prayer, it is an accepted Zakat, and whoever pays it after the prayer, it is a charity among charities (1). It is not permissible to pay the value (cash) according to the majority of scholars, and this has stronger evidence; rather, it is obligatory to give it as food, as the Prophet (peace be upon him) and his companions (may Allah be pleased with them) did, and this is the view of the majority of the Ummah. Allah is the One asked to grant us and all Muslims understanding of His religion and steadfastness upon it, and to rectify our hearts and deeds. Indeed, He is Generous and Kind. Peace and blessings be upon our Prophet Muhammad and his family and companions.",
    "foot_note": "1. Narrated by Abu Dawood (1609), and Ibn Majah (1827)",
    "book_id": "821",
    "new_page_number": 61
  },
  {
    "serial_number": "5003317",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 61,
    "volume_number": 1,
    "text": "(The Twenty-Ninth Session) (At the Conclusion of Ramadan) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: First: Among what must be alerted to is that some Muslims may strive in Ramadan and repent to Allah Glory be to Him from their past sins, but then after Ramadan exits, they return to their bad deeds. In this is great danger. The Muslim must beware of this and resolve with sincere determination to continue in obedience to Allah and leaving sins, as Allah Almighty said to His Prophet (peace be upon him): (And worship your Lord until there comes to you the certainty [death]) [Al-Hijr: 99]. And He Almighty said: (O you who have believed, fear Allah as He should be feared and do not die except as Muslims) [Al-Imran: 102]. And He Glory be to Him said: (Indeed, those who have said, \"Our Lord is Allah\" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised. We were your allies in the worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]. As accommodation from a Forgiving, Merciful Lord) [Fussilat: 30 - 32]. The meaning of the verse is that those who acknowledged that their Lord is Allah, believed in Him, were sincere to Him in worship, and remained steadfast on that, the angels give them glad tidings at death that there is no fear for them nor will they grieve, and that their destination is Paradise because of their belief in Him Glory be to Him, their steadfastness on His obedience, their leaving His disobedience, and their sincerity in worship to Him Glory be to Him. The verses in this meaning are many, all indicating the obligation of steadfastness on",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 15/ 428 - 43",
    "book_id": "821",
    "new_page_number": 62
  },
  {
    "serial_number": "5003318",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 62,
    "volume_number": 1,
    "text": "the truth, remaining upright upon it, and caution against persisting in disobeying Allah Almighty. Among that is His saying, Blessed and Exalted: (And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous. Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good; And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins - and who can forgive sins except Allah? - and [who] do not persist in what they have done while they know. Those - their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers) [Al-Imran: 133 - 136]. So we ask Allah to grant us and all Muslims success in these nights and others to what He loves and is pleased with, and to protect us all from the evils of our souls and the bad consequences of our deeds. Indeed, He is Generous and Kind. Second: It is confirmed from the Messenger of Allah (peace be upon him) that he said: (Whoever fasts Ramadan then follows it with six from Shawwal, it is like fasting the whole year). Narrated by Imam Muslim in the Sahih (1). These days are not specific days of the month; rather, the believer chooses them from the whole month. If he wishes, he fasts them at its beginning, or during it, or at its end. If he wishes, he separates them, and if he wishes, he fasts them consecutively. The matter is broad, praise be to Allah. If he hastens to them and follows them up at the beginning of the month, that is better; because that is part of racing to do good. It does not become obligatory upon him thereby; rather, it is permissible for him to leave them in any year, but continuing to fast them is better and more perfect; due to the saying of the Prophet (peace be upon him): (The most beloved deed to Allah is that which its doer is consistent upon, even if it is little) (2). Allah is the Grantor of success.",
    "foot_note": "1. Narrated by Muslim in (Fasting), Chapter: Desirability of fasting six days of Shawwal, number (1164). \n2. Narrated by Muslim in (Fasting), Chapter: Fasting of the Prophet (peace be upon him) in other than Ramadan, number (782).",
    "book_id": "821",
    "new_page_number": 63
  },
  {
    "serial_number": "5003319",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 63,
    "volume_number": 1,
    "text": "(The Thirtieth Session) (Eid Prayer) (1) In the name of Allah, all praise is due to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow his guidance. As for what follows: The Eid prayer is a communal obligation (Fard Kifayah) according to many scholars; it is permissible for some individuals to miss it, but attending it and participating with Muslim brothers is a confirmed Sunnah that should not be abandoned except for a legal excuse. Some scholars held that the Eid prayer is an individual obligation (Fard Ayn) like the Friday prayer, so it is not permissible for any accountable, free, resident male to miss it. This view is more apparent in evidence and closer to correctness. It is Sunnah for women to attend it while taking care to observe Hijab, covering, and not wearing perfume; due to what is confirmed in the two Sahihs from Umm Atiyyah (may Allah be pleased with her) that she said: We were ordered to bring out for the two Eids the young women and the menstruating women to witness the good and the supplication of the Muslims, and the menstruating women should keep away from the prayer place (2). In some of its wordings: One of them said: 'O Messenger of Allah, one of us does not find a Jilbab (outer garment) to go out in.' The Prophet (peace be upon him) said: 'Let her sister dress her from her Jilbab' (3). There is no doubt that this indicates the emphasis on women going out for the Eid prayers to witness the good and the supplication of the Muslims.",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 13/ 7 - 9 \n2. Narrated by Al-Bukhari (324), and Muslim (890) \n3. Narrated by Imam Ahmad (20269), and Ibn Majah (1307)",
    "book_id": "821",
    "new_page_number": 64
  },
  {
    "serial_number": "5003320",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Ramadan Gatherings (Majalis Ramadan)",
    "edition": "None",
    "publisher": "Dar Taybah Al-Khadra - Makkah Al-Mukarramah",
    "page_number": 64,
    "volume_number": 1,
    "text": "The Sunnah (1) for whoever comes to the Eid prayer place (Musalla) for Eid prayer or rain prayer (Istisqa) is to sit and not pray Tahiyyat al-Masjid (greeting the mosque); because that has not been reported from the Prophet (peace be upon him) nor from his companions (may Allah be pleased with them) as far as we know, unless the prayer is in a mosque, then he prays Tahiyyat al-Masjid; due to the generality of the Prophet's saying (peace be upon him): 'If one of you enters the mosque, let him not sit until he prays two Rak'ahs.' (2) It is prescribed for whoever sits waiting for the Eid prayer to increase in Tahleel (saying La ilaha illa Allah) and Takbir (saying Allahu Akbar); because that is the motto of that day. It is Sunnah for everyone inside and outside the mosque until the sermon ends. Whoever occupies himself with reading the Quran, there is no harm. Allah is the Grantor of success. We ask Allah to grant us success in what pleases Him and to guide us and all Muslims to His straight path. Indeed, He is Hearing, Near. Peace and blessings be upon our Prophet Muhammad and his family and companions (3).",
    "foot_note": "1. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz 13/ 14. \n1. Narrated by Al-Bukhari (1167), Muslim (714), and Imam Ahmad (22146). \n2. Collection of Fatwas and Articles by Sheikh Abdul Aziz bin Baz (1/ 130).",
    "book_id": "821",
    "new_page_number": 65
  }
]