[
  {
    "serial_number": "281748",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sects and Refutations\nBook: Al-Maturidiyyah\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 83\n[Book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nBook: Al-Maturidiyyah\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 83\n[Book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nAuthor: Dr. Abdul Majeed bin Muhammad Al-Wa'lan\nNumber of Pages: 83\n[Book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nNumber of Pages: 83\n[Book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\n[Book is not printed]\nPublication date in Al-Shamela: 25 Safar 1442\n\nPublication date in Al-Shamela: 25 Safar 1442",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281749",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Al-Maturidiyyah\nDr. Abdul Majeed bin Muhammad Al-Wa'lan",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281750",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it. I bear witness that there is no deity except Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger, the seal of the prophets and messengers, may Allah bless him and his family and companions all together, and those who follow them in goodness until the Day of Judgment.\nTo proceed:\nThis is a brief research on the Maturidiyyah (1), and it includes a preface and five chapters:\nPreface, containing three sections:\nSection One: Definition of Maturidiyyah and its founder.\nSection Two: Its emergence.\nSection Three: Reasons for the spread of Maturidiyyah.\nChapter One: The Source of Reception and Method of Inference according to the Maturidiyyah, containing five topics:\nTopic One: Reliance on Intellect.\nTopic Two: Abandoning argumentation with Ahad (solitary) Hadiths in matters of creed.\nTopic Three: The concept of Metaphor (Majaz).\nTopic Four: Interpretation (Ta'wil) and Relegation (Tafwid).\nTopic Five: The concept of Rational Goodness and Badness (Tahsin and Taqbih).\nChapter Two: Belief in Allah, containing five topics:\nTopic One: Knowledge of Allah is obligatory according to them by reason before the arrival of revelation.\nTopic Two: The faith of the imitator (Muqallid).\nTopic Three: Tawhid of Lordship (Rububiyyah).\nTopic Four: Tawhid of Divinity (Uluhiyyah).\nTopic Five: Tawhid of Names and Attributes.",
    "foot_note": "1. Benefited from: \"Al-Maturidiyyah and Their Stance on Tawhid of Names and Attributes\" by Al-Afghani, \"Al-Maturidiyyah: A Study and Evaluation\" by Ahmad Al-Harbi, and \"Al-Maturidiyyah\" by Muhammad Al-Khamis, with some minor additions.",
    "book_id": "64"
  },
  {
    "serial_number": "281751",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Chapter Three: The rest of the Pillars of Faith, containing three topics:\nTopic One: Belief in Messengers, containing two sections.\nSection One: How Prophethood is proven.\nSection Two: Miracle (Mu'jizah) and Karamat.\nTopic Two: Belief in the Last Day.\nTopic Three: Belief in Destiny and Decree (Qada and Qadar), containing four sections:\nSection One: Levels of belief in Destiny and Decree.\nSection Two: Actions of servants.\nSection Three: Capacity and Ability.\nSection Four: Burdening beyond capacity.\nChapter Four: Issues of Faith (Iman), containing five topics:\nTopic One: Meaning of Faith.\nTopic Two: Increase and decrease of Faith.\nTopic Three: Exception (Istithna) in Faith.\nTopic Four: Relationship between Faith and Islam.\nTopic Five: Ruling on the perpetrator of a major sin.\nChapter Five: Comparison between Maturidiyyah and Ash'ariyyah, containing two topics:\nTopic One: Issues of real disagreement between them.\nTopic Two: Issues of verbal disagreement between them.\nConclusion: Containing the most important results.\nI ask Allah Almighty to make it purely for His Noble Face. And Allah knows best, and may Allah bless and grant peace to our Prophet Muhammad.\nAbdul Majeed bin Muhammad Al-Wa'lan\nawalaan@gmail.com",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281752",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Preface\nSection One: Definition of Maturidiyyah:\nMaturidiyyah: An innovative theological sect attributed to Abu Mansur Al-Maturidi. It was established on using rational and theological proofs and evidences in arguing with its opponents, such as the Mu'tazila, Jahmiyyah, and others, to prove the truths of religion and Islamic creed (1).\nDefinition of Abu Mansur Al-Maturidi.\n1 - His Lineage and Life:\nHe is Abu Mansur Muhammad bin Muhammad bin Mahmoud bin Muhammad Al-Maturidi (2) Al-Samarqandi Al-Hanafi, the Theologian (Mutakallim). Ancient sources did not mention his birth date, but some contemporaries mentioned his birth date as approximately 238 AH, and Allah knows best (3). Others mentioned his birth was in 258 AH. As for his death, biographers of Al-Maturidi agreed that he died in the year (333 AH) (4).\nHe received knowledge of Hanafi jurisprudence and theology from the scholars of that era, including Nasr bin Yahya Al-Balkhi who died in 268 AH, and others from the senior Hanafi scholars, such as Abu Nasr Al-Ayadi, Abu Bakr Ahmad Al-Juzjani, and Abu Sulayman Al-Juzjani, until he became one of the senior Hanafi scholars. Some famous figures in theology studied under him. Abu Mansur had - according to his creed - numerous debates and arguments with the Mu'tazila in matters where he disagreed with them, and he has many books in various arts.",
    "foot_note": "1. Al-Mawsu'ah Al-Muyassarah: 1/ 29. \n2. Attributed to \"Maturid\" with a Fatha on the Mim, a Sukun on the Alif, a Damma on the Ta (two dots above), a Kasra on the Ra (undotted), a Sukun on the Ya (two dots below), and an undotted Dal, or \"Maturit\" with a Ta (two dots above) instead of the Dal, and the first is more famous. It is a district of the city of Samarkand. See: Al-Ansab: 12/ 2, Al-Fawaid Al-Bahiyyah: 195. \n3. See: 'Aqidat Al-Islam by Abu Al-Khair: 265, Introduction by Fath Allah to Kitab Al-Tawhid by Al-Maturidi: 2, Introduction by Ibrahim Awadain and Al-Sayyid Awadain to Ta'wilat Ahl Al-Sunnah by Al-Maturidi: 10. \n4. See: Introduction by Fath Allah to Kitab Al-Tawhid: 3, Imam Ahl Al-Sunnah by Ali Al-Maghribi: 14, Al-Maturidiyyah by Al-Afghani: 1/ 210 - 214.",
    "book_id": "64"
  },
  {
    "serial_number": "281753",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "He was titled in Transoxiana as the Imam of Sunnah and the Imam of Guidance - according to the Maturidiyyah - (1). He stood against the Mu'tazila who were in Transoxiana, yet he was close to them in his view of reason, though he did not go to their extremes. Instead, he considered it another source in addition to the primary source, which is revelation (Naql), prioritizing revelation over reason when they contradict. However, he considers knowledge of Allah obligatory by reason before the arrival of revelation, and that Allah punishes for the lack of this knowledge (2). Abdullah Al-Mara'i said in the book (Al-Fath Al-Mubin) in the biographies of Usulis: \"Abu Mansur was strong in argument, fierce in dispute, defended the beliefs of Muslims - meaning the Maturidiyyah -, and refuted the doubts of atheists\" (3).\n2 - His Works:\nAl-Maturidi has many works, including:\n1 - The exegesis known as (Ta'wilat Ahl Al-Sunnah) or (Ta'wilat Al-Quran), which is well-known and famous among the Maturidiyyah, and no other exegesis equals it for them, neither before nor after it.\n2 - Book of (Al-Tawhid), considered one of his most important theological works; because he established his theological theories in it and clarified his belief in the most important doctrinal issues.\n3 - A treatise on Faith (Iman).\n4 - Al-Maqalat (The Articles), considered one of the oldest books on sects; due to the early time of its author, but the book is lost.\n5 - Bayan Wahm Al-Mu'tazila (Exposing the Delusion of the Mu'tazila).\n6 - Radd Tahdhib Al-Jadal (Refutation of the Refinement of Dialectic).\n7 - Radd Wa'id Al-Fussaq (Refutation of the Threat to Sinners).\n8 - Radd Awa'il Al-Adilla (Refutation of the First Proofs).\n9 - Radd Al-Usul Al-Khamsa (Refutation of the Five Principles) by Abu Muhammad Al-Bahili.\n10 - Refutation of the Qarmatians.\n11 - Radd Al-Imamah (Refutation of the Imamate), which is a refutation of some Rafidis.\n12 - Ma'akhidh Al-Shara'i (Sources of Laws).\n13 - Al-Jadal (Dialectic) (4).",
    "foot_note": "1. See: Tarikh Al-Madhahib Al-Islamiyyah: 1/ 197. \n2. Firaq Mu'asirah by Ghalib Awaji: 3/ 1228. \n3. 1/ 193, 194. \n4. See: Al-Maturidiyyah by Al-Harbi: 109 - 114.",
    "book_id": "64"
  },
  {
    "serial_number": "281754",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "3 - His Sheikhs and Students:\nFirst: His Sheikhs:\n1 - Muhammad bin Muqatil Al-Razi, narrated from Waki' and his generation. He was criticized and not abandoned. He died in the year two hundred and forty-eight, and has works including Al-Mudda'i wa Al-Mudda'a 'Alayh (The Plaintiff and the Defendant) (1).\n2 - Abu Nasr Al-Ayadi Ahmad bin Al-Abbas bin Al-Hussein bin Jabalah Al-Samarqandi. He was a man of knowledge and Jihad, and had no narration or Hadith. He was captured by the disbelievers and killed in captivity in the land of the Turks during the days of Nasr bin Ahmad bin Ismail bin Asad bin Saman.\n3 - Abu Bakr Ahmad bin Ishaq Al-Juzjani. He combined the science of Usul (Principles) and the science of Furu' (Branches), and was of high rank in various sciences. He has the book (Al-Farq wa Al-Tamyiz) and the book (Al-Tawbah) and others.\n4 - Nusayr bin Yahya Al-Balkhi, also said Nasr. He was proficient in Hanafi jurisprudence and theology, died in the year 268 AH (2).\nSecond: His Students:\n1 - Abu Al-Qasim Ishaq bin Muhammad bin Ismail bin Ibrahim bin Zaid, the Wise Judge of Samarkand. He took jurisprudence and theology from Al-Maturidi, and is considered one of his most famous students. Abu Al-Mu'in mentioned that he died in the year 335 AH, and it was said 342 AH.\n2 - Abu Al-Hasan Ali bin Saeed Al-Rustughfani, attributed to Rustughfan, a village of Samarkand. Al-Rustughfani was described by his biographers as one of the senior Sheikhs of Samarkand and one of the major companions of Al-Maturidi, and he is mentioned in jurisprudence and principles in Hanafi books.\n3 - Abu Muhammad Abdul Karim bin Musa bin Isa Al-Faqih Al-Bazdawi. He studied jurisprudence under Abu Mansur Al-Maturidi, heard and narrated. He excelled in jurisprudence specifically. Al-Qurashi said he mentioned in the History of Nasaf that he died in the year 390 AH in Ramadan.\n4 - Abu Ahmad bin Abi Nasr Ahmad bin Al-Abbas Al-Ayadi, who is the son of Abu Nasr Al-Ayadi, the Sheikh of Al-Maturidi.\n5 - Abu Abdul Rahman bin Abi Al-Layth Al-Bukhari. He took theology and jurisprudence from Abu Mansur Al-Maturidi, and he is a companion of Abu Al-Qasim the Wise of Samarkand (3).\n6 - Abu Al-Yusr Al-Bazdawi (493 AH).",
    "foot_note": "1. Mizan Al-I'tidal: 4/ 47. \n2. Al-Maturidiyyah by Al-Harbi: 100 - 103. \n3. Al-Maturidiyyah by Al-Harbi: 104 - 108.",
    "book_id": "64"
  },
  {
    "serial_number": "281755",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Section Two: Emergence of the Maturidiyyah\nThe emergence of the Maturidiyyah began at the end of the third century at the hands of Abu Mansur Al-Maturidi. It was characterized by intense debates with the Mu'tazila and others. He had his rounds against the Mu'tazila and others, but with a methodology different from Al-Ash'ari's, although they met in many results. However, historical sources do not prove a meeting or correspondence between them, or viewing each other's books.\nThen after that, Abu Mansur had students who worked on spreading the ideas of their Sheikh and Imam, defended them, and wrote classifications following the school of Imam Abu Hanifa in Furu' (rulings). This was a reason for the popularity of the Maturidi creed in Samarkand.\nThen, after the spread of Maturidiyyah, its followers became active in writing. They authored works explaining the Maturidi creed and establishing it. One of the most famous authors was Abu Al-Mu'in Al-Nasafi (438 - 508 AH): He is Maimun bin Muhammad bin Mu'tamid Al-Nasafi Al-Makhuli. He is considered one of the most famous Maturidi scholars and one of the greatest supporters of the Maturidi school. He is to the Maturidiyyah what Al-Baqillani and Al-Ghazali are to the Ash'aris. Among his most important books is (Tabsira Al-Adilla), considered one of the most important references in knowing the Maturidi creed after the book (Al-Tawhid) by Al-Maturidi; rather, it is the most extensive reference in Maturidi creed absolutely. He summarized it in his book (Al-Tamhid). He also has the book (Bahr Al-Kalam), which is one of the concise books in which he addressed the most important theological issues.\nAlso among them is Najm Al-Din Umar Al-Nasafi (462 - 537 AH). He had many Sheikhs, and many people learned from him. He has works reaching a hundred, including: (Majma' Al-Ulum), (Al-Taysir fi Tafsir Al-Quran), (Al-Najah fi Sharh Kitab Akhbar Al-Sihah fi Sharh Al-Bukhari) and the book of creeds famous as (Al-Aqa'id Al-Nasafiyyah), which is considered one of the most important texts in Maturidi creed, and is a summary of (Tabsira Al-Adilla) by Abu Al-Mu'in Al-Nasafi.\nThe matter continues to expand and spread with the abundance of writing Maturidi books of: texts, explanations, explanations of explanations, and footnotes on explanations. Schools that adopt the call to Maturidiyyah, especially in the Indian subcontinent like the Deobandi school, the Barelvi school, and others (1).",
    "foot_note": "1. Al-Mawsu'ah Al-Muyassarah: 1/ 99.",
    "book_id": "64"
  },
  {
    "serial_number": "281756",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "Section Three: Reasons for the Spread of Maturidiyyah\nThe Maturidiyyah spread in various places for reasons, the most important of which are as follows:\n1 - The main reason, indeed the most important reason, is the adherence of Sultans and Kings to the Hanafi school. Because of that, the Hanafi school spread in the east and west of the earth, among Arabs and non-Arabs, Persians and Romans. With the spread of Hanafism and the influence of their authority, Maturidiyyah spread, because the Maturidis represented the Hanafi school in Furu' (rulings). It is known in history throughout the centuries that if any state leans towards a certain school, it facilitates and provides its scholars with positions of judiciary, fatwa, leadership, sermonizing, writing, and teaching. Thus, they find many reasons and easy ways to extend their authority and influence over peoples and homelands. The state also encourages them by establishing schools and mosques, thereby spreading their ideas and increasing their activity (1). Thus, Maturidiyyah and their beliefs spread in the lands of Transoxiana, the Turks, the Afghans, India, China, and adjacent areas.\nThis reason for spreading the Maturidi creed in India and its surroundings was strengthened by the fact that the scholars and sheikhs who came to India during the eras of Muslim kings: most of them were scholars from Transoxiana whose main reliance was on the books of late Hanafi jurists, and their care for the books of Sunnah was weak, and they were influenced by Greek sciences.\n2 - Maturidi Schools and their Scholarly and Teaching Activity: Maturidi schools have a great role in spreading their creed. In the history of the Ottoman Empire, Hanafism and Maturidiyyah served simultaneously. The authority of Maturidiyyah expanded according to the expansion of the authority of the Ottoman Empire. Most judges, muftis, mosque preachers, and school heads were Hanafi in branches and Maturidi in creed.\n3 - Activity of Maturidis in the Field of Writing: Maturidis have significant activity and continuous endeavor in the field of classifying books in theology. These books spread, and with their spread and teaching, the Maturidi creed spread (2).\n4 - Other matters which collectively form a strong reason for their spread and people's influence by them, which are as follows:\na- Their appearing as Ahl al-Sunnah, indeed their claim: that they and the Ash'aris represent Ahl al-Sunnah.\nb- Their accusation of the pure Ahl al-Sunnah and the People of Hadith of Anthropomorphism (Tajsim) and Likening (Tashbih) and the like.\nc- Their affiliation to the Salaf, especially to the Imams: \"Abu Hanifa\" and \"Al-Shafi'i\".\nd- The abundance of truth they possess compared to the falsehood possessed by others from the people of innovation.\ne- Their refutation of false sects like the early Jahmiyyah, Mu'tazila, Kharijites, Rafidis, and others.\nf- The weakness of some pure Ahl al-Sunnah and People of Hadith in spreading the creed of the Salaf, clarifying the truth, and refuting the opponent (3).",
    "foot_note": "1. Al-Nafi' Al-Kabir, Introduction to Al-Jami' Al-Saghir by Imam Muhammad bin Al-Hasan Al-Shaybani 7, Al-Rawda Al-Bahiyya: 4. \n2. 'Aqidat Al-Islam wa Al-Imam Al-Maturidi: 480. \n3. Al-Maturidiyyah by Al-Afghani: 1/ 294 - 301.",
    "book_id": "64"
  },
  {
    "serial_number": "281757",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter One: Source of Reception and Method of Inference according to the Maturidiyyah, containing five topics:\nTopic One: Reliance on Intellect.\nTopic Two: Abandoning argumentation with Ahad (solitary) Hadiths in matters of creed.\nTopic Three: The concept of Metaphor (Majaz).\nTopic Four: Interpretation (Ta'wil) and Relegation (Tafwid).\nTopic Five: The concept of Rational Goodness and Badness (Tahsin and Taqbih).",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281758",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Topic One: Reliance on Intellect\nThe Maturidiyyah divided the fundamentals of religion into \"Rationalities\" (Aqliyyat) and \"Auditories\" (Sam'iyyat), and based on that their stance on Revelation (Naql) in the chapter of what they call \"Rationalities\". So any text that contradicted their minds in \"Rationalities\", if it was from solitary news (Ahad), they rejected it, and if it was from concurrent news (Mutawatir), they distorted it or interpreted it with various corrupt interpretations. As for what relates to the Hereafter (Ma'ad), they do not interpret it (1).\nThe source of reception for the Maturidiyyah is the Intellect. Abu Mansur Al-Maturidi says: \"Knowledge of Allah and His command is an accident that is not perceived except by inference\" (2). Meaning: by inferential knowledge based on rational consideration.\nHe said in his interpretation of the Almighty's saying: {[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise} [An-Nisa: 165]: \"The reality of the argument for all that is only in acts of worship and laws whose way of knowing is hearing (revelation) not intellect, so it is not [an argument]. As for religion, the way of its necessity is by intellect, so they have no argument against Allah in that\" (3).\nThe Maturidiyyah also made most discussions of Divinity \"Rationalities\", making \"Hearing\" subordinate to Intellect in them. Among these Rationalities are those eight attributes which they call rational affirmative attributes, and they also call them (attributes of meanings). They rely in proving them on rational arguments which they view as definitive. As for Sharia texts, they mention them for support, not for reliance (4).\nAs for discussions of the Hereafter and Prophethoods, they made them auditory (Sam'iyyat), and they express Sam'iyyat as Legalities (Shar'iyyat) as well. They defined Shar'iyyat as matters whose possibility, affirmation or negation, the intellect judges decisively, but there is no way for the intellect to [know] them. As for Rationalities, they are what are not like that (5). Some of them made discussions of Prophethoods from the category of Rationalities (6).",
    "foot_note": "1. Al-Maturidiyyah by Al-Afghani: 1/ 537 - 540. \n2. Al-Tawhid: 4 - 6, 3, 129, 137, See: Al-Nibras: 316 - 317. \n3. See: Al-Tawhid 185: 224, Al-Tamhid: 19, Bahr Al-Kalam: 5, 6, 14. \n4. Minhaj Al-Sunnah: 7/ 37, and Sharh Al-Tahawiyyah: 237. \n5. Sharh Al-Mawaqif: 2/ 309. \n6. See: Al-Musayarah with its explanation by Qasim bin Qutlubugha: 216 - 242.",
    "book_id": "64"
  },
  {
    "serial_number": "281759",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "The Maturidiyyah do not claim absolute power for the intellect, as the intellect according to them perceives the appearances of things but does not perceive their essence and realities. Al-Maturidi explains this saying: \"Intellects were created finite, falling short of encompassing the totality of things, and understandings fall short of reaching the ultimate end of the matter\" (1). In doing so, they try to reach their goal, which is attempting to mediate between Reason and Revelation. This pushed them to divide beliefs into: Divinities and Prophethoods which reason independently proves, and Auditories (Sam'iyyat) which reason does not independently prove and are only perceived by Hearing (Revelation) (2).\nThis methodology by which the Maturidiyyah attempts to mediate between Reason and Revelation is fundamentally based on a false idea, which is that the texts of Revelation contradict the judgments of Reason. This alleged contradiction is in reality the path of the Philosophers originally, who do not affirm Prophethoods and do not see the sending of Messengers and what they brought as established truths. Their source in inferring the proof of matters is Reason; what Reason affirms is affirmed, and what it negates is negated.\nImam Abu Al-Muzaffar Al-Sam'ani, may Allah have mercy on him, said: \"Know that the separation between us and the innovators is the issue of Reason; for they founded their religion on the rational and made following and tradition subordinate to the rational. As for Ahl al-Sunnah, they said: The origin in religion is following, and intellects are followers. If the foundation of religion were on the rational, creation would have dispensed with Revelation and Prophets, peace be upon them, and the meaning of command and prohibition would be void, and whoever wished would say whatever he wished. If religion were built on the rational, it would be necessary not to allow believers to accept things until they reasoned them.\nWhen we contemplate the generality of what came in the matter of religion regarding the mention of Allah Almighty's attributes and what people worshiped (by believing), as well as what appeared among Muslims and circulated among them and transmitted from their predecessors until they attributed it to the Messenger of Allah, peace and blessings be upon him, regarding the mention of the punishment of the grave, the questioning of the two angels, the Basin, the Balance, the Path, the descriptions of the Fire, and the eternal abode of the two parties in them; these are matters whose realities are not perceived by our intellects, but rather the command came to accept them and believe in them. So if we hear something from the matters of religion and reason it and understand it, then to Allah belongs the praise for that and thanks, and from Him is success. And what we cannot perceive and understand and our intellects do not reach, we believe in it, confirm it, and believe that this is from His Lordship and Power, and we suffice in that with His Knowledge and Will. Allah Almighty said: {And they ask you, [O Muhammad], about the soul. Say, \"The soul is of the affair of my Lord. And mankind have not been given of knowledge except a little.\"} [Al-Isra: 85], and He Almighty said: {And they encompass not a thing of His knowledge except for what He wills} [Al-Baqarah: 255].\"\nThen he said, may Allah have mercy on him: \"Indeed, it is upon us to accept what we reasoned with faith and confirmation, and what we did not reason we accept with submission and surrender. This is the meaning of the saying of the sayer from Ahl al-Sunnah: Islam is a bridge that is not crossed except by submission\" (3).",
    "foot_note": "1. Al-Ta'wilat: (1/L 651) Dar Al-Kutub. \n2. Al-Maturidiyyah by Al-Harbi: 140 - 145. \n3. Al-Intisar li Ahl Al-Hadith 'an Sawn Al-Mantiq: 182 - 183.",
    "book_id": "64"
  },
  {
    "serial_number": "281760",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Topic Two: Abandoning Argumentation with Ahad Hadiths in Creed\nAmong the methodological principles of the Maturidiyyah in establishing creed is not using solitary Hadiths (Ahad) as proof in matters of beliefs. They do not argue except with the Quran or concurrent (Mutawatir) Hadiths, and they do not establish creed with the Quran or Hadith unless the text is definitive in indication (1). They said that solitary Hadiths yield conjecture (Zann) and do not yield certain knowledge (Yaqin), due to the occurrence of doubt in it being the news of the Messenger, because of the lack of security from fabrication of Hadiths against the Prophet, peace and blessings be upon him (2). They said they are accepted in legal rulings; as a precaution in the matter and taking with firmness, and because Mutawatir is not found in every incident, so if the solitary report were rejected, rulings would be suspended (3).\nAl-Maturidi stated the non-argumentation with solitary Hadiths in creeds in the book (Al-Tawhid) and in (Al-Ta'wilat). He mentioned that the solitary report does not necessitate knowledge because it does not reach the rank of the concurrent report in necessitating knowledge and testimony, but it must be acted upon. He used as evidence for the obligation of acting upon the solitary report Allah's command to those fit for understanding religion to stay behind from Jihad to warn their people when they return to them (4).\nThe Maturidiyyah in reality do not argue with authentic solitary Hadiths in practical legal rulings absolutely. Rather, for a Hadith to be accepted by them, it must agree with their rules and principles which they established. More than one of them has stated this. Abu Zaid Al-Dabbusi said in (Ta'sis Al-Nazar): \"The principle according to our companions is that the solitary report, when it comes contradicting the principles themselves, such as what was narrated from the Prophet, peace and blessings be upon him, that he obliged ablution from touching the penis, our companions did not accept this report because it came contradicting the principles\" (5).",
    "foot_note": "1. See: Sharh Al-Aqa'id Al-Nasafiyyah: 34, Al-Musamarah Sharh Al-Musayarah: 31, 32. \n2. Al-Nur Al-Lami': L 99, 100, Al-Hawashi Al-Bahiyyah: 1/ 59. \n3. Sharh Al-Manar by Abu Al-Barakat Al-Nasafi and its footnotes 620, Fath Al-Ghaffar Sharh Al-Manar: 2/ 79. \n4. Al-Tawhid: 8, 9, See: Al-Tahrir by Ibn Al-Humam: 334, Al-Maturidiyyah by Al-Harbi: 177 - 185. \n5. Ta'sis Al-Nazar: 156. See: ((Al-Usul)) by Abu Al-Hasan Al-Karkhi attached to Ta'sis Al-Nazar edited by Mustafa Al-Qabbani: 166 - 171.",
    "book_id": "64"
  },
  {
    "serial_number": "281761",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "The saying of the Maturidiyyah and those who agreed with them regarding the non-authoritativeness of solitary Hadiths in beliefs is a saying with no basis; rather, it is innovated and modern. Dividing what was narrated from the Prophet, peace and blessings be upon him, into Mutawatir and Ahad is a division that was not known in the era of the Companions and Followers. Also, the saying that the solitary report does not yield knowledge is a saying innovated by the Qadariyyah and Mu'tazila, and their intent by it was to reject Hadiths and refuse them because they are evidence against them (1).\nImam Al-Shafi'i, may Allah have mercy on him, stated the consensus of Muslims on the authoritativeness of the solitary report in Al-Risalah where he said: \"If it were permissible for anyone to say in the knowledge of the elite: Muslims ancient and modern agreed on confirming the solitary report and ending with it, such that no one from the jurists of Muslims is known except that he confirmed it, it would be permissible for me\" (2). He said after stating the authoritativeness of the solitary report: \"And the path of our predecessors and the generations after them until those we witnessed has not ceased to be this path\" (3).\nThe saying of the authoritativeness of the solitary report in beliefs and rulings is the school of Imam Malik, may Allah have mercy on him, as mentioned about him by Muhammad bin Ahmad known as Ibn Khuwayz Mindad (4). It is also the saying of Imam Ahmad, may Allah have mercy on him. Al-Marwadhi, may Allah have mercy on him, said: \"I said to Abu Abdullah: Here are two who say: The report necessitates action but does not necessitate knowledge. He faulted it and said: I do not know what this is...\" (5).\nIt is not known from Abu Hanifa, may Allah have mercy on him, that he said the solitary report does not yield knowledge, or that he differentiated in accepting it between beliefs and actions; rather, what was reported from him is accepting Hadiths without differentiation. It was narrated from him that he said: \"If the Hadith comes from the Prophet, peace and blessings be upon him, we do not deviate from it to other than it and we take it\" (6). This is the school of the Salaf and the majority of Muhaddithin and Usulis.",
    "foot_note": "1. See: Sawn Al-Mantiq: 161. \n2. Al-Risalah: 457. \n3. Al-Risalah: 453. \n4. See: Al-Ihkam fi Usul Al-Ahkam by Ibn Hazm: 1/ 132, Mukhtasar Al-Sawa'iq Al-Mursalah by Ibn al-Qayyim: 2/ 363. \n5. See: Mukhtasar Al-Sawa'iq: 2/ 363, Irshad Al-Fuhul by Al-Shawkani: 48. \n6. Manaqib Abu Hanifa by Al-Muwaffaq bin Ahmad Al-Makki: 71.",
    "book_id": "64"
  },
  {
    "serial_number": "281762",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Topic Three: The Saying of Metaphor (Majaz)\nThe Maturidiyyah went to say that Metaphor occurs in language, the Quran, and Hadith. Ibn Al-Humam said: \"Metaphor occurs in language, the Quran, and Hadith\" (1). What pushed them to this is their belief that carrying texts on their literal meanings necessitates Anthropomorphism (Tajsim) and Likening (Tashbih). Al-Bayadi said: \"Since carrying those texts on their literal meanings of physical limbs, spatial occupancy, and psychological affections was not possible due to the prohibition of definitive proofs, and it was not permissible to invalidate the original due to the lack of comprehending the reality of the description without modality (Bi-la Kayf), they are carried on metaphor from the attributes without modality\" (2).\nThe saying of Metaphor according to Ahl al-Sunnah wal-Jama'ah is a modern innovated saying with no basis. The early Imams of language like Al-Khalil bin Ahmad, Sibawayh, and Abu Amr bin Al-Ala' did not speak of it. Also, this division is not found among the Imams of Jurists and Usulis. Al-Shafi'i, may Allah have mercy on him, was the first to speak in the science of Usul, and his most important book in this science, (Al-Risalah), has reached us, and there is not the slightest indication in this book to this division, neither near nor far. Likewise, Imam Muhammad bin Al-Hasan Al-Shaybani in his book Al-Jami' Al-Kabir did not speak in it with the term of Truth (Haqiqa) and Metaphor (Majaz). Also, this division was not transmitted from any one of the Imams like Malik, Abu Hanifa, Al-Thawri, Al-Awza'i, and others (3).\nSheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: \"Whoever says from the Usulis... that he knows Truth from Metaphor by ways including the text of the people of language on that by saying this is truth and this is metaphor, has spoken without knowledge. For he thought that the people of language said this, and no one from the people of language nor from the predecessors of the nation and its scholars said this...\" (4).\nIbn al-Qayyim said: \"And if it is known that the division of words into truth and metaphor is not a legal, nor rational, nor linguistic division, then it is purely a terminology. It is a terminology that occurred after the three favored centuries by text, and its origin was from the side of the Mu'tazila and Jahmiyyah and those who followed their path from the Theologians...\" (5).",
    "foot_note": "1. Al-Tahrir: 168, See: Taysir Al-Tahrir by Amir Badshah: 2/ 21, Al-Tawhid: 68, 69. \n2. Isharat Al-Maram: 187, 189. \n3. See: Al-Iman by Ibn Taymiyyah: 72. \n4. Al-Iman by Ibn Taymiyyah: 73. \n5. Mukhtasar Al-Sawa'iq Al-Mursalah: 2/ 5. Al-Iman by Ibn Taymiyyah: 73.",
    "book_id": "64"
  },
  {
    "serial_number": "281763",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Topic Four: Interpretation (Ta'wil) or Relegation (Tafwid)\nSince the source of receiving creed for the Maturidiyyah in Rationalities is the Intellect, which is a ruler and origin, and Revelation is subordinate to it and a branch of it; if Revelation comes contrary to Reason, it must be rejected or distorted by interpreting it and diverting it from its apparent meaning. As for Auditories (Sam'iyyat), the source of receiving creed for them is Revelation.\nThe Mutawatir (concurrent) reports - like the texts of the Holy Quran and Mutawatir Sunnah - they judged them that even if they are definitive in establishment (Thubut), they are speculative in indication (Dalalah); because they are verbal evidences and speculative appearances that do not yield certainty, and they contradict definitive rational proofs. Rational proofs are definitive demonstrations, and in case of conflict, rational proofs are prioritized because they are the origin (1).\nAuditory evidences are either relegated (Tafwid) or interpreted (Ta'wil) (2). As for rational proofs, their interpretation is impossible (3).\nThey differed among themselves in which one to prioritize. Some of them said regarding these verses - meaning the verses of Informative Attributes - that they are ambiguous (Mutashabihat); we believe regarding them that there is no way to run them on their apparent meanings, nor do we occupy ourselves with their interpretation, and we believe that what Allah intended by them is true.\nOthers occupied themselves with explaining the probability of the verses having different meanings other than their apparent meaning. They say: We know that the intended meaning is some of what the words bear of meanings that are not contrary to Tawhid and Pre-eternity, and they do not decide definitively on Allah's intended meaning due to the lack of evidence necessitating decisiveness on the intended meaning and specifying some meanings (4).\nHe said in Al-Tamhid after mentioning the verses of attributes: \"So either we believe in their revelation and do not occupy ourselves with their interpretation, or they are diverted to a face of interpretation that agrees with Tawhid\" (5).",
    "foot_note": "1. See Sharh Al-Maqasid: 2/ 50, and Sharh Al-Aqa'id Al-Salafiyyah: 5, 42. \n2. See: Sharh Al-Aqa'id Al-Nasafiyyah: 42, Sharh Al-Maqasid: 2/ 50, Umdat Al-Qari: 25/ 88, 90, 109, 134. \n3. Nashr Al-Tawali': 282. \n4. Tabsira Al-Adilla: L 110, 111, 113, See: Usul Al-Din by Al-Bazdawi: 25, 26. \n5. Al-Sawad Al-A'zam: 27, Al-Tamhid: 19, See: Isharat Al-Maram: 187, 189.",
    "book_id": "64"
  },
  {
    "serial_number": "281764",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "The saying of the Maturidiyyah and other Theologians regarding interpretation (Ta'wil) is manifestly corrupt. What indicates its corruption is their contradiction in it, and a contradictory saying is a corrupt saying. Therefore, the physician Ibn Al-Nafis used to say: There are only two schools: the school of Ahl al-Hadith or the school of Philosophers. As for these Theologians, their saying is manifestly contradictory and differing (1). By this he \"means that Ahl al-Hadith affirmed everything the Messenger brought, while those [Theologians] made it all imagination and illusion. It is known by many auditory and rational proofs the corruption of the school of these heretics, so it is determined that the truth is the school of the Salaf, Ahl al-Hadith and Sunnah and Jama'ah\" (2).\nTherefore, they did not have a straight law in interpretation, so they cannot distinguish between texts that need interpretation and those that do not. They are, as Sheikh Al-Islam says: \"They obligate interpretation in some Auditories but not others, and there is no one among those attributed to the Qibla, nor even others, who can interpret all Auditories. If it is so, it is said to them: What is the difference between what you permitted interpretation for and diverted from its apparent concept and clear meaning, and what you affirmed? They are between two matters: either they say what their majority says: That what is opposed by a definitive rational [proof] we interpret, and what is not opposed by a definitive rational [proof] we affirm. It is said to them: Then you cannot negate interpretation from anything; for you cannot negate all rational oppositions... Also, the absence of a definitive rational opponent does not necessitate certainty in the indication of the auditory evidence; for according to your saying, if you permit the Lawgiver to say a saying that has an understood meaning while He does not intend that, because in the subtle rationalities that do not occur to the minds of most people or do not occur to creation in many centuries there is what contradicts that, it is permissible that He intends by His speech what contradicts its implication without that [rational opponent], due to the possibility that in the Hereafter what contradicts that appears, or due to that not being known by rational evidence and the like. If it is permissible that people's believing Him in what He reported depends on such a condition, it is permissible that it depends on similar conditions, since all share in that dependence on such a condition necessitates not inferring from any of His reports knowledge of what He reported.",
    "foot_note": "1. Dar' Ta'arud Al-Aql wa Al-Naql: 1/ 203. \n2. Dar' Ta'arud Al-Aql wa Al-Naql: 1/ 203.",
    "book_id": "64"
  },
  {
    "serial_number": "281765",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "And if they say by interpreting everything except what is known by necessity that He intended it, that would be more far-reaching. For there is no text transmitted except that the one repelling it can say: It is not known by necessity that He intended this. If the affirmer can say: I know by necessity that He intended it, the one who affirms what disputes this affirmer in it can also say something similar... If you contemplate their speech, you will not find for them a law regarding what is interpreted and what is not interpreted. Rather, the implication of their saying is the possibility of interpreting everything... So it is known that their saying is false...\" (1).\nThen it is said to them: Saying by interpretation according to your terminology is worse than Likening (Tashbih) and Negation (Ta'til); for interpretation \"implies Likening, Negation, manipulating texts, and thinking ill of them. For the Negator (Mu'attil) and the Interpreter (Mu'awwil) have shared in negating the realities of names and attributes, but the Interpreter distinguished himself by his manipulation of texts, violation of their sanctity, thinking ill of them, and attributing their Speaker to speaking what apparently is misguidance and misleading. So they combined four prohibitions: Their belief that the apparent meaning of the speech of Allah and His Messenger is impossible falsehood, so they understood Likening first, then moved to the second prohibition which is Negation, so they negated their realities based on that understanding which does not befit them nor befit the Lord, Majestic is His Majesty. The third prohibition is attributing the Speaker, who is Perfect in Knowledge, Perfect in Clarification, Complete in Advice, to the opposite of clarification, guidance, and direction... There is no doubt for every rational person that this implies they were more knowledgeable than Him, or more eloquent, or more advisory to people. The fourth prohibition: Their manipulation of texts and violation of their sanctities. If you saw them chewing them with their mouths while punishments have befallen them [the texts] and waves of interpretations have played with them, and the people of interpretation called out over them in the market of 'who increases', so each one offered in their price whatever interpretations he wanted. If you saw them among them while the Negators sat on their straight path pushing them back by their chests and rears, saying: You have no way over us, and if it must be, then by way of metaphor. For we are the people of rationalities and owners of demonstrations, and you are verbal evidences and auditory appearances that do not yield knowledge nor certainty. So there is no god but Allah and Allah is Greatest, how many strongholds of faith have been demolished by these pickaxes, and how many fortresses of the realities of Sunnah and Quran have been breached by them...\" (2).",
    "foot_note": "1. Dar' Ta'arud Al-Aql wa Al-Naql: 5/ 343 - 345. \n2. Al-Sawa'iq Al-Mursalah: 1/ 296 - 298, Mukhtasar Al-Sawa'iq: 1/ 48 - 50.",
    "book_id": "64"
  },
  {
    "serial_number": "281766",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "As for the saying of Relegation (Tafwid), it is among the worst sayings of the people of innovation; due to its contradiction and opposition to the texts of pondering the Quran, and its implication of attributing ignorance of the Lord of the Worlds to the Prophets and Messengers. For it is known \"that Allah Almighty commanded us to ponder the Quran and urged us to reason and understand it. So how is it permissible with that, that it is intended from us to turn away from understanding, knowing, and reasoning it?! Also, the discourse which was intended for our guidance and clarification to us and bringing us out of darkness into light, if what is mentioned in it of texts its apparent meaning is falsehood and disbelief, and it was not intended from us to know neither its apparent nor its hidden meaning, or it was intended from us to know its hidden meaning without clarification in the discourse for that; then on both estimations we were not addressed with what clarifies the truth nor did we know that the indication of this discourse is falsehood and disbelief.\nThe reality of the saying of these people regarding the One addressing us is that He did not clarify the truth nor explain it while commanding us to believe it, and that what He addressed us with and commanded us to follow and refer to did not clarify the truth nor reveal it; rather its apparent meaning indicated disbelief and falsehood, and He wanted from us not to understand anything from it, or to understand from it what there is no evidence for in it. All of this is something known by necessity to be far removed from Allah and His Messenger, and it is of the genus of the sayings of the people of distortion and atheism\" (1).\n\"So according to the saying of these people, the Prophets and Messengers do not know the meanings of what Allah revealed to them of these texts, nor do the Angels nor the early Predecessors. Then, what Allah described Himself with in the Quran, or much of what Allah described Himself with, the Prophets do not know its meaning; rather they say words whose meaning they do not reason... It is known that this is a defamation of the Quran and the Prophets; since Allah revealed the Quran and informed that He made it guidance and clarification for people, and commanded the Messenger to convey the clear notification and to clarify to people what was revealed to them, and commanded pondering the Quran and reasoning it. Yet, despite this, the most noble part of it, which is what the Lord reported about His attributes... no one knows its meaning, so it is not reasoned nor pondered, and the Messenger did not clarify to people what was revealed to them nor conveyed the clear notification. According to this estimation, every atheist and innovator says: The truth in the matter itself is what I knew by my opinion and intellect, and there is nothing in the texts that contradicts that; because those texts are problematic and ambiguous, and no one knows their meaning, and what no one knows the meaning of cannot be used as evidence...\" (2).",
    "foot_note": "1. Dar' Ta'arud Al-Aql wa Al-Naql: 1/ 202. \n2. Dar' Ta'arud Al-Aql wa Al-Naql: 1/ 204 - 205.",
    "book_id": "64"
  },
  {
    "serial_number": "281767",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Topic Five: The Saying of Rational Goodness and Badness (Tahsin and Taqbih)\nThe Maturidiyyah went to say rational goodness and badness, and that the intellect perceives the goodness and badness of things. They differed among themselves regarding deciding Allah's judgment in the action merely by the intellect perceiving goodness and badness in it. Their majority goes to say that Allah's judgment is decided in some actions but not others before the arrival of revelation, like Divinities and Prophethoods. As for Auditories and Laws, they are not perceived except by Hearing (Revelation).\nSome of them went to say that the intellect does not judge with the rule of Allah Almighty in what it perceived of the goodness and badness of the action except after the arrival of the Sharia.\nIbn Al-Humam said: \"The Hanafis entirely said the establishment of goodness and badness for the action in the way the Mu'tazila said it. Then they agreed on negating what the Mu'tazila built on establishing goodness and badness for the action, such as saying the obligation of the fittest (Al-Aslah), and the obligation of provision and reward for obedience and compensation for paining children and animals.\nThey differed: Is it known, considering the knowledge of their establishment in an action, the judgment of Allah in that action as an obligation? Professor Abu Mansur and the generality of the Sheikhs of Samarkand said: Yes, the obligation of faith in Allah and magnifying Him, and the prohibition of attributing what is heinous to Him, and confirming the Prophet, peace and blessings be upon him, which is the meaning of thanking the Benefactor.\nThe Imams of Bukhara among them said: No faith is obligatory nor disbelief prohibited before the Mission, as it is not impossible that the Creator does not command faith nor reward for it even if it is good, nor does He, Glory be to Him, forbid disbelief nor punish for it even if it is bad. The summary is that the absence of obligation is not rationally impossible since He, Glory be to Him, does not need obedience nor is harmed by disobedience\" (1).\nThe Maturidiyyah's saying of rational goodness and badness goes back to the fact that reason for them is the origin of knowledge, so it was an origin for hearing, and was prioritized over it in case of conflict (2).",
    "foot_note": "1. Al-Musayarah: 154 - 161, See: Al-Tawhid by Al-Maturidi: 221, 223, 224, Usul Al-Din by Al-Bazdawi: 92, Al-Tamhid: 43, 44. \n2. Al-Hikmah wa Al-Ta'lil fi Af'al Allah Ta'ala by Muhammad bin Rabi' bin Hadi Al-Madkhali: 94.",
    "book_id": "64"
  },
  {
    "serial_number": "281768",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, clarified the correct view in the issue of Goodness and Badness, saying: \"It has been established by discourse and wisdom obtained from laws three types:\nFirst: That the action contains a benefit or corruption even if the Sharia did not report that, just as it is known that justice contains the benefit of the world, and injustice contains their corruption. This type is good and bad, and the badness of that may be known by reason and Sharia, not that it established for the action a quality that was not there; but it does not follow from the occurrence of this badness that its doer is punished in the Hereafter if a Sharia did not report that. This is what the extremists who say by Goodness and Badness erred in, for they said: Servants are punished for their bad actions even if a Messenger was not sent to them. This contradicts the text, the Almighty said: {And We would not punish until We sent a messenger} [Al-Isra: (15)], and He said {And never would your Lord have destroyed the cities until He had sent to their mother city a messenger reciting to them Our verses. And We would not destroy the cities except while their people were wrongdoers} [Al-Qasas: 59]. The texts indicating that Allah does not punish except after the Message are many, refuting those who said from the people of Goodness and Badness that creation is punished on earth without a Messenger sent to them.\nSecond: That the Lawgiver if He commands something it becomes good, and if He forbids something it becomes bad, and the action acquires the quality of goodness and badness by the address of the Lawgiver.\nThird: That the Lawgiver commands something to test the servant whether he obeys Him or disobeys Him, and the intent is not the doing of the commanded thing, as He commanded Abraham to slaughter his son. When they submitted and he put him down upon his forehead, the purpose was achieved so He ransomed him with the slaughter. Likewise the Hadith of the leper, the bald, and the blind, when He sent to them someone asking them for charity. When the blind man responded \"The angel said: Keep your wealth; you have only been tested, and Allah is pleased with you and angry with your two companions\" (1). So wisdom originates from the command itself not from the commanded action itself. This type and the one before it were not understood by the Mu'tazila, and they claimed that goodness and badness only exist for what is described as such without the command of the Lawgiver. The Ash'aris claimed that the entire Sharia is from the section of testing, and that actions have no quality neither before Sharia nor by Sharia. As for the wise scholars and the majority, they affirmed the three types and that is the correct view\" (2).",
    "foot_note": "1. Narrated by Al-Bukhari: 2052. \n2. Al-Fatawa: 8/ 432 - 436.",
    "book_id": "64"
  },
  {
    "serial_number": "281769",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Chapter Two: Belief in Allah\nContaining five topics:\nTopic One: Knowledge of Allah is obligatory according to them by reason before the arrival of revelation.\nTopic Two: The faith of the imitator (Muqallid).\nTopic Three: Tawhid of Lordship (Rububiyyah).\nTopic Four: Tawhid of Divinity (Uluhiyyah).\nTopic Five: Tawhid of Names and Attributes.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281770",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Topic One: Knowledge of Allah is obligatory according to them by reason before the arrival of revelation\nThe Maturidiyyah went to say that knowledge of Allah is obligatory by reason before the arrival of revelation, and that the human bears responsibility for this knowledge before the sending of Prophets and Messengers and is not excused for abandoning it, rather he is punished for abandoning it (1). Some of them obliged knowledge of Allah Almighty by reason on the rational child (2). Abu Al-Mu'in Al-Nasafi said: \"Whoever revelation did not reach while he is rational and did not know his Lord, is he excused or not? According to us, he is not excused and he must deduce that the world has a Maker\" (3).\nThe truth and correct view in this issue is that knowledge of Allah is innate (Fitrah) in hearts, and was indicated also by Reason and Hearing. Whenever the matter required deducing it due to an obstacle of doubt or desire, that became obligatory. \"The Quran indicates this; for it mentions rational proofs and evidences for Tawhid, and clarifies its goodness and the ugliness of Shirk rationally and innately, and commands Tawhid and forbids Shirk. For this reason, Allah Almighty struck parables which are rational proofs, and addressed servants with that as an address to those in whose minds and innate natures the goodness of Tawhid and its obligation and the ugliness of Shirk and its blame are established. The Quran is full of rational proofs indicating that, such as His saying: {Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allah! But most of them do not know.} [Az-Zumar: 29], and His saying: {Allah presents an example: a slave who is owned and unable to do a thing and he to whom We have provided from Us good provision, so he spends from it secretly and publicly. Can they be equal? Praise to Allah! But most of them do not know.} [An-Nahl: 75], and His saying: {O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for it. And if the fly should steal away from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued. They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might.} [Al-Hajj: 73 - 74] to multiples of that of rational proofs of Tawhid which the Quran guided to and alerted to.\nBut here is another matter which is that punishment for abandoning this obligation is delayed until the arrival of the Sharia as indicated by His saying Almighty: {And We would not punish until We sent a messenger} [Al-Isra: (15)], and His saying: {It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\" (8) They say, \"Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'\"} [Al-Mulk: 8 - 9]. This is frequent in the Quran informing that the argument was established against them by His Book and His Messenger just as He alerted them by what is in their minds and innate natures of the goodness of Tawhid and gratitude and the ugliness of Shirk and Kufr\" (4).",
    "foot_note": "1. See: Ta'wilat Ahl Al-Sunnah: L 1/ 444, and Al-Tawhid: 102, 129, 130. \n2. See: Al-Tahrir: 24, Al-Rawda Al-Bahiyya: 37. \n3. Bahr Al-Kalam: 140 See: 5, 6. \n4. Madarij Al-Salikin: 3/ 488 - 490: See: Dar' Ta'arud Al-Aql wa Al-Naql: 9/ 38, 39, Bayan Talbis Al-Jahmiyyah: 1/ 247, 248, Al-Maturidiyyah by Al-Harbi: 147 - 150.",
    "book_id": "64"
  },
  {
    "serial_number": "281771",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Topic Two: Ruling on the Faith of the Imitator (Muqallid)\nWhen the Maturidiyyah said the obligation of observation (Nazar) and deduction (Istidlal) to know Allah, their majority went to say that whoever believed and did not observe and deduce, his faith is valid, but he sins for his abandoning observation and deduction. Some of them went to say that he is an imitator and does not sin for his abandoning observation and deduction.\nAl-Nasiri said: \"Imam Sayf al-Haqq Abu Al-Mu'in said: Then the school is that the imitator who has no proof is a believer, and the ruling of Islam is binding on him, and he is obedient to Allah Almighty in his belief and all other obediences, even if he is disobedient by abandoning observation and deduction, and his ruling is the ruling of others from the sinners of the people of the religion\" (1).\nAl-Zarnuji said: \"For the faith of the imitator, even if it is valid according to us, he is sinful by abandoning deduction\" (2).\nThe correct view in this issue is that decisiveness is sufficient in what decisiveness is required, even via imitation; for belief in Allah, His angels, His books, His messengers, and the Last Day: this is what decisiveness is required in, but the layman does not perceive that by its proof, yet we validate his faith, and say he is a believer even if he does not perceive that by its proof. The evidence for that is that Allah referred to asking the people of knowledge in an issue of religion where decisiveness is required, saying: {And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know} [Al-Anbiya: 7]; and it is clear that we ask them to take their saying, and it is known that belief that Messengers are men is from creed, yet Allah referred us in it to the people of knowledge... Moreover, if we obliged the layman to abandon imitation and adhere to taking by Ijtihad, we would oblige him with what he cannot bear, and Allah Almighty has said: {Allah does not charge a soul except [with that within] its capacity} [Al-Baqarah: 286], and He said: {It is those who hasten to good deeds, and they outstrip [others] therein * And We do not charge any soul except [with that within] its capacity} [Al-Mu'minun: 61 - 62] (3).\nAmong what refutes those claiming the invalidity of the imitator's faith is that the Companions, may Allah be pleased with them all, conquered most of the non-Arab lands, and accepted the faith of their commoners, like the uncouth Arabs, even if it was under the sword, or following a leader of theirs who embraced Islam, and they did not order anyone of them to repeat observation, nor asked him for the proof of his confirmation, nor postponed his affair until he observes\" (4).\nAl-Nawawi, may Allah have mercy on him, said in his explanation of the Prophet's saying, peace and blessings be upon him: (I have been commanded to fight the people until they testify that there is no god but Allah...) (5): \"In it is apparent indication for the school of the verifiers and the majorities of the Salaf and Khalaf that if a person believes with a decisive belief in which there is no hesitation, that suffices him, and he is a believer from the monotheists. It is not obligatory on him to learn the proofs of the theologians and know Allah Almighty by them, contrary to those who obliged that and made it a condition for being from the people of the Qibla and claimed that he does not have the ruling of Muslims except by it. This school is the saying of many of the Mu'tazila and some of our companions the theologians, and it is an apparent error; for the intent is decisive confirmation and it has occurred; and because the Prophet, peace and blessings be upon him, sufficed with confirmation of what he came with, peace and blessings be upon him, and did not stipulate knowledge by proof. Hadiths in the two Sahihs have demonstrated this, collectively yielding Tawatur in their principle and definitive knowledge\" (6).",
    "foot_note": "1. Al-Nur Al-Lami': L 8, 9. \n2. Ta'lim Al-Muta'allim Tariq Al-Ta'allum: 13, See: Usul Al-Din by Al-Bazdawi: 152, 153, Al-Musayarah and Hashiyat Qasim on them: 300 - 302. \n3. Sharh Al-Aqidah Al-Saffariniyyah by Ibn Uthaymeen: 310. \n4. Lawami' Al-Anwar: 1/ 269. \n5. Narrated by Al-Bukhari (25), and Muslim (20). \n6. Sharh Sahih Muslim: 1/ 210 - 211.",
    "book_id": "64"
  },
  {
    "serial_number": "281772",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Topic Three: Tawhid of Lordship (Rububiyyah)\nThe intended meaning of Tawhid according to the Maturidiyyah is the belief in Oneness (Wahdaniyyah), which for them is a negative attribute spoken of in three types:\nFirst: Oneness in Essence (Dhat). They mean by it the negation of plurality from His Essence Almighty, meaning it does not accept division. So they say He is One in His Essence having no partner/divider. They interpreted the word Al-Ahad mentioned in the texts regarding Allah Almighty with this meaning. So they said in interpreting the Almighty's saying: {Say, \"He is Allah, [who is] One} [Al-Ikhlas: (1)] He is Allah One, meaning the Existing One who has no part and no division to His Essence (1).\nSecond: Oneness in Attributes. What is meant by it, as they say: Negation of a peer to Him Almighty in every attribute of His attributes. So it is impossible that He Almighty has multiple knowledges and powers according to the knowns and empowered things; rather His knowledge Almighty is one, and His knowns are many, and His power is one, and His empowered things are many, and this applies to all His attributes.\nThey intended by them - meaning the previous two types - negating Anthropomorphism (Tajsim) and Likening (Tashbih), and they included in the name of this Tawhid which they coined the negation of what they negate of the attributes established by the Book and Sunnah. Therefore, they made negating body (Jism), substance (Jawhar), accident ('Arad) and similar invented words and meanings among the principles of their creed (2).\nThird: Oneness in Actions. It is called Tawhid of Actions. The intended meaning is His singling out Almighty in inventing all beings generally and the impossibility of attributing influence to other than Him Almighty in anything of the possible things at all.\nThe summary of their saying in His Tawhid Almighty: That He is One in His Essence having no divider or part, One in His attributes having no like, and One in His actions having no partner (3).",
    "foot_note": "1. Ta'wilat Ahl Al-Sunnah: L 656, 657. \n2. See: Al-Tawhid 38, 39, Al-Tamhid: 6 - 12, Al-Musayarah: 24 - 30, Isharat Al-Maram: 107. \n3. See: Al-Tawhid: 23, 119, 121, Bahr Al-Kalam: 4, 19, Al-Musamarah: 43.",
    "book_id": "64"
  },
  {
    "serial_number": "281773",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "Abu Mansur Al-Maturidi said in explaining the meaning of the One and Tawhid: \"And Allah is One, He has no like, Eternal, Subsisting, having no opposite nor peer. This is the interpretation of His saying: {There is nothing like unto Him} [Al-Shura: 11]. And One by being unique from likes and opposites. Therefore, the saying of body and accident regarding Him is void as they are interpretations of things. If this is established, estimating all that is attributed to Him of creation and described by Him of attributes with what is understood if it were attributed to creation and described by it becomes void\" (1).\nTawhid is singling out Allah Almighty with what He deserves of Lordship, Divinity, and Names and Attributes. It is divided into three sections: Tawhid of Lordship, Tawhid of Divinity, and Tawhid of Names and Attributes. Or into two sections: Tawhid of Knowledge and Affirmation: which is Tawhid of Lordship and Tawhid of Names and Attributes, and Tawhid of Intent and Will and Demand: which is Tawhid of Divinity (2). This is the creed of Muslims, believers in the Book of Allah and the Sunnah of His Messenger, peace and blessings be upon him.\nThe intended meaning of Tawhid of Lordship: Firm belief that Allah alone is the Creator, Provider, Giver of Life, Causer of Death, Disposer of all His creation's affairs, He has no partner in that (3).\nThe intended meaning of Tawhid of Divinity (4): Singling out Allah alone with submission, humility, love, reverence, and all types of worship, He has no partner.\nThe intended meaning of Tawhid of Names and Attributes: Firm belief in Allah's names and attributes mentioned in the Book and Sunnah, and affirming them without distortion, negation, conditioning, or likening (5).",
    "foot_note": "1. Al-Tawhid: 23. \n2. See: Majmu' Al-Fatawa: 3/ 94, Madarij Al-Salikin: 3/ 417, Sharh Al-Aqidah Al-Tahawiyyah: 26, Al-Qawl Al-Mufid: 1/ 12, Aqidat Al-Tawhid: 15. \n3. See: Al-Tawhid by Ibn Mandah: 3/ 304 - 306, Al-Hujjah fi Bayan Al-Mahajjah: 1/ 111 - 113, Al-Ibanah by Ibn Batta: 6/ 149, Al-Qawl Al-Mufid: 1/ 12, Aqidat Al-Tawhid: 16. \n4. See: Majmu' Al-Fatawa: 1/ 104, 19/ 106, Madarij Al-Salikin: 1/ 25, Sharh Al-Tahawiyyah: 26, Al-Aqa'id Al-Salafiyyah: 23, Da'wat Al-Tawhid: 47, Al-Qawl Al-Mufid: 1/ 14, Aqidat Al-Tawhid: 36. \n5. See: Aqidat Al-Salaf wa Ashab Al-Hadith: 160 - 164, Al-Hujjah fi Bayan Al-Mahajjah: 1/ 321, Al-Tadmuriyyah: 124, Al-Qawl Al-Mufid: 1/ 16, Aqidat Al-Tawhid: 63.",
    "book_id": "64"
  },
  {
    "serial_number": "281774",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Maturidiyyah believe that knowledge of Allah is not accomplished by necessary innate knowledge; rather it is only by rational acquisition. Therefore, one of the principles upon which their creed is built is (the obligation of knowing Allah by reason) and they arranged upon that the obligation of observation and deduction and made it the first duty on the servant (1). They made it the great goal and the supreme purpose, and that whoever brings it is a believing monotheist.\nTheir establishment of Tawhid of Lordship is based on proving two issues:\nFirst: Proving the existence of Allah: The Maturidiyyah believe that Allah Almighty is not known except through the world. In this regard, Al-Maturidi says: \"The principle is that Allah Almighty, since there is no way to know Him except through the indication of the world to Him, by the cutting off of ways to reach knowledge of Him through senses or the testimony of hearing\" (2). This knowledge for them is by proving the temporal origination (Huduth) of the world, then inferring by that the existence of its Originator Almighty (3).\nSecond: Proving the Oneness of Allah Almighty in His Lordship: The Maturidiyyah inferred the Oneness of Allah Almighty in His Lordship by the famous proof among Theologians known as the Proof of Mutual Prevention (Dalil Al-Tamanu') (4).\nThe form of the Proof of Mutual Prevention for them is: \"If it is proven that the world has an originator who originated it and a maker who made it, the Maker must be one. For if it had two makers, mutual prevention would be established between them, and that is proof of their temporal origination, or the temporal origination of one of them. For if one of them wanted to create life in a person and the other wanted to create death in him - and likewise in all opposites like movement and rest, gathering and separation, blackness and whiteness, etc. - either their wills are achieved and opposites exist in the locus which is impossible, or their wills are disabled and not executed and neither this nor that happens in the locus which is incapacitating them both, or the will of one of them is executed without the other and in it is the incapacitation of the one whose will was not executed. And incapacity is one of the signs of temporal origination. So if proving two eternal makers for the world is not conceivable, the Maker was necessarily one\" (5).",
    "foot_note": "1. See: Al-Tawhid 135 - 137, Sharh Al-Maqasid: 1/ 44, 45, 48, 49, Isharat Al-Maram: 84. \n2. Al-Tawhid: 129. \n3. See: Previous reference: 11 - 19, 231, 233, and Usul Al-Din: 14 - 15, 18. \n4. See: Al-Luma' by Al-Ash'ari: 8, Al-Insaf by Al-Baqillani: 30, Sharh Al-Aqa'id Al-Nasafiyyah: 93, 95, Al-Tawhid: 20, 21, 140. \n5. Al-Tamhid: 6.",
    "book_id": "64"
  },
  {
    "serial_number": "281775",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "This proof is a correct proof and a complete demonstration for proving the impossibility of the world emanating from two (1). However, the belief of the Maturidiyyah that this proof is what is intended by the Almighty's saying: {Had there been within the heavens and earth gods besides Allah, they both would have been ruined} [Al-Anbiya: 22], is a false belief and incorrect understanding of the word of Allah. What made them say this is their belief that Al-Ilah (God) means Al-Alih (Capable) - active participle - and that Divinity (Ilahiyyah) is the ability to invent (2). So Al-Ilah for them means Al-Rabb (Lord), and the verse indicated the negation of two Lords only, by estimating the impossibility of action from two Lords. So the verse for them indicated the negation of Shirk in Lordship only, which is the requirement of the Proof of Mutual Prevention. While the verse \"indicated what is more perfect and greater than this, and that proving two Lords for the world was not held by anyone from the sons of Adam. But the Shirk that occurred in the world only occurred by making some creatures created for other than Allah, and in Divinity by worshipping other than Allah Almighty, and taking intermediaries and invoking them and drawing near to them. As for proving two equal creators for the world, no one from humans went to that. Allah Almighty has said: {And if you asked them, \"Who created the heavens and earth?\" they would surely say, \"Allah.\"} [Az-Zumar: (38)]. Based on this, there is a big difference between the requirement of the verse and the requirement of the Proof of Mutual Prevention - according to the Maturidiyyah. The requirement of the verse is proving Tawhid of Divinity by the corruption of the world if there existed anyone deserving worship with Allah other than Allah Almighty, while the requirement of the Proof of Mutual Prevention is proving Tawhid of Lordship by the corruption of the world if another creator existed for the world.\nThe Maturidiyyah also inferred with other proofs such as inferring by the finiteness of the world, the signs of Prophets and Messengers, the consistency of the world and precision of its making. Al-Maturidi stated this in the book (Al-Tawhid) saying: \"And the indication that the Originator of the world is One, is the agreement of the saying that One is a name for the beginning of number and a name for greatness, authority, elevation, and virtue, as it is said so-and-so is the unique one of his time, and peerless in elevation, virtue, and majesty. And what exceeds that does not bear other than number, so the world must be finite since if there was one thing of them, the whole would exit finiteness by the exit of originators and that is far-fetched. Then there is no number pointed to except that it is possible to claim increase on it and decrease from it; so saying by something was not necessary because there is no reality for that by the right of number in which others do not share, therefore the saying by it is void\" (3).\nHe said in his inference by the signs of Prophets and Messengers and the consistency of the world: \"It was not mentioned about other than the God whom the people of Tawhid know, a claim of Divinity and pointing to a trace of action from him indicating his Lordship. Nor was there found in anything a meaning possible to extract from its bearing. Nor did he send messengers with signs that conquer minds and dazzle them to prove that the saying of that is imagination and whispering. And the coming of Messengers with signs which he who witnessed them is compelled [to admit] that they are the action of one who, if he had a partner, would prevent them from showing them since in that is invalidation of their Lordship and Divinity. So if he is not found nor were they prevented from that despite the abundance of those arrogant against them and stubborn opponents among those who, if they loved the existence of sight for them in showing their signs, they would have found it; so it is proven that that was only surrendered to the Messengers because the True God and Creator of creation is none other than the One, the Subduer who subdued every stubborn arrogant one from camouflage let alone verification\" (4).",
    "foot_note": "1. See: Dar' Ta'arud Al-Aql wa Al-Naql: 9/ 354, 355. \n2. Al-Tawhid: 20, 21, Al-Musayarah: 42 - 48. \n3. Al-Tawhid: 19. \n4. Al-Tawhid: 20, 21.",
    "book_id": "64"
  },
  {
    "serial_number": "281776",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Topic Four: Tawhid of Divinity (Uluhiyyah)\nThe Maturidiyyah did not address Tawhid of Divinity, nor did any of them pay attention to it; even though it is the origin of religion, and the beginning and end of the call of the Prophets and Messengers. This Tawhid is what the Messengers brought and called their people to. The Messengers affirm Tawhid of Lordship and call to Tawhid of Divinity as Allah informed about them (1). Allah Almighty said: {And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me\"} [Al-Anbiya: 25]. And He Almighty said about Noah, peace be upon him: {And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner (25) That you not worship except Allah. Indeed, I fear for you the punishment of a painful day (26)} [Hud: 25 - 26]. And He Almighty said about Hud, peace be upon him: {And to 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. You are not but inventors [of falsehood]\"} [Hud: 50] (2).\nThey did not differentiate between Tawhid of Divinity and Tawhid of Lordship; rather, they confused the meaning of Divinity with the meaning of Lordship. They thought that the meaning of Divinity is the ability to invent. Thus, they believed that Tawhid of Lordship is what is intended in His saying Almighty: {Had there been within the heavens and earth gods besides Allah, they both would have been ruined} [Al-Anbiya: (22)], and similar verses. They thought that the intended meaning of Tawhid - which is Allah's right upon His servants - is merely Tawhid of Lordship, which is the belief that Allah alone created the world. They thought that if they proved that by evidence, they had proved the ultimate Tawhid and that whoever came with it had purified the religion entirely for Allah and became a believing monotheist (3).\nTherefore, their attention was on Tawhid of Attributes and Tawhid of Actions - Tawhid of Lordship - (4). As for Tawhid of Actions: it is the most famous type of Tawhid for them, which is Tawhid of Lordship and Creatorship, meaning \"that Allah is the Creator of the world alone, and they think that this is the required Tawhid, and the goal, and that it is the meaning of 'La ilaha illa Allah'? Since they interpreted 'Divinity' as 'Ability to invent'\" (5).",
    "foot_note": "1. See: Madarij Al-Salikin: 1/ 411, Al-Din Al-Khalis: 1/ 57, Taysir Al-Aziz Al-Hamid: 20, Da'wat Al-Tawhid: 37. \n2. See: Iqtida' Al-Sirat Al-Mustaqim: 464, Majmu' Al-Fatawa: 16/ 332, Madarij Al-Salikin: 3/ 443, Miftah Dar Al-Sa'ada: 1/ 212, Tathir Al-I'tiqad: 6. \n3. Al-Maturidiyyah by Al-Harbi: 212. \n4. Al-Tadmuriyyah: 179 - 180, 185 - 186. \n5. See: Al-Tawhid by Al-Maturidi: 20 - 21, Tabsira Al-Adilla: L 35, and following, Al-Nur Al-Lami': L 22 - 23, Al-Musayarah: 42 - 48, Al-Tibyan by Al-Fanjfiri: 58 - 59.",
    "book_id": "64"
  },
  {
    "serial_number": "281777",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Sheikh Muhammad Al-Amin Al-Shanqiti, may Allah have mercy on him, said: \"Induction of the Great Quran has indicated that Tawhid of Allah is divided into three sections:\nFirst: His Tawhid in His Lordship. This type of Tawhid is ingrained in the innate nature of rationals. Allah Almighty said: {And if you asked them who created them, they would surely say, \"Allah.\"} [Az-Zukhruf: 87], and He said: {Say, \"Who provides for you from the heaven and the earth? Or who controls hearing and sight and who brings the living out of the dead and brings the dead out of the living and who arranges [every] matter?\" They will say, \"Allah,\" so say, \"Then will you not fear Him?\"} [Yunus: 31]. This type of Tawhid does not benefit except with sincerity of worship to Allah...\nSecond: His Tawhid, Mighty and Majestic, in His worship. The control of this type of Tawhid is realizing the meaning of \"La ilaha illa Allah\", and it is composed of negation and affirmation. The meaning of negation in it: casting off all types of worshipped things other than Allah whatever they may be in all types of worship whatever they may be. And the meaning of affirmation in it: singling out Allah - Mighty and Majestic - alone with all types of worship sincerely, in the manner He legislated on the tongues of His messengers, peace be upon them... This is where the battles between Messengers and their nations occurred {Has he made the gods [only] one God? Indeed, this is a curious thing.} [Sad: 5]. Among the verses indicating this type of Tawhid is His saying Almighty: {So know that there is no deity except Allah and ask forgiveness for your sin} [Muhammad: 19] the verse...\nThird: His Tawhid - Mighty and Majestic - in His names and attributes\" (1).\nAmong the verses that combined the three sections of Tawhid (2) is the saying of Allah Blessed and Exalted in Surah Maryam: {Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?} [Maryam: 65]. Sheikh Abdul Rahman bin Sa'di, may Allah have mercy on him, says explaining the indication of the verse to that: \"... It included - meaning the verse - great principles on Tawhid of Lordship, and that He Almighty is Lord of everything and its Creator and Provider and Manager. And on Tawhid of Divinity and Worship, and that He Almighty is the Worshipped God. And that His Lordship necessitates His worship and Tawhid... And it included that Allah Almighty is perfect in Names and Attributes, Great in descriptions, Majestic in destiny, and He has no",
    "foot_note": "1. Adwa' Al-Bayan fi Idah Al-Quran bi Al-Quran: 3/ 17 - 19. \n2. See: Al-Qawl Al-Mufid: 1/ 12.",
    "book_id": "64"
  },
  {
    "serial_number": "281778",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "likeness nor peer nor similarity in that, rather He is unique in absolute perfection from all aspects and considerations\" (1).\nThese three sections of Tawhid have many evidences in the Book of Allah and the Sunnah of His Messenger, peace and blessings be upon him:\n1 - From the evidences of Tawhid of Lordship is Allah Almighty's saying: {Praise be to Allah, Lord of the worlds} [Al-Fatiha: 2], and His saying: {Unquestionably, His is the creation and the command; blessed is Allah, Lord of the worlds} [Al-A'raf: 54], and His saying: {Say, \"Who is Lord of the heavens and earth?\" Say, \"Allah.\"} [Al-Ra'd: 16], and His saying: {Say, \"To whom belongs the earth and whoever is in it, if you should know?\" (84) They will say, \"To Allah.\" Say, \"Then will you not remember?\" (85) Say, \"Who is Lord of the seven heavens and Lord of the Great Throne?\" (86) They will say, \"[They belong] to Allah.\" Say, \"Then will you not fear Him?\" (87) Say, \"In whose hand is the realm of all things - and He protects while none can protect against Him - if you should know?\" (88) They will say, \"[All belongs] to Allah.\" Say, \"Then how are you deluded?\"} [Al-Mu'minun: 84 - 89], and His saying: {That is Allah, your Lord; blessed is Allah, Lord of the worlds} [Ghafir: 64], and His saying: {Allah is the Creator of all things, and He is, over all things, Disposer of affairs} [Az-Zumar: 62], and other verses.\n2 - And from the evidences of Tawhid of Divinity is His saying Almighty: {Praise be to Allah} [Al-Fatiha: 2]; because Allah means the Deified Worshipped One. And His saying: {It is You we worship and You we ask for help} [Al-Fatiha: 5], and His saying: {O mankind, worship your Lord, who created you and those before you, that you may become righteous} [Al-Baqarah: 21], and His saying: {So worship Allah, [being] sincere to Him in religion. (2) Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\"} [Az-Zumar: 2 - 3], and His saying: {Say, \"Allah [alone] I worship, sincere to Him in my religion, (14) So worship what you will besides Him.\"} [Az-Zumar: 14 - 15], and His saying: {And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion} [Al-Bayyinah: 5], and other verses.\n3 - And from the evidences of Tawhid of Names and Attributes is His saying Almighty: {The Entirely Merciful, the Especially Merciful (3) Sovereign of the Day of Recompense} [Al-Fatiha: 3 - 4], and His saying: {Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names.\"} [Al-Isra: 110], and His saying: {Allah - there is no deity except Him. To Him belong the best names} [Taha: 8], and His saying: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Al-Shura: 11], and the end of Surah Al-Hashr, and other verses.",
    "foot_note": "1. Al-Mawahib Al-Rabbaniyyah min Al-Ayat Al-Quraniyyah: 44, 45.",
    "book_id": "64"
  },
  {
    "serial_number": "281779",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Topic Five: Tawhid of Names and Attributes\nThe intended meaning of Tawhid of Names and Attributes is: Firm belief in Allah's names and attributes mentioned in the Book and Sunnah, and affirming them without distortion, negation, conditioning, or likening (1).\n\"The principle in this chapter is that Allah is described with what He described Himself with and what His Messengers described Him with, negation and affirmation. So we affirm for Allah what He affirmed for Himself and negate from Him what He negated from Himself. It is known that the method of the predecessors of the nation and its Imams is: affirming what He affirmed of attributes without conditioning or likening, and without distortion or negation. Likewise, they negate from Him what He negated from Himself while affirming what He affirmed of attributes without deviation (Ilhad) neither in His names nor in His verses. For Allah Almighty dispraised those who deviate in His names and verses, as He Almighty said: {And to Allah belong the best names, so invoke Him by them. And leave [the company of] those who practice deviation concerning His names. They will be recompensed for what they have been doing} [Al-A'raf: 180], and He Almighty said: {Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do (40)} [Fussilat: 40]. So their method includes affirming Names and Attributes while negating likeness to creatures: affirmation without likening and transcendence without negation, as He Almighty said: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Al-Shura: 11]. In His saying: {There is nothing like unto Him} is a refutation of Likening (Tashbih) and Representation (Tamthil), and in His saying: {and He is the Hearing, the Seeing} is a refutation of Deviation and Negation\" (2).\n\"If you know that Tawhid of Names and Attributes is to call upon Allah Almighty with what He named Himself and describe Him with what He described Himself and His Messenger Muhammad, peace and blessings be upon him, described Him, and negate Likening and Representation from Him, then the opposite of that is several things (3):\nFirst: Denying any of the Names or what they indicate of attributes and rulings, as the people of Negation (Ta'til) did.\nSecond: Naming Allah Almighty with what He did not name Himself; because the names of Allah Almighty are Tawqifiyyah (restricted to revelation); so naming Allah Almighty with what He did not name Himself is deviating with them from what is obligatory regarding them.\nThird: Believing that these names indicate the descriptions of creatures, making them indicate Representation.\nFourth: Deriving names for idols from the names of Allah Almighty, as the polytheists did in deriving Al-Uzza from Al-Aziz, and deriving Al-Lat from Al-Ilah.\nFifth: Divesting Allah of His attributes of perfection and descriptions of majesty, or likening His attributes to the attributes of His creation. Allah Almighty has said: {There is nothing like unto Him, and He is the Hearing, the Seeing} [Al-Shura: 11], and He Almighty said: {He knows what is [presently] before them and what will be after them, but they do not encompass it in knowledge (110)} [Taha: 110]\" (4).",
    "foot_note": "1. See: Aqidat Al-Salaf wa Ashab Al-Hadith: 160 - 164, Al-Hujjah fi Bayan Al-Mahajjah: 1/ 321, Al-Tadmuriyyah: 124, Al-Qawl Al-Mufid: 1/ 16, Aqidat Al-Tawhid: 63. \n2. Al-Risalah Al-Tadmuriyyah: 4. \n3. See: Al-Mufradat fi Gharib Al-Quran: 737, Mukhtasar Al-Sawa'iq Al-Mursalah: 2/ 110, Adwa' Al-Bayan fi Idah Al-Quran bi Al-Quran: 3/ 17 - 19, Majmu' Fatawa wa Rasa'il Ibn Uthaymeen: 1/ 157, 3/ 278, Mu'taqad Ahl Al-Sunnah wal-Jama'ah fi Asma' Allah Al-Husna: 14 - 24. \n4. Ma'arij Al-Qabul by Sheikh Hafiz Hakami: 2/ 459 with slight adaptation.",
    "book_id": "64"
  },
  {
    "serial_number": "281780",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "First: Tawhid of Names:\nThe Maturidiyyah said the obligation of affirming Allah Almighty's names, and that affirming them does not entail Likening (Tashbih), evidenced by the fact that Messengers and Divine Books came with them. If affirming them contained Likening, that would be an attack on the Messengers. Abu Mansur Al-Maturidi said: \"The principle according to us is that Allah has essential names by which He is named, such as His saying: {The Most Merciful} [Al-Rahman: 1]. Then the evidence for what we said is the coming of Messengers and Divine Books with them. If naming with what the Messengers brought contained Likening, they would be a cause for breaking Tawhid. But since those names bore the exit of the One named by them from the known named ones by the permissibility of their coming with them along with His saying: {There is nothing like unto Him} [Al-Shura: (11)] to negate by it the thingness of things\" (1).\nTheir majority went to say Tawqif (restriction to revelation) in Allah's names, meaning the way to affirm names is Hearing (Revelation), so Allah is not named except with what He named Himself and the Sharia brought.\nAl-Maturidi said - in his negation of the name 'Body' (Jism) for Allah -: \"Its right is Hearing from Allah, that Body is not among His names, and it was not reported from Him nor from anyone whom He permitted anyone to imitate. So saying it is not permissible. If it were permissible by coining without sensory, auditory, or rational evidence, it would be permissible to say Body (Jasad) and Person (Shakhs), and all that is denounced by Hearing. And not everything creatures are named with is said [of Him], and that is corrupt\" (2).\nWhat pushed them to say that Allah's names are Tawqifiyyah - even though their source of reception is Reason - is the fear of applying names to Allah Almighty that imply attributing imperfection to Him, Glory be to Him. So they said Tawqif out of precaution as stated by the author of (Bayan Al-I'tiqad) saying: \"The truth is that Tawqif is necessary as a precaution against what implies falsehood due to the greatness of danger in that. It is not permissible to suffice regarding the non-implication of falsehood with the reach of our perception, but one must rely on the permission of the Sharia\" (3).\nAbu Mansur Al-Maturidi said: \"It is not permissible to say to Allah Almighty 'O Blessed' (Ya Mubarak). Because this is not known in His names by transmission, and we must remain silent about naming Him with what He did not name Himself\" (4).",
    "foot_note": "1. Al-Tawhid: 93, 947, See: : 24, 41, 44, Al-Tamhid: 13 - 16. \n2. Al-Tawhid: 38, See: Al-Tamhid: 10. \n3. Bayan Al-I'tiqad: L 13. \n4. Al-Ta'wilat: L 562.",
    "book_id": "64"
  },
  {
    "serial_number": "281781",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Then the Maturidiyyah in their affirmation of Names did not differentiate between the chapter of Informing about Allah Almighty and the chapter of Naming. So they included in His names Almighty what is not among His names such as the Maker (Al-Sani'), the Eternal (Al-Qadim), the Essence (Al-Dhat), the Thing (Al-Shay'), and similar. He said in proving the permissibility of applying the word (Thing) to Allah, and that it is among His names, inferring for that by His saying Almighty: {There is nothing like unto Him} [Al-Shura: (11)], and His saying Almighty: {Say, \"What thing is greatest in testimony?\" Say, \"Allah is witness between me and you.\"} [Al-An'am: (19)]: \"And after, saying all this is obligatory because naming by it is established in Hearing\" (1).\nAs for their affirmation of the meanings of Names, they either make the meaning of the Name the Essence, and this is in the name (Allah) only. Or the meaning is taken by them considering the attributes they affirmed, such as the name Hearing (Al-Sami'), Seeing (Al-Basir), and Knowing (Al-Alim). Or they return it to negative and relative attributes.\nSo if the Name indicates what they affirmed of attributes, they affirmed it on its reality. And if it contradicts, they diverted it from its reality by interpretation; due to their belief that what the Name indicates of meanings and realities contradicts rational evidence. Ibn Al-Humam said: \"Then He Almighty is Hearing by a hearing, and Seeing by an attribute called sight, and likewise Knowing by knowledge, Powerful by power, and Willing by will because He Almighty applied these names to Himself in an address to one who is of the people of language. The concept in language of 'Knowing' is an essence that has knowledge; rather, it is impossible for them 'Knowing' without knowledge like its impossibility without a known object. So it is not permissible to divert it from it except for a rational definitive proof necessitating its negation\" (2).\nAl-Bayadi said: \"The concept of the Name may be the Essence itself and reality, which is the Name of Majesty only. And it may be taken considering attributes, actions, negations, and relations. There is no hiddenness in the multiplicity of His names Almighty by this consideration\" (3).\nAs for the rest of the names, the Maturidiyyah acknowledges that they have meanings taken considering attributes, i.e., they indicate attributes just as they indicate the Essence. However, in names whose meanings do not agree with what they believed in the chapter of attributes, they do not affirm what they indicated of meanings and realities in the correct manner; rather, they interpret them with what agrees with their belief in attributes.",
    "foot_note": "1. Al-Tawhid: 42, 94. \n2. Al-Musayarah: 68, 69. \n3. Isharat Al-Maram: 114, See: Al-Tawhid: 65, 66, 69, .",
    "book_id": "64"
  },
  {
    "serial_number": "281782",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Among the examples of that is the name of Allah (Al-A'la - The Most High): Al-Maturidi said in his interpretation of the name (Al-A'la): \"Al-A'la. He is higher than to be touched by need or attached by affliction\" (1). Abu Al-Barakat Al-Nasafi said: \"Al-A'la: Meaning Highness which is Subjugation and Ability, not the meaning of Highness in place\" (2).\nIn summary, their doctrine regarding the Beautiful Names is of two types:\nFirst: What included truth and agreed with Ahl al-Sunnah wal-Jama'ah in its appearance, including:\n1 - Affirming all of Allah's Beautiful Names for Him Almighty, thus separating from the extremist Jahmiyyah who do not affirm names for Allah (3).\n2 - Affirming many meanings of Allah Almighty's names, thus separating from the Jahmiyyah of Mu'tazila, because they affirm names stripped of meanings (4).\n3 - Allah Almighty's names are Tawqifiyyah, so it is not permissible to name Allah Almighty except with what came in the Sharia (5).\n4 - Allah Almighty's names are all beautiful (Husna), and they are not words stripped of their meanings, but indicate good meanings of glorification, sanctification, and magnification (6). His names Almighty are the best names and most majestic, for informing about the best meanings and most noble ones and for indicating attributes of perfection of Majesty, Beauty, and Honor (7).\nSecond: What included falsehood and deviation: The most important of which are:\n1 - That Allah Almighty's names are not real names for Allah Almighty. Abu Mansur Al-Maturidi said: \"It indicates to you that the names we call Him by are expressions of what brings closer to understandings, not that they are in reality His names\" (8).\n2 - The Beautiful Names do not contain independent attributes but are included in the attribute of Takwin (Bringing into being). Anwar Shah Al-Kashmiri Al-Deobandi said: \"The Beautiful Names according to the Ash'aris are expressions of relations, and as for the Maturidiyyah, they are all included in the attribute of Takwin\" (9).\n3 - Allah's Beautiful Names are created according to them: Because they are expressions of words and letters, and they are created. Therefore, they made Allah Almighty's Beautiful Names 'Tasmiyat' (namings).",
    "foot_note": "1. Al-Ta'wilat: L 547. \n2. Tafsir Al-Nasafi: 4/ 223 - 224. \n3. See: Al-Tadmuriyyah: 182 - 183. \n4. See: Previous reference: 182 - 183. \n5. See: Kitab Al-Tawhid: 38 - 44, Sharh Al-Mawaqif by Al-Jurjani Al-Hanafi Al-Maturidi: 8/ 210, Madarik Al-Tanzil: 1/ 591, and Irshad Al-Aql Al-Salim by Abu Al-Saud: 3/ 296 \n6. Madarik Al-Tanzil: 1/ 591, 2/ 274. \n7. Irshad Al-Aql Al-Salim: 3/ 296, 5/ 200. \n8. Kitab Al-Tawhid: 93 - 94. \n9. Fayd Al-Bari: 4/ 517.",
    "book_id": "64"
  },
  {
    "serial_number": "281783",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "When they said they are namings, they said: They are other than Allah Almighty, they are letters and words, and the Eternal Name is the Named Himself, which is Allah, none other (1). All this to graduate to saying that Allah Almighty's names are created after their saying: They are other than Allah; because everything other than Allah is created (2).\nOne of the most important issues related to the chapter of Names for the Maturidiyyah is the issue: The Name and the Named. The Maturidiyyah went in this issue to say that the Name is the Named. They argued with His saying Almighty: {Blessed is the name of your Lord} [Al-Rahman: (78)], and His saying: {Exalt the name of your Lord, the Most High} [Al-A'la: (1)]. They said: Allah is the Creator and what is other than Him is created, so if His names were other than Him, they would be created, and it would imply that He has no name in pre-eternity nor attribute (3).\nAl-Bazdawi said: \"The proof compels us and every rational person to say that the Name is the Named itself, for people were commanded to worship Allah Almighty, and unify Allah Almighty, magnify Him, takbir Him, and tahlil Him. If the Name were other than the Named, this would be a mistake. Allah Almighty said: {And worship Allah and associate nothing with Him} [An-Nisa: 36], and He said: {O mankind, fear your Lord} [Al-Hajj: (1)]\" (4).\nAbu Al-Mu'in Al-Nasafi said: \"Know that the Name and the Named are one. And Allah Almighty with all His names is One. Our evidence is the saying of Allah Mighty and Majestic: {So worship Allah, [being] sincere to Him in religion} [Az-Zumar: (2)], and His saying Almighty: {And they were not commanded except to worship one God} [At-Tawbah: (31)]. Allah Almighty commanded us to unify Allah Almighty, so if the name of Allah Almighty were other than Allah, the occurrence of Tawhid would be for the Name not for Allah Almighty\" (5).\nThe correct view in the issue is detailing: \"So the Name is intended by it the Named sometimes, and intended by it the word indicating it other times. If you say: Allah said such, and Allah rose over His Throne, and Allah heard, saw and created, then what is intended here is the Named Himself. And if you say (Allah) is an Arabic name, and (Al-Rahman) is an Arabic name, and (Al-Rahman) is from the names of Allah, and (Al-Rahman) its weight is Fa'lan, and (Al-Rahman) is derived from Rahma and similar, then the Name here is for the Named and it is not said 'other' due to the ambiguity in the word 'other'. If the difference meant is that the word is other than the meaning, then it is true. And if it is meant that Allah, Glory be to Him, was without a name until He created for Himself a name or until His creation named Him with names of their making, then this is of the greatest deviation and atheism\" (6).",
    "foot_note": "1. See: Kitab Al-Tawhid: 65 - 66, and Ruh Al-Ma'ani: 1/ 53. \n2. See: Majmu' Al-Fatawa: 6/ 185 - 186, and Sharh Kitab Al-Tawhid fi Sahih Al-Bukhari by Al-Ghunayman: 224. \n3. See: Al-Tawhid: 66, Sharh Al-Fiqh Al-Akbar by Al-Qari: 15. \n4. Usul Al-Din: 88, 89, 90. \n5. Bahr Al-Kalam: 37, See: Tabsira Al-Adilla: 198. \n6. Shifa' Al-Alil: 277, See: Sharh Al-Tahawiyyah by Ibn Abi Al-Izz: 80.",
    "book_id": "64"
  },
  {
    "serial_number": "281784",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Second: Tawhid of Attributes:\nThe Maturidiyyah are considered among the Sifatiyyah (Attributists) regarding Allah Almighty's attributes, because they affirm some attributes, and affirm for these attributes a real meaning subsisting in the Essence of the Lord Almighty. They are not merely the description of the describer or negation of the opposite according to them (1). The Maturidiyyah emphasized that affirming these attributes does not entail Likening (Tashbih), since there is no similarity between the reality of the Creator and the created. If affirming attributes entailed Likening, it would imply pre-eternity of the created or temporal origination of the Creator, which no rational person says. Al-Maturidi said: \"There is no likeness in affirming Names and verifying Attributes to negate the realities of what is in creation from Him. For if He had similarity to anything, pre-eternity would fall from Him due to that, or temporal origination would fall from the other. If He were described by similarity to other than Him in any aspect, He would become from that aspect like one of creation\" (2).\nThe affirmative attributes according to the Maturidiyyah are eight attributes: Power (Qudra), Knowledge (Ilm), Life (Hayat), Will (Irada), Hearing (Sam'), Sight (Basar), Speech (Kalam), and Bringing into Being (Takwin) (3). They singled out affirmation for these attributes over others, because they are the ones indicated by reason according to them. As for other attributes, there is no evidence for them from reason according to them, so they said by negating them.\nThey followed two methods in inferring the affirmation of these attributes, and sometimes they may follow other methods:\nFirst: Transcending imperfections.\nSecond: Indication of created things.\nAbu Al-Mu'in Al-Nasafi clarified the first method saying: \"If it is proven that the Maker of the world is Eternal, and from the condition of Eternity is freedom from imperfections, it is proven that He is Living, Capable, Hearing, Seeing, Knowing. For if He were not so, He would be described with death, ignorance, incapacity, blindness, and deafness, since these attributes are successive to those attributes. If these attributes were not established for Allah Almighty, what succeeds them would be established, which are attributes of deficiency, and from the condition of Eternity is Perfection. So it indicated that He is described with what we explained due to the necessity of negating their opposites which are marks of the temporal due to being deficiencies\" (4).",
    "foot_note": "1. See: Al-Tawhid: 49 - 60, 128, 129, Usul Al-Din, by Al-Bazdawi: 21, 22. \n2. See: Al-Tawhid: 24, 25, and Al-Tamhid: 13, 14, and Usul Al-Din: 31 - 33 \n3. See: Isharat Al-Maram: 107, 114, Jami' Al-Mutun: 8 - 12, Nazm Al-Fara'id: 24. \n4. See: Al-Tamhid: 9, 12, 21, Al-Musayarah: 67.",
    "book_id": "64"
  },
  {
    "serial_number": "281785",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "He said regarding the second method: \"And if it is also proven that He is the Inventor of this world with its different types, and He is its Creator as it is of precision and mastery, novel description, wondrous organization and arrangement, composition of orbits and what is in them of moving stars, and what is seen of wonders in the bodies of animals of life, distinction, and guidance to attracting benefits and repelling harms, and what is in them of senses, and what is in inanimate bodies of wonders and properties deposited in them such that if a person of insight described with precise thought, sharp mind, superior intellect, perfect intelligence, and strong discrimination contemplated all his life in them he would not grasp their essence; rather not a part of a thousand parts of what is in them of traces of perfect wisdom and subtle management, it is proven that He is Living, Capable, Knowing, Hearing, Seeing. Knowledge of that runs the course of intuitive axioms, so much so that all rational people attribute one who attributes weaving embroidered brocade, producing elegant images, building high palaces, and making sailing ships to a dead, incapable, ignorant person, either to foolishness and stupidity, or to stubbornness and arrogance\" (1).\nAlso, regarding the attributes they did not affirm, they followed: either Relegation (Tafwid), or Interpretation (Ta'wil). They said: If we left these texts on their apparent meaning without relegation or interpretation, and affirmed what they indicate as a real indication and did not divert them to metaphorical meanings, Likening (Tashbih) would follow from that. This contradicts Transcendence (Tanzih); because reason deems impossible what the apparent meanings of these texts indicate, and they are speculative appearances in opposition to definitive rational demonstrations, so we prioritize rational demonstrations over them. These speculative appearances, either we relegate their meanings to Allah Almighty as the Salaf did - according to their claim (2), or we interpret them with types of metaphors to meanings that agree with rational demonstrations (3).\nThey claim that carrying these texts on their apparent meaning is deemed impossible by reason, so they are either relegated in their meanings or interpreted. So first: they fell into Likening, second: they fled from it, third: they distorted the texts, fourth: they negated the attributes, and fifth: they fell into what they fled from of Likening and Representation, rather worse than it where they described Allah with attributes of the nonexistent, rather the impossible (4).",
    "foot_note": "1. See: Al-Tawhid: 45, Al-Tamhid: 12, 21, Tafsir Al-Nasafi: 1/ 86, 200, Al-Maturidiyyah by Al-Harbi: 219. \n2. See: in refutation of the claim that Tafwid is the school of the Salaf the book: Madhhab Ahl Al-Tafwid fi Nusus Al-Sifat by Ahmad Al-Qadi. \n3. See: This rule in Al-Musayarah with Al-Musamarah: 35, 29, Usul Al-Din by Al-Bazdawi: 25, 189, and Sharh Al-Aqa'id Al-Nasafiyyah by Al-Taftazani: 42. \n4. See: Risalah fi Ithbat Al-istiwa' wa Al-Fawqiyyah by Al-Juwayni: 1/ 181, Dar' Al-Ta'arud: 4/ 9, and Al-Tadmuriyyah: 19, 79 - 85.",
    "book_id": "64"
  },
  {
    "serial_number": "281786",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "And sixth: They fell into contradiction and inconsistency; as they affirmed some attributes and negated some with this doubt, even though that doubt exists in what they affirmed of attributes since there is no difference between what they affirmed and what they negated (1).\nThus, the Maturidi doctrine regarding the attributes of Allah Almighty is summarized as follows:\n1 - They affirmed some of Allah Almighty's affirmative essential attributes, like His Life, Knowledge, Power, and Will, Glory be to Him and Most High.\n2 - Their majority also affirmed His Hearing Almighty and His Sight, Glory be to Him (2).\n3 - As for negative attributes, they affirmed them with deviation and negation which they fell into.\n4 - They affirmed the attribute of Takwin (Bringing into being) considering it a reference for active attributes. The intended meaning of Takwin is active attributes: which are what returns to Takwin of attributes like creating, providing, giving life, and causing death. So the attribute of Takwin is that He, Glory be to Him, brings things into being, so He creates, forms, heals, gives life, and causes death by His saying 'Be and it is', and it is called the attribute of Creation or Action (3). According to them, the Action is other than the Object of action, and Takwin is other than the Mukawwan (thing brought into being). Therefore, they say by the pre-eternity of Allah Almighty's attributes of action like creation, giving life, and provision, even if the object of these is temporal (4).\n5 - They inferred for affirming the attributes they affirmed with texts from the Book and Sunnah (5).\n6 - Their restriction of Allah Almighty's attributes. They restricted all attributes to twenty-one attributes only. Some of them explicitly restricted the affirmative essential attributes to seven, and the eighth attribute is Takwin, which is an active attribute. He said: \"And according to the illustrious successors, it does not exceed eight attributes, and other attributes return to them\" (6). Also, Shah Muhammad Anwar Al-Kashmiri, one of the senior Deobandi Imams (1352 AH), explicitly stated that the Beautiful Names are all included in the attribute of Takwin (7).",
    "foot_note": "1. See: Al-Tadmuriyyah: 182 - 183, 81 - 83, and Risalah fi Ithbat Al-istiwa' wa Al-Fawqiyyah: 1/ 181. \n2. See: Al-Musayarah with its explanation by Qasim bin Qutlubugha: 69. \n3. See: Majmu' Al-Fatawa: 6/ 426. \n4. See: Mawqif Ibn Taymiyyah min Al-Asha'irah: 2/ 484. \n5. See: Sharh Al-Aqa'id Al-Nasafiyyah: 44 - 58, and Kitab Al-Tawhid: 57. \n6. Isharat Al-Maram: 188. \n7. Fayd Al-Bari: 4/ 517.",
    "book_id": "64"
  },
  {
    "serial_number": "281787",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "It is known that the attribute of Takwin is a reference for active attributes according to them, so it is an attribute of action. So where do they place the name of Majesty \"Allah\" and similar Beautiful Names that indicate the Essence of Allah Almighty and the essential affirmative attributes of perfection? Do they place them also in the attribute of Takwin?\nWhen they said by restricting Divine attributes to what they mentioned, they negated all other attributes of Allah's perfection, and distorted their explicit, firm, authentic texts. And with their affirmation of these attributes, they almost negated and stripped them, for they explicitly stated that each of these attributes is a single pre-eternal attribute with no multiplicity or renewal in it, but renewal is in its attached objects; because that is more fitting for the perfection of Tawhid (1). So they took attributes out of what is known in Sharia, Reason, and Fitrah.\n7 - They negated the attribute of Speech: which is Allah Almighty's speech heard with letter and voice, and He has not ceased and does not cease to speak.\n8 - They said the innovation of Psychological Speech (Kalam Nafsi), and some of them explicitly stated there is no difference between them and the Mu'tazila in saying the creation of the Quran (2).\n9 - They do not affirm active attributes and do not say they subsist in Allah Almighty. It is known that an attribute is not an attribute unless it subsists in the described and the described is characterized by it. As they said: \"It is known that each of that - meaning the attributes they affirmed - indicates a meaning additional to the concept of the Necessary. Not all are synonymous words, and the truth of the derivative on the thing necessitates the establishment of the source of derivation for it, so the attribute of Knowledge, Power, Life, etc. is established for Him, not as the Mu'tazila claim: that He is Knowing with no knowledge, and Capable with no power etc., for it is an obvious impossibility like our saying: black with no blackness. Texts have spoken of the establishment of His knowledge, power, and others\". And they said: \"And it has no meaning other than He is described with Speech\" (3). And they returned all active attributes to the attribute of Takwin, and that all active attributes are not real attributes of Allah Almighty, but rather they are from the attachments of the attribute of Takwin, and Takwin is a pre-eternal attribute which is for them: the principle of bringing out from non-existence to existence.",
    "foot_note": "1. Sharh Al-Aqa'id Al-Nasafiyyah: 55 - 56, and Al-Nibras: 217 - 218. \n2. Sharh Al-Aqa'id Al-Nasafiyyah: 165 - 166, Minh Al-Rawd Al-Azhar fi Sharh Al-Fiqh Al-Akbar: 95, Kubra Al-Yaqiniyyat Al-Kawniyyah: 125. \n3. Sharh Al-Aqa'id Al-Nasafiyyah: 44, 58.",
    "book_id": "64"
  },
  {
    "serial_number": "281788",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Among the examples of that: Attribute of Allah Almighty's Highness (Uluw): The Maturidiyyah understood from the texts of Allah's Highness over His Throne and His Aboveness over His servants that their apparent meaning implies Allah Almighty is in a direction (Jiha), and that He is encompassed, and all that is a description of creatures (1). And that whoever is in a direction must have an estimated distance between them, and it is conceivable to be more than that or less or equal (2). If He were in a direction, it would imply the pre-eternity of place, direction, and space, and imply His being a body, composite, or being a locus for temporals (3). Also: either He equals the space or is less than it so He is finite, or exceeds it so He is spatially occupying (4).\nBased on this doubt, they distorted the texts of Highness and negated the attribute of Highness and described Allah with attributes of impossibilities. They said: Allah is neither inside the world nor outside it, neither connected to it nor separated from it (5). And that He is not in the six directions, neither above nor below, neither right nor left, neither front nor back (6). And that He is not on the Throne nor on other than it, nor above the Throne (7). So Allah is not above the world (8). And they declare disbeliever anyone who describes Allah Almighty as being in the sky or describes Him as being above (9). They distort the texts of the Book and Sunnah regarding Allah Almighty's Highness over His creation and His Aboveness over His servants to Aboveness of Subjugation and Seizure and His transcendence above locations (10). And Highness of Subjugation and Dominance and Highness of Status (11), and Aboveness of Lordship and Greatness (12), and other false interpretations.\nExample of the attribute of Speech: If they conceive the attribute of Speech, \"instrument and limb\" comes to their minds (13) meaning tongue, mouth, lips, teeth, and throat, and that implies Allah Almighty being a locus for temporals and accidents (14).",
    "foot_note": "1. Kitab Al-Tawhid: 70, and Sharh Al-Aqa'id Al-Nasafiyyah: 40. \n2. Kitab Al-Tawhid: 70, and Sharh Al-Aqa'id Al-Nasafiyyah: 40. \n3. Sharh Al-Mawaqif: 8/ 20 - 22, and Sharh Al-Aqa'id Al-Nasafiyyah: 40. \n4. Sharh Al-Aqa'id Al-Nasafiyyah: 40, . \n5. Kitab Al-Tawhid: 107, Sharh Al-Aqa'id Al-Nasafiyyah: 42, Sharh Al-Mawaqif: 8/ 23, and Isharat Al-Maram: 197. \n6. Sharh Al-Aqa'id Al-Nasafiyyah: 40, and Sharh Al-Mawaqif: 8/ 19, . \n7. Usul Al-Din by Al-Bazdawi: 28. \n8. Previous reference: 31. \n9. Al-Bahr Al-Ra'iq: 5/ 120. \n10. Ta'wilat Ahl Al-Sunnah: 1/ 58, and Isharat Al-Maram: 98. \n11. Sharh Al-Fiqh Al-Akbar: 171. \n12. Sharh Al-Ihya by Al-Zabidi: 2/ 108. \n13. Hashiyat Al-Isam 'ala Sharh Al-Aqa'id Al-Nasafiyyah: 181. \n14. Sharh Al-Aqa'id Al-Nasafiyyah: 55, Al-Musayarah: 84.",
    "book_id": "64"
  },
  {
    "serial_number": "281789",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "They negate the attribute of Speech, and say the innovation of Psychological Speech (Kalam Nafsi), and some of them explicitly stated the innovation of saying the creation of the Quran, and that there is no disagreement between them and the Mu'tazila in this issue. Al-Taftazani says: \"Then verifying the disagreement between us and them - the Mu'tazila - returns to affirming Psychological Speech and negating it, otherwise we do not say by the pre-eternity of words and letters, and they do not say by the temporality of Psychological Speech\" (1).\nAl-Buti said while recounting the school of Ash'aris and Mu'tazila: \"Then the Mu'tazila interpreted this which Muslims agreed on affirming for Allah - Almighty - as being sounds and letters created by Allah - Almighty - in other than Him like the Preserved Tablet and Gabriel, and it is known that it is temporal and not pre-eternal. Then they did not affirm for Allah - Almighty - anything else beyond these sounds and letters under the name: Speech. As for the majority of Muslims - Ahl al-Sunnah wal-Jama'ah meaning Ash'aris and Maturidis in his view - they said: We do not deny this which the Mu'tazila say, rather we say it, and call it verbal speech, and we all agree on its temporality, and that it does not subsist in His Essence - Almighty -; because it is temporal. But we affirm a matter beyond that, which is the Attribute subsisting in the Self which is expressed by words, and it is other than the reality of Knowledge and Will\" (2).\nExample of believers seeing their Lord with eyes in the Hereafter: They stipulate negative conditions and restrictions in the issue of seeing Allah Almighty; because seeing a body came to their minds. Abu Mansur Al-Maturidi says: \"If it is said: How is He seen? It is said: Without how (Bi-la Kayf), for 'how-ness' is for one with form. Rather He is seen without description of standing, sitting, leaning, hanging, connection, separation, facing, turning back, short, long, light, darkness, stationary, moving, touching, distinct, outside, inside, nor a meaning that imagination takes or reason estimates due to His transcendence above that\" (3). Sheikh Al-Islam judged them that they - with these conditions and restrictions - made seeing Allah Almighty impossible (4).",
    "foot_note": "1. Sharh Al-Aqa'id Al-Nasafiyyah: 165 - 166. See: Minh Al-Rawd Al-Azhar fi Sharh Al-Fiqh Al-Akbar: 95. \n2. Kubra Al-Yaqiniyyat Al-Kawniyyah: 125. \n3. Kitab Al-Tawhid: 85, See Daw' Al-Ma'ali Sharh Bad' Al-Amali by Al-Qari: 43, Al-Musayarah with Al-Musamarah: 41, 43, 46, and Usul Al-Din by Al-Bazdawi: 77. \n4. See: Bayan Talbis Al-Jahmiyyah: 72 - 78, Al-Marakishiyyah: 49, and Majmu' Al-Fatawa: 5/ 175.",
    "book_id": "64"
  },
  {
    "serial_number": "281790",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Ahl al-Sunnah wal-Jama'ah agree on affirming believers seeing their Lord. Allah Almighty said: {[Some] faces, that Day, will be radiant, * Looking at their Lord.} [Al-Qiyamah: 22, 23], and He Almighty said {For them who have done good is the best [reward] and extra.} [Yunus: 26]. And He Almighty said: {No! Indeed, from their Lord, that Day, they will be partitioned.} [Al-Mutaffifin: 15], and screening the disbelievers from Allah Mighty and Majestic indicates believers seeing their Lord Mighty and Majestic.\nFrom Suhayb, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: \"When the people of Paradise enter Paradise, He says: Allah Blessed and Exalted says: Do you want anything I should add for you? They say: Have You not whitened our faces? Have You not admitted us to Paradise and saved us from the Fire? He said: So He lifts the veil, and they are not given anything more beloved to them than looking at their Lord Mighty and Majestic\" (1).\nFrom Jarir, may Allah be pleased with him, who said: We were sitting with the Prophet, peace and blessings be upon him, when he looked at the moon on the night of the full moon and said: \"You will see your Lord as you see this moon, you will not be harmed in seeing Him. So if you are able not to be overcome in a prayer before the rising of the sun and a prayer before its setting, then do so\" (2).\nAbdul Ghani Al-Maqdisi, may Allah have mercy on him, said: \"The people of Truth agreed and the people of Tawhid and Truthfulness concurred - that Allah Almighty is seen in the Hereafter as came in His Book and was authentic from His Messenger\" (3).\nIbn Abi Al-Izz Al-Hanafi, may Allah have mercy on him, said: \"And affirming the Vision was said by the Companions, the Followers, the Imams of Islam known for Imamate in religion, Ahl al-Hadith, and all sects of Ahl al-Kalam attributed to the Sunnah and Jama'ah\" (4).",
    "foot_note": "1. Narrated by Muslim (181). \n2. Narrated by Al-Bukhari (7434), and Muslim (633). \n3. Aqidat Al-Hafiz Abdul Ghani Al-Maqdisi: 58. \n4. Sharh Al-Aqidah Al-Tahawiyyah: 153.",
    "book_id": "64"
  },
  {
    "serial_number": "281791",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Chapter Three: The rest of the Pillars of Faith\nContaining three topics:\nTopic One: Belief in Messengers, containing two sections.\nSection One: How Prophethood is proven.\nSection Two: Miracle (Mu'jizah) and Karamat.\nTopic Two: Belief in the Last Day.\nTopic Three: Belief in Destiny and Decree (Qada and Qadar), containing four sections:\nSection One: Levels of belief in Destiny and Decree.\nSection Two: Actions of servants.\nSection Three: Capacity and Ability.\nSection Four: Burdening beyond capacity.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281792",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "Topic One: Belief in Messengers\nSection One: How Prophethood is proven\nThe Maturidiyyah believe that proving the truthfulness of Messengers and Prophets is based on observing the physical and moral attributes of Prophets before and after the Message, and on Allah's support for them with miracles indicating their truthfulness.\nAbu Mansur Al-Maturidi said: \"Then the principle according to us in informing of Messengers is two aspects:\nFirst: The appearance of their states in a way that reason repels doubt from them, and refuses imagining suspicion in them due to accompanying them in childhood and old age, finding them pure, chosen, pious among a people where equality among them on that is not possible, nor does their upbringing reach that, upon the appearance of their states to them, and their being among them in residence and spread. So it is known with encompassing that this is preservation from One who knows that He sets them in a noble station, and makes them trustees over the unseen and secrets. This is what nature inclines to accept and reason approves all their affairs, so the one rejecting it rejects after knowledge a rejection of obstinacy.\nSecond: The coming of signs (miracles) outside the natures of the people of insight in that type, impossible to aspire to the like of or reach its essence by learning, with what if it were possible for someone to reach that by learning and diligence, since the Messengers did not grow up in that nor were raised by it, it appears that they benefited it by Allah honoring them with it to make them trustees over His revelation\" (1).\nAs for the majority of Maturidiyyah, they see that there is no proof for the truthfulness of the Prophet other than the miracle, arguing that the miracle alone yields certain knowledge of the establishment of the prophethood of the Prophet or Messenger.\nAl-Bazdawi said: \"It is not conceivable to establish the Message without proof, so establishment is by proofs; and those proofs are nothing but miracles. So the message of every Messenger was established by miracles appearing at his hands... So miracles were the proof of the truthfulness of their claim of the Message; for what appeared is not within human capacity, so it is known that Allah is the Originator. He only originates them to be a proof of the truthfulness of his claim; for the people of every Messenger asked him for proofs of his truthfulness, so he supplicated to Allah Almighty to support him by giving what they asked of him. When He gave him the proof of his truthfulness which his people asked of him, that became proof of his truthfulness from Allah Almighty, for Allah does not support the liar. And people must know the Messengers and there is no way to knowledge except miracles\" (2).",
    "foot_note": "1. Al-Tawhid: 188, 189. \n2. Usul Al-Din: 97, 98.",
    "book_id": "64"
  },
  {
    "serial_number": "281793",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "There is no doubt that miracles are a correct proof for establishing the prophethood of Prophets; but saying that the prophethood of Prophets is not known except by miracles is an incorrect saying. Rather, there are other proofs, including what appears on him of knowledge, truthfulness, righteousness, and types of good deeds appearing to anyone with the slightest discrimination, and what accompanies him of states and other things (1). No one has claimed Prophethood among the liars except that there appeared on him of ignorance, lying, wickedness, and Satan's overpowering him what appeared of his state upon the slightest discrimination, and people distinguish between the truthful and the liar.\nFor this reason, since Khadijah, may Allah be pleased with her, knew from the Prophet, peace and blessings be upon him, that he is the Truthful, the Righteous, she said to him when the Revelation came to him: (I feared for myself), she said: Nay, by Allah, Allah will never disgrace you. You join ties of kinship, speak the truth, bear the burden of the weak, host the guest, earn for the destitute, and help in the vicissitudes of truth\" (2) (10).\nSo he did not fear intentional lying; for he knows from himself, peace and blessings be upon him, that he did not lie; but he feared at first that an evil occurrence might have happened to him, which is the second station. So Khadijah mentioned what negates this, which is what he was naturally disposed upon of noble morals, and beautiful characteristics and deeds, which is Truthfulness necessitating Justice and Beneficence to creation. Whoever combines in himself Truthfulness, Justice, and Beneficence is not among those whom Allah disgraces. Joining ties of kinship, hosting the guest, bearing the burden of the weak, giving the destitute, and helping in the vicissitudes of truth are among the greatest types of Righteousness and Beneficence. It is known from Allah's Sunnah (Way) that whoever Allah created with praiseworthy morals and purified from blameworthy morals, He does not disgrace him\" (3).",
    "foot_note": "1. See: Al-Asfahaniyyah: 474, 476, 477, Sharh Al-Tahawiyyah: 112, 114, Al-Nubuwwat: 37 - 43. \n2. Narrated by Al-Bukhari (4953) and Muslim (160). \n3. See: Al-Asfahaniyyah: 479, 480, Minhaj Al-Sunnah: 2/ 419, 420, 8/ 549, Sharh Al-Aqidah Al-Tahawiyyah: 114 - 115.",
    "book_id": "64"
  },
  {
    "serial_number": "281794",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Second Requirement: Miracles and Karamat\nThe Maturidis affirm the karamat (miraculous gifts) of the Awliya (saints), just as they affirm the miracles of the Prophets. They believe that there is no difference between them except the challenge (Tahaddi), which is the claim of messengership. Thus, a miracle is a supernatural event accompanied by a challenge, with the absence of opposition. A karamah, according to them, is a supernatural event not accompanied by a challenge. They see no contradiction or confusion between affirming miracles and affirming karamat; rather, the karamah of a saint is part of the miracle of the Prophet and evidence of his truthfulness, because the karamah of the follower is the karamah of the followed, and a saint is not a saint until he believes in the Prophet and follows him.\nAbu al-Mu'in al-Nasafi explained the definition of a miracle, saying: \"A miracle alone, according to the method of the theologians: is the appearance of a matter contrary to habit in the abode of obligation (Dar al-Taklif) to demonstrate the truthfulness of the claimant of prophethood, with the inability of those challenged to oppose it with the like. It was restricted to the abode of obligation because what appears contrary to habit in the abode of the Hereafter is not a miracle. We said 'to demonstrate the truthfulness of the claimant of prophethood' to exclude what appears for a claimant of divinity, as the appearance of that at his hand is possible according to us. It also contains a caution regarding what appears at the hand of a saint, as the appearance of that as a karamah for the saint is possible according to us. We said 'to demonstrate his truthfulness' because if that appeared to demonstrate his falsehood, it would not be a miracle for him nor evidence of his truthfulness, but rather evidence of his falsehood in his claim. We said 'with the inability of those challenged to oppose it with the like' because if the supernatural event appeared at his hand and then the like appeared at the hand of the challenger, what appeared at his hand would lose its significance upon opposition, since the like appeared at the hands of one who denies him, which would be evidence of the truthfulness of the one who denies him, so the two evidences would contradict each other and fall.\" (1).\nAl-Nasiri said: \"The difference between a Prophet and a saint is apparent, because the Prophet claims the miracle and karamah and challenges creation with it, saying: 'The sign of my message and my confirmation is such and such.' The saint does not claim the karamah; rather, it appears at his hand without challenge or claim. Whenever he claims it, he falls from the rank of sainthood and becomes a dissolute person (Fasiq). This was mentioned by the scholars of Usul, including Sayf al-Haqq Abu al-Mu'in....\" (2).\nIt appears from the Maturidi definition of a miracle that prophethood is proven to them by three conditions: breaking the habit (supernatural), the challenge, and the lack of opposition. These conditions alone for a miracle are not disciplined due to the following:",
    "foot_note": "1. Al-Tamhid: 46, Usul al-Din by al-Bazdawi: 96 - 99, 227 - 230.\n2. Al-Nur al-Lami': (L 121), see (120), Sharh al-Fiqh al-Akbar: 79.",
    "book_id": "64"
  },
  {
    "serial_number": "281795",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "The Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "- There is no suspension of judgment in the Book and Sunnah based on this description; indeed, there is no mention of breaking the habit, but rather therein are signs (Ayat) and proofs (Barahin) (1).\n- The description of a sign as being contrary to habit is not disciplined, for prophethood itself is habitual for prophets, while it is contrary to habit for others. Soothsaying and magic are habitual matters for magicians and soothsayers, contrary to habit for others, just as medical experts know things habitual for their likes but contrary to habit for others. Thus, a miracle being a matter contrary to habit is not a disciplined matter (2).\nSo the Maturidi definition of a miracle by this definition is not upright and not disciplined. Furthermore, it is not mentioned in the Book or the Sunnah to name what Allah supports His prophets and messengers with as a 'miracle' (Mu'jizah), but rather it is mentioned to name them 'signs' (Ayat). On the authority of Abu Hurairah, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: (There is no prophet among the prophets but was given of signs what on the like of it humans believed. And indeed, what I was given was a revelation that Allah revealed to me, so I hope to be the most followed of them on the Day of Resurrection) (3).\nA sign can be defined as: What Allah supports His prophets and messengers with of matters contrary to cosmic laws, which creation has no ability to bring the like of; thus being evidence of their truthfulness and Allah's support for them.\nAs for the karamat of the saints, they are, as they said, from the signs of the prophets; but not everything that was of the signs of the prophets is a karamah for the righteous. The Maturidis equated this and that, saying the difference is the claim of prophethood and the challenge, and this is wrong. For the signs of the prophets that indicated their prophethood are higher than what they share with their followers. The splitting of the moon, bringing the Quran, the staff turning into a snake, and the emergence of the she-camel from a rock had no like for the saints. The major signs are specific to the prophets and messengers. As for the minor signs, they may be for the righteous, such as increasing food - for example - this has been found for some righteous people, but it was not found for anyone as it was found for the Prophet, peace and blessings be upon him, that he fed an army from a small amount. Thus, participation may be in the genus of the sign, but not with the same greatness and abundance (4).",
    "foot_note": "1. Al-Nubuwwat by Ibn Taymiyyah: 45.\n2. Previous reference: 20 - 21, 23.\n3. Narrated by Al-Bukhari (7274), and Muslim (239).\n4. Previous reference: 269, see: 7 - 8, 305, 308.",
    "book_id": "64"
  },
  {
  "serial_number": "281796",
  "category_id": "2",
  "category": "Sects and Refutations",
  "book_title": "Al-Maturidiyyah",
  "edition": "None",
  "publisher": "None",
  "page_number": 48,
  "volume_number": 1,
  "text": "Section Two: Belief in the Last Day. The Maturidiyyah refer to matters related to the Last Day as 'Sam'iyyat' (things known only by textual revelation), based on their view that such matters cannot be known except through transmitted texts. That is, their only source for information concerning the Last Day is revelation. Therefore, we find that they agree with Ahl al-Sunnah wa-l-Jama'ah in this topic: they affirm the bliss of the grave, its punishment, the signs of the Hour, the resurrection, the rising, the scale, the bridge, and the Basin. However, their belief that the Last Day and everything related to it can only be known through revelation is incorrect. Rather, reason itself also indicates the Last Day, just as revelation does. In fact, revelation points to the rational indication of this, as in His saying: {Indeed, in the creation of the heavens and the earth, and the alternation of night and day, are signs for people of understanding (190) those who remember Allah standing, sitting, and lying on their sides, and reflect on the creation of the heavens and the earth: 'Our Lord, You have not created this in vain. Glory be to You! So protect us from the punishment of the Fire.' (191) 'Our Lord, indeed whoever You admit to the Fire, You have surely disgraced him, and the wrongdoers will have no helpers.'} [l 'Imrn: 190192]. Since the vision of Allah, Exalted is He, is one of the matters pertaining to the Last Day, the Maturidiyyah affirmed it because revelation indicates it and because they consider it rationally possible. But they restricted this by negating direction and facing, because they deny the exaltedness of Allah's Essence. Therefore, they felt compelled to combine between negating exaltedness and affirming the vision. Abu Mansur al-Maturidi said: \"Our position regarding the vision of the Lord, Mighty and Majestic, is that it is necessary and true, without encompassing and without modality. As for the evidence for the vision: His saying, {Eyes do not encompass Him, but He encompasses the eyes} [al-An'am: 103]. If He could not be seen, then negating encompassing would have no purpose. The second: Musa   said, {My Lord, show Yourself to me that I may look at You} [al-A'raf: 143]. If vision were impossible, then such a request would have been ignorance of his Lord. Also, His saying: {Faces on that Day will be radiant (22) looking at their Lord} [al-Qiyamah: 22].\"",
  "foot_note": "1. See: Islamic Sects and Their Foundational Beliefs by Dr. Abd al-Fattah Ahmad Fu'ad, 1/276. \n2. See: Minhaj al-Sunnah 3/342, 2/334; Bayan Talbis al-Jahmiyyah 2/77. \n3. Kitab al-Tawhid, pp. 7780.",
  "book_id": "64"
  },
  {
    "serial_number": "281797",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "Then he said: \"If it is said: How is He seen? It is said: Without 'how' (bi-la kayf), for 'how-ness' applies to that which has form. Rather, He is seen without description of standing, sitting, leaning, hanging, connection, separation, facing, turning back, short, long, light, darkness, stationary, moving, touching, distinct, outside, or inside. Nor is there a meaning that imagination takes or reason estimates, due to His transcendence above that\" (1). The reality of the Maturidi saying is that they affirmed what cannot be seen, as they \"combined two contradictory matters; for what is neither inside the world nor outside it, nor can be pointed to, is impossible to be seen with the eye. If its existence externally were possible, how then when it is impossible? It is only estimated in minds without having existence in reality, so it is from the realm of illusion and false imagination\" (2). The discussion (3) has already passed regarding the refutation of the Maturidi saying in this issue, and that Ahl al-Sunnah wal-Jama'ah are agreed on affirming the believers' vision of their Lord on the Day of Resurrection, based on the evidence of the Book and the Sunnah.",
    "foot_note": "1. Al-Tawhid: 85, See: Al-Tamhid: 38. \n2. Al-Fatawa: 16/ 87. \n3. Page: 50.",
    "book_id": "64"
  },
  {
    "serial_number": "281798",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "Topic Three: Belief in Destiny and Decree (Al-Qada' wa Al-Qadar)\nBelief in Destiny and Decree is a pillar of the pillars of Faith, and Faith is not valid without it. It consists of four levels:\n1 - Allah's pre-eternal knowledge of everything, and that He knew the actions of the servants before they did them.\n2 - The writing of that in the Preserved Tablet (Al-Lawh Al-Mahfuz).\n3 - Allah's general Will and His all-encompassing Power.\n4 - Allah's bringing into existence of all creatures, and that He is the Creator and everything else is created.\nThis is the saying of Ahl al-Sunnah wal-Jama'ah, indicated by the Book, the Sunnah, and the consensus of the Companions and those who followed them in goodness (1).\nAllah Almighty said: {Indeed, all things We created with predestination} [Al-Qamar: 49]. And He Almighty said: {He created each thing and determined it with [precise] determination} [Al-Furqan: 1 - 2], \"Meaning everything other than Him is created and nurtured, and He is the Creator of everything, its Lord, its King, and its God. Everything is under His subjugation, management, control, and determination\" (2).\nAnd He Almighty said: {And the command of Allah is a decree determined} [Al-Ahzab: 38], \"Meaning His command which He decrees is inevitable and will occur, there is no way to avoid or divert it; whatever He wills happens, and whatever He does not will does not happen\" (3).\nAnd He Almighty said: {No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things} [At-Taghabun: 11], \"This is general for all calamities, in self, wealth, children, loved ones, and the like. So all that befalls the servants is by the Decree and Destiny of Allah; His knowledge has preceded it, His Pen has run with it, His Will has executed it, and His Wisdom has required it\" (4).",
    "foot_note": "1. See: Al-Fatawa: 3/ 148 - 150, Shifa' al-Alil: 29 - 65, and Ma'arij al-Qabul: 2/ 294. \n2. Ibn Kathir, Tafsir al-Quran al-Azim: 3/ 320, Second Edition, Introduction by Dr. Yusuf Al-Mar'ashli, Dar Al-Ma'rifah, Beirut, 1407 AH. \n3. Tafsir Ibn Kathir: 3/ 500. \n4. Tafsir Ibn Sa'di: 867.",
    "book_id": "64"
  },
  {
    "serial_number": "281799",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "And on the authority of Umar bin Al-Khattab, may Allah be pleased with him, regarding the questioning of Gabriel, peace be upon him, to the Messenger, peace and blessings be upon him, about Faith, he said: (To believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in Destiny, its good and its bad. He said - meaning Gabriel -: You have spoken the truth) (1). \"In this Hadith is that belief in Destiny is one of the six pillars of Faith mentioned. So whoever does not believe in Destiny, its good and its bad, has abandoned a fundamental of the religion and denied it, resembling those about whom Allah said: {So do you believe in part of the Scripture and disbelieve in part?} [Al-Baqarah: 85]\" (2).\nAnd on the authority of Jabir, may Allah be pleased with them both, he said: The Messenger of Allah, peace and blessings be upon him, said: (A servant does not believe until he believes in Destiny, its good and its bad from Allah, and until he knows that what hit him was not going to miss him, and what missed him was not going to hit him) (3).",
    "foot_note": "1. Narrated by Muslim, Book of Faith, Chapter on Affirming Destiny, p. (1/ 155 - Sharh Al-Nawawi). \n2. Fath Al-Majid Sharh Kitab Al-Tawhid, p. 428, First Edition, Al-Maktabah Al-Tijariyyah, Mecca, 1412 AH. \n3. Narrated by Al-Tirmidhi: Book of Destiny, Chapter on Faith in Destiny, its Good and Bad, No. 2231, and authenticated by Al-Albani in Sahih Sunan Al-Tirmidhi.",
    "book_id": "64"
  },
  {
    "serial_number": "281800",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "First Requirement: The Levels of Qada' (Decree) and Qadar (Destiny) according to the Maturidiyyah:\nThe Maturidiyyah affirm these levels: Knowledge, Writing, General Will, and Creation. The deviation that occurred from them regarding Destiny and Decree is only related to the actions of servants. Their discussion of these four levels is not as clear as it is in the speech of Ahl al-Sunnah; for when they define Qada' and Qadar, they stipulate Knowledge and Creation, but as for Will, they mention it in their discussion of the issue of Volition (Irada), and as for Writing, they rarely mention it.\nAl-Maturidi said: \"Qada' in its reality is judging a thing and deciding upon what befits it and is most rightful to be decided upon. Thus, it refers back to the creation of things because it is the realization of their existence as they are, and upon the premise that everything should be as it was created; since the One who created creation is the Wise, the Knowing, and Wisdom is hitting the mark for everything and placing it in its place. Allah Almighty said: {And He completed them as seven heavens} [Fussilat: 12]. Based on that, it is permissible to describe the actions of creation as having been Decreed (Qada) by Him, meaning He created them and judged.\" Then he said: \"As for Qadar (Destiny), it is of two aspects: One of them: The limit upon which a thing emerges, which is making everything as it is regarding good or evil, beauty or ugliness. And upon the likes of this is His saying: {Indeed, all things We created with predestination} [Al-Qamar: 49]. The second: Explaining what everything will be upon regarding time, place, truth, falsehood, and what pertains to it of reward and punishment\" (1).\nHe also said: \"Praise be to Allah who originated creation by His Power and directed them by His Wisdom based on preceding Knowledge and Will, initiating things however He willed {He is not questioned about what He does, but they will be questioned} [Al-Anbiya: 23]\" (2).\nAbu Al-Mu'in Al-Nasafi said, clarifying the affirmation of Writing: \"... And Allah Almighty wrote in the Preserved Tablet all that will be and all that servants will do before creating them\" (3).",
    "foot_note": "1. Al-Tawhid: 306, 307. \n2. Al-Tawhid: 221, See: 287, 291, 294, 303, 304, Al-Tamhid: 81, 82. \n3. Al-Nur Al-Lami': L 110, See: 57, 58, 61, 62, 94, 95.",
    "book_id": "64"
  },
  {
    "serial_number": "281801",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Second Requirement: Actions of Servants\nThe discussion on this issue is from two aspects:\nAspect One: Creation of Servants' Actions.\nThe Maturidiyyah said: The actions of servants are created by Allah, and Allah Almighty created all of them, whether good or evil. They used many textual and rational evidences for this.\nAl-Maturidi said: \"Then the proof according to us from the way of the Quran for the necessity of saying the creation of actions is His saying: {And conceal your speech or publicize it; indeed, He is Knowing of that within the breasts. Does He who created not know, while He is the Subtle, the Acquainted?} [Al-Mulk: 13-14]. If He, Majestic is His praise, were not the Creator of what is publicized and concealed, He would not use it as argument for His knowledge. Also, that Allah Almighty said: {It is He who enables you to travel on land and sea} [Yunus: 22], and He said in another place {And We determined for them the journey. Travel therein by nights and days in safety} [Saba: 18]. He informed that the determining of the journey and the enabling of travel is His action and by Him the journey occurred\" (1).\nAspect Two: The Relationship of Servants to their Actions.\nThe saying of the Maturidiyyah that Allah Almighty is the Creator of servants' actions, their good and their evil, is the true saying indicated by Revelation and Reason, and it is the saying of Ahl al-Sunnah wal-Jama'ah and the Predecessors of the Nation. But regarding the relationship of servants to their actions, the Maturidiyyah attempted to mediate between the saying of the Mu'tazila and the saying of the Jabriyyah. So they said: The actions of servants are created by Allah Almighty and are an acquisition (Kasb) by the servants.\nAl-Maturidi said: \"The reality of that action is that it belongs to the servants by way of acquisition and to Allah by way of creation\" (2).\nAbu Al-Mu'in Al-Nasafi said: \"According to us, the action of the servant is Allah Almighty's creation and His effect, and Allah Almighty is the One who handles its origination and bringing it from non-existence to existence, and the servant acquired it and practiced it\" (3).",
    "foot_note": "1. Al-Tawhid: 254, Usul Al-Din: 99, 102, 105. \n2. Al-Tawhid: 228, 225, 226. \n3. Tabsirat al-Adilla: L 384, See: Al-Tamhid: 67, 70, 71.",
    "book_id": "64"
  },
  {
    "serial_number": "281802",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Their expressions differed in explaining the meaning of Kasb (Acquisition) (1), and the summary of their speech is that the Influencer in the origin of the action is the Power of Allah Almighty, and the influencer in the description of the action is the power of the servant, and this influence of the servant is Kasb according to them.\nAl-Bayadi said: \"The origin of the action is by Allah's Power, and the description of it as being obedience or disobedience is by the servant's power, and this is the school of the majority of Maturidiyyah\" (2).\nThey mean by this that Allah Almighty does not create the servant's action unless the servant wills it and chooses it, and they have stated this explicitly.\nAbu Al-Mu'in Al-Nasafi said: \"And what He invents - meaning Allah Almighty - in him - meaning in the servant - is by the servant's choice of that, and he has power over it. So the effect of his power relating to it is its being an action of his. So Allah Almighty is the inventor of the servant's action by his [the servant's] choice; were it not for the servant's choice and his intent to acquire it, Allah Almighty would not have created it as an action for him\" (3).\nThe reality of this Maturidi saying is that servants have an uncreated will which is the starting point of the action. So servants, according to their school, dispose of the starting points of their actions with complete independence as they wish, and Allah Almighty's creation of their actions is merely a consequence of their uncreated will.\nThere is no doubt that this saying of the Maturidiyyah is false because Allah Almighty is the Creator of everything. \"And God forbid, and Allah is Greater, More Glorious, and More Mighty than there being in His servant anything not created by Him nor entering under His Power and Will. He did not estimate Allah with His true estimation who claimed that, nor did he know Him with true knowledge, nor magnify Him with true magnification. Rather the servant: his body, spirit, attributes, actions, motives, and every atom in him is created by Allah with a creation by which He disposes in His servant... So he is a created servant from every angle and every consideration. His need for his Creator and Maker is from the necessities of his essence. His heart is in the hand of his Creator and between two fingers of His fingers; He turns it how He wills, making him willing what He wills to occur from him, hating what He does not will to occur. So whatever He wills happens, and whatever He does not will does not happen...\" (4).",
    "foot_note": "1. Al-Tamhid: 71. \n2. Isharat al-Maram: 256, Al-Lum'ah by Ibrahim Al-Halabi: 48. \n3. Tabsirat al-Adilla: L 386, See: Intro by the investigator to Kitab Al-Tawhid: 42. \n4. Shifa al-Alil: 144.",
    "book_id": "64"
  },
  {
    "serial_number": "281803",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "This does not mean that the servant is forced with no choice; rather, Allah Almighty created him with a \"nature and attribute by which he is enabled to originate his will and actions. That nature is by Allah's Will, Power, and Formation. He is the One who created him and formed him as such, and he did not make himself as such. Rather, his Creator and Maker made him an originator of his will and actions. By that, He commanded him and forbade him, established the argument against him, and exposed him to reward and punishment. So He commanded him with what he is enabled to originate, and forbade him from what he is enabled to leave. He arranged his reward and punishment on these actions and omissions which He enabled him to do and empowered him over, and linked them to him. He created His creation with an innate nature to praise and blame him for them - the believer among them and the disbeliever, the one acknowledging the laws among them and the denier. So he was willing and wishing by Allah's Will for him; were it not for Allah's Will for him to be wishing, he would have been too incapable and weak to make himself wishing. So the Lord, Glory be to Him, gave him will, power, and volition, and taught him what benefits him and what harms him, and commanded him to run his will, volition, and power in the path by which he reaches the ultimate end of his rectification...\" (1).\nAllah Almighty said: {To whoever wills among you to take a right course (28) And you do not will except that Allah wills - Lord of the worlds} [At-Takwir: 28-29].\nSo the actions of servants are truly their actions and are done by the Lord Almighty, since the act is other than the object of the act. So the servant did his action truly \"and Allah is his Creator and the Creator of what he acted with of power and will and the Creator of his agency. The secret of the issue is that the servant is an agent who is acted upon... so his Lord is the One who made him an agent by His Power and Will, empowered him over the action, and originated for him the will by which he acts\" (2).",
    "foot_note": "1. Shifa al-Alil: 137 - 138. \n2. Shifa al-Alil: 131.",
    "book_id": "64"
  },
  {
    "serial_number": "281804",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Third Requirement: Capability (Qudrah) and Ability (Istita'ah):\nIstita'ah, Taqah, Qudrah, and Wus' are words with close meanings, and their opposite is 'Ajz (Incapacity). Theologians defined it as: \"An existential attribute with which action is possible instead of omission, and omission instead of action\" (1).\nThe issue of Istita'ah or Qudrah is among the issues where disagreement occurred among Islamic sects following the disagreement occurring in Destiny (Qadar). Those who said by Compulsion (Jabr) - who are the Jahmiyyah and those who agreed with them - said by negating Istita'ah neither with the action nor before it, because the servant according to them has no choice (2).\nThose who said by negating Destiny and that the servant creates his action - who are the Mu'tazila and those who agreed with them - affirmed Istita'ah before the action and negated it being with it (3).\nThose who said by Acquisition (Kasb) - who are the Ash'aris and those who agreed with them - said that Istita'ah is with the action, not before it (4).\nAs for the majority of Maturidiyyah, they took a middle path in the issue. They said by affirming Istita'ah before the action and with it. They said that Istita'ah falls into two types:\nThe First: Safety of causes and instruments, and this precedes the action.\nThe Second: The Istita'ah by which the action is prepared/enabled, and this is with the action.\nAl-Maturidi said: \"The principle according to us regarding what is named Power (Qudrah) is that it is of two types: One of them: Safety of causes and health of instruments, and this precedes actions. The Second: A meaning whose boundary cannot be clarified by anything referred to, except that it is only for the action; it is not permissible for it to exist in any state unless the action occurs by it when it occurs with it\" (5).",
    "foot_note": "1. Al-Mawaqif: 2/ 229, See: Al-Mubin fi Sharh Alfaz Al-Hukama' wa Al-Mutakallimin by Al-Amidi: 127, Al-Ta'rifat by Al-Jurjani: 35. \n2. Al-Milal wa Al-Nihal: 36, Maqalat Al-Islamiyyin: 1/ 312, Al-Farq bayn Al-Firaq: 128, Al-Tabsir fi Al-Din: 96, Usul Al-Din by Al-Baghdadi: 333. \n3. Maqalat Al-Islamiyyin: 1/ 300, Sharh Al-Usul Al-Khamsa: 390. \n4. Al-Insaf: 46, Al-Tamhid by Al-Baqillani: 323 - 325, Muhassal Afkar Al-Mutaqaddimin wa Al-Muta'akhkhirin: 152. \n5. Al-Tawhid: 256, 257.",
    "book_id": "64"
  },
  {
    "serial_number": "281805",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "Abu Al-Mu'in Al-Nasafi said: \"Then Istita'ah, Taqah, Qudrah, and Quwwah, if attributed to the servant, all imply one meaning in the terminology of the Usulis. Then Istita'ah according to us is two parts: One of them: Safety of causes and instruments and health of limbs and organs. This is what is meant by His saying Almighty: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way} [Al Imran: 97], and His saying Almighty: {And he who is unable - then the feeding of sixty poor persons} [Al-Mujadila: 4], and His saying Almighty informing about the hypocrites: {If we were able, we would have gone forth with you. They destroy themselves, and Allah knows that they are liars} [At-Tawbah: 42] meaning if we had the instruments and causes. The validity of obligation (Taklif) depends on this Istita'ah. The Second: The Istita'ah which is the reality of Power by which the action is prepared. This is what is meant by His saying Almighty: {They were not to have any protectors besides Allah; the punishment will be multiplied for them. They were not able to hear, nor did they see} [Hud: 20]. Do you not see that Allah Almighty blamed them for that? Blame only attaches to them for the absence of the reality of Power while safety of causes and health of instruments exists, not for the absence of safety of causes and health of instruments; because the negation of that Istita'ah is not by his wasting it, rather he is forced in that, so blame would not attach to them for refraining from the action upon its negation. Likewise, it is what is meant by the saying of the companion of Musa, peace be upon them: {He said, 'Indeed, with me you will never be able to have patience.'} [Al-Kahf: 67], and His saying: {He said, 'Did I not tell you that with me you would never be able to have patience?'} [Al-Kahf: 75]. For if the intended meaning were safety of causes and instruments, he would not have reproached him for abandoning patience. The second Istita'ah is an accident ('Arad) that occurs according to us concurrent with the action...\" (1).\nThe saying of the majority of Maturidiyyah regarding Istita'ah is the saying of Ahl al-Sunnah wal-Jama'ah (2), and it is the true saying indicated by evidences.",
    "foot_note": "1. Al-Tamhid: 53 - 54. See: Tabsirat al-Adilla: L 331, and Al-Nur Al-Lami': L 113. \n2. Sharh Al-Tahawiyyah: 499, See: Al-Dar': 1/ 60 - 62, Al-Fatawa: 8/ 129, 290 - 302, Al-Qada' wa Al-Qadar by Al-Mahmoud: 212 - 214.",
    "book_id": "64"
  },
  {
    "serial_number": "281806",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Al-Tahawi, may Allah have mercy on him, said: \"And the Istita'ah by which the action becomes mandatory, regarding Tawfiq (divine success) which is not permissible to describe the created being with, is with the action. As for the Istita'ah from the aspect of health, capacity, enablement, and safety of instruments, it is before the action, and the Address (Khitab) relates to it.\"\nIbn Abi Al-Izz, may Allah have mercy on him, explaining Al-Tahawi's words said: \"And what the generality of Ahl al-Sunnah said is that the servant has a power which is the basis of command and prohibition, and this may be before it [the action] and does not have to be with it. And the power by which the action occurs must be with the action; it is not permissible for the action to exist with a non-existent power. As for the power from the aspect of health, capacity, enablement, and safety of instruments, it may precede actions. This is the power mentioned in His saying Almighty: {And [due] to Allah from the people is a pilgrimage to the House - for whoever is able to find thereto a way. But whoever disbelieves - then indeed, Allah is free from need of the worlds} [Al Imran: 97], and likewise His saying Almighty: {So fear Allah as much as you are able} [At-Taghabun: 16], and likewise His saying Almighty: {And he who is unable - then the feeding of sixty poor persons} [Al-Mujadila: 4]. The intended meaning is the capability of causes and instruments... As for the proof of affirming the Istita'ah which is the reality of Power, they mentioned regarding it His saying Almighty: {They were not able to hear, nor did they see} [Hud: 20]; the intended meaning is negating the reality of Power, not negating causes and instruments...\" (1).",
    "foot_note": "1. Sharh Al-Tahawiyyah: 499 - 501.",
    "book_id": "64"
  },
  {
    "serial_number": "281807",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Fourth Requirement: Burdening Beyond Capacity (Taklif ma la yutaq):\nThe issue of burdening beyond capacity is also among the issues where disagreement occurred among Muslim sects, following the disagreement occurring in Istita'ah and Rational Goodness and Badness.\nThe Jahmiyyah said it is permissible to burden beyond capacity absolutely (1).\nThe Mu'tazila said it is not permissible to burden beyond capacity; because it is rationally bad (Qabih), and Allah Almighty is transcendent above doing the bad, so it is not permissible for it to issue from Him (2).\nThe Ash'aris said it is permissible to burden beyond capacity rationally, even if it did not occur in the Sharia. They permitted it rationally based on their negation of rational Goodness and Badness (3).\nAs for the Maturidiyyah, they agreed with the Mu'tazila in this issue. They said it is not permissible to burden beyond capacity; because it is corrupt rationally, and due to the absence of the Power which is the requirement of obligation (Taklif).\nAl-Maturidi said: \"The principle is that burdening one who is prevented from capacity is corrupt in reason\" (4).\nIbn Al-Humam said: \"I do not know anyone of them (i.e., the Maturidiyyah) who permitted burdening beyond capacity\" (5).\nThe correct view in the issue is detailing, so it is said: \"Burdening beyond capacity divides into two types:\nOne of them: What cannot be borne due to inability to do it, like burdening the chronically ill to walk, and burdening the human to fly and the like. This does not occur in the Sharia according to the majority of Ahl al-Sunnah who affirm Destiny.\nThe Second: What cannot be borne due to being occupied with its opposite, like the disbeliever being occupied with disbelief; for it is what prevented him from faith, and like the sitter in the state of his sitting; for his occupation with sitting prevents him from being standing. The decisive will for one of two opposites negates the will for the other opposite, and charging the disbeliever with faith is of this category.\nThe likes of this is not bad rationally according to any of the rationals; rather, rationals agree on commanding the human and forbidding him regarding what he cannot do at the moment of command and prohibition due to his engagement with its opposite, if it is possible to leave the opposite and do the commanded opposite. This does not enter into 'what cannot be borne'; for it is not said to the capable one commanded with Hajj if he does not perform Hajj that he was burdened with what he cannot bear, nor is it said to the one commanded with purification and prayer if he leaves that out of laziness that he was burdened with what he cannot bear\" (6).",
    "foot_note": "1. Al-Fatawa: 8/ 297, See: Al-Milal wa Al-Nihal: 36. \n2. Sharh Al-Usul Al-Khamsa: 133, 396 - 409, Nazariyat Al-Taklif: 300 - 304. \n3. Al-Mustasfa by Al-Ghazali: 1/ 98, Sharh Al-Mawaqif: 1/ 160, 161, Al-Matalib Al-Aliyah by Al-Razi: 9/ 267 - 271. \n4. Al-Tawhid: 266. \n5. Al-Musayarah: 156. \n6. Minhaj Al-Sunnah: 3/ 104, 105, See: Al-Dar': 1/ 64, 65, Sharh Al-Tahawiyyah: 515 - 518, Mawqif Ibn Taymiyyah min Al-Asha'irah: 1402 - 1404.",
    "book_id": "64"
  },
  {
    "serial_number": "281808",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Chapter Four: Issues of Faith (Iman)\nContaining five topics:\nTopic One: Meaning of Faith.\nTopic Two: Increase and decrease of Faith.\nTopic Three: Exception (Istithna) in Faith.\nTopic Four: Relationship between Faith and Islam.\nTopic Five: Ruling on the perpetrator of a major sin.\nTopic One: Meaning and Reality of Faith\nThe Maturidiyyah went to say that Faith is Assent (Tasdiq) by the heart only, and some of them went to say it is Assent by the heart and Confession (Iqrar) by the tongue (1).\nAbu Al-Mu'in Al-Nasafi said: \"Faith in language is an expression for Assent (Tasdiq). So everyone who believes another in what he informs is called in language a believer in him and a believer for him. Allah Almighty said: {But you would not be a believer for us} [Yusuf: 17] meaning a ratifier (Musaddiq) for us. Then the linguistic [meaning] which is Assent by the heart is the reality of Faith obligatory upon the servant as a right to Allah Almighty, which is that he believes the Messenger, peace and blessings be upon him, in what he brought from Allah Almighty. So whoever brings this Assent is a believer between him and Allah Almighty (2).\nThis saying contradicts the saying of Ahl al-Sunnah wal-Jama'ah. For the root 'Amina' means in language: trusted and felt secure, and Amanah (Trust) is Wuthuq (Reliability) (3). It is said: \"I did not feel secure (Amintu) that I would find his companion, meaning I did not trust\" (4). Al-Raghib Al-Asfahani, may Allah have mercy on him, said: \"The origin of Amn is tranquility of the soul and removal of fear\" (5). Iman is the verbal noun of Amana Yu'minu Imanan so he is Mu'min (6). The origin of Amana is A'mana with two Hamzas, the second was softened (7). It is from Amn (Safety) opposite of Fear (8).\nSheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, said in his definition of Faith: \"... For its derivation is from Amn which is acknowledgment (Iqrar) and tranquility (Tuma'ninah), and that is only achieved if Assent (Tasdiq) and Compliance (Inqiyad) settle in the heart\" (9). This acknowledgment includes the speech of the heart which is Assent, and the action of the heart which is Compliance.",
    "foot_note": "1. See: Sharh Al-Aqa'id Al-Nasafiyyah: 55, 56, Hashiyat Qasim Al-Hanafi on Al-Musayarah: 290 - 293, Sharh Daw' Al-Ma'ali: 19, 20. \n2. Al-Tamhid: 99 - 101, Al-Tawhid: 373 - 379. \n3. See: Root Amn in Al-Sahah: 5/ 2071, Al-Qamus Al-Muhit: 1176, Lisan Al-Arab: 13/ 21, and Al-Mu'jam Al-Wasit: 8. \n4. Lisan Al-Arab: 13/ 21. \n5. Al-Mufradat fi Gharib Al-Quran: 90. \n6. Tahdhib Al-Lughah: 15/ 368. \n7. Al-Sahah: 5/ 2071. \n8. Al-Sahah: 5/ 2071, Al-Qamus Al-Muhit: 1176. \n9. Al-Sarim Al-Maslul: 519, See: Al-Fatawa: 7/ 289.",
    "book_id": "64"
  },
  {
    "serial_number": "281809",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "As for the meaning of Faith: It is Assent along with Compliance. It sometimes becomes transitive with 'Ba' and sometimes with 'Lam'. From the first - transitive with 'Ba' - it is said: Amana bihi qawmun (A people believed in him) (1) and Kadhdhaba bihi qawmun (A people denied him). From it is His saying Almighty: {Those who believe in the Unseen} [Al-Baqarah: 3]. Meaning they believe the reports of Allah regarding Paradise and Hell (2).\nFrom the second - transitive with 'Lam' - is His saying Almighty informing about the Jews that they said: {And do not believe except for one who follows your religion} [Al Imran: 73], meaning do not acknowledge nor believe (3). And from it is His saying Almighty: {But you would not be a believer for us} [Yusuf: 17], meaning a ratifier for us (4). The difference between them is that the transitive with 'Ba' is believing the report itself, and the transitive with 'Lam' is believing the reporter (5).\nSo Faith is: Confession by tongue, Belief by heart, and Action by limbs. It increases with obedience to the Most Merciful, and decreases with obedience to Satan (6).\nImam Al-Shafi'i, may Allah have mercy on him, said: \"The consensus of the Companions and the Followers after them whom we met was: That Faith is: Speech, Action, and Intention; none of the three suffices without the other\" (7).\nMuhammad bin Hussein Al-Ajurri, may Allah have mercy on him, said in the chapter \"The saying that Faith is Assent by the heart, Confession by the tongue, and Action by the limbs; one is not a believer unless these three qualities gather in him\", he said: \"Know, may Allah have mercy on us and you, that what Muslim scholars are upon is that Faith is obligatory on all creation, and it is Assent by the heart, Confession by the tongue, and Action by the limbs. Then know that knowledge by the heart and Assent do not suffice unless there is with it Faith by the tongue verbally, and knowledge of the heart and pronunciation of the tongue do not suffice until there is action by the limbs. If these three qualities are complete in him, he is a believer. The Book, the Sunnah, and the saying of Muslim scholars indicate that...\" (8).",
    "foot_note": "1. Al-Mufradat fi Gharib Al-Quran: 25. \n2. See: Tafsir Ibn Kathir: 1/ 165. \n3. See: Majaz Al-Quran: 97, Ma'ani Al-Quran: 1/ 222, and Tafsir Ibn Kathir: 2/ 59. \n4. Tafsir Gharib Al-Quran by Ibn Qutaybah: 213, Al-Mufradat fi Gharib Al-Quran: 91. \n5. Majmu' Al-Fatawa: 7/ 289, 529, and Sharh Al-Tahawiyyah: 321. \n6. See: Majmu' Al-Fatawa: 7/ 505, See: Sharh Al-Tahawiyyah: 314. \n7. Sharh Usul I'tiqad Ahl Al-Sunnah: 5/ 886. \n8. Al-Shari'ah by Al-Ajurri: 2/ 611, See: Sharh Usul I'tiqad Ahl Al-Sunnah: 4/ 832.",
    "book_id": "64"
  },
  {
    "serial_number": "281810",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "The evidences for the inclusion of these matters in the name of Faith are many, including:\nHis saying Almighty regarding the heart's assent and certainty: {And the one who has brought the truth and [they who] believed in it - those are the righteous. (33) They will have whatever they desire with their Lord. That is the reward of the doers of good (34)} [Az-Zumar: 33 - 34]. And He Almighty said: {And thus did We show Abraham the realm of the heavens and the earth that he would be among the certain [in faith] (75)}.\nIn the Hadith of Intercession: (He exits the Fire who said: There is no god but Allah, and in his heart is good equal to the weight of a barley grain) (1).\nAnd His saying Almighty regarding mentioning some actions of the hearts like sincerity, love, compliance, turning to Allah Mighty and Majestic, relying on Him, and the requirements and consequents of that. Allah Almighty said: {And do not send away those who call upon their Lord morning and afternoon, seeking His countenance} [Al-An'am: 52]. And He said: {And not [giving] for anyone who has with Him a favor to be rewarded (19) But only seeking the countenance of his Lord, Most High (20)} [Al-Layl: 19 - 20], and other texts indicating the obligation of reliance, fear, hope, dread, submission, turning in repentance, and other actions of the hearts.\nAmong them is His saying Almighty regarding pronouncing the Two Testimonies: testifying that there is no god but Allah and that Muhammad is the Messenger of Allah, and acknowledging their implications. Allah Almighty said: {Say, \"We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael and Isaac and Jacob and the Descendants and what was given to Moses and Jesus and what was given to the prophets from their Lord. We make no distinction between any of them, and we are Muslims [in submission] to Him.\"} [Al-Baqarah: 136]. And He Almighty said: {And when it is recited to them, they say, \"We have believed in it; indeed, it is the truth from our Lord\"} [Al-Qasas: 53]. And he said, peace and blessings be upon him: (I have been commanded to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah...) (2).\nAmong them is His saying Almighty regarding actions performed by the tongue like reciting the Quran and all remembrances like Tasbih, Tahmid, Takbir, Dua, Istighfar, etc.: {Indeed, those who recite the Book of Allah and establish prayer and spend [in His cause] out of what We have provided them, secretly and publicly, [can] expect a transaction that will never perish (29)} [Fatir: 29]. And He said: {And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words} [Al-Kahf: 27]. And He said: {O you who have believed, remember Allah with much remembrance (41) And exalt Him morning and afternoon (42)} [Al-Ahzab: 41 - 42].",
    "foot_note": "1. Sahih Al-Bukhari (7410), and Muslim (191). \n2. Sahih Al-Bukhari (25), and Muslim (22).",
    "book_id": "64"
  },
  {
    "serial_number": "281811",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "And among them are the evidences regarding what relates to the action of limbs, which is the action only performed by them, such as: Standing, Bowing, Prostrating, walking to mosques and to Hajj and Jihad in the path of Allah. Allah Almighty said: {And stand before Allah, devoutly obedient} [Al-Baqarah: 238]. And He Almighty said: {O you who have believed, bow and prostrate and worship your Lord and do good - that you may succeed. (77) And strive for Allah with the striving due to Him} [Al-Hajj: 77 - 78]. And He Almighty said: {And the servants of the Most Merciful are those who walk upon the earth easily, and when the ignorant address them [harshly], they say [words of] peace, (63) And those who spend [part of] the night to their Lord prostrating and standing [in prayer] (64)} [Al-Furqan: 63 - 64] (1).\nAmong the explicit evidences for that is the Hadith of the delegation of Abd Qays, in which he said, peace and blessings be upon him: (I command you to believe in Allah alone). And he said: (Do you know what belief in Allah alone is?). They said: Allah and His Messenger know best. He said: (Testifying that there is no god but Allah, establishing prayer, giving Zakat, and giving one-fifth of the booty) (2).",
    "foot_note": "1. See: Ma'arij Al-Qabul by Sheikh Hafiz Hakami: 2/ 17 and following. \n2. Sahih Al-Bukhari (53), and Sahih Muslim (23).",
    "book_id": "64"
  },
  {
    "serial_number": "281812",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Topic Two: Increase and Decrease of Faith\nThis issue is built upon the previous one; since the Maturidiyyah said that Faith is Assent (Tasdiq) and that actions are not included in the name of Faith, they said: Faith does not increase or decrease. They based this on the premise that Assent does not accept increase and decrease.\nAl-Hakim Al-Samarqandi said: \"And it should be known that Faith does not increase or decrease; because whoever sees increase and decrease in Faith is an innovator. Increase and decrease are only in actions, not in Faith. And no one from the scholars and righteous said that Faith increases and decreases\" (1).\nAbu Al-Mu'in Al-Nasafi said: \"If it is proven that Faith is Assent, and it does not increase in itself, it indicates that Faith does not increase or decrease. So there is no increase to it by the addition of acts of obedience to it, nor decrease to it by committing sins, since Assent in both states is as it was before them\" (2).\nThis saying contradicts the saying of Ahl al-Sunnah wal-Jama'ah, which is that Faith increases with obedience and decreases with disobedience (3). The evidences for the increase and decrease of Faith from the Book, the Sunnah, and the traditions of the Salaf are very many:\nAmong them: His saying Almighty {And when His verses are recited to them, it increases them in faith} [Al-Anfal: 2]. And He Almighty said: {And Allah increases those who were guided, in guidance} [Maryam: 76]. And He Almighty said: {And that those who believe may increase in faith} [Al-Muddaththir: 31]. And He Almighty said: {It is He who sent down tranquility into the hearts of the believers that they would increase in faith along with their [present] faith} [Al-Fath: 4].\nThe Prophet, peace and blessings be upon him, described women with deficiency in reason and religion, saying: (... I have not seen any lacking in reason and religion more overwhelming to a man of intellect than you) (4).\nIn the Hadith of Intercession: (Go and bring out whoever has in his heart the lowest, lowest, lowest weight of a mustard seed of faith, bring him out of the Fire) (5).\nThe speech of the Companions, may Allah be pleased with them, and those after them regarding this meaning is also plentiful:\nAbu Darda said: \"It is from the Fiqh (understanding) of the servant to tend to his faith and what decreased of it, and it is from the Fiqh of the servant to know whether he increases or decreases?\" (6).\nIbn Masud, may Allah be pleased with him, used to say in his supplication: \"O Allah, increase us in faith, certainty, and understanding\" (7).\nAl-Shafi'i, may Allah have mercy on him, said: \"Faith is speech and action, it increases with obedience, and decreases with disobedience\" (8).\nAl-Bukhari, may Allah have mercy on him, said: \"I met more than a thousand men from the scholars in the regions, I did not see any of them differ that Faith is speech and action, and it increases and decreases\" (9).",
    "foot_note": "1. Salam Al-Ahkam: 189, 190. See: 193 - 197. \n2. Al-Tamhid: 102, Usul Al-Din by Al-Bazdawi: 153, Sharh Al-Aqa'id Al-Nasafiyyah: 56 - 59. \n3. For more on this issue: See: Ziyadat Al-Iman wa Nuqsanuh wa Hukm Al-Istithna' fih, by Abdul Razzaq bin Abdul Muhsin Al-Badr. \n4. Sahih Muslim (79). \n5. Sahih Al-Bukhari (7510), and Sahih Muslim (193). \n6. Sharh Al-Aqidah Al-Tahawiyyah: 2/ 126. \n7. Narrated by Al-Tabarani in Al-Kabir (8549), Al-Haythami said in Al-Majma': Its chain is Jayyid (good). Al-Hafiz, may Allah have mercy on him, said in Al-Fath (1/ 48): Narrated by Ahmad in Al-Iman, and its chain is authentic. \n8. Fath Al-Bari: 1/ 47. \n9. Fath Al-Bari: 1/ 47.",
    "book_id": "64"
  },
  {
    "serial_number": "281813",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Topic Three: Exception (Istithna) in Faith\nWhat is meant by Exception in Faith is: Suspending Faith on the Will [of Allah], which is the believer saying: I am a believer Insha'Allah (If Allah wills).\nSince the Maturidiyyah said that Faith is Assent, and that it does not accept increase and decrease, they forbade Exception in Faith. They said: Exception is doubt, and whoever doubts in his assent is a disbeliever.\nAbu Mansur Al-Maturidi said: \"The principle according to us is decisiveness in saying Faith and naming oneself with it absolutely and abandoning Exception in it; because every meaning where the gathering of its existence is the completion of Faith according to him, if exception is made in it, that meaning is not valid. So based on that is his matter in general, like saying: I testify that there is no god but Allah, Insha'Allah, or Muhammad is the Messenger of Allah, Insha'Allah, and likewise testimony of Resurrection, Angels, Messengers, and Books\" (1).\nAbu Al-Mu'in Al-Nasafi said: \"Then since it - meaning Faith - is a name for Assent, and it is a real thing with known boundary, if it occurs with this boundary the Essence is by it a believer, like sitting, standing, blackness, whiteness, etc. Since they are meanings of known boundary, when they exist in their reality the Essence is by them sitting, standing, black, white, so is this. By knowing this, it is known that when Assent exists, Faith has existed in its reality. So the saying of one who says: I am a believer Insha'Allah; with the existence of the reality of Assent, is like the saying of one who says: I am standing Insha'Allah, and I am sitting Insha'Allah while the reality of that exists, and that is void so is this\" (2).\nSo the Maturidiyyah forbade Exception in Faith because the concept and reality of Faith for them is Assent or Assent and Speech.",
    "foot_note": "1. Al-Tawhid: 388. \n2. Al-Tamhid: 105, 106.",
    "book_id": "64"
  },
  {
    "serial_number": "281814",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "The intended meaning of Exception in Faith is suspending Faith on the Will [of Allah], which is the believer saying I am a believer Insha'Allah. The disagreement in this issue occurred following the disagreement on the reality of Faith. The summary of the sayings said regarding Exception are three opinions:\nFirst: Prohibition of Exception\nIf the Exception stems from doubt in the existence of the foundation of Faith, this is forbidden, rather disbelief; because Faith is decisiveness, and doubt contradicts it. The basis of this saying: Faith is one thing the person knows of himself, so if he makes exception in it, it is proof of his doubt; therefore, they used to call those who make exception in Faith 'Doubters' (Shukkak).\nSecond: Obligation of Exception:\nIf the Exception stems from fear of self-praise and testifying for oneself of perfecting Faith in word, deed, and belief, this is obligatory; out of fear of this prohibition. Also, Faith is what a person dies upon; so a person is only a believer or disbeliever according to death, and this is a future unknown matter; so it is not permissible to be decisive about it.\nThird: Detailing:\n- If the Exception stems from doubt in the existence of the foundation of Faith, this is forbidden, rather disbelief; because Faith is decisiveness, and doubt contradicts it.\n- If it stems from fear of self-praise and testifying for oneself of achieving Faith in word, deed, and belief, or that Faith is what a person dies upon; for a person is only a believer or disbeliever according to death, and this is a future unknown matter; so it is not permissible to be decisive about it, then this is obligatory.\n- If the intent of Exception is seeking blessing by mentioning the Will or stating the cause, and that what exists in his heart of Faith is by Allah's Will, this is permissible. Suspension in this manner - I mean stating the cause - does not contradict the realization of the suspended matter. For suspension in this manner has appeared regarding realized matters; like His saying Almighty: {Certainly has Allah showed to His Messenger the vision in truth. You will surely enter al-Masjid al-Haram, if Allah wills, in safety, with your heads shaved and [hair] shortened, not fearing} [Al-Fath: 27]. Likewise, the supplication in visiting graves: (And we, if Allah wills, will follow you) (1)\" (2).",
    "foot_note": "1. Sahih Muslim (249). \n2. See: Al-Manahi Al-Lafziyyah by Ibn Uthaymeen: 125, Risalah Fath Rabb Al-Bariyyah bi-Talkhis Al-Hamawiyyah: 117.",
    "book_id": "64"
  },
  {
    "serial_number": "281815",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Topic Four: Relationship between Faith and Islam\nThe Maturidiyyah went in this issue to say that Islam and Iman (Faith) are one thing, and there is no variance between them, and one does not separate from the other, and if one disappears the other disappears, and that the difference between them is in the meaning by language.\nAbu Mansur Al-Maturidi said: \"As for the saying according to us regarding Faith and Islam, it is one in the matter of religion in verification of intent, even if they may differ in meaning by language. Then from the aspect of verification of intent in religion, Faith is a name for the testimony of minds and traces by Assent to the Oneness of Allah Almighty, and that to Him belongs Creation and Command in creation having no partner in that. And Islam is the submission of the person himself entirely and likewise everything to Allah Almighty by servitude to Allah having no partner in it. So they resulted in intent as one. Then the principle is that it is far from reason that a person comes with all conditions of Faith then is not a Muslim, or comes with all conditions of Islam then is not a believer. It is proven that they are in reality one, and it is known that whoever is permitted to be named by one of them is permitted [to be named] by the other\" (1).\nPeople in this issue are on three opinions:\nFirst: That Islam and Faith are names for one named thing.\nSecond: That Islam is the Word and Faith is the Action.\nThird: Detailing, and it is the Truth; which is that the state of their conjunction is different from the state of their isolation. If they are conjoined, the intended meaning of Islam is apparent actions and Faith is hidden actions. If they are isolated, their meaning is one and one enters into the other, and the intended meaning is all apparent and hidden matters of religion.\nIts meaning: That Islam and Faith if gathered in one text from Book or Sunnah, then each one has a meaning specific to it. So Islam: Apparent actions including the Two Testimonies and Prayer... And Faith: Hidden actions of beliefs like Reliance, Fear, Love, Hope, Dread... etc.",
    "foot_note": "1. Al-Tawhid: 394 - 397, See: Usul Al-Din by Al-Bazdawi: 154, 221.",
    "book_id": "64"
  },
  {
    "serial_number": "281816",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "Many evidences indicated this, including:\nHis saying Almighty: {The Bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts.} [Al-Hujurat: 14]. So they gathered in one text, and He negated Faith from them, and affirmed Islam for them; which indicated their separation, that they are Muslims but did not reach being believers.\nAnd the famous Hadith of Gabriel, peace be upon him (1), in which Islam is mentioned: by the five pillars, and Faith: by the six fundamentals. For they gathered in one text, and the Prophet, peace and blessings be upon him, answered for each with a meaning other than the other; which indicated their separation.\nThe meaning of their separation [in definition]: That one of them comes in a text without the other, then one of them has the meaning of the other, so Islam is Faith and vice versa.\nThere are many evidences for this in the two Revelations: Among them His saying Almighty in Surah Ali Imran: {And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers} [Ali Imran: 85]. And in its beginning His saying Almighty: {Indeed, the religion in the sight of Allah is Islam} [Ali Imran: 19]. So we implied that the religion in the sight of Allah is Faith, and whoever desires other than Faith as religion, it will not be accepted from him.\nAnd from it His saying Almighty in His address to the believers in many verses: {O you who have believed}; for the address is also directed to those who submitted and Faith has not yet entered their hearts, which indicates one covering the other when alone.\nAmong the most explicit evidences from the Sunnah on their separation making their meaning one is the Hadith of the delegation of Abd Qays, agreed upon its authenticity from the Hadith of Abu Huraira, may Allah be pleased with him, that they came to the Prophet, peace and blessings be upon him, and said: O Messenger of Allah, between us and you is this tribe of Mudar and we cannot come to you except in the sacred months, so command us with a decisive command we can inform those behind us with, and enter Paradise by it? So he, peace and blessings be upon him, said: (I command you to believe in Allah alone. Do you know what belief in Allah alone is? They said: Allah and His Messenger know best! He said: To testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, give Zakat, fast Ramadan, and give one-fifth of the booty) (2). For the Prophet, peace and blessings be upon him, informed them in the Hadith about Faith by the pillars of Islam, which indicated that they are of one meaning, which implies that one suffices for the other when separated.",
    "foot_note": "1. Sahih Muslim (8). \n2. Sahih Al-Bukhari (53). For more on this issue, see: Mas'alat Al-Iman by Ali bin Abdul Aziz Al-Shibl.",
    "book_id": "64"
  },
  {
    "serial_number": "281817",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Topic Five: Ruling on the Perpetrator of a Major Sin\nThe Maturidiyyah went to say that the perpetrator of a major sin - who does not consider it lawful - does not exit Faith and does not enter Disbelief; rather he is a believer with complete faith due to the non-removal of Assent, and he is with his faith a Fasiq (sinner) deserving of threat due to his lack of obedience to Allah Almighty and his committing of sins and offenses.\nThey said if the perpetrator of a major sin dies without repentance, he is under the Will [of Allah], if He wills He punishes him, and if He wills He forgives him, and if punished he exits the Fire inevitably.\nAbu Al-Mu'in Al-Nasafi said: \"As for the People of Truth, they say: Whoever commits a major sin not considering it lawful, nor belittling the One who forbade it; but due to being overcome by desire or zeal, hoping Allah forgives him, and fearing He punishes him for it; this one's name is Believer, and he remains on what he was on of Faith, and his faith did not cease, nor decrease, and he does not exit Faith except from the door he entered it. His ruling is that if he dies without repentance, Allah Almighty has the Will regarding him, if He wills He pardons him by His bounty and generosity or by the blessing of what he has of Faith and good deeds or by the intercession of some righteous ones, and if He wills He punishes him according to his sin then the outcome of his affair is Paradise inevitably and he does not stay eternally in the Fire. As for the name, it is because Faith is Assent and Disbelief is Denial, and this one who committed this major sin, Assent remained with him, and as long as Assent exists Denial is non-existent due to the opposition between them. So saying his disbelief while Denial is non-existent or the cessation of Faith while Assent stands or the establishment of Hypocrisy while Assent is settled in the heart is a saying of manifest corruption. Then applying the name Fasiq is because he exited the boundary of compliance, and Fisq in language is exiting, then exiting from compliance, and it does not oppose Assent so Assent remains, and if it remains the ratifier is a believer by necessity\" (1).\nThe truth and correct view in ruling on the perpetrator of a major sin regarding worldly rulings is to say: He is \"a believer with incomplete faith, a believer by his faith, a Fasiq by his major sin, and he is not given the absolute name of Faith; for the Book and Sunnah negated the absolute name from him, and the name of Faith covers him in what Allah and His Messenger commanded; because that is an obligation on him and prohibition on him and it is binding on him as it binds others\" (2).\nAs for their saying that the perpetrator of a major sin if he dies without repentance is under the will of Allah, if He wills He pardons him and if He wills He punishes him, then the outcome of his affair is to Paradise and he does not stay eternally in the Fire, it is the true saying in the issue and it is the school of Ahl al-Sunnah wal-Jama'ah and the Predecessors of this Nation.\nAl-Tahawi, may Allah have mercy on him, said: \"And the people of major sins from the nation of Muhammad, peace and blessings be upon him, do not stay eternally in the Fire if they die while they are monotheists even if they did not repent after meeting Allah as knowers [believers]. They are in His Will and Judgment, if He wills He forgives them and pardons them by His bounty as He Mighty and Majestic mentioned in His Book {He forgives what is less than that for whom He wills} [An-Nisa: 48], and if He wills He punishes them in the Fire by His justice then brings them out of it by His mercy and the intercession of intercessors from the people of His obedience then sends them to His Paradise. That is because Allah Almighty is the Ally of the people of His knowledge, and did not make them in both abodes like the people of His denial who failed to receive His guidance and did not attain His guardianship. O Allah, Ally of Islam and its people, make us firm on Islam until we meet You with it\" (3).",
    "foot_note": "1. Al-Tamhid: 92, 93, Bahr Al-Kalam: 47, 48, See: Al-Tawhid: 329 - 365. \n2. Majmu' Al-Fatawa: 7/ 241. \n3. Sharh Al-Aqidah Al-Tahawiyyah: 413.",
    "book_id": "64"
  },
  {
    "serial_number": "281818",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Chapter Five: Comparison between Maturidiyyah and Ash'ariyyah\nContaining two topics:\nTopic One: Issues of real disagreement between them.\nTopic Two: Issues of verbal disagreement between them.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281819",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Preface\nThe observer of the Maturidi creed and the Ash'ari creed finds great convergence between them. This convergence is what created agreement and harmony between them, until each of them started applying the name Ahl al-Sunnah wal-Jama'ah to both sects.\nWhat appears - and Allah Almighty knows best the truth - is that Maturidiyyah emerged from Kullabiyyah just as Ash'ariyyah did. The evidence for this is that the most distinctive feature of Maturidiyyah is the saying of the pre-eternity of Takwin, and this was said by Kullabiyyah before the appearance of Maturidiyyah. Also, the Kullabi school was widespread in the lands of Transoxiana, which are the lands where Al-Maturidi lived and died... So based on this, Al-Maturidi must have taken from his Sheikhs from the Kullabiyyah and was influenced by them. By this, the secret of the convergence between Ash'aris and Maturidis becomes clear, and Allah Almighty knows best the truth (1).\nAl-Subki - who is Ash'ari - said in Al-Tabaqat: \"I examined the books of the Hanafis - meaning the Maturidis due to their following the Hanafi school - and I found all the issues in which there is disagreement between us and the Hanafis to be thirteen issues. Of them, six are semantic (related to meaning) and the rest are verbal. Those six semantic ones do not necessitate their opposing us, nor our opposing them in them to the extent of Takfir (declaring disbelief) or Tabdi' (declaring innovation). I have a poem ending in Nun (Nuniyyah) in which I gathered these issues, and added to it issues in which Ash'aris differed among themselves with confirming each other in the root of creed and their claim that they are all on the Sunnah\" (2).\nAlso, Al-Bayadi devoted a chapter in his book \"Isharat Al-Maram\" to explain the controversial issues between Ash'aris and Maturidis, and mentioned that the disagreement between them occurs in fifty issues. He also presented the details of the controversial issues with their evidences in all chapters of the book. He mentioned that the disagreement between Ash'aris and Maturidis is semantic, but it is in branches where disagreement does not necessitate Tabdi'. Thus, the book is considered one of the most important references in knowing the disagreement between Ash'aris and Maturidis (3).\nZahid Al-Kawthari says: \"Al-Ash'ari and Al-Maturidi are the two Imams of Ahl al-Sunnah wal-Jama'ah in the easts and wests of the earth. They have countless books. Most of what occurred between these two Imams of disagreement is of the type of verbal disagreement. Several books have been written on that, and Al-Bayadi summarized it well in \"Isharat Al-Maram fi Ibarat Al-Imam\", and Al-Zabidi quoted his text in \"Sharh Al-Ihya\" (4).",
    "foot_note": "1. See: Al-Maturidiyyah by Al-Harbi: 491 - 496, and he mentioned a group of writings on the subject of this disagreement. \n2. Tabaqat Al-Subki: 378 - 379. \n3. Kitab Isharat Al-Maram: 23, 53. \n4. Muqaddimat Al-Kawthari: 51.",
    "book_id": "64"
  },
  {
    "serial_number": "281820",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Topic One: Issues of Real Disagreement Between Them (1)\nThe most important issues where disagreement occurred between Maturidiyyah and Ash'ariyyah and the disagreement was real not verbal, and substantial not branching:\nIssue One: Knowledge of Allah Almighty: The Maturidiyyah said that knowledge of Allah Almighty is obligatory by reason, and that if He Almighty did not send a messenger to people, it would be obligatory on them by their intellects to know His existence Almighty, His oneness, His description with befitting attributes, that He is the Originator of the world and its Maker, and that whoever revelation did not reach is not excused. As for the Ash'aris, they said: Knowledge of Allah Almighty is obligatory by Sharia, and no faith is obligatory nor disbelief prohibited before the arrival of Sharia. Therefore, they said: The one growing up on a mountain peak whom the Call did not reach is excused.\nIssue Two: Attribute of Will: The Maturidiyyah went to say that Will does not imply Pleasure (Rida) and Love (Mahabbah). The Ash'aris went to say that Love, Pleasure, and Will are synonymous.\nIssue Three: Attribute of Speech: The Maturidiyyah went to say that Allah's speech is not heard; rather what is heard is what expresses it. So Moses only heard a sound and letters created by Allah indicating His speech. The Ash'aris went to say the permissibility of hearing Allah Almighty's speech, and that what Moses, peace be upon him, heard was Allah Almighty's Psychological Speech, and that is by creating a perception in the listener.\nIssue Four: Attribute of Takwin (Bringing into being): The Maturidiyyah said that Takwin is a pre-eternal attribute of Allah Almighty, and that Takwin is other than the Mukawwan (thing brought into being). The Ash'aris went to say that Takwin is not an attribute of Allah Almighty, but rather a conceptual matter occurring in the mind from attributing the Influencer to the Effect. Thus, they said that Takwin is the same as the Mukawwan and it is temporal.\nIssue Five: Burdening beyond capacity: The Maturidiyyah went to say the impermissibility of burdening beyond capacity. The majority of Ash'aris went to say that burdening beyond capacity is permissible.\nIssue Six: Wisdom and Causality in Allah Almighty's actions: The Maturidiyyah went to say the necessity of wisdom in Allah Almighty's actions, and that it is not permissible for them to be devoid of it absolutely. The Ash'aris went to negate wisdom and causality in Allah Almighty's actions, and said: His actions are not caused by purposes, and it is not permissible to explain His actions Almighty by any purposes or teleological causes.",
    "foot_note": "1. See: Al-Maturidiyyah by Al-Harbi: 498 - 501. Al-Maturidiyyah wa Mawqifuhum min Tawhid Al-Asma' wa Al-Sifat by Al-Afghani: 1/ 452 and following.",
    "book_id": "64"
  },
  {
    "serial_number": "281821",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Issue Seven: Goodness and Badness (Tahsin and Taqbih): The Maturidiyyah went to say that the intellect perceives the goodness and badness of things, meaning they said by Rational Goodness and Badness. As for the Ash'aris, they went to say that the goodness and badness of things is not known by reason, but is only known by Sharia.\nIssue Eight: Ability (Istita'ah): The majority of Maturidiyyah went to say that Ability falls into two types: First: Safety of causes and instruments, and it precedes the action. Second: The Ability by which the action is prepared, and it is with the action. As for the Ash'aris, they went to say that Ability is only with the action, and it is not permissible for it to precede it nor follow it.\nIssue Nine: Acquisition (Kasb): The Maturidiyyah and Ash'aris agreed that servants' actions are created by Allah Almighty, and are an acquisition by servants, but they differed in the meaning of Kasb. The Maturidiyyah said: The Influencer in the origin of the action is Allah Almighty's power, and the influencer in the description of the action is the servant's power, and this influence of the servant is Kasb. So the servant's power according to Maturidiyyah has an effect on the action, but no effect in origination because Allah Almighty is unique in creation, but its effect is in the intent and choice of the action. As for Kasb according to Ash'aris, it is that the voluntary actions of servants occur by Allah Almighty's power alone, and their power has no effect on them. Rather, Allah Glory be to Him made it His habit to create in the servant power and choice, so if there is no impediment He creates His decreed action in him concurrently with them. So the action is created by Allah as invention and origination, and acquired by the servant. The intended meaning of his acquiring it is: its concurrence with his power and will without there being any effect or entry from him in its existence other than being a locus for it.\nIssue Ten: Faith of the Imitator: The Maturidiyyah went to say the validity of the imitator's faith. As for the Ash'aris, they went to say the invalidity of the imitator's faith, and said: One of the conditions of valid faith is knowing every issue with a definitive rational proof.\nIssue Eleven: Reward and Punishment: The Maturidiyyah and Ash'aris agree on saying the impermissibility of punishing the obedient and rewarding the disobedient. However, the point of disagreement between them is in the source. The Maturidiyyah went to say that the source for that is Reason and Sharia. As for the Ash'aris, they went to say that the source for that is Sharia. It resulted from that that the Maturidiyyah forbade the permissibility of punishing the obedient and rewarding the disobedient, while the Ash'aris permitted that (1).\nIssue Twelve: Infallibility of Prophets: The Maturidiyyah said by the infallibility of Prophets from major sins and shameful acts especially regarding the matter of Sharia, conveying rulings, and guiding the nation. The Maturidiyyah also go to say that Prophets are infallible from minor sins, and they obliged interpreting everything that gave an impression [otherwise] regarding them, peace be upon them, from the Book and Sunnah which deceived some of those who permitted minor sins for them. So Prophets are transcendent above minor and major sins and all disobediences. While the Ash'aris go to say that minor sins may issue from Prophets before Prophethood if they are not vile and there is no proof preventing that, whether that was intentionally or by mistake. As for after Prophethood, Prophets are infallible from intentionally doing anything that breaches their truthfulness even if it is from minor sins (2).",
    "foot_note": "1. Ta'wilat Ahl Al-Sunnah: 1/ 169 - 178. \n2. Previous Reference: 1/ 169 - 178.",
    "book_id": "64"
  },
  {
    "serial_number": "281822",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Topic Two: Issues of Verbal Disagreement Between Them (1)\nAs for the issues verbally disputed, they are:\nIssue One: Happiness and Misery: The Maturidiyyah see that Happiness and Misery are in the current state, and not pre-eternal. Thus, the Happy one for them is the believer in the current state, and if he dies on disbelief he has turned miserable after being happy. And the Miserable one is the disbeliever in the current state, and if he dies on faith he has turned happy. As for the Ash'aris: The concept of Happiness for them is dying on Faith, and that is - considering the attachment of Allah Almighty's knowledge - pre-eternally so. Likewise, Misery for them is dying on Disbelief. Thus, the Happy one for them is happy in pre-eternity and the Miserable one is miserable in pre-eternity, and the Happy does not change to miserable nor the Miserable to happy.\nIssue Two: Ruling on the continuation of Prophethood after the death of Messengers: According to the Maturidiyyah, Messengers and Prophets remain so even after their death, i.e., in their capacity as Prophets and Messengers. As for the Ash'aris, they see that Prophets and Messengers after their death are in the ruling (Hukm) of the Message, and the ruling of a thing stands in place of its origin. Thus, it becomes clear that both parties agree on the principle of the issue which is that the Message remains until now, but the disagreement is whether the Message remains essentially or in the ruling of the Message.\nIssue Three: Will (Irada), and does it imply Pleasure and Love or not? The Maturidiyyah affirm Allah Almighty's comprehensive Will for servants' actions, because servants' actions are of His creation Almighty. Saying the absence of Allah's comprehensive Will means: Allah's lack of power over their actions, for saying Absolute Power, Absolute Will, and Absolute Knowledge is necessary for the perfection of the attributes of Divinity. However, the Maturidiyyah say: There is no Love in the attribute of Will, and this Will does not imply Pleasure and Love. As for the Ash'aris, they see that Will is Pleasure and Love, since Love is Will, and Pleasure likewise means Will, and Will implies Pleasure and Love. Thus, Will, Love, Volition (Mashi'ah), Pleasure, and Choice are all one meaning.\nIssue Four: Exception in Faith: The Maturidiyyah define Faith as Assent by the heart and Confession by the tongue. The Ash'aris define it as Assent in Allah Almighty. The Maturidiyyah went to forbid the entry of Exception in Faith, so the believer for them is a believer truly and not a believer by Will [saying Insha'Allah], because the Maturidiyyah see that Exception is doubt in the believer's faith and its conditions which do not accept doubt. While the Ash'aris go to the permissibility of Exception in Faith, so the believer can say: I am a believer Insha'Allah. Thus, it appears that the locus of disagreement is that the Maturidiyyah do not permit Exception in Faith, while the Ash'aris permit that.",
    "foot_note": "1. See: Al-Maturidiyyah wa Mawqifuhum min Tawhid Al-Asma' wa Al-Sifat by Al-Afghani: 1/ 468 and following.",
    "book_id": "64"
  },
  {
    "serial_number": "281823",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Issue Five: Faith of the Imitator: The Maturidiyyah go to say the validity of the imitator's faith, because with this faith there is Assent, and Assent is the origin of Faith. According to them also, it is valid to suffice with imitation in religious beliefs; however, the imitator is considered sinful for leaving observation (Nazar) if he is capable of that. As for the Ash'aris, they say that imitation is not sufficient in religious beliefs, but there must be decisive belief originating from proof; because Faith is from the fundamental issues, and these are few and can be encompassed, and general knowledge suffices in them, and ability to express that is not a condition for them. They go to say that the imitator is sinful for leaving observation and deduction, but he is not a polytheist or disbeliever.\nIssue Six: Acquisition (Kasb): The Maturidiyyah affirm for the servant a power and will that has an effect on the action, but has no effect on origination and invention. Its effect focuses on describing the action as obedience or disobedience. This power is represented in the intent and choice of the action. Allah Glory be to Him and Most High creates for the servant the power to act, and the result of the action is upon him. Thus, the Maturidiyyah affirm that the servant has choice in his actions, and these actions are what praise and blame in the world are based on, as well as reward and punishment in the Hereafter. As for the Ash'aris, they go to say that the servants' power by which the action occurred is not created [by the servant? context implies uncreated influence or no influence, checking text: standard Ashari view is power is created but ineffective], and that their affair is in their hands [text seems confused or attributing Mu'tazili view? Standard Ashari is created power with no effect. Re-reading Arabic: \"power... is not created\" seems to contradict Ashari tenets. However, sticking to translation]. And on it is the pivot of their obligation. Will according to Ash'aris is partial will, as for universal will according to them, it is created by Allah Almighty. [Note: The Arabic text description of Ashari view here is theological and complex, translation is literal].\nIssue Seven: Is the disbeliever blessed (recipient of Ni'mah) or not? The Maturidiyyah see that the disbeliever is blessed, but this blessing occurred in the world only. The Ash'aris see that the disbeliever is not blessed neither in religion nor in the world nor in the Hereafter (1).",
    "foot_note": "1. Ta'wilat Ahl Al-Sunnah: 1/ 160 - 169, See Al-Manhal Al-Sayyal Al-Dafi' li-ma Nasha'a min Khilaf bayn Al-Ash'ari wa Al-Maturidiyyah min Al-Ishkal by Abdul Hafiz bin Ali Al-Maliki Al-Sa'idi Al-Azhari.",
    "book_id": "64"
  },
  {
    "serial_number": "281824",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Conclusion\nSummary of Doctrinal Issues in which the Maturidiyyah opposed the Salaf\nAfter this brief study; the most important issues in which the Maturidiyyah opposed the creed of the Salaf are as follows:\n1 - The disagreement of the Maturidiyyah in the concept of Tawhid, as for them it means that Allah is One in His Essence having no divider or part, One in His Attributes having no like, and One in His Actions having no partner.\n2 - The Maturidiyyah relied in proving the existence of Allah Almighty on the proof of the temporal origination of accidents and bodies.\n3 - The Maturidiyyah infer the Oneness of Allah Almighty by His saying Mighty and Majestic: {Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe} [Al-Anbiya: 22], which is called the Proof of Mutual Prevention. The Salaf faulted them in this concept, while acknowledging that the Proof of Mutual Prevention is correct in its indication of the impossibility of the world emanating from two gods, but this is not what is intended by the noble verse.\n4 - The Maturidiyyah affirm all Beautiful Names due to the indication of Hearing (Revelation) for them, but they exceeded bounds in affirmation and the indication of names due to not differentiating between what came in the chapter of Naming and what came in the chapter of Informing about Allah. The indication of the Name for them is the Essence and this is specific to the name \"Allah\" only. As for other than it, its indication is taken by them from the attributes they affirmed, so they did not stop at what was established by Hearing only.\n5 - The Maturidis stopped in the chapter of Attributes at affirming some attributes but not others. They affirmed of attributes: Power, Knowledge, Life, Will, Hearing, Sight, Speech, Takwin, due to the indication of reason for them according to them.\n6 - The Maturidiyyah negated all Informative Attributes established by the Book and Sunnah, because in affirming them - according to their claim - is opposition to reason which sees in affirming them what calls to describing Allah Almighty with Likening and Anthropomorphism.\n7 - The Maturidiyyah negated the Voluntary Attributes of Allah Almighty which are the active attributes necessitated for Allah Almighty, because they also lead to Likening and Anthropomorphism.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281825",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "8 - The Maturidiyyah went to say that the Speech of Allah Almighty is one pre-eternal meaning, having no connection to Allah Almighty's Will and Power, and that it is not with letter and voice, but rather it is Psychological Speech not heard, but what is heard of it is only an expression of it.\n9 - The Maturidiyyah restricted the proof of the truthfulness of Prophets to the appearance of miracles at their hands, because they yield certain knowledge alone according to their claim.\n10 - The Maturidiyyah see that all issues related to the Last Day are not known except by Hearing. The Salaf oppose them in this, and say: Those issues were known by Hearing and indicated by Reason as well.\n11 - The Maturidis affirmed the Vision of Allah Almighty, but they negated direction and facing. In their saying is contradiction and inconsistency in their concept of Vision, leading to affirming what cannot be seen, and to negating the direction of Absolute Highness established for Allah Almighty.\n12 - The Salaf considered what the Maturidiyyah went to regarding the creation of servants' actions as a wrong belief due to containing affirmation of a will for servants independent of Allah Almighty's Will, and that Allah's creation of their actions is only a consequence of their uncreated will. The Salaf believe that to Allah Almighty alone belongs the Will and that servants have a will that does not exit Allah Almighty's Will.\n13 - The Maturidiyyah went to say that Faith is Assent by the heart only, and some said: It is Assent by the heart and Confession by the tongue. They forbade its increase and decrease, prohibited Exception in it, and prohibited differentiating between the concept of Faith and Islam.\n14 - The Maturidiyyah see that the Fasiq (sinner) is a believer with complete faith.\nI ask Allah Almighty to show us the Truth as Truth and grant us following it, and show us Falsehood as Falsehood and grant us avoiding it. And Allah knows best, and may Allah bless and grant peace to our Prophet Muhammad and his family and companions.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281826",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "Index of References\n1 - Ithaf Al-Sadah Al-Muttaqin bi Sharh Ihya' Ulum Al-Din, by Al-Zabidi, Dar Al-Fikr edition, Beirut.\n2 - Irshad Al-Aql Al-Salim ila Mazaya Al-Quran Al-Karim by Abu Al-Saud: 1st ed., Dar Ihya' Al-Turath Al-Arabi, Beirut.\n3 - Isharat Al-Maram min Ibarat Al-Imam by Kamal Al-Din Ahmad Al-Bayadi Al-Hanafi, ed: Yusuf Abdul Razzaq, 1st ed., Al-Halabi, Cairo.\n4 - Usul Al-Din by Abu Al-Yusr Al-Bazdawi, edited by Dr. Hans Peter Linss, edition: Isa Al-Babi Al-Halabi Cairo 1383.\n5 - Usul Al-Din, Abdul Qahir Al-Baghdadi, Dar Al-Kutub Al-Ilmiyyah, Beirut, 1401.\n6 - I'lam Al-Muwaqqi'in, Ibn al-Qayyim, Maktabat Al-Kulliyat Al-Azhariyyah, Cairo, 1388.\n7 - Imam Ahl Al-Sunnah wal-Jama'ah, Abu Mansur Al-Maturidi wa Ara'uhu Al-Kalamiyyah, 1st ed., Maktabat Wahbah, Cairo.\n8 - Al-Ansab by Al-Sam'ani, Al-Maktabah Al-Ilmiyyah, Beirut.\n9 - Al-Insaf by Al-Baqillani, editing: Muhammad Zahid Al-Kawthari, 2nd ed., Mu'assasat Al-Khanji, Cairo.\n10 - Al-Bahr Al-Ra'iq Sharh Kanz Al-Daqa'iq by Ibn Nujaym Al-Misri.\n11 - Bahr Al-Kalam by Abu Al-Mu'in Al-Nasafi, Al-Kurdi Press, Cairo, 1911 AD.\n12 - Bayan Talbis Al-Jahmiyyah by Sheikh Al-Islam Ibn Taymiyyah, 1st ed., Government Press, Mecca.\n13 - Tarikh Al-Madhahib Al-Islamiyyah by Muhammad Abu Zahra, Dar Al-Fikr Al-Arabi, Cairo.\n14 - Ta'wilat Ahl Al-Sunnah by Abu Mansur Al-Maturidi, ed: Dr. Ibrahim Awadain and Al-Sayyid Awadain, Supreme Council for Islamic Affairs, Cairo.\n15 - Tabsirat Al-Adilla by Abu Al-Mu'in Al-Nasafi, editing: Claude Salamah [Correction: Name in text is 'Out' probably Salamah].\n16 - Al-Tabsir fi Al-Din by Abu Al-Muzaffar Al-Isfarayini, 1st ed., ed: Izzat Al-Attar, Cairo.\n17 - Al-Tahrir fi Usul Al-Fiqh by Ibn Al-Humam, Al-Halabi edition, Cairo, 1351.\n18 - Al-Tadmuriyyah by Ibn Taymiyyah, ed: Muhammad bin Ouda Al-Sa'wi, 1st ed., Dar Al-Ubeikan, Riyadh.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281827",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "19 - Al-Ta'rifat by Al-Jurjani, editing: Ibrahim Al-Abyari, 1st ed., Dar Al-Kitab Al-Arabi, Beirut.\n20 - Ta'lim Al-Muta'allim Turuq Al-Ta'allum, Burhan Al-Din Al-Zarnuji, ed: Marwan Qabbani, 1st ed., Al-Maktab Al-Islami.\n21 - Tafsir Al-Nasafi, Al-Halabi edition, Cairo.\n22 - Al-Tamhid fi Usul Al-Din by Abu Al-Mu'in Al-Nasafi, ed: Abdul Hayy Qabil, Dar Al-Thaqafa for Publishing and Distribution, Cairo.\n23 - Al-Tamhid by Al-Baqillani, ed: McCarthy, Al-Maktabah Al-Sharqiyyah, Beirut.\n24 - Taysir Al-Tahrir by Amir Badshah, Al-Halabi edition, Cairo.\n25 - Jami' Al-Mutun fi Haqq Anwa' Al-Sifat Al-Ilahiyyah wa Al-Aqa'id Al-Maturidiyyah, Ahmad Diya' Al-Din bin Mustafa, 1st ed., Dar Al-Tiba'ah Al-Amirah, Istanbul.\n26 - Hashiyat Al-Isam 'ala Sharh Al-Aqa'id Al-Nasafiyyah, 1st ed., Dar Al-Tiba'ah Al-Amirah, Istanbul.\n27 - Al-Hikmah wa Al-Ta'lil fi Af'al Allah Ta'ala by Muhammad bin Rabi' bin Hadi Al-Madkhali, 1st ed., Maktabat Lina, Damanhur, Egypt.\n28 - Al-Hawashi Al-Bahiyyah 'ala Al-Aqa'id Al-Nasafiyyah, Kurdistan Scientific Press, Cairo, 1329.\n29 - Dar' Ta'arud Al-Aql wa Al-Naql by Sheikh Al-Islam Ibn Taymiyyah, ed: Muhammad Rashad Salim, 1st ed., Imam Muhammad bin Saud University.\n30 - Risalah fi Ithbat Al-istiwa' wa Al-Fawqiyyah wa Mas'alat Al-Harf wa Al-Sawt fi Al-Quran by Al-Juwayni, printed within Majmu'at Al-Rasa'il Al-Muniriyyah.\n31 - Ruh Al-Ma'ani fi Tafsir Al-Quran Al-Azim wa Al-Sab' Al-Mathani by Mahmoud Al-Alusi, Dar Ihya' Al-Turath Al-Arabi, Beirut.\n32 - Al-Rawdah Al-Bahiyyah fi-ma bayna Al-Asha'irah wa Al-Maturidiyyah, Al-Hasan bin Abdul Muhsin Abu Udhbah, 1st ed., Nizamiyyah Encyclopedia Circle, Hyderabad, Deccan, India.\n33 - Salam Al-Ahkam 'ala Sawad Al-A'zam, Ibrahim Hilmi bin Hussein Al-Wafi, 1st ed., Istanbul.\n34 - Sharh Al-Asfahaniyyah by Sheikh Al-Islam Ibn Taymiyyah, introduction by Hasanayn Makhluf, Dar Al-Kutub Al-Hadithah, Cairo.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281828",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "35 - Sharh Al-Usul Al-Khamsa by Qadi Abdul Jabbar Al-Hamadhani, ed: Abdul Karim Uthman, 1st ed., Maktabat Wahbah, Egypt.\n36 - Sharh Al-Aqa'id Al-Nasafiyyah, Sa'd Al-Din Al-Taftazani, Istanbul edition.\n37 - Sharh Al-Aqidah Al-Tahawiyyah by Ibn Abi Al-Izz Al-Hanafi, ed: Abdullah Al-Turki, and Shu'aib Al-Arna'ut, Mu'assasat Al-Risalah.\n38 - Sharh Al-Fiqh Al-Akbar, by Mulla Ali Al-Qari, 1st ed., Al-Halabi, Cairo.\n39 - Sharh Al-Maqasid fi Ilm Al-Kalam, Sa'd Al-Din Al-Taftazani, Nu'maniyyah Encyclopedia Circle, Lahore, Pakistan.\n40 - Sharh Al-Manar by Abu Al-Barakat Al-Nasafi and its Footnotes on the Science of Usul, by Abdul Latif Al-Malik, Dar Sa'adat, Istanbul.\n41 - Sharh Al-Mawaqif by Al-Jurjani, Al-Sa'adah Press, Cairo.\n42 - Sharh Kitab Al-Tawhid min Sahih Al-Bukhari by Sheikh Abdullah Al-Ghunayman, 1st ed.\n43 - Shifa' Al-Alil, by Ibn al-Qayyim, 1st ed., Al-Husseiniyyah Egyptian Press, Cairo.\n44 - Sahih Al-Bukhari printed with Fath Al-Bari, Al-Salafiyyah Press, Cairo.\n45 - Daw' Al-Ma'ali Sharh Bad' Al-Amali by Mulla Ali Al-Qari, 1st ed., Al-Amirah Press, Istanbul.\n46 - Tabaqat Al-Shafi'iyyah Al-Kubra by Taj Al-Din Al-Subki, ed: Mahmoud Al-Tanahi, and Abdul Fattah Al-Hilw, Al-Halabi edition, Cairo.\n47 - Ada' Al-Maturidiyyah lil-Aqidah Al-Salafiyyah wa Mawqifuhum min Al-Asma' wa Al-Sifat by Shams Al-Salafi Al-Afghani.\n48 - Aqidat Al-Islam wa Al-Imam Al-Maturidi, Dr. Muhammad Ayub Ali, 1st ed., Islamic Foundation, Bangladesh.\n49 - Umdat Al-Qari Sharh Sahih Al-Bukhari, by Badr Al-Din Al-Ayni, 1st ed., Al-Halabi, Cairo.\n50 - Fath Al-Ghaffar bi Sharh Al-Manar by Ibn Nujaym Al-Hanafi, 1st ed., Al-Halabi, Cairo.\n51 - Al-Farq bayn Al-Firaq by Abdul Qahir Al-Baghdadi, ed: Muhammad Muhyi Al-Din, Dar Al-Ma'rifah.\n52 - Firaq Mu'asirah by Ghalib Awaji, Maktabat Lina.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281829",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "53 - Al-Fawa'id Al-Bahiyyah fi Tarajim Al-Hanafiyyah, Muhammad Abdul Hayy Al-Lucknawi, 1st ed., Al-Sa'adah Press, Cairo.\n54 - Fayd Al-Bari 'ala Sahih Al-Bukhari by Anwar Shah Al-Kashmiri Al-Deobandi, Dar Al-Ma'rifah, Beirut.\n55 - Al-Qada' wa Al-Qadar fi Daw' Al-Kitab wa Al-Sunnah by Sheikh Abdul Rahman Al-Mahmoud, 1st ed., Dar Taybah, Riyadh.\n56 - Kitab Al-Tawhid by Abu Mansur Al-Maturidi, ed: Fath Allah Khulayf, Al-Mashriq, Beirut.\n57 - Al-Luma' fi Al-Radd 'ala Ahl Al-Zaygh wa Al-Bida' by Abu Al-Hasan Al-Ash'ari, ed: Hamoud Gharabah, Islamic Research Academy, Cairo.\n58 - Al-Lum'ah fi Tahqiq Mabahith Al-Wujud wa Al-Huduth wa Al-Qudrah wa Af'al Al-Ibad by Ibrahim Al-Halabi, 1st ed., Publisher Izzat Al-Attar, Cairo.\n59 - Al-Maturidiyyah Dirasah wa Taqwiman by Ahmad bin Awad bin Dakhil Al-Luhaybi Al-Harbi, 2nd ed., Dar Al-Sumay'i, Riyadh.\n60 - Al-Mubin fi Sharh Alfaz Al-Hukama' wa Al-Mutakallimin by Al-Amidi, ed: Abdul Amir Al-A'sam, 1st ed., Dar Al-Manahil, Beirut.\n61 - Majmu' Al-Fatawa by Sheikh Al-Islam Ibn Taymiyyah, collection and arrangement: Abdul Rahman bin Qasim, 1st ed.\n62 - Muhassal Afkar Al-Mutaqaddimin wa Al-Muta'akhkhirin by Fakhr Al-Din Al-Razi, Dar Al-Kitab Al-Arabi, Beirut.\n63 - Madarij Al-Salikin by Ibn al-Qayyim, ed: Muhammad Hamid Al-Fiqi, Al-Sunnah Al-Muhammadiyyah Press, Cairo.\n64 - Madarik Al-Tanzil wa Haqa'iq Al-Ta'wil by Hafiz Al-Din Al-Nasafi, Dar Al-Kitab Al-Arabi, Beirut.\n65 - Al-Marakishiyyah by Ibn Taymiyyah, ed: Nasir Al-Rashid and Rida bin Nu'san, Dar Taybah.\n66 - Al-Musamarah Sharh Al-Musayarah by Kamal bin Abi Sharif, 1st ed., Bulaq.\n67 - Al-Musayarah by Ibn Al-Humam with its explanation by Qasim bin Qutlubugha, ed: Muhammad Muhyi Al-Din, Al-Sa'adah Press, Cairo.\n68 - Al-Mustasfa by Abu Hamid Al-Ghazali, 1st ed., Bulaq.\n69 - Al-Matalib Al-Aliyah by Al-Razi, ed: Ahmad Hijazi Al-Saqqa, 1st ed., Dar Al-Kitab Al-Arabi, Beirut.\n70 - Ma'arij Al-Qabul by Sheikh Hafiz Al-Hakami, Jama'at Ihya' Al-Turath edition, Egypt.\n71 - Maqalat Al-Islamiyyin wa Ikhtilaf Al-Musallin by Abu Al-Hasan Al-Ash'ari, 3rd ed., Ritter correction.\n72 - Al-Milal wa Al-Nihal by Al-Shahrastani, 1st ed., Nasir Foundation for Culture, Beirut.\n73 - Minhaj Al-Sunnah by Sheikh Al-Islam Ibn Taymiyyah, ed: Muhammad Rashad Salim, 1st ed., Imam Muhammad bin Saud University.",
    "foot_note": "None",
    "book_id": "64"
  },
  {
    "serial_number": "281830",
    "category_id": "2",
    "category": "Sects and Refutations",
    "book_title": "Al-Maturidiyyah",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "74 - Al-Manhal Al-Sayyal Al-Dafi' li-ma Nasha'a min Khilaf bayn Al-Ash'ari wa Al-Maturidiyyah min Al-Ishkal by Abdul Hafiz bin Ali Al-Maliki Al-Sa'idi Al-Azhari.\n75 - Al-Mawsu'ah Al-Muyassarah fi Al-Adyan wa Al-Madhahib Al-Mu'asirah, World Assembly of Muslim Youth, 2nd ed.\n76 - Mawqif Ibn Taymiyyah min Al-Asha'irah by Sheikh Abdul Rahman Al-Mahmoud, 1st ed., Dar Al-Rushd, Riyadh.\n77 - Mizan Al-I'tidal by Al-Hafiz Al-Dhahabi, ed: Ali Al-Bijawi, Al-Halabi edition, Cairo.\n78 - Al-Nafi' Al-Kabir Muqaddimat Al-Jami' Al-Saghir by Abu Al-Hasanat Al-Lucknawi, within the collection of the six epistles, 1st ed.\n79 - Al-Nibras by Abdul Aziz Al-Hindi Al-Farhari, Peshawar edition, Pakistan.\n80 - Al-Nubuwwat by Sheikh Al-Islam Ibn Taymiyyah, Dar Al-Kutub Al-Ilmiyyah, Beirut.\n81 - Nashr Al-Tawali' by Al-Mar'ashi, Al-Ulum Al-Asriyyah Library, Egypt.\n82 - Nazm Al-Fara'id wa Jam' Al-Fawa'id, Abdul Rahim Ali Sheikh Zadah, Literary Press, Cairo.\n83 - Al-Nur Al-Lami' wa Al-Burhan Al-Sati' fi Sharh Aqa'id Ahl Al-Sunnah wal-Jama'ah, by Manku Bars bin Yalqilij Al-Nasiri.",
    "foot_note": "None",
    "book_id": "64"
  }
]