[
  {
    "text": "Islam is the Religion of Moderation, Virtues, and Eternal Values\nAuthor: عبد السلام الهراس\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8364\nbook_title: الإسلام دين الوسطية والفضائل والقيم الخالدة\nbook_link: https://shamela.ws/book/1119\nbook_id: 1119\nauthor_name: عبد السلام الهراس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1796\nauthor_ID: 1796\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 52\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7483047",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: Islam is the Religion of Moderation, Virtues, and Eternal Values. Author: Abd al-Salam al-Harras. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (Paper Book): 34 [The book is automatically numbered and does not match the printed version]. Number of Pages: 52. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Islam is the Religion of Moderation, Virtues, and Eternal Values. Author: Abd al-Salam al-Harras. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (Paper Book): 34 [The book is automatically numbered and does not match the printed version]. Number of Pages: 52. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abd al-Salam al-Harras. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (Paper Book): 34 [The book is automatically numbered and does not match the printed version]. Number of Pages: 52. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages (Paper Book): 34 [The book is automatically numbered and does not match the printed version]. Number of Pages: 52. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered and does not match the printed version]. Number of Pages: 52. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 3
  },
  {
    "serial_number": "7483048",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 1,
    "volume_number": 1,
    "text": "Islam is the Religion of Moderation, Virtues, and Eternal Values. Prepared by Prof. Dr. Abd al-Salam al-Harras, Fes - Morocco. In the name of Allah, the Most Gracious, the Most Merciful. Islam is the Religion of Moderation, Virtues, and Eternal Values. This topic has been addressed by a number of researchers and preachers to the extent that writing about it has become akin to repetition and regurgitation. Nevertheless, I was inclined to address it without feeling compelled to review previous writings, which vary between three levels: the excellent, the good, and the less than good. It is well known that the Holy Quran described the Islamic nation as 'middle' (moderate/just) in the Almighty's saying: {And thus we have made you a just community that you will be witnesses over the people and the Messenger will be a witness over you.} (1)",
    "foot_note": "1. (1) Al-Baqarah: 143.",
    "book_id": "1119",
    "new_page_number": 4
  },
  {
    "serial_number": "7483049",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "The meaning of 'Middle' (Wasat) as interpreted by the Quran in another verse is 'The Best' (Khayriyyah): The Almighty said: {You are the best nation produced [as an example] for mankind.} (1) In the language: The 'middle' of the pasture is its best part; the 'middle' of a thing is its best and most just part; and the 'middle' of the necklace (Wasitat al-Qiladah) is the jewel that is in its center (2), which is its most precious gem. In *Al-Sahah*: \"The middle of the necklace is the jewel that is in its center, and it is the finest of them.\" The Imam interpreted it as meaning the best of religions, and 'so-and-so is from the middle of his people' means their best, most noble, and finest. From this, the 'Middle Prayer' was named because it is the best of prayers and the greatest in reward, which is why it was singled out for maintenance. The Prophet (peace be upon him) was described as being from the 'middle' of his people. Ibn al-Rumi mourned his best son saying: 'Death aimed at the middle of my children ... By God, how it chose the jewel of the necklace.' Islam is built upon goodness, justice, benevolence, kindness, trustworthiness, truthfulness, chastity, integrity of the heart, sovereignty of reason, responsible freedom, respect for the other, humility, mercy, integrity, and modesty, among other values that are worthy of emulation.",
    "foot_note": "1. (1) Al-Imran: 110. \n2. Al-Sahah (3 / 1167), entry (Wasat).",
    "book_id": "1119",
    "new_page_number": 5
  },
  {
    "serial_number": "7483050",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "The Islamic nation was addressed with great Quranic verses defining its mission under Islam in the Almighty's saying: {You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah} (1). It is as if He said: \"You are the best nation in existence now because corruption has prevailed over all nations, so what is right is not known in them, nor is what is wrong forbidden, and they do not possess the faith that restrains its people from evil and directs them to good. Whereas you enjoin what is right and forbid what is wrong, and you believe in Allah with a true faith that reflects its effect in action, and thus 'Kan' (to be) is complete/perfect here.\" It was also said it is incomplete/past tense: \"Meaning you were in God's knowledge and in the Preserved Tablet, or you were in the previous nations as found in their books prophesying you as the best nation produced for mankind.\" Whatever the estimation, the nation of Muhammad is the best nation produced for mankind, and it deserved this superiority through the three mentioned merits: enjoining the good, forbidding the evil, continuing in faith in Allah, and holding fast all together to the rope of Allah. (2)",
    "foot_note": "1. (1) Al-Imran Verse 110. \n2. Al-Manar - 57 / 4 58.",
    "book_id": "1119",
    "new_page_number": 6
  },
  {
    "serial_number": "7483051",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "If this nation holds this status and rank chosen for it by Allah Almighty, then it must realize this within itself and its soul, as stated in the Almighty's saying: {And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.} (1) This expression is more beautiful and fulfilling of the intent, just as you say: 'Let me have a friend in you.' It implies an urging for action, exertion of effort, and excellence in following, so that the community of believers in this religion deserves to attain the honor of that status and rank before being granted power. This is done by calling to good, enjoining right, and forbidding wrong within its own circle, exchanging counsel of truth and patience among themselves. And after being granted power, [it continues] in carrying out its mission within its society, maintaining the three characteristics that qualified it to be the nation of good calling to good. Is there any good greater than Islam? {Indeed, the religion in the sight of Allah is Islam} (2), {And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers} (3). It is the religion that Allah is pleased with for us and commanded us to hold fast to and not die except...",
    "foot_note": "1. (1) Al-Imran: 104. \n2. Al-Imran: 19. \n3. Al-Imran: 85.",
    "book_id": "1119",
    "new_page_number": 7
  },
  {
    "serial_number": "7483052",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "...while we are Muslims. However, the mission of enjoining good and forbidding evil after being granted power, and even more so before it, must be with wisdom, good instruction, and arguing in the best way. For the slogan of Islam in its call is: {There is no compulsion in religion}. I was pleased with a statement in *Al-Manar* explaining that enjoining good and forbidding evil does not mean drawing the sword and raising the whip to coerce people into entering Islam on the grounds that it is the most known of good deeds, or to make them quit disbelief on the grounds that it is the most denounced of evil deeds. The author of *Al-Manar* says: \"This saying is false, built upon unstable foundations... Among them: that compulsion in religion is negated in Islam by the text of the Quran, and the Messenger (peace be upon him) did not fight anyone from the Arabs or others for the sake of coercion into Islam; rather, he fought in defense. How could he attempt coercion when Allah Almighty says: {So would you compel the people in order that they become believers?} (1). He distinguished between enjoining good/forbidding evil and the obligation of changing evil, and clarified that the mission of that is not calling to Islam and forcing it [upon people].",
    "foot_note": "1. (1) Yunus: 99.",
    "book_id": "1119",
    "new_page_number": 8
  },
  {
    "serial_number": "7483053",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "The statement of Al-Qaffal, quoted by Al-Razi, contradicts His saying - the Almighty - in Surah Al-Hajj describing the believers after they were permitted to fight those who aggressed against them: {Those who, if We establish them in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong} (1). So, the Almighty made enjoining good and forbidding evil one of their descriptions after being established in the land, and that is not done through Jihad [warfare], but after it (2). One of the most beautiful and greatest things mentioned in this verse, as previously indicated, is the glad tidings of the goodness of this nation, provided that it strives against itself for faith in the truth, acting upon it, walking in its guidance, and calling to it with wisdom, good instruction, and everything that is good and best, and having patience in that. This implies searching for the most successful means, the most beautiful paths, the most effective methods, and the most upright discourse presented through good example and benevolent role models, bringing good tidings of good and encouraging it. And 'Good' is: \"What is desired by all, such as intellect, justice, virtue, and useful things; it is an absolute good desired by everyone and for everyone\" (3).",
    "foot_note": "1. (1) Al-Hajj: 41. \n2. Al-Manar 4 / 61 - 62. \n3. Mufradat al-Raghib.",
    "book_id": "1119",
    "new_page_number": 9
  },
  {
    "serial_number": "7483054",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "Allah has described the groups of Muslims and their individuals as being 'the successful ones' (Al-Muflihoon) specifically and emphatically, and they have high ranks due to the use of the demonstrative pronoun \"those\" (Ula'ika), because they invite to good, enjoin every right, and forbid every wrong. If this is achieved by them, they are the \"Middle Nation\" and the \"Nation of Witness\" over all people, and the Messenger (peace be upon him) will be a witness over them. Thus, we see these three verses are consistent, one following the other: The first explains that this nation was the best nation brought forth for people in God's knowledge or in the Preserved Tablet. The second: That this nation must work and make of itself what is required of it: {And let there be [arising] from you a nation inviting to [all that is] good} (1). The fruit of that is its entitlement to be the nation of witness over people. It does not deserve that unless the conditions of witnessing are realized in it, the most important of which are: Knowledge, Justice, Integrity on the Straight Path, and all eternal values, lofty morals, and praiseworthy traits expressed by the Holy Quran with miraculous brevity: \"With the Middle (Wasat),\" which is justice, choice, and high status achieved by its inclusion of all human rights, its good balance between matter and spirit, and its freedom or innocence from excess there and negligence here, and extremism...",
    "foot_note": "1. (1) Al-Imran: 104.",
    "book_id": "1119",
    "new_page_number": 10
  },
  {
    "serial_number": "7483055",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "...there and shortcoming here (1). The Messenger (peace be upon him) is the witness over his nation which Allah Almighty honored with moderation (Wasatiyyah) because he is the perfect example of the middle rank. This nation is only 'middle' by following him (peace be upon him) in his biography and his law... As if Allah is saying: The description of 'Middle' is only realized for you if you maintain action upon the guidance of the Messenger (peace be upon him) and remain upright on his Sunnah (2). This moderation is what is mentioned in Al-Fatiha as the \"Straight Path\" which Allah commanded us to recite in every prayer as it is the Mother of the Book. Among the characteristics of this Straight Path is that it leads to the noble goal, and it alone does so, unlike other twisted, crooked, deviant, difficult paths, or those full of potholes and unevenness. It is a path familiarized by those walking to Allah among those upon whom He has bestowed favor, not those who have evoked [His] anger—those who knew the truth and opposed it—nor of those who are astray—those who were ignorant of the truth and strove in their ignorance and persisted in their error. So the Middle Nation is between these two extremes that deviate from the truth.",
    "foot_note": "1. (1) See Tafsir Abi Al-Saud 204 / 1 Dar Al-Fikr. \n2. See Tafsir Al-Manar 1 / 4 - 5.",
    "book_id": "1119",
    "new_page_number": 11
  },
  {
    "serial_number": "7483056",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "The Holy Quran expressed this moderation as a blessed olive tree, neither of the east nor of the west, whose oil would almost glow even if untouched by fire; light upon light, Allah guides to His light whom He wills. It is the white clear path, its night is like its day, from which no one deviates except he who is doomed, as stated in the Noble Hadith. Just as Allah made the Islamic nation a 'middle' among nations, He made its Qibla (direction of prayer) a 'middle' among directions, and He Almighty guided it to it and called it the Straight Path, saying: {To Allah belongs the east and the west. He guides whom He wills to a straight path} (1). Thus, it is a middle nation in the Qibla of prayer, i.e., in directions, just as He made it middle among nations (2).",
    "foot_note": "1. (1) Al-Baqarah: 142. \n2. Bada'i' al-Fawa'id by Ibn al-Qayyim al-Jawziyya 1 / 158 - 159. See also the book 'The Kaaba is the Center of the World' p. 148, 204 by Dr. Saad al-Marsaifi, Al-Manar Islamic Library and Al-Rayyan Foundation for Printing, Publishing and Distribution, Beirut, Lebanon, 1421 AH / 2000 AD.",
    "book_id": "1119",
    "new_page_number": 12
  },
  {
    "serial_number": "7483057",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "Among the manifestations of this moderation: Honoring the Human Being",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 13
  },
  {
    "serial_number": "7483058",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "{And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.} (1) For Allah created him with His Hand, breathed into him from His Spirit, made His angels prostrate to him in a prostration of honor, taught him all the names, created for him a mate from himself, placed affection and mercy between them, and dwelled them in His Paradise. He left them complete freedom to enjoy eating from it wherever they willed abundantly, except that this freedom had limits. So Allah forbade them from approaching one specific tree pointed out to emphasize the warning due to the bad consequence of the sin of eating from it for them. However, they weakened before the temptation of Satan, so he caused them to slip from what they were in, and He brought them down to the earth where Allah decreed that Adam and his descendants would be successors (Khalifah), as Allah told His angels before his creation saying: {And when your Lord said to the angels, \"Indeed, I will make upon the earth a successor.\"} (2). He did not leave him to himself, nor did He close the door of His mercy or the blessing of His repentance regarding his forgetfulness that weakened his resolve. Rather, He inspired him with \"Istighfar\" (seeking forgiveness) and the worship of repentance: {Then Adam received from his Lord [some] words, and He accepted his repentance.} (3) And He clarified to him the path of guidance and the way of success, and warned him...",
    "foot_note": "1. (1) Al-Isra: 70. \n2. Al-Baqarah: 30. \n3. Al-Baqarah: 37.",
    "book_id": "1119",
    "new_page_number": 14
  },
  {
    "serial_number": "7483059",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "...against the trial of that one who refused to obey his Lord by prostrating to him with the angels, out of envy from himself, arrogance, and delusion. He saw himself as more deserving of this honor because Allah created him from fire, while Adam was created from clay. Thus, Adam escaped the sin he committed, so his back was no longer burdened by it, nor did he bequeath it to his offspring after him. The children of Adam became free from what their father committed by Allah's acceptance of his repentance.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 15
  },
  {
    "serial_number": "7483060",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "Thus, Adam and his sons became in connection with their Lord without a human or non-human intermediary, so that he does not fall into exploitation, nor expose himself to the violation of his secrets and the distortion of his honor. Whenever he commits a bad deed, he has only to hasten to repentance and turning back, and he will find Allah Accepting of Repentance and Merciful: {And when My servants ask you concerning Me, indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided.} (1) Indeed, some bad deeds are changed by the Generous, the Forgiving, the Accepter of Repentance, the Forbearing into good deeds: {Allah will change their sins into good deeds, and ever is Allah Forgiving and Merciful.} (2). Islam has encouraged repentance in the Book and the Sunnah with various incentives, leaving no room for despondency and despair of God's mercy, even if one comes with the most imaginable sins and transgressions, provided one does not associate partners with Allah: {Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills.} (3) By this, He opened the doors of good before the human being to return to the middle state between fear and hope with good opinion of his Lord, and to the Straight Path so that he may shade himself in the shadows of God's mercy and pardon, and derive his true and correct knowledge of his Lord. Then he enjoys the Good Word in his life, which is...",
    "foot_note": "1. (1) Al-Baqarah: 186. \n2. Al-Furqan: 70. \n3. An-Nisa: 48.",
    "book_id": "1119",
    "new_page_number": 16
  },
  {
    "serial_number": "7483061",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "...good entirely, like a good tree, its root is firmly fixed and its branch is in the sky, yielding its fruit at all times by permission of its Lord (1).",
    "foot_note": "1. (1) See: Tafsir Al-Razi, Al-Kashhaf, Ibn Kathir, Adwa' Al-Bayan, and others.",
    "book_id": "1119",
    "new_page_number": 17
  },
  {
    "serial_number": "7483062",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "Repentance is one of the characteristics of moderation in Islam. It leaves the door open for the servant to renew his connection with his Lord without intermediary or brokerage, and without despair or cutting off hope leading the sinner and the committer of evil deeds to persist in his stubbornness and error. This is because Allah Almighty honored the children of Adam by creating them upon the Fitrah (natural disposition). No matter what impurities, turbidity, and veils affect it, the depth remains sound. Therefore, the Almighty said, addressing the believer: {Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.} {But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].} (1). For man is good in his depths, possessing a readiness for affection and tolerance and connecting what was severed, but he needs to be addressed, treated, and his stubbornness and persistence in enmity countered with what is better, which can penetrate those veils to touch the Fitrah upon which Allah created him, so his enmity turns into intimate friendship and close bond. Unlike Satan, who is pure evil by nature and does not accept a bribe, so nothing works with him except seeking refuge in Allah. Among the manifestations of moderation is Allah honoring man with the doctrine of Monotheism (Tawhid), which is characterized by rational and spiritual balance; there is no denial of divinity...",
    "foot_note": "1. (1) Fussilat: 34-35.",
    "book_id": "1119",
    "new_page_number": 18
  },
  {
    "serial_number": "7483063",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "...nor exaggeration in it nor idolatry. Monotheism is a doctrine innocent of negligence and excess, and of extremism away from the Straight Path to the right or left: {And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way.} Among God's honoring of man is the right to life. Whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely. And whoever saves one - it is as if he had saved mankind entirely. But if he takes a life intentionally, then it is a life for a life, and in the Hereafter, he is eternal in the Fire. Also among Islam's honoring of man is the declaration of the principle of liberating slaves through manumission, which counts as a door of drawing close to Allah, and through financial penalties like certain expiations. The master in Islam does not own the humanity of his slave, but owns his neck, i.e., his work and service. As for his humanity, no. If he is permitted to discipline him, it must not exceed ten strikes, just as he disciplines his family (1). If he mutilates his slave, he [the slave] becomes free against him [the master], and this is the school of the Hadith jurists. And if a man forces his slave or the female slave of another into immorality, they become free against him, and he guarantees to the other for his female slave with a similar one (2).",
    "foot_note": "1. (1) I'lam al-Muwaqqi'in 49 / 2. \n2. Ibid 46 / 2.",
    "book_id": "1119",
    "new_page_number": 19
  },
  {
    "serial_number": "7483064",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "It is not known in the history of Islamic conquests that they exterminated peoples as other nations did in order to replace them with Muslims, or enslaved peoples as others did through invasion and aggression, bringing them to new colonies and selling them in markets like livestock to exploit them in the most hideous exploitation. Rather, peoples used to convert to Islam voluntarily. Those who refused lived according to their religion, as we see in many Arab lands and others such as the Levant: \"Syria, Lebanon, Jordan, Palestine, Iraq, Egypt, and the Jews in the Maghreb and Sudan.\" As for India, Persia, Andalusia, and others, the Islamic conquest also recognized the other and did not force anyone to enter Islam. Whereas when the Christian kings of the Peninsula won, they conspired to exterminate the Muslims, burn their books and heritage, and turn their mosques into churches. Not a single book remained in Spain from the millions of books authored, acquired, copied, and produced by the scholars, stationers, and scribes of Andalusia... As for the books in the Escorial Library, they are of Moroccan origin, pirated by a French corsair, then taken by the Spanish who placed them in the Escorial Monastery, and most of them were destroyed by burning and other means!!",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 20
  },
  {
    "serial_number": "7483065",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "Were it not for the Islamic conquest in Andalusia, the Jews, who were subjected from time to time to calamities and woes by the kings of the Peninsula before the Islamic conquest, would have been eradicated. Under Islam, they attained rights, favor, and scientific, social, and political status that none of them denies. As for the Muslims, they are still being exterminated to this day; Bosnia and Chechnya are examples of that.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 21
  },
  {
    "serial_number": "7483066",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "From the moderation of Islam: Making its greeting \"Peace\" (Salaam), and its relations with others: Peace: {And if they incline to peace, then incline to it}. And kindness to everyone who does not fight us, nor drive us out of our homes, nor aid an enemy against us; acting justly towards them is obligatory: {Indeed, Allah loves those who act justly}. And fulfilling covenants: {And fulfill the covenant of Allah when you have taken it} {And those who fulfill their promise when they promise} {And fulfill the covenant. Indeed, the covenant will be questioned} {So as long as they are upright toward you, be upright toward them} (1). Since Islam is the religion of the Middle, and among the meanings of that is Justice: Justice and equity are foundations of Islamic civilization, even with those who hate us: {And do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness}.",
    "foot_note": "1. (1) At-Tawbah: 7.",
    "book_id": "1119",
    "new_page_number": 22
  },
  {
    "serial_number": "7483067",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "The Quranic verses, Prophetic Hadiths, and practical applications are numerous, all demonstrating the greatness of the justice of this religion, which has remained strong due to it until now, despite the weakness and turmoil that has affected this pillar. The rule \"Justice is the basis of dominion\" is an Islamic rule. The Almighty says: {And when you judge between people to judge with justice} (1). He did not say 'and when you judge between Muslims', so justice is comprehensive for all. And the Almighty says: {Indeed, Allah orders justice and good conduct and giving to relatives and forbids immorality and bad conduct and oppression. He admonishes you that perhaps you will be reminded} (2). Ibn al-Qayyim says: \"The Sharia is built and founded upon wisdom and the interests of servants in livelihood and the Hereafter. It is all justice, all mercy, all benefit, and all wisdom. So any issue that departs from justice to injustice, from mercy to its opposite, from benefit to harm, and from wisdom to futility, is not from the Sharia, even if entered into it by interpretation (3). Therefore, injustice will be darknesses on the Day of Resurrection. Allah has forbidden injustice upon Himself as He forbade it upon creation, and made it obligatory for them not to oppress one another. The prayer of the oppressed is answered, even if this oppressed person is a disbeliever, for there is...",
    "foot_note": "1. (1) An-Nisa: 58. \n2. An-Nahl: 90. \n3. I'lam al-Muwaqqi'in 'an Rabb al-'Alamin 3 / 3.",
    "book_id": "1119",
    "new_page_number": 23
  },
  {
    "serial_number": "7483068",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "...no veil between it and Allah. Ibn Khaldun titled a chapter of his *Muqaddimah* saying: Chapter Forty-Three: 'Injustice signals the ruin of civilization' (1). He says after citing a story indicating the ruin of nations due to the prevalence of injustice: \"When injustice was, as you have seen, a signal for the cutting off of the species due to what it leads to of ruining civilization, the wisdom of banning it was present, so its prohibition was important. Its evidences from the Quran and Sunnah are many, more than can be captured by the law of limitation and enumeration (2).",
    "foot_note": "1. (1) Al-Muqaddimah p. 353, Dar Al-Fikr edition, Beirut. \n2. See his book: A Look at the Future of Humanity: Issues that Cannot Wait p. 87, translation by Dr. Mahmoud Ali Makki, Egyptian Society for the Dissemination of World Knowledge and Culture 1987, Cairo, Egypt.",
    "book_id": "1119",
    "new_page_number": 24
  },
  {
    "serial_number": "7483069",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "With this justice, Islamic civilization was able to preserve for the world a society of diverse cultures and religions, even ancient cultures that remained as witnesses to extinct civilizations like the Assyrian, Phoenician, Pharaonic, and other civilizations preceding Islamic civilization. Civilizational progress is not measured by the plumb line as George Sarton, the author of the *History of Science*, says (I believe), or as Professor Dr. Federico Mayor Zaragoza, the Spanish former Director-General of UNESCO, says, by material standards manifested in a consumer society and the satisfaction of its desires to the point of gluttony and succumbing to lethargy. The new standard for true progress is that which takes its axis from the moral values that must be present in a human being qua human being (1). Progress is not measured by the advancement of knowledge and its technical applications, for this progress has reached a massive level of inflation that burdens our shoulders and makes us forget serious awareness of the danger of the problems generated by it. Dr. Federico Zaragoza asks: Do we not see how scientific progress leads to the destruction of man? (2). He quotes some great thinkers who studied Western civilization saying: \"But the truth is that everything is going in a wrong way\" (3).",
    "foot_note": "1. (1) Ibid 356. \n2. Ibid 71. \n3. Ibid 70.",
    "book_id": "1119",
    "new_page_number": 25
  },
  {
    "serial_number": "7483070",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "The conclusion is that Western civilization, in the opinion of this great thinker who reinforces his ideas with many summaries of the thoughts of Western greats, has created a future where instead of man controlling progress, he has become a slave to it (1). The truth is that major thinkers are pessimistic about the outcome of this civilization. Dr. Zaragoza conveys this pessimism in his precious book, such as the statement of Mrs. Estefania Aldaba-Lim, who asks about the fate of moral values in a foolish consumer world: \"A world of destructive inventions, a complex world, a world where we see the efforts of scientists and inventors directed towards destroying human life instead of enabling him to survive (2). What Zaragoza says was said before by Spengler,\" and said by many contemporaries (3).",
    "foot_note": "1. (1) Ibid 70. \n2. Ibid 75. \n3. Ibid 87.",
    "book_id": "1119",
    "new_page_number": 26
  },
  {
    "serial_number": "7483071",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "An advanced society is characterized by many noble qualities that are absent from a consumer society (1). He sees that the difference in cultures is the true expression of the creative human... the wise human (2). Science that brings misery and consumer progress that causes regression is what the Messenger (peace be upon him) meant by 'knowledge that does not benefit' and 'a belly that is not satisfied', and what the Holy Quran said: {[It is] the promise of Allah. Allah does not fail in His promise, but most of the people do not know.} {They know what is apparent of the worldly life, but they, of the Hereafter, are unaware.} {Do they not reflect within themselves? Allah did not create the heavens and the earth and that between them except in truth and for a specified term. And indeed, many of the people, in [the matter of] the meeting with their Lord, are disbelievers.} {Have they not traveled through the land and observed how was the end of those before them? They were greater than them in power and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves.} (3).",
    "foot_note": "1. (1) See for example \"The Struggle for the Top\", p. 195, and others by Lester Thurow, translated by Ahmed Fouad Baligh - Alam Al-Ma'rifah 204. \n2. Ibid 89. \n3. Ar-Rum: 6-9.",
    "book_id": "1119",
    "new_page_number": 27
  },
  {
    "serial_number": "7483072",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "Connecting science and technology with moral values is the fundamental essence of Islamic moderation after the Oneness of God and belief in the Unseen. These values are called: Ethics (Akhlaq), Manners (Adab), and Purification of the Soul (Tazkiyah). Therefore, we see Islamic civilization's interest in the behavioral and educational aspect to elevate the level of the Muslim human in all aspects of his life and actions. Manners, as Ibn al-Qayyim says: \"Is the religion entirely\" (1). Ikrimah, the freed slave of Abdullah ibn Abbas, says: \"Everything has a foundation, and the foundation of Islam is good character\" (2). The reality of manners is the gathering of good traits; that is why the Messenger of Allah (peace be upon him) said: \"My Lord disciplined me and perfected my discipline.\" And his Lord said to him: {And indeed, you are of a great moral character.} The Messenger of Allah (peace be upon him) was sent only to perfect good moral character, as stated in the Noble Hadith. Manners are firstly with Allah, with the Messenger of Allah (peace be upon him), and with creation: humans, animals, plants, and inanimate objects. Therefore, the moderation of Islam stands out strongly in this great network of ethics and manners that surrounds the human being in all his states, at all his stations and levels, and various responsibilities. Just as the Muslim is surrounded by supplications and remembrances, all linked to reforming the inner self. The content of those values makes the Muslim...",
    "foot_note": "1. (1) Madarij al-Salikin 384 / 2. \n2. The Problem of Culture p. 81 by Professor Malek Bennabi - Dar Al-Fikr Al-Mu'asir - Beirut - Dar Al-Fikr - Damascus - 4th Edition - 1420 AH / 2000 AD.",
    "book_id": "1119",
    "new_page_number": 28
  },
  {
    "serial_number": "7483073",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "...balanced in his life, beneficial to his society and indeed to all humanity, and to the environment surrounding it. It makes him an element of happiness for himself and others. Let us take for example: dealing with neighbors, confronting ignorance and the ignorant, the right of the road, the right of water sources, the right of social facilities, the right of animals, the rights of parents and their friends, the right of a Muslim over a Muslim in various conditions and relationships, the right of kin even if they are disbelievers, the right of non-Muslim citizens, and even his right over himself, and the right of his family and children... There are also various voluntary acts and communal obligations (Fard Kifayah) that make the Muslim a righteous, useful member, contributing vitally to nourishing society with a culture of goodness, love, and peace. This culture is characterized—as long as it derives its teachings from its pure sources—by internal cohesion, comprehensiveness, vitality, and steady construction like the blessed tree.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 29
  },
  {
    "serial_number": "7483074",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "As for the prescribed supplications and remembrances, they always purify those spiritual and moral values and entrench the beautiful and righteous aspects in the upbringing of the Muslim human from his waking until his going to sleep, making him during that and after that a sound, healthy, and effective member of the best nation produced for mankind, and of the Middle Nation, embodying goodness, love, gentleness, and benefit for all circles he is responsible for. Thus, the Muslim is surrounded by everything that makes him truly represent the human of the eternal heavenly message. The Middle Nation is the nation of ethics, but which ethics? It is comprehensive civilizational ethics whose radiance covers the inside and the outside. It knows no racism, no bias, no double standards or multiple measures as happened in extinct civilizations and in contemporary racist societies like South Africa, and as is the reality now in most Western societies exposed by immoral practices that overcame the artificial character which was a facade not expressing the truth behind it. The morals of the people there have witnessed a retreat and deterioration towards others, especially Muslims.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 30
  },
  {
    "serial_number": "7483075",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "Furthermore, Islamic ethics have a limit; if exceeded, they become aggression, and if fallen short of, they become deficiency and humiliation. The control for all of that is Justice, as Ibn al-Qayyim and others say. The most just of people is the one who upholds the limits of ethics, actions, and legislations in knowledge and deed (1). Islamic ethics originate with doctrine, flow into acts of worship, and interact with transactions. They are the beautiful, useful, required, and desired fruits from the human being regardless of his background, sect, or creed. Fundamentally, they begin by binding individuals in society with a strong bond.",
    "foot_note": "1. (1) Sifat al-Safwah 2 / 61.",
    "book_id": "1119",
    "new_page_number": 31
  },
  {
    "serial_number": "7483076",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "Mustafa Sadiq al-Rafi'i says: \"And Islam in its reality is nothing but a set of strong ethics aiming to bind the collective from every side\" (1). He says: It regulates the Muslim conscience with a regulation that reflects as discipline in life, responding to enacted just legislations and laws. That regulation is what the Quran expresses as Taqwa (God-consciousness). He says: One of the characteristics of this ethical religion is that it is rigid in what is essential for the human soul if it desires human perfection, but flexible in what is essential for the conditions of different times which does not contradict the principles of noble ethics (2). From that Taqwa and spiritual, psychological, and mental discipline arises holding fast to the command of Allah all together, as the Holy Quran stated, warning at the same time against division, conflict, and infighting. The Almighty says: {And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.} (3).",
    "foot_note": "1. (1) Al-Fawa'id by Ibn al-Qayyim p. 140, 141. [Note: The attribution in text says Al-Rafi'i but footnote refers to Ibn al-Qayyim, likely referencing Al-Rafi'i's commentary or similar context]. \n2. Wahy al-Qalam 3 / 201. \n3. Al-Imran: 103.",
    "book_id": "1119",
    "new_page_number": 32
  },
  {
    "serial_number": "7483077",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "If holding fast and non-division are achieved, behind that lies the blessing of Allah upon this nation which was hostile, divided, fighting, and hateful, so Allah - Glory be to Him - brought their hearts together. Then the Holy Quran continues warning this nation against falling into what previous nations fell into; it must take heed so as not to be like those who divided and differed after the clear proofs came to them (Al-Imran 105). Then comes verse 110 to inform the Muslims that they are the best nation produced for mankind with the mentioned conditions and traits.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 33
  },
  {
    "serial_number": "7483078",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "The spirit of Islam is what made scattered elements and warring tribes in Umm al-Qura (Mecca) and its surroundings, and in Medina and its surroundings, and from the elements of the Immigrants (Muhajirun) and the Helpers (Ansar), the first Islamic society, cohesive, compact, and cooperating in the best possible way. Even a man in the new society would offer his brother to marry the one he chooses from his wives after he divorces her for him so that he may build a family thereby (1). These are features of Islam's moderation. Here, a legitimate question comes to mind: Where is the nation that represents the moderation of Islam? In other words: Where is the Middle Nation? Is it the one that existed in the first era during the time of the Messenger of Allah and the time of his Rightly Guided Caliphs before it turned into a biting kingship, then renewed by the fifth Caliph Umar bin Abdul Aziz, may Allah be pleased with him? Stripping the nation of its moderation after the Prophetic and Rashidun eras is a great injustice. Islam has extended like the sunlight on earth and continues to extend. Its great heritage, great civilization, and noble sublime culture are still utilized and praised by the world. This religion still has its influence and power across the globe. America has announced that three thousand (3000) individuals from its army in Saudi Arabia alone converted to Islam during their stay there. Some of those practicing Da'wah in the midst of the army...",
    "foot_note": "1. (1) 3 / 202.",
    "book_id": "1119",
    "new_page_number": 34
  },
  {
    "serial_number": "7483079",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "...American army announced that the number is many times double that. The same applies to Kuwait and other Gulf countries, and now in Iraq. Indeed, responsible American circles have announced that several guards at the \"Guantanamo\" base converted to Islam at the hands of Muslim prisoners there. Also, the French Interior Ministry announced that about fifty thousand French people converted to Islam in France over ten years. Perhaps the number is double that three times at least, according to what we observe and what is told to us from reliable sources. The phenomenon of people entering Islam is steady and growing. We live in the midst of this phenomenon regarding Spain; hardly a week passes without individuals and entire families visiting some centers of our brother preachers in Spain and Morocco, having entered Islam or wanting to testify to enter it. What happens in the Western world happens in the Third World, especially Africa, which is the future of Islam by the power and strength of Allah.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 35
  },
  {
    "serial_number": "7483080",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "This is only due to the existence of a significant group calling to Allah with wisdom and good instruction and arguing in the best way. The Islamic world is classified - except for Malaysia - as Third World, and generally, it is poor and scientifically and technically backward. However, it is a world rich in its sublime moral values and many of its noble customs, making the phenomenon of Islamic influence strong across the non-Islamic world, whether civilized or backward. Malcolm X says in a famous letter he sent during his Hajj in Mecca to some of his relatives and acquaintances and to Wallace Muhammad, son of his sheikh Elijah Muhammad: \"Never have I witnessed such sincere hospitality and overwhelming spirit of true brotherhood as is practiced by people of all colors and races here in this ancient Holy Land, the home of Abraham, Muhammad and all the other Prophets of the Holy Scriptures... America needs to understand Islam, because this is the one religion that erases from its society the race problem.\" This Hajj forced me to rearrange much of my thought-patterns previously held, and to toss aside some of my previous conclusions...",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 36
  },
  {
    "serial_number": "7483081",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "\"I have thought while watching them that if white Americans would accept the Oneness of God, then perhaps, too, they could accept in reality the Oneness of Man - and cease to measure, and hinder, and harm others in terms of their 'differences' in color. We see that racism is America's true cancer, and its fate will be like the fate of Nazi Germany unless it devotes itself to the Islamic solution to the problem to save America from a disaster about to befall it...\" He signed with the name El-Hajj Malik El-Shabazz, and below that Malcolm X (1). I still remember a word said to me by an American, who was formerly a judge and is black, at whose hand Tyson converted to Islam: \"The blessing of Islam is a great and mighty blessing that Muslims do not feel. It is we who feel it when we converted to Islam, so we felt the huge difference between the misery we lived in, the hardship of life, spiritual emptiness, and bad morals we suffered from, and the blessing of Islam that filled our hearts with reassurance and tranquility, and changed our morals and our view of the world until we became pitying our enemies, sympathizing with them, and striving to join them to the caravan of those blessed with faith.\"",
    "foot_note": "1. (1) The Autobiography of Malcolm X - Translated by Zoukan Qarkout - Dar Al-Adab - Beirut 1968.",
    "book_id": "1119",
    "new_page_number": 37
  },
  {
    "serial_number": "7483082",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "Therefore, it is no wonder that the high-ranking people and the lowly ones and those in between convert to Islam. Although some stories of their conversion were recorded, thousands of cases were not recorded, and we have been given but little knowledge of that. El-Hajj Malik El-Shabazz corrected some of his opinions and ideas, like Mr. Knox who was from the Black Panthers and began to view the white man with an Islamic view far from extremism, fanaticism, and racial discrimination resulting from the American racist view. One of the leaders of the 'Ibad al-Rahman' group in Beirut told me in the late sixties: They celebrated El-Hajj Malik El-Shabazz and entrenched in his mind the idea that superiority among people is not based on race, color, or money, but 'Indeed, the most noble of you in the sight of Allah is the most righteous of you.'",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 38
  },
  {
    "serial_number": "7483083",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "It is well known that the preachers of the Kingdom of Saudi Arabia had a clear impact on reforming the man's ideas and correcting his stance towards whites and non-Muslims... Before him, Leopold Weiss (Muhammad Asad) converted to Islam in the Kingdom during the reign of King Abdul Aziz, may Allah have mercy on him. Even if this man had nothing in Islam except \"Islam at the Crossroads\" and \"The Road to Mecca,\" it would have been enough for him. He added other books, including: a translation of the meanings of the Holy Quran into English, which Professor Dr. Sayyid Desouki Hassan considers the best English translation to date. Some veteran Muslim and Spanish doctors, like Abd al-Salam Mansour Escudero, also rely on it. Muhammad Asad continued to live under the generosity of some noble Saudi figures until his death on February 19, 1992, in Andalusia, Spain (1). The secret of Islam's spread in Western circles as well as Russia is its moderation, balance, and resonance with Fitrah (natural disposition) and sound reason, starting from the Oneness of God to removing harm from the road, and the spiritual power carried by its teachings that penetrates veils to settle in the soul and conscience without the owner's will, as expressed by Muhammad Asad who did not feel it until Islam filled his soul and illuminated his entire conscience with the light of truth... The wonderful stories of some who converted from...",
    "foot_note": "1. (1) See: The valuable article on 'Muhammad Asad' published in 'Al-Majalla Al-Arabiyya Al-Saudiyya' p. 59 Rajab 1413 AH by the great writer Sheikh Abdul Aziz Al-Rifa'i, may Allah have mercy on him.",
    "book_id": "1119",
    "new_page_number": 39
  },
  {
    "serial_number": "7483084",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "...Westerners are worthy of recording. But just as much as a Muslim takes pride in the blessed spread Islam achieves in the world, he feels sadness and sorrow for the distorted facades presented to the non-Muslim world through shameful behaviors, bad ideas, and repulsive stances issued by \"some\" Muslims. This type has multiplied, which our professor Malek calls 'the implicated lawyer' who makes his clumsy defense of innocent Islam the greatest argument for its conviction and judgment. Would that the matter stopped at speech; rather, it turns into horrific acts and heinous criminal impulses. Even more regrettable is that Islamic Da'wah has turned with these people into Inquisitions based on Takfir (excommunication), Tafsiq (labeling as sinners), and declaring the blood of innocents permissible, contradicting the moderation, tolerance, beauty, and mercy of Islam, and its call to gentleness, good opinion, easing things, love, respect, kindness, and good manners with everyone: {And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you} (1). This type of Muslims fail in their mission to strengthen the bonds of love internally and in scattering efforts for social construction and wasting opportunities available to make up for what the nation missed in catching up with advanced nations, just as happened to Muslims when currents sprouted among them and from the midst of piety...",
    "foot_note": "1. (1) Al-Imran: 159.",
    "book_id": "1119",
    "new_page_number": 40
  },
  {
    "serial_number": "7483085",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "...righteousness, asceticism, and love for the Family of the House (Ahl al-Bayt), which shook the social network of the Islamic structure, such as the Kharijites. For the mighty efforts, rare courage, amazing desperation, and disregard for death for the sake of principles, and the manifestations of deep religiosity and attachment to the Hereafter preferring it over the worldly life—instead of these praiseworthy traits being a driving force for Muslims and spreading the Call abroad, they were factors of destruction for Muslims internally, hindering conquests, spreading the spirit of rebellion, and opening the doors of fitnah (strife) among the common people. For what wisdom builds in an age, sharpness destroys in a brief time, as Muhammad Abduh says regarding what the sharpness of his teacher Jamal al-Din al-Afghani, may Allah have mercy on him, wasted.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 41
  },
  {
    "serial_number": "7483086",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "Scientific institutions responsible for Islamic Da'wah, Islamic universities, and official Islamic organizations must cooperate sincerely with rational and balanced organizations and Da'wah groups known for wisdom, sincerity, and jealousy for the nation and its causes, and with the luminaries of Islamic thought and its men working in the fields of Da'wah individually. This is to rectify the coming dangers threatening to carry out plans in the near and long term to snatch guidance, direction, matters of jurisprudence, religion, education, formation, and Fatwa from the stokers of war and strife and the hands and entities that adopted shameful behavior and unfortunate disturbances which only increase the nation in backwardness and spread within it the spirit of boycott and turning backs on one another, and everything that tears apart the network whose strength, cohesion, and harmony Allah bestows as a favor upon Muslims.",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 42
  },
  {
    "serial_number": "7483087",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "We have seen individual and non-individual attempts confronting this thought and working to wrest its leadership of the youth from it—that leadership which reinforces its destructive direction by deluding the youth that its reference is the Book, the Sunnah, the jurisprudence of the righteous predecessors (Salaf), and the great Imams and reformers. The truth is that there are those who rely in their stances, behavior, and jurisprudence on Imams who are innocent of what is issued by those who implicate the nation and trap it in difficult problems they are incapable of solving. True Salafism is innocent of the trend of Takfir, Tafsiq, rebelling against the nation, implicating it in conflict with the outside, and giving distorted images of Islam and Muslims, which incites the peoples of the world against this religion and its adherents at a time when Islam has become the most influential and accepted religion... If this religion were not veiled by the behavior of those who distort its reality, Islam and Muslims would have had a status—and what a status—in this age. Imam al-Dhahabi, may Allah have mercy on him, says about his sheikh Ibn Taymiyyah, may Allah have mercy on him, whose jurisprudence they lean on without understanding it: \"Our Sheikh Ibn Taymiyyah used to say in his last days:",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 43
  },
  {
    "serial_number": "7483088",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "'I do not excommunicate [anyone] from the Ummah,' and he says: 'The Prophet (peace be upon him) said: \"None preserves Wudu (ablution) except a believer.\" So whoever maintains prayers with ablution is a Muslim.'\" Al-Dhahabi says: He adheres to what he heard from his sheikh and what reached him about Imam Al-Ash'ari, may Allah have mercy on him, who, when his death approached, called Zahir bin Ahmed Al-Sarakhsi—and the Imam was staying with him in his house—he said: \"I came to him and he said: Bear witness upon me that I do not excommunicate anyone from the people of the Qibla because all point to one Worshipped, and all of this is just a difference in expressions\" (1). Indeed, Imam Ibn Taymiyyah, may Allah have mercy on him, sees that one should not fight a sect described by the Messenger of Allah (peace be upon him) as 'transgressing' (Baghiya), whether that is by interpretation or without interpretation, because of the fitnah that arises from that. He says: \"And whatever necessitates fitnah and division is not from religion (2).\" The Imams of Islam and its scholars agree on this jurisprudence, a jurisprudence that does not please disgruntled psyches, small minds, and deficient knowledge. What escapes the mind of many who engage in Da'wah is that the origin of fitnah is not only from leaving what Allah commanded, but also from leaving patience. Ibn Taymiyyah narrated that he who did not know the truth and fell short in knowing it, and added to that [impatience/action], has committed three sins (3).",
    "foot_note": "1. (1) Siyar A'lam al-Nubala 15 / 88. \n2. Al-Istiqamah 1 / 36-37. \n3. Ibid 39.",
    "book_id": "1119",
    "new_page_number": 44
  },
  {
    "serial_number": "7483089",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "From the jurisprudence of this Imam is that he provides us with great ideas scattered throughout his books. Among these wonderful ideas that are missed by many of that type of preachers who have almost filled the arenas—avoiding fitnah and preserving security and stability—he says: \"Therefore, we find people prefer those among kings and the like who wrong themselves by drinking wine, fornication, or immoralities but avoid wronging the subjects and strive for justice among them, over those who avoid immoralities, wine, and fornication but set themselves to wrong people in their lives, properties, and honor (1).\" We also see from the results of this thought that avoids Islamic moderation that it stirs up many fitnahs because of someone they see as unfit for Imamate due to a flaw rumored about him or seen in him, so instead of concealing it, they make it their habit to expose him and tear his veils. Perhaps they tried to advise him, so they exposed him or rebuked him and were harsh on him in front of everyone. Imam Ibn Taymiyyah, may Allah have mercy on him, says: \"Even if the follower knew that the Imam is an innovator calling to his innovation, or a sinner with open sin, and he is the regular Imam behind whom prayer is unavoidable like the Imam of Friday prayer, Eid prayers, and the Imam in Hajj prayer at Arafat and the like, then the follower prays behind him according to the general consensus of the Salaf (predecessors) and Khalaf (successors).\" This is the school of Ahmad, Al-Shafi'i, Abu Hanifa, and others.",
    "foot_note": "1. (1) Ibid 466.",
    "book_id": "1119",
    "new_page_number": 45
  },
  {
    "serial_number": "7483090",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "That is why they said regarding creeds: He prays Friday and Eid behind every Imam, whether righteous or wicked. For prayer in congregation is better than a man's prayer alone, even if the Imam is a sinner. And whoever abandons Friday and Congregation behind a wicked Imam is an innovator according to Imam Ahmad (1). These ideas are widely spread in our Islamic heritage. Among them is what the venerable scholar Sheikh Ahmed Zarruq Al-Fassi said in his *Qawa'id*: \"Preserving order is obligatory, and considering public interest is necessary. Therefore, they agreed on the prohibition of rebelling against the Imam by word or deed until their consensus led to praying behind every righteous and wicked person among rulers and others, as long as his wickedness is not in the prayer itself\" (2).",
    "foot_note": "1. (1) Fatawa Ibn Taymiyyah 23 / 353. \n2. Qawa'id al-Tasawwuf, p. 69.",
    "book_id": "1119",
    "new_page_number": 46
  },
  {
    "serial_number": "7483091",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "Partial and truncated readings of the jurisprudence of some scholars to suit the whims of extremists and satisfy their deviation, their deficient understanding, or their corrupt interpretation—all or some of this is responsible for these fitnahs that arose from fatwas and ideas that were scooping from these schools led by half-scholars who began repeating before the common people a phrase said before them by great Imams who knew what they were saying: \"We are men and they are men,\" without knowing the meaning of that. It is strange that this \"saying\" is now repeated by some commoners with permission from their \"sheikhs\" whom rivalry for increase diverted [from truth]!! How true is the following wisdom: \"Whomever you see answering everything he is asked, expressing everything he witnessed, and mentioning every knowledge, infer from that the existence of his ignorance\" (1).",
    "foot_note": "1. (1) Al-Hikam al-Ata'iyyah - Wisdom 68.",
    "book_id": "1119",
    "new_page_number": 47
  },
  {
    "serial_number": "7483092",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "A comprehensive and careful study of Imams to whom statements, stances, and fatwas were attributed clearly shows us that they were not so, because they are too noble to fall into what is attributed to them. Among those who were wronged among our Imams by being made a reference for some of those people is the reformer Sheikh: Muhammad bin Abd al-Wahhab, until \"Wahhabism\" (1) became an accusation even in some Islamic countries after its sharpness had subsided upon the clarification of its reality. Just as some Islamic movements suffered during the prime of the socialist doctrine from shameful propaganda published about them, the same happened to great reformers who were accused of accusations that expel them from the religion. Imam Muhammad bin Abd al-Wahhab, for example, wrote a letter to some of them saying:",
    "foot_note": "1. (1) There is no Wahhabi sect in Creed or Jurisprudence. The matter is a Turkish political invention by charging this \"term\" with fabrications that have no connection to the truth. Imam Muhammad bin Abd al-Wahhab, may Allah have mercy on him, was upon the school of Imam Ibn Hanbal, may Allah have mercy on him.",
    "book_id": "1119",
    "new_page_number": 48
  },
  {
    "serial_number": "7483093",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "\"If this is clear, then the issues regarding which slander was made, some of them are manifest falsehood. These are his saying: that I invalidate the books of the [four] schools. And his saying: that I say: People for six hundred years have been upon nothing. And his saying: that the difference of scholars is a curse. And his saying: that I excommunicate those who seek intercession through the righteous. And his saying: that I excommunicate Al-Busiri for saying: 'O most noble of creation'. And his saying: that I say if I could demolish the chamber of the Messenger (peace be upon him) I would demolish it, and if I could [reach] the Kaaba I would take its gutter and make a wooden gutter for it. And his saying: that I deny visiting the grave of the Prophet (peace be upon him). And his saying: that I deny visiting the grave of parents and others, and that I excommunicate whoever swears by other than Allah. These are twelve issues, my answer regarding them is to say: {Exalted are You, this is a great slander} (1).\"",
    "foot_note": "1. (1) Works of Sheikh Imam Muhammad bin Abd al-Wahhab - Part Five - Personal Letters p. 64 - Imam University Publication - Riyadh.",
    "book_id": "1119",
    "new_page_number": 49
  },
  {
    "serial_number": "7483094",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "One of the most dangerous things that implicate Muslims and give bad impressions about Islam is this Kharijite tendency that calls for religion without sufficient provision, sound understanding, or upright behavior. An example of this is the call by some of them to establish the Islamic Caliphate state in Western lands, where biased media exploits this to frighten Western peoples of Islam and Muslims, and to entrench the link between terrorism and religion and Muslims together in the manner of \"Pavlov's Russian\" theory. Among the painful manifestations is what some of them do of creating strife within Islamic peoples who are newly independent from Russia. Therefore, serious study is necessary to save ourselves before it is too late. Islamic moderation must transform into intellectual educational institutions with sound scientific curricula aiming to mold the Muslim in a way that achieves the internal psychological change conditional in the Holy Quran to achieve external change: {Indeed, Allah will not change the condition of a people until they change what is in themselves} {The established way of Allah which has occurred before. And never will you find in the way of Allah any change.}",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 50
  },
  {
    "serial_number": "7483095",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "Before we ask others to change, we must change ourselves, but according to what we aspire to of regulating the internal and external in accordance with the sublime objectives of Sharia and its eternal truths. The urgent task is preparing souls for the process of internal change and transformation to preserve the self and fortify it. Then we will have surpassed the levels of the soul that commands evil (An-Nafs Al-Ammarah) so that those noble motives and benevolent impulses become entrenched in souls, disciplined in movement towards good and stillness from evil, and fused until they become one spirit and one body in the direction of new construction as if everyone is a single soul. [Moving] the human who wrongs himself to elevation by starting to walk through the self-reproaching soul (An-Nafs Al-Lawwamah) which represents the moderate Muslim (Muqtasid) until we achieve stability on the path of the journey in the degrees of the reassured soul (An-Nafs Al-Mutma'innah) or the Muslim foremost in good deeds by permission of Allah. Whenever the high percentage of the third type is available to the nation, it is able to take its respected place among the nations of the world. Perhaps this is what the Holy Quran means—and Allah knows best—by His saying: {Then We caused to inherit the Book those We have chosen of Our servants; and among them is he who wrongs himself, and among them is he who is moderate, and among them is he who is foremost in good deeds by permission of Allah. That is the great bounty}",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 51
  },
  {
    "serial_number": "7483096",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "(1). The third type is honored by Allah with high upbringing making his good deeds outweigh his bad deeds. He is of the type who fulfills the rights of others without demanding his rights from those who denied him them; he is a human of sacrifice and self-denial, his concern is that his nation be a leading pioneer, so he does not count his hours of work; he gives more than he takes. It does not harm that beside him is the moderate human who performs his duties to the extent he takes his rights (2). But the type who wrongs himself is the discourager and the discouraged; a rise in his percentage in the nation signals delay, backwardness, and perhaps collapse. Malek Bennabi, may Allah have mercy on him, says in his books and talks: \"Progress and advancement are only realized in a society where there is a surplus of duties,\" citing Germany and Japan after World War II as examples.",
    "foot_note": "1. (1) Fatir: 32. \n2. Perhaps the speaker is Ibn al-Qayyim in Madarij al-Salikin.",
    "book_id": "1119",
    "new_page_number": 52
  },
  {
    "serial_number": "7483097",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "To achieve this, the matter must be entrusted to its people and qualified men of education, behavior, and good example who possess the conditions: Knowledge, meaning knowledge of Sharia and knowledge of reality, i.e., the field in which he works. And Wisdom: which is the deep experience that makes him capable of dealing with the best methods, most successful means, most appropriate mechanisms, and most beautiful arts of communication to convey his idea and explain it clearly and accurately with good influence and responsiveness and achieving the best results, added to that the good attribute and arguing in the best way. Wisdom was not described by one of the two mentioned descriptions because it is 'the best' in itself and does not need an extra description (1). Perhaps Insight (Basirah) combines knowledge and wisdom, then piety and righteousness, so that the preacher becomes an influential role model through behavior and action.",
    "foot_note": "1. (1) See: Tariq al-Hijratayn by Ibn al-Qayyim: p. 212-213, edited by Dr. Wahba al-Zuhaili - Dar al-Khair - Damascus - Beirut 1419 AH.",
    "book_id": "1119",
    "new_page_number": 53
  },
  {
    "serial_number": "7483098",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "The learned and working human wealth in the field of calling to Islam inside and outside the country is large, numerous, diverse, rich, and at appropriate levels. But it must coordinate and cooperate among itself before it is too late. It must also cooperate with Islamic countries and their various systems as much as possible, or at least avoid clashing with those in authority because the entire nation is threatened. It has become clear that every internal tension spreads a spirit of discontent, annoyance, and suspicion throughout society and drags into dire consequences that may extend to the infrastructure of Islam and the established bases in the nation, making it easy prey for foreign conspiracies due to the weakness and fragmentation that afflicts it. Leaders from here and there have admitted that actions from one side and reactions from another side resulted in the nation being the loser in the first and the last. Indeed, we have confirmed oral accounts that among the grave mistakes is cooperating to undermine some regimes due to their corruption or the claim thereof, because of the greater corruption that resulted from undermining them, the bitterness of which we taste every moment. Revolutionary regimes used to promise peoples paradise and cleansing the country of Zionism and its agents, but lo, these peoples are in the depths of hell and the worst blaze, weeping over the righteous past in which...",
    "foot_note": "None",
    "book_id": "1119",
    "new_page_number": 54
  },
  {
    "serial_number": "7483099",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Islam is the Religion of Moderation, Virtues, and Eternal Values",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "...the nation enjoyed many rights and lived at a living, cultural, political, social, and moral level that it has not reached even a quarter of under coups and what followed. We must represent the moderation of Islam in our behavior, ideas, and dealings among ourselves first, then transfer it to the outside, not through ideas only but through behavior. If we could reach the peaks of Islamic values and the peaks of Islamic truth, and could descend to the plateaus of Western civilization that is thirsty, and quench it with Islamic truth and Islamic guidance, we would add a new dimension to it, \"because secular civilization, the civilization of the rocket, the civilization of the electron, has acquired these things but lost a dimension it feels missing, which is the dimension of Heaven\" (1).",
    "foot_note": "1. (1) The Role of the Muslim and His Message in the Last Third of the Twentieth Century p. 38 Malek Bennabi - Dar Al-Fikr - Damascus - 1398 AH.",
    "book_id": "1119",
    "new_page_number": 55
  }
]