[
  {
    "text": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body\nAuthor: عبد الكريم بن محمد بن عبد الله العميريني\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4851\nbook_title: الأحكام الفقهية المتعلقة بالأجزاء الزائدة والمنفصلة والمبتورة من جسم الإنسان (دراسةً فقهيةً مقارنةً)\nbook_link: https://shamela.ws/book/1039\nbook_id: 1039\nauthor_name: عبد الكريم بن محمد بن عبد الله العميريني\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/97\nauthor_ID: 97\neditor: Null\npublisher: مجلة مجمع الفقه الإسلامي برابطة العالم الإسلامي\nedition: العدد: 40 (السنة 34، 1442 هـ - 2021 م)\npages: 56\nvolumes: 40\npagination: [ترقيم البحث موافق للمطبوع، ورقم الجزء هو رقم العدد]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4589045",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues. Book: Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body (A Comparative Jurisprudential Study). Author: Abdul Karim bin Muhammad bin Abdullah Al-Omairini, Assistant Professor at Qassim University, College of Science and Arts - Unaizah. Research: In the Journal of the Islamic Fiqh Academy of the Muslim World League, Issue: 40 (Year 34, 1442 AH - 2021 CE). Number of pages: 56 [Research numbering corresponds to the printed version, and the Part number is the Issue number]. Publication date in Shamela: 11 Rabi' al-Awwal 1444.",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 3
  },
  {
    "serial_number": "4589046",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 215,
    "volume_number": 1,
    "text": "Introduction: Indeed, all praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomsoever Allah guides, none can misguide, and whomsoever He misguides, none can guide. I bear witness that there is no god but Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger. {O you who have believed, fear Allah as He should be feared and do not die except as Muslims} [Al Imran: 102], {O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer} [An-Nisa: 1], {O you who have believed, fear Allah and speak words of appropriate justice (70) He will amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment} [Al-Ahzab: 70-71] (1). Since the human body is susceptible to the falling of something from its skin or organs, whether intentionally or unintentionally, and a person may be born with an extra part such as an extra finger on the foot or hand, the ruling regarding these separated or extra things—in terms of amputation, washing, praying over them, burial, and other rulings—becomes confusing for the Muslim. Therefore, I desired to research the jurisprudential rulings regarding separated parts in some detail, given that I have not seen independent research collecting the rulings specific to them. I have titled it (Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body). Importance of the Topic: The importance of the topic is evident through the following points: First: People's need for clarification of these rulings related to amputated human organs.",
    "foot_note": "1. This sermon is called 'Khutbah al-Hajah' (The Sermon of Necessity), and the Hadith has narrations with slight variations. It was recorded by Abu Dawood in his Sunan under number (2118) 2/238, Al-Tirmidhi in his Sunan under number (1105) 3/405, Al-Nasa'i in his Sunan under number (1404) 3/104, Ibn Majah in his Sunan under number (1892) 1/609, Ahmad in his Musnad under number (3720) 6/262, Al-Darimi in his Sunan under number (2248) 3/1413, Al-Hakim in Al-Mustadrak under number (2744) 2/199, and Al-Bayhaqi in Al-Sunan Al-Kubra under number (5802) 3/304. Ibn Al-Mulaqqin authenticated it in Al-Badr Al-Munir 7/530. Al-Albani authenticated it in Sahih wa Da'if Sunan Al-Tirmidhi under number (1105) 3/105, and he has a specific treatise on it where he listed its chains of transmission and authenticated it.",
    "book_id": "1039",
    "new_page_number": 4
  },
  {
    "serial_number": "4589047",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 216,
    "volume_number": 1,
    "text": "Second: The topic's connection to practical life, such as shaving for rituals (Nusuk), applying the characteristics of Fitrah (natural disposition), car accidents, and machinery accidents resulting in amputation, cutting, etc. Third: Connecting legal (Sharia) knowledge with contemporary occurrences related to the topic. Fourth: The issues of this topic are scattered within the books of Fiqh, so collecting them in an independent research paper helps bring knowledge closer and gather what is dispersed. Previous Studies: Through my search and induction, there is no independent research comprehensive of the issues I addressed in this research. What I found in some research papers and theses may have touched upon one or more issues, but did not encompass the issues of this topic. Among the books I reviewed are: 1 - A doctoral dissertation at the Islamic University of Madinah titled (Rulings of Medical Surgery and Its Consequences) by researcher: Muhammad bin Muhammad al-Mukhtar al-Shanqiti. 2 - A master's thesis titled (Utilizing Human Parts in Islamic Jurisprudence) by researcher: Ismat Allah Inayat Allah Muhammad, Umm Al-Qura University, 1407 AH. 3 - A research paper (Contemporary Cosmetic Surgery in the Light of Sharia and Positive Laws) by researcher: Ahmad bin Sulaiman Al-Rayish, Associate Professor at King Fahd Security College in Riyadh, 1424 AH. These studies are full of scientific material related to the topic, but they did not cover all the sections I addressed. So I added what was not found in them, or added evidence, reasoning, or quotes from scholars. I desired to collect the issues of the topic from more than one aspect; perfection belongs to Allah, and deficiency and error are human nature. Scope of Research: The research will be on separated non-liquid things, such as hair, nails, extra fingers, amputated organs, and the like. It does not include what exits from...",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 5
  },
  {
    "serial_number": "4589048",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 217,
    "volume_number": 1,
    "text": "...a human being that flows from the two passages, such as urine, feces, semen, and prostatic fluid (madhy), or from other than the two passages, such as blood, vomit, milk, mucus, etc. In this research, I did not address the issue of organ donation, whether during life or after death, due to the abundance of academic theses and decisions issued by Fiqh academies regarding this topic. I sufficed with referring to them (1), and to avoid prolonging the pages of the research. Research Methodology: In my research, I followed the theoretical inductive analytical method, through various sources, observing gradation, coherence, and comprehensiveness in presenting information. Research Procedures: 1 - I provided the linguistic and terminological definitions for the research vocabulary. 2 - I collected issues related to the jurisprudence of separated parts, presenting the disagreement with evidence and weighting (Tarjih). 3 - If the issue is a point of agreement among jurists, I mention its ruling with its evidence, documenting that. 4 - If the issue is a point of disagreement, I follow these steps: a- I mention the opinions in the issue, attributing each opinion to its proponent. b- I document the opinion from the original sources of each school of thought (Madhab). c- When presenting the opinions on the issue, I observe the chronological order of the schools, and I follow...",
    "foot_note": "1. Among them are the following: (1) Research titled (Legal Controls for Organ Donation) Author: Abdul Haq bin Ahmed Khamis. \n2. Book titled (Fiqh Issues in Human Organ Transplantation). Author: Arif Ali Arif Al-Qaradaghi. \n3. Thesis titled (Sale of Human Organs for Transplantation to Those in Need from the Perspective of Islamic Scholars) Author: Fatima Tabtabai. \n4. Thesis titled (Thesis on Rulings of Organ Transplantation in Islamic Jurisprudence) Author: Dr. Yusuf Al-Ahmad. \n5. Research titled (Cosmetic Surgery) Author: Dr. Hassan Shamsi Pasha. \n6. Thesis titled (Rulings of Medical Surgery and Its Consequences) Author: Muhammad bin Muhammad al-Mukhtar al-Shanqiti. \n7. Research titled (Ruling on Organ Donation in Light of Legal Rules and Medical Data) Author: Muhammad Naeem Abdul Salam. \n8. Researches in the Journal of the Islamic Fiqh Academy, Issue Four; Bakr Abu Zaid mentioned in the journal more than forty research papers related to the topic.",
    "book_id": "1039",
    "new_page_number": 6
  },
  {
    "serial_number": "4589049",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 218,
    "volume_number": 1,
    "text": "...each opinion with its evidence, clarifying the aspect of inference from the evidence, any discussion raised against the evidence if found, and the response to that discussion, whenever the need calls for any of that. d- After finishing the above, I proceed to weigh (Tarjih) between the opinions on the issue. 5 - Writing Quranic verses in the Uthmani script, indicating the Surah name and verse number in the footnote. 6 - I referenced the Prophetic Hadiths; for what was in the two Sahihs (Bukhari and Muslim) or one of them, I sufficed with that. For what was in others, I referenced it and clarified the scholars' ruling on it regarding authenticity or weakness. 7 - I referenced the reported Athar (narrations from Companions/Successors) with a statement of the judgment upon them. 7 - I explained strange words that need clarification. 8 - I placed an index for sources and references, and an index for topics. 7 - I did not provide biographies for the prominent figures mentioned to avoid burdening the footnotes. Research Plan: It includes an introduction, a preamble, and eight requirements (sections) as follows: Introduction: Contains the research methodology and plan. Preamble: Clarifies the honoring of the human being in Islamic Sharia. Requirement One: Definition of Parts, Separation, and Amputation. Requirement Two: Ablution (Wudu) of the Amputee. Requirement Three: Ruling on Separated Parts in terms of Purity and Impurity. Requirement Four: Ruling on Separated Parts in terms of Burial or Disposal. Requirement Five: The outcome of separated body parts in terms of praying over them, containing two issues: First Issue: That the owner of the severed organ is alive.",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 7
  },
  {
    "serial_number": "4589050",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 219,
    "volume_number": 1,
    "text": "Second Issue: That the owner of the severed organ is dead. Requirement Six: Ruling on replanting organs after they have been severed into the body of their owner, containing two issues. First Issue: Replanting the organ after it was severed in a Hadd (prescribed punishment) or Qisas (retribution). Second Issue: Replanting the organ after it was severed in other than a Hadd or Qisas. Requirement Seven: Cutting extra parts from the human body, containing two issues: First Issue: Cutting and removing extra parts out of necessity. Second Issue: Cutting and removing extra parts for beautification (cosmetic). Requirement Eight: Ruling on selling human parts. Conclusion: Mentions the most important results and recommendations. Indexes: Includes: 1/ Index of Sources and References. 2/ Index of Topics.",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 8
  },
  {
    "serial_number": "4589051",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 221,
    "volume_number": 1,
    "text": "Research Summary: 1/ That separated human parts and organs are generally pure (Tahir) according to the preponderant view. 2/ It is obligatory to bury separated parts that contain life, such as a hand and a finger. 3/ It is better (Mustahabb) to bury separated parts that do not contain life, such as hair, as a form of honoring. 4/ It is permissible, according to the preponderant view, to replant an organ severed in cases other than Hadd or Qisas. 5/ It is permissible to amputate and cut extra organs out of necessity and need. 6/ It is not permissible to amputate and cut extra organs for improvement and beautification. 7/ It is not permissible to sell human organs according to the preponderant view, in order to preserve human dignity.",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 9
  },
  {
    "serial_number": "4589052",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 225,
    "volume_number": 1,
    "text": "Preamble: Honoring the Human Being in Islamic Sharia. Many texts indicate Allah's honoring of the Children of Adam and His preference for them over many of His creations. The Almighty said: {And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference} (1). In Sahih Muslim, on the authority of Abu Hurairah (may Allah be pleased with him), he said: The Messenger of Allah (peace be upon him) said: \"Do not envy one another, do not artificially inflate prices, do not hate one another, do not turn away from one another, and do not undercut one another in trade, but be servants of Allah and brothers. A Muslim is the brother of a Muslim: he does not oppress him, nor does he fail him, nor does he despise him. Piety (Taqwa) is right here\"—and he pointed to his chest three times—\"It is enough evil for a man to despise his Muslim brother. All of a Muslim is sacred to a Muslim: his blood, his wealth, and his honor\" (2). This Hadith indicates manners and virtues for good interaction between Muslims and clarifies the sanctity of a Muslim's blood, wealth, and honor. Therefore, one of the objectives of Islamic Sharia is protecting the five necessities (Religion, Life, Honor/Lineage, Wealth, and Intellect) (3). Islam also observed the sanctity of a Muslim whether alive or dead, so texts came prohibiting the breaking of a dead person's bones, prohibiting harming him, and prohibiting stepping on his grave, among other texts indicating his honoring. From Aisha (may Allah be pleased with her), the Prophet (peace be upon him) said: \"Breaking the bone of the dead is like breaking it while he is alive\" (4).",
    "foot_note": "1. Al-Isra: 70. \n2. Recorded by Muslim in his Sahih, Book of Virtues, Chapter: Prohibition of oppressing, failing, and despising a Muslim, and [sanctity of] his blood, honor, and wealth, number (2564) 4/1986. \n3. See: Al-Mahsoul 5/160, and Al-Wajiz fi Usul al-Fiqh al-Islami 1/125. \n4. Recorded by Ahmad in Al-Musnad number (24686) 41/218, Abu Dawood in his Sunan number (3207) 5/116, Ibn Majah in his Sunan number (1616) 2/541, and others. It was authenticated by Al-Nawawi in Al-Khulasah number (3694) 2/1035, Ibn Al-Mulaqqin in Al-Badr Al-Munir 6/769, and Al-Albani in Al-Irwa number (763) 3/213.",
    "book_id": "1039",
    "new_page_number": 10
  },
  {
    "serial_number": "4589053",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 226,
    "volume_number": 1,
    "text": "And in the Hadith of Abu Hurairah (may Allah be pleased with him), he said: The Messenger of Allah (peace be upon him) said: \"It is better for one of you to sit on a live coal that burns his clothes and reaches his skin than to sit on a grave\" (1). Indeed, what adds to the honor of the Children of Adam in general is Allah subjecting to them what is in the heavens and what is on the earth, and bestowing favors upon them, as in His saying: {Do you not see that Allah has made subject to you whatever is in the heavens and whatever is in the earth and amply bestowed upon you His favors, [both] apparent and unapparent? But of the people is he who disputes about Allah without knowledge or guidance or an enlightening Book} (2). Requirement One: Definition of Parts, Separation, and Amputation. Parts (Ajza') linguistically: Plural of Juz', and the Juz' is a portion of a thing. It is masculine. It is said: 'I took a part of it', meaning: I took a portion of it and isolated it (3). Separation (Infisal) linguistically: Detachment. It is said: 'He separated the thing, so it separated', meaning he cut it, so it was cut off. It is the opposite of connection (4). Amputation (Batr) linguistically: 'He batara the thing', meaning he cut it. Every cut is a batr. From it is a 'batir' sword, meaning sharp/cutting. It is said: 'He amputated the tail or the organ' if he cut it and removed it. It is also applied to cutting a thing before completion (5). It has been used terminologically with these two meanings by the jurists, and it may be applied to any cutting. Types of Amputation: Amputating a part of a human or removing something from his skin may be done intentionally, and it has multiple forms (6):",
    "foot_note": "1. Recorded by Muslim in his Sahih, Book of Funerals, Chapter: Prohibition of sitting on a grave and praying upon it, number (971) 2/667. \n2. Luqman: 20. \n3. See: Al-Ain 6/163, Al-Mutli' 'ala Alfaz Al-Muqni' (p. 186), and Mu'jam Al-Lughah Al-Arabiyah Al-Mu'asirah 1/227. \n4. See: Taj Al-Arus 30/170, and Mu'jam Lughat Al-Fuqaha 1/93. \n5. See: Jamharat Al-Lughah 1/253, Al-Muhkam wa Al-Muhit Al-A'zam 9/483, and Al-Misbah Al-Munir 1/35. \n6. Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah 8/10.",
    "book_id": "1039",
    "new_page_number": 11
  },
  {
    "serial_number": "4589054",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 227,
    "volume_number": 1,
    "text": "First: That it is due to a crime. Second: That it is by right, such as cutting the hand for Qisas (retribution) or Hadd (punishment). Third: That it is a means of treatment, such as cutting a hand affected by gangrene, poisoning, or rot. Fourth: That it is a cause for purity and cleanliness, such as circumcision (1) and the characteristics of Fitrah (2). Separation and amputation may occur without intent, and this has many causes, including: First: What occurs due to injuries such as car accidents, effects of fires, dangers of machinery, attacks by predatory animals, etc. Second: What occurs due to pregnancy and childbirth, such as one who gives birth to a miscarriage (Saqt) (3), and what follows childbirth like the placenta (Mushimah) (4). Third: What falls off usually, such as a tooth, nail, and hair (5).",
    "foot_note": "1. Khatn: Cutting. Khitan (Circumcision): It is removing the skin covering the glans of the penis so it becomes exposed. Regarding women: Cutting a part of the skin located high above the vagina. It takes place in childhood because it heals faster and so the child grows up in the most perfect state. See: Al-Mutli' 'ala Abwab Al-Muqni' p. 29, Mu'jam Lughat Al-Fuqaha p. 193, Mu'jam Al-Mustalahat wa Al-Alfaz Al-Fiqhiyyah 2/16, and Al-Mulakhkhus Al-Fiqhi 1/37. \n2. These are established in the two Sahihs and others from the Hadith of Abu Hurairah (may Allah be pleased with him) from the Prophet (peace be upon him) who said: (The Fitrah is five - or five are from the Fitrah - circumcision, shaving pubic hair, trimming nails, plucking armpit hair, and trimming the mustache). Recorded by Al-Bukhari in his Sahih, Book of Clothing, Chapter: Trimming the mustache number (5889) 7/160, and Muslim in his Sahih, Book of Purification, Chapter: Characteristics of Fitrah, number (257) 1/221. \n3. Saqt: With Kasra on Sin, or Fatha, or Damma. It is: The newborn before completion, or that which falls from its mother's womb dead after its form has appeared. See: Al-Mutli' 'ala Alfaz Al-Muqni' p. 149, Mu'jam Lughat Al-Fuqaha p. 193, and Mu'jam Al-Mustalahat wa Al-Alfaz Al-Fiqhiyyah 2/276. \n4. Al-Mushimah (Placenta): A thin skin like a sac or membrane in which the newborn is located in its mother's womb. See: Jamharat Al-Lughah 1/611, Al-Misbah Al-Munir 1/329, Taj Al-Arus 32/484, and Al-Mu'jam Al-Wasit 1/504. \n5. Sheikh Ibn Uthaymeen said in Al-Sharh Al-Mumti' 12/403: (Body hair has three states: commanded [to remove], prohibited [from removing], and silent about. The commanded: Pubic hair, armpit hair, and mustache; these are removed without issue. The prohibited: The beard for men, and plucking eyebrows (Namas) for men and women. The silent about: Scholars differed, may Allah have mercy on them: is it permissible, disliked, or prohibited? What I see is that there is no harm in it because it is silent about, but it is better not to remove it unless it is deforming, because Allah did not create this except for wisdom, so do not think that Allah created anything except for wisdom, but you may not know it).",
    "book_id": "1039",
    "new_page_number": 12
  },
  {
    "serial_number": "4589055",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 228,
    "volume_number": 1,
    "text": "Requirement Two: Ablution (Wudu) of the Amputee. The jurists of the four schools of thought (1) agreed that the owner of an amputated limb must wash what remains of his limb. For example, regarding the ablution of one whose hand was cut off from the wrist joint (Rusgh) (2), he must wash the remaining obligatory part of his arm. And one whose toes were cut off must wash the remainder. It is stated in Al-Durr Al-Mukhtar (3): [He said in Al-Bahr: If his hand or foot is cut off and nothing remains of the elbow and ankle, washing drops. If it remains, it is obligatory]. And in Mawahib Al-Jalil (4): [If part of the obligatory site is cut off, washing what remains of it is obligatory without disagreement]. And in Al-Siraj Al-Wahhaj (5): [Likewise, washing the healthy part of the remaining ailing limb is obligatory according to the Madhab]. And in Al-Insaf (6): [If anything remains of the obligatory site, washing it is obligatory without dispute]. They reasoned with the following: First Evidence: The Almighty’s saying: {So fear Allah as much as you are able} (7), and the Almighty’s saying: {Allah does not charge a soul except [with that within] its capacity} (8).",
    "foot_note": "1. See: Al-Durr Al-Mukhtar wa Hashiyat Ibn Abidin 1/102, Al-Sharh Al-Kabir by Sheikh Al-Dardir wa Hashiyat Al-Dasuqi 1/87, Mughni Al-Muhtaj ila Ma'rifat Ma'ani Alfaz Al-Minhaj 1/175, Al-Insaf 1/164, and Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah 43/342. \n2. Al-Rusgh (Wrist): The joint of the palm from the forearm. See: Tahdhib Al-Lughah 2/62, Al-Qamus Al-Muhit 1/731, and Lisan Al-Arab 8/168. \n3. Al-Durr Al-Mukhtar wa Hashiyat Ibn Abidin 1/102. \n4. Mawahib Al-Jalil 1/191. \n5. Al-Siraj Al-Wahhaj p. 26. \n6. Al-Insaf 1/164. \n7. At-Taghabun: 16. \n8. Al-Baqarah: 286.",
    "book_id": "1039",
    "new_page_number": 13
  },
  {
    "serial_number": "4589056",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 229,
    "volume_number": 1,
    "text": "Point of Reference: It implies that washing the remainder of the limb is obligatory because that is within a human's ability, without burden or hardship. Second Evidence: The Hadith of Abu Hurairah (may Allah be pleased with him) containing the Prophet's (peace be upon him) saying: \"...and if I order you to do something, then do of it as much as you can\" (1). Point of Reference: Commands are based on ability and capacity. Whoever can do part of the commanded act but is unable to do the rest, it is obligatory for him to do it. It is not permissible to abandon the whole due to the claim of inability to do the part. Rather, the accountable person must do what he is capable of, because ability to perform the act is a condition for accountability. The command that the accountable person can do and is capable of does not drop due to what he is incapacitated from or what is difficult for him to do (2). Third Evidence: Consensus (Ijma), which is one of the strongest proofs (3). Lack of disagreement was reported by Al-Hattab and Al-Mardawi (4) as mentioned earlier in the beginning of the requirement. Fourth Evidence: The Fiqh Maxim [The easy is not waived by the difficult] (5). The meaning of this maxim: [The command that the accountable person can do, and which is easy for him, does not drop due to what is difficult for him to do or becomes hard] (6). Also, the Shafi'is and Hanbalis (7) see that it is recommended (Mustahabb) to wash the rest of the limb, even if it was cut from above the obligatory point. So whoever had his hand cut off including the elbow, it is recommended for him to wash the upper arm ( عضد), and whoever had his leg cut off including the ankle, it is recommended for him to wash the shin. They have justifications, including: First: So that the limb is not left without purification.",
    "foot_note": "1. Recorded by Al-Bukhari in his Sahih, Book of Holding Fast to the Book and Sunnah, Chapter: Following the Sunan of the Messenger of Allah (peace be upon him), number (7288) 9/94. \n2. Mawsu'at Al-Qawa'id Al-Fiqhiyyah 8/954. \n3. It is: The agreement of the scholars of an era from the Ummah of Muhammad (peace be upon him) on a religious matter. Consensus is a proof; it must be resorted to, violating it is prohibited, and it is not permissible for the Ummah to agree on an error. See: Al-Uddah fi Usul Al-Fiqh 4/1058, Al-Durar Al-Lawami' fi Sharh Jam' Al-Jawami' 3/205, and Rawdat Al-Nazir wa Jannat Al-Munazir 1/376. \n4. See: Mawahib Al-Jalil 1/191, and Al-Insaf 1/164. \n5. See: Al-Ashbah wa Al-Naza'ir by Taj al-Din al-Subki 1/155, Al-Ashbah wa Al-Naza'ir by Al-Suyuti 1/159. \n6. See: Qawa'id Al-Ahkam fi Masalih Al-Anam 2/7, and Al-Wajiz fi Idah Qawa'id Al-Fiqh Al-Kulliyah 1/396. \n7. See: Asna Al-Matalib 1/32, Umdat Al-Salik 1/13, Al-Mubdi' 1/108, and Al-Insaf 1/164.",
    "book_id": "1039",
    "new_page_number": 14
  },
  {
    "serial_number": "4589057",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 230,
    "volume_number": 1,
    "text": "It is stated in Sharh Muntaha Al-Iradat (1): [It is known from this that the amputee from above the elbow joint and ankle has no washing upon him, but it is recommended for him to wipe the place of amputation with water, so the limb is not devoid of purification]. And in Mughni Al-Muhtaj (2): [...or if it was cut from above it - meaning the elbow - it is recommended to wash the rest of his upper arm; so the limb is not devoid of purification]. Second: In order to extend the 'Tahjeel' (radiant marks of Wudu) (3). Third: By analogy to passing a razor over the head in Ihram for someone who lacks hair, like a bald person. It is stated in Al-Insaf (4): [If hair is lacking, it is recommended for him to pass the razor over the head, as stated by the As-hab (Hanbali scholars)]. And in Al-Waseet (5): [If there is no hair on his head, it is recommended to pass the razor over the head, and it is not obligatory]. They also agreed that whoever has an extra limb created in the obligatory site, such as an extra finger on the foot or hand, must wash it with the original one, because it is subordinate to it, so it takes its rulings (6). The Fiqh Maxim says: [The follower follows].",
    "foot_note": "1. Sharh Muntaha Al-Iradat 1/58. \n2. Mughni Al-Muhtaj 1/175. \n3. See: Asna Al-Matalib 1/40, Mughni Al-Muhtaj 1/191, and Al-Mubdi' 1/108. \n4. Al-Insaf 4/39. \n5. Al-Waseet 2/664. \n6. See: Mawahib Al-Jalil 1/194, Rawdat Al-Talibin 1/52, Al-I'lam bi Fawa'id Umdat Al-Ahkam 1/355, Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah 30/147, Al-Fiqh Al-Islami wa Adillatuh 1/370, and Mawsu'at Ahkam Al-Taharah 10/497.",
    "book_id": "1039",
    "new_page_number": 15
  },
  {
    "serial_number": "4589058",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 231,
    "volume_number": 1,
    "text": "Its meaning: [That which follows another in existence does not stand alone in ruling; rather, it enters into the ruling with what it follows]. The intended meaning of 'follower' here: What does not exist independently by itself, but its existence follows the existence of another; thus its ruling is not separated from the ruling of what it follows (1). In this requirement, the ease of Sharia and the tolerance of the religion become clear, and that its rulings are based on removing hardship from the accountable person, and that the Muslim does what he can, and Allah does not burden a soul beyond its capacity, and that with hardship comes ease. Requirement Three: Ruling on Separated Parts in terms of Purity and Impurity. This issue is based on the disagreement regarding the dead human body in terms of purity and impurity. Therefore, jurists differed regarding separated parts in terms of their essence (purity and impurity) into three opinions: First Opinion: That separated parts from the human body are absolutely pure (Tahir). This is the opinion of the general body of jurists, the relied-upon view of the Malikis, the correct view of the Shafi'is, the Madhab of the Hanbalis, and the saying of Ata' bin Abi Rabah, Ata' Al-Khurasani. It is the choice of Abu Bakr from the Hanbalis, Al-Bukhari, Sheikh Al-Islam Ibn Taymiyyah, Ibn Rajab, Ibn Hajar, Al-Shawkani (2), and others. It is stated in Minah Al-Jalil (3): [So what is separated from a living or dead human is pure according to the relied-upon view]. And in Mughni Al-Muhtaj (4): [So what is separated from a human, fish, or locust is pure].",
    "foot_note": "1. Al-Wajiz fi Idah Qawa'id Al-Fiqh Al-Kulliyah p. 331. \n2. See: Hashiyat Al-Dasuqi ma'a Al-Sharh Al-Kabir 1/54, Minah Al-Jalil Sharh Mukhtasar Khalil 1/51, Al-Majmu' 1/232, Al-Mughni 1/59 and also 8/325, Al-Kafi 1/50, Sahih Al-Bukhari 1/264, Majmu' Al-Fatawa 22/201, Al-Fatawa Al-Kubra 1/272, Fath Al-Bari by Ibn Rajab 1/343, Fath Al-Bari by Ibn Hajar 1/274, Nayl Al-Awtar 1/79. Ibn Hubayrah reported in Al-Ifsah 1/61: (The agreement of jurists that the wool and hair of a dead animal is pure). I say: So the purity of human hair is more worthy. \n3. Minah Al-Jalil Sharh Mukhtasar Khalil 1/51. \n4. Mughni Al-Muhtaj ila Ma'rifat Ma'ani Alfaz Al-Minhaj 1/235.",
    "book_id": "1039",
    "new_page_number": 16
  },
  {
    "serial_number": "4589059",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 232,
    "volume_number": 1,
    "text": "Al-Mardawi said (1): [If his tooth falls out and he puts it back while it is still warm and it sets, it is pure. This is the Madhab, and the majority are upon it, and most of them stated it definitively...]. It is stated in Al-Rawd Al-Murbi' (2): [And what falls from him - meaning a human - such as an organ or tooth, is pure]. They cited evidences including: First Evidence: {And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference} (3). Point of Reference: That the view of purity is what aligns with the verse and the texts reported regarding his honoring (4). Second Evidence: The Hadith of Anas (may Allah be pleased with him) who said: \"When the Messenger of Allah (peace be upon him) threw the Jamrah, slaughtered his sacrifice, and shaved, he handed the shaver his right side and he shaved it. Then he called Abu Talha Al-Ansari and gave it to him. Then he handed him the left side and said: 'Shave,' so he shaved it, and he gave it to Abu Talha and said: 'Distribute it among the people'\" (5). Point of Reference: Had it not been pure, the Prophet (peace be upon him) would not have distributed it among the Companions (may Allah be pleased with them). It was argued: This is specific to the Prophet (peace be upon him). It was answered: The principle is that the Prophet (peace be upon him) shares rulings with his Ummah, except for what evidence indicates is specific to him, and there is no evidence here, so the ruling remains general. Third Evidence: The Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Prophet (peace be upon him) said: \"...Indeed, the believer does not become impure\" (6).",
    "foot_note": "1. Al-Insaf fi Ma'rifat Al-Rajih min Al-Khilaf 3/295. \n2. Al-Rawd Al-Murbi' 1/79. \n3. Al-Isra: 70. \n4. See: Thesis 'Ahkam Al-Sha'r fi Al-Fiqh Al-Islami' by researcher Abdullah Al-Sam'il p. 146. \n5. Recorded by Muslim in his Sahih, Book of Hajj, Chapter: Explanation that the Sunnah on the Day of Sacrifice is to throw, then slaughter, then shave, and starting shaving with the right side of the shaved person's head, number (1305) 2/947. Part of it is in Sahih Al-Bukhari, Book of Ablution, Chapter: The water used for washing, number (171) 1/45. \n6. Recorded by Al-Bukhari in his Sahih, Book of Ghusl, Chapter: The Junub (person in major impurity) going out and walking in the market etc., number (285) 1/65, and Muslim in his Sahih, Book of Menstruation, Chapter: Proof that water does not become impure, number (371) 1/282.",
    "book_id": "1039",
    "new_page_number": 17
  },
  {
    "serial_number": "4589060",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 233,
    "volume_number": 1,
    "text": "Fourth Evidence: The Hadith of Ibn Abbas (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) said: \"Do not treat your dead as impure, for the Muslim does not become impure, alive or dead\" (1). Point of Reference: The believer is pure alive and dead, whether connected to him or separated from him, due to the generality of the Hadiths. Fifth Evidence: What the Prophet (peace be upon him) did when he returned the eye of Qatadah bin Al-Nu'man (may Allah be pleased with him) when he was injured on the day of Uhud, and he put it back in its place (2). Point of Reference: That the separated part of the body is pure; if it were impure, the Prophet (peace be upon him) would not have returned the eye of Qatadah bin Al-Nu'man (may Allah be pleased with him). Sixth Evidence: The Hadith of Ibn Abbas (may Allah be pleased with them) who said: While a man was standing at Arafat, he fell from his mount and it broke his neck - or he said: it killed him (3) - The Prophet (peace be upon him) said: \"Wash him with water and sidr (lote tree leaves), and shroud him in two garments, and do not embalm him, and do not cover his head (4), for he will be resurrected on the Day of Judgment reciting Talbiyah\" (5). Point of Reference: Had he been impure, washing would not have been beneficial for him. Also, washing is a form of honoring and cleanliness. Seventh Evidence: The opinion stating the impurity of what separates from the human body involves difficulty and hardship, and it is difficult for people to avoid it due to the frequency of what falls from him and the widespread nature of the issue (Ummum al-Balwa).",
    "foot_note": "1. Recorded by Al-Hakim in Al-Mustadrak under number (1422) 1/542, and he said: Authentic (Sahih) according to the conditions of the two Sheikhs, and they did not record it. Recorded by Al-Daraqutni in his Sunan under number (1811) 2/430, and Al-Bayhaqi in Al-Sunan Al-Kubra under number (1463) 1/457. Its chain was authenticated by Al-Albani as in Al-Silsilah 13/667. \n2. Recorded by Ibn Abi Shaybah in Al-Musannaf under number (32364) 6/400, and Al-Haythami in Al-Maqsad Al-A'la fi Zawa'id Abi Ya'la Al-Mawsili under number (1277) 3/156. \n3. Waqasathu: Threw him and broke his neck. See: Talibat Al-Talabah fi Al-Istilahat Al-Fiqhiyyah (p. 14), and Al-Mu'jam Al-Wasit 2/1049. \n4. Takhmir: Covering. See: Sharh Sahih Al-Bukhari by Ibn Battal 9/67, and Sharh Al-Nawawi 'ala Muslim 13/182. \n5. Recorded by Al-Bukhari in his Sahih, Book of Funerals, Chapter: Shrouding in two garments, number (1265) 2/75, and Muslim in his Sahih, Book of Hajj, Chapter: What is done with the Muhrim if he dies, number (1206) 2/865.",
    "book_id": "1039",
    "new_page_number": 18
  },
  {
    "serial_number": "4589061",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 234,
    "volume_number": 1,
    "text": "And Islamic Sharia came to remove difficulty, hardship, and distress. The Almighty said: {And He has not placed upon you in the religion any difficulty} (1), and His saying: {Allah intends for you ease and does not intend for you hardship} (2). Second Opinion: That the separated part of the human body is absolutely impure (Najis). This is the view of Muhammad bin Al-Hasan from the Hanafis (3), a view in the Maliki Madhab (4), the relied-upon view of the Shafi'is (5), and a narration from Ahmad (6). Al-Shafi'i said in Al-Umm (7): [If a woman's bone is broken and flies off, she may not patch it except with the bone of an animal whose meat is eaten and was slaughtered Islamically. Likewise, if a tooth falls out, it becomes dead (Maitah), so he may not put it back after it has separated]. Al-Nawawi said in Al-Majmu' (8): [As for if a part of his body separates, such as his hand or nail, the Iraqis, or the majority of them, affirmed its impurity...]. In Al-Insaf (9): (As for separated human hair, the correct view of the Madhab, upon which are the As-hab, is its purity; many of them stated it definitively. And from him [Ahmad] is a narration of its impurity, other than the hair of the Prophet (peace be upon him)). They reason with the following: First Evidence: The noble verse {Say, \"I do not find within that which was revealed to me [anything] forbidden to one who would eat it unless it be a dead animal or blood spilled out or the flesh of swine - for indeed, it is impure - or it be [that slaughtered in] disobedience, dedicated to other than Allah} (10).",
    "foot_note": "1. Al-Hajj: 78. \n2. Al-Baqarah: 185. \n3. See: Al-Mabsut 26/98, Tuhfat Al-Fuqaha 1/52, and Bada'i' Al-Sana'i' 7/315. \n4. See: Al-Taj wa Al-Iklil 1/141, Mawahib Al-Jalil 1/99, and Al-Sharh Al-Kabir wa Hashiyat Al-Dasuqi 1/53. \n5. See: Al-Bayan fi Madhab Al-Imam Al-Shafi'i 1/424, Al-Majmu' 1/232, and Rawdat Al-Talibin 1/15. \n6. See: Al-Mughni 8/325, Al-Sharh Al-Kabir 9/431, Sharh Al-Zarkashi 1/162, Al-Mubdi' 1/55, Al-Insaf 1/93. \n7. See: Al-Umm 1/71. \n8. See: Al-Majmu' 1/232. \n9. Al-Insaf 1/183. I say: If there is a narration in the Madhab about the impurity of hair, which has no life, then the impurity of what has blood and life is more worthy. \n10. Al-An'am: 145.",
    "book_id": "1039",
    "new_page_number": 19
  },
  {
    "serial_number": "4589062",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 235,
    "volume_number": 1,
    "text": "Point of Inference: The verse is general and includes human dead bodies and others, so it would be impure upon separation. It is discussed: That what is meant is what comes out of animals while they are alive, and what comes out of the jugular veins at slaughter (1). Also, what is meant by it is animals, and humans are not measured against animals in rulings. Second Evidence: The Hadith of Abu Waqid (may Allah be pleased with him), containing his saying (peace be upon him): \"Whatever is cut from a beast (Bahimah) while it is alive is dead (Maitah)\" (2). Point of Reference: That what is cut from a human while alive is impure; because the dead human body is impure as evidenced by washing it after death. Even if it was revealed for a specific cause, the correct view is that consideration is given to the generality of the wording, not the specificity of the cause, as in the verses of Li'an (imprecation) and Zihar, which were revealed for specific causes but their generality remained for the rest of the Ummah (3). It is answered by the following: That a human is not called a 'beast' (Bahimah), and this Hadith is restricted by its wording and cause to beasts, so it does not extend to others. Also, what is meant is the dead animal, as evidenced by the jurists citing this Hadith in the chapters of Hunting, Slaughter, and Purity (4). This is supported by the occasion on which this Hadith was narrated, where Abu Waqid (may Allah be pleased with him) said: The people in the Jahiliyyah (pre-Islamic period) used to cut off camel humps and cut off sheep tails and eat them, and carry the fat from them. When the Prophet (peace be upon him) arrived, they asked him about that, so he said: \"Whatever is cut from a beast while it is alive...",
    "foot_note": "1. See: Tafsir Al-Baghawi 2/166, and Al-Lubab fi Ulum Al-Kitab 8/485. \n2. Recorded by Ahmad in Al-Musnad under number (21903) 36/233, Abu Dawood in his Sunan under number (2858) 4/479, Al-Tirmidhi in his Jami' under number (1480) 4/74, Ibn Khuzaymah in his Sahih number (333) 2/1377, Al-Daraqutni in his Sunan under number (4792) 5/527, Ibn Al-Jarud in Al-Muntaqa under number (876) 1/221, Al-Hakim in Al-Mustadrak under number (7150) 4/137, and he said: This Hadith has an authentic chain and they did not record it, and Al-Bayhaqi in Al-Sunan Al-Kubra under number (77) 1/35. \n3. Al-Jawhar Al-Naqi 9/245. \n4. See for Hanafis: Al-Mu'tasar min Al-Mukhtasar min Mushkil Al-Athar 1/266, for Malikis: Bidayat Al-Mujtahid 1/85, for Shafi'is: Nihayat Al-Matlab 1/33, for Hanbalis: Al-Mughni 9/402.",
    "book_id": "1039",
    "new_page_number": 20
  },
  {
    "serial_number": "4589063",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 236,
    "volume_number": 1,
    "text": "...is dead (Maitah)\" (1). As for washing him after his death, it is intended for cleanliness and perfection, not purification from impurity. Ibn Al-Arabi refuted those who said it is dead (Maitah) and impure, saying: [This is a clear mistake. Whoever it was hidden from him that returning it and its return to its form necessitates the return of its ruling is ignorant; because the impurity was in it due to separation, and it has returned connected. Rulings of Sharia are not attributes of substances, but rather they are rulings returning to Allah's saying about them and His informing about them] (2). Modern medicine has also proven that some organs retain life for a known period even after the death of their owner (3), so by this, these organs are judged not to be impure because life remains in them. Third Opinion: Differentiating between what separated from the human body (4): if it contains life and blood, like a hand, nose, and ear, they say it is impure. And what does not contain life or blood, like hair and nails, they judge as pure. This is the relied-upon opinion among the Hanafis, an opinion among the Shafi'is, and a narration in the Madhab of Ahmad (5).",
    "foot_note": "1. Its referencing preceded in the Second Evidence of this opinion's proofs. \n2. Ahkam Al-Quran 2/134, Fiqh Al-Nawazil 2/27. \n3. Human organs after removal from the body differ in the duration they remain viable for transplantation into another body, called in medical language (ischemia time). After that, they are damaged irreversibly. For example, kidneys remain (45) minutes, liver (8) minutes, pancreas (20) minutes, bone and cornea (24) hours. They can be preserved to remain viable longer through two ways: either cooling or freezing, while observing other medical matters to prevent cell corruption. See: Al-Masa'il Al-Tibbiyah Al-Mustajaddah fi Daw' Al-Shari'ah Al-Islamiyah p. 392. \n4. Ibn Hazm differentiates between the Muslim and the Disbeliever; what separates from the believer's body is pure, and what separates from the disbeliever is impure. See: Al-Muhalla 1/137. \n5. See for Hanafis: Tuhfat Al-Fuqaha 1/52, Bada'i' Al-Sana'i' 1/63, Al-Jawhara Al-Nayyirah 1/16. For Shafi'is: Al-Bayan fi Madhab Al-Imam Al-Shafi'i 1/424, Al-Majmu' 1/232. For Hanbalis: Sharh Al-Zarkashi 1/162, Al-Mubdi' 1/55, and Al-Insaf 1/93.",
    "book_id": "1039",
    "new_page_number": 21
  },
  {
    "serial_number": "4589064",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 237,
    "volume_number": 1,
    "text": "It is stated in Bada'i' Al-Sana'i' (1): [As for that which has flowing blood, there is no disagreement regarding the parts that contain blood such as flesh, fat, skin, and the like, that they are impure; due to the retention of impure blood in them, which is spilled blood]. It is stated in Al-Durr Al-Mukhtar (2): [What is separated from the living, if it is a part containing blood like a hand, ear, nose, and the like, is impure by Consensus (3). Otherwise, like hair and nail, it is pure according to us]. And in Al-Mughni: [Because it is hair; the connected part is pure, so the separated part is pure, like the hair of all animals. We say the same regarding human organs. Even if we accept their impurity, they become impure like other animals by separation during life, unlike hair] (4). The secret of the difference in ruling: That life in wool and hair is a life of growth, like the life of trees and palms, not a life of soul (spirit), as they do not feel pain when cut or clipped, unlike bone and flesh, for theirs is a life of soul, evidenced by pain upon breaking or cutting. The evidence that wool and hair are pure upon separation is the Almighty's saying: {And from their wool, fur, and hair is furnishing and enjoyment for a time} (5), where it came in the context of gratitude/favor, and favor is not granted with something impure. The verse encompasses the state of life and death (6). Also, evidence indicates that bone and flesh are impure upon cutting and separation. The Almighty said: {And he presents for Us an example and forgets his [own] creation. He says, \"Who will give life to bones while they are disintegrated?\"} (7). This indicates that...",
    "foot_note": "1. Bada'i' Al-Sana'i' 1/63. \n2. Al-Durr Al-Mukhtar wa Hashiyat Ibn Abidin 1/207. \n3. Meaning the Consensus of the Madhab's jurists. \n4. Al-Mughni 1/60. \n5. Al-Nahl: 80. \n6. See: Al-Mubdi' 1/77, Kashshaf Al-Qina' 1/57. \n7. Ya-Sin: 78.",
    "book_id": "1039",
    "new_page_number": 22
  },
  {
    "serial_number": "4589065",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 238,
    "volume_number": 1,
    "text": "...they had a soul and life during life, so they became impure by death. They inferred with the proofs of the first opinion for purity, limiting it to what has no soul, life, or sensation. And they inferred with the proofs of the second opinion for impurity, limiting it to what has life and soul. Weighting (Tarjih): The preponderant view is the first opinion, the opinion of the majority, which is the general purity of what separates from the human body, whether the separated part has life or not; due to the following: The strength of the evidences they cited. Its agreement with general texts on honoring the human. Its agreement with tolerance, ease, and removing hardship from the accountable person. And due to the discussions raised against the proofs of the other opinions (1). Requirement Four: Ruling on Separated Parts in terms of Burial or Disposal. Human body parts are divided into two categories: First Category: That which has sanctity and contains life and blood, and originally should not be removed, like a hand and a leg. This must be buried to honor the human body. Al-Bahuti said (2): [If part of a confirmed dead person is found, other than hair, nail, and tooth, it is washed, shrouded, prayed over, and buried obligatorily. Then if the rest is found, it is prayed over and buried beside it]. In Requirement Five, quotes from jurists regarding the sanctity and dignity of these parts and whether they are prayed over will follow. Second Category: That which has no life or blood, like hair and nail. It has been reported from the jurists of the four schools that it is recommended (Mustahabb) to bury what separated from the body and that it is better, while remaining permissible to dispose of it without burial (3).",
    "foot_note": "1. See: Thesis 'Al-Intifa' bi Ajza' Al-Adami fi Al-Fiqh Al-Islami' p. 53 onwards by researcher Muhammad Ismat Allah, Mawsu'at Ahkam Al-Taharah by researcher Dubayan Al-Dubayan 3/270, Thesis 'Ahkam Al-Sha'r fi Al-Fiqh Al-Islami' p. 146 by researcher Abdullah Al-Sam'il, and Majallat Al-Fiqh Al-Islami Vol 4 p. 93. \n2. Kashshaf Al-Qina' 2/124. \n3. See: Al-Bahr Al-Ra'iq 2/372, Tafsir Al-Qurtubi 2/102, Asna Al-Matalib 1/492, Al-Majmu' 1/289, Al-Mughni 1/66, Al-Wuquf wa Al-Tarajjul li Masa'il Al-Imam Ahmad bin Hanbal 1/140, Kashshaf Al-Qina' 2/96, Fath Al-Bari 10/346, Mawsu'at Ahkam Al-Taharah 3/269, Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah 5/171, Majmu' Fatawa Ibn Baz 9/436, and Majmu' Al-Fatawa wa Al-Rasa'il by Ibn Uthaymeen 11/132.",
    "book_id": "1039",
    "new_page_number": 23
  },
  {
    "serial_number": "4589066",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 239,
    "volume_number": 1,
    "text": "Ibn Nujaym said (1): [It is recommended to bury his hair... and if the hair is thrown away, there is no harm, but throwing it in the latrine (2) and washing place is disliked; because that causes disease]. Al-Qurtubi said (3): [Since the body of a believer has sanctity, preserving the sanctity of what falls and is removed from it remains. It is incumbent upon him to bury it, just as if he died, he would be buried. So if part of him dies, his sanctity is also established by burying it, so it does not disperse or fall into fire or dirty trash heaps. The Messenger of Allah (peace be upon him) ordered burying his blood where he was cupped, so dogs would not search for it]. Al-Nawawi said (4): [Burial is not exclusive to the organ of one known to be dead; rather, everything that separates from the living, such as a limb, hair, nail, and other parts, is recommended to be buried. Likewise, the blood clot (Alaqah) and lump of flesh (Mudghah) cast by a woman are buried, as are blood from phlebotomy and cupping]. Ibn Qudamah said (5): [It is recommended to bury what he clipped of his nails or removed of his hair]. Muhanna said: I asked Ahmad about a man who takes from his hair and nails, should he bury it or throw it? He said: He buries it. I said: Did something reach you regarding it? He said: Ibn Umar used to bury it (6). They reasoned with the following evidences: First Evidence: The generality of the Almighty's saying: {Have We not made the earth a container (25) Of the living and the dead?} (7). Kifata (container): Meaning a gatherer that gathers the living on its back and the dead in its belly (8).",
    "foot_note": "1. Al-Bahr Al-Ra'iq 2/372. \n2. Al-Kunuf: Places for relieving oneself. See: Al-Nihayah fi Gharib Al-Hadith wa Al-Athar 1/390. \n3. Tafsir Al-Qurtubi 2/102. \n4. Al-Majmu' 1/254. \n5. Al-Mughni 1/66. \n6. Al-Wuquf wa Al-Tarajjul fi Masa'il Al-Imam Ahmad 1/140, Al-Mughni 1/66, Al-Sharh Al-Kabir 1/105, and Al-Insaf 1/28. \n7. Al-Mursalat: 26, 25. \n8. See: Tafsir Ibn Kathir 8/304, and Tafsir Al-Baghawi 5/197.",
    "book_id": "1039",
    "new_page_number": 24
  },
  {
    "serial_number": "4589067",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 240,
    "volume_number": 1,
    "text": "Point of Inference: That the verse indicates hiding the dead and burying him, and burying his hair and all that he removes from himself (1). Al-Khallal said: Al-Marwazi told us, he said: It was read to Abu Abdullah: {Have We not made the earth a container (25) Of the living and the dead?} (2). He said: The living are contained in it: blood, hair, and nails (3). Second Evidence: The Hadiths and Athar reported, including: First: From Abdul Jabbar bin Abbas, from a man of Bani Hashim, that the Messenger of Allah (peace be upon him): \"Ordered the burial of hair, nail, and blood\" (4). Second: From Abdul Jabbar bin Wa'il, from his father, from the Prophet (peace be upon him): \"He used to order the burial of hair and nails\" (5). Third: From Mayl bint Mishrah Al-Ash'ari, she said: I saw my father \"clip his nails then bury them.\" He said: O my daughter, \"Thus I saw the Messenger of Allah (peace be upon him) do\" (6). Fourth: From Nafi', from Ibn Umar (may Allah be pleased with them), he said: The Messenger of Allah (peace be upon him) said: \"Bury the nails, hair, and blood, for they are dead (Maitah)\" (7). These Hadiths and Athar are weak, and that has been clarified in the footnote along with the statement of scholars about them. Even if they are weak, they may rise to the level of Hasan (good) by the sum of their chains. Also, their content agrees with what many texts indicated regarding the sanctity of the human and his dignity, and because the principle is burial to honor the human by honoring his parts.",
    "foot_note": "1. Tafsir Al-Qurtubi 19/161. \n2. Al-Mursalat: 26, 25. \n3. Al-Wuquf wa Al-Tarajjul fi Masa'il Al-Imam Ahmad 1/141. \n4. Recorded by Ibn Abi Shaybah in Al-Musannaf under number (25661) 5/241. \n5. Recorded by Al-Tabarani in Al-Kabir number (73) 22/32, Al-Bayhaqi in Shu'ab Al-Iman number (6069) 8/444, and he said: This chain is weak and it was narrated from other ways, all of which are weak. Al-Albani weakened it in Al-Silsilah Al-Da'ifah number (2357) 5/380. \n6. Recorded by Al-Bukhari in Al-Tarikh Al-Kabir 8/45, Al-Tabarani in Al-Kabir number (762) 20/322, Al-Bayhaqi in Shu'ab Al-Iman number (6068) 8/443. Ibn Hajar said in Al-Isabah 6/97: And in its chain is Muhammad bin Sulaiman bin Masmul, and he is very weak. Al-Albani weakened it in Al-Silsilah Al-Da'ifah number (2357) 5/382 and said: It has other defects. \n7. Recorded by Al-Uqayli in Al-Du'afa Al-Kabir 2/279, and Al-Bayhaqi in Al-Sunan Al-Kubra number (76) 1/35, and he said: (This is a weak chain. Hadiths regarding burying nails and hair have been narrated with weak chains).",
    "book_id": "1039",
    "new_page_number": 25
  },
  {
    "serial_number": "4589068",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 241,
    "volume_number": 1,
    "text": "Third Evidence: That burying them prevents using them for harm, as sorcerers do, as the Prophet (peace be upon him) was bewitched in a comb and combings (hairfall) (1). Fourth Evidence: That Islam is the religion of cleanliness and integrity, and it has commanded removing harm. There is no doubt that burying hair and nails is perfection of cleanliness, and it also involves consideration for the feelings of others, which is what Islam calls for. Requirement Five: The outcome of separated body parts in terms of praying over them, containing two issues: First Issue: That the owner of the severed organ is alive: The amputated and separated organ, while its owner is alive, is not washed and not prayed over. This is a point of agreement among the jurists of the schools, especially if it is less than half, or a single organ like a leg or a hand (2). The Permanent Committee for Scholarly Research and Ifta in the Kingdom of Saudi Arabia issued a Fatwa to this effect (3). It is stated in Maraqi Al-Falah (4): [If most of the body is found, or half of it with the head, it is washed and prayed over; otherwise, no]. Al-Hattab said (5): [As for the dismembered body, if all of it or most of it is gathered, it is washed and prayed over]. It is understood from the saying of the author of Al-Maraqi and from Al-Hattab's words also that what was a separated organ is not washed nor prayed over.",
    "foot_note": "1. Al-Musht (Comb): The known tool used to comb head and beard hair, this is the famous meaning. Al-Mushatah (Combings): The hair that falls from the head or beard when combing. See: Sharh Al-Nawawi 'ala Muslim 14/177, and Fath Al-Bari by Ibn Hajar 10/229. \n2. See for Hanafis: Maraqi Al-Falah Sharh Nur Al-Idah p. 216, Al-Durr Al-Mukhtar 2/199. For Malikis: Jawahir Al-Durar 2/556, Mawahib Al-Jalil fi Sharh Mukhtasar Khalil 2/522. For Shafi'is: Al-Majmu' 5/254, and Al-Nawawi reported in Al-Majmu' from Al-Mutawalli the Agreement that it is not washed nor prayed over. For Hanbalis: Kashshaf Al-Qina' 2/124. \n3. Fatawa Al- اللجنة Al-Da'imah (8/448). \n4. Maraqi Al-Falah Sharh Nur Al-Idah p. 216. \n5. Mawahib Al-Jalil fi Sharh Mukhtasar Khalil 2/212.",
    "book_id": "1039",
    "new_page_number": 26
  },
  {
    "serial_number": "4589069",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 242,
    "volume_number": 1,
    "text": "Al-Nawawi said (1): [...There is no disagreement that the hand cut off in theft and Qisas is not washed nor prayed over, but it is wrapped in a cloth and buried. Likewise, clipped nails and hair taken from the living; none of it is prayed over, but it is recommended to bury them]. Al-Mardawi said (2): [What separated from a living person, like a hand and leg that separated at a time—if the whole body were found [in that state] it would not be washed nor prayed over—according to the correct view of the Madhab]. Second Issue: That the owner of the severed part is dead. This issue has two cases: First Case: That organs and parts of a dead person are found separated from him, like a hand, leg, or others. If they are found separated, and the rest of the body is found, they are washed and placed in his shroud, and the body and what separated from it are prayed over all at once. Ibn Qudamah reported agreement on that, saying: [If something falls from the dead, it is washed and placed with him in his shrouds. The summary is that if something separates from the dead and is present, it is washed and placed with him in his shrouds. Ibn Sirin said this, and we do not know any disagreement regarding it] (3). Second Case: That the severed organ is found without the rest of the body. If the part is found separated, the scholars (may Allah have mercy on them) differed regarding praying over this organ into three opinions: First Opinion: That praying over it is not legislated. Rather, prayer is offered for the greater part of the dead person; even if half of him is found complete, he is not prayed over; it must be more than the dead person [to be prayed over]. This is the saying of the Hanafis (4).",
    "foot_note": "1. See: Al-Majmu' 5/254. \n2. Al-Insaf fi Ma'rifat Al-Rajih min Al-Khilaf 2/538. \n3. Al-Mughni 2/401. \n4. See: Bada'i' Al-Sana'i' 1/311, and Fath Al-Qadir 2/112.",
    "book_id": "1039",
    "new_page_number": 27
  },
  {
    "serial_number": "4589070",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 243,
    "volume_number": 1,
    "text": "Al-Kasani said (1): [And prayer is not offered over a part of a human until the majority of him is found according to us; because if we prayed over this part, it would obligate us to pray over the remainder if we found it, leading to repetition]. Ibn Al-Humam said (2): [If limbs of a dead person or part of his body are found, they are not washed nor prayed over, but buried; unless more than half of his body is found, then he is washed and prayed over. Or if half is found along with the head, then he is prayed over. If he was split into two halves lengthwise and one half was found, it is not washed nor prayed over]. They reasoned and argued with the following: First Evidence: That what is established from the Sunnah of the Prophet (peace be upon him) is praying over dead people with their complete bodies, and it was not reported that the Prophet (peace be upon him) prayed over part of a body. The principle is adhering to the text (3). Second Evidence: That what is less than half is appended to hair and nail. It is discussed: That nails and hair have no life in them, so what has life cannot be measured against them. Second Opinion: The Malikis hold that it is not prayed over unless two-thirds or more are found, or half or more. If less than two-thirds but with the head, it is prayed over (4). Al-Dardir said (5): [And he is not washed if less than the 'Jull' - meaning less than two-thirds of the body - and the intended meaning of 'body' is other than the head. So if half the body is found, or more, but less than two-thirds with the head, he is not washed according to the relied-upon view; i.e., it is disliked, because the condition for washing is the presence of the deceased. If part of him is found, the ruling is for the majority/dominant part, and there is no ruling for the minor part].",
    "foot_note": "1. See: Bada'i' Al-Sana'i' 1/311. \n2. See: Fath Al-Qadir 2/112. \n3. See: Al-Awsat fi Al-Sunan wa Al-Ijma' wa Al-Ikhtilaf 5/411. \n4. See: Khulasat Al-Jawahir Al-Zakiyyah 1/28, Al-Sharh Al-Kabir 1/426, and Sharh Mukhtasar Khalil by Al-Kharashi 2/141. \n5. See: Al-Sharh Al-Kabir 1/426.",
    "book_id": "1039",
    "new_page_number": 28
  },
  {
    "serial_number": "4589071",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 244,
    "volume_number": 1,
    "text": "They have justifications for that, including: First Justification: That what is less than half is appended to hair and nail. It is discussed: That nails and hair have no life in them, so they are in the ruling of the separated part during life, thus other things containing life and soul cannot be measured against them. Second Justification: That if prayer is offered over a part of him like the hand, for example, it will lead to praying over the absent (Salat al-Gha'ib), which is not permissible in the Madhab (according to Malikis). It is discussed: That the preponderant view is not the opinion of impermissibility of praying over the absent absolutely (1). Also, your opinion implies that the dead person is not prayed over at all, even if found cut into two halves. Third Opinion: That prayer over the amputated organ, whether little or much, is legislated. This is the saying of the Shafi'is and Hanbalis, and the Fatwa of the Permanent Committee for Ifta in Saudi Arabia is upon it, and it is the choice of Ibn Uthaymeen (2). Al-Nawawi said (3): [The texts of Al-Shafi'i (may Allah have mercy on him) and the As-hab agreed that if a part is found of someone whose death we are certain of, it is washed and prayed over].",
    "foot_note": "1. Prayer over the Absent (Salat al-Gha'ib) has three schools of thought: First Opinion: Shafi'is and Hanbalis in their relied-upon view hold that absent prayer is legislated and permissible for a Muslim who dies in another land; the Qibla is faced and he is prayed over just as the present dead is prayed over. This is the view of Ibn Hazm Al-Zahiri. See for Shafi'is: Al-Bayan 3/75, Al-Majmu' 5/273. For Hanbalis: Al-Kafi 1/367, Al-Mughni 2/382, Al-Muhalla 3/263. Second Opinion: Hanafis and Malikis hold that absent prayer is not legislated. It is a narration from Ahmad. Malikis differed whether it is disliked or prohibited on two views. See for Hanafis: Al-Tajrid 3/1109, Al-Mu'tasar 1/108. For Malikis: Bidayat Al-Mujtahid 1/256, Al-Taj wa Al-Iklil 3/55. For Hanbalis: Al-Kafi 1/367. Third Opinion: Absent prayer is legislated for a Muslim if he died in a land where he was not prayed over. If he was prayed over where he died, he is not prayed over in absentia. Imam Al-Khattabi, Sheikh Al-Islam Ibn Taymiyyah, and Ibn Al-Qayyim chose this. See: Ma'alim Al-Sunan 3/311, Al-Mustadrak 'ala Majmu' Al-Fatawa 3/144, Zad Al-Ma'ad 1/501, Salat Al-Gha'ib p. 33, 32. \n2. See: Al-Majmu' 5/253, Al-Mughni 2/402, Fatawa Al-Lajnah Al-Da'imah 8/434, Fatawa Arkan Al-Islam 1/406. \n3. Al-Majmu' 5/253.",
    "book_id": "1039",
    "new_page_number": 29
  },
  {
    "serial_number": "4589072",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh Rulings Related to Extra, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 245,
    "volume_number": 1,
    "text": "Ibn Qudamah said (1): [If only part of the dead person is found, the Madhab is that it is washed and prayed over]. Al-Bahuti said (2): (If part of a confirmed dead person is found, other than hair, nail, and tooth, it is washed, shrouded, prayed over, and buried obligatorily. Then if the rest is found, it is prayed over and buried beside it]. They reasoned with the following: First Evidence: Consensus of the Companions (may Allah be pleased with them) on praying over what separated from the body, whether little or much. Al-Mawardi from the Shafi'is reported the Consensus, saying (3): [It was narrated that Umar bin Al-Khattab (may Allah be pleased with him) prayed over bones in Sham, and there is no opponent to those we mentioned, so it is established as Consensus]. Ibn Qudamah from the Hanbalis also reported the Consensus, saying: [For us is the Consensus of the Companions (may Allah be pleased with them)... then he mentioned the story of the hand of Abdul Rahman bin Attab bin Asid, that the people of Makkah prayed over it, and that was in the presence of the Companions, and we do not know any opponent among the Companions regarding that] (4). Second Evidence: Athar (narrations) from the Companions; Abu Ayyub (may Allah be pleased with him) prayed over a leg (5), Umar (may Allah be pleased with him) prayed over bones in Sham (6), and Abu Ubaydah (may Allah be pleased with him) prayed over heads in Sham (7). It is discussed: That the reported Athar are weak; Ibn Al-Mundhir and Al-Albani weakened them (8).",
    "foot_note": "1. Al-Mughni 2/401. \n2. Kashshaf Al-Qina' 2/124. \n3. See: Al-Hawi Al-Kabir 3/32. \n4. See: Al-Mughni 2/402. \n5. Recorded by Ibn Abi Shaybah in Al-Musannaf under number (11902) 3/38. \n6. Recorded by Ibn Abi Shaybah in Al-Musannaf under number (11903) 3/38, and Ibn Al-Mundhir in Al-Awsat number (3100) 5/410, wording: (From Amir, that Umar prayed over bones in Sham). \n7. Recorded by Ibn Abi Shaybah in Al-Musannaf under number (11900) 3/38, and Ibn Al-Mundhir in Al-Awsat number (3100) 5/410, wording: (From Khalid bin Ma'dan, he said: «When it was the day of Yarmouk, or some battles, a man from the polytheists would charge at a side of the Muslims and inflict damage, a Muslim man charged at him and killed him, and took a saddlebag he had. He looked and behold, inside were heads of Muslims. They were brought to Abu Ubaydah, so Abu Ubaydah ordered them washed, shrouded, embalmed, and he prayed over them»). See: Masa'il Al-Imam Ahmad narrated by his son Abdullah 1/141. \n8. Ibn Al-Mundhir said: What was narrated from Umar and Abu Ubaydah is not established. See: Al-Awsat 5/411. Al-Albani said in Al-Irwa number (715) 3/169: (Weak suspended narrations/Mawqufat).",
    "book_id": "1039",
    "new_page_number": 30
  },
  {
    "serial_number": "4589073",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 246,
    "volume_number": 1,
    "text": "Third Evidence: The sanctity of a part is like the sanctity of the whole, especially if that part was a locus of life. If a part of him is gone, the sanctity of what remains is not gone, and one must perform upon what remains of his body the washing, prayer, and burial, as is the Sunnah for the dead (1). Al-Qurtubi said (2): [The body of a believer has sanctity; so whatever falls from it or is removed from it, its protection from violation remains standing. It is a duty to bury it, just as if he had died he would be buried. So if a part of him dies, his sanctity is likewise established by burying it, so that it does not scatter or fall into fire or into filthy dumps]. The most correct view—and Allah knows best—is according to the following detail: 1 - If the amputated limb belongs to a deceased person who has already been prayed over, it is washed, shrouded, and buried, but it is not prayed over again, as the prayer over his whole suffices for the prayer over a part of him. 2 - If the severed limb belongs to a deceased person who was not prayed over due to his body being lost, or torn apart in a way that it could not be gathered, then the limb is washed, shrouded, prayed over, and buried (3). 3 - If the separated limb belongs to a deceased person who has not been prayed over, and the rest of his body is present, it is placed with the rest of his body so that prayer is performed over all his parts in a single prayer. 4 - If the limb belongs to a living person, it is shrouded and then buried, but it is not prayed over, because praying over the separated limb would result in praying over him twice. In this topic, the sanctity of the believer and his dignity before Allah becomes clear, as well as the comprehensiveness of the rulings of the religion and their suitability for every time and place. Furthermore, a human must generally protect himself, and his limbs specifically, as this falls under the five necessities that the Sharia came to preserve and maintain.",
    "foot_note": "1. See: Al-Bayan fi Madhhab Al-Imam Al-Shafi'i 3/76, Bidayat Al-Mujtahid 1/256, and Al-Awsat fi Al-Sunan wa Al-Ijma' wa Al-Ikhtilaf 5/410.\n2. Tafsir Al-Qurtubi 2/102.\n3. Ibn Qudamah said in Al-Mughni 2/401: (Section: If only part of the deceased is found, the Madhhab is that it is washed and prayed over. This is the saying of Al-Shafi'i. Ibn Mansur reported from Ahmad that the limbs are not prayed over. Al-Khallal said: Perhaps this is an old saying of Abu Abdullah [Imam Ahmad], but what became established as the view of Abu Abdullah is that the limbs are prayed over).",
    "book_id": "1039",
    "new_page_number": 31
  },
  {
    "serial_number": "4589074",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 247,
    "volume_number": 1,
    "text": "Requirement Six: The ruling on transplanting organs back into the owner's body after they have been severed. This contains two issues: Issue One: Transplanting an organ severed in a situation other than Hadd (fixed punishment) or Qisas (retribution). Issue Two: Transplanting an organ severed in a Hadd or Qisas. A human may suffer the amputation of one of his limbs, such as a hand, finger, leg, ear, or otherwise, due to a traffic accident, a fall from a high place, or due to modern machinery in factories. Alternatively, the amputation may be due to a Hadd from the Hudud, such as for theft or banditry (Hirabah), or for any criminal cause. Modern medicine has—by the grace of Allah—reached the ability to restore the organ after its excision and amputation by suturing nerves and tendons and connecting blood vessels, provided there is no long time lapse, no contamination, and no tearing in a way that prevents its restoration (1). Therefore, scholars have differentiated between what was cut in a Hadd or Qisas, to which a private right is attached, and what was separated due to an accident of time, to which no one's right is attached. This is what we will address in this requirement as follows: Issue One: Transplanting an organ severed in a situation other than Hadd or Qisas. Jurists differed regarding this amputated limb in terms of its transplantation and restoration to its place. The cause of the difference is the purity or impurity of the limb after its separation. Those who said it is pure permitted its restoration and transplantation into its owner's body, and those who said it is impure prevented that. Some distinguished between human parts: some have life, sensation, and blood attached to them, like a hand or leg, while other human parts do not have life attached, like a tooth. The disagreement consisted of three views, as follows:",
    "foot_note": "1. See: The Treatise on Jurisprudential Rulings Related to Replanting Amputated Organs via Microsurgery p. 478, the Decision of the Islamic Fiqh Academy in its fourth session in the year 1408 AH, Rulings on Medical Surgery and Its Consequences by Dr. Muhammad bin Muhammad Al-Mukhtar Al-Shanqiti 1/411.",
    "book_id": "1039",
    "new_page_number": 32
  },
  {
    "serial_number": "4589075",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 248,
    "volume_number": 1,
    "text": "The First View: Permissible unconditionally. This is the view of the Malikis, and a view in the Shafi'i and Hanbali schools, and the decision issued by the Islamic Fiqh Academy (1). In the third requirement (2), regarding the explanation of the first view on the issue of the ruling on separated parts in terms of purity and impurity, citations from the jurists of the schools were mentioned, along with their evidence and the manner of deduction. They also reasoned—in addition to what was previously mentioned—for the permissibility of restoring the organ with the following: First Evidence: What the Prophet (peace be upon him) did when he restored the pupil of the eye of Qatada bin Al-Nu'man (may Allah be pleased with him) when he was injured on the day of Badr, and he returned it to its place (3). Manner of Deduction: Human organs remain pure even after separation; otherwise, if they were impure, the Prophet (peace be upon him) would not have put it back. It is debated: That this is one of the specificities of the Prophet (peace be upon him), so others do not share in it. It is answered: That a claim of specificity requires evidence, and there is no evidence here, so the ruling remains general. Second Evidence: The Hadith of Aisha, \"The Prophet (peace be upon him) kissed Uthman bin Maz'un while he was dead and he was weeping\" (4). Third Evidence: What Al-Bukhari narrated from Ibn Abbas and Aisha (may Allah be pleased with them) that Abu Bakr (may Allah be pleased with him) \"kissed the Prophet (peace be upon him) after his death\" (5).",
    "foot_note": "1. See: Hashiyat Al-Dasuqi with Al-Sharh Al-Kabir 1/54, Minah Al-Jalil Sharh Mukhtasar Khalil 1/51, Al-Majmu' 1/232, Al-Mughni 1/59, Al-Kafi 1/50, Sahih Al-Bukhari 1/264, Majmu' Al-Fatawa 22/201, Al-Fatawa Al-Kubra 1/272, Fath Al-Bari by Ibn Rajab 1/343, Fath Al-Bari by Ibn Hajar 1/274, Nayl Al-Awtar 1/79. See also the Treatise on Jurisprudential Rulings Related to Replanting Amputated Organs via Microsurgery p. 478, and the decision of the Islamic Fiqh Academy in its fourth session in 1408 AH.\n2. See Requirement Three (p. 12).\n3. Narrated by Ibn Abi Shaybah in Al-Musannaf No. (32364) 6/400, and Al-Haythami in Al-Maqsad Al-Ali fi Zawa'id Abi Ya'la Al-Mawsili No. (1277) 3/156.\n4. Narrated by Ahmad in Al-Musnad No. (25712) 42/469, and Al-Tirmidhi in his Jami' No. (989) 3/305 and said: The Hadith of Aisha is Hasan Sahih. Narrated by Al-Hakim in Al-Mustadrak No. (1334) 1/514. Al-Albani declared it weak in Tahqiq Al-Mishkat No. (1623) 1/509.\n5. Narrated by Al-Bukhari in his Sahih, Book of Maghazi, Chapter: The Illness and Death of the Prophet (pbuh), No. (4455) 6/14.",
    "book_id": "1039",
    "new_page_number": 33
  },
  {
    "serial_number": "4589076",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 249,
    "volume_number": 1,
    "text": "Manner of Deduction from the two Hadiths: That the Prophet (peace be upon him) kissing Uthman bin Maz'un (may Allah be pleased with him) after his death, and Abu Bakr (may Allah be pleased with him) kissing the Prophet (peace be upon him), is evidence of the purity of the dead. Fourth Evidence: We have been commanded to wash the dead as an act of worship, and an impure thing is not washed as an act of worship because washing it increases its impurity (1). The Second View: The transplantation of a severed organ is not permissible at all, because it has become impure. This is the view of Muhammad bin Al-Hasan from the Hanafis (2), a view in the Maliki school (3), the relied-upon view among the Shafi'is (4), and a narration from Ahmad (5), because those who say hair is impure upon separation will, with greater reason, say other organs are impure (6). In the third requirement, explaining the second view on the issue of separated parts regarding purity and impurity, citations from the jurists of the schools were mentioned, along with their evidence and the manner of deduction, so refer back to it (7). The Third View: Differentiating between what contains life and blood, such as a hand, leg, and similar parts, which may not be restored, and what does not contain life, such as a tooth, which is permissible. This is the relied-upon view among the Hanafis (8), a view among the Shafi'is, and a narration in the school of Ahmad (9). In the third requirement (10), explaining the third view on the issue of separated parts regarding purity and impurity, citations from the jurists of the schools were mentioned, along with their evidence, manner of deduction, and discussion.",
    "foot_note": "1. Sharh Al-Qastallani (Irshad Al-Sari li Sharh Sahih Al-Bukhari) 7/202.\n2. Al-Mabsut 26/98, Tuhfat Al-Fuqaha 1/52, Bada'i' Al-Sana'i' 7/315.\n3. Mawahib Al-Jalil 1/99, Al-Taj wa Al-Iklil 1/141, Al-Sharh Al-Kabir wa Hashiyat Al-Dasuqi 1/53.\n4. Al-Bayan fi Madhhab Al-Imam Al-Shafi'i 1/424, Al-Majmu' 1/232, Rawdat Al-Talibin 1/15.\n5. Al-Insaf 1/93, Sharh Al-Zarkashi 1/162, Al-Mubdi' 1/55, Al-Mughni 1/60.\n6. See Requirement Three (p. 13).\n7. See Requirement Three (p. 15).\n8. See: Tuhfat Al-Fuqaha 1/52, Bada'i' Al-Sana'i' 1/63, Al-Bahr Al-Ra'iq 1/112, Al-Durr Al-Mukhtar wa Hashiyat Ibn Abidin 1/207.\n9. See for Hanafis: Tuhfat Al-Fuqaha 1/52, Bada'i' Al-Sana'i' 1/63, Al-Jawhara Al-Nayyira 1/16; for Shafi'is: Al-Bayan fi Madhhab Al-Imam Al-Shafi'i 1/424, Al-Majmu' 1/232; for Hanbalis: Sharh Al-Zarkashi 1/162, Al-Mubdi' 1/55, Al-Insaf 1/93.\n10. See Requirement Three (p. 11).",
    "book_id": "1039",
    "new_page_number": 34
  },
  {
    "serial_number": "4589077",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 250,
    "volume_number": 1,
    "text": "Preponderance: The most correct view—and Allah the Exalted is Higher and knows best—is the first view, which is the view of the purity of the amputated and separated organ. Based on this, it is permissible to restore and transplant it again, for the following matters: 1 - Due to the strength of their evidence. 2 - Its agreement with the objectives of the Sharia in removing hardship and facilitating for the accountable. 3 - That it involves applying the rules of Fiqh by committing the lesser of two harms. 4 - Due to the refutations raised against the evidence of the other views (1). Issue Two: Transplanting an organ severed in a Hadd or Qisas. Perhaps it is appropriate, before mentioning the disagreement in this issue, to mention the legal objectives (Maqasid) upon which the legal ruling is built. Jurists have mentioned legal maxims and Sharia objectives related to Hudud and Qisas, the most prominent of which perhaps are the following: First: The primary objective of Hudud and Qisas is the preservation of the five necessities (Religion, Intellect, Life, Lineage/Honor, and Wealth). Second: Deterrence and restraint for the criminal himself, and for anyone whose soul tempts him to commit the crime. Third: Purifying the criminal from the sin. Fourth: Satisfying the victim or his heirs and removing the rage from their hearts. Fifth: Establishing security and stability in the land, so society lives in comfort and tranquility (2).",
    "foot_note": "1. Regarding the research of this issue, see the following references: Jurisprudential Rulings Related to Replanting Amputated Organs via Microsurgery by researcher Huda Bajbir, Research on the Ruling of Islamic Sharia in Connecting What Was Cut from Human Organs by Umar Al-Ashqar, Research by Dr. Bakr Abu Zaid in the Journal of the Islamic Fiqh Academy, Treatise: Rulings on Medical Surgery and Its Consequences by Dr. Muhammad bin Muhammad Al-Mukhtar Al-Shanqiti, Al-Fiqh Al-Muyassar by a group of authors, and Treatise: Benefiting from Human Parts in Islamic Jurisprudence by Ismatullah Inayatullah.\n2. See: Supplementary research at Imam Muhammad bin Saud Islamic University titled (Purposes of Punishment in Islamic Sharia and Positive Law) year 1406 AH, prepared by Raji Al-Sa'idi p. 87.",
    "book_id": "1039",
    "new_page_number": 35
  },
  {
    "serial_number": "4589078",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 251,
    "volume_number": 1,
    "text": "Looking at the legal evidence and the observed objectives, scholars have differed regarding transplanting a severed organ where the cause of amputation was Hadd or Qisas, into two views: The First View: Permissibility. This was said by Al-Shafi'i, Ibn Rushd of the Malikis, and it is a view in the Hanbali school preferred by Ibn Qudamah, and chosen by Wahbah Al-Zuhayli (1). Ibn Rushd said: [If retribution is exacted after they returned to their original state, so the ear or eye of the one retaliated against returned, then that is that. If they did not return, and the tooth or ear of the first one had returned, he has no claim. If the tooth or ear of the one from whom retaliation was taken returned, but the tooth or ear of the first one did not return, he pays the indemnity (Aql)] (2). And he said in Al-Umm regarding the issue of the victim returning his organ to its place: [If the victim does not reattach it, or wanted to reattach it but it did not attach, and he exacted retribution from the perpetrator, and he (the perpetrator) reattached it and it attached, the perpetrator is not liable for more than it being severed from him once. If the victim asks the governor to cut it from the perpetrator a second time, the governor does not cut it for retribution (Qawad), because he has performed retribution once...] (3). Ibn Qudamah said: [If a person's ear is cut off, and retribution is taken from him (the perpetrator), and the perpetrator reattaches his ear and it sticks, and the victim demands its removal, he does not have that right... and the retribution has been fulfilled, so no right remains for him against him... And the ruling for the tooth is like the ruling for the ear] (4). They argued with evidence including: First Evidence: That this is consistent with removing hardship which the Sharia came with. {And He has not placed upon you in the religion any difficulty} (5) and His saying: {Allah does not intend to make for you any difficulty} (6).",
    "foot_note": "1. See: Al-Umm 6/56, Al-Mughni 8/523, Al-Bayan wa Al-Tahsil 16/67. Transplanting an organ removed in Hadd, Journal of the Islamic Fiqh Academy Issue 6 Vol 3 pp. 2161-2179, Rulings on Medical Surgery 1/414, and Treatise: Benefiting from Human Parts in Islamic Jurisprudence p. 89.\n2. Al-Bayan wa Al-Tahsil 16/67.\n3. Al-Umm 6/56.\n4. Al-Mughni 8/523.\n5. Al-Hajj: 78.\n6. Al-Ma'idah: 6.",
    "book_id": "1039",
    "new_page_number": 36
  },
  {
    "serial_number": "4589079",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 252,
    "volume_number": 1,
    "text": "Second Evidence: That if amputation and separation of the organ from the body is permissible when there is a need, then it is more appropriate that returning it is permissible when it exists. Third Evidence: That after the implementation of the Hadd, the ruler has no authority over the convicted, just as he has no right to prevent him from fitting a prosthetic hand, which is among the things Allah has subjected for man to benefit from and permitted him to do. It was debated: That this is an analogy with a discrepancy, because the restored organ was ordered by Sharia to be removed from the body, so returning it is like implying a correction to the Sharia. Fourth Evidence: That the legal text came only with cutting, so whatever is beyond that (which is its transplantation) remains on the original principle of permissibility. It was debated: That the text came with cutting and cauterization (Hasm) as in the Hadith of Abu Huraira—which will be mentioned in the evidence for the second view—and with cutting and hanging as in the Hadith of Fadalah—which will be mentioned in the evidence for the second view—and both serve as preventions for returning the organ. Fifth Evidence: That the Sharia came to bring benefits and ward off harms, and in cutting there is harm to the body, while in returning it there is an apparent benefit. It is debated: That the public interest, which is suppressing people and deterring them, takes precedence over private interest (1). The Second View: Non-permissibility. This is a view in the Shafi'i school (2). It is the opinion of Bakr Abu Zaid, Muhammad Taqi Usmani, Muhammad bin Abdul Rahman Al-Sheikh, Abdullah Sulaiman Bin Mani', and Sheikh Moulay Mustafa Al-Alawi, head of the Association of Scholars of Morocco and Senegal (3). It was also stated by the Council of the Islamic Fiqh Academy held in",
    "foot_note": "1. See: Al-Muwafaqat 3/57, and Legal Maxims and their Applications in the Four Schools 1/235.\n2. Al-Nawawi said in Al-Majmu': (If his tooth was pulled out and he returned it to its place, our Iraqi companions said: It is not permissible because it is impure. This is based on their method that a human organ separated during his life is impure, which is the text in Al-Umm. However, the Madhhab is its purity, and this is the correct view according to the Khurasanis). See: Al-Majmu' 3/139, Rawdat Al-Talibin 9/197.\n3. Journal of the Islamic Fiqh Academy 6/1476.",
    "book_id": "1039",
    "new_page_number": 37
  },
  {
    "serial_number": "4589080",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 253,
    "volume_number": 1,
    "text": "the session of its sixth conference in Jeddah, Kingdom of Saudi Arabia, from 17-23 Sha'ban 1410 AH (1). This view was also issued in the decision of the Council of Senior Scholars in the Kingdom of Saudi Arabia No. (136) dated 17/6/1406 AH. They argued with evidence including: First Evidence: The saying of the Almighty: {The [unmarried] woman or [unmarried] man found guilty of sexual intercourse - lash each one of them a hundred lashes, and do not be taken by pity for them in the religion of Allah, if you should believe in Allah and the Last Day. And let a group of the believers witness their punishment} (2). And the Almighty said: {[As for] the thief, the male and the female, amputate their hands in recompense for what they committed as a deterrent [punishment] from Allah. And Allah is Exalted in Might and Wise} (3). Manner of Deduction: That restoring the cut organ after the establishment of Allah's Hadd upon it involves pity and mercy, which contradicts the text of the verse. Also, the recompense is not complete except with cutting, and the deterrent (Nakal) is not complete except by seeing the hand cut off. Second Evidence: The Hadith of Abu Huraira (may Allah be pleased with him) in which the Prophet (peace be upon him) said regarding the thief: \"Take him and cut him, then cauterize (Hasam) him (4), then bring him to me\" (5). Manner of Deduction: That the command for cauterization is evidence of the prohibition of restoring it. It is answered: That cauterization was prescribed as a mercy to him, so that the wound does not hemorrhage blood causing him to die. Third Evidence: The Hadith of Fadalah (may Allah be pleased with him) who said: \"I saw the Messenger of Allah (peace be upon him) when a thief was brought to him, so he ordered concerning him, and his hand was cut off. Then he ordered regarding it, and it was hung on his neck\" (6).",
    "foot_note": "1. Journal of the Islamic Fiqh Academy 6/1599.\n2. Al-Nur: 2.\n3. Al-Ma'idah: 38.\n4. His saying (Ihsimuhu) means cauterize him so the blood stops. See: Al-Ayn 3/153, Jamharat Al-Lugha 1/534, Tahdhib Al-Lugha 4/199. Narrated by Al-Bazzar in Al-Musnad No. (8259) 15/46, Al-Hakim in Al-Mustadrak No. (8150) 4/422 (He said: This Hadith is Sahih according to Muslim's conditions though they did not narrate it), Al-Daraqutni in his Sunan No. (3163) 4/97, Al-Bayhaqi in Al-Sunan Al-Kubra No. (17254) 8/471. Authenticated by Ibn Al-Mulaqqin in Al-Badr Al-Munir 8/674. Al-Albani weakened it as connected (Mawsul) in Al-Irwa, but authenticated it as Mursal 8/83.\n5. Narrated by Al-Bazzar in Al-Musnad No. (8259) 15/46, Al-Hakim in Al-Mustadrak No. (8150) 4/422, Al-Daraqutni in his Sunan No. (3163) 4/97, Al-Bayhaqi in Al-Sunan Al-Kubra No. (17254) 8/471. Authenticated by Ibn Al-Mulaqqin in Al-Badr Al-Munir 8/674. Al-Albani weakened it as connected (Mawsul) in Al-Irwa, but authenticated it as Mursal 8/83.\n6. Narrated by Ahmad in Al-Musnad No. (23946) 39/370, Al-Tirmidhi in his Jami' No. (1447) 4/51 (He said: This Hadith is Hasan Gharib), Abu Dawud in his Sunan No. (4411) 6/463, Al-Tabarani in Al-Kabir No. (769) 18/299, Al-Bayhaqi in Al-Sunan Al-Kubra No. (17270) 8/478. Authenticated by Ibn Al-Mulaqqin in Al-Badr Al-Munir 8/675, weakened by Al-Albani in Al-Irwa 8/84.",
    "book_id": "1039",
    "new_page_number": 38
  },
  {
    "serial_number": "4589081",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 254,
    "volume_number": 1,
    "text": "Manner of Deduction: Hanging the thief's hand on his neck is a legal ruling considered part of the completion of the punishment and the Hadd. Hudud were prescribed for the sake of rebuke, deterrence, and making an example (Nakal) for the criminal and others, and to maintain the intent of the punishment by the permanence of its effect as a lesson and warning, and to cut off the roots of crime. By this, the objectives of the Sharia are observed, and restoring it [the hand] necessitates missing that, so doing it is not permissible. It is answered: That one of the objectives of punishment is a lesson for others, and the cutting of the limb from the criminal suffices as an example and similarity to what he did, and as retribution for that. There is no evidence for a perpetual lesson; how many lessons have passed in a moment, yet their news remained a lesson throughout history (1). Fourth Evidence: That the cut organ became impure by separation, so its restoration is not permissible lest it leads to the invalidation of worship. It is answered: That whatever is severed from a living being is like its carrion (Maytah), and the carrion of a human is pure. Therefore, that organ which was severed must be pure. We have previously mentioned in the third requirement that the correct view is the purity of organs separated from the human body (2). Ibn Al-Arabi said in response to the view of those who argued based on impurity: [This is a mistake. Whoever it was hidden from him was ignorant that returning it and its return to its form does not necessitate its return to its ruling, because the impurity was in it due to separation, and it has returned connected. The rulings of Sharia are not a description of the substances themselves, but rather they are rulings returning to Allah's saying about them and His reporting about them] (3). Preponderance: What is preponderant—and Allah knows best—is the second view, which is the non-permissibility of restoring the organ that was severed in a Hadd or Qisas (4), for the following reasons:",
    "foot_note": "1. Journal of the Islamic Fiqh Academy 6/1486.\n2. Requirement Three p. 12.\n3. Ahkam Al-Quran 2/134.\n4. Benefit: The decision of the Council of the Islamic Fiqh Academy stated that it is permissible to restore an organ cut by Hadd or Qisas in the following cases: A - If the victim gives permission after the execution of Qisas to return the cut organ of the perpetrator. B - If the victim was able to restore his organ cut from him. C - It is permissible to restore the organ that was excised in a Hadd or Qisas due to an error in judgment or execution.",
    "book_id": "1039",
    "new_page_number": 39
  },
  {
    "serial_number": "4589082",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 255,
    "volume_number": 1,
    "text": "First: Due to the validity and strength of the textual and rational evidence for those saying it is not permissible. Second: Due to the refutations raised against most of the evidence of those saying it is permissible. Third: That restoring it involves a lack of justice and fairness for the victim, which are among the intended meanings of the Lawgiver. Fourth: That the purpose of the legitimacy of Qisas is rebuke and deterrence, not just pain. Maintaining the intent of the punishment by the permanence of its effect as a lesson and warning, and cutting off the roots of crime, and announcing these punishments by their permanence, realizes its effect on the criminal and others who witnessed the Hadd or knew of it (1). Requirement Seven: Cutting excess parts from the human body. This contains two issues (2). Issue One: Cutting and removing excess parts out of necessity and need. Issue Two: Cutting and removing excess parts for cosmetic purposes. The Sharia came with the command to protect the human being and his organs, and clarified that the intended prohibited alteration is what remains on the body like tattooing (3) and filing teeth for gaps (4) and similar things. As for what does not remain, like kohl and henna, and things which the Muslim is ordered to remove or shave like the characteristics of Fitra (natural disposition), the prohibition does not cover them. However, a human may be born with some excess parts, whether in the hand, foot, teeth, or similar areas. The contemplator of this issue finds that it requires detailed breakdown,",
    "foot_note": "1. See: Al-Fiqh Al-Islami wa Adillatuh 7/5184, Al-Fiqh Al-Muyassar 12/38. Regarding the research of this issue, see the following references: Jurisprudential Rulings Related to Replanting Amputated Organs via Microsurgery by researcher Huda Bajbir, Reconnecting What Was Cut from the Human Body by Umar Al-Ashqar, Research by Dr. Bakr Abu Zaid in the Journal of the Islamic Fiqh Academy, and Treatise: Rulings on Medical Surgery and Its Consequences by Dr. Muhammad bin Muhammad Al-Mukhtar Al-Shanqiti.\n2. Regarding the research of this issue, see: Dorar Al-Saniyah website supervised by Alawi Al-Saqqaf, and Rulings of Cosmetic Surgery in Islamic Jurisprudence by Dr. Muhammad Uthman Shabir.\n3. To prick the limb with a needle until blood flows, then stuff the prick site with kohl, lime, or ink so it turns green or blue. See: Gharib Al-Hadith by Al-Qasim bin Sallam 1/167, Tahdhib Al-Lugha 11/297.\n4. It is filing the teeth with a file or similar tool to sharpen and beautify them. It is also called 'Washr', which is filing the incisors and canines to create a gap between them. See: Al-Ayn 6/127, Gharib Al-Hadith by Al-Qasim bin Sallam 3/239.",
    "book_id": "1039",
    "new_page_number": 40
  },
  {
    "serial_number": "4589083",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 256,
    "volume_number": 1,
    "text": "for the removal of these excesses may be out of necessity, or their removal may be for improvement and beautification. The detail in this issue is as follows: Issue One: Cutting and removing excesses out of necessity and need. It is good to differentiate between necessity (Darurah) and need (Hajah). Necessity: It is distress and hardship at its utmost limit, such that it reaches a point where one fears destruction for himself, or approaching destruction, by the loss of his essential interests. Necessity drops the sin and imposes the guarantee (Damman/liability), as compulsion does not invalidate the right of another (1). As for Need: It is a rank lower than necessity. What is permitted by necessity is not permitted by it, except that it descends to the status of necessity regarding a single person if it is general. Need does not justify taking another's property; if someone took it, he would be sinful and liable (2). Based on that, the majority of jurists from the Hanafis, Malikis, Shafi'is, and Hanbalis (3) have gone to the view that there is no harm in removing such excesses that might harm the human, or cause hindrance in performing his function or the perfection of his performance, or cause him embarrassment in society. I have not encountered an opposing opinion. This is the choice of Ibn Jarir Al-Tabari (4), Muhammad bin Ibrahim, Ibn Baz, Ibn Uthaymeen, Muhammad Uthman Shabir, and Al-Shanqiti (5), and it is the Fatwa of the Standing Committee in the Kingdom of Saudi Arabia (6).",
    "foot_note": "1. Ahkam Al-Quran by Al-Jassas 1/159, Encyclopedia of Fiqh Maxims 1/61.\n2. Shifa Al-Ghalil by Al-Ghazali p. 246; Al-Ashbah wa Al-Naza'ir by Al-Suyuti p. 88, Encyclopedia of Fiqh Maxims 1/61.\n3. See: Lawami' Al-Durar 11/110, Al-Jawhara Al-Nayyira 2/132, Majma' Al-Anhur 2/645, Minah Al-Jalil 7/494, Al-Mughni 8/468, Al-Mubdi' 7/313.\n4. Imam Al-Qurtubi quoted him in his Tafsir (Al-Jami' li Ahkam Al-Quran) 5/393, Ibn Hajar in Al-Fath 10/377, and Al-Mubarakpuri quoted him in Tuhfat Al-Ahwadhi 8/55.\n5. Fatawa and Treatises of His Eminence Sheikh Muhammad bin Ibrahim 3/165, Majmu' Fatawa Ibn Baz 9/420, Majmu' Fatawa and Treatises of Ibn Uthaymeen 11/122, Rulings on Medical Surgery p. 305.\n6. Fatawa of the Standing Committee 25/58.",
    "book_id": "1039",
    "new_page_number": 41
  },
  {
    "serial_number": "4589084",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 257,
    "volume_number": 1,
    "text": "He said in Minah Al-Jalil (1) [Unless this extra part harms him and causes him pain, such as a finger or a molar, then there is no harm in removing it in any case]. And he said in Al-Mughni: (Because these excesses have no beauty in them; they are rather a disfigurement in creation, and a defect by which a sold item would be returned and value decreased] (2). They argued for permissibility with the following: First Evidence: The Hadith of Abdullah bin Masud (may Allah be pleased with him) who said: \"Allah has cursed the women who do tattoos and those who have them done, those who pluck eyebrows, and those who file teeth for beauty (3), those who change the creation of Allah\" (4). Al-Nawawi (may Allah have mercy on him) said (5): [As for his saying: (those who file teeth for beauty), its meaning is they do that seeking beauty. In it is an indication that the forbidden is what is done seeking beauty. As for if she needed it for treatment, or a defect in the tooth and the like, then there is no harm]. Al-Shawkani said: [Its appearance implies that the mentioned prohibition is only if the intent is beautification, not for a disease or ailment, for then it is not prohibited] (6). Second Evidence: The Hadith of Abdul Rahman bin Tarfa (may Allah be pleased with him) that his grandfather Arfajah bin As'ad \"had his nose cut off on the Day of al-Kulab (7) in the Jahiliyyah, so he adopted a nose of silver, but it caused a stench for him. So he asked the Prophet (peace be upon him), and he ordered him to adopt a nose of gold\" (8).",
    "foot_note": "1. Minah Al-Jalil 7/494, See: Lawami' Al-Durar 11/110.\n2. Al-Mughni 8/468.\n3. Al-Washm (Tattooing): Wounding the skin, pricking it with a needle, and stuffing it with indigo, kohl, or fat smoke and other black substances. Al-Namas: Plucking hair. Al-Falaj: A gap between the incisors and canines of the teeth, done by an old woman to resemble young girls. See: Al-Mughrib fi Tartib Al-Mu'rib 1/473, Al-Ta'rifat Al-Fiqhiyyah 1/255.\n4. Narrated by Al-Bukhari in his Sahih, Book of Clothing, Chapter: Those who file teeth for beauty, No. (5931) 7/164, and Muslim in his Sahih, Book of Clothing and Adornment, Chapter: Prohibition of the action of the hair extender, the one getting extensions, the tattooer, the one getting tattoos, the plucker, the one getting plucked, the teeth filers, and those changing Allah's creation, No. (2125) 3/1678.\n5. Sharh Al-Nawawi ala Sahih Muslim 14/107.\n6. Nayl Al-Awtar 6/229.\n7. It is with a Damma and lightened (lam), the name of a water source. It refers to the First Day of al-Kulab and the Second Day of al-Kulab, which were between the kings of Kinda and Banu Tamim. See: Al-Sharh Al-Kabir ala Al-Muqni' 7/44, Majma' Bahr Al-Anwar 4/427.\n8. Narrated by Abu Dawud Al-Tayalisi in his Musnad No. (1354) 2/586, Ahmad in Al-Musnad No. (19006) 31/344 (Its investigator Shu'ayb Al-Arna'ut said: Its Isnad is Hasan), Al-Tirmidhi in his Jami' and declared it Hasan No. (1770) 4/240, Al-Nasa'i in Al-Sunan Al-Kubra No. (9400) 8/363, Ibn Hibban in his Sahih No. (5462) 12/276, Al-Bayhaqi in Al-Sunan Al-Kubra No. (4221) 2/597. Al-Albani declared it Hasan in Sahih wa Da'if Sunan Al-Tirmidhi 4/270.",
    "book_id": "1039",
    "new_page_number": 42
  },
  {
    "serial_number": "4589085",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 258,
    "volume_number": 1,
    "text": "Manner of Deduction: The Prophet (peace be upon him) ordered Arfajah bin As'ad to remove the defect and attach a nose cosmetically. This indicates by implication the permissibility of removing what contains disfigurement or harm, physically or socially. Third Evidence: General Hadiths that indicate medical treatment and the command for it, including: First Hadith: The Hadith of Jabir (may Allah be pleased with him) from the Prophet (peace be upon him) that he said: \"For every disease there is a cure. So if the cure for the disease hits the target, it is cured by the permission of Allah Almighty\" (1). Second Hadith: The Hadith of Abu Darda (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Indeed Allah Almighty has sent down the disease and the cure, and He has made for every disease a cure, so treat yourselves, but do not treat yourselves with something prohibited\" (2). Fourth Evidence: Applying legal maxims and Sharia objectives such as the maxim: (Harm must be removed) (3), and the maxims falling under it like (Necessities permit prohibitions), and the maxim: (Need descends to the status of necessity, whether general or specific), and that the Sharia came to bring benefits and ward off harms. They stipulated conditions for permissibility, including (4): First: That success of the operation is thought most likely, and the danger to the person from whom it is removed is secured. Second: That this be done with permissible, lawful medications. Third: That the intent of the cosmetic surgery is removing the defect; and beautification comes as a consequence. Fourth: That in keeping it there is greater harm than in removing it, such as psychological illness for its owner.",
    "foot_note": "1. Narrated by Muslim in his Sahih, Book of Peace, Chapter: For every disease there is a cure and the recommendation of treatment, No. (2204) 4/1729.\n2. Narrated by Abu Dawud in his Sunan No. (3874) 6/23, Al-Bayhaqi in Al-Sunan Al-Kubra No. (19681) 10/9.\n3. See: Al-Ashbah wa Al-Naza'ir by Al-Subki 1/45, Al-Ashbah wa Al-Naza'ir by Ibn Nujaym 1/78, Al-Manthur fi Al-Qawa'id Al-Fiqhiyyah 2/317, Al-Ashbah wa Al-Naza'ir by Al-Suyuti 1/84.\n4. See for further reading: Cosmetic Surgery by Dr. Hassan Shamsi Pasha p. 8 and following, Rulings on Medical Surgery by Al-Shanqiti, and Cosmetic Surgery: A Jurisprudential Study by Dr. Salih bin Muhammad Al-Fawzan.",
    "book_id": "1039",
    "new_page_number": 43
  },
  {
    "serial_number": "4589086",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 259,
    "volume_number": 1,
    "text": "Fifth: That it is determined that the person must undergo the surgical operation, such that no other means exists that can take the place of that operation in fulfilling the need or pushing away the necessity. Issue Two: Cutting and removing excesses for cosmetic and beautification purposes. Cosmetic surgery is defined as: [A medical surgical procedure aiming to improve the appearance or function of visible body parts] (1). The intent of it is improving appearance and achieving a more beautiful image, without the existence of necessary or needy motives necessitating the surgery, such as filing teeth for gaps, filing them, plucking eyebrows, or removing signs of aging. Allah created man and perfected his creation, and formed him and perfected his form, as the Almighty said: {We have certainly created man in the best of stature} (2), and He said: {Allah It is He who made for you the earth a place of settlement and the sky a ceiling and formed you and perfected your forms} (3). Therefore, jurists differed on removing excess organs for improvement and beautification into two views: The First View: Prohibition and banning. This is the view of the general body of jurists from the schools, and the choice of Ibn Jarir Al-Tabari, Ibn Hajar, Al-Shawkani, and Ibn Uthaymeen (4). Al-Tabari said, summarized (5): [It is not permissible for a woman to change anything of her creation which Allah created her upon, by addition or subtraction, seeking beauty, neither for the husband nor for anyone else, such as one who has",
    "foot_note": "1. See: Cosmetic Surgery: A Jurisprudential Study by Dr. Salih bin Muhammad Al-Fawzan p. 20.\n2. Al-Tin: 4.\n3. Ghafir: 64.\n4. See: Lawami' Al-Durar 11/110, Al-Jawhara Al-Nayyira 2/132, Majma' Al-Anhur 2/645, Minah Al-Jalil 7/494, Al-Mughni 8/468, Al-Mubdi' 7/313, Al-Insaf 1/125, Al-Jami' li Ahkam Al-Quran 5/393, Sharh Al-Nawawi ala Sahih Muslim 14/107, Nayl Al-Awtar 6/229, Al-Sharh Al-Mumti' 8/313.\n5. Imam Al-Qurtubi quoted him in his Tafsir (Al-Jami' li Ahkam Al-Quran) 5/393, Ibn Hajar quoted him in Al-Fath 10/377, and Al-Mubarakpuri quoted him in Tuhfat Al-Ahwadhi 8/55.",
    "book_id": "1039",
    "new_page_number": 44
  },
  {
    "serial_number": "4589087",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 260,
    "volume_number": 1,
    "text": "an extra tooth so she pulls it out, or a long one so she cuts from it, or one whose hair is short or scanty so she lengthens it or thickens it with someone else's hair. All of that is included in the prohibition, and it is changing Allah's creation...]. Al-Qurtubi quoted from Iyad (1): That whoever is created with an extra finger or an extra organ, it is not permissible for him to cut it or remove it, because it is changing Allah's creation (2). Al-Nawawi (may Allah have mercy on him) said (3): As for his saying: [Those who file teeth for beauty), its meaning is they do that seeking beauty. In it is an indication that the forbidden is what is done seeking beauty...]. Ibn Hajar said in Al-Fath (4): [It is understood from it that the blameworthy one is she who does that for the sake of beauty]. Al-Shawkani said (5): [Its appearance implies that the mentioned prohibition is only if the intent is beautification...]. Ibn Uthaymeen said after mentioning the permissibility of cutting if it is to remove a defect (6): (... But if it were for cosmetic purposes, it would be forbidden. For this reason, the Prophet (peace be upon him) cursed: (The plucker and the one getting plucked)) (7) End quote. They argued with the following: First Evidence: The saying of the Almighty: {And I will mislead them, and I will arouse in them [sinful] desires, and I will command them so they will slit the ears of cattle, and I will command them so they will change the creation of Allah. And whoever takes Satan as an ally instead of Allah has certainly sustained a clear loss} (8).",
    "foot_note": "1. Referring to: Qadi Iyad bin Musa bin Iyad Al-Yahsubi Al-Sabti Al-Maliki. He has works including: Ikmal Al-Mu'allim, Al-Shifa, and Mashariq Al-Anwar.\n2. Tafsir Al-Qurtubi (Al-Jami' li Ahkam Al-Quran) 5/393.\n3. Sharh Al-Nawawi ala Sahih Muslim 14/107.\n4. Fath Al-Bari 10/372.\n5. Nayl Al-Awtar 6/229.\n6. Al-Sharh Al-Mumti' 8/313.\n7. Al-Namisah: Is the one who plucks hair from her face or another's face. Al-Mutanammisah: Is the one who asks for that to be done to her. See: Mashariq Al-Anwar ala Sihah Al-Athar 2/13.\n8. Al-Nisa: 119.",
    "book_id": "1039",
    "new_page_number": 45
  },
  {
    "serial_number": "4589088",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 261,
    "volume_number": 1,
    "text": "Manner of Deduction: Removing excesses that have no harm or disfigurement on their owner is changing Allah's creation, and it is from the action and beautification of Satan, which is prohibited. Second Evidence: From Abdullah bin Masud (may Allah be pleased with him) that he said: \"Allah has cursed the women who do tattoos, those who have them done (1), those who pluck eyebrows, and those who file teeth for beauty, those who change the creation of Allah\" (2). Manner of Deduction: The Hadith arranged expulsion and banishment from Allah's mercy for the one who changed Allah's creation by removing hair etc., or filing teeth for gaps, or filing. The text in the Hadith specified that beauty is intended by that. Third Evidence: That removal and excision might lead to hemorrhage resulting in death. It is answered: That this is not expected with the development of modern medicine. Fourth Evidence: That it contains a type of fraud and deception, especially regarding matters of marriage. Ibn Hajar quoted Imam Al-Khattabi in Al-Fath saying: [The severe threat was only narrated regarding these things due to the fraud and deception in them. If any of it were permitted, it would be a means to permitting other types of fraud, and because it involves changing creation] (3). The Second View: Permissibility of cutting excess parts from the body. Some jurists of the schools said this (4), based on the fact that the extra part has no benefit, and the extra organ is not equal to the original. Among contemporaries, Muhammad Uthman Shabir said this (5).",
    "foot_note": "1. Al-Washm (Tattooing): Wounding the skin, pricking it with a needle, and stuffing it with indigo, kohl, or fat smoke and other black substances. Al-Namas: Plucking hair. Al-Falaj: A gap between the incisors and canines of the teeth, done by an old woman to resemble young girls. See: Al-Mughrib fi Tartib Al-Mu'rib 1/473, Al-Ta'rifat Al-Fiqhiyyah 1/255.\n2. Narrated by Al-Bukhari in his Sahih, Book of Clothing, Chapter: The one getting tattoos, No. (5948) 7/167, and Muslim in his Sahih, Book of Clothing and Adornment, Chapter: Prohibition of the action of the hair extender... No. (2125) 3/1678.\n3. Fath Al-Bari 10/380.\n4. Because they ruled for a 'Hukuma' (indemnity determined by a judge) for one whose extra finger was cut, saying it does not have the rulings of an original finger. See: Bada'i' Al-Sana'i' 7/323, Al-Dhakhira 12/364, Al-Umm 6/81, Al-Mughni 8/464.\n5. See: Rulings of Cosmetic Surgery in Islamic Jurisprudence p. 37.",
    "book_id": "1039",
    "new_page_number": 46
  },
  {
    "serial_number": "4589089",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 262,
    "volume_number": 1,
    "text": "He said in Al-Jawhara Al-Nayyira: (Regarding the extra finger, there is a just government [indemnity] as an honor to the human being; because it is part of his hand, but there is no benefit in it, nor adornment] (1). Al-Mardawi said (2): [An original part is not taken for an extra part, nor an extra part for an original one, without dispute]. This is due to the lack of equality in place and benefit; for the original is created in its place for a benefit in it, unlike the extra (3). Muhammad Uthman Shabir said: [It is noted from the previous texts that assault on extra parts does not necessitate blood money (Diyah) on the aggressor, because he did not remove a benefit or beauty. Rather, a government (Hukuma) was obligatory on him for cutting it without its owner's permission. If he cut it with his permission, or the permission of his guardian, there is nothing on him] (4). They argued with the following: First Evidence: That the continued existence of these excesses contains a defect and disfigurement of creation, and Allah commands man to be beautiful. It is answered: That the disagreement concerns excesses which have no effect on disfigurement nor hindrance of work. Whatever has any of that, the permissibility of cutting it was previously mentioned in the first issue. Second Evidence: That jurists determined a 'government' (Hukuma) for the extra finger (5) and did not consider Qisas applicable to it. Manner of Deduction: If it were considered significant, Qisas would be obligatory for it. Since it was extra, a government was estimated for it. It is answered: That considering a government for it is proof of its sanctity. If it had no sanctity, its right would have been dropped entirely. The Preponderant View—and Allah knows best—is the first view of prohibition, for the following reasons: That its remaining causes no harm, neither physical nor moral, nor pain, nor disfigurement.",
    "foot_note": "1. Al-Jawhara Al-Nayyira 2/132.\n2. Al-Insaf fi Ma'rifat Al-Rajih min Al-Khilaf 25/258.\n3. Encyclopedia of Consensus in Islamic Jurisprudence 11/216.\n4. Rulings of Cosmetic Surgery in Islamic Jurisprudence p. 37.\n5. Al-Hukuma in indemnity for wounds is that which has no fixed Diyah. See: Tahdhib Al-Lugha 4/70, Al-Nihaya fi Gharib Al-Hadith wa Al-Athar by Ibn Al-Athir 1/420.",
    "book_id": "1039",
    "new_page_number": 47
  },
  {
    "serial_number": "4589090",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 263,
    "volume_number": 1,
    "text": "That cosmetic surgery is part of the prohibited alteration. That cosmetic surgery may change realities and facts, so it enters into prohibition through the door of forgery and deception. Requirement Eight: Ruling on Selling Human Parts (1). Defining the Point of Contention: The organs of the human body differ in importance according to their functions. Also, the removal of some entails loss of life, like the heart, while a human may live with the presence of a single organ of a pair, like the kidney. What entails loss of life may not be sold, nor donated. As for what a human may live with a part of, the dispute exists among scholars. The cause of the difference returns to the following reasons: First: Absence of a correct, explicit text on the prohibition of selling organs. Second: The difference of Fatwa with the difference of time. In the past, modern and advanced medical devices did not exist in this present form, where currently the risk ratio for the donor is low or non-existent, and the success ratio of the operation for the recipient is very high (2). The First View: Non-permissibility. This is the view of the Hanafis and Shafi'is (3). Among those who chose this view are Al-Shanqiti, Ali Al-Qaradaghi, Ibn Uthaymeen, and Dr. Yusuf Al-Ahmad (4),",
    "foot_note": "1. Human organs after removal from the body differ in the duration they remain valid for transplantation into another body, called in medical language (warm ischemia time). After that, they are damaged irreversibly. For example, kidneys remain 45 minutes, liver 8 minutes, pancreas 20 minutes, bone and cornea 24 hours. They can be preserved to remain valid longer via cooling or freezing while observing other medical matters to prevent cell corruption. See: New Medical Issues in the Light of Islamic Sharia p. 392.\n2. Ibn Al-Qayyim said in I'lam Al-Muwaqqi'in 3/11: (Chapter on the changing and difference of Fatwa according to the change of times, places, conditions, intentions, and customs).\n3. See for Hanafis: Al-Hidaya Sharh Al-Bidaya 3/46, Al-Muhit Al-Burhani 6/349, Bada'i' Al-Sana'i' 5/142. See for Shafi'is: Al-Majmu' 9/45, Rawdat Al-Talibin 3/285, Al-Ghurar Al-Bahiyya 5/178.\n4. He has a dissertation titled (Thesis on Rulings of Organ Transplantation in Islamic Jurisprudence).",
    "book_id": "1039",
    "new_page_number": 48
  },
  {
    "serial_number": "4589091",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 264,
    "volume_number": 1,
    "text": "and the decision of the Islamic Fiqh Academy, the decision of the Islamic Organization for Medical Sciences, and the decision of the World Health Organization affiliated with the United Nations (1) were issued with this view. It is stated in Al-Mabsut (2): [... Then the parts of a human have the ruling of his whole self. Do you not see that human hair is not utilized out of honor for the human, unlike other animals]. Al-Qarafi said in Al-Furuq (3): [Allah prohibited killing and wounding to protect his soul, his organs, and their benefits for him. Even if the servant accepted dropping his right to that, his acceptance is not considered, and his dropping is not effective]. Al-Nawawi said (4): [It is not for another to cut anything from his organs to give to a compelled person, without dispute; Imam Al-Haramayn and the companions stated this explicitly]. They argued with the following: First Evidence: The saying of the Almighty: {And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference} (5). Manner of Deduction: Selling organs contradicts the honor that the Sharia came with, and involves degradation and vulgarity. It is stated in Bada'i' Al-Sana'i' (6): [As for the bone and hair of a human, selling it is not permissible, not because of its impurity—for it is pure in the correct narration—but out of respect for him, and vulgarity by selling implies insult].",
    "foot_note": "1. See: Rulings on Medical Surgery 591, Journal of the Islamic Fiqh Academy Issue 4, Fiqh Issues in Human Organ Transplantation p. 51, The Monthly Meeting of Ibn Uthaymeen 50/20, and Thesis: Selling Human Organs for Transplantation to Those in Need from the Perspective of Islamic Scholars by Fatima Tabatabai p. 372.\n2. Al-Mabsut 15/125.\n3. Al-Furuq 1/141.\n4. Al-Majmu' 9/45.\n5. Al-Isra: 70.\n6. Bada'i' Al-Sana'i' fi Tartib Al-Shara'i' 5/142.",
    "book_id": "1039",
    "new_page_number": 49
  },
  {
    "serial_number": "4589092",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 265,
    "volume_number": 1,
    "text": "It is debated: That selling organs involves degradation if it is for the purpose of trade and earning. However, if it is for the purpose of saving a human, it does not contradict honoring the human. Second Evidence: The saying of the Almighty: {We have certainly created man in the best of stature} (1). Manner of Deduction: Allah created man in the best image and assigned a function for every organ in the human body, and selling them is a suspension of this function. It is debated: By not conceding the suspension of the organ's function, for it is from the perfection of Allah's creation and His power that He made man able to live with one organ of the repeated organs in the body, such as the eye or the kidney. Third Evidence: The Hadith of Abu Huraira (may Allah be pleased with him) from the Prophet (peace be upon him) who said: Allah said: \"Three I will be their adversary on the Day of Resurrection: A man who gave a pledge in My name then betrayed it, a man who sold a free person and consumed his price, and a man who hired an employee, fulfilled the work from him, but did not give him his wage\" (2). Manner of Deduction: The Hadith indicates the prohibition of selling a free person, and if selling the whole is prohibited, selling a part is prohibited. Fourth Evidence: That body organs are not wealth (Mal), and are not the property of the human, so his disposal of them is not valid. Among the conditions for the validity of a sale is that the seller owns the item sold and it is under his disposal (3). Ibn Hazm reported the consensus of jurists on that, saying: [They agreed that a man selling what he does not own, and its owner did not authorize him, and the seller was not a ruler nor exacting a right for himself or another, nor a Mujtahid regarding property whose owner is despaired of, then it is void] (4).",
    "foot_note": "1. Al-Tin: 4.\n2. Narrated by Al-Bukhari in his Sahih, Book of Sales, Chapter: The sin of one who sells a free person, No. (2227) 3/82.\n3. See: Bada'i' Al-Sana'i' 5/142, Al-Mubdi' 4/6, Al-Uddah Sharh Al-Umdah 1/239.\n4. Maratib Al-Ijma' p. 84.",
    "book_id": "1039",
    "new_page_number": 50
  },
  {
    "serial_number": "4589093",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 266,
    "volume_number": 1,
    "text": "And as Al-Qarafi said: (That which is purely a right of Allah Almighty, servants are not able to drop nor absolve from, rather that returns to the Lawgiver) (1). Fifth Evidence: That the view of permissibility results in negative effects and various corruptions, such as trafficking in organs by the poor, or it may lead to the destruction and death of the seller of one of his organs, for the remaining organ might fail after a period, and the transplant operation might not succeed, and other potential effects. The Prophet (peace be upon him) says: (There shall be no harm and no reciprocation of harm) (2), and warding off evils takes precedence over bringing benefits, which is a legal Sharia maxim (3). The Second View: Permissibility. Those who said this include Dr. Mukhtar Al-Mahdi (4), Dr. Muhammad Naaim Yasin (5), and some medical centers (6). They argued with the following: First Evidence: That the origin in things is permissibility (Ibahah), and no explicit text has been reported regarding the prohibition of sale, so it remains on the original principle. It is answered: That the evidences are established, as in the previous evidences for the first view. Second Evidence: The Fiqh Maxim (Necessities permit prohibitions). Manner of Deduction: That it is permissible for a human to dispose by selling one of his organs when there is a need for money. It is answered: With the Fiqh Maxim (Harm is not removed by harm) which controls the maxim you used as evidence. Disposal must be within the limits of what Allah permitted, and not exceed it to others (7).",
    "foot_note": "1. Al-Furuq by Al-Qarafi 1/195.\n2. Narrated by Malik in Al-Muwatta No. (31) 2/745, Al-Tabarani in Al-Awsat No. (1033) 1/307, Al-Hakim in Al-Mustadrak No. (2345) 2/66, Al-Daraqutni in his Sunan No. (3079) 4/51. Authenticated by Al-Albani in Al-Irwa No. (896) 3/408.\n3. See: Al-Muwafaqat 6/446, Al-Ashbah wa Al-Naza'ir by Al-Subki 1/455, Al-Ashbah wa Al-Naza'ir by Al-Suyuti 1/87.\n4. In his research (Human Organs Between Gift, Sale, and Taking Without Will). Link: http://www.islamset.org/arabic/abioethics/index.html\n5. Head of Comparative Jurisprudence and Sharia Policy Department, College of Sharia and Islamic Studies, Kuwait University.\n6. Ibn Sina Hospital for Specialized Surgeries.\n7. See: Thesis titled (New Medical Issues in the Light of Islamic Sharia) by Muhammad Abdul Jawad Hijazi, p. (436).",
    "book_id": "1039",
    "new_page_number": 51
  },
  {
    "serial_number": "4589094",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 267,
    "volume_number": 1,
    "text": "Third Evidence: Analogy (Qiyas) from several aspects, including: First Aspect: Analogy to the permissibility of selling human milk, and Shafi'i and Hanbali jurists have stated this (1). It is stated in Al-Hawi Al-Kabir (2): [Human milk according to us is pure, drinking it is Halal, and selling it is permissible]. Manner of Deduction: If selling milk is permissible, and it is part of a human, then selling other organs is permissible. It is answered: That this is an invalid analogy due to the existence of a difference (Fariq). Milk is renewable, and its retention harms the woman's body and health, unlike an organ. Al-Shawkani mentioned that this is among the matters cut off (definitive), saying: [The prohibition of this (i.e., selling a free person) is among the definitives of Sharia, and the consensus of the people of Islam on prohibition is known, and one does not need to deduce evidence for the likes of it] (3). Second Aspect: Analogy to the permissibility of selling a female slave and a male slave; if selling the whole is permissible, selling a part is permissible by greater reason. It is answered: That Islam looks forward to freedom and manumission, so the Sharia came with honoring the slave, not burdening him with what he cannot bear, and arranged for his manumission freedom from the Fire, as he (peace be upon him) said: (From Abu Huraira, may Allah be pleased with him, from the Prophet, peace be upon him, who said: \"Whoever frees a Muslim slave, Allah will save with every limb of him a limb of his from the Fire, even his private part for his private part\") (4). Third Aspect: Analogy to the permissibility of selling the Mushaf (Quran copy), and human organs do not have greater sanctity than it.",
    "foot_note": "1. See: Al-Hawi Al-Kabir 5/333, Al-Majmu' 5/254, Al-Mughni 4/196, Al-Furu' 6/135.\n2. Al-Hawi Al-Kabir 5/333.\n3. Al-Sayl Al-Jarrar p. 490.\n4. Narrated by Al-Bukhari in his Sahih, Book of Expiation of Oaths, Chapter: His saying (or freeing a slave) No. (6715) 8/145, and Muslim in his Sahih, Book of Manumission, Chapter: The Virtue of Manumission, No. (1509) 2/1147.",
    "book_id": "1039",
    "new_page_number": 52
  },
  {
    "serial_number": "4589095",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 268,
    "volume_number": 1,
    "text": "Fourth Aspect: Analogy to permissibility via donation; if donation is permissible, which is a type of disposal of the organ, then selling is permissible. Third Evidence: That Islam came to preserve the human soul from destruction, which requires the view of permissibility, especially if no one is found to donate the organ. The legal Fiqh maxims support this, such as the maxim \"Hardship brings facility,\" the maxim \"Committing the lesser of two harms,\" the maxim \"Necessity is estimated by its extent,\" and the maxim \"Necessities permit prohibitions\" (1). Preponderance: The preponderant view—and Allah knows best—is the view of non-permissibility for the following reasons: The strength of the evidence of those saying it is forbidden, along with the refutations raised against the evidence of those saying it is permissible. The consistency of the prohibition view with the spirit of the Sharia and its objectives of preserving the human soul, human dignity, and lack of vulgarity. That the view of permissibility might cause destabilization of security and lack of stability due to assaults on souls and selling their organs.",
    "foot_note": "1. Some researchers mention a third view: The permissibility of purchase for the compelled person, and the prohibition of sale, when no industrial alternative exists. Bakr Abu Zaid mentioned this in his research published in the Journal of the Islamic Fiqh Academy Issue 4, 4/119, saying: (If benefitting from it via donation is permitted for a compelled person, selling it is not permitted due to the maxim: Permissibility of benefit does not imply permissibility of sale. Therefore: Selling them is forbidden and not permissible, but if a compelled person cannot obtain it except for a price, it is permissible for the payer to push away harm, not for the taker). Then he said at the end of his research: (And all that I mentioned in this treatise regarding points of disagreement, I present as research, and I did not dare to separate from it with an opinion). Among those who held this view is Dr. Muhammad Fawzi Faydullah, Professor of Sharia at Kuwait University, in his research in the symposium (Islamic Vision for Some Medical Practices) p. 40, and Laila Saraj Abu Al-Ula in her Master's thesis year 1409 AH titled: (Blood Transfusion and Organ Transplantation).",
    "book_id": "1039",
    "new_page_number": 53
  },
  {
    "serial_number": "4589096",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Jurisprudential Rulings Related to Excess, Separated, and Amputated Parts of the Human Body",
    "edition": "None",
    "publisher": "None",
    "page_number": 269,
    "volume_number": 1,
    "text": "(Conclusion and Important Results of the Research) This brief research has been completed by the praise of Allah and His facilitation. I have benefited greatly from the words of jurists and specialists in the medical field, and reached some results, perhaps the most important of which are: (1) Allah's honoring of the children of Adam generally, and the dignity of the believer before Allah specifically. (2) Separated human parts and organs are generally pure according to the correct view. (3) The amputated organ is not prayed over if its owner is alive. (4) The amputated organ is not prayed over if its owner has been prayed over, but it is washed and buried. (5) The severed part is prayed over if the person himself was not prayed over due to loss or tearing. (6) It is not permissible to transplant an organ cut in a Hadd or Qisas according to the correct view. (7) Permissibility of transplanting an organ cut in other than a Hadd or Qisas according to the correct view. (8) Permissibility of amputating and cutting excess organs out of necessity and need. (9) It is not permissible to amputate and cut excess organs for improvement and beautification. (10) Non-permissibility of selling organs according to the correct view. (11) The Sharia came with taking means, and among that is medical treatment. (12) Inclusion of Fiqh maxims and Sharia objectives in most research issues, such as: Hardship brings facility, the maxim of committing the lesser of two harms, the maxim of necessity is estimated by its extent, the maxim of necessities permit prohibitions, and the maxim that need descends to the status of necessity whether general or specific. Recommendations: (1) Preparing specialized centers for separated human parts in hospitals and health centers, to preserve them and clarify the legal ruling related to them.",
    "foot_note": "None",
    "book_id": "1039",
    "new_page_number": 54
  }
]