[
  {
    "text": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence\nAuthor: علي بن عبد العزيز بن علي الشبل\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8262\nbook_title: الجذور التاريخية لحقيقة الغلو والتطرف والإرهاب والعنف\nbook_link: https://shamela.ws/book/1129\nbook_id: 1129\nauthor_name: علي بن عبد العزيز بن علي الشبل\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/188\nauthor_ID: 188\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 66\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7486584",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence. Author: Ali bin Abdul Aziz bin Ali Al-Shibl. Publisher: The book is published on the website of the Saudi Ministry of Awqaf without data. Number of pages (paper book): 49 [The book is numbered automatically, not matching the printed version]. Number of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence. Author: Ali bin Abdul Aziz bin Ali Al-Shibl. Publisher: The book is published on the website of the Saudi Ministry of Awqaf without data. Number of pages (paper book): 49 [The book is numbered automatically, not matching the printed version]. Number of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Ali bin Abdul Aziz bin Ali Al-Shibl. Publisher: The book is published on the website of the Saudi Ministry of Awqaf without data. Number of pages (paper book): 49 [The book is numbered automatically, not matching the printed version]. Number of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages (paper book): 49 [The book is numbered automatically, not matching the printed version]. Number of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is numbered automatically, not matching the printed version]. Number of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 66. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nPublication date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 3
  },
  {
    "serial_number": "7486585",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence. Prepared by Dr. Ali bin Abdul Aziz bin Ali Al-Shibl, Imam Muhammad bin Saud Islamic University. In the name of Allah, the Most Gracious, the Most Merciful. Introduction. Praise be to Allah, we praise Him, seek His help and forgiveness, and seek refuge in Allah from the evils of our souls and our bad deeds. Whoever Allah guides, none can mislead, and whoever He misleads, none can guide. I bear witness that there is no god but Allah alone, with no partner, and I bear witness that Muhammad is His servant and messenger, may Allah bless him and his family and companions and grant them peace. To proceed: Allah Almighty has ordained for us this religion: Islam, and has not accepted any alternative for us: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion} [Al-Ma'idah: 3]. Indeed, He - Glory be to Him - does not accept from people a religion other than it: {Indeed, the religion in the sight of Allah is Islam} [Al Imran: 19]. And He said: {And whoever desires other than Islam as religion - never will it be accepted from him, and he, in the Hereafter, will be among the losers} [Al Imran: 85].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 4
  },
  {
    "serial_number": "7486586",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "This Islam is a middle religion between religions, and Muslims are truly the middle among nations, and likewise, the People of the Sunnah and the Community (Ahl al-Sunnah wal-Jama'ah): the people of steadfastness are the middle among the sects of Islam. Allah said in the verse of Al-Baqarah: {And thus we have made you a just community that you will be witnesses over the people and the Messenger will be a witness over you} [Al-Baqarah: 143]. The middle nation are those who are upon justice and equity and upon the path of steadfastness and the Sunnah. In this research, I talk about the historical roots of the reality of extremism, radicalism, terrorism, and violence, which included an introduction, a preface, and three chapters. In the introduction, the research speech, its plan, and part of its importance in the distinction of this nation and the specificity of its religion, Islam, with justice and moderation through the path of the Sunnah and steadfastness that the Messenger of Allah, peace be upon him, clarified for it. In the preface, defining the reality of the research terms: 1- First, regarding the meaning of extremism (Ghuluw) and its reality, and what came from the noble texts in the two revelations warning against it. 2- Second, regarding the meaning of radicalism (Tatarruf) and its reality. 3- Third, regarding the meaning of terrorism (Irhab) and its reality, and defining the contemporary term terrorism. 4- Fourth, regarding the meaning of violence ('Unf) and its divisions. 5- Fifth, regarding the relationship between extremism, radicalism, excess (Ifrat), and the like.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 5
  },
  {
    "serial_number": "7486587",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "6- Sixth, regarding the difference between steadfastness (Istiqamah) and extremism, radicalism, and terrorism. Then came the first chapter: On the history of religious radicalism and extremism, and it included: 1- First: Extremism among the people of Noah, peace be upon him, and its effects. 2- Second: Extremism and radicalism among the Greeks and its effects. 3- Third: Extremism and radicalism among the People of the Book and its effects. This is through religious radicalism and extremism related to creed, thought, and Sharia. Then came the second chapter: On the emergence of extremism and radicalism in religion among Muslims, influenced by the nations and religions before them, and it included: 1- First: The extremism of the Kharijites and its most important manifestations, with an explanation of the effect of the extremism of the Rawafid (Shia), and the influence of the Jews in it. 2- Second: The relationship of the emergence of extremism and radicalism among Muslims with ancient creeds. 3- Third: The radicalism of the Mu'tazila and their extremism, and its effects. Then came the third chapter: On radicalism and extremism in the chapter of names and rulings (Al-Asma' wa Al-Ahkam) and its effects. Including five sections: 1- First: What is meant by names and rulings and their effect. 2- Second: The extremist sects in this chapter and their sayings. 3- Third: Discussing the sayings of the extremists. 4- Fourth: Refuting the Wa'idiyyah (those who emphasize threats) from the Kharijites and Mu'tazila in their inference with the verse of An-Nisa.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 6
  },
  {
    "serial_number": "7486588",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "5- Fifth: The effect of extremism in names and rulings among the Wa'idiyyah. These are the contents of this research, its chapters, and sections. If I am successful in correctness and justice in speech, it is from the success and guidance of my Lord, and if it is otherwise, it is from myself and Satan, and I seek refuge in Allah from that and ask forgiveness from my Lord and repent to Him. Allah is the one asked to make this work purely for His sake, and bringing near to Him, and He - Glory be to Him - is the Helper and Guide to the right path, and may Allah bless our Prophet Muhammad and all his family and companions.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 7
  },
  {
    "serial_number": "7486589",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "Chapter One: The meaning of extremism (Ghuluw) and its reality and clarification of some synonymous terms. The meaning of extremism by referring to linguistic sources and dictionaries, it appeared that extremism is: exceeding the limit and transgressing it. Al-Jawhari said in Al-Sahih: ((He went to extremes (Ghala) in the matter, he goes to extremes (Yaghlu) extremism (Ghuluwwan), meaning he exceeded the limit in it)). And Al-Fairuzabadi said in Al-Qamus: ((Ghala Ghala'an, so he is Ghalin (expensive/extreme) and Ghaliyyun, the opposite of cheap... and he went to extremes in the matter Ghuluwwan, he exceeded its limit)). And Al-Zubaidi agreed with him in Taj al-Arus. Ibn Manzur said in Al-Lisan: ((... The origin of Ghala' is: elevation and exceeding the measure in everything... It is said: You exaggerated (Ghalayta) the dowry of the woman, meaning you made it expensive. From it is the saying of Umar, may Allah be pleased with him: ((Do not exaggerate (La Taghalu) in the dowries of women)) and in a narration: ((Do not exaggerate (La Taghalu) in the dowry of women)). Meaning do not exaggerate in the amount of the dowry. And he went to extremes in religion and the matter, he goes to extremes, extremism: he exceeded its limit. He said: Some of them said: I went to extremes (Ghalawtu) in the matter Ghuluwwan and Ghalaniyah and Ghalaniya if I exceeded the limit and was excessive in it, and it is said of a thing if it rises: It has become expensive (Ghala). Dhu al-Rummah said: So the love of Mayya continues to rise (Yaghlu) with us... and increases until we find nothing to add to it)). And Al-Fayoumi said in Al-Misbah Al-Munir:",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 8
  },
  {
    "serial_number": "7486590",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "((... And he went to extremes (Ghala) in religion Ghuluwwan from the chapter of Qa'ad, and he became rigid and strict until he exceeded the limit, and in the Revelation: {Do not commit excess in your religion} (1) and he exaggerated (Ghala) in his affair Mughalah, he exaggerated)) (2). Ibn Faris said in Al-Mu'jam: ((Ghalwa: The Ghain and Lam and the weak letter is a sound root in the matter indicating elevation and exceeding a measure. It is said: The price rose (Ghala) Yaghlu Ghala and that is its elevation, and the man went to extremes (Ghala) in the matter Ghuluwwan if he exceeded its limit)) End quote. And likewise in Al-Mujmal (3). From the above, it becomes clear that Ghuluw (extremism) in all its usages indicates \"Elevation, increase, and exceeding the natural origin or the usual limit\". From it is his saying, peace be upon him, in the hadith of Abu Dharr: ((... Which slaves are best? He said: «Those most expensive (Aghlaha) in price and most beneficial to their people» (4) Agreed upon. And the hadith of An-Nu'man bin Bashir, may Allah be pleased with him, that the Prophet, peace be upon him, said: «The person with the lightest punishment among the people of Hell on the Day of Resurrection is a man under whose feet are two coals from which his brain boils (Yaghli) as the cauldron boils» (5) Agreed upon. So the price rose (Ghala): if its price increased and went up. And the pot boiled (Ghalat): if its heat increased and rose. And he went to extremes (Ghala) in his walk: if he sped up and increased in it. And the flesh became expensive (Taghala): rose and went, and from it is the saying of Labid bin Abi Rabi'ah:",
    "foot_note": "1. (1) This is part of verse An-Nisa 171, and Al-Ma'idah 77.\n2. All of them in the entry Ghala.\n3. In Al-Mujmal entry Ghala and Al-Mu'jam entry Ghalwa.\n4. Narrated by Al-Bukhari in the Book of Manumission, Chapter: Which slaves are best, and narrated by Muslim in the Book of Faith, Chapter: Being Belief in Allah is the Best of Deeds No. 84.\n5. Narrated by Al-Bukhari in the Book of Riqaq (Softening of Hearts), Chapter: Description of Paradise and Hell, and Muslim in the Book of Faith, Chapter: The person with the lightest punishment among the people of Hell No. 213.",
    "book_id": "1129",
    "new_page_number": 9
  },
  {
    "serial_number": "7486591",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "So if its flesh became expensive (Taghala) and it became weary... And cut off after fatigue its scraps. Therefore, the reality of extremism (Ghuluw) is: Increase and exceeding the obligatory legal limit. Allah Almighty said: {Do not commit excess in your religion or say about Allah except the truth} [An-Nisa: 171] And He said in the verse of Al-Ma'idah: {Say, \"O People of the Scripture, do not exceed limits in your religion beyond the truth and do not follow the inclinations of a people who had gone astray before and misled many and have strayed from the soundness of the way.\"} [Al-Ma'idah: 77] And He said in numerous verses that came prohibiting tyranny (Tughyan) \"which is extremism in error\" as He said at the end of Surah Taha to the Children of Israel: {And do not exceed limits (Tatghaw) therein, lest My anger should descend upon you} [Taha: 81], and His saying about Pharaoh and his chiefs in more than one verse: {Go to Pharaoh. Indeed, he has transgressed (Tagha)} [An-Nazi'at: 17], and He said about the loser, the inmate of Hellfire {So as for he who transgressed (Tagha)} {And preferred the life of the world} [An-Nazi'at: 37, 38] the verse, and He said at the end of Surah Hud: {So remain on a right course as you have been commanded, [you] and those who have turned back with you [to Allah], and do not transgress (Tatghaw). Indeed, He is Seeing of what you do} [Hud: 112].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 10
  },
  {
    "serial_number": "7486592",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "And among what was reported in the Sunnah also: What Ahmad narrated with his chain from Abd al-Rahman bin Shibl who said I heard the Messenger of Allah, peace be upon him, say: «Read the Quran and do not commit excess (Taghlu) in it, and do not turn away from it, and do not eat by it...» (1). And in the hadith of Ibn Abbas, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said to me on the morning of Al-Aqaba while he was on his she-camel: «Pick up pebbles for me», so I picked up for him seven pebbles, like the pebbles of slinging, so he started shaking them in his palm and saying: «Like these throw, then he said: O people, beware of excess (Ghuluw) in religion; for those before you were destroyed by excess in religion». Narrated by Ahmad, Ibn Majah, Al-Hakim and others (2). So from the above, it becomes clear that the Book and the Sunnah specify the general language, and that Ghuluw (extremism) is: ((Excess in exceeding the legally considered amount in a matter of religion)).",
    "foot_note": "1. (1) «Al-Fath Al-Rabbani» 18 / 28.\n2. Narrated by Ahmad in Al-Musnad as in «Al-Fath Al-Rabbani» 12 / 169, Book of Hajj and Umrah, Chapter: Reason for the legitimacy of stoning the Jamarat and its ruling, and narrated by Al-Nasa'i, Book of Rituals, Chapter: Size of the pebbles for slinging, and likewise Ibn Majah in Chapter: Picking up pebbles. And narrated by Al-Hakim in his «Mustadrak» 1 / 466 and said: An authentic hadith according to the condition of the two Sheikhs and they did not extract it, and Al-Dhahabi agreed with him in his summary of it. Al-Nawawi said in «Al-Majmu'» 8 / 127: Authentic, narrated by Al-Bayhaqi with a good authentic chain and it is according to the condition of Muslim, narration of Abdullah bin Abbas from his brother Al-Fadl. And narrated by Al-Nasa'i and Ibn Majah with two authentic chains, Al-Nasa'i's chain is according to the condition of Muslim... End quote. And Sheikh Al-Islam said in «Al-Wasiyyah Al-Kubra»: It is an authentic hadith. And Sheikh Saleh Al-Bulaihi, may Allah have mercy on him, quoted from him in ((Al-Salsabil fi Ma'rifat Al-Dalil 1 / 367)) that he said: According to the condition of Muslim, and I did not stand on it!. And Ibn Hajar mentioned it in «Al-Talkhis Al-Habir» 7 / 387 where he verified who was the pillion rider of the Prophet, peace be upon him, and picked up the pebbles for him: Abdullah or Al-Fadl, and he corrected that it was Al-Fadl, which is a valuable verification, and likewise the previous speech of Al-Nawawi, and in Fath Al-Bari 13 / 291:..... And it was authenticated by Ibn Khuzaymah, Ibn Hibban, and Al-Hakim from the path of Abu Al-Aliyah from Ibn Abbas.",
    "book_id": "1129",
    "new_page_number": 11
  },
  {
    "serial_number": "7486593",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "The meaning of Radicalism (Tatarruf). Radicalism (Tatarruf) is Tafa'ul - with emphasis on the 'Ayn - from Tarafa Yatrufu Tarafan with movement (vowel), which is taking one of the two sides and inclining towards them: either the lower or the farthest side (1), and from it they applied it to the side and the edge of a thing. And the concept of radicalism in common usage - in this time -: Extremism in a creed, idea, doctrine, or other specific to a religion, group, or party. That is why radicalism is described to sects of Jews and Christians, so there are right-wing radical parties or left-wing radical parties. It has been described as religious, movement, and political radicalism. And describing extremism as radicalism has its justification by taking one of the two sides, as the first one said: Do not go to extremes in anything of the matter and be moderate... Both sides of the intent of matters are blameworthy. But the legal description for strictness in religion and excess in it must refer back to the Sharia itself, not people's terminology, concepts, and applications, as indicated by the hadith of Ibn Abbas, may Allah be pleased with him, that the Prophet, peace be upon him, said during Hajj: «Like these throw, and beware of excess in religion, for those before you were only destroyed by excess in religion» narrated by Ahmad, Ibn Majah, and Al-Hakim and he authenticated it. (2).",
    "foot_note": "1. (1) «Al-Qamus Al-Muhit», and its explanation «Taj Al-Arus», «Lisan Al-Arab», «Mu'jam Maqayis Al-Lughah», «Al-Sahih» and «Al-Misbah Al-Munir» entry (Taraf).\n2. Its extraction preceded in the beginning of the preface.",
    "book_id": "1129",
    "new_page_number": 12
  },
  {
    "serial_number": "7486594",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "The meaning of Terrorism (Irhab). Irhab linguistically: A source taken from Rahaba like 'Alima, Yarhabu Rahban and Ruhbaban and Irhaban with Fath and Kasr, and it is intimidation and frightening (1). And the meaning of terrorism legally revolves around intense fear and intimidation falling upon an individual or a group, and it is in its reality and ruling of two types:",
    "foot_note": "1. (1) See: «Al-Qamus» and its explanation «Taj Al-Arus», «Lisan Al-Arab», «Al-Sahih», «Al-Misbah Al-Munir», and «Mu'jam Maqayis Al-Lughah». Entry (Rahaba).",
    "book_id": "1129",
    "new_page_number": 13
  },
  {
    "serial_number": "7486595",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "(1) Legitimate terrorism by the explicit text of the Quran in the verse of Al-Anfal in His saying: {And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy and others besides them whom you do not know [but] whom Allah knows. And whatever you spend in the cause of Allah will be fully repaid to you, and you will not be wronged} {And if they incline to peace, then incline to it [also] and rely upon Allah. Indeed, it is He who is the Hearing, the Knowing} [Al-Anfal: 60-61]. For frightening the disbelieving enemy stubborn against the call of Allah by Jihad in the path of Allah and shaking him with equipment and power is one of the objectives of Islamic Jihad, to stop his evil, and end his injustice, and perhaps he might be guided to the religion of Allah Almighty. And this ruling is specific to warriors from the disbelievers or transgressors. (2) Illegitimate terrorism, rather it is forbidden and prohibited: in frightening the secure and instilling terror and panic in them, whether they are Muslims, those granted security (Musta'manin), those under covenant (Mu'ahidin), People of Dhimma, or others. It is banditry (Hirabah) against Muslims and injustice against others! And in all cases, it is corruption on earth which has been forbidden explicitly in the Quran and Sunnah and by the consensus of scholars.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 14
  },
  {
    "serial_number": "7486596",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without details",
    "page_number": 12,
    "volume_number": 1,
    "text": "This is based on injustice, where frightening and terrorizing the safe is oppression and transgression, and it is prohibited by consensus of the religions and divine laws. Imam Ahmad and others narrated with authentic chains from Abu Dharr (RA) reporting from the Prophet ﷺ that Allah Almighty said: 'O My servants, I have forbidden oppression for Myself and made it forbidden among you, so do not oppress one another.'\n\nIn the explicit Quranic text, Allah says in Surah Yunus: {Indeed, Allah does not wrong the people at all, but it is the people who wrong themselves.} [Yunus: 44] and in Surah Al-Mumtahina: {Allah does not forbid you from those who do not fight you in religion and do not expel you from your homes to be righteous toward them and act justly toward them. Indeed, Allah loves the just.} [Al-Mumtahina: 8].\n\nThis is in addition to other clear evidences regarding the obligation to honor covenants and fulfill promises, the prohibition of killing a soul without right, and the prohibition of killing women, infants, monks, and elderly disbelievers.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 15
  },
  {
    "serial_number": "7486597",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "Defining the Term 'Contemporary Terrorism': A statement defining it was issued by the Islamic Fiqh Council of the Muslim World League in Makkah during its sixteenth session, held in Shawwal of the year 1423 AH in Makkah Al-Mukarramah. They defined terrorism with a definition that preceded many global entities that were mistaken in its meaning and implications. Their statement read: ((Terrorism is aggression practiced by individuals, groups, or states acting unjustly against human beings regarding their religion, life, intellect, wealth, and honor. It includes forms of intimidation, harm, threats, and unlawful killing, as well as acts related to banditry, highway robbery, and every act of violence or threat carried out in execution of an individual or collective criminal project aimed at instilling terror among people, or terrifying them by harming them, or exposing their lives, freedom, security, or statements to danger. Among its forms is causing damage to the environment or to any public or private facilities or properties, or exposing any national or natural resources to danger. All of this is among the forms of corruption on earth that Allah - Glory be to Him - has forbidden Muslims from committed. The Almighty said: {And do not desire corruption in the land. Indeed, Allah does not like corrupters} [Al-Qasas: 77] (1).",
    "foot_note": "1. (1) See the statement issued by the Islamic Fiqh Council of the Muslim World League in Makkah in its 16th session, published in print, audio, and visual media.",
    "book_id": "1129",
    "new_page_number": 16
  },
  {
    "serial_number": "7486598",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "Terrorism in the contemporary Arab terminology: It does not differentiate between the righteous and the invalid - for resisting the occupier and responding to him is called terrorism by them, and surrendering to him is called peace and cooperation. Indeed, if they had enough time, they would name every Muslim a terrorist.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 17
  },
  {
    "serial_number": "7486599",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 15,
    "volume_number": 1,
    "text": "The Meaning of Violence: Referring to linguistic dictionaries under the root 'Unf' (Violence), it is found with three vowelizations on the 'Ain' (Damma, Fatha, Kasra). It is the opposite of gentleness (Rifq). It refers to severity in speech and action. The reality of violence: It is harshness in speech, opinion, action, or state! This generates what is called doctrinal violence, scientific violence, and intellectual violence in opinion, understanding, and conception?! Thus, violence is a result of excess and extremism. Among what has been mentioned in dispraising violence and harshness is the saying of the Prophet (peace be upon him): \"The strong man is not the one who wrestles, but the strong man is the one who controls himself when angry.\"",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 18
  },
  {
    "serial_number": "7486600",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "The Relationship between Excess (Ghuluw), Extremism (Tatarruf), and Exorbitance (Ifrat) and the like: Excess (Ghuluw) is, in reality, the highest rank of Exorbitance (Ifrat) generally. For example, 'Ghuluw' in a shroud means raising its price excessively and being exorbitant about it. Excess (Ghuluw) is more specific than Extremism (Tatarruf); because Extremism is crossing the limit and distancing oneself from mediation and moderation, whether by excess or negligence, or in other words: negatively or positively, by increase or decrease, whether it is Ghuluw or not. The criterion is reaching the two ends (extremes) of a matter. Ghuluw is implied in the poet's saying: 'Do not go to excess in any matter and be moderate... For both ends of intended matters are blameworthy.' Thus, Ghuluw is more specific than Extremism regarding crossing the natural limit in increase and decrease. In the case of decrease, it is called Ghuluw if one exaggerates in the decrease; it is said: 'He went to excess in decrease,' as in the Jews' aversion regarding the right of the Messiah, son of Mary, peace be upon them. Similarly in increase, if one exaggerates in it, like the Christians' excess regarding the Messiah, son of Mary. Extremism (Tatarruf): Is biasing towards the two ends of a matter, so it includes Ghuluw, but Ghuluw is more specific than it regarding increase and crossing limits, not just merely moving away from the center to the extremities. In other words: Every Ghuluw is extremism, but not every extremism is Ghuluw. The Difference between Steadfastness (Istiqamah) and (Excess, Extremism, and Terrorism):",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 19
  },
  {
    "serial_number": "7486601",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "In reality, there is no correlation between holding fast to texts and excess (Ghuluw). The Companions, may Allah be pleased with them, were the most strictly adherent to and compliant with the texts of Sharia. Despite this, no excess or harshness occurred from them, except in specific cases during the life of the Prophet (peace be upon him) where he guided his Companions (1), taught them, and clarified the moderate path of worship, so they desisted. The reason for this was that this adherence by them, may Allah be pleased with them, coincided with correct knowledge, sound understanding, and a determination eager for knowledge and insight, so they were saved from excess, let alone persisting in it. But when people became distant from the time of the virtuous ones, and religion became strange, and ignorance enveloped many Muslims, the one holding fast to the Sunnah of the Chosen One (peace be upon him), biting onto it with his molars, became an outcast and mocked in those societies. They launched derogatory terms at him such as 'strict', 'extremist', 'radical', 'fundamentalist', 'terrorist', and similar titles promoted by some media outlets on behalf of the enemies of Islam!",
    "foot_note": "1. (1) As in the report of Abdullah bin Amr bin Al-Aas, may Allah be pleased with him, regarding prolonging fasting, the authenticity of which is agreed upon. Narrated by Al-Bukhari in the Book of Virtues of the Quran... and Muslim in the Book of Fasting... No. (1159). And the Hadith of Abdullah bin Al-Shikhir regarding the delegation of Banu Amir, wherein it says: ((We said: You are our Master. He said: The Master is Allah, Blessed and Exalted be He). We said: And the best of us in merit and greatest in bounty. He said: ((Say what you say, or part of what you say, and let not Satan sweep you away)). Narrated by Abu Dawood and An-Nasa'i with good chains of narration. His saying that, peace be upon him, was only to block the path of excess regarding him. See: Fath al-Majid 517.",
    "book_id": "1129",
    "new_page_number": 20
  },
  {
    "serial_number": "7486602",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "The reality is that adhering to the texts of the Book and Sunnah, and understanding them correctly, is considered by those negligent of Sharia rulings and heedless of them as excess and extremism. This is in view of their own apparent negligence and failure to manifest the methodology of Islam. Let us take an example to clarify the above: The reformist call of Sheikh Muhammad bin Abd al-Wahhab was accused by many people of declaring people disbelievers (Takfir) - which is a prominent manifestation of excess - or that they are Kharijites... and similar titles implying crossing the bounds of Islam's moderation and tolerance. They label them with terms that in Sharia are descriptions of harsh people who have no understanding or insight (1), while they are innocent of that as the wolf was innocent of the blood of Joseph, peace be upon him. But what is the recourse of one who chokes on it but that? It is noticeable that those adhering to the implications of legal texts are [considered] extremists and harsh in relation to the negligent ones who carry Islam merely as a description. However, when compared to the scale of Sharia, we do not find in them [the negligent ones] the meaning of the required adherence, which is steadfastness on the rulings of the Book and Sunnah.",
    "foot_note": "1. (1) See the suspicions raised about the call of Sheikh Muhammad bin Abd al-Wahhab, containing research by Dr. Abd al-Rahman Amira and others in: Sheikh Muhammad Week, Volume Two. Also ((Claims of the Opponents of the Call of Sheikh Muhammad bin Abd al-Wahhab)) by Dr. Al-Abd al-Latif.",
    "book_id": "1129",
    "new_page_number": 21
  },
  {
    "serial_number": "7486603",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "The negligent ones label the adherents with excess, extremism, terrorism, or strictness, implying that what they themselves are upon is the moderation and centrism of Islam, and what they manifest is moderation. In reality, it is not so; rather, it is negligence and failure in some rituals and rulings of Islam. As for moderation and centrism, it is in the religion of Allah and the methodology of His religion. It is no secret that the goal of anyone who accuses another of extremism or excess and the like is to alienate and warn against them, not because they are transgressing the limits of Sharia and the moderation of Islam, as is the case with those who accused the Salafi reformist call of that?! I mean that these claims are not a matter of proper naming and rulings, or to clarify legal meanings, as much as they are for personal whims or limited purposes. Thus, they burden the Lawgiver's terms with what they do not bear, and use legal meanings for narrow personal purposes and limited political goals!",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 22
  },
  {
    "serial_number": "7486604",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "First - Excess regarding the Righteous among the People of Noah, peace be upon him: The cause of Noah's mission, peace be upon him, to his people was the existence of excess among them regarding the righteous. This excess was the cause of their disbelief and associating others with Allah in worship. The people of Noah, before his coming to them, went to excess regarding men who were righteous; they loved them excessively until they worshipped them besides Allah. Then they fashioned idols for them to be symbols of their worship, until their innovation manifested into the Jahiliyyah (ignorance) of the Arabs before the coming of the Prophet (peace be upon him). As the Almighty said: {And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.'} [Nuh: 23]",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 23
  },
  {
    "serial_number": "7486605",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "Al-Bukhari narrated with his chain to Ibn Abbas, may Allah be pleased with them, who said regarding this verse: ((The idols that were among the people of Noah became among the Arabs later. As for Wadd, it was for Kalb in Dumat al-Jandal; as for Suwa', it was for Hudhayl; as for Yaghuth, it was for Murad then for Bani Ghatafan...; as for Ya'uq, it was for Hamdan; and as for Nasr, it was for Himyar for the family of Dhu al-Kala'. These are names of righteous men from the people of Noah. When they perished, Satan inspired their people to set up statues in their gathering places where they used to sit and name them with their names. They did so, but they were not worshipped. Until those people perished and knowledge was effaced, then they were worshipped)) End quote (1). 'Ansab' is the plural of 'Nusub', which is an idol set up for the dead to immortalize his memory. This actually represents a clear manifestation of excess in the category of excess regarding persons.",
    "foot_note": "1. (1) Narrated by Al-Bukhari in the Book of Interpretation of his Sahih, Chapter: The Statement of the Almighty: {And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.'} [Nuh: 23] the verse.",
    "book_id": "1129",
    "new_page_number": 24
  },
  {
    "serial_number": "7486606",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "Second - Excess and Extremism among the Greeks: Why Greek Paganism specifically for the history of extremism and excess in ancient times? Raising this question is important. Why the attention to explaining the paganism of these people? It is an insight derived from the Almighty's saying in Surah Bara'ah (At-Tawbah): {The Jews say, \"Ezra is the son of Allah\"; and the Christians say, \"The Messiah is the son of Allah.\" That is their statement with their mouths; they imitate the saying of those who disbelieved before. May Allah destroy them; how are they deluded?} [At-Tawbah: 30]. The Almighty mentioned in this verse the resemblance of the saying of the Jews and Christians in their claim of sonship to Allah Almighty to the saying of those disbelievers before them who held views that are the root of this imitation. Ibn Kathir, may Allah have mercy on him, said regarding His saying: {they imitate the saying of those who disbelieved before}: Meaning, they resemble those before them among the nations; they went astray just as those went astray (1). Ibn al-Jawzi quoted in his Tafsir \"Zad al-Masir\" (2).",
    "foot_note": "1. (1) See «Tafsir Ibn Kathir» 2 / 348. \n2. See «Zad al-Masir» 3 / 289, and «Ma'ani al-Quran» by Abu Ja'far al-Nahhas 3 / 200 similar to what Ibn al-Jawzi mentioned, and see: «Al-Tashil li-'Ulum al-Tanzil» by Ibn al-Jazari 2 / 74.",
    "book_id": "1129",
    "new_page_number": 25
  },
  {
    "serial_number": "7486607",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "In His saying: (Yudahi'una - they imitate), there are two readings: with Hamza, which is for Asim alone, and the rest of the Seven read ((Yudahuna)) without Hamza. See: \"Al-Sab'ah\" by Ibn Mujahid 314, \"Al-Qira'at Al-Ashr Al-Mutawatirah\" 192, \"Al-Nashr\" 1 / 406, and \"Al-Taysir\" 118 regarding Al-Zajjaj's saying: (Yudahi'una) means they resemble the saying of the disbelievers who preceded them, for they only said it following their predecessors. Then Ibn al-Jawzi said: Regarding His saying: {those who disbelieved} here, there are three opinions: First: That they are the idol worshippers, and the meaning is that those said: 'The angels are the daughters of Allah'; stated by Ibn Abbas. Second: That they are the Jews, so the meaning is that the Christians in their saying 'The Messiah is the son of Allah' resembled the Jews in their saying 'Ezra is the son of Allah'; stated by Qatadah and Al-Suddi. Third: That they are their ancestors; they followed them in their sayings by imitation; stated by Al-Zajjaj and Ibn Qutaybah. End quote. Similar was narrated by Al-Qurtubi and Al-Shawkani in their Tafsirs at this verse (1), and before them Al-Hafiz Ibn Jarir Al-Tabari on the verse of Bara'ah. In any case, the three opinions are not contradictory, and the difference between them is not a difference of opposition, but rather of variety, as the meaning can bear one of the opinions as well as all of them.",
    "foot_note": "1. (1) «Tafsir Al-Qurtubi» 8 / 118-119, and «Fath Al-Qadir» 2 / 353.",
    "book_id": "1129",
    "new_page_number": 26
  },
  {
    "serial_number": "7486608",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "Among those included in the meaning of 'those who disbelieved before' the Jews and Christians are: the nations who preceded them, whose claim of sonship to Allah was resembled by the claim of the Jews and Christians. This claim - of gods generating and having sons - is a clear and explicit pagan doctrine of the ancient Greek nation! Therefore, the pagan Greeks fall within the concept and explicit meaning of the verse from this consideration, for they are among those who disbelieved before. This is also a clear manifestation of religious excess and extremism that bequeathed violence, Takfir (declaring others disbelievers), and terrorism against those who did not agree with them in the pagan doctrine. This is in addition to the influence of Greek paganism on the nations after them, where their pagan influence appeared on the Jews, Christians, sects, and some deviant sects like the Jahmiyyah, Mu'tazila, and theologians (Mutakallimun), and before them the philosophers..., as well as their influence on other polytheistic pagan nations like the Magians, Hindus, Romans, etc. Thus, in clarifying the excess, extremism, and pagan deviation in Greek doctrine, there is an explanation of 'those who disbelieved before' and the extent of their knowledge of their Lord, represented in the lowest depths of ignorance and blindness about the Lord of the Worlds, even if they reached an advanced level in material construction of the world through the prominent material heritage they left behind.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 27
  },
  {
    "serial_number": "7486609",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "The subject is also indicated by the implication of His Almighty's saying: {Say, \"Travel through the land; then observe how was the end of the deniers\"}, and His saying: {And We sent not before you except men to whom We revealed [Our message] from among the people of the cities. Have they not traveled through the land and observed how was the end of those before them? And the home of the Hereafter is best for those who fear Allah; then will you not reason?}, and His saying: {Have they not traveled through the land and observed how was the end of those before them? They were greater than them in power, and they plowed the earth and built it up more than they have built it up, and their messengers came to them with clear evidences. And Allah would not ever have wronged them, but they were wronging themselves}, and His saying: {Say, \"Travel through the land and observe how was the end of those before. Most of them were associators [of others with Allah].\"}",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 28
  },
  {
    "serial_number": "7486610",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "And His Almighty's saying: {Have they not traveled through the land and observed how was the end of those before them? And they were greater than them in power. And Allah is not such that anything in the heavens or in the earth can escape Him. Indeed, He is ever Knowing and Competent}. And His saying: {Have they not traveled through the land and observed how was the end of those who were before them? They were greater than them in strength and in impression on the land, but Allah seized them for their sins. And they had not from Allah any protector}. And His saying at the end of the Surah: {Have they not traveled through the land and observed how was the end of those before them? They were more numerous than them and greater in strength and in impression on the land, but they were not availed by what they used to earn}. There is no doubt that the Greeks and others among the ancient extremists and radicals in their religion are included in the requirement of reflection, consideration, taking heed, and avoiding their path and methodologies mentioned in the verses. (1).",
    "foot_note": "1. (1) See the research by the one in need of Allah: «Pagan Deviations in Greek Doctrine and Their Effects» published by Dar Al-Masir in Riyadh, 1417 AH.",
    "book_id": "1129",
    "new_page_number": 29
  },
  {
    "serial_number": "7486611",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "Third - Extremism and Excess among the People of the Book",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 30
  },
  {
    "serial_number": "7486612",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "Then there existed after that a type of excess among the Children of Israel, Jews and Christians, as previously mentioned in His Almighty's saying in Surahs An-Nisa and Al-Ma'idah: {O People of the Scripture, do not commit excess in your religion}......... [An-Nisa: 171, Al-Ma'idah: 77]. Excess in Takfir (declaring others disbelievers) was also found between the Jews and Christians against each other. Allah Almighty said: {The Jews say, \"The Christians have nothing [true] to stand on,\" and the Christians say, \"The Jews have nothing to stand on,\"} until the matter led them to deeming permissible the blood and honor of each other (1). The Jews affirm the principle of fighting because it is linked to their existence and survival, and [they believe] they are the sons of Allah and His beloved, and that others are Gentiles (Ummiyyin) whom they may treat as they wish based on their malicious principle that they are God's chosen people, and as Allah recounted about them in their saying: {And among the People of the Scripture is he who, if you entrust him with a great amount [of wealth], he will return it to you. And among them is he who, if you entrust him with a [single] dinar, he will not return it to you unless you are constantly standing over him [demanding it]. That is because they say, \"There is no blame upon us concerning the unlearned.\" And they speak untruth about Allah while they know.} [Al-Imran: 75] and [they believe] servants are subservient for their sake.",
    "foot_note": "1. (1) Details of this are in a scientific article in Al-Faisal Magazine, issue 134, Sha'ban 1408 AH, under the title ((Religious Extremism among the Children of Israel)) by Abd al-Rahman Abd al-Muhsin, who supported his statements with quotes from the Old and New Testaments pp. 87-91. See also the research «Atheism and its Relation to Jews and Christians» by Dr. Muhammad Al-Shuway'ir in Al-Buhuth Magazine issue 14, year 1405 AH, p. 209.",
    "book_id": "1129",
    "new_page_number": 31
  },
  {
    "serial_number": "7486613",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Christians assert that they are the heirs of Judaism through the law of Jesus, peace be upon him. They also held a grudge against the Jews because they crucified Jesus, peace be upon him, as they assume. {But the Jews and the Christians say, \"We are the children of Allah and His beloved.\" Say, \"Then why does He punish you for your sins?\" Rather, you are human beings from among those He has created.}........ the verse [Al-Ma'idah: 18]. Thus, the People of the Book - especially the Jews - have clear and evident manifestations of excess and extremism in various aspects, in exaggerating, arrogance, vanity, and haughtiness over all people, Muslims, Christians, and others. Also in their doctrine and their distinction from people through false claims of being the sons of Allah and His beloved, and their allegation that they are God's chosen people, and that there is no sin or blame upon them in what they do to others of injustice, oppression, and aggression. The greatest manifestation of their extremism and excess was regarding Allah Almighty, by describing Him, Glory be to Him, with imperfections and attributing faults to Him, among what Allah exposed them for in the Quran:",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 32
  },
  {
    "serial_number": "7486614",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "1 - Their saying that Allah is poor and we are rich, as in the end of Surah Al-Imran: {Allah has certainly heard the statement of those who said, \"Indeed, Allah is poor, while we are rich.\" We will record what they said and their killing of the prophets without right and will say, \"Taste the punishment of the Burning Fire.\" That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.} {[They are] those who said, \"Indeed, Allah has taken our promise not to believe any messenger until he brings us an offering which fire [from heaven] will consume.\" Say, \"There have already come to you messengers before me with clear proofs and with that of which you speak. So why did you kill them, if you should be truthful?\"} [Al-Imran: 181-183].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 33
  },
  {
    "serial_number": "7486615",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "2 - And Allah described them with miserliness and greed, as in Surah Al-Ma'idah in His Almighty's saying: {And the Jews said, \"The hand of Allah is chained.\" Chained are their hands, and cursed are they for what they said. Rather, both His hands are extended; He spends however He wills. And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. And We have cast among them animosity and hatred until the Day of Resurrection. Every time they kindled the fire of war [against you], Allah extinguished it. And they strive throughout the land [causing] corruption, and Allah does not like corrupters} [Al-Ma'idah: 64]. 3 - And Allah criticized them for [claiming He suffered] fatigue and weariness in creating the heavens and the earth in six days, which Allah refuted by His saying in Surah Q: {And We did certainly create the heavens and earth and what is between them in six days, and there did not touch Us any weariness} [Q: 38].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 34
  },
  {
    "serial_number": "7486616",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "4 - Among their terrorism: Their killing of Allah's prophets and His messengers to them, and their corruption and spreading of corruption in the land and in Allah's judgment, which many verses in the Quran concurred upon, the first of which is His Almighty's saying in Surah Al-Baqarah: {And [recall] when you said, \"O Moses, we can never endure one [kind of] food. So call upon your Lord to bring forth for us from the earth its green herbs and its cucumbers and its garlic and its lentils and its onions.\" [Moses] said, \"Would you exchange what is better for what is less? Go into [any] settlement and indeed, you will have what you have asked.\" And they were covered with humiliation and poverty and returned with anger from Allah [upon them]. That is because they disbelieved in the verses of Allah and killed the prophets without right. That is because they disobeyed and were transgressing} [Al-Baqarah: 61].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 35
  },
  {
    "serial_number": "7486617",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "First - The Excess of the Kharijites: This is because they strove for sedition and rebelled against the Commander of the Faithful Uthman bin Affan, may Allah be pleased with him, starting with a verbal rebellion by striving for sedition and aggression against him, then they rebelled against him actually by besieging him, insulting him, and disparaging him, then by killing him, may Allah be pleased with him. When Uthman, may Allah be pleased with him, was killed unjustly, aggressively, and treacherously, tribulations appeared, storms of doubts erupted, and trials came running carrying the banner of excess, extremism, and terrorism forbidden to the safe and reassured Muslims especially. So there was the excess of the Kharijites and their harshness, especially in Takfir (declaring others disbelievers) and their stance towards the Commander of the Faithful Ali bin Abi Talib, may Allah be pleased with him. The manifestations of Kharijite extremism and terrorism were represented in their excess in their religion through their doctrinal principles that became famous for them after this historical stage, where their principles were rooted and their rules appeared in their creed and in their dealing with Muslims through:",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 36
  },
  {
    "serial_number": "7486618",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "Takfir of Muslims: Rulers, scholars, and commoners merely for the occurrence of a sin from any of them. From this, they judged Ali bin Abi Talib, and before him Uthman bin Affan, and Muawiyah and those with them, may Allah be pleased with them, as disbelievers individually. Then this was generalized by them to every Muslim who commits a sin. For merely by the occurrence of a sin from him, he is declared a disbeliever personally and exits the religion (Millah), unless he repents, in which case he must re-enter the religion. This Takfir resulted in rebelling against those declared disbelievers with the sword and fighting, which is deeming permissible the blood, honor, and wealth of those declared disbelievers. (These two principles will be further explained and discussed in Chapter Three: Excess and Extremism in the Chapter of Names and Rulings). Furthermore, in the late first century and early second century, they added the rejection of the Sunnah and reliance on the Quran only, according to their claim. So they denied the punishment of stoning because it was not mentioned in the Quran, and obliged the menstruating woman to make up prayers [missed] during her excuse of menstruation or postpartum bleeding, just as she makes up fasting! Note: Doctrinal cross-pollination occurred between the Mu'tazila and the Kharijites regarding issues of judging people with faith and disbelief. Also, doctrinal cross-pollination occurred between them in the chapter of Allah's names and attributes, where the saying that the Quran is created and the denial of seeing Allah in the Hereafter and in Paradise spread among Kharijite sects, especially the Ibadis.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 37
  },
  {
    "serial_number": "7486619",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Excess, Extremism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "This happened by tracking the books of the people and inducing sources of creed, which space is too limited to enumerate, and Sheikh al-Islam Ibn Taymiyyah has the precedence in distinguishing and noting this. Then the extremist Saba'iyyah appeared - attributed to Abdullah bin Saba Al-San'ani the Jew, son of the black woman, the first to kindle heresy (Zandaqa) in Islam - regarding the person of Ali, may Allah be pleased with him. Sheikh Abdullah bin Muhammad bin Abd al-Wahhab said in 'Mukhtasar Sirat al-Rasul' (Summary of the Prophet's Biography) (1): ((And in his days - meaning Ali - the extremists emerged and claimed divinity in Ali. Al-Hafiz Ibn Hajar said: It was reported via Abdullah bin Sharik Al-Amiri from his father, who said: It was said to Ali: There are people at the door of the mosque claiming that you are their Lord. Ali called them and said to them: Woe to you! I am but like you; I eat food as you eat and drink as you drink. If I obey Allah, He rewards me, and if I disobey Him, I fear He will punish me. So fear Allah and return! They refused! When it was the next day, they came to him, and Qanbar came to him and said: By Allah, they have returned saying that talk. He asked for them to be brought in. They said the same thing. When it was the third day, he said: If you say that, I will kill you with the most wretched killing. But they refused except that.",
    "foot_note": "1. (1) Mukhtasar Sirat al-Rasul, p. 434. What he quoted from Al-Hafiz is in «Fath Al-Bari» 12 / 282.",
    "book_id": "1129",
    "new_page_number": 38
  },
  {
    "serial_number": "7486620",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "He said: 'O Qanbar, bring me laborers with their spades' — workers with their digging tools — so he dug a trench for them between the mosque and the palace. He said to them: 'Dig and go deep into the earth.' He brought firewood and threw it into the fire in the trench and said: 'I will throw you into it unless you recant.' They refused to recant. So he cast them in until they burned. He said: 'When I saw the matter was a grievous evil... I kindled my fire and called for Qanbar.' Its chain of narration is Hasan (good). In the Sahih, it is reported that when news of their burning reached Ibn Abbas, he said: 'Had it been me, I would not have burned them because of the saying of the Prophet, peace be upon him: \"Do not punish with the punishment of Allah.\" But I would have killed them because of the saying of the Messenger of Allah, peace be upon him: \"Whoever changes his religion, kill him\"' (1). When this reached Ali, he said: 'Ibn Abbas spoke the truth.' End quote. This attempt [to deny this event] is well-known in history and has been mentioned by a group of scholars of sects. Were it not for lengthening the discussion, I would have referred to their books. I have come across a statement by some contemporaries (2). This opinion has recently appeared from the enemies of Islam among the Orientalists and their followers. It is not unlikely that this denial has an early origin based on the Rafidah's denial of it, even though Al-Nawbakhti, the historian of the Rafidah who listed their sects, mentioned Ibn Saba and his sect, the Sabaiyyah, in his book: *Firaq al-Shia*, pp. 22-23. He denies this story and claims that it is:",
    "foot_note": "1. (1) Narrated by Al-Bukhari in the Book of Jihad, Chapter: Do not punish with the punishment of Allah. See the citation from Al-Hafiz Ibn Hajar in 'Fath al-Bari' 6/175 and in the Book of 'Istitabat al-Murtaddin' 12/282.\n2. He is: Dr. Kamil Mustafa Al-Shibi in his book *The Connection Between Shi'ism and Sufism*, pp. 90-91; he even went further than this, claiming that Ibn Saba is Ammar bin Yasir, may Allah be pleased with him, and tried to reconcile the descriptions of Ibn Saba found in history books with the descriptions of Ammar. See: pp. 38-54, 84-92. Discussing this claim requires elaboration unsuitable for this occasion.",
    "book_id": "1129",
    "new_page_number": 39
  },
  {
    "serial_number": "7486621",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "((A completely fabricated report that has not appeared in a trustworthy form in any reliable history book... We end up with a great benefit, which is that the Sabaiyyah is a heap of accusations cast upon a group... whether intentionally or unintentionally)) (1). The answer to him is: You are condemned by your own mouth; this story is not fabricated, but rather narrated by a group of historians and writers on sects - as you mentioned some of them in your book. Even stranger is that it was narrated with a Hasan (good) chain of transmission, as stated by Al-Hafiz Ibn Hajar. Indeed, the hadith of Ibn Abbas in Al-Bukhari is clear contextual evidence for the occurrence of that incident. Therefore, there is no entry point here for denying this incident for anyone who looks and reasons. After this, we realize how this corrupt clique - of the Kharijites and the Sabaiyyah - were the first manifestations of true extremism and radicalism, and the most popular among the extremist Rafidah in particular, and the rest of the Islamic sects in general. It suffices you to look at a single book on religions and sects to see the impact of that! We did not rely solely on the extremism of the Kharijites as the first manifestation of religious radicalism and extremism for the following reasons: 1- Their extremism is far lighter than the extremism of these Sabaiyyah regarding Ali, may Allah be pleased with him, in terms of religion, creed, and impact?!",
    "foot_note": "1. (1) As in pp. 87-90. End quote.",
    "book_id": "1129",
    "new_page_number": 40
  },
  {
    "serial_number": "7486622",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "2- The Kharijites fell into what they fell into out of foolishness and deficiency in their minds, insight, and knowledge (1). Their intention was definitely not to corrupt the religion and the Muslims - as is the case with the extremist Rafidah. Therefore, the clearest manifestations of extremism and radicalism, and their origin among Muslims, is the extremism of the Sabaiyyah, attributed to Abdullah bin Saba Al-Hamdhani, the Jew from Sana'a, nicknamed Ibn Al-Sawda - who converted to Islam during the era of Uthman and led the sedition between the Companions and Ali and those with him. He was the publisher of the extremists' saying regarding the deification of Ali - and Ali exiled him to Sabat Al-Madain where he did not openly declare his divinity before him. Thus, it can be said that the first emergence of forbidden extremism, terrorism, and radicalism in Islam with this thought and these beliefs was due to Abdullah bin Saba the Jew, may Allah banish him. Like the effect of Paul the Jew in corrupting the religion of the Christians?!",
    "foot_note": "1. (1) Evidence for this is that when Ibn Abbas debated them regarding their proofs and brought parallels to what they misunderstood in three issues: 1. The issue of appointing men as judges regarding the verse in An-Nisa, 2. The taking of the Mother of the Believers as a captive, 3. And declaring the wealth and blood of Muslims lawful; many of them returned (recanted), differing in number, while the rest refused to debate Ibn Abbas because he was from Quraysh and because they were, according to their claim, as Allah said: {But they are a contentious people} (Az-Zukhruf: 58).",
    "book_id": "1129",
    "new_page_number": 41
  },
  {
    "serial_number": "7486623",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "Second: The relationship between the emergence of extremism and radicalism among Muslims and ancient beliefs. If it is established that the first extremism that arose among Muslims and influenced subsequent centuries is the extremism of Abdullah bin Saba regarding the person of Ali, may Allah be pleased with him, and that Ibn Saba is a real figure whom sources on creeds almost unanimously agree was the first to call for the idea of sanctifying Ali and then his household (1); and that he was originally a Jew - and some ancient beliefs existed among Islamic sects and extremists, especially the Rafidah - given this existence, some contemporaries researched the theories of religious extremism and radicalism among Muslims: where did they come from? Some say: They are of Indian, Magian, Jewish, Christian, or Arab origin (2). The reality is that what the extremists possess is a collection of most of those beliefs - with a noticeable influence from the Jews - especially since it is the religion of the first extremist sect in Islam (3).",
    "foot_note": "1. (1) As in *Nash'at al-Fikr al-Falsafi* 1/68.\n2. A group of contemporaries researched this issue. Among them are Dr. Irfan Abdul Hamid in *Studies in Islamic Creeds* 34-43, Al-Samarra'i in *Extremism and Extremist Sects* 79-80, 125-180, Dr. Ali Al-Nashar in *The Emergence of Philosophical Thought* 1/68 and the second part on the influence of Jews on the Rafidah doctrine, and Nazlah Al-Jubouri in *The Extremist Movement and Its Persian Origins*. And Kamil Al-Shibi in *The Connection Between Sufism and Shi'ism* p. 128, and Ahmad Amin in *Duha al-Islam* 3/278, and Muhammad Abu Zahra in *History of Islamic Doctrines* 1/37-38, and others.\n3. Recently, a doctoral thesis on this subject was printed in two volumes titled *Exerting Effort in Proving the Resemblance of the Rafidah to the Jews*.",
    "book_id": "1129",
    "new_page_number": 42
  },
  {
    "serial_number": "7486624",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "Here is the statement of the one who knew the Rafidah best, the majestic Tabi'i Imam Al-Sha'bi (104 AH). Abu Al-Qasim Al-Lalaka'i Al-Tabari narrated with his chain to Abdul Rahman bin Malik bin Mighwal from his father who said: ((Al-Sha'bi said: O Malik, if I wanted them to give me their necks as slaves or to fill my house with gold - meaning the Rafidah - in exchange for me lying to them about Ali, they would have done so, but by Allah, I will never lie about him. O Malik: I have studied all these whims (heresies), and I have not seen a people more foolish than the Khashabiyya - one of the Rafidah sects. If they were animals, they would be donkeys, and if they were birds, they would be vultures. He said: I warn you against misleading whims, and the worst of them are the Rafidah; that is because they are the Jews of this nation who disparage Islam so that their misguidance may live, just as Paul son of Saul, the King of the Jews, disparaged the religion of Christianity. They did not enter Islam out of desire or fear of Allah, but out of hatred for the people of Islam and to attack them. Ali bin Abi Talib burned them with fire and exiled them from the lands: among them Abdullah bin Saba whom he exiled to Sabat, Abdullah bin Yasar whom he exiled to Khazar, and Abu Al-Karous and his son to Al-Jabiya. That is because the trial of the Rafidah is the trial of the Jews. The Jews said: Kingship is only fit for the family of David, and the Rafidah said: Imamate is not fit except in the family of Ali.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 43
  },
  {
    "serial_number": "7486625",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Jews said: There is no Jihad in the path of Allah until the Antichrist (Masih ad-Dajjal) emerges or Jesus descends from the sky. And the Rafidah said: There is no Jihad until the Mahdi emerges and a caller calls out from the sky. The Jews delay the Maghrib prayer until the stars intertwine, and so do the Rafidah. The Hadith from the Messenger of Allah, peace be upon him, says: «My Ummah will remain upon the Fitrah (sound nature) as long as they do not delay Maghrib until the stars intertwine.» The Jews turn slightly away from the Qibla, and so do the Rafidah. The Jews let their garments hang low (Isbal), and so do the Rafidah. The Messenger of Allah, peace be upon him, ordered a man who had let his garment hang low to tuck it up or fold it. The Jews distorted the Torah, and likewise the Rafidah distorted the Quran. The Jews deem the blood of every Muslim lawful, and so do the Rafidah. The Jews do not consider the triple divorce to be anything, and so do the Rafidah. The Jews do not see a waiting period (Iddah) for women, and so do the Rafidah. The Jews hate Gabriel and say: He is our enemy among the angels, and likewise a class of the Rafidah - the Ghurabiyya - say: He made a mistake with the revelation intended for Muhammad (1). The Jews and Christians surpassed the Rafidah in two traits: The Jews were asked: Who are the best of your religion? They said: The companions of Moses. The Christians were asked: Who are the best of your religion? They said: The disciples of Jesus.",
    "foot_note": "1. (1) The Ghurabiyya said: Ali resembles Muhammad as a raven resembles a raven, so this confused Gabriel and he made a mistake; instead of bringing the revelation to Ali, he gave it to Muhammad? May Allah deform them! Allah says: {The Trustworthy Spirit has brought it down (193) Upon your heart, that you may be of the warners (194) In a clear Arabic language} [Ash-Shu'ara: 193-195].",
    "book_id": "1129",
    "new_page_number": 44
  },
  {
    "serial_number": "7486626",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "And the Rafidah were asked: Who are the worst of your religion? They said: The Companions of Muhammad. They were commanded to ask forgiveness for them, but they cursed them. So the sword is drawn against them until the Day of Resurrection; no foot will stand firm for them, no banner will be raised for them, and no word will unite them. Their call is refuted and their gathering is scattered; whenever they kindle a fire for war, Allah extinguishes it) End quote (1). Here is what Abu Bakr Al-Baqillani said in his book *Fada'ih al-Batiniyya* (Scandals of the Esoterics) - may Allah facilitate its publication - via the commentary of Al-Tahawiyyah (2). He said in it: ((For this reason, Rafd (Rejectionism) was the gateway to Zandaqa (heresy), as recounted by Judge Abu Bakr Al-Tayyib regarding the Batinis and how they corrupted the religion of Islam. He said: They said to the caller (missionary): You must, if you find someone you invite who is a Muslim, make Tashayyu' (Shi'ism) his religion and slogan in his presence. Make the connection [based on] the oppression of the Salaf against Ali, their killing of Al-Hussein, and disavowal of Taym and Adi - the tribes of Abu Bakr and Umar - and Banu Umayyah and Banu Abbas, even though they are from the Family of the House (Ahl al-Bayt). Speak of the Raj'a (Return) and that Ali knows the Unseen and the creation of the world is delegated to him! And similar wonders of the Shia and their ignorance. If you perceive response and guidance from some Shia during the call, inform him of the faults of Ali and his son, may Allah be pleased with them.....)) End quote (3).",
    "foot_note": "1. (1) Ibn Taymiyyah mentioned two paths for this narration in *Minhaj al-Sunnah*; one via Ibn Shahin with his chain to Al-Sha'bi, and the other via Abu Amr Al-Talamanki to him, and he quoted their wording in full. He pointed to this narration of Al-Lalaka'i and said afterwards: This narration has been reported from multiple perspectives verifying each other, and some adding to others, like from Abdul Rahman bin Malik, who is weak. Then he said: Al-Sha'bi's condemnation of them is established through other paths. End quote. *Al-Minhaj* 1/22-36. The investigator of Al-Lalaka'i's book said in number 2823: Al-Khallal narrated it with a longer wording than Al-Lalaka'i's narration.\n2. *Sharh Al-Tahawiyyah* p. 90.\n3. Abu Hamid Al-Ghazali benefited from Al-Baqillani's book in *Fada'ih al-Batiniyya*, which is printed in a small volume.",
    "book_id": "1129",
    "new_page_number": 45
  },
  {
    "serial_number": "7486627",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "The extremists among the Rafidah took from the Magians, the people of Persia - as in the Hadith of Abu Huraira regarding the stance on extremism - where the Prophet, peace be upon him, stated clearly that they take from Persia and Rome. Among the beliefs influenced by the extremists is the doctrine of Wasiyya (Executorship), brought by Ibn Saba, where he said: Ali is the executor of the Messenger of Allah, from the Jewish beliefs that they say: Joshua bin Nun is the executor of Moses, peace be upon him. They took Tashbih (Anthropomorphism) - likening the Creator to the created - from the Jews, where the Jews said: {The hand of Allah is chained} [Al-Ma'idah: 64], and said: {Indeed, Allah is poor} [Al-Imran: 181]. The early Rafidah were anthropomorphists and corporatists, and among the most famous of them were Hisham bin Al-Hakam Al-Rafidi and Al-Jawaliqi. They spoke of Ali's ascension to the sky, and Ibn Saba denied those who said he died, saying that even if his brain were brought in a bundle or seventy bundles, he would not believe in his death, and that he would descend to the earth. Like the People of the Book's saying regarding Elijah - Jesus - peace be upon him - which is the doctrine of Raj'a (Return). They said: He is above the clouds, thunder is his voice, and lightning is his whip with which he strikes the clouds. They took the denial of Qadar (Divine Decree) and that the servant creates his own action, which is the saying of a Jewish sect called the Farushim (Pharisees) (1). And they took Hulul (Indwelling/Incarnation) and Tanasuk (Reincarnation/Transmigration of souls) from the Christians and Indians (2).",
    "foot_note": "1. (1) As in *History of Islamic Doctrines* 1/125 quoting Ahmad Amin from *Fajr al-Islam*, and the translation of this word is the Mu'tazila.\n2. This is based on induction from books on sects and creeds that I have reviewed, and I have only mentioned the most important beliefs. Refer specifically to the discussion on the sects of the extremist Rafidah whose influence by ancient and pagan beliefs appeared clearly, such as the Sabaiyyah, Kaysaniyyah, Bayaniyyah, Khattabiyya, Nusayriyyah..... See concerning them: *Al-Milal wa Al-Nihal* 2/12-13, *Al-Fisal* by Ibn Hazm 5/137-144, *Studies in Islamic Creeds* 35-41, *Maqalat al-Islamiyyin* 1/66-88, *Al-Zina* by Al-Razi 303-307, *Beliefs of Muslim Sects* 70-71, *Al-Farq bayna al-Firaq* 177 and following, *The Emergence of Philosophical Thought* 1/Chapters 1, 2, and 4, *Al-Burhan fi Ma'rifat 'Aqa'id Ahl al-Adyan* 67-85, *Al-Tabsir fi al-Din* Chapter 13 123-124, *History of Islamic Doctrines* 1/38-43 and 58-59, *Al-Fawa'id al-Mujtami'ah fi Bayan al-Firaq al-Dallah al-Mubtadi'ah*, and the treatise ((Declaration of Deviant Sects)) by Al-Yaziji and *Al-Nawaqis li Zuhur al-Rawafid* by Al-Barzanji, both of which are manuscripts I have copies of, and *Al-Firaq al-Muftariqah* by Al-Afandi, and *Al-Bakura Al-Sulaymaniyya*, and others.",
    "book_id": "1129",
    "new_page_number": 46
  },
  {
    "serial_number": "7486628",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "And other beliefs that corrupted their religion for them. I do not single out the extremist Shia with this, but everyone who came with extremist thought, such as the Mu'tazila, the extreme Qadariyyah, the Hululiyyah (Incarnationists), the Ittihadiyyah (Monists), the Batiniyyah (Esoterics), and the heretics in general, may Allah deform them!",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 47
  },
  {
    "serial_number": "7486629",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "Third - The extremism and radicalism of the Mu'tazila, and its impact. Their extremism appeared in three aspects: In the chapter of Names and Attributes, where they denied them for Allah and stripped Him, Glory be to Him, of them, resembling the Jahmiyyah, which is their principle they call ((Tawhid)). And in the chapter of Qadar (Decree) by denying Allah's decree and His will over the actions of His creation, also based on their principle they call ((Justice)). The third aspect, which is the most dangerous thing they have, relates to Names and Rulings (Al-Asma wa Al-Ahkam) regarding people's names in this world: are they Muslims, Fasiqs (sinners), or Kafirs (disbelievers)? And their rulings in the Hereafter: are they in Paradise or Hell? This revolves around their principles: 1 - The Third Principle which is ((The Enforcement of the Promise and the Threat)), making the committer of a major sin eternally in Hellfire. 2 - The Fourth Principle which is ((The Intermediate Position between the Two Positions)), where the sinner in this world is neither a Muslim nor a disbeliever, but in a position between the two, which they term with a specific terminology: Fasiq (1). 3 - The Fifth Principle: Enjoining Good and Forbidding Evil. This principle for them stands on rebelling against sultans and rulers if they fall into sin, rebelling by hand and sword if they are able to (2). This is the fruit of the Kharijite doctrine in using the sword against the sinner, which makes the description of Wa'idiyyah (Threateners) applicable to all of them.",
    "foot_note": "1. (1) See these principles among the Mu'tazila in *Sharh al-Usul al-Khamsah* by Judge Abdul Jabbar Al-Hamdani the Mu'tazili (415 AH), and *Al-Mughni fi Abwab al-Adl wa al-Tawhid* by him, and *Al-Muhit bi al-Taklif* by him also, and *Maqalat al-Islamiyyin* by Abu Al-Hasan Al-Ash'ari 2/218 and following.\n2. See *Sharh al-Usul al-Khamsah* 144, *Maqalat al-Islamiyyin* 1/278, and *Al-Intisar* by Al-Khayyat the Mu'tazili 117 and following.",
    "book_id": "1129",
    "new_page_number": 48
  },
  {
    "serial_number": "7486630",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "The next chapter, which is the third, explains the extremism and radicalism of the Mu'tazila in these principles and their effects, which strikes through Takfir (excommunication) and fighting in the history of Muslims through them.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 49
  },
  {
    "serial_number": "7486631",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "Chapter Three: Extremism and Radicalism in the Chapter of Names and Rulings and Its Effects. First - What are Names and Rulings? This term is new and was not known among the first generation of the righteous Salaf, although it existed in its meaning and rulings. Names (Al-Asma): Is what a servant is named in this world regarding religious names: Believer, Disbeliever, Fasiq (sinner), Disobedient, Hypocrite..... Rulings (Al-Ahkam): Is what is judged upon him in the Hereafter: In Paradise or eternally in Hell or not eternally in it. This topic is the fruit of the disagreement regarding the definition of Faith (Iman) and its reality, and the definition of Disbelief (Kufr) and its reality. Everyone who has an opinion on Faith, you will find in the end of his opinion a determination regarding the servant's judgment in the Hereafter and his name in this world. For this reason, the discussion will initially be on extremism in the chapter of Faith among the sects, and Names and Rulings will be included as a result of it. The Ahlus Sunnah wal Jama'ah believe that Faith consists of three things: 1- Speech of the tongue. 2- Belief of the heart and inner self. 3- Action of the limbs and pillars. With its increase through obedience to the Merciful, and its decrease through disobedience. The origin of this saying is derived from the induction of the Book (Quran) and the Sunnah, the Companions' understanding of them, and the indication of the Arabic language for their terms.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 50
  },
  {
    "serial_number": "7486632",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "Accordingly, the servant according to Ahlus Sunnah, based on the texts, is named a Believer in this world unless he is a committer of a major sin that causes Fisq (ungodliness) or Kufr (disbelief). If he has a sin causing Fisq, they name him a believer deficient in faith according to his sin, or a Fasiq believer, and he is treated like Muslims except in testimony and the like. On the Day of Resurrection, he is among the people of Paradise under the will of Allah; if He wills, He punishes him for his major sin, or He forgives him through His mercy. If He punishes him for it, he does not remain eternally in Hellfire because he is a Muslim possessing the root of Faith. If it is an innovation causing Kufr, then the ruling of apostasy is applied to him, and they name him a disbeliever (Kafir) to apply the rulings of a disbeliever upon him. On the Day of Resurrection, he - the Kafir - is eternal in Hell. However, they do not testify for a specific individual - even if the punishment for apostasy was carried out on him - that he is among the people of Hell eternally; due to their lack of knowledge of what Allah sealed his deeds with, such as sincere repentance. Likewise, regarding testimony of Faith; they do not testify for a specific individual that he is among the people of Paradise, except those whom the evidence has specified, such as the Ten Promised Paradise and Ukasha bin Mihsan and the like, may Allah be pleased with them all.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 51
  },
  {
    "serial_number": "7486633",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "Second - The Extremist Sects in this Chapter. The Kharijites and the Mu'tazila, who are the Wa'idiyyah (Threateners), agreed with Ahlus Sunnah on the definition of Faith but separated from them in its application until they became extreme or radical in Names and Rulings. The Kharijites went to extremes and said: The committer of a major sin is named a Disbeliever (Kafir) in this world, whose blood and wealth are lawful, and his ruling on the Day of Resurrection is that he is eternal in Hellfire. The Mu'tazila said: He - i.e., the committer of a major sin - is in a position between the two positions, neither a believer nor a disbeliever; this is in this world. They might name him Fasiq, but not with the meaning used by Ahlus Sunnah wal Jama'ah; rather, a Fisq that removes him from the rank of Faith and does not enter him into the depths of Disbelief. His ruling on the Day of Resurrection is that he is eternally abiding in Hell. So their difference with the Kharijites is in his name in this world, as they did not declare the Kharijites' saying, even though they agreed with them on the Hereafter's judgment which is a result of prior action; and for this reason they were called ((The Effeminates of the Kharijites))?! The Jahmiyyah, and the Salihiyya - followers of Abu Al-Hasan Al-Salihi the Mu'tazili - and the Thawbaniyya, and the Ghassaniyya - followers of Yunus bin Awn Al-Numayri - and the Shabibiyya - followers of Muhammad bin Shabib - and likewise Ghaylan bin Muslim Al-Dimashqi said; they said:",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 52
  },
  {
    "serial_number": "7486634",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "Faith is knowledge and acknowledgment of Allah and His Messenger with the heart only, even if not accompanied by speech of the tongue or action of the limbs; so every knower of Allah in his heart in this world is among the people of Paradise. And the opposite holds true. Therefore, Ibn Al-Qayyim said in Al-Nuniyyah recounting the doctrine of Jahm and his likes: They said: And the servants' acknowledgment that He... Is their Creator is the ultimate Faith / And people in Faith are one thing... Like a comb when the teeth are equal. These are the Pure Murji'ah. The Karramiyya - followers of Muhammad bin Karram Al-Sijistani the Ascetic - and the opinion of the Najjariyya - followers of Al-Hussein bin Muhammad Al-Najjar from the Mu'tazila - and they are Muqatil bin Sulaiman and his followers; they said: Faith is merely the utterance of Tawhid with one's tongue. So whoever utters Tawhid, according to them, is a believer of complete faith and is in the Hereafter in the Gardens of Bliss. The Karramiyya, as famously known among scholars, are from the general Murji'ah, or say from their commoners and intermediates! The Ash'aris said, and it is the apparent view of the Maturidiyya: Faith is Assent (Tasdiq) with the heart only. So they separated from the Pure Murji'ah by adding Assent to the acknowledgment of the heart! The saying of the commentator of Al-Tahawiyyah (1) is interpreted according to the view of the Ash'aris and Maturidiyya:",
    "foot_note": "1. (1) p. 332 of *Sharh Al-Aqidah Al-Tahawiyyah* by Ibn Abi Al-Izz Al-Hanafi.",
    "book_id": "1129",
    "new_page_number": 53
  },
  {
    "serial_number": "7486635",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "((Some of them say: Acknowledgment with the tongue is an extra pillar, not an original one, and Abu Mansur Al-Maturidi, may Allah have mercy on him, went to this, and it is narrated from Abu Hanifa, may Allah be pleased with him)) End quote. I say: As for the statement of Abu Hanifa, it is strange to attribute it to him, since what is famous from him, may Allah have mercy on him, as in *Sharh Al-Fiqh Al-Akbar* (1) is his saying: ((Faith is Acknowledgment and Assent. The faith of the inhabitants of the heavens does not increase or decrease regarding the One believed in, but increases and decreases regarding certainty and assent. Believers are equal in Faith and Tawhid, varying in deeds)) End quote. This which became famous among the Hanafis and was mentioned by the commentator of Al-Tahawiyyah is what Abu Ja'far Al-Tahawi Al-Hanafi established in his creed, and for this reason, they are called by scholars ((The Murji'ah of the Jurists)). As for the statement of Abu Mansur Al-Maturidi, I have not come across it. If it were authentic, his disagreement with the Jahmiyyah - the proponents of Knowledge (Ma'rifa); that Faith is knowledge of Allah and His Messenger in the heart - would be a verbal disagreement since the tongue is an extra pillar, not original. Based on this, the Murji'ah are levels: 1 - The Pure Murji'ah, who say that Faith is knowledge in the heart only, and Disbelief is ignorance. 2- The common Murji'ah ((Karramiyya)) who say that Faith is acknowledgment with the tongue only.",
    "foot_note": "1. (1) pp. 124-129 of *Sharh Al-Fiqh Al-Akbar* by Abu Hanifa by Mulla Ali Qari Al-Harawi.",
    "book_id": "1129",
    "new_page_number": 54
  },
  {
    "serial_number": "7486636",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "3- The Ash'aris and Maturidiyya: Those who say that Faith is Assent with the heart/inner self. 4- The Murji'ah of the Jurists who say that Faith is Assent with the heart and Acknowledgment with the tongue.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 55
  },
  {
    "serial_number": "7486637",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "Third - Discussing the Opinions of the Extremists. The saying of the Jahmiyyah is too obvious to need discussion, as it is the most corrupt of opinions; because its implication is testifying to the faith of the most disbelieving of Allah's creation, those whom Allah declared disbelievers in His Book, like Iblis, Pharaoh and his people, and Umayyah bin Khalaf. The implication of their saying is that they are believers; because all of them acknowledged Allah and His Messenger in their hearts, as Allah recounted about them in more than one verse in His Mighty Book. Just as He, Glory be to Him, said about Iblis: {He said: My Lord, because You have put me in error, I will surely make [disobedience] attractive to them on earth and I will mislead them all} [Al-Hijr: 39], and He said in Surah Sad: {He said: By Your might, I will surely mislead them all} [Sad: 82]. And He, Glory be to Him, said about Pharaoh and his people in Surah An-Naml: {And they rejected them, while their inner selves were convinced thereof, out of injustice and haughtiness. So see how was the end of the corrupters} [An-Naml: 14]. And He, Glory be to Him, said at the end of Surah Al-Isra: {He said: You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think, O Pharaoh, that you are destroyed} [Al-Isra: 102].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 56
  },
  {
    "serial_number": "7486638",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "As for the Kharijites and the Mu'tazila, one of their most prominent specious arguments is holding on to His saying, the Almighty: {And whoever kills a believer intentionally, his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and has prepared for him a great punishment} [An-Nisa: 93]. They said: This is a believer who committed a sin and a major offense by killing another believer aggressively and intentionally, so Allah Almighty made him eternal in His Fire, and no one abides eternally in the Fire except a Disbeliever; so this indicates that he is a Disbeliever eternally in the Fire due to his major sin, and likewise for the rest of sins.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 57
  },
  {
    "serial_number": "7486639",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "Fourth - Refuting the Wa'idiyyah (Threateners) from the Kharijites and Mu'tazila. The refutation of the Wa'idiyyah from the Kharijites and Mu'tazila in their inference from the verse in An-Nisa is from several angles: 1- That Allah mentioned eternity (Khulud) in the verse but did not mention it as everlasting (Ta'bid) like His saying about the people of Paradise: {Abiding therein forever, Allah being pleased with them and they with Him} [Al-Bayyinah: 8]. And like His saying about the people of Fire in three places in the Quran at the ends of An-Nisa, Al-Ahzab, and Al-Jinn {Abiding therein forever}, so He explicitly stated therein eternity with everlastingness. Thus, the intended meaning of eternity (Takhleed) in this verse is a long stay, especially since the sin of killing a soul which Allah has forbidden is one of the greatest major sins after Shirk (polytheism) with Allah, as indicated by the hadith of Abu Huraira, may Allah be pleased with him, regarding the Seven Destructive Sins, which is in Muslim. This indicates the greatness of this crime and its enormity, not the disbelief of its doer! 2- Indeed, Allah Almighty, in the rulings of retribution (Qisas), named the killer a brother to the killed, as in His saying: {But if any remission is made to anyone by his brother, then grant any reasonable demand} [Al-Baqarah: 178].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 58
  },
  {
    "serial_number": "7486640",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "If the killer were a disbeliever, it would not have been permissible for Allah to name him a brother to the believer; because brotherhood is affection and it is only for the believer {You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers} ... [Al-Mujadila: 22]. 3- Also, it is permissible to pardon in retribution by accepting blood money (Diyah), or nothing at all out of generosity and grace. If the killer were a disbeliever apostate, it would not be permissible to drop the Hadd punishment from him by pardon, due to the Hadith \"Whoever changes his religion, kill him\" and the Hadith \"The blood of a Muslim man is not lawful except in one of three cases: The married adulterer, a life for a life, and the one who leaves his religion and separates from the community.\" 4 - If the Hadd is carried out on the killer, he is prayed over, washed, and buried with the Muslims in their cemeteries, and giving charity on his behalf is permissible... and upon this is the consensus of the Salaf. If he were a disbeliever, the rulings of apostates would apply to him, and what preceded of rulings specific to Muslims would not be permissible for him. 5 - Some scholars like Ibn Jarir and others said: The verse is specific to those who deem killing lawful (Istihlal). If it is so, then he is a disbeliever without doubt, but the apparent meaning of the verse is far from this interpretation!",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 59
  },
  {
    "serial_number": "7486641",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 57,
    "volume_number": 1,
    "text": "6 - And for the sake of argument, this verse is specific to one who kills a believer intentionally, so other sins like theft, stoning (adultery), slander... etc., do not fall under it. 7 - The generality of His saying, the Almighty, in the two verses of An-Nisa: {Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills} [An-Nisa: 48]. There is no doubt that killing is less than Shirk with Allah by consensus; so it falls under the Will (Mashi'ah) in this verse. As for the doubt of the Karramiyya in their saying: Faith is speech with the tongue only; because Allah called people to acknowledge Him, and the revealed books, as in His saying: {Say, \"We have believed in Allah and what has been revealed to us and what has been revealed to Abraham and Ishmael...\"} [Al-Baqarah: 136]. So Allah did not command us here except with speech, indicating that Faith depends on it. The answer to them is also from several aspects: 1 - The utmost that the verse indicates is the command to believe in Allah, the heavenly books, and the prophets from Allah, and not to differentiate between His messengers by believing in some and disbelieving in others. There is no indication in the verse that Faith is limited to speech only.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 60
  },
  {
    "serial_number": "7486642",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 58,
    "volume_number": 1,
    "text": "2 - The verse immediately following it states: {So if they believe in the like of that which you believe, then they are rightly guided} [Al-Baqarah: 137]; meaning if the People of the Book and others believe in the like of what you believed in regarding faith in Allah, His angels, His books, and His messengers... And some of these are only in the heart, indicating that Faith is not limited to mere speech. 3 - In this verse, there is a mention of the most important types of Faith, and the verse did not encompass all types of Faith ((in Allah and His angels...)). The branches of Faith are many, and in the rest of the texts, there is completion of all types of Faith; The Almighty said: {But righteousness is [in] one who believes in Allah, the Last Day, the angels, the Book, and the prophets...} [Al-Baqarah: 177] and others. So the Quran is taken in its entirety, not partially. Likewise the Sunnah, where texts appeared declaring disbeliever the one who believed in faith with all its six levels but does not pray, or deemed lawful a sin that is explicitly forbidden, with definitive evidence on its prohibition. 4 - This saying contradicts His saying: {The Bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted'...\"} [Al-Hujurat: 14].",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 61
  },
  {
    "serial_number": "7486643",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 59,
    "volume_number": 1,
    "text": "So Allah negated Faith from the Bedouins even though they uttered the word of Tawhid, but Faith had not entered their hearts, unless they meant by that Islam - meaning by Faith, Islam - then there is no contradiction between the two verses. 5 - It follows from your saying: That Faith is merely speech with the tongue only, judging the hypocrites who testified with their tongues that they are believers as having complete faith, and this contradicts the clear text of the Book; The Almighty said: {Indeed, the hypocrites will be in the lowest depths of the Fire and you will never find for them a helper} [An-Nisa: 145], and other verses indicating their disbelief and denial and that their destination is the Fire. 6 - Also, it follows from this saying that one who has a defect like the mute, and cannot speak with his tongue - despite his heart's assent and certainty in Faith - follows that he is a disbeliever, and this contradicts the consensus of Muslims. In any case, limiting Faith to merely uttering it - along with its necessity initially - is a false saying contrary to the apparent meaning of texts from the Book and Sunnah and the consensus of Muslims, and the action of the Messenger, peace be upon him, with those who newly embrace Islam. As for those who say that Faith is Assent (Tasdiq), which is the saying of the Ash'aris and Maturidis, it is also false.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 62
  },
  {
    "serial_number": "7486644",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 60,
    "volume_number": 1,
    "text": "- Because if it were so, the obligation of the disbeliever uttering Tawhid - the two testimonies - upon entering Islam would not be valid, which is what the Prophet, peace be upon him, and his companions and Muslims after them did with those wanting Islam from among the disbelievers. - And also, declaring anyone from the people a disbeliever would not be valid, [even if] he comes with a nullifier of Islam, or leaves prayer intentionally or out of negligence... as long as he has assent in the heart alone! Indeed, these two demonstrate the corruption of their saying and its distance from correctness. Similarly, the saying of the Murji'ah of the Jurists that Faith is: Acknowledgment and Assent, contradicts the practice of the Messenger of Allah, peace be upon him, and the Muslims after him regarding the obligation of the action of Faith through prayer, Hajj, fasting, and Jihad, and linking many actions to Faith. Indeed, they contradict their saying in what they establish in their Fiqh regarding the obligation of action starting from the Book of Purification to the end of the Fiqh chapters. If these were not from Faith, what is the need for researching them, knowing them, and acting upon them? Furthermore, they are among the most expansive of the four schools in establishing the chapters on the ruling of the apostate and clarifying the words and deeds by which a believer apostatizes from Islam. This is in addition to their arranging of legal penalties and punishments in this world and the Hereafter for abandoning actions.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 63
  },
  {
    "serial_number": "7486645",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 61,
    "volume_number": 1,
    "text": "Fifth - The Effect of Extremism in Names and Rulings. The saying of the Kharijites has passed that the Fasiq (sinner) is a disbeliever in this world, eternal in the Fire on the Day of Resurrection; permissible to seize his wealth, deem his blood lawful, enslave him, and divorce his wife from him, and it is not permissible to pray over him or bury him with Muslims... and he is in the Hereafter despairing of Allah's mercy, due to the certainty that he is a disbeliever and eternal in Hellfire. As for the Mu'tazila, they agree with them in the judgment of the Day of Resurrection, which is the Afterlife Judgment, without the judgment of this world. These people have restricted the people by holding them accountable for their major sins and acts of disobedience. How many men would remain in the religion after this strictness and difficulty?! For who can absolve himself from falling into acts of disobedience or leaving duties... The danger of those Kharijites continues, until a sect appeared in this time calling for their ideas and rooting their principles, which is the group of Shukri Ahmad Mustafa (1398 AH) in the land of Egypt, known as Jama'at At-Takfir wal-Hijra. Groups of those with little knowledge and insight among impulsive emotional youth, and groups from activist movements and Hizb ut-Tahrir and others, have been influenced by this group and its sayings. Among the sayings of Shukri (1) regarding the committer of sin:",
    "foot_note": "1. (1) I was keen to access the sayings of the group through their two treatises: *Al-Hujiyyat* and *Ijmal Ta'wilatihim wa Al-Radd Alayha*, but they were withheld from me. Therefore, I relied on what was quoted from them by the author of *((Ruling by Other Than What Allah Revealed and the People of Extremism regarding it))* p. 167, for he stated that he took directly from those treatises, and perhaps Allah will facilitate access to them.",
    "book_id": "1129",
    "new_page_number": 64
  },
  {
    "serial_number": "7486646",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 62,
    "volume_number": 1,
    "text": "((It has never happened that the Sharia differentiated between practical disbelief (Kufr Amali) and heart disbelief (Kufr Qalbi), nor has a single text come indicating or pointing the slightest indication that those who disbelieved by their behavior are different from those who disbelieved by their hearts and beliefs. Rather, all texts indicate that disobedience to Allah in action and disbelief in Him in behavior and reality is, by itself, a cause for punishment and eternity in the Fire and deprivation from Paradise)) End quote. It suffices me to point out the effects of that sect on people: 1- Its members isolating themselves from Egyptian society because it is disbelieving; and because it is satisfied with disbelief. 2 - Liquidating and killing everyone who opposed them or refuted them - including the Dhahabi of Egypt - because whoever opposes them is a disbeliever, as the proof has been established against him yet he was not convinced by it, so the rulings of the apostate apply to him. 3 - According to them, anyone who does not rule by what Allah has revealed is a disbeliever with a disbelief that expels one from the religion entirely, without detail, unlike the method of the investigators among Ahlus Sunnah regarding the necessity of detail. 4 - Takfir (excommunication) by sins and judging the doer to be eternal in Hellfire. This is among the greatest justifications for the occurrence of Takfir, bombings, killing, deeming blood, honor, and wealth lawful, spreading corruption on earth, frightening the safe, and spreading chaos and fear among secure societies.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 65
  },
  {
    "serial_number": "7486647",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 63,
    "volume_number": 1,
    "text": "5 - Distorting the image of Islam's tolerance among people - and this coincided with labeling them as extremists, terrorists, hardliners, and the Takfir wal-Hijra group - and dividing Muslims, and spreading chaos, fear, and lack of security among them. This is witnessed in various places among the likes of these people. Regrettably, they believe that their behavior is religious devotion to Allah and Jihad, out of ignorance of knowledge, religion, and its objectives! 6 - Their claim that they are the group of the awaited Mahdi, due to the coincidence of the time the Prophet, peace be upon him, informed about the Mahdi's existence with the time they live in?! Thus, every saying or sect that adopts ideas and beliefs like those of the Kharijites must result in effects similar to what results from this sect, which are naturally and rationally praiseworthy, let alone by the tolerant Sharia. With the caveat that it does not necessitate that whoever resembles the Kharijites - or other sects - in some of their principles is one of them or affiliated with them, but the just judgment in this is to say: He resembled the Kharijites in their principle of such and such. And Allah knows best, and praise be to Allah by whose grace good deeds are completed.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 66
  },
  {
    "serial_number": "7486648",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 64,
    "volume_number": 1,
    "text": "Conclusion. Praise be to Allah, and peace and blessings be upon our Prophet Muhammad and upon his family and companions: After this tour within the folds of this research between its introduction, chapters, and sections, and through moving through its histories starting from the extremism of the people of Noah, peace be upon him, to the paganism of the Greeks, to the extremism of the People of the Book: Jews and Christians, then their influence on Muslim sects, and the emergence of extremism in it regarding extremism in Names and Rulings, and extremism in Persons and Places, these results were obtained included with recommendations, the most important of which were the following: That Ghuluw (Extremism) in religion is exceeding the limit, and it is blameworthy in the Sharia. Radicalism (Tatarruf) is a general meaning, and Ghuluw is more specific than it. Terrorism is of two types: Legitimate through Jihad in the path of Allah, and forbidden by frightening the safe among Muslims and others. The Sharia preceded in defining its meaning through the meanings of Hirabah (banditry) and spreading corruption on earth, and the prohibition of injustice. Using the terms extremism, radicalism, and terrorism out of context, if Muslims or Islam - creed or law - are accused of being their source. And that this is distortion and altering facts. Religious extremism and radicalism are ancient in humanity represented in the extremism of the people of Noah regarding their righteous ones, and the extremism of the Greeks regarding their gods, and the extremism of the People of the Book.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 67
  },
  {
    "serial_number": "7486649",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 65,
    "volume_number": 1,
    "text": "The influence of beliefs from those before us on sects of Muslims in the emergence of extremism among them. This appeared clearly in the Rafidah, the Jahmiyyah, the Mu'tazila, and the Kharijites. That blameworthy extremism and radicalism by bearing arms against Muslims and using the sword among them is an innovated emergence, appearing among the Kharijites then their development and the Mu'tazila through their three principles: 1 - Enforcement of the Threat. 2 - The Intermediate Position between Two Positions. 3 - Enjoining Good and Forbidding Evil. (7) The effects of extremism and radicalism through forbidden terrorism and violence return to a poor understanding of the issues of Names and Rulings: in the name of people in this world regarding Islam or Fisq and disobedience or Kufr and hypocrisy, then their judgment in the Hereafter: are they from the people of Paradise? Or from the people of Fire? Or who enters the Fire then exits it to Paradise? (8) Furthermore, issues of extremism generate one another, as it is a circle that starts narrow then expands to affect Creed, Speech, and Action, and corruption and spoiling in religion and life result from it. The reality of extremists testifies to all this, and there is no power or strength except by Allah. The most important reasons for treating religious extremism and radicalism are through correct Sharia knowledge.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 68
  },
  {
    "serial_number": "7486650",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Historical Roots of the Reality of Extremism, Radicalism, Terrorism, and Violence",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 66,
    "volume_number": 1,
    "text": "And by knowing its causes and bewaring of guidance that bequeaths transgression, injustice, and aggression in understanding, belief, speech, and action. And Allah is the One whose help is sought.",
    "foot_note": "None",
    "book_id": "1129",
    "new_page_number": 69
  }
]