[
  {
    "text": "How We Must Interpret the Noble Qur'an\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "How We Must Interpret the Noble Qur'an",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1366\nbook_title: كيف يجب علينا أن نفسر القرآن الكريم\nbook_link: https://shamela.ws/book/11362\nbook_id: 11362\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: المكتبه الإسلامية\nedition: الأولى 1421هـ\npages: 40\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "How We Must Interpret the Noble Qur'an",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1116276",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sciences of the Qur'an and Principles of Interpretation. Book: How We Must Interpret the Noble Qur'an. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library. Edition: First 1421 AH. Number of Pages: 40 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: How We Must Interpret the Noble Qur'an. Author: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library. Edition: First 1421 AH. Number of Pages: 40 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: The Islamic Library. Edition: First 1421 AH. Number of Pages: 40 [Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering corresponds to the printed version]. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 3
  },
  {
    "serial_number": "1116277",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Publisher's Introduction. Indeed, all praise is due to Allah, we praise Him, we seek His help, we ask for His forgiveness, and we seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, there is none to misguide him, and whomever He leaves astray, there is none to guide him. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His slave and His Messenger. As for what follows; This is a treatise: \"How must we interpret the Noble Qur'an?\" Its origin is questions that were presented to Sheikh Muhammad Nasir al-Din al-Albani, may Allah the Exalted have mercy on him, and he answered them in a recording. Then it was transcribed and printed on papers and presented to the Sheikh, may Allah the Exalted have mercy on him, so he read it and commented on it in his own handwriting. The Islamic Library in Amman saw fit to publish it today so that the benefit may spread, and so the knowledge of the Sheikh, may Allah have mercy on him, may spread, and so that he may be rewarded for it in his grave, may Allah have mercy on him. Despite its small size, it is of great benefit and immense utility to the entire Islamic nation, as it clarifies the principles and rules that must",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 4
  },
  {
    "serial_number": "1116278",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 4,
    "volume_number": 1,
    "text": "be followed by us if we wish to interpret the Noble Qur'an in the correct manner that pleases our Lord, Blessed and Exalted is He, and which He legislated upon the tongue of His Prophet, may Allah bless him and grant him peace, followed thereafter by the best of this nation: his Companions, then those who followed them in goodness, may Allah be pleased with them all. Just as it contains, despite its small size, a great deal of general rules that concern every Muslim who wants to be from the Saved Sect, and which he must hold fast to and act upon so that they may lead him to the correct path, such as the rule \"Whenever a Sunnah is revived, an innovation is killed\" and others from those luminous rules which Allah opened up to the Sheikh, may Allah have mercy on him and forgive him. For he was of vast knowledge and understanding of the Shariah of Islam and the Sunnah of our Messenger, may Allah bless him and grant him peace. And our Lord spoke the truth when He said: {Allah raises those who have believed among you and those who were given knowledge, by degrees} [Al-Mujadila: 11]. May Allah have mercy on the Sheikh, and may He reward those who undertake the publication of his knowledge after him with good, and may He benefit every Muslim who views it with this knowledge. The Publisher. Amman, 4 Dhu al-Hijjah 1420 AH.",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 5
  },
  {
    "serial_number": "1116279",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 5,
    "volume_number": 1,
    "text": "Question 1: Regarding the authenticity of the hadith: \"Take from the Qur'an what you wish for what you wish\"... Question 1: Virtuous Sheikh! I read in a small book a hadith that says: \"Take from the Qur'an what you wish for what you wish.\" Is this hadith authentic? Benefit us, may Allah reward you with good. The Answer: This hadith: \"Take from the Qur'an what you wish for what you wish\" (1); is a hadith famous on some tongues, but—with deep regret—it is one of those hadiths that have no basis in the Sunnah. Therefore, it is not permissible to narrate it or attribute it to the Prophet, may Allah bless him and grant him peace. Furthermore, this broad, comprehensive meaning is not correct and is never established in the Shariah of Islam: \"Take from the Qur'an what you wish for what you wish.\" For example, if I sat in the middle of my house, not working in my profession or craft, and I ask for provision from my Lord, to send it down upon me from the sky because I take from the Qur'an for this! Who says this?! This is false speech, and perhaps it is from the fabrication of those lazy Sufis who were imprinted with sitting and dwelling in what they call Ribats (hostels/hospices), residing in them and waiting for Allah's provision from whatever people bring to them. Knowing that this is not from the nature of the Muslim, because the Prophet, may Allah bless him and grant him peace, raised the Muslims",
    "foot_note": "1. 1 \"Al-Da'ifah\" \"557\".",
    "book_id": "11362",
    "new_page_number": 6
  },
  {
    "serial_number": "1116280",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 6,
    "volume_number": 1,
    "text": "all upon high aspirations and self-dignity. For he, upon him be blessings and peace, said: \"The upper hand is better than the lower hand. The upper hand is the spending one, and the lower hand is the asking one\" (1). I am reminded on this occasion of something I had read regarding some of the ascetics among the Sufis—and I will not prolong this, for their stories are many and strange—: They claimed that one of them went out wandering, striking out into the land without provisions. The matter reached a point where he was about to die of hunger. Then a village appeared to him from afar, so he came to it. The day was Friday, and he had, according to his claim, gone out relying (Tawakkul) on Allah. So, in order not to invalidate—according to his claim—his alleged reliance, he did not show himself to the public in the mosque. Rather, he curled up on himself under the pulpit so that no one would notice him. However, he was saying to himself, perhaps someone will sense him. And so the preacher delivered his sermon, and he [the man] did not pray with the congregation! After the Imam finished the sermon and the prayer, and the people began to leave in groups and individually from the doors of the mosque, until the man sensed that the mosque was almost empty of people, and at that point the doors would be locked, and he would remain alone in the mosque without food or drink, he had no choice but to",
    "foot_note": "1. 1 Al-Bukhari \"1429\" and the wording is his, Muslim \"1033\".",
    "book_id": "11362",
    "new_page_number": 7
  },
  {
    "serial_number": "1116281",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 7,
    "volume_number": 1,
    "text": "clear his throat to prove his presence to those present. So some people turned around and found him having transformed as if he were bone from hunger and thirst. So they took him and aided him. They asked him: Who are you, O man?! He said: I am an ascetic relying on Allah. They said: How can you say 'relying on Allah' when you were about to die?! If you were truly relying on Allah, you would not have asked, and you would not have alerted the people to your presence by clearing your throat, even if you died in your sin?! This is an example of what such a hadith, \"Take from the Qur'an what you wish for what you wish,\" leads to. The conclusion: This hadith has no basis.\n\nQuestion 2: Inquiry about the Sheikh's opinion on the adherence of the Quranists to the saying of Allah the Exalted: {We have not neglected in the Register a thing}... Question 2: Virtuous Sheikh! The Quranists say: Allah the Exalted said: {And We have detailed everything with distinct explanation} Al-Isra: 12 [and the Exalted said: {We have not neglected in the Register a thing}] Al-An'am: 38. [And the Messenger, may Allah bless him and grant him peace, says: \"Indeed this Qur'an, one end of it is in the Hand of Allah, and the other end is in your hands, so hold fast to it, for you will never go astray nor be destroyed after it, ever\" (1). We hope for a comment from your virtue on that.",
    "foot_note": "None\n\n1. 1 \"Sahih At-Targhib wa At-Tarhib\" \"1/93/35\".",
    "book_id": "11362",
    "new_page_number": 8
  },
  {
    "serial_number": "1116283",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 8,
    "volume_number": 1,
    "text": "The Answer: As for His saying, Exalted is He: {We have not neglected in the Register a thing} [Al-An'am: 38], this verse refers to 'The Book' here as: The Preserved Tablet (Al-Lawh Al-Mahfuz), and it does not refer to: The Noble Qur'an. As for His saying, Exalted is He: {And We have detailed everything with distinct explanation} [Al-Isra: 12], if you append to the Noble Qur'an what has been explained previously, then it is established that Allah, Mighty and Majestic, has detailed everything with distinct explanation, but with another addition. For you know that detailing (Tafseel) may sometimes be by way of summation, by establishing general rules under which fall particulars that cannot be counted due to their multitude. So by the Wise Lawgiver establishing known rules for those many particulars, the meaning of the noble verse becomes apparent. And sometimes the detailing is what is immediately understood from this verse, as he, upon him be blessings and peace, said: \"I have not left anything which Allah ordered you with except that I have ordered you with it, nor have I left anything which Allah forbade you from except that I have forbade you from it\" (1). So the detailing, therefore, is sometimes through rules under which fall many particulars, and sometimes it is through the detailing of individual acts of worship and rulings, a detailing that does not",
    "foot_note": "1. 1 \"Al-Sahihah\" \"1803\".",
    "book_id": "11362",
    "new_page_number": 9
  },
  {
    "serial_number": "1116284",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 9,
    "volume_number": 1,
    "text": "require returning to a rule from those rules. And among the rules under which do not fall many sub-issues—and through which the greatness of Islam and the breadth of Islam's scope in legislation appear—is his saying, may Allah bless him and grant him peace, for example: \"No harm and no reciprocating harm\" (1). And his saying, upon him be peace: \"Every intoxicant is Khamr (wine), and every Khamr is forbidden\" (2). And his saying, upon him be peace: \"Every innovation is misguidance, and every misguidance is in the Fire\" (3). These are rules and comprehensive principles that miss nothing related to harm to the self or harm to property in the first hadith, and what relates to what intoxicates as in the second hadith, whether the intoxicant is derived from grapes—as is famous—or from corn, or from any material from other materials. So as long as",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"7517\". 2 \"Irwa al-Ghalil\" \"8/40/2373\". 3 \"Sahih At-Targhib wa At-Tarhib\" \"1/92/34\", and \"Salat al-Tarawih\" \"p 75\".",
    "book_id": "11362",
    "new_page_number": 10
  },
  {
    "serial_number": "1116285",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 10,
    "volume_number": 1,
    "text": "it is intoxicant, it is forbidden. Likewise in the third hadith: Innovations cannot be limited due to their abundance, nor can they be enumerated, yet this hadith—despite its brevity—says clearly \"and every innovation is misguidance, and every misguidance is in the Fire.\" This is detailing but through rules. As for the rulings that you know, they are detailed by individual items mentioned in the Sunnah mostly, and sometimes, like the laws of inheritance for example, they are mentioned in the Noble Qur'an. As for the hadith that was mentioned, it is an authentic hadith. Acting upon it is what enables us to hold fast to it, and as came in the hadith: \"I have left among you two matters; you will not go astray as long as you hold fast to them: The Book of Allah and the Sunnah of His Messenger\" (1). So holding fast to the rope of Allah—which is in our hands—is indeed acting upon the Sunnah that explains the Noble Qur'an.",
    "foot_note": "1. 1 \"Mishkat al-Masabih\" \"1/66/186\".",
    "book_id": "11362",
    "new_page_number": 11
  },
  {
    "serial_number": "1116286",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 11,
    "volume_number": 1,
    "text": "Question 3: About the validity of the statement of one who says: If a hadith contradicts a verse from the Qur'an, it is rejected... Question 3: There are those who say: If a hadith contradicts a verse from the Qur'an, it is rejected, whatever its degree of authenticity may be. And he gave an example of that with the hadith \"Indeed the deceased is punished by the weeping of his family over him\" (1), and argued with the statement of Aisha in her rejection of the hadith using the saying of Allah, Mighty and Majestic: {And no bearer of burdens will bear the burden of another} [Fatir: 18]. So how is one to respond to the one who says this? The Answer: Rejecting this hadith is one of the problems of rejecting the Sunnah by the Qur'an, and it indicates the deviation of that line of thought. As for the answer regarding this hadith—and I specifically address the one who held onto the hadith of Aisha, may Allah be pleased with her—it is: First: From the Hadith perspective: There is no way to reject this hadith from the Hadith perspective for two reasons: The First: That it came with an authentic chain of narration from Ibn Umar, may Allah be pleased with them both. The Second: That Ibn Umar, may Allah be pleased with him, was not alone in narrating it; rather, Umar bin Al-Khattab corroborated him on that, and he and his son were not alone in it, for Al-Mughira bin Shu'bah corroborated them. And this is what comes to my mind at this hour, that these narrations from",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"1970\"",
    "book_id": "11362",
    "new_page_number": 12
  },
  {
    "serial_number": "1116287",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 12,
    "volume_number": 1,
    "text": "these three Companions, may Allah be pleased with them, are in the Two Sahihs. However, if a researcher were to conduct a special search on this hadith, he would find other paths for it. And these three hadiths are all hadiths with authentic chains of narration, so they are not rejected merely by a claim of contradiction with the Noble Qur'an. Second: From the Tafsir (interpretive) perspective: The scholars have interpreted this hadith in two ways: The First View: That this hadith only applies to the deceased who knew during his lifetime that his family would commit legislative violations after his death, yet he did not advise them nor bequeath to them that they should not weep over him, because weeping is a cause for the punishment of the deceased. And the definite article \"Al\" (The) in the word \"Al-Mayyit\" (The Deceased) here is not for total inclusion and comprehensiveness; meaning: the hadith does not mean that *every* deceased person is punished by the weeping of his family over him. Rather, \"Al\" here is for specific reference (Al-Ahd), meaning: The deceased who does not advise that they not commit what contradicts the Shariah after his death. This is the one who is punished by the weeping of his family over him. As for the one who performed the duty of advice, and the duty of the legislative will that they not",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 13
  },
  {
    "serial_number": "1116288",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 13,
    "volume_number": 1,
    "text": "wail over him, and that they not perform the forbidden acts that are done especially in these times, then he is not punished. And if he did not bequeath and did not advise, he is punished. This detailing is what we must understand from the first interpretation of many of the well-known and famous scholars, such as Al-Nawawi and others. And if we know this detail, it becomes clear that there is no contradiction between this hadith and His saying, Exalted is He: {And no bearer of burdens will bear the burden of another} [Fatir: 18]. The contradiction only appears if it is understood that \"Al\" in the word \"Al-Mayyit\" is for total inclusion and comprehensiveness, meaning: *every* deceased is punished. At that point, the hadith becomes problematic and contradicts the noble verse. But if we know the meaning that we mentioned just now, there is no contradiction and no problem, because the one who is punished is only punished because of his failure to perform the duty of advising and bequeathing. This is the first view of what has been said in the interpretation of this hadith to repel the claimed contradiction. As for the Second View: It is what Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, mentioned in some of his works, that the punishment here is not punishment in the grave, or punishment in the Hereafter, but rather it is in the sense of feeling pain and in the sense of sadness. Meaning: That the deceased, if",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 14
  },
  {
    "serial_number": "1116289",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 14,
    "volume_number": 1,
    "text": "he hears the weeping of his family over him, feels sorrow and sadness for their sadness over him. This is what Sheikh al-Islam Ibn Taymiyyah said, and if this were correct, it would have uprooted the doubt completely. But I say: This interpretation contradicts two facts, so we have no choice but to rely on the first interpretation of the hadith: The First Fact: That in the hadith of Al-Mughira bin Shu'bah, may Allah be pleased with him, which I indicated earlier, there is an addition clarifying that the punishment is not in the sense of feeling pain, but rather it is in the sense of the immediately understood punishment, meaning: the punishment of the Fire, unless Allah, Blessed and Exalted, forgives, as is explicit in His saying, Mighty and Majestic: {Indeed, Allah does not forgive that you join partners with Him, but He forgives other than that for whom He wills} [An-Nisa: 48]. For in the narration of Al-Mughira, he said: \"Indeed the deceased is punished by the weeping of his family on the Day of Resurrection.\" This is explicit that the deceased is punished because of his family's weeping over him on the Day of Resurrection, and not in the grave, which is what Ibn Taymiyyah interpreted as pain and sadness. The Other Fact: Is that when the deceased dies, he does not sense anything happening around him, whether this thing is good or evil—as indicated by the evidences of the Book and the Sunnah—except on some occasions that were mentioned in",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 15
  },
  {
    "serial_number": "1116290",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 15,
    "volume_number": 1,
    "text": "some hadiths, either as a rule for every deceased person, or for some of the dead, where Allah, Mighty and Majestic, makes them hear something which causes them pain. From the first type: The hadith narrated by Al-Bukhari in his Sahih from the hadith of Anas bin Malik, may Allah the Exalted be pleased with him, who said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Indeed, when the slave is placed in his grave, and his companions turn away from him—even so that he hears the tapping of their sandals—two angels come to him\" (1). So in this authentic hadith is the affirmation of a specific hearing for the deceased at the time of his burial, and when the people leave him. Meaning: at the time the two angels sit him up, the soul is returned to him. So in this state, he hears the tapping of sandals. The hadith does not mean, obviously, that this deceased person and all dead people have their souls returned to them, and that they remain hearing the tapping of sandals passing between the graves until the Day they are resurrected! No. Rather this is a special situation and a special hearing for the deceased, because his soul was returned to him. In that case, if we were to take the interpretation of Ibn Taymiyyah, may Allah have mercy on him, we would have widened the circle of the deceased's sensing of what happens around him, whether at his deathbed before his burial, or after his placement in his grave. The meaning of that would be: that he hears the weeping of the living over him, and this",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"1675\".",
    "book_id": "11362",
    "new_page_number": 16
  },
  {
    "serial_number": "1116291",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 16,
    "volume_number": 1,
    "text": "requires a text, and it is missing. This is firstly. Secondly: Some texts of the Book and the authentic Sunnah indicate that the dead do not hear. This is a long discussion, but I will mention one hadith and conclude the answer to the question, which is the saying of the Prophet, may Allah bless him and grant him peace: \"Indeed, Allah has angels wandering on the earth who convey to me the Salam from my Ummah\" (1). His saying \"wandering\" (Sayahin) means: circulating in the gatherings. So whenever a Muslim sends blessings (Salah) upon the Prophet, may Allah bless him and grant him peace, there is an assigned angel who conveys the Salam from that Muslim to the Prophet, may Allah bless him and grant him peace. If the dead could hear, the one most entitled among these dead to hear would be our Prophet, may Allah bless him and grant him peace, due to the favor Allah, Blessed and Exalted, bestowed upon him, and the characteristics He distinguished him with over all Prophets, Messengers, and the worlds. So if anyone were to hear, it would be the Prophet, may Allah bless him and grant him peace. Then, if the Prophet, may Allah bless him and grant him peace, were to hear anything after his death, he would hear the prayer of his Ummah upon him. From here, you understand the error—if not the misguidance—of those who seek aid (Istighatha) not only from the Prophet, may Allah bless him and grant him peace, but from those below him, whether they are messengers, prophets, or righteous people. For if they were to seek aid from the Messenger, upon him be blessings and peace, he would not hear them, as",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"2174\".",
    "book_id": "11362",
    "new_page_number": 17
  },
  {
    "serial_number": "1116292",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 17,
    "volume_number": 1,
    "text": "is explicit in the Qur'an: {Indeed, those you invoke besides Allah are servants like you} [Al-A'raf: 194], and {If you invoke them, they do not hear your supplication} [Fatir: 14] to the end of the verse. Therefore, the dead do not hear after their death, except for what came in the text regarding a specific case—as I mentioned previously—regarding the deceased hearing the tapping of sandals. With this, the answer to this question concludes.\n\nQuestion 4: About the ruling on turning on a recorder playing the Qur'an and being distracted from listening to it... Question 4: If a recorder is turned on playing the Noble Qur'an, and some of those present are not listening because they are busy talking, what is the ruling on not listening? And does anyone among those present or the one who turned on the recorder bear sin? The Answer: The answer to this issue differs according to the gathering in which the Qur'an is being recited from the recorder. If the gathering is a gathering of knowledge, remembrance, and recitation of the Qur'an, then it is obligatory—in this case—to listen attentively. Whoever does not do so is sinful, for his violation of the saying of Allah, Blessed and Exalted, in the Qur'an: {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} [Al-A'raf: 204].",
    "foot_note": "None\n\nNone",
    "book_id": "11362",
    "new_page_number": 18
  },
  {
    "serial_number": "1116294",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 18,
    "volume_number": 1,
    "text": "However, if the gathering is not a gathering of knowledge, remembrance, or Quranic recitation, but rather a normal gathering—such as a person working in the house, studying, or reading—then in this case, it is not permissible to turn on the recording device and raise the volume of the recitation such that it reaches others who are not obligated to listen, because they did not sit for that purpose. The one responsible is the one who raised the volume of the recorder and made others hear its sound, because he causes hardship for the people and compels them to listen to the Qur'an in a state where they are not prepared for listening. The closest example of this: One of us walks in the street and hears from the grocer or the falafel seller, who also sells these recorded tapes \"cassettes,\" having filled the air with the sound of the Qur'an. Wherever you go, you hear this sound. So are those walking in the street—each on his own path—obligated to listen silently to this Qur'an which is being recited out of place?! No. Rather, the one responsible is this person who causes hardship for the people and makes them hear the sound of the Qur'an, either for trade or to attract people's attention, and similar material interests. Thus, they take the Qur'an on one hand as musical instruments (Mizamir)—as came",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 19
  },
  {
    "serial_number": "1116295",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 19,
    "volume_number": 1,
    "text": "in some hadiths (1), and on the other hand, they purchase a small price with the verses of Allah in a manner different from the manner of the Jews and Christians about whom Allah, Mighty and Majestic, said in this verse: {They exchanged the signs of Allah for a small price} [At-Tawbah: 9].\n\nQuestion 5: Regarding the meaning of His saying, Exalted is He: {And they planned, and Allah planned. And Allah is the best of planners}... Question 5: Allah, Mighty and Majestic, informs about Himself saying: {And they planned, and Allah planned. And Allah is the best of planners} [Al Imran: 54]. Perhaps the minds of some people are too narrow to understand this verse upon its apparent meaning. And since we do not need interpretation (Ta'wil), how is Allah the best of planners (Makirin)? The Answer: The matter is easy by the grace of Allah. That is because we can know that plotting/planning (Makar)—in and of itself—is not always and forever described as evil, just as it is not always and forever described as good. For perhaps a disbeliever plots against a Muslim, but this Muslim is astute and smart, not oblivious or stupid, so he is alert to the plot of his disbelieving opponent. So he deals with him in a manner opposite to his plot, such that the result is that this Muslim, through his good planning, overcomes the disbeliever and his bad plotting. So is it said: That this Muslim, when he planned against the disbeliever, engaged in an illegitimate matter? No one says this. And it is easy for you to understand this fact from his saying, upon him be blessings",
    "foot_note": "1. 1 \"Al-Sahihah\" \"979\".\n\nNone",
    "book_id": "11362",
    "new_page_number": 20
  },
  {
    "serial_number": "1116297",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 20,
    "volume_number": 1,
    "text": "and peace: \"War is deception\" (1). So what is said regarding deception is said regarding plotting/planning exactly. For a Muslim to deceive his Muslim brother is forbidden (Haram), but for a Muslim to deceive the disbeliever, the enemy of Allah and the enemy of His Messenger, this is not forbidden; rather, it is obligatory. Likewise, the plotting of a Muslim against a disbeliever who wants to plot against him—such that this Muslim invalidates the plot of the disbeliever—this is good planning. This is a human and that is a human. So what do we say regarding the Lord of the Worlds, the Able, the All-Knowing, the All-Wise? Behold, He invalidates the plotting of all plotters, thus He said: {And Allah is the best of planners}. So when our Lord, Mighty and Majestic, described Himself with this attribute, He drew our attention to the fact that plotting, even from humans, is not always [bad], because He said {And Allah is the best of planners}. So there is one who plans with good, and one who plans with evil. He who plans with good is not blamed. And Allah, Mighty and Majestic, is as He said: {And Allah is the best of planners}. In short, I say: Whatever crosses your mind, Allah is different from that. So if a person imagines a matter that does not befit Allah, let him know immediately that he is mistaken. For this verse is praise for Allah, Mighty and Majestic, and there is nothing in it that is impermissible to attribute",
    "foot_note": "1. 1 Al-Bukhari \"3030\", Muslim \"1740\"",
    "book_id": "11362",
    "new_page_number": 21
  },
  {
    "serial_number": "1116298",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 21,
    "volume_number": 1,
    "text": "to Allah, Blessed and Exalted.\n\nQuestion 6: Regarding the meaning of His saying, Exalted is He: {And whoever seeks a religion other than Islam, it will never be accepted from him}, and who are the Sabians?... Question 6: How do we reconcile between these two verses: {And whoever seeks a religion other than Islam, it will never be accepted from him} [Al Imran: 85], and His saying, Exalted is He: {Indeed, those who have believed [in Prophet Muhammad] and those [before Him] who were Jews or Sabians or Christians - those [among them] who believed in Allah and the Last Day and did righteousness - no fear will there be concerning them, nor will they grieve} [Al-Ma'idah: 69]? The Answer: There is no contradiction between the two verses as the question implies. That is because the verse of Islam applies after the call of Islam reaches those people whom Allah, Mighty and Majestic, described in the second verse {no fear will there be concerning them, nor will they grieve}. He mentioned among them the Sabians (As-Sabi'ah). When the Sabians are mentioned, what comes to mind is that the intended meaning is: the star worshippers. But—in reality—they are every people who fell into Shirk (polytheism) after having been people of Tawhid (monotheism). For the Sabians were monotheists, then Shirk and star worship happened to them. So those mentioned in this verse are the believers among them, the monotheists. These people, before the coming of the call of Islam, are like the Jews and Christians, and they were also mentioned in the same context in which",
    "foot_note": "None\n\nNone",
    "book_id": "11362",
    "new_page_number": 22
  },
  {
    "serial_number": "1116300",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 22,
    "volume_number": 1,
    "text": "the Sabians were mentioned. So regarding these people, whoever among them was holding fast to his religion in his time, he is among the believers: {no fear will there be concerning them, nor will they grieve}. However, after Allah, Mighty and Majestic, sent Muhammad, upon him be blessings and peace, with the religion of Islam, and the call of this Islam reached those people—Jews, Christians, and Sabians—nothing is accepted from them except Islam. Therefore, His saying, Exalted is He: {And whoever seeks a religion other than Islam} means: after the coming of Islam on the tongue of the Messenger, upon him be blessings and peace, and the reaching of the call of Islam to him, nothing will be accepted from him except Islam. As for those who were before the mission of the Messenger, upon him be blessings and peace, with Islam, or those who might exist today on the face of the earth and the call of Islam has not reached them, or the call of Islam reached them but it reached them distorted from its foundation and reality—as I mentioned on some occasions regarding the Qadianis, for example, who spread in Europe and America calling to Islam, but this Islam they call to is not from Islam in anything, because they speak of the coming of prophets after the Seal of Prophets, Muhammad, upon him be blessings and peace—so these people, from the Europeans and Americans who were invited to Qadiani Islam, and",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 23
  },
  {
    "serial_number": "1116301",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 23,
    "volume_number": 1,
    "text": "the call of true Islam did not reach them, are of two types: A type among them is upon a previous religion and they are holding fast to it; so upon them the verse {no fear will there be concerning them, nor will they grieve} is applied. And a type deviating from this religion—as is the case with many Muslims today—so the proof is established against them. As for those whom the call of Islam did not reach at all—whether after Islam [began] or before it—these have a special treatment in the Hereafter. It is that Allah, Mighty and Majestic, will send a messenger to them to test them—just as people were tested in the worldly life. So whoever responds to that messenger in the plains of the Day of Resurrection and obeys him enters Paradise, and whoever disobeys him enters the Fire (1).\n\nQuestion 7: Regarding the verse: {And We have placed over their hearts coverings, lest they understand it, and in their ears deafness} and who are the Sabians?... Question 7: The Exalted said: {And We have placed over their hearts coverings (Akinnah), lest they understand it, and in their ears deafness} [Al-An'am: 25]. Some smell from this verse the scent of Jabr (compulsion/predetermination). So what is your opinion on that? The Answer: This 'placing' (Ja'l) is a Universal/Cosmic (Kawni) placing. To understand this, one must explain the meaning of the Divine Will. For the Divine Will is divided into two parts:",
    "foot_note": "1. 1 \"Al-Sahihah\" \"2468\"\n\nNone",
    "book_id": "11362",
    "new_page_number": 24
  },
  {
    "serial_number": "1116303",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 24,
    "volume_number": 1,
    "text": "Legislative Will (Shar'iyyah) and Universal Will (Kawniyyah). The Legislative Will: It is everything that Allah, Mighty and Majestic, legislated for His slaves and urged them to perform, consisting of obediences and acts of worship with their varying rulings, from obligatory duties to recommended acts. So these obediences and acts of worship are willed by Him, Blessed and Exalted, and He loves them. As for the Universal Will: It may sometimes be what Allah did not legislate, but He decreed it. This will was named Universal Will (Kawniyyah) derived from His saying, Exalted is He: {His command is only when He intends a thing that He says to it, \"Be,\" and it is} [Ya-Sin: 82]. So \"a thing\" (Shay'an) is an indefinite noun that includes everything, whether it is obedience or disobedience. And that only happens by His saying, Exalted is He: {Be}, meaning by His volition, decree, and predestination. So if we know this Universal Will—which is that it includes everything, whether it is obedience or disobedience—we must be brought back to the subject of Divine Decree and Predestination (Al-Qada' wa Al-Qadar). Because His saying, Exalted is He: {And We have placed over their hearts coverings, lest they understand it, and in their ears deafness}, means that this matter for which He said {Be}, He made it a destined, existing matter that is inevitable. So everything with Allah, Mighty and Majestic, is by decree (Qadar). And this also",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 25
  },
  {
    "serial_number": "1116304",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 25,
    "volume_number": 1,
    "text": "includes good and evil. However, what relates to us, the two weighty beings (Thaqalayn)—Mankind and Jinn who are accountable and commanded by Allah, Mighty and Majestic—is that we look into what we ourselves perform. Either it is by our pure will and choice, or it is against our will. This second category does not have obedience or disobedience attached to it, nor is its consequence Paradise or Hellfire. Rather, the first category is that upon which the legislative rulings revolve, and based on which the person's recompense is Paradise or Hellfire. Meaning: What the human does by his will, and strives for by his earning and choice, is what he is held accountable for. If it is good, then good; and if it is evil, then evil. The fact that the human is one who has choice in a large portion of his actions is a reality that cannot be argued against religiously or rationally. As for religiously: The texts of the Book and the Sunnah are Mutawatir (mass transmitted) regarding the command for the human to do what he is ordered and to leave what he is forbidden from. These texts are too many to mention. As for rationally: It is clear to every human stripped of whim and bias that when he speaks, when he walks, when he eats, when he drinks,",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 26
  },
  {
    "serial_number": "1116305",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 26,
    "volume_number": 1,
    "text": "when he does anything that falls within his choice, he is choosing in that matter, not compelled at all. If I wished to speak now, there is no one forcing me to do so, naturally. But it is destined (Muqaddar). The meaning of my speech being destined is that it is destined *along with* my choice for this which I say and speak. However, it is within my ability to be silent to prove to anyone who is in doubt about what I say that I have choice in this speech. Therefore, human choice—in reality—is a matter that does not accept discussion or argument. Otherwise, the one who argues in such a matter is merely engaging in sophistry and casting doubt on self-evident truths. If a person reaches this stage, speech with him is cut off. So, human actions are of two types: voluntary and involuntary. Involuntary actions: There is no discussion about them, neither from the legislative perspective nor from the factual perspective. The legislation (Shar') relates to voluntary matters. This is the truth. If we fix this in our minds, we can understand the previous verse: {And We have placed over their hearts coverings}. This 'placing' is Universal (Kawni). And we must remember the previous verse {His command is only when He intends a thing} that the Will here is Universal Will. But it is not against the will of this person upon whose heart Allah placed",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 27
  },
  {
    "serial_number": "1116306",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 27,
    "volume_number": 1,
    "text": "a covering. An example from the material perspective: When a human is created, he is created with tender, soft flesh. Then as he grows and grows, his flesh hardens and his bones strengthen. However, people are not all the same. This one, for example, is a person dedicated to a type of study and knowledge; so what strengthens in him? His mind strengthens, and his brain strengthens in the aspect he is occupied with and pours all his effort into. But from the physical perspective, his body does not strengthen, and his muscles do not grow. And the reverse is exactly true: This is a person dedicated to the material aspect; every day he engages in physical exercises—as they say today. So this one, his muscles harden, his body strengthens, and he attains a form as we see sometimes in reality and sometimes in pictures. These champions, for example, their bodies become all muscle. So was he created like this, or did he acquire this strong structure with many muscles? This is something he reached by his earning and his choice. That is the likeness of the human who persists in his misguidance and in his stubbornness,",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 28
  },
  {
    "serial_number": "1116307",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 28,
    "volume_number": 1,
    "text": "and in his disbelief and denial, so the stain (Raan) reaches [the point of becoming] these coverings (Akinnah) that Allah, Mighty and Majestic, places over their hearts. Not by imposition from Allah and compulsion from Allah upon them, but rather because of their earning and their choice. So this is the Universal Placing (Al-Ja'l Al-Kawni) that these disbelievers earn, so they reach this point which the ignorant imagine was imposed upon them. The truth is that it was not imposed upon them, but rather it is because of what their hands earned, and Allah is not unjust to the servants.\n\nQuestion 8: Regarding the ruling of kissing the Mushaf (Quran)... Question 8: What is the ruling on kissing the Mushaf? The Answer: This falls—in our belief—under the generality of the hadiths which include \"Beware of newly invented matters, for every newly invented matter is an innovation (Bid'ah), and every innovation is misguidance\" (1), and in another hadith \"Every misguidance is in the Fire\" (2). Many people have a specific stance regarding such a detail. They say: What is wrong with that?! It is nothing but a show of reverence and veneration for the Qur'an. And we say: You have spoken the truth; there is nothing in it but reverence and veneration of the Noble Qur'an! But I wonder, was this reverence and veneration hidden from the first generation—the Companions of the Messenger, may Allah bless him and grant him peace,",
    "foot_note": "None\n\n1. 1 \"Sahih At-Targhib wa At-Tarhib\" \"1/92/34\". 2 \"Salat al-Tarawih\" \"p 75\".",
    "book_id": "11362",
    "new_page_number": 29
  },
  {
    "serial_number": "1116309",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 29,
    "volume_number": 1,
    "text": "and likewise their followers, and likewise the followers of the followers after them? There is no doubt that the answer will be as the scholars of the Salaf (predecessors) said: If it were good, they would have preceded us to it. This is one thing. The other thing: Is the default ruling for kissing something permission, or is the default prohibition? Here we must cite the hadith which the two Sheikhs (Bukhari and Muslim) narrated in their Sahihs, so that he who wishes to remember may remember, and know the distance of the Muslims today from their righteous Salaf, and from their understanding (Fiqh), and from their handling of matters that might occur to them. That hadith is: From Abbas bin Rabi'ah who said: I saw Umar bin Al-Khattab, may Allah be pleased with him, kissing the Stone—meaning: the Black Stone—and saying: \"Indeed, I know that you are a stone that neither harms nor benefits. If I had not seen the Messenger of Allah, may Allah bless him and grant him peace, kissing you, I would not have kissed you\" (1). What is the meaning of this statement from this Farooq (Umar): If I had not seen the Messenger of Allah, may Allah bless him and grant him peace, kissing you, I would not have kissed you?! So, why did Umar kiss the Black Stone, when it is as mentioned in the authentic hadith",
    "foot_note": "1. 1 \"Sahih At-Targhib wa At-Tarhib\" \"1/94/41\".",
    "book_id": "11362",
    "new_page_number": 30
  },
  {
    "serial_number": "1116310",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 30,
    "volume_number": 1,
    "text": "\"The Black Stone is from Paradise\" (1)?! Did he kiss it due to a philosophy originating from him, so that he could say, as the speaker says regarding the questioner's issue: This is the speech of Allah and we kiss it?! Did Umar say: This stone is a relic from the relics of Paradise which the pious were promised, so I kiss it, and I do not need a text from the Messenger of Allah, may Allah bless him and grant him peace, to clarify to me the legitimacy of kissing it?! Or did he treat this detailed issue as some people today want to speak with the logic that we call to, and which we call the Salafi logic, which is sincerity in following the Messenger, upon him be blessings and peace, and whoever practiced his Sunnah until the Day of Resurrection? Such was the stance of Umar. He says: If I had not seen the Messenger of Allah, may Allah bless him and grant him peace, kissing you, I would not have kissed you. So, the basis in this kissing is that we proceed in it according to a past Sunnah, not that we judge matters—as we indicated previously—and say: This is good, and what is wrong with it?! Remember with me the stance of Zaid bin Thabit regarding how he faced the proposal of Abu Bakr and Umar to him to compile the Qur'an to preserve the Qur'an from loss. He said: How can you do something that the Messenger of Allah, may Allah bless him and grant him peace, did not do?!",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"3174\"",
    "book_id": "11362",
    "new_page_number": 31
  },
  {
    "serial_number": "1116311",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Muslims today do not have this understanding (Fiqh) of the religion at all. If it is said to the one kissing the Mushaf: How do you do something that the Messenger of Allah, may Allah bless him and grant him peace, did not do?! He confronts you with strange and wonderful answers, among them: O brother! What is wrong with that?! This contains veneration of the Qur'an! So say to him: O brother! This speech is returned to you: Did the Messenger, may Allah bless him and grant him peace, not venerate the Qur'an? There is no doubt that he used to venerate the Qur'an, yet he did not kiss it. Or they say: You deny us kissing the Mushaf! Yet here you are riding a car, and traveling by plane, and these are things of innovation?! The reply comes based on what you heard, that the innovation which is misguidance is only that which is in the religion. As for in worldly matters, then as we hinted previously, it may be permissible, and it may be forbidden, etc. This is something known and does not need an example. A man rides a plane to travel to the House of Allah to perform Hajj; there is no doubt that it is permissible. And a man rides a plane to travel to the lands of the West and perform pilgrimage to it; there is no doubt that this is disobedience. And so on. As for acts of worship about which the questioner asked: Why do you do [this] (20)? He said: To draw closer to Allah!",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 32
  },
  {
    "serial_number": "1116312",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 32,
    "volume_number": 1,
    "text": "So I say: There is no way to draw closer to Allah, Blessed and Exalted, except through what Allah has legislated. But I want to remind of something which is—in my belief—very important for establishing and supporting this rule \"Every innovation is misguidance\"; there is no room for rational approbation (Istihsan) at all. Some of the Salaf say: No innovation was invented except that a Sunnah died. And I feel this reality tangibly due to my tracking of newly invented matters, and how they contradict what came from the Messenger, upon him be blessings and peace, in many instances. The people of knowledge and virtue, truly, if one of them takes the Mushaf to read from it, you do not see them kissing it; rather, they act upon what is in it. As for the common people—whose emotions have no controls—they say: And what is wrong with that?! And they do not know what is in it! So we say: No innovation was invented except that a Sunnah died. Similar to this innovation is another innovation: We see people—even the sinners among them who still have a remnant of faith in their hearts—if they hear the Mu'adhin (caller to prayer), they stand up! And if you ask them: What is this standing?! They say: Veneration for Allah, Mighty and Majestic! Yet they do not go to the mosque; they remain playing dice (Backgammon) and chess",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 33
  },
  {
    "serial_number": "1116313",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 33,
    "volume_number": 1,
    "text": "and the like. But they believe that they are venerating our Lord by this standing! Where did this standing come from?! It came, naturally, from a fabricated hadith that has no basis, which is \"When you hear the Adhan, stand up\" (1). This hadith has an origin, but it was altered by some of the weak narrators or liars. So he said \"stand up\" (Qumu) instead of \"say\" (Qulu). And he shortened the authentic hadith \"When you hear the Adhan, say (Qulu) as he says, then send blessings upon me\" (2) etc. the hadith. So look at how Satan beautifies innovation for man, and convinces him within himself that he is a believer venerating the rites of Allah. The proof is that if he takes the Mushaf he kisses it, and if he hears the Adhan he stands for it?!! But does he act upon the Qur'an? He does not act upon the Qur'an! For example, he might pray, but does he not eat the Forbidden (Haram)? Does he not consume Riba (usury/interest)? Does he not feed Riba [to others]? Does he not spread among people the means by which they increase in disobedience to Allah? Does he? Does he? Questions with no end. Therefore, we stop at what Allah has legislated for us of obediences and acts of worship, and we do not add a single letter to them. Because as he, upon him be blessings and peace, said \"I have not left anything which Allah ordered you with except",
    "foot_note": "1. 1 \"Al-Da'ifah\" \"711\". 2 Muslim \"384\".",
    "book_id": "11362",
    "new_page_number": 34
  },
  {
    "serial_number": "1116314",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 34,
    "volume_number": 1,
    "text": "that I have ordered you with it\" (1). And this thing which you are doing, are you drawing closer to Allah by it? If the answer is: Yes. Then bring the text from the Messenger, upon him be blessings and peace. The answer: There is no text. Therefore, this is an innovation, and every innovation is misguidance, and every misguidance is in the Fire. Let it not be confusing to anyone so he says: Is this issue of this degree of simplicity, yet it is misguidance and its doer is in the Fire?! Imam Al-Shatibi answered this issue by saying: \"Every innovation, no matter how small, is misguidance.\" And in this ruling—that it is misguidance—one does not look at the innovation itself, but rather one looks in this ruling at the place where this innovation was put. What is this place? This place is the Shariah of Islam which has been completed and perfected. So there is no room for anyone to make an amendment (Istidrak) with a small or large innovation. From here comes the misguidance of the innovation, not merely because he invented it, but because he gives a meaning of amending/correcting our Lord, Blessed and Exalted, and our Prophet, may Allah bless him and grant him peace.",
    "foot_note": "1. 1 Passed on \"p 8\".",
    "book_id": "11362",
    "new_page_number": 35
  },
  {
    "serial_number": "1116315",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 35,
    "volume_number": 1,
    "text": "Question 9: How must we interpret the Noble Qur'an? The Answer: Allah, Blessed and Exalted, sent down the Noble Qur'an upon the heart of His Messenger Muhammad, may Allah bless him and grant him peace, to bring people out from the darknesses of disbelief and ignorance to the light of Islam. The Exalted said: {Alif, Lam, Ra. [This is] a Book which We have revealed to you, [O Muhammad], that you might bring mankind out of darknesses into the light by permission of their Lord - to the path of the Exalted in Might, the Praiseworthy} [Ibrahim: 1]. And He made His Messenger, may Allah bless him and grant him peace, the clarifier of what is in the Qur'an, and an interpreter and explainer of it. The Exalted said: {And We revealed to you the message that you may make clear to the people what was sent down to them and that they might give thought} [An-Nahl: 44]. So the Sunnah came as an interpreter and clarifier of what is in the Noble Qur'an, and it is revelation (Wahy) from Allah. The Exalted said {Nor does he speak from [his own] inclination * It is not but a revelation revealed} [An-Najm: 3-4]. And the Prophet, may Allah bless him and grant him peace, said: \"Beware, I have been given the Qur'an and the like of it with it. Beware, a satiated man on his couch is about to say: 'You must hold to this Qur'an; so whatever you find in it of Halal (lawful), deem it lawful, and whatever you find in it of Haram (unlawful), deem it unlawful.' But indeed, what the Messenger of Allah, may Allah bless him and grant him peace, forbade is like what Allah forbade\" (1). So the first thing by which the Noble Qur'an is interpreted is the Qur'an along with the Sunnah—which are the sayings,",
    "foot_note": "1. 1 \"Takhrij al-Mishkat\" \"No. 163\".",
    "book_id": "11362",
    "new_page_number": 36
  },
  {
    "serial_number": "1116316",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 36,
    "volume_number": 1,
    "text": "actions, and approvals of the Messenger of Allah, may Allah bless him and grant him peace—then after that, by the interpretation of the people of knowledge, and at their head are the Companions of the Messenger of Allah, may Allah bless him and grant him peace, and in the forefront of them: Abdullah bin Masud, may Allah be pleased with him. That is due to his companionship with the Prophet, may Allah bless him and grant him peace, on one hand, and due to his care in asking him about the Qur'an and understanding and interpreting it on the other hand. Then Abdullah bin Abbas, may Allah be pleased with them both, for Ibn Masud said regarding him: \"He is the Interpreter of the Qur'an.\" Then any Companion after them from whom an interpretation of a verse is established—and there was no disagreement among the Companions—we receive that interpretation at that point with satisfaction, submission, and acceptance. If it is not found, we must take from the Tabi'in (Followers) who took care to receive interpretation from the Companions of the Messenger of Allah, upon him be blessings and peace, such as Sa'id bin Jubayr, Tawus, and their likes among those who were famous for receiving the interpretation of the Qur'an from some of the Companions of the Messenger, upon him be blessings and peace, especially Ibn Abbas as we mentioned. There are—unfortunately—some verses interpreted by opinion and Madhab (School of Thought), where no clarification came regarding that directly from the Prophet, may Allah bless him and grant him peace. So some of the later scholars act independently in interpreting it to apply the verse to the Madhab. This is a very dangerous issue, where verses are interpreted to support the Madhab, while the scholars of Tafsir interpreted it contrary to how the people of that Madhab interpreted it.",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 37
  },
  {
    "serial_number": "1116317",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 37,
    "volume_number": 1,
    "text": "We can mention an example of that: His saying, Blessed and Exalted: {So read what is easy of the Qur'an} [Al-Muzzammil: 20]. Some Madhabs interpreted it as recitation itself. Meaning: The obligation from the Qur'an in the prayers is only a long verse or three short verses! They said this despite the arrival of the authentic hadith from the Prophet, may Allah bless him and grant him peace, who said: \"There is no prayer for the one who did not read the Opening of the Book (Al-Fatiha)\" (1). And in another hadith \"Whoever prayed a prayer in which he did not read the Opening of the Book, then it is defective (khidaj), it is defective, it is defective, not complete\" (2). The indication of these two hadiths was rejected—by the mentioned interpretation of the previous verse—with the claim that it [the verse] made the reading general, and it is not permissible according to them to interpret the Qur'an except by Mutawatir (mass transmitted) Sunnah; meaning, it is not permissible to interpret the Mutawatir except by the Mutawatir. So they rejected the two previous hadiths relying on their interpretation of the verse by opinion or by Madhab. While the scholars—all scholars of Tafsir, with no difference between those who preceded among them or those who came later—clarified that the intended meaning of the noble verse {So read} is: So pray what is easy for you of the Night Prayer. Because Allah, Mighty and Majestic, mentioned",
    "foot_note": "1. 1 \"Sahih Al-Jami'\" \"7389\". 2 \"Sifat as-Salah\" \"97\"",
    "book_id": "11362",
    "new_page_number": 38
  },
  {
    "serial_number": "1116318",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 38,
    "volume_number": 1,
    "text": "this verse on the occasion of His saying, Blessed and Exalted {Indeed, your Lord knows that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day} until He said: {So read what is easy of the Qur'an} [Al-Muzzammil: 20]. Meaning: So pray what is easy for you of the Night Prayer specifically. Allah, Mighty and Majestic, only made it easy for the Muslims to pray what is easy for them of the Night Prayer, so it is not obligatory upon them to pray what the Messenger of Allah, may Allah bless him and grant him peace, used to pray—as you know—eleven Rak'ahs. This is the meaning of the verse. And this, in the Arabic style, is from the chapter of mentioning the part and intending the whole. So His saying {So read} means: So pray. The prayer is the whole, and the reading is the part. That is to clarify the importance of this part in that whole. And that is due to His saying, Blessed and Exalted, in the other verse {Establish prayer at the decline of the sun [from its meridian] until the darkness of the night and [also] the Qur'an of dawn. Indeed, the recitation of dawn is ever witnessed} [Al-Isra: 78]. The meaning of {Qur'an of dawn} is: The Prayer of Fajr. So He also mentioned the part here and intended the whole. This is a known style in the Arabic language.",
    "foot_note": "None",
    "book_id": "11362",
    "new_page_number": 39
  },
  {
    "serial_number": "1116319",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 39,
    "volume_number": 1,
    "text": "Therefore, regarding this verse, after its interpretation appeared from the scholars of Tafsir without disagreement between their predecessors and successors, it was not permissible to reject the first and second hadith with the claim that it is a solitary (Ahad) hadith, and it is not permissible to interpret the Qur'an with solitary hadiths! Because the mentioned verse was interpreted by the sayings of the scholars who know the language of the Qur'an; this is firstly. And because the hadith of the Prophet, may Allah bless him and grant him peace, does not contradict the Qur'an, but rather interprets and clarifies it, as we mentioned at the beginning of this speech; this is secondly. So how [can they do this] when the verse has no relation to the subject of what a Muslim must read in the prayer, whether it is obligatory or voluntary?! As for the two hadiths mentioned previously, their subject is explicit that the prayer of the one praying is not valid except by reading Al-Fatiha. He said \"There is no prayer for the one who did not read the Opening of the Book\", and in the other hadith \"Whoever prayed a prayer in which he did not read the Opening of the Book, then it is defective (khidaj), it is defective, it is defective, not complete\" (1), meaning: it is incomplete. And whoever turns away from his prayer while it is incomplete, he has not prayed. And his prayer is then void (Batil), as is the apparent meaning of the first hadith. If this reality becomes clear to us, then we feel reassured regarding the hadiths",
    "foot_note": "1. 1 and \"2\" preceded in \"p 37\".",
    "book_id": "11362",
    "new_page_number": 40
  },
  {
    "serial_number": "1116320",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "How We Must Interpret the Noble Qur'an",
    "edition": "First 1421 AH",
    "publisher": "The Islamic Library",
    "page_number": 40,
    "volume_number": 1,
    "text": "that came from the Prophet, may Allah bless him and grant him peace, narrated in the books of Sunnah firstly, then with authentic chains of narration secondly. And we do not doubt nor waver in them due to the philosophy of the hadiths that we hear in this present age, which says: We do not care for solitary (Ahad) hadiths as long as they did not come regarding rulings, but rather are in beliefs (Aqa'id), and beliefs are not established on solitary hadiths. Thus they claimed! Yet we have known that the Prophet, may Allah bless him and grant him peace, sent Mu'adh to call the People of the Book to the creed of Tawhid (1), and he was one person. In this amount, there is sufficiency with this speech which I wanted to clarify, and it relates to: How must we interpret the Noble Qur'an? And may Allah send blessings, peace, and benedictions upon our Prophet Muhammad, his family, his companions, and those who follow them in goodness until the Day of Judgment. And praise be to Allah, Lord of the Worlds.",
    "foot_note": "1. 1 Al-Bukhari \"1485\", and Muslim \"19\"",
    "book_id": "11362",
    "new_page_number": 41
  }
]