[
  {
    "text": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»\nالمؤلف: محمد بن عبد الله المقشي\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "category_id": "31",
    "category": "النحو والصرف",
    "new_page_number": 1
  },
  {
    "text": "sn: 7377\nbook_title: فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»\nbook_link: https://shamela.ws/book/238\nbook_id: 238\nauthor_name: محمد بن عبد الله المقشي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3087\nauthor_ID: 3087\neditor: Null\npublisher: Null\nedition: غير مطبوع\npages: 75\nvolumes: Null\npagination: [الكتاب غير مطبوع]\ncategory: النحو والصرف\ncategory_id: 31",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "category_id": "31",
    "category": "النحو والصرف",
    "new_page_number": 2
  },
  {
    "serial_number": "6662871",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: النحو والصرف الكتاب : فتح الكريم اللطيف في شرح « باكورة التعريف بالمهمّ من التصريف ، للشيخ محمد حماد بن أحمد الشنقيطي » الشارح : الدكتور محمد بن عبد الله بن حمود المقشي عدد الصفحات : 75 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 13 رمضان 1442\nالكتاب : فتح الكريم اللطيف في شرح « باكورة التعريف بالمهمّ من التصريف ، للشيخ محمد حماد بن أحمد الشنقيطي » الشارح : الدكتور محمد بن عبد الله بن حمود المقشي عدد الصفحات : 75 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 13 رمضان 1442\nالشارح : الدكتور محمد بن عبد الله بن حمود المقشي عدد الصفحات : 75 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 13 رمضان 1442\nعدد الصفحات : 75 [ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 13 رمضان 1442\n[ الكتاب غير مطبوع ] تاريخ النشر بالشاملة : 13 رمضان 1442\nتاريخ النشر بالشاملة : 13 رمضان 1442",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 3
  },
  {
    "serial_number": "6662872",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "فتح الكريم اللطيف في شرح باكورة التعريف بالمهمّ من التصريف للشيخ/ محمد حماد بن أحمد الشنقيطي شرح الدكتور/محمد بن عبد الله بن حمود المقشي",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 4
  },
  {
    "serial_number": "6662873",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "تقديم الشيخ العلامة إبراهيم محمد عبد الله الشنقيطي بسم الله الرحمن الرحيم، الحمد لله رب العالمين، والصلاة والسلام على خاتم الأنبياء والمرسلين، محمد النبي الأمي، وعلى آله وصحبه، وتابعيهم بإحسان إلى يوم الدين. وبعد: فإن كتاب فتح الكريم اللطيف في شرح باكورة التعريف بالمهم من التصريف لمؤلِّفه النابغة الفهامة الشيخ محمد بن عبد الله بن حمود المقشي، كتاب نافع، تبصرة للمبتدي، وتذكرة للمنتهي، يلمس فيه قارئه الدقة في المضمون، والوضوح في الأسلوب، نرجو من الله العلي الكريم أن ينفع به، وأن يكتب ثوابه لمؤلفه وقارئه. كتبه إبراهيم محمد عبد الله الشنقيطي",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 5
  },
  {
    "serial_number": "6662874",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "تقديم الشيخ الدكتور عبد الواحد الخميسي الحمد لله رب العالمين، والصلاة والسلام على أشرف الأنبياء والمرسلين، سيدنا محمد وعلى آله وصحبه أجمعين. أما بعد: فقد اطلعت على الشرح المسمى بفتح الكريم اللطيف في شرح باكورة التعريف بالمهم من التصريف لصاحبه الدكتور محمد بن عبد الله المقشي، فوجدته شرحاً لطيفاً، ورائعاً في بابه، ويتناسب مع مريدي الابتداء في تعلُّم علم الصرف، فهو يعطيهم تصوراً واضحاً عن بعض مواضيع علم الصرف، وهي التي يحتاج إليها طالب العلم ابتداءً، فأسأل الله أن ينفع به، ويجزي المؤلف خير الجزاء، إنه ولي ذلك ومولاه. والحمد لله رب العالمين. وكتبه د/ عبد الواحد عبد الله علي الخميسي رئيس قسم اللغة العربية بجامعة الإيمان 26 جمادى الآخرة 1434 هـ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 6
  },
  {
    "serial_number": "6662875",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "تقديم الشيخ العلامة وليد أحمد محمود بسم الله الرحمن الرحيم الحمد لله رب العالمين، والصلاة والسلام على نبيه الكريم وبعد: فقد اطلعتُ على ما كتبه فضيلة الشيخ الدكتور/ محمد بن عبد الله المقشي في شرحه على منظومة \"باكورة التعريف بالمهم من التصريف\"، والذي أسماه \"فتح الكريم اللطيف في شرح باكورة التعريف\"، فألفيته شرحاً جليلاً يفك ألفاظها، ويوضح معانيها، من غير تطويل ولا حشو ولا إخلال، وهو شرح ينتفع به العالم، ولا يستغني عنه طالب العلم، فأسأل الله تعالى أن ينفع به، وأن ينفع بمؤلفه. كتبه/ وليد بن أحمد محمود أستاذ الأصول واللغة بجامعة الإيمان",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 7
  },
  {
    "serial_number": "6662876",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "نظم باكورة التعريف بالمهم من التصريف بسم الله الرحمن الرحيم  مقدمة الحمد لله رب العالمين، والصلاة والسلام على سيدنا محمد وعلى إخوانه من الأنبياء والمرسلين، وعلى آله وأصحابه والتابعين. أما بعد: فهذا شرح لطيف على منظومة الشيخ محمد حمّاد بن أحمد بن سيد الجكني الشنقيطي في علم الصرف المسماة \"باكورة التعريف بالمهم من التصريف\"، اقتصرت فيه على حلّ ألفاظها، وبيان مرادها، على وجه لطيف خال عن الحشو والتطويل، سميته بـ\"فتح الكريم اللطيف في شرح باكورة التعريف بالمهم من التصريف\". والله أسأل أن ينفع به، وهو حسبي ونعم الوكيل.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 8
  },
  {
    "serial_number": "6662877",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "أحمَدُ ربِّي مَن لِكَونٍ صرَّفا … ........................................  الشرح قال الناظم تبركاً باسم الله العظيم، واقتداء بكتابه الكريم (بسم الله الرحمن الرحيم) أي: أنظم؛ إذ كل فاعل يبدأ في فعله ببسم الله يُضْمِرُ ما جعل التسمية مبدأً له كما أن المسافر إذا حل أو ارتحل فقال: بسم الله كان المعنى بسم الله أحل، وبسم الله أرتحل، و (الله) عَلَمٌ للذات الواجب الوجود، و (الرحمن الرحيم) اسمان بُنيا للمبالغة من رَحِم، والرحمن ابلغ من الرحيم؛ لأن زيادة البناء تدل على زيادة المعنى (أحمدُ ربي) الحمد لغة: الثناء باللسان على الجميل الاختياري على جهة التعظيم، والربُّ من أسماء الله تعالى (مَنْ لِكَونٍ صرَّفا) أي: الذي صرَّف هذا الكون، فهو المتصرِّف فيه بالخلق والإعدام. وفي قول الناظم: (مَنْ لِكَونٍ صرَّفا) ما يُسمَّى ببراعة الاستهلال، ومعناها عند أهل البلاغة أن يذكر المتكلِّمُ في أول كلامه ما يُشْعِرُ بمقصوده، وهنا قدمَّ الناظم هذه العبارة في أول منظومته ليشير بها إشارة لطيفة إلى ما سيتكلم عنه فيها وهو علم الصرف.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 9
  },
  {
    "serial_number": "6662878",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "................. … صلّى وسلّم على اللَّذْ شرَّفَا  الشرح (صلّى) المشهور أن الصلاة من الله تعالى بمعنى الرحمة، ومن الملائكة الاستغفار، ومن الآدمي تضرع ودعاء، واختار الحافظ ابن حجر في فتح الباري أن معنى صلاة الله على نبيه ثناؤه عليه وتعظيمه، وصلاة الملائكة وغيرهم عليه طلب ذلك له من الله تعالى. (وسلّم) من التسليم بمعنى السلام، قال بعضهم: وإثبات الصلاة والسلام بعد البسملة في صدر الكتب والرسائل حَدَث في زمن ولاية بني هاشم، ثم مضى العمل على استحبابه، ومن العلماء من يختم بهما الكتب أيضاً (1) . (على اللَّذْ شرَّفَا) أي: على الذي رفع قدره ومنزلته، والشرف: العلو والرفعة، و (اللَّذْ) لغة في الذي.",
    "foot_note": "1. تحفة الحبيب على شرح الخطيب (1/ 50).",
    "book_id": "238",
    "new_page_number": 10
  },
  {
    "serial_number": "6662879",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "محمدٍ وآلهِ وبعدُ … .......................................  الشرح (محمدٍ) بدل من (اللَّذْ شرفا)، ومحمدٌ عَلَمٌ على نبينا صلى الله عليه وسلم، سماه به جده عبد المطلب إلهاماً من الله تعالى بأنه يكثر حمد الخلق له لكثرة خصاله الحميدة كما رُوي في السِّيَر. (وآله) هم على الأصح مؤمنو بني هاشم وبني المطلب. (وبعدُ) أي: وبعد ما تقدم من الحمد والصلاة والسلام، وهذه الكلمة سواء كانت بعد \"أما\" أم لا، يؤتى بها للانتقال من أسلوب إلى آخر، ولا يجوز الإتيان بها في أول الكلام، ويستحب الإتيان بها في الخطب والمكاتبات اقتداء برسول الله صلى الله عليه وسلم، وقد عقد البخاري لها باباً في صحيحه، وقد اختُلِف في أول من قالها على ثمانية أقوال جمعها بعضهم في بيتين: جرى الخلف \"أما بعدُ\" من كان بادئاً … بها عُدّ أقوالاً وداودُ أقربُ ويعقوبُ أيوبُ الصبورُ وآدمٌ … وقسٌّ وسحبانٌ وكعبٌ ويعربُ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 11
  },
  {
    "serial_number": "6662880",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "....................... … فهاكَ من تصريفِ فِعْلٍ عِقْدُ فإنهُ فنٌّ جليلُ القدرِ … وجَهْلُهُ بالمرء حقاً مُزر  الشرح (فهاكَ) هاك: اسم فعل أمر بمعنى خُذ (مِن تصْريفِ فِعْلٍ عِقْدُ) شبَّهَ نظمه بالعِقد المنظوم من الجوهر والخرز ونحوهما الذي يُعَلَّق بالرقبة، وخصّ التصريف بالفعل في قوله (مِن تصْريفِ فِعْلٍ) لكونه لم يتكلم في هذه المنظومة إلا عن تصريف الفعل خاصة، والأصالة في التصريف إنما هي للأفعال؛ لكثرة تغييرها، وإنما دخل الأسماءَ حمْلاً لها على الأفعال. (فإنهُ) أي: علم الصرف (فنٌ جليلُ القدرِ) أي: عظيم المنزلة، فهو من أجل العلوم العربية وأعظمها خطراً؛ لأنه يجري في الصميم من الألفاظ العربية، ويجري منها مجرى المعيار والميزان. (وجَهْلُهُ بالمرء حقاً مُزرِ) أي: أن جهْل طالب العلم بعلم الصرف يُلْحِقُ به العيب، ويَنْقُصُ من مرتبته.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 12
  },
  {
    "serial_number": "6662881",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "ذَكرتُ منهُ ما تَمَسُّ الحاجةُ … إليهِ والربُّ بهِ الإِعانَةُ سمَّيتُهُ باكُورَةَ التعريفِ … بِما يهُمُّنَا مِن التَصْرِيف  الشرح (ذَكرتُ منهُ ما تَمَسُّ الحاجةُ إِليهِ) أي: أنه ذَكَر مما يتعلق بتصريف الأفعال ما لا بدّ منه (والربُّ بهِ الإِعانَةُ) أي: أن الإعانة تُطلب من الله سبحانه لا من غيره، فتقديم المعمول في قوله: (والربُّ بهِ) يفيد الحصر. (سمَّيتُهُ باكُورَةَ التعريفِ) أي: أنه سمَّى نظمه هذا (باكورة التعريف) وباكورة الشيء أوَّلُه، فهي أول التعريف بعلم الصرف؛ لأنه ذكر فيها أهم القواعد التي لابد منها لطالب هذا الفن. (بِما يهُمُّنَا مِن التَصْرِيفِ) أي: بالأهم من علم التصريف؛ لأن العلم كثير والعمر قصير فيُقدِّم طالب العلم الأهم فالأهم، ولذا قال ابن الوردي: والعُمْرُ عن تحصيلِ كُلِّ علمِ … يقصرُ فابدأْ منهُ بالأهمّ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 13
  },
  {
    "serial_number": "6662882",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "..................................  الشرح والمبنى والوزن والصيغة والهيئة ألفاظ مترادفة، يقال: بنية الكلمة - أي: وزنها- والمراد بالبناء هيئة الكلمة التي يُمكن أن يُشاركها فيها غيرها، وهذه الهيئة عبارة عن عدد حروف الكلمة، وترتيبها، وحركاتها وسكناتها، مع اعتبار الحروف الزائدة والأصلية، فـ\"رَجُل\" - مثلاً - على هيئةٍ وصفةٍ يمكن أن يشاركه فيها كلمة \"عَضُد\" ونحوها مما كان على ثلاثة أحرف أولها مفتوح والثاني منها مضموم. فعلم الصرف إنما يُبحثُ فيه عن أحوال أبنية الكلمة التي ليست بإعراب ولا بناء، وعلم النحو يُبحث فيه عن أواخر الكلِم من إعراب وبناء. وموضوعه: الكلمات العربية من حيث البحث عن صحتها واعتلالها، وأصالتها وزيادتها ونحو ذلك، ويختص بالأسماء المتمكنة - المعربة - والأفعال المتصرفة، فالحرف بجميع أنواعه، والأسماء المبنية، والأفعال الجامدة لا يجري البحث عنها في علم الصرف.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 14
  },
  {
    "serial_number": "6662883",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "................................  الشرح والتصريف لغةً: مطلق التغيير، ومنه تصريف الرياح، أي تغييرها، وتقلّبها. واصطلاحاً: عِلْمٌ يُبحَثُ فيه عن أحوال أبنية الكلمة العربية، وما لحروفها من أصالة وزيادة، وصحة وإعلال ونحو ذلك. والأبنية جمع بناء، والبناء والبِنية والبُنية وواضعه: معاذ بن مسلم الهرَّاء (1) . وثمرته: صون اللسان عن الخطأ في المفردات العربية، وتأديته إلى فهم اللغة الموصلة إلى فهم كتاب الله تعالى، وبمعرفته تُضبط الصِّيَغ وتصغيرها والنسبة إليها. واستمداده: من الكتاب، والسنة، وكلام العرب. وحكمه: الوجوب الكفائي. ومسائله: قضاياه التي تُذكر فيه كقولنا: ضَرَبَ فِعْلٌ مجرّد، وأكْرَمَ فِعْلٌ مزيد، وفَعُلَ بضمِّ العين مضارعه يَفْعُل، إلى غير ذلك.",
    "foot_note": "1. نسبةً إلى بيع الثياب الهروية. ..............................   الشرح",
    "book_id": "238",
    "new_page_number": 15
  },
  {
    "serial_number": "6662884",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "باب أبنية المجرَّد  الشرح (بابُ أَبْنيةِ المجرَّدِ) الأبنية كما تقدم جمع بناء، والمراد بأبنية المجرد الصِّيَغ التي يأتي على وزنها الفعل المجرد. وقبل أن نذكر هذه الأوزان للمجرَّد نبيِّن أن الفعل ينقسم إلى مجرد ومزيد: فالمجرد عن الزيادة هو: الفعل الذي جميع حروفه أصلية. والحرف الأصلي هو: الحرف الذي يلزم الكلمة في جميع تصاريفها. والفعل المزيد هو: الذي فيه حرف زائد أو أكثر. والحرف الزائد هو: الحرف الذي يسقط في بعض تصاريف الكلمة مثل الألف من \"قاتَلَ، ضارَبَ\" والتاء والألف في \"تقاتَلَ، تغافَلَ\" والهمزة والسين والتاء في \"استغفر، استقام\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 16
  },
  {
    "serial_number": "6662885",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "وَزْنُ المُجَرَّدِ لدَيْهِمْ فَعَلا … فَعِلَ مَعْ فَعُلَ ثُمَّ فَعْلَلا  الشرح والزيادة إما أن تكون تكريراً لأصلٍ أو لا، فإن كانت تكريراً لأصلٍ فلا تختص بأحرف الزيادة، وإن لم تكن تكريراً لأصلٍ فلا تكون إلا من أحد الأحرف العشرة التي يجمعها قولك: \"سألتمونيها\"، وتسمى هذه الأحرف بأحرف الزيادة، ومعنى تسميتها بأحرف الزيادة أنه لا يزاد لغير التكرير إلا منها، وليس المعنى أن هذه الأحرف لا تقع في الكلام إلا زائدة؛ فإنها قد تقع أصلية نحو \"مات، سأل\". قال: (وَزْنُ المُجَرَّدِ … إلخ البيت) ذكر الناظم في هذا البيت أوزان الفعل المجرد، وهي أربعة أوزان، ثلاثة منها للماضي الثلاثي، وواحد للماضي الرباعي. أما أوزان الثلاثي فهي: 1 - \"فَعَلَ\" بفتح العين مثل: ضَرَبَ، نَصَرَ، دَخَلَ، خَرَجَ، أَكَلَ. 2 - \"فَعِلَ\" بكسر العين مثل: مَرِضَ، فَرِحَ، عَجِلَ، غَلِطَ، فَشِلَ. 3 - \"فَعُلَ\" بضم العين مثل: عَظُمَ، كَرُمَ، كَبُرَ، صَغُرَ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 17
  },
  {
    "serial_number": "6662886",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "كَتَبَ مَعْ عَلِمَ ثُمَّ ظَرُفَا … دَحْرَجَ ...........................  الشرح أما وزن الرباعي فهو: \"فَعْلَلَ\" بسكون العين وفتح ما عداها، مثل: بَعْثَرَ، حَشْرَجَ، هَذْرَمَ، بَرْطَمَ (1) ، عربَدَ (2) . ثم شرع الناظم في البيت التالي في التمثيل للأوزان الأربعة المتقدمة فقال: (كَتَبَ مَعْ عَلِمَ ثُمَّ ظَرُفَا دَحْرَجَ). فقوله: \"كتَبَ\" مثال للوزن الأول \"فَعَلَ\" بفتح العين. وقوله: \"عَلِمَ\" مثال للوزن الثاني \"فَعِلَ\" بكسر العين. وقوله: \"ظَرُفَ\" مثال للوزن الثالث \"فَعُلَ\" بضم العين. وقوله: \"دَحْرَجَ\" مثال لوزن الرباعي \"فَعْلَلَ\".",
    "foot_note": "1. أي: عبس وجهه، وانتفخ غضباً. \n2. أي: ساء خلقه.",
    "book_id": "238",
    "new_page_number": 18
  },
  {
    "serial_number": "6662887",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "........................... … ......... تمثيلٌ بِلَفٍّ قد وفا  الشرح ثم قال: (تمثيلٌ بِلَفٍّ قد وفا) اللف والنشر من المحسنات المعنوية وهو: ذِكْرُ متعدِّد على التفصيل أو الإجمال، ثم ذكر ما لكل من غير تعيين (1) اعتماداً على أن السامع الفطِن يردُّ إلى كلٍ منهما ما هو له، فإذا أتى المتكلم بمتعدّدٍ، وبعده جاء بمتعدّد آخر يتعلّق كلّ فرد من أفراده بفرد من أفراد السابق بالتفصيل ودون تعيين سُمِّيَ صَنيعُه هذا \"لفَّاً ونشراً\"، فإن كان على الترتيب بأن كان الأول للأول والثاني للثاني وهكذا فاللف والنشر على الترتيب، وإلا فعلى غير الترتيب. وهنا حصل اللف على الترتيب فالناظم مثّلَ للأوزان الأربعة المذكورة في البيت السابق على حسب ترتيبها في الذِّكْر، فبدأ بالتمثيل لفَعَلَ بـ\"كتَبَ\"، ثم مثَّل لِفَعِلَ بـ\"عَلِمَ\"، ثم مثَّلَ لِفَعُلَ بـ\"ظَرُفَ\"، ثم مثّلَ لِفَعْلَلَ بـ\"دحْرَجَ\". وقوله: (قد وفا) يقال: وَفَى الشيء يَفِي أي: تمَّ.",
    "foot_note": "1. فإن عيّن سُمي ذلك تقسيماً لا لفاً ونشراً.",
    "book_id": "238",
    "new_page_number": 19
  },
  {
    "serial_number": "6662888",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "فصلٌ في تصريفِ المضارعِ فَعُلَ بالضَمِّ اللُّزُومَ تَلْزَمُ … ......................................  الشرح فصلٌ في تصريفِ المضارعِ لمّا انتهى الناظم من الكلام على أوزان الفعل المجرد شرع في الكلام على مضارِع كل وزن من الأوزان الأربعة المتقدِّمة فقال: (فَعُلَ بالضَمِّ اللُّزُومَ تَلْزَمُ) أي: أن \"فَعُلَ\" بضم العين تُلازِم اللزوم، فلا يأتي فعلُها إلا لازماً. والفعل اللَاّزم هو: الذي يلزم فاعله، أي: يكتفي به فليس له مفعول نحو: قام زيد، قعد عمرو، خرج بكرٌ، أو له مفعول ولكن لا يتعدَّى إليه إلا بواسطة حرف الجر نحو: مررت بزيدٍ. والفعل المتعدِّي هو: الذي يصل إلى المفعول به بغير حرف جر نحو: ضربتُ زيداً، أكرمتُ عمراً.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 20
  },
  {
    "serial_number": "6662889",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "..................... … وَضَمُّ ما ضَارعَ مِنها يُعْلَمُ وافْتَحْ لَهُ مِنْ ذاتِ كَسْرِ الماضِيْ … ......................................  الشرح وعلامته: أن تتصل به هاء ضمير لا ترجع إلى المصدر، نحو: \"البابُ أغلقتُهُ\". فالضمير - الهاء - مفعول به يرجع إلى الباب وهو غير مصدر. فـ\"فَعُلَ\" بضم العين لا يكون إلا لازماً، نحو: \" كَرُمَ، شَجُعَ، حَسُنَ، قَبُحَ، قَصُرَ، فَظُعَ\". قال: (وَضَمُّ ما ضَارعَ مِنها يُعْلَمُ) أي: أن كل فِعْلٍ على وزن \"فَعُل\" يأتي المضارع منه دائماً على وزن\"يَفْعُل\" بضم العين، نحو: \" كَرُمَ يكْرُم، حَسُنَ يحْسُن، قَبُحَ يقْبُح، قَصُرَ يقْصُر، عَظُمَ يعْظُم، شرُفَ يشرُفُ\" وهكذا. قال: (وافْتَحْ لَهُ) أي: للمضارع (مِنْ ذاتِ كَسْرِ الماضِيْ) أي: من \"فَعِلَ\" بكسر العين، فكلُّ فِعْلٍ على وزن \"فَعِلَ\" بكسر العين فإن المضارع منه يأتي على وزن \"يَفْعَل\" بفتح العين، نحو: \"فرِحَ يفْرَح، حزِن يَحْزَن، عطِش يعطَش، شَرِب يشرَب، شبِع يشبَع، علِم يعلَم، رضِي يرضَى، سكِر يسكَر، غضِب يغضَب\" وهكذا.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 21
  },
  {
    "serial_number": "6662890",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "......................... … تَغْلِبُ في الألوانِ والأعراضِ واكْسِرْهُ فِي \"وَرِثْ\"\"وَرِمْ\"\"وَلِي\" \"وَثِقْ\" … \"وَرِيَ مُخٌّ\" و\"وَرِعْ\" \"وَفِقْ\" \"وَمِقْ\"  الشرح وقوله: (تَغْلِبُ في الألوانِ والأعراضِ) أي: أن صيغة \"فَعِل\" بكسر العين الغالب عليها أنها تأتي دالّةً على الألوان والأعراض. والأعراض: هي الصفات التي لا تلازم الذات، بل تأتي وتزول كالمرض، والفرح. مثال ما دلّ على الألوان: حَمِرَ، سَوِدَ، خَضِرَ، صَفِرَ. ومثال ما دل على الأعراض: فَرِحَ، حَزِنَ، مَرِضَ، بَرِصَ، جَرِبَ، نَشِطَ، شَبِعَ، عَطِشَ، تَعِبَ. قال: (واكْسِرْهُ فِي \"وَرِثْ\" \"وَرِمْ\" … إلخ البيت) تقدم في البيت السابق أن المضارع من \"فَعِلَ\" بكسر العين الأصل فيه أن يأتي مفتوحاً كـ\"يَفْرَح\"، وهناك أفعال على وزن \"فعِلَ\" بكسر العين لم يُسمع في مضارعها إلا الكسر الشاذ، وعددها ثلاثة عشر، ذكر الناظم منها ثمانية أفعال، وهي: \"وَرِثَ يَرِثُ، وَرِمَ الجرحُ يَرِمُ، وَلِيَ يلِي، وَثِقَ يثِقُ، وَرِيَ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 22
  },
  {
    "serial_number": "6662891",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "وجْهانِ منْهُ في \"حَسِبْ\" \"نَعِمْ\" \"بَئِسْ\" … \"وَغِرْ\" \"وَحِرْ\" \"وَلِهْ\" \"وَهِلْ\" \"يَبِسْ\" \"يَئِسْ\"  الشرح المخُّ يَرِي، وَرِعَ الرجلُ يرِعُ، وَفِقَ الفرسُ يفِقُ، وَمِقَ يمِقُ\"، فهذه الأفعال الثمانية لم ترد في اللغة العربية إلا بكسر المضارع، مع أن القياس في مضارعها الفتح. ومعنى وَرِمَ أي: انتفخ، ووَرِيَ المخّ أي: كَثُر، ووَرِعَ أي: ترك الشبهات خشية الوقوع في الحرام، ووَفِقَ الفرس أي: حَسُنَ، ووفِقتَ أمرك أي: وجدتَه موافقاً، ووَمِقَ أي: أَحَبَّ. قال: (وجْهانِ منْهُ في \"حَسِبْ\" \"نَعِمْ\" … إلخ البيت) بعد أن ذكر الناظم ما سُمِع فيه الكسر فقط من مضارع \"فَعِلَ\"، شرع في الكلام على الأفعال التي سُمِعَ فيها الوجهان الفتح المقيس، والكسر الشاذ وهي اثنا عشر فعلاً ذكر منها الناظم في هذا البيت تسعة وهي: حسِب يحسَب ويحسِب، نَعِمَ ينعَم وينعِم، بَئِس يبأَس ويبئِس، وَغِرَ يَوغَرُ ويغِرُ، وَحِرَ يَوحَرُ ويحِرُ، وَلِهَ يولَه ويلِه، وَهِلَ يوهَل ويهِلُ، يبِسَ ييبَس وييبِس، يَئِس ييأَس وييئِس\". ومعنى حسِبَ أي: ظَنَّ، ونَعِمَ الرجلُ أي: حسنت حاله، وبئِس إذا ساءت حاله، ووَغِرَ صدرهُ أي: توقَّد غيظاً، ووحِرَ أي: امتلأ حقداً، وَوَلِهَ فهو وَالِهٌ ووَلْهَانُ إذا كاد أن يذهب عقله لفقد محبوب من أهل ومال، وَوَهِلَ عن الشيء نَسِيَهُ، ويَبِسَ الشجر ذهبت نداوته - رطوبته-، ويَئِسَ إذا انقطع رجاؤه. ولما انتهى من الكلام على مضارع \"فَعُلَ\"بضم العين، و\"فَعِلَ\" بكسر العين، انتقل إلى الكلام على مضارع \"فَعَلَ\" بفتح العين",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 23
  },
  {
    "serial_number": "6662892",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "يُكْسَرُ آتِي فَعَلَ المفتوحِ في … وَاوِيِّ فا أو لازِمٍ مُضَعَّفِ أوْ يائِياً (1) في عينِهِ أو لامِهْ … ........................................  الشرح فقال: (يُكْسَرُ آتِي فَعَلَ) أي: مضارعها؛ لأن المضارع يطلق عليه \"الآتِي\" (المفتوحِ) أي: مفتوح العين (في وَاوِيِّ فا أو لازِمٍ مُضَعَّفِ أوْ يائِياً في عينِهِ أوْ لامِهْ) أي: أن \"فَعَلَ\" بفتح العين يُكسر عين مضارعها فيقال: \"يَفْعِل\" إذا وُجِد جالب (2) من جوالب الكسر الأربعة المذكورة في النظم وهي: 1 - أن تكون فاءُ \"فَعَلَ\" واواً (3) ، وإلى ذلك أشار الناظم بقوله: (في وَاوِيِّ فا)، ومن أمثلته: \"وعَدَ يعِدُ، وَجَدَ يجِدُ، وصَفَ يصِفُ، وصَلَ يصِلُ، وعَظَ يعِظُ\" (4) ، ويشترطون أن لا تكون لامُه ُحرفاً من حروف الحلق (5) ، فإن كانت كذلك فُتِحَت عينُ مضارعه نحو: \"وقَع يقَعُ، وَدَعَ يَدَعُ، وَضَعَ يَضَعُ\".",
    "foot_note": "1. هكذا ورد في النظم \"أو يائِياً\" والصواب أن يقول \"أو يائيٍ\" لأنه معطوف على مجرور، ولكن لما ذكره الناظم وجه وهو أن يكون قوله:\"يائياً\" خبراً لـ\"كان\" المحذوفها واسمها فيكون التقدير: \"أو كان الفعل يائياً\"، ولكن كان الأولى ما ذكرنا لأن ما ليس فيه تقدير أولى مما فيه تقدير. \n2. الجوالب: جمع جالب، والجالب عند الصرفيين هو الداعي، فيقال: جالِبُ الكسر أي: الداعي إلى الكسر. \n3. اختار علماء الصرف معياراً وميزاناً صرفياً يقابلون به أصول الكلمات التي تعرض لهم، فألَّفوا الميزان من ثلاثة أحرف؛ لأن أكثر كلمات اللغة العربية ثلاثي، وجعلوا هذه الحروف الثلاثة هي: \"فعل\" وهي الفاء والعين واللام، وسموا الحرف الأول المقابل للفاء: فاء الكلمة، والحرف الثاني المقابل للعين: عين الكلمة، والحرف الثالث: لام الكلمة، فكاف \"كَتَبَ\" - مثلاً - هو فاء الكلمة، والتاء عين الكلمة، والباء لام الكلمة، وهكذا، ويلتزمون شكل الميزان بنفس حركات الموزون وسكناته فيقولون: \"كَتَبَ\" على وزن \"فَعَلَ\"، و\"فَهِمَ\" على وزن \"فعِلَ\"، و\"كَرُمَ\" على وزن \"فَعُلَ\" وهلمّ جراً. \n4. إنما حُذفت الواو في جميع هذه الأفعال لوقوعها بين الياء المفتوحة والكسرة، والأصل \"يَوعِد \n…. إلخ\"، والقاعدة أن الواو إذا وقعت بينهما فإنها تحذف، قال ابن مالك: فا أمرٍ أو مضارعٍ من كـ\"وعد\" احذف وفي كعدة ٍ ذاك اطّرد. \n5. حروف الحلق ستة وهي: الهمزة والهاء والعين والحاء والغين والخاء.",
    "book_id": "238",
    "new_page_number": 24
  },
  {
    "serial_number": "6662893",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  الشرح 2 - أن تكون \"فَعَلَ\" مضعّفة (1) لازمة، وإلى ذلك أشار الناظم بقوله: (أو لازِمٍ مُضَعَّفِ) ومن أمثلته: \"دبَّ يدِبُّ، فرّ يفِرُّ، خفَّ يخِفُّ، ضلَّ يضِلّ، حَنَّ يحِنُّ، قَلَّ الشيءُ يقِلُّ، طنَّ يطِنُّ، أَنَّ يئِنُّ، رَنَّ يرِنُّ\". 3 - أن تكون \"فَعَلَ\" يائية العين، نحو: \"جاء يجِيءُ، قاءَ يقِيءُ، غاب يغِيب، قال يقِيلُ قيلولةً، خاب يخِيب، زاد يزِيدُ، عاشَ يعِيشُ، مالَ يمِيلُ\". 4 - أن تكون \"فَعَلَ\" يائية اللام، نحو: \" أتى يأتِي، بكى يبكِي، بنى يبنِي، رمى يرمِي، زنى يزنِي، هذى يهذِي، عصى يعصِي، جرى يجرِي\"، إلا أنه يُشترط أن لا تكون عينه حرفاً من حروف الحلق، فإن كانت من حروف الحلق فُتِحت عين المضارع، نحو: \"رأى يرَى، رعى يرعَى، سعى يسعَى، نهى ينهَى\". وإلى الجالب الثالث والرابع من جوالب الكسر أشار الناظم بقوله: (أوْ يائِياً في عينِهِ أوْ لامِهْ).",
    "foot_note": "1. المراد بالمضعَّف هنا مضعَّف الثلاثي: وهو ما كانت عينه ولامه من جنس واحد مثل: \"شدَّ، مدَّ، حنَّ\"، فأصلها: \"شدَدَ، مدَدَ، حنَنَ\".",
    "book_id": "238",
    "new_page_number": 25
  },
  {
    "serial_number": "6662894",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "....................... … وَاوِيْهِما لا ريب في انْضِمامِهْ كذاكَ ما جاءَ لِبَذِّ الفَخْرِ، أو … مُضَعَّفٌ إنْ يَتَعَدَّى .................  الشرح ثم لما انتهى من جوالب كسر مضارع \"فَعَلَ\" بفتح العين، شرع في الكلام على جوالب ضمّ المضارع وهي أربعة أيضاً فقال: (وَاوِيْهِما لا ريب في انْضِمامِهْ، كذاكَ ما جاءَ لِبَذِّ الفَخْرِ، أوْ مُضَعَّفٌ إنْ يَتَعَدَّى) أي: أنَّ فَعَلَ بفتح العين يُضَمّ عين مضارعها فيقال: \"يفْعُل\" إذا وُجد فيها جالبٌ - داعٍ- من جوالب الضم الأربعة المذكورة في النظم، وهي: 1 - أن تكون عينُ \"فَعَلَ\" واواً، نحو: \" قال يقولُ، ذاب يذُوبُ، فات يفُوتُ، ناءَ ينُوء، جاد يجُودُ، فاز يفُوزُ، خاضَ يخُوضُ، جاعَ يجُوعُ، طافَ يطوفُ\" (1) . 2 - أن تكون لامُ \"فَعَلَ\" واواً، نحو: \"دعا يدعو، بدا يبدُو، زكا يزكو، رشاه يرشُوه، صبا يصبو، عفا يعفو، عدا يعدو، غزا يغزو، فشا يفشو، هجا يهجو، هفا يهفو\" (2) . وإلى هذا الجالب والذي قبله أشار الناظم بقوله: (وَاوِيْهِما لا ريب في انْضِمامِهْ) أي: أن \"فَعَلَ\" بفتح العين إذا كانت واويّة العين أو اللام لا ريب - أي: لا شك - في ضم عين مضارعها.",
    "foot_note": "1. جميع الأمثلة التي ذُكِرت كـ\"قال، ذاب، جاد\" الألف فيها منقلبة عن واو. \n2. جميع الأمثلة التي ذُكِرت كـ\"دعا، بدا، زكا، صبا، فشا، هجا\" الألف فيها منقلبة عن واو.",
    "book_id": "238",
    "new_page_number": 26
  },
  {
    "serial_number": "6662895",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "..................  الشرح 3 - أن تكون \"فَعَلَ\" دالة على الغلبة في الفخر، نحو: صارعني فصرعتُهُ فأنا أصرُعُهُ، تضاربنا فضربتُهُ فأنا أضرُبُهُ، تناصرنا فنصرتُهُ فأنا أنصُرُهُ\"، فكلّ فِعْلٍ قُصِد به الدلالة على أن اثنين تفاخرا في أمر فغلب أحدهما الآخر فيه فإن المضارع منه مضموم العين، وهذا هو المراد بقول الناظم: (كذاكَ ما جاءَ لِبَذِّ الفَخْرِ). وقوله: (لِبَذِّ الفَخْرِ) أي: للغلبة في المفاخرة، وليس (البذُّ) لغةً في \"البَذل\" كما يُتوهم. 4 - أن تكون \"فَعَلَ\" بفتح العين مضعَّفة متعدية، نحو: \"سبَّ يسُبُّ، مدَّ يمُدُّ، صبَّ يصُبُّ، فتّ يفُتُّ، حجَّ البيت يحُجُّه، ردَّ يرُدُّ، حثَّ يحُثُّ، بثَّ الخبر يبُثُّه، ضرَّهُ يضُرُّه، رشَّ يرُشُّ، دكّ يدّكُّ، زفّ العروس يزُفُّها\"، وإلى هذا الجالب أشار الناظم بقوله: (أوْ مُضَعَّفٌ إنْ يَتَعَدَّى) أي: أنَّ من جوالب ضم مضارع \"فَعَلَ\" بفتح العين أن يأتي مضعَّفاً متعدياً.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 27
  },
  {
    "serial_number": "6662896",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "5 - .......................... … ............................. وَرَوَوْا سماعاً الكسرَ، وفي حَبَّ انفَرَدْ … .......................................  الشرح قال: (وَرَوَوا سماعاً الكسرَ، وفي حَبَّ انفَرَدْ) تقدم أنَّ القياس في \"فَعَلَ\" بفتح العين المضعفة المتعدية أن يأتي مضارعها مضموم العين، إلا أنه شذّ من ذلك أفعال، والشاذ على قسمين: 1 - ما سُمِعَ فيه الضم المقيس، والكسر الشاذ، وهي تسعة أفعال، منها: \"شدَّهُ يشُدّه ويشِدّه، نمَّ الحديث ينُمُّهُ وينِمُّه، شجَّهُ يشُجُّه ويشِجّه، بتَّهُ يبُتُّهُ ويبِتُّه\"، وهذا هو المراد بقول الناظم: (وَرَوَوا) أي: في مضارع فَعَلَ المضعفة المتعدية (سماعاً الكسرَ) أي: مع الضم، وذلك في الأفعال التسعة. 2 - ما لم يُسمع فيه إلا الكسر الشاذ لا غير، وذلك في فعْلٍ واحد، وهو: \" حَبَّ\" فمضارعه يحِبُّ بكسر الحاء (1) ، وهذا هو المراد بقول الناظم: (وفي حَبَّ انفَرَدْ) أي: انفرد الكسر، ولم يُسمَع فيه الضمُّ على القياس.",
    "foot_note": "1. أما \"يُحِبُّ\" بضم حرف المضارعة - الياء - فهو مضارِعُ \"أحَبَّ\" الرباعي، وليس مضارع \"حَبَّ\" الثلاثي.",
    "book_id": "238",
    "new_page_number": 28
  },
  {
    "serial_number": "6662897",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "............................ … وَضَمُّ لازمٍ سماعاً قدْ وَرَدْ  الشرح قال: (وَضَمُّ لازمٍ سماعاً قدْ وَرَدْ) تقدَّم أن القياس كسر العين من مضارع فَعَلَ - بفتح العين- إذا كانت لازمة كـ\"فَرَّ يَفِرُّ\"، إلا أنه شذَّ من ذلك أفعال سُمِع فيها ضم مضارعها، وهذا الشاذ على قسمين: 1 - ما سُمِعَ فيه الكسر المقيس، والضمّ الشاذ، وهي أفعال كثيرة، منها: \"صدَّ يصِدُّ ويصُدُّ (1) ، خرَّ الحجرُ يخِرُّ ويخُرُّ، حَدَّتِ المرأة تحِدُّ وتحُدُّ، شذّ يشِذُّ ويشُذُّ، شحَّ يشِحُّ ويشُحُّ\". 2 - ما سُمِعَ فيه الضم الشاذ فقط، وهي أفعال كثيرة أيضاً منها: \"هبّتِ الريحُ تهُبُّ، همَّ بالأمر يَهُمُّ، مرَّ يمُرُّ، شكَّ -أي: ظنّ - يشُكُّ، جنَّ الظلام يجُنُّ، رشَّ يرُشُّ، طشَّ يطُشُّ، ثجَّ يثُجُّ\".",
    "foot_note": "1. وبالوجهين قرئ قوله تعالى: {وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلاً إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ} الزخرف: 57.",
    "book_id": "238",
    "new_page_number": 29
  },
  {
    "serial_number": "6662898",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "والفتحُ في حَلْقِيِّ عَينٍ واجبُ … أو لامٍ ............................  الشرح ولمّا انتهى الناظم من الكلام على جوالب الكسر والضم، شرع في الكلام على جوالب الفتح فقال: (والفتحُ في حَلْقِيِّ عَينٍ واجبُ أوْ لامٍ) فذكر أنه يجب فتح عين مضارع \"فَعَلَ\" إذا وُجِد فيها جالب من جوالب الفتح، وهي اثنان: 1 - أن تكون عينُ \"فَعَلَ\" حرفاً من حروف الحلق، ولذا قال الناظم: (والفتحُ في حَلْقِيِّ عَينٍ واجبُ) أي: ويجب فتح عين مضارع \"فَعَلَ\" إذا كانت العين حلقية، فقوله: (الفتحُ) مبتدأ، و (واجبٌ) خبره، ومن أمثلة ذلك: \"سأل يسأَلُ، بحَثَ يبحَثُ، بعثَ يبعَثُ، بَهَتَ يبهَتُ، لهثَ يلهَثُ، نحرَ ينحَرُ، شغرَ المكان يشغَرُ، نهشَ ينهَشُ\". 2 - أن تكون لامُ \" فَعَلَ\" حرفاً من حروف الحلق، ولذا قال الناظم: (أوْ لامٍ) أي: ويجب فتح عين مضارع \"فَعَلَ\" إذا كانت حلقية اللام كما يجب إذا كانت حلقية العين، نحو: \"خشعَ يخشَعُ، خضعَ يخضَعُ، بدأَ يبدَأُ، هدأَ يهدَأُ، شرحَ يشرحُ، ركعَ يركَعُ، خلعَ يخلَعُ، رفعَ يرفَعُ، زرعَ يزرَعُ، رقعَ يرقَعُ، نصحَ ينصَحُ، شرَعَ في الأمرِ يشرَعُ، لَعَنَ يلعَنُ، فتحَ يفتحُ\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 30
  },
  {
    "serial_number": "6662899",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "....................... … ......... إِنْ عُدِمَ فيهِ الجالِبُ  الشرح إلا أنه يشترط في فتح مضارع فَعَلَ أن لا يوجد جالب من جوالب الكسر أو الضمّ، ولذا قال الناظم: (إِنْ عُدِمَ فيهِ الجالِبُ) أي: جالب الكسر والضم، أما إذا وُجِد جالب من جوالب الكسر أو الضم فإنه يُغلَّبُ ويُقدَّمُ على جالب الفتح إلا فيما استثني سابقاً؛ لأن جالب الفتح أضعف الجوالب، نحو: دَعّ، يقال: دعَّهُ - أي: رماه بعنف - يدُعُّهُ -. بضم العين (1) ، مع أن عينها ولامها حلقية، فعينها حرف العين، ولامها عينٌ أيضاً؛ لأن أصلها\"دَععَ\"، ومع ذلك قُدِّم جالب الضم، وهو كون \"فَعَلَ\" مضعَّفة متعدية. ومن أمثلة ذلك أيضاً: \"بغى\" فيقال في مضارعها: \" يبغِي\" بالكسر، مع أنّه وُجِد فيها جالب من جوالب الفتح، وهو كون عين الكلمة حرفاً من حروف الحلق، إلا أنه عارضه جالب من جوالب الكسر وهو كون اللام يائياً، فقُدِّم جالب الكسر على جالب الفتح.",
    "foot_note": "1. ومنه قوله تعالى: {يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعّاً} الطور: 13.",
    "book_id": "238",
    "new_page_number": 31
  },
  {
    "serial_number": "6662900",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "معْ شهرةٍ ........................ … .......................................  الشرح ثم قال: (معْ شُهْرَةٍ) أي: ويشترطُ أيضاً في فتح مضارع فَعَلَ أن لا تُوجد شُهرة، فإذا اشتهر الفعلُ عند العرب بالكسر أو الضم فالشهرة مقدَّمة ومغلَّبة على جالب الفتح؛ لأن الشهرة تقوى على الجالب، ومن أمثلة ذلك: \"قعَدَ، زعمَ، أخذ، دخَلَ، سعَلَ، نَخَلَ\" فإن هذه الأمثلة القياس فيها فتح عين مضارعها؛ لكون عينها حرفاً من حروف الحلق، إلا أنه اشتُهِر في مضارعها الضم فيقال: \"يقعُدُ، يزعُمُ، يأخُذُ، يدخُلُ، يسعُلُ، ينخُلُ\". ومن أمثلة ذلك أيضاً: \"نَفخَ، صَرخَ، بلغَ الصبي، طلعتِ الشمس\" فإن هذه الأمثلة القياس فيها فتح عين مضارعها؛ لكون لامها حرفاً من حروف الحلق، إلا أنه اشتُهِر في مضارعها الضم فيقال: \"ينفُخُ، يصرُخُ، يبلُغُ، تطلُعُ\". ومن أمثلة ذلك أيضاً: \"شَخَرَ - أي: صوَّت من حلقه وأنفه -\" فإن القياس فيها فتح عين مضارعها؛ لكون عينها حرفاً من حروف الحلق، إلا أنه اشتُهِر في مضارعها الكسر فيقال: \"يشْخِرُ\". ومن أمثلة ذلك أيضاً: \"رجَعَ، نَزَعَ\" فإن القياس فيها فتح عين مضارعها؛ لكون لامها حرفاً من حروف الحلق، إلا أنه اشتُهِر في مضارعها الكسر فيقال: \" يرجِعُ، ينزِعُ\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 32
  },
  {
    "serial_number": "6662901",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "وما عنِ الكُلِّ عَدَلْ … فَاكْسِرْ أوِ اضْمُمْ منهُ آتٍ كَعَتَلْ  الشرح قال: (وما عنِ الكُلِّ عَدَلْ فَاكْسِرْ أوِ اضْمُمْ منهُ آتٍ كَعَتَلْ) أي: وما خلا عن جميع الجوالب السابقة، فلم يوجد فيه جالب من جوالب الكسر ولا الضم ولا الفتح، وخلا عن الشهرة فلم يشتهر فيه عن العرب بشيء؛ فإنه يجوز في عين مضارعه الكسر والضم، نحو: عَتَلَ، ولذا قال الناظم: (كعَتَل) - والعَتْل: الدفعُ بعنف وقوة - فتقول في مضارعها: يعْتِلُ ويعتُلُ\" (1) . وقوله: (آتٍ) أي: مضارع؛ لأن المضارع يطلق عليه \"الآتِي\" كما قدمنا.",
    "foot_note": "1. وبالوجهين - الكسر والضم -قرئ قوله تعالى: {فَاعْتِلُوهُ إِلَى سَوَاء الْجَحِيمِ} الدخان: 47.",
    "book_id": "238",
    "new_page_number": 33
  },
  {
    "serial_number": "6662902",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  الشرح الخلاصة: للفعل الثلاثي المجرَّد باعتبار مضارعه ستة أبواب: الباب الأول: فَعُلَ يَفْعُلُ - بضم العين من الماضي والمضارع -، نحو: كرُمَ يكرُم. الباب الثاني: فَعِلَ يفعَلُ - بكسر عين الماضي، وفتحها من المضارع -، نحو: فرِحَ يفرَحُ. الباب الثالث: فَعِلَ يفْعِلُ - بكسر عين الماضي والمضارع -، نحو: ورِثَ يرِثُ. الباب الرابع: فَعَلَ يَفْعِلُ - بفتح عين الماضي وكسرها من المضارع -، نحو: ضرَبَ يضْرِبُ. الباب الخامس: فَعَلَ يفْعُلُ - بفتح عين الماضي وضمها من المضارع -، نحو: نصَرَ ينصُرُ. الباب السادس: فَعَلَ يفْعَلُ - بفتح عين الماضي والمضارع -، نحو: فتَحَ يفتَحُ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 34
  },
  {
    "serial_number": "6662903",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "و خلاصة ما يتعلق بـ\"فَعَلَ\" بفتح العين ما يلي: 1 - يُكسر عين مضارعها إذا كانت واويّة الفاء، أو لازمة مضعّفة، أو يائية العين أو اللام. 2 - يضمُّ عين مضارعها إذا كانت واويّة العين، أو واوية اللام، أو دالةً على الغلبة، أو مضعّفة متعدية. 3 - يُفتَحُ عين مضارعها إذا كانت حلقية العين أو حلقية اللام، وخلت عن جوالب الكسر والضمّ، وخلت من شهرة عند العرب. 4 - إذا خلت عن جوالب الكسر والضمّ والفتح، ولم تشتهر عند العرب بشيء، فإنه يجوز في عين مضارعها الكسر والضمّ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 35
  },
  {
    "serial_number": "6662904",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "ثم لمّا انتهى الناظم من الكلام على وزن مضارع الثلاثي، انتقل إلى الكلام على  وزن مضارع الرباعي فقال: مُضَارِعُ الرُّباعِ مكسورٌ كما … زادَ على ثلاثةٍ وعَمِّما  الشرح (مُضَارِعُ الرُّباعِ مكسورٌ) أي: أنّ كل فِعْلٍ رباعي مجرّد كـ\"دَحْرَج\" فإن المضارع منه يأتي بكسر ما قبل آخره، نحو: \"يُدَحرِجُ، يُزلزِلُ، يحشرِجُ، يُبرطِمُ، يُعربِدُ\". وقوله: (مكسورٌ) أي: ما قبل آخره. وقوله: (كما زادَ على ثلاثةٍ) أي: كما يكسر ما قبل الآخِر من مضارع الثلاثي المزيد، نحو: ينطلِقُ - مضارع الفعل الخماسي انطلق-، يستخرِجُ - مضارع السداسي استخرج-. وقوله: (وعَمِّما) أي: وعمِّم هذا الحكم، وهو كسر ما قبل الآخر من مضارع المزيد، لكنَّ هذا التعميم فيه نظر؛ لأن الفعل الثلاثي المبدوء بتاء زائدة يفتح ما قبل آخره من المضارع كما سيأتي، نحو: \"يتغافَلُ، يتقاتَلُ، يتكلَّمُ، يتعلَّمُ، يتقدَّمُ، يتكلَّفُ\". والألف في قوله (وعمِّما) منقلبة عن نون التوكيد المخففة الموقوف عليها؛ لأن الأصل أن يقول: (وعمِّمن) ولكنه عدل عن ذلك مراعاة للوزن.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 36
  },
  {
    "serial_number": "6662905",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "تنبيهٌ تمْييزُكَ الياءَ مِنَ الوَاوِ بعَينْ … ........................................  الشرح تنبيهٌ التنبيه في اللغة: الإيقاظ. وفي الاصطلاح هو: تعقيب الكلام السابق بذكر جزئية تندرج فيه اندراجاً خفياً. وإن شئنا قلنا في تعريفه: هو كلام مفصِّلٌ لِما أُجْمِل قبله (1) . وكان الأولى أن يعبِّر الناظم بقوله: \"مسألة\" بدل قوله: \"تنبيه\"؛ لأن هذه المسألة التي تكلم عنها الناظم في هذا التنبيه لم يتقدم لها ذِكْرٌ أصلاً. والناظم في هذه الأبيات أراد أن يُبيِن الطريقة التي بها تُعرف الألف هل هي منقلبة عن واو، أو عن ياء، فقال: (تمْييزُكَ الياءَ مِنَ الوَاوِ بعَينْ) أي: إذا أردتَ تمييز عين الفعل",
    "foot_note": "1. انظر: التعريفات للجرجاني (ص: 91).",
    "book_id": "238",
    "new_page_number": 37
  },
  {
    "serial_number": "6662906",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "............................ … بوَصْلِ ذِي الرفعِ المُحرَّكِ يَبينْ  الشرح هل هي منقلبة عن واو، أو عن ياء كـ\"قال، باع، طال، خاف، هاب\" فأتِ بضمير الرفع المتحرِّك كتاء المتكلِّم، وصِلْهُ بالفعل الذي تريد تمييز عينه (1) ، ولذا قال الناظم: (بوَصْلِ ذِي الرفعِ المُحرَّكِ يَبينْ) أي: أنك إذا وصلْتَ بآخر الفعل أحد ضمائر الرفع المتحركة (2) فسيظهر عين الفعل، ويتبين هل هو واو أو ياء. وقوله: (بعين) أي: الواقعة في عين الكلمة. وقوله: (يبين) أي: يظهر.",
    "foot_note": "1. فائدة: قال ابن هشام: \"إذا أشكل أمرُ الفعل وصلْتَه بتاء المتكلم أو المخاطب، فمهما ظهر فهو أصله، ألا ترى أنك تقول في رمى وهدى: رميت وهديت، وفي دعا وعفا: دعوت وعفوت. وإذا أشكل أمر الاسم نظرت إلى تثنيته، فمهما ظهر فيها فهو أصله، ألا ترى أنك تقول في الفتى والهدي: الفتيان والهديان، وفي العصا العصوان، وما أحسن قول الشاطبي [أي: في حرز الأماني] رحمه الله تعالى: وتثنية الأسماء تكشفها وإن \n…. رددت إليك الفعل صادفت منهلاً قال الحريري رحمه الله تعالى: إذا الفعل يوما غمّ عنك هجاؤه \n…. فألحق به تاء الخطاب ولا تقفْ فإن تره بالياء يوماً كتبته \n…. بياء وإلا فهو يكتب بالألف. \n…. انظر: شرح قطر الندى (ص: 331 - 332). \n2. ضمائر الرفع المتحركة هي: تاء الفاعل كـ\"ضربتُ\"، ونون النسوة كـ\"خِفنَ\"، ونا الفاعلين كـ\"قلنا\".",
    "book_id": "238",
    "new_page_number": 38
  },
  {
    "serial_number": "6662907",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "وَنَقْلِ شَكْلِ عينهِ للفاءِ … إنْ ضُمَّ أوْ كُسِرَ ماضي ذاء  الشرح ثم قال: (وَنَقْلِ شَكْلِ عينهِ للفاءِ إنْ ضُمَّ أوْ كُسِرَ ماضي ذاءِ) الشكلُ: الحركة. والمراد أنَّ الفعل الماضي الذي عينه مضمومة أو مكسورة إذا وصلته بضمير رفع متحرك فإنك تنقل حركة عين الفعل إلى الفاء. مثال ما عينه مكسورة: \"خافَ\"، فإن أصلها \"خَوِف\"، تحرَّك حرف العلة وانفتح ما قبله فوجب قلبه ألفاً، فيقال: \"خافَ\"، فإذا وصلتها بضمير رفع متحرك كالتاء فإنك تقول: \"خِفْتُ\"، والأصل \"خَوِفْتُ\"، نُقِلَت حركة الواو إلى الخاء بعد نزع حركتها، ثم حُذفت الواو لالتقاء الساكنين - الواو والفاء - فصارت \"خِفْتُ\" على وزن \"فِلْتُ\" فبقاء الكسرة على فاء الكلمة دليل على أن عينها ياء. وقوله: (ذاءِ) اسم من أسماء الإشارة للمفرد المذكر.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 39
  },
  {
    "serial_number": "6662908",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "أمَّا لدَى المفتوحِ فَالمُجَانِسُ … يُنْقَلُ لا الشَّكْلُ على ما أسَّسوا  الشرح ثم قال الناظم: (أمَّا لدَى المفتوحِ فَالمُجَانِسُ يُنْقَلُ لا الشَّكْلُ على ما أسَّسوا) أي: أنَّ عين الفعل الماضي إذا كانت مفتوحة ووصلناه بضمير رفع متحرك، فإن الذي يُنقَلُ الحركةُ المجانسةُ للعين لا حركتها؛ لأن حركتها هي الفتحة، ولا فائدة من نقل فتحة إلى فتحة، لكن نعطي للفاء حركة مجانسة لحرف العين، فإن كان حرف العين واواً أعطينا للفاء الضمة؛ لأنها تجانس الواو، وإن كان حرف العين ياءً أعطينا للفاء الكسرة؛ لأنها تجانس الياء. مثال ما عينه واو: \"قال\" فإن أصلها \"قوَلَ\" تحرَّك حرف العلة وانفتح ما قبله فوجب قلبه ألفاً فيقال: \"قال\"، فإذا وصلنا بها ضمير رفع متحرك صارت \"قُلْتُ\"، ووجود الضمة على الفاء دليل على أن الألف منقلبة عن واو. ومثال ما عينه ياء: \"باع\" فإن أصلها \"بَيَعَ\" تحرَّك حرف العلة وانفتح ما قبله فوجب قلبه ألفاً فيقال: \"باع\"، فإذا وصلنا بها ضمير رفع متحرك صارت \"بِعت\" ووجود الكسرة على الفاء دليل على أن الألف منقلبة عن ياء. وقول الناظم: (فالمجانسُ يُنقلُ) فيه تسامح؛ لأنه لا نقل هنا حقيقة، بخلاف ما تقدم في المضموم والمكسور. وقوله: (على ما أسَّسوا) أي: على ما أصَّلوا وقعَّدوا.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 40
  },
  {
    "serial_number": "6662909",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "فصلٌ في المضارِعِ وَبـ\"نَأيْتُ\" يُبْدَأُ المضارعُ … وافْتَحْ .................................  الشرح فصلٌ في المضارِعِ ذكر الناظم في هذا الفصل الأحرف التي يُفْتَتَحُ بها المضارع، وحركة هذه الأحرف، وحركة الحرف الذي قبل الآخر، فبدأ بما يفتتح به المضارع فقال: (وَبـ\"نَأيْتُ\" يُبْدَأُ المضارعُ) أي: أن الفعل المضارع لابد أن يكون مبدوءاً بحرف من الأحرف الأربعة المجموعة في قولك: \"نأيتُ\" (1) ، نحو: \"نجلِسُ، أَجلِسُ، يجلِسُ، تجلِسُ\"، وهذه الأحرف الأربعة تسمى أحرف المضارعة. ثم شرع الناظم في الكلام على حركة هذه الأحرف فقال: (وافتحْ) أي: وافتح هذه الحروف إذا كان الفعلُ ثلاثياً كـ\"يَضرِبُ، تَنصُرُ، أَفتحُ\"، أو خماسياً كـ\"يَنطلقُ، نَجتمِعُ، أَتعلَّمُ\"، أو سداسياً كـ\"يَستخرجُ، نَستغفرُ\".",
    "foot_note": "1. وتُجمعُ أيضاً في كلمة \"أنيتُ\" و\"نأتي\".",
    "book_id": "238",
    "new_page_number": 41
  },
  {
    "serial_number": "6662910",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "............................. … ............... وفي الرُّباعِ ضَمٌّ واقعُ وما قُبَيْلَ الآخِرِ افتحْ إنْ بُدِيْ … بالتّا ...................................  الشرح قال: (وفي الرُّباعِ ضَمٌّ واقعُ) أي: وأمّا مضارع الرباعي فإن حرف المضارعة فيه يضم عند جميع العرب، فتقول: \"يُدحرِجُ، نُكرِمُ، تُخبِرُ، أُسافرُ، أُعلِّمُ\" وهكذا. ثم لما انتهى من الكلام على  حركة حرف المضارعة الذي يُفتتحُ به الفعل المضارع، شرع في الكلام على حركة الحرف الذي قبل الآخر فقال: (وما قُبَيْلَ الآخِرِ افتحْ إنْ بُدِيْ بالتا) أي: أنّ الفعل الماضي المزيد المبدوء بتاء زائدة معتادة الزيادة (1) - ولا يكون إلا خماسياً كـ\"تكلّمَ، تقدَّم، تعلَّم، تقاتلَ، تغافلَ\"- يفتح الحرف قبل الأخير من مضارعه، فتقول: \"يتكلَّمُ، يتقدَّمُ، يتعلَّمُ، يتقاتَلُ، يتغافَلُ\" وهكذا.",
    "foot_note": "1. قولنا: \"معتادة الزيادة\" احترازا من تاء \"تَرْمَسَ الشيء\" - بمعنى: غيَّبه في الرمس وهو القبر - فإن زيادتها ليست معتادة، وإنما أُتِي بها للتوصل إلى النطق بالساكن، والذي ينبغي أن يبدأ بالهمزة لا بالتاء، ولذا يلغز بعضهم فيقول: ما هو الحرف الذي ليس بهمزة وصل يتوصل به إلى الساكن.",
    "book_id": "238",
    "new_page_number": 42
  },
  {
    "serial_number": "6662911",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": ".......................... … ...... وغيرُهُ مَضَى بادِي بَدِيْ  الشرح قال: (وغيرُهُ مَضَى بادِي بَدِيْ) أي: أنّ غير المبدوء بالتاء قد مضى الكلام فيه، وذلك في فصل تصريف المضارع. فغير المبدوء بالتاء إما أن يكون ثلاثياً كـ\"ضربَ، فتحَ\"، وإما أن يكون رباعياً كـ\"دحرج، بعثرَ\"، وإما أن يكون خماسياً كـ\"انطلق، انكسرَ، اجتمعَ\"، وإما أن يكون سداسياً كـ\" استغفرَ\". فإن كان رباعياً أو خماسياً أو سداسياً وَجَبَ كسر ما قبل آخره من المضارع، نحو: \"يُدحرِجُ، يُبعثِر، يُكرِمُ، يُسلِمُ، يُسافِرُ، يُعلِّمُ، يُقدِّمُ، ينطلِقُ، ينكسِرُ، يجتمِعُ، يستغفِرُ\" وهكذا. وإن كان ثلاثياً كـ\"فتحَ، ضربَ، نصر، كَرُمَ\"، فقد تقدّم الكلام عليه بتوسّع، وبيَّنا أنه قد يكون ما قبل الآخر من مضارعه مفتوحاً كـ\"يفتَحُ، يفرَحُ، يسأَلُ، يخشَعُ، يخضَعُ، يخلَعُ\". وقد يكون مكسوراً كـ\"يأتِي، يبكِي، يبنِي، يرمِي، يهذِي، يعصِي، يجرِي، يمشِي، يزني\". وقد يكون مضموماً كـ\"يدعُو، يبدُو، يزكُو، يعفُو، يعدُو، يغزُو، يفشُو، يهجُو، يهفُو\". وقوله: (بادِي بَدِيْ) أي: في بداية الأمر، قال ابن الأثير: \"البَدِيّ بالتشديد: الأوّل، ومنه قولهم: افعل هذا بادِيَ بَدِيٍّ. أي: أوّل كل شيء\" (1) . وقال الرضي أثناء كلامه على هذه العبارة: \"كثر استعماله حتى استفيد من مجموع الكلمتين ما يستفاد من كلمة واحدة، إذ معنى بادي بدي: مبتدئاً\" (2) .",
    "foot_note": "1. انظر: النهاية في غريب الأثر (1/ 271). \n2. انظر: شرح الرضي على الكافية (3/ 139).",
    "book_id": "238",
    "new_page_number": 43
  },
  {
    "serial_number": "6662912",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "فصلٌ فيما يُبنى للمَجهُولِ والفعلُ إنْ بُنيَ للمفعولِ ضُمْ … أَوَّلَهُ ...................................  الشرح فصلٌ فيما يُبنى للمَجهُولِ قال: (والفعلُ إنْ بُنيَ للمفعولِ ضُمّْ أَوَّلَهُ) أي: أنّ الفعل - سواء كان ثلاثياً أو زائداً على الثلاثي - إذا أردتَ بناءه للمفعول -أي: لِما لم يسمّ فاعله - فإنك تضم أوله، سواء كان ماضياً أو مضارعاً. وقوله: (ضُمّْ) فعل أمر، والفاعل ضمير مستتر تقديره (أنت). مثال الثلاثي الماضي: \"ضُرِبَ، فُتِحَ، سُرقَ، حُفظَ، فُهِمَ، كُتبَ، أُخِذَ، أُكِلَ، قُتِلَ\". ومثال مضارع الفعل الثلاثي: \"يُضربُ، يُفتحُ، يُسرقُ، يُحفظُ، يُفهمُ، يُكتبُ، يُؤخذُ، يُؤكلُ، يُقتلُ\". ومثال الماضي الزائد على الثلاثي: \"دُحْرِجَ، تُعلِّمَ، تُصُدِّقَ، اُنطلقَ، اُجتمعَ، اُستخرجَ\". ومثال مضارع الزائد على الثلاثي: \"يُدحرَج، يُبعثَرُ، يُنطلقُ، يُجتمعُ، يُستخرجُ\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 44
  },
  {
    "serial_number": "6662913",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "........................ … ....... واكسِرْ بِمُعْتَلٍّ كَشِمْ  الشرح قال: (واكسِرْ بِمُعْتَلٍ (1) كَشِمْ) أي: أن الفعل الماضي الثلاثي إذا كان معتلَّ العين كـ: \"قال، باع، جاء، كاد\"، ورُكِّب للمفعول فإنه يُكسر أوله فيقال: \"قِيلَ، بِيعَ، جِيءَ\" (2) . وقوله: (كشِم) شِم: فعل أمر من شام البرق. والشيم: النظر إلى البرق، ينظر إليه أين يقصد وأين يمطر، يقال: شام البرق يشيمه شيماً\" (3) .",
    "foot_note": "1. الفعل ينقسم إلى قسمين: صحيح ومعتل، فالصحيح هو: ما خلا عن أحرف العلة الثلاثة - الألف، والواو، والياء-. والمعتل هو: ما كان أحد حروفه الأصلية حرفاً من حروف العلة. وينقسم إلى خمسة أقسام: الأول: المثال: وهو: ما اعتلت فاؤه، نحو: وَعَدَ، وَرِمَ. الثاني: الأجوف: وهو: ما اعتلت عينه، نحو: باع، قال، خاف، قام، صام. الثالث: الناقص: وهو: ما اعتلت لامه، نحو: رمى، بكى، بغى، رضي، دعا. الرابع: اللفيف المقرون: وهو: ما اعتلت عينه ولامه، نحو: طَوَى، رَوَى، هَوَى، نَوَى، لَوَى، شَوَى. الخامس: اللفيف المفروق: وهو: ما اعتلت فاؤه ولامه، نحو: وَفَى، وَقَى، وَعَى، وَلِيَ. \n2. ما ذكره الناظم من كسر فاء الفعل المعتل العين إذا بُني للمفعول هو الأفصح، مع أنه يجوز الضم الخالص - وهي لغة فقعس ودبير - فتقول: \"بُوعَ، قُولَ، صُوم\"ومنه قول الشاعر: لَيْتَ وَهَلْ يَنْفَعُ شَيْئاً لَيْتُ \n…. لَيْتَ شَبَاباً بُوعَ فَاشْتَرَيْتُ. ويجوز أيضاً الإشمام، وهو: شوب الضمة بشيء من صوت الكسرة. \n3. القاموس المحيط (ص: 1456)، إصلاح المنطق، لابن السكيت (ص: 16).",
    "book_id": "238",
    "new_page_number": 45
  },
  {
    "serial_number": "6662914",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "وما قُبَيلَ آخِرِ الماضِيْ كُسِرْ … والفتحُ فيهِ منْ مضارعٍ أُثِرْ في \"اخْتارَ\" و\"انْقادَ\" وشِبْهٍ اكْسِرِ … لِأَوَّلٍ وثالثٍ وحرِّر  الشرح قال: (وما قُبَيلَ آخِرِ الماضِيْ كُسِرْ) أي: أنَّ الفعل الماضي إذا بُني للمفعول فإنه يُكسر ما قبل آخره، نحو: \" كُسِر، ضُرِبَ، فُتِحَ، سُرِقَ، حُفِظَ، فُهِمَ، كُتِبَ، أُخِذَ، أُكِلَ، قُتِلَ\". قال: (والفتحُ فيهِ منْ مضارعٍ أُثِرْ) أي: ويُفتح ما قبل آخره إذا كان مضارعاً، نحو: \"يُكسَرُ، يُضرَبُ، يُفتَحُ، يُحفَظُ، يُفهَمُ، يُكتَبُ، يُؤكَلُ، يُقتَلُ\". وقوله: (أُثِرْ) أي: نُقِلَ عن العرب. قال: (في \"اخْتارَ\" و\"انْقادَ\" وشِبْهٍ اكْسِرِ لِأَوَّلٍ وثالثٍ وحرِّرِ) أي: أنه في \"اختار\" و\"انقاد\" يُكسر الحرف الأول والثالث، فتقول: \"اِختِير\" و\"اِنقِيدَ\". وما بُدِيْ بِهَمزةِ الوصلِ فضَمْ … ثالثِهِ كثانِ ذي التَّا مُلْتَزَمْ وقوله: (وشِبْهٍ) أي: ما أشبههما من كل فعلٍ على وزن \"افتعل\" أو\"انفعل\"، معتل العين صحيح اللام، فحكمه كحكمهما بمعنى أنه يُكسر أوله وثالثه (1) . وقوله: (وحرِّرِ) من التحرير وهو التهذيب، ولعل الناظم أراد أن يبين بهذه العبارة أن ما لم تتوفر فيه الشروط المتقدمة مما كان على وزن \"افتعل\" أو\"انفعل\" كـ\"استَوى\" (2) فإنه لا يعطى حكمهما، بل هو كغيره مما بُدئ بهمزة وصل ليس فيه إلا ضم أوله وثالثه كما سيأتي في البيت التالي، وهو قوله: وما بُدِيْ بِهَمزةِ الوصلِ فضَمْ … ثالثِهِ كثانِ ذي التَّا مُلْتَزَمْ",
    "foot_note": "1. ويجوز أيضاً الضم الخالص فتقول: \"اُخْتُور، اُنْقُود\"، ويجوز أيضاً الإشمام. \n2. ونحوه مما اختل فيه شرط من الشروط المتقدمة، وهو هنا صحة اللام، فاللام فيه معتلة.",
    "book_id": "238",
    "new_page_number": 46
  },
  {
    "serial_number": "6662915",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "وما بُدِيْ بِهَمزةِ الوصلِ فضَمْ … ثالثِهِ كثانِ ذي التَّا مُلْتَزَمْ  الشرح (وما بُدِيْ بِهَمزةِ الوصلِ فضَمْ ثالثِهِ كثانِ ذي التَّا مُلْتَزَمْ) أي: أن الفعل الماضي المبدوء بهمزة وصل - ولا يكون إلا خماسياً أو سداسياً- إذا بُني للمفعول، فإنه يُلتَزمُ ضمّ الحرف الثالث منه - أي: مع الأول -، نحو: \"اُنطُلِقَ، اُجتُمِعُ، اُستُخرِجَ، اُستُغفِرَ، اُستُنبِطَ\". وكان الأولى هو تقديم هذا البيت على البيت الذي قبله؛ إذ ما ذُكِر في البيت السابق إنما هو استثناء من هذه القاعدة، فكان الأولى تقديم ذِكْر القاعدة، ثم يُذكر ما يُستثنى منها، والذي هو كلّ فعْلٍ على وزن \"افتعل\" أو\"انفعل\"، معتل العين صحيح اللام. وقوله: (كثانِ ذي التَّا) أي: أنّ الفعل المبدوء بتاء زائدة يُضمّ الحرف الثاني منه- أي: مع الأول - كـ\"تَعلَّم، تَصدَّقَ، تَقاتلَ\"، فتقول في بنائها للمفعول: \"تُعُلِّمَ، تُصُدِّقَ، تُقٌوتِلَ\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 47
  },
  {
    "serial_number": "6662916",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "بابٌ في الأمرِ والأمْرُ منْ أَفْعَلَ أَفْعِلْ ............ … ........................................  الشرح بابٌ في الأمرِ تكلَّم الناظم في هذا الباب عن كيفية صوغ فعل الأمر، وحاصل هذا الباب أن الفعل الماضي إما أن يكون على وزن \"أَفْعَلَ\" أولا، فإن كان على وزن \"أَفْعَل\" بفتح العين، فيؤتى بفعل الأمر منه على وزن \"أفْعِلْ\" بكسر العين، وهذا معنى قول الناظم: (والأمْرُ منْ أَفْعَلَ أَفْعِلْ) ومن أمثلة ذلك: \"أَكْرِمْ، أَحْسِنْ، أَعْطِ، آمِنْ\"، فإن ماضي هذه الأوامر: \"أكْرَمَ، أحْسَنَ، أعطَى، آمَنَ\"، فالفرق بين صيغة الماضي والأمر - كما ترى في الأمثلة - أن الحرف الذي قبل الآخر مفتوح في الماضي، ومكسور في الأمر (1) .",
    "foot_note": "1. ومن الفرق بينهما أيضاً أن الحرف الأخير في الماضي مفتوح، وفي الأمر ساكن، إلا أن ضبط الحرف الأخير ليس من مباحث علم الصرف، وإنما هو من مباحث علم الإعراب.",
    "book_id": "238",
    "new_page_number": 48
  },
  {
    "serial_number": "6662917",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "................. واحْذِفِ … مِنْ غيرهِ حرفَ المضارعِ تَفِي  الشرح وإن لم يكن الماضي على وزن \"أَفْعَلَ\" بأن كان ثلاثياً كـ\"ضرَب\"، أو رباعياً ليس على وزن أفعل كـ\"دَحرجَ\"، أو خماسياً \"كانطلق\"، أو سداسياً كـ\"استخرَجَ\"، فطريقة الإتيان بفعل الأمر منه أن يؤتى بالفعل المضارع مجزوماً بلام الأمر، ثم يُحذف منه لامُ الأمر وحرف المضارعة، ثم يُنظر إلى الحرف الذي كان متصلاً بحرف المضارعة، فإن كان متحركاً فإنك ستحصلُ على فعل الأمر مباشرة، نحو: \"لِتُدَحرِجْ، لِتُزَخرِفْ، لِتُصَدِّقْ، لِتُشَارِكْ، لِتُقَاتِلْ، لِتَتَقدَّمْ، لِتَقُلْ، لِتَصُمْ \"، تقول في الأمر منها: \"دَحرِجْ، زَخرِفْ، صدِّقْ، شارِكْ، قاتِلْ، تقدَّمْ، قُلْ، صُمْ\". وهذا هو المراد بقول الناظم: (واحْذِفِ مِنْ غيرهِ حرفَ المضارعِ تَفِي) أي: واحذف حرف المضارعة من غير \" أَفْعَلَ\" تفي بما هو واجب عليك. وأما إن كان الحرف المتصل بحرف المضارعة ساكناً، فإنه يؤتى بهمزة وصل يتوصل بها إلى النطق بذلك الساكن، وتكون هذه الهمزة مكسورة إذا كان المضارعُ مكسور العين كـ\"يضرِبُ\"، أو مفتوح العين كـ\"يذهَبُ، يعلَمُ\"، فتقول في الأمر منها: \"اِضرِب، اِذهَبْ، اِعلَمْ\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 49
  },
  {
    "serial_number": "6662918",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "وساكناً صِلْهُ بهمزٍ كُسِرا … إنْ فُتِحَ الآتِيْ كذا إِنْ كُسِرا واضْمُمْهُ ممَّا ضُمَّ أَصليّاً ........ … ..............................................  الشرح وإلى هذا أشار الناظم بقوله: (وساكناً صِلْهُ بهمزٍ كُسِرا إنْ فُتِحَ الآتِيْ كذا إِنْ كُسِرا) أي: أنَّ الحرف الذي يلي حرف المضارعة إذا كان ساكناً فصِلْهُ بهمزة وصل مكسورة إذا كان المضارع مفتوحاً أو مكسوراً. وقوله: (إنْ فُتِحَ الآتِيْ) أي: المضارع. قال: (واضْمُمْهُ ممَّا ضُمَّ أَصليّاً) أي: وضُمّ همزة الوصل إذا كانت عين الفعل المضارع مضمومةً بضمة أصلية، مثال ذلك: \"ينصُرُ، يقتُلُ، ينظُرُ، يكتُبُ، يدعُو\"، فهذه أفعال مضارعة مضمومة العين، فتقول في فعل الأمر منها: \"اُنصُرْ، اُقتُلْ، اُنظُر، اُكتُبْ، اُدْعُ\". وقوله: (ممَّا ضُمَّ أَصليّاً) احتراز مما لو كانت ضمةُ عين المضارع ضمة عارضة، فإنه يؤتى بهمزة الوصل مكسورة، لأن العارِضَ ضعيفٌ لا يُخرِجُ عن الأصل، فتقول: \"اِمشُوا\" بكسر همزة الوصل، مع أن عين الفعل المضارع المسند إلى واو الجماعة مضمومة \"يمشُون\"، ولكنّ هذه الضمة عارضة لأجل واو الجماعة.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 50
  },
  {
    "serial_number": "6662919",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "...................... وشَذْ … حذفٌ لها من كُلْ ومُرْ وسَلْ وخُذْ  الشرح وقوله: (وشَذْ حذفٌ لها من كُلْ ومُرْ وسَلْ وخُذْ) أي: وشذّ حذف همزة الوصل في أفعال محصورة، وهي: \" كُلْ، مُرْ، سَلْ، خُذْ\"، مع أن الأصل إثباتها؛ لأن الحرف المتصل بحرف المضارعة ساكن، والقياس في أمثالها إثبات همزة الوصل، فالأصل أن يقال: \"اُأْكُل، اُأْمُر، اِسأَلْ، اُأْخذ، \"، إلا أن العرب لماَّ حذفت هذا الساكن المتصل بحرف المضارعة، استغنوا عن الإتيان بهمزة الوصل؛ لأنها كانت مجتلبة للتوصل إلى النطق بالساكن وقد زال، فحذفوها، فصارت \"كُل، مُرْ، سَلْ، خُذْ\". إلا أنه لا يُلتزم حذف همزة \"أَمر، سأَل\" إلا عند الابتداء بالكلمة، فإن كانت مسبوقة بحرف عاطف لم يلتزموا حذفها، بل الأكثر استعمالاً في هاتين الكلمتين حينئذٍ إعادة الهمزة، نحو قوله تعالى: {وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ}، {فَاسْأَلُوا أَهْلَ الذِّكْرِ}. وأما \"خُذْ، كُلْ\" فتتميمهما بعد العاطف نادرٌ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 51
  },
  {
    "serial_number": "6662920",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "بابٌ في اسمِ الفاعلِ واسمِ المفعولِ فَعُلَ بالضمِّ فَعِيْلٌ فَعْلُ … لَهُ اسمُ فاعِلٍ كـ\"زيدٌ سهْلُ\" وَفَعِلٌ لِفَعِلَ الكسرِ أدِمْ … كأَفْعَلٍ فَعْلانَ إنْ كانَ لَزِمْ  الشرح بابٌ في اسمِ الفاعلِ واسمِ المفعولِ قال الناظم: (فَعُلَ بالضمِّ فَعِيْلٌ فَعْلُ لَهُ اسمُ فاعِلٍ كزيدٌ سهْلُ) أي: أنّ كل فعْلٍ على وزن \"فَعُلَ\" فقياس اسم فاعله أن يأتي على وزن \"فعِيل\" أو على وزن \"فَعْل\"، وما خرج عن هذين الوزنين فهو شاذ يُحفظ ولا يقاس عليه. فمن أمثلة ما أتى على وزن \"فعيل\": \"كرُمُ فهو كريم، نبُلَ فهو نبيل، قَبُحَ فهو قبيح، قَصُرَ فهو قصير، عَظُمَ فهو عظيم، شرُفَ فهو شريف، سَمُنَ فهو سمين\". ومن أمثلة ما جاء على وزن\"فعْل\": \"سَهُل فهو سهْلٌ، صَعُب فهو صَعْبٌ\". وقول الناظم: (زيدٌ سهْلٌ) مبتدأ وخبر. قال: (وَفَعِلٌ لِفَعِلَ الكسرِ أدِمْ كأَفْعَلٍ فَعْلانَ إنْ كانَ لَزِمْ) أي: أنّ كل فعلٍ لازم على وزن \"فَعِلَ\" بكسر العين، فإن اسم الفاعل يأتي منه على وزن \"فَعِل\" وهو الغالب كـ\"فرِحَ فهو فَرِحٌ، بَطِرَ فهو بطِرٌ\"، أو على وزن \"أفعَلَ\" إذا كان دالاًّ على لون كـ\"خضِرَ فهو أخضر، حَمِرَ فهو أحمر، سَوِدَ فهو أسود\"، أو على وزن \"فعْلان\" كـ\"شبِعَ فهو شبعان، عطِشَ فهو عطشان، سكِرَ فهو سكران\"، وربما اجتمعت الأوزان الثلاثة كـ\"شَعِثَ فهو شعِثٌ وأشعث وشعثان\"، ولذا قال بعضهم: وربما اجتمعن نحو شَعِثِ ونحو شعثان ونحو الأشعثِ.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 52
  },
  {
    "serial_number": "6662921",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "وفاعِلٌ لِفَعَلَ المفتوحِ والْـ … ـمكسورِ إنْ عُدِّيْ .....................  الشرح ومعنى قوله: (وَفَعِلٌ لِفَعِلَ الكسرِ أدِمْ) أي: واسم الفاعل الذي على وزن \"فَعِلٌ\" يُؤتى به دائماً لـ\"فَعِلَ\" بكسر العين. وقوله: (أدِمْ) فعل أمر من أدَامَ. وقوله: (إنْ كانَ لَزِمْ) أي: بشرط أن يكون \"فَعِلَ\" بكسر العين لازماً لا متعدياً. قال: (وفاعِلٌ لِفَعَلَ المفتوحِ والمكسورِ إنْ عُدِّيْ) أي: أنّ كل فعلٍ على وزن \"فَعَلَ\" بفتح العين - سواء كانت لازمة كـ\"ذهَبَ\" أو متعديةكـ\"ضرَب، كتَبَ\"-، أو على وزن \"فَعِلَ\" بكسر العين بشرط أن تكون متعدية كـ\"حفِظَ، فَهِمَ\"، فإن اسم الفاعل يأتي منها على وزن\"فاعِل\"، نحو: ذهب فهو ذاهب، ضرب فهو ضارِب، كتب فهو كاتِب، حفِظَ فهو حافِظ، فهِمَ فهو فاهِم\". وقوله: (إنْ عُدِّيْ) أي: بشرط أن يكون \"فَعِلَ\" بكسر العين متعدياً، أما إن كان لازماً فقد تقدم في البيت السابق أن اسم الفاعل منه على وزن\"فعِلٌ، أو\"أفعَل\"، أو \"فعلان\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 53
  },
  {
    "serial_number": "6662922",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "................... … .................. لِغَير ذا نُقِلْ زِنَةُ ما ضارعَ معْ مِيمٍ تُضَمْ … أَوَّلَهُ، واكْسِرْ لِتالي ما خَتَمْ  الشرح وبعد أن ذكر الناظم صيغة اسم الفاعل من الفعل الثلاثي، ذكر أنه يأتي من غير الثلاثي فقال: (لِغَير ذا نُقِلْ) أي: لغير الثلاثي. معناه أنَّ اسم الفاعل يأتي من غير الثلاثي على وزن مضارعه، إلا أن حرف المضارعة يُبدلُ ميماً مضمومة، ويكسر ما قبل آخره، نحو: \"أكرم يُكرِمُ فهو مُكرِمٌ، انطلق ينطلِقُ فهو مُنطلِقٌ، استخرَج يستخرِجُ فهو مُستخرِجٌ\"، ولذا قال الناظم: (زِنَةُ ما ضارعَ معْ مِيمٍ تُضَمْ أَوَّلَهُ، واكْسِرْ لِتالي ما خَتَمْ). فقوله: (زِنَةُ ما ضارعَ) أي: على وزن المضارع. وقوله: (معْ مِيمٍ تُضَمْ) أي: يُبدل حرف المضارعة ميماً مضمومة. وقوله: (أّوَّلَهُ) أي: أن الميم تكون في أوّله. وقوله: (واكْسِرْ لِتالي ما خَتَمْ) أي: واكسر الحرف الذي قبل الأخير.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 54
  },
  {
    "serial_number": "6662923",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "وإنْ فتَحْتَهُ فمفْعولٌ تُرِدْ … والوزنُ ذا مِنَ الثلاثيْ مُطَّرِدْ  الشرح ولما انتهى الناظم من الكلام على اسم الفاعل، شرع في الكلام على اسم المفعول من الفعل الثلاثي ومن غيره، فبدأ بالكلام عن صوغه من غير الثلاثي فقال: (وإنْ فتَحْتَهُ فمفْعولٌ تُرِدْ) أي: وإن أردت اسم المفعول من الفعل الزائد على الثلاثي فافتح الحرف الذي قبل الأخير من اسم فاعله، نحو: \"مُكرَمٌ، مُنطلَقٌ، مُستخرَجٌ، مُستنبَطٌ\" وهكذا. ثم ذكر  اسم المفعول من الثلاثي ، فقال: (والوزنُ ذا) أي: وزن \"مَفْعُول\" (مِنَ الثلاثيْ مُطَّرِدْ) أي: هو قياس اسم المفعول من الثلاثي مطلقاً، فكل فعْلٍ ثلاثي سواء كان على وزن\"فعُل\" بضم العين، أو على وزن \"فعِلَ\" بكسر العين، أو على وزن \"فعَل\" بفتح العين فإنه يؤتى باسم المفعول منه على وزن \"مفعول\"، نحو: \" مشروب، مأكول، مضروب، مسروق، مقتول\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 55
  },
  {
    "serial_number": "6662924",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "بابٌ في المصادر مِنْ فَعُلَ المضمومِ قَيْسُ المصدرِ … فَعَالةً فُعُوْلَةً لَهُ اذْكُر  الشرح بابٌ في المصادر المصادر على قسمين: سماعي، وقياسي. والسماعي منها أكثر من القياسي، إلا أن الناظم لم يتكلم عليه، بل اقتصر على القياسي منها، وبدأ بالكلام عن مصدر \"فعُلَ\" بضم العين، فقال: (مِنْ فَعُلَ المضمومِ قَيْسُ المصدرِ فَعَالةً فُعُوْلَةً لَهُ اذْكُرِ) أي: أنَّ كلَّ فعلٍ على وزن \"فعُلَ\" بضم العين فقياس المصدر منه أن يأتي على وزن \"فعالة\" أو فُعُولَة، نحو: \"ظَرُفَ ظرافة، فَصُحَ فصاحة، شجُعَ شجاعة، سهُل سُهُولة، صعُبَ صُعُوبة\". وقوله: (قَيْسُ) أي: قياس، و (فعالة وفعولة) في قول الناظم مفعول به لقوله: (اذكُر) أي: اذكر لِـ\"فَعُلَ\" فعالةً وفُعُولةً.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 56
  },
  {
    "serial_number": "6662925",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "وفَعِلَ المكسورِ لازماً فَعَلْ … قِياسُهُ فَعْلٌ لِوَاقِعٍ حصلْ وفَعَلَ المفتوحُ منهُ المصدرُ … فَعْلٌ ..................................  الشرح قال: (وفَعِلَ المكسورِ لازماً فَعَلْ) أي: أنّ كل فعلٍ لازم على وزن \"فعِلَ\" بكسر العين فقياس المصدر منه أن يأتي على وزن \"فَعَل\"، نحو: \"فرِحَ فرَحَاً، بطِرَ بَطَراً، غضِبَ غَضَباً، عطِشَ عَطَشاً\" وهكذا. وقوله: (وفَعِلَ المكسورِ) أي: مكسور العين (لازماً) أي: بشرط أن يكون لازماً. أما المتعدي فقياس المصدر منه أن يأتي على وزن \"فعْلٌ\" بسكون العين، ولذا قال الناظم: (قِياسُهُ فَعْلٌ لِوَاقِعٍ حصلْ) نحو: \"فهِم فَهْماً، ثلِم ثَلْماً\". وقوله: \" (لواقع) أي: للفعل المتعدي، لأن المتعدي يطلق عليه لفظ \"الواقع\"؛ لوقوعه على المفعول به. قال: (وفَعَلَ المفتوحُ منهُ المصدرُ فَعْلٌ) أي: وكل فعْلٍ على وزن \"فَعَلَ\" بفتح العين إذا كان متعدياً، فقياس المصدر منه أن يأتي على وزن \"فَعْل\" بسكون العين، نحو: \"ضرَب ضرْباً، فتح فتْحاً، بحَثَ بحْثاً، بعَثَ بعْثاً\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 57
  },
  {
    "serial_number": "6662926",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "........................ … ...... فُعُولٌ في لُزُومٍ يُذْكَرُ وجا فَعِيلٌ كَدَبيبٍ، وفُعَالْ … مثلَ صُراخٍ، فَعَلانٌ لانتقالْ  الشرح وأما إن كان لازماً فقياس المصدر منه أن يأتي على وزن \"فُعُولٌ\"، نحو: \"قعَد قُعُوداً، جلس جُلُوساً، دخل دُخُولاً، خضَع خُضُوعاً\"، ولذا قال الناظم: (فُعُولٌ في لُزُومٍ يُذْكَرُ). إلا أنه قد سُمِع كثيراً في \"فعَلَ\" اللازمة مفتوحة العين مجيء المصدر منها على وزن \"فعِيل\" إذا دلت على السير، نحو: \"رحَلَ رحيلاً\"، أو على وزن\"فُعَال\" إن كانت دالة على صوت، نحو: \"دعا دُعاءً\"، أو على وزن \"فَعَلان\" إن كانت دالة على الحركة والاضطراب، نحو: \"دار دَوَراناً\"، ولذا قال الناظم: (وجا فَعِيلٌ كَدَبيبٍ، وفُعَالْ مثلَ صُراخٍ، فَعَلانٌ لانتقالْ) أي: وجاء المصدر لـ\"فعَلَ\" اللازمة على وزن \"فعيل\"، نحو: \"دبَّ دبيباً\"، وعلى وزن\"فُعَال\" كـ\"صرخ صُراخاً\"، وعلى وزن \"فَعَلان\" إن كانت \"فَعَلَ\" دالة على الانتقال والحركة، نحو: \"فاض فَيَضاناً، جرى جَرَياناً، غلى غَلَياناً\". وكذا سُمع مجيء المصدر من \"فَعلَ\" اللازمة على وزن \"فِعالة\" إن كانت دالة على حرفة أو ولاية نحو: \"كتَبَ كِتابة، صنع صِناعة، خاط خِياطة، درس دِراسة، وَلِيَ وِلاية\". وسُمع أيضاً مجيء المصدر من \"فَعلَ\" اللازمة على وزن \"فُعَال\"إن كانت دالة على مرض، نحو: \" سعل سُعالاً، زُكِم زُكاماً، صدع صُداعاً\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 58
  },
  {
    "serial_number": "6662927",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "وفَعْلةٌ لِمَرةٍ كَخَلْسة … ........................................  الشرح (وفَعْلةٌ لِمَرةٍ كَخَلْسة) أي: أنَّ  اسم المرة من الفعل الثلاثي مطلقاً سواء كان لازماً أو متعدياً يكون على وزن \"فَعْلَة\"، نحو: \"جلس جَلْسَة، أَكَلَ أَكْلَة، قعد قَعْدة\". وقوله: (كخَلسة) من الاختلاس: وهو أخذ الشئ بسرعة، والخَلسة: المرة الواحدة من الاختلاس. لكن يشترط فيما تقدم أن لا يكون المصدر مبنياً على التاء، فإذا كان مبنياً على التاء كـ\"رحمة، نفخة\" فلا يدل على المرة، وإذا أُريدت المرة منه وُصف بالوحدة فيقال: \"رحِم رحمة واحدة، نفخ نفخة واحدة\". وأما صوغ المرة من غير الفعل الثلاثي فيكون بزيادة تاء في آخره، نحو: انطلق انطلاقة، استخرَجَ استخراجة\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 59
  },
  {
    "serial_number": "6662928",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "......................... … وَفِعْلَةٌ لِهَيئةٍ كخِلْسَة  الشرح قال: (وَفِعْلَةٌ لِهَيئةٍ كخِلْسَة) أي: أن الهيئة تصاغ من الفعل الثلاثي مطلقاً على وزن \"فِعْلَة\"، نحو: \"فأحسنوا القِتْلة، فأحسنوا الذِبْحة، جلس جِلْسَة المتكبّر، قعد قِعْدة الأعرابي، مات مِيتة حسنة\". وقوله: (كخِلْسَة) أي: كهيئة من يريد الاختلاس. ولا يُبنى من غير الثلاثي مصدر للهيئة.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 60
  },
  {
    "serial_number": "6662929",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "فصلٌ في مصادرِ غيرِ الثلاثي غيرُ الثلاثيِّ بِوَصلٍ إنْ بُدِي … ثالثَهُ فاكْسِرْ، وما بعدُ امْدُدِ والعينُ منْ معتلِّهِ حتماً حُذِفْ … وَعَوْضُ تاءٍ غالباً منها أُلِفْ  الشرح فصلٌ في مصادرِ غيرِ الثلاثي قال الناظم: (غيرُ الثلاثيِّ بِوَصلٍ إنْ بُدِي، ثالثَهُ فاكْسِرْ، وما بعدُ امْدُدِ) أي: أنّ غير الثلاثي من الأفعال إن بُدئ بهمزة وصل - ولا يكون إلا خماسياً أو سداسياً-، فقياس المصدر منه أن يُكسر حرفه الثالث، ويزاد قبل آخره ألف، نحو: \"انطلق انطِلاقاً، اقتدر اقتِداراً، استغفر استِغفاراً، استنبط استِنباطاً\". فقوله: (ثالثَهُ) مفعول به للفعل الذي بعده (فاكسر) أي: فاكسر ثالثه. وقوله: (وما بعدُ امْدُدِ) أي: وامدُد ما قبل الأخير. ولكن يشترط فيما تقدَّم أن تكون العين صحيحة، فإذا كانت معتلة فقياس المصدر منه أن تُحذف عينه، ويُعوَّض عنها تاء، ولذا قال الناظم: (والعينُ منْ معتلِّهِ حتماً حُذِفْ، وَعَوْضُ تاءٍ غالباً منها أُلِفْ) نحو: \"استبان استِبانة، استقام استِقامة، استعاذ استِعاذة\". وقوله: (وَعَوْضُ تاءٍ) أي: وتعويض تاء. وقوله: (غالباً) معناه أن هذه التاء الغالب ذكرُها، ومن غير الغالب حذفها، ويكثر ذلك - أي: الحذف - مع الإضافة، نحو: \"إِقامَ الصلاة، اِستِنار البدر\"، وأصلهما: \"إقامة الصلاة، استِنارة البدر\". وقوله: (أُلِفْ) أي: وُجِد وعُرِف.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 61
  },
  {
    "serial_number": "6662930",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "وما بُدِيْ بالتاءِ إنْ صحَّ لَزِمْ … ضَمٌّ لِما قُبَيلَ آخِرٍ عُلِمْ واكْسِرْهُ مِنْ معتلِّهِ ............. … .............................................  الشرح قال: (وما بُدِيْ بالتاءِ إنْ صحَّ لَزِمْ ضَمٌّ لِما قُبَيلَ آخِرٍ عُلِمْ) أي: أنّ كل فعل مبدوء بتاء زائدة - ولا يكون إلا خماسياً - فقياس المصدر منه أن يُضم ما قبل آخره، بشرط أن يكون صحيح اللام، ولذا قال الناظم: (إنْ صحَّ) أي: إن كان صحيح اللام، نحو: \"تدحرج تَدَحرُجاً، تعلَّم تعلُّماً، تكلم تكلُّماً، تشيطَن تشيطُناً، تكلَّفَ تكلُّفاً، تكرَّم تكرُّماً، تفهَّم تفهُماً\" وهكذا. أما إن كان معتل اللام، نحو: \"توانى، تولّى، تدلَّى\"، فقياس المصدر منه أن يُكسر ما قبل آخره، ولذا قال الناظم (واكْسِرْهُ مِنْ معتلِّهِ) فتقول: \"توانِياً، تولِّياً، تدلِّياً\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 62
  },
  {
    "serial_number": "6662931",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "............... وفَعْلَلا … مَصْدرهُ فَعْلَلَةٌ كـ\"حوْقَلا\" وفَعَّلَ المصدرُ تَفْعِيْلٌ ......... … ............................................  الشرح قال: (وفَعْلَلا مَصْدرهُ فَعْلَلَةٌ كحوْقَلا) أي: أنّ كل فعْلٍ على وزن \"فعْلَلَ\" وما أُلحق به كـ\"فوْعَلَ\" فقياس المصدر منه أن يأتي على وزن \"فعْلَلَة\"، نحو: \"دحْرجَ دحرَجَة، وسْوَس وَسْوسة، زلزل زَلْزلة، حوقل حوقلة\". وذكر بعضهم أن الفِعْلال أيضاً مصدر مقيس لـ\"فعْلَلَ\"، وهو ظاهر كلام ابن مالك في التسهيل (1) ، فتقول: \"دحرج دِحراجاً، وسوس وسْواساً، زلزل زِلْزالاً\". قال: (وفَعَّلَ المصدرُ تَفْعِيْلٌ) أي: أنَّ كل فعل على وزن \"فعَّلَ\" فقياس مصدره أن يأتي على وزن \"تفعيل\" بشرط أن يكون صحيح اللام، نحو: \"كلَّمَ تكليماً، علَّمَ تعلِيماً، عظَّمَ تعظيماً، ذكَّر تذكيراً\".",
    "foot_note": "1. أما في الألفية فذكر أنه غير مقيس حيث قال: فِعْلَالٌ أَوْ فَعْلَلَةٌ لِفَعْلَلَا \n…. وَاجْعَلْ مَقِيساً ثَانِياً لا أَوَّلا.",
    "book_id": "238",
    "new_page_number": 63
  },
  {
    "serial_number": "6662932",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "أما إن كان معتل اللام فقياس مصدره أن يأتي على وزن \"تَفْعِلة\"، ولذا قال الناظم: ............................... وذا … إِنْ يَعْتَلِلْ تَفْعِلَةً لَهُ خُذا وجاءَ تَفْعَالٌ لَدَى الكثرةِ لَهْ … لِفاعَلَ الفِعَالُ والمُفَاعَلَهْ  الشرح (وذا) أي: و\"فعَّلَ\" (إِنْ يَعْتَلِلْ) أي: إن يكن معتل اللام (تَفْعِلَةً لَهُ خُذا) أي: خُذ له مصدراً على وزن \"تَفْعِلة\"، نحو: \"زكَّى تزكِية، ربَّى تربِية، نمَّى تنمِية، وفَّى توفِية، غطَّى تغطِية\". قال: (وجاءَ تَفْعَالٌ لَدَى الكثرةِ لَهْ) أي: أن \"فعَّلَ\" ربما جاء مصدرها على وزن \"تَفعال\" للدلالة على الكثرة، نحو: \"طوَّف تَطوافاً، سيَّر تَسياراً\" (1) . قال: (لِفاعَلَ الفِعَالُ والمُفَاعَلَه) هذا الشطر من ألفية ابن مالك، والمراد أنَّ كلّ فعْلٍ على وزن \"فاعَلَ\" فقياس المصدر منه أن يأتي على وزن \"مفاعلة\" اتفاقاً، وعلى وزن \"فِعَال\" على الصحيح، نحو: \"ضارَبَ ضِراباً ومضاربة، خاصم خِصاماً ومخاصمة، قاتَل قِتالاً ومقاتلة\".",
    "foot_note": "1. فائدة: كل مصدر جاء على وزن تَفعال، فهو بفتح التاء إلا \"تِبيان\"وتِلقاء\".",
    "book_id": "238",
    "new_page_number": 64
  },
  {
    "serial_number": "6662933",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "فصلٌ في بناءِ المَفْعَلِ والمَفْعِلِ ما لمْ يَكنْ كَسْرٌ لِآتيهِ لَزِمْ … فمنهُ مَفْعَلٌ بفتحٍ قدْ وُسِمْ  الشرح فصلٌ في بناءِ المَفْعَلِ والمَفْعِلِ عقد الناظم هذا الفصل في بناء المفعَل - بفتح العين - والمفعِل - بكسر العين-، الذي يقال له: \"المصدر الميمي\" لكونه مبدوءاً بميم زائدة. قال: (ما لمْ يَكنْ كَسْرٌ لِآتيهِ لَزِمْ فمنهُ مَفْعَلٌ بفتحٍ قدْ وُسِمْ) أي: أنّ الفعل الذي لا يجب كسر عين مضارعه كـ \"ذهب\" فإنه يؤتى بالمفعَل منه بالفتح دالاً على المصدر والمكان والزمان، ويفرَّق بينها بالقرائن، فتقول: \"ذهب زيدٌ مذهَباً حسناً - أي: ذهاباً حسناً-، وهذا مذهَبُ زيد - أي: مكان ذهابه- ورمضان مذهَبُ زيد -أي: زمان ذهابه\". وقوله: (لِآتيهِ) أي: لمضارعه. وقوله: (وُسِمْ) أي: عُلِم.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 65
  },
  {
    "serial_number": "6662934",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "واكْسِرْهُ منْ واويِّ فاءٍ مطلقاً … إلاّ بمُعْتَلٍ ففتحاً أَطْلِقا  الشرح قال: (واكْسِرْهُ منْ واويِّ فاءٍ مطلقاً) أي: واكسر \"المفعِل\" من كل فعل ثلاثي واوي الفاء سواء كُسرت عين مضارعه كـ\"وَعد يعِدُ\" أوْ لا كـ\"وَقَعَ يقَعُ\"، فتقول: \"وعَد زيد موعِداً حسناً - أي: وعداً- وهذا موعِدُ زيد - أي: مكان وعده - ورمضان موعِدُ زيد -أي: زمان وعده - ومنه قوله تعالى: {قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ}. قال: (إلاّ بمُعْتَلٍ ففتحاً أَطْلِقا) أي: إلا إذا كان معتل اللام فيجاء بالمفعَل منه بالفتح مطلقاً، - أي: سواء كان واوي الفاء أو لا-، دالاً على المصدر والمكان والزمان. مثال واوي الفاء: \"وقَى\"فتقول: \"موقَى \" للمصدر والزمان والمكان، ويُفرّق بينها بالقرائن. ومثال ما ليس واوي الفاء: \"رمى\" فتقول: \"مرمى\" للمصدر والزمان والمكان، ويُفرّق بينها أيضاً بالقرائن.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 66
  },
  {
    "serial_number": "6662935",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "وغيرُ ما مَرَّ مِنَ المكسورِ … يُفْتَحُ في المصدرِ دُونَ زُورِ واكْسِرْهُ مِنْ ظرفِ الزمانِ والمكانْ … وما سِوى هذا شُذُوذهُ استبانْ  الشرح قال: (وغيرُ ما مَرَّ) أي: وغير ما تقدم من واوي الفاء، ومعتل اللام (مِنَ المكسورِ) أي: مما تُكسر عين مضارعه كـ\"ضرب يضرِبُ\" (يُفْتَحُ في المصدرِ) أي: أنه يؤتى بالمفعَل منه بالفتح دالاً على المصدر فتقول: \"ضربَ زيد مَضرَباً حسناً - أي: ضرباً -. وقوله: (دُونَ زُورِ) أي: دون كذب. قال: (واكْسِرْهُ مِنْ ظرفِ الزمانِ والمكانْ) أي: ويؤتى بالمفعِل منه بالكسر دالاً على الزمان والمكان، فتقول: \"رمضان مضرِبُ زيد -أي: زمان ضربه- وهذا مضرِبُ زيد - أي: مكان ضربه-. قال: (وما سِوى هذا شُذُوذهُ استبانْ) أي: وما خرج عن القواعد السابقة فإنه شاذ يحفظُ ولا يقاس عليه، نحو: \"عصَى\" فالقياس هو الفتح في المصدر الميمي؛ لأنه معتل اللام، فيقال: معصَيَة -بفتح الصاد -، ولكن لم يُسمع إلا الكسر شذوذاً - معصِية -. ومثل: \"سجَدَ\" فالقياس فيها هو الفتح: \"مسجَد\"؛ لكون فائها ليست واواً، ولامها ليست معتلة، ومضارعها ليس مكسور العين، ولكن لم يُسمع فيها إلا الكسر.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 67
  },
  {
    "serial_number": "6662936",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "غَيرُ الثلاثيِّ كمُفْعَلٍ يجيْ … كمُكْرَمٍ ومُدْخَلٍ ومُخْرَج  الشرح ولما انتهى الناظم من الكلام على المصدر الميمي من الفعل الثلاثي، ذكر أنه يجيء من غير الثلاثي فقال: (غَيرُ الثلاثيِّ كمُفْعَلٍ يجيْ كمُكْرَمٍ ومُدْخَلٍ ومُخْرَجِ) أي: أنه إذا أُريد المصدر الميمي من الفعل الزائد على الثلاثي فإنه يؤتى به على وزن اسم مفعوله، فـ\"أكرمَ\" - مثلاً- اسم المفعول منه \"مُكْرَم\"، و\"أدخل\" اسم المفعول منه \"مُدْخَل\"، و\"أخرج\" اسم المفعول منه \"مُخرَج\"، و\"مُكْرَمٌ\" و\"مُدخَلٌ\" و\"مُخرَجٌ\" صالحة للمصدر والمكان والزمان، ويفرق بينها بالقرائن. وقول الناظم: (كمُفْعَلٍ يجيْ) صوابه أن يقول: \"كاسم مفعوله\"؛ لأن بعضها لا تكون على وزن \"مُفْعَل\"، نحو: \"مُستخرَجٌ\" فإنها على وزن \"مُستَفْعَل\".",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 68
  },
  {
    "serial_number": "6662937",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "فصلٌ في بِناء اسمِ الأرضِ مَفْعَلَةٌ بالفتحِ معْ مَفْعَاةِ … لِكَثْرةٍ في الأرضِ قَيْساً تاتِي  الشرح فصلٌ في بِناء اسمِ الأرضِ قال الناظم: (مَفْعَلَةٌ بالفتحِ معْ مَفْعَاةِ لِكَثْرةٍ في الأرضِ قَيْساً تاتِي) أي: أنه يصاغ من اسم ما كَثُر من أسماء الأعيان اسمٌ على وزن \"مَفْعَلَة\" بالفتح، وصفاً للأرض، للدلالة على كثرة ذلك الشيء فيها، نحو: \"أرضٌ مأسَدَة\" - أي: كثيرة الأسود -، \"أرضٌ مَسْبَعَة\" - أي: كثيرة السَّبُع- \" أرضٌ مَذْأَبة\" - أي: كثيرة الذئاب -. ولا تصاغ المفْعَلَة إلا من اسم ثلاثي (1) سواء كان مجرداً كـ\"أسد\"، أو مزيداً لكن بحذف الحرف الزائد منه كـ\"أفعى\"، يقال: \"أرض مَفْعَاة\" أي: كثيرة الأفاعي. ولذا قال الناظم: (معْ مَفْعَاةِ). وقوله: (قَيْساً) أي: قياساً، فمعنى البيت: أن \"مَفْعَلَة\" تأتي وزناً قياساً لِما كثر في الأرض.",
    "foot_note": "1. قال سيبويه: \"ولم يجيئوا بنظير هذا فيما جاوز ثلاثة أحرف من نحو الضفدع والثعلب؛ كراهية أن يثقل عليهم، ولأنهم قد يستغنون بأن يقولوا: \"كثيرة الثعالب\" ونحو ذلك، وإنما اختصوا بها بنات الثلاثة لخفتها\". انظر: كتاب سيبويه (4/ 94).",
    "book_id": "238",
    "new_page_number": 69
  },
  {
    "serial_number": "6662938",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "وأَفْعَلَتْ مُفْعِلَةٌ بالضمِّ لَهْ … غيرُ الثُّلاثيْ نادراً بِهِ اجْعَلَهْ  الشرح ثم قال: (وأَفْعَلَتْ مُفْعِلَةٌ بالضمِّ لَهْ) أي: أنه قد يُصاغ من الاسم فِعْلٌ على وزن \"أفْعَلَ\" ثم يؤتى بالوصف منه على وزن \"مُفْعِلَة\" بكسر العين، وصفاً للأرض للدلالة على ما كثُر فيها، نحو: \"أَعْشَبتِ الأرض فهي مُعْشِبة\" أي: كَثُرَ عُشبُها. وقوله: (بالضمّ) أي: ضم الميم. وقوله: (لَهْ) أي: لِما كَثُر في الأرض. ثم قال: (غيرُ الثُّلاثيْ نادراً بِهِ اجْعَلَهْ) تقدم أن صوغ المفعَلة لا يكون إلا من اسم ثلاثي، وذكر الناظم هنا أنه قد تُصاغ نادراً من غير الثلاثي - أي: من اسم رباعي الأصول-، نحو: \"أرضٌ مُثعْلبة\" -أي: كثيرة الثعالب -، \"أرضٌ مُعَقْربة\" - أي: كثيرة العقارب -. وهي بفتح العين على مذهب سيبويه، وبكسرها على مذهب غيره، قال سيبويه: \"ولو قلت من بنات الأربعة على قولك: \"مأسدةٌ\" لقلت: \"مثعلَبةٌ\"؛ لأن ما جاوز الثلاثة يكون نظير المفعل منه بمنزلة المفعول وقالوا: \"أرض مثعلَبةٌ ومعقرَبةٌ\" (1) . وقال الزبيدي: \"وأرض مُعقرِبة\" بكسر الراء\" (2) . وقال الفيومي: \"وأرض \"مُعَقْرِبَةٌ\" اسم فاعل ذات عَقَارِبَ، كما يقال: مُثَعْلِبَة ومُضَفْدِعة ونحو ذلك\" (3) .",
    "foot_note": "1. انظر: كتاب سيبويه (4/ 94). \n2. انظر: تاج العروس من جواهر القاموس (3/ 425). \n3. انظر: المصباح المنير (ص: 218).",
    "book_id": "238",
    "new_page_number": 70
  },
  {
    "serial_number": "6662939",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "فصلٌ في بِناءِ الآلةِ وَلِبِنا الآلةِ مِفْعَلٌ وَرَدْ … مِفْعَالٌ اوْ مِفْعَلَةٌ لهُ اطَّردْ وشذَّ ضمٌّ في مُدُقٍّ مُنْصُلِ … .............................................  الشرح فصلٌ في بِناءِ الآلةِ عقد الناظم هذا الفصل للكلام على بناء الآلة من الفعل الذي يُعمل بها، والآلة هي الواسطة بين الفاعل والمفعول. قال: (وَلِبِنا الآلةِ مِفْعَلٌ وَرَدْ مِفْعَالٌ اوْ مِفْعَلَةٌ) أي: أن الآلة تصاغ من الفعل الذي يُعمل بها على وزن \"مِفْعَل\"، نحو: \"مِخْيَط، مِعْزَف، مِحْلَب، مِبْرَد، مِشْرَط\"، أو على وزن \"مِفْعَال\"، نحو: \"مِقْرَاض، مِفتاح، مِسْوَاك، مِسْمَار، مِسْبَار\"، أو على وزن \"مِفْعَلة\"، نحو: مِخَدَّة، مِكْنَسة، مِقْرَعة، مِسْطَرة، مِصفاة\". وقوله: (لهُ اطَّردْ) أي: أن اسم الآلة يأتي من هذه الأوزان الثلاثة قياساً مطرداً. إلا أن هناك أسماء خرجت عن هذا القياس، وأشار إليها الناظم بقوله: (وشذَّ ضمٌّ في مُدُقٍّ) وهو: الآلة التي يُدق بها الأشياء. و (مُنْصُلِ) وهو: من أسماء السيف.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 71
  },
  {
    "serial_number": "6662940",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "................................ … مُكْحُلَةٍ مُدْهُنْ ومُسْعُطْ مُنْخُل  الشرح و (مُكْحُلَةٍ) وهي: الوعاء الذي يُجعل فيه الكحل. و (مُدْهُن) وهو: الآلة التي يجعل فيها الدهن. (ومُسْعُط) وهو: الآلة التي يُسعط بها المريض - أي: يوضع بها الدواء في أنفه. و (مُنْخُلِ) وهو: الآلة التي يُنخل بها. فهذه الألفاظ لم تُسمع إلا على الشذوذ - أعني: بضم الميم والعين (1) - مع أن القياس كما تقدم هو كسر الميم دائماً، وفتح العين. ومحل لزوم الضم الشاذ عند إطلاق الاسم عليها من غير ملاحظة المعنى كأنها أسماء لآلات مخصوصة.",
    "foot_note": "1. عدا \"مُدُق\" فهو بضم الحرف الأول والثاني.",
    "book_id": "238",
    "new_page_number": 72
  },
  {
    "serial_number": "6662941",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "أما إذا أُريد بها الاشتقاق والعمل بأن لُوحِظ فيها المعنى فلا يجب فيها التزام الضم، بل يجوز أن يؤتى بهنّ على القياس، وإلى هذا أشار الناظم بقوله: وَمَنْ نَوى العملَ جازَ القَيْسُ لَهْ … والحمدُ للهِ العليِّ مُكْمِلَه ثُمَّ صلاتُهُ على مَن أرسَلَهْ … وصحبِهِ والتابعينَ الكَمَلَهْ  الشرح (وَمَنْ نَوى العملَ جازَ القَيْسُ لَهْ) أي: ومن نوى في الألفاظ السابقة الاشتقاق والشروع في العمل فإنه يجوز كسر الميم على القياس، فتقول: دقَقْتُهُ بالمِدَق، كَحَلْتُهُ بمِكْحَلتي، نخلتُهُ بمِنخَلي، وهكذا. وقوله: (القَيْسُ) أي: القياس. قال: (والحمدُ للهِ العليِّ مُكْمِلَه) أي: والحمد لله الذي أعان على إكمال هذا النظم. (ثُمَّ صلاتُهُ على مَن أرسَلَهْ) وهو نبينا محمد صلى الله عليه وسلم. (وصحبِهِ) جمع صاحب، وهو من لقي النبي صلى الله عليه وسلم مؤمناً به ومات على ذلك (والتابعينَ) جمع تابعي، وهو: من لقي صحابياً في حالة الإيمان، ومات على ذلك. (الكَمَلَهْ) أي: جمع كامل، والكامل هو الذي كَمُلَ في أخلاقه وصفاته، والكَمَلَه صفة للصحابة والتابعين.",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 73
  },
  {
    "serial_number": "6662942",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "عَدَدُهُ \"زَانَ\" وأسألُ العليْ … خاتمة حُسنى وَغَفْرَ الزَّلَل  الشرح قال: (عَدَدُهُ \"زَانَ\") أي: أن هذا النظم عدد أبياته ثمانية وخمسون بيتاً؛ لأن حرف الزاء في حساب حروف الجمَّل (1) سبعة، وحرف الألف واحد، وحرف النون خمسون. قال: (وأسألُ العليْ خاتمة حُسنى) خاتمة كل شيء آخره، والخاتمة الحسنة هي التي يوفق صاحبها للنطق بكلمة الشهادة (وَغَفْرَ الزَّلَلِ) الغَفْر بفتح الغين هو: الستر، والزلل: أي: الخطأ، والعدول عن سنن الصواب من قولك: زلت قدمه. أي: زلقت. تم هذا الشرح المبارك أسأل الله تعالى أن يجعله خالصا لوجهه الكريم، موجباً للفوز لديه، وأن يعم النفع به، وقد راعينا فيه جانب التوسط؛ لأن النظم مختصر، فالأليق بشارحه أن يحذو حذوه، ولا يتعدى ممشاه. ونسأل الله تعالى أن يوفقنا لصالح الأعمال، ويجمعنا على العلم ونشره في كل حال بمنّه وكرمه، والحمد لله وحده، وصلى الله على سيدنا محمد وآله وصحبه وسلم تسليماً كثيراً إلى يوم الدين.",
    "foot_note": "1. حسَابُ الجُمَّل طريقةٌ حسابية تُوضَع فيها أحرف الهجاء العربية مقابل الأرقام، بمعنى أن يأخذ الحرف الهجائي القيمة الحسابية للعدد الذي يقابله وفق جدول معلوم. ويقوم حساب الجُمَّل على الحروف الأبجدية، وهي: \"أبْجَدْ، هوَّز، حطِّي، كَلَمُنْ، سَعْفَص، قَرَشَتْ، ثَخَذْ، ضَظَغٌ\". ومجموعها ثمانية وعشرون حرفًا؛ تسعة منها للآحاد، وتسعة للعشرات، و تسعة للمئات، وحرف للألْف. وتستعمل الحروف الأبجدية في حساب الجمل على الوضع التالي: أ 1، ب 2، ج 3، د 4، هـ 5، و 6، ز 7، ح 8، ط 9، ي 10، ك 20، ل 30، م 40 ن،50، س 60، ع 70، ف 80، ص 90، ق 100، ر 200، ش 300، ت 400، ث 500، خ 600، ذ 700، ض 800، ظ 900، غ 1000.",
    "book_id": "238",
    "new_page_number": 74
  },
  {
    "serial_number": "6662943",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "نظم باكورة التعريف بالمهم من التصريف بسم الله الرحمن الرحيم 1 - أحمَدُ ربِّي مَن لِكَونٍ صرَّفا … صلّى وسلّم على اللَّذْ شرَّفَا 2 - محمدٍ وآلهِ وبعدُ … فهاكَ مِن تصْريفِ فِعْلٍ عِقْدُ 3 - فإنهُ فنٌ جليلُ القدرِ … وجَهْلُهُ بالمرء حقاً مُزرِ 4 - ذَكرتُ منهُ ما تَمَسُّ الحاجةُ … إليهِ والربُّ بهِ الإِعانَةُ 5 - سمَّيتُهُ باكُورَةَ التعريفِ … بِما يهُمُّنَا مِن التَصْرِيف  باب أبنية المجرَّد 6 - وَزْنُ المُجَرَّدِ لدَيْهِمْ فَعَلا … فَعِلَ مَعْ فَعُلَ ثُمَّ فَعْلَلا 7 - كَتَبَ مَعْ عَلِمَ ثُمَّ ظَرُفَا … دَحْرَجَ تمثيلٌ بِلَفٍّ قد وفا  فصلٌ في تصريفِ المضارعِ 8 - فَعُلَ بالضَمِّ اللُّزُومَ تَلْزَمُ … وَضَمُّ ما ضَارعَ مِنها يُعْلَمُ 9 - وافْتَحْ لَهُ مِنْ ذاتِ كَسْرِ الماضِيْ … تَغْلِبُ في الألوانِ والأعراضِ 10 - واكْسِرْهُ فِي \"وَرِثْ\"وَرِمْ\"وَلِيْ \"وَثِقْ\" … \"وَرِيَ مُخٌ\" و\"وَرِع\"وَفِق\"وَمِق\" 11 - وجْهانِ منْهُ في\"حَسِبْ\"نَعِمْ\" \"بَئِسْ\" … \"وَغِرْ\"وَحِرْ\"وَلِهْ\"وَهِلْ \"يَبِس\" \"يَئِسْ\" 12 - يُكْسَرُ آتِي فَعَلَ المفتوحِ في … وَاوِيِّ فا أو لازِمٍ مُضَعَّفِ 13 - أوْ يائِياً في عينِهِ أوْ لامِهْ … وَاوِيْهِما لا ريب في انْضِمامِهْ 14 - كذاكَ ما جاءَ لِبَذِّ الفَخْرِ، أوْ … مُضَعَّفٌ إنْ يَتَعَدَّى، وَرَوَوا 15 - سماعاً الكسرَ، وفي حَبَّ انفَرَدْ … وَضَمُّ لازمٍ سماعاً قدْ وَرَدْ 16 - والفتحُ في حَلْقِيِّ عَينٍ واجبُ … أوْ لامٍ انْ عُدِمَ فيهِ الجالِبُ 17 - معْ شُهْرَةٍ، وما عنِ الكُلِّ عَدَلْ … فَاكْسِرْ أوِ اضْمُمْ منهُ آتٍ كَعَتَلْ 18 - مُضَارِعُ الرُّباعِ مكسورٌ كما … زادَ على ثلاثةٍ وعَمِّما",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 75
  },
  {
    "serial_number": "6662944",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "تنبيهٌ 19 - تمْييزُكَ الياءَ مِنَ الوَاوِ بعَينْ … بوَصْلِ ذِي الرفعِ المُحرَّكِ يَبينْ 20 - وَنَقْل شَكْلِ عينهِ للفاءِ … إنْ ضُمَّ أوْ كُسِرَ ماضِيْ ذاءِ 21 - أمَّا لدَى المفتوحِ فَالمُجَانِسُ … يُنْقَلُ لا الشَّكْلُ على ما أسَّسوا  فصلٌ في المضارِعِ 22 - وَبـ\"نَأيْتُ\" يُبْدَأُ المضارعُ … وافتحْ، وفي الرُّباعِ ضَمٌّ واقعُ 23 - وما قُبَيْلَ الآخِر ِافتحْ إنْ بُدِيْ … بالتا، وغيرُهُ مَضَى بادِي بَدِيْ  فصلٌ فيما يُبنى للمَجهُولِ 24 - والفعلُ إنْ بُنيَ للمفعولِ ضُمّْ … أَوَّله، واكسِرْ بِمُعْتَلٍ كَشِمْ 25 - وما قُبَيلَ آخِرِ الماضِيْ كُسِرْ … والفتحُ فيهِ منْ مضارعٍ أُثِرْ 26 - في\"اخْتارَ\"و\"انْقادَ وشِبْهٍ اكْسِر … لِأَوَّلٍ وثالثٍ وحرِّرِ 27 - وما بُدِيْ بِهَمزةِ الوصلِ فضَمْ … ثالثِهِ كثانِ ذي التَّا مُلْتَزَمْ  بابٌ في الأمرِ 28 - والأمْرُ منْ أَفْعَلَ أَفْعِلْ واحْذِفِ … مِنْ غيرهِ حرفَ المضارعِ تَفِي 29 - وساكناً صِلْهُ بهمزٍ كُسِرا … إنْ فُتِحَ الآتِيْ كذا إِنْ كُسِرا 30 - واضْمُمْهُ ممَّا ضُمَّ أَصليّاً وشَذْ … حذفٌ لها من كُلْ ومُرْ وسَلْ وخُذْ  بابٌ في اسمِ الفاعلِ واسمِ المفعولِ 31 - فَعُلَ بالضمِّ فَعِيْلٌ فَعْلُ … لَهُ اسمُ فاعِلٍ كـ\"زيدٌ سهْلُ\" 32 - وَفَعِلٌ لِفَعِلَ الكسرِ أدِمْ … كأَفْعَلٍ فَعْلانَ إنْ كانَ لَزِمْ 33 - وفاعِلٌ لِفَعَلَ المفتوحِ والـ … ـمكسورِ إنْ عُدِّيْ، لِغَير ذا نُقِلْ 34 - زِنَةُ ما ضارعَ معْ مِيمٍ تُضَمْ … أّوَّلَهُ، واكْسِرْ لِتالي ما خَتَمْ 35 - وإنْ فتَحْتَهُ فمفْعولٌ تُرِدْ … والوزنُ ذا مِنَ الثلاثيْ مُطَّرِدْ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 76
  },
  {
    "serial_number": "6662945",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "بابٌ في المصادر 36 - مِنْ فَعُلَ المضمومِ قَيْسُ المصدرِ … فَعَالةً فُعُوْلَةً لَهُ اذْكُرِ 37 - وفَعِلَ المكسورِ لازماً فَعَلْ … قِياسُهُ فَعْلٌ لِوَاقِعٍ حصلْ 38 - وفَعَلَ المفتوحُ منهُ المصدرُ … فَعْلٌ، فُعُولٌ في لُزُومٍ يُذْكَرُ 39 - وجا فَعِيلٌ كَدَبيبٍ وفُعَالْ … مثلَ صُراخٍ فَعَلانٌ لانتقالْ 40 - وفَعْلةٌ لِمَرةٍ كَخَلْسة … وَفِعْلَةٌ لِهَيئةٍ كخِلْسَة  فصلٌ في مصادرِ غيرِ الثلاثي 41 - غيرُ الثلاثيِّ بِوَصلٍ إنْ بُدِيْ … ثالثَهُ فاكْسِرْ وما بعدُ امْدُدِ 42 - والعينُ منْ معتلِّهِ حتماً حُذِفْ … وَعَوْضُ تاءٍ غالباً منها أُلِفْ 43 - وما بُدِيْ بالتاءِ إنْ صحَّ لَزِمْ … ضَمٌّ لِما قُبَيل آخِرٍ عُلِمْ 44 - واكْسِرْهُ مِنْ معتلِّهِ، وفَعْلَلا … مَصْدرهُ فَعْلَلَةٌ كـ\"حوْقَلا\" 45 - وفَعَّلَ المصدرُ تَفْعِيْلٌ، وذا … إِنْ يَعْتَلِلْ تَفْعِلَةً لَهُ خُذا 46 - وجاءَ تَفْعَالٌ لَدَى الكثرةِ لَهْ … (لِفاعَلَ الفِعَالُ والمُفَاعَلَه)  فصلٌ في بناءِ المَفْعَلِ والمَفْعِلِ 47 - ما لمْ يَكنْ كَسْرٌ لِآتيهِ لَزِمْ … فمنهُ مَفْعَلٌ بفتحٍ قدْ وُسِمْ 48 - واكْسِرْهُ منْ واويِّ فاءٍ مطلقاً … إلاّ بمُعْتَلٍ ففتحاً أَطْلِقا 49 - وغيرُ ما مَرَّ مِنَ المكسورِ … يُفْتَحُ في المصدرِ دُونَ زُورِ 50 - واكْسِرْهُ مِنْ ظرفِ الزمانِ والمكانْ … وما سِوى هذا شُذُوذهُ استبانْ 51 - غَيرُ الثلاثيِّ كمُفْعَلٍ يجي … كمُكْرَمٍ ومُدْخَلٍ ومُخْرَجِ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 77
  },
  {
    "serial_number": "6662946",
    "category_id": "31",
    "category": "النحو والصرف",
    "book_title": "فتح الكريم اللطيف في شرح «باكورة التعريف بالمهمّ من التصريف، للشيخ محمد حماد بن أحمد الشنقيطي»",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "فصلٌ في بِناء اسمِ الأرضِ 52 - مَفْعَلَةٌ بالفتحِ معْ مَفْعَاةِ … لِكَثْرةٍ في الأرضِ قَيْساً تاتِي 53 - وأَفْعَلَتْ مُفْعِلَةٌ بالضمِّ لَهْ … غيرُ الثُّلاثيْ نادراً بِهِ اجْعَلَهْ  فصلٌ في بِناءِ الآلةِ 54 - وَلِبِنا الآلةِ مِفْعَلٌ وَرَدْ … مِفْعَالٌ اوْ مِفْعَلَةٌ لهُ اطَّردْ 55 - وشذَّ ضمٌّ في مُدُقٍّ مُنْصُلِ … مُكْحُلَةٍ مُدْهُنْ ومُسْعُطْ مُنْخُلِ 56 - وَمَنْ نَوى العملَ جازَ القَيْسُ لَهْ … والحمدُ للهِ العليِّ مُكْمِلَهْ 57 - ثُمَّ صلاتُهُ على مَن أرسَلَهْ … وصحبِهِ والتابعينَ الكَمَلَهْ 58 - عَدَدُهُ \"زَانَ\" وأسألُ العليْ … خاتمةً حُسنى وَغَفْرَ الزَّلَلِ",
    "foot_note": "None",
    "book_id": "238",
    "new_page_number": 78
  }
]