[
  {
    "text": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah\nAuthor: زين الدين أبو الفرج عبد الرحمن بن أحمد بن رجب الحنبلي\nYear: 795",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4651\nbook_title: أحكام الاختلاف في رؤية هلال ذي الحجة\nbook_link: https://shamela.ws/book/667\nbook_id: 667\nauthor_name: زين الدين أبو الفرج عبد الرحمن بن أحمد بن رجب الحنبلي\nauthor_year: 795\nnickname: أبو الفرج\nauthor_link: https://shamela.ws/author/184\nauthor_ID: 184\neditor: دراسة وتحقيق: أ. د. عبد الله بن عبد العزيز الجبرين\npublisher: دار عالم الفوائد للنشر والتوزيع، مكة المكرمة\nedition: الأولى، 1422 هـ\npages: 67\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4577267",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Fiqh Issues\nBook: Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah\nAuthor: Zayn al-Din Abd al-Rahman bin Ahmad bin Rajab bin al-Hasan, al-Salami, al-Baghdadi, then al-Dimashqi, al-Hanbali (Died 795 AH)\nStudy and Verification: Prof. Dr. Abdullah bin Abdul Aziz al-Jibreen\n[Book numbering corresponds to the printed version]\nDate of publication on Al-Shamela: 8 Dhu al-Hijjah 1431\n\nRulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah [Rule: Clouding of the Crescent Moon of Dhu al-Hijjah]\nAuthored by Al-Hafiz Abd al-Rahman bin Ahmad bin Rajab al-Hanbali 736 AH - 795 AH\nVerification and Study by Dr. Abdullah bin Abdul Aziz al-Jibreen, Associate Professor at Teachers College in Riyadh\nThe formatting and publishing of the treatise was done by: Salman bin Abdul Qadir Abu Zaid\nMay Allah forgive him, his parents, his sheikhs, and all Muslims.",
    "foot_note": "None\n\nNone",
    "book_id": "667",
    "new_page_number": 3
  },
  {
    "serial_number": "4577269",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\n«Introduction to the Verification»:\nIndeed, all praise is due to Allah, we praise Him, seek His help, ask for His forgiveness, and seek His guidance. We seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, there is none to mislead him, and whomever He misleads, there is none to guide him. I bear witness that there is no god but Allah alone, who has no partner, and I bear witness that Muhammad is His servant and Messenger, may Allah’s peace and blessings be upon him and his family.\nAs for what follows:\nThis is a treatise written by the Imam, the Hafiz, the Jurist, Abu al-Faraj Abd al-Rahman bin Rajab al-Hanbali, may Allah have mercy on him, and it relates to an important issue, which is: The disagreement in sighting the crescent moon of Dhu al-Hijjah.\nI have found three manuscripts for this treatise, which are:\nFirst: A copy in the Saudi Library in Riyadh, under number (527 / 86) within a collection, owned by Sheikh Muhammad bin Abd al-Latif (1), may Allah have mercy on him, and its number of pages is ten...",
    "foot_note": "1. (1) He is Sheikh Muhammad bin Abd al-Latif bin Abd al-Rahman bin Hasan bin Sheikh Muhammad bin Abd al-Wahhab. He was born in Riyadh and grew up in a house of knowledge and righteousness. He memorized the Quran, then began seeking knowledge with high determination and constant activity. He read under the scholars of his country until he excelled in many Sharia sciences, so much so that he was considered one of the great scholars of his time. King Abdul Aziz, may Allah have mercy on him, appointed him at the beginning of his reign as a judge for the Quway'iyah region, then transferred him as a judge for the Washm region, then sent him to Asir and Hijaz as a caller and guide, then appointed him as a judge in Riyadh. In addition to his work in the judiciary, he used to teach and issue fatwas. He died, may Allah have mercy on him, in Riyadh in 1367 AH. See his biography in 'Ulama' Najd 3/849, 850, Rawdat al-Nazirin 2/267-273, Mashahir 'Ulama' Najd wa Ghayruhum p. 146, 147, Majallat al-Arab, Year 16, p. 2, 3",
    "book_id": "667",
    "new_page_number": 4
  },
  {
    "serial_number": "4577270",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 4,
    "volume_number": 1,
    "text": "pages and a half page. Each page has nineteen lines, written in clear handwriting, and the name of its scribe was not mentioned. I have symbolized this copy with the letter \"M\".\nSecond: A copy in the King Saud University Library in Riyadh, under number (1817 / 3 M), within a collection of books belonging to Sheikh Abd al-Muhsin bin Ubayd (1), may Allah have mercy on him. He, may Allah have mercy on him, mentioned at the end of this treatise that he transcribed it in the year 1361 AH from the pen of one who protected...",
    "foot_note": "1. (1) He is Sheikh Abd al-Muhsin bin Ubayd bin Abd al-Muhsin bin Ubayd. He was born in the city of Buraydah, the capital of Qassim, in the year 1319 AH. He grew up there and sought knowledge at the hands of its scholars. He has authored works, the most famous of which is the book (Al-Hidayah wal-Irshad ila Tariq al-Huda wal-Rashad). He was famous, may Allah have mercy on him, for asceticism and piety, and he had beautiful handwriting, having written many books by his hand. He died, may Allah have mercy on him, in the year 1364 AH. See his biography written by his nephew Abd al-Muhsin bin Fahd al-Ubayd at the beginning of his book (Al-Hidayah wal-Irshad), and the book (Tadhkirat Uli al-Nuha wal-Irfan) by the brother of the biographee, Ibrahim bin Ubayd 4/212-218",
    "book_id": "667",
    "new_page_number": 5
  },
  {
    "serial_number": "4577271",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 5,
    "volume_number": 1,
    "text": "himself: Farraj bin Mansour bin Sabiq al-Najdi (1), who wrote it in the year 1228 AH (2). Its number of pages is eight pages and eight lines. Each page has twenty-seven lines. It is compared with another copy, and I have symbolized it with the letter \"A\".\nThird: A copy in the library of Sheikh Sa'd bin Abd al-Rahman bin Qasim (3), who works as a teacher at the Riyadh Scientific Institute. It is in the handwriting of his father Sheikh: Abd al-Rahman bin Muhammad bin Qasim. Its number of pages is four pages. Each page has thirty lines, and I have symbolized it with the letter \"Q\".",
    "foot_note": "1. (1) Al-Hanbali, died around the year 1246 AH. See Al-Sahab al-Wabilah p. 331. \n2. See p. (37) footnote (4) of this treatise. \n3. He is Sheikh Abd al-Rahman bin Muhammad bin Qasim al-Asimi al-Qahtani al-Najdi al-Hanbali, the author of beneficial works, the most famous of which are: (Hashiyat Kitab al-Tawhid), (Al-Ihkam Sharh Usul al-Ahkam), and (Hashiyat al-Rawd al-Murbi'). Among his great works is the collection and arrangement of the Fatwas of Sheikh al-Islam Ibn Taymiyyah. He died, may Allah have mercy on him, in the year 1392 AH. See his biography in: 'Ulama' Najd Khilal Sittat Qurun 2/414-416, the biography written by Sheikh Abdullah bin Abdul Rahman bin Jibreen at the beginning of the first part of Hashiyat al-Rawd al-Murbi' for the biographee, Al-A'lam 3/336, Majallat al-Arab, Year 16, p. 8, 9, Mashahir 'Ulama' Najd p. 432-434",
    "book_id": "667",
    "new_page_number": 6
  },
  {
    "serial_number": "4577272",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 6,
    "volume_number": 1,
    "text": "The importance of verifying this treatise is evident in the following points:\n1 - The subject for which it was written is an important subject about which people need to know the rulings at all times, due to its connection to a pillar of Islam, which is Hajj, and indeed it relates to its most important pillar, which is standing at Arafat.\n2 - The subject of the treatise and other important topics it addresses, such as the disagreement in the crescent moon of Ramadan, and the disagreement in the crescent moon of Shawwal, and others, require knowing the correct opinion regarding them, due to the frequent occurrence of disagreement in each of these issues.\n3 - This treatise highlights and addresses a legal ruling that indicates the ease and tolerance of this religion, which is the ruling on the validity of Muslims' acts of worship when they err in the time of the entry of the month of Dhu al-Hijjah, or the time of the entry or exit of the month of Ramadan.\n4 - The opinion toward which the author leaned in this important issue brings together the word of Muslims, prevents disagreement, division, and dispersion of the word, and cuts off excessive talk and gossip.",
    "foot_note": "None",
    "book_id": "667",
    "new_page_number": 7
  },
  {
    "serial_number": "4577273",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 7,
    "volume_number": 1,
    "text": "My work on this treatise was limited to the following matters:\n1 - Correcting the text, and I have relied on the correct text and indicated others in the footnote.\n2 - Studying all the topics addressed by the author by mentioning their evidence briefly, if the author did not address them. If there was a disagreement on the issue that the author did not address, I mentioned it with its evidence somewhat briefly, then mentioned the preponderant opinion and the reason for preponderance.\n3 - Documenting (Takhrij) all the Hadiths and Athar cited by the author, mentioning their chains of transmission and supporting evidence, and judging the chain of transmission of each narration in terms of strength and weakness.\nThe author did not mention a title for this treatise. Ibn Abd al-Hadi mentioned it among the works of Ibn Rajab, and named it: \"Rule: Clouding of the Crescent Moon of Dhu al-Hijjah\" (1). Perhaps he took this title from the author's saying in the introduction to this treatise: \"For an incident occurred in this year, which is the year seven hundred and eighty-four, which is that the crescent moon of Dhu al-Hijjah was clouded over, so people completed the crescent moon of Dhu al-Qa'dah...\"",
    "foot_note": "1. (1) Al-Jawhar Al-Munaddad p. 51.",
    "book_id": "667",
    "new_page_number": 8
  },
  {
    "serial_number": "4577274",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 8,
    "volume_number": 1,
    "text": "I have chosen a title for it that expresses its content and substance, which is: \"Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah\".\n\n«Biography of the Author (1)»:\nHe is the Imam, the Hafiz, the Jurist, the Preacher, the Ascetic, Abu al-Faraj Zayn al-Din Abd al-Rahman bin Ahmad bin Rajab al-Hasan bin Muhammad bin Abi al-Barakat al-Salami, al-Baghdadi then al-Dimashqi.\nHe was born in Baghdad in the year 736 AH. His father and grandfather were people of knowledge and righteousness (2). His father took great care in educating him, bringing him to circles of knowledge while he was young before...",
    "foot_note": "1. (1) See his biography in: Al-Maqsad Al-Arshad 12/81, 82, Al-Jawhar Al-Munaddad p. 46-53, Lahz Al-Alhaz p. 180-182, Al-Radd Al-Wafir p. 106, 107, Inba' Al-Ghamr 3/175, 176, Al-Durar Al-Kaminah 2/428, 429, Al-Daris 2/76, Dhayl Tadhkirat Al-Huffaz by Al-Suyuti 5/367, Tabaqat Al-Huffaz p. 540, Shadharat Al-Dhahab 6/339, 340, Al-Badr Al-Tali' 1/328, Al-Sahab Al-Wabilah p. 197, 198, Mukhtasar Tabaqat Al-Hanabila p. 71, 72, Hadiyyat Al-Arifin 10/527, Fahras Al-Faharis 2/636, 637, Al-Risalah Al-Mustatrafah p. 111, Mu'jam Al-Mu'allifin 5/118, Al-A'lam 3/295, introduction to the verification of the book Sharh Al-Ilal by the author written by Dr. Hammam Abdul Rahim. \n2. Al-Daris 2/76, Al-Maqsad Al-Arshad 2/81, Shadharat Al-Dhahab 6/339.",
    "book_id": "667",
    "new_page_number": 9
  },
  {
    "serial_number": "4577275",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 9,
    "volume_number": 1,
    "text": "the age of discernment, in the third, fourth, fifth, and sixth year of his life (1). Then his father traveled with him to Damascus, Nablus, and Jerusalem, so he heard from the scholars of these lands while he was young (2). Then he returned to Baghdad and heard Hadith there from some of its scholars (3). Then he performed Hajj with his father in the year 749 AH and heard Hadith in Mecca (4). Then he returned with him to Damascus, where he adhered to Imam Ibn al-Qayyim for more than a year until he died in the year 751 AH, and he heard from him his poem Al-Nuniyyah on creed and things from his writings and others (5). Then he traveled with his father to Egypt and heard from some of its scholars (6). Al-Hafiz Ibn Rajab listened to a lot of Hadith, read the Quran with the readings (7), and studied Fiqh under many of his sheikhs,",
    "foot_note": "1. (1) Dhayl Tabaqat Al-Hanabila by the author 1/67, and 2/176, 213, 214, 436. \n2. Dhayl Tabaqat Al-Hanabila 2/109, 365, Shadharat Al-Dhahab 6/339, Al-Durar Al-Kaminah 2/429. \n3. Dhayl Tabaqat Al-Hanabila 1/289. \n4. The previous reference 2/444. \n5. Dhayl Tabaqat Al-Hanabila 2/444, Al-Sahab Al-Wabilah p. 197. \n6. Inba' Al-Ghamr 3/175, Al-Daris 2/77, Al-Maqsad Al-Arshad 8232, and see Al-Dhayl 'ala Tabaqat Al-Hanabila 2/41, 82. \n7. Al-Durar Al-Kaminah 2/429.",
    "book_id": "667",
    "new_page_number": 10
  },
  {
    "serial_number": "4577276",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 10,
    "volume_number": 1,
    "text": "and memorized some Fiqh texts in Hanbali jurisprudence (1).\nAfter those many travels, he settled, may Allah have mercy on him, in Damascus, and devoted himself to teaching, writing, and preaching. Students flocked to his lessons, became his disciples, learned Fiqh from him, and benefited from his knowledge (2).\nAl-Hafiz Ibn Rajab excelled in many arts of Sharia sciences. He excelled in the sciences of Hadith, having vast knowledge of narrators, chains of transmission, defects, and meanings. He also excelled in Fiqh, and had beneficial sessions of reminder and preaching. He possessed a pure and clear creed, and he wrote a treatise on the preference of the knowledge of the Salaf over the knowledge of the Khalaf (3).\nMore than one scholar praised him:\nIbn Nasir al-Din said: \"The Sheikh, the Imam, the Allama, the Ascetic, the Role Model, the Blessing, the Hafiz, the Support, the Trustworthy, the Proof, the Preacher of Muslims,",
    "foot_note": "1. (1) Dhayl Tabaqat Al-Hanabila 2/432. \n2. Al-Jawhar Al-Munaddad p. 52, Al-Shadharat 6/339, 340, Al-Maqsad Al-Arshad 2/237, 265, Al-Daw' Al-Lami' 2/234, and 4/82, 137, and 6/34. \n3. See his works in this introduction p. (10).",
    "book_id": "667",
    "new_page_number": 11
  },
  {
    "serial_number": "4577277",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 11,
    "volume_number": 1,
    "text": "Benefactor of Muhaddithin... One of the ascetic Imams and worshipful scholars\" (1).\nIbn Fahd said: \"The Imam, the Hafiz, the Proof, the Fiqh Support, one of the ascetic scholars and worshipful Imams, benefactor of Muhaddithin, preacher of Muslims... He was, may Allah have mercy on him, a pious, ascetic Imam to whom hearts inclined with love, and upon whom sects agreed. His sessions of reminding were beneficial for hearts and people in general, and piercing for hearts\" (2).\nIbn al-Imad al-Hanbali said: \"The Sheikh, the Imam, the Scholar, the Allama, the Ascetic Role Model, the Blessing, the Hafiz, the Support, the Trustworthy, the Proof. His sessions of reminding were blessed and beneficial for hearts and people in general. Sects gathered around him, and hearts inclined to him with love. He has beneficial compilations and numerous works... He knew nothing of people's worldly affairs and did not frequent anyone of authority\" (3).\nIbn al-Mubarrad said: \"The Sheikh, the Imam, the Unique of Mankind, the Role Model of Huffaz, Collector of Scattered Virtues... The Ascetic Jurist, the Skilled",
    "foot_note": "1. (1) Al-Radd Al-Wafir p. 106. \n2. Lahz Al-Alhaz 5/180, 181. \n3. Shadharat Al-Dhahab 6/339.",
    "book_id": "667",
    "new_page_number": 12
  },
  {
    "serial_number": "4577278",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 12,
    "volume_number": 1,
    "text": "Usuli, the Beneficial Muhaddith\" (1).\nAl-Suyuti said: \"The Imam, the Hafiz, the Muhaddith, the Jurist, the Preacher\" (2).\nAbu al-Yaman al-Ulaymi said: \"He is the Sheikh, the Imam, the Ink (Scholar), the Sea, the Magnanimous, the Knowledgeable, the Worker, the Full Moon, the Role Model, the Pious, the Ascetic, the Hafiz, the Proof, the Trustworthy, Sheikh of Islam and Muslims, Ornament of the Nation and Religion, Preacher of Muslims, Benefactor of Muhaddithin, Beauty of Authors... He was one of the great Imams, Huffaz, scholars, ascetics, and righteous. His sessions of reminding were piercing for hearts and blessed and beneficial for people in general. Sects gathered around him, and hearts inclined to him with love. His asceticism and piety exceeded the limit. He, may Allah have mercy on him, knew nothing of people's worldly affairs and did not frequent those of authority\" (3).\nHis student Ibn al-Lahham said: \"Our Master and Sheikh, the Scholar, the Allama, the Unique, the Hafiz, Sheikh of Islam, clarifier of difficulties and explainer of ambiguities\" (4). He also said: \"The Scholar, the Hafiz,",
    "foot_note": "1. (1) Al-Jawhar Al-Munaddad p. 46, 47. \n2. Tabaqat Al-Huffaz p. 540, Dhayl Tadhkirat Al-Huffaz 5/367. \n3. Al-Sahab Al-Wabilah p. 197, 198, Mukhtasar Tabaqat Al-Hanabila p. 72. \n4. Al-Jawhar Al-Munaddad p. 47.",
    "book_id": "667",
    "new_page_number": 13
  },
  {
    "serial_number": "4577279",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 13,
    "volume_number": 1,
    "text": "Remnant of the Noble Predecessors, unique of his age, unique of his time, Sheikh of Islam\" (1).\nIbn Qadi Shuhba said: \"The Sheikh, the Imam, the Allama, the Hafiz, the Ascetic, the Pious, Sheikh of the Hanbalis and their virtuous one, the unique of Muhaddithin\" (2). He also said: \"He wrote, read, and mastered the art, and engaged in the Madhhab until he mastered it. He devoted himself to knowing the texts of Hadith, its defects, and meanings... He was withdrawn from people, not mixing nor frequenting anyone of authority\" (3).\nIbn Hajji said: \"He mastered the art - i.e., the art of Hadith - and became the most knowledgeable of the people of his time in defects and tracking chains of transmission. He did not mix with people nor frequent anyone... Most of our Hanbali companions in Damascus graduated under him\" (4).\nAl-Hafiz Ibn Hajar said: \"He was skilled in the arts of Hadith: names, narrators, defects, and chains of transmission, and knowledge of its meanings. He was",
    "foot_note": "1. (1) The previous reference. \n2. The previous reference p. 48. \n3. See introduction to the verification of Sharh Ilal al-Tirmidhi by Dr. Hammam Abdul Rahim p. 249, and Al-Jawhar Al-Munaddad p. 48. \n4. Shadharat Al-Dhahab 6/339, 340, Inba' Al-Ghamr 3/176.",
    "book_id": "667",
    "new_page_number": 14
  },
  {
    "serial_number": "4577280",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 14,
    "volume_number": 1,
    "text": "a person of worship and night prayer\" (1).\nAl-Nu'aymi said: \"The Allama Sheikh, the Ascetic Hafiz, Sheikh of the Hanbalis. He knew nothing of people's worldly affairs and did not frequent anyone of authority\" (2).\nAl-Hafiz Ibn Rajab has many beneficial writings in numerous arts. Among these writings:\n1 - Fadl 'Ilm al-Salaf 'ala al-Khalaf (3).\n2 - Sharh Sunan al-Tirmidhi (4), twenty volumes, most of which is lost (5).\n3 - Sharh Sahih al-Bukhari. He did not complete it; he reached the Book of Funerals (6). He named it: Fath al-Bari fi Sharh al-Bukhari (7).",
    "foot_note": "1. (1) Inba' Al-Ghamr 3/176. \n2. Al-Daris 2/76, 77. \n3. Al-Jawhar Al-Munaddad p. 50. \n4. Al-Durar Al-Kaminah 2/429, Lahz Al-Alhaz 5/181, Tabaqat Al-Huffaz p. 540, Al-Badr Al-Tali' 1/328. \n5. Al-Jawhar Al-Munaddad p. 49, Inba' Al-Ghamr 5/176. \n6. Dhayl Tadhkirat Al-Huffaz by Al-Suyuti 5/367, Lahz Al-Alhaz 5/181, Al-Radd Al-Wafir p. 106. \n7. Al-Maqsad Al-Arshad 2/83, Shadharat Al-Dhahab 6/339, Al-Daris 2/77.",
    "book_id": "667",
    "new_page_number": 15
  },
  {
    "serial_number": "4577281",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 15,
    "volume_number": 1,
    "text": "4 - Al-Qawa'id al-Fiqhiyyah (1). Ibn al-Mubarrad said: \"It is a beneficial book, one of the wonders of time\" (2).\n5 - Jami' al-Ulum wal-Hikam (3).\n6 - Dhayl Tabaqat al-Hanabila (4).\n7 - Al-Istighna' bi-l-Quran (5).\n8 - Al-Radd 'ala Man Ittaba'a Ghayr al-Madhahib al-Arba'ah (6).\n9 - Lata'if al-Ma'arif (7).",
    "foot_note": "1. (1) Al-Durar Al-Kaminah 2/429, Shadharat Al-Dhahab 6/339, Al-Daris 2/77, Al-Durr Al-Munaddad p. 48. \n2. Al-Jawhar Al-Munaddad p. 49. \n3. Al-Maqsad Al-Arshad 2/82, Kashf Al-Zunun 1/59, Dhayl Kashf Al-Zunun 3/335. \n4. Al-Durar Al-Kaminah 2/429, Al-Radd Al-Wafir p. 106, Lahz Al-Alhaz 5/181, Al-Badr Al-Tali' 1/328. \n5. Al-Jawhar Al-Munaddad p. 51, Hadiyyat Al-Arifin 1/527. \n6. Al-Jawhar Al-Munaddad p. 50, 51. \n7. Al-Durar Al-Kaminah 2/429, Shadharat Al-Dhahab 6/339, Al-Daris 2/77, Inba' Al-Ghamr 3/176.",
    "book_id": "667",
    "new_page_number": 16
  },
  {
    "serial_number": "4577282",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 16,
    "volume_number": 1,
    "text": "And many others. Ibn al-Mubarrad mentioned forty-six of his works, including books and treatises, then said: \"And other beneficial and useful writings, the likes of which we have not seen\" (1). Most of his works have been printed. His death, may Allah have mercy on him, was in Damascus in the year 795 AH (2).",
    "foot_note": "1. (1) Al-Jawhar Al-Munaddad p. 49-51, and see Al-Sahab Al-Wabilah p. 197, 198, Hadiyyat Al-Arifin 1/527. \n2. Al-Radd Al-Wafir p. 107, Al-Durar Al-Kaminah 2/429, Al-Maqsad Al-Arshad 2/82 and others.",
    "book_id": "667",
    "new_page_number": 17
  },
  {
    "serial_number": "4577283",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 17,
    "volume_number": 1,
    "text": "«The Verified Text»:\nIn the name of Allah, the Most Gracious, the Most Merciful\nO Lord, facilitate, help, and grant success for good, O Generous (1)\nThe Sheikh, the Imam, the Scholar, the Allama, the Unique, the Highly Understanding (2), Unique of his age, and Singular of his time: Abu al-Faraj (3) Abd al-Rahman bin the Sheikh, the Imam, Shihab al-Din Ahmad bin Rajab al-Hanbali, may Allah Almighty have mercy on him (4), said.\nPraise be to Allah, we praise Him, seek His help, and ask for His forgiveness. Whomever Allah guides, there is none to mislead him, and whomever He misleads (5), there is none to guide him. I bear witness that there is no god but Allah alone, who has no partner, and I bear witness that Muhammad is His servant and Messenger, may Allah’s peace and blessings be upon him and upon his family and companions.",
    "foot_note": "1. (1) The sentence \"O Lord, facilitate, help, and grant success for good, O Generous\" is not present in \"A\" and \"Q\". \n2. In \"A\": \"The Unique Imam, the Allama, the Magnanimous Ink, the Highly Understanding\". \n3. In \"A\": \"Al-Hafiz Abu al-Faraj Zayn al-Din\". \n4. In \"A\": \"May Allah's mercy be upon us and upon him, Amen\". \n5. The word: \"wa man yudlil\" (and whomever He misleads) is repeated in \"Q\".",
    "book_id": "667",
    "new_page_number": 18
  },
  {
    "serial_number": "4577284",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 18,
    "volume_number": 1,
    "text": "As for what follows:\nFor an incident occurred in this year, which is the year seven hundred and eighty-four, which is that the crescent moon of Dhu al-Hijjah was clouded over (1), so people completed the crescent moon of Dhu al-Qa'dah. Then people spoke of sighting the crescent moon of Dhu al-Hijjah, and people (2) testified to it whose testimony the judge did not hear. The situation continued on completing the count (3) of the month of Dhu al-Qa'dah. So some people refrained from (4) fasting the ninth (5), which is the Day of Arafah in this year. They said it is the Day of Sacrifice according to what those witnesses whose testimony was not accepted reported. It was said: That some of them sacrificed on that day. And due to that, confusion occurred for the people.",
    "foot_note": "1. (1) Meaning clouds or fog or other things prevented its sighting, from 'Ghamamtu ash-shay'a' if you covered it. See Gharib al-Hadith by Ibn al-Jawzi 2/164, Al-Nihaya fi Gharib al-Hadith 3/388, Al-Misbah al-Munir p. 454. \n2. In \"M\" and \"Q\": \"Nas\" (people). \n3. In \"A\": \"Adad\" (number), marked as a copy variant. In its margin: \"Iddah\" (count), marked as another copy variant. \n4. In \"A\": \"Fi\" (in), marked as a copy variant. In its margin: \"An\" (from), marked as another copy variant. \n5. In \"A\": \"Al-yawm at-tasi'\" (the ninth day).",
    "book_id": "667",
    "new_page_number": 19
  },
  {
    "serial_number": "4577285",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 19,
    "volume_number": 1,
    "text": "So I liked to write regarding that what Allah Almighty facilitates. And in Him (1) help is sought, and upon Him is reliance, and there is no power nor strength except in Allah, the Most High, the Great.\nWe say: This issue has two forms:\nThe first: That the doubt is based on abstract indications (2), or on the testimony of one whose testimony is not accepted (3), either because of his solitary sighting or because he is one whose word is not permissible to accept and the like.\nPeople have differed on this issue (4) into two opinions.\nThe first: That one does not fast in this case (5).\nAl-Nakha'i (6) said regarding fasting the Day of Arafah while resident: If there is disagreement about it, do not fast (7).",
    "foot_note": "1. (1) In \"A\": \"Wa billah\" (And in Allah). \n2. In \"A\": \"Muharrarah\" (edited/written), marked as a copy variant. In its margin: \"Mujarradah\" (abstract), marked as another copy variant and correction mark. \n3. In \"A\": \"Shahadatihim\" (their testimony). \n4. In \"A\": \"The Salaf differed on it\", marked as a copy variant. In its margin: \"An-Nas\" (people), marked as another copy variant. \n5. In the margin of \"A\": \"Al-Hal\" (situation), marked as another copy variant. \n6. He is the Imam, the Hafiz, the Jurist of Iraq, Ibrahim bin Yazid al-Nakha'i, one of the junior Tabi'in. He died in 96 AH. See his biography in Siyar A'lam al-Nubala' 4/520-529, Al-Bidaya wa'l-Nihaya 9/146. \n7. Narrated by Ibn Abi Shaybah in his Musannaf - as the author said - in the Book of Fasting: What they said about fasting the Day of Arafah other than at Arafah 3/97: Ishaq al-Azraq told us from Abu al-Ala from Abu Hashim from Ibrahim. Its chain of transmission is Hasan, God willing - its men are trustworthy men of the Two Sahihs, except Abu al-Ala, who is Ayyub bin Abi Miskin al-Tamimi al-Qassab, for he is truthful (Saduq) but has delusions as in Al-Taqrib p. 119.",
    "book_id": "667",
    "new_page_number": 20
  },
  {
    "serial_number": "4577286",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 20,
    "volume_number": 1,
    "text": "And from him, he said: They used to see no harm in fasting the Day of Arafah unless they feared it might be the Day of Sacrifice (1).\nIbn Abi Shaybah narrated both in his book. We will mention similar sayings from Masruq (2) and others of the Tabi'in later, God willing Almighty (3).\nThe speech of these people may be said - and Allah knows best - to be interpreted (4) as dislike (Karahah) rather than prohibition (Tahrim). Sheikh al-Islam Taqi al-Din",
    "foot_note": "1. (1) Narrated by Ibn Abi Shaybah - as the author said - in the previous place: Yazid bin Harun told us, he said: Ibn Awn told us from Ibrahim. Its chain of transmission is authentic, its men are men of the Two Sahihs. The Day of Sacrifice is the day of Eid al-Adha, also called Yawm al-Nahr, because sacrifices are slaughtered on it. The prohibition of fasting on the two Eids has been confirmed from the Prophet, peace and blessings be upon him, from the Hadith of several of his Companions, may Allah be pleased with them. It was narrated by Al-Bukhari (1990) and Muslim (1137) from the Hadith of Umar bin Al-Khattab, may Allah be pleased with him. And by Al-Bukhari (1995) and Muslim (827) from the Hadith of Abu Sa'id, may Allah be pleased with him. And by Muslim (1140) from the Hadith of Umm al-Mu'minin Aisha, may Allah be pleased with her. And by Muslim also (1138) from the Hadith of Abu Huraira, may Allah be pleased with him. And Al-Bukhari (1994) and Muslim (1139) narrated from Abdullah bin Umar, may Allah be pleased with them both, that a man came to him and said: I vowed to fast a day, and it coincided with the day of Adha or Fitr. Ibn Umar said: Allah commanded the fulfillment of vows, and the Messenger of Allah, peace and blessings be upon him, forbade fasting on this day. \n2. He is the Imam Masruq bin al-Ajda' bin Malik al-Hamdani al-Kufi, one of the senior Tabi'in. He died in 62 AH, and it is said 63 AH. See Siyar A'lam al-Nubala' 4; 63-69, Al-Ansab 5/650, 651. \n3. That is because they did not fast the Day of Arafah when there was doubt about it being the Day of Sacrifice, as will come on p. (19-21) regarding Masruq and Abu Atiyah when they entered upon Aisha on the Day of Arafah while not fasting due to doubt about it being the Day of Sacrifice. \n4. In \"A\": \"It may be said it is interpreted, and Allah knows best\".",
    "book_id": "667",
    "new_page_number": 21
  },
  {
    "serial_number": "4577287",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 21,
    "volume_number": 1,
    "text": "Bin Taymiyyah, may Allah Almighty have mercy on him, mentioned regarding fasting this day in this case (1) that it is permissible without dispute among scholars. He said: Because the principle is the non-existence of the tenth, just as if they doubted on the night of the thirtieth of Ramadan whether the crescent moon appeared or (2) did not appear? They fast that day by the agreement of the Imams. Indeed (3), the Day of Doubt in which dislike was narrated is the doubt (4) at the beginning of Ramadan (5), because the principle is the continuation of Sha'ban. End quote (6).",
    "foot_note": "1. (1) In \"A\": \"In this situation\". \n2. In \"A\": \"Or\". \n3. In \"A\": \"Fa-innama\" (So indeed). In its margin: \"Wa innama\" (And indeed), marked as another copy variant and correction. \n4. The word: \"Al-Shakk\" (the doubt) is not in \"M\", and it is correct to include it, as in Majmu' Fatawa Ibn Taymiyyah 25/204. \n5. The opinions of scholars regarding the ruling of fasting this day will be mentioned on p. (15-16). \n6. It came in Majmu' Fatawa Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, Vol 25 p. 202-204: \"Sheikh al-Islam, may Allah have mercy on him, was asked about the people of a city, some of whom saw the crescent moon of Dhu al-Hijjah, but it was not established before the ruler of the city. Do they have the right to fast the day which is apparently the ninth, even if in reality it is the tenth? He answered: Yes, they fast the ninth in the appearance known to the group, even if in reality it is the tenth. Even if that sighting were established, there is in the Sunan from Abu Huraira from the Prophet, peace and blessings be upon him, that he said: 'Your fasting is the day you fast, your breaking fast is the day you break fast, and your sacrifice is the day you sacrifice.' Narrated by Abu Dawood, Ibn Majah, and Al-Tirmidhi who authenticated it. And from Aisha, may Allah be pleased with her, that she said: The Messenger of Allah, peace and blessings be upon him, said: 'Al-Fitr is the day people break their fast, and Al-Adha is the day people sacrifice.' Narrated by Al-Tirmidhi. And on this is the practice according to all Imams of Muslims. If people stood at Arafah on the tenth day by mistake, their standing suffices them by agreement, and that day was the Day of Arafah in their right. If they stood on the eighth by mistake, there is a dispute regarding sufficiency, and the apparent view is the validity of the standing as well, which is one of the two opinions in the school of Malik and the school of Ahmad and others. Aisha, may Allah be pleased with her, said: 'Arafah is only the day people recognize.' The origin of that is that Allah, Glory be to Him, linked the ruling to the crescent moon and the month. He Almighty said: (They ask you about the new moons. Say, 'They are measurements of time for the people and for Hajj'). Al-Hilal (Crescent Moon): A name for what is announced (yustahallu bihi): i.e., announced and proclaimed. If it rises in the sky and people do not know it and announce it, it is not a crescent moon. Likewise, Al-Shahr (Month) is taken from Al-Shuhrah (Fame/Publicity). If it is not famous among people, the month has not entered. Many people err in this issue, thinking that if it rises in the sky, that night is the first of the month, whether that appeared to people and they announced it or not. It is not so; rather, its appearance to people and their announcement of it is necessary. Therefore, the Prophet, peace and blessings be upon him, said: 'Your fasting is the day you fast, your breaking fast is the day you break fast, and your sacrifice is the day you sacrifice.' Meaning this day which you know is the time of fasting, breaking fast, and sacrifice. If you do not know it, no ruling is based on it. Fasting the day about which there is doubt: Is it the ninth of Dhu al-Hijjah? Or the tenth of Dhu al-Hijjah? Is permissible without dispute among scholars, because the principle is the non-existence of the tenth, just as if they doubted on the night of the thirtieth of Ramadan whether the crescent moon appeared or did not appear? They fast that doubtful day by the agreement of the Imams. Indeed, the Day of Doubt in which dislike was narrated is the doubt at the beginning of Ramadan, because the principle is the continuation of Sha'ban. End quote.",
    "book_id": "667",
    "new_page_number": 22
  },
  {
    "serial_number": "4577288",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 23,
    "volume_number": 1,
    "text": "So either he saw Al-Nakha'i's statement and interpreted it as dislike. Therefore (1) he negated the dispute regarding its permissibility. Or he did not see it, and his intent is: To uphold the original state in both places, because the principle is the continuation of the month whose existence is certain and the non-entry of the month whose entry is doubted (2). So likewise here, if the entry of Dhu al-Hijjah (3) is doubted, the matter is built (4) on completing Dhu al-Qa'dah, because it is the principle, and the Day of Arafah is fasted on this calculation, which is the completion of the month of Dhu al-Qa'dah. However, some of the Salaf used to fast the Day of Doubt at the beginning of Ramadan as a precaution (5), and a group of them differentiated between whether the sky was",
    "foot_note": "1. (1) In \"M\": \"Fadhalika\" (So that). \n2. See the speech of Sheikh al-Islam Ibn Taymiyyah previously quoted in the previous comment. \n3. In \"A\": \"The month of Dhu al-Hijjah\". \n4. In \"M\" and \"Q\": \"Mabna\" (Building/Based). \n5. Al-Walid bin Muslim narrated from Ibn Thawban from his father from Makhul that Umar used to fast if the sun (should be moon) was clouded over on that night, and say: \"This is not advancing, but investigation.\" See Zad al-Ma'ad 2/43. The word \"Bin\" was dropped from it. Our Sheikh Abd al-Aziz bin Baz said in some of his lessons: \"Thawban is not known from his father,\" and leaned towards the correct reading being: \"Ibn Thawban from his father.\" This is correct, as in the books of narrators. This chain is weak, containing two defects: First: Ibn Thawban - who is Abd al-Rahman bin Thabit bin Thawban - there is disagreement regarding his reliability. Imam Ahmad said: \"His hadiths are Munkar (rejected).\" Salih bin Muhammad said: \"Truthful, they rejected hadiths he narrates from his father from Makhul.\" Abu Hatim said: \"Trustworthy, his mind changed at the end of his life but he is upright in hadith.\" See Tahdhib al-Tahdhib 6/150, 151. Second: Makhul did not meet Umar, so it is interrupted (Munqati'). Al-Iraqi declared it defective in Tarh al-Tathrib 4/110. Al-Shafi'i narrated in Al-Umm 2/94, and from his path Al-Daraqutni 2/170, and Al-Bayhaqi 4/212 from Al-Darawardi from Muhammad bin Abdullah bin Amr bin Uthman from Fatima bint Husayn that a man testified before Ali, may Allah be pleased with him, regarding his sighting of the crescent moon, so he fasted, and I think he ordered people to fast, and said: \"That I fast a day of Sha'ban is more beloved to me than that I break fast a day of Ramadan.\" Its chain is weak. Al-Darawardi has weakness in his narration, and Fatima bint Husayn did not meet her grandfather Ali, may Allah be pleased with him, for she is among the junior Tabi'in. See Al-Thiqat 5/300, 301, Tahdhib al-Kamal plate 1692. It is said in Al-Majmu' 6/403: \"Al-Abdari said: It is not authentic from him.\" In Al-Talkhis 2/211: \"It contains interruption.\" Al-Iraqi said in Tarh al-Tathrib 4/110: \"It is interrupted, then he only said it upon the testimony of one regarding the sighting of the crescent moon, not in cloudiness.\" See Nayl al-Awtar 4/266, 267. Abu Dawood narrated 2/298, number (1329), and from his path Al-Bayhaqi in Al-Kubra 4/210, 211 from Al-Mughira bin Farwah from Muawiyah, may Allah be pleased with him, who said: We saw the crescent moon on such and such day, and I am advancing the fast, so whoever likes to do so let him do so. Its chain is weak. \"Al-Mughira bin Farwah\" was not authenticated by anyone except Ibn Hibban. See Al-Thiqat 5/410, and Tahdhib al-Tahdhib 10/268. The hadith is in Da'if Sunan Abi Dawood. Imam Ahmad narrated - as in Zad al-Ma'ad 2/44 - from Al-Mughira, Sa'id bin Abd al-Aziz told us, he said: Makhul and Yunus bin Maysarah bin Halbas told me that Muawiyah bin Abi Sufyan used to say: \"That I fast a day of Sha'ban is more beloved to me than that I break fast a day of Ramadan.\" Its chain is weak. Sa'id bin Abd al-Aziz - who is Al-Tanukhi - became confused at the end. See Al-Kawakib al-Nayyirat p. 213-220. Al-Mughira, I did not determine who he is. Makhul did not meet Muawiyah. As for Yunus bin Maysarah, his hearing from him is disputed, but it is more likely he heard from him, for he was killed in 132 AH at the age of 120, so his age at Muawiyah's death would be 58, and he is Damascene. Yahya bin Ma'in affirmed his hearing from him. See Tahdhib al-Kamal plate 1571. Ibn al-Jawzi narrated it in Al-Ilal al-Mutanahiyah 2/38 via Makhul similarly to the first narration. It is interrupted, Makhul did not meet Muawiyah. Imam Ahmad also narrated - as in Zad al-Ma'ad 2/44 - from Zaid bin al-Hubbab, Ibn Lahi'ah informed us from Abdullah bin Hubayrah from Amr bin al-Aas that he used to fast the day doubted to be of Ramadan. Ibn Lahi'ah is disputed, and Abdullah bin Hubayrah is not mentioned to have heard from Amr, and his age at his death was close to ten years or slightly more, and he is Egyptian. See Tahdhib al-Tahdhib 6/61, 62. Imam Ahmad narrated - as in Zad al-Ma'ad 2/44 - from Abd al-Rahman bin Mahdi, Muawiyah bin Salih told us from Abu Maryam, the freed slave of Abu Huraira, who said: I heard Abu Huraira saying: That I hasten in fasting Ramadan by a day is more beloved to me than that I delay, because if I hasten I do not miss it, and if I delay I miss it. Its chain is Hasan, its men are trustworthy, except Muawiyah bin Salih - who is Al-Hadrami - for he is truthful (Saduq) having delusions, as in Al-Taqrib p. 538. Al-Khatib said - as in Al-Majmu' 6/632: \"As for what we narrated from Muawiyah bin Salih from Abu Maryam - he mentioned it - then said: A weak narration not preserved except from this aspect, and Abu Maryam is unknown, so it does not contradict what the Hafiz narrated from the companions of Abu Huraira from him.\" End quote. What he mentioned of Abu Maryam's obscurity is not accepted, for Al-Ijli authenticated him, and Imam Ahmad reported from the people of Homs that he is known among them and they praised him well. See Tarikh al-Thiqat p. 510, and Tahdhib al-Tahdhib 12/231, 232. Al-Bayhaqi narrated this Athar in his Sunan al-Kubra 4/211 via Zaid bin Habban from Muawiyah bin Salih similarly. Imam Ahmad narrated as in Zad al-Ma'ad 2/43, 44 from Isma'il bin Ibrahim, Yahya bin Abi Ishaq told us, he said: I saw the crescent moon either at noon or close to it, so some people broke fast. We came to Anas bin Malik and informed him of seeing the crescent moon and the breaking of fast by those who broke fast. He said: I am fasting tomorrow, so I disliked differing from him, so I fasted, and I am completing this day of mine until night. Its chain is Hasan, its men are trustworthy, except Yahya bin Abi Ishaq - who is Al-Hadrami - for he is truthful (Saduq) perhaps erring as in Al-Taqrib p. 587. Al-Khatib said after mentioning this Athar: \"The opponent said: Anas does not advance the fast of the group except by fasting the Day of Doubt. It is said: Anas said he did not fast it believing it obligatory, but he followed Al-Hakam bin Ayyub - who was the Emir - in abstaining during it, and perhaps the Emir resolved upon him in that so he disliked opposing him. What is preserved from Anas is that he broke fast on the Day of Doubt, as Muhammad bin Sirin narrated from him, and suffice with him in understanding, intellect, truthfulness, and virtue.\" See Al-Majmu' 6/432, 433. Abd al-Razzaq narrated in his Musannaf 4/159, number (7317), and Ibn Abi Shaybah 3/71 via Muhammad bin Sirin from Anas a narration indicating he broke fast on the Day of Doubt. Its chain is authentic, its men are men of the Two Sheikhs. Al-Tabarani narrated similarly via Muhammad bin Ka'b al-Qurazi. Al-Haythami authenticated its chain in Majma' al-Bahrain 3/103. Al-Bayhaqi narrated in his Sunan 4/209 similarly via Hammam from Qatada. Imam Ahmad narrated from Ruh bin Ubadah from Hammad bin Salamah from Hisham bin Urwa from Fatima from Asma' that she used to fast the day doubted to be of Ramadan. See Zad al-Ma'ad 2/45. \"Ruh bin Ubadah\" was misspelled as \"Ruh bin Abbad\" and our Sheikh Abd al-Aziz bin Baz corrected it in some of his lessons. The chain of this narration is connected, and its men are trustworthy, except that Hammad bin Salamah's memory changed at the end. Yahya bin Durais followed Hammad in Al-Bayhaqi's Al-Kubra 4/211 so Hammad's narration is strengthened by this follow-up. Sa'id bin Mansur narrated as in Zad al-Ma'ad 2/45 from Ya'qub bin Abd al-Rahman from Hisham bin Urwa from Fatima bint al-Mundhir who said: The crescent moon of Ramadan was never clouded over except that Asma' was advancing by a day, and ordering advancing it. Its chain is authentic, its men are men of the Two Sahihs. Fasting the Day of Doubt or the opinion of fasting it has been narrated from Salim bin Abdullah, Umar bin Abd al-Aziz, Mujahid, Tawus, Abu Uthman al-Nahdi, Mutarrif bin al-Shikhkhir, Maymun bin Mahran, Bakr bin Abdullah al-Muzani, and Ibn Abi Maryam. See Al-Mughni 4/330, Al-Majmu' 6/408, Zad al-Ma'ad 2/42, Tarh al-Tathrib 4/110, and Al-Minah al-Shafiyat 1/281. And see the following comment.",
    "book_id": "667",
    "new_page_number": 23
  },
  {
    "serial_number": "4577289",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 27,
    "volume_number": 1,
    "text": "clear or cloudy (1).",
    "foot_note": "1. (1) Abd al-Razzaq narrated in his Musannaf 4/161, number (7324) from Ma'mar from Ibn Tawus from his father from Ibn Umar, may Allah be pleased with them both, that if there were clouds he would fast in the morning, and if there were no clouds he would break fast. Its chain is authentic. Its men are men of the Two Sahihs. This Athar was also narrated by Abd al-Razzaq in the previous place, number (7323), Ahmad 2/5, Abu Dawood 2/297, number (2320), Al-Daraqutni 2/161, Al-Bayhaqi in his Sunan al-Kubra 4/204, and in Ma'rifat al-Sunan 6/233, 234, and Ibn Abd al-Barr in Al-Tamhid 14/348, 349 from paths via Ayyub via Nafi' from Ibn Umar. Its chain is authentic, its men are men of the Two Sahihs. The printed Musannaf of Abd al-Razzaq missed the phrase: \"from Nafi'\". See Al-Tamhid 14/348, and Majmu' Fatawa Ibn Taymiyyah 25/149. This chain was authenticated by Al-Nawawi in Al-Majmu' 6/405, Ibn al-Qayyim in Zad al-Ma'ad 2/43, Ahmad Shakir in his commentary on Al-Musnad 6/226, Muhammad Nasir al-Din in Al-Irwa' 4/9, and Shu'aib al-Arna'ut in his commentary on Sharh al-Sunnah 6/233. Ibn Abi Shaybah 3/71, and Hanbal in Al-Masa'il as in Zad al-Ma'ad 2/48 narrated with a Hasan chain from Ibn Umar, may Allah be pleased with them both, that he said: \"If I fasted the whole year, I would break fast on the day doubted.\" It was also narrated from him forbidding advancing before the Imam and the group. Al-Khatib al-Baghdadi said: \"This is more likely of Ibn Umar, because it is not permissible to think that he opposed the Prophet, peace and blessings be upon him, and abandoned his saying which he and others narrated regarding acting upon sighting or completing the count. So what was narrated from Ibn Umar about fasting the Day of Doubt must be interpreted as him abstaining in the morning until it became clear after the day rose whether evidence of sighting was established, so the narrator thought he was fasting. This is indicated by him not counting it and not breaking fast except with the people. Also indicating it is his saying: \"I do not advance before the Imam\", and his saying: \"If I fasted the year I would break it\" - meaning the Day of Doubt - and this is a declaration from him that he did not believe fasting in it, but rather was abstaining. End quote. See Al-Majmu' 6/442, and see Tarh al-Tathrib 4/111, and see what follows on p. () comment (). Imam Ahmad narrated in Al-Musnad 6/152, 126, and Al-Bayhaqi in Al-Kubra 4/211 from two paths via Shu'bah who said: I heard Yazid bin Khumayr from Abdullah bin Abi Musa that he asked Aisha about the day people doubt. She said: That I fast a day of Sha'ban is more beloved to me than that I break fast a day of Ramadan. Its chain is Hasan, its men are trustworthy, except Yazid bin Khumayr, for he is truthful (Saduq) as in Al-Taqrib p. 600. Sheikh Muhammad Nasir al-Din authenticated it in Al-Irwa' 4/11, and Al-Haythami said in Al-Majma' 3/148: \"Its men are men of the Sahih.\" Al-Bayhaqi also narrated it in the previous place, and in Ma'rifat al-Sunan 6/234 via Yazid bin Harun from Shu'bah with it, wording: He asked Aisha about the month if clouded. She said... and mentioned it. Then Al-Bayhaqi said: \"Yazid bin Harun's narration indicates that Aisha's school in that is like Ibn Umar's school in fasting if the month is clouded without being clear.\" The chain of this narration is Hasan like the previous one. Al-Khatib said: \"Aisha, may Allah be pleased with her, meant fasting the doubt if a just person testified to seeing the crescent moon, so its fasting is obligatory even if he testified falsely in reality. And she meant by her saying to oppose those who stipulated two witnesses for fasting Ramadan. The evidence for this is that Masruq narrated from her the prohibition of fasting the Day of Doubt.\" End quote. See Al-Majmu' 6/433.",
    "book_id": "667",
    "new_page_number": 24
  },
  {
    "serial_number": "4577290",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 29,
    "volume_number": 1,
    "text": "As is famous from Imam Ahmad (1). Precaution here: Only affects (2) the desirability of fasting the eighth and ninth of Dhu al-Hijjah with doubt as a precaution. As Ibn Sirin and others said that with the confusion of months in (3) the month of Muharram, three days are fasted from it as a precaution to achieve fasting the ninth and tenth days, and Imam Ahmad agreed (4) with him on that (5). It was narrated from Ibn Abbas, may Allah be pleased with them both, that he used to justify (6) fasting the ninth with the tenth by precaution (7) also fearing missing the fast of Ashura (8). As for precaution rising (9) to prohibiting the fast of the ninth day of Dhu al-Hijjah merely (10) for doubt, then no, because the principle",
    "foot_note": "1. (1) This opinion was narrated from Ahmad by his son Abdullah in Al-Masa'il p. 194, his son Salih in Al-Masa'il 3/202, and Abu Dawood in Al-Masa'il p. 88. The correct view in this issue is that fasting this day is not legislated, and it does not suffice if he fasted it and then it became clear it was from Ramadan, whether clouds or other things prevented sighting or not. This is the opinion of the majority of scholars from the Companions and those after them, due to what Al-Bukhari 4/119, number (1909), and Muslim 7/193 narrated from Abu Huraira raised to the Prophet: \"Fast at its sighting and break fast at its sighting, and if it is obscured from you then complete the count of Sha'ban thirty.\" It has many supporting evidences from hadiths of several Companions which would take long to mention. See Jami' al-Usul 6/268-271, 350, 351, Nasb al-Rayah 2/437-443, Zad al-Ma'ad 2/39-49, Tartib Sahih al-Jami' 1/390-392, and see Sharh al-Sunnah 6/227-235, Al-Tamhid 14/337-354, Sharh al-Zarkashi 2/550-561, Tarh al-Tathrib 4/105-114, Al-Majmu' 6/203-235, Fath al-Bari 4/221, 222, Nayl al-Awtar 4/262-267. Some Hanbali scholars wrote treatises obligating fasting the Day of Doubt, and others countered them classifying on its dislike and prohibition, among them Muhammad bin Abd al-Hadi al-Hanbali. See Hashiyat al-Rawd al-Murbi' by Sheikh Abd al-Rahman bin Qasim 3/351. Al-Nawawi mentioned in Al-Majmu' 6/408-435 a summary of a treatise authored by Qadi Abu Ya'la al-Hanbali on obligating fasting the Day of Doubt during clouds, then mentioned a summary of a treatise authored by Al-Khatib al-Baghdadi in refutation of Abu Ya'la's treatise. \n2. In \"A\" and \"M\": \"Is considered\". \n3. In \"A\": \"And in\". \n4. In \"A\": \"Wa waafaq\" (And agreed), marked as a copy variant. In its margin: \"Wa wafaqahu\" (And agreed with him), marked as another copy variant. \n5. It says in Al-Mughni 4/441: \"Ahmad said: If the beginning of the month is confused for him, he fasts three days, and he only does that to be certain of fasting the ninth and tenth.\" See Sharh al-Zarkashi 2/640, Al-Sharh Al-Kabir by Ibn Qudamah 2/5, Al-Mubdi' 3/52. I did not find who narrated this saying from Ibn Sirin. \n6. In \"A\": \"Yasilu\" (Arrives/Connects), marked as a copy variant. In its margin: \"Yu'allilu\" (Justifies), marked as another copy variant. \n7. In \"M\": \"Al-Ihtiyat\". \n8. Narrated by Ibn Abi Shaybah in his Musannaf in the Book of Fasting: On the day of Ashura, which day is it? 3/59, and Al-Tabari in Tahdhib al-Athar Part One from Musnad Umar p. 217, number (2431, 2432), and Al-Bayhaqi in Ma'rifat al-Sunan Book of Fasting: Fasting the ninth day of Muharram with the tenth 6/351, number (8972) via paths from Ibn Abi Dhi'b from Shu'bah freed slave of Ibn Abbas from Ibn Abbas that he used to fast the day of Ashura while traveling and combine the two days fearing missing it. Its chain is weak, due to Shu'bah's poor memory. See Al-Taqrib p. 226. The author indicated its weakness by starting it with the passive voice form. \n9. In \"A\": \"Nahada\" (rose), marked as a copy variant. In its margin: \"Yanhadu\" (rises), marked as another copy variant and correction mark. \n10. In \"A\": \"Bi-mujarrad\" (by mere), marked as a copy variant. In its margin: \"Li-mujarrad\" (for mere), marked as another copy variant.",
    "book_id": "667",
    "new_page_number": 25
  },
  {
    "serial_number": "4577291",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 32,
    "volume_number": 1,
    "text": "is the continuation of Dhu al-Qa'dah and the non-commencement (Istihlak) of Dhu al-Hijjah, so (1) fasting the day (2) of the ninth of it is not forbidden merely for doubt, just as fasting the thirtieth (3) of Ramadan is obligatory with doubt in the commencement of Shawwal, because the principle is its non-existence and the continuation of Ramadan.\nThe second opinion: That it is fasted and no attention is paid to the doubt. It is narrated from Aisha, may Allah be pleased with her, from various aspects. Abd al-Razzaq said in his book: Ma'mar informed us (4) from Ja'far bin Burqan from Al-Hakam or another (5) from Masruq that he and a man with him (6) entered upon Aisha on the Day of Arafah. Aisha said: O slave girl, mix Sawiq (barley mush) for them and sweeten it. Were it not that I am fasting, I would have tasted it. They said: Do you fast (7), O Mother of",
    "foot_note": "1. (1) In \"A\": \"Wa la\" (And not). \n2. The word \"Yawm\" (day) is not in \"A\". \n3. In \"A\": \"Fasting the thirtieth day\". \n4. In the margin of \"A\": \"Anba'ana\" (Informed us), marked as a copy variant. In \"M\" and \"Q\": \"Anba'a\" (Informed). \n5. Thus in \"A\" and it is correct as in Al-Musannaf. In \"M\", \"Q\" and margin of \"A\": \"Wa ghayruhu\" (And another), marked in margin of \"A\" as another copy variant. \n6. The phrase: \"Ma'ahu\" (with him) is not in \"M\". \n7. In \"A\": \"Tasumina\" (You fast), marked as a copy variant. In its margin: \"A-tasumina\" (Do you fast?), marked as another copy variant.",
    "book_id": "667",
    "new_page_number": 26
  },
  {
    "serial_number": "4577292",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 33,
    "volume_number": 1,
    "text": "Believers, and you do not know, perhaps it is the Day of Sacrifice? She said: The Day of Sacrifice is only when the Imam sacrifices and the people glorify (1), and Fitr is when the Imam breaks fast and the people glorify (2) (3).\nIt was narrated from another aspect (4). Abu Ishaq al-Sabi'i narrated from Masruq, he said: I and a friend of mine (5) entered upon Aisha on the Day of Arafah. She called for a drink for us and said: Were it not that I am fasting, I would have tasted it. We said to her: Do you fast (6) while people claim that today is the Day of Sacrifice (7)? She said: \"Al-Adha is the day people sacrifice, and Al-Fitr is the day people break fast.\" Narrated by Imam",
    "foot_note": "1. (1) In \"A\": \"Wa mu'azzam\" in both places, marked as a copy variant. In its margin \"Wa 'azzama\" in both places, marked as another copy variant. Both words have the same meaning. \n2. In \"A\": \"Wa mu'azzam\" in both places, marked as a copy variant. In its margin \"Wa 'azzama\" in both places, marked as another copy variant. Both words have the same meaning. \n3. See Musannaf Abd al-Razzaq Book of Fasting Chapter of Fasting 4/157, number (7310). The chain of this narration is weak, due to uncertainty about whom Ja'far bin Burqan narrated from, is it Al-Hakam or another. Al-Hakam is Al-Hakam bin Abdullah al-Nasri, who is Maqbul (acceptable) as in Al-Taqrib p. 174. \n4. In \"A\": \"From another aspect\", marked as a copy variant. In its margin: \"Wujuh\" (aspects), marked as another copy variant. \n5. In \"A\": \"I and a companion of mine entered upon Aisha\". \n6. In \"A\": \"Tasumina\" (You fast), marked as a copy variant. In its margin: \"A-tasumina\" (Do you fast?), marked as another copy variant. \n7. In \"A\": \"Claim today is the Sacrifice\", marked as a copy variant. In its margin: \"That today is the day of\", marked as another copy variant.",
    "book_id": "667",
    "new_page_number": 27
  },
  {
    "serial_number": "4577293",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 34,
    "volume_number": 1,
    "text": "Ahmad from Ibn Numayr (1) and Ibn Fudayl both from Al-A'mash from Abu Ishaq with it (2). His son Abdullah narrated it from him in the Book of Masa'il (3). Abdullah also narrated it (4) from his father from Ibn Mahdi from Sufyan from Abu Ishaq from Abu Atiyah and Masruq, they said (5): We entered upon Aisha on the day doubtful to be Adha (6). She said: Mix Sawiq for my two sons and sweeten it. Were it not that I am fasting, I would have tasted it. It was said to her: O Mother of Believers: People think that today is the Day of Adha. She said: \"The Day of (7) Adha is only the day the Imam sacrifices",
    "foot_note": "1. (1) The phrase: \"Ibn Numayr\" is written in \"M\" in a different script than the manuscript was written in, and written next to it in the margin: \"Blank in original\". \n2. Its chain is weak. Abu Ishaq al-Sabi'i is a Mudallis, and narrated it with 'an' (from). See Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis p. 101. As for his confusion at the end, Imam al-Dhahabi denied it and mentioned that when he grew old his memory changed slightly due to age and he did not become confused. See Siyar A'lam al-Nubala' 5/394, and Al-Mizan 3/270. Also, Muslim narrated in his Sahih via Al-A'mash from him. See Al-Kawakib al-Nayyirat p. 354. Similarly Al-A'mash, who is Sulayman bin Mihran al-Asadi, used to do Tadlis, and narrated with 'an', but Al-Hafiz mentioned him in Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis p. 67 among those whose Tadlis the Imams tolerated. \n3. I did not find this narration in the printed Masa'il of Abdullah. \n4. In \"A\": \"Wa kharaja\" (And went out), marked as a copy variant. In its margin: \"Wa kharrajahu\" (And narrated it), marked as another copy variant. \n5. In \"Q\": \"Wa qala\" (And he said). \n6. In \"Q\": \"Li-l-Adha\" (For Adha). \n7. The word: \"Yawm\" (Day) is not in \"A\".",
    "book_id": "667",
    "new_page_number": 28
  },
  {
    "serial_number": "4577294",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 35,
    "volume_number": 1,
    "text": "and the group of people\" (1). Shu'bah also narrated it from Abu Ishaq from Abu Atiyah and Masruq from Aisha similarly (2). And Dalham (3) bin Salih narrated it from Abu Ishaq from Abu Atiyah (4) and Masruq from Aisha (5). There was disagreement regarding him raising the end of the Hadith, which is: \"Adha is only the day the Imam sacrifices\". Some of his companions raised it from him making it the saying of the Prophet, peace and blessings be upon him, and some of them stopped it at Aisha, which is correct (6). Mujalid (7) also narrated it from Al-Sha'bi from Masruq from",
    "foot_note": "1. (1) The chain of this narration is weak. Abu Ishaq is a Mudallis and narrated it with 'an'. Sufyan, it is not clear to me which Sufyan he is, for both Al-Thawri and Ibn Uyaynah narrate from Abu Ishaq. Al-Thawri's narration from him was before his mentioned confusion, and Ibn Uyaynah's narration was after. See Al-Kawakib al-Nayyirat p. 349, 350, and see comment number (9) p. (20). I did not find this narration in the printed Masa'il of Abdullah. \n2. In \"M\" and \"Q\" addition: \"Anhum\" (from them). The discussion on Abu Ishaq's confusion preceded p. (20) comment (9). Also Al-Bukhari and Muslim narrated in their Sahihs from Shu'bah's narration from him. See Sahih al-Bukhari with Al-Fath 8/28, Hadith (4316), and Sahih Muslim 1/405, Hadith (576). \n3. In \"M\" and \"Q\": \"Wa rawahu lahum\" (And narrated it to them). In \"A\": \"Wa rawa Dalham\". \n4. The phrase: \"Abi Atiyah\" is not in \"A\". \n5. Narrated by Al-Tabarani in Al-Awsat via Abu Dawood Sulayman bin Musa al-Kufi from Dalham with it. See Majma' al-Bahrain 3/142, 143. Al-Haythami said in Majma' al-Zawa'id 3/190: \"Narrated by Al-Tabarani in Al-Awsat, and in its chain is Dalham bin Salih, weakened by Ibn Ma'in and Ibn Hibban.\" \n6. In \"Q\": \"Inna\" (Indeed). \n7. Al-Hafiz said in Al-Talkhis 2/256: \"Al-Daraqutni corrected stopping it in Al-Ilal.\" \n8. In \"A\": \"Aydan 'an Mujalid\" (Also from Mujalid), marked as a copy variant. In its margin: \"Aydan Mujalid\" (Also Mujalid), marked as another copy variant.",
    "book_id": "667",
    "new_page_number": 29
  },
  {
    "serial_number": "4577295",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on the Disagreement in Sighting the Crescent Moon of Dhu al-Hijjah",
    "edition": "First Edition, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 36,
    "volume_number": 1,
    "text": "Aisha similarly stopped (Mawquf) as well (1). So this Athar (2) is authentic from Aisha, may Allah be pleased with her (3), its chain is extremely sound. No opponent from the Companions is known for Aisha (4) (5). The rationale of her statement: That the principle regarding this day is that it is the Day of Arafah, because the day doubted, is it from Dhu",
    "foot_note": "1. (1) Its chain is weak. Mujalid - who is Ibn Sa'id al-Hamdani - is not strong, and changed at the end of his life as in Al-Taqrib p. 520. \n2. In \"A\": \"Fa-hadha athar\" (So this is an Athar). \n3. There is another path for the Athar not mentioned by the author, strengthening the previous paths. Abu Yusuf narrated it in Kitab al-Athar fi al-Siyam p. 179, number (818), and Al-Bayhaqi in his Sunan in the Book of Fasting Chapter (People missing the crescent) 4/252 from Imam Abu Hanifa from Ali bin al-Aqmar from Masruq, and mentioned it, adding: I said: \"Nothing prevented me from fasting except that I thought it was the Day of Sacrifice.\" This chain has slight weakness, because Imam Abu Hanifa was weakened in his narration of Hadith regarding his memory. See Tarikh Baghdad 13/323-454, Mizan al-I'tidal 4/265. This path is a witness for the previous paths, so the Athar is authentic by the sum of its paths. And Allah knows best. \n4. In \"A\": Addition: \"Fi dhalika\" (In that). \n5. Ibn Qudamah said in Al-Mughni 4/421 when discussing the issue: Whoever sees the crescent of Shawwal alone, after mentioning this Athar and the Athar of Umar, may Allah be pleased with him, when he disapproved of the man who broke fast when he and his companion saw the crescent of Shawwal, he said: \"And no opponent was known to them in their time, so it was consensus.\" See Al-Sharh Al-Kabir by Shams al-Din Ibn Qudamah 2",
    "book_id": "667",
    "new_page_number": 30
  },
  {
    "serial_number": "4577296",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 37,
    "volume_number": 1,
    "text": "Hijjah or from Dhu al-Qa'dah? The principle regarding it: It is from Dhu al-Qa'dah, so one acts upon that based on the continuity of the original state (Istishab). Another perspective: It is (1) what Aisha, may Allah be pleased with her, pointed to: That the Day of Arafah is the day the people gather (2) with the Imam for the standing (Ta'rif), and the Day of Sacrifice (Nahr) is the day the people gather with the Imam for the sacrifice. Whatever is not like that is not the Day of Arafah, nor the Day of Adha, even if it is the ninth or tenth regarding the number of days of the month. This has been narrated from the Prophet, peace and blessings be upon him (3), from multiple paths. At-Tirmidhi recorded it via the path of Al-Maqburi from Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: \"Fasting is the day the people fast, breaking the fast is the day they break the fast, and the sacrifice is the day they sacrifice.\" He said (4): Hasan Gharib (5).",
    "foot_note": "1. (1) In 'A': 'huwa' (he/it is), and a copy mark was placed on it, and in its margin: 'wa huwa' (and it is) and another copy mark was placed on it.\n2. In 'A': 'tajtami'u fihi an-nas' (the people gather in it) and a copy mark was placed on it, and in its margin: 'mujtama' ' (gathering place/time) and another copy mark was placed on it.\n3. In 'A': Addition: 'Marfu'an' (traceable to the Prophet).\n4. In 'M' and 'Q': 'Qala' (He said).\n5. At-Tirmidhi narrated it - the author said - in the Book of Fasting, Chapter: What has come regarding: Fasting is the day you fast... 3/71, number (297). And from his path, Al-Baghawi in Sharh al-Sunnah, Book of Fasting, Chapter: If the People Mistake the Crescent 6/347, 348, number (726) from the path of Ishaq bin Ja'far bin Muhammad: Abdullah bin Ja'far - who is Al-Makhrami - told me. It was said in Al-Taqrib p. 298: 'There is no harm in him' and he is one of Muslim's narrators. Except for Uthman bin Muhammad - who is Al-Akhnasi - he is truthful (Saduq) but has delusions as in Al-Taqrib p. 386. Sheikh Ahmad Shakir, may Allah have mercy on him, authenticated this chain in the treatise: 'The Beginnings of Arabic Months: Is it Legally Permissible to Establish Them by Astronomical Calculation?' p. 22. And Sheikh Muhammad Nasir al-Din declared it Hasan in Al-Irwa' number (905). Ishaq bin Ja'far was followed by Abu Sa'id, the mawla of Banu Hashim; Al-Bayhaqi narrated it in his Sunan Al-Kubra in the Book of Fasting, Chapter: The People Mistake the Crescent 4/252 from the path of Abu Sa'id, the mawla of Banu Hashim: Abdullah bin Ja'far Al-Makhrami told us with it. Abu Sa'id - who is Abd al-Rahman bin Abdullah al-Basri - is truthful but perhaps erred, and he is one of Bukhari's narrators as in Al-Taqrib p. 344. In this narration, there is no sentence 'And breaking the fast is the day you break the fast'. Al-Daraqutni narrated it 2/164, and from his path Ibn al-Arabi in Sharh al-Tirmidhi 4/222 with two chains containing Al-Waqidi, who is abandoned (Matruk) as in Al-Taqrib p. 498. Al-Daraqutni said 'Al-Waqidi is weak', but Ibn al-Arabi disagreed and considered Al-Waqidi reliable, and authenticated his narration, and Ahmad Shakir followed him in that in his treatise: 'The Beginnings of Arabic Months...' p. 22-24.",
    "book_id": "667",
    "new_page_number": 31
  },
  {
    "serial_number": "4577297",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 38,
    "volume_number": 1,
    "text": "And Abu Dawood and Ibn Majah (1) recorded it via the path of Ibn al-Munkadir",
    "foot_note": "1. (1) I did not find it in the printed Sunan Ibn Majah, nor did I find anyone who attributed it to him via the path of Ibn al-Munkadir from Abu Huraira. However, Shams al-Din bin Muflih said in Al-Furu' 3/18: 'And Abu Dawood and Ibn Majah narrated it, and the chain is good (Jayyid).' Ibn Majah did narrate this Hadith in the Book of Fasting, Chapter: What came regarding the two months of Eid 1/531, number (1660): From Muhammad bin Umar al-Muqri, Hammad bin Zayd told us, from Ayyub, from Muhammad bin Sirin, from Abu Huraira who said: The Messenger of Allah, peace and blessings be upon him, said... and he mentioned it. Its chain is weak; Muhammad bin Umar al-Muqri is unknown as in Al-Taqrib p. 498. Nevertheless, Sheikh Ahmad Shakir, may Allah have mercy on him, authenticated it in his commentary on Mukhtasar al-Sunan by Al-Mundhiri 3/213.",
    "book_id": "667",
    "new_page_number": 32
  },
  {
    "serial_number": "4577298",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 39,
    "volume_number": 1,
    "text": "from Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, similar to it without mentioning \"Fasting\" (1).",
    "foot_note": "1. (1) Abd al-Razzaq narrated it in his Musannaf in the Book of Fasting, Chapter: Fasting 4/156, Hadith (7304). Abu Dawood - as the author said - in the Book of Fasting, Chapter: If the People Mistake the Crescent 2/297, number (2324). Al-Daraqutni in his Sunan in the Book of Fasting 2/163, and in the Book of Hajj 2/224, 225. Al-Bayhaqi in his Sunan Al-Kubra in the Book of Eid Prayers, Chapter: The People Mistake the Crescent 3/317, and in Fasting, Chapter: The People Mistake the Crescent 4/251, 252, and in Hajj, Chapter: The People's Mistake regarding the Day of Arafah 5/175. And Abu Ali al-Harawi in Al-Fawa'id - as in Al-Irwa' 4/11 - via paths from Ibn al-Munkadir with it. Its men are trustworthy, but it was said: It is disconnected (Munqati'), because Ibn al-Munkadir did not hear from Abu Huraira, see Kitab al-Marasil by Ibn Abi Hatim p. 189, and Tahdhib al-Tahdhib 9/474, 475. Hafiz Ibn Hajar commented on that in Al-Talkhis al-Habir in the Book of Hajj, Chapter: Sunan of Ihram 2/256, 257, number (1051), saying after mentioning Al-Bayhaqi's statement that Ibn al-Munkadir did not hear from Aisha: 'At-Tirmidhi quoted from Al-Bukhari that he heard from her. If his hearing from her is established, his hearing from Abu Huraira is possible, for he died after her.' End quote. Al-Mizzi mentioned in Tahdhib al-Kamal plate 1276, and Al-Dhahabi in Siyar A'lam al-Nubala 5/353 among his sheikhs from whom he narrated: both Aisha and Abu Huraira, may Allah be pleased with them both. Shams al-Din bin Muflih declared the chain of Abu Dawood's narration as good (Jayyid), and his statement was previously quoted in the previous note.",
    "book_id": "667",
    "new_page_number": 33
  },
  {
    "serial_number": "4577299",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 40,
    "volume_number": 1,
    "text": "And At-Tirmidhi recorded it from the Hadith of Ibn al-Munkadir from Aisha, may Allah be pleased with her, from the Prophet, peace and blessings be upon him (1), and he said: Sahih (Authentic) (2). And it has been narrated from Aisha from other paths as Marfu' (traceable to the Prophet) (3).",
    "foot_note": "1. (1) At-Tirmidhi narrated it - as the author said - in the Book of Fasting, Chapter: What came regarding when Fitr and Adha occur 3/156, number (802). From his path, Al-Baghawi in Sharh al-Sunnah in the Book of Fasting, Chapter: If the People Mistake the Crescent 6/247, number (1725) from Yahya bin Musa, Yahya bin al-Yaman told us, from Ma'mar, from Ibn al-Munkadir with it. Its chain is weak; Yahya bin al-Yaman is 'truthful (Saduq) who errs a lot and had changed' as in Al-Taqrib p. 598. Also, he contradicted one who is more trustworthy than him, for Abd al-Razzaq narrated it in his Musannaf and Yazid bin Zurai' in Al-Harawi's Fawa'id, both from Ma'mar from Ibn al-Munkadir from Abu Huraira. See the previous note. Al-Daraqutni narrated it in Hajj 2/225 via the path of Abu Hisham al-Rifa'i: Yahya bin al-Yaman told us with it. However, he said: Abu Hashim said: 'I think he raised it (made it Marfu').' Al-Nawawi authenticated this Hadith of Aisha in Al-Majmu' 5/27, and Abdul Qadir al-Arna'ut declared it Hasan in his commentary on Zad al-Ma'ad 6/279.\n2. What is in the printed Sunan At-Tirmidhi 3/156: 'Abu Isa said: This Hadith is Hasan Gharib Sahih from this aspect.'\n3. Al-Shafi'i narrated it as Marfu' in Al-Umm in the Book of Two Eids 1/230, and in his Musnad in the Book of Two Eids also p. 73. From his path, Al-Bayhaqi in Ma'rifat al-Sunan in the Book of Eid Prayers 5/114, number (7019). Al-Shafi'i said: Ibrahim bin Muhammad informed us, he said Abdullah bin Ata bin Ibrahim, the mawla of Safiyyah bint Abdul Muttalib, told me from Urwah bin al-Zubayr from Aisha, and he mentioned it. Its chain is very weak; Ibrahim bin Muhammad - who is Ibn Abi Yahya al-Aslami - is abandoned (Matruk) as in Al-Taqrib p. 93. Al-Bayhaqi narrated in his Sunan Al-Kubra in the Book of Hajj, Chapter: The People's Mistake regarding the Day of Arafah 5/175 via the path of Muhammad bin Isma'il Abu Isma'il, Sufyan told us from Ibn al-Munkadir from Aisha, may Allah be pleased with her, who said: The Messenger of Allah, peace and blessings be upon him, said: 'Arafah is the day the Imam knows/stands, Adha is the day the Imam sacrifices, and Fitr is the day the Imam breaks fast.' Its chain is weak; Muhammad bin Isma'il - who is Al-Farisi - was mentioned by Ibn Hibban in Al-Thiqat 9/78 and he said: 'He narrates strange things (yughrib).' See Lisan al-Mizan 5/77. Nevertheless, Sheikh Ahmad Shakir authenticated it in his treatise: 'The Beginnings of Arabic Months...' p. 26. Al-Tabarani narrated it in Al-Awsat via the path of Yazid bin Iyad from Abu Bakr bin Muhammad bin Amr bin Hazm from Amrah from Aisha. See Majma' al-Bahrain 3/292. In Majma' al-Zawa'id 4/21 it says: 'It contains Yazid bin Iyad and he is abandoned.'",
    "book_id": "667",
    "new_page_number": 34
  },
  {
    "serial_number": "4577300",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 41,
    "volume_number": 1,
    "text": "And it was narrated from Abu Huraira as his own statement (Mawquf) (1). And Al-Saffah bin Matar narrated from Abdul Aziz bin Abdullah bin Khalid bin Asid: That the Prophet, peace and blessings be upon him, said: \"The Day of Arafah is the day the people know/gather\" - a Hasan Mursal (2), which Imam Ahmad used as proof.",
    "foot_note": "1. (1) Al-Bayhaqi said after narrating the previous Hadith: 'Ibn Ulayyah and Abdul Wahhab al-Thaqafi narrated it from Ayyub from Muhammad bin al-Munkadir from Abu Huraira as Mawquf.'\n2. Al-Daraqutni narrated it in Hajj 2/223, 224, and from his path Al-Bayhaqi in Al-Sunan Al-Kubra in Hajj, Chapter: The People's Mistake regarding the Day of Arafah 5/174 via the path of Hushaym from Al-Awwam bin Hawshab from Al-Saffah bin Matar with it. Its chain is weak. It has three defects: First: It is Mursal - as the author mentioned - for Abdul Aziz bin Abdullah bin Khalid is a Tabi'i who did not meet the time of the Prophet, peace and blessings be upon him. See Al-Marasil by Abu Dawood p. 139, and Al-Taqrib p. 357. Second: Al-Saffah bin Matar was not documented as trustworthy by anyone except Ibn Hibban in Kitab al-Thiqat 6/435, and in Al-Taqrib p. 243 he is said to be: 'Maqbul' (Acceptable). Third: Hushaym - who is Ibn Bashir - is a Mudallis (one who conceals defects in the chain), and he used 'an' (from). See Ta'rif Ahl al-Taqdis by Ibn Hajar p. 115. Al-Bayhaqi said: 'This is a good (Jayyid) Mursal.' It has a supporting narration (Shahid) which is not to be rejoiced at; Al-Daraqutni narrated it in the previous location via Al-Waqidi from Ibn Abi Sabrah from Ya'qub bin Zaid bin Talha al-Taymi from his father from the Prophet, peace and blessings be upon him, who said: 'Arafah is the day the people know/stand.' Al-Waqidi is abandoned as in Al-Taqrib p. 498, and Zaid bin Talha is a Tabi'i, see Al-Tarikh al-Kabir 3/398 and Al-Thiqat 4/249, so it is Mursal. In general, this Hadith is Sahih from the Hadith of Abu Huraira with the wording: 'Fasting is the day the people fast, and Fitr is the day they break fast, and Adha is the day they sacrifice.' A group of scholars authenticated or declared it Hasan, including Al-Nawawi in Al-Majmu' 5/27, Al-Subki in the treatise Al-Ilm al-Manshur fi Ithbat al-Shuhur p. 18, Al-Suyuti in Al-Jami' al-Saghir (Fayd al-Qadir 4/441), Al-Azim Abadi in Al-Ta'liq al-Mughni 2/224, Ahmad Shakir in his treatise: 'The Beginnings of Arabic Months...' p. 24, Muhammad Nasir al-Din in Al-Irwa 4/11, Shu'aib al-Arna'ut in his commentary on Sharh al-Sunnah 6/248, and Abdul Qadir al-Arna'ut in his commentary on Jami' al-Usul 6/278. Interpretation of this Hadith differed: 'Some scholars interpreted this Hadith saying: The meaning of this is: That Fasting and Fitr are with the community and the majority of people.' Imam Al-Khattabi said in Ma'alim al-Sunan 3/213: 'The meaning of the Hadith is that error is lifted from the people in matters subject to Ijtihad. If a people strove (did Ijtihad) and did not see the crescent until after the thirtieth, so they did not break fast until they completed the number, then it was established among them that the month was twenty-nine, their fasting and breaking fast is valid, and there is no sin or hardship upon them. Likewise in Hajj, if they mistook the day of Arafah, there is no repetition upon them, and their Adha suffices them as well. This is only a lightening from Allah Almighty and kindness to His servants. If they were tasked to repeat if they mistook the number, they would not be safe from mistaking a second time, nor safe from error a third and fourth time, for whatever is subject to Ijtihad, error is not secure in it.' The majority of scholars agreed with Imam Al-Khattabi on this interpretation. See Nayl al-Awtar 3/383. Qadi Al-Subki opposed them in interpreting this Hadith in Kitab al-Ilm al-Manshur p. 18, saying after mentioning this Hadith: 'And its meaning, and Allah knows best, is if the people gather on that, they are not tasked with what might be in the reality of the matter which they did not know.' And he said on p. 51 of this book after mentioning the Hanafi view: That if they counted Sha'ban as thirty based on a sighting, then fasted twenty-eight and saw the crescent, they make up a day, because they erred. He said: 'So that from the Hanafis indicates that Fasting is not the day you fast by mistake, and Fitr is not the day you break fast by mistake. Rather, the meaning of the Hadith is: The day you fast the correct Fast and break the correct Fitr.' The closest interpretation of this Hadith is what Imam At-Tirmidhi quoted from some scholars, for it aligns with the statement of Mother of the Believers Aisha, may Allah be pleased with her, and no opponent from the Prophet's companions is known for her. See previous p. (21) note (12), and see the following note.",
    "book_id": "667",
    "new_page_number": 35
  },
  {
    "serial_number": "4577301",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 43,
    "volume_number": 1,
    "text": "that if the people stand on the Day of Arafah by mistake, their Hajj suffices them (1). And Mujahid said: Al-Adha is the day they sacrifice, and Al-Fitr",
    "foot_note": "1. (1) See Masa'il Abdullah bin Ahmad from his father: Book of Rituals p. 240, and see Ma'rifat al-Sunan: Book of Rituals 7/376. Al-Nawawi said in Al-Majmu' 8/292, 293: 'If they erred in time by two days, such that they stood on the seventh or eleventh, it does not suffice them without dispute... And they agreed that if they erred and stood on the tenth, and they are a large group as usual, it suffices them. If they stood on the eighth, the correct view according to us is that it does not suffice them, and Abu Hanifa and his companions said this. The correct view of the Madhhab of Malik and Ahmad is that it does not suffice them.' Ibn Abd al-Barr also narrated consensus that if the group stood on the tenth day, it suffices them in Al-Tamhid 14/356, and Sheikh al-Islam Ibn Taymiyyah as in Majmu' al-Fatawa 25/202, 203, and Sheikh Abdul Rahman bin Qasim in his footnote on Al-Rawd al-Murbi' 4/209. The speech of Sheikh al-Islam on this issue has been previously quoted p. (14) note (11).",
    "book_id": "667",
    "new_page_number": 36
  },
  {
    "serial_number": "4577302",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 44,
    "volume_number": 1,
    "text": "is the day they break the fast, and Jumu'ah is the day they gather. Abdullah, the son of Imam Ahmad, recorded it (1). The Second Scenario: That someone testifies to seeing the crescent of Dhu al-Hijjah (2), by whom the month is established, but the ruler does not accept him, either for an apparent excuse or due to negligence in his regard. In this scenario, is it said: Must the witnesses act according to their sighting, and those whom they inform who trust their word, or not? It may be said: This issue is based on the famous disagreement regarding the issue of the one alone in seeing the crescent of Shawwal: Does he break the fast acting upon his sighting, or does he not break the fast except with the people? Regarding that (3), there are two famous opinions among the scholars:",
    "foot_note": "1. (1) I did not find it.\n2. In 'A': 'That someone testifies to seeing the crescent', and a copy mark was placed on it, and in its margin: 'the crescent of Dhu al-Hijjah' and another copy mark was placed on it.\n3. Meaning regarding breaking the fast of the one who saw the crescent of Shawwal alone.",
    "book_id": "667",
    "new_page_number": 37
  },
  {
    "serial_number": "4577303",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 45,
    "volume_number": 1,
    "text": "The first: He does not break the fast. This is the view of Ata (1), Al-Thawri (2), Al-Layth (3), Abu Hanifa (4), Ahmad (5), and Ishaq (6). And the like was narrated from Umar bin Al-Khattab, may Allah be pleased with him (7).",
    "foot_note": "1. (1) Abd al-Razzaq narrated in his Musannaf in the Book of Fasting, Chapter: How many witnesses are permitted for seeing the crescent 4/167, number (7343) from Ibn Jurayj who said: I said to Ata: What do you think if a man saw the crescent of Ramadan a night before the people, should he fast before them and break fast before them? He said: No, unless the people see it; I fear it might have been confused for him until they are two [witnesses]. He said: I said: No, even if he saw it and travelled with it for an hour? He said: Even so, until they are two. Its chain is authentic, its men are the men of the two Sahihs.\n2. Al-Tamhid 14/335.\n3. Al-Tamhid 14/355, Tafsir Al-Qurtubi 2/294, Al-Mughni 4/420, Al-Sharh Al-Kabir by Ibn Qudamah 2/8.\n4. Tabyin al-Haqa'iq 1/318, Fath al-Qadir 2/325, Al-Bahr al-Ra'iq 2/286.\n5. Ibn Hani' narrated this view from him in his Masa'il 1/129, and another narration was reported from him that he breaks the fast. See Majmu' Fatawa Ibn Taymiyyah 25/114, and Al-Furu' 3/19, 20.\n6. Tafsir Al-Qurtubi 2/294.\n7. Abd al-Razzaq narrated in his Musannaf in the Book of Fasting, Chapter: The people woke up fasting and the crescent had been seen 4/165, number (7338) from Ma'mar from Ayyub from Abu Qilabah that two men saw the crescent while traveling, so they hurried until they arrived in Medina in the forenoon. They informed Umar bin Al-Khattab of that. Umar said to one of them: Are you fasting? He said: Yes. He said: Why? He said: Because I disliked that the people be fasting while I am breaking fast, so I disliked differing from them. He said to the other: And you? He said: I woke up breaking fast. He said: Why? He said: Because I saw the crescent so I disliked fasting. He said to the one who broke fast: Were it not for this one - meaning the one who fasted - we would have rejected your testimony and hurt your head. Then he ordered the people to break fast, and went out. Its men are trustworthy, but it is Mursal; Abu Qilabah did not meet the time of Umar bin Al-Khattab, may Allah be pleased with him. See Al-Marasil by Ibn Abi Hatim p. 109, 110. Sa'id narrated it - as in Al-Mughni 4/420, 421 - from Ibn Ulayyah from Ayyub from Abu Raja' from Abu Qilabah. Ibn Abi Shaybah narrated in the Book of Fasting: What they said regarding the day in which fasting is doubted 3/73 from Yazid bin Harun from Asim from Abu Uthman who said: Umar said: Let one of you beware of fasting a day of Sha'ban or breaking fast a day of Ramadan. He said: And to advance before the people, 'So let him break fast when the people break fast.' Its chain is authentic, its men are the men of the two Sahihs. It is possible that his saying: 'So let him break fast when the people break fast' is a prohibition for the one who fasted Ramadan to break fast on the thirtieth day before the people, and it is possible that it is a prohibition against fasting the Day of Doubt at the beginning of the month of Ramadan, and he might have intended prohibition of both matters. The evidences for this opinion will come p. (32, 33).",
    "book_id": "667",
    "new_page_number": 38
  },
  {
    "serial_number": "4577304",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 46,
    "volume_number": 1,
    "text": "The second: He breaks the fast. This is the view of Al-Hasan bin Salih (1) and Al-Shafi'i (2),",
    "foot_note": "1. (1) Al-Tamhid 14/355.\n2. Imam Al-Shafi'i said in Al-Umm regarding Eid prayers 1/230: 'If two witnesses or more testified but were not known to be just or were impugned, they may break the fast, and I prefer for them to pray the Eid prayer for themselves in congregation or individually, concealing it. I forbade them from praying it openly, I only commanded them to pray it concealing it and forbade them from praying it openly lest it be denounced upon them and the people of division covet separating from the general Muslims.' Then he said after it: 'Likewise, if one person testified and was not accepted, he has no choice but to break the fast and hide his breaking of fast, lest anyone thinks ill of him. He prays Eid for himself, then testifies later if he wishes Eid with the congregation, so it would be a voluntary prayer, better for him.'",
    "book_id": "667",
    "new_page_number": 39
  },
  {
    "serial_number": "4577305",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 47,
    "volume_number": 1,
    "text": "and Abu Thawr (1), and a group of our companions (2). And both (3) opinions were narrated from Malik (4). A group of our companions (5) said: This issue is built upon this principle. It is the correct view of the School (Madhhab). So, according to the view of one who says: The one alone in sighting the crescent of Shawwal does not break the fast, but fasts and does not break it except with the people; he says: It is recommended to fast the Day of Arafah for the witness whose testimony regarding the crescent of Dhu al-Hijjah was not accepted, because this is (6) the Day of Arafah regarding",
    "foot_note": "1. (1) The phrase: 'and Abu Thawr' is not present in 'M' and 'Q'. Ibn Rushd narrated this view from Abu Thawr in Bidayat al-Mujtahid 1/285.\n2. Among them Abu Bakr and Ibn Aqil. See Al-Furu' 3/19, Al-Mubdi' 3/10, Al-Insaf 3/278, and Al-Iqna' (printed with its explanation Kashshaf al-Qina' 2/306).\n3. In 'A': 'ka-l-qawlayn' (like the two opinions) and a copy mark was placed on it, and in its margin: 'kila al-qawlayn' (both opinions) and another copy mark was placed on it.\n4. Imam Malik said in Al-Muwatta 1/287: 'Whoever sees the crescent of Shawwal alone does not break the fast, because people are accused that someone not trusted among them might break the fast, and those say if it appears upon them: We saw the crescent.' It was narrated from him that if he breaks the fast, he owes expiation along with making up. See Al-Tamhid 14/356, Bidayat al-Mujtahid 1/285, 286, and see Mawahib al-Jalil 2/290.\n5. Among them Sheikh al-Islam Ibn Taymiyyah, and we will mention his words on that soon, Allah willing.\n6. The pronoun 'huwa' (is) is not present in 'A'.",
    "book_id": "667",
    "new_page_number": 40
  },
  {
    "serial_number": "4577306",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 48,
    "volume_number": 1,
    "text": "the people, and he is one of them. And whoever said regarding the witness (1) of the crescent of Shawwal that he breaks the fast secretly (2), said here: He breaks the fast and does not fast, because it is the day of Eid in his regard. He said: But he does not have the right to sacrifice before the people on this day, just as he does not stand alone at Arafah without the people based on this sighting, because those who commanded breaking the fast at the end of Ramadan only commanded it secretly and did not allow him to reveal it. Being alone in sacrificing and standing [at Arafah] involves opposing the community, similar to revealing the breaking of the fast. This is what Sheikh Taqi al-Din Abu al-Abbas Ibn Taymiyyah, may Allah have mercy on him, mentioned (3),",
    "foot_note": "1. (1) In 'A' 'bi-l-shahid' (regarding the witness), and upon it a copy mark. And in its margin: 'fi al-shahid' (regarding the witness) and another copy mark was placed on it.\n2. They are all those who said his breaking of fast is obligatory or permissible. Al-Majd Ibn Taymiyyah and his grandson Sheikh al-Islam Ibn Taymiyyah narrated consensus that it is not permissible to reveal the breaking of the fast. See Majmu' Fatawa Ibn Taymiyyah 25/204, Al-Furu' 2/20, and Al-Insaf 3/278.\n3. Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said as in Majmu' al-Fatawa 25/204-206 after his speech which was previously quoted p. (14) note (11) the text of which is: 'What is confusing in this chapter are two issues: First: If he sees the crescent of Shawwal alone or a group informs him whose truthfulness he knows: Does he break the fast? Or not? Second: If he sees the crescent of Dhu al-Hijjah or a group informs him whose truthfulness he knows, is the Day of Arafah and the Day of Sacrifice in his regard the ninth and tenth according to this sighting which did not become famous among the people? Or is it the ninth and tenth which became famous among the people? As for the first issue: The one alone in seeing the crescent of Shawwal does not break the fast openly by agreement of scholars, unless he has an excuse permitting breaking fast like illness and travel. Does he break the fast secretly? There are two opinions for scholars, the more correct of which is he does not break the fast secretly... The reason for that is that Fitr (breaking fast) is the day people break fast, which is the day of Eid. That which the lone sighter fasted is not the day of Eid which the Prophet, peace and blessings be upon him, forbade fasting, for he forbade fasting the day of Fitr and the day of Nahr, and said: \"As for one of them, it is the day of your breaking fast from your fasting, and as for the other, it is the day you eat from your rites.\" So what was forbidden to fast is the day the Muslims break fast, and the Muslims perform rituals in. As for fasting the ninth day regarding one who saw the crescent, or two trustworthy people informed him that they saw the crescent, and it is the tenth according to that, but that was not established among the general public, and it is the tenth according to the hidden sighting, this is derived from what preceded. So whoever commanded him to fast the thirtieth day which is, according to the hidden sighting, from Shawwal, and did not command him to break fast secretly, permitted him to fast this day, and recommended it; because this is the Day of Arafah, just as that is from Ramadan, and this is the correct view indicated by the Sunnah and consideration. And whoever commanded him to break fast secretly due to his sighting forbade him from fasting this day according to this speaker, like the crescent of Shawwal which he saw alone.' End quote.",
    "book_id": "667",
    "new_page_number": 41
  },
  {
    "serial_number": "4577307",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 49,
    "volume_number": 1,
    "text": "although it has been narrated from Salim bin Abdullah bin Umar (1), and Abd al-Razzaq recorded it from Sufyan al-Thawri, from Umar bin Muhammad who said: A group testified that they saw the crescent of Dhu al-Hijjah, so Salim went with them to",
    "foot_note": "1. (1) He is Salim bin Abdullah bin Umar bin Al-Khattab Al-Qurashi Al-Adawi, one of the masters of the Tabi'in, and one of the seven jurists of Medina. His death was in the year 106 AH. See his biography in Al-Tabaqat Al-Kubra 5/195-201, Hilyat al-Awliya 2/193-198.",
    "book_id": "667",
    "new_page_number": 42
  },
  {
    "serial_number": "4577308",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 50,
    "volume_number": 1,
    "text": "the Governor of the Hajj (1), who was Ibn Hisham, but he refused to accept their testimony. So Salim stood at Arafah at the time of their testimony, then when it was the second day, he stood with (2) the people (3). But the Sacrifice is not like the Standing, because there is no necessity to advance it due to the extension of its time, unlike the Standing. It may be said: Fasting this day for the witness, or the one he informed, is built upon the difference of perspectives regarding the command (4) for the one who",
    "foot_note": "1. (1) In 'A': 'Al-Hajj' and a copy mark was placed on it, and in its margin: 'Al-Hujjaj' (the pilgrims) and another copy mark was placed on it.\n2. 'Ma'a' (with) was dropped from 'M'.\n3. His chain to Salim bin Abdullah, may Allah have mercy on him, is authentic; its men are the men of the two Sahihs. Umar bin Muhammad is Umar bin Muhammad bin Zaid bin Abdullah bin Umar bin Al-Khattab. See Tahdhib al-Kamal plate (1023). Shams al-Din bin Muflih, may Allah have mercy on him, agreed with Salim, may Allah have mercy on him, on this issue, where he said in Al-Furu' 3/535: 'It is directed to stand twice if some of them stood, especially the one who saw it.' See Al-Mubdi' 3/269, 70. It was mentioned in Al-Majmu' 8/292 that the Shafi'i school holds: That whoever saw the crescent of Dhu al-Hijjah and his testimony was not accepted must stand on the ninth day according to him, whether he is one or a group. And that if he stands on the tenth day only with the congregation, his standing is not valid according to all Shafi'is.\n4. The phrase: 'fi al-amr' (regarding the command) is not present in 'M' and 'Q'.",
    "book_id": "667",
    "new_page_number": 43
  },
  {
    "serial_number": "4577309",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 51,
    "volume_number": 1,
    "text": "was alone in sighting the crescent of Fitr (Shawwal) to fast with the people (1). Regarding that, there are perspectives: First: Fear of being accused regarding breaking the fast. Second: Fear of disagreement and scattering the word, and that every person assigns himself the rank of a judge, and the rules of Sharia refuse that. This is what Sheikh Majd al-Din Ibn Taymiyyah (2) and others mentioned. Third (3): That the quorum of testimony was not completed by his sighting alone. This is the perspective of Sheikh Muwaffaq al-Din Ibn Qudamah",
    "foot_note": "1. (1) Meaning that the ruling on fasting the Day of Arafah for the one who saw the crescent and his testimony was rejected, or the one informed of its sighting by someone he trusts whose testimony was rejected, depends on the applicability of all or some of the reasons given by those who commanded the one alone in sighting the crescent of Shawwal to fast, to this issue, or their non-applicability to it.\n2. He is the Imam, Muhaddith, Faqih Abu al-Barakat Abd al-Salam bin Abdullah bin Taymiyyah, Al-Hanbali, Al-Harrani, grandfather of Sheikh al-Islam Ibn Taymiyyah. He has many works including Al-Muntaqa in Hadith, Al-Musawwadah in Usul al-Fiqh, and Al-Muharrar in Fiqh. He died in 652 AH. See his biography in Dhail Tabaqat al-Hanabilah by Ibn Rajab 2/249-254, Siyar A'lam al-Nubala 23/291-293. The reason the author referred to was mentioned by Al-Majd in his commentary on Al-Hidayah, which is not printed. See Al-Furu' 3/20, Al-Insaf 3/279. Imam Al-Sha'bi preceded Al-Majd in this reasoning as will come p. (35) note (2).\n3. In 'A': 'Al-Thalith' (The third).",
    "book_id": "667",
    "new_page_number": 44
  },
  {
    "serial_number": "4577310",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 52,
    "volume_number": 1,
    "text": "Al-Maqdisi (1) from our companions (2). Fourth: What Sheikh Taqi al-Din Ibn Taymiyyah, may Allah have mercy on him, mentioned: That the Month (Shahr) is what is famous (Ishtahara) and apparent, and the Crescent (Hilal) is what is raised (Istuhilla) voices with and announced, not what (3) was in the sky without sighting or fame. For the name of the Month and the Crescent does not apply without the fame of its sighting and the arrangement of breaking fast and rituals upon it. So whatever (4) is not like that is neither a Crescent nor a Month (5).",
    "foot_note": "1. (1) He is Imam Muwaffaq al-Din Abu Muhammad Abdullah bin Ahmad bin Muhammad bin Qudamah Al-Maqdisi, Al-Hanbali, author of famous works in Fiqh, namely Al-Mughni, Al-Kafi, Al-Muqni', and Al-Umdah. His death was in 620 AH. See his biography in Al-Taqyid by Ibn Nuqtah 2/78, Dhail Tabaqat al-Hanabilah by Ibn Rajab 2/133-149. The reasoning the author referred to was mentioned by Al-Muwaffaq in Al-Mughni 4/421.\n2. The phrase: 'from our companions' is not present in 'M' and 'Q'.\n3. 'Ma' is not present in: 'M'.\n4. In 'M' and 'A': 'Falama' (So when).\n5. The speech of Sheikh al-Islam Ibn Taymiyyah which the author referred to was previously quoted entirely (14) note (11). The correct view on this issue is that it is obligatory for the one who saw the crescent of Shawwal alone and his testimony was not accepted, or was accepted but no one testified with him to complete the quorum of testimony, to fast with the people for the reasons mentioned, and for the Hadith 'Your fasting is the day you fast, and your breaking fast is the day you break fast...' which is a Sahih Hadith as preceded p. (22, 26). It is explicit that there is no breaking fast unless the congregation breaks fast. This is if he is in a country where the entry of the month is established by sighting, as is the case in this country, praise be to Allah. But if he is in a country that acts upon calculation, or his testimony was rejected because it contradicted calculation, then he must break fast in that case. And Allah knows best.",
    "book_id": "667",
    "new_page_number": 45
  },
  {
    "serial_number": "4577311",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 53,
    "volume_number": 1,
    "text": "As for the first perspective, the command for the witness here to fast does not appear, because breaking the fast on the Day of Arafah does not fear accusation as in Ramadan. As for the second perspective, which is differing from the Imam and scattering (1) the word, the command to fast this day with the people is directed, because his breaking the fast leads to most people breaking the fast on the Day of Arafah despite their habit of fasting it in other years. This involves dividing the word (2) and transgressing against the Imam. As for the third perspective, it is said: If there are two witnesses or more, the quorum of testimony is complete, so they and those who trust their word act upon their testimony. Sheikh Muwaffaq al-Din - may Allah Almighty have mercy on him - said the same regarding two witnesses for the crescent of Fitr if their testimony is rejected, that they break the fast, them and those who trust their word (3). Sheikh Majd al-Din opposed him in that, and said: And the analogy of the School (Madhhab) is",
    "foot_note": "1. (1) In 'Q': 'wa tashattut' (and dispersal).\n2. In 'A' and 'M': 'Al-Kalimah'.\n3. See Al-Mughni 4/421.",
    "book_id": "667",
    "new_page_number": 46
  },
  {
    "serial_number": "4577312",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 54,
    "volume_number": 1,
    "text": "contrary to that (1), based on the first and second perspectives. As for the fourth perspective: What Sheikh Taqi al-Din mentioned is directed, and it is the apparent meaning of what was narrated from Aisha (2) and others from the Predecessors (Salaf) (3). The previous Hadiths indicate this: That Al-Adha is the day the people sacrifice, Al-Fitr is the day they break fast, and Arafah is the day they know/stand. And what is transmitted from the Companions like Ibn Umar (4) and from many of",
    "foot_note": "1. (1) See Al-Mubdi' 3/20, and Al-Insaf 3/279. The correct view on this issue is that they are not permitted to break fast, nor is it permissible for those who trusted their word to break fast, due to the Hadith 'Your fasting is the day you fast, and your breaking fast is the day you break fast...' which is a Sahih Hadith as preceded p. (23, 26). See previous p. (33) note (7).\n2. What was narrated from Aisha, may Allah be pleased with her, regarding that was previously referenced p. (19-22).\n3. The statement of Umar, may Allah be pleased with him: 'Let one of you beware of fasting a day of Sha'ban or breaking fast a day of Ramadan, and breaking fast before the people, so let him break fast when the people break fast,' and what was narrated of his disapproval of the man who broke fast when he and his companion saw the crescent, was previously referenced. p. (28) note (9). Ibn Abi Shaybah narrated in the Book of Fasting: Regarding the crescent seen while some people have eaten 3/69 from Isma'il bin Ayyash from Amr bin Muhajir that Umar bin Abd al-Aziz, may Allah have mercy on him, disapproved of Muhammad bin Suwayd al-Fihri when he broke fast or sacrificed a day before the people. Its chain is Hasan, due to Isma'il bin Ayyash, for he is truthful in what he narrates from the Levantines (Shamiyeen), weak in what he narrates from others, and Amr bin Muhajir is from the people of Sham. See Tahdhib al-Tahdhib 1/322-326, Al-Taqrib p. 109.\n4. Hanbal narrated in his Masa'il - as in Zad al-Ma'ad 2/49 - from Imam Ahmad: Ubaydah bin Humayd told us, he said: Abdul Aziz bin Hakim informed us, he said: They asked Ibn Umar, they said: Shall we anticipate before Ramadan so we don't miss anything of it? He said: 'Uff, Uff, fast with the congregation.' Its chain is Hasan, Allah willing; Ubaydah bin Humayd is truthful but perhaps erred, as in Al-Taqrib p. 379, and Abdul Aziz bin Hakim has slight criticism that does not bring his Hadith below the grade of Hasan. See Lisan al-Mizan 4/29. Shu'aib al-Arna'ut and Abdul Qadir al-Arna'ut authenticated it in their commentary on Zad al-Ma'ad 2/48. A supporting evidence for this report was previously mentioned p. (16) note (1).",
    "book_id": "667",
    "new_page_number": 47
  },
  {
    "serial_number": "4577313",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 55,
    "volume_number": 1,
    "text": "the Successors (Tabi'in), such as Al-Sha'bi (1), Al-Nakha'i (2), Al-Hasan (3), and Ibn",
    "foot_note": "1. (1) Ibn Abi Shaybah narrated in Fasting: What they said regarding the day in which it is doubted whether to fast 3/71, from Abu Al-Ahwas from Mughira from Ibrahim and Al-Sha'bi that they said: 'Do not fast except with the group of people.' Its chain is weak; Mughira - who is Ibn Miqsam - is trustworthy and precise except that he used to conceal defects (tadlis), especially from Ibrahim as in Al-Taqrib p. 543, and he narrated this report with 'an' (from). Ibn Abi Shaybah also narrated in the previous location from Waki' from Isma'il bin Abi Khalid from Al-Sha'bi who said: There is no day I fast more hateful to me than a day the people differ in. Its chain is authentic, its men are the men of the two Sahihs. Ibn Abi Shaybah also narrated in the previous location 3/72 from Ibn Fudayl from Mutarrif from 'Amir regarding the day in which people say it is from Ramadan, so he said: Do not fast except with the Imam, for the first division was only in the like of this. Its chain is Hasan, and its men are trustworthy, except Ibn Fudayl - who is Muhammad bin Fudayl al-Dabbi - he is truthful, knowledgeable, and accused of Shi'ism, as in Al-Taqrib p. 52.\n2. See the previous note. Ibn Abi Shaybah narrated in the previous location from Waki' from Al-Aizar who said: I came to Ibrahim on the day in which doubt occurs, so he said: Perhaps you are fasting, do not fast except with the congregation. Its chain is authentic.\n3. Ibn Abi Shaybah narrated in the Book of Fasting: Who used to say it is not permitted except with the testimony of two men 3/68, 69 from Abu Usamah from Hisham from Al-Hasan that he used to say regarding the man who sees the crescent alone before the people, he said: He does not fast except with the people, and does not break fast except with the people. Its men are trustworthy, but in the narration of Hisham - who is Ibn Hasan al-Azdi - from Al-Hasan there is weakness, because it was said: He used to narrate Mursal reports from him. See Al-Taqrib p. 752.",
    "book_id": "667",
    "new_page_number": 48
  },
  {
    "serial_number": "4577314",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 56,
    "volume_number": 1,
    "text": "Sirin (1) and others: implies that one should not separate from the group in fasting or breaking the fast. Ahmad sees that one should not separate from the group in breaking the fast, like the one who saw the crescent of Shawwal alone (2). As for separating from the group in fasting, there are two narrations from him regarding it (3), like (4) the fasting of a cloudy day if the Imam and the group with him do not fast it (5),",
    "foot_note": "1. (1) Abd al-Razzaq narrated in the Book of Fasting, Chapter: Separation between Ramadan and Sha'ban 4/162, number (3229) from Ja'far bin Sulayman: Asma' bin Ubayd informed me, he said: We came to Muhammad bin Sirin on the day in which doubt occurs, so we said: What should we do? He said to his servant: Go and look, did the Amir fast or not? - He said: The Amir that day was Adi bin Artah - So he returned to him and said: I found him breaking fast. He said: So Muhammad called for his lunch and had lunch, so we had lunch with him. Its chain is Hasan, due to Ja'far bin Sulayman - who is Al-Duba'i - for he is truthful as in Al-Taqrib p. 140 and he is one of Muslim's narrators.\n2. Mention of who narrated this saying from Ahmad has preceded, and that another narration was reported from him, which is that he does not break fast except with the people. See p. (28) note (7).\n3. In 'A' 'fa-fihi riwayatan' (so in it are two narrations), and in 'M': 'fa-fihi 'anhu riwayatan' (so in it from him are two narrations).\n4. In 'Q': 'wa mithl' (and like).\n5. A narration that he fasts, and a narration that fasting is forbidden for him, and he has a third narration in the issue, which is that people follow the Imam; if he fasts they fast and if he breaks fast they break fast. See Masa'il Abdullah p. 181, Masa'il Salih 3/202, Masa'il Abu Dawood p. 88, Majmu' Fatawa Ibn Taymiyyah 25/122-125, Al-Mughni 4/330, Zad al-Ma'ad 2/42, and Sharh Al-Zarkashi 2/553-561. The correct view on this issue has been previously mentioned p. (17) note (1).",
    "book_id": "667",
    "new_page_number": 49
  },
  {
    "serial_number": "4577315",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 57,
    "volume_number": 1,
    "text": "and like (1) the one who saw the crescent (2) of Ramadan alone and his testimony was rejected. Regarding the obligation of his fasting upon the sighter, there are two narrations from Ahmad (3). The text from him in the narration of Hanbal is that he does not fast (4), and it is the saying of a group of the Predecessors, such as Ata (5), Al-Hasan (6), Ibn Sirin (7), and the school of Ishaq (8).",
    "foot_note": "1. (1) In 'Q': 'wa mithluhu' (and like it).\n2. In 'A': 'wa mithl siyam man ra'a hilal' (and like the fasting of one who saw the crescent), and in its margin: 'man ra'a siyam hilal' (who saw the fasting of a crescent), and upon it a copy mark.\n3. One of them: That fasting is obligatory for him. And the second narration, which is Hanbal's narration: That fasting is not obligatory for him. See Majmu' Fatawa Ibn Taymiyyah 25/624, Al-Furu' 3/18, Al-Insaf 3/277. Some narrated that Hanbal's narration is: He does not fast except in the group of people. See Al-Mughni 4/416, Sharh Al-Zarkashi 2/624, 625.\n4. See previous note number ().\n5. Referencing of his saying preceded p. () note ().\n6. Referencing of his saying preceded p. () note ().\n7. Referencing of his saying preceded p. () note ().\n8. See Tarh al-Tathrib 4/117. The majority of scholars held that he must fast this day, and it is a narration from Ahmad as preceded, and they argued with his saying, peace and blessings be upon him: 'Fast upon seeing it and break fast upon seeing it' which was previously referenced p. (17). The correct view on this issue is the first opinion which the author leaned towards, which is that fasting is forbidden for him, and he does not fast except with the group of Muslims, due to the Hadith: 'Your fasting is the day you fast, and your breaking fast is the day you break fast...' which is a Sahih Hadith as preceded p. (23, 26). It is explicit that the day of fasting is the day the group fasts, and because it is a day judged to be from Sha'ban, and prohibition against fasting the last day of Sha'ban has been reported in the Hadith of Ibn Abbas in Al-Nasa'i 4/154 with a Hasan chain. However, if a person saw it in a place where there is no one else or in a place where sighting is not acted upon, then he fasts. And Allah knows best. See on this issue Al-Tamhid, 14/355, 356, Sharh al-Sunnah 6/248, Bidayat al-Mujtahid 5/131, 132, Al-Mughni 4/416, Majmu' Fatawa Ibn Taymiyyah 25/114-118, and Al-Majmu' 6/280.",
    "book_id": "667",
    "new_page_number": 50
  },
  {
    "serial_number": "4577316",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 58,
    "volume_number": 1,
    "text": "Based on this, the analogy of his school is that he does not separate from the group by breaking the fast on the Day of Arafah if the Imam and the people fast it, and it was seen by one whose word was not taken. For in the command for his breaking the fast and the prohibition of his fasting (1) is the corruption of opposing the Imam (2) and the community of Muslims. Something like this can hardly be hidden, rather it appears and spreads, as happened this year. And it might lead to many people making it the Day of Sacrifice, so sacrifices are slaughtered in it, as happened this year (3). This is among the most profound",
    "foot_note": "1. (1) In 'M': 'wa tahrimihi' (and prohibiting it) and it was corrected with a different handwriting from that of the manuscript to: 'wa tahrim siyamihi' (and prohibition of his fasting)\n2. In 'A': 'li-mukhalafat al-imam' (to opposing the Imam) and in 'M': 'lil-mukhalafati lil-imam'.\n3. In 'A' addition: 'aydan' (also).",
    "book_id": "667",
    "new_page_number": 51
  },
  {
    "serial_number": "4577317",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 59,
    "volume_number": 1,
    "text": "transgression against the Imam and the community of Muslims. In it is the scattering of the word, the division of the community, and the resemblance to the people of innovation (1), such as the Rafidah and their likes, for they separate from the Muslims in fasting, breaking the fast, and in festivals (2). So one should not resemble them in that. What verifies (3) this is: That advancing ahead of the Imam in slaughtering the ritual sacrifice is forbidden, like advancing ahead of him in fasting, advancing ahead of him in moving from Arafah (4), and advancing ahead of him in the Friday prayer. Therefore, a group of our companions, such as Abu Bakr Abd al-Aziz (5), prevented the people of excuses from praying",
    "foot_note": "1. (1) In 'A': 'Al-Bid'ah' (Innovation).\n2. See the book Wasa'il al-Shi'a by Muhammad bin Al-Hasan Al-Hurr Al-Amili Al-Shi'i, Book of Fasting, Chapter: Impermissibility of relying on the word of opponents in Fasting, Breaking Fast, and Adha Vol 7 p 123.\n3. In the margin of 'A': 'wa tahqiq' (and verification) and another copy mark was placed on it.\n4. I did not find in this issue a Hadith traceable to the Prophet, peace and blessings be upon him. But some scholars narrated consensus that no one should depart before the Imam. Al-Zarkashi said 3/344, 345: 'The Imam is the one to whom the matter of Hajj belongs, and there is no dispute in the requirement to follow him, and not to depart except after his departure, because he is more knowledgeable about the matters of Hajj and what relates to it, and more controlling of people lest they transgress against each other.' It was transmitted in Al-Mughni 5/276 from Imam Ahmad that he was asked about a man who departed before the Imam after sunset, so he said: 'I did not find from anyone that he was lenient in it; all of them are strict about it.'\n5. He is Abdul Aziz bin Ja'far bin Ahmad, Abu Bakr, Al-Hanbali, known as Ghulam al-Khallal. His death was in 363 AH. See his biography in Tabaqat al-Hanabilah 2/119-127, Al-Manhaj al-Ahmad 2/68, Al-Ibar 2/116.",
    "book_id": "667",
    "new_page_number": 52
  },
  {
    "serial_number": "4577318",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 60,
    "volume_number": 1,
    "text": "Dhuhr on the day of Friday until the Imam prays Jumu'ah (1). And for that reason (2), the scholars disputed: Is it permissible to advance ahead of the Imam in slaughtering on the Day of Sacrifice, or is it not permissible (3) until the Imam slaughters his ritual sacrifice? There are (4) two famous opinions among the scholars (5). And there is no disagreement among them that it is better",
    "foot_note": "1. (1) Among the Hanbalis who said this are: Abu Bakr Abd al-Aziz - as mentioned by the author - and Ibn Aqil, and it is a narration from Ahmad. Ibn Aqil justified it: by fear of believing they are transgressing against the Imam or that they do not see the Friday prayer [as valid]. Abu Bakr Abd al-Aziz justified it: that he is not certain of the continuation of the excuse, so his prayer is not valid like the non-excused. The correct view is that it is permissible for people of excuses to pray Dhuhr if its time enters, even if the Imam has not prayed Jumu'ah, because Dhuhr is what is obligatory upon them at the time of their performance of it, and the default is the continuation of the excuse. Some of them have a continuous excuse like the woman and the crippled old person and others. Exception to this is one who thinks it likely that his excuse will cease before the Imam prays Jumu'ah; he should not pray Dhuhr before Jumu'ah prayer is performed. What Ibn Aqil justified with is not strong enough to prevent due to its weakness. Allah knows best. See Al-Mughni 3/222, 223, Tabaqat al-Hanabilah 2/83, 84, Sharh Al-Zarkashi 2/204, and Al-Insaf 2/372, 373.\n2. In 'A': 'wa kadhalika' (and likewise), and in its margin: 'wa lidhalika' (and for that reason) and another copy mark was placed on it.\n3. In 'A' addition: 'Al-Dhabh' (slaughtering).\n4. In 'A' and 'M': 'wa fihi' (and in it).\n5. Imam Malik, Al-Awza'i, and Ahmad in a narration held that it is not permissible for anyone to sacrifice until the Imam sacrifices. They argued for this opinion with what Muslim narrated in his Sahih (3/117, 118 Sharh al-Nawawi) via Ibn Jurayj: Abu al-Zubayr informed me that he heard Jabir bin Abdullah saying: The Prophet, peace and blessings be upon him, led us in prayer on the Day of Sacrifice in Medina, so some men advanced and slaughtered, thinking that the Prophet, peace and blessings be upon him, had slaughtered. So the Prophet, peace and blessings be upon him, ordered those who had slaughtered before him to repeat with another slaughter, and not to slaughter until the Prophet, peace and blessings be upon him, slaughters. The majority of scholars held that it is permissible to sacrifice before the Imam slaughters. They argued with what is in the two Sahihs from Al-Bara' raised: 'Whoever sacrifices before the prayer, he has only slaughtered for himself, and whoever sacrifices after the prayer, his rite is complete and he has hit the Sunnah of the Muslims.' And what is in the two Sahihs also from Anas raised: 'Whoever slaughters before the prayer, let him repeat.' And what is in the two Sahihs also from Jundub raised: 'Whoever slaughters before he prays, let him repeat another in its place.' See Sahih Al-Bukhari with Al-Fath 10/12, 20, and Sahih Muslim with Nawawi's commentary 13/109-117. They said these Hadiths indicate that what counts is the finishing of the prayer, not the slaughter of the Imam. The Hadith of Ibn Jurayj from Abu al-Zubayr from Jabir was answered by saying Hammad bin Salamah contradicted him and narrated it from Abu al-Zubayr from Jabir with the wording: 'He forbade that they slaughter before he prays,' narrated by Al-Tahawi and Ibn Hibban. In the chain of this narration is the 'an'ana of Abu al-Zubayr, who is a Mudallis. They said: This narration agrees with the Hadiths indicating that slaughter begins after the prayer, not after the Imam's slaughter. See Sharh Ma'ani al-Athar 4/171-174 and Mawarid al-Zam'an p. 259, and see Al-Tamhid 23/180-188, Al-Muntaqa by Al-Baji 3/86, 87, Sharh Muslim by Al-Nawawi 13/106-111, Al-Furu' 3/545, Al-Fath 10/21, 22, and Umdat al-Qari 21/157. The preponderant view in this issue is the opinion of the Majority, due to the strength of their evidences. The Hadith of Jabir is interpreted as deterrence from haste which might lead to doing it before the time. See Sharh Muslim by Al-Nawawi 13/118.",
    "book_id": "667",
    "new_page_number": 53
  },
  {
    "serial_number": "4577319",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 62,
    "volume_number": 1,
    "text": "that the people do not slaughter until the Imam slaughters (1). Al-Hasan said regarding His Almighty's saying: {O you who have believed, do not put [yourselves] before Allah and His Messenger} [Surah Al-Hujurat: Verse 1], he said: Do not slaughter before the Imam. Ibn Abi Hatim recorded it (2). If it is said: Did not the Prophet, peace and blessings be upon him, command his companions, when there are Imams who delay the prayer beyond its time, to pray the prayer at its time and make their prayer with them voluntary (3)? Even though in that",
    "foot_note": "1. (1) Sheikh Abdul Rahman bin Qasim also narrated consensus on this issue in his footnote on Al-Rawd al-Murbi' 4/230.\n2. Al-Suyuti said in Al-Durr al-Manthur 5/547: 'And Abd bin Humayd, Ibn Jarir, and Ibn al-Mundhir recorded from Al-Hasan, may Allah be pleased with him, that some people slaughtered before the Messenger of Allah, peace and blessings be upon him, on the Day of Sacrifice, so he ordered them to repeat slaughtering, so Allah revealed: {O you who have believed, do not put [yourselves] before Allah and His Messenger}.' Abd al-Razzaq narrated in his Tafsir 2/230, and from his path Al-Jassas in Ahkam al-Qur'an 5/276 from Ma'mar from Al-Hasan: 'They are a people who slaughtered before the Prophet, peace and blessings be upon him, prayed, so he commanded them and they repeated the slaughter.' Its men are trustworthy, except that it is disconnected (Munqati'); Ma'mar did not hear from Al-Hasan, and Al-Hasan did not meet the time of the Prophet, peace and blessings be upon him. See Al-Marasil by Ibn Abi Hatim p. 219. And see Tafsir Ibn Jarir 9/74.\n3. Muslim narrated in the Book of Mosques, Chapter: Dislike of Delaying Prayer Beyond its Preferred Time 1/448, number (648) from Abu Dharr, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said to me: 'How will you be if there are Amirs over you who delay prayer beyond its time, or kill prayer beyond its time?' He said: I said: What do you command me? He said: 'Pray the prayer at its time, then if you catch it with them, pray, for it will be voluntary for you.' Muslim also narrated it in the Book of Mosques, Chapter: Recommendation to place hands on knees in bowing 1/379, number (534) similarly from the Hadith of Abdullah bin Mas'ud, may Allah be pleased with him.",
    "book_id": "667",
    "new_page_number": 54
  },
  {
    "serial_number": "4577320",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 63,
    "volume_number": 1,
    "text": "is transgression against the Imams and differing from them; and for this reason, the Banu Umayyah used to be strict about that and make people swear when they came to prayer that they had not prayed before that (1). Despite this, the Prophet, peace and blessings be upon him, commanded praying in the time secretly and praying with them as voluntary to repel their evil and withhold their harm. This indicates that it is not permissible for anyone to leave what he knows of the truth to agree with the Imams and the general public; rather, he must act upon what he knows of the truth in himself, even if it involves opposing the Imams and the general public who follow them. In that case, it is not permissible to command the one who saw the crescent, or the one whom (2) a trusted person informed of its sighting, to follow the Imam and the community with him, and leave what (3) he knows of the truth.",
    "foot_note": "1. (1) I did not find it.\n2. In 'A': 'wa man amarahu' (and whoever commanded him) and upon it a copy mark, and in its margin: 'aw man akhbarahu' (or whoever informed him) and upon it another copy mark.\n3. In 'A': 'ma qad' (what [has]).",
    "book_id": "667",
    "new_page_number": 55
  },
  {
    "serial_number": "4577321",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 64,
    "volume_number": 1,
    "text": "The Answer: That what we are discussing is not of this sort. That is because prayer has a limited time in the Sharia, the beginning and end of which are known by apparent knowledge. So whoever changes it among the Imams, it is not permissible (1) to follow him in that, because it involves agreeing to the alteration of the Sharia, and that is not permissible. The parallel to this from our issue is that just witnesses testify (2) before a ruler regarding the sighting of the crescent of Dhu al-Hijjah or Ramadan, and he says: 'They are just to me, but I do not accept their testimony,' or something similar which shows that he (3) intentionally left the obligation without an excuse. Here (4), attention is not paid to him, and one acts according to the requirement of the truth (5), even if he shows dissimulation (Taqiyyah) to him if",
    "foot_note": "1. (1) In 'A': 'lam tajib' (it is not obligatory).\n2. In 'A': 'in shahida' (if [he] testified) and upon it a copy mark, and in its margin: 'an shahida' (that [he] testified) and upon it another copy mark.\n3. 'annahu' (that he) is not present in 'A'.\n4. 'fahuna' (so here) is not present in 'A'.\n5. Sheikh al-Islam Ibn Taymiyyah, may Allah Almighty have mercy on him, disagreed on this issue as in Majmu' al-Fatawa 25/206, 207. He said after his speech which was previously quoted p. (31) note (1) the text of which is: 'If it is said: The Imam to whom establishing the crescent is delegated might be negligent by rejecting the testimony of just witnesses, either for his negligence in researching their justice, or rejecting their testimony due to enmity between him and them, or other reasons that are not legal, or for his reliance on the saying of the astrologer who claimed it cannot be seen. It is said: What is established of the ruling regarding the one followed in seeing the crescent does not differ whether he is striving and correct or mistaken, or negligent... It has been proven in the Sahih that the Prophet, peace and blessings be upon him, said regarding the Imams: \"They pray for you, so if they are correct, it is for you and them, and if they err, it is for you and against them.\" So his error and negligence are upon him, not upon the Muslims who were not negligent or mistaken. There is no doubt that it is proven by the authentic Sunnah and consensus of the Companions that it is not permissible to rely on the calculation of stars, as proven from him, peace and blessings be upon him, in the two Sahihs that he said: \"We are an unlettered nation, we do not write or calculate. Fast upon seeing it, and break fast upon seeing it.\" The one relying on calculation regarding the crescent, just as he is astray in Sharia and an innovator in religion, he is mistaken in reason and the science of calculation, for scholars of astronomy know that sighting is not regulated by a calculable matter.' End quote.",
    "book_id": "667",
    "new_page_number": 56
  },
  {
    "serial_number": "4577322",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 65,
    "volume_number": 1,
    "text": "his evil is feared. Just as the Prophet, peace and blessings be upon him, ordered praying with those Amirs as voluntary. This is contrary to matters of Ijtihad (independent reasoning) which are hidden and in which Ijtihad is permissible, such as accepting witnesses or rejecting them. For this is among things whose causes are hidden, and the ruler might be excused in the reality of the matter. So in such cases, it is not permissible to transgress against the Imams and their deputies nor to show opposition to them. Even if they were negligent in the reality of the matter, their negligence is upon them, not upon the one who was not negligent. As the Prophet, peace and blessings be upon him, said regarding the Imams: \"They pray for you (1), so if they are correct, it is for you",
    "foot_note": "1. (1) The phrase: 'yusalluna lakum' (they pray for you) is not present in 'Q', and in 'A': 'bikum' (with you), and a copy mark was placed on it, and in its margin: 'lakum' (for you) and upon it another copy mark and a correction mark.",
    "book_id": "667",
    "new_page_number": 57
  },
  {
    "serial_number": "4577323",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 66,
    "volume_number": 1,
    "text": "and for them. And if they err, it is for you and against them.\" Al-Bukhari recorded it (1). Ended, and Allah knows best (2).",
    "foot_note": "1. (1) See Sahih Al-Bukhari with Al-Fath: Book of Adhan, Chapter: If the Imam does not complete and the one behind him completes 2/187, Hadith (694).\n2. The correct view in the issue is what the author leaned towards and mentioned as the analogy of the Madhhab: that whoever saw the crescent of Dhu al-Hijjah and his word was not accepted, and whoever was informed of its sighting by someone he trusts, if he wants Hajj, he must stand on the Day of Arafah with the group of Muslims. Likewise, it is recommended for him to fast it if he is not a pilgrim, even if according to what is established with him it is the tenth day. Because the Hadith 'Your fasting is the day you fast, your breaking fast is the day you break fast, and your sacrifice is the day you sacrifice' - which is a Sahih Hadith as preceded p. (24) - is explicit that the Day of Sacrifice for the entire Ummah is the day the Imam and the community of Muslims sacrifice and pray the Eid prayer in, even if it is the eleventh day according to what was established with some Muslims from sighting. Based on this, the Day of Arafah is the day the Imam and the community of Muslims stand at Arafat. This is what is established from Mother of the Believers Aisha, may Allah be pleased with her, as preceded completely (19-21) - and no opponent from the Companions is known for her. But if a person wants to be cautious for himself and stand on the eighth day at Arafah which is, according to what is established with him, the Day of Arafah, then stand with the people the next day as Salim bin Abdullah, may Allah have mercy on him, did - and his action was previously mentioned p. (31, 32) - or leave fasting the Day of Arafah which is, according to what is established with him, the Day of Eid if he is not a pilgrim, as Masruq and others did - and their action was previously mentioned p. (19-21) - there is no harm in that, escaping from the disagreement of those who obligated him to act upon what is established with him like Al-Subki in the book Al-Ilm al-Manshur fi Ithbat al-Shuhur p. 45, 46. This is the analogy of the saying of one who said the one who sees the crescent of Ramadan alone fasts, as mention of who said that preceded p. (). It is also the analogy of the saying of one who said: He breaks fast if he sees the crescent of Shawwal alone, as mention of who said that preceded p. (29, 30). But whoever does that should hide his action to prevent division and scattering the word, and lest the common people doubt the validity of their action. All this applies if the one establishing the entry of the month relies on sighting, as is the case in this country, praise be to Allah. But if he relies on calculation, or does not accept the testimony of witnesses if it contradicts calculation, then he who saw it or was informed of its sighting by someone he trusts must act upon what is established with him from sighting, and leave what is other than it - this is also what the author leaned towards, as preceded p. (). In this case, he should show his action to the people and teach others what is established with him, unless he fears that calling to act by this legal ruling will result in a greater evil, then he should leave calling to it at that time. And Allah knows best.",
    "book_id": "667",
    "new_page_number": 58
  },
  {
    "serial_number": "4577324",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Rulings on Disagreement regarding the Sighting of the Crescent of Dhu al-Hijjah",
    "edition": "First, 1422 AH",
    "publisher": "Dar Alam al-Fawaid for Publishing and Distribution, Makkah Al-Mukarramah",
    "page_number": 67,
    "volume_number": 1,
    "text": "The end of what the Sheikh, may Allah Almighty have mercy on him, mentioned (1).",
    "foot_note": "1. (1) It came in 'A' after his saying: 'Al-Bukhari recorded it' the text: 'And Allah, Glorified and Exalted, knows best, and His knowledge is most complete and wisest. May Allah send prayers and peace upon Muhammad and his family and companions and grant peace. The end of what the Sheikh, may Allah have mercy on us and him, mentioned. Written by the poor one unto his Lord, confessing his sin: Abd al-Muhsin bin Ubayd, may Allah be good to him and his parents and the Muslims. Written 4 Jumada al-Ula year 1361 AH. And copied from the handwriting of one who named himself: Farraj bin Mansur bin Sabiq al-Najdi, may Allah have mercy on him, he wrote it in the year 1228 AH, eight and twenty and two hundred and one thousand.'",
    "book_id": "667",
    "new_page_number": 59
  }
]