[
  {
    "text": "Defense of the Prophetic Hadith and Biography\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3525\nbook_title: دفاع عن الحديث النبوي والسيرة\nbook_link: https://shamela.ws/book/421\nbook_id: 421\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: Null\nedition: Null\npages: 111\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3365927",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Sciences\nBook: Defense of the Prophetic Hadith and Biography\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nBook: Defense of the Prophetic Hadith and Biography\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\n\n[Book numbering corresponds to the printed version]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 3
  },
  {
    "serial_number": "3365928",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Defense of the Prophetic Hadith and Biography\nAuthored by the Sheikh, the Muhaddith, the Allamah Muhammad Nasir al-Din al-Albani - may Allah have mercy on him\n\nA Word Before the Treatise\n\nPraise be to Allah, Lord of the Worlds, and no aggression except against the oppressors, and peace and blessings be upon our Prophet Muhammad, his family, and all his companions, and those who follow them in goodness until the Day of Judgment.\n\nTo proceed: Before you, O noble reader, are scientific Hadith-based research papers criticizing the book (Fiqh as-Sirah) by Dr. Muhammad Sa'id Al-Buti, a professor at the College of Sharia at the University of Damascus. He had written it for the second-year students at the college. I had published this critique in the distinguished magazine 'At-Tamaddun Al-Islami' as sequential research papers, hoping that students and others would find in them (a sound model for honest scientific criticism based on research and adherence to correct scientific rules, hoping that this would increase their care for studying the Noble Hadith scientifically, and thereby revive what has almost been obliterated of this great science due to teachers and professors limiting themselves to teaching it purely theoretically, and issuing their writings based on that for their students or others without observing even the simplest of those scientific rules regarding the selection of authentic texts and proven Hadiths from trusted sources and approved references, while attributing them to their sources and verifying them (Takhrij) with scientific precision. You see one of them - even while being a professor of this subject: Hadith - citing a Prophetic Hadith or a report related to his biography, peace and blessings be upon him, or his character, saying in its verification: 'Narrated by Abu Dawood' or 'Narrated by Ibn Hisham in (As-Sirah)', thinking that by doing so he has fulfilled the scientific trust hung around his neck and that he has advised his students. Far from it, far from it! For adhering to the scientific method referred to in Hadith studies obligates him, before this brief verification, to study the chain of transmission (Isnad) of that Hadith or report, track its narrators, and identify its defects and the statements of the specialists [A]\n\nregarding it, then judge it according to what this study requires of authenticity or weakness, then present its summary to his students with the mentioned verification. Otherwise, such truncated verification as practiced by the referred professor is something that none of the students themselves would be incapable of, if Allah Almighty wills). That is what I had written in the introduction to my treatise (Critique of Hadith Texts in General Culture) (1) by Sheikh Muhammad Muntasir Al-Kittani, and it applies to Dr. Al-Buti completely. In fact, he exceeded the Sheikh by claiming a level of authenticity for his book (Fiqh as-Sirah) that it does not possess, as I indicated in the commentary on the mentioned introduction where I said: (Then I came across the book 'Fiqh as-Sirah' by the virtuous professor Dr. Muhammad Sa'id Ramadan Al-Buti, and I saw that he followed the path of Professor Al-Kittani, citing in it many weak and objectionable (Munkar) Hadiths, and even those with no basis at all. However, he exceeded him by stating in the introduction that he relied in it on what is authentic of Hadiths and reports. But my study of the book showed that this is a mere claim, and that his reliance was mostly on the book of the virtuous Sheikh Muhammad Al-Ghazali: 'Fiqh as-Sirah', from whom the Doctor did not limit himself to taking the name only, but went further to benefit from many of its researches and texts, and even its titles, just as he benefited from my verification (Takhrij) of it printed with it, with a disruptive abbreviation to cover up what he had done. He criticized me in three places in it, regarding which I wished - Allah bears witness - that he would be correct even in one of them, but on the contrary, he revealed by all of that that these high certificates and what they call 'Doctorate' do not give their holder knowledge, verification, or manners. I hope to have the opportunity to explain this summary, and Allah is the One sought for help).\n\nThen the opportunity became available to me, so I explained the summary referred to in this treatise, for which the primary credit for its publication goes to the gentlemen in charge of the distinguished magazine At-Tamaddun Al-Islami, especially among them Professor Ahmad Mazhar Al-Azmah - may Allah heal and strengthen him. It was published therein sequentially in articles from issue (7 - Volume 42) to (2 - Volume 44), then I compiled it in this treatise so that the benefit may be widespread and those who could not follow it in the distinguished magazine may read it. It has been conveyed to me that some professors saw in this response of mine to the Doctor some severity and harshness at times, which they are not accustomed to in the rest of my writings and scientific responses, and they wished that it had been a purely scientific response. So I say: I firmly believe that I did nothing but what is religiously permissible for me, and that there is no way for a fair person to criticize us. How so, when Allah Almighty says in His Noble Book describing His believing servants: {And those who, when tyranny strikes them, they defend themselves... And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation - his reward is [due] from Allah. Indeed, He does not like wrongdoers... And whoever avenges himself after having been wronged - those have not upon them any cause [for blame]... The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment... And whoever is patient and forgives - indeed, that is of the matters [requiring] determination}. For anyone who tracks what Dr. Al-Buti writes in his books and treatises and speaks of in his sermons and gatherings will find that he never ceases to attack the Salafis in general, and me specifically without naming, and defames them among the common people and the mob, accusing them of ignorance and misguidance, and of stupidity and madness, labeling them as 'Salafiyyin' and 'Sakhfiyyin' (silly ones). Not only this, but he tries to incite the rulers against them by accusing them of being agents of colonialism, among other lies and absurdities recorded against him by Professor Muhammad Eid Abbasi in his valuable book (The Innovation of Sectarian Fanaticism) (p. 274-300) and others, supporting that by mentioning the book and page where these lies appeared. Among his calamities and fabrications is his statement in 'Fiqh as-Sirah' (p. 354 - Third Edition) after labeling them with the nickname Wahhabism: (Groups have gone astray whose hearts did not feel the love of the Messenger of Allah [C]\n\npeace and blessings be upon him, and they went on to denounce Tawassul (seeking intercession) by his person, peace and blessings be upon him, after his death). This is as if it were a regurgitation by the Doctor of the fabrication of that unjust fanatic: (The souls of these Wahhabis are disgusted or repulsed when the name of Muhammad, peace and blessings be upon him, is mentioned). When the Doctor utters this fabrication, he remembers that reality - of which he is aware - belies it. For the Salafis and those like them, by the grace of Allah Almighty - among all Muslims - their motto is following the Prophet, peace and blessings be upon him, alone to the exclusion of others, which is the definitive proof of their sincere love for him, which necessitates their love for Allah Almighty, as He said: {Say, \"If you should love Allah, then follow me, [so] Allah will love you\"}. Yet, the Doctor's knowledge of this divine favor upon the Salafis led his hatred against them to try to invalidate the indication of the mentioned verse regarding what preceded, and even to mislead about the Salafis anew regarding their understanding of it with this clear understanding: that following is the proof of love and is inseparable from it. So he said (p. 195 - Third Edition): (And a people have gone astray who thought that love for the Messenger of Allah, peace and blessings be upon him, has no meaning other than following and emulating, and they missed that emulation does not come except by a restraint and a motive, and you will not find a restraint that drives one to follow except heartfelt love...). I say: The one who went astray is the one who contradicts himself; for the beginning of his speech contradicts its end. Because if nothing drives one to follow except heartfelt love - which is true, and which is what we believe and act upon - then how does this agree with the beginning of his speech which is explicit that love has a meaning other than following? If the matter were so, and the Doctor stood firm on it, he would have invalidated the indication of the Verse, and refuge is sought with Allah Almighty. On the other hand, he fabricated against us by saying: (And they missed that emulation...) etc. We absolutely did not miss that, praise be to Allah. Rather, we know with certainty that whenever a Muslim increases in following the Prophet, peace and blessings be upon him, he increases in love for him, and whenever he increases in love for him, he increases in following him, peace and blessings be upon him. They are two matters [D]\n\ninseparable, exactly like faith and righteous deeds. This truthful love accompanied by sincere following of the Prophet, peace and blessings be upon him, is what the Doctor wanted to negate from the Salafis with his previous fabrication. So Allah Almighty is his reckoner, {And sufficient is Allah as a Reckoner}. That is a little of much of Dr. Al-Buti's fabrications and absurdities, for which those few people feared regarding our harshness against him at times in the response. Perhaps it has become clear to them that we were excused in that, and that we have not yet exacted our full right from him {And the retribution for an evil act is an evil one like it}, but we will not be able to exact it fully because fabrication is not permissible to be met with the like. All I have done is that I have exposed his ignorance in this science, his intrusion into it, his contradiction of the scholars, and his fabrication against them and against the innocent in a terrible manner that is almost unbelievable. Whoever wishes to get a quick idea of that, let him return to the index of this treatise to see the strange wonders. Furthermore, there is a stronger reason that necessitated the mentioned harshness in the response which those few who pity the Doctor should realize: namely, the majesty of the subject and its gravity, into which the Doctor plunged without knowledge, with arrogance and empty claims that were unprecedented. He authenticated many Hadiths and reports that no one had deemed authentic, and he weakened other Hadiths out of partisanship for the Madhhab while they are established according to the scholars of this art and field, along with his complete ignorance of Hadith terminology and the biographies of its narrators, and his turning away from benefiting from the scholars who know it. He thus opened a dangerous door for the ignorant and people of whims to authenticate whatever Hadiths they wish and weaken whatever they want. (And whoever enacts a bad precedent in Islam, upon him is its burden and the burden of those who act upon it until the Day of Resurrection). Glory be to Allah the Great! The Doctor never ceases to accuse the Salafis, among what he accuses them of, that they perform Ijtihad in Fiqh even if they are not qualified for it. Yet, here he falls into what is worse than what he accused them of, realizing the proverb: (Whoever digs a pit for his brother falls into it). Or does [E]\n\nthe Doctor see that Ijtihad in the science of Hadith by a non-Mujtahid, rather by an ignorant person, is permissible, even though all or most of Fiqh is based on this science? For this reason, I see it as a duty upon those who pity the Doctor to advise him (and Religion is Advice/Nasiha) to retract all his ignorance and fabrications, and to restrain his pen and tongue from plunging into the likes of it again, acting upon the saying of our Prophet Muhammad, peace and blessings be upon him: (Help your brother, whether he is an oppressor or is oppressed. It was said: How do I help him if he is an oppressor? He said: You restrain him from oppression, for that is helping him). Narrated by Al-Bukhari from the Hadith of Anas and Muslim from the Hadith of Jabir, and it is verified in 'Al-Irwa' (2515). If the Doctor responds, that is what we hope for, and (May Allah pardon what has passed). But if it is the other way, let him blame no one but himself, and the outcome is for the righteous. Allah the Great spoke the truth when He says: {Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand... The Day their excuse will not benefit the wrongdoers, and they will have the curse, and they will have the worst Home}. And may Allah send blessings and peace upon Muhammad, the unlettered Prophet, and upon his family and companions. Damascus, 27 Jumada al-Akhirah, year 1397 AH. Muhammad Nasir al-Din al-Albani [F]\n\nIndeed, all praise is due to Allah, we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whoever Allah guides, there is no one to misguide him, and whoever He leaves astray, there is no guide for him. I bear witness that there is no deity worthy of worship except Allah alone, without partner, and I bear witness that Muhammad is His servant and Messenger. To proceed: These are quick comments on the Hadiths of the book (Fiqh as-Sirah) authored by Dr. Muhammad Sa'id Ramadan Al-Buti in two parts, printed by Dar Al-Fikr Al-Hadith in Lebanon. He said in the introduction: (To proceed: These are researches in the Fiqh (jurisprudence) of the Prophetic Biography which I delivered as lectures to the first - and second - year students at the College of Sharia at the University of Damascus). I say: One of the strongest incentives for studying this book - despite the tightness of time and weak desire to read the works of contemporaries - was that I saw its virtuous author say in the introduction to the second part (p. 3): (I have followed in it the method I followed in the first part, so I isolated the researches of the Biography in the form of texts in which I relied firstly on the Sahihs (authentic books) of the Sunnah, and secondly on what is authentic of the news of the Biography in its books, and the most important of what I relied upon from that are Sirah of Ibn Hisham and Tabaqat of Ibn Sa'd). When I read this, I rejoiced and said to myself: If the news is true, then undoubtedly the Doctor, with this book of his, has opened a new door of authorship in the biography of the Prophet, peace and blessings be upon him, which is selecting the narrations that are authentic within it from the books of Hadith and Sirah, necessitating the avoidance of mentioning what is not authentic among them according to the method of Hadith scholars and critics. This is a very important matter, for what has been written on the Noble Prophetic Biography until now numbers in the thousands [1]\n\nas the Scholar Sayyid Sulaiman Nadwi said in his valuable book (The Muhammadan Message) (1) (p. 65). Yet, I do not know, in all that has been written of that, anyone who has taken this approach of selection that the virtuous Doctor mentioned he followed in this book. My soul has often tempted me to follow this path and compile a comprehensive book under the title (Sahih as-Sirah an-Nabawiyyah) similar to the way I proceeded in (Sahih Sunan Abi Dawood) and others which I am in the process of now, but the opportunity has not presented itself to me until this hour to perform such a duty. So when I read the Doctor's previous phrase, I thought that he had performed the duty and the hope was realized. And how could that not be a duty when his biography, peace and blessings be upon him, is but a (picture of the highest ideal in every affair of virtuous life so that it may be made a constitution to adhere to and follow. There is no doubt that whatever highest ideal one searches for in any aspect of life, he will find it all in the life of the Messenger of Allah, peace and blessings be upon him, with the greatest clarity and perfection. Therefore, Allah made him a role model for all humanity, saying: {There has certainly been for you in the Messenger of Allah an excellent pattern} - Al-Ahzab 21) as the Doctor said in the introduction of his book (p. 7-8). But was the Doctor able to realize the hope, or at least restrict his reliance in the texts he quoted to what is authentic among them in the books of Sirah and the collections of Sunnah which he called (Sahihs of the Sunnah)? That is what I want to elaborate on now in this hurry, hoping from the Master, Glory be to Him and Most High, to guide our steps and inspire us with correctness and sincerity in our words and deeds.",
    "foot_note": "None\n\nNone\n\n1. (1) First published in the distinguished magazine At-Tamaddun Al-Islami (Volumes 33 and 34), then published separately as a treatise ten years ago [B].\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "421",
    "new_page_number": 4
  },
  {
    "serial_number": "3365937",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "1 - His statement under the title (Sources of the Prophetic Biography) (1 / 11) drew my attention:",
    "foot_note": "1. (1) These are eight lectures on the Prophetic Biography and the Message of Islam which he delivered at the universities of India. They are of significant benefits indicating the abundance of the author's knowledge, may Allah Almighty have mercy on him and reward him with good [2].",
    "book_id": "421",
    "new_page_number": 5
  },
  {
    "serial_number": "3365938",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "2 - The Authentic Prophetic Sunnah: It is what is contained in the books of the Imams of Hadith known for their truthfulness and trustworthiness, such as the Six Books, Muwatta of Imam Malik, and Musnad of Imam Ahmad (1). I say: What constitutes the mentioned books and others - with the exception of the Two Sahihs (Bukhari and Muslim) - is not entirely authentic Hadith. Rather, they contain the Authentic (Sahih), the Good (Hasan), and the Weak (Da'if), and in some of them, there are Fabricated (Mawdu') narrations as well, as is known to the scholars of the Noble Hadith. Some texts supporting this from what they mentioned in the (Science of Hadith Terminology) will be mentioned shortly. Therefore, the Doctor's statement regarding the Authentic Sunnah: (It is what is contained in the books of the Imams of Hadith) is an incorrect generalization. I wished to say: Perhaps it was a slip of the pen from him and that he did not intend this generality which is apparent from it and whose falsehood is known intuitively. I wished that, but I did not find in his other words nor in the methodology he practically followed what would support me in that. For his statement preceded while he was speaking about his method in the book: (I relied in it on the Sahihs of the Sunnah). So his saying (Sahihs) in the plural form instead of (The Two Sahihs and the Four Sunan) - as is the correct scientific expression - gives the impression to the researcher that the books that collect only authentic Hadiths are not limited, according to him,",
    "foot_note": "1. (1) Then it became clear to me that Dr. Al-Buti imitated Dr. As-Siba'i, may Allah Almighty have mercy on him, in this speech. He said in his book (Notes on Fiqh as-Sirah) (p. 10): (The main relied-upon sources for the Biography are limited to four sources... The Holy Quran, then the Authentic Sunnah contained in the books of Hadith whose authors are recognized for their truthfulness and trustworthiness, which are the Six Books: Bukhari, Muslim, Abu Dawood, An-Nasa'i, At-Tirmidhi, and Ibn Majah, and added to them are (Al-Muwatta) by Imam Malik and (Musnad of Imam Ahmad). These books are at the highest peak of authenticity, trust, and verification. As for the other books, they contained the Sahih, the Hasan, and in some of them the Weak as well) [3].",
    "book_id": "421",
    "new_page_number": 6
  },
  {
    "serial_number": "3365939",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "to the (Two Sahihs) among the books of Sunnah. Nor can it be said: (Perhaps it was a slip of the pen from him) because I saw that he repeated this saying (Sahihs of the Sunnah) in another place in his book (Vol 1, p 15), and he means by that the Six Books. Indeed, perhaps he means with them (Al-Muwatta) and (Al-Musnad), for he coupled them with the former in this word which we are in the process of criticizing. What supports this is his previous statement: (I relied) in it firstly on the Sahihs of the Sunnah, secondly on what is authentic of the news of the Biography. This is a text from him regarding what he mentioned, because he explicitly stated that the news of the Biography contains what is not authentic, so he relied - as he claimed - on what is authentic of it. If the books of Sunnah were, in his view, like the books of Sirah in containing what is authentic and what is not authentic, he would not have needed this division and differentiation: (... Sahihs of the Sunnah) (... what is authentic of the news of the Biography). He would have said, for example: (I relied in it on what is authentic from the books of Sunnah and Sirah). So this differentiation from him is a definitive proof that he means what we mentioned: that the Authentic Sunnah is not exclusive to the (Two Sahihs) only, but the Four Sunan are also among the Sahihs of the Sunnah according to his claim. So is the matter so? That is what I will explain shortly. But to clarify the truth, I say: The Doctor is not the first to come up with such a generalization; rather, he was preceded in it. Here is the scholar Suleiman Nadwi saying in his book (The Muhammadan Message) p. 63: (And among the books classified in Hadith are the Six Sahih Books). This generalization is very common in India, and I heard it often from some of its students at the Islamic University in Madinah and from others as well. Then the virtuous Doctor followed them in that and built his book on this generalization. So is it correct? The answer: No. And here is the explanation: This generalization is pure error because it contradicts the reality in these books other than the Two Sahihs, as decided by the scholars of this science in their books. It has had dangerous effects in diverting modern authors from criticizing the Hadiths found in them under the claim that they are from the 'Sahihs'. This is what the Doctor himself fell into; we find him satisfying himself with attributing the Hadith to some of the Sunan, so there is no difference for him between a Hadith narrated by Bukhari or Muslim and another narrated by Abu Dawood or others of the authors of the Sunan, whereas the duty is to look into the Hadiths of the Sunan due to the occurrence of [4]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 7
  },
  {
    "serial_number": "3365940",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "weak Hadiths in them. Imam An-Nawawi, may Allah Almighty have mercy on him, said in (At-Taqrib): (As for Al-Baghawi's division of the Hadiths of Al-Masabih into Hasan (Good) and Sahih (Authentic), intending by (Sahih) what is in the Two Sahihs and by (Hasan) what is in the Sunan, it is not correct, because in the Sunan there is the Sahih, the Hasan, the Da'if (Weak), and the Munkar (Objectionable)). As-Suyuti said in its explanation: (And whoever applied the term Sahih to them, like the statement of As-Silafi regarding the Five Books (meaning the Six excluding Ibn Majah): 'The scholars of the East and West agreed on their authenticity', and like Al-Hakim applying the name (Al-Jami' As-Sahih) to At-Tirmidhi, and Al-Khatib applying the name (As-Sahih) to it and to An-Nasa'i, then he has been lenient). He said in his (Alfiyyah): 'Abu Dawood narrates the strongest he found, then the weak where others were missing. And An-Nasa'i, those regarding whom they did not agree to abandon, and the others they attached. To the five, Ibn Majah, join; it is said: And whoever distinguished them, for in them is weakness. Lenient is he who applied 'Authentic' to them. And Ad-Darimi and Al-Muntaqa. And below them are Musnads, and the elevated among them is that of Ahmad and Al-Hanzali.' I say: There is no greater proof of the invalidity of this division and generalization than the fact that Tirmidhi himself explicitly stated the weakness of tens, widely hundreds, of Hadiths in his Sunan and revealed their defects. So how can it be correct to describe his book as (The Authentic Comprehensive Collection) or to judge every Hadith in it as Hasan? Something similar is said regarding Sunan Abi Dawood and Sunan An-Nasa'i, for they discuss some Hadiths at times and weaken them. As for what the scholars have weakened of the Hadiths of the two books, speak without restriction (there are many). Examples of that are very many, and whoever wishes to see a group of them should refer to our books: (Series of Weak and Fabricated Hadiths), (Takhrij Mishkat al-Masabih), and finally our book: (Critique of Hadith Texts by Sheikh Muntasir Al-Kittani). As for (Al-Muwatta) by Imam Malik, despite its majesty, it is not devoid of many Mursal (hurried) and Mu'dal (perplexing/disconnected) Hadiths, and some for which no origin was found at all, such as the Hadith (I do not forget, but [5]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 8
  },
  {
    "serial_number": "3365941",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "I am made to forget) (1), and some for which an origin was found by some Hadith scholars containing both Sahih and Da'if, so verification is necessary. Therefore, As-Suyuti said in (At-Tadrib p. 4): (Al-Khatib and others stated that Al-Muwatta takes precedence over all books of Jami' and Musanids. Based on this, it is after (Sahih Al-Hakim). I counted what is in (Muwatta Malik) and what is in (Hadith of Sufyan bin Uyainah) and found in each of them over five hundred Musnad (connected) Hadiths and over three hundred Mursal Hadiths. And in it are over seventy Hadiths that Malik himself refrained from acting upon, and in them are weak Hadiths, and the majority of scholars weakened them). I say: This is the truth to which every knower of this science who has studied the Hadiths of Al-Muwatta scientifically and closely bears witness. Anything said to the contrary is rejected by the testimony of reality and correct scientific criticism. As for the Musnad of Imam Ahmad, due to the abundance of its material, weak Hadiths abound in it, and this is a matter in which there is no disagreement among the people of knowledge. Al-Hafiz Al-Iraqi said: (As for the existence of the weak in it, it is verified; in fact, there are fabricated Hadiths in it which I collected in a section). As-Suyuti mentioned this in his book (p. 100), then he quoted Al-Hafiz Ibn Hajar refuting in his book (Al-Qawl Al-Musaddad fi Adh-Dhab 'an Al-Musnad) those who said there are fabricated Hadiths in the Musnad. I say: This is a point of disagreement and research, and Sheikh Al-Islam Ibn Taymiyyah has a middle opinion on it which there is no need to mention now. The intent is to explain that the existence of weak Hadiths in the Musnad is a matter agreed upon among the Hadith memorizers (Huffaz). The scholar Ahmad Shakir revealed this with a precise practical disclosure in his commentary on the new Musnad in his edition, may Allah have mercy on him and reward him well.",
    "foot_note": "1. (1) See the discussion on it and the explanation that it contradicts authentic Hadiths in (Series of Weak Hadiths) number (101) [6].",
    "book_id": "421",
    "new_page_number": 9
  },
  {
    "serial_number": "3365942",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "2 - His saying: (I relied in it firstly on the Sahihs of the Sunnah). I say: The error of applying this term (Sahihs of the Sunnah) to the Six Books, Al-Muwatta, and Al-Musnad, upon which the virtuous Doctor relied, has been explained previously. I want to clarify now another fact that appeared to me from my tracking of the book's Hadiths, which is: The total number of Hadiths in the book in its two parts, excluding the Hadiths of the (Two Sahihs), is eleven Hadiths. Two of them are in the first part and the rest in the other part. For Malik, there is only one Hadith, although he attributed it to Bukhari, so this spares him from attributing it to him in a book like his. For Ahmad, there are three, two of which are weak; one of them does not exist in his Musnad alongside its weakness. The rest are for the authors of the Sunan, of which two are weak: one for Tirmidhi and the other for Abu Dawood. Does this meager number relative to the size of the book, given that a third of it is weak, deserve this introduction for it with the statement: (I relied in it on the Sahihs of the Sunnah)? For anyone who reads this in the introduction imagines that the book is rich in material from the Hadiths of these books, but upon verification, he finds in it only this limited number. As for the four weak Hadiths, they are: First: He said on p. 216: (Some of the Companions said to him: O Messenger of Allah, invoke Allah against Thaqif. He said: O Allah, guide Thaqif and bring them. Narrated by Ibn Sa'd in (At-Tabaqat) and extracted by At-Tirmidhi in his Sunan, and Ibn Sa'd narrated it from Asim Al-Kinani from Al-Ashhab from Al-Hasan). The defect of the Hadith is the 'an'anah (usage of 'from' implying ambiguity) of Abu Az-Zubayr in At-Tirmidhi. I had verified it in the verification of (Fiqh as-Sirah) by Al-Ghazali (p. 432, Fourth Edition), so I will not repeat the speech on its verification. We criticize the Doctor in his verification of this Hadith on several points: [7]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 10
  },
  {
    "serial_number": "3365943",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "First: His attribution of it to Ibn Sa'd after At-Tirmidhi gives the impression that it was not extracted by someone of a higher class than him and those he relied upon in his book, which is not the case, for Ahmad extracted it, but its chain is interrupted (Munqati') as I explained in the previous source. Second: He should have mentioned in his verification Tirmidhi's statement on it (Hasan Sahih) because it is stronger for his verification. Perhaps he did not mention that relying on the fact that mere attribution to Tirmidhi is sufficient to authenticate it because it is from the (Sahihs) in his view. We say this to point out the best method in verification, although I do not agree with Tirmidhi on this statement due to the aforementioned defect in its chain. Third: His saying: (Narrated by Ibn Sa'd in At-Tabaqat... and Ibn Sa'd narrated it...) is a repetitive disruption in classification, especially in a footnote which does not tolerate elongation let alone repetition. Fourth: His saying: (And Ibn Sa'd narrated it from Asim Al-Kalabi from Al-Ashhab from Al-Hasan). An error; the correct version is as in the beginning of (The Raid of the Messenger of Allah, peace and blessings be upon him, on Ta'if) from (Tabaqat Ibn Sa'd) (2 / 159 - Beirut Edition): (And from Amr bin Asim Al-Kilabi, Abu Al-Ashhab informed us, Al-Hasan informed us). Fifth: This chain in Ibn Sa'd is not for this wording of the Hadith, but rather with the wording: (Indeed Allah did not give permission regarding Thaqif). As for the wording of the translation, it is found in his book just before this without a chain, so there is no benefit then in attributing it to him. Sixth: In the other wording, it is also weak because it is Mursal, and Mursal is from the category of Weak according to Hadith scholars, especially if it is from the Mursals of Al-Hasan, who is Al-Basri, for some Imams said regarding them: (The Mursals of Al-Hasan Al-Basri are like the wind) [8]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 11
  },
  {
    "serial_number": "3365944",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "The Second Hadith: He said (p. 232): (Imam Ahmad and others narrated that two and three men used to take turns on one camel, and severe thirst afflicted them until they began to slaughter their camels to squeeze their stomachs and drink their water. Narrated by Ibn Sa'd in his Tabaqat 3 / 220). I say: First regarding it: The unrestricted attribution to Ahmad implies technically his (Musnad), and this Hadith is not in it. Therefore, Al-Haythami did not include it in (Majma' az-Zawa'id), for if it were in it, he would have included it because it fits his criteria. Al-Hafiz As-Suyuti said in (Ad-Durr Al-Manthur) (3 / 286): (And Ibn Abi Hatim, Abu Ash-Sheikh, and Al-Bayhaqi in (Ad-Dala'il) extracted from Abdullah bin Muhammad bin Aqil (1) Abi Talib regarding the verse: {Those who followed him in the hour of difficulty} he said...) so he mentioned it. If the Hadith were in (Musnad Ahmad), he would not have left attributing it to him for attributing it to these who are below him. What makes its presence in it unlikely is that it is Mursal, for Ibn Aqil is a Tabi'i with weakness in him. Al-Hafiz said in (At-Taqrib): (Truthful, in his hadith is leniency, and it is said he changed at the end, from the fourth category). And the (Musnad) is specific to connected (Mawsul) Hadith as is known, and the Doctor imitated in this attribution the virtuous Sheikh Muhammad Al-Ghazali, for he is his predecessor in it in his book (Fiqh as-Sirah) (p. 440), from which the virtuous Doctor did not hesitate to apply this name to his book as well. He benefited from (1) Original: Muhammad bin Abdullah bin Aqil, which is an error I corrected from (Ibn Sa'd) and others [9]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 12
  },
  {
    "serial_number": "3365945",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "our verification of it without pointing to all of that with the slightest indication. I had left a blank space for this Hadith when I verified Al-Ghazali's book because I did not find it in the (Musnad). I say now: Al-Hafiz Ibn Kathir mentioned the Hadith in (Al-Bidayah) saying (5 / 9): (Imam Ahmad said: Abdur-Razzaq told us, Ma'mar told us, Abdullah bin Muhammad bin Aqil told us regarding His statement: {Those who followed him in the hour of difficulty} he said:) so he mentioned it. And Ibn Sa'd narrated it (172 - Beirut Edition) from another path from Ma'mar with it. It cannot be said: Why then did Al-Hafiz Ibn Kathir attribute it unrestrictedly as well? Because we say: When Al-Hafiz cited the Hadith with its chain and it was Mursal, that was an indication that he did not mean his (Musnad) as previously explained. Then Al-Hafiz cited from the path of Sa'id bin Abi Hilal from Utbah bin Abi Utbah from Nafi' bin Jubayr from Abdullah bin Abbas that it was said to Umar bin Al-Khattab, tell us about the hour of difficulty. So Umar said: so he mentioned it similarly without the verse. He said (Its chain is good/Jayyid). I say: I have a reservation about it because this Utbah was mentioned by Al-Hafiz in (Al-Lisan) saying: (He has narrations from Ikrimah but is not followed on them, Al-Uqayli said so) and Al-Hafiz agreed with him on that. However, perhaps Ibn Hibban considered him trustworthy or he was corroborated, for Al-Haythami said regarding this Hadith (6 / 195): (Al-Bazzar and At-Tabarani narrated it in (Al-Awsat) and the men of Al-Bazzar are trustworthy). I say: It has another defect which is Ibn Abi Hilal. Ahmad said: He became confused. Yes, it can be said: The Hadith is strong by the sum of the two paths, and Allah knows best. Ibn Hibban narrated it in his (Sahih) as in (Mawarid Az-Zam'an) (1707) but Utbah mentioned was dropped from its chain, so let it be noted [10]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 13
  },
  {
    "serial_number": "3365946",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "The Third Hadith: He said (p. 259): (And the news of the reconciliation on Jizyah (meaning with the delegation of Najran) was narrated by Abu Dawood in the Book of Tribute, Chapter on Taking Jizyah). I say: In its chain is Asbat bin Nasr Al-Hamdani, who is weak due to his poor memory. Al-Hafiz said in (At-Taqrib): (Truthful, makes many mistakes). And from the path of Abu Dawood, Ad-Diya' Al-Maqdisi extracted it in (The Selected Hadiths Not in Sahih Al-Bukhari and Sahih Muslim) (58 / 187 / 1), so notice is required. The Fourth Hadith: He said (p. 261) mentioning the Hadith of Adi bin Hatim's conversion in detail: (Narrated by Ibn Ishaq and Imam Ahmad and Al-Baghawi in his Mu'jam with similar wordings, and see Al-Isabah by Al-Hafiz Ibn Hajar: 2 / 461). I say: I returned to (Al-Isabah) and saw he said: (Ahmad and Al-Baghawi in his (Mu'jam) and others narrated from the path of Abu Ubaidah bin Hudhayfah who said: I was narrating the Hadith of Adi bin Hatim, so I said: This is Adi in the district of Kufa, so I came to him and he said...) I say: so he mentioned it similar to the context of the Doctor's book and simpler than it. Then I returned to (Musnad Ahmad) and found the Hadith in it (4 / 378 and 379) from the mentioned perspective. This Abu Ubaidah was not authenticated by anyone other than Ibn Hibban, and his authentication is lenient. Therefore, Al-Hafiz did not rely on him in (At-Taqrib), saying about him: (Acceptable), meaning when corroborated, otherwise the Hadith is lenient as stated in the introduction. Since the Hadith is not known except from his path, it is weak, especially since it is in the (Sahih) abbreviated without this context as will come. As for Ibn Ishaq, he presented it (4 / 227 - Ibn Hisham) without a chain, so there is no benefit in the Doctor attributing to him because Ibn Ishaq, if he cited the Hadith with the chain to the Prophet, peace and blessings be upon him, and did not explicitly state his hearing of it from his Sheikh who narrated it from him, it would not [11]\n\nbe accepted from him because he was a Mudallis (one who conceals defects in the chain), and thus you see the verifying scholars knowledgeable in this matter finding fault with hundreds of Hadiths due to the 'an'anah (ambiguous 'from') of Ibn Ishaq and other Mudallisin. So how can his Hadith be accepted if he made it Mu'dal (omitted links) and did not cite its chain? I do not know if this was hidden from the Doctor or if he ignored it for the necessity of authorship. I have seen him do much of this kind of useless attribution, and some examples of it have passed. Yes, Al-Bukhari extracted in (Al-Manaqib) from his (Sahih) from another path from Adi the end of the Hadith similarly. What is summarized from this chapter is that correctness was not the ally of the Doctor when he applied the term: (Sahihs of the Sunnah) to other than the Two Sahihs from the aforementioned books, and that we have proven to him the weakness of four Hadiths out of eleven he attributed to them. So what would be the case if their number had reached a hundred or hundreds? There is no doubt that the percentage of weakness in them would rise in proportion to the increase in them. If this is the condition of his Hadiths which he transferred from the (Sahihs) as he claimed, then what is the condition of the other Hadiths which he transferred from the books of Sirah while indicating that there are things in these books that are not authentic and stating that he only relied on what is authentic of the news in them? That is what I want to investigate in the next chapter, Allah willing.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 14
  },
  {
    "serial_number": "3365948",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "3 - The Doctor said previously: (Secondly: [I relied] on what is authentic of the news of the Biography in its books, and the most important of what I relied upon from that are Sirah of Ibn Hisham and Tabaqat of Ibn Sa'd). I say: How delighted I would have been if the Doctor were truthful in this statement of his. Before I explain what is in it, I turn to his virtue, if he permits, with the following question: What are the rules and principles upon which you relied when you judged authenticity upon the news you included in the book? If they are principles that you [12]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 15
  },
  {
    "serial_number": "3365949",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "alone established and adopted as terminology, then please explain them so we may look into them and show you their invalidity, along with your departure from following the Imams, a matter which you disapprove of in others regarding lesser things when they follow evidence in disagreement. So how is it that you contradicted all of them? And if they are the rules known in the science of Noble Hadith, permit me to say to you frankly: You are between two matters: - Either you are knowledgeable of them but did not adhere to them, rather did not pay attention to them at all to see if they apply to the referred news or not? - Or you have no knowledge of them at all. I ask the readers' pardon for this frankness because I felt pained for this science, absolute pain, that someone like the Doctor would transgress against it a transgression the likes of which I do not know in what I have known. Tens of reports cannot be authentic according to scientific rules, yet he presents them to students as authentic reports. So to Allah is the complaint. Here are the reports which he attributed to some of the sources he mentioned in his previous statement explicitly and implicitly which do not have authentic chains. As for the reports which he released without attribution to anyone, I did not find great benefit in wasting time investigating them and explaining what is not authentic among them. So I say: The First Report: He said (1 / 36): (He, peace be upon him, said narrating about himself: 'I did not intend anything of what they used to do in Jahiliyyah except twice; in all of that Allah intervened between me and it. Then I did not intend it until Allah honored me with the Message. I said one night to the boy who was herding with me in upper Mecca: If you would watch my sheep for me until I enter Mecca and chat in it as the young men chat. He said: I will do so. So I went out until I was at the first house in Mecca, I heard playing (music). I said: What is this? They said: A wedding. So I sat to listen, and Allah struck my ears (with sleep) so I slept. nothing woke me except the heat of the sun... Then I said to him another night the like of that, and I entered Mecca like the first night... Then I did not intend evil after that'). [13]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 16
  },
  {
    "serial_number": "3365950",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Narrated by Ibn Al-Athir and narrated by Al-Hakim from Ali bin Abi Talib and he said about it: Authentic on the condition of Muslim, and narrated by At-Tabarani from the Hadith of Ammar bin Yasir). I say: This Hadith is weak. The Doctor's deception by Al-Hakim's authentication of it on the condition of Muslim indicates that he has no knowledge of Al-Hakim's leniency in authentication in his book (Al-Mustadrak) as is known to those occupied with this noble science. The books of Terminology are full of warnings about that. As-Suyuti said in his Alfiyyah: (And how much leniency is in it until Objectionable (Manakir) and Fabricated (Mawdu') reports appeared in it to be rejected). Therefore, Al-Hafiz Adh-Dhahabi wrote his book (At-Talkhis) on it and critiqued him in hundreds of fabricated Hadiths that Al-Hakim narrated in (Al-Mustadrak), although he sometimes goes along with him in authenticating some Hadiths while having stated their weakness in some of his other books. This chain has two defects which I explained in (Takhrij Fiqh as-Sirah by Al-Ghazali) (p. 32 - 33), and I quoted there from Al-Hafiz Ibn Kathir that he said: (This Hadith is very Gharib (strange), and it may be from Ali himself, meaning stopped (Mawquf) at him). As for the Hadith of At-Tabarani from Ammar, it contains a group who are unknown as Al-Haythami said in (Al-Majma'), and I mentioned it in the mentioned (Takhrij) (1). The Doctor, may Allah heal us and him, came across it and summarized his verification of the Hadith from it, except his saying: (Narrated by Ibn Al-Athir), which is from himself, meaning from his history. I rise above such attribution because it is not the character of verifiers to rely on Mursal and Mu'dal reports that are sent without a chain, especially if it is a Hadith like this which does not agree with his perfection, peace and blessings be upon him, and his infallibility, despite the interpretation offered by",
    "foot_note": "1. (1) I add here and say: The Hadith of Ammar contradicts the Hadith of Ali, for in it is: (... upon his appointment. As for one of them, my eyes overcame me, and as for the other, a chatting companion of my people intervened between me and it) [14].",
    "book_id": "421",
    "new_page_number": 17
  },
  {
    "serial_number": "3365951",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "the Doctor (p. 39 - 40) regarding it. For interpretation is a branch of authentication, and we need to close some gaps through which the biased of various sects penetrate with correct scientific Hadith criticism. So if the Hadith is not authentic, then there is no justification for interpretation by agreement. Second: He said (1 / 60): (Therefore it was narrated that the Prophet, peace and blessings be upon him, said after the revelation of the verse: I do not doubt nor do I ask. Narrated by Ibn Kathir from Qatada). Thus spoke the poor Doctor: (Narrated by Ibn Kathir). Since when was Ibn Kathir a narrator? For a person to say: 'Narrated by so-and-so' means according to scholars 'with his chain of transmission'. Therefore, it is not permissible for them to say: 'Narrated by Al-Bukhari' regarding a Hadith he has without citing its chain; rather, referring to that, he says: 'Narrated by Al-Bukhari in a suspended manner (Mu'allaqan)'. So in this statement of the Doctor is an illusion for the reader who has no knowledge of Ibn Kathir's method of mentioning Hadith that he narrated it with his chain. The correct way is to say: (Ibn Kathir said: Qatada said: It reached us that the Messenger of Allah, peace and blessings be upon him, said). So he mentions it because he is the one quoted by Ibn Kathir, and there is no illusion in it; rather, it explicitly states that the Hadith reached Qatada and he did not hear it from any of the Companions, so it is Mursal, thus weak. Ibn Jarir extracted it in his (Tafsir) (11 / 116) from two paths from Qatada, so it is established from him as Mursal. Yes, it has been narrated as connected (Mawsul); Ibn Al-Mundhir, Ibn Abi Hatim, Ibn Mardawayh, and Ad-Diya' in (Al-Mukhtara) extracted it from Ibn Abbas, may Allah be pleased with them both: {So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you}: The Messenger of Allah, peace and blessings be upon him, did not doubt and did not ask. Mentioned in (Ad-Durr Al-Manthur) (3 / 317). I say: This, despite differing somewhat from the Mursal of Qatada - for in this is a report from Ibn Abbas that the Prophet, peace and blessings be upon him, did not doubt and did not ask, and in the Mursal implies that the Prophet, peace and blessings be upon him, said about himself: (I do not doubt nor do I ask). I say: With this difference in wording, I [15]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 18
  },
  {
    "serial_number": "3365952",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "do not know the condition of the chain of this connected report. It is regrettable that none of the sources to which the Hadith was attributed exists in printed or manuscript form, except for (Al-Mukhtara) by Ad-Diya' Al-Maqdisi. Volumes of it in the author's handwriting, may Allah have mercy on him, are still preserved in the protected Zahiriyah Library, arranged by the Musnads of the Companions. I returned to the Musnad of Ibn Abbas in it, the number of its pages reaching about (460), and I went through all of them searching for this Hadith but did not find it, sadly. Perhaps he placed it in the margins of some pages where he used to add what he missed, writing in fine script, or in some added and lost papers. Yes, I found in it (61 / 266 / 1) another Hadith narrated from the path of Abu Dawood, and this is in his (Sunan) (2 / 331) with a good chain from Ibn Abbas from the narration of Abu Zamil who said: (I asked Ibn Abbas saying: What is this thing I find in my chest? He said: What is it? I said: By Allah, I will not speak of it. He said: Then tell me: Is it something of doubt? He said: And he laughed. He said: No one was saved from that until Allah Almighty revealed (So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you... the Verse). He said: So he said to me: If you find something in yourself, say {He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing}). This, as you see, is different from the Hadith we are discussing, and I consider it very unlikely that As-Suyuti meant it in what he attributed to Ad-Diya', and Allah knows best. Third: He said (1 / 97 - 98): (The first delegation to come to the Messenger of Allah, peace and blessings be upon him, from outside Mecca... They were some thirty men from the Christians of Abyssinia who came with Ja'far bin Abi Talib... So regarding them was revealed His saying: {Those to whom We gave the Scripture before it - they are believers in it...} Narrated by Ibn Ishaq, Muqatil, and At-Tabarani from Sa'id bin Jubayr, and see Ibn Kathir, Al-Qurtubi, and An-Nisaburi). [16]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 19
  },
  {
    "serial_number": "3365953",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "I say: These are all Mursals (disconnected chains), and there is nothing Musnad (connected) in them. When Ibn Ishaq narrated it in the Sirah (2 / 32 - Ibn Hisham), he suspended it as a comment and did not mention a chain for it. The narrations, despite being Mursal, differ severely in specifying regarding whom the mentioned verses were revealed and in their number, as you see in some of the sources the Doctor ordered to refer to, such as Tafsir Al-Qurtubi (13 / 296), and better than it in this is (Ad-Durr Al-Manthur) by As-Suyuti (5 / 131 - 133). The narration of At-Tabarani from Sa'id bin Jubayr was not mentioned by Al-Haythami in (Al-Majma') (7 / 88), so Allah knows best about the correctness of this attribution. Ibn Abi Hatim narrated it from Sa'id as in (Ad-Durr), and despite being Mursal, it is different from the book's narration. This is actually Ibn Ishaq's, but he has it that their number was twenty men. Furthermore, it is strange that the Doctor asserts that the mentioned verses were revealed regarding those Abyssinians and attributes that to Ibn Ishaq, while the latter did not assert that. He said before his saying: (So regarding them was revealed...): (It is said: The group of Christians were from the people of Najran, so Allah knows best which of that it was). Then he also did not assert - contrary to the Doctor - that the verses were revealed regarding them, for he followed his previous statement by saying: (So it is said - and Allah knows best - regarding them were revealed these verses {Those to whom We gave the Scripture...}). This is how Ibn Kathir mentioned it in his (Tafsir) from Ibn Ishaq. So how did the Doctor justify asserting firstly that the verses were revealed regarding those persons when there is no authentic chain for that? And secondly, how does he attribute that to Ibn Ishaq when he doubted it and did not assert it? Is this the action of one who says: (I relied on what is authentic of the news of the Biography). Is this and that and what is coming from what is authentic... O virtuous Doctor? So to [17]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 20
  },
  {
    "serial_number": "3365954",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Allah is the complaint from this flagrant ignorance of the second origin of the Law, and there is no power or might except with Allah. Fourth: He said (1 / 101) after mentioning the death of Khadijah and his uncle Abu Talib in the tenth year of his mission, peace and blessings be upon him: (And the Prophet, peace and blessings be upon him, named this year the (Year of Sorrow) due to the severity of the hardships he endured in it for the sake of the Call). I say: From which trusted source did the Doctor take this report? And is its chain - if it has a chain - proof? For after extensive searching for it, I did not find it. Sheikh Al-Ghazali cited it in his book (Fiqh as-Sirah) without attribution. Perhaps the Doctor imitated him in that, although Al-Ghazali, may Allah Almighty preserve him, did not claim what the Doctor claimed: (That he relied on 'Sahihs of the Sunnah' and 'on what is authentic of the news of Sirah books'). So what applies to the Doctor does not apply to him, even if the correct scientific method obligates relying on authentic reports, otherwise at least mentioning the report with the source enabling the researcher to verify it. This is what verifying scholars do through methods of Takhrij and criticism, like Al-Hafiz Ibn Kathir and others, contrary to the Doctor and his likes from the authors who are mere transporters, gatherers, and collectors. Despite asserting the authenticity of this report by saying: (And he named...), he does not at least mention its source. So from where did he know its authenticity? Therefore, this authenticity and others are merely a claim or whim from the Doctor, nothing more. What indicates this is that the only source I saw that cited it is Al-Qastallani in (Al-Mawahib Al-Ladunniyyah), mentioning nothing more than: (In what Sa'id mentioned). This Sa'id is Ibn Ubayd Al-Ijli as Az-Zarqani said in his commentary on it (1 / 244). So what is the status of this Sa'id? He is unknown, not recognized, and no one authenticated him; rather, Al-Hafiz indicated that he is lenient in Hadith if not corroborated, as is his case in this report. Moreover, Al-Qastallani's statement: (Mentioned [18]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 21
  },
  {
    "serial_number": "3365955",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "by Sa'id) implies that he mentioned it suspended without a chain, so it would be Mu'dal (missing links), thus the report is weak and not authentic even if Sa'id were known for trustworthiness and memory. Far from it, far from it. Fifth: He mentioned (1 / 105 - 107) the story of his going, peace and blessings be upon him, to Ta'if, his call to Thaqif, their wounding his noble head with stones, and his supplication, peace and blessings be upon him: (O Allah, to You I complain of the weakness of my strength, the paucity of my resourcefulness, and my insignificance before people...) and his story with Addas the Christian and Addas falling upon him, peace and blessings be upon him, kissing his head, hands, and feet. He mentioned a source for it (Tabaqat Ibn Sa'd and Tahdhib as-Sirah by Ibn Hisham). I say: As for (At-Tabaqat), it did not mention of the whole story except a few letters. Even so, it is in it (1 / 211 - 212) from the statement of Muhammad bin Umar without a chain. It is highly probable that the Doctor does not know that this Ibn Umar is Al-Waqidi, the Abandoned (Matruk), as will come. As for (Tahdhib as-Sirah), he mentioned it (2 / 60) from the path of Ibn Ishaq with a Mursal chain for him, except for the supplication, for which he did not cite a chain. He said: (When the Messenger of Allah, peace and blessings be upon him, rested, he said - according to what was mentioned to me -: O Allah...). At-Tabarani extracted the story in summary - containing the supplication - with his chain from Ibn Ishaq with his chain from Abdullah bin Ja'far. Ibn Ishaq is a Mudallis and he used 'an'anah (said 'from'), so I weakened the Hadith in (Takhrij Al-Fiqh) (p. 132). The Doctor is aware of that, so he neither benefits from such verification there nor brings what contradicts it to be looked into. Instead, he suffices with mere attribution to the two previous sources while knowing that they contain what is not authentic, then he claims that he relied on what is authentic in them. Sixth: He said (1 / 101): (Ibn Hisham says: And the Messenger of Allah, peace and blessings be upon him, entered his house with dust on his head. One of his daughters stood up and began washing the dust from him while crying, and the Messenger of Allah, peace and blessings be upon him, was saying to her: Do not cry, O my daughter, for Allah is the protector of your father). [19]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 22
  },
  {
    "serial_number": "3365956",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "I say: Ibn Hisham extracted it in (As-Sirah) (2 / 58) from the path of Ibn Ishaq with his authentic chain from Urwah bin Az-Zubayr who said: so he mentioned it. Urwah is a Tabi'i who did not witness the incident, so it is Mursal, and Mursal is from the categories of weak Hadith according to Hadith scholars. Perhaps the Doctor knows that, so the report would not be considered authentic to him. Why then did he include it when it does not meet his condition? Or perhaps he thinks that Urwah is a Companion like his brother Abdullah bin Az-Zubayr, and that is not far from his knowledge of this noble science. From that is his prefixing it with the statement: (Ibn Hisham says), for this is only said by scholars regarding what is suspended without a chain, as I will explain in the next Hadith. The reality here is that Ibn Hisham mentioned his chain as you saw, so the mentioned prefix is a clear error. The correct phrasing is: (Ibn Hisham narrated). And Ibn Sa'd narrated likewise. The Seventh Hadith: He said (1 / 124): (Ibn Sa'd says in his Tabaqat Vol 1 p 200 and 201: The Messenger of Allah, peace and blessings be upon him, used to attend the season every year following the pilgrims... and saying: O people, say there is no deity worthy of worship except Allah, you will succeed, you will possess the Arabs, and the non-Arabs will submit to you, and if you believe, you will be kings in Paradise. And Abu Lahab was behind him saying: Do not obey him...). I say: First regarding it: His prefixing this Hadith with the statement (Ibn Sa'd says) implies in the terminology of Hadith scholars that it is a suspended (Mu'allaq) Hadith in Ibn Sa'd, meaning he did not cite its chain, but the matter is not so as will come. It is known among scholars that in Sahih Al-Bukhari there are many suspended Hadiths from the Prophet, peace and blessings be upon him, or some of his Companions. If a student of knowledge wants to quote something from these Hadiths, he does not say in them: (Al-Bukhari narrated) because this expression is specific to connected Hadiths. Rather, he says indicating that: (Al-Bukhari said: The Messenger of Allah, peace and blessings be upon him, said... or The Messenger of Allah, peace and blessings be upon him, was...). He does not say in this genre (Al-Bukhari narrated) as we mentioned unless he qualifies that by saying (Al-Bukhari narrated suspendedly). Just as he does not say in the connected genre of Hadiths 'Al-Bukhari said: The Messenger of Allah, peace and blessings be upon him, said' because it implies it is from the suspended ones in his book. This is what the virtuous Doctor fell into by prefixing [20]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 23
  },
  {
    "serial_number": "3365957",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "the Hadith with the mentioned statement, thus giving an impression contrary to reality, either due to lack of knowledge of the difference between the expressions (Said) and (Narrated) or due to his negligence in expression. The former is more fitting to his condition indicated by his style in his book and the abundance of his errors in it. Among that is his saying regarding what Ibn Kathir suspended: (Narrated by Ibn Kathir) as previously noted in the Second Hadith (p. 15). Second: The Hadith in Ibn Sa'd is from the path of his Sheikh Muhammad bin Umar, saying: Muhammad bin Umar informed us, saying: Ayyub bin An-Nu'man told me... so he mentioned several chains for it, all of them Mursal. Along with their disconnected nature, his mentioned Sheikh is accused of lying, and he is the famous Al-Waqidi, author of the book (Al-Maghazi) printed in India then in Egypt. My thought is that the Doctor does not know that this Muhammad bin Umar is Al-Waqidi, and if he knows that, my thought is that he does not know anything of his biography according to Hadith scholars. Therefore, I quote the testimony of two famous Hadith memorizers. Imam Adh-Dhahabi said in his book (Ad-Du'afa' wal-Matrukin - The Weak and Abandoned Narrators): (Muhammad bin Umar bin Waqid Al-Waqidi; An-Nasa'i said: He fabricates Hadith. Ibn Adi said: His Hadiths are not preserved, and the calamity comes from him). Al-Hafiz Ibn Hajar said in (At-Taqrib): (Abandoned (Matruk) despite the breadth of his knowledge), meaning he is severely weak in narration (1). I only thought that the Doctor does not know that due to the command to have good opinion of a Muslim. Otherwise, is it conceivable that the Doctor knows Al-Waqidi's condition and the fall of his narration, and knows",
    "foot_note": "1. (1) I say: Therefore, no one should be deceived by what Ibn Sayyid An-Nas went to in the introduction of his book (Uyun al-Athar) regarding the authentication of Al-Waqidi, for he contradicted what the verifying Imams, old and new, are upon, and due to its contradiction with the science of Terminology regarding the obligation of prioritizing explained criticism (Jarh Mufassar) over authentication (Ta'dil). And what criticism is stronger than fabrication? Imam Ash-Shafi'i, whom Al-Buti claims to imitate, also accused him of it, as did Abu Dawood and Abu Hatim, and Ahmad said: A liar [21].",
    "book_id": "421",
    "new_page_number": 24
  },
  {
    "serial_number": "3365958",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "at the same time that Muhammad bin Umar mentioned in the chain of this Hadith is this accused Al-Waqidi, yet he ignores this fact and narrates several Hadiths for him from the narration of Ibn Sa'd from him? This is very far from the requirement of good opinion of him regarding his scientific honesty as well, especially since he explicitly stated in the introduction of his book that he relied on what is authentic of reports in Sirah books. Including such flimsy Hadiths compels us to assume one of two things: either he does not know, or he knows and does not act upon what he knows. Since it is established among scholars that if a person falls between two evils, he chooses the lesser of them, we said regarding the Doctor: He does not know. I do not think he prefers the other matter over it. It must be one of them, and the sweeter of them is bitter. What witnesses to what I say is: This Hadith was extracted by Imam Ahmad in (Al-Musnad) (3 / 492 and 4 / 63, 341 and 5 / 376) and Al-Bayhaqi with chains from more than one Companion. One of them is in Ibn Ishaq's (Sirah) (2 / 64 - 65) similarly. One of Ahmad's chains is authentic. Al-Bayhaqi also extracted it as in (Al-Bidayah) (3 / 139). Its first part has a witness in (Al-Mustadrak) (2 / 624) from the Hadith of Jabir at length, and he authenticated it and Adh-Dhahabi agreed. I say: If the Doctor knew these paths and knew that severe weakness in Ibn Sa'd's path due to the accused Al-Waqidi, do you think, O reader, that he would prefer this path over those paths while knowing? As for me, I think only good. What supports what I mentioned is the following Hadith: The Eighth Hadith: He said (1 / 147): (Ibn Sa'd said in his Tabaqat narrating from Aisha, may Allah be pleased with her: When the seventy returned from the Messenger of Allah, peace and blessings be upon him, his soul was pleased...). I say: In its chain in Ibn Sa'd (1 / 225 - Beirut Edition) is Muhammad bin Umar Al-Aslami, who is Al-Waqidi, and you have known from the previous Hadith that he is accused of lying and fabrication, and that the Doctor does not know that [22]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 25
  },
  {
    "serial_number": "3365959",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Furthermore, his saying: (Ibn Sa'd said narrating...) is not a scientific expression, for the intended meaning is unclear: Did he narrate it connected or suspended? Refer to the discussion on the Seventh Hadith (p. 20 - 21) and the Second Hadith which was pointed to there. The Ninth Hadith: He said (1 / 153) in the story of the Hijrah: (So Gabriel, peace be upon him, came to the Messenger of Allah, peace and blessings be upon him, ordering him to migrate and forbidding him to sleep in his bed that night. Sirah of Ibn Hisham (1 / 155) and Tabaqat of Ibn Sa'd (1 / 212)). I say: It is in Ibn Sa'd from the narration of Al-Waqidi the liar mentioned previously. In Ibn Hisham's chain is one who is unnamed. He narrated it from the path of Ibn Ishaq. Likewise, Abu Nu'aym extracted it in (Dala'il an-Nubuwwah) (p. 63), then extracted it from the path of Al-Fadl bin Ghanim who said: Salamah bin Al-Fadl told us from Muhammad bin Ishaq who said: Abdullah bin Abi Najih told me from Mujahid bin Jabr Al-Makki from Abdullah bin Abbas. This is a connected chain, but Al-Fadl and his Sheikh Salamah are weak. In (As-Sirah) it is like this: Ibn Ishaq said: So one whom I do not accuse from our companions told me from Abdullah bin Abi Najih... So he dropped one of these two weak narrators from the chain, the unknown Sheikh of Ibn Ishaq who was not named, so the chain appeared connected with no ignorance in it. That is from the calamities of the weak narrators and their deceptions which may not be intentional from some of them. So whoever is not knowledgeable about their conditions and does not take caution from their narrations goes astray through them while unaware. The Tenth Hadith: He said (1 / 157): (And maidens from Banu Najjar came out - in what Ibn Hisham narrates - joyful at the arrival of the Prophet, peace and blessings be upon him, and his neighborhood to them, singing: We are maidens from Banu Najjar, O how excellent is Muhammad as a neighbor. So he, peace be upon him, said to them: Do you love me? They said: Yes. He said: O Allah knows that my heart loves you). I say: I did not see this in Ibn Hisham in (As-Sirah). Al-Hafiz Ibn Kathir mentioned [23]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 26
  },
  {
    "serial_number": "3365960",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "something similar in (Al-Bidayah) (3 / 199 - ..) from the narration of Al-Bayhaqi in (Dala'il an-Nubuwwah) with his chain from Ibrahim bin Sirma with his chain from Anas who said: so he mentioned it with the wording: (So maidens from Banu Najjar came out beating drums and saying...) so he mentioned it. Al-Hafiz said: (This Hadith is Gharib (strange) from this perspective). I say: Its defect is Ibn Sirma; Ibn Ma'in said about him: A wicked liar, and others weakened him. Ibn Majah extracted it in his (Sunan) (1 / 587) and Al-Bayhaqi from another path from Anas with it, and it does not say that this was upon his arrival in Medina, and its chain is authentic. Rather, in (Sahih Al-Bukhari) and others from a third path from Anas, it states that this was at a wedding, but he did not mention the poem. The Eleventh Hadith: He said (2 / 8): (And it was said to him: Shall we not roof it - meaning the Mosque of Medina - he said: (A trellis like the trellis of Moses: logs and panic grass - a weak short plant - the affair is quicker than that). Tabaqat Ibn Sa'd 2 / 5). I say: It contains Al-Waqidi, who is a liar as mentioned repeatedly. Even so, its chain ends at Az-Zuhri (1 / 239 - 240 Beirut Edition), so it is Mursal. If the Doctor had tasked himself with a little research, he would have found paths that suffice him from relying on the narration of the mentioned liar. But he was content with the few sources he had, then he did not care after that not to fulfill the promise he made to himself to rely on authentic reports. For the Hadith has come from numerous paths by which it ascends to the degree of Hasan (Good) at the very least. Ibn Abi Shaybah extracted it in (Al-Musannaf) and Ibn Abi Ad-Dunya in (Qasr Al-Amal) (manuscripts) from Al-Hasan Al-Basri as Mursal, and the chain to him is authentic. And Abu Sa'id Al-Mufaddal Al-Jandi in (Book of Virtues of Medina) (manuscript) from Rashid bin Sa'd as Mursal, and its chain is authentic as well. And Abu Hamid Al-Hadrami in (His Hadith) and Al-Mukhallis in (Al-Fawa'id Al-Muntaqah) [24]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 27
  },
  {
    "serial_number": "3365961",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "(9 / 193 / 1) and Ad-Diya' Al-Maqdisi in (Al-Ahadith Al-Mukhtara) (manuscripts) from Abu Ad-Darda' as Marfu' (elevated to Prophet). And Ibn Abi Ad-Dunya also from Ubadah bin As-Samit. I have verified its chains in my book: (Series of Authentic Hadiths) in the second volume number (616) and hopefully it will be printed soon, Allah willing (1). I say: All these paths by which the Hadith is strengthened were neglected by Dr. Al-Buti, and he did not attribute it to any of those extractors - despite their number - thus reducing the strength of the Hadith. This is something impermissible according to Hadith scholars by agreement. This is not only due to Al-Buti's ignorance of them as is his case in others, but also due to his inability and short reach in verification (Takhrij). Otherwise, he is the one who says as will come: (And it is not appropriate during verification to limit oneself to mentioning the weak path and remaining silent about the authentic or agreed-upon path, due to the clear illusion in that which Hadith scholars avoid). See Hadith (Twenty-Four) below and our comment on it to see the strange wonders from this pseudo-learned Doctor. The Twelfth Hadith He said: (2 / 18): (Ibn Hisham narrated that the Prophet, peace and blessings be upon him... wrote a document between the Emigrants (Muhajirin) and the Helpers (Ansar), in which he made a treaty with the Jews, covenanted with them, confirmed them in their religion and properties, and set conditions for them and upon them). I say: This is of unknown authenticity. Ibn Hisham narrated it in (As-Sirah) (2 / 147) saying: Ibn Ishaq... so he mentioned it like this without a chain, so it is Mu'dal. Ibn Kathir transferred it (3 / 224 - 225) from Ibn Ishaq and did not add to it",
    "foot_note": "1. (1) Then it was printed, praise be to Allah, in the Islamic Office [25].",
    "book_id": "421",
    "new_page_number": 28
  },
  {
    "serial_number": "3365962",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "in his verification anything, contrary to his habit, which indicates that it is not famous among the people of knowledge and acquaintance with Biography and chains of transmission. The Thirteenth Hadith: He said (3 / 29): (So Al-Hubab bin Al-Mundhir said: O Messenger of Allah, do you see this station? Is it a station Allah made you settle in, so we have no right to advance...?) I say: It is in Ibn Hisham in (As-Sirah) (2 / 272). Ibn Ishaq said: I was told from men of Banu Salamah that they mentioned that Al-Hubab... This is a Mursal unknown chain, so it is weak. Some connected it, but it contains one who is not known and another who is a liar, as I verified in Al-Ghazali's book (p. 240). Adh-Dhahabi said about it: (A Munkar (Objectionable) Hadith). So where is the authenticity you promised, O Doctor? Especially since you built upon it a chapter you titled (2 / 37) (Categories of his actions, peace and blessings be upon him). The Fourteenth Hadith: He said (2 / 44): (Ibn Hisham narrated from Muhammad bin Ishaq that a woman from the Arabs came with goods of hers and sold them in the market of Banu Qaynuqa... so they began trying to make her uncover her face, but she refused...). I say: Its chain is Mursal suspended (Mu'allaq). Ibn Hisham said (3 / 51): (And Abdullah bin Ja'far bin Al-Miswar bin Makhramah mentioned from Abu Awn who said...) so he mentioned it. Abu Awn's name is Muhammad bin Abdullah Ath-Thaqafi Al-Kufi Al-A'war, died in year (116). He is a junior Tabi'i, so he did not witness the incident. Abdullah bin Ja'far Al-Makhrami is from the Sheikhs of Imam Ahmad, died in year (170), so between him and Ibn Hisham [26]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 29
  },
  {
    "serial_number": "3365963",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "are wastelands, so it is a weak chain, apparently weak. It is strange that the Doctor uses such to argue for the obligation of a woman covering her face, while even if it were authentic, it would indicate no more than the legitimacy of that. As for obligation, from where? I mentioned in my book (The Muslim Woman's Veil) the disagreement of jurists on that and that the majority hold it is recommended to cover, not obligatory, and I verified that this is what the evidence requires, so whoever wishes may refer to it. Furthermore, some of our brothers here from the students of the College of Sharia, when they saw this, asked about the date of the raid of Banu Qaynuqa in which this incident occurred? I said to him: What is behind that? He said: The verse of Hijab was revealed in the raid of Al-Ahzab (The Confederates) as is known, so if the first raid was before this, it would be proof that the woman's veil in the incident was not due to a command in the Verse. I said: You spoke the truth. We looked and found that the first raid was mentioned in Sirah books before Al-Ahzab. The Doctor himself followed that, saying: It was in the third year of Hijrah, and Al-Ahzab was in the year five, and it is said year four. This indicates that when the Doctor studied the incident, he did not recall in his mind that it was before the revelation of the Verse, and that the woman's covering of her face, if authentic, was not a religious obligation she had to adhere to, but rather chastity from her. What supports this is what is in Al-Bukhari that Aisha and Umm Salamah, their ankle bracelets were seen on the day of Uhud while they were carrying water skins on their backs. Al-Hafiz Ibn Hajar said: (This incident was before the Hijab) (1). I say: And the raid of Uhud was after the raid of Banu Qaynuqa as well. The Fifteenth Hadith He said (2 / 49): (And to explain this rule, the Messenger of Allah, peace and blessings be upon him, says: We were ordered to judge by the apparent, and Allah handles the secrets).",
    "foot_note": "1. (1) See my book (The Muslim Woman's Veil) (p. 18) printed by the Islamic Office [27].",
    "book_id": "421",
    "new_page_number": 30
  },
  {
    "serial_number": "3365964",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "I say: The rule referred to is correct, but the mentioned Hadith is not authentic; rather, it has no basis/origin (La Asla Lahu) as stated by Hadith scholars like Al-Hafiz Al-Iraqi, Al-Asqalani, As-Sakhawi, As-Suyuti, and others. He said in (Al-Maqasid Al-Hasanah in Explaining Many Hadiths Famous on Tongues) (p. 91 No. 178): (It has no existence in the famous books of Hadith nor the scattered parts, and Al-Iraqi asserted that it has no basis (1), and Al-Mizzi and others denied it as well). Likewise in (Kashf Al-Khafa') by Al-Ajluni (1 / 192 / 585) and other books written to distinguish the authentic from the inauthentic Hadith. So did the Doctor not read anything of them at all until he fell into this fabrication against the Messenger of Allah, peace and blessings be upon him? Or does he have a special opinion contradicting the judgment of Hadith Imams and scholars? It would have been possible for him, if he were guided by their guidance and knowledgeable about Hadith, to argue for the referred rule by his saying, peace and blessings be upon him: (You bring disputes to me, and perhaps some of you are more eloquent in their argument than others, so I judge for him according to what I hear. So whoever I judge for him with something of his brother's right, let him not take anything of it). Added in a narration: (For I only cut for him a piece of Fire). Extracted by the two Sheikhs in their Sahihs from the Hadith of Umm Salamah, may Allah be pleased with her. An-Nasa'i titled it, then An-Nawawi in (Sahih Muslim), as (Chapter on Judging by the Apparent). It is verified by me in (Irwa' Al-Ghalil) (2702) and (Series of Authentic Hadiths) (1192) (2).",
    "foot_note": "1. (1) Likewise in (Takhrij Al-Ihya') (4 / 283) by him, and he said: (And Al-Mizzi said likewise when asked about it). There is no doubt that Al-Buti read (Al-Ihya') even once, so did he not read Al-Hafiz Al-Iraqi's verification of it to know from it the weak Hadith and what has no basis? Or is this a science of no value to him because it became a science of those whom the Doctor stigmatizes as (Wahhabis), so he does not want to resemble them?\n2. Then I came across the third edition of the Doctor's book, and found that he had replaced that false Hadith with this authentic one. However, he also did wrong when he did not mention the one who deserves credit for that, the virtuous Professor Eid Abbasi, for he had criticized him in his book (The Innovation of Fanaticism) and explained to him briefly that it is a Hadith with no basis. So it was upon the Doctor to explain that and thank him for it, due to his saying, peace and blessings be upon him: (Whoever does not thank people does not thank Allah). Yet, he fell into another calamity there which he was not preceded in, where he elevated a Hadith to the Messenger of Allah, peace and blessings be upon him, from the narration of Al-Bukhari, while it is stopped (Mawquf) at Umar in his book, as will come in the seventh chapter of the (Addendum) by Allah's permission [28].",
    "book_id": "421",
    "new_page_number": 31
  },
  {
    "serial_number": "3365965",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Sixteenth Hadith (2 / 68): (Ibn Hisham narrated that the Prophet, peace and blessings be upon him, said to his companions: Who is the man who will look for me what Sa'd bin Ar-Rabi' did? Is he among the living or the dead?...) I say: He said in (As-Sirah) (3 / 100): Ibn Ishaq said: So the Messenger of Allah, peace and blessings be upon him, said as Muhammad bin Abdullah bin Abdur-Rahman bin Abi Sa'sa'ah Al-Mazini, brother of Banu Najjar, told me...) so he mentioned it. I say: This is a Mu'dal (missing links) chain. It was narrated as connected as I explained in (Takhrij Fiqh as-Sirah by Al-Ghazali) (289 - 290). The Seventeenth Hadith He said (2 / 174): (And the Messenger of Allah, peace and blessings be upon him, said to them: The commander of the people is Zayd bin Harithah, if he is killed then Ja'far bin Abi Talib, if he is killed then Abdullah bin Rawahah, if he is killed then let the Muslims choose a man and make him over them. Narrated by Al-Bukhari, Ahmad, and Ibn Sa'd in (his Tabaqat), but in Al-Bukhari there is not: (if he is killed then let the Muslims choose a man from them). I say: There are issues in this: First: His saying rectifying: (But in Al-Bukhari there is not...) has an implication, and the Doctor knows, Allah Almighty willing, that the implications of books are considered, which is that Imam Ahmad extracted this addition which is not in Al-Bukhari. The matter is not so, for his narration is also devoid of this addition. He extracted the Hadith in places in his (Musnad) as I had [29]\n\nindicated by numbers in my verification of (Fiqh as-Sirah by Al-Ghazali) (p. 396). The Doctor is aware of it and has benefited from it and its original as previously indicated. He could have used those numbers to review Ahmad's narration so as not to fall into such an error. So what deterred him from that? Was it lack of time, or his assumption that none of the readers would return to the (Musnad) to uncover such an error or others which might not cross anyone's mind except one who is negligent in scientific verification or incapable of it? Second: How did the Doctor justify preferring Ibn Sa'd's narration over Al-Bukhari's narration while knowing that not everything in it is authentic and established unlike what is in Al-Bukhari? Third: If it is said: Perhaps he preferred it because of the addition in it and it has an authentic chain according to him? I say: Far from it, far from it. It has been proven to us from our study of this book of his that he has no knowledge at all of the method of authenticating Hadiths and criticizing chains. Therefore, we see that the Doctor and his likes must imitate the specialists and knowledgeable ones in that from Hadith scholars and limit themselves to quoting their statements in authentication and weakening. If they do not do so, they go astray and lead others astray, and many examples witnessing to what we said have passed. This is one thing, and another thing is that the Hadith in Ibn Sa'd (2 / 128 Beirut Edition) is without a chain, so how can the non-existent be judged as authentic? Yes, I have known Ibn Sa'd's basis in that, which is his Sheikh Al-Waqidi, for Ibn Kathir said in (Al-Bidayah) (4 / 241): (And Al-Waqidi said: Rabi'ah bin Uthman told me...) so he mentioned it. I say: Al-Waqidi is accused of fabrication as preceded (p. 21). So if the Doctor were researching as scholars research, especially since he presented that huge introduction: (I relied on what is authentic of the news of the Biography in its books) and was capable and eager to fulfill what he said, he would not have hastened to rely on Ibn Sa'd's suspended narration without a chain, especially when its end contains what alerts",
    "foot_note": "None\n\n1. page 30]",
    "book_id": "421",
    "new_page_number": 32
  },
  {
    "serial_number": "3365967",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "the intelligent person to its lack of establishment, even if he were ignorant of the science of Hadith and the criticism of chains of narration. That is his saying (2 / 129): (When the people of Medina heard of the army of Mu'tah arriving, they met them at (Al-Jurf). The people began throwing dust in their faces and saying: 'O Runaways (Furrar)! Did you flee from the path of Allah?' So the Messenger of Allah, peace and blessings be upon him, said: 'They are not runaways, but they are those who return to fight (Karrar), if Allah wills.') I said: This is Munkar (objectionable), nay, false and clearly invalid. For how is it conceivable that the victorious army, despite their small number and equipment against the Roman army which was superior to them in numbers and equipment by many fold—how is it conceivable that these believing people would be met with dust thrown in their faces and accused of fleeing from Jihad, when they did not flee? Rather, they stood firm with the firmness of heroes until Allah granted them victory and opened for them, as in the Hadith of Al-Bukhari: (...until a sword from the swords of Allah took the banner, until Allah granted them victory)? Among the wonders is that the Doctor, after mentioning this authentic Hadith and following it with his saying: (And this Hadith indicates, as you see, that Allah supported the Muslims with victory in the end), he nevertheless cited this objectionable addition and said (2 / 180): (As for the reason the people said to the Muslims after their return to Medina: 'O Runaways'... it is because they did not pursue the Romans and those with them in their defeat...) We say: This interpretation is very far-fetched. Furthermore, interpretation (Ta'wil) is a branch of correction (Tashih) [proving authenticity first], as is established in (Usul). So why did you not prove this narration, O Virtuous Doctor, so that it would be permissible for you to interpret it to resolve this objectionable meaning apparent from it? Otherwise, the reality is as the common people say: This deceased does not deserve this condolence. [31]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 33
  },
  {
    "serial_number": "3365968",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "And if this interpretation indicates anything, it is that the Doctor does not differentiate between what is authentic and what is not authentic of reports. He cites them all in one manner and treats them with one treatment. For instance, he does not differentiate between what Al-Bukhari narrated and what Ibn Sa'd narrated, even if without a chain of narration! This is not how the work of scholars should be. If you want an example contrary to his action, sourced from a Hafiz among the Huffaz of the Muslims, take Al-Hafiz Ibn Kathir for example. He mentioned this objectionable narration in his book (Al-Bidayah) (4 / 248) from the narration of Ibn Ishaq from Urwah in a Mursal form, then he said: (This is Mursal from this aspect and contains strangeness. In my view, Ibn Ishaq was mistaken in this context; he thought that this multitude was the army, but rather those who fled were [only] when the two groups met. As for the rest of them, they did not flee; rather, they were victorious as the Messenger of Allah, peace and blessings be upon him, informed the Muslims while he was on the pulpit. So the Muslims would not call them runaways after that; rather, they met them with honor and veneration.) Would that the Doctor had returned to the book of this Hafiz and sought his help in clarifying what might be obscure to him of facts and knowledge, especially since his subject is the same subject as his book and it is within his reach. However, haste in authorship, lack of deliberation in research, inability to verify within it, and the desire to write in what is not one's specialty is what causes the author to fall into such apparent errors. And Allah is the One sought for help. Hadith Eighteen: He said (2 / 188): (Then he, peace and blessings be upon him, said: 'O assembly of Quraysh, what do you think I will do with you?' They said: 'Good, a noble brother and the son of a noble brother.' He said: 'Go, for you are the free ones (Al-Tulaqa).') I said: This Hadith, despite its fame, does not have an established chain of narration. It is Mu'dal (perplexing/interrupted) in Ibn Hisham, and Al-Hafiz Al-Iraqi weakened it as I have clarified in (Takhrij Fiqh as-Seerah) (p. 415). So I do not know what prevented the Doctor from benefiting from this Hafiz's weakening [32]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 34
  },
  {
    "serial_number": "3365969",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "of the Hadith, so he would not cite it in his book which he described as relying on what is authentic from the reports of the Seerah. Is there not in this a clear violation of this condition? Or does the Doctor possess knowledge that the Hafiz did not have, seeing the Hadith as authentic and not falling outside his condition? If so, let him prove that to us, and we will be grateful to him? Or does he proceed according to the famous [saying] as well (): A famous error is better than an abandoned truth? Hadith Nineteen: He said (2 / 189): (Ibn Hisham narrated that Fadalah bin Umayr Al-Laythi wanted to kill the Prophet, peace and blessings be upon him, while he was circumambulating the House in the year of the Conquest... and I did not find a biography for this Fadalah in (Al-Isabah) nor in (Al-Isti'ab).) I said: Firstly: This Hadith, like the previous ones, is not authentic because Ibn Hisham did not mention a connected chain for it so that its narrators could be examined. For he said (4 / 59): (And it was narrated to me [meaning by someone he trusts from the people of narration, as in a hadith before it] that Fadalah bin Umayr bin Al-Mulawwah Al-Laythi wanted...). Secondly: This Fadalah has a biography in (Al-Isabah) (Vol 3, p 201-202, Biography No. 6996, Mustafa Muhammad Press in Egypt), which is the edition the Doctor refers to. So I do not know how he did not find it in there. Perhaps he does not even master referencing, or he assigned it to some of his students who do not master it, or at the very least are not active in it. Another source older than it also provided his biography, Ibn Abi Hatim in (Al-Jarh wa Al-Ta'dil) (23 / 77 / 234), and Al-Bukhari preceded him in (Al-Tarikh Al-Kabir) (4 / 1 / 124): (Fadalah Al-Laythi reached the Jahiliyyah; his son Abdullah bin Fadalah narrated from him). Al-Bukhari cited a Hadith for him indicating his companionship, but it is from the narration of his son Abdullah bin Fadalah, and no one declared him trustworthy except Ibn Hibban (1 / 137), and it was said he had companionship. [33]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 35
  },
  {
    "serial_number": "3365970",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Thirdly: What is the benefit of knowing the biography of this Fadalah when the chain to him is not authentic? Is this not one of the many proofs that the Doctor has absolutely no knowledge of the methods of authentication and weakening? Otherwise, why did he waste his time or the time of others among his students searching for the biography of Fadalah, and then he did not succeed? Even if he had succeeded, that would not have established the authenticity of the Hadith by the agreement of the people of knowledge, because he turned away from studying the chain of narration to him, if it even needed study, for its broken nature is apparent. If Al-Buti is of this status of ignorance regarding Hadith, then it is fitting for him not to claim what he is incapable of verifying regarding the authentication of the Hadiths of the Sunan and Seerah, and to occupy himself with other knowledge if he masters it. Hadith Twenty: He said (2 / 216): (And some of the Companions said: 'O Messenger of Allah, supplicate to Allah against Thaqif.' He said: 'O Allah, guide Thaqif and bring them.' Narrated by Ibn Sa'd in (Al-Tabaqat) and Al-Tirmidhi extracted it in his (Sunan), and Ibn Sa'd narrated it from Asim Al-Kilabi from Al-Ashhab from Al-Hasan.) I said regarding it are two matters: First: Its chain in Al-Tirmidhi is not authentic; it contains the 'an'ana [saying 'from'] of Abu Al-Zubayr, and he is a mudallis [one who obfuscates chains], as I clarified in (Takhrij Al-Fiqh) p. 432. The other: It is in Ibn Sa'd in (Al-Tabaqat) 2 / 159 without a chain. And his saying: (Ibn Sa'd narrated it from Asim...) etc., along with the repetition in it which has no benefit, contains two illusions: First: That this chain from Ibn Sa'd in the place I referred to is actually for a different Hadith than this one. For its wording is: (...So Umar came and said: 'O Prophet of Allah, supplicate against Thaqif?' He said: 'Allah has not permitted regarding Thaqif.' He said: 'So how can we kill a people regarding whom Allah has not given permission?' He said: 'Depart, depart.') [34]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 36
  },
  {
    "serial_number": "3365971",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "So you see that this Hadith is other than the Hadith of the chapter. If this attribution to Ibn Sa'd by the Doctor the second time was not due to an illusion from him, then it is one of the many proofs that he does not master the craft of Takhrij [extraction] at all. For it is not permissible to say: 'Ibn Sa'd narrated from Al-Hasan from the Prophet, peace and blessings be upon him, that he said: (O Allah, guide Thaqif and bring them),' because Al-Hasan did not narrate that in Ibn Sa'd. Anyone who comes across this Takhrij by the Doctor would understand the opposite! It is most likely that this was only intentional on his part, so it is proof of what I mentioned. Because I saw him later, when I extracted a Hadith of Ibn Abbas and attributed it to Ahmad and Ibn Majah, he critiqued me saying it is in the (Two Sahihs) and expressed amazement at my failure to attribute the Hadith to them. Yet, if that attribution had come from me - and I ask Allah to protect me from the like - it would have been a sheer error like this error of the Doctor in attributing this Hadith to the narration of Ibn Sa'd from Al-Hasan. The detailed discussion on that will come in its place, Allah willing. Hadith Twenty-One: He said (2 / 246 - 247) in the Takhrij of the story of Masjid Al-Dirar: (Tafsir Ibn Kathir 2 / 387 - 388, and Ibn Hisham narrated it in his Seerah in a similar manner in Vol 2 / 322). I said: Firstly: The Takhrij does not imply - like many of his Takhrijs - that the story is authentic. For in Ibn Hisham, it is via Ibn Ishaq without a chain, and in Ibn Kathir, it is from his path via a group I mentioned in (Takhrij Al-Fiqh) (p. 488). Secondly: The Doctor abbreviated this Takhrij from our mentioned Takhrij, and what he mentioned is almost copied from it word for word, except that he deleted from it our statement at the beginning that it is (Weak). So what drove the Doctor to this deletion and failure to mention the source from which he took his Takhrij? If his fear that people might say: 'The Doctor benefited from Al-Albani's Takhrij' allows him that, does it allow him to delete the ruling of weakness which [35]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 37
  },
  {
    "serial_number": "3365972",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "the Hadith Takhrij necessitates, and to mislead people that this Hadith is from (what is authentic of the reports of the Seerah) when it is not authentic? Let him know that Allah the Exalted will question him and hold him accountable for what he has done in this book of authenticating reports that are not authentic, neither out of his following (Taqlid) of the people of knowledge, nor out of his own independent reasoning (Ijtihad), because he is not among the people of Ijtihad - by his own admission - in Fiqh, in which the Doctor holds a degree, let alone in this noble science whose scent he has not yet smelled. Hadith Twenty-Two: He said (2 / 250) regarding the story of the delegation of Thaqif: (Ibn Sa'd narrated that he, peace and blessings be upon him, used to come to them every night after Isha, standing over them speaking to them until he would alternate [his weight] between his feet). I said regarding it are criticisms: First: That Ibn Sa'd did not cite its chain, so how did he know its authenticity and rely upon it? Second: That limiting the attribution to him gives the student the impression that it was not narrated by one who is more famous than him and more worthy of reliance, and that is not the case. For Abu Dawud extracted it in (Qiyam Ramadan) and Ibn Majah at the end of (Iqamat as-Salat), both from the Hadith of Aws bin Hudhayfah, and Ahmad also (4 / 343) without the alternating [of feet]. Third: That its chain is not authentic because it is from the narration of Abdullah bin Abdul Rahman bin Ya'la Al-Ta'ifi from Uthman bin Abdullah bin Aws Al-Ta'ifi, and this one was not declared trustworthy by anyone except Ibn Hibban, but a group of trustworthy narrators narrated from him; however, the first one [Abdullah] was weakened by Al-Dhahabi and Al-Asqalani, so he is the defect of the Hadith. Hadith Twenty-Three: He said (2 / 251) regarding the story of the delegation of Thaqif also: (Ibn Ishaq said: And they also asked him to remove the prayer from them. So he said to them: There is no good in a religion with no prayer.) I said: The completion of this narration in Ibn Ishaq in (Al-Seerah) (4 / 183 - 185) is: (They said: O Muhammad, then we will grant it to you, even if it is a humiliation.) [36]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 38
  },
  {
    "serial_number": "3365973",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "I said: This is not authentic like the previous Hadiths, because it is with him via a Mu'dal [interrupted] chain. As for the Marfu' [elevated to Prophet] part of it, Abu Dawud and Ahmad extracted it with a Munqati' [broken] chain as I clarified in (Takhrij Al-Fiqh) (p. 540). Yet the Doctor ignored this like others - from what preceded - and authenticated it. So Allah is the One sought for help. Twenty-Fourth: He said in (The Farewell Pilgrimage) (2 / 270): (When he, peace and blessings be upon him, saw the House, he said: 'O Allah, increase this House in honor, magnification, nobility, and awe, and increase him who magnifies it among those who perform Hajj or Umrah to it in honor, nobility, awe, respect, and righteousness.' Narrated by Al-Tabarani and Ibn Sa'd). I said: This is very weak, indeed fabricated. As for Ibn Sa'd, he mentioned it without a chain (2 / 173). As for Al-Tabarani, he extracted it in (Al-Mu'jam Al-Kabir) (Vol 1, Folio 149 / 2 manuscript) from Hudhayfah bin Asid, and in its chain is Asim bin Sulayman Al-Kuzi. Al-Dhahabi said in (Al-Mizan): (Ibn Adi said: He is counted among those who fabricate Hadith. Al-Fallas said: He used to fabricate; I have never seen the likes of him... And Al-Daraqutni said: A liar). Al-Haythami said in (Majma' Al-Zawa'id) (3 / 238) after attributing it to Al-Tabarani: (He is Matruk [abandoned]). I said: Based on this, two matters apply to the Doctor, one of which must be true: First: If he knew this defect and yet decisively attributed it to the Prophet, peace and blessings be upon him, then he is included in the threat of his saying, peace and blessings be upon him: (Whoever narrates a Hadith from me seeing that it is a lie, then he is one of the liars). Extracted by Muslim in the introduction to his (Sahih) (1 / 7) via two authentic chains from Samurah bin Jundub and Al-Mughirah bin Shu'bah. And the other: If he did not know it - which is the assumption about him - then how did he narrate it and speak with it while the Messenger of Allah, peace and blessings be upon him, says: (It is enough of a lie for a man to narrate everything he hears)? Also extracted by Muslim (1 / 8) via an authentic chain. Rather, how did he include it in his book in which he claimed [37]\n\nthat he relied on authentic reports? It is also assumed that he has no knowledge of these two Hadiths, otherwise they would have been sufficient to deter him from narrating weak Hadiths under the guise that they are authentic? And Allah is the One sought for help, and to Allah we belong and to Him we return. With this ends what I wanted to mention of the weak Hadiths and flimsy reports that I stumbled upon in Doctor Al-Buti's book. They clarify most clearly that what he said in the texts of his book (I relied in them firstly on the authentic collections of Sunnah. Secondly, on what is authentic of the reports of Seerah in its books) (1) was nothing but mere publicity for the book and to draw people's attention to it. Within the folds of the discussion on them, it is clear that he does not possess the culture and knowledge of the Sunnah, the terminology of Hadith, and the biographies of narrators that would enable him to implement this methodology which he claimed to have adopted in his book, even by relying on scholars for that and imitating them. For he does not even master imitating them because he has no knowledge of their statements. Yet, he attempts to do the work of the stalwarts among them, but far from it. How similar he is to the saying of some of the predecessors: (You are but like the chick; it hears the roosters crowing, so it crows with them). There remain with me other examples of his errors which indicate the extent of his knowledge of this noble art, and they represent various types of distance from the correct scientific approach. So I say:",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 39
  },
  {
    "serial_number": "3365975",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "1 - He said (1 / 31): (The narrators of the Seerah have agreed that the Bedouin lands of Bani Sa'd bin Bakr were suffering at that time from a drought year wherein the udders had dried and the crops withered. But no sooner had Muhammad, peace and blessings be upon him, come into Halimah's home and settled in her lap and [drank from] her breast, than the dwellings of Halimah around her tent became fertile and green...)",
    "foot_note": "1. (1) He confirmed that in the introduction to the third edition with his saying: (And I know that I have not recorded in this book of mine any events of the Seerah except the most important and most authentic of them). So did he tell the truth? [38].",
    "book_id": "421",
    "new_page_number": 40
  },
  {
    "serial_number": "3365976",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "I said: We have two criticisms against him: First: The mentioned consensus was not claimed by anyone before the Doctor as far as I know, so it has no value. The other: The story did not come with a chain of narration that establishes proof. Its most famous path is what Muhammad bin Ishaq narrated from Jahm bin Abi Jahm from Abdullah bin Ja'far from Halimah bint Al-Harith As-Sa'diyah. Abu Ya'la extracted it (Folio 128 / 1) and from him Ibn Hibban (2094 - Mawarid), and Abu Nu'aym in (Dala'il An-Nubuwwah) (1 / 47) from Ibn Ishaq with it. Al-Bayhaqi extracted it in (Dala'il An-Nubuwwah) (1 / 108) from him also, except that he said: Jahm bin Abi Al-Jahm - a freed slave of a woman from Bani Tamim who was with Al-Harith bin Hatib, and he used to be called: the freed slave of Al-Harith bin Hatib - told us, he said: Anyone who heard Abdullah bin Ja'far bin Abi Talib told us, saying: I was told from Halimah bint Al-Harith. I said: This is a weak chain containing two defects: First: The disruption (Idtirab) in its chain as is apparent. In the first narration, there is the 'an'ana [saying 'from'] of Ibn Ishaq from all his narrators. In the other, his declaration of hearing (Tahdith) along with Jahm's declaration that he did not hear it from Abdullah bin Ja'far, and the latter's declaration that he did not hear it from Halimah. So according to the first narration, there is a disconnection between Ibn Ishaq and Jahm because the former is famous for Tadlis (obfuscation). And according to the other narration, the disconnection is in two places in it. From this, you learn the illusion of Al-Hafiz in (Al-Isabah) where he said (4 / 266): (Ibn Hibban declared the hearing [Tahdith] between Abdullah and Halimah in his Sahih). For there is no basis for this Tahdith in Ibn Hibban nor in others we mentioned. And it is very unlikely that Abdullah bin Ja'far met Halimah, the wet nurse of the Messenger, peace and blessings be upon him, for when the Prophet, peace and blessings be upon him, died, Abdullah was ten years old. Even if they did not mention a date of death for her, it is usually assumed that she died before the Messenger of Allah, peace and blessings be upon him. Allah knows best. [39]\n\nWhether the first narration or the other is more correct, the chain is disconnected inevitably. The other defect is that it pivots on Jahm bin Abi Al-Jahm, who is of unknown status (Majhul Al-Hal). Al-Dhahabi said in (Al-Mizan): (The story of Halimah As-Sa'diyah is not known from him). As for Ibn Hibban, he mentioned him in (Al-Thiqat) (1 / 31) according to his rule in declaring unknowns trustworthy. The story has two other paths in Abu Nu'aym pivoting on Al-Waqidi, who is a liar. One of them is from his Sheikh Musa bin Shaybah, who is lenient (Layyin) in Hadith as Al-Hafiz said in (Al-Taqrib). The other is from Abdul Samad bin Muhammad As-Sa'di from his father from his grandfather, who said: Some of those who used to herd Halimah's sheep told me... and these are unknowns.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 41
  },
  {
    "serial_number": "3365978",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "2 - He said (1 / 55): (The Prophet, peace and blessings be upon him, grieved due to that a great grief, to the point that he was attempting - as Imam Al-Bukhari narrates - to throw himself from the peaks of the mountains.) I said: This attribution to Al-Bukhari is a gross error. That is because it gives the illusion that this story of throwing oneself down is authentic according to Al-Bukhari's condition, which is not the case. The explanation is that Al-Bukhari extracted it at the end of Aisha's Hadith on the beginning of revelation, which the Doctor cited (1 / 51 - 53). It is in Al-Bukhari at the beginning of (Interpretation of Dreams) (12 / 297 - 304 Fath) via Ma'mar: Al-Zuhri said: So Urwah informed me from Aisha... and he cited the Hadith up to his saying: (And the revelation paused). And Al-Zuhri added: (Until the Prophet, peace and blessings be upon him, became sad - according to what has reached us - a sadness due to which he went early several times to throw himself from the tops of the mountain peaks. Whenever he reached the peak of a mountain to throw himself from it, Gabriel appeared to him [40]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 42
  },
  {
    "serial_number": "3365979",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "and said: 'O Muhammad, you are truly the Messenger of Allah.' So his agitation would calm down and his soul would settle, and he would return. If the pause in revelation became long for him, he would go early for the like of that. If he reached the peak of a mountain, Gabriel would appear to him and say the like of that to him.) Thus Ahmad (6 / 232 - 233), Abu Nu'aym in (Ad-Dala'il) (p. 68 - 69), and Al-Bayhaqi in (Ad-Dala'il) (1 / 393 - 395) extracted it with this addition via Abdur Razzaq from Ma'mar with it. From this path, Muslim extracted it (1 / 98), but he did not cite its wording; rather, he referred it to the wording of the narration of Yunus from Ibn Shihab, which does not contain the addition. Likewise, Muslim and Ahmad (6 / 223) extracted it via Uqayl bin Khalid: Ibn Shihab said... with it, without the addition. And likewise, Al-Bukhari extracted it at the beginning of the Sahih from Uqayl with it. I said: We conclude from the above that this addition has two defects: First: Ma'mar's solitude in narrating it without Yunus and Uqayl, so it is Shadh (anomalous). Second: It is Mursal Mu'dal (hurried/interrupted/perplexing), for the one saying: (according to what has reached us) is Al-Zuhri, as is apparent from the context. Al-Hafiz decided on this in (Al-Fath) (12 / 302) and said: (It is from the Balaghat [reports reaching someone] of Al-Zuhri and is not connected). I said: This is what the Doctor neglected or was ignorant of, so he thought that every letter in (Sahih Al-Bukhari) is according to his condition of authenticity. Perhaps he does not distinguish between the Musnad (connected) Hadith in it and the Mu'allaq (suspended), just as he did not distinguish between the connected Hadith in it and the Mursal Hadith that came in it incidentally, like this Hadith of Aisha, at the end of which came this Mursal addition. Know that this addition did not come through a connected path that can be used as proof, as I clarified in (Silsilat Al-Ahadith Ad-Da'ifah) number (4858), and I pointed that out in the commentary on (My Abridgment of Sahih Al-Bukhari) (1 / 5), may Allah facilitate the completion of its printing. [41]\n\nIf you know the lack of establishment of this addition, we have the right to say that it is an objectionable addition in terms of meaning, because it does not befit the infallible Prophet, peace and blessings be upon him, to attempt to kill himself by throwing himself from the mountain, whatever the motive for him to do so, while he is the one who said: (Whoever throws himself from a mountain and kills himself, he will be in the Fire of Hell throwing himself down in it, abiding eternally therein forever). Extracted by the two Sheikhs and others, and I extracted it in (Takhrij Al-Halal wa Al-Haram) number (447).\n\n3 - He said (1 / 115): (Before the legislation of prayer, he, peace be upon him, used to pray two rak'ahs in the morning and two like them in the evening, as Ibrahim, peace be upon him, used to do). I say: I do not know a chain of narration for this Hadith. If the Doctor has come across it, let him mention its source to us so we can study it, and I do not think it is authentic. Yes, Ibn Sayyid An-Nas mentioned in (Uyun Al-Athar) (1 / 91) from Muqatil bin Sulayman: (Allah obligated prayer at the beginning of Islam as two rak'ahs in the morning and two rak'ahs in the evening, then He obligated the five on the Night of Ascension). Then he mentioned similar from Al-Harbi (1 / 149) and quoted Ibn Abd Al-Barr saying: (This is not found in an authentic report). Then Ibn Sayyid An-Nas pointed out (1 / 152) the weakness of Al-Harbi's statement. I said: Muqatil bin Sulayman is Matruk (abandoned), severely weak. Al-Hafiz said: (They declared him a liar and abandoned him, and he was accused of Tajsim [anthropomorphism]).",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "421",
    "new_page_number": 43
  },
  {
    "serial_number": "3365982",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "4 - He said (p. 147): (No one among the companions of the Messenger of Allah, peace and blessings be upon him, migrated except in hiding, other than Umar bin Al-Khattab, may Allah be pleased with him. For Ali bin Abi Talib, may Allah be pleased with him, narrated that when he [Umar] intended to migrate, he girded his sword, slung his bow, and held arrows in his hand (and in it that he said:) ('Whoever wishes his mother to be bereft of him, or his child to be orphaned, or his wife to be widowed, let him meet me behind this [42]\n\nvalley'). Ali said: So no one followed him except a group of the weak; he taught them and guided them, then proceeded on his way. Usd Al-Ghabah Vol 4 p 58). I said: There are two criticisms against him: First: His saying: (No one migrated...) What is the basis for this negation? For the narration he mentioned from Ali, may Allah be pleased with him, contains nothing of that. If the Doctor's basis for it is only that it was not known except about Umar, then the answer is that scholars say: Lack of knowledge of a thing does not necessitate knowledge of its non-existence. This is if the negation comes from people of knowledge, so how about when it is from someone like Doctor Al-Buti? Second: His assertion that Umar, may Allah be pleased with him, migrated openly, relying on the mentioned narration of Ali, and his assertion that Ali narrated it, is not correct. Because the chain of narration for it to him is not authentic. The author of (Usd Al-Ghabah) did not first assert its attribution to him, may Allah be pleased with him, and secondly, he cited his chain for it to him so that his responsibility would be cleared and so that those of knowledge could look into it. I found it pivots on Al-Zubayr bin Muhammad bin Khalid Al-Uthmani: Abdullah bin Al-Qasim Al-Amali (thus in the original, perhaps Al-Ayli) told us from his father with his chain to Ali. These three are among the unknowns (Majahil), for none of the people of Jarh and Ta'dil mentioned them at all. Did the Doctor find them and know their probity and accuracy so that he permitted himself to assert the authenticity of the narration from Ali? Or is his affair in it like his affair in others, merely a gatherer of firewood [at night], or as the common people say here in the Levant: (Khabt Laz' - Slap and Stick)? Then, in addition to that, he claims that he relied on authentic narrations.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 44
  },
  {
    "serial_number": "3365984",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "5 - He said: (2 / 12): (So (Umar) said: 'Shelter the people from the rain, and beware [that] (1) you paint it red or yellow, thereby tempting the people.' I'lam As-Sajid 337). I said: This report was narrated by Al-Bukhari in (Chapter: Building of the Mosque) from\n\nhis (Sahih) as Mu'allaq Majzum [suspended definitively] (1). So the Doctor leaving the attribution to it, despite it indicating authenticity, for attributing it to (Al-I'lam) which does not indicate authenticity, is a negligence not forgiven from the likes of him if he were of the people of knowledge of Hadith. For it is known among them that it is not appropriate to attribute a Hadith that is in the (Two Sahihs) or one of them to the four Sunan, let alone those below them. So how is it permissible to attribute it to someone who is below them all, like Al-Zarkashi the author of (I'lam As-Sajid)? Mughlatay said: (A traditionist has no right to attribute a Hadith in one of the Six [Books] to other than them except for an addition not present in them or to clarify its chain and narrators). Al-Munawi quoted it in (Fayd Al-Qadir) (1 / 280).",
    "foot_note": "1. (1) It did not appear in Al-Buti's book; we supplied it from Al-Bukhari. \n[43].\n\n1. (1) And it is in my Abridgment of Sahih Al-Bukhari number (118). \n[44].",
    "book_id": "421",
    "new_page_number": 45
  },
  {
    "serial_number": "3365986",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "6 - He said (2 / 69): (As for what was narrated that he, peace be upon him, prayed over them (meaning the martyrs of Uhud) ten by ten, and in every ten was Hamzah, until he prayed over him seventy times: it is weak and an error. Refer to Mughni Al-Muhtaj 1 / 399). I said: This is a new type of the Doctor's mix-ups. He was not satisfied with types of errors we uncovered previously, especially those regarding weak Hadiths he authenticated, until he now came with a new style of error, which is weakening authentic reports. For this Hadith has many paths, and some are Hasan. Al-Hafiz Al-Zayla'i cited a large portion of them in (Nasb Ar-Rayah) (2 / 309 - 313), and likewise Al-Hafiz Ibn Hajar Al-Asqalani in (Ad-Dirayah) (1 / 243 - 244) and (Talkhis Al-Habir) (1 / 11), and he leaned towards strengthening it. This is what no traditionist who came across those paths can oppose. Therefore, I cited it in my separate book: (Ahkam Al-Jana'iz wa Bida'uha) Issue (70). Moreover, regarding the prayer over Hamzah and other martyrs, there are other Hadiths, some of which are authentic, which I mentioned in Issues (22 and 60) of the mentioned book.",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 46
  },
  {
    "serial_number": "3365987",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "The intelligent reader might be struck by the Doctor's weakening of this Hadith, contrary to his habit and for the first time in his book, so he asks about the reason for that? So I say: Since the Doctor is Shafi'i in Madhhab and fanatical about it, as indicated by his treatment of some Fiqh issues in this book, and the Hadith stipulates the legitimacy of praying over martyrs while his Madhhab states the lack of its legitimacy (1), therefore he weakened it, not because the scientific Hadith methodology necessitates its weakness. How so, when Al-Hafiz Ibn Hajar strengthened it, and he is Shafi'i in Madhhab as well, as is known? Also striking is the Doctor's reference in weakening the Hadith to the book (Mughni Al-Muhtaj), for this is a book of Fiqh. It is known among people of knowledge that in every science one must refer to the specialists in it. Why did the Doctor not refer to a reliable book of Hadith like those mentioned just now? Would the Doctor be satisfied if someone referred him in a Fiqh issue to a book of Hadith like the Sunan and others? Yes, if the author of (Mughni Al-Muhtaj), who is Sheikh Muhammad Ash-Shirbini Al-Khatib (2), was known for his engagement with the science of Hadith and his verification in it - in addition to his knowledge of Shafi'i Fiqh - the mentioned reference would be somewhat acceptable. But he was not known for any of that at all. In fact, his mentioned book clearly indicates that he is very far from this noble science, farther than others from it, indeed perhaps he is a predecessor to him in that. Look at him, for example, saying (1 / 5): (And in (Al-Ihya) that the Prophet, peace be upon him, said: A little success (Tawfiq) is better than a lot of knowledge. And in some narrations (Intellect instead of Knowledge). So when was Al-Ghazali's book (Al-Ihya) a reference for people of knowledge in Hadith, while it is",
    "foot_note": "1. (1) Rather, he stated in (Al-Mughni) that it is forbidden because he is alive according to the text of the Qur'an. \n2. One of the Shafi'i jurists in the tenth century, died in the year (988). \n[45].",
    "book_id": "421",
    "new_page_number": 47
  },
  {
    "serial_number": "3365988",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "known among beginners in this science as being packed with weak and fabricated Hadiths and what has no basis in Hadith? Including this very Hadith, for Al-Hafiz Al-Iraqi said in his (Takhrij) (1 / 38): (I did not find a basis for it). And he says (1 / 13): (And from Ibn Abbas, may Allah be pleased with them both, that the Prophet, peace be upon him, used to stop when he reached Adnan in lineage, then say: The genealogists have lied). I said: This is a fabricated Hadith as I clarified in (Silsilat Al-Ahadith Ad-Da'ifah wal-Mawdu'ah) number (111). And his saying (1 / 45) regarding the Hadith of the Two Sheikhs: (If one of you cleans himself with stones, let him do so with an odd number): (And the narration of Abu Dawud diverted it from obligation, which is his saying, peace be upon him: Whoever cleans himself with stones, let him make it odd; whoever does so has done well, and whoever does not, there is no sin). This is a weak narration not suitable for the mentioned diversion; Al-Bayhaqi and Al-Asqalani weakened it as I clarified in my book (Da'if Sunan Abi Dawud) number (8). And his saying (1 / 512): (Al-Bukhari narrated: Whoever prays upon me at my grave, Allah appoints an angel to convey it to me, and his worldly and otherworldly affairs are sufficed, and I will be a intercessor or witness for him on the Day of Resurrection). Attributing this to Al-Bukhari is a gross error, for it is a fabricated Hadith as I clarified in the mentioned Silsilah: number (203). Perhaps he saw it attributed to Ibn An-Najjar and thought it distorted from Al-Bukhari, so he attributed it to him due to his poor judgment and lack of knowledge that among the traditionists is one known as (Ibn An-Najjar), the author of (Tarikh Al-Madinah) known as (Ad-Durar Ath-Thaminah), for he extracted the first part of it from him. Then Ash-Shirbini mentioned lines later the Hadith (Whoever performs Hajj and does not visit me has shunned me) and said: Ibn Adi narrated it in (Al-Kamil) and others. Then he said: (This indicates that it is emphasized for the pilgrim more than others). I said: Yes, indeed it indicates that visiting him, peace be upon him, is obligatory because shunning him, peace be upon him, is a sin and leaving it is obligatory [to avoid]. But we say to him and his likes: Establish the throne then engrave. For the mentioned Hadith is fabricated by the testimony of critical Imams like [46]\n\nIbn Al-Jawzi, As-Saghani, Az-Zarkashi, Adh-Dhahabi and others, as we clarified in (Silsilat Al-Ahadith Ad-Da'ifah wal-Mawdu'ah) (45). Al-Hafiz Ibn Abd Al-Hadi elaborated on it in (As-Sarim Al-Munki) (p. 75 - 80) and concluded by saying: (The result: This Hadith cannot be used as proof and cannot be relied upon except by one whose heart Allah has blinded and is among the most ignorant of people in the science of transmitted reports). Then he mentioned on the same page the Hadith of Adam's Tawassul by the Prophet, peace be upon him, which is also fabricated as Al-Hafiz Adh-Dhahabi and others said, and I have spoken about it in the Silsilah referred to just now under number (25) (1). To other than that of many examples which if tracked would make a huge volume. This is the state of the author of (Mughni Al-Muhtaj) whom Doctor Al-Buti referred to for knowing the weakness of the mentioned Hadith. From it, the intelligent person knows the state of the one referring to him in this noble science.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 48
  },
  {
    "serial_number": "3365990",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and the Sirah",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "7 - He said (2 / 172): “It is narrated from Anas رضي الله عنه that the Prophet صلى الله عليه وسلم wrote to Khosrow, and to Caesar, and to the Negus, and to every tyrant, calling them to Allah the Exalted.” I (the author) say: The hadith is in Sahih Muslim (6 / 166). So beginning it with the wording ‘It is narrated’ (ruwiya) suggests that, in his view, the hadith is weak, or that he does not know its authenticity, or that he is unaware that this form and others similar to it—forms constructed in the passive—are used by hadith scholars specifically for weak hadith. And that it is not permissible to introduce an authentic hadith with such wording. These are three possibilities, and one of them must apply to the doctor. Perhaps the last one fits him best, for he is from the general public who do not care to abide by the rules of the hadith scholars—as Imam An-Nawawi رحمه الله pointed out. And this is assuming the doctor even knows these rules. An-Nawawi said in the introduction to his great work *Al-Majmū‘ Sharh al-Muhadhdhab* (1 / 63): “The verifying scholars from among the people of hadith and others have said: If the hadith is weak…” [47]\n\nIt is not said in it: 'The Messenger of Allah, peace and blessings be upon him, said, or did, or commanded, or forbade, or judged,' and similar forms of certainty (Jazm). Likewise, it is not said: 'Abu Hurairah narrated, or said, or mentioned, or informed, or told, or transmitted, or gave a fatwa,' and the like. Similarly, this is not said regarding the Tabi'in and those after them regarding what is weak. Thus, none of that is spoken of with the form of certainty. Rather, in all of this, it is said: 'It was narrated from him, or it was transmitted from him, or it was told about him, or it reached us from him,' or it is said: 'It is said, or it is mentioned, or it is told, or it is narrated, or it is elevated (Marfu'), or it is attributed,' and similar forms of passivity/uncertainty (Tamrid), and these are not forms of certainty. They said: Forms of certainty are designated for the Authentic (Sahih) or Good (Hasan), and forms of uncertainty for what is other than them. This is because the form of certainty implies its authenticity from the one it is attributed to, so it should not be applied except to what is authentic; otherwise, the person would be in the sense of lying against him, peace and blessings be upon him. This etiquette was violated by the author and the majority of jurists from our companions and others, indeed the majority of scholars of sciences absolutely, except for the skilled Hadith scholars. That is an ugly leniency, for they often say in the (Authentic): 'It was narrated from him,' and in the (Weak): 'So-and-so said and narrated,' and this is a deviation from correctness). I say: The Doctor has fallen into both uglinesses. In this authentic Hadith, he said: 'It was narrated,' and in those weak Hadiths, despite their abundance, he did not preface a single one of them with the form of uncertainty, but rather with the form of certainty.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 49
  },
  {
    "serial_number": "3365992",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "8 - He said (3 / 181), mentioning the story of Banu Bakr attacking Khuza'ah at night and the departure of Amr bin Salim Al-Khuza'i with forty riders from Khuza'ah, coming to the Messenger of Allah, peace and blessings be upon him, informing him of what befell them. He said: (So he stood up dragging his garment saying: 'I would not be supported if I do not support Banu Ka'b regarding what I support myself from'). And he said: ('Indeed this cloud carries the beginning of victory for Banu Ka'b'). Ibn Sa'd and Ibn Ishaq narrated that. And this text is from the narration of Ibn Sa'd. Ibn Hajar said: And Al-Bazzar, At-Tabarani, Musa bin Uqbah, and others narrated it) [48]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 50
  },
  {
    "serial_number": "3365993",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "I say: In this extraction (Takhrij) and attribution are errors (Wahm) that should be clarified: First: The story is not among (what is authentic of the news of the Biography) because it is with this text in Ibn Sa'd (2 / 134) and Ibn Ishaq (4 / 32 - 37) without a chain of transmission (Isnad), so how can it be judged as authentic? Second: This text was not narrated by Al-Bazzar at all, so attributing it to him and claiming that Ibn Hajar attributed it to him is a double error. For his [Ibn Hajar's] words are explicit in other than what the Doctor attributed to him. He mentioned the story from the path of Ibn Ishaq, and in it is that when the Khuza'i man came to the Prophet, peace and blessings be upon him, while he was sitting in the mosque, he said: 'O Lord, I appeal to Muhammad, the alliance of our father and his father the old one...' etc., the verses. So Al-Hafiz said (7 / 419): (Al-Bazzar narrated from the path of Hammad bin Salamah from Muhammad bin Amr from Abu Salamah from Abu Hurairah *some of the verses mentioned in this story*, and it is a good (Hasan) connected chain. But Ibn Abi Shaybah narrated it from Yazid bin Harun from Muhammad bin Amr from Abu Salamah as Mursal (disconnected). And he also extracted it from the narration of Ayyub from Ikrimah as Mursal at length... And Abdur-Razzaq extracted it from the path of Miqsam from Ibn Abbas at length without the poetry. And At-Tabarani extracted it from the Hadith of Maymunah bint Al-Harith at length... And in Musa bin Uqbah regarding this story: He said: 'It is mentioned that...') I say: It is clear from Al-Hafiz's words that Al-Bazzar did not narrate the story, but rather narrated some verses from it, so attributing it to him is a clear error. And At-Tabarani's chain is weak as I mentioned in (Takhrij Al-Fiqh) (p. 404). However, it appears from the sum of its paths that it has a basis in general. Verification requires tracking the wordings of these paths, so whatever they agree upon is established. This requires accessing some of the sources mentioned by Al-Hafiz, such as the book of Ibn Abi Shaybah and Abdur-Razzaq, which is not feasible now [49]\n\nThird: It became clear from Al-Hafiz's words which I mentioned just now that Musa bin Uqbah did not cite the Hadith with a chain of transmission, but rather suspended it by saying: (It is mentioned). So the Doctor's statement that Al-Hafiz said, conjoining with Al-Bazzar and At-Tabarani: (And Musa bin Uqbah), gives the illusion that he narrated it with his chain. This contradicts the reality in Al-Hafiz's speech as we mentioned. The Doctor was only misled by his lack of knowledge of the art of Takhrij. In such a case, it should be said: (And Musa bin Uqbah suspendedly). Likewise, it should be said regarding the narration of Ibn Ishaq and Ibn Sa'd for this story to prevent giving an impression contrary to reality. The Doctor's denial of the existence of the addition in (At-Tabaqat) while it is in it.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 51
  },
  {
    "serial_number": "3365995",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "9 - Then he mentioned (2 / 167) the story of the Prophet, peace and blessings be upon him, sending Abdullah bin Hudhafah with a letter to Chosroes (Kisra) inviting him to Islam. Then he said: (The news of the letter of the Messenger of Allah, peace and blessings be upon him, to Chosroes with this detail is from the narration of Ibn Sa'd in his Tabaqat, and Al-Bukhari also mentioned that briefly... Sheikh Nasir [Al-Albani] has attributed in his comments on the book Fiqh as-Sirah by Al-Ghazali to Ibn Sa'd an addition to what we mentioned which we did not find in his Tabaqat, which is that the Prophet, peace and blessings be upon him, saw their mustaches [i.e., the two messengers sent by Badhan] twisted and their cheeks shaved, so he turned away from them and said: 'Woe to you! Who ordered you to do this?' They said: 'Our Lord ordered us' - meaning Chosroes. This addition we did not find in Ibn Sa'd's narration). I say: O Doctor, had you read (At-Tabaqat) with scrutiny, observation, and contemplation, you would have found the narration which you assertively negated, or at least if you knew how to refer to it and search in it, you would have found it. But whoever is unable to extract the biography of Fadalah Al-Laythi from the book (Al-Isabah) while its biographies are arranged alphabetically (1), is more likely to be unable to extract this Hadith from (At-Tabaqat) where Hadiths are not arranged in a way that resembles the ease of finding the desired item in the arrangement of biographies. Furthermore, whoever reads the Doctor's statement",
    "foot_note": "1. (1) See Hadith Nineteen (p. 33) [50].",
    "book_id": "421",
    "new_page_number": 52
  },
  {
    "serial_number": "3365996",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "regarding this addition (and we did not find it in his Tabaqat) would immediately think that the Doctor read the entire (At-Tabaqat) and extracted its benefits and treasures to deposit them in this book of his, yet despite that, he did not find the addition in it. The truth is that the Doctor did not do that; rather, he did not trouble himself at all - and Allah knows best - in the path of searching for this addition in (At-Tabaqat). All he did was refer to it in the chapter concerning the Messenger of Allah, peace and blessings be upon him, sending messengers with his letters to the kings... This chapter from which the Doctor quoted the story referred to earlier, he did not go beyond it to any other at all. Even if we assume he did go beyond it, that is clear proof that the Doctor has not yet practiced the method of research and verification, and that some of his students are better than him in this path, as will be explained. For the Hadith he critiques me on, when I extracted it in the commentary on (Fiqh as-Sirah) by Sheikh Al-Ghazali, my extraction of it was not in the Doctor's predominant manner, which is attribution neglecting the mention of volumes and pages. Not at all. I said in its extraction (p. 389): (A Good (Hasan) Hadith, extracted by Ibn Jarir (2 / 267 - 267) from Yazid bin Abi Habib as Mursal, and Ibn Sa'd in (At-Tabaqat) (Vol 1, Part 2, p 147) from Ubaidullah bin Abdullah as Mursal also, and its chain is authentic. Ibn Bishran connected it in (Al-Amali) from the Hadith of Abu Hurairah with a flimsy chain. In the three paths, there is an addition that was appropriate to include, which is: 'But my Lord, Mighty and Majestic, ordered me to let my beard grow and to trim my mustache'). So in my saying: 'Vol' such, 'Part' such, 'Page' such, is the greatest alert to the ordinary reader, let alone the Doctor, that this Hadith is in (At-Tabaqat) in a place other than the place from which he quoted the story referred to previously. It contains another alert, which is my saying (from Ubaidullah as Mursal also, and its chain is authentic). The point of the alert is well known to the Doctor, for he knows that the story has no chain of transmission in Ibn Sa'd, unlike this one. All of that was sufficient to alert the Doctor not to rush into criticism and denial. But it seems the vessel became full, so it must spill what is in it. Yes, we found an excuse for him in that, but it is an excuse not befitting the station of a Doctor like him [51]\n\nand it might be accepted from someone below the level of any student of his in the College of Sharia. That is that the page number referred to (147) had the hundreds digit dropped by the typewriter, so it became like this (p. 47) (1). So it is probable that the Doctor did not search at all; all he did was refer to this number, and when he did not find the addition in it, he said: (We did not find it in his Tabaqat). Had he been fair and sincere in his criticism, he would have said: (We did not find it in the place Al-Albani indicated in At-Tabaqat). But he wants to pretend to have what he was not given and to criticize without right. The recompense for one who does that is nothing but that the saying of the poet proves true regarding him: (And upon the oppressor, misfortunes turn). Furthermore, the Doctor preferred the narration of Ibn Sa'd, which has no chain, over the narration of Al-Bukhari in his (Sahih), for no reason other than that it is detailed while Al-Bukhari's narration is concise. Then he claims that he relied on what is authentic of reports! I have come to believe that the authenticity the Doctor means is different from the authenticity meant by the people of knowledge. So what is it? I do not know, unless it is that which agrees with a person's whim and mood, as some contemporary writers do. Has the Doctor been influenced by them? If the answer is: No, then what is the authenticity he means while he cites dozens of texts as authentic when they are not so according to the rules of the people of knowledge? What is it then, what is it? (2)",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 53
  },
  {
    "serial_number": "3365998",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "10 - He said (2 / 287): (It has been narrated regarding Aisha, may Allah be pleased with her, that when the Prophet, peace and blessings be upon him, returned from Al-Baqi', she met him",
    "foot_note": "1. (1) That typing error was discovered by that university student referred to at the end of the discussion on Hadith (14) pp. 26-27. Was his professor, the Doctor, not more worthy of this serious discovery?\n2. And know, O noble reader, that the virtuous Professor Eid Abbasi had published in his book (The Innovation of Sectarian Fanaticism) (pp. 316-320) [52].",
    "book_id": "421",
    "new_page_number": 54
  },
  {
    "serial_number": "3365999",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "saying: 'O my head.' So he, peace and blessings be upon him, said to her: 'Nay, I, by Allah, O Aisha, O my head.' Narrated by Ibn Ishaq and Ibn Sa'd) [53]\n\nI say: There are objections in this: The first: His restriction in his extraction to Ibn Ishaq and Ibn Sa'd implies that it was not narrated by those more famous than them. This is not the case, for Ahmad, Ad-Darimi, Ibn Majah, Ad-Daraqutni, and Al-Bayhaqi extracted it, as verified in my book (Ahkam al-Jana'iz wa Bida'uha) (p. 50 - Islamic Office edition). The other: His prefixing it with his saying: (It has been narrated - Ruwiya), which implies it is weak in the terminology of Hadith scholars as established in the science of (Terminology) and pointed out by Imam An-Nawawi in the introduction of his book (Al-Majmu' Sharh Al-Muhadhdhab). The Doctor is mistaken in this prefixing, whether he knows this terminology and applied it in its place according to him or not. As for the first case, it is because its chain is established as I explained in the previous source, so how can he prefix it with the form of uncertainty/weakness if he knows? As for the other, which is that he has no knowledge of this terminology or has knowledge of it but placed it in its place according to his claim, then it is a false claim as preceded regarding his ignorance in Takhrij, his fabrication in it, and his persistence upon it.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 55
  },
  {
    "serial_number": "3366001",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "11 - He mentioned (2 / 289 - 290) the story of his prayer, peace and blessings be upon him, with the people during his death illness, and in it: (So the Messenger of Allah, peace and blessings be upon him, sat next to Abu Bakr. Abu Bakr was praying following the prayer of the Messenger of Allah, peace and blessings be upon him, while he was sitting, and the people were praying following the prayer of Abu Bakr). Then he said commenting on it: (Narrated by Al-Bukhari in the Book of Prayer, Chapter: Whoever stood next to the Imam for a cause, and Muslim in the Book of Prayer, Chapter: Succession of the Imam, and Malik in Al-Muwatta, Book of Congregational Prayer, Chapter: Prayer of the Imam while he is sitting, and others. It is strange that Sheikh Nasir extracted this Hadith in his verification of Hadiths of Fiqh as-Sirah by Al-Ghazali and attributed it to Imam Ahmad and Ibn Majah only, and added to this that he started investigating an attribution of weakness to it because it contains Abu Ishaq As-Sabi'i, even though the Hadith is Agreed Upon (Muttafaq 'alayh - in Bukhari and Muslim) and has paths other than this one he concerned himself with investigating...) [54]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 56
  },
  {
    "serial_number": "3366002",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "I say: What I believe is that the noble reader will be amazed at the Doctor's amazement once we reveal the overt prejudice and flagrant ignorance of the science of Takhrij in his words. Before that, I must quote my words in the extraction of the Hadith the Doctor pointed to. I will start first by mentioning its text in the book (Al-Fiqh) then follow with my comments on it. The virtuous Sheikh Al-Ghazali, may Allah Almighty preserve him, said (p. 501): (Ibn Abbas said: When the Prophet, peace and blessings be upon him, became ill, he ordered Abu Bakr to pray with the people. Then he found relief, so he went out. When Abu Bakr sensed him, he wanted to step back, but the Messenger, peace and blessings be upon him, motioned to him. So he sat next to Abu Bakr on his left and started the recitation from the verse where Abu Bakr had ended. So Abu Bakr was following the Prophet, and the people were following Abu Bakr). So I said in its extraction verbatim: (Authentic (Sahih). Extracted by Ahmad (2055, 3330, and 3355) and Ibn Majah (1 / 373) from the path of Abu Ishaq from Al-Arqam bin Shurahbil from Ibn Abbas, and its men are trustworthy. However, Al-Busiri found a defect in it that Abu Ishaq - who is As-Sabi'i - became confused at the end of his life and was a Mudallis (concealer) and narrated it by 'an'anah (ambiguous transmission). I said: But Abdullah bin Abi As-Safar followed him [corroborated him], except that he said: from Ibn Abbas from Al-Abbas, making it from the Musnad of Al-Abbas. This is a slight difference that does not harm the authenticity of the Hadith, Allah willing. Ahmad also narrated it from this perspective (1784 and 1785). So if you, O noble reader, examine this extraction of mine and compare it with what the Doctor attributed to me, the following two facts will become clear to you: The First: The Hadith I verified is different from the Hadith about which the Doctor said: Narrated by Al-Bukhari... etc. Two matters indicate this: The First: That in it is the saying: (And he started recitation from the verse where Abu Bakr had ended). This is not in the Hadith of the Two Sheikhs (Bukhari and Muslim). [55]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 57
  },
  {
    "serial_number": "3366003",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "The Other: It is from the Hadith of Ibn Abbas, whereas the Hadith of the Two Sheikhs is from the Hadith of Aisha, as is not hidden from anyone who returns to the places the Doctor named in those books. If that is the case, it is not permissible for anyone given an atom of knowledge of this science to attribute the Hadith of Ibn Abbas to the Two Sahihs merely because they extracted the origin of the Hadith from the narration of Aisha, may Allah be pleased with her. Meaning, it is not permissible for anyone of sound mind and knowledge to say regarding the Hadith of Ibn Abbas: (The Two Sheikhs extracted it), for it is a clear lie against them. This is an apparent matter needing no proof, and no student of knowledge disputes it. Therefore, Ad-Diya' Al-Maqdisi appended it to the Two Sheikhs, including it in his book which he named (The Selected Hadiths Which Bukhari and Muslim Did Not Extract) (58 / 185 / 1). Was this hidden from the Doctor so that he was amazed at the attribution of the Hadith to Ahmad and Ibn Majah only? Or is the matter as was said: 'And the eye of satisfaction is dull to every defect, but the eye of discontent exposes faults.' We ask Allah for safety. The Other Fact: Is that I authenticated the Hadith and stated that explicitly at the beginning of the extraction, then I recounted the defect Al-Busiri mentioned, then I refuted it with the mentioned corroboration. So how was it permissible for the Doctor to mislead the readers that I weakened the Hadith by saying: (and added to this that he started investigating an attribution of weakness to it...)? Does one who fears Allah do this? (1) His ignorance of the difference between the authentic Hadith of Al-Bukhari and the weak Hadith of At-Tirmidhi in chain and text, then his attempt to cover that up with evasion.",
    "foot_note": "1. (1) I say: This Hadith is the second Hadith regarding which Professor Eid Abbasi explained the Doctor's error and his fabrication against me in his valuable book (The Innovation of Sectarian Fanaticism) as referred to recently (p. 52 - 56). But the Doctor did not respond to the caller of truth; rather he persisted, was arrogant, and stubborn, so he refused [56].",
    "book_id": "421",
    "new_page_number": 58
  },
  {
    "serial_number": "3366004",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "12 - He said (2 / 291): (There was a water skin containing water before him (meaning the Prophet, peace and blessings be upon him), so he began putting his hands in the water and wiping his face with them, saying: 'There is no deity but Allah, indeed death has throes.' Narrated by Al-Bukhari in the Chapter of the illness of the Messenger, peace and blessings be upon him... This is also among the errors of Sheikh Nasir in his extraction, for he said about it: 'Weak, extracted by At-Tirmidhi and others from (sic) the path of Musa bin Sarjis bin Muhammad from Aisha... while it is narrated in Al-Bukhari via a path other than this'). I say: This is deception, rather another ignorance from the Doctor which I wished he would not fall [57]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 59
  },
  {
    "serial_number": "3366005",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "into. I absolutely did not extract this text which he cited from the narration of Al-Bukhari. Rather, I extracted another text in Sheikh Al-Ghazali's book with the wording: (And saying: O Allah help me with the throes of death). This is the one I weakened and attributed to At-Tirmidhi, and I mentioned in its extraction (499) that At-Tirmidhi himself weakened it by saying: (A Gharib [Strange] Hadith). And I said: (Meaning weak, because this Musa was not authenticated by anyone, so he is unknown). So does the Doctor not differentiate between Al-Bukhari's narration which is with the wording: (There is no deity but Allah, indeed death has throes), and At-Tirmidhi's narration which says: (O Allah help me with the throes of death)? If the Doctor does not differentiate between them as his mentioned words indicate, then conversation with him has fallen, as the matter then is as the poet said: 'And nothing is correct in the minds * If the day needs proof.' And if he does differentiate between them, as is apparent to anyone with two eyes, then where is the alleged error, O Doctor? And what is your purpose in claiming it? Rather, I say: It is you who are deluded, O Doctor, because you want me to [58]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 60
  },
  {
    "serial_number": "3366006",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "attribute At-Tirmidhi's wording, which At-Tirmidhi himself weakened, to Al-Bukhari whose wording is different from At-Tirmidhi's wording. This is not permissible according to anyone who has smelled the scent of this noble science. The Doctor's mistake in this Hadith is like his mistake in the Hadith of Ibn Abbas previously. Just as he wanted me there to attribute it to the Two Sheikhs who extracted it from the Hadith of Aisha without the addition merely due to their relation to a single incident, likewise he wanted the like of it from me in this Hadith, even though it is weak. My certainty is that the Doctor does not know that Hadith rules require that At-Tirmidhi's narration is Munkar (Objectionable) due to its contradiction of Al-Bukhari's authentic narration despite the unity of the Hadith narrator, who is Lady Aisha, may Allah be pleased with her, due to the anonymity of its [Tirmidhi's] narrator and the trustworthiness of the narrator of Al-Bukhari's narration (1). If this is the Doctor's knowledge in the Noble Hadith - dozens of weak and Munkar Hadiths and those with no basis he cites with the form of certainty, introducing them as being from authentic reports when they are not so according to the rules of the people of knowledge, then he criticizes others without knowledge or fairness - then what would be the state of the book in its other texts if effort were directed to criticizing them? [59]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 61
  },
  {
    "serial_number": "3366007",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Defense of the Prophetic Hadith and Biography",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "In conclusion, I advise the Doctor not to write except in a science he has mastered and practiced for a period of time, and that his guide in that be advice to the Muslims and sincerity to the Lord of the Worlds, far from being influenced by the character of malice and envy. That is more effective for him and more beneficial in this world and the Hereafter. Imam An-Nawawi, may Allah Almighty have mercy on him, said in (At-Taqrib) (p. 232) briefly: [60]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 62
  },
  {
    "serial_number": "3366008",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "(The science of Hadith is a noble science that befits high morals and virtuous characters, and it is among the sciences of the Hereafter. Whoever is denied it is denied great good, and whoever is granted it attains abundant favor. Its possessor must correct his intention, purify his heart from worldly motives, employ beautiful morals and manners, and then empty his effort into acquiring it. Greed should not drive him to carelessness in bearing it, thereby violating any of its conditions. He should apply the Hadiths of worship and manners that he hears, for that is the Zakat (purification) of the Hadith and a cause for its preservation. He must beware, with all caution, of pride preventing him from striving fully in acquisition and taking knowledge from those below him in lineage, age, or otherwise. He should not limit himself to hearing and writing it without knowing and understanding it; rather, he should learn its authenticity, weakness, meanings, language, inflection, and the names of its narrators, verifying all of that. He should engage in Takhrij (extraction/referencing) and classification if he is qualified for it. He must beware of publishing his work except after refining, editing, and repeatedly reviewing it, and he must beware of classifying what he is not qualified for). With these great counsels, I conclude these researches now, hoping from the Mawla (Allah) Subhanahu wa Ta'ala to benefit everyone who reads them with a sound heart. And praise be to Allah, Lord of the Worlds. [61]\n\nAppendix: After writing the above by a long time, I came across the third edition of this book (Fiqh as-Seerah) by Dr. Al-Buti. He claimed in its introduction (that the reader will not see any addition in it over the edition before it, nor any signs of change and alteration, except what was necessary by way of correction and revision). However, I found in it numerous errors and new ignorances that appeared in the additions found in the edition preceding it, meaning the second edition. I did not have the opportunity to view this [second] edition to see the extent to which his claim matched reality. The Doctor has done the like of this before in the introduction to the second edition of his treatise (Al-La Madhhabiyya), even though reality testified to the contrary, as proven with numbers by our companion Master Eid Abbasi in (Supplement to the Innovation of Madhhab Fanaticism) pp. (51-58). Among that is that in the first edition of (Al-La Madhhabiyya) p. 61, he attributed a Hadith to Al-Bazzar and At-Tabarani only, then he added in its second edition (p. 77) (And the Two Sheikhs narrated from Aisha something close to it with the wording...). He mentioned it, and the strange thing is that Al-Buti took this Takhrij (referencing) from Master Abbasi's rebuttal against him in (The Innovation of Fanaticism) without attributing it to him at all, just as he did in some of his previous amendments which I alerted to regarding the three previous Hadiths (pp. 50-59) (See the aforementioned Supplement p. 53). There is no great benefit in expanding in this field; rather, the important thing now is that I alert to those new errors so that the noble readers are not deceived by them, especially since the author emphasized in its introduction that he did not record in this book of his any events of the Seerah except the most important and authentic of them. For the religion is advice (Nasiha), as he (peace and blessings be upon him) said. I will mention them in the order they appeared in his book (Al-Fiqh), so I say:",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 63
  },
  {
    "serial_number": "3366010",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "1 - He said (pp. 55-56) commenting on the story of Bahira: (Summarized from Seerah Ibn Hisham 1/180; narrated by At-Tabari in his History 2/287 (1); narrated by Al-Bayhaqi in his Sunan and Abu Nu'aym in Al-Hilyah. There is some difference in detail among these narrations. At-Tirmidhi was unique in narrating it at length in another manner, and perhaps there is some leniency (weakness) in its chain). For he himself said [62]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 64
  },
  {
    "serial_number": "3366011",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "after narrating it: (This is a Hasan Gharib Hadith, we do not know it except from this route). In its chain is Abdur-Rahman ibn Ghazwan, about whom it is said in Al-Mizan: He has Manakir (denounced reports), then he said: The most Munkar of his Hadith is from Yunus ibn Abi Ishaq... regarding the journey of the Prophet (peace and blessings be upon him) while he was an adolescent with Abu Talib to Sham (Syria). Ibn Sayyid An-Nas said about him: There is Nakarah (oddity) in his text (Refer to 'Uyun al-Athar 1/43). It is strange that Sheikh Nasir-ud-Din Al-Albani said about it—despite this—in his extraction of the Hadiths of (Fiqh as-Seerah) by Al-Ghazali: Its chain is Sahih. And he did not quote from At-Tirmidhi's comment on it except his saying: This is a Hasan Hadith... And it is his habit to weaken what is much more authentic than this Hadith. As for the shared amount of the story, it is established in the first edition by many paths that are not affected by weakness). In response to him, I say: The matter of this Dr. Al-Buti is truly strange. He was not satisfied with what I critiqued him for in those three Hadiths regarding which our brother Eid revealed his ignorance to the people, forcing the Doctor to admit some of his errors and be stubborn about others in this third edition as previously explained. Rather, he returned to replying to me on this Hadith to confirm anew his ignorance in the science of Hadith. Here is the explanation: First: His attribution of the story to Ibn Hisham and his reliance on him for it to the exclusion of others is useless; rather, it is an inversion of what is correct because with him [Ibn Hisham] it is suspended (Mu'allaq) without a chain, while with others it is connected (Musnad), so reliance on them is more appropriate. Second: The chain of the story is criticized by the Doctor, so nothing fixed remains in his hand to rely upon. So how, with this, can he say regarding what was previously quoted from him: 'I relied first on the authentic Sunnah, second on what is authentic from the reports of the Seerah'? How can this be correct regarding what was summarized from (Seerah Ibn Hisham) which has no chain, and there is no chain that is not revisited, rather, he criticizes it? Third: His statement (And At-Tirmidhi was unique in narrating it at length...) is not correct. [63]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 65
  },
  {
    "serial_number": "3366012",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "For At-Tabari also shared in narrating it at length in the place the Doctor pointed to, Dar al-Ma'arif edition with the mentioned number, except that the correct reference is (2/278) not (2/287). Likewise, the other two narrated it. This indicates to the intelligent person that the Doctor does not quote directly from the books of the Imams, otherwise he would not have fallen into this clear, scandalous shortcoming. Fourth: His statement (and Al-Bayhaqi in his Sunan and Abu Nu'aym in Al-Hilyah) is also an error arising from Al-Buti's ignorance of the books of the Imams of Hadith and his lack of examining them and benefiting from them. He only quotes from those who quoted from them, except rarely. It is most likely that this arose from him seeing some of them attribute it to Al-Bayhaqi and Abu Nu'aym, so he imagined, due to his lack of knowledge, that the intended books were their books (As-Sunan) and (Al-Hilyah), whereas the intended books are the ones named (Dala'il an-Nubuwwah) for each of them. It is in Abu Nu'aym (1/53) and Al-Bayhaqi (1/308-309). Fifth: His statement (perhaps there is some leniency in its chain... to his saying: from this route). I say: First: Is his saying this not sufficient indication to the noble reader of Al-Buti's ignorance of this science? For one who wants to investigate the discussion on a Hadith, especially if he is in the process of refuting another as is the Doctor's case here, does not present speech with this weakness, like one about whom it is said: he puts one foot forward and delays the other, leaning on his staff. (Perhaps/La'alla) is a word of hope and fear as is known. Second: If we accept that there is some weakness (Wahn) in the chain, then so what? What is the meaning of the criticism then, and the blackening of paper and wasting the readers' time? Every student of the science of terminology (Mustalah) knows that a Hasan Hadith contains some weakness because it is above the Weak Hadith and below the Sahih. Likewise, the narrator of a Hasan Hadith is lower in memory than the narrator of a Sahih Hadith. So, every Hasan Hadith has some leniency (Lin). Therefore, there is no contradiction between this and At-Tirmidhi declaring it Hasan. The truth is that in Al-Buti's speech on this Hadith, there is poorness, foreignness [to the field], ignorance, and stuttering [64]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 66
  },
  {
    "serial_number": "3366013",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "from which his intent is not clear. Because this statement of his, and his reasoning with what he quoted from At-Tirmidhi, can be interpreted to mean that the Hadith is not Sahih in chain but is only Hasan, and At-Tirmidhi's statement is proof of that as I explained just now. In that case, did he set himself up to refute Al-Albani's authentication for the sake of this meager difference? That is something I do not believe, evidenced by his saying after it about me: (And he did not quote from At-Tirmidhi's comment on it except his saying: This is a Hasan Hadith). This makes the intelligent reader feel that he is winking at me for this shortcoming in quoting from At-Tirmidhi. The face of the shortcoming in Al-Buti's logic is unintelligible except on the consideration that At-Tirmidhi's full phrase is closer to weakening than to authenticating compared to his phrase according to my quote from him. Therefore, he winked at me, and the poor man did not know that the opposite is correct according to others besides Al-Buti who have knowledge of this science. For they know that the Hadith about which At-Tirmidhi says: (Hasan Gharib) is stronger than the Hadith about which he says: (Hasan only). This is because his first statement means a Hadith that is Hasan Li-Dhatihi (Hasan by itself), and his other statement means Hasan Li-Ghayrihi (Hasan due to others). He clarified this latter one at the end of his book (As-Sunan), and Al-Hafiz explained it in (Sharh an-Nukhbah) (p. 11 - Al-Maymaniyyah) and declared after that (p. 25) that this is lower than the rank of Hasan Li-Dhatihi. [65]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 67
  },
  {
    "serial_number": "3366014",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "If this is clear, is it conceivable that the mentioned wink would issue from the Doctor if he knew that At-Tirmidhi's saying: (Hasan Gharib Hadith) is a higher rank than his saying: (Hasan Hadith)? No, by Allah. For this saying is understood by the reader who knows the science of terminology to mean that there is weakness in the Hadith's chain that was strengthened by a similar one, as previously mentioned. If the Doctor understood this, he would have focused his criticism on it and would have been truly correct. But since he does not know this fact, he neglected this correct criticism and fell into what he himself is criticized for, due to his lack of study of this noble science except to the extent by which a degree is obtained, then... peace be upon him. It appears to me that what deceived the Doctor and caused him to fall into this obscene error is that the scholars' saying: (Gharib Hadith) means it is mostly weak. He did not know that Gharabah (strangeness) can sometimes coexist with Sihhah (soundness), let alone Hasan, as in At-Tirmidhi's saying on this Hadith. It is just as he sometimes combines in a single Hadith the two words: (Hasan Sahih), and combines the words (Hasan Gharib). And just as the Hadith about which he said (Hasan Sahih) is lower than what was called (Sahih) in a manner explained by Al-Hafiz (p. 12), the Doctor imagined that the Hadith about which At-Tirmidhi said: (Hasan Gharib) is lower than that about which he said: (Hasan). In Al-Buti's knowledge, Ijtihad is forbidden in matters where jurists differed, yet he is an absolute Mujtahid in the science of Hadith, bringing forth what the ancients could not. Sixth: His saying (In its chain is Abdur-Rahman ibn Ghazwan, about whom it is said in Al-Mizan: He has Manakir (denounced reports)... then he said: The most Munkar of his Hadith is from Yunus ibn Abi Ishaq... regarding the journey of the Prophet (peace and blessings be upon him) while he was an adolescent with Abu Talib to Sham). I say: This is evidence of the Doctor's ignorance of this science. For Adh-Dhahabi's saying regarding Ibn Ghazwan: (He has Manakir) is not a wound (Jarh) that drops the Hadith from the degree of stability, even to the rank of Hasan. This is from two aspects: First: That the saying of Adh-Dhahabi or others regarding a narrator: (He has Manakir) is not a wound absolutely, contrary to Al-Buti's action here, especially if he is trustworthy (Thiqah) as is the case of this Ibn Ghazwan, as [66]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 68
  },
  {
    "serial_number": "3366015",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "will be explained. Adh-Dhahabi said in (Al-Mizan) (1/56): (Not everyone who narrates Manakir is weak). Imam Ibn Daqiq Al-Eid said: (Their saying: 'He narrated Manakir' does not by itself necessitate abandoning his narration until the Manakir become numerous in his narration and it ends up being said of him: Munkar al-Hadith, because 'Munkar al-Hadith' is a description of the man by which he deserves his Hadith to be abandoned). (Refer to Fath al-Mughith by As-Sakhawi 1/346-347). Second: This Ibn Ghazwan was authenticated by a group, including Ibn Al-Madini, the Sheikh of Al-Bukhari, Ibn Numayr, Ya'qub ibn Shaybah, Ad-Daraqutni, and others. Al-Bukhari narrated from him in his (Sahih), so he has crossed the bridge, as Adh-Dhahabi says about the likes of him. A group authenticated this Hadith of his, who will be mentioned, including Al-Hafiz Ibn Kathir, for he said in (As-Seerah) (1/247): (He is among the trustworthy narrators (Thiqat) from whom Al-Bukhari narrated, and a group of Imams and Huffaz authenticated him. I have not seen anyone who wounded him. Despite this, there is Gharabah in his Hadith). Then he explained its face in the manner to be mentioned from Ibn Sayyid An-Nas. So how did Al-Buti permit the concealment of these texts, giving the readers the illusion that there is nothing regarding Ibn Ghazwan except Adh-Dhahabi's saying: (He has Manakir), even though it is not a wound upon verification as previously mentioned, and the reality is that he is trustworthy according to the majority as you have seen? Is this not from the concealment about which peace and blessings be upon him said: (Whoever conceals knowledge, Allah will bridle him on the Day of Resurrection with a bridle of fire)? Narrated by Ibn Hibban in his (Sahih) and Al-Hakim, and he and Adh-Dhahabi authenticated it. It is sufficient for him that he has much of such concealment as will come. I will not take you [67] far, for he did not quote Adh-Dhahabi's speech in full, and he did the same with the speech of Ibn Sayyid An-Nas and with my speech as well. He takes from their speech what is for him and leaves what is against him, deceiving and blinding the people. Because if he quoted the speech of each of them completely, the contradiction between their words would appear, and he would not benefit anything at all from that in supporting his viewpoint. He wants to support his previous statement: (And perhaps there is some leniency in its chain). But the full speech refutes him, because Ibn Sayyid An-Nas's speech supports the authenticity of the chain, and Adh-Dhahabi's speech is explicit in judging the Hadith as fabricated (Mawdu'), and Al-Buti adopts neither this nor that. That is why he did not quote it. The completion of Adh-Dhahabi's speech, the beginning of which was mentioned on p. 66 and to which Al-Buti restricted himself: (...and what indicates that it is false is his saying: 'Abu Talib returned him and sent Abu Bakr and Bilal with him', while Bilal was not yet created and Abu Bakr was a boy). You see, noble reader, how Al-Buti took from Adh-Dhahabi's speech and armed himself with it against Al-Albani's authentication, and left this completion because it refutes his adoption of the story even at the rank of (some leniency), because Adh-Dhahabi explicitly declares it false (Batil) in it. If he were a truly honest scholar, he would have quoted the completion and refuted it with proof and evidence. But how can he do that when he is unable to refute Al-Albani with it, so how can he refute Al-Hafiz Adh-Dhahabi? If it is said: This completion contains a refutation of you as well. The answer is: Yes, but I have refuted it in detail after quoting his speech in (Al-Mizan), his speech in (At-Talkhis), and his speech in (Tarikh al-Islam) in an article I published in issue number 8 of volume 6 of (Al-Muslimun) magazine, Muharram 1379, under the title (The Hadith of the shading of the cloud has an authentic origin) in response to Ustad Ali At-Tantawi who claimed that day that it had no origin. Whoever wants the detail should refer to it. The summary of the refutation is from two aspects: [68]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 69
  },
  {
    "serial_number": "3366016",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "First: Opposing him with the authentication of those who authenticated and strengthened it, and they are a group of Imams as will be mentioned. Second: It does not follow from a trustworthy narrator's error in a sentence of a Hadith that the entire Hadith is Munkar or fabricated. For fabrication is established by the narrator being a fabricator and a liar. This is categorically denied here. Rather, the text itself would be fabricated based on indications of knowledge having no relation to the chain. This also does not exist here at all, except for the sentence about Abu Bakr and Bilal; it alone is the Munkar part. This is what I explicitly declared as Munkar in my Takhrij of the Hadith in (Fiqh as-Seerah) by Al-Ghazali, so Al-Buti concealed it as well, as will come. Then I followed that article with another article I wrote on 3/1379 and was published in volume 26 of this flourishing magazine (At-Tamaddun Al-Islami) under the title (The Incident of the Monk Bahira is a Reality, not a Myth) pp. 167-175, in response to one who claimed it has no chain. In it, I verified, in response to some doubts, that the monk was not named at all in this third narration from Abu Musa, but was named in Ibn Ishaq's narration which Al-Buti relied upon, which is weak and Mu'dal (perplexing/disconnected) as previously mentioned, and in another which contains Al-Waqidi the liar. Seventh: He said: (Ibn Sayyid An-Nas said about it: In its text is Nakarah (oddity). Refer to 'Uyun al-Athar 1/43). I said: I checked and saw that Al-Buti had cut Ibn Sayyid An-Nas's speech just as he did with Adh-Dhahabi's speech and others. For its completion in the place Al-Buti pointed to, not elsewhere, is: (I say: There is no one in the chain of this Hadith except those from whom [Al-Bukhari] extracted in (As-Sahih). Abdur-Rahman ibn Ghazwan Abu Nuh is Thiqah (trustworthy); Al-Bukhari was unique with him [in narrating from him], and Muslim was unique with Yunus ibn Abi Ishaq. Despite that, there is Nakarah in it, which is the sending of Bilal by Abu Bakr with the Prophet (peace and blessings be upon him), for how could that be when Abu Bakr had not then reached ten years of age). I say: Let the reader look with what face of religion or character Dr. Al-Buti permits himself [69]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 70
  },
  {
    "serial_number": "3366017",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "to fold this completion of Ibn Sayyid An-Nas's speech? It refutes his response to Al-Albani and confirms his opposition to the Imams of Hadith, the earlier and later ones among them, in their authentication of Ibn Ghazwan, by his attempt to (attribute weakness to him) clinging to Adh-Dhahabi's previous statement? The truth is that Ibn Sayyid An-Nas's speech matches my speech completely, as is intuitively obvious, were it not that Al-Buti cut it as well, as is his habit. May Allah treat him as he deserves. And he is in his previous and coming statement: Eighth: He said: (It is strange that Sheikh Nasir-ud-Din Al-Albani said about it - despite this () in his Takhrij of the Hadiths of 'Fiqh as-Seerah' by Al-Ghazali: Its chain is Sahih). I say: I am not the only one who said so. The completion of my speech after mentioning At-Tirmidhi's declaring it Hasan is: I said: And its chain is Sahih as Al-Jazari said, and he said: (The mention of Abu Bakr and Bilal in it is unpreserved [Ghayr Mahfuzah]). I said: Al-Bazzar narrated it and said: (He sent with him a man). So I say now: I have become aware of a matter I was heedless of, and the credit for that goes to Al-Hafiz Ibn Kathir. For the denunciation of that addition and considering it unpreserved is based on the Prophet (peace and blessings be upon him) not having reached ten years of age at that time, as previously mentioned from Ibn Sayyid An-Nas. No intelligent Muhaddith doubts that to prove the alleged Nakarah, one must prove the mentioned age, and that it is more authentic than the chain of Ibn Ghazwan, the narrator of the Hadith containing the addition, so that we may reject it. It is apparent from Ibn Kathir's speech in (As-Seerah) that there is nothing except what As-Suhayli related from some that his age, peace and blessings be upon him, was then nine years, and from Al-Waqidi from Dawud ibn Al-Husayn, twelve years. With the likes of this, it is not permissible to declare a trustworthy narrator mistaken, because the first report is Mu'dal and the other is Mursal, and it suffices in rejecting it that it is from the narration of Al-Waqidi. Perhaps this is the reason why those who did not address the clarification of the mentioned Nakarah, like At-Tirmidhi, Al-Hakim, and Al-Bayhaqi, did so. And Allah the Exalted knows best. After this, do you not see, noble reader, how much breach of scientific honesty there is in Al-Buti's quotation from me and from Ibn Sayyid An-Nas [70]\n\nregarding citation?\n\n1 - He deluded the reader that I was unique in the mentioned authentication, while the reality is that Ibn Sayyid An-Nas and Al-Jazari preceded me in it, as you see, and others who will be mentioned shortly.\n\n2 - He deluded them that I limited myself to authenticating the chain without explaining what was in its text of an unpreserved sentence. The reality is to the contrary; rather, I followed Ibn Sayyid An-Nas and Al-Jazari in denouncing that sentence upon which Adh-Dhahabi relied in judging the entire Hadith as fabricated, so he erred as previously explained. I added to them that I mentioned the wording of Al-Bazzar's narration which has no dust on it [is clear]. So how did Dr. Al-Buti find this cut citation palatable? If he is not ashamed to be exposed by that before the readers after his matter is revealed, does he not fear Allah? Allah spoke the truth when He said: {Only those fear Allah, from among His servants, who have knowledge}. The truth is that the scholars of Hadith have successively authenticated this Hadith and authenticated Ibn Ghazwan, with most of them explaining the Nakarah of the sentence, as I verified in the article published in (Al-Muslimun) magazine, and the reference to it has passed. Here are the names of those who authenticated it among them:\n\n1 - At-Tirmidhi\n\n2 - Al-Hakim\n\n3 - Ibn Sayyid An-Nas\n\n4 - Al-Jazari\n\n5 - Ibn Kathir\n\n6 - Al-Asqalani",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "421",
    "new_page_number": 71
  },
  {
    "serial_number": "3366027",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "7 - As-Suyuti. The summary is that Al-Buti opposed all these Imams when he tried to (verify the attribution of weakness to him), so he did not succeed due to his ignorance and lack of knowledge of the science of Jarh and Ta'dil (Wounding and Authentication). Along with what appeared in his speech of concealing knowledge and preferring Ibn Ishaq's narration which has no chain over the narration of Ibn Ghazwan the Trustworthy (Thiqah). [71]\n\nNinth: His saying: And he did not quote from At-Tirmidhi's comment on it except his saying: (This is a Hasan Hadith). I say: Yes, so what happened? For the completion of At-Tirmidhi's statement is (Gharib, we do not know it except from this route). So is there in this completion what supports him or what refutes him? Al-Buti thinks the former, and that is due to his extreme ignorance of this science as previously explained in paragraph five, so there is no need to repeat. Tenth: His saying: And it is his habit to weaken what is much more authentic than this Hadith. I say: This is a falsehood and a clear slander for which we have no trick except to slap his face with it and say to him {Bring your proof if you are truthful}. Otherwise, the most ignorant of people and the most corrupt of them is not incapable of fabricating the like of it, so Allah is his reckoner. Eleventh: His saying: (As for the shared amount of the story, it is established by paths that are not affected by weakness). I say: regarding it are matters from which we chose: The first: This is cheap talk. What is the shared amount of the story? Why didn't he explain it and cite the narrations that support it? The second: His saying: 'So it is established by many paths that are not affected by weakness'. I say: This is also a claim, for the story has no paths not affected by weakness except this connected path from Abu Musa, and the Doctor did with it what he did. Even though Al-Hafiz Ibn Kathir said (1/248): It is more authentic than others. And other earlier and later Imams authenticated it, and I have mentioned their names recently. So look at this Doctor, how he speaks in a science he does not know and does not follow the sayings of the scholars who know it.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 72
  },
  {
    "serial_number": "3366029",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "2 - He said (p. 155) in the main text of the book: (Beware, while you are researching the story of Isra' and Mi'raj, of relying on what is called (Mi'raj Ibn Abbas), for it is a fabricated book from a collection of false Hadiths that have no origin and no chain). [72]\n\nI say: The Doctor pretends in this paragraph to be the capable Muhaddith, the critic of fabricated Hadiths, and the one fearing for the Ummah lest they be deceived by them. But the matter turns against him due to his ignorance of this science and writing in it, leading to the opposite of what he aimed for. Which is his warning against relying on taking anything in the mentioned book due to his saying about it (for it is fabricated from a collection of... Hadiths) etc. So is everything in the book fabricated and false? That is what I want to explain with some examples so that one who is afflicted with reading this book of his (Fiqh as-Seerah) or studying under him and listening to his ignorances and claims is not deceived by this word. The following facts appear in the mentioned book (Mi'raj Ibn Abbas):\n\n1 - It says regarding Al-Buraq (p. 2): (And behold, it is a beast resembling beasts, above the donkey and below the mule).\n\n2 - And in (p. 5): (So Gabriel knocked on the door. They said: Who is this? He said: Gabriel. They said: And who is with you? He said: Muhammad. They said: Has he been sent for? He said: Yes. They said: Welcome to you and to the one with you).\n\n3 - And in (p. 25): (And in another Hadith: The majority of your Ummah will not perish except by stabbing [fighting] and the plague).",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "421",
    "new_page_number": 73
  },
  {
    "serial_number": "3366034",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "4 - (p. 27): (And fifty prayers were obligated upon you and your Ummah in every day and night). These are four examples of what came in the book (Mi'raj Ibn Abbas), and they are all authentic and established in several Sahih Hadiths. The first example was narrated by the Two Sheikhs [Bukhari and Muslim], and the Doctor himself attributed it to them (p. 146). It is from the Hadith of Anas and has many supporting evidences, including from Hudhayfah, and I have extracted it in (Al-Ahadith As-Sahihah) (p. 874). Likewise, the second and fourth examples; they are in (As-Sahihayn) also from the Hadith of Anas referred to just now. The third example is a Sahih Hadith narrated by Ahmad (6/133, 145, and 255) [73]\n\nfrom the Hadith of Aisha in a Marfu' form, and it has supporting evidences extracted in my works (Ar-Rawd An-Nadir 526) and (Irwa' al-Ghalil 1636). So how is it permissible for the Doctor to say regarding the mentioned book that it is (fabricated from a collection of false Hadiths) when it contains these examples collected from Sahih Hadiths? I am almost certain that the Doctor never read the mentioned book at all, or at least not when writing this word. Otherwise, he would not have fallen into such a gross error, which invalidates some of what he admitted to be authentic pages earlier regarding what appeared in the first example, as previously indicated. What supports me in what I say is that he wrote in the footnote of page (146) the text: (And beware of relying on the likes of the book 'Mi'raj Ibn Abbas', for it is full of lies and falsehoods, and Ibn Abbas is innocent of this book). This is sound speech to which what I raised against his previous statement does not apply. It is mostly likely something he benefited from another, and perhaps he copied it letter for letter. But when he acted upon it with his pen and moved it from the footnote to the main text of the book, he fell into what we mentioned of scandalous ignorance. Were it not for his love of increasing the pages of the book and pretending to research, of which he is not worthy, this would not have happened from him. So, O Allah, guide him.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 74
  },
  {
    "serial_number": "3366036",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "3 - He said in the footnote of (p. 197) after noting the miracle of Suraqah's horse and its forelegs sinking into the earth, and the miracle of the Prophet (peace and blessings be upon him) leaving his house while the polytheists surrounded him, and the seeking of blessings (Tabarruk) by Abu Ayyub Al-Ansari and his wife. Then he digressed and mentioned Umm Salamah seeking blessings from his hair (peace and blessings be upon him), and Umm Sulaym from his sweat, and other than that. Then he commented on it saying: (Sheikh Nasir Al-Albani sees that such Hadiths have no benefit in this era. He mentioned that in a critique of his on Hadiths that Professor Muhammad Al-Muntasir Al-Kattani had selected for the students of the College of Sharia. We see that this is dangerous speech that a Muslim should not utter. For all the sayings [74]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 75
  },
  {
    "serial_number": "3366037",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "of the Messenger, his actions, and his approvals are legislation, and legislation remains continuous until the Day of Resurrection unless abrogated by a Book or a Sahih Sunnah. Among the most important benefits of legislation and its evidence is knowing the ruling and believing in accordance with it. These established Sahih Hadiths have not been abrogated by a Book or a Sunnah like them, so their legislative content remains until the Day of Resurrection. The meaning of this is that there is no objection to Tawassul (intercession) and Tabarruk (seeking blessings) by the traces of the Prophet (peace and blessings be upon him), let alone Tawassul by his essence (Dhat) and status (Jah) with Allah the Exalted, and that this is established and legitimate with time. So how can it be said, with that, that there is no benefit in them in this era? The greatest suspicion is that the reason which cancelled their benefit in the view of Professor Sheikh Nasir is that they oppose his school of thought (Madhhab) regarding Tawassul. However, that alone is not sufficient as a cause to abrogate them and end their benefit, as is known). This is Al-Buti's speech, letter for letter. I quoted it at length despite its little benefit so that the readers may be certain of the extent of this man's knowledge, his fear of Allah the Exalted, and his lack of concern regarding accusing the innocent and slandering them without right. To explain this truth here, I say: First: What he attributed to me of opinion is nothing but a fabrication. What indicates the man's audacity, lack of fear of Allah, and lack of shame before people is his attribution of that to my critique of Al-Kattani's Hadiths, which does not contain this false lie as you will see. If the Doctor criticized with sincerity and knowledge, he would have quoted my phrase and criticized it scientifically and objectively. But he knows that if he did that, he would be exposed before the readers. That is why he proceeded on this method of criticism, attributing a saying to the speaker when he did not say it originally, or said part of it but the Doctor takes some and leaves some, like one who says {Do not approach prayer} and falls silent. So listen to the text of my speech in the mentioned critique of Al-Kattani. I said (p. 56) of it: (6 - His citation of Hadiths upon the knowledge of which not *great* benefit relies today, under the following titles (p. 21): (Seeking blessings by the traces of the Messenger of Allah, peace and blessings be upon him, by his command). And he mentioned in it the Hadith of [75]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 76
  },
  {
    "serial_number": "3366038",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "Ali ibn Abi Talib, in which implies his command (peace and blessings be upon him) to him and another to drink from a vessel he (peace and blessings be upon him) had rinsed his mouth into and to pour it over their faces. Then he said: (The Companions seeking blessings by the traces of the Messenger of Allah, peace and blessings be upon him). Then he cited in it the Hadith of Talq ibn Ali, in which implies that he (peace and blessings be upon him) performed ablution and rinsed his mouth, then poured it into a water skin for them. Then he repeated the same heading and mentioned under it a third Hadith regarding Asma seeking blessings by his Jubbah (cloak) (peace and blessings be upon him). Then he repeated the heading for the fourth time and cited in it a Hadith regarding Umm Salamah seeking blessings by the hair of the Messenger of Allah (peace and blessings be upon him). So what is the benefit of repeating these titles and headings at a time when it is impossible today to seek blessings by his traces (peace and blessings be upon him) due to their non-existence? And what they do today in some lands of seeking blessings on some occasions by a hair preserved in a glass bottle is something that has no basis in the Sharia, nor is that proven by authentic paths. Yes, only some Sheikhs of the [Sufi] orders benefit from these headings as previously mentioned in the introduction. Perhaps the author placed these headings as help from him to them in enslaving their disciples and subjugating them in the name of seeking blessings by them. And Allah is the One whose help is sought). This which I said in the mentioned critique, I quoted it essentially letter for letter so the noble reader may compare it with what Al-Buti attributed to me, to verify his fabrication and excess in his saying: (This is dangerous speech that a Muslim should not utter). You see that the Doctor intentionally deleted the word (great/Kabir) added to (benefit), which is an explicit text that I do not deny the benefit, as is not hidden from anyone, Allah willing. I explained that with a clear reasoning, saying: (it is impossible today to seek blessings by his traces... due to their non-existence...). So the benefit remains, which is not great, but is knowing it for the mere knowledge of the thing and not ignorance of it. So how can Al-Buti attribute that lie to me: (These Hadiths have no benefit in this era)? Second: Suppose I said that, shouldn't he have mentioned the reason I stated in explaining that, instead of concealing it from the people, causing them to fall into indulging in Al-Albani's honor and going [76]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 77
  },
  {
    "serial_number": "3366039",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "in various directions in explaining that and attacking him? Or is this what Al-Buti intends by everything he writes against Al-Albani, and not advice to them? Third: Was it not obligatory for Dr. Al-Buti to refute my mentioned reasoning if he had a counter-refutation, instead of taking from my previous critique on Al-Kattani - despite its length - that truncated sentence (no benefit in them) and lying about me? Fourth: I do not doubt that there is a big difference between us and Dr. Al-Buti in estimating the benefit of Hadiths of Tabarruk (seeking blessings). For me and every person of knowledge, as I believe, they are irrelevant today. This does not negate the benefit of knowing them as previously explained. While the Doctor sees that they are relevant because they indicate Tabarruk, and Tabarruk and Tawassul (intercession) are synonymous to him, as indicated by his previous statement: (The meaning of this is that there is no objection to Tawassul and Tabarruk by the traces of the Prophet... let alone Tawassul by his essence and status...) etc. More explicit is his statement in the main text of the book on page (197): (For Tawassul and Tabarruk are two words indicating one meaning, which is seeking good and blessing through the path of Tawassul by it. Both Tawassul by his status (peace and blessings be upon him) with Allah and Tawassul by his traces, secretions, or clothes are individuals and particulars falling under a comprehensive type which is absolute Tawassul, whose ruling is established by Sahih Hadiths. All its particular forms fall under the generality of the text by means of what is called (refining the basis/Tanqih al-Manat) according to the scholars of Usul). He declared in another place (p. 355) that the basis (Manat) is solely him (peace and blessings be upon him) being the best of creatures with Allah absolutely. I say: In this speech there is much confusion and mixing, and claiming what has no origin and what is irrational. Just as there is not even a single Hadith confirming the absolute Tawassul that the Doctor claimed (The imitator who says what no Mujtahid in the world has said). Why didn't he mention some of those Hadiths that prove absolute Tawassul and explain the face of their indication of what he claimed, instead of turning away from this speech and the clamor without grinding? [77]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 78
  },
  {
    "serial_number": "3366040",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "Then how can he make Tawassul synonymous with Tabarruk, when Tawassul according to him does not require the presence of the one by whom Tawassul is sought, as is explicit in his speech, and [distinguish it from] Tabarruk which requires the presence of the object by which blessing is sought, as is apparent in the Hadiths mentioned by Professor Al-Buti and before him Al-Kattani and others? Otherwise, how is it possible to seek blessings by them? Also, his speech is explicit in the permissibility of Tawassul by saying in his supplication: (O Allah, I seek intercession to You by the secretions of Your Prophet, his sweat, and...) and other things that every sane Muslim jealous for the station of Divinity would be ashamed to write, let alone utter. Oh the shame if the Doctor stood on the pulpit on Friday praying with this supplication, confirming what he adopted of the philosophy of Tawassul by waste products. By Allah, we have increased in certainty regarding the illegitimacy of Tawassul by the Essence (Dhat) when we saw Dr. Al-Buti implying from it the legitimacy of Tawassul by a part of the parts of the Essence, even if it is from the kind that the Messenger of Allah (peace and blessings be upon him) himself used to clean and purify himself from, as is established in the (Two Sahihs) and other books of the purified Sunnah. Fifth: It has become clear from what passed that what Dr. Al-Buti thought was the reason is a sinful suspicion. Because, first, I did not cancel the benefit of Hadiths of seeking blessings by his traces (peace and blessings be upon him) as previously explained. And second, because it is based on his false equalization between Tabarruk and Tawassul on one hand, and on the legitimacy of Tawassul by the Essence on the other hand, and both are incorrect as we presented, even if briefly. As for his winking at me regarding oddity (Shudhudh) in his saying: (that they oppose his school regarding Tawassul), it arises from his lack of observing manners with the Imams who oppose his opinion - I do not say his school (Madhhab) - for he has no school despite his 'non-Madhhabism'. Otherwise, where is he regarding the statement of Imam Abu Hanifa: (I detest that one asks Allah except by Allah). The Imam did not permit asking by the Essence, let alone by waste products as is the opinion of the 'Imitator Mujtahid Gatherer of Contradictions'. What the Imam went to is the school of his two companions as well, let alone Sheikh al-Islam Ibn Taymiyyah and Ibn al-Qayyim and others among the verifiers. It is the school supported by Prophetic Hadiths and Salafi traditions as you see detailed in my special treatise on Tawassul, along with the refutation of the doubts of the opposers and critiquing them via narration [78]\n\nand understanding. Included in that is the detailed refutation of Al-Buti in his mixing between Tawassul and Tabarruk and his permitting Tawassul by waste products. This article will not reach the hands of the noble readers before the treatise has been circulated and benefited from, Allah willing, by everyone who has a heart or lends an ear while he is a witness. Apologies to the readers for being compelled to prolong the refutation of Al-Buti in this paragraph, which dragged us into departing from what we are concerned with regarding refuting him from the purely Hadith perspective, to which I directed myself in these articles, without discussing his Fiqh opinions in which he opposed the Sharia evidences. Perhaps I will find time later to write on that by the permission of Allah the Exalted. Let us return now to what we are concerned with, so I say:",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 79
  },
  {
    "serial_number": "3366042",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "4 - He said (p. 213): (Ibn Ishaq mentioned this book [document] without a chain. And Ibn Khaythamah mentioned it and connected it: Ahmad ibn Janab Abu Al-Walid told us, Isa ibn Yunus told us, Kathir ibn Abdullah ibn Amr Al-Muzani told us, from his father, from his grandfather that the Messenger of Allah (peace and blessings be upon him) wrote a writing between the Muhajireen and the Ansar... so he mentioned similar to what Ibn Ishaq mentioned. See 'Uyun al-Athar by Ibn Sayyid An-Nas) (1/198). I say regarding it there are criticisms: First: This chain has no value because Kathir ibn Abdullah ibn Amr Al-Muzani is very weak. Adh-Dhahabi said in (Ad-Du'afa wal-Matrukin): (Ash-Shafi'i said about him: One of the pillars of lying. Ibn Hibban said: He has a fabricated copy from his father from his grandfather. Others said: Weak). Second: If the Doctor does not know this severe weakness due to his ignorance of the biographies of Hadith narrators, why did he mention its chain? His students and the majority of his book's readers are naturally not better than him in that. And if he knew it, why did he conceal it and not explain it? Do we not have the right, with all this, to narrate the saying of the one who said: [79]\n\nIf you do not know, that is a calamity, and if you know, the calamity is greater. Third: If he knew that, what is the benefit of it other than inflating the size of the book? Does the Doctor not know that a weak Hadith is not strengthened by what is severely weak according to the scholars of Hadith, nor is it used as a witnessing evidence (Istishhad), especially if the witnessed report has no chain at all, as is the case of this book [document] according to Ibn Ishaq? Fourth: How does all this agree with his saying that he relied on authentic news of the Seerah? Where is the authenticity in what has no chain and its witness is very weak? Fifth: His saying: (Ibn Khaythamah) is an error indicating the extent of the Doctor's knowledge of biographies. The correct name is (Ibn Abi Khaythamah) as in (Al-'Uyun) and others.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 80
  },
  {
    "serial_number": "3366044",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "5 - Then he said immediately following that (p. 214): (And Imam Ahmad mentioned it in his Musnad, narrating it from Surayj who said: Abbad told us, from Hajjaj, from Amr ibn Shu'ayb, from his father, from his grandfather that the Prophet (peace and blessings be upon him) wrote a writing between the Muhajireen and the Ansar... etc. See Musnad Ahmad 21/10 Sharh al-Banna). I say: There are criticisms in it as well: First: Its chain is weak and cannot be used as proof because this Hajjaj is Ibn Artah, and Al-Hafiz said about him in (At-Taqrib): (Truthful, makes many mistakes and practices Tadlis [concealment]). It seems that Sheikh Abdur-Rahman Al-Banna imagined he was another one of the trustworthy narrators, so he said: (And its chain is Sahih). Second, Third, and Fourth are like what preceded in the Hadith before it. Fifth: His saying: (...etc). I say: In it is an illusion contrary to reality that should not issue from one who cares that his speech or what he writes matches reality. For anyone who stands upon his saying this after the Hadith before it which contains (so he mentioned similar to what Ibn Ishaq mentioned), then he conjoined to it saying: (And Imam Ahmad mentioned it in his Musnad...), understands from it nothing other than that what Ahmad mentioned is like, or at least similar to, what Ibn Ishaq mentioned in meaning and completeness. This is contrary to Ahmad's narration, for it is very brief compared to Ibn Ishaq's context. Its wording is: [80]\n\n(He wrote a writing between the Muhajireen and the Ansar that they should pay their blood monies, and they should ransom their captives with kindness and reconciliation among the Muslims). Where is this brief context compared to Ibn Ishaq's context which reaches about two pages of the size of this magazine's page? Sufficient indication for you is that Al-Buti mentioned (13) paragraphs from it, which are still few from many. If this indicates anything, it indicates that in his writings he does not seek correctness and precise expression matching reality. This is assuming he did not intend that to block the path of one who might criticize him for relying on Ibn Ishaq's narration which has no chain. For its chain consists of the two mentioned Hadiths as witnesses for it, and they contain what you learned of severe weakness in the first, and severe brevity with weakness in the other.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 81
  },
  {
    "serial_number": "3366046",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "6 - He said (p. 226) after mentioning the Hadith of Al-Hubab ibn Al-Mundhir regarding his advice to the Prophet (peace and blessings be upon him) to camp in a place other than the one he (peace and blessings be upon him) had camped in: (Ibn Hisham narrated this Hadith of Al-Hubab ibn Al-Mundhir in his Seerah from Ibn Ishaq from men of Banu Salamah. So in what Ibn Hisham narrated, it is a narration from unknown people. Al-Hafiz Ibn Hajar mentioned this Hadith in (Al-Isabah) and narrated it from Ibn Ishaq from Yazid ibn Ruman from Urwah ibn Az-Zubayr and more than one in the story of Badr, and this is a Sahih chain. Al-Hafiz Ibn Hajar is trustworthy in what he transfers and narrates. (Refer to Al-Isabah 1/302). I say: We have observations on it: First: His defecting Ibn Hisham's narration because it is from unknown people is not a damaging defect because they are a group whose anonymity is overlooked by the scholars of this field, especially since it is probable they are from the Sahabah (Companions). Because Ibn Ishaq narrated it like this: 'I was told by men from Banu Salamah'. If Ibn Ishaq had explicitly stated narration [Haddathana] from the men, the mentioned probability would be negated because Ibn Ishaq is from the followers of the Tabi'in, and we would be certain that the Hadith is Mursal. [81]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 82
  },
  {
    "serial_number": "3366047",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "But his saying: (I was told / Huddithtu) is evidence that there is an intermediary between him and the men, and it is possible that he is from the Tabi'in, so the mentioned probability remains standing. Rather, the damaging defect in this narration is the anonymity of the intermediary along with the probability of Irsaal (disconnection). Second: His saying regarding Urwah's narration: (And this is a Sahih chain) is not correct in an absolute sense due to two matters: The first: That Ibn Ishaq has some talk regarding his memory, and the settled opinion of investigating scholars is that his Hadith is in the rank of Hasan with two conditions: That he explicitly states narration [Tahdith to avoid Tadlis] and that he does not oppose one who is more trustworthy than him. The other matter: That Urwah is a Tabi'i who did not witness the event. So the correct statement is to say: Its chain is Mursal Hasan. In that case, it is a weak chain because Mursal is one of the categories of Weak according to the rules of Hadith scholars as established in its place. I find no face for the Doctor's mentioned saying except that he thinks Urwah ibn Az-Zubayr is a Companion like his brother Abdullah. If it is so, it is a strange thought that reveals the extent of the Doctor's knowledge of the men of the Salaf. Another Hadith of this type passed from him in the third chapter, Hadith six, pp. (19-20). Third: His saying about Al-Hafiz: (So he narrated it from Ibn Ishaq from Yazid) is an error, and like it is his saying afterwards: (transfers and narrates). Because narration (Riwayah) according to Muhaddithin does not mean mere mentioning of the narrated item and transferring it, but rather mentioning it with the narrator's chain from him to its end. The detail of that passed in the refutation of the Doctor's saying: (Ibn Kathir narrated) (p. 15), so refer to it. If he said: (narrates and transfers) it would have been closer to correctness on the consideration of his saying: (and transfers) being an explanation of his saying: (narrates). As for the reverse, it is incorrect due to what I mentioned. Fourth: His saying about Al-Hafiz also: (from Ibn Ishaq from Yazid) is an error of his against Al-Hafiz, because he only said: (Ibn Ishaq said in 'As-Seerah': Yazid told me [Haddathani] [82]\n\nibn Ruman...). There is a big difference between the two sayings for one who knows that Ibn Ishaq is a Mudallis (concealer), and that if he says (from / 'an), it is not a proof, but if he says: (told me / Haddathani), it is a proof. If the Doctor had knowledge of this, he would not have attributed to Al-Hafiz what he did not say, Allah the Exalted willing. Fifth: There is no doubt that Al-Hafiz is trustworthy, rather above trustworthy, but that does not mean he is infallible from error as the Shia say of their Imams. This narration which he mentioned from Urwah, I have not seen anyone mention it, like Ibn Sayyid An-Nas and Ibn Kathir and others. In addition to that, it is not in (Seerah Ibn Hisham) (2/272). Yes, it appeared in it before that (1/263): (Ibn Ishaq said: And Yazid ibn Ruman told me from Urwah ibn Az-Zubayr who said...). I say: So he mentioned a part of the Battle of Badr, then followed it with many other parts, beginning each part of them with his saying: (Ibn Ishaq said). Then Ibn Hisham said: Ibn Ishaq said: So I was told by men... etc. So he mentioned the story of Al-Hubab. I say: It is probable that when Al-Hafiz transferred it, his eye fell on the first chain from Urwah and his gaze did not fall on his second chain: 'from men of Banu Salamah', so it became from the narration of Urwah. But one could say: This is a strong probability were it not that Al-Hafiz joined to Urwah his saying: (and more than one). This is not in the Seerah at all, so where did he get it from? I say: This is something for which I have no answer now. It bears a remote probability that Al-Hafiz transferred Urwah's narration and 'more than one' directly from (Seerah Ibn Ishaq), so it would contain what is not in (Seerah Ibn Hisham) from him. This is very unlikely. And Allah knows best.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 83
  },
  {
    "serial_number": "3366049",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 83,
    "volume_number": 1,
    "text": "7 - He said (p. 246): (To explain this rule, the Messenger of Allah (peace and blessings be upon him) says in what Al-Bukhari narrated from Omar (may Allah be pleased with him): (We only take you now by what appears to us from your deeds...). And he says in what the Two Sheikhs narrated: (You dispute before me...) the Hadith). I say: This is an obscene sin that cannot be tolerated. For the Hadith in Al-Bukhari and others is not from the saying of the Prophet (peace and blessings be upon him); rather, it is from the saying of Omar (may Allah be pleased with him) suspended (Mawquf) upon him. It is in [83]\n\nAl-Bukhari in the beginning of the Book of (Witnesses) via Abdullah ibn Utbah who said: I heard Omar ibn Al-Khattab (may Allah be pleased with him) say: (Indeed, people used to be taken by revelation during the time of the Messenger of Allah (peace and blessings be upon him), but the revelation has ceased. And we only take you now by what appears to us from your deeds). Imam Ahmad also extracted it via another path from Omar as Mawquf similar to it. The most likely reason for the issuance of this sin from Dr. Al-Buti is firstly lack of checking what came in the Sunnah as is required, and secondly speed of copying without awareness and attention, because he transfers what he has not digested. Otherwise, if he were aware, this would not have happened from him by Allah's permission. Perhaps when he saw in the Hadith the saying: (Messenger of Allah, peace and blessings be upon him), he imagined that what followed it was his saying (peace and blessings be upon him). From the Doctor's saying after it: (And he says in what the Two Sheikhs narrated...), the reader knows that his saying in the first Hadith: (The Messenger of Allah, peace and blessings be upon him, says) is not an addition from the printer that the Doctor overlooked when correcting proofs, evidenced by his conjoining the second Hadith to the first Hadith which the Doctor explicitly stated and wrote with his pen was raised (Marfu') to the Prophet (peace and blessings be upon him). So he conjoined the second to it, and this one is known to be raised to the Prophet (peace and blessings be upon him) unlike the first. Were it not for that explicit statement, the mentioned conjunction would not be correct as is apparent. Among the Doctor's oddities and strange things is that in the first edition, he had placed another Hadith in place of this Hadith of Omar, the wording of which was: (To explain this rule, the Messenger of Allah, peace and blessings be upon him, says: We were ordered to judge by the apparent, and Allah handles the secrets). When our companion Master Eid Abbasi criticized him and explained to him that this Hadith has no origin, he deleted it and the Doctor printed in its place this Hadith of Omar which is Mawquf in Al-Bukhari, but he attributed it to him as Marfu' (raised to Prophet). If this indicates anything, it is that the Doctor was not successful in this amendment by which he increased in distance from correctness. Perhaps the Doctor has taken a lesson not to be arrogant again about admitting his error and thanking the one who alerted him to it, thereby giving a practical lesson to students and readers reminding them of the morals of pious scholars.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 84
  },
  {
    "serial_number": "3366051",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 84,
    "volume_number": 1,
    "text": "8 - He said (p. 288): (And it is also proven in the Two Sahihs that the Messenger of Allah (peace and blessings be upon him) [84]\n\nasked Jabir in the Ghazwah (expedition) of Dhat Ar-Riqa: Did you marry? He said: Yes). I say: The mention of the Ghazwah of Dhat Ar-Riqa is not in the (Two Sahihs) nor in either of them. The Doctor attributing that to them is one of his errors that are endless. Rather, that is in (Seerah Ibn Hisham) from Ibn Ishaq from Jabir, and its chain is Hasan. Ahmad also narrated it (375-376). Al-Bukhari commented a part of its beginning in (Al-Maghazi). Rather, he has in (Ash-Shurut) also as Mu'allaq (suspended) via another path from Jabir what implies that this was in the Ghazwah of Tabuk, but Al-Hafiz preferred Ibn Ishaq's narration over it. Let whoever wishes refer to it.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 85
  },
  {
    "serial_number": "3366053",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 85,
    "volume_number": 1,
    "text": "9 - He said (pp. 366-367) having mentioned the Hadith of the Messenger of Allah (peace and blessings be upon him) kissing Ja'far ibn Abi Talib between his eyes and embracing him upon his arrival from Abyssinia: (And the Hadith was narrated by Abu Dawud with a Sahih chain). I say: This is an error like his error in his previous saying regarding Urwah's Mursal report: (Sahih chain) as previously explained (p. 81, para 6). For Abu Dawud extracted it at the end of his book via Ali ibn Mushir from Ajlah from Ash-Sha'bi that the Prophet (peace and blessings be upon him) met Ja'far ibn Abi Talib, embraced him, and kissed what was between his eyes. I say: So Ash-Sha'bi is a known Tabi'i who did not witness the incident naturally, so the chain is interrupted (Munqati') and Mursal. And Al-Ajlah, who is Ibn Abdullah ibn Hujayyah Al-Kindi, is disputed; a group authenticated him and others weakened him, including Abu Dawud himself. Al-'Uqayli said: He narrated from Ash-Sha'bi disturbed (Mudtarib) Hadiths that are not corroborated. Adh-Dhahabi listed him in (Ad-Du'afa) number (229) of (Al-Mughni) and said: (Shi'i, there is no harm in his Hadith, some softened him. Al-Juzjani said: Al-Ajlah is a fabricator). Al-Hafiz said in (At-Taqrib): (Truthful, Shi'i). I say: The likes of him, his Hadith is not authenticated (Sahih) except by one who has no knowledge of the science of Hadith terminology and biographies of men. Rather, he only considers it Hasan if he is not among the strict ones. So the correct statement is [85]\n\nto say: (Narrated by Abu Dawud with a Hasan Mursal chain). And the more correct is to say: Narrated by Abu Dawud with a weak chain, because most readers do not know that the Mursal - according to Muhaddithin - is from the category of Weak Hadith like the Munqati', Mudallis, Mu'dal and others. This is all regarding Abu Dawud's narration. Otherwise, Al-Hakim narrated it (3/211) via Al-Hasan ibn Al-Husayn Al-'Urani, Ajlah ibn Abdullah told us, from Ash-Sha'bi from Jabir who said: So he mentioned the Hadith like this connected (Musnad) from Jabir. But this Al-'Urani was listed by Adh-Dhahabi in (Ad-Du'afa) and said (1389): (He is not truthful). I say: So the likes of him are not used as proof at all, so how can he be when he opposed the likes of Ali ibn Mushir, the Trustworthy (Thiqah) used as proof in the (Two Sahihs)? Rather, even if trustworthy narrators narrated it from Al-Ajlah connected from Jabir, it would not be Sahih because he opposed two trustworthy narrators, Ismail ibn Abi Khalid and Zakariyya ibn Abi Za'idah, who narrated it from Ash-Sha'bi as Mursal. Al-Hakim extracted it. So how is it when Al-Ajlah agreed with them in the authentic narration from him? That is why Adh-Dhahabi said in (Talkhis al-Mustadrak): (I say: And the Mursal is the correct one).",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 86
  },
  {
    "serial_number": "3366055",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 86,
    "volume_number": 1,
    "text": "10 - Then he said: (And At-Tirmidhi narrated from Aisha, may Allah be pleased with her, who said: Zaid ibn Harithah arrived in Medina while the Messenger of Allah (peace and blessings be upon him) was in my house. He came to him and knocked on the door, so the Prophet (peace and blessings be upon him) stood up to him dragging his garment, embraced him, and kissed him). I say: Its chain is weak, sequenced with three weak narrators in a row as I explained in my critique of Al-Kattani (p. 16 - Hadith Eighth). That is why Adh-Dhahabi said: (Munkar Hadith). So how does the Doctor's inclusion of this Hadith in his book meet with his saying that he relied in it on the authentic Sunnah? And if he has a special opinion opposing Imam Adh-Dhahabi's judgment and what I explained there, why didn't he refute us as he did in the three Hadiths regarding which the refutation of him passed? Or is he convinced within himself of the weakness of its chain explained there, for he is certainly aware of it, and that is why he did not turn to criticize it? In that case, the burden of citing it is greater. May Allah reform him and guide him. [86]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 87
  },
  {
    "serial_number": "3366056",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 87,
    "volume_number": 1,
    "text": "11 - He mentioned (p. 441) the Hadith of Omar ibn Al-Khattab regarding his racing with Abu Bakr As-Siddiq and Abu Bakr donating all his wealth, and his saying (may Allah be pleased with him): (I have left Allah and His Messenger for them). And he said in its Takhrij in the footnote: (Narrated by At-Tirmidhi, Al-Hakim, and Abu Dawud. In its chain is Hisham ibn Sa'd from Zaid ibn Aslam. Imam Ahmad and An-Nasa'i (Original says Al-Kisa'i) weakened him, and Al-Hafiz Ibn Hajar considered him of the fifth rank, saying about him: Truthful, has delusions. However, Adh-Dhahabi quoted from Abu Dawud that he is the most established of people when he narrates from Zaid ibn Aslam as in this Hadith, and quoted from Al-Hakim that Muslim extracted from him in the supporting evidences (Shawahid)). The Doctor said following the Hadith in the main text of the book: (And if this Hadith is authentic...). And he referred to it (p. 451) and said: (Despite the probabilities of weakness in it which I explained in the Takhrij of the Hadith). I say: This is a new type from the Doctor in Takhrij. While we previously saw him limiting himself in Takhrij of Hadiths to merely mentioning who extracted it without judging it with what it deserves of authenticity or weakness - and often it is weak so he remains silent about it, giving the illusion of its authenticity as passed repeatedly - suddenly we see him here reversing that and trying to weaken the established Hadith, clinging to the talk regarding the mentioned Hisham ibn Sa'd. Even though his Hadith, according to the people of knowledge of Jarh and Ta'dil and biographies of men, does not fall below the rank of Hasan. Because they know that the mere fact of a narrator being spoken about does not make his Hadith in the rank of Weak, for there is a middle rank between it and the rank of Sahih, which is Hasan. Hisham is of this type, especially in his narration from Ibn Aslam due to his frequent narration from him and his companionship with him. No wonder At-Tirmidhi, Al-Hakim, and Adh-Dhahabi authenticated his Hadith; rather, Imam Al-Bukhari used him as proof and cited him in suspended form (Mu'allaq) in his (Sahih) with the formula of certainty (Jazm) (Number 228 - Mukhtasar Sahih Al-Bukhari). Therefore, I extracted it in (Sahih Abi Dawud) [87]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 88
  },
  {
    "serial_number": "3366057",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 88,
    "volume_number": 1,
    "text": "Despite all this, we find Dr. Al-Buti ignoring, if not ignorant of, the authentication of it by these Imams, and trying to attribute weakness to it as if he views himself as having reached the highest rank in the science of Hadith and its criticism, taking complete independence in it. If another had done that - especially if he were from the Salafis - he would have stood up and sat down, thundered and foamed, and pretended Islamic zeal and religious jealousy for the station of the Imams in the hearts of the Ummah, and attributed it to slandering them and not respecting them, exactly as he says about the Salafis and accuses them of many charges because they do not adhere to the Madhhab of a specific Imam but take the saying of any Imam among them in what agrees with the Book and Sunnah according to them. So let the noble reader reflect on the wisdom of the Wise, the Knowing, how He makes the circle turn upon the aggressor. This is first. As for second: Let the intelligent person look at his saying: (And despite the probabilities of weakness in it which I explained). I say: Where are these alleged probabilities? For the Doctor only explained one probability, which is nevertheless rejected by the authentication of those Imams for it. Third: Al-Hafiz said in (Al-Fath) (3/229) regarding the Hadith, and Al-Bukhari had commented a part of it as previously mentioned: (This is famous in the Seerahs... it appeared in a Marfu' Hadith extracted by Abu Dawud, and At-Tirmidhi and Al-Hakim authenticated it...). He mentioned it then said: (Hisham ibn Sa'd was unique with it from Zaid, and Hisham is truthful, having some speech regarding his memory). I say: The Doctor mentioned many Hadiths of the Seerah and its stories which are less famous than this Hadith, and among them are those known to have no chain at all, mentioning them as if they were authentic. So how did the fame of this Hadith, along with the Imams' authentication of it, not intercede for him to include it without any criticism from himself? He knows that he has no methodology or school he adheres to in authenticating Hadiths [88]\n\nand classifying them. Rather, his matter in that is as the common people say (cut and paste). Fourth: Al-Buti prioritized At-Tirmidhi and Al-Hakim over Abu Dawud in mentioning, and what is known among scholars is the opposite. No one among them prioritizes At-Tirmidhi, let alone Al-Hakim, over Abu Dawud. Rather, they say: Narrated by Abu Dawud, At-Tirmidhi, and Al-Hakim. Just as they say: Narrated by Al-Bukhari, Muslim, and Abu Dawud. They do not reverse that at all. That is out of manners from them by way of putting people in their places. Has Al-Buti not memorized this manner from them until today, having become a Doctor, or has knowledge become clear to him that the ancients did not encompass, so he permitted himself to oppose them in their manners and method? Let not the reader think that this is a slip of the pen from the Doctor, for he said on page 450: (We mentioned the Hadith which At-Tirmidhi and Abu Dawud narrated regarding Abu Bakr presenting all his money...). And he said on the page after it: (Indeed, the Hadith of At-Tirmidhi, Al-Hakim, and Abu Dawud). If this indicates anything, it is that the Doctor does not refer to books of Hadith except very rarely. Otherwise, their manner in the mentioned arrangement would not be hidden from him, and this is clear and not hidden, and praise be to Allah. I almost said due to the multitude of these errors: These Takhrijs and comments are not by the pen of the Doctor himself; rather, they are by the pen of one of his students, and not the brilliant ones among them.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 89
  },
  {
    "serial_number": "3366059",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 89,
    "volume_number": 1,
    "text": "12 - He said (p. 442): (And Imam Ahmad narrated in his Musnad from Abu Hurairah who said: When it was the Ghazwah of Tabuk, the people were struck by famine...). I say: So he mentioned the Hadith at length and commented on it saying: (Narrated by Ahmad in his Musnad, and Al-Hafiz Ibn Kathir mentioned it in his History then said: Muslim narrated it from Abu Kurayb from Abu Mu'awiyah from Al-A'mash). I say: This comment, despite its brevity, contains disturbing repetition not hidden from the reader. Worse than it is his quoting Ibn Kathir's speech cut off, for the completion of Ibn Kathir's speech is (...from Al-A'mash bi-hi [with it/via the same chain]). The word (bi-hi) might have been dropped by the printer and the Doctor did not notice it when correcting proofs. But even so, what is the benefit of this quote then, especially when it is a matter the Doctor did not follow [89]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 90
  },
  {
    "serial_number": "3366060",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 90,
    "volume_number": 1,
    "text": "in all his comments without introduction and explanation for it? And what is the meaning of his saying: (from Abu Kurayb from Abu Mu'awiyah from Al-A'mash)? Is the end of this chain, who is Al-A'mash named Sulayman ibn Mihran, one of the young Tabi'in, making the Hadith Mursal based on this? Is this the intended meaning of the mentioned chain? No. So what is it then? Even if we assume that the word (bi-hi) fell from the printer and not from the Doctor himself. Indeed, Al-Hafiz Ibn Kathir mentioned the Hadith and presented its chain beforehand, saying: (Imam Ahmad narrated it from Mu'awiyah from Al-A'mash from Abu Salih from Abu Hurairah or from Abu Sa'id Al-Khudri - Al-A'mash doubted - who said...). I say: So he mentioned the Hadith then said at its end: (And Muslim narrated it from Abu Kurayb from Abu Mu'awiyah from Al-A'mash bi-hi). With this, one who has knowledge of Hadith and its chains can understand that this saying of Ibn Kathir means that Muslim narrated it via Abu Kurayb who followed Abu Mu'awiyah, the Sheikh of Imam Ahmad, in his narration of the Hadith from Abu Mu'awiyah from Al-A'mash bi-hi, meaning with the mentioned chain of Al-A'mash found in Ahmad. Meaning that both Abu Mu'awiyah and Abu Kurayb narrated the Hadith from Al-A'mash from Abu Salih from Abu Hurairah or from Abu Sa'id Al-Khudri, like this with doubt between Abu Hurairah and Abu Sa'id Al-Khudri. If you know this, O noble reader, say by your Lord, what is the benefit gained by the reader of Al-Buti's book if he [Al-Buti] undertook explaining this meaning intended by Ibn Kathir by his previous statement? So how is it when it is unexplained by him? How rich he would have been without mentioning it if he limited himself in the Takhrij to his saying: (Narrated by Ahmad and Muslim) as is his habit regarding this book and others. After this, a new error of Professor Al-Buti has become clear to the readers in his mentioned Takhrij, which is that he attributed the Hadith to the narration of Ahmad and Muslim from the Hadith of Abu Hurairah, while in both of them it is from Abu Hurairah or from Abu Sa'id Al-Khudri with doubt as I explained. Ibn Kathir also attributed it to them [90]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 91
  },
  {
    "serial_number": "3366061",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 91,
    "volume_number": 1,
    "text": "13 - He mentioned (p. 502) the agreed-upon Hadith: (May Allah's curse be upon the Jews and the Christians; they took the graves of their prophets as mosques). He said following it: 'It is as if he warns the Muslims against doing with him what they did.' I say: This statement from the Doctor informs the scholar of Hadith of one of two things: Either the Doctor is so ignorant that he has no knowledge of Hadith, or he intentionally distorts the narration of the Hadith. That is because the mentioned warning, which the Doctor made out to be his own deduction, is actually part of the complete text of the agreed-upon Hadith. It is from the Hadith of Aisha and Abdullah ibn Abbas (may Allah be pleased with them both), for they said immediately following the Hadith: (He was warning against what they did). This is how Al-Bukhari extracted it (1/422, 6/386, 10/227 - Fath al-Bari), and Muslim (2/67), Ad-Darimi (1/326), and Ahmad (1/218). The latter explicitly stated that this is from the speech of Aisha (may Allah be pleased with her). This is a benefit that Al-Hafiz Ibn Hajar missed pointing out, as he said in Al-Fath (1/423): (His saying: 'He was warning against what they did' is another new sentence from the speech of the narrator, as if he was asked about the wisdom of mentioning that at that time, so he answered with that). Therefore, the saying: (He was warning against what they did) is from the speech of the narrator of the Hadith, as Al-Hafiz explicitly stated, and she is Aisha (may Allah be pleased with her) as in Ahmad's narration. So how did the Doctor make it his own speech? This action of his reminds me of a type of impugning Hadith narrators known as 'stealing Hadith'; a narrator would hear of a Hadith narrated by some, so he would steal it from him and attach one of his own chains to it, then raise it to the Prophet (peace and blessings be upon him). As for the Doctor, he attributed the Hadith [commentary] to himself. However, I cannot assert that he intended that, due to my certainty that his memorization of Prophetic Hadiths is very little. So it is strongly probable that he does not know that the sentence: (He was warning against what they did) is in the Hadith, so he explained it from his own mind. Furthermore, the Doctor's saying: (It is as if he, peace and blessings be upon him, warns...) contains clear skepticism that he (peace and blessings be upon him) intended the warning. [91]\n\nAnd this contradicts, with explicit contradiction, the certainty of Sayyidah Aisha regarding that in her saying: (He was warning against what they did). How could it not be so, when the witness sees what the absent does not see? As he (peace and blessings be upon him) said (1). So contemplate what ignorance of Hadith does in terms of distorting and altering the explicit authentic text.\n\n14 - He said (p. 521) while listing the faces indicating the legitimacy of visiting his grave (peace and blessings be upon him): (The second face: What is established of the consensus of the Companions, the Tabi'in, and those after them regarding visiting his grave (peace and blessings be upon him) and greeting him every time they passed by the Noble Rawdah. This was narrated by the prominent Imams and the majority of scholars, including Ibn Taymiyyah, may Allah have mercy on him). I say: This is a lie against the prominent Imams, especially Ibn Taymiyyah, the Sheikh of Islam. For none of them narrated from the mentioned people that they visited the Noble Grave every time they passed by the Rawdah, let alone transmitting consensus on it. Rather, Imam Malik textually stated that such an action is disliked (Makruh). The sayings of the scholars witnessing to what I say are many; I will content myself with two sayings from them: One from Ibn Taymiyyah, the one slandered against, and the other from Imam An-Nawawi, considering him one of the Shafi'i Imams whom Dr. Al-Buti imitates.",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "421",
    "new_page_number": 92
  },
  {
    "serial_number": "3366064",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 92,
    "volume_number": 1,
    "text": "1 - As for Ibn Taymiyyah, his statements are very many in this regard. Here are two texts from them: First: His saying: (The Companions did not used to enter near the grave, nor stand by it from the outside, even though they entered his mosque night and day. They used to arrive from journeys to meet the Rightly Guided Caliphs and others, so they would pray in his mosque and send peace upon him in the prayer and upon entering the mosque and exiting it. They would not come to the grave because that was, according to them, something he did not command them to do nor institute as a Sunnah for them. He only commanded and instituted for them the prayer and sending peace upon him in the prayer and when entering mosques and so on. However, Ibn Umar used to come to him and greet him and his two companions upon his arrival from travel. Others besides Ibn Umar might have done it too. For this reason, those scholars who viewed this as permissible did so following the example of the Companions, may Allah be pleased with them. Ibn Umar used to greet [him]",
    "foot_note": "1. (1) I say: It is extracted in my work (Al-Ahadith As-Sahihah) number (1904). \n[92].",
    "book_id": "421",
    "new_page_number": 93
  },
  {
    "serial_number": "3366065",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 93,
    "volume_number": 1,
    "text": "then leave and would not stand. He would say: 'Peace be upon you, O Messenger of Allah. Peace be upon you, O Abu Bakr. Peace be upon you, O my father,' then he would leave. The majority of the Companions did not do as Ibn Umar did; rather, the Caliphs and others would travel for Hajj and other things and return without doing that, because this was not, in their view, a Sunnah he instituted for them. Likewise, his wives during the era of the Caliphs and after them would travel for Hajj then each one would return to her house as he instructed them. The delegations of Yemen, about whom Allah the Exalted said: {Allah will bring forth a people He will love and who will love Him}, used to come in crowds from Yemen for Jihad in the path of Allah during the era of Abu Bakr and Umar. They would pray behind Abu Bakr and Umar in his mosque, and not one of them would enter inside the chamber nor stand in the mosque outside of it, neither for supplication, nor for prayer, nor for greeting, nor for anything else. They were knowledgeable of his Sunnah as the Companions and Tabi'in taught them). This is in his book (Al-Jawab Al-Bahir fi Zuwwar Al-Maqabir) (p. 60 - Salafi Edition). Second: His saying in his refutation of Al-Akhna'i (p. 45): (As for what is thought to be a visit to his grave (peace and blessings be upon him), such as standing outside the chamber for greeting and supplication, this is not recommended for the people of Medina. Rather, they are forbidden from it, because the first predecessors from the Muhajireen and Ansar and those who followed them in good - the Rightly Guided Caliphs and others - used to enter his mosque for the five prayers and other things. The grave was at the wall of the mosque, and they did not go to it nor stand by it. Malik and other scholars mentioned this; they stated that it is not recommended, rather it is disliked (Makruh) for residents of Medina to stand at the grave for greeting or otherwise, because the righteous predecessors did not do that when they entered the mosque for the five prayers and others during the era of the Rightly Guided Caliphs, Abu Bakr, Umar, Uthman, and Ali, may Allah be pleased with them. For they used to lead people in prayer in the mosque, and people would come from the regions to pray with them. It is known that if it were recommended for them to stand adjacent to the grave and greet or supplicate or do other than that, they would have done so. And if they had done it, it would have been frequent, apparent, and famous. However, Malik and others specified the legislation of that for when traveling, based on what was transmitted from Ibn Umar. Qadi Iyad said: [93]\n\nMalik said: There is no harm for one who arrived from a journey or set out for a journey to stand at the grave of the Prophet (peace and blessings be upon him) and send prayers upon him and supplicate for him and for Abu Bakr and Umar. It was said to him: 'What about people from the people of Medina who are not arriving from a journey nor intending one, doing that once or more in a day, and perhaps they stand on Friday and on days once or twice or more than that at the grave, sending greetings and supplicating for an hour?' He said: 'This has not reached me from the people of Fiqh in our land, and leaving it is ample. The latter part of this Ummah will not be rectified except by what rectified its first part. It has not reached me regarding the first of this Ummah and its early generation that they used to do that, and it is disliked except for one who came from a journey or intended one').",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 94
  },
  {
    "serial_number": "3366067",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 94,
    "volume_number": 1,
    "text": "2 - An-Nawawi said in his book (Manasik al-Hajj) (69/2 - Manuscript): (Malik, may Allah have mercy on him, disliked for the people of Medina to stand at the grave every time one of them entered or exited. He said: That is only for strangers. He said: And there is no harm for one who arrived from a journey or set out for a journey to stand at the grave of the Prophet (peace and blessings be upon him) and send prayers upon him and supplicate for him and for Abu Bakr and Umar, may Allah be pleased with them both. Al-Baji said: Malik distinguished between the people of Medina and strangers because strangers intended that [visit], while the people of Medina are residents there, and he (peace and blessings be upon him) said: O Allah, do not make my grave an idol to be worshipped). I say: These statements from Imam An-Nawawi and Sheikh al-Islam Ibn Taymiyyah are explicit in invalidating the consensus that Al-Buti reported. Rather, they speak to the illegitimacy of what he mentioned, and that he lied against the scholars in general and Ibn Taymiyyah in particular regarding what he attributed to them of narration. So what does the fair, unbiased person say about such a human who does not care what comes out of his mouth? To Allah is the complaint. Then the Doctor said: (The third face: What is established of the visit of many Companions to his grave (peace and blessings be upon him), among them Bilal, may Allah be pleased with him. Ibn Asakir narrated it with a Jayyid [good] chain). I say regarding it are matters: First: He was vague to the readers regarding the text of Ibn Asakir's narration and sufficed with pointing to it [94]\n\nbecause if he quoted it in full, its falsehood would become clear to the people, even if they did not know the weakness of its chain. So it was necessary for me to quote the narration so that the noble readers may be certain with us that the Doctor does not proceed in what he writes according to a verified scientific method; rather, it is whim and motive, and according to the alleged rule (the end justifies the means). Al-Hafiz Ibn Asakir narrated in (Tarikh Dimashq) in the biography of Ibrahim ibn Muhammad ibn Sulayman ibn Bilal ibn Abi Darda' Al-Ansari (Vol 2 Part 4 25/1) with his chain from him, saying: My father Muhammad ibn Sulayman told me, from his father Sulayman ibn Bilal, from Umm Darda', from Abu Darda' who said: (So he mentioned the story of Bilal's arrival in Sham during the era of Umar, then said): (Then Bilal saw the Prophet (peace and blessings be upon him) in his sleep saying to him: 'What is this estrangement, O Bilal? Is it not time for you to visit me, O Bilal?' So he woke up sad, fearful, and afraid. He rode his mount and headed for Medina. He came to the grave of the Prophet (peace and blessings be upon him) and began to cry at it and rub his face on it. Al-Hasan and Al-Husayn came, and he began hugging and kissing them. They said to him: 'O Bilal, we desire to hear your Adhan which you used to call for the Messenger of Allah (peace and blessings be upon him) at dawn.' So he did. He climbed the roof of the mosque and stood in the place where he used to stand. When he said: (Allah is Greatest), Medina shook. When he said: (I bear witness that there is no god but Allah), its shaking increased. When he said: (I bear witness that Muhammad is the Messenger of Allah), peace and blessings be upon him, the young women came out of their private quarters saying: 'Has the Messenger of Allah (peace and blessings be upon him) been sent [resurrected]?' No day was seen with more weeping men and women after the Messenger of Allah (peace and blessings be upon him) than that day). I say: This narration is false and fabricated. The signs of fabrication upon it are apparent from several aspects, the most important of which are:",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 95
  },
  {
    "serial_number": "3366069",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 95,
    "volume_number": 1,
    "text": "1 - His saying: (He came to the grave of the Prophet, peace and blessings be upon him, and began to cry at it). This portrays to us that his grave (peace and blessings be upon him) was visible like other graves in graveyards that anyone can come to. This is intuitively false according to anyone who knows the history of the burial of the Prophet (peace and blessings be upon him) in the chamber of Aisha (may Allah be pleased with her) [95]\n\nand her house, which no one is allowed to enter except with her permission. Likewise was the matter during the era of Umar (may Allah be pleased with him). It is established that when he was stabbed (may Allah be pleased with him), he ordered his son Abdullah to go to Aisha and say to her: 'Umar says to you: If it does not harm you or restrict you, I would love to be buried with my two companions.' She said: 'That does not harm me nor restrict me.' He said: 'Then bury me with them.' Extracted by Al-Hakim (3/93). Then he extracted (4/7) with his Sahih chain from her that she said: (I used to enter the house in which he was buried with them, and by Allah, I never entered except with my clothes wrapped tight around me out of shyness from Umar, may Allah be pleased with him). The Noble Grave remained in Aisha's house until after her death, rather until the end of the century of the Companions (may Allah be pleased with them). Then they entered the house [into the mosque complex] and joined it to the mosque to expand it, so it became inside the mosque in the manner seen today. One who has no knowledge of the reality of the matter might think that when the Prophet (peace and blessings be upon him) died, the Companions buried him in the mosque - far be it from them to do that. Rather, they buried him in the house, then what we mentioned happened afterwards, contrary to what many ignorant people think, including the fabricator of this story who gave an image of the grave contradicting the reality of that day and the Companions (may Allah be pleased with them), as explained by Sheikh al-Islam and other verifiers. I mentioned a part of it in my book (Tahdhir As-Sajid min Ittikhadh Al-Qubur Masajid - Warning the Prostrator against taking Graves as Mosques), so whoever wishes may refer to it.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 96
  },
  {
    "serial_number": "3366071",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 96,
    "volume_number": 1,
    "text": "2 - His saying: (and rub his face on it). I say: This is another proof of the fabrication of this story and the ignorance of its fabricator. For he depicts Bilal (may Allah be pleased with him) as one of those ignorant people who do not stop at the limits of the Sharia when they see graves, doing impermissible acts of Shirk and paganism at them, such as touching the grave, wiping oneself on it, kissing it, and other things mentioned in their proper place. Even if some pseudo-jurists who have no knowledge of the Book and Sunnah to illuminate their insights and hearts permit that, aligning with the common masses in their whims and justifying many of their misguidances for them. It truly pleased me that Dr. Al-Buti was not among them this time, for [96]\n\nI saw him say in the etiquette of visiting his grave (peace and blessings be upon him) (p. 523): (So beware of rushing upon it or sticking to the windows or wiping over them as many ignorant people do, for that is an innovation (Bid'ah) that is close to being prohibited). This statement from the Doctor, despite the hesitation it contains regarding the ruling of what was mentioned - which indicates he has not yet understood his saying (peace and blessings be upon him): (Every innovation is misguidance, and every misguidance is in the Fire) - indicates clearly that he cannot believe that Bilal rubbed his face on the Prophet's grave (peace and blessings be upon him). This is the truth. In that case, how does the Doctor use this narration of Ibn Asakir as proof when it contains this Munkar (denounced act) by his own admission? The truth is that the Doctor does not want verification; if he wanted it, he could not achieve it because he does not possess the means enabling him to do so. He takes from a single narration what he desires and uses it as proof, and turns away from what he does not desire, rather he denies it. Otherwise, what would the Doctor say to one of the innovators or pseudo-jurists who might argue against him using this narration of Ibn Asakir for the permissibility of rubbing oneself on the Noble Grave, when he himself has used it as proof and strengthened it?",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 97
  },
  {
    "serial_number": "3366073",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 97,
    "volume_number": 1,
    "text": "3 - His saying: (The young women came out of their private quarters...) etc., is poetic, imaginative speech whose fabrication is apparent. Otherwise, what is the connection between their coming out and hearing the second testimony and their saying (Has the Messenger of Allah, peace and blessings be upon him, been sent [resurrected])? Because of that, Al-Hafiz Ibn Hajar asserted that this story is fabricated, as will come. Second: Al-Buti's saying: (Ibn Asakir narrated it with a Jayyid [good] chain). I say: In it are two criticisms: The first: That this classification of 'Jayyid' is not from the Doctor's knowledge or Ijtihad, because he has absolutely no knowledge qualifying him to issue such a judgment, as the readers have known from the previous articles. Even if this judgment is an error in itself as will come, it was obligatory upon him to attribute it to the one he copied it from, so as not to appear satiated with what is not his, due to his saying (peace and blessings be upon him): (The one who pretends to satisfy himself with what he was not given is like the wearer of two garments of falsehood). Agreed upon. [97]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 98
  },
  {
    "serial_number": "3366074",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 98,
    "volume_number": 1,
    "text": "The second: The mentioned statement belongs to Sheikh As-Subki the Shafi'i; he said it in his book (Shifa' As-Siqam fi Ziyarat Khayr Al-Anam). The verifying Hafiz Muhammad ibn Abdul-Hadi Al-Hanbali refuted him in his great book: (As-Sarim Al-Munki fi Ar-Radd 'ala As-Subki) (pp. 210-215). He wrote at length on it, the summary of which is that its chain is not fit to be relied upon, nor is it referred to in disputes by any of the Imams of this field. I will explain its defect shortly, Allah the Exalted willing. Is the Doctor aware of this, yet preferred As-Subki's saying over it for no reason other than that he is Shafi'i in Madhhab like him? Or did he not know of it at all? The matter is as was said: If you do not know... The third: That the chain of the story is as far as can be from being 'Jayyid'. For it is in Ibn Asakir, as previously mentioned, from the narration of Ibrahim ibn Muhammad ibn Sulayman from his father Sulayman ibn Bilal. This is a dark chain containing two unknowns: The first: Sulayman ibn Bilal. Al-Hafiz Ibn Abdul-Hadi said: (He is unknown; rather, he is Majhul al-Hal (unknown state) [sic: Original text], narrating little, not famous for bearing knowledge or transmitting it, and no Imam authenticated him as far as we know. Al-Bukhari did not mention his biography in his book, nor did Ibn Abi Hatim, and no hearing from Umm Darda' is known for him). I say: He is Majhul al-Ayn (unknown person). What is in the original (Majhul al-Hal) is perhaps a typo or a slip of the pen from the author, may Allah have mercy on him. Following Al-Bukhari and Ibn Abi Hatim, Adh-Dhahabi did not mention him in (Al-Mizan) nor Al-Hafiz in (Al-Lisan). The other: Ibrahim ibn Muhammad ibn Sulayman ibn Bilal. Al-Hafiz Ibn Abdul-Hadi said (A sheikh not known for trustworthiness or honesty, nor accuracy or probity. Rather, he is unknown, not known for transmission nor famous for narration. No one narrated from him other than Muhammad ibn Al-Fayd. He narrated from him this Munkar report). Adh-Dhahabi listed him in (Ad-Du'afa) and said: (He is not known). And he said in (Al-Mizan): (There is ignorance [Jahala] regarding him; Muhammad ibn Al-Fayd Al-Ghassani narrated from him). [98]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 99
  },
  {
    "serial_number": "3366075",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 99,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar approved him in (Al-Lisan) and added to it saying: (Ibn Asakir gave his biography then cited his narration from his father from his grandfather from Umm Darda' from Abu Darda' regarding the story of Bilal's journey to Sham and the story of his coming to Medina and his Adhan there and Medina shaking with weeping because of that. It is a story of clear fabrication). I say: Both Hafiz Al-Mizzi and Ibn Kathir pointed to the weakness of this story. As for the first, it is in the biography of Bilal in his book (Tahdhib al-Kamal), and the other in his biography in his book (Al-Bidaya) (2/102). So these are five famous Huffaz - all of them Shafi'is to Al-Buti's luck, except Ibn Abdul-Hadi - who asserted its lack of authenticity, ranging from explicitly declaring it fabricated to weakening it. Opposing them is As-Subki alone who declared its chain 'Jayyid'. Scientific criticism decidedly judges him to be deluded, if not said to be following his whim. Despite this, the virtuous Doctor imitated him excluding the others. So what does every unbiased person stripped of whim say about this Doctor who authors books on Seerah and determines Sharia rulings while he does not know how to follow evidence nor how to imitate [correctly]? O Allah, guide him. Two notices: First: Muhammad ibn Sulayman ibn Bilal was given a biography by Al-Hafiz Ibn Abdul-Hadi (p. 224) from which it is taken that he is Majhul al-Hal. However, I found Ibn Abi Hatim narrated in (Al-Jarh wat-Ta'dil) (3/2/267) from his father that he said about him: (There is no harm in his Hadith). Thus, I avoided defecting the story through him as well. The other: Al-Buti cited Ibn Asakir's previous narration regarding Bilal, arguing with it against Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, regarding his opposition - according to Al-Buti's claim - to the consensus stating the legitimacy of visiting his grave (peace and blessings be upon him). This is a fabrication against Sheikh al-Islam Ibn Taymiyyah, may Allah the Exalted have mercy on him. Its banner was carried by Sheikh Al-Akhna'i, As-Subki, and others of old, and Zayni Dahlan and his likes in his war against the renewer of the call of Tawhid, Muhammad ibn Abd al-Wahhab, may Allah's mercy be upon him, and those who followed them in it from the earlier and later generations, including the poor Al-Buti. For he said (p. 520): [99]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 100
  },
  {
    "serial_number": "3366076",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 100,
    "volume_number": 1,
    "text": "(And know that visiting his mosque and his grave, peace and blessings be upon him, is among the greatest acts of closeness to Allah Almighty. The masses of Muslims have agreed on that in every era until our day. No one disagreed in that except Ibn Taymiyyah, may Allah forgive him, for he held that visiting his grave is not legitimate). Then he argued for the mentioned consensus with four faces, one of which is Ibn Asakir's narration. Then he said: (Know that there is no basis for what Ibn Taymiyyah was unique in, regarding his rejection of these faces without a repeller, and the saying that visiting his grave, peace and blessings be upon him, is not legitimate). I say: This is a lie and a great fabrication by this pretender against Sheikh al-Islam, may Allah the Exalted have mercy on him. His books and fatwas are overflowing with explicit statements on the legitimacy of visiting Muslim graves in general and visiting his grave (peace and blessings be upon him) in particular, as is known to anyone who viewed any of the Sheikh's books and studied them. Among that is his book (Ar-Radd 'ala Al-Akhna'i), who is one of the Sheikh's contemporaries who refuted him with injustice coupled with fabrication against him. From that is the accusation that Al-Buti snatched from him or from the likes of him among the fabricating liars without referring to some of the Sheikh's books to clarify the truth of the matter. For the Sheikh, may Allah have mercy on him, said in the beginning of (Ar-Radd 'ala Al-Akhna'i) after mentioning his stated fabrication against him: (The respondent [meaning himself] is known to have books and fatwas filled with the recommendation of visiting graves. In all his rites [Manasik], he mentions the recommendation of visiting the graves of the people of Baqi' and the martyrs of Uhud, and mentions visiting the grave of the Prophet, peace and blessings be upon him, when entering his mosque, and the etiquette in that). He said in the beginning of his book (Al-Jawab Al-Bahir fi Zuwwar Al-Maqabir) (p. 14): (I mentioned in what I wrote of rites that traveling to his mosque and visiting his grave, as the Imams of Muslims mention in the rites of Hajj, is a righteous recommended deed. I mentioned the Sunnah in that and how to greet him, and whether to face the chamber or the Qiblah, on two opinions...). Ibn Abdul-Hadi explained this in his refutation of As-Subki, so let whoever wants more refer to it. So what does the speaker say about Dr. Al-Buti and this fabrication of his? Did he not view [100]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 101
  },
  {
    "serial_number": "3366077",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 101,
    "volume_number": 1,
    "text": "these sources that stand between him and it? Or did he view them and know that Sheikh al-Islam is innocent of it, then persisted in accusing him of it due to the rancor and hatred in his heart against Sheikh al-Islam Ibn Taymiyyah specifically and the Salafis generally, unconcerned with the likes of His saying, Exalted is He: {Indeed, those who came with falsehood are a group among you. Do not think it bad for you; rather it is good for you. For every person among them is what [punishment] he has earned from the sin} and His saying Almighty: {And those who harm believing men and believing women for [something] other than what they have earned have certainly born upon themselves a slander and manifest sin}. Whether it was this or that, Allah Almighty is the Reckoner of Al-Buti and his likes. We only have to defend those who believed and clear their arena from what they were accused of regarding lies and falsehoods, the motive for which is sometimes ignorance and other times injustice, and they may be combined. Of the first type is his saying (No one disagreed in that except Ibn Taymiyyah). For it is clear that the demonstrative noun (that) refers to both visiting his mosque (peace and blessings be upon him) and visiting his grave. This is a new fabrication in which Al-Buti was unique over his predecessors pointed to, because visiting his mosque (peace and blessings be upon him) is something Sheikh al-Islam also says is legitimate; rather, he says it is legitimate to travel to it specifically as previously mentioned, unlike traveling to visit his grave (peace and blessings be upon him) specifically. The apparent meaning of Al-Buti's speech is that he does not distinguish between the two visits like his previous predecessors. Evidence for that is his saying following what was quoted from him just now: (The sum of what Ibn Taymiyyah relied upon in that is the saying of the Messenger of Allah, peace and blessings be upon him: (Do not saddle the mounts except to three mosques...). This was used by Ibn Taymiyyah to prove the legitimacy of traveling to the mosque to the exclusion of the grave. Al-Buti rejects his deduction by claiming that the Hadith is a metonymy for the fact that the places most worthy of attention to travel to from far distances are these three mosques, evidenced by the fact that the Prophet (peace and blessings be upon him) used to single out other places besides these mosques for visiting (), like his visit (peace and blessings be upon him) to Quba Mosque every week. So contemplate how he confuses visiting with travel [Shadd ar-Rihal], which is what is negated in the first Hadith, and visiting without travel [from afar], which is affirmed in the Hadith of Quba. There is no contradiction between them as is apparent. This is what [101]\n\nSheikh al-Islam went to, may Allah the Exalted have mercy on him, because he asserts the legitimacy of visiting Quba Mosque and visiting the graves of Baqi' and the martyrs and other graves, but he does not permit traveling [specifically] to them, as indicated by the first Hadith. So he asserts both Hadiths, whereas Al-Buti - may Allah guide him - does not have the knowledge to reconcile them if they were contradictory - except by suspending the indication of the first of them by claiming it is a metonymy. This is contrary to what the Predecessors (Salaf) among the Companions and others understood. It is established from Ibn Umar (may Allah be pleased with them both) that he forbade a man who wanted to go to At-Tur, saying to him: (Leave At-Tur alone and do not go to it). He argued against him with the Hadith prohibiting saddling the mounts. Similar to this is established from more than one Companion, as you see detailed in my book (Ahkam al-Jana'iz) (pp. 224-231). If the Hadith meant what Al-Buti went to, Ibn Umar's prohibition of going to At-Tur would not be sound. Do you think Al-Buti is correct or Ibn Umar? O Allah, guide him. My purpose now is not to discuss Al-Buti in everything that appeared in this issue regarding confusions, for this has another place which was previously referred to in explaining Fiqh errors - and how many they are. Rather, it is only to alert to his fabrication against Sheikh al-Islam Ibn Taymiyyah and to warn the readers not to be deceived by the likes of him. Allah the Exalted is the One asked to guide our steps, purify our intentions, and grant us success for righteous deeds in accordance with the Book and Sunnah.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 102
  },
  {
    "serial_number": "3366079",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 102,
    "volume_number": 1,
    "text": "15 - Then the Doctor said in the footnote of (p. 521): (There is also a group of Hadiths reported from him (peace and blessings be upon him) regarding the merit of visiting his grave; most of them are not free from weak or lenient status. Although they rise in their aggregate to the degree of strength, we preferred not to cite them with these proofs we mentioned so that the opposers do not cling to what they might like to cling to regarding leniency or weakness in them, thereby finding a loophole to support Ibn Taymiyyah's opinion despite its oddity). I say: This reminded me of the famous proverb: More foolish than an ostrich. [102]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 103
  },
  {
    "serial_number": "3366080",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 103,
    "volume_number": 1,
    "text": "This is because if it sees the hunter, it buries its head in the sand so the hunter doesn't see it, due to its foolishness. So it is with the Doctor; by preferring not to cite those Hadiths, he imagined he would escape criticism and the exposure of error. But he is not escaping, for the referenced Hadiths are known for weakness and Nakarah (denouncement) whether he cites them or not. Had he truly wanted escape, he would have dispensed with this footnote and not blackened his book with it, nor opened the door of criticism upon himself. But Allah the Exalted refuses except to complete His light and show people the clear truth, and that one should not undertake this noble science [without qualification] so that they are not deceived by the author and his book again and stray from the straight path. It seems that what forced him to this statement is his feeling of ignorance and inability to prove what he claimed of strength. So he had no choice but the claim which no ignorant person is incapable of, and he was not satisfied with it until he resorted to justifying it with what makes the bereaved mother laugh. Not only this, but he turned away from the explicit statements of the Imams weakening all paths of the referenced Hadiths, among them a group of senior Shafi'i Imams whom the Doctor usually is fanatical for, like Imam An-Nawawi and Al-Hafiz Ibn Hajar Al-Asqalani, let alone other verifying Huffaz. As I will explain, by the permission of Allah the Exalted, detailing what is in his statement of ignorance, feigning ignorance, fabrication, blind imitation, and following whim. He imitated in his claim that the Hadith of the merit of visiting his grave (peace and blessings be upon him) rises to the degree of strength some of the late imitator jurists who have no knowledge of this noble science, like Al-Akhna'i and As-Subki and others of the later ones. He knows that those who refuted them among the people of knowledge of this science explained the falsehood of the mentioned claim in a way that leaves no doubt. Here is Al-Akhna'i saying: (Hadiths were reported regarding visiting his grave, some Sahih and others which did not reach the degree of Sahih, but it is permissible to use them as evidence for Sharia rulings and preponderance is achieved by them). Sheikh al-Islam Ibn Taymiyyah refuted that against him with points, some of which concern us. He said, may Allah have mercy on him (p. 87), as if refuting Al-Buti due to the similarity between him and Al-Akhna'i: [103]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 104
  },
  {
    "serial_number": "3366081",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 104,
    "volume_number": 1,
    "text": "(Third) That it is a saying for which he mentioned no proof. If it is said to him: We do not concede that a Sahih Hadith was reported regarding that, he needs to answer. He mentioned none of those Hadiths, so what he mentioned remains a bare claim met with denial. (The fourth face) That we say: This is a false saying not said by anyone of the Muslim scholars who know the Sahih. Among the Hadiths narrated with the wording: 'visiting his grave', there is no Sahih Hadith according to the people of knowledge. The masters of Sahih did not extract any of that, nor the masters of the relied-upon Sunan like Sunan Abi Dawud, An-Nasa'i, At-Tirmidhi and their likes, nor the people of Musnads of this genre like Musnad Ahmad and others, nor in Muwatta' Malik nor Musnad Ash-Shafi'i and the like. No Imam of the Muslims Imams like Abu Hanifa, Malik, Ash-Shafi'i, Ahmad, and others used as proof a Hadith containing the mention of visiting his grave. So how can there be Sahih Hadiths regarding that when none of the Imams of religion nor scholars of Hadith knew them? And from where does this one and his likes get that those Hadiths are Sahih when he does not know this field? (The fifth face) His saying: 'And others which did not reach the degree of Sahih...' We say to him: We do not concede that anything was reported of that which is permissible to use as evidence, and he mentioned only a bare claim, so it is met with denial. (The sixth face) That it be said: There is nothing in this chapter permissible to use as evidence; rather, they are all weak, nay fabricated, as detailed in places. I mentioned these Hadiths and mentioned the Imams' speech on them, Hadith by Hadith. Rather, I do not know of anyone of the Companions who spoke with the phrase 'visiting his grave' (peace and blessings be upon him) at all. So this phrase was not known among them; for this reason, Malik disliked speaking with it (1), unlike the word 'visiting' (Ziyarah) absolutely [for graves in general], for this word is known from the Prophet (peace and blessings be upon him) and his Companions...).",
    "foot_note": "1. (1) I say: Dr. Al-Buti and his likes among people of whims might deny that this is established from Malik. So what will he do when it is in (Al-Mudawwanah) (2/132)? \n[104].",
    "book_id": "421",
    "new_page_number": 105
  },
  {
    "serial_number": "3366082",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 105,
    "volume_number": 1,
    "text": "I say: So what diverted Dr. Al-Buti from relying on this speech of Sheikh al-Islam, who is more knowledgeable than As-Subki and others whom Al-Buti imitates in a way that comparison between them is invalid? Just as Malik asserts the dislike of speaking of 'visiting his grave' (peace and blessings be upon him), let alone other Imams of Hadith as will come. Were it not for whim and fear of being called 'Wahhabi'? Or is it that the Doctor, due to his narrow scope and lack of reading, has no knowledge of this viewpoint of Ibn Taymiyyah and the statements of scholars agreeing with him? This is something I consider unlikely. Whether it is this or that, the sweeter of them is bitter. Likewise, what prevented him from benefiting from the critique of Al-Hafiz Muhammad ibn Abdul-Hadi against Sheikh As-Subki in his book (As-Sarim Al-Munki fi Ar-Radd 'ala As-Subki)? He tracked As-Subki's Hadiths on Ziyarah Hadith by Hadith and explained their defects and the sayings of Imams of Hadith regarding them from (p. 10 - 171), detailing the speech in a way that leaves no doubt in the heart of any fair person regarding their weakness and the non-establishment of anything from them at all, and that there is nothing in them that strengthens each other due to the severity of their weakness, the disturbance of their chains, and the contradiction of their wordings. Therefore, I see it as obligatory upon me to summarize the discussion on them here to the extent that reveals their defects and establishes the proof against Al-Buti and his likes among the imitators and those deceived by them {so that those who perished [through disbelief] would perish upon evidence}, referring whoever wants detail to the book of Al-Hafiz Ibn Abdul-Hadi, for he collected and encompassed, and the book At-Talkhis by Ibn Hajar (Vol 2 / 266 & 267), and to my book (Silsilat Al-Ahadith Ad-Da'ifah wal-Mawdu'ah), for I expanded the discussion in it on some of them, numbers (25, 47, and 204). The First Hadith: From Ibn Umar, Marfu' with the wording: (Whoever visits my grave, my intercession is obligatory for him). It has paths from him: The first: From the narration of Musa ibn Hilal Al-Abdi, who is unknown (Majhul). He was disturbed (Mudtarib) in its chain; once he said: from Abdullah ibn Umar, and once: from Ubaydullah ibn Umar from Nafi' from him. Al-Bayhaqi said: [105]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 106
  },
  {
    "serial_number": "3366083",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 106,
    "volume_number": 1,
    "text": "(Whether he said Ubaydullah or Abdullah, it is Munkar from Nafi' from Ibn Umar; no one else brought it). Al-Uqayli said about it: (His Hadith is not Sahih and is not corroborated). Then he cited it with his chain and said following it: (And regarding narration in this chapter, there is leniency). In Al-Hafiz Ibn Hajar's quote from him, he said: (And nothing is authentic in this chapter). The meaning is one, which is that its paths are all weak. That is what Al-Hafiz explicitly stated at the end of his discussion on the Hadith. Ubaydullah - the diminutive - is trustworthy (Thiqah), unlike his brother Abdullah - the non-diminutive - for he is weak. Ibn Adi preferred that he is the owner of this Hadith, and Imam Ibn Khuzaymah agreed with him and explicitly stated that a trustworthy narrator does not narrate this Munkar report, as Al-Hafiz Ibn Hajar said. That is why An-Nawawi said: (Its chain is very weak). The second: From the narration of Abdullah ibn Ibrahim from Abdur-Rahman ibn Zaid ibn Aslam from his father from Ibn Umar. Abdullah ibn Ibrahim, who is Ibn Abi Amr Al-Ghafari, is accused of lying and fabrication. Similar to him is Abdur-Rahman ibn Zaid ibn Aslam, for he is very weak. He is the narrator of the Hadith of Adam (peace be upon him) seeking intercession by our Prophet (peace and blessings be upon him), which is fabricated as I explained in (Al-Ahadith Ad-Da'ifah) number (25). An-Nawawi said regarding this path as well: (Its chain is very weak). The third: From the narration of Maslamah ibn Salim Al-Juhani from Ubaydullah ibn Umar from Nafi' from Salim from him with the wording: (Whoever comes to me visiting, not driven by any need except visiting me, it is a right upon me to be an intercessor for him on the Day of Resurrection). Maslamah is unknown (Majhul). It is said of him Maslamah ibn Salim Al-Juhani. Abu Dawud said: He is not trustworthy. He was disturbed in its chain, narrating it once like this, and once saying: from Abdullah ibn Umar from Nafi'. This is most likely, that it is from his narration from Abdullah ibn Umar Al-Umari, the non-diminutive who is weakened. So this Juhani would be a follower/corroborator for Musa ibn Hilal who is in the first path. [106]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 107
  },
  {
    "serial_number": "3366084",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 107,
    "volume_number": 1,
    "text": "However, his following him is something scholars do not rejoice at because he is not trustworthy as you knew. Even if it were useful, the Hadith would not be strengthened by it because above them is Abdullah ibn Umar the weak. Furthermore, it does not contain visiting the Noble Grave, so it can be interpreted as visiting him in his lifetime, and there is no doubt about the legitimacy of this. So be aware and do not be among the heedless people of whims. Moreover, what is preserved in this meaning is what Ayyub narrated from Nafi' from Ibn Umar who said: The Messenger of Allah (peace and blessings be upon him) said: (Whoever among you can die in Medina, let him do so, for I will witness (or in a narration: intercede) for whoever dies in it). Extracted by Ahmad, At-Tirmidhi who authenticated it, Ibn Majah, and Ibn Hibban in his (Sahih). This is the origin of the Hadith and its wording, but those unknown and weak narrators distorted it, intentionally or inadvertently, and those with no knowledge were deceived by them. The fourth: From the narration of Hafs ibn Sulayman Abu Umar from Al-Layth ibn Abi Sulaym from Mujahid from him with the wording: (Whoever performs Hajj and visits my grave after my death is like one who visited me in my life). Some added (and accompanied me). This is very Munkar. Hafs ibn Sulayman, the Asadi Qari Al-Ghadiri, is abandoned (Matruk), accused of lying and fabrication. He was unique with it as Al-Bayhaqi said. Layth ibn Abi Sulaym is weak and confused (Mukhtalit). It is extracted in (Ad-Da'ifah) number (47). The fifth: From the narration of Muhammad ibn Muhammad ibn An-Nu'man ibn Shibl: My grandfather told me, saying: Malik told me from Nafi' from him with the wording: (Whoever performs Hajj to the House and does not visit me has shunned me). This is fabricated as stated by Ibn Al-Jawzi, Adh-Dhahabi, Az-Zarkashi and others, as you see in (Ad-Da'ifah) (4). The defect is from Muhammad ibn Muhammad or from his grandfather An-Nu'man ibn Shibl; both are accused. Ibn Abdul-Hadi preferred the first, so let whoever wishes refer to it. Also, it does not mention visiting the Noble Grave. The Second Hadith: From Umar, Marfu' with the wording: (Whoever visits my grave, or he said whoever visits me, I will be an intercessor or witness for him). Narrated by Sawwar ibn Maimun Abu Al-Jarrah Al-Abdi: A man from the family of Umar told me from him. This is a disturbed text and a dark chain. Sawwar is unknown (Majhul), not known. Some [107]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 108
  },
  {
    "serial_number": "3366085",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 108,
    "volume_number": 1,
    "text": "narrators invert him saying: Maimun ibn Sawwar. His Sheikh is a man not named, who is in a worse state than the unknown. They were disturbed regarding him; some say: (a man from the family of Umar) as in this narration. Some say: (a man from the children of Hatib). Some insert between him and Sawwar: Harun ibn Qaza'ah, who is also unknown. Some say Harun ibn Abi Qaza'ah. Al-Uqayli, As-Saji, and Ibn Al-Jarud mentioned him in (Ad-Du'afa). Al-Bayhaqi said: (This is an unknown chain). The Third Hadith: From Ibn Abbas, Marfu' with the wording: (Whoever performs Hajj to Mecca then intends me in my mosque, two accepted Hajjs are written for him). This is fabricated; its defect is Usayd ibn Zaid Al-Jammal Al-Kufi. Ibn Ma'in said: (A liar, I heard him narrating lies). With that, it does not mention the grave at all. It has another path from him with the wording: (Whoever visits me after my death is like one who visited me in my life). And (Whoever visits me until he ends up at my grave, I will be a witness or he said intercessor for him on the Day of Resurrection). This is also fabricated. In its chain is Fadalah ibn Sa'id ibn Zumayl, unknown (Majhul), not known except in this report with which he was unique and was not corroborated. Adh-Dhahabi said: (This is fabricated). The Fourth Hadith: From Ali, Marfu': (Whoever visits my grave after my death, it is as if he visited me in my life. And whoever performs Hajj and does not visit my grave has shunned me). This is fabricated. Its defect is that it is from the narration of An-Nu'man ibn Shibl, previously mentioned. Al-Hafiz Musa ibn Harun Al-Hammal accused him. Ibn Hibban said: (He brings calamities from trustworthy narrators and inverted reports from established narrators). He narrates it from Muhammad ibn Al-Fadl ibn Atiyyah, who was a liar as Ibn Ma'in said. Ahmad said: His Hadith is the Hadith of the people of lying. He narrates this from Jabir Al-Ju'fi, who is a Rafidi, abandoned (Matruk), severely weak. Abu Hanifa, may Allah have mercy on him, said: I have not seen anyone more lying than him. The Fifth Hadith: From Ibn Mas'ud, Marfu' with the wording: (Whoever performs the Hajj of Islam and visits my grave and fights in a Ghazwah and prays upon me in Bayt al-Maqdis [Jerusalem], Allah will not ask him about what He obligated upon him). This is a false Hadith, apparent in falsehood. That is why As-Suyuti and others said: It is a [108]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 109
  },
  {
    "serial_number": "3366086",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 109,
    "volume_number": 1,
    "text": "fabricated Hadith. It is extracted in (Al-Ahadith Ad-Da'ifah) number (204). The Sixth Hadith: From Abu Hurairah, Marfu': (Whoever visits me after my death, it is as if he visited me while I was alive). This is fabricated. In its chain is Khalid ibn Yazid Al-Umari. Ibn Ma'in and Abu Hatim said: (Liar). Ibn Hibban said: (He narrates fabrications from trustworthy narrators). I say: The chain to him is dark, containing those who are not known. The Seventh Hadith: From Anas, and it has two wordings via two paths: The first: With the wording: (Whoever visits me seeking reward, I will be a witness and intercessor for him on the Day of Resurrection). In its chain is Sulayman ibn Yazid Al-Ka'bi. Abu Hatim said: (Munkar al-Hadith). Then it is interrupted (Munqati') because this Al-Ka'bi did not hear from Anas. The other: With the wording: (There is no one of my Ummah who has means then does not visit me, except that he has no excuse). This is fabricated. In its chain is Sam'an ibn Al-Mahdi. Adh-Dhahabi said: (He is hardly known. A lied copy was attached to him which I saw; may Allah uglify the one who fabricated it). I say: And the chain to him is layers of darkness, one over another. It also does not mention the grave. The Eighth Hadith: From a man from Bukayr ibn Abdullah, Marfu': (Whoever comes to Medina visiting, my intercession is obligatory for him on the Day of Resurrection). This is false as Ibn Abdul-Hadi said. Its chain is Mursal or Mu'dal, and it contains the vague man. It does not mention the grave. I say: These are the Hadiths Dr. Al-Buti pointed to, and those are their paths which he claimed the Hadith rises by their aggregate to the degree of strength, without conducting any study on them - if he were capable of it - to know the severity of their weakness and the repulsion of their texts, which would prevent him from the mentioned claim. But if he is incapable of that study, does he not know how to imitate either? Instead of imitating Sheikh al-Islam who explicitly stated the weakening of the Hadith from all its paths as you saw, he imitates Al-Akhna'i. Or instead of imitating Imam An-Nawawi who [109]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 110
  },
  {
    "serial_number": "3366087",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 110,
    "volume_number": 1,
    "text": "greatly weakened its two preceding paths - which are its most famous paths - he imitated As-Subki who strengthened the Hadith contrary to everyone who spoke on the Hadith among those preceding him in knowledge and time, who asserted that it is a Munkar Hadith, like Ibn Khuzaymah, Al-Bayhaqi, and others who spoke on the individual paths, and Al-Asqalani, Adh-Dhahabi, and As-Suyuti, let alone Ibn Taymiyyah and Ibn Abdul-Hadi. If the Doctor knew how to imitate at least, he would have imitated these due to their specialization in this science, their large number, and their precedence. But Allah the Almighty spoke the truth: {And he for whom Allah has not appointed a light, for him there is no light}. My belief is that the Doctor thinks {And indeed, assumption avails not against the truth at all} that any Hadith whose paths are numerous is strengthened by them. This is ignorance contrary to what is established in the science of Hadith terminology. Ibn As-Salah said in (Al-Muqaddimah) (pp. 36-37) after mentioning the Hasan li-Ghayrihi Hadith, which is that which came from more than one face not containing a negligent narrator making many mistakes: (Perhaps the understanding researcher says: We find Hadiths judged as weak despite being narrated with many chains from numerous faces, like the Hadith (The ears are part of the head) and similar ones. Why did you not make that and its likes of the Hasan type because some of it supports others as you said regarding Hasan as previously mentioned? The answer to that is that not every weakness in Hadith is removed by its coming from [multiple] faces. Rather, that varies. There is a category where that [weakness] is removed, such as when its weakness arises from the poor memory of its narrator despite him being of the people of truthfulness and piety. If we see what he narrated has come from another face, we know that it is of what he memorized and his precision did not fail in it. Likewise, if its weakness is from the aspect of Irsaal (disconnection), it is removed by similar to that, as in the Mursal reported by a Hafiz Imam, for it has slight weakness removed by its narration from another face. And there is weakness not removed by similar to that due to the strength of the weakness and the inability of this restorer to restore it. That is like the weakness arising from the narrator being accused of lying or the Hadith being Shadh (anomalous). This is a summary whose details are perceived by practice and research, so know that, for it is of the precious gems). I say: Yes, by Allah, it is of the precious gems neglected by many who occupy themselves [110]",
    "foot_note": "None",
    "book_id": "421",
    "new_page_number": 111
  },
  {
    "serial_number": "3366088",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "Difa' 'an al-Hadith an-Nabawi wa as-Seerah",
    "edition": "None",
    "publisher": "None",
    "page_number": 111,
    "volume_number": 1,
    "text": "with this science, let alone others who have no knowledge of it at all, like this one whom we are in the process of refuting and warning against the effects of his ignorance. For that reason, when Al-Hafiz Ibn Kathir summarized this speech of Ibn As-Salah in his (Mukhtasar) (p. 43) and approved it, Sheikh Ahmad Shakir, may Allah have mercy on him, commented on it saying: (From this, the error of many late scholars becomes clear in their absolute statement that the weak Hadith, if it comes from multiple weak paths, rises to the degree of Hasan or Sahih. For if the weakness of the Hadith is due to the wickedness (fisq) of the narrator or his being accused of lying, then it comes from other paths of this type, it increases in weakness. Because the uniqueness of those accused of lying or those wounded in their integrity, such that no one else narrates it, removes trust in their Hadith and confirms the weakness of their narration. This is clear). I say: If the reader examines closely those preceding paths of the Hadith of Ziyarah, he will not find in them any quality of those qualities mentioned by Ibn As-Salah regarding paths by which a Hadith is strengthened. There is not in them, for example, at least one narrator who is of the people of truthfulness known to have weak memory. Rather, they are among those accused of lying, or known for severe weakness, or unknowns, or vague individuals, along with the Hadith not being free from disturbance and Nakarah in the text. Also, there is no single Mursal path among them sent by a Hafiz Imam. Because of that, we find many weak Hadiths that scholars have asserted are weak even though they have many paths. Ibn As-Salah gave an example for that with the Hadith: (The ears are part of the head). I have a view on it from several aspects, the most important being that I found a strong chain for it, so I extracted it in (Sahih Abi Dawud) (123) and (Silsilat Al-Ahadith As-Sahihah) number (26); this is printed so let whoever wishes refer to it. Therefore, the better example in my view is the Hadith: (Whoever preserves for my Ummah forty Hadiths of the Sunnah, I will be an intercessor for him on the Day of Resurrection), as Al-Hafiz As-Sakhawi did in (Fath al-Mughith) (1/71). He said following it: (An-Nawawi reported the agreement of Huffaz on its weakness despite the multitude of its paths). Ignorance of this important rule leads to strengthening many weak Hadiths [111]\n\nbecause of their paths. Rather, it may lead to joining some deviant sects. For example, this Hadith: (If you see Mu'awiyah on my pulpit, kill him). It was narrated from the Hadith of Abu Sa'id, Abdullah ibn Mas'ud, Jabir, Sahl ibn Hunayf, and others. Yet, it is counted among the fabricated Hadiths. Like it is the Hadith: (Ali is the best of mankind; whoever refuses has disbelieved). It has many paths as well. Examples of this type are very many, hardly countable. Refer if you wish to my book (Silsilat Al-Ahadith Ad-Da'ifah), for there is much of it, including: (55, 133, 134, 139, 143 (52), 226, 230, 266, 332, 337, 451, 583, 585, 649...). I say: These examples of fabricated Hadiths should be authentic according to Dr. Al-Buti because his previous saying applies to them: (some of them strengthen others...) {So is there any who will remember}? In conclusion, I remind him of my advice which I offered to him coupled with citation of Imam An-Nawawi's speech shortly before this appendix, hoping that I will not be compelled again to waste time refuting his ignorances and fabrications. Asking the Mawla (Allah) Subhanahu wa Ta'ala to rectify our deeds, purify our intentions, and unite our hearts upon the Book of our Lord and the Sunnah of our Prophet. Indeed, He is Hearing, Responsive. Damascus 3 Rabi' Al-Awwal 1396.",
    "foot_note": "None\n\nNone",
    "book_id": "421",
    "new_page_number": 112
  }
]