[
  {
    "text": "The Ruling on the One Who Abandons Prayer\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4761\nbook_title: حكم تارك الصلاة\nbook_link: https://shamela.ws/book/416\nbook_id: 416\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: دار الجلالين - الرياض\nedition: الأولى - 1412\npages: 66\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4625147",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Jurisprudential Issues\nBook: The Ruling on the One Who Abandons Prayer\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\n\nBook: The Ruling on the One Who Abandons Prayer\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\n\nAuthor: Muhammad Nasir al-Din al-Albani (d. 1420 AH)\n\n\n\n\n[Book numbering corresponds to the printed version]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 3
  },
  {
    "serial_number": "4625148",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Ruling on the One Who Abandons Prayer\nBy the pen of the Allamah, the Muhaddith, Muhammad Nasir al-Din al-Albani\nDar Al-Jalalayn\nRiyadh\nFirst Edition\n\n1412 - AH",
    "foot_note": "None\n\nNone",
    "book_id": "416",
    "new_page_number": 4
  },
  {
    "serial_number": "4625150",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 5,
    "volume_number": 1,
    "text": "Preface\nVerily, all praise is due to Allah, we praise Him, we seek His help, we ask for His forgiveness, and we seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, there is none to misguide him, and whomever He leaves astray, there is none to guide him. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger.\nAs for what follows:\nIndeed, it is among the things regarding which (the Muslims do not differ that the intentional abandonment of the obligatory prayer is among the greatest of sins and the major grave sins, and that its sin is greater than the sin of killing a soul and taking wealth, and greater than the sin of adultery, theft, and drinking alcohol, and that he [who does so] is exposed to the punishment of Allah, His anger, and disgrace in this world and the Hereafter) (1)",
    "foot_note": "1. (1) Kitab al-Salat wa Hukm Tarikiha (p. 16) by the Allamah Ibn al-Qayyim, may Allah have mercy on him. Quranic verses have been revealed in succession regarding the magnification of the status of prayer and explaining the severity of the sin of the one who abandons it or takes it lightly. Allah the Exalted said: {But there came after them successors who neglected prayer and pursued appetites; so they are going to meet evil - Except those who repent} [Maryam: 59-60]. And He, the Glorified, said: {So woe to those who pray - [But] who are heedless of their prayer - Those who make show [of their deeds] - And withhold [simple] assistance} [Al-Ma'un: 4-7]. And He, the Majestic, said: {What put you into Saqar? They will say, 'We were not of those who prayed'} [Al-Muddathir: 42-43]. Along with other noble verses that strike the ears and pound the hearing. Several hadiths have also come from the Prophet (peace and blessings of Allah be upon him) informing about the greatness of the sin committed by the one who abandons prayer, or is negligent of it, or lazy about it.",
    "book_id": "416",
    "new_page_number": 5
  },
  {
    "serial_number": "4625151",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 6,
    "volume_number": 1,
    "text": "He (peace and blessings of Allah be upon him) said: (Between the servant and Shirk is the abandonment of prayer) (1). And he (peace and blessings of Allah be upon him) said: (The covenant that distinguishes between us and them is prayer; so whoever leaves it has committed Kufr) (2). And he (peace and blessings of Allah be upon him) said: (Whoever abandons prayer intentionally, the protection of Allah has departed from him) (3).\nI say: Regarding these Quranic and Prophetic texts, the Imams and scholars have differed concerning the Takfir (declaring as disbeliever) of the one who abandons prayer intentionally.\nImam Al-Baghawi said in \"Sharh al-Sunnah\" (2 / 178, 179): The people of knowledge differed regarding the Takfir of the one who intentionally abandons the obligatory prayer.",
    "foot_note": "1. (1) Narrated by Muslim (82) from Jabir.\n2. Narrated by Ahmad (5 / 346), Al-Tirmidhi (2623), Ibn Majah (1079), and others from Buraydah. Our Sheikh said in his commentary on (Kitab al-Iman) (p. 15) by Ibn Abi Shaybah: (Its chain is authentic according to the conditions of Muslim).\n3. Narrated by Ibn Majah (4034), Al-Bukhari in \"Al-Adab Al-Mufrad\" (No. 18), and others. There is weakness in its chain, but it has supporting evidences that strengthen it. See: (Al-Talkhis al-Habir) (2 / 148) by Al-Hafiz Ibn Hajar and (Irwa' al-Ghalil) (7 / 89 - 91) by our Sheikh Al-Albani.",
    "book_id": "416",
    "new_page_number": 6
  },
  {
    "serial_number": "4625152",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 8,
    "volume_number": 1,
    "text": "Then he mentioned a group of names of those who differed on this.\nAl-Shawkani said in \"Nayl al-Awtar\" (1 / 369) commenting on the hadith of Jabir previously cited: The hadith indicates that abandoning prayer is among the causes of Kufr. There is no disagreement among Muslims regarding the disbelief of the one who abandons prayer while denying its obligation, unless he is new to Islam or has not mixed with Muslims for a period in which the obligation of prayer would reach him. However, if his abandonment of it is out of laziness while believing in its obligation - as is the case with many people (1) - then the people have differed regarding that.\nThen he quoted - after that, a summary of the disagreement - the famous opinion of \"The majority of the Salaf and Khalaf - including Malik and Al-Shafi'i - is that he does not commit Kufr but rather becomes a Fasiq (sinner). If he repents [it is accepted], otherwise we kill him as a Hadd punishment like the married adulterer... etc.\"\nIbn Hibban said in his \"Sahih\" (4 / 324): The Chosen One (Al-Mustafa), peace and blessings of Allah be upon him, applied the name of Kufr to the one who abandons prayer because abandoning prayer is the beginning of Kufr. For if a person abandons prayer and becomes accustomed to it, he ascends from there to abandoning other obligations. And if",
    "foot_note": "1. (1) This was in his time, so how about today?\n[7]. he becomes accustomed to abandoning obligations, that leads him to denial (Juhud). So he (peace and blessings of Allah be upon him) applied the name of the end result, which is the last branch of Kufr, to the beginning, which is the first of its branches, and that is the abandonment of prayer.\nThen he (may Allah have mercy on him) said, creating a chapter heading: \"Mention of a report indicating the correctness of what we mentioned: That the Arabs apply the name of what is expected at the end to the beginning.\"\nAfter citing the saying of the Prophet (peace and blessings of Allah be upon him): \"Disputation regarding the Quran is Kufr\" (1), he said: If a person disputes regarding the Quran, that leads him - if Allah does not protect him - to doubt the ambiguous verses of it. So he (peace and blessings of Allah be upon him) applied the name of Kufr - which is denial - to the beginning of its cause, which is disputation.\nThus, abandoning prayer is a major issue and a dangerous matter that leads - we seek refuge in Allah - to apostasy from the religion and joining the disbelievers and polytheists.\nSince the scholars and Imams differed on this important issue, it was obligatory for students of knowledge to be deliberate and cautious, not to treat every person who abandons",
    "book_id": "416",
    "new_page_number": 7
  },
  {
    "serial_number": "4625153",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 9,
    "volume_number": 1,
    "text": "prayer by branding them with Takfir (disbelief) and apostasy with all harshness and severity. For (1) judging a Muslim man as having exited the religion of Islam and entered into Kufr is not something a Muslim who believes in Allah and the Last Day should proceed with unless he has a proof clearer than the sun in the day. It has been established in authentic hadiths narrated through a group of Companions (2) that: \"Whoever says to his brother: 'O Kafir', then it has returned upon one of them\"... and in a wording in the \"Sahih\": \"...then one of them has committed Kufr.\" In these hadiths and what has been narrated in their vein is the greatest deterrent and the biggest warner against rushing into Takfir. Allah the Mighty and Majestic has said: {But those who open their breasts to disbelief} [Al-Nahl: 106]. So there must be an opening of the breast to disbelief, the heart finding tranquility in it, and the soul settling upon it.\" (3)\nYes, jealousy (for the religion) and emotion might drive some people of knowledge or students to judge with Takfir everyone who abandons prayer, without considering denial or laziness,",
    "foot_note": "1. (1) From here is a quote from the words of the Allamah Al-Shawkani in \"Al-Sayl al-Jarrar\" (4 / 578).\n2. Narrated by Al-Bukhari (10 / 428) and Muslim (60) from Ibn Umar. Also in the chapter from Abu Dharr in Al-Bukhari (10 / 388).\n3. Up to here is the quote from Imam Al-Shawkani.",
    "book_id": "416",
    "new_page_number": 8
  },
  {
    "serial_number": "4625154",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 10,
    "volume_number": 1,
    "text": "out of desire - in their opinion - to severely warn against this grave action, and out of a wish - as they imagined - to prevent any leniency regarding prayer and its ruling which (might) lead to negligence in this great Islamic pillar.\n(Some) of these scholars or students might use as evidence for this some of the Quranic or Prophetic proofs that preceded or others, but without reconciling between the evidences reported on this issue negatively or positively - at times - or with a shortcoming in this reconciliation - at other times.\nI am not, in this introduction - let alone what will come in the treatise of our Sheikh - going to exhaustively discuss the proofs of those who differ on this great issue and verify the basis of the disagreement and look into them, for that has another place (1). However, I will suffice here with mentioning important scientific notes that might be absent from a number of students of knowledge, so I say:\nFirst: The venerated Imam Ahmad bin Hanbal said in his will to his student, the Imam and Hafiz Musaddad bin Musarhad (2): Nothing expels a man from Islam except Shirk with Allah\n\nthe Great, or rejecting an obligation from the obligations of Allah the Mighty and Majestic by denying it. But if he abandons it out of laziness or negligence, his matter is within the will of Allah; if He wills, He punishes him, and if He wills, He pardons him...\" (1)\nI say: This is the explicit meaning of what has come to us in the Book and the Sunnah regarding the general ruling and the specific issue of abandoning prayer. Allah the Exalted said: {Indeed, Allah does not forgive that you join partners with Him, but He forgives other than that for whom He wills}.",
    "foot_note": "1. (1) See what will come (p. 64).\n2. As in \"Tabaqat al-Hanabilah\" (1 / 343) and others. I have a brief explanation on this (Will) titled: (Al-Sabil al-Mumahhad) which is currently being printed.\n\n1. (1) See \"Al-Iman\" (p. 245) by Sheikh al-Islam Ibn Taymiyyah to know the narrations from Ahmad regarding that, and what will come (pp. 16, 46, 58).",
    "book_id": "416",
    "new_page_number": 9
  },
  {
    "serial_number": "4625156",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 11,
    "volume_number": 1,
    "text": "And he (peace and blessings of Allah be upon him) said: \"Five prayers which Allah has written (prescribed) upon the servants. Whoever performs them and does not waste anything of them out of disregard for their right, has a covenant with Allah that He will admit him into Paradise. And whoever does not perform them, has no covenant with Allah; if He wills, He punishes him, and if He wills, He admits him into Paradise.\" (2)\nSecond: Imam Muhammad bin Abd al-Wahhab, may Allah the Exalted have mercy on him, said",
    "foot_note": "2. (2) Narrated by Abu Dawood (425), Al-Nasa'i (1 / 230), and others. See (Sahih al-Targhib) (366) by our Sheikh Al-Albani. Ibn Abd al-Barr has a very important discussion on it in (Al-Tamhid) (23 / 289 - 301).",
    "book_id": "416",
    "new_page_number": 10
  },
  {
    "serial_number": "4625157",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 12,
    "volume_number": 1,
    "text": "as in \"Al-Durar Al-Saniyyah\" (1 / 70) - in response to someone who asked him about what makes a man a disbeliever? And what is fought over? He said, may Allah have mercy on him: \"The five pillars of Islam, the first of them is the two testimonies (Shahadatayn), then the four pillars. If he acknowledges them but abandons them out of negligence, then even though we fight him to perform them, we do not declare him a disbeliever for abandoning them. The scholars differed regarding the disbelief of the one who abandons them out of laziness without denial. And we do not declare anyone a disbeliever except for what all scholars have agreed upon, which is the two testimonies.\"\nThird: Some people of knowledge use as evidence for declaring the one who abandons prayer a disbeliever a verse from the Great Quran, making it the pillar of their proofs for Takfir, which is His saying, the Majestic: {But if they repent, establish prayer, and give Zakah, then they are your brothers in religion} [Al-Tawbah: 11]. They said: The indication from the verse is that Allah the Exalted made establishing prayer a condition for the establishment of brotherhood between us and the polytheists, so whoever does not establish it is not considered a brother to us in religion.\nThe answer to this deduction is from two aspects:\nThe first: Imam Ibn Atiyyah said in \"Al-Muharrar Al-Wajiz\" [12]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 11
  },
  {
    "serial_number": "4625158",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 13,
    "volume_number": 1,
    "text": "(8 / 139 Morocco print): \"Repent: meaning returned from their state. And repentance from them implies Iman (faith). So establishing prayer is conditional upon and preceded by repentance which implies Iman, since Allah mentioned repentance before mentioning prayer or Zakah. This indicates that it (repentance/Iman) is the fundamental rule in judging religious brotherhood.\"\nTherefore, Al-Tabari said in \"Jami' al-Bayan\" (18 / 86): \"He, the Majestic, says: If these polytheists - whom I commanded you, O believers, to fight - return from their disbelief and Shirk with Allah to believing in Him and His Messenger, and turn in obedience to Him, and establish the prescribed prayer performing it with its limits, and give the obligatory Zakah to those entitled to it: Then they are your brothers in the religion which Allah commanded you with, which is Islam.\"\nAnd what supports the above is:\nThe second aspect: That He coupled Zakah with prayer. So, is the one who repents and establishes prayer but does not give Zakah: not a brother in religion, having the duties of Muslims upon him and the rights of Muslims for him?\nIf it is said: No, rather he is a brother in religion. We say: What is the evidence for differentiating in the verse between prayer and Zakah while they are mentioned in order and equality following repentance?\n[13]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 12
  },
  {
    "serial_number": "4625159",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 14,
    "volume_number": 1,
    "text": "And if it is said: He is not a brother in religion. We say: This is false speech with certainty, having no evidence for it.\nFourth: From Hudhayfah bin Al-Yaman, may Allah be pleased with him, who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Islam will wear out as the embroidery on a garment wears out, until it will not be known what fasting is, nor prayer, nor rites (of sacrifice), nor charity. And the Book of Allah the Mighty and Majestic will be taken away by night, so not a verse of it will remain on earth. And there will remain groups of people: The old man and the old woman saying: 'We reached our fathers upon this statement: La ilaha illa Allah (There is no deity but Allah), so we say it.'\"\nNarrated by Ibn Majah (4049) and Al-Hakim (4 / 473) via Abu Mu'awiyah from Abu Malik Al-Ashja'i from Rib'i bin Hirash from Hudhayfah bin Al-Yaman in a Marfu' form. Al-Hakim declared it authentic and Al-Dhahabi agreed with him. Al-Busiri also declared it authentic in \"Misbah al-Zujajah,\" and Al-Hafiz Ibn Hajar strengthened it in \"Fath al-Bari\" (13 / 16).\n(Some) have found a defect in the hadith and weakened it due to talk regarding Abu [14]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 13
  },
  {
    "serial_number": "4625160",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 17,
    "volume_number": 1,
    "text": "Mu'awiyah, but it does not harm him. With that, a majestic corroboration was hidden (from them): For Abu Awanah narrated the hadith from Abu Malik with its chain and text, as Al-Busiri said in \"Al-Misbah\" (3 / 254), and Abu Awanah is trustworthy, firm, and accepted.\nOur Sheikh Al-Albani said in his fragrant book \"Silsilat Al-Ahadith Al-Sahihah\" (1 / 130 - 132) commenting on this authentic hadith:\n\"This hadith contains an important jurisprudential benefit, which is that the testimony that there is no deity but Allah saves the one who says it from eternal residence in the Fire on the Day of Resurrection, even if he does not perform any of the other five pillars of Islam such as prayer and others.\nIt is known that scholars differed regarding the ruling on the one who abandons prayer specifically while believing in its legislation. The majority hold that he does not commit Kufr by that, but rather becomes a Fasiq (sinner). Ahmad held [in what is reported from him] that he commits Kufr and is killed for apostasy, not as a Hadd punishment. It has been authentically reported from the Companions that they did not consider abandoning any deed as Kufr except prayer. Narrated by Al-Tirmidhi and Al-Hakim.\n[15]\nI see that the correct view is the opinion of the majority, and that what was reported from the Companions is not a text indicating that they meant by (Kufr) here the Kufr that causes its doer to remain eternally in the Fire and does not allow for Allah to forgive him.\nHow can that be when Hudhayfah bin Al-Yaman - who is among the senior of those Companions - replies to Silah bin Zufar, who almost understood the matter as Ahmad understood it, saying: 'What good will La ilaha illa Allah do for them when they do not know what prayer is...?' So Hudhayfah answers him after turning away from him: 'O Silah, it saves them from the Fire,' three times. This is a text from Hudhayfah, may Allah be pleased with him, that the one who abandons prayer - and among them the rest of the pillars - is not a disbeliever, but rather a Muslim saved from eternal residence in the Fire on the Day of Resurrection. Memorize this, for you may not find it in other than this place.\"\nThen I came across \"Al-Fatawa Al-Hadithiyyah\" (84 / 2) by Al-Hafiz Al-Sakhawi, and saw him saying after citing some hadiths reported regarding the Takfir of the one who abandons prayer, which are famous and known:\n\"But all of this is only interpreted according to its apparent meaning regarding the one who abandons it denying its obligation, while being someone who grew up among Muslims, for he is then [16] a disbeliever and an apostate by the consensus of Muslims. If he returns to Islam, it is accepted from him, otherwise he is killed. As for the one who leaves it without excuse but out of laziness while believing in its obligation, then the correct stated view upon which the majority have decided is that he does not commit Kufr. And - also according to the correct view - after the time of a single prayer has passed its necessary time - such as delaying Zuhr until the sun sets or Maghrib until dawn rises - he is asked to repent just as the apostate is asked to repent. Then he is killed if he does not repent, and he is washed and prayed over and buried in the graveyards of the Muslims, with all other rulings of Muslims applied to him. The application of Kufr to him is interpreted as him sharing with the disbeliever in some of his rulings, which is the obligation of action. This is to reconcile between these texts and what is also authentically reported from him (peace and blessings of Allah be upon him) that he said: 'Five prayers which Allah has written...' - and he mentioned the hadith which contains: 'If He wills He punishes him, and if He wills He forgives him.' And he also said: 'Whoever dies knowing that there is no deity but Allah enters Paradise,' and other than that. For this reason, Muslims have never ceased inheriting from the one who abandons prayer and he inheriting from them. If [17] he were a disbeliever, he would not be forgiven, nor would he inherit, nor be inherited from.\" End quote.",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 14
  },
  {
    "serial_number": "4625161",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 18,
    "volume_number": 1,
    "text": "Fifth: Some people of knowledge answer a number of the hadiths reported on this issue which indicate the inclusion of Allah's pardon, forgiveness, and mercy for some of those who abandon prayer which is less than Shirk - as He, the Majestic, said: \"Indeed, Allah does not forgive that you join partners with Him, but He forgives other than that for whom He wills\" - such as the hadith of the Card (Bitakah) and the hadith of Intercession which is coming, and other hadiths, by saying (these people): \"These are (general) hadiths and the hadiths of declaring the one who abandons prayer a disbeliever are (specific).\"\nI say: If (these people) - may Allah guide them - had reversed their statement, they would have been closer to the truth, as is known from the rule of Promise and Threat according to Ahl al-Sunnah as established by Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, in several places in his books like \"Majmu' al-Fatawa\" (4 / 484), (8 / 270), (11 / 648), (23 / 305) and others.\nThe summary of the statement on this rule is: That the texts of Threat fall under the will of Allah the Glorified, either [18]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 15
  },
  {
    "serial_number": "4625162",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 19,
    "volume_number": 1,
    "text": "pardon or execution. As for the texts of Promise, Allah fulfills them as He - the Glorified - has prescribed upon Himself. Regarding this, some people of knowledge say, citing the basis of this rule:\n\"And indeed, if I threaten him or promise him, I might break my threat but I will fulfill my promise.\"\nSee \"Sharh al-Aqidah al-Tahawiyyah\" (p. 318).\nSixth: It is most strange - after what has preceded - that (some) say, describing the view of not declaring the one who abandons prayer a disbeliever while affirming his corruption (fisq) and wickedness (fujur): that it is Irja'? So what is Irja' according to these people? And what are its boundaries? And what are its criteria?\nAfter all this preceding, we affirm and clarify with all frankness and clarity that the one who abandons prayer is a criminal, a wicked person (fajir), a sinner, and a corrupt person (fasiq). It is feared for him [19]\n\n- we seek refuge in Allah - from apostasy, Kufr, exiting Islam, and Shirk if he does not hasten to repent, return, seek forgiveness, and guidance, or if Allah - the Glorified - does not cover him with His pardon and care.\nFinally: This issue is among the major issues of knowledge, and the people of knowledge have disputed over it in the past and present. Research into it must be with a good spirit, an enlightened mind, and a sound view far from fanaticism, casting aside blind imitation, for all of this leads to knowing the truth, standing upon it, and calling to it.\nThis treatise by our Sheikh, the Allamah, the Muhaddith, the Verifier Muhammad Nasir al-Din al-Albani - may Allah the Glorified preserve him - is a good example of what I presented. We present it to the brother readers out of a desire to spread knowledge and hope to attain reward, and in response to the command of Allah the Glorified to refer - in case of disagreement - to Him and to His Prophet (peace and blessings of Allah be upon him): {And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result}.",
    "foot_note": "None\n\nNone",
    "book_id": "416",
    "new_page_number": 16
  },
  {
    "serial_number": "4625164",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 20,
    "volume_number": 1,
    "text": "[20]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 17
  },
  {
    "serial_number": "4625165",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 21,
    "volume_number": 1,
    "text": "So let not familiarity, habit, upbringing, or what one has been taught prevent any of the readers of this treatise from accepting the truth, submitting to it, and striving for it. For the truth is the most precious thing sought and the dearest thing desired.\nWe ask Allah the Great for success, correctness, guidance, and direction, and for the guidance of those who have strayed among the servants, and the destruction of those who have clothed themselves in Kufr and stubbornness.\nAnd our final prayer is that all praise is due to Allah, Lord of the worlds.\n[21]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 18
  },
  {
    "serial_number": "4625166",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 22,
    "volume_number": 1,
    "text": "Author's Introduction\nVerily, all praise is due to Allah, we praise Him, we seek His help, we ask for His forgiveness, and we seek refuge in Allah from the evils of our own selves and from our bad deeds. Whomever Allah guides, there is none to misguide him, and whomever He leaves astray, there is none to guide him. I bear witness that there is no deity worthy of worship except Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger.\nAs for what follows:\nThis is a subtle scientific research in the extraction (Takhrij) and explanation of a noble Prophetic hadith. Its origin is from the hadiths of the seventh volume of my book: (Silsilat al-Ahadith al-Sahihah). I saw fit to publish it separately due to its importance and great benefit, after some of our brothers saw it and suggested to me to publish it individually as a way of hastening towards good. This coincided with what I had in mind, so I handed a copy of it to our companion and student, the young man Ali bin Hasan al-Halabi, to prepare it for publication and ready it for printing, along with writing a scientific introduction for it that brings its benefits closer to the honorable readers.\n[22]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 19
  },
  {
    "serial_number": "4625167",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 25,
    "volume_number": 1,
    "text": "He did all of that - may Allah reward him with good - and then supervised its printing, correction, and review. At the end of this brief introduction, I ask Allah the Glorified to benefit with this scientific research whoever reads it and looks into it. Indeed, He is Hearing, Responsive.\nSo I say, and with Allah is success:\n[25]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 20
  },
  {
    "serial_number": "4625168",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Text of the Hadith:\nImam Ma'mar bin Rashid narrated in (Al-Jami') (11 / 409 - 411 - appended to Musannaf Abd al-Razzaq) from Zayd bin Aslam from Ata bin Yasar from Abu Sa'id al-Khudri - may Allah be pleased with him - who said: The Messenger of Allah (peace and blessings of Allah be upon him) said:\n(When the believers are saved from the Fire and are safe, then [by the One in Whose Hand is my soul], the dispute of one of you with his companion regarding the truth in this world is not more intense than the dispute of the believers with their Lord regarding their brothers who were admitted into the Fire. He said: They say: Our Lord, our brothers used to pray with us, fast with us, and perform Hajj with us [and fight (Jihad) with us], yet You have admitted them into the Fire. He said: So He says: Go and bring out those whom you recognize among them. So they come to them and recognize them by their forms; the Fire does not eat their forms [it did not cover the face]. Among them are those whom the Fire seized up to the middle of his shins, and among them are those whom it seized up to his ankles. [So they bring out from it [26]\n\nmany people]. They say: Our Lord, we have brought out those whom You commanded us. He said: Then [they return and speak, so] He says: Bring out whoever has in his heart a Dinar's weight of faith. [So they bring out many people]. Then [they say: Our Lord, we have not left in it anyone of those whom You commanded us...\n\nThen He says: Return, and] whoever has in his heart the weight of half a Dinar [bring him out. So they bring out many people. Then they say: Our Lord, we have not left in it those whom You commanded us...] until He says: Bring out whoever has in his heart an atom's weight [so they bring out many people]. Abu Sa'id said: So whoever does not believe this hadith, let him read this verse: {Indeed, Allah does not do injustice, [even] as much as an atom's weight; while if there is a good deed, He multiplies it and gives from Himself a great reward} [Surah An-Nisa: 4].",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "416",
    "new_page_number": 21
  },
  {
    "serial_number": "4625171",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 27,
    "volume_number": 1,
    "text": "He said: So they say: Our Lord, we have brought out those whom You commanded us, so there does not remain in [27]\n\nthe Fire anyone having good. He said: Then Allah says: The Angels have interceded, the Prophets have interceded, and the believers have interceded, and the Most Merciful of the merciful remains. He said: So He grabs a handful from the Fire - or he said: two handfuls - people who never did any good for Allah, who have been burnt until they became charcoal. He said: So they are brought to a water called: (Life), and it is poured over them, so they grow as a seed grows in the silt carried by the flood [you have seen it by the side of the rock and by the side of the tree; whatever of it is towards the sun is green, and whatever of it is towards the shade is white]. He said: So they come out looking like pearls, and around their necks are rings (and in a narration: necklaces), the freed ones of Allah. He said: So it is said to them: Enter Paradise, whatever you wished for and saw is yours [and the like of it with it]. [So the people of Paradise say: These are the freed ones of the Most Gracious, He admitted them into Paradise without any deed they did nor any good they presented]. He said: So they say: Our Lord, You have given us what You have not given anyone of the worlds. He said: So He says: Indeed, for you with Me is better than this. They say: Our Lord, and what is better than this? [He said:] He says: My pleasure upon you, so I will never be angry with you",
    "foot_note": "None\n\nNone",
    "book_id": "416",
    "new_page_number": 22
  },
  {
    "serial_number": "4625173",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 28,
    "volume_number": 1,
    "text": "[28]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 23
  },
  {
    "serial_number": "4625174",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 29,
    "volume_number": 1,
    "text": "ever).\nIts Extraction (Takhrij):\nIts chain is authentic according to the conditions of the two Sheikhs (Bukhari and Muslim). It is from the narration of Abd al-Razzaq from Ma'mar:\nAnd via Abd al-Razzaq, it was narrated by Ahmad (3 / 94), Al-Nasa'i (2 / 271), Ibn Majah (No. 60), Ibn Khuzaymah in (Al-Tawhid) (p. 184, 201, 212), and Ibn Nasr Al-Marwazi in (Ta'zim Qadr al-Salat) (No. 276).\nMuhammad bin Thawr followed Abd al-Razzaq [in narrating] from Ma'mar with it, but he did not quote its wording; rather, he said: similar to it, meaning the hadith of Hisham bin Sa'd which extraction is coming.\nA group followed Ma'mar [in narrating]:\nFirst: Sa'id bin Abi Hilal from Zayd bin Aslam with it, more complete than it, beginning with: (Do you have difficulty in seeing the sun and the moon...) The long Hadith. Narrated by Al-Bukhari (7439), Muslim (1 / 114 - 117), Ibn Khuzaymah also (p. 201), and Ibn Hibban (7333 - Al-Ihsan).\n[29]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 24
  },
  {
    "serial_number": "4625175",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 30,
    "volume_number": 1,
    "text": "Second: Hafs bin Maysarah from Zayd: Narrated by Muslim (1 / 114 - 117), and likewise Al-Bukhari (4581) but he did not quote it completely, and likewise Abu Awanah (1 / 168 - 169).\nThird: Hisham bin Sa'd from Zayd: Narrated by Abu Awanah (1 / 181 - 183) completely, Ibn Khuzaymah (p. 200), Al-Hakim (4 / 582 - 584) who declared it authentic, and likewise Muslim (1 / 17) except that he did not quote its wording but referred it to the wording of the hadith of Hafs bin Maysarah similar to it.\nSulayman bin Amr bin Ubayd Al-Utwari - one of Banu Layth who was under the guardianship of Abu Sa'id - followed Zayd saying: I heard Abu Sa'id al-Khudri saying: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say... and he mentioned similar to it briefly, containing the third addition.\nNarrated by Ahmad (3 / 11 - 12), Ibn Khuzaymah (p. 211), Ibn Abi Shaybah in (Al-Musannaf) (13 / 176 / 16039), and from him Ibn Majah (4280), Ibn Jarir in (Al-Tafsir) (16 / 85), Yahya bin Sa'id in (Zawa'id al-Zuhd) (p. 448 / 1268), and Al-Hakim (4 / 585) who said: (Authentic chain according to the conditions of Muslim).\n[30]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 25
  },
  {
    "serial_number": "4625176",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 31,
    "volume_number": 1,
    "text": "Al-Dhahabi left it blank (did not comment), but it is only Hasan because it contains Muhammad bin Ishaq, and he has explicitly stated hearing it (Tahdith).\nIts Fiqh (Understanding):\nAfter extracting this hadith with this extraction which you may not see in another place, and clarifying that it is agreed upon between the two Sheikhs and others among the people of (Sahihs), (Sunans), and (Musnads), I say: In this hadith are abundant great benefits, among them:\nThe intercession of the righteous believers for their brothers who prayed who were admitted into the Fire because of their sins, then for others who are below them according to the varying strength of their faith. Then Allah the Blessed and Exalted bestows His favor upon those remaining in the Fire among the believers, so He brings them out of the Fire without any deed they did nor any good they presented.\n(Some) have imagined that the meaning of the negated 'good' allows for the exit of non-monotheists from the Fire. Al-Hafiz said in (Al-Fath) (13 / 429): (This is refuted by the fact that the 'good' negated is what exceeds the basic acknowledgment of the two testimonies, as indicated by the rest of the hadiths).\nI say: Among them is his saying (peace and blessings of Allah be upon him) in the long hadith of Anas regarding intercession as well:\n[31]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 26
  },
  {
    "serial_number": "4625177",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 32,
    "volume_number": 1,
    "text": "(It will be said: O Muhammad, raise your head, and speak, you will be heard; and ask, you will be given; and intercede, your intercession will be accepted. So I will say: O Lord, grant me permission regarding whoever said: La ilaha illa Allah. He will say: By My Might, My Majesty, My Pride, and My Greatness, I will surely bring out of it whoever said: La ilaha illa Allah). Agreed upon, and it is extracted in (Zilal al-Jannah) (2 / 296).\nAnd in another path from Anas: (...And Allah finishes judging the people, and those remaining from my Ummah are admitted into the Fire. So the people of the Fire say: Of what avail was it to you that you used to worship Allah the Mighty and Majestic and not associate anything with Him? So the Compeller (Al-Jabbar), the Mighty and Majestic, says: So by My Might, I will surely free them from the Fire. So He sends to them, and they come out having been burnt, so they enter the River of Life and grow...) The Hadith. Narrated by Ahmad and others with an authentic chain, and it is extracted in (Al-Zilal) under Hadith (844), and it has supporting evidences in it (843 - 843), and in (Al-Fath) (11 / 455) are other supporting evidences.\nIn the hadith is a refutation of the deduction of Ibn Abi Jamrah from his saying\n[32]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 27
  },
  {
    "serial_number": "4625178",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 33,
    "volume_number": 1,
    "text": "(peace and blessings of Allah be upon him) in it: (It [Fire] did not cover the face) and similar to it the hadith coming after it: (Except the marks of prostration): That whoever was a Muslim but did not pray will not exit [from the Fire] because he has no mark.\nTherefore, Al-Hafiz critiqued him saying (11 / 457): (But it is interpreted that he comes out in the Handful [of Allah] due to the generality of his saying: 'They never did any good,' which is mentioned in the hadith of Abu Sa'id coming in (Al-Tawhid), meaning this hadith).\nHowever, Al-Hafiz, may Allah have mercy on him, missed that in the hadith itself is a critique of Ibn Abi Jamrah from another aspect, which is that when the believers interceded for their brothers who prayed, fasted, and others in the first time, they brought them out of the Fire by the mark. Then when they interceded in the other times and brought out many people, there were - obviously - no people who prayed among them; rather, there was good in them according to their faith. This is very apparent and not hidden from anyone, Allah willing.\n[33]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 28
  },
  {
    "serial_number": "4625179",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 34,
    "volume_number": 1,
    "text": "Discussions and Debates:\nBased on that, the hadith is a definitive proof that the one who abandons prayer, if he dies as a Muslim bearing witness that there is no deity but Allah: he will not remain eternally in the Fire with the polytheists. In it is very strong evidence that he falls under the will of Allah the Exalted in His saying: {Indeed, Allah does not forgive that you join partners with Him, but He forgives other than that for whom He wills}.\nImam Ahmad narrated in his (Musnad) (6 / 240) a hadith explicit in this from the narration of Aisha, may Allah be pleased with her, in Marfu' form with the wording: (The registers [of deeds] with Allah the Mighty and Majestic are three...) The Hadith. And in it: \"As for the register which Allah does not forgive, it is Shirk with Allah. The Mighty and Majestic said: {Whoever joins partners with Allah, Allah has forbidden him Paradise} [Al-Ma'idah: 72]. And as for the register which Allah does not care about at all, it is the servant's wronging of himself regarding what is between him and his Lord, of a day's fast he abandoned or a prayer he abandoned, for Allah the Mighty and Majestic forgives that and overlooks it if He wills...\" The Hadith. Al-Hakim declared it authentic (4 / 576).\n[34]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 29
  },
  {
    "serial_number": "4625180",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 35,
    "volume_number": 1,
    "text": "This, even if it is not accepted by me due to what I explained in (Takhrij al-Tahawiyyah) (p. 367 - Fourth Edition), acts as a witness for this authentic hadith. So take note.\nIf you know what preceded - O Muslim brother - then my wonder hardly ends at the omission by the majority of authors who expanded in writing on this important issue, namely: Does the one who abandons prayer out of laziness commit Kufr or not? They all neglected - as far as I have seen - to cite this authentic hadith despite the agreement of the two Sheikhs and others on its authenticity. Neither the one for whom it is a proof mentioned it, nor did the one against whom it is a proof answer it.\nEspecially among them Imam Ibn al-Qayyim, may Allah the Exalted have mercy on him. For despite his expansion in citing the proofs of those who differ in his valuable book (Al-Salat) and the answer of each of them to the proofs of his opponent, he did not mention this hadith among the proofs of those preventing Takfir except abbreviated in a defective manner that does not show its explicit indication that the intercession includes the one who abandons prayer as well. For he, may Allah have mercy on him, said:\n(And in the hadith of Intercession: Allah the Mighty and Majestic says: \"By My Might and Majesty, I will surely bring out of the Fire whoever said La ilaha illa Allah.\" And in it\n[35]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 30
  },
  {
    "serial_number": "4625181",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 36,
    "volume_number": 1,
    "text": ": He brings out of the Fire whoever never did any good).\nI say: This context is pieced together from two hadiths:\nThe first part of it: is in the end of the hadith of Anas agreed upon, and I have previously mentioned (p. 33) the last part of it.\nThe other part is in the hadith of the Book: (...So He grabs a handful from the Fire, people who never did any good for Allah...).\nAs for his abbreviation being defective, it is very clear if you remember, O noble reader, what I previously appended to Al-Hafiz (p. 34) completing his critique of Ibn Abi Jamrah, which indicates that the intercession of the believers was for non-prayers in the second time and after, and that they brought them out of the Fire. This is a definitive text on the issue by which the dispute should disappear among the people of knowledge who are united by the one creed, which includes not declaring those who commit major sins from the Ummah of Muhammad as disbelievers.\nEspecially in this time where some who affiliate themselves with knowledge have expanded in declaring Muslims as disbelievers for neglecting to perform what is obligatory upon them, despite the soundness of their creed, unlike the disbelievers who do not pray as a matter of religion and belief. And Allah the Glorified and Exalted says: {Then will We treat the Muslims like the criminals? What is [the matter] with you? How do you judge?}\n[36]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 31
  },
  {
    "serial_number": "4625182",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 37,
    "volume_number": 1,
    "text": "Due to what preceded, I would have loved for Ibn al-Qayyim, may Allah have mercy on him, not to neglect mentioning this authentic hadith as an explicit proof for those preventing Takfir, and to answer it if he, may Allah have mercy on him, had an answer. By that, he would have given the research and fairness to both parties without bias to a group.\nYes, indeed it is obligatory upon me to note that he, may Allah have mercy on him, dedicated a special chapter (In Judging Between the Two Parties and the Decisive Speech Between the Two Groups) helping the researcher to understand the texts of both parties correctly. For he verified in it, a magnificent verification, what is accepted among scholars: that not every Kufr a Muslim falls into expels him from the religion.\nSo it is useful that I present to the reader paragraphs or summaries of his words indicating his intent, then follow it up with what is necessary of what meets with this authentic hadith and supports the most correct opinion.\nHe, may Allah have mercy on him, stated (That Kufr is of two types: Kufr of action and Kufr of rejection and belief. And that Kufr of action is divided into what contradicts Iman and what does not\n[37]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 32
  },
  {
    "serial_number": "4625183",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 38,
    "volume_number": 1,
    "text": "contradict it. So prostrating to an idol, showing contempt for the Mushaf, killing the Prophet and insulting him contradicts Iman. As for ruling by other than what Allah revealed and abandoning prayer, it is definitively from practical Kufr).\n(I say: This absolute statement is questionable, as that might be from belief-based Kufr at times, and that is if it is accompanied by what indicates the corruption of his creed, such as his mocking of prayer and those who pray, and his preference of being killed over praying if the ruler calls him to it, as will come. So remember this, for it is important).\nThen he, may Allah have mercy on him, said: (And the name of Kufr cannot be negated from him after Allah and His Messenger applied it to him, but it is Kufr of action, not Kufr of belief. The Messenger of Allah (peace and blessings of Allah be upon him) negated Iman from the fornicator, the thief, the drinker of alcohol, and the one whose neighbor is not safe from his evil. If the name of Iman is negated from him, he is a disbeliever from the aspect of action, and the Kufr of rejection and belief is negated from him).\n(I say: But I see that it is not correct to apply the word Kufr to the likes of these, so it is said for example: Whoever commits fornication has committed Kufr, let alone that it is not permissible to say: 'So he is a Kafir' - even for the one who abandons prayer - meaning to say: 'Kafir' - and upon others who were described in the hadith with Kufr, stopping with\n[38]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 33
  },
  {
    "serial_number": "4625184",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 39,
    "volume_number": 1,
    "text": "the text, and with greater reason, it should not be said: 'A disbeliever whose blood is lawful'). Then he [Ibn al-Qayyim] said, may Allah have mercy on him, after mentioning the authentic hadith: ('Abusing a Muslim is Fusuq (immorality) and fighting him is Kufr')... (And it is known that he, peace and blessings of Allah be upon him, only intended practical Kufr, not doctrinal Kufr. This Kufr does not expel one from the Islamic circle and the Millah entirely, just as the adulterer and the thief are not expelled from the Millah, even if the name of Iman (faith) is stripped from them. This detail is the saying of the Companions who are the most knowledgeable of the Ummah regarding the Book of Allah and regarding Islam and Kufr and their implications). Then he mentioned the well-known report from Ibn Abbas regarding the interpretation of His command, the Exalted: [And whoever does not judge by what Allah has revealed - then it is those who are the disbelievers]. He said: (It is not the Kufr that they adhere to). (I say: Al-Hakim added: 'It is not a Kufr that expels from the Millah; it is a Kufr less than [major] Kufr.' He authenticated it (2 / 313) and Al-Dhahabi [agreed]. This is a back-breaker for the Takfir group and their likes among the extremists). Then Ibn al-Qayyim, may Allah have mercy on him, said: (The intended meaning is that stripping Iman from the one who abandons prayer is more appropriate than stripping it [39]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 34
  },
  {
    "serial_number": "4625185",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 40,
    "volume_number": 1,
    "text": "from the perpetrator of major sins, and stripping the name of Islam from him is more appropriate than stripping it from one from whose tongue and hand the Muslims have not been safe. So, the one who abandons prayer is not called a Muslim or a Mu'min (believer), even if he possesses a branch of the branches of Islam or Iman). (I say: Denying the mentioned naming for the one who abandons prayer: this is questionable. For Allah the Exalted named the rebellious group 'believers' in the well-known verse: [And if two factions among the believers should fight, then make settlement between the two...], alongside his saying, peace and blessings of Allah be upon him, in the previous hadith: (...and fighting him is Kufr). So, just as describing the rebellious Muslim with Kufr did not necessitate negating the name of 'believer' from him, let alone the name of 'Muslim', the same applies to the one who abandons prayer, unless what is intended by that negation is that he is not a 'perfect' Muslim, and that is far-fetched). He said: (Yes, it remains to be said: Does what he has of Iman benefit him in not abiding eternally in the Fire? It is said: It benefits him if the abandoned [act] is not a condition for the validity of the remainder and its consideration. But if the abandoned [act] is a condition for the consideration of the remainder, it does not benefit him. So, is prayer a condition for the validity of Iman? This is the secret of the issue). I say: Then he, may Allah have mercy on him, pointed to the evidences he had mentioned [40]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 35
  },
  {
    "serial_number": "4625186",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 41,
    "volume_number": 1,
    "text": "for the first group which declares Takfir, then he said: (And they indicate that nothing of a servant's deeds is accepted except with the performance of prayer). So I say: It appears clear to me that Ibn al-Qayyim, may Allah have mercy on him, after his valuable research in distinguishing between practical Kufr and doctrinal Kufr, and that a Muslim does not exit the Millah by practical Kufr, was unable to rule in favor of the group that declares Takfir for abandoning prayer despite the many evidences he cited for them, because they all do not indicate practical Kufr. Therefore, he finally resorted to asking: (Does his Iman benefit him? And is prayer a condition for the validity of Iman?). I say: Everyone who contemplates his answer to this question notices that he deviated from it to saying that righteous deeds are not accepted except with prayer. So where is the answer regarding prayer being a condition for the validity of Iman? Meaning: Not just a condition of perfection, for all righteous deeds are a condition of perfection according to Ahlus-Sunnah, contrary to the Khawarij and the Mu'tazilah who say that people of major sins abide eternally in the Fire, with the Khawarij explicitly declaring them disbelievers [41]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 36
  },
  {
    "serial_number": "4625187",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 42,
    "volume_number": 1,
    "text": "If someone were to say that prayer is a condition for the validity of Iman and that the one who abandons it abides eternally in the Fire, he would have aligned with the Khawarij in some of their saying. And more dangerous than that is that he has contradicted this hadith of Intercession, as previously explained. Perhaps Ibn al-Qayyim, may Allah have mercy on him, by deviating from that answer, wanted to make the reader feel the importance of prayer in Islam on one hand, and that there is no evidence that it is a condition for the validity of Iman on the other hand. Accordingly, the one who abandons prayer out of laziness does not disbelieve according to him unless his abandonment is accompanied by what indicates that he disbelieved with a doctrinal Kufr. In this case—only—he disbelieves with a Kufr by which he exits the Millah, as I have previously pointed out. This is what is implied by Ibn al-Qayyim's speech at the end of this chapter, for he said: (And it is strange that doubt should occur regarding the Kufr of one who persists in abandoning it and is called to perform it in front of the public assembly, seeing the flash of the sword over his head, and is bound for execution, and his eyes are blindfolded, and it is said to him: 'Pray, or else we will kill you?' and he says: 'Kill me, and I will never pray'). I say: And upon such a person who persists in abandonment and refuses prayer while the ruler threatens him with death: all the evidences of the group that declares Takfir on the abandoner of prayer must be interpreted. Thus, their evidences combine with the evidences of the opponents, and they meet on a word [42]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 37
  },
  {
    "serial_number": "4625188",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 43,
    "volume_number": 1,
    "text": "of agreement that mere abandonment does not constitute Kufr because it is practical Kufr, not doctrinal, as previously quoted from Ibn al-Qayyim. This is what Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, did—I mean that he interpreted those evidences in this manner. He said in (Majmu' al-Fatawa) (22 / 48), when he was asked about the one who abandons prayer without excuse: Is he a Muslim in that state? He answered, may Allah have mercy on him, with a long research filled with knowledge, but the important part for us now is what relates to this discussion of ours. After narrating that the one who abandons prayer is to be killed according to the majority of scholars—Malik, Al-Shafi'i, and Ahmad—he said: (And if he persists until he is killed, is he killed as an apostate disbeliever or as a Fasiq (sinner) like the sinners of the Muslims? There are two famous opinions narrated as two narrations from Ahmad. If he was acknowledging prayer inwardly, believing in its obligation, it is impossible for him to persist in abandoning it until he is killed and not pray. This is not known from the children of Adam and their habits. For this reason, this has never occurred in Islam, nor is it known that anyone believes in its obligation and is told: 'If you do not pray, we will kill you,' and he persists in abandoning it while acknowledging the obligation. This has never occurred in Islam [43]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 38
  },
  {
    "serial_number": "4625189",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 44,
    "volume_number": 1,
    "text": "And whenever a man refuses prayer until he is killed: he was not inwardly acknowledging its obligation nor committed to performing it. This one is a disbeliever by the agreement of the Muslims, just as the reports from the Companions have become widespread regarding the Kufr of such a person. The authentic texts indicated this, such as his saying, peace and blessings of Allah be upon him: (There is nothing between the servant and Kufr except leaving prayer) narrated by Muslim. So whoever persists in abandoning it until he dies, never prostrating a single prostration to Allah, this one is never a Muslim acknowledging its obligation. For the belief in the obligation and the belief that the one who abandons it deserves killing is a complete motive to perform it. And the motive, along with the ability, necessitates the existence of the object of power. So if he was capable and never did it, it is known that the motive did not exist in his case. The complete belief in the punishment of the abandoner is a motivator for the action. However, this might sometimes be opposed by matters that necessitate delaying it, leaving some of its obligations, and missing it sometimes. But as for the one who persists in abandoning it, never praying, and dies upon this persistence and abandonment, this one is not a Muslim. However, most people pray sometimes and leave it sometimes; these are not [44]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 39
  },
  {
    "serial_number": "4625190",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 45,
    "volume_number": 1,
    "text": "preserving it. These are under the threat, and they are the ones concerning whom the hadith in (Al-Sunan) came [from] the hadith of Ubadah from the Prophet, peace and blessings of Allah be upon him, that he said: (Five prayers, Allah has written them upon the servants in the day and night. Whoever preserves them, he has a covenant with Allah that He will admit him into Paradise. And whoever does not preserve them, he has no covenant with Allah; if He wills, He punishes him, and if He wills, He forgives him)). So the one who preserves them: is the one who prays them at their times as Allah the Exalted commanded. And the one who delays them sometimes beyond their time or leaves their obligations, this one is under the will of Allah the Exalted. And this one might have voluntary prayers with which he completes his obligatory prayers as stated in the hadith...)). The speech of Imam Ahmad also indicates this interpretation, [even though] some of his later followers became famous for the opinion of declaring Takfir on the one who abandons prayer without [45]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 40
  },
  {
    "serial_number": "4625191",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 46,
    "volume_number": 1,
    "text": "detail. His [Ahmad's] speech indicates the opposite of that, such that it does not contradict this authentic hadith. How could it be otherwise when he narrated it in his (Musnad), just as he narrated the hadith of Aisha with its meaning as previously mentioned? His son Abdullah mentioned in his (Masa'il) (p. 55), saying: (I asked my father, may Allah have mercy on him, about leaving prayer intentionally? He said: (...And the one who leaves it and does not pray it, and the one who prays it outside its time, I call him three times. If he prays, [good], otherwise I strike his neck. He is, in my view, in the status of an apostate...)). I say: This is a text from Imam Ahmad that he did not declare him a disbeliever merely for abandoning prayer, but rather for refusing prayer while knowing that he would be killed if he did not pray. The reason is his preference for death over prayer. This is what indicated that his Kufr is doctrinal Kufr, so he deserved killing. Similar to this is what Al-Majd Ibn Taymiyyah—the grandfather of Sheikh al-Islam Ibn Taymiyyah—mentioned in his book (Al-Muharrar fi Al-Fiqh Al-Hanbali) (p. 62): (And whoever delays a prayer out of laziness, not denial, is ordered to perform it. If he persists until the time of the other [prayer] becomes tight, his killing becomes obligatory). I say: So he did not disbelieve by delaying, but by the persistence that indicates denial [46]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 41
  },
  {
    "serial_number": "4625192",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 47,
    "volume_number": 1,
    "text": "Therefore, Imam Abu Ja'far Al-Tahawi, may Allah have mercy on him, said in (Mushkil al-Athar) in a chapter he dedicated to this issue, narrating some of the evidences of both groups, then choosing that he does not disbelieve. He said (4 / 228): (The evidence for that is that we command him to pray, and we do not command a disbeliever to pray. If he were a disbeliever due to what happened from him, we would have commanded him to accept Islam, and if he accepted Islam, we would command him to pray. In our leaving of that and commanding him to pray is an indication that he is from the people of prayer. Also from that is the command of the Prophet, peace and blessings of Allah be upon him, to the one who broke his fast in Ramadan one day intentionally to perform the expiation which he commanded him with, which includes fasting, and fasting is only for Muslims. Since a man is a Muslim if he acknowledges Islam before he performs what Islam obligates of the five prayers and the fasting of Ramadan: he is likewise. He becomes a disbeliever by his denial of that, and he does not become a disbeliever by leaving it without denial from him for it—and he is not a disbeliever except from where he was a Muslim—and his Islam was by his acknowledgement of Islam, so likewise his apostasy is only by his denial of Islam). I say: This is good jurisprudence and solid speech that cannot be rejected. It aligns perfectly with what preceded from the speech of Imam Ahmad, may Allah have mercy on him, indicating that he does not disbelieve merely by abandonment, but by his refusal of prayer after being called to it [47]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 42
  },
  {
    "serial_number": "4625193",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 48,
    "volume_number": 1,
    "text": "And indeed, what confirms the interpretation I gave to the speech of Imam Ahmad is what came in the book (Al-Insaf fi Ma'rifat Al-Rajih min Al-Khilaf 'ala Madhhab Al-Imam Al-Mubajjal Ahmad bin Hanbal) by Sheikh Ala' al-Din Al-Mardawi. He, may Allah have mercy on him, said (1 / 402), acting as an explainer to Ahmad's saying mentioned just now: ('I call him three times'): (The one who calls him is the Imam or his deputy. If he left many prayers before the call, his killing is not obligatory, and he does not disbelieve according to the correct view of the Madhhab. This is the view of the majority of the companions [of the Madhhab], and many of them stated it decisively). Among those who chose this Madhhab was Abu Abdullah bin Battah, as mentioned by Sheikh Abu Al-Faraj Abdul Rahman bin Qudamah Al-Maqdisi in his book (Al-Sharh Al-Kabir 'ala (Al-Muqni') by Imam Muwaffaq al-Din Al-Maqdisi) (1 / 385), and he added that he denied the saying of those who said he disbelieves. Abu Al-Faraj said: (It is the saying of most jurists, including Abu Hanifa, Malik, and Al-Shafi'i). Then he used many hadiths as evidence for that, most of which are with Ibn al-Qayyim, including the hadith of Ubadah mentioned in Ibn Taymiyyah's speech. He said following it: (If he were a disbeliever, He would not have included him in the Will [Mashi'ah]). I say: This is confirmed by the hadith of the Book and the hadith of Aisha [48]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 43
  },
  {
    "serial_number": "4625194",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 49,
    "volume_number": 1,
    "text": "with a confirmation that leaves no doubt or suspicion, so do not forget. Then Abu Al-Faraj said: (And because that is the consensus of the Muslims, for we do not know in any of the ages anyone among the abandoners of prayer who was left without washing and prayer over him, nor was the inheritance of his inheritor prevented, nor was a separation made between the spouses if one of them abandoned it, despite the abundance of those who abandon prayer. If he had disbelieved, these rulings would have been established. And we do not know of any disagreement among Muslims that the abandoner of prayer must make it up, unlike their disagreement regarding the apostate. As for the previous hadiths (meaning those used as evidence by those who declare Takfir, like the hadith: 'Between a man and Kufr is the abandonment of prayer'), they are by way of severity and likeness to the disbelievers, not in reality, like his saying, peace and blessings of Allah be upon him: 'Abusing a Muslim is Fusuq and fighting him is Kufr'... and the likes of this which are intended to intensify the threat. Our Sheikh, may Allah have mercy on him (meaning Al-Muwaffaq Al-Maqdisi), said: And this is the more correct of the two sayings, and Allah knows best). I say: Sheikh Suleiman bin Sheikh Abdullah bin Sheikh [49]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 44
  },
  {
    "serial_number": "4625195",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 50,
    "volume_number": 1,
    "text": "Muhammad bin Abdul Wahhab, may Allah have mercy on them, quoted it in his footnote on (Al-Muqni') (1 / 95 - 96) by Ibn Qudamah, affirming it. Even with Imam Al-Shawkani's explicit declaration in (Al-Sayl Al-Jarrar) (1 / 292) of the Takfir of the one who abandons prayer intentionally and that he deserves killing and it is obligatory on the Imam of the Muslims to kill him, he clarified in (Nayl Al-Awtar) that he does not mean a Kufr that is not forgiven. He said after narrating the sayings of the scholars and their disagreement and mentioning some of their evidences (1 / 154 - 155): (The truth is that he is a disbeliever who is killed. As for his Kufr, it is because the hadiths authenticated that the Lawgiver named the abandoner of prayer with that name [] and made the barrier between a man and the permissibility of applying this name to him be the prayer. So abandoning it necessitates the permissibility of the application. None of the objections raised by the first group bind us, because we say: It is not prevented that some types of Kufr do not prevent forgiveness and entitlement to intercession, like the Kufr of the People of the Qiblah regarding some sins which the Lawgiver named Kufr. So there is no excuse for the interpretations which people fell into wasting). He spoke the truth, may Allah have mercy on him, but his going towards the permissibility of applying the name 'Disbeliever' (Kafir) to the abandoner of prayer is an expansion that is not praiseworthy in my view, because the hadiths he referred to do not contain the claimed application; rather, they contain: [50]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 45
  },
  {
    "serial_number": "4625196",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 51,
    "volume_number": 1,
    "text": "('he has disbelieved' [Faqad Kafara]). I do not think anyone permits himself to derive an active participle (noun of subject) from this verb and say from it: 'Kafir' (disbeliever). Otherwise, he would be required to apply it also to everyone about whom it was said: 'Kafara' (he disbelieved), such as the one who swears by other than Allah, and the one who fights a Muslim or disowns a lineage, and the like of what came in the hadiths. Yes, if what Abu Ya'la (2349) and others narrated from Ibn Abbas as Marfu' (elevated to the Prophet) were authentic, with the wording: (The loops of Islam and the foundations of the religion are three, upon which Islam is founded. Whoever leaves one of them, he is by it a disbeliever whose blood is lawful: The testimony that there is no deity but Allah, the prescribed prayer, and the fasting of Ramadan). I say: If this were authentic, it would be clear evidence for the permissibility of applying it [the term Kafir] to the abandoner of prayer, but it is not authentic, as I had clarified in (Al-Silsilah Al-Da'ifah) (94). The summary: Mere abandonment cannot be a proof for declaring a Muslim a disbeliever. Rather, he is a Fasiq (sinner) whose affair is with Allah; if He wills, He punishes him, and if He wills, He forgives him. The hadith which is the pillar of this treatise is an explicit text in that, which a Muslim has no option but to accept. And [it states] that whoever is called to prayer and warned of killing if he does not respond, and is then killed, he is a disbeliever—with certainty—whose blood is lawful, who is not prayed over, and is not buried in [51]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 46
  },
  {
    "serial_number": "4625197",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 52,
    "volume_number": 1,
    "text": "the cemeteries of the Muslims. So whoever generalizes Takfir is mistaken, and whoever generalizes non-Takfir is mistaken. The correct view is the detailed one. This truth has no hiddenness, so leave me be from the divergent paths. Furthermore: What I fear most is that some ignorant fanatics might rush to reject this authentic hadith due to its explicit indication that the one who abandons prayer out of laziness, while believing in its obligation, falls under the generality of His saying, the Exalted: [...and He forgives what is less than that for whom He wills]. As some of them did recently on the date (1407 AH). Two students of knowledge cooperated—one Saudi and the other Egyptian—and critiqued me regarding some hadiths from the first hundred of (Silsilat Al-Ahadith Al-Sahihah), among them the hadith of Hudhayfah bin Al-Yaman, may Allah be pleased with him (number: 87), and its wording is: (Islam will wear out as the embroidery of a garment wears out, until it is not known what fasting is, nor prayer, nor rites, nor charity. And the Book of Allah, the Mighty and Majestic, will be journeyed upon in a night, so not a verse of it will remain. And groups of people will remain: the old man and the old woman, saying: We overtook our fathers upon this word: 'La ilaha illa Allah' (There is no deity but Allah), so we say it) [52]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 47
  },
  {
    "serial_number": "4625198",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 53,
    "volume_number": 1,
    "text": "Silah bin Zufar said to Hudhayfah: What does (La ilaha illa Allah) avail them when they do not know what prayer is, nor fasting, nor rites, nor charity? Hudhayfah turned away from him. Then he repeated it to him three times, all the while Hudhayfah turning away from him. Then he turned to him on the third time and said: O Silah, it saves them from the Fire. (Three times). I say: They blackened three large pages in weakening this hadith in response to me for authenticating it. They did not find anything to cling to for weakening it except that it is from the narration of Abu Mu'awiyah Muhammad bin Khazim Al-Darir, arguing that he used to hold the view of Irja' and that the hadith agrees with the innovation of Irja'. This is extreme ignorance, and there is no room now to explain it except briefly. For Abu Mu'awiyah, despite being trustworthy (Thiqah) and relied upon by the two Sheikhs [Bukhari and Muslim], has been followed [corroborated] by a trustworthy narrator like him, and the hadith has absolutely no connection to Irja'. They only claimed that due to their ignorance of the knowledge. How could that be when Al-Hakim and Al-Dhahabi authenticated it, as well as Ibn Taymiyyah, Al-Asqalani, and Al-Busiri? Even if it were conceivable in their minds that these scholars were all mistaken in authenticating it, has the matter reached the point with them that they believe that they [the scholars] [53]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 48
  },
  {
    "serial_number": "4625199",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 54,
    "volume_number": 1,
    "text": "authenticate what supports Irja'? By Allah, it is indeed one of the great calamities that those who do not master this science dominate it, and weaken what the people of knowledge authenticate. This authentic hadith is utilized to show that ignorance may reach such an extent with some people that they know nothing of Islam except the Testimony (Shahadah). This does not mean that they know the obligation of prayer and the rest of the pillars and then do not perform them. No, there is nothing of that in the hadith. Rather, they are in that state like many of the people of the desert and those new to Islam in the lands of Kufr who know nothing of Islam except the two Testimonies. Something of this might occur in some capitals. Someone asked me by phone about a woman he married who used to pray without performing Ghusl (ritual bath) from sexual intercourse. And recently, an Imam of a mosque, who views himself as having some knowledge that justifies him contradicting the scholars, asked me about his son who used to pray while Junub (impure) after reaching manhood and having wet dreams, because he did not know the obligation of Ghusl from Janabah. Ibn Taymiyyah said in (Majmu' Al-Fatawa) (22 / 41): [54]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 49
  },
  {
    "serial_number": "4625200",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 55,
    "volume_number": 1,
    "text": "(And whoever knows that Muhammad is the Messenger of Allah and believes in that, but does not know much of what he brought, Allah will not punish him for what did not reach him. For if He does not punish him for leaving Iman after puberty, then [that] He does not punish him for some of its conditions except after puberty is more appropriate and worthy. This is the Sunnah of the Messenger of Allah, peace and blessings of Allah be upon him, which is widespread from him in the likes of that...) Then he mentioned good examples, including the woman with Istihadah (irregular bleeding) who said: I suffer from severe Istihadah that prevents me from prayer and fasting? So he commanded her to pray during the time of the Istihadah blood and did not command her to make it up. I say: This woman with Istihadah is Fatima bint Abi Hubaysh, may Allah be pleased with her, and her hadith is in the (Two Sahihs) and others, and it is extracted in (Sahih Abi Dawood) (281). Similar to her is Umm Habiba bint Jahsh, the wife of Abdul Rahman bin Awf, who had Istihadah for seven years, and her hadith is with the two Sheikhs as well, and it is extracted in the (Sahih) also (283). There is a third, Hamnah bint Jahsh, who is the one indicated by Ibn Taymiyyah, for in her hadith: (I suffer from copious, severe Istihadah, so what is your view on it? It has prevented me from prayer and fasting...) the Hadith [55]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 50
  },
  {
    "serial_number": "4625201",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 56,
    "volume_number": 1,
    "text": "Furthermore, there is another text from Imam Ahmad that should have been added to what was previously quoted from him due to its strong connection to it and its indication also that the one who abandons prayer does not disbelieve by mere abandonment. But this is how it was destined. Abdullah, the son of Imam Ahmad, said in his (Masa'il) (p. 56 / 195): (I asked my father about a man who neglected the prayers of two months? He said: (He prays what was in a time where the remembrance of those prayers is present to him. He continues to pray until it is the last time of the prayer in which he remembered these prayers which he neglected. So he prays this one which he fears missing, and he does not waste [it] twice. Then he returns and prays also until he fears missing the prayer that follows it. Unless it has become too much for him, and he is one who seeks a livelihood and does not have the strength to perform it; then he prays until he needs to seek what sustains him of his livelihood, then he returns to prayer. A prayer does not suffice him while he remembers the obligatory prayer preceding it; he repeats it also if he remembers it while he is in a prayer). Look, O noble reader: Do you see in this speech of Imam Ahmad anything but what indicates what was previously verified, that a Muslim does not exit Islam merely by leaving that prayer, rather the prayers of two consecutive months, rather [56]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 51
  },
  {
    "serial_number": "4625202",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 57,
    "volume_number": 1,
    "text": "and he permitted him to delay making up some of them to seek livelihood. This, in my view, indicates two things: First: What preceded, which is that he remains upon his Islam even if his conscience is not absolved by making up all the missed prayers he owes. Second: That the ruling of making up (Qada') is lower than the ruling of performance (Ada'), because I do not believe that Imam Ahmad, nor even anyone below him in knowledge, permits leaving prayer until its time exits for the excuse of seeking livelihood. And Allah, the Glorious and Exalted, knows best. Know, O Muslim brother, that this narration from Imam Ahmad and what carries its meaning is what every Muslim should rely upon, for his own sake first, and for the distinctiveness of Imam Ahmad second, due to his saying, may Allah have mercy on him: (If the hadith is authentic, it is my Madhhab). Especially since the other opinions narrated from him contrary to what preceded are very contradictory, as you see in (Al-Insaf) (1 / 327 - 328) and other reliable books. And despite their contradiction, there is nothing in any of them explicitly stating that a Muslim disbelieves merely by abandoning prayer [57]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 52
  },
  {
    "serial_number": "4625203",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 58,
    "volume_number": 1,
    "text": "Since the matter is so, the absolute narrations from him must be interpreted by the restricted narrations that clarify his intent, may Allah have mercy on him, which is what was previously quoted from his son Abdullah. Even if we assume there is an explicit narration from him regarding Takfir by mere abandonment, it must be abandoned, and one must hold to the other narrations due to their agreement with this explicit authentic hadith regarding the exit of the abandoner of prayer from the Fire by his Iman, even if it is the amount of an atom. Many verifying Hanbali scholars have stated this, such as Ibn Qudamah Al-Maqdisi, as previously quoted by Abu Al-Faraj from him. The text of Ibn Qudamah's speech is: (And if he leaves any of the five acts of worship out of negligence, he does not disbelieve). This is in his book (Al-Muqni'), and similar to it is in (Al-Mughni) (2 / 298 - 302) in a long discussion by him wherein he mentioned the disagreement regarding it and the proofs of each, then concluded with this which is in (Al-Muqni'). It is the truth in which there is no doubt, and the authors of (Al-Sharh Al-Kabir) and (Al-Insaf) are upon it, as previously mentioned. If you know the correct saying of Ahmad, then what was mentioned by [58]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 53
  },
  {
    "serial_number": "4625204",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 59,
    "volume_number": 1,
    "text": "Al-Subki in the biography of Imam Al-Shafi'i does not refute him, where he said in (Tabaqat Al-Shafi'iyyah Al-Kubra) (1 / 220): (It is told that Ahmad debated Al-Shafi'i regarding the abandoner of prayer. Al-Shafi'i said to him: O Ahmad, do you say: He disbelieves? He said: Yes. He said: If he is a disbeliever, then by what does he become Muslim? He said: He says: There is no deity but Allah, Muhammad is the Messenger of Allah. He said: The man is continuing upon this saying, he has not left it. He said: He becomes Muslim by praying. He said: The prayer of a disbeliever is not valid, and Islam is not judged by it. So Ahmad was silenced and remained quiet). I say: This does not refute Imam Ahmad, may Allah have mercy on him, for two reasons: First: The story is not established. Al-Subki, may Allah have mercy on him, indicated that by prefacing it with the saying: (It is told), so it is interrupted. Second: It was mentioned based on the saying that Ahmad declares a Muslim a disbeliever merely by abandoning prayer, and this is not established from him—as previously clarified. It only refutes some of the Sheikhs who still hold the view of Takfir by mere abandonment. My hope is that they will retract it after they stand [59]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 54
  },
  {
    "serial_number": "4625205",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 60,
    "volume_number": 1,
    "text": "upon this authentic hadith—upon which we built this treatise—and upon the saying of Ahmad—and others among the senior Imams of the Hanbalis—which agrees with it. For declaring a monotheist Muslim a disbeliever for an act issuing from him is not permissible until it becomes clear from him that he is denying, even if it is some of what Allah legislated, like the one who is called to prayer or else killed—as previously mentioned. I am pleased on this occasion by what Al-Hafiz quoted in (Al-Fath) (12 / 300) from Al-Ghazali, that he said: (And what should be guarded against is: Takfir as long as there is a way [to avoid] it. For allowing the blood of Muslims who acknowledge Tawhid is an error, and the error in leaving a thousand disbelievers alive is lesser than the error in shedding the blood of one Muslim). Furthermore, it has reached me that (some of them), when confronted with this hadith, questioned its indication regarding the salvation of the Muslim abandoner of prayer from eternal abode in the Fire with the disbelievers, claiming that he is not mentioned in all the batches brought out of the Fire. This is a strange arrogance that reminds us of the arrogance of some fanatics of the Madhhabs in rejecting the indications of the texts to support the Madhhab. For the hadith is explicit that the first batch included those who prayed, by the sign that the Fire did not eat their faces. So, the batches after it do not contain those who pray, obviously [60]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 55
  },
  {
    "serial_number": "4625206",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 61,
    "volume_number": 1,
    "text": "If the likes of this does not benefit some of the rigid blind followers, we have nothing to say but: [Peace be upon you; we do not seek the ignorant]. The summary: Our hadith—the hadith of Intercession—is a magnificent hadith with many indications and meanings. Among them—as I presented—is its decisive indication that the abandoner of prayer—while believing in its obligation—does not exit the Millah and does not abide eternally in the Fire with the disbelievers and polytheists. Therefore, I sincerely hope that everyone who comes across this treatise containing this hadith—and others of its meaning—will retract declaring the Muslims who abandon prayer while believing in it and unifying Allah the Blessed and Exalted as disbelievers. For declaring a Muslim a disbeliever is a very serious matter—as previously mentioned. They must—only—remind [people] of the greatness of prayer in Islam according to what came regarding that in the Holy Quran, the Prophetic Hadiths, and the authentic Salafi reports. For the judgment has slipped—unfortunately—from the hands of the scholars. Therefore, they cannot execute the ruling of Kufr and killing on a single abandoner of prayer, let alone a group of abandoners, even in their own state, let alone in other Islamic states. For killing the abandoner of prayer after calling him to it was only for an apparent wisdom, which is that perhaps he would repent if he believed in it. So if he preferred death over it, it indicated [61]\n\nthat his abandonment was out of denial, so he dies—in this case—as a disbeliever, as previously quoted from Ibn Taymiyyah. His refusal of it in this state is the proof of his exit from the Millah. This is something for which there is no way today, unfortunately. So let the scholars be satisfied—then—from a theoretical standpoint with what the majority of Muslim Imams are upon regarding not declaring the abandoner of prayer a disbeliever while he believes in it. We have presented the decisive proof for that from the authentic Sunnah, so there is no excuse for anyone after that. [So let those beware who dissent from the Prophet's order, lest fitnah strike them or a painful punishment]",
    "foot_note": "None\n\nNone",
    "book_id": "416",
    "new_page_number": 56
  },
  {
    "serial_number": "4625208",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 62,
    "volume_number": 1,
    "text": "Note: The quotation (p. 57 - 58) from Ibn Qudamah preceded. He, may Allah have mercy on him, is among those who missed using this authentic hadith as evidence for the correct Madhhab regarding not declaring the abandoner of prayer out of laziness a disbeliever. But what is strange is that he mentioned another hadith which, had it been authentic, would have been decisive in ending the disagreement, because it states that a freed slave of the Ansar died while he used to pray and [sometimes] leave it, yet he, peace and blessings of Allah be upon him, commanded washing him, praying over him, and burying him. Although he [Ibn Qudamah] remained silent about it, he did well by mentioning it with its chain from the narration of Al-Khallal, which enabled me to study it and judge it with the weakness and denunciations it deserves. Therefore, I deposited it in my book [62]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 57
  },
  {
    "serial_number": "4625209",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 63,
    "volume_number": 1,
    "text": "(Silsilat Al-Ahadith Al-Da'ifah) (6036). Second Note: Days after writing the above, some of my brothers showed me an important book entitled: (Fath min Al-Aziz Al-Ghaffar bi Ithbat anna Tarik Al-Salat laysa min Al-Kuffar) [A Victory from the Mighty, the Forgiving, in Proving that the Abandoner of Prayer is not among the Disbelievers], authored by Ata' bin Abdul Latif Ahmad. I rejoiced greatly at it, and my joy increased when I read it and browsed some of its chapters. His scientific style and his method in handling the different evidences became clear to me. Among them—indeed, the most important of them—is extracting the hadiths, tracking their paths and supporting evidences, and distinguishing their authentic ones from their weak ones, to enable him thereafter to drop what is not permissible to engage with due to its weakness, and to rely on what is established of them, then using it as evidence or answering it. This is what the brother author did—may Allah reward him with good—unlike some authors who gather everything that supports them without investigating only the authentic, as did those who replied to me regarding the issue of the woman's face among the authors on that from the Saudis, Egyptians, and others. As for this brother (Ata'), he followed the scientific method in replying [63]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 58
  },
  {
    "serial_number": "4625210",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 64,
    "volume_number": 1,
    "text": "to those who declare Takfir. He tracked their evidences and mentioned what is for them and what is against them, then mentioned the evidences contrary to them using the same method. He reconciled between them and what contradicts them with a solid, firm style, although it is accompanied—sometimes—by some leniency in authentication based on corroborating evidences, then artificiality in reconciling it with the authentic hadiths indicating the Kufr of the abandoner of prayer. As he did with the hadith of Abu Darda' regarding prayer: (...so whoever abandons it has exited the Millah). After discussing it and clarifying the weakness of its chain, he returned and strengthened it with its corroborating evidences, which are in reality deficient corroborating evidences that do not stand to strengthen this hadith. Then he went further to interpret the 'exit' mentioned in it as an exit less than [total] exit. He has other instances of leniency and interpretation, such as the hadith extracted in (Al-Da'ifah) (6037). The truth is: His book is very useful in its field. He collected everything related to it, negatively or positively, accepting or rejecting, without apparent fanaticism from him for anyone or against anyone. The best part of it is the first chapter of the second section, which is as he said: (Regarding mentioning special evidences indicating that the abandoner of prayer does not exit the Millah). He numbered his referenced evidences as twelve evidences [64]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 59
  },
  {
    "serial_number": "4625211",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 65,
    "volume_number": 1,
    "text": "I thought when I read this title in the introduction of his book that among them was this hadith of Intercession, because it is decisive in the dispute for every fair person—as previously explained. But—unfortunately—he missed it, just as others among the later or earlier scholars missed it, as previously mentioned. However, I must mention one of his evidences due to its importance and the heedlessness of those who declare Takfir regarding it. That is his saying, peace and blessings of Allah be upon him: (Indeed, Islam has landmarks and a lighthouse like the lighthouse of the road...) the Hadith. In it is the mention of Tawhid, prayer, and others of the known five pillars and obligations. Then he, peace and blessings of Allah be upon him, said: (...So whoever detracts anything from them, it is a share of Islam he has left; and whoever leaves them [all], he has thrown Islam behind him). The aforementioned [author] extracted it well, tracked its paths, showed that some of them have authentic chains, then explained its explicit indication that the abandoner of prayer does not exit the Millah. I had extracted this hadith long ago in my book (Silsilat Al-Ahadith Al-Sahihah) (Number: 333) more than thirty years ago. He benefited from it as is the case of the later with the earlier, but he did not refer to that with the slightest indication. It would have been better for him to do so, especially since he singled me out for criticism regarding some hadiths. That does not harm me at all; rather, it [65]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 60
  },
  {
    "serial_number": "4625212",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "The Ruling on the One Who Abandons Prayer",
    "edition": "First - 1412",
    "publisher": "Dar Al-Jalalayn - Riyadh",
    "page_number": 66,
    "volume_number": 1,
    "text": "benefits me whether he was right or wrong. Now is not the place to detail the speech on that. In conclusion: Let anyone who has doubt regarding this issue review this book. And Allah alone, the Glorious, is the Granter of success to what is right. Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You. I seek Your forgiveness and repent to You. [66]",
    "foot_note": "None",
    "book_id": "416",
    "new_page_number": 61
  }
]