[
  {
    "text": "Fiqh of Contemporary Issues in Worship\nAuthor: خالد بن علي بن محمد المشيقح\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4865\nbook_title: فقه النوازل في العبادات\nbook_link: https://shamela.ws/book/945\nbook_id: 945\nauthor_name: خالد بن علي بن محمد المشيقح\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/590\nauthor_ID: 590\neditor: Null\npublisher: Null\nedition: Null\npages: 79\nvolumes: Null\npagination: [الكتاب مرقم آليا]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4635826",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Fiqh Issues\nBook: Fiqh al-Nawazil fi al-Ibadat (Jurisprudence of Contemporary Issues in Worship)\nAuthor: Khalid bin Ali bin Muhammad bin Hamoud bin Ali Al-Mushayqih\n[The book is automatically numbered]\nNumber of pages: 79\nPublication date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 3
  },
  {
    "serial_number": "4635827",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "From the lessons of the scientific course at Al-Rajhi Mosque in Buraidah for the year 1426 AH.\nFiqh of Contemporary Issues in Worship\nPart One (Purification - Prayer - Funerals)\nDelivered by Sheikh: Prof. Dr. Khalid bin Ali Al-Mushayqih\n\n**Introduction**\nPraise be to Allah, Lord of the Worlds, and prayers and peace be upon the Master of Messengers. To proceed:\nIn this course, I decided that we address 'Contemporary Issues concerned with matters of Worship'. There are many contemporary issues related to purification and prayer, as well as what relates to Zakat and Fasting, such as new invalidate of fasting, etc.\nWe will start, God willing, with contemporary issues of purification, then after that we will move to contemporary issues of prayer, then after that if time permits us, we will address a number of contemporary issues of Zakat such as the ruling on trading with Zakat funds and charities and other things we will mention. We will try, God willing, to be brief because the contemporary issues are many. I have surveyed many of the contemporary issues existing now in purification; there are many issues found in water, in ablution (Wudu), in bathing (Ghusl), and also regarding removing impurities, etc. These issues are needed by people because they encounter them and they touch their worship matters. We will mention a definition for these contemporary issues in general, then after that mention their derivation from the words of previous jurists.\nBefore I start with the contemporary issues, I will present a definition of 'Nawazil' (contemporary issues) in language and terminology, then after that I will mention a part of the importance of studying contemporary issues and new occurrences in Fiqh, then after that we will start with the contemporary issues of purification. We will try, God willing, to take ten issues every day.\n\n**Definition of Nawazil**\nNawazil: Plural of Nazilah. In language: The descent of a thing and its coming down.\nAs for terminology: It is the new occurrence that requires a Sharia ruling.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 4
  },
  {
    "serial_number": "4635828",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "**Ruling on Studying these Contemporary Issues**\nIt is a communal obligation (Fard Kifayah); if performed by enough people, the sin falls off the rest. Because clarifying knowledge and what people need is a communal obligation; if performed by enough people, the sin falls off the rest.\nThe evidence that it is an obligation is the saying of Allah Almighty: {And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\"} (1). So clarifying knowledge and spreading it is obligatory upon scholars and students of knowledge. For a layperson, deriving the ruling for such contemporary issues based on what came in the Book of Allah and the Sunnah of His Messenger (peace be upon him) and what the scholars (may Allah have mercy on them) mentioned might not be done well. It was made a communal obligation because this action relates to the deed and not the doer. We have previously clarified in the Fiqh Maxims the difference between communal obligation and individual obligation; that if the matter relates to the doer, it is an individual obligation, and if it relates to the deed, it is a communal obligation. This relates to the deed, meaning the acquisition of this deed is required whether from this person or from others.\n\n**Importance of Studying Contemporary Issues**\nStudying contemporary issues has importance. Among its importance:\nFirst: Clarifying the perfection of Sharia and that it is valid for every time and place. There is no contemporary issue except that it has a ruling in Sharia; the explanation of that came in the Book of Allah and the Sunnah of His Messenger (peace be upon him), known and recognized by those firm in knowledge. The evidence for that is: The saying of Allah Almighty: {This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion} (2). And He Almighty said: {And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims} (3). And Abu Dharr (may Allah be pleased with him) said: \"The Messenger of Allah (peace be upon him) left us while there was no bird flapping its wings in the sky except that he mentioned to us knowledge about it\" (4).",
    "foot_note": "1. (1) Al-Imran 187 \n2. Al-Ma'idah 3 \n3. Al-Nahl 89 \n4. Narrated by Ahmad and Al-Tabarani",
    "book_id": "945",
    "new_page_number": 5
  },
  {
    "serial_number": "4635829",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "And it was said to Salman Al-Farisi (may Allah be pleased with him): Did your Messenger teach you everything, even defecation? He said: Yes\" (1). Meaning even what relates to the etiquette of relieving oneself, the Sharia came clarifying these verbal and practical etiquettes.\nSecond: Responding to the command of Allah and the command of the Messenger (peace be upon him), for studying these contemporary issues is part of conveying knowledge and acting upon it. Conveying knowledge is commanded by Allah and commanded by His Messenger (peace be upon him) in his Sunnah. Allah Almighty said: {And say, \"My Lord, increase me in knowledge.\"} (2). And He Almighty said: {Say, \"Are those who know equal to those who do not know?\"} (3). And He Almighty said: {Allah will raise those who have believed among you and those who were given knowledge, by degrees.} (4). The Sunnah is very abundant, including: The saying of the Prophet (peace be upon him): \"Whoever travels a path seeking knowledge, Allah makes easy for him a path to Paradise\" (5). And also the saying of the Prophet (peace be upon him): \"Whoever goes out seeking knowledge is in the path of Allah until he returns\" (6).\nThird: Worshipping Allah Almighty by studying these contemporary issues, because studying them is learning and teaching knowledge, and knowledge is among the best acts of worship and greatest good deeds. So addressing such issues is worship of Allah Almighty for which a person is rewarded.\nFourth: Earning reward and recompense from Allah Almighty, because the scholar and Mujtahid, if he exerts his effort and view in learning the ruling of this issue and what its ruling is, there is reward and recompense from Allah Almighty in this. In the Hadith, the Prophet (peace be upon him) said: \"If a judge makes a judgment and strives and is correct, he has two rewards. And if he strives and errs, he has one reward.\" Agreed upon.",
    "foot_note": "1. (1) Narrated by Muslim, Abu Dawood, and Al-Tirmidhi \n2. Ta-Ha 114 \n3. Al-Zumar 9 \n4. Al-Mujadila 11 \n5. Narrated by Ahmad, Muslim, Abu Dawood, Al-Tirmidhi, and Ibn Asakir \n6. Narrated by Al-Tirmidhi and said it is a Hasan Hadith from the narration of Anas",
    "book_id": "945",
    "new_page_number": 6
  },
  {
    "serial_number": "4635830",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Fifth: Performing this obligation, which is a communal obligation, because as we mentioned before, learning these contemporary issues is a communal obligation. So a person undertaking to know them and clarify them to people is performing one of the obligations of Islam.\nSixth: Granting the one undertaking the study of these issues a Fiqh aptitude (Malakah Fiqhiyyah).\nThis is a part of the importance and benefits of these contemporary issues.\n\n**Contemporary Issues Related to Rulings of Purification**\nThe contemporary issues in purification, as we mentioned, are very many. Today we will mention what relates to water issues, and also mention a part of what relates to Wudu and Ghusl issues, and we will complete later, God willing.\nAmong these issues:\n**The First Issue: Water Changed by Rust.**\n**The Second Issue: Water Changed by Modern Detergents** such as: water changed by soap and other newly introduced detergents.\nSo we have these two waters:\nFirst Water: Changed by rust. It is that which changed due to passing through water pipes or due to remaining long in some vessels preserving it like tanks and pots, until its color inclined to redness. So what is the ruling of this water changed by rust regarding Wudu? Does it lift major and minor impurity (Hadath) or not? And does it remove filth (Khabath) or not?\nSimilarly regarding waters changed by modern detergents, like soap and others. If we find water changed by this soap and the like, does it lift impurity (Hadath) and remove filth (Khabath) or not?\nTo clarify the ruling of these two issues, we say: Water is divided into categories. Then after that we will derive the ruling of these two issues based on these categories mentioned by scholars, may Allah have mercy on them:\n*   **First Category: Water remaining in its original creation**, not changed by impurity nor by a pure substance that transfers it from the name of absolute water (Ma' Mutlaq) and dominates its parts, like henna, ink, or dyes. This water is purifying (Tahur) by agreement of scholars; it lifts Hadath and removes Khabath.\n    The evidence for that: The saying of Allah Almighty {And We have sent down from the sky pure water} (1).",
    "foot_note": "1. (1) Al-Furqan 48",
    "book_id": "945",
    "new_page_number": 7
  },
  {
    "serial_number": "4635831",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "And also the hadith of Abu Huraira - may Allah be pleased with him - regarding sea water, that the Prophet (peace be upon him) said: \"Its water is purifying, its dead animals are lawful.\" This hadith was narrated by Imam Ahmad, Al-Tirmidhi, Abu Dawood, Ibn Majah, and others, and its chain of narration is authentic.\n*   **Second Category: Water changed by impurity**, its taste changed, or its color changed, or its smell changed. We say this is impure (Najis) water by agreement of scholars.\n    The evidence for that: The hadith of Abu Sa'id (may Allah be pleased with him) that the Prophet (peace be upon him) said: \"Water is purifying, nothing makes it impure\" (1). The Prophet's judgment that water is purifying is exited from this purifying nature by consensus of scholars; for scholars agree that if water is changed by impurity—its taste, smell, or color changes—it is impure; it does not lift Hadath nor remove Khabath.\n*   **Third Category: Water changed by something that is usually inseparable from water.** Meaning changed by something accompanying water usually. We say this, by agreement of Imams also, does not strip it of its purifying nature; it lifts Hadath and removes Khabath. This is like water changed by staying for a long time; this is usually inseparable from water, so we say it lifts Hadath and removes Khabath. Water changed by trees existing in it or weeds growing in it; this is usually inseparable from water, so we say it does not strip it of its purifying nature; it lifts Hadath and removes Khabath. Water changed by fish existing in it... etc. Water changed by falling leaves. Water changed by what winds throw into it or floods carry to it... etc.",
    "foot_note": "1. (1) Narrated by Ahmad, Abu Dawood, Al-Tirmidhi, and Al-Nasa'i",
    "book_id": "945",
    "new_page_number": 8
  },
  {
    "serial_number": "4635832",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "*   **Fourth Category: Water changed by soil (Turab).** This is also by agreement of Imams considered purifying; it lifts Hadath and removes Khabath. Because soil is a substitute for water, and soil is one of the two purifiers and is a purifier like water. That is why Allah Almighty said regarding soil when mentioning Tayammum: {Allah does not intend to make difficulty for you, but He intends to purify you} (1). And in the authentic hadith of Abu Dharr, the Prophet (peace be upon him) said: \"Clean earth is the Wudu of a Muslim even if he does not find water for ten years\" (2). So if we have water changed by soil—soil was put in it, or for example a person found a pond in the desert and moved his feet in it until it became red—we say this lifts Hadath and removes Khabath. This is by agreement of Imams, and we mentioned the evidence for that. Unless this water becomes mud, meaning it becomes mud that does not flow over the limbs; in this case, they said it does not lift Hadath nor remove Khabath. But if it is changed by this soil [while still water], they said this does not harm, and it lifts Hadath and removes Khabath.\n*   **Fifth Category: Water changed by a pure substance.** For example, changed by henna, or some ink was put in it, or some dyes, or some tea... etc. This changed by a pure substance. This water has details, although there is disagreement among scholars, may Allah have mercy on them. What concerns us is the preponderant opinion in this issue. We say: Water changed by a pure substance, if it strips it of the name of absolute water and dominates its parts, then it transfers from being purifying. We do not say it is purifying that lifts Hadath. But regarding removing Khabath, we say this is another thing, because removing Khabath is broader than lifting Hadath as we will explain, God willing.\n\n**First Issue:** Our water changed by rust, which of these categories is it?",
    "foot_note": "1. (1) Al-Ma'idah 6 \n2. Narrated by Al-Tirmidhi, as well as Abu Dawood, Al-Nasa'i, Al-Daraqutni, Al-Hakim, Ahmad, and others from the hadith of Abu Dharr. Al-Tirmidhi said: \"Hasan Sahih Hadith\"",
    "book_id": "945",
    "new_page_number": 9
  },
  {
    "serial_number": "4635833",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "We say that water changed by rust belongs to the category of water changed by something inseparable from it. As we said, water changed by a matter inseparable from it usually, accompanying water usually, is purifying by agreement of Imams. Based on this, we say that water changed by rust: changed by pipe rust, tank rust, or pot rust and the like, we say this is purifying water by agreement of Imams; it lifts Hadath and removes Khabath.\n\n**Second Issue: Water changed by soap and the like... etc.**\nThis, we say, takes the ruling of the Fifth Category. If this soap by which water changed is a small amount such that it does not change the water [significantly]—does not strip it of the name of absolute water and does not dominate its parts—then we say it is also purifying; it lifts Hadath and removes Khabath. But if this changing agent stripped it of the name of absolute water and dominated its parts, we say it does not lift Hadath. As for removing Khabath, it does remove Khabath as we will explain, God willing.\nThe Hanafis are the broadest of schools in this issue, meaning regarding lifting Hadath and removing Khabath. They view that water changed by some detergents like soap and other powders existing now... etc., even if it dominates its parts and even if it transfers it from the name of absolute water, they say this lifts Hadath and removes Khabath.\nRegarding removing Khabath, water changed by rust also removes Khabath by agreement of Imams.\n\n**Issue: Is water a condition for removing Khabath, or do we say Khabath is removed by any remover?**\nThere are two opinions of scholars, may Allah have mercy on them:\n**First Opinion:** Water is a condition for removing Khabath. This is said by most scholars from the Shafi'is, Malikis, and Hanbalis.\nTheir evidences:\nAmong them: The hadith of Anas and Abu Huraira in the story of the Bedouin urinating in the mosque: \"That the Prophet (peace be upon him) called for a bucket of water and poured it over it\" (Agreed upon).\nAmong them: The hadith of Asma' (may Allah be pleased with her) regarding menstruation blood, containing the Prophet's saying: \"...scrape it off, then rub it with water, then rinse it, then pray in it\" (Agreed upon).\nAnd other evidences of theirs.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 10
  },
  {
    "serial_number": "4635834",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "**Second Opinion:** Water is not a condition for removing Khabath (filth). This is the view of the Hanafis and the choice of Sheikh al-Islam (Ibn Taymiyyah), may Allah have mercy on him.\nTheir evidences:\nAmong them: All evidences of Istijmar (cleaning with stones), because the one doing Istijmar wipes the impurity by wiping and does not remove it with water; he wipes it with cloth, soil, stones... etc., and does not remove it with water.\nAmong them: What is confirmed in Sahih Al-Bukhari (1) from Aisha (may Allah be pleased with her) that she said: \"One of us would have only one garment in which she menstruated. If some menstrual blood got on it, she would wet it with her saliva like this and scratch it off with her fingernail.\"\nAmong them: The hadith of Abu Sa'id regarding the purification of shoes, that if a person wants to enter the mosque and there is harm (filth) on his shoes, he rubs them with soil; \"Soil is their purifier\" (2).\nAmong them: The hadith of Umm Salamah—though it has weakness—regarding a woman's hem dragging as she goes to the market. The Prophet (peace be upon him) said: \"What comes after it purifies it\" (3).\n**Preponderance:** That water is not a condition for removing Khabath, and this opinion is the correct one.",
    "foot_note": "1. (1) Chapter: Can a woman pray in a garment in which she menstruated?\n2. Narrated by Abu Dawood in the Book of Prayer, \"Chapter: Praying in Shoes\", from Musa bin Ismail from Hammad bin Zayd from Abu Na'amah Al-Sa'di from Abu Nadrah from Al-Khudri who said: While the Messenger of Allah (peace be upon him) was praying with his companions, he took off his shoes and placed them to his left. When the people saw that, they threw off their shoes. When the Messenger of Allah (peace be upon him) finished his prayer, he said: \"What made you throw off your shoes?\" They said: \"We saw you throw off your shoes, so we threw off ours.\" The Messenger of Allah (peace be upon him) said: \"Gabriel came to me and informed me that there was filth on them.\" And he said: \"If one of you comes to the mosque, let him look; if he sees filth or harm on his shoes, let him wipe it and pray in them.\" Also narrated by Ibn Hibban in his \"Sahih\".\n3. Narrated by Malik, Ahmad, Al-Tirmidhi, Abu Dawood, and Al-Darimi.",
    "book_id": "945",
    "new_page_number": 11
  },
  {
    "serial_number": "4635835",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Based on this, we say this water changed by these detergents, soap or otherwise, if it dominated the parts of the water, does not lift Hadath (ritual impurity), but it removes Khabath (physical filth). Also, we say regarding other things that are not water, such as gasoline, gas, etc., that these things do not lift Hadath but they remove Khabath.\n\n**The Third Issue: Dry Cleaning.**\nDry cleaning is the removal of impurity and dirt using a liquid remover other than water, along with the use of water vapor. This dry cleaning is usually and mostly resorted to for clothes that are affected by water, meaning water spoils them. Sheikh al-Islam and others have stated regarding things that if contaminated and using water harms them, that wiping is sufficient for them, such as banknotes, or papers and documents hit by impurity; if you go and wash them with water, they get spoiled. Sheikh al-Islam gave the example of silk garments; if washed, it would lead to their spoilage. He says wiping is sufficient for these. So anything that if contaminated, washing it with water leads to its damage, spoilage, or harm... etc., wiping is sufficient. Now, something other than wiping exists; dry cleaning or steam laundries exist now. According to the previous issue we mentioned, which is that impurity is purified by any purifier, we say this issue applies, and we say the ruling revolves with its cause (Illah) in existence and non-existence. The cause is the harm (filth); if the harm exists, the ruling remains, and if the harm is negated by any remover, the ruling is negated.\n\n**The Fourth Issue: Artificial Dental Fixtures or Dentures.**\nSome people have artificial teeth they install, or some teeth they install, and these teeth are removable. Is it obligatory upon him if he wants to perform Wudu or Ghusl to remove these removable teeth or not?\nThe famous view of the Hanbali school, may Allah have mercy on them, is that rinsing the mouth (Madmadah) and sniffing water into the nose (Istinshaq) are both obligatory and Fard in Wudu and Ghusl. This is one of the unique views of the Hanbali school.\nThe Hanafis say that Madmadah and Istinshaq are Fard in Ghusl but not in Wudu.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 12
  },
  {
    "serial_number": "4635836",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Shafi'is and Malikis say: Madmadah and Istinshaq are two Sunnahs in Wudu and Ghusl. So according to the opinion of the Shafi'is and Malikis, it is not obligatory because they fundamentally see that Madmadah and Istinshaq are each Sunnah. But we remain with the Hanbali school; they see that Madmadah and Istinshaq are both obligatory and Fard in Wudu and Ghusl.\nThe preponderant of these opinions is the Hanbali school, that Madmadah and Istinshaq are both obligatory and Fard in Wudu and Ghusl.\nThe evidence for that from the Quran: Allah Almighty said: {O you who have believed, when you rise to [perform] prayer, wash your faces} (1). The nose is part of the face; no one says the nose is not part of the face. The mouth is also part of the face, even if it is a cavity, it is under the ruling of the exterior. That is why if a person rinses his mouth, his fasting is not broken. Also, the hadith of Abu Huraira in the two Sahihs that the Prophet (peace be upon him) said: \"Then let him put water in his nose then blow it out.\" This is a command, and the default in command is obligation. And in the hadith of Safwan, though it has weakness: \"If you perform Wudu, then rinse your mouth...\". Also, those who described the Wudu of the Prophet (peace be upon him), nearly twenty-two companions, did not mention that the Prophet (peace be upon him) omitted Madmadah and Istinshaq.\nBased on this, it remains with us that Madmadah and Istinshaq are obligatory. So, is it obligatory on a person to remove these things [dentures] or not?\nThe Shafi'is stated that if a person's nose is cut off and he then takes a nose made of gold, as the Prophet (peace be upon him) guided Arfajah bin As'ad when his nose was cut off on the Day of Al-Kulab; he took a nose of silver but it rotted on him, so the Prophet (peace be upon him) guided him to take a nose of gold (2).",
    "foot_note": "1. (1) Al-Ma'idah 6 \n2. Narrated by Abu Dawood (4233, 4234), Al-Nasa'i (2 / 286), Al-Tirmidhi (1 / 328), Al-Tahawi in \"Sharh Al-Ma'ani\" (2 / 349), Al-Bayhaqi (2 / 425), and Ahmad (5 / 25).",
    "book_id": "945",
    "new_page_number": 13
  },
  {
    "serial_number": "4635837",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "The Shafi'is stated that if he takes a nose of gold, this nose takes the ruling of the original nose, so he does not have to remove it but washes it with the face. They also stated that if a person's fingertip is cut off and he takes a gold fingertip instead, he does not have to remove it during Ghusl, and this fingertip is like the original; he washes it.\nBased on this, we say the correct view in this issue is: Dentures or artificial teeth do not have to be removed by a person if he wants Wudu or Ghusl. The evidence for this is two proofs:\n1.  The hadith of Arfajah bin As'ad (may Allah be pleased with him) \"that the Prophet (peace be upon him) ordered him to take a nose of gold\" (1). This nose would block some of the water contact areas, yet the Prophet (peace be upon him) did not order him to remove this nose during Wudu or Ghusl.\n2.  A person is permitted or prescribed to wear a ring, yet it was not reported that he must take off the ring or move it, even though the ring might block some water. The Prophet (peace be upon him) also wore a ring (2), yet it was not reported that the Prophet (peace be upon him) used to move his ring—that was not established—or that he used to take off his ring. Since that was not reported, it indicates that such things are excused. The ring blocks part of the finger, so this is excused. We say such a fixture [denture], even if removable, taking it off might involve some hardship. So we say it is not removed or moved. Just as the ring which is permitted or prescribed for a person to wear does not have to be removed, so too dentures do not have to be removed.\n\n**The Fifth Issue: Painting Nails with Chemical Substances (Nail Polish).**\nThis issue, although clear, I mentioned because some Muftis stated that it takes the ruling of Khuff (leather socks) and that it is okay for a woman to wipe over it for a day and a night.",
    "foot_note": "1. (1) Previous sources \n2. Hadith \"That he (peace be upon him) wore a ring of silver\" Agreed upon",
    "book_id": "945",
    "new_page_number": 14
  },
  {
    "serial_number": "4635838",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "This polish, although it has some harm, if a woman puts on such things at the time of Wudu or Ghusl, this is forbidden and impermissible because encompassing the limb with washing is obligatory. The Imams (Hanafi, Maliki, Shafi'i, and Hanbali) all agree that one of the conditions for the validity of Wudu is removing what prevents water from reaching the skin.\nThe evidence for that: The saying of Allah Almighty: {O you who have believed, when you rise to [perform] prayer, wash your faces and your hands to the elbows and wipe over your heads and wash your feet to the ankles} (1). Allah Almighty commanded washing the hand, which includes the entire hand, and commanded washing the two feet, which includes the entire feet, even the nails. Whoever adopts this barrier (nail polish) which prevents water from reaching the skin or nail... etc., has not washed the entire hand and has not complied with the command.\nThe hadith of Aisha and Abdullah bin Amr and others that the Prophet (peace be upon him) said: \"Woe to the heels from the Fire\" (2). Heels is the plural of heel, which is the back of the foot. The Prophet (peace be upon him) threatened it with Woe because it is common that people are negligent about such things and do not pay attention to them. This indicates that the foot must be washed completely, and Wudu must be performed thoroughly as obligated.\nWe conclude from this that adopting such things that prevent water from reaching the nail at the time of Wudu or Ghusl is forbidden and impermissible, and Wudu and Ghusl are not valid with it. Even if a woman forgot and bathed, we say her Ghusl is invalid and she must remove such things and then repeat the Ghusl again. Unless she remembered immediately after the Ghusl such that the interval was not long and she was able to remove these things, then it suffices to wash the spot that water did not reach, because order (Tartib) is not obligatory in Ghusl, but continuity (Muwalat) is obligatory according to the correct view, and continuity here has been rectified.\n\n**The Sixth Issue: Artificial Nail Fixtures.**",
    "foot_note": "1. (1) Al-Ma'idah 6 \n2. Agreed upon",
    "book_id": "945",
    "new_page_number": 15
  },
  {
    "serial_number": "4635839",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "It is a type of plastic nails resembling natural nails. A woman takes them, paints them with various dyes, then places them on her nail or glues them to her nail with an adhesive substance.\nThese nails have the same ruling as the aforementioned chemical dyes (nail polish). We say adopting them at the time of Wudu and Ghusl is forbidden and impermissible because, as we mentioned, they prevent water from reaching the nail. It was mentioned earlier that all Imams agree that one of the conditions for the validity of Wudu is removing what prevents water from reaching the skin, such as mud or dough... etc.\nMoreover, adopting such nails appears, and Allah knows best, to be forbidden and impermissible because the Lawgiver commanded trimming the nails, as in the hadith of Abu Huraira in the two Sahihs that the Prophet (peace be upon him) said: (Five are from the Fitra: Circumcision, shaving pubic hair, plucking armpit hair, trimming nails, and trimming the moustache) (1).\nScholars, may Allah have mercy on them, stated that taking these Sunan has three timings:\nFirst Time: Time of recommendation, which is when these things grow long. If they grow long, it is recommended for a person to take them.\nSecond Time: Time of dislike (Karahah), which is if they exceed forty days. If they exceed forty days, it is disliked for a person to leave them. That is why in the hadith of Anas (may Allah be pleased with him), he said: \"A time limit was set for us in trimming the moustache, trimming nails, plucking armpit hair, and shaving pubic hair, that they should not be left for more than forty nights\" (2).\nThird Time: If they grow long and become grotesque, then this is forbidden and impermissible. Meaning if he leaves his moustache until it becomes long and grotesque, or leaves his nails until they become long and grotesque, or leaves armpit hair or pubic hair... etc., then this is forbidden and impermissible for two reasons:\n1- Because of the resemblance to predatory animals and beasts.\n2- Because of the resemblance to the people of disbelief and polytheism.\n\n**The Seventh Issue: Hair Dyes.**\nFrom inductive reasoning, it is noted that the type of dyes women use falls into three categories:",
    "foot_note": "1. (1) Narrated by Al-Bukhari and Muslim \n2. Narrated by Muslim and Ibn Majah, and narrated by Ahmad, Al-Tirmidhi, Al-Nasa'i, and Abu Dawood",
    "book_id": "945",
    "new_page_number": 16
  },
  {
    "serial_number": "4635840",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "First Category: Plant dyes, like henna.\nSecond Category: Mineral dyes. These mineral dyes consist of metallic compounds containing sulfur, lead, or copper.\nThird Category: Hair bleaches or lighteners. These are done using peroxide or hydrogen peroxide. This leads to breaking down the melanin pigment found in the outer cortex of the hair, turning the hair white or yellow, then it is dyed again according to what the woman wants.\nThis is the first classification regarding the type of dyes.\nThe second classification regarding the Sharia ruling: We say in terms of Sharia ruling, these dyes are divided into two categories:\nFirst Category: Dyes that are merely color. This is the case for most of these dyes, meaning plant dyes like henna and the like, and also many of the dyes existing today. These are merely color that does not form a mass on the hair nor an insulating layer. We say using these regarding Wudu and Ghusl is permissible and there is no harm in it because such things do not prevent water from reaching; they are merely color coating the hair with another color.\nSecond Category: That this dye has a mass and layer preventing water from reaching the hair such that the hair becomes thick, which is rare. Using this is not permissible because its period lasts long and a woman needs Ghusl for major impurity like Janabah and menstruation and the like.\n\n**The Eighth Issue: Artificial Eyelashes.**\nArtificial eyelashes: Consist of thin hairs made from plastic materials glued to the eyelid by an adhesive placed on the edge of the upper eyelash.\nThese artificial eyelashes, upon examination and placing in water... etc., are found to decompose. Also, they have openings from the bottom side that do not prevent water from reaching inside the hairs (cilia). If so, meaning these eyelashes if water is put on them and the woman performs Wudu or Ghusl, it is observed that they decompose. Also, they have openings from inside that do not prevent water from reaching the eyelash of the eye.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 17
  },
  {
    "serial_number": "4635841",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "If this is the case, we say these things do not prevent water from reaching any of the organs that must be washed. So regarding Wudu and Ghusl, we say the woman's Wudu is valid and also her Ghusl is valid.\nBut the question remains: Is using such eyelashes permissible or not permissible? We say what appears to be the case, and Allah knows best, is that using such eyelashes is not permissible because these artificial eyelashes are placed on natural eyelashes. It is noted that such things are a type of hair extension (Wasl), and the Prophet (peace be upon him) \"cursed the woman who joins hair and the one who asks for it to be joined\" (1).\nThe Wasilah (hair joiner): Is the one who joins hair with other hair or what resembles it.\nJoining hair is divided into three categories:\nFirst Category: Joining hair with other hair. This is forbidden.\nSecond Category: Joining hair with something other than hair, like hair made of plastic but it is like hair or close to it in form and shape... etc. This is a subject of disagreement, and what appears, and Allah knows best, is that it is not permissible.\nThird Category: Joining hair with something else that is not like hair, far from it, does not resemble or look like it, such as joining it with rags and the like, such that if you see it you don't say it is hair. We say this is permissible and there is no harm in it.\nIt appears, and Allah knows best, that using these artificial eyelashes is not permissible, not because of Wudu and Ghusl, but because it falls under hair extension (Wasl) since the cause (Illah), which is deception (Zur), for which the Prophet (peace be upon him) gave the ruling, exists here.",
    "foot_note": "1. (1) From Ibn Umar (may Allah be pleased with them both): \"The Prophet (peace be upon him) cursed the woman who joins hair (Al-Wasilah) and the one who asks for it to be joined (Al-Mustawsilah), and the woman who tattoos (Al-Washimah) and the one who asks to be tattooed (Al-Mustawshimah).\" Agreed upon.",
    "book_id": "945",
    "new_page_number": 18
  },
  {
    "serial_number": "4635842",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Similar to that also is what is found now in some hair clips for women where hair is present in them. The fact that this woman puts this clip which has hair in it, we say regarding Wudu and Ghusl, it appears this does not affect it. Also, some women stuff their hair with other hair; we also say regarding Wudu and Ghusl it does not affect, because water is a thin liquid that permeates such things. But the issue of Wasl (hair extension) remains, and this is what affects the use of such things.\n\n**The Ninth Issue: Use of Greases, Creams, and Powders.**\nWe say that this issue is divided into two categories:\nFirst Category: That these greases, creams, and powders form merely a color, moisture, or greasiness, like the dyes a woman puts on her face or the creams or greases a woman anoints her body with. We say that these things which are merely greasiness, moisture, or mere color do not prevent water from reaching the skin. Using them does not affect Wudu and does not affect Ghusl. Evidence for this is that water permeates these things. Also, using kohl is commanded in Sharia, using henna is also commanded, dyeing for women... etc.\nSecond Category: That such things form a dense greasy layer or a waxy layer, such that you find this grease accumulated on the body not just painted. We say this prevents water from reaching the skin.\nSimilar to that also is what is called today 'Liquid Eyeliner' which a woman applies. This liquid eyeliner is divided into two types:\n1: Eyeliner that forms a plastic substance preventing water from reaching the skin; this is not permissible.\n2: Eyeliner that dissolves with water and falls off; this does not affect Wudu or Ghusl.\n\n**The Tenth Issue: Catheterization and similarly what is called Artificial Anus (Colostomy) and their effect on purification.**",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 19
  },
  {
    "serial_number": "4635843",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Catheterization: Is placing a catheter (plastic tube) in the patient's urethra to cause urine discharge without the patient's will. This urine collects in a bag hung in the place where the patient sleeps. The doctor resorts to placing this catheter for the patient: either because the patient cannot urinate naturally or because it is difficult for the patient to go to the toilet. The urine is in a bag next to the patient.\nAs for Artificial Anus (Colostomy): It is when a patient is afflicted with colon cancer such that he cannot defecate naturally, or the patient has congenital deformities preventing natural defecation. So the doctor resorts to opening a hole in the abdominal wall to facilitate the exit of stool without the patient's will through a tube. There is a container where this stool collects, removed periodically.\nWhat is the effect of this urine on the patient's purity and also on his prayer? And also the exit of this stool on the patient's purity and on his prayer?\nThis issue builds upon a matter discussed by scholars, may Allah have mercy on them, which is the person with permanent Hadath (incontinence) (whose Hadath is permanent for his obligation). Is Wudu obligatory on him or not? And if we say Wudu is obligatory, must he perform Wudu for the time of every prayer or must he perform Wudu for every prayer?\nThis issue is a subject of disagreement among scholars, may Allah have mercy on them. Scholars have three opinions on this:\nFirst Opinion: The strictest of schools, which is the Shafi'i school. They say that the one whose Hadath is permanent must perform Wudu for every obligatory prayer. If he performs Wudu for this obligatory prayer, he can pray with this Wudu whatever he wishes of obligatory and voluntary prayers. If he wants to pray another obligatory prayer, he performs Wudu again.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 20
  },
  {
    "serial_number": "4635844",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Second Opinion: The Hanafi and Hanbali schools said he does not have to perform Wudu for every prayer, but rather he must perform Wudu for the time of every prayer. They said he must perform Wudu when the time enters and pray whatever he wishes of obligatory and voluntary prayers. When the time for the second prayer comes, he must perform Wudu and pray whatever he wishes of obligatory and voluntary prayers.\nThird Opinion: The Maliki school, which is the choice of Sheikh al-Islam (Ibn Taymiyyah), may Allah have mercy on him. It is the broadest of schools in this issue. They said that the one from whom permanent Hadath exits does not have to perform Wudu for every prayer, and Wudu is not invalidated unless another Hadath other than this permanent Hadath exits from him, then he must perform Wudu. For example, this patient from whom urine exits permanently does not have to perform Wudu, but if wind exits from him, he must perform Wudu for this wind, or if stool exits from him, he performs Wudu for this stool.\nThey excluded from this a case: If the occurrence of the Hadath during the time is a minor matter, meaning most of the time nothing exits from him and it exits from him in a short time, here they said Wudu is obligatory.\nThe closest of schools is the Maliki school, may Allah have mercy on them. The evidence for that is: The hadith of Aisha (may Allah be pleased with her) said: Fatima bint Abi Hubaysh came to the Prophet (peace be upon him) and said: O Messenger of Allah, I am a woman who experiences Istihadah (irregular bleeding) and I do not become pure; should I leave prayer? The Messenger of Allah (peace be upon him) said: \"No, that is a vein and not menstruation. When your menstruation comes, leave prayer, and when it goes, wash the blood from yourself then pray\" (1).\nThe Prophet (peace be upon him) did not order the woman with Istihadah to perform Wudu for every prayer. He only guided her to observe menstruation rules during the time of her menstruation only. When the time of menstruation ends, she bathes and prays. Apart from that, it is not obligatory on her.\nAs for what is narrated of his saying (peace be upon him): \"Perform Wudu for every prayer\", this phrase is interpolated and not established from the Prophet (peace be upon him).\nIf we know that, we say this person from whom urine exits permanently does not have to perform Wudu until another Hadath other than this urine occurs.",
    "foot_note": "1. (1) Agreed upon",
    "book_id": "945",
    "new_page_number": 21
  },
  {
    "serial_number": "4635845",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Similarly, this person who has a natural opening [colostomy], if the exit of stool is continuous, he does not have to perform Wudu for it until another Hadath other than this accidental Hadath occurs. If the exit of this stool is not continuous but is a habitual matter, like people's habit exiting once or twice a day, then he must perform Wudu for the exit of this stool.\n\n**The Eleventh Issue: Kidney Dialysis and its Effect on Purification.**\nKidney failure diseases are considered among the prevalent diseases in our present time. The kidneys perform a major function in the human body; they purify the blood from toxins, liquid wastes, and excess salts. If a person falls ill with this disease and his kidneys fail, this is a dangerous disease threatening his life, and failure to remedy the kidney function leads to the patient's death.\nWith the development of medicine and its advancement, what is called kidney dialysis appeared in our present time. Kidney dialysis is divided into two types:\nFirst Type: Hemodialysis or blood purification. This is the most common in our present time.\nHemodialysis method: The doctor withdraws the patient's blood through a needle placed in one of the veins. Then this blood passes through a machine that cleans it of toxins, liquid wastes, and excess salts, acting as a natural kidney. During its operation, some medicines, treatments, and nutrients needed by the patient are added to this machine.\nThis procedure takes place three or four times a week, and each session is estimated at approximately three or four hours depending on the patient's need.\nNow, does the exit of this blood and then its reentry into the body after purification invalidate Wudu or does it not invalidate Wudu?\nThis is a disputed issue among scholars, may Allah have mercy on them. Does bleeding invalidate Wudu or not?\nFirst Opinion: The view of the Malikis and Shafi'is, and the choice of Sheikh al-Islam Ibn Taymiyyah. They said that bleeding does not invalidate Wudu, whether the amount is small or large.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 22
  },
  {
    "serial_number": "4635846",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Second Opinion: The Hanbali school differentiates in this issue. They said if the blood exiting is much, it invalidates Wudu, and if it is little, it does not invalidate Wudu.\nThird Opinion: The Hanafi school said if it exits and flows, it invalidates. If it exits and pools without flowing, they said this does not invalidate.\nThe correct view in this issue: It is what the Malikis and Shafi'is went to, which is that blood exiting from the human body is not invalidating. The evidence for that: The hadith of Jabir bin Abdullah (may Allah be pleased with him) in the story of the Ansari whom the Prophet (peace be upon him) sent with one of the Muhajireen to be a guard at the mouth of the valley. One of the polytheists hit him with an arrow three times, and blood came out of him, yet he did not cut his prayer but continued his prayer while blood was gushing from him. This hadith was narrated by Ahmad and Abu Dawood, and authenticated by Ibn Hibban, Ibn Khuzaimah, and others. Blood came out of him, yet he continued his prayer. If bleeding invalidated Wudu, he would not have continued his prayer.\nAlso, Umar (may Allah be pleased with him), as in Sahih Al-Bukhari, prayed while his wound was gushing blood (1).\nAlso, it was reported from Ibn Abbas (may Allah be pleased with him) that he said regarding Cupping (Hijama), meaning if a person gets cupped: \"Wash your cupping places and that suffices you.\" Narrated by Al-Bayhaqi and its chain has weakness.\nAlso, it was reported from Ibn Umar (may Allah be pleased with them both) suspended in Sahih Al-Bukhari that he squeezed a pimple on his face and some blood came out, yet he did not perform Wudu.\nAlso, this is supported by the principle (Asl) which is that the original state is the continuation of purity, so we do not move from this principle except with evidence indicating that.",
    "foot_note": "1. (1) Narrated by Malik (1 / 39 / 51), and similarly by Ibn Sa'd in \"Al-Tabaqat\" (3 / 350), Ibn Abi Shaybah in \"Al-Iman\" (190 / 1), Al-Daraqutni in his Sunan (p. 81), Ibn Asakir (13 / 85 / 2), and Al-Bayhaqi (1 / 357).",
    "book_id": "945",
    "new_page_number": 23
  },
  {
    "serial_number": "4635847",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Based on this, we say that whoever undergoes this kidney dialysis, which is called Hemodialysis or Blood Purification, the exit of this blood from him then its purification then its return to the body again does not affect Wudu, and he does not have to perform Wudu.\nSecond Type: Peritoneal Dialysis: It is a tube placed in the patient's abdominal cavity. This tube is placed between the navel and the pubis. The patient is given some fluids and special medicines that help the body get rid of toxins, liquid wastes, and excess salts. Then these toxins, liquid wastes, and excess salts remain collecting in this tube for nearly eight hours while the patient goes about his normal life activities. Then after collection, the patient empties this tube into an external bag, then this bag is sent and another bag is brought... etc. The patient uses this method approximately three times a day according to his need.\nSome researchers mentioned that whoever uses Peritoneal Dialysis usually dispenses with natural urination, and this process replaces natural urination.\nJurists discussed this issue under the case: If the original outlet is blocked and another unusual accidental outlet opens, does it take the ruling of the original outlet or not?\nThis issue is a subject of disagreement among scholars, may Allah have mercy on them:\nFirst Opinion: The famous view of the Hanbali school, may Allah have mercy on them, is differentiation regarding what exits. They said: If what exits is much blood, it invalidates Wudu. If it is little, it does not invalidate Wudu. If what exits is urine or stool, it invalidates whether little or much. As we mentioned in Hemodialysis, the correct view is that bleeding does not invalidate Wudu.\nSecond Opinion: The Shafi'is said that the exit of these things does not invalidate unless their exit is from below the navel.\nThird Opinion: The Hanafis said that the exit of these things invalidates, and they did not differentiate.\nEssentially, what exits is divided into two categories:",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 24
  },
  {
    "serial_number": "4635848",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "1 - If it is blood, this does not invalidate.\n2 - Or it is other than blood, like urine or stool or what has the characteristics of urine or stool, as in Peritoneal Dialysis. Because Peritoneal Dialysis has the characteristic of urine as it contains toxins, wastes... etc. that are in urine.\nSo regarding Peritoneal Dialysis: The Hanbali and Hanafi schools hold that it invalidates. The Shafi'i school differentiates: If it is below the navel, it invalidates; if it is above the navel, it does not invalidate.\nThe closest view in this issue: Peritoneal Dialysis invalidates Wudu because this discharge does not take the ruling of blood, but takes the ruling of urine because it has the characteristics of urine such as wastes, salts, toxins... etc. So we say such a thing invalidates Wudu, unless it is something continuous, but it is not continuous, so it takes the ruling of incontinence (Salas).\nThe conclusion on that: Peritoneal Dialysis invalidates [Wudu], while Hemodialysis, which is taking out blood, purifying it, then returning it, does not invalidate.\n\n**The Twelfth Issue: Purification of Sewage Water.**\nAnd the ruling on using this purified sewage water for drinking or irrigating farms and green areas or recharging groundwater with such purified water.\nDefinition of Sewage: It consists of water resulting from human use of water in normal life activities such as washing, cleaning, Istinja (cleaning private parts), and the like.\nThis sewage water is forbidden to use for three reasons:\nFirst: (Impurity - Najasah) as this sewage contains much human waste.\nSecond: (Harm) as this sewage contains many toxins and many microbes.\nThird: (Filthiness - Istiqdhar) as this sewage is filthy in people's custom and habits.\nFor sewage to become pure and return to its original state, it passes through stages:\nFirst Stage: Called Pre-treatment Stage. This includes three things:\n1 – Removing floating materials and large objects like wood, iron, and plastic materials.\n2 – Removing fine sand via sedimentation.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 25
  },
  {
    "serial_number": "4635849",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "3 – Removing fats by floating them in special tanks.\nSecond Stage: Primary Treatment. It precipitates organic materials (human waste) and inorganic materials using a special sedimentation method. This is the first sedimentation stage.\nThird Stage: Biological Treatment. After this sedimentation of organic and inorganic materials, a type of aerobic bacteria is grown to feed on these sedimented materials.\nFourth Stage: Secondary Sedimentation Stage. Water retains some suspended materials after the biological stage, so another special sedimentation stage is carried out.\nFifth Stage: Tertiary Treatment Stage, called Sand Filters. This stage consists of removing the remaining suspended materials through sand filters.\nSixth Stage: Sterilization Stage. It is the final stage where this water is sterilized by injecting chlorine gas into the tanks.\nThese six stages, in terms of Sharia ruling, are divided into two parts:\n1 – Secondary Purification.\n2 – Final Purification.\nSecondary Purification: This is before the Tertiary Treatment Stage (Sand Filters), meaning after the first four stages. If applied completely according to its instructional systems, the water returns to its natural state by 95%. After the Tertiary Treatment Stage and Sand Filters, they say the water mostly returns to its original state and original creation.\nSharia Ruling regarding Secondary Purification differs according to its uses:\nFirst: Using it for drinking and purification: This is not permissible and forbidden because it has not yet become pure as long as 5% remains, and the characteristic of impurity still remains in it.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 26
  },
  {
    "serial_number": "4635850",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Second: Using it to irrigate crops and trees: This issue is based on a matter discussed by scholars, may Allah have mercy on them, which is the ruling on fertilizing plants and trees with impure things, for example with human waste or waste of animals whose meat is not eaten like donkeys...etc. What is the ruling on fertilizing plants and trees with these impure things?\nScholars, may Allah have mercy on them, differed on this issue into two opinions:\nFirst Opinion: That this is permissible and there is no harm in it. This is the saying of the majority of scholars.\nTheir evidences:\nAmong them: What is narrated from Sa'd bin Abi Waqqas (may Allah be pleased with him) \"that he used to manure his land with human excrement\" and say: \"A basket of this for two baskets\" meaning we put a basket of excrement and get two baskets of wheat or barley and the like. This narration was reported by Al-Bayhaqi and its chain is weak and not established.\nAmong them: That the original rule is permissibility, and this is what people's customs have run on, and no prohibition came in Sharia regarding it.\nSupporting their view is that impurity is purified by transformation (Istihala). Such impurities like excrement and the like transform into grains and fruits. Impurity is purified by transformation as will come to us, God willing. The saying that impurity is purified by transformation is the school of the Zahiris and the choice of Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, because this impure substance transformed from one substance to another. For example, if we had a dead animal and this carcass burned and became ash, losing the vile characteristic, we say this ash is pure and there is nothing wrong with it. So if these things become pure by transformation and no harm results from them, we say this is permissible and there is no harm in it.\nAlso, there is consensus that wine - according to the view of its impurity - becomes pure by transformation (into vinegar). Similarly, they said these things become pure by transformation.\nSecond Opinion: It is not permissible to manure crops and trees with excrement or impurities. This is the famous view of the Hanbali school.\nTheir evidence:",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 27
  },
  {
    "serial_number": "4635851",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "What is narrated from Ibn Abbas (may Allah be pleased with them both) that he said: \"We used to lease land and stipulate on them not to manure it with human excrement.\" This narration is also weak.\nThe correct view on this is that fertilizing crops and trees with excrement or impure waste is permissible and there is no harm in it due to the evidence we mentioned.\nThus it becomes clear that this sewage water in its secondary stage is okay to irrigate crops and trees with.\nThird: Using it to irrigate parks and gardens with sewage water in its secondary stage, while it has not returned to its original creation and the characteristic of impurity is still in it. This happens often. That is why you find some parks have signs stating they are irrigated with sewage water to warn people against sitting... etc.\nScholars divided this into two types:\n1- Green areas where people do not need to sit, but are for beautification. Such action is permissible and there is no harm in it because this harm does not extend to people.\n2- Gardens and parks people need to sit in. This builds on a matter scholars discussed, which is the ruling on relieving oneself in places where people sit, or in their paths, or water sources. Scholars have two opinions on this:\nFirst Opinion: Prohibition (Tahrim).\nSecond Opinion: Dislike (Karahah).\nThe correct view is that it is forbidden and not permissible. Accordingly, we say irrigating these gardens where people sit with sewage water after the secondary stage is forbidden and not permissible.\nThe evidence for that: The saying of the Prophet (peace be upon him) in the hadith of Abu Huraira (may Allah be pleased with him): \"Beware of the two cursers.\" They said: What are the two cursers, O Messenger of Allah? He said: \"The one who relieves himself in the people's path or in their shade\" (1). And Allah Almighty says: {And those who harm believing men and believing women for [something] other than what they have earned have certainly born upon themselves a slander and manifest sin} (2).",
    "foot_note": "1. (1) Narrated by Muslim. \n2. Al-Ahzab 58",
    "book_id": "945",
    "new_page_number": 28
  },
  {
    "serial_number": "4635852",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "Fourth: Using it to recharge groundwater with such water. Meaning if this water is injected into the ground and groundwater is fed with it, is this permissible or not?\nThis is a point of disagreement among contemporary scholars. The correct view is that it is permissible and there is no harm in it, because the earth and soil are purifying (Tahur) and a purifier. The evidence for that: Allah Almighty said {Allah does not intend to make difficulty for you, but He intends to purify you} (1). And the Prophet (peace be upon him) said: \"Clean earth is the Wudu of a Muslim even if he does not find water for ten years\" (2).\nAlso, a number of researchers mentioned that if this water permeates the earth, soil, and sand, it becomes purified by the permission of Allah Almighty, and this stands in place of the third stage, which is the Tertiary Treatment Stage, called Sand Filters.\nSo it is summarized for us in the Secondary Stage that using this water regarding the Sharia ruling:\nFirst: Using it for eating, drinking, and purification is forbidden and not permissible.\nSecond: Using it for irrigating trees and crops... etc. is permissible and there is no harm in it.\nThird: Using it for irrigating gardens and parks has detail: If people frequent these gardens and parks, it is forbidden and not permissible. If people do not frequent them, it is permissible and there is no harm in it.\nFourth: Recharging groundwater is permissible and there is no harm in it.\n\nThe Second Sharia Ruling regarding sewage water after the Tertiary Treatment Stage. They say water returns to its first natural state. Decisions have been issued regarding this, including decisions of the Council of Senior Scholars in the Kingdom of Saudi Arabia, that water after the Tertiary Treatment Stage, if it returns to its original creation, it is okay to use for purification, drinking, irrigating farms, recharging groundwater... etc.",
    "foot_note": "1. (1) Al-Ma'idah 6 \n2. Narrated by Al-Tirmidhi, as well as Abu Dawood, Al-Nasa'i, Al-Daraqutni, Al-Hakim, Ahmad, and others from the hadith of Abu Dharr. Al-Tirmidhi said: \"Hasan Sahih Hadith\"",
    "book_id": "945",
    "new_page_number": 29
  },
  {
    "serial_number": "4635853",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Also, the decision of the Fiqh Academy of the Muslim World League is that after the Tertiary Treatment Stage, it is okay to use it for eating, drinking, purification, etc.\n\n**The Thirteenth Issue: Organ Transplantation and Transfer and its Effect on Purification.**\nIn this issue, we will not discuss the ruling of organ transplantation or the ruling of transferring these organs because this is a separate issue. But we will discuss the ruling of this organ if transferred to this body: do we say this organ is pure or impure?\nOrgan transplantation existed in ancient times but in its primitive stages. It is confirmed that the Prophet (peace be upon him) in the Battle of Badr, when Abu Qatada (may Allah be pleased with him) was struck and his eye bulged out, the Prophet (peace be upon him) took it and returned it, and it became the better of his two eyes even though it had fallen out. This is one of the signs of the Prophet (peace be upon him).\nThe first to know organ transplantation were the ancient Egyptians through tooth transplantation. Then the Greeks and Romans took this method from them. This was in its primitive stages. Then after that, organ transplantation developed with the development of medicine and advancement of science.\nSummary regarding the Sharia ruling for organ transplantation: We say that transplanting organs or transferring them from one body to another or from the patient's body to his own body is divided into categories:\nFirst Category: That the organ is transferred for its owner: for example, transferring bone from one place to another in the body, or skin transferring from one place to another in the same body, or that an organ is severed and falls off like a finger getting cut off or a hand then returned and implanted in the body.\nWe say that this organ transferred from one place to another in the same body, the four Imams all agree that it is pure.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 30
  },
  {
    "serial_number": "4635854",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Second Category: That this skin or bone is transferred from another human, not from the patient himself. For example, we took from the skin of this person and put it in this person, or from his bone... etc. This is also, according to the majority of scholars, a pure organ. This issue builds upon a question: Is the human being pure or not pure? Also his organs and what separated from him, because what is severed from the living is like its dead (carrion). So is the dead human pure? Is there a difference between Muslim and disbeliever?\nWe say:\nFirst: The living Muslim is pure by agreement. Evidence for that: The saying of the Prophet (peace be upon him) in the hadith of Abu Huraira (may Allah be pleased with him): \"Indeed, the believer does not become impure\" (Agreed upon).\nSecond: As for the living disbeliever, is he pure or impure? There are two opinions for scholars:\nFirst Opinion: He is pure. This is the opinion of the majority of scholars.\nTheir evidence: Allah Almighty permitted Muslims to marry women of the People of the Book and permitted their slaughtered animals. Allah Almighty said: {This day [all] good foods have been made lawful, and the food of those who were given the Scripture is lawful for you and your food is lawful for them. And [lawful in marriage are] chaste women from among the believers and chaste women from among those who were given the Scripture} (1). Undoubtedly, a Muslim man will mix with his wife.\nSecond Opinion: He is impure. This is the opinion of the Zahiris. They used as evidence the saying of Allah Almighty: {O you who have believed, indeed the polytheists are unclean} (2).\nIt is answered that the intended meaning is moral impurity, not physical impurity.\nThe correct view: Is what the majority of scholars went to.\nThird: Dead human: The majority view is that it is pure. Hanafis say the dead human is impure, unless he was a Muslim then he becomes pure by washing, but the disbeliever does not become pure even if washed.\nThe correct view: The dead human, whether disbeliever or Muslim, is pure.",
    "foot_note": "1. (1) Al-Ma'idah 5 \n2. Al-Tawbah 28",
    "book_id": "945",
    "new_page_number": 31
  },
  {
    "serial_number": "4635855",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "The evidence for that is what we previously mentioned of evidences for the purity of disbelievers and evidences for Muslims. Also indicating this is that the Prophet (peace be upon him) kissed Uthman bin Maz'un after his death, which indicates he is pure; otherwise, if he became impure by death, the Prophet (peace be upon him) would not have placed his mouth on him.\nConclusion on that: The human is pure whether alive or dead, and whether Muslim or disbeliever. Based on this, we say his organs are pure, and what is severed from him of organs is like his dead body. For example, if skin is cut from him, this skin is like the dead body, and his dead body is pure, so we say it is pure. Whatever bone is cut from him, we say it is like his dead body, and his dead body is pure, so we say it is pure.\nSo it becomes clear that if some skin, organ, or bone is transferred from a human, whether dead or alive, these things are pure and have no effect on Wudu and prayer, and it is permissible for him to pray with them.\nThird Category: Transferring organs from a pure animal to a human. Pure animal: like sea animals and slaughtered animals. For example, if we had a sheep, slaughtered it, took its bone, and took it to a human whose bone was broken. Jurists have stated the transfer of bones. Or we took some skin and implanted it in human skin... etc. We say these things are pure, have no effect on prayer or Wudu, and this is permissible by agreement of Imams.\nFourth Category: Transferring impure organs to a human, such as the carrion of cattle and pigs... etc. Doctors have mentioned that pig bone is one of the best bones in suitability for human bone, healing quickly and not leading to curvature.\nIf pig bone is transferred to a human, or a dead sheep whose bone we took without slaughtering and transferred to a human who had a fracture, what is the ruling? We say the principle is that this is forbidden and impermissible because carrion is impure and pig is also forbidden and impermissible.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 32
  },
  {
    "serial_number": "4635856",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Although Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, regards bones of carrion as pure, according to the opinion of the majority of scholars who view them as impure, they see it is not permissible to transfer such impure organs, e.g., skin, bones, tooth, pig bone... etc.\nHowever, the issue of necessity (Idtirar) remains. If a person is compelled to such things, we say this is permissible with two conditions:\nFirst Condition: That this is after searching and investigation, meaning he searches for the medicine that suits him. If he exerts his effort in searching and investigating and does not find anything pure, then it is permissible for him to resort to the impure.\nSecond Condition: That it be a case of necessity, meaning he is in need of it and compelled to it. But if he is not compelled, it is not permissible.\nSo it is summarized for us regarding organ transfer that it is divided into four categories:\n1 - From the human himself to his body: This is permissible by agreement.\n2 - From a human: This is permissible according to the majority of scholars, whether that human is Muslim or disbeliever, alive or dead.\n3 - From a pure animal like sea animals and slaughtered cattle: This is permissible by agreement.\n4 - From an impure animal: This is not permissible, but the issue of necessity applies.\n\n**The Fourteenth Issue: Detergents containing impurities in their composition, such as soap and others containing pig fat or alcohol.**\nWhat is the ruling of these detergents?\nFirst: Regarding soap and other detergents containing impurities in their composition, we say: These impurities are one of two cases:\nFirst Case: If these impure compounds dissolved, melted, and were consumed due to mixing with other materials, using such soap containing small percentages of pig fat etc., which dissolved and were consumed, is permissible and there is no harm in it. Because this fat has no effect left. Ibn Rajab, may Allah have mercy on him, mentioned a rule for that: That the substance which is immersed in another and consumed has no ruling.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 33
  },
  {
    "serial_number": "4635857",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Second Case: If these impure compounds transformed (Istahalat) and changed into another substance. We also say that transformation (Istihala) changes impure substances into pure substances, transferring them from impure to pure, as is the Zahiri school and choice of Sheikh al-Islam Ibn Taymiyyah. For example, if we had a dog, then this dog burned and turned into ash and smoke, this ash is pure, because the impure substance transformed and transferred from one substance to another.\nThe evidence that impurity becomes pure by transformation: Scholars agreed that wine, if it transforms by itself, turns from an impure substance according to the majority to a pure substance. Similar to that are the worms of latrines; these worms emerge from impurities yet transform into a pure animal.\nThird Case: If these compositions still remain, like pig fat or carrion fat still remaining, not transformed or consumed in others. Is it permissible to use such soap or detergent in whose composition this impurity entered and remains?\nThis is a subject of disagreement among scholars, may Allah have mercy on them, regarding the ruling of using impurity in a way that does not transmit (its impurity). There are two opinions for scholars:\nFirst Opinion: Using such soap is not permissible. This is the opinion of most scholars.\nTheir evidence: The Lawgiver commanded avoiding impurities, and commanded Istinja and Istijmar.\nSecond Opinion: Using such soap is permissible for need, if it is in a way that does not transmit, meaning if it is not used in prayer or eating and drinking... etc. This is the choice of Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him.\nHis evidence: The hadith of Jabir (may Allah be pleased with him) that he heard the Messenger of Allah (peace be upon him) saying in the Year of Conquest while he was in Mecca: \"Indeed, Allah and His Messenger have forbidden the sale of wine, dead animals, swine, and idols.\" It was said: O Messenger of Allah, what about the fat of dead animals? For ships are coated with it, skins are oiled with it, and people use it for lamps? He said: \"No, it is Haram.\" (Agreed upon).",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 34
  },
  {
    "serial_number": "4635858",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "The Prophet (peace be upon him) approved their saying: skins are oiled with it, people use it for lamps, and ships are coated with it, even though carrion fat is impure. Yet, the Prophet (peace be upon him) approved them utilizing it, and said: \"No, it is Haram\" regarding the sale.\nSecond: Some cosmetics which use impurities in their composition like pig fat, for example. We say as preceded: If this impurity was consumed in others or transformed, meaning transferred from one substance to another, then these tools are pure and permissible to use.\nIf this impurity still remains in such tools, the previous disagreement applies: Using them at prayer time if remaining, we say is not permissible. If using them outside prayer, we said: Most scholars say this is not permissible. According to Sheikh al-Islam Ibn Taymiyyah's view, this is permissible due to the evidence we mentioned.\nThird: Using cosmetics containing parts of embryos (fetuses). We say using these tools is forbidden and not permissible, even if these embryos were consumed or transformed from one substance to another and no trace remained. The evidence for that:\nThe principle regarding the human being is sanctity (Hurmah). Proceeding with such a thing is fundamentally forbidden and not permissible. Allah Almighty says: {And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference} Al-Isra 70.\nHadith of Jabir (may Allah be pleased with him): \"Indeed your blood and your wealth are sacred to you like the sanctity of this day of yours, in this month of yours, in this land of yours...\".",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 35
  },
  {
    "serial_number": "4635859",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "Hadith \"The blood of a Muslim is not lawful except in one of three cases...\" (1).\nHadith of Aisha (may Allah be pleased with her) that the Prophet (peace be upon him) said: \"Breaking the bone of the dead is like breaking it while alive\" (2). Which indicates that his sanctity remains even after his death.\nThe Prophet (peace be upon him) forbade sitting on a grave and walking on it (3).\nSelling a human is among the major sins, even if he is a disbeliever, because the principle for children of Adam is freedom. Due to the hadith: \"Three people Allah will not speak to, nor purify, nor look at on the Day of Resurrection... one who sold a free person and ate his price\" (4).\nThis includes selling embryos and introducing them into industries and cosmetics.\n\n**Contemporary Issues Related to Rulings of Prayer**\n**1- Issues Related to Conditions of Prayer**\n**First: Regarding Time:**\n**The First Issue: Does anything like calculation substitute for cosmic horizontal signs or not?**",
    "foot_note": "1. (1) Hadith (The blood of a Muslim man is not lawful except in one of three cases: the married adulterer, a life for a life, and the one who leaves his religion and separates from the group). Narrated by Ahmad and the Six from Ibn Mas'ud. Narrated by Ahmad, Al-Tirmidhi, Al-Nasa'i and others from Uthman and Aisha with wording: (The blood of a man is not lawful except in one of three cases: a man committed adultery after being married, or apostatized after Islam, or killed a soul without right, so he is killed for it).\n2. Narrated by Ahmad, Abu Dawood, and Ibn Majah. Al-Bayhaqi narrated it from Aisha as Marfu' (raised to Prophet). Ibn Al-Qattan classified it Hasan. Ibn Daqiq Al-Eid said it is on the condition of Muslim. Al-Daraqutni narrated it from her and added \"in sin\". Malik mentioned it in Al-Muwatta as Balagh (report without chain) from Aisha as Mawquf (stopped at companion). Ibn Majah narrated it from Umm Salamah.\n3. From Abu Huraira (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: (That one of you sits on an ember which burns his clothes and reaches his skin is better than for him to sit on a grave). Narrated by Muslim, Abu Dawood, Al-Nasa'i, and Ibn Majah.\n4. From Abu Huraira (may Allah be pleased with him) from the Prophet (peace be upon him) who said: (Allah said: I will be the opponent of three on the Day of Resurrection: a man who gave [a pledge] in My name then betrayed, a man who sold a free person and ate his price, and a man who hired a worker, took full work from him, and did not give him his wage). Narrated by Al-Bukhari and Ahmad.",
    "book_id": "945",
    "new_page_number": 36
  },
  {
    "serial_number": "4635860",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "Time is a condition for the validity of prayer by agreement of scholars. The evidence for that: The saying of Allah Almighty: {Establish prayer at the decline of the sun [from its meridian] until the darkness of the night and [also] the Qur'an of dawn. Indeed, the recitation of dawn is ever witnessed} (1). Also His saying Almighty: {Indeed, prayer has been decreed upon the believers a decree of specified times} Al-Nisa 103 (2). The hadiths on times are many, and one of the most authentic is the hadith of Abdullah bin Umar (may Allah be pleased with them both), which is a verbal hadith and more preponderant than the hadith of Gabriel leading the Prophet (peace be upon him) as in the hadith of Jabir and Ibn Abbas (may Allah be pleased with them).\nFrom the ease and facilitation of Sharia is that it linked prayer times to cosmic horizontal signs seen by everyone, not hidden from them, realized by the scholar, the ignorant, the city dweller, and the Bedouin.\nWe find that (Fajr Prayer): Its time enters with the rise of the second dawn and lasts until sunrise.\n(Zuhr Prayer): Its time enters with the sun's decline (Zawal) and lasts until the shadow of everything becomes equal to it, excluding the shadow of Zawal.\n(Asr Prayer): Lasts until the sun turns yellow, then a time of necessity until sunset.\n(Maghrib Prayer): From sunset until the disappearance of the twilight.\n(Isha Prayer): From the disappearance of twilight until midnight.\nDoes anything like calculation substitute for these cosmic horizontal signs or not? We find people today, due to abundant lights, expansion of buildings, and high-rise buildings in big cities and even small towns... etc., have turned away from these cosmic horizontal signs and relied on what is called calculation, calendars, watches, and also computer devices existing now which determine prayer time in any city in the world not just for a day or two or a month or two, but for years.\nWhat is the validity of a Muslim relying on such calendars, watches, and devices like computers for his prayer?",
    "foot_note": "1. (1) Al-Isra 78 \n2. Al-Nisa 103",
    "book_id": "945",
    "new_page_number": 37
  },
  {
    "serial_number": "4635861",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Al-Qarafi (may Allah have mercy on him) mentioned a difference between Ramadan and Prayer (1). He said that regarding Ramadan, the Lawgiver commanded us with only one of two things and did not look at calculation:\nFirst Matter: Sighting the crescent moon, which is a cosmic horizontal sign perceivable by all.\nSecond Matter: Completing the count. If we are unable to see the crescent, we complete the count of thirty days.\nThat is why the Prophet (peace be upon him) said: \"Fast upon sighting it and break fast upon sighting it, and if it is obscured from you, complete the count\" (2). In Sahih Al-Bukhari: \"Then count Sha'ban as thirty\" (3).\nAs for calculation in Ramadan, the Lawgiver invalidated it and did not consider it, due to the saying of the Prophet (peace be upon him): \"We are an unlettered nation, we do not write or calculate. The month is like this and like this and like this, or like this and like this and like this\" (4), meaning he folded his thumb in the third instance, meaning the month is either thirty days or twenty-nine days.\nAs for calculation in prayer times, the Lawgiver considered it. The evidence for that:",
    "foot_note": "1. (1) Mawahib Al-Jalil: 2/388 \n2. From Abu Huraira (may Allah be pleased with him): The Messenger of Allah (peace be upon him) said: \"Fast upon sighting it and break fast upon sighting it, and if it is obscured from you, complete the count of Sha'ban as thirty\" (Agreed upon). \n3. Narrated by Al-Bukhari in the chapter of the Prophet's saying: If you see the crescent, fast, and if you see it, break fast (1810). He said: Adam told us, Shu'ba told us, Muhammad bin Ziyad told us, he said I heard Abu Huraira (may Allah be pleased with him) saying: The Prophet (peace be upon him) said - or Abu Al-Qasim (peace be upon him) said - (Fast upon sighting it and break fast upon sighting it, and if it is hidden from you, complete the count of Sha'ban as thirty). \n4. From the hadith of Abdullah bin Umar: Narrated by Al-Bukhari no: 1913, Muslim no: 1080, Abu Dawood no: 2319, Al-Nasa'i: 4 / 139",
    "book_id": "945",
    "new_page_number": 38
  },
  {
    "serial_number": "4635862",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "The hadith of the Dajjal (Antichrist). The Prophet (peace be upon him) informed the Companions about the Dajjal's stay, saying: \"He will stay forty days: a day like a year, a day like a month, and a day like a week.\" They said: O Messenger of Allah, this day which is like a year, will the prayer of one day suffice us in it? He said: \"No, estimate for it its measure.\" How do we estimate for it? Al-Nawawi and other scholars mentioned how to estimate for this day which is the length of a year. Similarly in such days where people need calculation due to the expansion of cities and spread of lights. The Imams agreed that calculation is considered in prayer, although they do not consider it in Ramadan. They say that if the time of prayer is known either through industry or tested mechanism, a person may pray.\nSo it became clear to us that relying on such instruments yields probability (Zann) of the time entering. Probability of time entry is permissible to act upon in Sharia. Evidence for that is the hadith of Asma' in Sahih Al-Bukhari (1). Asma' mentioned that they broke their fast during the time of the Prophet (peace be upon him) on a cloudy day, then the sun appeared. This indicates they built upon probability. If they built upon certainty, the sun would not have appeared. But the sun appearing indicates they thought the sun had set, yet they broke fast. This indicates relying on probability regarding entry of time as well as its exit.\nSecond: Regarding covering the 'Awrah (nakedness).\n\n**The Second Issue: Praying in Trousers (Pants).**\nPraying in trousers was not present in previous times, so contemporary scholars differed on it. Trousers are a type of Sirwal (drawers) but characterized by being tight and thick, covering from navel to ankle, and maybe lower than the ankle. Praying in trousers is a new matter not present among Muslims in past times; it transferred to Muslims from the West. Al-Albani (may Allah have mercy on him) said: These trousers have two calamities: First calamity is resemblance to disbelievers, Second calamity is defining the 'Awrah (showing shape).",
    "foot_note": "1. (1) Al-Bukhari in \"Chapter: If one breaks fast in Ramadan then the sun appears\"",
    "book_id": "945",
    "new_page_number": 39
  },
  {
    "serial_number": "4635863",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Regarding resemblance to disbelievers, it has now become in some Islamic countries a clothing of Muslims and has become widespread, so it is no longer specific to disbelievers. The Salaf disliked the Burnus (hooded cloak), yet Imam Malik (may Allah have mercy on him) was asked about the Burnus and said there is no harm in it. They said Christians wear it. He said: It is worn here. This indicates that if something spreads among Muslims and is not specific to disbelievers, there is no harm in it unless it implies a Sharia prohibition, like being of religious symbols.\nRegarding the second calamity mentioned by Sheikh Al-Albani (may Allah have mercy on him), which is defining the 'Awrah by shape: regarding defining the 'Awrah, jurists (may Allah have mercy on them) agree that praying in tight clothes is permissible and okay regarding the prayer itself, unlike wearing it which many scholars dislike. If it leads to Fitnah (temptation), it is forbidden.\nThe evidence that wearing tight clothes is permissible is the hadith of Jabir (may Allah be pleased with him) that the Prophet (peace be upon him) said regarding the garment: \"If it is wide, wrap yourself in it, and if it is tight, tie it around your waist\" (1). Al-Bukhari titled a chapter: Chapter of Praying in Tight Garments.\nBased on this, we say whoever prays in these trousers, his prayer is valid and permissible. But wearing these tight trousers is at least Makruh (disliked) because scholars disliked that. But whoever is afflicted with these trousers, like one accustomed to wearing them or vocational workers, we say he should strive to widen these trousers and not make them describe and define the 'Awrah.\n\n**The Third Issue: The Praying Person Carrying Pictures.**\nMost people are afflicted with carrying pictures. It could be pictures in ID cards, pictures in money, or pictures in job cards, as some employees might put the picture in their pocket or on their front and are required to do so.",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Chapter: If the garment is tight, and narrated by Muslim in Chapter: Narrated by Muslim in Zuhd and Raqa'iq / 3010",
    "book_id": "945",
    "new_page_number": 40
  },
  {
    "serial_number": "4635864",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Regarding the ruling of carrying these pictures, there are two opinions for scholars:\nFirst Opinion: The famous view of the Hanbali school is that the prayer of one carrying a picture is Makruh (disliked).\nSecond Opinion: The Hanafis and Shafi'is said: This is permissible and not Makruh.\nThe basis for this is the hadith of Aisha (may Allah be pleased with her) in Sahih Al-Bukhari, that the Prophet (peace be upon him) said: \"Remove your Qiram (1) from us, for its pictures keep distracting me in my prayer\" (2).\nAl-Ayni (may Allah have mercy on him) said in Umdat al-Qari Sharh Sahih Al-Bukhari: \"If this prohibition is regarding the house in which one prays, then being in the garment in which the person prays containing pictures is more worthy (of prohibition).\"\nThe closer view in this issue: Such pictures are permissible and there is no harm in them, as per the Fatwa of the Permanent Committee for Scholarly Research and Ifta (3). Sheikh Abd al-Rahman al-Sa'di (may Allah have mercy on him) said: However, necessary things that entered upon people and became a widespread affliction like pictures in money, matchboxes, and passports, what appears is that this is from necessity and widespread affliction (Umum al-Balwa), pardon is hoped from Allah regarding it, and the matter is eased.\nScholars (may Allah have mercy on them) infer that such matters are eased by the fact that the Salaf carried Frankish coins which bore pictures of kings and animals, indicating that such is permissible and no harm. There is also evidence that these objects are humiliated by taking and giving. Also, some scholars said polytheists used to worship large images, whereas such pictures are small, so resemblance is negated, meaning the carrier of this picture is not resembling idol worshippers.",
    "foot_note": "1. (1) Qiramuk: Al-Qiram: A thin curtain.\n2. Narrated by Al-Bukhari in Chapter: If one prays in a garment with crosses or pictures, does his prayer spoil? And what is forbidden of that.\n3. Fatwa No. (658)",
    "book_id": "945",
    "new_page_number": 41
  },
  {
    "serial_number": "4635865",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Based on this, we say such things appear to be permissible, no harm in them, and not Makruh. But some employees are afflicted with hanging the picture (ID badge); we say it is better to keep this picture covered in his pocket during prayer, because many scholars justified the permissibility of such pictures in money and cards by the fact that they are mostly covered and not visible.\n\n**Third: Issues Related to Adhan:**\n**The Fourth Issue: Adhan via Recorder.**\nIs this considered worship sufficient for the communal obligation? And also, do we say we should answer it if we hear it? Or do we say it is not worship and not prescribed?\nWe say this Adhan via recorder is not prescribed, and it is feared to be an innovation (Bid'ah).\nThe evidence for that:\n1.  Worship is Tawqifi (dependent on text). Allah Almighty says: {Or have they partners who have legislated for them a religion to which Allah has not consented?} (1). And He Almighty says: {And the Day He will call them and say, \"What did you answer the messengers?\"} (2).\n2.  Adhan is worship requiring intention (Niyyah), due to the hadith \"Actions are but by intentions\" (3), and such is not achieved by this recorder.\n3.  Also, what some late scholars mentioned that relying on such a recorder misses many Sunan, etiquettes, and rulings of the Mu'adhin. The Mu'adhin has Sunan, etiquettes, and conditions. Among Sunan: turning right and left, purity, facing Qibla... etc. These things do not exist in this recorder. Among conditions of Adhan is that the Mu'adhin be a sane male Muslim, and this does not apply to the recorder.\nFor these reasons mentioned, Adhan from this recorder is incorrect, does not suffice for the communal obligation, is not sufficient for legitimacy if there is someone to call Adhan and drop the communal obligation, and rulings of Adhan like answering the Mu'adhin etc. do not apply to it.\n\n**The Fifth Issue: Is it prescribed to answer the Mu'adhin who calls Adhan via machines like the Radio...**",
    "foot_note": "1. (1) Al-Shura 21 \n2. Al-Qasas 65 \n3. Agreed upon",
    "book_id": "945",
    "new_page_number": 42
  },
  {
    "serial_number": "4635866",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "If Adhan is transmitted via radio, does it have the ruling of Adhan in terms of answering it if we hear it, or does it not take the ruling of Adhan so we don't answer it? For example, a person turned on the radio and heard Adhan being called in such-and-such country, does he answer this Mu'adhin and say the Adhan remembrances and supplication? Or do we say this Adhan is not answered?\nWe say this transmitted Adhan is divided into two categories (1):\nFirst Category: That it be transmitted live directly. This is answered. If you hear the Mu'adhin, you follow him and answer him. Evidence is the general statement of the Prophet: \"If you hear the call, say like what the Mu'adhin says\" (2). This includes whether Adhan is in the person's country or another country. Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) mentioned that it is recommended to answer a second, third, and fourth Mu'adhin, because Adhan is Dhikr (remembrance) and Dhikr is commanded, and that falls under the Prophet's (peace be upon him) saying: \"If you hear the call, say like what the Mu'adhin says\" (3).\nSecond Category: That this Adhan be a recording as mentioned, as some radio stations do. We say this is not prescribed to be answered. We mentioned previously that the origin of this Adhan is not prescribed and it is feared to be an innovation because worship acts are Tawqifi as we mentioned.\n\n**The Sixth Issue: Turning (right and left) during Adhan in Loudspeakers, is it prescribed or not?**\nIn previous times, the Mu'adhin used to climb the minaret or tower and call Adhan. Evidence for this is that Bilal (may Allah be pleased with him) used to call Adhan on the house of a woman from Banu Najjar, and her house was the highest house near the mosque\" (4).",
    "foot_note": "1. (1) This classification is by Sheikh Ibn Uthaymeen (may Allah have mercy on him). \n2. Agreed upon from the hadith of Abu Sa'id \n3. Agreed upon from the hadith of Abu Sa'id \n4. Narrated by Abu Dawood (1/198) and Al-Bayhaqi (1/425)",
    "book_id": "945",
    "new_page_number": 43
  },
  {
    "serial_number": "4635867",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "From this, scholars (may Allah have mercy on them) derived that it is recommended to call Adhan on a high place. This is supported by being more effective in calling, announcing, and alerting people to prayer, because the purpose of Adhan is informing people of prayer so they attend it.\nNow in many countries, they do not rely on this, and you don't find the Mu'adhin climbing the tower or a high place to call Adhan. Rather, he suffices with calling Adhan at the bottom, and Adhan is broadcast via loudspeakers found on the tower where sound amplification happens.\nIf he was calling Adhan on the minaret or a high place, the Sunnah is to turn. This Sunnah is supported by the hadith of Abu Juhayfah \"that he saw Bilal calling Adhan, and I began following his mouth here and there, right and left, saying Hayya 'ala al-Salah, Hayya 'ala al-Falah\" (1).\nBut regarding now, the one calling Adhan into loudspeakers, do we say the Sunnah is for him to turn, or do we say the Sunnah is to leave turning?\nThis is a point of disagreement among late scholars (may Allah have mercy on them):\nFirst Opinion: He leaves turning.\nTheir evidences:\n- Among them: The wisdom of the Mu'adhin turning right and left is to convey to all directions: right, left, front, and back. Now the wisdom is negated, so it is not prescribed to turn.\n- Among them: They also said that turning right or left weakens the voice because he will turn away [from the microphone], so it is not prescribed to turn.\nSecond Opinion: Remaining on the original Sunnah, because this is an established Sunnah in the two Sahihs, so it is prescribed for the Mu'adhin to turn.",
    "foot_note": "1. (1) Agreed upon. Al-Bukhari in Chapter of Adhan and Muslim in Chapter of Prayer",
    "book_id": "945",
    "new_page_number": 44
  },
  {
    "serial_number": "4635868",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "The closer view, and Allah knows best, in this issue is to say: Look at the weakening of the voice. If the voice weakens, the Mu'adhin should not turn because raising the voice is the pillar of Adhan. If the voice does not weaken by turning, we say the principle is the continuation of the Sunnah and he should turn. We have a rule: The deduced cause (Illah Mustanbatah) is not strong enough to restrict the text. Their saying that the wisdom is to convey to directions is a deduced cause. This might be a wisdom, and there might also be other wisdoms, such as alerting someone other than the Mu'adhin that this person is calling Adhan and the time for Adhan has entered... etc.\n\n**The Seventh Issue: Among the contemporary issues in Adhan and Prayer is what relates to Echo, meaning placing a device that amplifies the reciter's or Mu'adhin's voice.**\nWe say regarding this echo, it is divided into two types:\nFirst Type: That this echo results in repetition and reiteration of the letter. We say this is forbidden and not permissible due to lack of respect for the Book of Allah Almighty and not honoring it duly, and also it contains some vulgarity with this act. The origin in the Quran is reflection and remembrance because Allah Almighty said: {This is a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded} (1). Observing such matters diverts this great benefit so that the intent of reading or Adhan and similar legal dhikrs becomes merely the apparent without the inner, and this is contrary to what the Lawgiver intended.\nSecond Type: That it does not result in repetition and reiteration of the letter. This is okay and permissible. It is better that the worshiper's and Imam's attention be on what relates to reflection and remembrance and not attaching to the apparent without the inner.\n\n**Fourth: Regarding Facing the Qibla**\n**The Seventh Issue: Determining Qibla by Modern Devices.**\nFacing the Qibla is a condition for the validity of prayer. Scholars (may Allah have mercy on them) agree that facing the Qibla is a condition for the validity of prayer. The evidence for that:",
    "foot_note": "1. (1) Sad 29",
    "book_id": "945",
    "new_page_number": 45
  },
  {
    "serial_number": "4635869",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "The saying of Allah Almighty: {We have certainly seen the turning of your face, [O Muhammad], toward the heaven, and We will surely turn you to a qiblah with which you will be pleased. So turn your face toward al-Masjid al-Haram. And wherever you [believers] are, turn your faces toward it [in prayer]} (1). Also in the hadith of Abu Huraira in the story of the one who prayed badly, the Prophet (peace be upon him) said: \"When you stand for prayer, perform ablution well, then face the Qibla and say Takbir\" (2).\nAlso, what we said regarding the entry of time for prayer, we say regarding facing the Qibla. The Lawgiver set signs for the Qibla. Scholars (may Allah have mercy on them) mentioned among cosmic horizontal signs to infer Qibla: The Pole Star, stars, sun, moon. Also some scholars mentioned the flow of big rivers, faces of mountains can also indicate Qibla, wind directions, and also Muslim niches (Mihrabs)... etc.\nJurists agree that there is no harm in relying on instruments to determine the Qibla. They said: Because they yield probability (Zann). The compass was found, and now what is called the electronic compass exists. This electronic compass determines North and South with complete accuracy and is not affected by other influences like electricity and magnetism, and if affected, it clarifies that. The old compass might be objected to for being affected by electricity or magnetism, but regarding the electronic compass, it determines North and South with complete accuracy. If so, it yields probability, and probability as we mentioned is considered in the chapter of worship due to the aforementioned hadith of Asma' (may Allah be pleased with her) in Al-Bukhari (3).",
    "foot_note": "1. (1) Al-Baqarah 144 \n2. Narrated by Al-Bukhari (1 / 145 - 146, 4 / 172, 367), Muslim (2 / 11), Abu Awana (2 / 103), Abu Dawood (856), Al-Nasa'i (1 / 141), Al-Tirmidhi (2 / 103 - 104), Ibn Majah (1060), Al-Bayhaqi (2 / 15, 37, 62, 372), and Ahmad (2 / 437). \n3. See page 36",
    "book_id": "945",
    "new_page_number": 46
  },
  {
    "serial_number": "4635870",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "**The Eighth Issue: Prayer in Ship and Airplane.**\nFacing Qibla in obligatory prayer is a condition. As for voluntary prayer, facing Qibla drops and is not a condition nor obligatory, but it is recommended only in Takbirat Al-Ihram to face Qibla as in the hadith of Anas to start prayer facing Qibla, and the Prophet (peace be upon him) used to pray wherever his mount turned. As for obligatory prayer, facing Qibla is a condition. So we say a person strives to face Qibla. If he can face Qibla, then as Allah Almighty said: {So fear Allah as much as you are able} (1), and the Prophet's saying: \"If I order you with a command, do of it what you can\" (2).\nIf the ship turns, if he can turn with it, let him turn. The important thing is this relates to ability. If there is a place where he can face Qibla, he faces it. If he delays prayer until he disembarks, if he will disembark within the time, or the prayer can be combined with the one before it like Zuhr combined with Asr, this is better. But if he will disembark after the time exits, e.g., disembarking after sunrise for Fajr prayer, he is not allowed to delay prayer but must pray. If he prays while knowing he will disembark before time exits, his prayer is valid.\nScholars agree on the validity of prayer in ships because ships existed in their time. Al-Nawawi (may Allah have mercy on him) mentioned in his book Al-Majmu': \"And the prayer of a man carried on a bed in the air is valid\" (3). Late scholars took from this that prayer in an airplane is permissible and there is no harm in it.\n\n**Regarding Congregational Prayer**\n**The First Issue: Attendance of Congregational Prayer in Mosque for One Afflicted with Smoking.**\nDoes he have to attend congregational prayer or is attendance dropped for him?",
    "foot_note": "1. (1) Al-Taghabun 16 \n2. Narrated by Al-Bukhari (4 / 422), Muslim (7 / 91), and Ahmad (2 / 258). \n3. Al-Majmu': 3/214",
    "book_id": "945",
    "new_page_number": 47
  },
  {
    "serial_number": "4635871",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Definition of Tobacco (Dukhan): Tobacco is a plant of the Solanaceae family which includes most poisonous plants like Belladonna and Henbane. The origin of these plants is in Western lands. Muslims did not know it until the end of the tenth century. The English introduced tobacco to Muslims during the Ottoman Empire. A Jewish man claiming to be a wise doctor treating people introduced it to the Maghreb lands. Then it was brought to the rest of Muslim lands like Egypt, Hejaz, and most Muslim lands.\nWhen this tobacco appeared, scholars (may Allah have mercy on them) differed regarding smoking it: is it forbidden (Haram), disliked (Makruh), or permissible (Mubah)? There are three opinions. The correct one among these opinions is that it is forbidden.\nThe evidence for that:\n1.  Allah Almighty said: {And do not kill yourselves [or one another]. Indeed, Allah is to you ever Merciful} (1).\n2.  It is medically proven that this smoke carries deadly poisons for humans. Medical statistics mention that nearly twenty-five million people die annually in the world due to smoking. This is killing the self, and Allah Almighty says: {And do not throw [yourselves] with your hands into destruction [by refraining]. And do good; indeed, Allah loves the doers of good} (2).\n3.  Also due to the harms agreed upon by doctors, based on the Sharia maxim: \"No harm and no reciprocating harm.\"\n4.  Also because man does not own this body.\n5.  Also because it is among the foul things (Khaba'ith), and among the attributes of the Prophet (peace be upon him) is that he makes lawful for them the good things and prohibits for them the foul things.\n\n-- This smoke has an offensive odor. Some scholars said attending congregational prayer is forbidden for him, and some said it is disliked. The closer view is regarding annoyance/harm (Idha'). If he annoys others, he is not allowed to attend congregational prayer. Evidence for this:",
    "foot_note": "1. (1) Al-Nisa 29 \n2. Al-Baqarah 195",
    "book_id": "945",
    "new_page_number": 48
  },
  {
    "serial_number": "4635872",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "The hadith of Ibn Umar (may Allah be pleased with them both) that the Prophet (peace be upon him) said: \"Whoever eats from this tree - meaning garlic - let him not approach our mosque\" (1). The Prophet (peace be upon him) only forbade that because it causes harm/annoyance, and annoying a Muslim is not permissible. Allah Almighty says: {And those who harm believing men and believing women for [something] other than what they have earned have certainly born upon themselves a slander and manifest sin} (2). In the Qudsi Hadith: \"Whoever shows enmity to a wali (ally) of Mine, I have declared war on him\" (3).\nBased on this, we say that attending congregation for one who smokes this tobacco or smoke is forbidden and not permissible. This is not lightening for him, but rather punishment and discipline for his action, depriving him of this great merit and many blessings resulting from attending congregational prayer.\n\n**The Second Issue: Separating Women's Prayer Area from Men's Prayer Area in Mosques.**\nAbu Dawood (may Allah have mercy on him) titled a chapter in his Sunan \"Chapter: Seclusion of Women in the Mosque from Men\", and mentioned the hadith of Ibn Umar (may Allah be pleased with them both) that the Prophet (peace be upon him) said: \"If we left this door for women.\" Nafi' said: Ibn Umar did not enter through it until he died.\nFrom this titling by Abu Dawood, it is understood that women seclude themselves in a special place in the mosque. Also, the Prophet's saying \"If we left this door for women\" indicates leaving this specific door for women to enter and exit, implying it is prescribed that women's prayer area be specific to them.\nSupporting this is the hadith of Umm Salamah (may Allah be pleased with her) in Sahih Al-Bukhari, she said: \"Women in the time of the Messenger (peace be upon him), when they finished the obligatory prayer, stood up, and the Messenger of Allah (peace be upon him) and the men with him stayed for a while. When the Messenger of Allah (peace be upon him) stood up, the men stood up.\"",
    "foot_note": "1. (1) Narrated by Al-Bukhari and Muslim \n2. Al-Ahzab 58 \n3. Narrated by Al-Bukhari in the Book of Riqaq, Chapter of Humility, from the hadith of Abu Huraira",
    "book_id": "945",
    "new_page_number": 49
  },
  {
    "serial_number": "4635873",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "This hadith indicates preventing mixing of men and women in the mosque, even in markets. That is why the Prophet (peace be upon him) used to stay in his place along with the men with him until the women departed. If that was prevented among men (in general/markets), then it is so in mosques as well. Also supporting this is the hadith of Abu Huraira (may Allah be pleased with him) that the Prophet (peace be upon him) said: \"The best of men's rows are the first and the worst are the last, and the best of women's rows are the last and the worst are the first.\" Narrated by Muslim in his Sahih. This indicates that women are isolated, and the further men are from women, the better it is for them. These evidences and others indicate women's seclusion in a special place and not mixing with men. Therefore, what exists in some large mosques of mixing men and women is an error.\n\n**The Third Issue: Separation Between Men's and Women's Prayer Areas with a Barrier.**\nThis barrier could be a wall or non-wall like plastic, cloth, or similar. Is this permissible or not, given that it was not reported in the Prophet's time that men and women were separated by a barrier?\nThis is a point of disagreement among late scholars. What appears is that this is permissible and there is no harm in it. In fact, some scholars went to its obligation, like Al-Ghazali (may Allah have mercy on him). He stated in Ihya Ulum al-Din the obligation of placing such a barrier, saying: \"A barrier must be placed between men and women preventing sight, for it is a suspicion of corruption\" (1).\nAs for the fact that such a barrier did not exist in the Prophet's time, we say:",
    "foot_note": "1. (1) Ihya Ulum al-Din 1/337",
    "book_id": "945",
    "new_page_number": 50
  },
  {
    "serial_number": "4635874",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "First Aspect: One who contemplates the Sunnah finds that women only attended Isha and Fajr prayers with the Prophet (peace be upon him), and their time is dark with no need for such a barrier. As in the hadith of Aisha (may Allah be pleased with her): \"The believing women used to attend Fajr with the Prophet (peace be upon him) wrapped in their sheets, then return to their homes unrecognized by anyone due to darkness\" (1). Also the Prophet's saying: \"Any woman who touched incense should not attend the last Isha with us\" (2). These two hadiths are the ones where attending these two prayers, Fajr and Isha, was explicitly mentioned. The place was prone to darkness and lack of visibility. Even if there was light, it was little light. The Prophet's time was not like our time today with many lights making night like day, so there was no need for such.\nSecond Aspect: There is no comparison between those favored centuries and our eras. That century was the century of the Prophet (peace be upon him), the Companions, the Tabi'in, and those who followed them; they are the best of the Ummah. They had strength of faith, knowledge, and reverence for Allah Almighty that prevented, deterred, and warded off Fitnah from them, unlike our present time where weakness of faith exists, as well as provocation of Fitnah, desires, and instincts that were not present in that time... etc.\nThird Aspect: This falls under means (Wasa'il), and means are expanded upon more than objectives (Maqasid). Scholars (may Allah have mercy on them) expand on means what they do not expand on objectives.\n\n**The Fourth Issue: Following the Imam via Media Means Existing Today**, whether visual or audio.",
    "foot_note": "1. (1) Narrated by the two Sheikhs and others \n2. Narrated by Muslim from the hadith of Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Any woman who applied incense should not attend the last Isha with us.\"",
    "book_id": "945",
    "new_page_number": 51
  },
  {
    "serial_number": "4635875",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "If the prayer is broadcast live, is the prayer valid behind this Imam whose prayer is broadcast, or do we say this prayer is invalid?\nLate scholars differed on this issue, with two opinions:\nFirst Opinion: That this is not permissible. Most scholars (may Allah have mercy on them) said this. They used evidences including:\n1.  Prayer is worship and acts of worship are Tawqifi, as Allah Almighty said: {Or have they partners who have legislated for them a religion to which Allah has not consented?} (1). And Allah Almighty said: {And the Day He will call them and say, \"What did you answer the messengers?\"} (2). A person following an Imam while he is in one country and the Imam in another country, we say this is an innovation and was not reported from the Prophet (peace be upon him).\n2.  Congregational prayer came in Sharia in a specific form. This form is having a meeting between the Imam and followers in one place and one time. Forms of worship are Tawqifi. The Prophet (peace be upon him) said: \"There is no prayer for a solitary person behind the row\" (3). If the solitary person behind the row has no valid prayer, Ibn al-Qayyim said: \"How about one who is solitary (separate) from the row and the congregation!\" (4).\n3.  They said this implies nullifying congregational prayer and would lead people to pray in their homes. Also, the effects and benefits resulting from congregational prayer, such as people meeting in the mosque, creating affection, love, familiarity, and brotherhood bonds, would be nullified.\n4.  They said a defect might occur in this medium transmitting the prayer, such as power outage or broadcast interruption, then following would be disrupted.\nSecond Opinion: They said it is valid. They used their evidences.",
    "foot_note": "1. (1) Al-Shura 21 \n2. Al-Qasas 65 \n3. Narrated by Ibn Abi Shaybah (13 / 2 / 1). Narrated by Ibn Majah (1003), Ibn Khuzaimah (1 / 164 / 2), Ibn Hibban in his Sahih (401 and 402), Al-Bayhaqi, Ahmad (4 / 23), and Ibn Asakir (15 / 99 / 1) \n4. Al-Salah wa Hukm Tarikiha 1/ 148",
    "book_id": "945",
    "new_page_number": 52
  },
  {
    "serial_number": "4635876",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "They said jurists stated that Friday prayer and congregational prayer are valid in houses adjacent to the mosque and close to it. This was discussed (refuted) saying this is not conceded; scholars only stated that for need, for example if the mosque is full, roads are full, and rows are connected, then houses reached by rows, their owners may pray in them provided he is not solitary if he is a man.\nThey said if rain falls, the Prophet (peace be upon him) permitted people to pray in their dwellings while hearing the Prophet's voice and following him. This evidence was discussed (refuted) saying it is incorrect. Rather the meaning, as reported in \"the hadith of Ibn Umar (may Allah be pleased with them both) that the Prophet (peace be upon him) used to order the Mu'adhin if it was a cold and rainy night to say: Lo! Pray in the dwellings\" (1), implies that congregational prayer drops from them due to hardship, not that they follow the Prophet (peace be upon him). It was not reported that they used to follow the Prophet (peace be upon him).\nThey said the criteria in following is the example (Iqtida'), even if it is following, and now following is possible; meaning the one hearing the radio voice follows the Imam, bows with him, and hears his voice.\nThis evidence was discussed (refuted) as incorrect. Rather, the criteria is that the Imam and follower gather in one place and one time, and this is the criteria indicated by the Sunnah.\n\n**The Fifth Issue: Follower Following the Imam if He Hears Him via Loudspeakers.**\nOr a woman in her house hearing the loudspeakers, can she pray in the house following the Imam's prayer, or do we say she cannot?\nScholars divided this issue into two categories:\nFirst Category: That the neighbor of the mosque has his house attached to the mosque, and there is a passage between the mosque and the house. The majority of scholars (may Allah have mercy on them) said following the Imam is valid and his prayer is valid, and seeing (the Imam) is not a condition; hearing the voice suffices.",
    "foot_note": "1. (1) Agreed upon",
    "book_id": "945",
    "new_page_number": 53
  },
  {
    "serial_number": "4635877",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "But the Hanbalis stipulate that there must be vision, meaning whoever is in this house must see the Imam or see the followers or some followers even in part of the prayer.\nThe correct view: This is permissible and okay, and vision is not a condition. The evidence for that: The hadith of Asma', she came to Aisha (may Allah be pleased with her) when the sun eclipsed and people were praying standing, and she was standing praying. This was narrated by Al-Bukhari in his Sahih. This is Aisha (may Allah be pleased with her) praying in her house following the Prophet's prayer (peace be upon him).\nAlso what is reported in Musannaf Abd al-Razzaq that Aisha (may Allah be pleased with her) used to pray in her house following the Imam's prayer because the Prophet's houses were attached to the mosque and had openings to the mosque. Also, some houses of the Companions (may Allah be pleased with them) were attached to the mosque and had openings to the mosque, so the Prophet (peace be upon him) ordered that every Khawkhah (1) be closed except the Khawkhah of Abu Bakr (2).\nSecond Category: That these houses are not attached, as exists now in our time where most houses are not attached to mosques. Is it valid for owners of these houses to pray in them while hearing the Imam, or do we say they cannot?\nScholars (may Allah have mercy on them) differed on this issue with three opinions:\nFirst Opinion: Prayer in these houses is valid as long as they can follow, whether following is by Takbir or vision.\nSecond Opinion: That connection of rows is a condition along with possibility of following. This is the saying of Ibn Qudamah.\nThird Opinion: The Hanbali school, that connection of rows is not a condition, but two conditions are necessary:\n1 - Seeing the Imam or some followers even in part of the prayer.\n2 - Hearing the Takbir.",
    "foot_note": "1. (1) Al-Khawkhah: A small door like a large window, being between two houses where a door is installed.\n2. Agreed upon",
    "book_id": "945",
    "new_page_number": 54
  },
  {
    "serial_number": "4635878",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "The correct view in this issue: If the rows are connected, house owners may pray. But if they are not connected, it is not valid. We stipulate connection of rows along with possibility of following. The evidence for this is what we mentioned that the congregation has a Sharia form, and acts of worship are Tawqifi. Its Sharia form as reported from the Prophet (peace be upon him) and Companions is that they gather in one place and one time; this is the Sharia form. But if rows are connected, it takes the ruling of this place, so the two places become like one place due to row connection. In this case, we say it is okay to pray in their homes and follow the Imam. Other than that, the correct view is that following is not valid.\n\n**The Sixth Issue: Placing a Heater in Front of the Worshiper.**\nWhat is the ruling of that? Is it disliked (Makruh) or not? Is it permissible or not?\nScholars have three opinions on this:\nFirst Opinion: It is disliked if it has a flame, e.g., wood fire, candle, or lamp. If it has no flame but is merely embers, the Hanbalis said this is not disliked.\nSecond Opinion: Opposite to this view: If it is embers it is disliked, and if it is flame it is not disliked. This is the Hanafi school.\nThird Opinion: The principle is permissibility whether it is flame or embers, and there is no evidence for dislike. Dislike is a Sharia ruling requiring Sharia evidence, and it was not reported from the Prophet (peace be upon him) that he disliked it. This is the Zahiri opinion.\nThe disagreement between Hanbalis and Hanafis is in verifying the cause (Manat). The cause scholars stated is resemblance to Magians (Zoroastrians). Do Magians worship embers or worship flames?\nThe Hanbalis say Magians worship flames and use Salman's saying: \"I was the stoker of the fire who lights it so it doesn't go out.\" The Hanafis say Magians worship embers not flames.\nThe closer view regarding that is the Hanbali view that they worship flames. The closer view in this issue is what the Zahiris went to, that this is permissible, okay, and not disliked.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 55
  },
  {
    "serial_number": "4635879",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Because the principle is permissibility, and dislike (Karahah) is a Sharia ruling needing Sharia evidence and is not moved from except with proof. The cause given by Hanbalis (may Allah have mercy on them) is that Magians worship flames. These heaters existing now have no flame, so resemblance to Magians is negated. If we take the Hanafi view that they worship embers, wood embers do not resemble heaters existing now which work via gas or electricity... etc. It is merely redness due to electric current generating this heat, i.e., neither flame nor ember... etc.\n\n**The Seventh Issue: Missing Congregational Prayer for One Who Needs To.**\nLike: The on-call doctor, ambulance man, fireman, guard, and the like who are needed.\nThis issue is easy. Jurists (may Allah have mercy on them) state that among excuses for leaving congregation: Fear, whether fear for money, self, or family. Also they said whether he fears for himself or another, or his money or another's, or his family or another's; all this is an excuse lightening the leaving of congregation.\nThe evidence for that: The saying of Allah Almighty: {So fear Allah as much as you are able} (1). Also Allah's saying: {Allah does not charge a soul except [with that within] its capacity} (2). Also the Prophet's saying: \"Indeed this religion is ease, and no one will make religion difficult except it will overcome him\" (3). From Fiqh maxims is the maxim \"Hardship brings ease.\"\n\n**The Eighth Issue: Combining Prayers in Residence for One Who Needs It.**\nEither to save a protected life like a fireman who cannot pray every prayer on time, or for example a doctor performing a surgery that might take several hours.",
    "foot_note": "1. (1) Al-Taghabun 16 \n2. Al-Baqarah 286 \n3. Narrated by Al-Bukhari, Al-Nasa'i, and Al-Bayhaqi from Abu Huraira as Marfu'",
    "book_id": "945",
    "new_page_number": 56
  },
  {
    "serial_number": "4635880",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Combining is either in travel or in residence. regarding travel, it is permissible absolutely. A traveler may combine in travel even if there is no hardship, because scholars considered here the probability (Mazinnah), which is probability of hardship, unless he is inside the city, then he must pray the first prayer with people, then after that if he wants to pray the second prayer with it, he may. It is better for a non-traveler to pray every prayer on time, and if traveling, it is better to combine.\nAs for residence: This is a point of disagreement. Is residence a place for combining or not? The principle is that prayer is performed on time because Allah Almighty said: {Indeed, prayer has been decreed upon the believers a decree of specified times} (1). Also hadiths on times are very many. It was reported from Umar (may Allah be pleased with him) that he said: \"Whoever combines two prayers without excuse has come to a door of major sins.\" Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said in Al-Fatawa Al-Kubra: \"It is not permissible to delay day prayer to night neither for craft nor work by agreement of jurists\" (2).\nSo the principle is prayer on time, but there might be hardship in performing prayer on time. Is residence a place for combining or not?\nThe Hanbali school is the broadest in this issue - combining in residence. They say: Combining is permissible between two prayers for every excuse permitting leaving Friday and congregational prayer. They said need and hardship permit combining two prayers. This was said by some Salaf like Ibn Sirin, Al-Khattabi, Sheikh al-Islam Ibn Taymiyyah, and among moderns Sheikh Muhammad Rashid Rida and Sheikh Ahmad Shakir (may Allah have mercy on them). Some of these scholars stipulated it not be taken as a habit.\nThe narrowest school in combining is the Hanafi school. They do not permit combining neither in travel nor residence, permitting it only in Arafat and Muzdalifah with the Imam. Otherwise, for them it is apparent combining (Jam' Suri): delaying the first to end of its time and hastening the second to beginning of its time.",
    "foot_note": "1. (1) Al-Nisa 103 \n2. Majmu' al-Fatawa: 22/27",
    "book_id": "945",
    "new_page_number": 57
  },
  {
    "serial_number": "4635881",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Shafi'is also do not permit combining in residence except for the sick, preventing it for others. Similarly Malikis say regarding the sick if he fears a preventer, he advances the second and prays it with the first at the beginning of its time.\nThe correct view is what Hanbalis went to: that if leaving combining entails difficulty and hardship in residence, then combining is permissible and okay. They evidenced this with the hadith of Ibn Abbas (may Allah be pleased with them both) that the Prophet (peace be upon him) combined Zuhr and Asr, and Maghrib and Isha without fear or rain - in a narration without fear or travel. Ibn Abbas was asked about that, and he said: He wanted not to cause difficulty for his Ummah.\nThis indicates that if there is difficulty and hardship in combining, it is resorted to. Based on this, whoever needs it to save a protected life etc., like a doctor needing hours for surgery or treatment... etc., or ambulance man or fireman to extinguish fire etc., if he cannot pray every prayer on time, he resorts to combining. The action of Companions in the conquest of Tustar is interpreted on this, as they delayed Fajr prayer to Duha since they couldn't perform prayer on time.\n\n**Regarding Friday Prayer**\n**The First Issue: Speaking during Friday Sermon by Mosque Attendants**\nLarge mosques where Friday prayer is performed might have people managing them, organizing people, arranging them etc. What is the ruling of their speaking during the Imam's sermon?\nFirst Opinion: Majority of scholars hold that listening to the sermon is obligatory. The evidence: Allah Almighty said: {O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah} (1). Proceeding is obligatory so one can listen to the sermon.",
    "foot_note": "1. (1) Al-Jumu'ah 9",
    "book_id": "945",
    "new_page_number": 58
  },
  {
    "serial_number": "4635882",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "Also indicated by the hadith of Abu Huraira that the Prophet (peace be upon him) said: \"If you say to your companion on Friday 'Listen' while the Imam is preaching, you have engaged in idle talk (Laghw).\" This hadith is in the two Sahihs (1), (and whoever engages in Laghw has no Jumu'ah). Also they used as evidence Allah's saying: {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} (2). Allah ordered paying attention. Some scholars said: The intent is the sermon, expressed as Quran because reading verses in it is frequent. This is a point of dispute.\nSecond Opinion: Shafi'i's view in the New School. He said listening to the sermon is recommended, not obligatory. He used as evidence: The hadith of Anas (agreed upon) that the Prophet (peace be upon him) was standing preaching when a man entered and said: O Messenger of Allah, wealth is destroyed, roads are cut, and children are hungry, so pray to Allah to send us rain. The Prophet raised his hands and said: \"O Allah send us rain...\" Next Friday he said: O Messenger of Allah, pray to Allah to divert it from us... They said this man did not listen to the sermon and spoke to the Prophet. Also they used the hadith of Anas that a man entered while the Prophet was preaching and said: O Messenger of Allah, when is the Hour? People signaled to him. He said: When is the Hour? People signaled to him. He said it three times. After the third, the Prophet said: Woe to you, what have you prepared for it? He said: Love of Allah and His Messenger. The Prophet said: You are with whom you loved. They said this man spoke to the Prophet and the Prophet did not order him to be silent.",
    "foot_note": "1. (1) Narrated by the two Sheikhs and others \n2. Al-A'raf 204",
    "book_id": "945",
    "new_page_number": 59
  },
  {
    "serial_number": "4635883",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "They also used the hadith of Uthman when he came while Umar was preaching, having delayed coming to the sermon, and Umar rebuked him.\nThe correct view in this issue: What the majority of scholars went to, that paying attention to listen to the sermon is obligatory. As for these evidences Shafi'i used, we say they indicate it is permissible for the follower to speak to the preacher, and the preacher may speak to whomever he wishes of the followers; this is permissible. Based on this, if a person doesn't understand something from the sermon, he may ask the preacher, and the preacher may answer. Also if he doesn't hear his voice and wants to alert him, he may. Based on this, regarding the speech of mosque attendants during the sermon: do they have the right to speak or organize people? This happens in large mosques like the Makkan Haram. We say the principle is this is forbidden and not permissible because listening to the sermon is obligatory. But there might be a great interest needed. The Permanent Committee for Ifta (Fatwa No. 12349) gave a fatwa to attendants of the Holy Mosque who arrange and organize people and prevent them sitting in passages etc., that their work is permissible due to the great interest. Other than that in other mosques, the principle is they listen and leave their work.\n\n**The Second Issue: What is the ruling on working during the sermon, like broadcasting it, fixing loudspeakers, or fixing recording devices?**\nJurists differentiate between speech and action. They are lenient regarding action; meaning a person working is lighter than speaking, due to evidence, and because work doesn't prevent a person from listening to the sermon.\nEvidence that action is permissible: Hadith of Abu Huraira that Sulayk Al-Ghatafani entered while the Prophet was preaching. The Prophet said: Did you pray two rak'ahs? He said: No. He said: Stand and pray two rak'ahs. Praying two rak'ahs during the sermon is an action.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 60
  },
  {
    "serial_number": "4635884",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "Also indicating this is the previous hadith of Anas when the man said 'When is the Hour, O Messenger of Allah', the Companions signaled to him, which is a type of action. Similarly, the hadith of Muawiyah bin al-Hakam when he spoke in prayer, the Companions signaled him to be silent and struck their thighs. Hanbalis stated that whoever sees a munkar (wrong) during the sermon may signal to the doer to stop. Jurists also stated it is okay for a person to drink water during the sermon. They also stated if drowsiness overtakes him, he may move from one place to another to drive away drowsiness, and use Siwak if needed to drive away drowsiness. Also if a person gives charity to a poor person during the sermon, this is permissible. Based on this, we understand there is no harm in working to fix loudspeakers during the sermon, and this is not considered Laghw (idle talk), or working on recording the sermon or transmitting it to another place; all this is permissible.\n\n**The Third Issue: Translating the Sermon after Prayer for Non-Arabic Speakers.**\nScholars differed regarding Friday sermon: Is it a condition to be in Arabic or is it valid in any language? Scholars have three opinions:\nFirst Opinion: Condition to be in Arabic. This is the school of Imam Malik and Shafi'i. Evidence: Hadith of Malik bin al-Huwayrith: \"Pray as you have seen me praying\" (1). The Prophet preached in Arabic. They also said dhikrs are Tawqifi like Quran reading, stopped at the text. Just as Quran is not read or translated literally, so is the sermon.\nSecond Opinion: Sermon is valid in any language. School of Abu Hanifa. Evidence:",
    "foot_note": "1. (1) Narrated by Al-Bukhari in Sahih, Book of Adhan, Chapter Adhan for Traveler (1 / 162)",
    "book_id": "945",
    "new_page_number": 61
  },
  {
    "serial_number": "4635885",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Allah's saying: {And We did not send any messenger except [speaking] in the language of his people to state clearly for them} (1), meaning in their language. Communication and teaching do not happen unless in the language of the addressees.\nThird Opinion: Detail in this issue. It is a condition to be in Arabic unless unable. If the preacher does not speak Arabic, he preaches in his people's tongue. This is the famous view of Ahmad's school.\nThe closer view is to say: Look at the state of listeners:\n1- If listeners do not understand Arabic, the sermon is in their language as per Hanafi school, because Allah says: {And We did not send any messenger except [speaking] in the language of his people to state clearly for them} (2). If this is in the origin of conveying the Message, then in branches of the Message it is more worthy, because the sermon is a type of conveying the Message. Also the Prophet ordered Zaid bin Thabit to learn the language of the Jews so the Prophet could correspond with them in their language and establish proof against them.\n2- If the language of listeners is Arabic and there are people who do not speak Arabic, we say the sermon here is in Arabic, and for non-Arabs, the sermon is translated for them. This is a way.\nFirst Way: Sermon is translated for them after prayer. This is permissible and okay, not considered innovation, but rather conveying the sermon. Conveying the sermon might not happen except this way as done in some mosques.\nSecond Way: Some scholars said sermon is translated for them on papers distributed to them to read.\nThird Way: Sermon is recorded, and while the Imam delivers the sermon, a recording in their language is played for them to listen via headphones.",
    "foot_note": "1. (1) Ibrahim 4 \n2. Ibrahim 4",
    "book_id": "945",
    "new_page_number": 62
  },
  {
    "serial_number": "4635886",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Reading the sermon on papers or listening to it via recording is permissible and okay. Hanbalis and Shafi'is stated this, saying: The person who doesn't hear the Imam's sermon because he is deaf or far from the Imam may busy himself with Dhikr, sending blessings on the Prophet, reading Quran, reading scholars' books etc. Similarly, this non-Arab who doesn't understand Arabic, if he busies himself reading the sermon the Imam is delivering or listening via recorder or reading, this is permissible and okay, being in the position of the deaf and distant person. They used as evidence the hadith of Abu Darda that the Prophet said: \"If you hear your Imam speaking, pay attention until he finishes.\" Narrated by Imam Ahmad. He restricted it to hearing speech, and this one doesn't hear (understand) speech. Also, the purpose of hearing the sermon is benefit and understanding, and such non-Arab and distant person doesn't benefit or understand, so he may busy himself with other worship.\nWe mentioned before differentiating between action and speech in the sermon, that action is lighter. As for the Prophet's saying: \"Whoever touches pebbles has engaged in idle talk,\" we say action during sermon is divided into two parts:\nFirst Part: Action for interest as advanced, examples given, this is permissible.\nSecond Part: Action for no interest or need, this is what is not permissible. As for such action (translation/recording), it is for need, so we say it is permissible.\n\n**Contemporary Issues Related to Eclipse Rulings**\nDefinition of Kusuf (Solar Eclipse) and Khusuf (Lunar Eclipse):\nKusuf linguistically: Change to blackness.\nKhusuf linguistically: Going away and decrease.\nTerminologically: Obscuration of the light of the sun or moon, wholly or partially, due to an unusual cause.\nCause of Eclipse: Eclipse has two causes:\n1- Legal/Religious cause.\n2- Cosmic cause.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 63
  },
  {
    "serial_number": "4635887",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "The Religious Cause: Is Allah frightening His servants so they return and repent to Allah Almighty as the Prophet clarified in Sahih: \"The sun and the moon are two signs of Allah's signs; they do not eclipse for the death or life of anyone, but Allah frightens His servants with them.\" Ibn al-Munayyar mentioned that the eclipse serves as a warning of impending punishment from Allah Almighty. Therefore, the Prophet ordered after the eclipse occurs to supplicate, pray, seek forgiveness, repent, give charity, free slaves, and return to Allah Almighty.\nThe Cosmic Cause: As for solar eclipse, the cause is the moon coming between the sun and the earth. If the moon comes between the sun and earth, a solar eclipse occurs.\nCause of Lunar Eclipse: The earth coming between the sun and the moon, because the moon's light is derived from the sun's light. Scholars mentioned the moon is like a mirror and the sun like a lamp; the moon takes light from the sun and reflects it to earth. If the earth comes between the lamp and mirror, reflection of moon light does not occur.\nKnowing the eclipse is not from the Unseen Knowledge exclusive to Allah, but from perceptible knowledge. Scholars stated this and agreed on it. Calculators and astronomers know it. Anyone acquainted with calculation and astronomy can know solar and lunar eclipses via calculation.\n\n**The First Issue: Publishing the time of eclipse occurrence in media.**\nDo we say this is prescribed or not prescribed?",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 64
  },
  {
    "serial_number": "4635888",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "We say: If we contemplate the wisdom for which these great signs occurred, this is not prescribed. Because the wisdom is frightening the servants. Publishing and circulating it via various communication means lessens the impact of this sign on people's hearts. Thus the wisdom for which eclipse was legislated—frightening servants and returning them to Allah—is not achieved. Also regarding Sunan related to this prayer like charity, freeing slaves, forgiveness, prayer; if the impact lessens, the motive to perform these Sunan weakens in many people, which is observed. Thus, this action is not prescribed but left; leaving it is better and more fitting for the wisdom of these signs.\n\n**The Second Issue: If news of eclipse occurrence is published in media, then cloud or dust occurs, do we pray based on media reports or say prayer is not prescribed?**\nWe say: The Prophet suspended the command on visual sighting. He said: \"If you see anything of that, rush to supplicating Allah and seeking His forgiveness,\" and in a wording \"Prayer.\" That is why Al-Darimi said: \"Eclipse is not acted upon by astronomers' saying.\" If we see the eclipse, we pray. If cloud or dust or otherwise prevents seeing it, we do not pray even if media published it will occur.\n\n**The Third Issue: Ruling if sun or moon eclipses then cloud or dust occurs and we doubt its existence or non-existence?**\nWe say the principle is prayer. That is why Al-Zarkashi mentioned in Al-Manthur: If the sun eclipses in cloudy condition and it is not known if it cleared or not, he may pray. We mentioned that reliance is on visual sighting because the Prophet suspended the command on seeing, saying: \"If you see anything of that, rush to supplicating Allah and seeking His forgiveness.\"",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 65
  },
  {
    "serial_number": "4635889",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Also scholars said the principle is non-eclipse. They also said the saying of calculators and astronomers is from conjecture (Zann) not certainty (Yaqin).\n\n**Contemporary Issues Related to Funerals**\n**The First Issue: Announcement of Death (Na'y)**\nNa'y is informing of the dead person's death. The principle in text is prohibition based on what is confirmed in the two Sahihs from Abu Huraira and others \"That the Prophet (peace be upon him) announced the death of Negus (Najashi) on the day he died and went out with Companions and prayed absentee prayer for him.\" Also the Prophet announced the death of the Mu'tah expedition companions saying: \"Zaid was hit, Ja'far was hit, Abdullah was hit,\" announcing them to Companions in Medina. Also hadith of Hudhayfah saying: \"If I die do not announce me, I fear it being Na'y, for I heard the Messenger of Allah forbid Na'y.\" Narrated by Ahmad and Al-Tirmidhi who authenticated it.\nScholars mentioned Na'y has three forms:\nFirst Form: Informing the dead person's relatives, friends, and neighbors to gather for preparing him—washing, shrouding, praying for him, supplicating for him etc. We say this is prescribed Na'y, not blameworthy Na'y, even if via communication means. Evidence is Abu Huraira's hadith that the Prophet announced Negus the day he died and went out with Companions, informing them to pray for him.\nSecond Form: Sending someone to call among people, their gatherings and clubs: 'Lo! So-and-so died, witness his funeral.' Also what happens in media newspapers etc. Scholars differed on this:\nFirst Opinion: It is Makruh (disliked) and blameworthy Na'y. This is the majority view.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 66
  },
  {
    "serial_number": "4635890",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "They used as evidence Hudhayfah's hadith: \"If I die do not announce me... I heard the Messenger forbid Na'y.\" Also they said this resembles Jahiliyyah people; when someone died, they would climb heights and stand in gatherings announcing so-and-so died, mentioning his feats etc.\nSecond Opinion: It is permissible and okay. Hanafi view. Evidence: The principle is permissibility. Also the Prophet announced Negus the day he died, and announced Mu'tah martyrs.\nThird Opinion: Detail. If the intent is a valid purpose and interest, it is permissible. E.g., intent is to pray for him, witness funeral, cooperate in washing/burying, or creditors/dealers to come take rights, as it might only be possible via media. This is permissible, even required for clearing the dead's liability. A group of Shafi'i jurists said this. This is the closer view.\nThird Form: Resembling Jahiliyyah Na'y, sending callers to mention feats and virtues, possibly with wailing. This is blameworthy and forbidden Na'y.\nConclusion: Na'y before preparing the dead, washing, shrouding, and praying, for people to help and gather for prayer is required and prescribed because the Prophet announced Negus and Mu'tah martyrs before preparation and burial.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 67
  },
  {
    "serial_number": "4635891",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "Second Section: Announcement after praying for him. We say do not announce, it is not prescribed unless an interest results, like the dead having transactions or debts heirs want to settle. This is an interest and permissible even in media.\nAs for giving speeches and lectures after Zaid's death, even if a scholar, we say this is all not prescribed. If during the calamity, it is a type of Na'y and inciting griefs with no benefit. If after time passes, we say it is okay to give a lecture about the scholar to fulfill his right and urge the Ummah to follow him and quote his biography and educate youth on it. If after time passes, it is required and okay because scholars wrote books on biographies and classes mentioned virtues.\nBut during the calamity, it is forbidden, being a type of inciting griefs. The Lawgiver prescribed condolences to console the afflicted to ward off this prohibited matter.\n\n**The Second Issue: Holding the Dead Body by the Hospital until Payment of Dues.**\nA hospital might be commercial, patient treated then dies owing financial rights. Some hospitals hold the body not delivering it to relatives until dues are paid.\nWhat is the ruling? Is this valid?\nWe say holding the dead body is forbidden and not permissible. Evidence: The principle is hastening to prepare, wash, and shroud the dead. Holding disrupts this Sunnah. Al-Tabarani in Al-Kabir (Hasan by Hafiz Ibn Hajar) reported Ibn Umar's hadith: \"If one of you dies do not detain him and hasten him to his grave.\"",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 68
  },
  {
    "serial_number": "4635892",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Also Abu Huraira's hadith: \"Hasten the funeral...\" (Agreed upon).\nAlso Companions in the story of the woman or man who cleaned the mosque dying at night; they didn't wait for Fajr but prepared and buried him at night. The Prophet said: \"Why didn't you inform me?\" (Bukhari). Scholars say: Slight delay is okay, e.g., died after Zuhr delayed to Asr. But what some do, dying today and preparing tomorrow, is wrong and contrary to Sunnah, unless for a great urgent interest.\nRegarding these debts to the hospital, there are three cases:\nFirst Case: The dead entered with sponsorship (guarantor). We say no need to hold the body; the guarantor pays and returns to the estate.\nSecond Case: The dead is insolvent with nothing. We say his liability is corrupted. No legal justification to hold the body as he has nothing. Heirs are not obliged to pay debts by agreement of scholars {No bearer of burdens will bear the burden of another}. This is contrary to many people's understanding that heirs must pay insolvent father's debt, perhaps taking Zakat for it. Paying Zakat for the dead is forbidden.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 69
  },
  {
    "serial_number": "4635893",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "But as the Prophet said: \"Whoever takes people's money intending to pay it back, Allah pays for him...\" This dead, if he intended payment, Allah pays for him on Judgment Day. If he intended destruction, Allah destroys him.\nThird Case: He is solvent with an estate. The right relates to the estate money, not the body. The hospital is like any creditor returning to the estate {After any bequest he [may have] made or debt}. Debts and bequests are prioritized. Thus, such holding is forbidden and ethically unacceptable.\n\n**The Third Issue: Autopsy of the Dead Body.**\nAnatomy: Science researching body parts composition... Jurists discussed anatomy long ago. Islamic scholars authored books on it. e.g., Jurists say Kohl in Ramadan breaks fast because anatomists say there is a passage between eye and throat. Some say semen is impure because it exits from urine outlet; others say pure because anatomy says three outlets... etc. Ibn Jama'ah, Al-Suyuti, Hasan Attar authored on anatomy.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 70
  },
  {
    "serial_number": "4635894",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Scholars mentioned reasons for autopsy:\nFirst: Education: As medical students do now.\nSecond: Forensic Autopsy: Knowing cause of death (natural or criminal).\nThird: Pathological Autopsy: Revealing cause of death generally (diseases) for prevention.\nScholars differed on these:\nFirst Section: Autopsy for Learning. Three opinions: Permissible absolutely, Forbidden absolutely, Detail.\nFirst Opinion: Permissible absolutely. Decision of Fiqh Academy in Mecca (10th session). Evidence: If two interests conflict, highest is presented. Dead's interest not to be cut vs public interest of learning medicine to treat people. Public interest precedes. Also committing lesser of two evils.\nJurists stated: Okay to cut pregnant dead's belly to extract living fetus.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 71
  },
  {
    "serial_number": "4635895",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "Also if dead swallowed usurped money, okay to cut belly to extract it. Also permissible to eat dead body in necessity.\nSecond Opinion: Forbidden absolutely. Evidence: {We have honored the children of Adam}. Hadith: \"Breaking dead's bone is like breaking it alive.\" Consensus on prohibition of mutilation (Muthla) and looting.\nThird Opinion: Detail. Permissible for disbeliever's body, not Muslim's. Decision of Senior Scholars in Saudi Arabia (No. 47). Evidence: {And he whom Allah humiliates - for him there is no bestower of honor}. Disbeliever's honor is less.",
    "foot_note": "1. (1) Al-Isra 70 \n2. Narrated by Malik, Abu Dawood, Ibn Majah \n3. Narrated by Al-Bukhari \n4. Narrated by Muslim \n5. Al-Hajj 18",
    "book_id": "945",
    "new_page_number": 72
  },
  {
    "serial_number": "4635896",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "For necessity. Disbeliever bodies can be obtained/bought. Disbelievers don't respect bodies like Muslims. Many burn bodies or throw in sea.\nPreponderance: This view is closer. Conditions for permissibility:\n- Autopsy according to need (only needed part).\n- Women dissect women, men dissect men.\n- Parts buried after autopsy.\nSecond Section: Forensic Autopsy. Suspecting cause of death (criminal?). Majority of contemporaries: Permissible, maybe obligatory. Adopted by Fiqh Academy, Senior Scholars (Fatwa 47), Egyptian Fatwa House. Because it entails great interests; public interest precedes private.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 73
  },
  {
    "serial_number": "4635897",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "Interests of Forensic Autopsy:\n1- Protecting judge's ruling from error.\n2- Protecting accused's right.\n3- Protecting society's right (security).\nConditions:\n1- There must be an accused. If none, no need.\n2- Necessity due to weak evidence. Origin is prohibition.\n3- Permission of Sharia judge.\n4- Skilled doctor.\n5- Heirs don't drop their right.\nThird Section: Pathological Autopsy. To know disease causes for prevention. Disputed.",
    "foot_note": "1. (1) Narrated by Al-Bukhari",
    "book_id": "945",
    "new_page_number": 74
  },
  {
    "serial_number": "4635898",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "Correct view: Permissible with valid purpose, e.g., feared infectious disease. Public interest (health) precedes private (dead's sanctity). Forensic/Pathological allowed after burial for great interest, but Educational not allowed after burial.\nScholars mentioned Exhumation permissible in cases:\n1- Buried without washing (Majority allow if not decomposed).\n2- Buried facing non-Qibla (Shafi'is/Hanbalis allow reburying).\n3- Buried before prayer (Hanbalis/Malikis allow exhuming to pray).\n4- Buried without shroud (Hanbalis allow).\n5- Buried in usurped land (Agreed allowed).\n\n**The Fourth Issue: Transporting the Dead from One Country to Another.**",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 75
  },
  {
    "serial_number": "4635899",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "Transporting the dead is not new but easier now. Is it permissible?\nFirst: Cases where transport is not allowed:\n1- If it leads to violating sanctity or changing the body (long duration). Must be buried in place.\n2- Martyrs: Must be buried where they fell. Hadith of Uhud martyrs returned to their places.\n3- Transport for necessity is permissible, e.g., died in disbeliever land, fearing tampering with body.\nOther than these: If requested to be buried in homeland or holy land, or family wants to transport? Disagreement:\n1- Hanbalis/Malikis: Permissible (Broadest view, even after burial).",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 76
  },
  {
    "serial_number": "4635900",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "2- Hanafis: Makruh except short distance (1-2 miles). Narrowest view.\n3- Shafi'is: Detail. Permissible to holy land, forbidden to others. Provided no change in body occurs.\nEvidence for permissibility:\n- Moses asked to be brought near Holy Land.\n- Umar asked to be buried next to Prophet.\n- Sa'd bin Abi Waqqas transported from Aqiq to Baqi'.\n- Abd al-Rahman bin Abu Bakr transported.\nHowever, Sunnah is burying where died. Prophet didn't order transporting from Medina to Mecca.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 77
  },
  {
    "serial_number": "4635901",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "Narrations interpreted for short distances. Conclusion: Permissible in two cases:\n1- Short distance (10-20 km).\n2- Died in disbeliever land, transported to Muslim land.\nOtherwise not prescribed because:\n- Companions didn't transport dead.\n- Sunnah is hastening burial.\n- Hardship/cost on family.\n\n**The Fifth Issue: Sitting for Condolences.**\nIs it prescribed?\n1- Not prescribed (Some scholars, Ibn Uthaymeen). Condolences in mosque/market. Evidence: Jarir's hadith \"We counted gathering... as wailing.\"",
    "foot_note": "1. (1) Agreed upon.",
    "book_id": "945",
    "new_page_number": 78
  },
  {
    "serial_number": "4635902",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "2- Permissible/Okay (Al-Khallal, Ahmad, Ibn Baz). Evidence: Aisha's hadith \"Prophet sat... sorrow known in him.\" He forbade wailing, not sitting. So it appears permissible provided no prohibitions (extravagance, lights, food). Food should be for afflicted only. Chairs, reciters, lectures are innovations.\n\n**The Sixth Issue: Preaching in Graveyard.**",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 79
  },
  {
    "serial_number": "4635903",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "Al-Bukhari titled: Chapter of preaching at grave and sitting around. Okay if private/casual like Prophet did (Ali's hadith). But standing as Khatib/Preacher was not done.\n\n**The Seventh Issue: Bringing Drinks to Graveyard.**\nPermissible? Wisdom of visiting is remembering death/Hereafter, detaching from world (food/drink). Bringing drinks contradicts this. At least not prescribed. Not done by Salaf.",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 80
  },
  {
    "serial_number": "4635904",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "Safer to avoid. Water for need taken outside from coolers. May lead to expansion/prohibitions.\n\n**The Eighth Issue: Talking Worldly Matters in Graveyard via Phones.**\nContradicts wisdom of remembering Hereafter. Disliked by scholars.\n\n**Index**\nIntroduction ... 2\nDefinition of Nawazil ... 3\nImportance ... 4\nWater Changed by Rust/Detergents ... 6\nDry Cleaning ... 11\nDentures ... 11\nNail Polish ... 14\nArtificial Nails ... 15\nHair Dyes ... 16\nArtificial Eyelashes ... 17\nCreams/Powders ... 18\nCatheter/Colostomy ... 19\nKidney Dialysis ... 21\nSewage Purification ... 24\nOrgan Transplant ... 29\nDetergents with Impurities ... 33\nCalculation for Prayer Times ... 37\nPants ... 40\nCarrying Pictures ... 41\nAdhan via Recorder ... 43\nFollowing Radio Adhan ... 43\nTurning in Adhan ... 44\nEcho ... 46",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 81
  },
  {
    "serial_number": "4635905",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Fiqh of Contemporary Issues in Worship",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "Determining Qibla ... 47\nPrayer in Ship/Plane ... 48\nSmoker Attending Mosque ... 49\nSeparating Women's Area ... 50\nBarrier between Men/Women ... 51\nFollowing Imam via Media ... 53\nFollowing Imam via Speakers ... 55\nHeater in Front ... 57\nMissing Congregation for Need ... 58\nCombining for Need ... 58\nSpeaking during Khutbah (Organizers) ... 61\nWorking during Khutbah ... 63\nTranslating Khutbah ... 64\nEclipse Definition ... 67\nPublishing Eclipse Time ... 68\nCloud during Eclipse ... 68\nDoubt in Eclipse ... 69\nNa'y (Death Announcement) ... 70\nForms of Na'y ... 70\nHolding Body for Debt ... 72\nAutopsy ... 74\nTransporting Dead ... 81\nSitting for Condolences ... 84\nPreaching at Grave ... 85\nDrinks at Graveyard ... 85\nWorldly Talk at Graveyard ... 86 ...",
    "foot_note": "None",
    "book_id": "945",
    "new_page_number": 82
  }
]