[
  {
    "serial_number": "4644326",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: مسائل فقهية الكتاب : واحفظوا أيمانكم المؤلف : عبد المنان التالبي عدد الصفحات : 80 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nالكتاب : واحفظوا أيمانكم المؤلف : عبد المنان التالبي عدد الصفحات : 80 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nالمؤلف : عبد المنان التالبي عدد الصفحات : 80 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nعدد الصفحات : 80 [ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\n[ البحث غير مطبوع ] تاريخ النشر بالشاملة : 1 ربيع الأول 1442\nتاريخ النشر بالشاملة : 1 ربيع الأول 1442",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 1
  },
  {
    "serial_number": "4644327",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "{وَاحْفَظُوا أَيْمَانَكُمْ} تأليف د/ عبدالمنان التالبي مع ملحق بالفتاوى الشرعية حول الأيمان لفضيلة القاضي العلامة/ محمد بن إسماعيل العمراني قدم للكتاب القاضي العلامة / محمد بن اسماعيل العمراني الشيخ العلامة الدكتور/ حسن محمد مقبولي الأهدل الشيخ / محمد الصادق مغلس",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 2
  },
  {
    "serial_number": "4644328",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "مقدمة: القاضي العلامة / محمد بن اسماعيل العمراني حفظه الله الحمد لله رب العالمين والصلاة والسلام على سيد الأنبياء والمرسلين وعلى آله الطيبين الطاهرين وعلى الصحابة الغر الميامين وعلى التابعين لهم بإحسان إلى يوم الدين … وبعد: فهذا كتاب (واحفظوا أيمانكم) الذي دبجه يراع ولدي العزيز العالم الشاب النشيط: عبد المنان التالبي لمن أحسن المؤلفات العلمية التي خرجت في هذه الأيام لأنه قد تكلم في مؤلفه هذا بكلام جيد وقوي مركز كل مسئلة بدليها الصحيح ولم يحتج بأحاديث نبوية إلا ما كان صحيحا مخرجا وقد نزهه عن الحديث الضعيف ولم يتساهل في الاحتجاج بالأحاديث الواهية لا في الترهيب ولا في الوجوب والتحريم فهو كتاب تشد إليه الرحال ويكتب بماء الذهب لما فيه من الفوائد التي لا تحصى ومن المسائل القيمة التي لا تنحصر فرضي الله عنه وجزاه الله خيراً وزاد في الشباب من أمثاله آمين وسبحان الله وبحمده سبحان الله العظيم ربيع ثاني سنة 1430 هـ محمد بن اسماعيل العمراني",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 3
  },
  {
    "serial_number": "4644329",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "مقدمة: القاضي العلامة / محمد بن اسماعيل العمراني حفظه الله",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 4
  },
  {
    "serial_number": "4644330",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "مقدمة الشيخ / محمد الصادق مغلس",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 5
  },
  {
    "serial_number": "4644331",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم  المقدمة: الحمد لله رب العالمين، والصلاة والسلام على رسوله الأمين وعلى آله الطاهرين وأصحابه الراشدين، والتابعين لهم بإحسان إلى يوم الدين … أما بعد: فإن من أعظم القُرب وأجل الطاعات التفقه في الدين، ولذا ندب الله تعالى إليه في كتابه الكريم فقال: {وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُوا كَآفَّةً فَلَوْلا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَآئِفَةٌ لِّيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ} ومدح النبي صلى الله عليه وسلم المتفقهين في الدين وبين أن الله أراد بهم خيراً حين ندبهم صوب هذه الغاية الشريفة، فقال صلى الله عليه وسلم: «من يرد الله به خيراً يفقهه في الدين» متفق عليه. وبهذا يتبين فضل التفقه في الدين على سائر العلوم، وإن من الفقه في الدين تبصير الناس بأمور دينهم وتحذيرهم من مضلات الهوى ومنزلقات الإغواء ،والأخذ بأيديهم إلى جادة الحق والصواب. وما من باب من أبواب الفقه إلا وتجد أن للناس فيه شيئاً من المخالفات الشرعية ومن هذا ما يخص الأيمان فإن الناظر إلى حال البعض اليوم يجد أنهم قد حادوا عن هدي النبي صلى الله عليه وسلم في هذا الباب وذلك بحلفهم بغير أسماء الله تعالى وصفاته بصيغ وألفاظ متعددة منذ عهد قديم وهذا الكتاب على حجمه الصغير عالجت فيه موضوعات مهمة في باب الأيمان وما يتعلق بها من أحكام وما يلحق بها من مخالفات استهان بها الناس كالحلف بالحرام ،والحلف بالطلاق ،والحلف باليمين الزبيرية الذي ما زال البعض يحلف بها ويعتقدها إلى",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 6
  },
  {
    "serial_number": "4644332",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "يومنا هذا رغم أنها حرام وشرك لا يجوز الحلف بها. كما تطرقت إلى عقوبة اليمين الفاجرة وما يترتب عليها في الدنيا والآخرة لينزجر بذلك من يستهين باليمين ،ويقسم الأيمان الكاذبة ليقتطع بها حقوق الآخرين بغير حق ، وقد حرصت على أن تكون مسائل هذا الكتاب مقترنة بالدليل الشرعي من الكتاب والسنة الصحيحة، مع عزو الأقوال إلى قائليها في مصادرها المعتبرة؛ ليسهل على المطلع فهمها ،والاستفادة منها. وقد استفدت كثيرا من تصويبات وملحوظات مشائخي الأجلاءالذين راجعوا هذا البحث وقدموا له. وإتماماً للفائدة فقد جمعت ما تيسر لي جمعه من فتاوى لفضيلة شيخنا القاضي العلامة /محمد بن إسماعيل العمراني حول الأيمان بصيغها المختلفة ،ومخالفاتها المتعددة ،سائلاً المولى عز وجل أن يجعل هذا الجهد المتواضع خالصاً لوجهه الكريم وأن ينفع به إنه حميد مجيد. كتبه الفقير إلى الله/ عبد المنان التالبي altalaby 10@hotmayl.com",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 7
  },
  {
    "serial_number": "4644333",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "واحفظوا أيمانكم سنتحدث في ظلال هذا التوجيه الرباني الكريم عن اليمين ، وأحكامها ، وكفارتها، وما يتعلق بها من مخالفات في أربعة مباحث على النحو التالي: ـ المبحث الأول: اليمين. ـ المبحث الثاني: أقسام اليمين. ـ المبحث الثالث: أحكام اليمين. ـ المبحث الرابع: كفارة اليمين.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 8
  },
  {
    "serial_number": "4644334",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": " المبحث الأول: اليمين  مقدمة: اليمين وسيلة شرعية من وسائل إثبات الحق، عرفت منذ أقدم العصور، وتعددت أشكالها وطرق أدائها في المجتمعات، بحسب العقائد والأديان والأفكار. وقد كانت سائدة عند العرب في الجاهلية؛ فأقرها الشارع الحكيم بما يتفق مع العقيدة السليمة البعيدة عن الشرك. وقد بقيت اليمين في الشرائع والقوانين حتى عصرنا الحاضر، رغم تباين العقائد وشيوع المذاهب الإلحادية والمادية. وسأتناولها في خمسة مطالب: - المطلب الأول: تعريف اليمين - معانيها - سبب تسميتها. المطلب الثاني: مشروعية اليمين - حكمها - شروطها. المطلب الثالث: صفة اليمين- حكم الحلف بغير الله- صور من الحلف بغير الله. المطلب الرابع: الأمر بحفظ الأيمان، والتحذير من الحلف الكاذب. المطلب الخامس: -صيغ أيمان النبي صلى الله عليه وسلم وأصحابه رضوان الله عليهم التي كانوا يحلفون بها.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 9
  },
  {
    "serial_number": "4644335",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": " المطلب الأول: تعريف اليمين - معانيها- سبب تسميتها  أولاً: تعريف اليمين: اليمين لغة: أصلها اليد اليمنى وجمعها أيمان وأيمُنٌ (1) ، ومنه قوله تعالى: {وَمَا تِلْكَ بِيَمِينِكَ يَا مُوسَى} (2) . ومن معانيها: (أ) القوة (3) ، ومنه قوله تعالى: {لأَخَذْنَا مِنْهُ بِالْيَمِينِ} (4) (ب) الجهة (5) ، ومنه قوله تعالى: (عَنِ الْيَمِينِ وَعَنِ الشِّمَالِ عِزِينَ) (6) (ج) الحلف والقسم والعهد (7) ، ومنه قوله تعالى: (وَأَقْسَمُوا بِاللَّهِ جَهْدَ أَيْمَانِهِمْ. .) (8) . وقوله تعالى: (وَإِنْ نَكَثُوا أَيْمَانَهُمْ مِنْ بَعْدِ عَهْدِهِمْ. .) (9) . واليمين في الشرع: \" هي توكيد الشيء بذكر اسم أو صفة لله\" وهذا أخصر التعاريف … وأقربها (10) .  ثانياً: سبب تسميتها: سمي الحلف يميناً: لأنهم كانوا إذا تحالفوا ضرب كل واحد منهم يمينه على يمين صاحبه فسمي الحلف يميناً مجازاً (11) . -وقيل: لأن اليد اليمنى من شأنها الحفظ للشيء ، فسمي الحلف بذلك لحفظ المحلوف عليه، وسمي المحلوف عليه يميناً لتلبسه بها (12) . _ وقيل: لأن الحلف يتقوى بالقسم (13) . _ وقيل: لإفادته القوة على المحلوف عليه من الفعل والترك (14) .",
    "foot_note": "1. المصباح المنير في غريب الشرح الكبير للرافعي، تأليف العلامة المقري الفيومي، (351). \n2. سورة طه الآية (17). \n3. المصباح المنير في غريب الشرح الكبير للرافعي، تأليف العلامة المقري الفيومي، (351). \n4. الحاقة، الآية (45). \n5. المصباح المنير في غريب الشرح الكبير للرافعي، تأليف العلامة المقري الفيومي، (351). \n6. المعارج (37). \n7. لسان العرب لابن منظور (13/ 458)، نزهة الأعين النواظر، تأليف أبي الفرج ابن الجوزي (1/ 642). \n8. النحل (38). \n9. التوبة (12). \n10. فتح الباري في شرح صحيح البخاري، للحافظ ابن حجر، (11/ 629). \n11. المصباح المنير في غريب الشرح الكبير للرافعي، تأليف العلامة المقري الفيومي (852). \n12. فتح الباري شرح صحيح البخاري، للحافظ ابن حجر، (11/ 629). \n13. رد المحتار على الدر المختار شرح تنوير الأبصار (13/ 490). \n14. المرجع السابق.",
    "book_id": "85",
    "new_page_number": 10
  },
  {
    "serial_number": "4644336",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": " المطلب الثاني: مشروعية اليمين -حكمها- شروطها  أولاً: مشروعية اليمين: الأصل في مشروعيتها وثبوت حكمها الكتاب والسنة والإجماع. أما الكتاب فقول الله سبحانه وتعالى: {لا يُؤَاخِذُكُمْ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمْ الأَيْمَانَ. .} (1) . وقوله تعالى: {وَلا تَنقُضُوا الأَيْمَانَ بَعْدَ تَوْكِيدِهَا. .} (2) . وأمر الله نبيه صلى الله عليه وسلم بالحلف في ثلاثة مواضع: - قال تعالى: {وَيَسْتَنْبِئُونَكَ أَحَقٌّ هُوَ قُلْ إِي وَرَبِّي إِنَّهُ لَحَقٌّ وَمَا أَنْتُمْ بِمُعْجِزِينَ} (3) . - وقال سبحانه: {قُلْ بَلَى وَرَبِّي لَتَأْتِيَنَّكُمْ} (4) - وقال سبحانه {قُلْ بَلَى وَرَبِّي لَتُبْعَثُنَّ} (5) . وأما السنة فقول النبي صلى الله عليه وسلم: \" والله إن شاء الله، لا أحلف على يمين فأرى غيرها خيراً منها إلا أتيت الذي هو خير وتحللتها\" (6) . وكان أكثر قسم النبي صلى الله عليه وسلم \"ومصرف القلوب _ ومقلب القلوب _ والذي نفسي بيده \" كما سيأتي لاحقاً. _ وقد يعتري اليمين الأحكام الخمسة فيكون حكمها حكم ما تفضي إليه: من الوجوب ، أو الحرمة ، أو الندب ، أو الكراهه ، أو الإباحة. وأجمعت الأمة على مشروعية اليمين ، وثبوت حكمها ، ووضعها في الأصل لتوكيد المحلوف عليه (7) .",
    "foot_note": "1. المائدة الآية (89). \n2. النحل الآية (91). \n3. يونس الآية (53). \n4. سبأ (3). \n5. التغابن (7). \n6. رواه البخاري (11/ 688) برقم (6680)، ومسلم (11/ 101) برقم (1649). \n7. المغني (13/ 217، 218)",
    "book_id": "85",
    "new_page_number": 11
  },
  {
    "serial_number": "4644337",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": " ثانياً: كراهة الإكثار من اليمين: الأصل عدم الإكثار من اليمين، لقوله تعالى: {وَاحْفَظُوا أَيْمَانَكُمْ. . .} (1) قيل: أراد به ترك الحلف. أي: لا تحلفوا. وقيلَ وهو الأصحَ: أراد به إذا حلفتم فلا تحنثوا (2) . ويكره الإفراط في الحلف بالله تعالى؛ لقوله تعالى: {وَلا تُطِعْ كُلَّ حَلَاّفٍ مَهِينٍ} (3) وهذا ذم له يقتضي كراهة فعله، فإن لم يخرج إلى حد الإفراط فليس بمكروه إلا أن يقترن به ما يوجب كراهته (4) .  ثالثاً: ركن اليمين القضائية وشروطها: اشترط الفقهاء بالاتفاق على ستة شروط في اليمين القضائية وهي: 1 - أن يكون الحالف مكلفاً (بالغاً، عاقلا، مختاراً) فلا يحلف الصبي والمجنون ولا تعتبر يمين النائم والمستكره. 2 - أن يكون المدعى عليه منكراً حق المدعي فإن كان مقراً فلا حاجة للحلف. 3 - أن يطلب الخصم اليمين من القاضي أو يوجهها القاضي إلى الحالف. 4 - أن تكون اليمين شخصية فلا تقبل اليمين بالنيابة لصلتها بذمة الحالف ودينه فلا يحلف الوكيل أو ولي القاصر ويوقف الأمر حتى يبلغ. 5 - أن لا تكون في الحقوق الخالصة لله تعالى كالحدود والقصاص. 6 - أن تكون في الحقوق التي يجوز الإقرار بها، فلا تجوز اليمين في الحقوق التي لا يجوز الإقرار بها، فلا يحلف الوكيل والوصي والقيم؛ لأنه لا يصح إقرارهم على الغير (5) . وركنها: - اللفظ المستعمل فيها. (6)",
    "foot_note": "1. المائدة (89). \n2. تفسير البغوي (3/ 93). \n3. القلم (10). \n4. المغني (13/ 223، 228) ، الشرح الممتع لابن عثيمين (341). \n5. الفقه الإسلامي وأدلته (6/ 597). \n6. رد المحتار على الدر المختار شرح تنوير الأبصار (5/ 472).",
    "book_id": "85",
    "new_page_number": 12
  },
  {
    "serial_number": "4644338",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": " المطلب الثالث: صفة اليمين - حكم الحلف بغير الله - صور من الحلف بغير الله  أولاً: صفة اليمين: واليمين لا تكون إلا باسم من أسماء الله تعالى، أو صفة من صفاته سبحانه، سواءً أكانت من صفات الذات أم من صفات الأفعال. وأدلة الحلف باسم الله عز وجل ظاهرة؛ ومن ذلك قول النبي صلى الله عليه وسلم: \"من كان حالفاً فليحلف بالله أو ليصمت\" (1) وعند أبي داود والترمذي بلفظ: \"أو ليسكت\" (2) وفي رواية لمسلم: \"من كان حالفاً فلا يحلف إلا بالله\" (3) . قال الإمام النووي - في شرحه للحديث السابق-: \"وفي الحديث إباحة الحلف بالله تعالى وصفاته كلها وهذا مجمع عليه\" (4) . أما الحلف بصفات الفعل؛ فلحلفه صلى الله عليه وسلم بمقلب القلوب، وبمصرف القلوب. ففي صحيح البخاري من حديث ابن عمر رضي الله عنهما قال: \"كانت يمين النبي صلى الله عليه وسلم لا ومقلب القلوب\" (5) . وفي سنن ابن ماجة \"ومصرف القلوب\" (6) . قال الحافظ في الفتح: \"قال القاضي أبو بكر بن العربي: في الحديث - يشير إلى حديث لا ومقلب القلوب- جواز الحلف بأفعال الله إذا وصف بها ولم يذكر اسمه (7) \". وأما الحلف بصفات الذات فلما، أخرجه الترمذي والنسائي من حديث أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \" لما خلق الله الجنة أرسل جبريل، فقال: انظر إليها، وإلى ما أعددت لأهلها فيها. فنظر إليها، فرجع، فقال: لا وعزتك لا يسمع بها أحد إلا دخلها\" (8) .",
    "foot_note": "1. البخاري مع فتح الباري (11/ 646)، برقم (6646). \n2. تحفة الأحوذي (4/ 478)، وصححه الألباني في صحيح سنن ابن ماجة برقم (2094). \n3. صحيح مسلم بشرح النووي (11/ 96) برقم (1646). \n4. صحيح مسلم بشرح النووي (11/ 95، 96). \n5. سبق تخريجهما. \n6. سبق تخريجهما. \n7. فتح الباري (11/ 642). \n8. أخرجه الترمذي (4/ 693) برقم (2560) ، وحسنه الألباني في صحيح سنن الترمذي برقم (2698).",
    "book_id": "85",
    "new_page_number": 13
  },
  {
    "serial_number": "4644339",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "وقد بوب البخاري في صحيحه - باب الحلف بعزة الله وصفاته وكلماته - وأورد أحاديث فيها: منها حديث ابن عباس رضي الله عنهما: كان النبي صلى الله عليه وسلم يقول: \" أعوذ بعزتك\" وحديث أبي هريرة عن النبي صلى الله عليه وسلم: \"يبقى رجل بين الجنة والنار؛ فيقول: يارب اصرف وجهي عن النار لا وعزتك لا أسألك غيرها\" (1) . ففي الأحاديث السابقة وأمثالها جواز الحلف بصفات الله تعالى كالعزة ونحوها من القدرة والجلال والكبرياء والعظمة.  ثانيا: حكم الحلف بغير الله: الحلف بغير الله غير جائز، قد ورد المنع منه وأنه شرك، ففي سنن أبي داود من حديث ابن عمر- رضي الله عنهما قال: سمعت النبي صلى الله عليه وسلم يقول: \"من حلف بغير الله فقد أشرك\" (2) . وفي رواية الترمذي: \"فقد كفر أو أشرك \" (3) . قال الحافظ ابن حجر: \"والتعبير بقوله فقد كفر أو أشرك للمبالغة في الزجر والتغليظ في ذلك\" (4) . وقال ابن عبدالبر: \"أجمع العلماء على أن اليمين بغير الله مكروهة منهي عنها لا يجوز لأحد الحلف بها\" (5) . _ وهذا النوع من الشرك: يسمى شرك الألفاظ وهو من الشرك الأصغر كالحلف بالآباء والكعبة والأمانة .... إلخ. والحكمة من النهي عن الحلف بغير الله\" أن الحلف بالشيء يقتضي تعظيمه، والعظمة في الحقيقة إنما هي لله وحده، فلا يضاهي به غيره\" (6) . \"ولأن من حلف بغير الله فقد عظم غير الله تعظيماً يشبه تعظيم الرب تبارك وتعالى، ولهذا سمي شركاً لكونه أشرك غير الله مع الله تعالى في تعظيمه بالقسم به. . . \" (7)",
    "foot_note": "1. فتح الباري (11/ 664). \n2. عون المعبود شرح سنن أبي داوود (6/ 155)، برقم (3249) ، وصححه الألباني في صحيح سنن الترمذي برقم (1590). \n3. تحفة الأحوذي بشرح جامع الترمذي (4/ 479)، رقم (1535) وصححه الألباني في الإرواء برقم (2561). \n4. فتح الباري (11/ 647، 684). \n5. فتح الباري (11/ 647، 684). \n6. فتح الباري (11/ 647، 684). \n7. المغني (13/ 222، 223).",
    "book_id": "85",
    "new_page_number": 14
  },
  {
    "serial_number": "4644340",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": " ثالثاً: صور من الحلف بغير الله: تعددت صور الحلف بغير الله قديماً وحديثاً، وتهاون بها الناس، غير آبهين بما ورد فيها من نصوص زاجرة. وسأذكر طرفاً من هذه الصور رغم كثرتها وتعددها، لكن يشملها قول النبي صلى الله عليه وسلم: \"كل يمين يحلف بها دون الله شرك\" ( 1). 1) الحلف بالآباء والأمهات: وهو حلف المشركين في الجاهلية، فقد كانت قريش تحلف بآبائها، وقد ورد النهي عنه في ديننا ففي البخاري ومسلم من حديث ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم أدرك عمر بن الخطاب رضي الله عنه وهو يسير في ركب - يحلف بأبيه ـ فقال: \"ألا إن الله ينهاكم أن تحلفوا بآبائكم. . . (2) \". قال عمر: فوالله ما حلفت بها منذ سمعت النبي صلى الله عليه وسلم ذاكراً ولا آثراً. والمعنى: ما حلفت بها ولا حكيت ذلك عن غيري. وفي سنن أبي داود من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا تحلفوا بآبائكم ولا بأمهاتكم. . . (3) \"  2) الحلف بالأنداد والطواغيت: لحديث عبدالرحمن بن سمرة رضي الله عنه ــ أنَ النبي صلى الله عليه وسلم قال: \"لا تحلفوا بالطواغي. . . \" (4) وعند النسائي \"ولا بالطواغيت\" (5) ، والطواغي جمع طاغية، وهي الأصنام، سمي باسم المصدر لطغيان الكفار بعبادته لأنه سبب طغيانهم وكفرهم (6) . وفي سنن أبي داود من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله ولا تحلفوا إلا وأنتم صادقون\" (7) .",
    "foot_note": "1. مستدرك الحاكم برقم (44) وصححه الألباني في صحيح الترغيب والترهيب (3/ 131)، برقم (2952). \n2. فتح الباري (11/ 645 - 646) برقم (6646)، وصحيح مسلم بشرح النووي (11/ 95) برقم (1646). \n3. عون المعبود (6/ 154) برقم (3246) وصححه الألباني في صحيح سنن أبي داود برقم (3248). \n4. صحيح مسلم (11/ 98) برقم (1648). \n5. سنن النسائي (7/ 10) برقم (7383) وصححه الألباني في صحيح سنن النسائي برقم (3774). \n6. صحيح مسلم (11/ 98) برقم (1648). \n7. سبق تخريجه.",
    "book_id": "85",
    "new_page_number": 15
  },
  {
    "serial_number": "4644341",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": " 3) الحلف باللات والعزى: في البخاري ومسلم من حديث أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"من حلف فقال في حلفه باللات والعزى فليقل لا إله إلا الله. . . \" (1) .  4) الحلف بالبراءة من الإسلام: في سنن النسائي وأبي داود عن عبدالله بن بريدة عن أبيه قال: قال رسول الله صلى الله عليه وسلم: \"من حلف فقال إني بريء من الإسلام فإن كان كاذباً فهو كما قال: وإن كان صادقاً فلن يرجع إلى الإسلام سالماً\" (2) . 5) الحلف بملة غير ملة الإسلام: في البخاري عن ثابت بن الضحاك رضي الله عنه قال: قال النبي صلى الله عليه وسلم: \"من حلف بغير ملة الإسلام فهو كما قال. . . \" (3) . وفي مستدرك الحاكم من حديث أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: \"من حلف على يمين فهو كما حلف، إن قال هو يهودي فهو يهودي، وإن قال هو نصراني فهو نصراني، وإن قال هو بريء من الإسلام فهو بريء من الإسلام\" (4) .  6) الحلف بالأمانة في سنن أبي داود من حديث عبدالله بن بريده عن أبيه قال: قال رسول الله صلى الله عليه وسلم: \"من حلف بالأمانة فليس منا\" (5) . - وفي مسند أحمد بلفظ: \"ليس منا من حلف بالأمانة\" (6) .",
    "foot_note": "1. فتح الباري (11/ 653) برقم (6650)، ومسلم بشرح النووي (11/ 97) برقم (1647). \n2. عون المعبود (6/ 159) برقم (3255)، وصححه الألباني في الإرواء (8/ 201). \n3. فتح الباري (11/ 655) برقم (6652). \n4. مستدرك الحاكم برقم (7900) وصححه الألباني في صحيح الترغيب (3/ 131) برقم (2956). \n5. عون المعبود (6/ 156) برقم (3251)، وصححه الألباني في صحيح الجامع برقم (6203). \n6. مسند أحمد (38/ 82) ، وصححه الألباني في صحيح الجامع (2/ 956) برقم (5436).",
    "book_id": "85",
    "new_page_number": 16
  },
  {
    "serial_number": "4644342",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": " 7) الحلف بالكعبة . في سنن الترمذي من حديث ابن عمر رضي الله عنهما أنه سمع رجلاً يقول: لا والكعبة. فقال ابن عمر: لا تحلف بغير الله، فإني سمعت رسول الله صلى الله عليه وسلم يقول: \"من حلف بغير الله فقد كفر أو أشرك\" (1) . وسمع أمير المؤمنين عمر رضي الله عنه ابن الزبير يحلف بالكعبة فقال له: لو أعلم أنك فكرت فيها قبل أن تحلف لعاقبتك، احلف بالله فأثم أو ابرر (2) . وفي سنن النسائي من حديث عبدالله بن يسار عن قتيلة بنت صيفي رضي الله عنهما أن يهودياً أتى النبي صلى الله عليه وسلم فقال: إنكم تنددون وإنكم تشركون، تقولون ما شاء الله وشئت وتقولون والكعبة فأمرهم النبي صلى الله عليه وسلم إذا أرادوا أن يحلفوا أن يقولوا ورب الكعبة، ويقولوا ما شاء الله ثم شئت\" (3) . وفي رواية لها: \"من حلف فليحلف برب الكعبة\" (4) . وفي حديث أبي رمثة قال: انطلقت مع أبي نحو النبي صلى الله عليه وسلم ثم إن النبي صلى الله عليه وسلم قال لأبي: آبنك هذا؟ قال أبي: ورب الكعبة قال حقاً قال: أشهد به. قال: فتبسم رسول الله ضاحكاً\" (5) .",
    "foot_note": "1. تحفة الأحوذي (4/ 479) برقم (1535)، وصححه الألباني في صحيح الترغيب برقم (2952). \n2. المحلى لابن حزم (8/ 46). \n3. سنن النسائي (7/ 6) وصححه الشيخ مقبل الوادعي في الجامع الصحيح (4/ 453). \n4. المعجم الكبير للطبراني (18/ 192) وصححه الشيخ مقبل الوادعي في الجامع الصحيح (2/ 1068). \n5. مسند الإمام أحمد (11/ 680) وصححه الشيخ مقبل الوادعي في الجامع الصحيح (4/ 467).",
    "book_id": "85",
    "new_page_number": 17
  },
  {
    "serial_number": "4644343",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": " المطلب الرابع: الأمر بحفظ الأيمان - والتحذير من الحلف الكاذب  أولاً: الأمر بحفظ الأيمان: أمر الله سبحانه وتعالى بحفظ الأيمان فقال: {وَاحْفَظُوا أَيْمَانَكُمْ. . .} قال الإمام البغوي: \" أراد به إذا حلفتم فلا تحنثوا ، فالمراد منه حفظ اليمين عن الحنث .. \" (1) . قال الإمام القرطبي: والمعنى: \" لا تستكثروا من اليمين بالله\" (2) وذم الله المكثرين للحلف فقال: {وَلا تُطِعْ كُلَّ حَلَاّفٍ مَهِينٍ} وهذا ذم له يقتضي كراهة فعله. قال الشوكاني ـفي تفسير الآية: - \"كثير الحلف بالباطل، وقد كانت العرب في الجاهلية تتمادح بقلة الأيمان حتى قال قائلهم: قليل الألايا حافظ ليمينه ** وإن بدرت منه الأليةُ برّت (3) \" وقد بين الله في كتابه أن من صفات المنافقين كثرة الحلف بالباطل قال عز وجل في شأنهم: {يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَنْ يُرْضُوهُ إِنْ كَانُوا مُؤْمِنِينَ} (4) . وفي البخاري ومسلم من حديث عبدالله بن مسعودـ رضي الله عنه ـقال: سئل النبي صلى الله عليه وسلم أيُّ الناس خير؟ قال: قرني ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادةُ أحدهم يمينه ويمينُه شهادته\" (5) . قال الإمام النووي: \"هذا ذم لمن يشهد ويحلف مع شهادته\" (6) . وقال الإمام الطحاوي: \"أي يكثرون الأيمان في كل شيء حتى يصير لهم عادة فيحلف أحدهم حيث لا يراد منه اليمين ومن قبل أن يستحلف\" (7) .",
    "foot_note": "1. تفسير البغوي (2/ 80). \n2. الجامع لأحكام القرآن (3/ 97). \n3. فتح القدير (264).والألية هي: اليمين. \n4. التوبة (62). \n5. فتح الباري (11/ 662) برقم (6658) ومسلم بشرح النووي (16/ 79) برقم (2533). \n6. صحيح مسلم بشرح النووي (4/ 1962). \n7. فتح الباري (11/ 663).",
    "book_id": "85",
    "new_page_number": 18
  },
  {
    "serial_number": "4644344",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "ورع الصحابة عن الحلف بغير الله وحفظهم لأيمانهم: قال ابن مسعود رضي الله عنه: لأن أحلف بالله كاذباً أحب إليّ من أن أحلف بغير الله صادقاً، وورد مثل قوله عن ابن عمر (1) وابن عباس ــ رضي الله عنهما ــ قال شيخ الإسلام ابن تيمية: معلقاً على كلام ابن مسعود: \"لأن حسنة التوحيد أعظم من حسنة الصدق، وسيئة الكذب أسهل من سيئة الشرك، قال تعالى: {إِنَّ اللَّهَ لا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ} (2) . وعندما بلغ أمير المؤمنين عمر رضي الله عنه النهي من النبي صلى الله عليه وسلم عن الحلف بالآباء قال: \"والله ما حلفت بها منذ سمعت النبي صلى الله عليه وسلم ذاكراً ولا آثراً\" (3) . وعند ما سمع عمر ابن الزبير يحلف بالكعبة قال: \"لو أعلم أنك فكرت فيها قبل أن تحلف لعاقبتك، احلف بالله فأثم أو ابرر\" (4) . وروي عن جبير بن مطعم رضي الله عنه أنه افتدى يمينه بعشرة آلاف درهم، ثم قال: \"ورب هذا المسجد لو حلفت حلفت صادقاً وإنما هو شيء افتديت به يميني\" (5) . قال الأشعث بن قيس: \"اشتريت يميني مرة بسبعين ألفاً\" (6) . وهكذا كان ورع من بعد الصحابة من التابعين وغيرهم في حفظهم لأيمانهم. قال عامر الشعبي _ رحمه الله_: \"ولأن أقسم بالله فأحنث أحب إلي من أن أقسم بغيره فأبر\" (7) . وقال إبراهيم النخعي _ رحمه الله _: \"وكان أصحابنا (مشايخنا) ينهوننا، ووردت بلفظ \"يضربوننا \" ونحن غلمان أن نحلف بالشهادة والعهد\". وفي هذا الرغبة في تمرين الصغار على طاعة ربهم ونهيهم عما يضرهم (8) . وأثر عن الشافعي أنه قال: \"ما حلفت بالله صادقاً ولا كاذبا\".",
    "foot_note": "1. إرواء الغليل (8/ 191). \n2. النساء (48). \n3. سبق تخريجه. \n4. سبق تخريجه. \n5. رواه الطبراني في الأوسط بإسناد جيد (1/ 270) برقم (881). \n6. معجم الطبراني الكبير، (1/ 234) رقم (639). \n7. فتح الباري (11/ 652). \n8. فتح الباري (11/ 662).",
    "book_id": "85",
    "new_page_number": 19
  },
  {
    "serial_number": "4644345",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": " ثانياً: - التحذير من الحلف الكاذب: حذر النبي صلى الله عليه وسلم من الحلف الكاذب ، ففي معجم الطبراني من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"إنَّ الله جل ذكره أذن لي أن أُحدث عن ديك قد مرقت رجلاه الأرض وعنقه مثنيٌ تحت العرش وهو يقول سبحانك ما أعظمك ربنا، فيردُّ عليه: ما علم ذلك من حلف بي كاذبا\" (1) . والحلف الكاذب من خصال النفاق قال تعالى-حاكياً عن حالهم-: {وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ} (2) ووصفهم بهذا الوصف في كثير من آيات القرآن الكريم، قال تعالى: {يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَنْ يُرْضُوهُ إِنْ كَانُوا مُؤْمِنِينَ} (3) وقال تعالى: {وَيَحْلِفُونَ بِاللَّهِ إِنَّهُمْ لَمِنْكُمْ وَمَا هُمْ مِنْكُمْ وَلَكِنَّهُمْ قَوْمٌ يَفْرَقُونَ) (4) . ويزداد إثم اليمين الكاذبة عندما تتعلق بحق آدمي ففي البخاري أن النبي صلى الله عليه وسلم قال: \" من حلف على يمين كاذبة ليقتطع بها مال رجل مسلم ــ أو قال أخيه- لقي الله عز وجل وهو عليه غضبان\" (5) فعلى المسلم أن يحذر من الأيمان الكاذبة، وأن يتحرى الصدق في يمينه فما عظَّم الله من حلف به كاذباً قال صلى الله عليه وسلم: \" احلفوا بالله وبروا واصدقوا فإن الله يحب أن يحلف به\" (6) .",
    "foot_note": "1. رواه الطبراني في المعجم الأوسط (7/ 220) برقم (7324) ، وصححه الألباني في صحيح الترغيب برقم (1839). \n2. المجادلة (14) \n3. التوبة (62) \n4. التوبة (56) \n5. صحيح البخاري (6/ 6283). \n6. أخرجه أبو نعيم في الحلية (7/ 267) ، وصححه الألباني في صحيح الجامع: (1/ 102)، برقم (211).",
    "book_id": "85",
    "new_page_number": 20
  },
  {
    "serial_number": "4644346",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": " المطلب الخامس: صيغ أيمان النبي صلى الله عليه وسلم وأصحابه رضوان الله عليهم التي كانوا يحلفون بها  أولاً: أيمان النبي صلى الله عليه وسلم التي كان يحلف بها: كانت يمين النبي صلى الله عليه وسلم التي كان يحلف بها ويكثر منها هي:  (أ) والله: ففي صحيح البخاري من حديث أم المؤمنين عائشة رضي الله عنها عن النبي صلى الله عليه وسلم أنه قال: \"يا أمة محمد والله لو تعلمون ما أعلم لبكيتم كثيراً ولضحكتم قليلاً\" (1) . ولما أخرجه الترمذي عن عبدالله بن عدي بن حمراء قال: \"رأيت رسول الله صلى الله عليه وسلم واقفاً على _الحزورة (2) _ فقال: \" والله إنك لخير أرض الله وأحب أرض الله إلى الله ولولا أني أُخرجت منك ما خرجت\" (3) .  (ب) والذي نفسي بيده: لما أخرجه البخاري عن جابر بن سمرة عن النبي صلى الله عليه وسلم قال: \" إذا هلك قيصر فلا قيصر بعده، وإذا هلك كسرى فلا كسرى بعده، والذي نفسي بيده لتنفقنَّ كنوزهما في سبيل الله\" (4) . وقد ورد هذا القسم عنه صلى الله عليه وسلم بعدة ألفاظ منها: \" والذي نفس محمد بيده \"، وبعضها مصدر بلفظ \" لا والذي نفسي بيده \"، وبعضها بلفظ \"أمَا والذي نفسي بيده\"، وبعضها بلفظ \"وأيم الذي نفسي بيده \"، وكلها ألفاظ ثبتت في الصحيح (5) . وعند أبي داود بلفظ: \"والذي نفس أبي القاسم بيده\" (6) .",
    "foot_note": "1. فتح الباري: (1/ 637) برقم (6631). \n2. قال ابن الأثير: \"هو موضع عند باب الحناطين\". وقال السهيلي: \"اسم سوق كانت بمكة وأدخلت في المسجد لما زيد منه \" ، تاج العروس (11/ 10). \n3. أخرجه أحمد في المسند (30/ 13) ، وحسنه الشيح مقبل الوادعي في الجامع الصحيح (4/ 459). \n4. فتح الباري (11/ 637) برقم (6629). \n5. فتح الباري (11/ 637 ـ 640) من رقم (6628 ـ 6645). \n6. أخرجه أبو يعلى في مسنده (11/ 462) ، وصححه الألباني في السلسلة الصحيحة برقم (2733).",
    "book_id": "85",
    "new_page_number": 21
  },
  {
    "serial_number": "4644347",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": " (ج) لا ومقلَّب القلوب: في البخاري من حديث ابن عمر قال كانت يمين النبي صلى الله عليه وسلم \"لا ومقلب القلوب\" (1) .  (د) لا ومصرف القلوب: لما أخرجه ابن ماجة من حديث ابن عمر قال: \" كان أكثر أيمانه لا ومصرف القلوب\" (2) .  (هـ) وربَّ الكعبة: لما أخرجه البخاري عن أبي ذر رضي الله عنه قال انتهيت إليه ـ إلى النبي صلى الله عليه وسلم وهو يقول في ظلَّ الكعبة: \"هم الأخسرون وربَّ الكعبة، هم الأخسرون ورب الكعبة. . . فقلت من هم بأبي أنت وأمي يا رسول الله؟ قال الأكثرون أموالاً إلَاّ من قال هكذا وهكذا وهكذا\" (3) .  ثانياً: أيمان الصحابة رضوان الله عليهم: كانت أيمان الصحابة رضوان الله عليهم كأيمان النبي صلى الله عليه وسلم فقد كانوا يحلفون كحلفه ويتأسون به صلى الله عليه وسلم ومن ذلك الآتي:  (أ) والله: وقد كان أكثر حلفهم به لحديث الأعرابي الذي جاء يسأل عن الإسلام وفيه أنه قال \"وَاللَّهِ لَا أَزِيدُ عَلَى هَذَا وَلَا أَنْقُصُ، قَالَ رَسُولُ اللَّه صلى الله عليه وسلم: أَفْلَحَ إِنْ صَدَقَ\" (4) . - وحديث عائشة وقد نفست في الحج أنها قالت: \" لوددت والله أني لم أحج العام .. \" (5) . - وحديث جابر في الخندق وفيه أن أمير المؤمنين عمر رضي الله عنه قال \" والله يا رسول الله ما كدت أصلي حتى كادت الشمس تغرب\" (6) .",
    "foot_note": "1. فتح الباري (11/ 637) برقم (6628). \n2. سنن ابن ماجه (1/ 677)، وصححه الألباني في صحيح الجامع (2/ 871). \n3. فتح الباري (11/ 639) برقم (6638). \n4. صحيح البخاري برقم (45). \n5. صحيح البخاري برقم (297). \n6. صحيح البخاري برقم (609)",
    "book_id": "85",
    "new_page_number": 22
  },
  {
    "serial_number": "4644348",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": " (ب) والذي نفسي بيده: كما في حديث نعيم المجمر، قال: صليت وراء أبي هريرة فقرأ بسم الله الرحمن الرحيم ثم قرأ بأم الكتاب حتى إذا بلغ \"غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلا الضَّالِّينَ \" قال: آمين فقال الناس: آمين فلما ركع قال: الله أكبر فلما رفع رأسه قال: سمع الله لمن حمده ثم قال: الله أكبر ثم سجد فلما رفع قال: الله أكبر فلما سجد قال: الله أكبر فلما رفع قال: الله أكبر ثم استقبل قائماً مع التكبير فلما قام من الثنتين قال: الله أكبر فلما سلم قال: والذي نفسي بيده إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم \" (1) .  (ج) وربَّ الكعبة: لحديث أبي رمثة قال: انطلقت مع أبي نحو النبي صلى الله عليه وسلم ثم إنَّ النبي صلى الله عليه وسلم قال لأبي: \" آبنك هذا؟ \" قال: إي وربَّ الكعبة. قال حقاً؟ قال: أشهد به. قال: فبتسم رسول الله صلى الله عليه وسلم ضاحكاً.\" (2) .  (د) وربَّ محمد: ورد ذلك في حديث عائشة قالت: قال رسول الله صلى الله عليه وسلم: \" إني لأعلم إذا كنت عني راضية وإذا كنت عليَّ غضبى؛ أما إذا كنت راضيةً فإنك تقولين: لا ورب محمد، وإذا كنت عليَّ غضبى قلت: لا ورب إبراهيم\" (3) .",
    "foot_note": "1. سنن النسائي (5/ 100)، وصححه الأرنؤوط برقم (1797). \n2. أخرجه أبو داود في سننه (4/ 287) ، وصححه الشيخ مقبل في الجامع الصحيح (4/ 467). \n3. صحيح البخاري (7/ 47) برقم (5228).",
    "book_id": "85",
    "new_page_number": 23
  },
  {
    "serial_number": "4644349",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": " المبحث الثاني: أقسام اليمين المطلب الأول: يمين اللغو ـ ماهيتها ـ حكمها. المطلب الثاني: اليمين المنعقدة ـ ماهيتها ـ حكمها. المطلب الثالث: اليمين الغموس ـ ماهيتها ـ سبب تسميتها ـ حكمها. المطلب الرابع: عقوبة اليمين الفاجرة وما يترتب عليها في الدنيا والآخرة.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 24
  },
  {
    "serial_number": "4644350",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": " المطلب الأول: يمين اللغو ـ ماهيتها ـ حكمها يمين اللغو:  (أولا) معنى اللغو: قال الراغب الأصبهاني: \"هو في الأصل ما لا يعتد به من الكلام، والمراد به في الأيمان ما يورد من غير رويَة فيجري مجرى اللغا وهو صوت العصافير ونحوها من الطير\" (1) . وقد اختلف في تأويلها على أقوال: أشهرها: وهو مذهب جمهور العلماء، أنَّهُ كلام الرجل لا والله وبلى والله من غير أن يقصد اليمين، لما أخرجه أبو داود في سننه عن إبراهيم الصائغ قال: سألت عطاء عن اللغو في اليمين؟ قال: ـ قالت عائشة ـ إن رسول الله صلى الله عليه وسلم قال: \"هو كلام الرجل كلا والله وبلى والله \" (2) . وقد ورد الحديث عن عائشة رضي الله عنها موقوفاً، كما في البخاري، ومرفوعاً كما في … صحيح ابن حبان.  (ثانيا) حكمها: لا كفارة فيها ولا مؤاخذة عليها. لقوله تعالى: {لا يُؤَاخِذُكُمْ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ. . .} (3) . قال الشوكاني - في تفسير هذه الآية-: \" وفي الآية دليل على أنَّ أيمان اللغو لا يؤاخذ الله الحالف بها، ولا تجب فيها الكفارة\" (4) . قال الإمام ابن قدامة: \" وأكثر أهل العلم على أن لغو اليمين لا كفارة فيه. وقال ابن عبد البر: أجمع المسلمون على هذا \" (5)",
    "foot_note": "1. مفردات ألفاظ القرآن للراغب الأصبهاني (742). \n2. عون المعبود (6/ 204) برقم (3315)، وصححه الألباني مرفوعاً في صحيح موارد الظمآن برقم (488). \n3. المائدة: (89). \n4. فتح القدير (2/ 81). \n5. المغني (13/ 245).",
    "book_id": "85",
    "new_page_number": 25
  },
  {
    "serial_number": "4644351",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": " المطلب الثاني: اليمين المنعقدة ـ ماهيتها ـ حكمها اليمين المنعقدة:  (أولا) ماهيتها: اليمين المنعقدة: منفعلة من العقد، وهي عقد القلب في المستقبل ألَاّ يفعل ففعل أو ليفعلَنَّ فلا يفعل (1) .  (ثانيا): حكمها: وجوب الوفاء بما حلف عليه ، فإن حنث وجبت الكفارة. قال تعالى: {لا يُؤَاخِذُكُمْ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَكِنْ يُؤَاخِذُكُمْ بِمَا كَسَبَتْ قُلُوبُكُمْ وَاللَّهُ غَفُورٌ حَلِيمٌ} (2) . وقال سبحانه: {لا يُؤَاخِذُكُمْ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمْ الأَيْمَانَ. . .} (3) . وقال صلى الله عليه وسلم: \"من حلف على يمين فرأى غيرها خيراً منها فليأت الذي هو خير وليكفر عن يمينه\" (4) . قال ابن عبدالبر: \" اليمين التي فيها الكفارة بإجماع المسلمين هي التي على المستقبل من الأفعال\" (5) .",
    "foot_note": "1. الجامع لأحكام القرآن للقرطبي: (3/ 214). \n2. البقرة: (225). \n3. المائدة: (89). \n4. صحيح مسلم برقم (1650). \n5. المغني: (13/ 234، 235).",
    "book_id": "85",
    "new_page_number": 26
  },
  {
    "serial_number": "4644352",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": " المطلب الثالث: اليمين الغموس ماهيتها ـ سبب تسميتها ـ حكمها اليمين الغموس: وتسمى اليمين الصابرة.  (أولا) ماهيتها: اليمين الغموس: قال المناوي: اليمين الغموس الحلف على فعل أو ترك ماضٍ كاذباً (1) . وقد ورد تفسيرها عن النبي صلى الله عليه وسلم في الحديث الذي أخرجه البخاري والترمذي والنسائي من حديث عبدالله بن عمرو بن العاص رضي الله عنهما عن النبي صلى الله عليه وسلم قال: \" الكبائر الإشراك بالله، وعقوق الوالدين، واليمين الغموس\" وفي رواية أن أعرابياً جاء إلى النبي صلى الله عليه وسلم فقال: يا رسول الله ما الكبائر؟ قال: \"الإشراك بالله، قال: ثم ماذا؟ قال: \"اليمين الغموس؟ \" قُلتُ: وما اليمين الغموس؟ قال: \"الذي يقتطع مال امرئ مسلم بيمين هو فيها كاذب\" (2) . وفي مستدرك الحاكم من حديث ابن مسعود رضي الله عنه قال: كٌنَّا نعد من الذنب الذي ليس له كفارة اليمين الغموس. قيل: وما اليمين الغموس؟ قال: الرجل يقتطع بيمينه مال الرجل\" (3) .  (ثانيا) سبب تسميتها: قال الحافظ: سميت بذلك لأنَّها تغمس صاحبها في الإثم، ثم في النار. وقيل: الأصل في ذلك أنهم كانوا إذا أرادوا أن يتعاهدوا أحضروا جفنة فجعلوا فيها طيبا أو دماً أو رماداً ثم يحلفون عندما يدخلون أيديهم فيها ليتم لهم بذلك المراد من تأكيد ما أرادوا، فسميت تلك اليمين إذا غدر صاحبها غموساً لكونه بالغاً في نقض العهد وكأنها على هذا مأخوذة من اليد المغموسة. . . \" (4) .",
    "foot_note": "1. التوقيف على مهمات التعاريف (1/ 751). \n2. فتح الباري (13/ 677) برقم (6675)، وصححه الألباني في صحيح الترغيب (2/ 366) برقم (1831). \n3. مستدرك الحاكم (4/ 329) ، وصححه الألباني في صحيح الترغيب والترهيب (2/ 367) برقم (1833). \n4. فتح الباري، (3/ 677)، النهاية في غريب الحديث لابن الأثير (1/ 386).",
    "book_id": "85",
    "new_page_number": 27
  },
  {
    "serial_number": "4644353",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": " (ثالثا) حكمها: اليمين الغموس كبيرة من كبائر الذنوب، لا كفارة لها عند جمهور العلماء، لأنها يمين مكر وخديعة وكذب قد باء الحالف بإثمها. قال تعالى: {وَلا تَتَّخِذُوا أَيْمَانَكُمْ دَخَلاً بَيْنَكُمْ فَتَزِلَّ قَدَمٌ بَعْدَ ثُبُوتِهَا وَتَذُوقُوا السُّوءَ بِمَا صَدَدْتُمْ عَنْ سَبِيلِ اللَّهِ وَلَكُمْ عَذَابٌ عَظِيمٌ} (1) . وفيها نزل قول الله تعالى: {إِنّ الّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمَانِهِمْ ثَمَناً قَلِيلاً أُوْلََئِكَ لا خَلاقَ لَهُمْ فِي الاخِرَةِ وَلا يُكَلّمُهُمُ اللهُ وَلا يَنظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلا يُزَكّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ} (2) . وفي مسند أحمد من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \" خمسٌ ليس لهن كفارة: الشرك بالله، وقتل النفس بغير حق، وبهت مؤمن، والفرار من الزحف، ويمين صابرة يقتطع بها مالاً بغير حق\" (3) . قال ابن مسعود \" كنا نعد من الذنب الذي ليس له كفارة اليمين الغموس\" (4) . وقال سعيد بن المسيب \"هي من الكبائر وهي أعظم من أن تكفر\" (5) . والواجب فيها التوبة ورد الحقوق إلى أصحابها.",
    "foot_note": "1. النحل (49). \n2. آل عمران (77). \n3. مسند أحمد (2/ 200) ، وحسنه الألباني في صحيح الترغيب (2/ 386) برقم (1836). \n4. مستدرك الحاكم (4/ 429) ، وصححه الألباني في صحيح الترغيب (2/ 367) برقم (1833). \n5. المغني (13/ 240).",
    "book_id": "85",
    "new_page_number": 28
  },
  {
    "serial_number": "4644354",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": " المطلب الرابع: عقوبة اليمين الفاجرة وما يترتب عليها في الدنيا والآخرة لليمين الفاجرة التي يقتطع بها المسلم مال أخيه آثار تترتب عليها، وعقوبات تنال صاحبها منها ما هو عاجل في الدنيا، ومنها ما هو آجل يوم القيامة، سأذكرها في هذا المطلب مُفَصَلةً: ـ  (أولا) عقوبة اليمين الفاجرة وأثرها على صاحبهافي الدنيا .  (أ) اليمين الفاجرة التي اقتطع المسلم بها مال أخيه تُذهب المال الذي حلف من أجله: لحديث عبدالرحمن بن عوف رضي الله عنه أنَّ النبي صلى الله عليه وسلم قال: \"اليمين الفاجرة تُذهب المال، أو تذهب بالمال\" (1) .  (ب) اليمين الفاجرة نكتة سوداء في قلب صاحبها إلى يوم القيامة: لحديث عبدالله بن أُنيس الجهني _رضي الله عنه_ قال: قال رسول الله صلى الله عليه وسلم: \"وما حلف حالف بالله يمين صبر، فأدخل فيها مثل جناح بعوضة، إلَاّ جُعلت نُكتةً في قلبه إلى يوم القيامة\" (2) . وقال صلى الله عليه وسلم: \"من اقتطع مال امرئٍ مسلم بيمينٍ كاذبة كانت نُكتة سوداء في قلبه لا يُغيرها شيءً إلى يوم القيامة\" (3) .  (ج) اليمين الفاجرة تقفر الديار وتذرها بلاقع . ففي حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"ليس مما عُصيَ الله به هو أعجل عِقاباً من البغي، وما من شيء أطيع الله فيه أسرع ثواباً من الصلة، واليمينُ الفاجرة تدعُ الديار بلاقع\" (4) . وبلاقع: جمع بلقع وهي الأرضُ القفر التي لا شيء بها. يريد أن الحالف بها يفقر ويذهب ما في بيته من الرزق، وقيل: هو أن يفرق الله شمله، ويغير عليه ما أولاه من نعمة\" (5) . وفي حديث أبي هريرة رضي الله عنه أيضا قال رسول الله صلى الله عليه وسلم: \"وإن أعجل المعصية عقوبة البغي والخيانة، واليمين الغموس تُذهب المال وتذر الديار بلاقع\" (6) .",
    "foot_note": "1. أخرجه البزار (3/ 245) وحسنه الألباني في صحيح الترغيب (2/ 368) برقم (1835). \n2. أخرجه الترمذي (5/ 86) وحسنه الألباني في صحيح الترغيب (2/ 367) برقم (1832). \n3. أخرجه الحاكم في مستدركه (4/ 327) وصححه الألباني في صحيح الترغيب (2/ 369) برقم (1838). \n4. رواه البيهقي (10/ 35)، وحسنه الألباني في صحيح الترغيب (2/ 368) برقم 1836. \n5. القاموس المحيط للفيروز أبادي (649)، النهاية في غريب الحديث والأثر لبن الأثير (1/ 153). \n6. معجم الطبراني الأوسط برقم (1/ 155) وصححه الألباني في السلسلة الصحيحة (3/ 52).",
    "book_id": "85",
    "new_page_number": 29
  },
  {
    "serial_number": "4644355",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": " (د) اليمين الفاجرة يُعجل لصاحبها العقوبة في الدنيا قبل الآخرة: لقوله صلى الله عليه وسلم: \"من قطع رحماً أو حلف على يمين فاجرة رأى وباله قبل أن يموت\" (1) .  (هـ) اليمين الفاجرة صاحبها منزوع البركة بدعوة النبي صلى الله عليه وسلم: ففي حديث سعيد بن زيد القرشي قال: أشهدُ لسمعت رسول الله صلى الله عليه وسلم يقول: \" من اقتطع مال امرئِ مسلم بيمين فلا بارك الله فيه\" (2) .  (ثانيا) عقوبة اليمين الفاجرة وأثرها على صاحبها في الآخرة .  (أ) أنها من أعظم الخطايا عند الله تعالى يوم القيامة: لحديث أبي رهم السُمعي قال: قال رسول الله صلى الله عليه وسلم: \". . . وإنَّ من أعظم الخطايا من اقتطع مال امرئٍ مسلم بغير حق. . . \" (3) .  (ب) اليمين الفاجرة سبب في غضب الله على العبد يوم القيامة: فعن عبدالله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من حلف على يمين صبر يقتطع بها مال امرئٍ مسلم لقي الله وهو عليه غضبان، فأنزل الله تصديق ذلك: {إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَناً قَلِيلاً أُوْلَئِكَ لا خَلاقَ لَهُمْ فِي الآخِرَةِ وَلا يُكَلِّمُهُمْ اللَّهُ وَلا يَنْظُرُ إِلَيْهِمْ يَوْمَ الْقِيَامَةِ وَلا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ} (4) . فدخل الأشعث بن قيس فقال: ما حدثكم أبو عبدالرحمن؟ فقالوا: كذا وكذا قال: فيَّ أُنزلت. كانت لي بئر في أرض ابن عم لي فأتيت رسول الله صلى الله عليه وسلم فقال: بينتُك أو يمينه. قلت: إذاً يحلف عليها يا رسول الله. فقال رسول الله صلى الله عليه وسلم: \" من حلف على يمين صبر وهو فيها فاجر يقتطع بها مال امرئٍ مسلم لقي الله يوم القيامة وهو عليه غضبان\" (5) . قال الحافظ: \"وفيه التشديد على من حلف باطلاً ليأخذ حق مسلم وهو عند الجميع محمول على من مات على غير توبة صحيحة (6) .",
    "foot_note": "1. رواه البخاري في التاريخ (3/ 207) وصححه الألباني في صحيح الجامع برقم (6475). \n2. أخرجه أحمد في مسنده برقم (1640) وقال الشيخ الأرنؤوط اسناده قوي .. \n3. رواه الطبراني في الكبير (16/ 194) وقال الهيثمي في مجمع الزوائد: رواه الطبراني في الكبير ورجاله ثقات وفي بعضهم كلام لا يضر. \n4. آل عمران (77). \n5. البخاري مع الفتح (11/ 679، 680)، برقم (6676، 6677). \n6. فتح الباري (11/ 685).",
    "book_id": "85",
    "new_page_number": 30
  },
  {
    "serial_number": "4644356",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": " (ج) اليمين الفاجرة سبب إعراض الله عن العبد يوم القيامة وعدم نظره إليه: لحديث وائل بن حجر رضي الله عنه قال: جاء رجل من حضرموت، ورجل من كنده إلى النبي صلى الله عليه وسلم فقال الحضرمي: يا رسول الله، إن هذا قد غلبني على أرض كانت لأبي. فقال الكندي: هي أرضي في يدي، أزرعها ليس له فيها حق. فقال النبي صلى الله عليه وسلم للحضرمي: ألك بينه؟ قال: لا. قال: \"فلك يمينه\" قال: يا رسول الله إنَّ الرجل فاجر لا يبالي على ما حلف عليه، وليس يتورع عن شيء. فقال: \"ليس لك مِنه إلَاّ يمينه\" فانطلق ليحلف، فقال صلى الله عليه وسلم لما أدبر: \" لئِن حلف على مال ليأكله ظلماً ليلقين الله وهو عنه معرض\" (1) . وفي حديث أبي موسى رضي الله عنه قال: اختصم رجلان إلى النبي صلى الله عليه وسلم في أرضٍ، أحدهما من حضرموت قال: فجعل يمين أحدهما، فضج الآخر وقال: إذاً يذهبُ بأرضي. فقال: إن هو اقتطعها بيمينه ظلماً كان ممن لا ينظر الله إليه يوم القيامة ولا يزكيه وله عذاب أليم. قال: وورع الآخر فردها\" (2) .  (د) من حلف بيمين فاجرة جاء يوم القيامة أجذم: لحديث الأشعث بن قيس قال: قال رسول الله صلى الله عليه وسلم: \"من حلف على يمين صبر ليقتطع بها مال امرئٍ مسلم وهو فيها فاجر لقي الله أجذم\" (3) . والأجذم: هو الذي ذهبت أعضاؤه كلها. (4) . وقيل أجذم: مقطوع اليد، أو البركة، أو الحجة، أو الحركة، أو منقطع السبب.  (هـ) اليمين الفاجرة توجب لصاحبها النار وتحرمه من الجنة: ففي حديث أبي أمامة _ رضي الله عنه _أن رسول الله صلى الله عليه وسلم قال: من اقتطع حق امرئٍ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنَّة. قالوا: وإن كان شيئاً يسيرا يا رسول الله؟ فقال: وإن كان قضيباً من أراك\" (5) . وعن الحارث بن البرصاء رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم في الحج بين الجمرتين وهو يقول: \"ومن اقتطع مال أخيه بيمين فاجرة فليتبوأ مقعده من النار، ليُبلغ شاهدُكم غائبكم مرتين أو ثلاثاً\" (6) . وفي رواية: \"فليتبوأ بيتاً من النار\" (7) .",
    "foot_note": "1. صحيح مسلم بشرح النووي، (10/ 123)، برقم (139). \n2. مسند أحمد (32/ 247، 275) وصححه الأرنؤوط برقم (19514). \n3. صحيح ابن حبان (11/ 486) وحسنه الأرنؤوط برقم (5088). \n4. النهاية في غريب الحديث لابن الأثير (1/ 251). \n5. صحيح مسلم بشرح النووي، (1/ 122)، برقم (137). \n6. مستدرك الحاكم (4/ 294) ، وصححه الألباني في صحيح الترغيب (2/ 368) برقم (1834). \n7. معجم الطبراني الكبير (3/ 413) وصححه الألباني في صحيح الترغيب برقم (1834).",
    "book_id": "85",
    "new_page_number": 31
  },
  {
    "serial_number": "4644357",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": " المبحث الثالث: أحكام اليمين المطلب الأول: أحكام تتعلق بالحلف. المطلب الثاني: أحكام تتعلق بالحالف. المطلب الثالث: أحكام عامة.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 32
  },
  {
    "serial_number": "4644358",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": " المطلب الأول: أحكام تتعلق بالحلف يتعلق بالحلف أحكام كثيرة مِنها ما يلي: ـ  1 - لا يجوز الحلف إلا باسم من أسماء الله تعالى أو صفة من صفاته: لقوله صلى الله عليه وسلم: \"من كان حالفاً فليحلف بالله أو ليصمت\" (1) ، وفي رواية: \"من كان حالفاً فلا يحلف إلا بالله\" (2) ، وكانت يمين النبي صلى الله عليه وسلم \" لا ومقلب القلوب\" (3) ، \"لا ومصرف القلوب\" (4) . وفي حديث ابن عباس ــ رضي الله عنهما قال: كان النبي صلى الله عليه وسلم يقول: \"أعوذ بعزتك \" (5)  2 - يحرم الحلف بغير الله: لقوله صلى الله عليه وسلم: \"لا تحلفوا بآبائكم ولا بأمهاتكم ولا بالأنداد ولا تحلفوا إلا بالله. . \" (6) . ولقوله صلى الله عليه وسلم: \"من حلف بغير الله كفر أو أشرك\" (7) . ولقوله صلى الله عليه وسلم: \"كل يمين يحلف بها دون الله شرك\" (8) .  3 - يحرم الحلف بالله كذباً: وقد ذمّه الله تعالى في قوله: {وَيَحْلِفُونَ عَلَى الْكَذِبِ وَهُمْ يَعْلَمُونَ} (9) ، ولقوله صلى الله عليه وسلم: \"من حلف يميناً فاجرة يقتطع بها مال امرئٍ مسلم لقي الله وهو عليه غضبان\" (10) . وقال صلى الله عليه وسلم: \"إن الله أذن لي أن أحدث عن ديك قد مرقت رجلاه الأرض، وعنقه مثنية تحت العرش وهو يقول: سبحانك ما أعظمك فَيُرَدُ عليه: \" لا يعلم ذلك من حلف بي كاذباً\" (11) .",
    "foot_note": "1. سبق تخريجه. \n2. سبق تخريجه. \n3. سبق تخريجه. \n4. سبق تخريجه. \n5. سبق تخريجه. \n6. سبق تخريجه. \n7. سبق تخريجه. \n8. سبق تخريجه. \n9. سبق تخريجه. \n10. سبق تخريجه. \n11. سبق تخريجه.",
    "book_id": "85",
    "new_page_number": 33
  },
  {
    "serial_number": "4644359",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": " 4 - يكره الحلف في البيع وإن كان صادقاً: لقوله صلى الله عليه وسلم: \"الحلف منفقةٌ للسلعة ممحقةٌ للبركة\" (1) . ولقوله صلى الله عليه وسلم: \"إياكم وكثرة الحلف في البيع فإنه ينفق ثم يمحق\" (2) .  5 - من حلف له أخوه المسلم صدقه على يمينه وإن عَلِمَ منه خلافه: لحديث ابن عمر- رضي الله عنهما قال: سمع النبي صلى الله عليه وسلم رجلاً يحلف بأبيه. فقال: \"لا تحلفوا بآبائكم، ومن حلف بالله فليصدق، ومن حُلِف له بالله فليرض، ومن لم يرض فليس من الله\" (3) . عن أبي هريرة أن النبي صلى الله عليه وسلم قال: \"رأى عيسى بن مريم رجلاً يسرق فقال: أسرقت؟ قال: لا، والذي لا إله إلا هو، قال عيسى: آمنتُ بالله وكذّبتُ بصري\" (4) .  6 - يحرم نقض الأيمان ويجب البر فيها والوفاء بها: قال تعالى: {وَأَوْفُوا بِعَهْدِ اللهِ إِذَا عَاهَدتّمْ وَلا تَنقُضُوا الأيْمَانَ بَعْدَ تَوْكِيدِهَا. . .} (5) والنهي يقتضي التحريم. ولقوله صلى الله عليه وسلم: \"احلفوا بالله وبروا واصدقوا فإن الله يحب أن يحلف به\" (6) .  7 - يحرم إدخال غير اليمين في اليمين: لقوله صلى الله عليه وسلم: \"ما حلف حالف بالله يمين صبر فأدخل فيها مثل جناح بعوضة إلا جُعلت نُكتَةٌ في قلبه إلى يوم القيامة\" (7) .  8 - الأصل في اليمين أنها على المدعى عليه: لحديث ابن عباس _رضي الله عنهما_ أن رسول الله صلى الله عليه وسلم قال: \"لو يعطى الناس بدعواهم، لادعى ناسٌ دماء رجال وأموالهم. ولكن اليمين على المدعى عليه\" (8) . وفي رواية عند الترمذي: \"البينة على المدعي واليمين على المدعى عليه\" (9) .",
    "foot_note": "1. صحيح البخاري (3/ 78) برقم (2087). \n2. صحيح مسلم (3/ 1228) برقم (1607). \n3. سنن ابن ماجة (1/ 679) وصححه الألباني في صحيح سنن ابن ماجة (2/ 196) برقم (1721). \n4. سنن ابن ماجة (1/ 679) وصححه الألباني في صحيح سنن ابن ماجة (2/ص 196، 197) برقم (1722). \n5. النحل (91/ 92). \n6. حلية الأولياء (7/ 267) وصححه الألباني في صحيح الجامع (1/ 102) برقم (211). \n7. مسند أحمد (25/ 436) وصححه الأرنؤوط برقم (16043). \n8. صحيح مسلم بشرح النووي (12/ 3) برقم (1711). \n9. رواه الترمذي (3/ 626) وصححه الألباني في صحيح الجامع برقم (2897).",
    "book_id": "85",
    "new_page_number": 34
  },
  {
    "serial_number": "4644360",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": " 9 - باليمين تنقطع الخصومة: قال ابن القيم، ولليمين فوائد مِنها: - تخويف المدعى عليه سوء عاقبة الحلف الكاذب فيحمله ذلك على الإقرار بالحق. - ومِنها القضاء عليه بنكوله عنها. - ومِنها انقطاع الخصومة والمطالبة في الحال، وتخليص كل من الخصمين من ملازمة الآخر؛ ولكنها لا تسقط الحق، ولا تبرئ الذمة باطناً ولا ظاهراً، فلو أقام المدعي بينة بعد حلف المدعى عليه سمعت وقضي بها، وكذا لو ردت اليمين على المدعي فنكل ثم أقام المدعي بينة سمعت وحكم بها. - ومِنها إثبات الحق بها إذا ردت على المدعي أو أقام شاهداً واحداً. - ومِنها تعجيل عقوبة الكاذب المنكر لما عليه من الحق، فإن اليمين الغموس تدع الديار بلاقع، فيشقى بذلك المظلوم عوض ما ظلمه بإضاعة حقه والله أعلم ( 1). 10 - الأيمان تبنى على العرف: قال العلامة السيد محمد رشيد رضا: \"أمر الأيمان مبني على العرف العام بين الناس بالإجماع لا على مدلولات اللغة واصطلاحات الشرع فمن حلف لا يأكل لحماً فأكل سمكاً لا يحنث وإن سماه الله لحماً طرياً إلا إن نواه. . \" (2) .  11 - يشرع إبرار القسم إذا كان طاعة أو لم يكن الحنث خيراً من البر: لحديث أبي حازم أن ابن عمر مرَّ على رجل ومعه غنيمات له فقال له: بكم تبيع غنمك هذه؟ قال: بكذا وكذا فقال ابن عمر: آخذها بكذا وكذا فحلف أن لا يبيعها فانطلق ابن عمر فقضى حاجته فمر عليه فقال: يا أبا عبدالرحمن خُذها بالذي أعطيتني. قال: \"حلفت على يمين فلم أكن لأعين الشيطان عليك إني أحنثك\" (3) . وعن أبي الفيض قال: سمعت عبدالله _ رجلاً من أهل حمص _قال: رأيت أبا الدرداء رضي الله عنه يساوم رجلاً بغنم فحلف ألا يبيعها، ثم قال بعدُ: أبيعُها فقال أبو الدرداء: إني لأكره أن أحملك على إثم فأبى أن يشتريها\" (4) .",
    "foot_note": "1. الطرق الحكمية في السياسة الشرعية لابن قيم الجوزية (98). \n2. تفسير القرآن الحكيم المشهور بتفسير المنار للسيد محمد رشيد رضا (7/ 40). \n3. أخرجه الطبراني في الكبير (10/ 410) برقم (12896)، قال في مجمع الزوائد رجاله رجال الصحيح. \n4. السنن الكبرى للبيهقي (10/ 35) برقم (19652).",
    "book_id": "85",
    "new_page_number": 35
  },
  {
    "serial_number": "4644361",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "وعن البراء بن عازب رضي الله عنه قال: \"أمرنا رسول الله صلى الله عليه وسلم بإبرار المقسم\" (1) . والحِنث في اليمين: نقضها والنكث فيها، وكأنه من الإثم والمعصية (2) ، وحَنِث في يمينه إذا لم يف بها (3) .  12 - الحقوق التي يجوز فيها اليمين هي: أ) \"اتفق الفقهاء على عدم جواز التحليف في حقوق الله تعالى المحضة، سواء كانت حدوداً كالزنا والسرقة. . . أم عبادات كالصلاة والصوم والحج. . . إلا إذا تعلق بها حق لآدمي فيجوز لأن الحدود تدرأ بالشبهات. . . \". ب) واتفق الفقهاء -أيضاً- على جواز اليمين في الأموال وما يؤول إلى المال فيحلف المدعى عليه إثباتاً ونفياً لقوله تعالى: {إِنّ الّذِينَ يَشْتَرُونَ بِعَهْدِ اللهِ وَأَيْمَانِهِمْ ثَمَناً قَلِيلاً. . .} (4) ، وللحديث السابق: \"لو يعطى الناس بدعواهم لادعى ناسٌ دماء رجال وأموالهم ولكن اليمين على المدعى عليه\". ج) واتفق الفقهاء على جواز التحليف في الجنايات من قصاص وجروح وفي بعض مسائل الأحوال الشخصية واختلفوا في بعض مسائلها. . . \" (5) .  13 - ويخرج من عهدة اليمين بواحد من ثلاثة أشياء: الأول: إبرارها بفعل ما حلف عليه. الثاني: الكفارة وهي جائزةٌ قبل الحِنث وبعده على التحقيق. الثالث: الاستثناء بنحو إن شاء الله _ عقب اليمين _. . . \" (6) .",
    "foot_note": "1. سنن ابن ماجة (1/ 683) وصححه الألباني في صحيح سنن ابن ماجة (2/ 200) برقم (1732). \n2. النهاية في غريب الحديث (1/ 449). \n3. مفردات ألفاظ القرآن (260). \n4. آل عمران (77) \n5. الفقه الإسلامي وأدلته، د/ وهبة الزحيلي (6/ 608)، (609) بتصرف. \n6. أضواء البيان للشنقيطي، (2/ 123، 124).",
    "book_id": "85",
    "new_page_number": 36
  },
  {
    "serial_number": "4644362",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": " المطلب الثاني: أحكام تتعلق بالحالف تتعلق بالحالف أحكام بينتها نصوص الكتاب والسُّنة مِنها ما يلي: ـ  1 - لا يحلف إلا على ما تأكد منه: لحديث أبي الحوراء السعدي قال: قلت للحسن بن علي رضي الله عنهما حفظت عن رسول الله صلى الله عليه وسلم: \"دع ما يريبك إلى ما لا يريبك فإن الصدق طمأنينة وإن الكذب ريبة\" (1) .  2 - لا يحلف على أن لا يغفر الله لفلان: لحديث أبي هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: \"كان رجلان من بني إسرائيل متواخيين فكان أحدهما يذنب، والآخر مجتهد في العبادة. فكان لا يزال المجتهد يرى الآخر على الذنب؛ فيقول: أقصِر. فوجده يوماً على ذنب، فقال له: أقصر. فقال: خلِّني وربي؛ أبعثت عليَّ رقيباً؟ فقال: والله لا يغفر الله لك - أو لا يدخلك الله الجنة- فقبض أرواحهما، فاجتمعا عند رب العالمين، فقال: لهذا المجتهد أكنت بي عالماً أو كنت على ما في يدي قادراً. وقال للمذنب: اذهب فادخل الجنة برحمتي. وقال للآخر: اذهبوا به إلى النار\" (2) .  3 - من حلف على يمين فرأى غيرها خيراً منها فليكفر عن يمينه ويأت الذي هو خير: ففي حديث أبي موسى الأشعري قال: قال رسول الله صلى الله عليه وسلم: \". . . وإني والله إن شاء الله- لا أحلف على يمين فأرى غيرها خيراً منها إلا أتيتُ الذي هو خيرٌ وتحللتها\" (3) . عن عبدالرحمن بن سمرة قال: قال النبي صلى الله عليه وسلم: \"يا عبدالرحمن بن سمرة، لا تسأل الإمارة فإنك إن أوتيتها عن مسألة وكلت إليها وإن أوتيتها من غير مسألة أُعِنت عليها. وإن حلفت على يمين فرأيت غيرها خيراً منها فكفِّر عن يمينك وأت الذي هو خير\" (4) .",
    "foot_note": "1. رواه الترمذي (7/ 221) وصححه الشيخ مقبل الوادعي في الجامع الصحيح مما ليس في الصحيحين (4/ 445). \n2. رواه أبو داود (4/ 427) وحسنه الشيخ مقبل الوادعي في الجامع الصحيح مما ليس في الصحيحين (4/ 446 - 447). \n3. البخاري مع الفتح (11/ 630) رقم (6623) وصحيح مسلم بشرح النووي (11/ 99) برقم (1649). \n4. البخاري مع الفتح (11/ 629) رقم (6622) وصحيح مسلم بشرح النووي (11/ 104) برقم (1652).",
    "book_id": "85",
    "new_page_number": 37
  },
  {
    "serial_number": "4644363",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": " 4 - من حلف ألَاّ يفعل أمراً من المعروف فلا يتعلل باليمين وليكفر عن يمينه: لقوله تعالى: {وَلا تَجْعَلُوا اللَّهَ عُرْضَةً لأَيْمَانِكُمْ. .} (1) . قال الشوكاني: \"أي لا تجعلوا الله حاجزاً ومانعاً لما حلفتم عليه، وذلك أن الرجل كان يحلف على بعض الخير من صلة رحم، أو إحسان إلى الغير، أو إصلاح بين الناس، بأن لا يفعل ذلك ثم يمتنع عن فعله معللاً لذلك الامتناع بأنه قد حلف أن لا يفعله وهذا المعنى هو الذي ذكره الجمهور في تفسير الآية. . . \" (2) . قال ابن عباس: \"الرجل يحلف ألَاّ يصل قرابته وقد جعل الله له مخرجاً في التكفير فأمره ألا يعتل بالله فليكفر وليبر\" (3) .  5 - لا يجوز الإصرار على اليمين إذا تأذى بها أهل الحالف: لقوله صلى الله عليه وسلم: \"والله لأن يلج أحدكم بيمينه في أهله آثمُ له عند الله من أن يعطي كفارته التي فرض الله\" (4) . قال النووي \"ومعنى الحديث أنه إذا حلف يميناً تتعلق بأهله ويتضررون بعدم حنثه ويكون الحنث ليس بمعصية فينبغي له أن يحنث فيفعل ذلك الشيء ويكفر عن يمينه فإن قال لا أحنث بل أتورع عن ارتكاب الحنث وأخاف الإثم فيه فهو مخطئ بهذا القول بل استمراره في عدم الحنث وإدامة الضرر على أهله أشد إثماً من الحِنث. واللجاج في اللغة: هو الإصرار على الشيء\" (5) . واللجاجُ هو: التمادي في العناد من تعاطي الفعل المزجور عنه ( 6). 6 - من حلف على ما لا يملك أو على معصية أو في قطيعة رحم فلا يمين له وعليه الكفارة: لحديث سعيد بن المسيب أن أخوين من الأنصار كان بينهما ميراث فسأل أحدهما صاحبه القسمة. فقال: لئن عُدت لتسألني القسمة لا أكلمك أبداً وكلُ مالٍ لي في رتاج الكعبة. فقال عمر بن الخطاب رضي الله عنه إن الكعبة لغنيةٌ عن مالك. كفِّر عن يمينك، وكلِّم أخاك. فإني سمعت رسول الله صلى الله عليه وسلم يقول: \"لا يمين عليك ولا نذر في معصية ولا في قطيعة رحم ولا فيما لا تملك\" (7) . -رتاج الكعبة أي: مصالحها أو زينتها (8) . قال أبو الطيب العظيم آبادي والمعنى: لا يجب إلزام هذه اليمين عليك وإنما عليك الكفارة\".",
    "foot_note": "1. البقرة (225). \n2. فتح القدير (1/ 263). \n3. سنن البيهقي (10/ 33). \n4. البخاري مع الفتح (11/ 630) برقم 6625، صحيح مسلم بشرح النووي (11/ 17) برقم (1655). \n5. صحيح مسلم بشرح النووي (11/ 111). \n6. مفردات ألفاظ القرآن (736). \n7. أخرجه ابن حبان (10/ 197) برقم (4355) وصححه شعيب الأرنؤوط. \n8. عون المعبود (6/ 208).",
    "book_id": "85",
    "new_page_number": 38
  },
  {
    "serial_number": "4644364",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "وقال صلى الله عليه وسلم: \". . ومن حلف على معصية فلا يمين له، ومن حلف على قطيعة رحم فلا يمين له\". … وقال أيضاً \"لا نذر في معصية الله وكفارته كفارة يمين \" وفي حديث مالك الجُشمي رضي الله عنه قال: قلت يا رسول الله: يأتيني ابنُ عمٍ فأحلف أن لا أُعطيه ولا أصِلَهُ قال: \"كفر عن يمينك\" (1) .  7 - من حلف وهو غضبان لزمته اليمين وعليه الكفارة: عن أبي موسى الأشعري رضي الله عنه قال أتيتُ رسول الله صلى الله عليه وسلم في نفرٍ من الأشعريين فوافقتهُ وهو غضبان فاستحملناه فحلف أن لا يحملنا ثم قال. . . والله إن شاء الله لا أحلفُ على يمين فأرى غيرها خيراً منها إلا أتيتُ الذي هو خيرٌ وتحللتها\" (2) . قال القاضي عياض: \"وفي الحديث دليل على لزوم يمين الغضب\" (3) .  8 - من حلف فاستثنى في يمينه فهو بالخيار إن شاء مضى وإن شاء ترك غير حَنِث ولا كفارة عليه: لحديث ابن عمر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من حلف فاستثنى فهو بالخيار إن شاء مضى، وإن شاء ترك غير حَنِث\" (4) وفي رواية \"من حلف فقال: إن شاء الله لم يحنث\" (5) . ولحديث أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: \"من حلف فقال إن شاء الله فقد استثنى\" (6) . قال القاضي عياض: \"أجمع المسلمون على أن قوله إن شاء الله يمنع انعقاد اليمين بشرط كونه متصلاً\" (7) .  9 - من حلف ناسياً فلا كفارة عليه: لقوله تعالى: {وَلَيْسَ عَلَيْكُمْ جُنَاحٌ فِيمَا أَخْطَأْتُمْ بِهِ. .} (8) .",
    "foot_note": "1. سنن ابن ماجه (1/ 6810) وصححه الألباني في صحيح الجامع برقم (7522). \n2. البخاري مع الفتح (11/ 688) برقم (6680). \n3. كمال المعلم شرح صحيح مسلم (2/ 210). \n4. صحيح ابن حبان (10/ 184) وقال الأرنؤوط إسناده قوي. \n5. رواه الترمذي (3/ 160) وصححه الألباني في إرواء الغليل برقم (2570). \n6. المرجع السابق. \n7. صحيح مسلم بشرح النووي (11/ 107). \n8. الأحزاب، آية (5).",
    "book_id": "85",
    "new_page_number": 39
  },
  {
    "serial_number": "4644365",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "ولقوله سبحانه: {لا تُؤَاخِذْنِي بِمَا نَسِيتُ. .} (1) . ولقوله صلى الله عليه وسلم: \"إن الله تجاوز لأمتي عما وسوست- أو حدَّثت- به أنفسها ما لم تعمل به أو تتكلَّم\" (2) .  10 - من حلف مكرهاً فلا إثم عليه ولا تلزمه الكفارة: لقوله تعالى: {إِلَاّ مَنْ أُكْرِهَ وَقَلْبُهُ مُطْمَئِنٌّ بِالإِيمَانِ. . .} (3) . عن ابن عباس رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: \"إن الله تجاوز عن أمتي الخطأ والنسيان وما استكرهوا عليه\" (4) .  11 - من حلف فلا يقل ما شاء الله وشئت ولكن ليقل ما شاء الله ثم شئت: عن ابن عباس رضي الله عنهما قال، قال رسول الله صلى الله عليه وسلم: \"إذا حلف أحدكم فلا يقل ما شاء الله وشئت ولكن ليقل ما شاء الله ثم شئت\" (5) . وعن حذيفة بن اليمان رضي الله عنه أن رجلاً من المسلمين رأى في النوم أنه لقي رجلاً من أهل الكتاب. فقال: نعم القوم أنتم لولا أنكم تشركون وتقولون: ما شاء الله وشاء محمد وذكر ذلك للنبي صلى الله عليه وسلم فقال صلى الله عليه وسلم: \"أما والله إن كنت لأعرفها لكم، قولوا ما شاء الله ثم شاء محمد\" (6) .",
    "foot_note": "1. الكهف آية (73). \n2. البخاري مع الفتح (11/ 668) برقم (6664). \n3. النحل آية (106). \n4. صحيح ابن حبان (16/ 202) وصححه الألباني في إرواء الغليل برقم (82). \n5. سنن ابن ماجة (1/ 684) وصححه الألباني في صحيح سنن ابن ماجة (2/ 200) برقم (1733). \n6. سنن ابن ماجة (1/ 685) وصححه الالباني في صحيح سنن ابن ماجة (2/ 200) برقم (1734).",
    "book_id": "85",
    "new_page_number": 40
  },
  {
    "serial_number": "4644366",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": " المطلب الثالث: أحكام عامة الحلف بالحرام ـ الحلف بالطلاق ــ الحلف باليمين الزبيرية  أولاً: الحلف بالحرام:  (أ) صيغتَهَ قال الإمام ابن القيم _ رحمه الله تعالى _: - الحف بالحرام له صيغتان: ـ إحدهما: إن فَعلتُ كذا فأنت عليَّ حرام، أو ما أحل الله عليَّ حرام. الثانية: الحرام يلزمني لا أفعل كذا\" (1) .  (ب) أقوال الفُقهاء وأدلتهم فيه: هذه المسألة اختلف فيها السلف من الصحابة والتابعين والخلف من الأئمة المجتهدين حتى بلَّغها العلامةُ القُرطبي المفسر ثمانية عشر قولاً (2) ، قال الحافظ وزاد غيره عليها (3) ، وقد تكلم على هذه المسألة الإمام ابن القيم كلاماً طويلاً أوصلها إلى خمسة عشر قولاً أصولاً تفرعت إلى عشرين مذهباً (4) . أقربها ما يلي: ـ - القول الأول: أنُّه لغو وباطل لا يترتب عليه شيء. قال ابن القيم: وهو إحدى الروايتين عن ابن عباس رضي الله عنهما وبه قال الشعبي ومسروق وربيعة وأبو سلمة بن عبدالرحمن وعطاء وداود وجميع أهل الظاهر، وأكثر أصحاب الحديث وهو أحد قولي المالكية اختاره أصبغ بن الفرج (5) . - استدلالاتهم: استدلوا بقوله تعالى: (وَلا تَقُولُوا لِمَا تَصِفُ أَلْسِنَتُكُمُ الْكَذِبَ هََذَا حَلالٌ وَهََذَا حَرَامٌ. . .) [سورة: النحل - الآية: 116]. قالوا: فما لم يحرمه الله فليس لأحد أن يحرمه ولا أن يصير بتحريمه حراماً (6) . وقد قال الله لنبيه (7) . \" (. . . . لِمَ تُحَرّمُ مَآ أَحَلّ اللهُ لَكَ. . .) [سورة التحريم - الآية: 1].",
    "foot_note": "1. إعلام الموقعين لبن القيم في (ـ 2/ ـ 77). \n2. الجامع لأحكام القرآن (18/ـ 142). \n3. فتح الباري (ـ 9/ـ 461). \n4. زاد المعاد (ـ 5/ـ 300) وما بعدها، إعلام المؤمنين، (ـ 2/ـ 77)، وما بعدها. \n5. إعلام الموقعين، (2/ ـ 78). \n6. الجامع لأحكام القرآن، (ـ 18/ـ 140). \n7. سبل السلام، (3/ 1091).",
    "book_id": "85",
    "new_page_number": 41
  },
  {
    "serial_number": "4644367",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "وخاطب الله المؤمنين بقوله: (يَأَيّهَا الّذِينَ آمَنُوا لا تُحَرّمُوا طَيّبَاتِ مَآ أَحَلّ اللهُ لَكُمْ) [سورة: المائدة - الآية: 87]. واستدلوا كذلك بما جاء في صحيح البخاري (1) عن سعيد بن جبير أنه سمع ابن عباس رضي الله عنهما يقول: \"إذا حرم امرأته فليس بشيء وقال: (لّقَدْ كَانَ لَكُمْ فِي رَسُولِ اللهِ أُسْوَةٌ حَسَنَةٌ. . .) [سورة الأحزاب-الآية: 21] وصح عن مسروق أنه قال: \" ما أبالي أحرمت امرأتي أو قصعة من ثريد\". وصح عن الشعبي في تحريم المرأة: \" لهو أهون عليَّ من نعلي \". وقال أبو سلمة: \" ما أبالي أحرمت امرأتي أو حرمت ماء النهر\" (2) . - وقد رجح هذا القول وانتصر له من علماء اليمن العلامة ابن الأمير الصنعاني قال في سُبُل السلام \"وهذا القول أقرب الأقوال المذكورة وأرجحها عندي. . . \" (3) . ورجحه كذلك العلامة الشوكاني في نيل الأوطار وقال: \" وهذا المذهب هو الراجح عندي إذا أراد تحريم العين\" (4) . القول الثاني: أنها يمين يكفرها ما يكفر اليمين على كل حال. قال ابن القيم: (5) \" صح ذلك عن أبي بكر الصديق، وعمر بن الخطاب، وابن عباس وعائشة. . وزيد بن ثابت، وابن مسعود، وعبدالله بن عمر، وعكرمة، وعطاء، ومكحول، وقتادة والحسن، والشعبي، وسعيد بن المسيب، وسليمان بن يسار، وجابر بن زيد، وسعيد بن جبير ونافع، والأوزاعي، وأبي ثور، وخلق سواهم\". وحجة هذا القول: ظاهر القرآن فإن الله تعالى ذكر فرض تحلة الأيمان عقب تحريم الحلال فلا بد أن يتناوله يقيناً (6) وذلك في قوله سبحانه: (قَد فرض اللَّهُ لَكُمْ تَحِلَّة أَيْمَانِكُمْ … ) [التحريم: 2]. واستدلوا بما في صحيح مسلم من حديث ابن عباس رضي الله عنهما قال: \"إذا حرَّم الرجل امرأته فهو يمين يكفرها\" (7) . ورجح هذا القول شيخ الإسلام ابن تيمية، ورجحه كذلك تلميذه ابن القيم في إعلام الموقعين وغيره (8) .",
    "foot_note": "1. البخاري مع الفتح، (9/ ـ 464). \n2. أعلام الموقعين، (2/ ـ 78). \n3. سبل السلام (3/ ـ 1091). \n4. نيل الأوطار، (6/ ـ 316). \n5. أعلام الموقعين (2/ 81 - 84). \n6. المرجع السابق. \n7. مجموع الفتاوى الكبرى، (3/ 226 - 227). \n8. مجموع الفتاوى الكبرى (3/ 226)، (227)، (17/ 45).",
    "book_id": "85",
    "new_page_number": 42
  },
  {
    "serial_number": "4644368",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "القول الثالث: أنه ظهار، وفيه كفارة الظهار: قال ابن القيم (1) : \" صحَّ ذلك عن ابن عباس أيضاً وأبي قلابة، وسعيد بن جبير، ووهب بن منبه، وعثمان التيمي، وهو إحدى الروايات عن الإمام أحمد\". وحجة هذا القول: \"أن الله تعالى جعل تشبيه المرأة بأمه المحرمة عليه ظهاراً، وجعله منكراً من القول وزوراً، فإذا كان التشبيه بالمحرمة يجعله مظاهراً؛ فإذا صرح بتحريمها كان أولى بالظهار. وهذا أقيس الأقوال وأفقهها\" (2) . ورجحه من المعاصرين العلامة محمد الأمين الشنقيطي في أضواء البيان (3) . القول الرابع: أنه راجع إلى نيتة إن نوى به الطلاق كان طلاقاً، وإن نوى به الظهار كان ظهاراً، وإ ن نوى به اليمين كان يميناً وتجب فيه كفارة يمين، وإن لم ينو شيئاً فعليه كفارة يمين (4) . قال ابن حجر: \" وبهذا قال النخعي، والشافعي، وإسحاق وروى نحوه عن ابن مسعود، وابن عمر، وطاووس (5) وهو قول الزهري، ورواية عن الحسن كما في الفتح عنه في الحرام إن نوى يميناً فيمين وإن طلاقاً فطلاق\" (6) . قال ابن القيم: \"وحجة هذا القول أن اللفظ صالح لذلك كله فلا يتبين واحد منهما إلا بالنية. أيضاً أنه كناية في الطلاق فإن نواه كان طلاقاً، وإن لم ينوه كان يميناً لقوله تعالى: (يَأَيّهَا النّبِيّ لِمَ تُحَرّمُ مَآ أَحَلّ اللهُ لَكَ تَبْتَغِي مَرْضَاةَ أَزْوَاجِكَ وَاللهُ غَفُورٌ رّحِيمٌ) إلى قوله تعالى: (. . . تَحِلّةَ أَيْمَانِكُمْ وَاللهُ مَوْلاكُمْ وَهُوَ الْعَلِيمُ الْحَكِيمُ) [التحريم: 1، 2] \" (7) . وهذا القول هو الذي يفتي به فضيلة شيخنا القاضي العلامة/ محمد بن إسماعيل العمراني حفظه الله. وللعلماء مذاهب كثيرة في المسألة كما أسلفت فمنهم من جعله طلاقاً رجعياً، ومنهم من جعله طلاقاً بائناً، ومنهم من قال قد حرمت عليه بمقتضى تحريمه، ومنهم من توقف فيه، ومنهم من قال غير ذلك. وقد اقتصرت على المذاهب الأربعة السابقة لقوة ما استدل به أصحابها ولأن هذا الكتاب مبني على الاختصار. سبب خلاف العلماء في هذه المسألة: -",
    "foot_note": "1. أعلام الموقعين، (2/ 81). \n2. أضواء البيان (6/ 539). \n3. السراج الوهاج، (307). \n4. فتح الباري، (9/ 461). \n5. فتح الباري، (9/ 461). \n6. إعلام الموقعين (2/ 81). \n7. نيل الأوطار (6/ 314).",
    "book_id": "85",
    "new_page_number": 43
  },
  {
    "serial_number": "4644369",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "قال العلامة القرطبي: \" قال علماؤنا - سبب الاختلاف في هذا الباب أنه ليس في كتاب الله ولا في سنة رسول الله (صلى الله عليه وسلم) نص ولا ظاهر صحيح يعتمد عليه في هذه المسألة فتجاذبها العلماء لذلك، فمن تمسك بالبراءة الأصلية فقال: لا حكم. فلا يلزم بها شيء، وأما من قال: إنها يمين، فقال: سمَّاها الله يميناً، وأما من قال: تجب فيها كفارة وليست يميناً فبناه على أمرين أحدهما: أنه ظن أن الله تعالى أوجب الكفارة فيها وإن لم تكن يميناً. والثاني: أن معنى اليمين عنده التحريم فوقعت الكفارة على المعنى، وأما من قال: إنها طلقة رجعية فإنه حمل اللفظ على أقل وجوهه. . . وكذلك وجه من قال إنها ثلاث فحمله على أكبر معناه، وهو الطلاق الثلاث. . وأما من قال إنه ظهار فلأنه أقل درجات التحريم. . . وأما من قال إنه طلقة بائنة؛ فعول على أن الطلاق الرجعي لا يحرم المطلقة وأن الطلاق البائن يحرمها. . . \" (1) . والذي أميل إليه من الأقوال السابقة هو القول الرابع، لأن به تجتمع سائر الأقوال والمذاهب ولأن لفظ التحريم كناية قد يراد به الطلاق أو الظهار أو اليمين، فلا يصار إلى أحدها إلا بنية فيلزم العمل بالنية وبهذا القول يفتي علماؤنا.",
    "foot_note": "1. الجامع لأحكام القرآن، (18/ 142).",
    "book_id": "85",
    "new_page_number": 44
  },
  {
    "serial_number": "4644370",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": " ثانياً: الحلف بالطلاق: ويسمى الطلاق المعلق. -سمي يميناً: عند جمهور العلماء مجازاً وذلك: - لأن في الشرط معنى القسم، من حيث كونه جملة غير مستقلة دون الجواب فأشبه قوله والله، وبالله وتالله. - قيل: لأنه في حكم اليمين من جهة ما يتضمن من حث أو منع أو تصديق أو تكذيب. وهذه المسألة مما ابتلي بها كثير من المسلمين وعمت بها البلوى \" فنحن في زمن ألف رجال فيه الهذر بألفاظ الطلاق؛ فجعلوا عصِم نسائهم كأنها لعب في أيديهم، يتصرفون فيها كيف يشاؤون، ولا يرعون للشرع حرمة ولا للعشرة حقاً. . . \" (1) . والحلف بالطلاق أمره خطير، بل روي في بعض الآثار أنه من أيمان الفُساق (2) . وهو مما حدث الإفتاء به بعد انقراض عهد الصحابة. وهو بدعة محدثة في الأمة أحدثها الحجاج بن يوسف الثقفي فيما يسمى بأيمان البيعة وتتضمن اليمين بالله تعالى والطلاق والعتاق وصدقة المال (3) . - صيغته: قال الإمام ابن القيم رحمه الله: والحلف بالطلاق له صيغتان: - إحداهما: إن فعلت كذا وكذا فأنت طالق- وتسمى صيغة تعليق أي تعليق الطلاق على شرط. - الثانية: الطلاق يلزمني لا أفعل كذا (4) - وتسمى صيغة قسم.",
    "foot_note": "1. الأعمال الكاملة للشيخ/ محمد عبده (2/ 134) عن طريق الانترنت. \n2. الشبكة الإسلامية، موسوعة الفتاوى. \n3. مجمع فتاوى ابن تيمية (35/ 243). \n4. إعلام الموقعين (2/ 3) (77).",
    "book_id": "85",
    "new_page_number": 45
  },
  {
    "serial_number": "4644371",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": " حكمه: اتفق جمهور الفقهاء على صحة اليمين بالطلاق أو تعليق الطلاق على شرط مطلقاً (1) . \"فالطلاق شرعه الله تعالى للحاجة الشديدة، عندما يصبح الوفاق بين الزوجين متعذراً، ولم يشرعه الله ليسيء الناس استعماله ويجعله رعاع الناس يميناً يحلفون به في البيع والشراء والخصومات، فقد جاء في الصحيح قال عليه الصلاة والسلام: \"من كان حالفاً فلا يحلف إلا بالله\" فالحلف بالطلاق مكروه- وقيل الحلف به حرام ويؤدب من حلف به - وهو عند علمائنا ـ المالكية ـ من أيمان الفساق الذي يقدح في المروءة. . \" (2) . - خلاف العلماء فيه: اختلف العلماء من السلف والخلف في حكم الحلف بالطلاق على ثلاثة أقوال يمكن بسطها والأدلة التي بنيت عليها فيما يلي: - القول الأول: أن من حلف بالطلاق لا يلزمه الطلاق- ولا تجب فيه كفارة إذا حنث، لأنه لغو وباطل لا يترتب عليه شيء؛ إذ لا يكون الطلاق إلا كما أمر الله عز وجل. وبه قال أمير المؤمنين علي رضي الله عنه، وشريح، وعكرمة، وطاووس، وهو مذهب داود، وابن حزم، وجميع أهل الظاهر (3) وغيرهم من المتأخرين. قال ابن حزم: \" واليمين بالطلاق لا يلزم سواء بر أو حنث لا يقع به طلاق، ولا طلاق إلا كما أمر الله عز وجل. . . \" (4) . واستدلوا- بأن: أمير المؤمنين علي رضي الله عنه أفتى الحالف بالطلاق أنه لا شيء عليه ولم يعرف له من الصحابة مخالف (5) . - وصح عن شريح قاضي أمير المؤمنين علي وابن مسعود أنها لا يلزم بها الطلاق (6) . - وصح عن عكرمة في رجل قال لغلامه إن لم أجلدك مائة سوط فامرأتي طالق، وقال: لا يجلد غلامه ولا تطلق امرأته هذا من خطوات الشيطان (7) . - وصح عن طاووس من رواية عبدالرزاق عن معمر عن ابن طاووس عنه: \"ليس الحلف بالطلاق شيئاً\" (8) .",
    "foot_note": "1. الموسوعة الفقهية (29/ 37). \n2. المدونة في الفقه المالكي (666) وما بعدها. \n3. المحلى لابن حزم (10/ 268) وما بعدها. \n4. المرجع السابق (10/ 211). \n5. إعلام الموقعين (2، 3/ 71) وما بعدها، إغاثة اللهفان (2/ 400) وما بعدها. \n6. المرجعان السابقان. \n7. المرجعان السابقان، مجموع الفتاوى (17/ 75) وما بعدها. \n8. المرجعان السابقان.",
    "book_id": "85",
    "new_page_number": 46
  },
  {
    "serial_number": "4644372",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "- واستدلوا كذلك بقوله تعالى: (لا يُؤَاخِذُكُمُ اللهُ بِاللّغْوِ فِيَ أَيْمَانِكُمْ وَلََكِن يُؤَاخِذُكُم بِمَا عَقّدتّمُ الأيْمَانَ فَكَفّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَن لّمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيّامٍ ذَلِكَ كَفّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ وَاحْفَظُوَا أَيْمَانَكُمْ كَذَلِكَ يُبَيّنُ اللهُ لَكُمْ آيَاتِهِ لَعَلّكُمْ تَشْكُرُونَ) [المائدة: 89] \". احتج بها ابن حزم للدلالة على أنه \"لا طلاق إلا كما أمر الله عز وجل ولا يمين إلا كما أمر الله عز وجل على لسان رسوله (صلى الله عليه وسلم) \". وليس منه اليمين بالطلاق (1) . واستدل كذلك بقوله (صلى الله عليه وسلم): \"من كان حالفاً فلا يحلف إلا بالله\"، قال\" فارتفع الإشكال في أن كل حلف بغير الله عز وجل فإنه معصية وليس يميناً\" (2) . - قال الإمام الشوكاني رحمه الله: \"وأما قول القائل عليه الطلاق أو يلزمه الطلاق، ونحو ذلك فليس من ذلك في شيء ولم يجعله الله عز وجل طلاقاً، ولا ألزم به أحداً من عباده، ولا يصح من العبد أن يجعل على نفسه غير ما جعله الله عليه، ويلزمها غير ما ألزم الله به. . . وبالجملة فليس في الشرع ما يدل على وقوع هذا الطلاق لا في اللفظ ولا في القصد فتدبر هذا\" (3) . القول الثاني: أن الحلف بالطلاق لا يقع به الطلاق ويلزم صاحبه كفارة يمين إلا إذا نواه فيقع. - نقل هذا الرأي عن طاووس بن كيسان اليماني، وبه قال جماعة من السلف والخلف وأفتى به بعض أصحاب مالك والشافعي في بعض الصور (4) . وهو مذهب شيخ الإسلام ابن تيمية وتلميذه ابن القيم الذي أنتصر له ودلَّل عليه في كتبه. حجة أصحاب هذا القول: -القياس: حيث قاسوا الطلاق على العتق. فإن ابن عمر، وابن عباس، وأبا هريرة، وعائشة، وحفصة، وأم سلمة، وزينب ربيبة النبي (صلى الله عليه وسلم) وغير واحد من الصحابة، أفتوا فيمن قال إن فعلت كذا فكل مملوك لي حر قالوا يكفر عن يمينه ولا يلزمه العتق، هذا مع أن العتق طاعة وقربه فالطلاق لا يلزمه بطريق الأولى (5) .",
    "foot_note": "1. المحلى (10/ 211). \n2. المرجع السابق. \n3. السيل الجرار (412). \n4. الفتاوى الكبرى (3/ 243). \n5. أحكام الأسرة للقليصي (2/ 66 ــ 67).",
    "book_id": "85",
    "new_page_number": 47
  },
  {
    "serial_number": "4644373",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "- أيضاً استدلوا بما صح عن ابن عباس ــ رضي الله عنهما ــ كما في البخاري\" الطلاق عن وطر والعتق ما ابتغي به وجه الله\". وجه الشاهد: أن ابن عباس ــ رضي الله عنهما ــ بيَّن أن الطلاق إنما يقع لمن غرضه أن يوقعه، لا لمن يكره وقوعه (1) . واستدلوا كذلك بما ورد عن أم المؤمنين عائشة ــ رضي الله عنها ــ أنها قالت: \"كل يمينٍ وإن عظمت فكفارتها كفارة اليمين بالله\". وهذا يتناول جميع الأيمان من الحلف بالطلاق والعتاق والنذر وغير ذلك (2) . - وبنوا على هذا الاستدلال \"أن هذه اليمين قد جعل الله لها كفارة حيث قال سبحانه: (قَدْ فَرَضَ اللهُ لَكُمْ تَحِلّةَ أَيْمَانِكُمْ وَاللهُ مَوْلاكُمْ وَهُوَ الْعَلِيمُ الْحَكِيمُ) [سورة: التحريم - الأية: 2]، وقال: (لا يُؤَاخِذُكُمُ اللهُ بِاللّغْوِ فِيَ أَيْمَانِكُمْ وَلََكِن يُؤَاخِذُكُم بِمَا عَقّدتّمُ الأيْمَانَ فَكَفّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَن لّمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيّامٍ ذَلِكَ كَفّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ وَاحْفَظُوَا أَيْمَانَكُمْ كَذَلِكَ يُبَيّنُ اللهُ لَكُمْ آيَاتِهِ لَعَلّكُمْ تَشْكُرُونَ) [سورة: المائدة - الأية: 89] \" وثبت عن النبي (صلى الله عليه وسلم) من حديث أبي هريرة، وعدي بن حاتم، وأبي موسى الأشعري رضي الله تعالى عنهم أنه قال: \" ومن حلف على يمين فرأى غيرها خيراً منها فليأت الذي هو خير وليكفر عن يمينه\" (3) . - أما شيخ الإسلام ابن تيمية فإنه فصَّل في هذه المسألة وفرَّق بين صيغتي الحلف بالطلاق: فالصيغة الأولى: وهي صيغة التعليق أي تعليق الطلاق على شرط كقول الرجل لزوجته: إن خرجت من الدار بغير إذني فأنت طالق. فهذه الصيغة عنده حكمها \"أن ينظر إلى مقصود الحالف فإن كان مقصوده الحض أو المنع أو التصديق أو التكذيب فهذه تعتبر يميناً. وإن كان مقصوده وقوع الطلاق عليها إذا خالفت وفعلت ما نهاها عنه فإنه يكون موقعاً للطلاق إذا تحقق الشرط\" (4) .",
    "foot_note": "1. البخاري مع الفتح (9/ 486). \n2. الفتاوى الكبرى (3/ 235) وما بعدها. \n3. مجموع الفتاوى (17/ 36). \n4. الفتاوى الكبرى (10/ 234) وما بعدها- المفصل (2/ 402) وما بعدها.",
    "book_id": "85",
    "new_page_number": 48
  },
  {
    "serial_number": "4644374",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "أما الصيغة الثانية: وهي صيغة القسم كقول الرجل- الطلاق يلزمني لأفعلن كذا أو يقول بالطلاق لأفعلنَّ كذا. فهذه الصيغة عنده تعتبر يميناً باتفاق أهل اللغة واتفاق طوائف الفقهاء ولكن اختلفوا في حكمها (1) . قال شيخ الإسلام: \"وأظهر الأقوال وهو القول الموافق للأقوال الثابتة عن الصحابة وعليه يدل الكتاب والسنة والاعتبار أنه يجزئه كفارة يمين في جميع أيمان المسلمين، وهو الكفارة عند الحنث. . . ثم قال. . . وهذا قول طائفة من السلف والخلف كطاووس وغيره. . . وبه يفتي كثير من المالكية وغيرهم. . وهو مقتضى نصوص أحمد بن حنبل وأصوله في غير موضع. . . \" (2) . القول الثالث: أن الحلف بالطلاق، يقع به الطلاق سواء نواه أم لم ينوه، وسواء كان معلقاً على شرط كإن دخلت الدار فأنت طالق أو بدون تعليق كنحو عليَّ الطلاق لأفعلن كذا. - وهذا مذهب جمهور العلماء. قال شيخ الإسلام ابن تيمية: وهو المشهور عن أكثر الفقهاء والمتأخرين (3) . واستدلوا بـ: \"أن الطلاق من باب الإسقاطات وما كان من باب الإسقاطات يجوز تعليقه على شرط كالعتق فيجوز تعليق الطلاق. - أيضاً أن الطلاق تصرف شرعي سواء كان منجزاً أو معلقاً فيلزم الوفاء به لأنه يندرج في نطاق الآية الكريمة: \" يا أيها الذين آمنوا أوفوا بالعقود. . . \". - أيضاً أنه التزم أمراً عند وجود شرط فلزمه ما التزمه لأن المعلق بالشرط كالمنجز عند وجود الشرط فيدخل في نطاق الحديث النبوي الشريف الذي جاء فيه \"المسلمون عند شروطهم إلا شرطاً أحل حراماً أو حرَّم حلالاً\" (4) وليس في تعليق الطلاق على شرط تحليل حرام أو تحريم حلال (5) . - قال في الدر المختار: \"ومن الألفاظ المستعملة الطلاق يلزمني والحرام يلزمني وعلي الطلاق وعلي الحرام فيقع بلا نية للعرف\" (6) .",
    "foot_note": "1. مجموع الفتاوى (33/ 140). \n2. الفتاوى الكبرى (3/ 223)، وما بعدها. \n3. الفتاوى الكبرى (3/ 241)، بدائع الصنائع (3/ 41)، روضة الطالبين (8/ 14) وما بعدها، المدونة (2/ 379). \n4. الحديث في البخاري معلق (2/ 794) وصححه الألباني في الصحيحة برقم (2915) بدون ذكر \"إلا شرطاً أحل حراماً أو حرم حلالاً\". \n5. المفصل في أحكام المرأة (7/ 471)، وما بعدها، المجموع (18/ 296). \n6. الدر المختار (4/ 343).",
    "book_id": "85",
    "new_page_number": 49
  },
  {
    "serial_number": "4644375",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "- قال في المدونة: \"والقول بوقوع الطلاق المعلق نقل بأسانيد صحيحة عن جماعة من الصحابة وعن عامة فقهاء التابعين، ومن فقهاء المدينة السبعة المشهورون، وعن جمهور من بعدهم من الفقهاء، ومنهم الأئمة الأربعة ولم يخالف فيه إلا جماعة قليلة من العلماء ليس لهم في مخالفتهم مستند يعول عليه عدا فتوى لعلي بن أبي طالب رضي الله عنه على ما في دلالتها على عدم الوقوع من الاحتمال\" (1) . والذي يترجح لديَّ: بعد هذا العرض لأقوال العلماء وأدلتهم هو مذهب جمهور العلماء. - فمن علق الطلاق على شرط وقع الطلاق عند تحقق الشرط للآتي: - 1 - لأن المعلق بالشرط كالمنجز عند وجود الشرط (2) . 2 - لأن الأصل في الأبضاع التحريم، فينبغي الأخذ بالأحوط في مسائل الطلاق، والتورع فيها، حتى لا يتجرأ المتساهلون على حدود لله ويتلاعبون بها قال تعالى: (وَلا تَتّخِذُوَا آيَاتِ اللهِ هُزُواً) [سورة: البقرة - الآية: 231] \". - وفي سنن النسائي من حديث محمود بن لبيد قال \"أخبر رسول الله صلى الله عليه وسلم عن رجل طلق امرأته ثلاث تطليقات جميعاً؟ فقام غضبان ثم قال: أيلعب بكتاب الله وأنا بين أظهركم؟ حتى قام رجل وقال: يا رسول الله ألا أقتله؟ \" (3) . فإن كان النبي صلى الله عليه وسلم اعتبر من يطلق امرأته ثلاثاً جميعاً متلاعباً بكتاب الله فكيف بمن اتخذ الطلاق ديدنه في عامة شأنه. - قال الإمام ابن عابدين في حاشيته نقلاً عن السُّروجي: \"أقول الحق الوقوع به في هذا الزمان لاشتهاره في معنى التطليق، فيجب الرجوع إليه والتعويل عليه عملاً بالاحتياط في أمر الفروج\" (4) . 3 - زجر الحالف بالطلاق: فأمير المؤمنين عمر رضي الله عنه عندما رأى استعجال الناس في أمر الطلاق أمضاه عليهم ثلاثاً، ففي صحيح مسلم من حديث ابن عباس رضي الله عنهما قال: \"كان الطلاق على عهد رسول الله صلى الله عليه وسلم وأبي بكر وسنتين من خلافة عمر، طلاق الثلاث واحدة، فقال عمر بن الخطاب رضي الله عنه: إن النَّاس قد استعجلوا في أمرٍ كانت لهم فيه أناةٌ، فلو أمضيناه عليهم فأمضاه عليهم\" (5) .",
    "foot_note": "1. المدونة (2/ 687) وما بعدها. \n2. البناية شرح الهداية (5/ـ 410). \n3. سنن النسائي (3401) وصححه الألباني في غاية المرام (261). \n4. حاشية ابن عابدين (4/ـ 344). \n5. صحيح مسلم بشرح النووي (ـ 5/ 2/ـ 60).",
    "book_id": "85",
    "new_page_number": 50
  },
  {
    "serial_number": "4644376",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "\" فعلى المسلم أن يتقي الله عز وجل في نفسه فلا يحلف بالطلاق ولا بغيره مما نهى الشارع عن الحلف به، لأن الحلف بالطلاق، يعرض عصمة الزوجية للهدم بل ذكر بعض أهل العلم أن صاحبه لا يأمن بقاء زوجته معه، لأنها قد تكون في زنى من كثرة حلفه وهو ما نظمه ابن ما يابي بقوله: ـ - وكثرة الحلف بالطلاق … * … فسق وعيب موجب الفراق. وما كان كذلك يجب الحذر منه والبعد عنه\" (1) . \" وختاماً أنصحك ـ أخي بأن لا تجعل الطلاق مضغة في فمك، وإذا كنت تريد التوكيد وحث نفسك أو زوجتك على أمرٍ والمنع منه، فاحلف يميناً بالله تعالى، فإن الطلاق لم يشرع في شريعة الإسلام لتوكيد الأخبار أو للحث أو المنع\" (2) .",
    "foot_note": "1. الشبكة الإسلامية ـ موسوعة الفتاوى. \n2. فتاوى مصطفى الزرقاء، (ـ 310).",
    "book_id": "85",
    "new_page_number": 51
  },
  {
    "serial_number": "4644377",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": " ثالثاً: الحلف باليمين الزبيرية: اليمينُ الزُبيرية حلف لا زال البعض يُحلِّف به. ويعتقد أن من حلف بها كاذباً عوجل بالعقوبة وسأكتب عنها على النحو التالي: -  أ) صيغتها: - أن يقال للحالف قل: \" قد برئت من حول الله وقوته واعتصمت بحولي وقوتي، وتقلدت الحول والقوة من دون الله، استكباراً على الله، واستغناء عنه واستعلاء عليه، إن كنت قلت كذا أو فعلت كذا. . . \".  ب) أول من حلَّف بها: - هو الإمام يحيى بن عبدالله بن الحسن بن الحسن بن علي بن أبي طالب رضي الله عنه، حلف بها عبدالله بن مصعب الزبيري عندما سعى بالوشاية بينه وبين الرشيد أنه يريد الخلافة دونه.  ج) سبب التحليف بها: للتحليف بهذه اليمين قصَّة أوردها المؤرخون في كتبهم كابن جرير الطبري وابن كثير وغيرهما، مفادها: - أن يحيى بن عبد الله بن الحسن بن الحسن بن علي بن أبي طالب رضي الله عنه، ظهر ببلاد الديلم في زمن هارون الرشيد، واشتدت شوكته، وقوي أمره، وارتحل إليه الناس من الأمصار، فاغتم لذلك الرشيد أيّما اغتمام وقلق من أمره، فندب إليه الفضل بن يحيى بن خالد بن برمك في خمسين ألف رجل ومعه صناديد القواد وسار الفضل إلى تلك الناحية وكتب إلى يحيى بن عبدالله يعده ويمنيه ويؤمله ويرجيه وأنه إن خرج إليه أن يقيم له العذر عند الرشيد، فامتنع يحيى أن يخرج إليهم حتى يكتب له الرشيد كتاب أمان بيده على نسخة يبعث بها إليه، فكتب الفضل بذلك إلى الرشيد ففرح الرشيد ووقع منه موقعاً عظيماً، وكتب الأمان بيده وأشهد عليه القضاة والفقهاء ومشيخة بني هاشم ووجه به مع جوائز وهدايا فوجه الفضل بذلك إليه فقدم يحيى بن عبدالله، وورد به الفضل بغداد، فلقيه الرشيد بكل ما أحب وأمر له بمال كثير وأجزل له في العطاء وخدمه آل برمك خدمة عظيمة، ثم إنَّ الرشيد تنكر ليحيى بن عبدالله وتغير عليه ويقال إنه سجنه ثم استحضره وعنده جماعات من الهاشميين وأحضر الأمان الذي بعث به إليه، فسأل الرشيد محمد بن الحسن الفقيه صاحب أبي يوسف هذا الأمان أصحيح هو؟ قال نعم. فتغيظ عليه الرشيد ثَّم سأل أبا البختري فقال: هذا منتقض من وجه كذا وكذا وليس هذا بشيء فاحكم فيه بما شئت، ومزق الأمان وتفل فيه أبو البختري، فقال الرشيد أنت قاضي القضاة وأنت أعلم بذلك. ولقد سعى بالنميمة بين الرشيد ويحيى بن عبدالله الساعون، وكلما رق الرشيد له أثاروا عليه في نفسه السخيمة عليه، فقد ذكروا أن يحيى قال للرشيد يا أمير المؤمنين إن لنا قرابة",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 52
  },
  {
    "serial_number": "4644378",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "ورحماً. . إنا وأنتم أهل بيت واحد، فأذكرك الله قرابتنا من رسول الله صلى الله عليه وسلم علام تحبسني وتعذبني، فرق له هارون، فقال له عبدالله بن مصعب الزُّبيري وكان حاكماً للمدينة أيام الرشيد يا أمير المؤمنين لا يغرنك هذا الكلام من هذا، فإنه عاص شاق وإنما هذا منه مكر وخبث وقد أفسد علينا مدينتنا وأظهر فيها العصيان فرد عليه يحيى وكان مما قال يا أمير المؤمنين لقد جاءني هذا حين قتل أخي محمد بن عبدالله بن الحسن فقال لعن الله قاتله، وأنشدني فيه نحواً من عشرين بيتاً. وقال لي إن تحركت في هذا الأمر فأنا أول من يبايعك وما يمنعك أن تلحق بالبصرة وأيدينا معك؟ فتغير وجه الزبيري وأنكر وشرع يحلف بالأيمان المغلظة إنه لكاذب في ذلك، وتحير الرشيد ثم قال ليحيى أتحفظ شيئاً من المرثية؟ قال: نعم، وأنشده منها جانباً منها: - قوموا بأمركم ننهض بطاعتنا ** إن الخلافة فيكم يا بني حسن فازداد الزُبيري في الإنكار وقال والله يا أمير المؤمنين الذي لا إله إلا هو. . حتى أتى على آخر اليمين الغموس ما كان مما قال شيء- فأقبل الرشيد على يحيى فقال قد حلف فهل من بيِّنة سمعوا هذه المرثية منه قال لا يا أمير المؤمنين، ولكن استحلفه بما أريد قال فاستحلفه فأقبل على الزبيري فقال: قل إن كنت كاذباً فقد برئت من حول الله وقوته واعتصمت بحولي وقوتي وتقلدت الحول والقوة من دون الله استكباراً على الله، واستغناءً عنه واستعلاءً عليه إن كنت قلته. فامتنع الزبيري من الحلف بذلك فعزم عليه الرشيد وتغيظ عليه، فحلف بذلك فما كان إلا أن خرج من عند الرشيد فرماه الله بالفالج فمات من ساعته. ثم إن الرشيد أطلق يحيى بن عبدالله وأطلق له مائة ألف دينار. ويقال إنما حبسه بعض يوم، وقيل ثلاثة أيام، وعاش بعد ذلك كله شهراً واحداً ثم مات رحمه الله تعالى (1) .",
    "foot_note": "1. تاريخ الطبري (8/ 242)، وما بعدها، البداية والنهاية لابن كثير (10/ 178 ـ 180)، عصر المأمون للدكتور/ أحمد فريد (1/ـ 122) وما بعدها",
    "book_id": "85",
    "new_page_number": 53
  },
  {
    "serial_number": "4644379",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": " د) حكم الحلف بها: التحليف باليمين الزُبيريه حرام، إذ لا يكون الحلف إلا باسم من أسماء الله تعالى أو صفة من صفاته سبحانه، لقوله صلى الله عليه وسلم كما في البخاري: \" من كان حالفاً فليحلف بالله أو ليصمت\". وفي رواية عند أبي داود والترمذي بلفظ \"أو ليسكت\" وعند مسلم \" من كان حالفاً فلا يحلف إلا بالله\". والحلف بغير الله، قد ورد المنع منه وأنه شرك، لقوله صلى الله عليه وسلم كما في سنن أبي داود من حديث ابن عمر رضي الله عنهما قال: سمعت النبي صلى الله عليه وسلم يقول: \" من حلف بغير الله فقد أشرك\" (1) وعند الترمذي: \" فقد كفر أو أشرك\" (2) . لأن الحلف بالشيء يقتضي تعظيمه، والعظمة إنما هي لله وحده، فلا يضاهي به غيره. وعليه فالتحليف بالبراءة من حول الله وقوته واعتصام الإنسان بحوله وقوته حرام بل شرك. فكيف إذا أضيف إلى هذا كون هذه البراء استكباراً على الله، واستغناء عنه واستعلاء عليه، إن ذلك يوصل الإنسان إلى حد الكفر والعياذ بالله خاصة إذا اعتقد ذلك. فالحول والقوة كله لله وبالله فلا حول للمسلم ولا قوة إلا بالله فقد علم النبي صلى الله عليه وسلم أصحابه أن يقولوا \" ولا حول ولا قوة إلا بالله \" (3) . وكان يوصيهم بذلك فقد وصى عليه الصلاة والسلام أبا موسى الأشعري رضي الله عنه فقال له قل: (لا حول ولا قوة إلا بالله، فإنها كنز من كنوز الجنة \" (4) . ووصى بها (صلى الله عليه وسلم) كذلك أبا ذر _ رضي الله عنه _ حيث قال: كنت أمشي خلف النبي صلى الله عليه وسلم فقال لي يا أبا ذر: ألا أدلك على كنز من كنوز الجنة؟ قلت بلى قال: \" قل لا حول ولا قوة إلا بالله\" (5) . قال الخطابي: \"معنى الكنز في هذا الحديث الأجر الذي يحرزه قائله والثواب الذي يدخر له فيه\" (6) . وهكذا أرشد عليه الصلاة والسلام أمته إلى الاستكثار من لا حول ولا قوة إلا بالله، فقال كما في حديث أبي سعيد الخدري رضي الله عنه: \" استكثروا من الباقيات الصالحات: قيل وما هُن يا رسول الله؟ قال: التهليل، والتكبير، والتسبيح، والحمد لله، ولا حول ولا قوة إلا بالله\" (7) . ومن خلال هذه الأحاديث يتبين لنا أن على المسلم دائماً أن يتبرأ من حوله وقوته وأن يُعلن على الدوام أنه لا حول له ولا قوة إلا بالله.",
    "foot_note": "1. سبق تخريجه. \n2. سبق تخريجه. \n3. سنن الترمذي (5/ 580) وصححه الألباني في صحيح الترغيب برقم (1580). \n4. صحيح البخاري (16/ 161) برقم (6384) ومسلم (4/ 2076) برقم (2704). \n5. سنن ابن ماجه (2/ 1256) وصححه الألباني في صحيح الجامع برقم (7820). \n6. تحفة الذاكرين: الشوكاني (1/ 372). \n7. أخرجه أحمد في المسند (18/ 241) برقم (11713) وحسنه الأرنؤوط.",
    "book_id": "85",
    "new_page_number": 54
  },
  {
    "serial_number": "4644380",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": " المبحث الرابع: كفارة اليمين المطلب الأول: تعريف الكفارة ــ ماهيتها - مشروعيتها - سبب تسميتها -الحكمة مِنها. المطلب الثاني: بم تكون الكفارة ــ شروط وجوبها. المطلب الثالث: الأحكام المتعلقة بالكفارة. المطلب الرابع: صور من تهاون الناس بالأيمان.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 55
  },
  {
    "serial_number": "4644381",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": " المطلب الأول: تعريف الكفارة ـ مشروعيتها- سبب تسميتها- الحكمة مِنها  أولاً: تعريف الكفارة: الكفارةُ: مأخوذة من الكَفرْ وهو الستر، وهي تدل على أن هناك ذنباً يحتاج إلى تكفير وهذا الذنب هو انتهاك حرمة المُقسم به. قال الراغب: \"والكفارة ما يغطى من الإثم، ومنه كفارة اليمين. . . وكذلك كفارة غيره من الآثام. . . والتكفير سترُه، وتغطيتُه حتى يصير بمنزلة ما لم يُعمَل\" (1) . ومن رحمة الله بعباده أنه جعل لهم في الحنث باليمين الكفارة من باب التخفيف وإلَاّ فإن الأصل هو البر باليمين؛ وهذا ممَّا اختصت به هذه الأمة.  ثانياً: مشروعيتها: الأصل في مشروعيتها وثبوت حكمها الكتاب والسنة والإجماع، أما الكتاب فقول الله تعالى: {لا يُؤَاخِذُكُمُ اللهُ بِاللّغْوِ فِيَ أَيْمَانِكُمْ وَلَكِن يُؤَاخِذُكُم بِمَا عَقّدتّمُ الأيْمَانَ فَكَفّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَن لّمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيّامٍ ذَلِكَ كَفّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ وَاحْفَظُوَا أَيْمَانَكُمْ كَذَلِكَ يُبَيّنُ اللهُ لَكُمْ آيَاتِهِ لَعَلّكُمْ تَشْكُرُونَ} (2) ، وأما السنة فقول النبي صلى الله عليه وسلم: \"إذا حلفت على يمين فرأيت غيرها خيراً منها فأت الذي هو خير وكفِّر عن يمينك\". وأجمع المسلمون على مشروعية الكفارة في اليمين بالله تعالى (3) .  ثالثاً: سبب تسميتها: وسميت كفارة لأنها تكفر الذنب أي تستره (4) .  رابعاً: الحكمة مِنها: لمَّا كان عدم الوفاء باليمين يوقع صاحبها في الحنث: وهو الإثم ، شرعت الكفارة لرفع الإثم (5) .",
    "foot_note": "1. مفردات ألفاظ القرآن للراغب الأصفهاني (717)، الشرح الممتع (6/ 341). \n2. سورة: المائدة (89). \n3. المغني (13/ 333). \n4. فتح الباري (11/ 723). \n5. مما أفاد ني به الدكتور / عبد الوهاب الديلمي حفظه الله تعالى.",
    "book_id": "85",
    "new_page_number": 56
  },
  {
    "serial_number": "4644382",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": " المطلب الثاني: بم تكون الكفارة - شروط وجوبها  أولاً: بم تكون الكفارة: اتفق العلماء على أن الكفارة في الأيمان تكون في الأربعة الأنواع التي ذكرها الله في كتابه: {فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيَّامٍ ذَلِكَ كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ} (1) . والحالف مخير بين الثلاثة فيها: الإطعام أو الكسوة أو العتق، وأنه لا يجوز له الصيام إلا إذا عجز عن هذه الثلاثة لقوله تعالى: {فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيَّامٍ} (2) . قال ابن قدامة: \"أجمع أهل العلم على أن الحانث في يمينه بالخيار إن شاء أطعم، وإن شاء كسى، وإن شاء أعتق، أي ذلك فعل أجزأه؛ لأن الله تعالى عطف بعض هذه الخصال على بعض بحرف أو، وهو للتخيير. . . \" (3) . وتفصيل ذلك:  (1) الإطعام: لم يرد نص شرعي في مقدار الطعام ونوعه، وكل ذلك يرجع في تقديره إلى العرف فيكون الطعام مقدراً بما يطعم منه الإنسان أهل بيته - غالباً- لا من الأعلى الذي يتوسع به في المواسم والمناسبات، ولا من الأدنى الذي يطعمه في بعض الأحيان (4) . عن ابن عباس رضي الله عنهما قال: \" كان الرجل يقوت أهله قوتاً فيه سعة، وكان الرجل يقوت أهله قوتاً فيه شدة فنزلت: {مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ. . .} (5) \".  (2) الكسوة: وهي اللباس ويجزئ فيها ما يسمى كسوة، وأقل ذلك ما يلبسه المساكين عادة، فيكفي القميص السابغ مع السراويل، وتكفي العباءة أو الإزار والرِداء. . . الخ\" (6) .",
    "foot_note": "1. بداية المجتهد ونهاية المقتد لابن رشد (2/ 405). \n2. بداية المجتهد ونهاية المقتصد لابن رشد (2/ 405). \n3. المغني (13/ 333 - 334). \n4. فقه السنة (3/ 98). \n5. سنن ابن ماجة (1/ 682) وصححه الألباني في صحيح سنن الترمذي برقم (1730). \n6. فقه السنة (3/ 99 - 100).",
    "book_id": "85",
    "new_page_number": 57
  },
  {
    "serial_number": "4644383",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": " (3) العتق: وهو إعتاق العبيد وتحريرهم من العبودية ولو كان كافراً، عملاً بإطلاق الآية عند أبي حنيفة، وأبي ثور، وابن المنذر. واشترط الجمهور: الإيمان فيها حملاً للمطلق هنا على المقيد في كفارة قتل الخطأ إذ تقول الآية: {فَتَحْرِيرُ رَقَبَةٍ مُؤْمِنَةٍ} (1) . ومذهب الجمهور في حمل المطلق في كفارة اليمين على المقيد في كفارة قتل الخطأ هوالأولى وعليه فيشترط الإيمان في الرقبة عند العتق.  (4) الصيام عند عدم الاستطاعة: ويستحب فيه التتابع- فقد قرأ أُبي بن كعب، وابن مسعود \" فصيامُ ثلاثة أيامٍ متتابعاتٍ\" (2) .  ثانياً: شروط وجوب الكفارة: يشترط لوجوب الكفارة ثلاثة شروط: الأول: أن تكون اليمين منعقدة: وهي التي قصد ــ صاحبهاـ عقدها على مستقبل ممكن. الثاني: أن يحلف مختاراً فإن حلف مكرهاً لم تنعقد يمينه ــ ـكما أسلفنا ــ. الثالث: الحِنث في يمينه؛ بأن يفعل ما حلف على تركه، أو يترك ما حلف على فعله، مختاراً ذاكراً؛ فإن حلف مكرهاً أو ناسياً فلا كفارة (3) .",
    "foot_note": "1. فقه السنة (3/ 99 - 100). \n2. إرواء الغليل (8/ 203). \n3. الشرح الممتع (6/ 339).",
    "book_id": "85",
    "new_page_number": 58
  },
  {
    "serial_number": "4644384",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": " المطلب الثالث: الأحكام المتعلقة بالكفارة للكفارة أحكام تتعلق بها منها ما يلي: ـ  1 - يستحب إعانة المعسر في الكفارة: عن أبي هريرة رضي الله عنه قال: جاء رجل إلى رسول الله صلى الله عليه وسلم فقال: هلكت، فقال: وما ذاك؟ قال وقعتُ بأهلي في رمضان، قال: تجد رقبة؟ قال: لا، قال: هل تستطيع أن تصوم شهرين متتابعين؟ قال: لا، قال تستطيع أن تطعم ستين مسكيناً؟ قال: لا، قال: فجاء رجلٌ من الأنصار بعرق ــ والعرق المكتل فيه تمرـ فقال: اذهب بهذا فتصدق به. قال: أعلى أحوج منا يا رسول الله؟ والذي بعثك بالحق ما بين لا بتيها أهل بيت أحوج مِنَّا، ثم قال: اذهب فأطعمه أهلك\" (1) . - يستفاد من الحديث: أن الكفارة لا تسقط عن الفقير، لكن يستحب إعانته إن كان معسراً.  2 - تشرع الكفارة قبل الحِنث وبعده: اتفق الفقهاء على أن الكفارة لا تجب إلَاّ بالحِنث، واختلفوا في جواز تقديمها عليه وتأخيرها عنه. فجمهور الفقهاء يرى أنها رخصة شرعها الله لحل ما عقد من اليمين فلذلك تجزئ قبل الحنث وبعده، وهذا القول منسوب لأربعة عشر صحابياً وعدد كبير من التابعين، واستدلوا بظواهر النصوص ومنها: قوله صلى الله عليه وسلم: \"والله إن شاء الله، لا أحلف على يمين ثم أرى خيراً منها إلَاّ كفرتُ عن يميني وأتيت الذي هو خير\" (2) . وقوله صلى الله عليه وسلم: \"من حلف على يمين فرأى غيرها خيراً منها فليأت الذي هو خير وليكفر عن يمينه\" (3) . ويرى أبو حنيفة أن الكفارة لا تصح إلَاّ بعد الحنث وذلك لتحقيق موجبها حينئذ ولقوله صلى الله عليه وسلم: \"من حلف على يمين فرأى غيرها خيراً منها فليأت الذي هو خير وليكفر عن يمينه \" (4) . والصحيح قول الجمهور لثبوت الأحاديث بالكفارة قبل الحِنث وبعده. ولأن الواو لا تدل على الترتيب وإنما هي لمطلق الجمع.",
    "foot_note": "1. البخاري مع الفتح (11/ 726)، برقم (6710). \n2. البخاري مع الفتح (11/ 630) برقم (6623)، ومسلم بشرح النووي (11/ 99) برقم (1649). \n3. مسلم بشرح النووي (11/ 103) برقم (1650). \n4. صحيح مسلم (3/ 1271) برقم (1650).",
    "book_id": "85",
    "new_page_number": 59
  },
  {
    "serial_number": "4644385",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": " 3 - يستحب التتابع في صيام الكفارة عند جمهور العلماء: وحجتهم في ذلك قراءة أُبي وابن مسعود . فقد قرأ أبي بن كعب، وابن مسعود \" فصيام ثلاثة أيامٍ متتابعات\" (1) . والقراءة وإن كانت شاذة لا يقرأ بها في القرآن، لكن يعمل بها في الأحكام الشرعية، وهي بمثابة حديث الآحاد متى صحَّت، وتكون صالحة لتقييد المطلق وتخصيص العام كما تقرر في الأصول. قال ابن قدامة: \"وهذا إن كان قرآناً فهو حجة. . وإن لم يكن قرآناً فهو رواية عن النبي صلى الله عليه وسلم. . . ولا ينقص عن درجة تفسير النبي صلى الله عليه وسلم للآية وعلى كلا التقديرين فهو حجة يصار إليه. .\" (2) . وذهب الإمام مالك والشافعي في الأظهر ، وأحمد في رواية، وهو مذهب الظاهرية إلى أنه لا يشترط في الصوم التتابع بل له أن يصومه متتابعا ومتفرقا، وحجتهم ظاهر الآية فإن الأمر فيها مطلق (3) والصواب الأول لثبوت قراءة أُبي وابن مسعود في التتابع.  4 - يشترط في الكفارة بالعتق كون الرقبة مؤمنة: عند جمهور العلماء وحملوا المطلق في كفارة اليمين على المقيد في كفارة قتل الخطأ وقالوا لا يجزئ في الكفارتين إلَاّ الرقبة المؤمنة. ولم يشترط كون الرقبة مؤمنة أبو حنيفة رحمه الله لأن الحنفية لا يقولون بحمل المطلق على المقيد في حالة اتحاد الحكم واختلاف السبب، بل قالوا بحمل المطلق في مكانه والمقيد في مكانه، ففي كفارة اليمين والظهار تجزئ عندهم الرقبة الكافرة عملاً بالإطلاق وفي كفارة القتل الخطأ لا تجزئ عندهم إلَاّ الرقبة المؤمنة عملاً بالتقييد (4) ، والصحيح الأول.",
    "foot_note": "1. سبق تخريجه. \n2. المغني (8/ 752). \n3. الاحتجاج بالقراءة الشاذة وأثرها في اختلاف الفقهاء لمحمد مشهوري محمد نعيم (273). \n4. أثر الاختلاف في القواعد الأصولية د/ مصطفى الخن (261، 262).",
    "book_id": "85",
    "new_page_number": 60
  },
  {
    "serial_number": "4644386",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": " المطلب الرابع: صور من تهاون الناس بالأيمان  1 - كثرة الحلف في البيع والشراء: وقد وردت العديد من النصوص في النهي عن ذلك مِنها: قول النبي صلى الله عليه وسلم: \"أربعة يبغضهم الله تعالى البيَّاع الحلَاّف، والفقير المختال، والشيخ الزاني، والإمام الجائر\" (1) . وقوله صلى الله عليه وسلم في حديث أبي ذر _ رضي الله تعالى عنه _: \"ثلاثة لا ينظر الله إليهم يوم القيامة لا يزكيهم، ولهم عذابٌ أليم- فقرأها رسول الله صلى الله عليه وسلم ثلاث مرات- فقلت خابوا وخسروا من هم يا رسول الله؟ قال: \"المُسبل، والمنان، والمنفق سلعته بالحلف الكاذب\" (2) . وقوله عليه الصلاة والسلام: \"ثلاثةٌ لا ينظر الله إليهم يوم القيامة، ولا يزكيهم، ولهم عذابٌ أليم، أشيمط زان، وعائل مستكبر، ورجل جعل الله بضاعته لا يشتري إلَاّ بيمينه ولا يبيع إلَاّ بيمينه\" (3) . - والأشيمط: من الشمط وهو الشيب (4) . وقد وصَّى النبي صلى الله عليه وسلم: التجار بالصدقة؛ لما يحضر البيع من حلف وكذب فقال: يا معشر التجار إن هذا البيع يحضره الحلف والكذب فشوبوا بيعكم بالصدقة\" (5) . ويدخل تحت هذه الصورة: -  أـ الحلف أن هذه السلعة بكذا وكذا وليست كذلك: لقوله صلى الله عليه وسلم: \"ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم، ولهم عذابٌ أليم، رجلٌ على فضل ماء بفلاة يمنعه ابن السبيل، ورجلٌ بايع رجلاً سلعته بعد العصر فحلف بالله لأخذها بكذا وكذا فصدقه فأخذها وهو على غير ذلك، ورجلٌ بايع إماماً لا يبايعه إلا للدنيا فإن أعطاه فيها ما يريد وفى له وإن لم يعطه لم يف\" (6) .",
    "foot_note": "1. شعب الإيمان للبيهقي (4/ 220) وصححه الألباني في صحيح الجامع برقم (880). \n2. صحيح مسلم بشرح النووي (1/ 71) برقم (306). \n3. معجم الطبراني الصغير (2/ 82 ـ 83) وصححه الألباني في صحيح الجامع برقم (3072). \n4. النهاية في غريب الحديث لابن الأثير (2/ 501). \n5. سنن النسائي (7/ 14) وصححه الألباني في صحيح سنن ابن ماجة برقم (2145). \n6. البخاري (1/ 3598) برقم (7212) ومسلم (1/ 103) برقم (108).",
    "book_id": "85",
    "new_page_number": 61
  },
  {
    "serial_number": "4644387",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": " ب ـ الحلف لقد أُعطي أكثر مما أَعْطى وهو كاذب . لقوله صلى الله عليه وسلم: \"ثلاثة لا يكلمهم الله يوم القيامة، ولا ينظر إليهم ، رجلٌ حلف على سلعته لقد أُعطي بها أكثر مما أُعطي وهو كاذب. . . \" (1) . قال واثلة بن الاسقع رضي الله عنه: كان رسول الله صلى الله عليه وسلم يخرج إلينا، وكنا تُجاراً وكان يقول: \"يا معشر التجار إياكم والكذب\" (2) .  ج ــ الحلف ألَاّ يبيع بكذا ثم يبيع: عن أبي سعيد الخدري -رضي الله عنه قال: مرَّ أعرابيٌ بشاة فقلت: تبيعنيها بثلاثة دراهم؟ فقال: لا والله. ثم باعنيها. فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال: باع آخرته بدنياه\" (3) .  2 - التهاون في الأيمان المصبورة التي يلزم بها الحاكم والحلف بها كذباً وفجوراً وإدخال النوايا السيئة فيها: وقد علم من خلال النصوص الصحيحة أنها على نية المستحلف فعن عمران بن حصين رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: \"من حلف على يمين مصبورة كاذباً فليتبوأ بوجهه مقعده من النار\" (4) . وقال صلى الله عليه وسلم: \"ما حلف حالف بالله يمين صبر فأدخل فيها مثل جناح البعوضة إلا كانت نُكتةً في قلبه يوم القيامة\" (5) . ـ والأيمان المصبورة: هي التي يلزم بها صاحبها ويحبس عليها.  3 - الحلف في كل حق وباطل: لقوله صلى الله عليه وسلم: \"ثلاثة لا ينظر الله إليهم غداً: شيخ زان، ورجل اتخذ الأيمان بضاعة يحلف في كل حق وباطل، وفقير مختال مزهو\" (6) .",
    "foot_note": "1. صحيح البخاري (3/ 148) برقم (2369). \n2. المعجم الكبير للطبراني (15/ 433) وصححه الألباني في صحيح الترغيب \n…. برقم (1793). \n3. صحيح ابن حبان (11/ 276) وحسنه الأرنؤوط برقم (4909). \n4. سنن أبي داود (3/ 213) وصححه الألباني في السلسلة الصحيحة برقم (2332). \n5. سبق تخريجه. \n6. المعجم الكبير للطبراني (12/ 129) وصححه الألباني في صحيح الجامع برقم (3070).",
    "book_id": "85",
    "new_page_number": 62
  },
  {
    "serial_number": "4644388",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": " ملحق بالفتاوى الشرعية حول الأيمان لفضيلة القاضي العلامة/ محمد بن إسماعيل العمراني - حفظه الله -",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 63
  },
  {
    "serial_number": "4644389",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": " السؤال الأول/ ما هو المشروع في الأيمان ؟ الجواب/ المشروع هو الحلف بالله، أو باسم من أسماء الله تعالى، أو صفة من صفات الله تعالى.  السؤال الثاني/ ما حكم الحلف بغير الله ؟ الجواب/ الحلف بغير الله حرام.  السؤال الثالث/ ما معنى قوله تعالى\" وَلا تَجْعَلُوا اللَّهَ عُرْضَةً لأَيْمَانِكُمْ \"؟ الجواب/ معنى الآية ألا يكثر الشخص من الأيمان كقول البعض\" والله كذا والله كذا والله كذا\" فيحلف في اليوم الواحد عشرات المرات وهذا لا ينبغي.  السؤال الرابع/ رجل يقسم بدين الكعبة فأجبنا بأنه لا يجوز أن يقسم بهذا فأجاب بأن الكعبة ليس لها دين. فهل يجوز القسم بهذه الطريقة؟ وهل يجوز أن نطلق بأن ليس للكعبة دين ؟ الجواب/ أعلم بأن الرسول صلى الله عليه وسلم قال: \" لا تحلفوا بآبائكم ولا بأمهاتكم ومن كان حالفاً فليحلف بالله أو ليصمت\"، وبناءً على ذلك فمن حلف بدين الكعبة فقد خالف الرسول صلى الله عليه وسلم وعليه التوبة والاستغفار. ولا فرق بين أن يقول بالكعبة، أو يقول بدين الكعبة، فالكل غير جائز ولا مانع بأن يحلف برب الكعبة لأن رب الكعبة هو الله. فإذا حلف برب الكعبة فكأنه حلف بالله وحكم الحلف برب الكعبة مثل الحلف بالله تعالى.  السؤال الخامس: ما الحكم في من يحلف بالأمانة ـ وبالكعبة ـ وبالشرف ؟ الجواب: قد نهى النبي صلى الله عليه وسلم عن الحلف بالأمانة كما لا يجوز الحلف بالكعبة ولا مانع من الحلف برب الكعبة وهو الله.  السؤال السادس: هل يجوز التحليف بـ\"والله الحاطم الناقم \"؟ الجواب: الحاطم الناقم ليست من أسماء الله.  السؤال السابع: ما حكم الشرع في من يحلف بالنبي عليه الصلاة والسلام ؟ الجواب: لا يجوز الحلف بغير الله عز وجل لا بالآباء ولا بالأمهات ولا بأي مخلوق حتى ولو بالأنبياء والمرسلين.  السؤال الثامن: هل يشرع إبرار قسم المسلم ؟ الجواب: نعم يشرع للمسلم أن يبر بقسم أخيه لحديث\" من حق المسلم على المسلم إبرار قسمه\".",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 64
  },
  {
    "serial_number": "4644390",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": " السؤال التاسع: نرجو من فضيلتكم التوضيح في قوله صلى الله عليه وسلم\" أفلح وأبيه إن صدق\" ففي هذا الحديث حلف بغير الله ؟ الجواب: قال بعض العلماء: إن النبي صلى الله عليه وسلم أتى بها لا لمعنى اليمين لأن بعض الألفاظ ليست على أصلها مثل\" تربت يداك\" فمعناها \" دعوة عليه بالفقر\" حتى تلتصق يمينه بالتراب وعلى فرض عدم التأويل فإن أحاديث النهي عن الحلف أرجح لأن قول الرسول صلى الله عليه وسلم المبلغ أرجح من فعله وهناك قاعدة \" إذا تعارض حديث دال على النهي وحديث يدل على الإباحة فيعمل بالحديث الدال على النهي عملاً بالأحوط\".  السؤال العاشر: ما الحكم في من يحلف بالله تعالى فجوراً ثم ندم على فعله ماذا يلزمه ؟ الجواب: عليه أن يتوب إلى الله توبة خالصة ويندم على ما كان منه ويعزم على عدم العودة إلى هذا الذنب العظيم وإذا كان قد استقطع مالاً لأحد فمن تمام التوبة أن يرجع ما أخذ ولا تتم توبته إلا بإرجاع ما أخذ كثيراً أو قليلاً ولا تصح التوبة ولا تقبل إلا بالإرجاع لكل ذي حقٍ حقه.  السؤال الحادي عشر: ما هي يمين اللغو ؟ الجواب: اختلف العلماء في تعيينها على ثلاثة أقوال: القول الأول: قول الحنفية والهادوية أنها اليمين التي يحلف عليها الحالف ظاناً أنها واقعة على ما حلف عليه فينكشف خلاف ما حلف عليه. القول الثاني: قول الشافعية: أنها اليمين التي تخرج بغير قصد مثل ما قالت عائشة رضي الله عنها: \" هي قول الرجل لا والله، وبلى والله\" وتفسير الصحابي مقدم على غيره. القول الثالث: قول سعيد ابن المسيب أنها يمين الغضب والصحيح هو قول عائشة وهو\" أن اليمين اللغو هي التي لا يقصد بها الحالف اليمين وإنما هي قول الرجل لا والله وبلى والله بلا قصد الحلف.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 65
  },
  {
    "serial_number": "4644391",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": " السؤال الثاني عشر: نشاهد بعض الناس يتكلمون بكل ما يحلو لهم من سب وشتم وحين يستنكر عليه أحد يقول \" لا يؤاخذكم الله باللغو في أيمانكم\" وبعض الناس يستولي على أموال غيره أي يظلمه ثم يتخلص من فعله باليمين ويكفر عنها معتقداً أن الكفارة تخلصه من الإثم، وبعض الناس يكذب ويحلف بالله وحينما تزجره يقول لك سأكفر عن يميني فنطلب من علمائنا الأفاضل الإجابة الشافية ؟ الجواب: اعلم أن يمين اللغو هي اليمين التي يحلف الإنسان فيها على شيء ظاناً وقوعه فينكشف خلافه مثل أن يحلف بأن محمداً في المسجد ظاناً أنه في المسجد ثم ينكشف بأنه قد خرج من المسجد وأنه حال اليمين لم يكن في المسجد أو هي اليمين التي تخرج من فم الإنسان من غير قصد أو عزم على اليمين مثل قول الرجل لا والله، وبلى والله فهذه اليمين لا يؤاخذ الله الحالف بها وإنما يؤاخذه باليمين المعقودة التي يحلف بها الحالف ليقتطع مال أخيه المسلم أو نحو ذلك، أما السب والشتم فهو حرام شرعاً والمؤمن ليس بلعانٍ ولا طعان، ومن سب أو شتم أو طعن في أخيه المسلم فهو آثم شرعاً واعتذاره بأنه إنما يعمل هذا العمل لكونه مستنداً لقوله تعالى\"لا يؤاخذكم الله باللغو في أيْمَانِكُمْ\" اعتذار غير صحيح وغير مقبول وإنما هو من باب قولهم العذر أقبح من الفعل لأنه ضم إلى السب والشتم المحرمين شرعاً شيئاً زائداً على الذنب وأقبح منه وهو تفسير الآية الكريمة بمعنى لا تدل عليه اللغة لا بمطابقة، ولا بتضمن، ولا التزام. وبما لا يدل على هذا التفسير أي دليل شرعي واعلم بأن كفارة اليمين مشروعة لكل يمين تصدر من الإنسان وإنما تكون فيما ورد النص فيه مثل أن يحلف الإنسان على شيء من الأشياء ثم يرى أن الخير في عدم هذا الشيء كمن يحلف أنه لا يكلم والده أو أخاه أو صديقه ثم يندم على اليمين حيث إنه لا خير في هجر الوالد، أو الأخ، أو الصديق. والخير كل الخير في مواصلة الأب، أو الأخ، أو الصديق، أو في عدم هجره. فمثل هذا الإنسان. المشروع في حقه أن لا يهجر أباه، أو أخاه، أو صديقه، وأن يتكلم معهم ويكفر عن يمينه عملاً بقول الرسول صلى الله عليه وسلم: \"من حلف على يمين ورأى غيرها خيراً منها فليكفر عن يمينه وليأت الذي هو خير\"، أما من يستولي على بعض أموال أخيه أو يظلمه بأي ظلم من أنواع الظلم ثم يتخلص من ذلك الاعتداء الصادر منه على المال أو بعضه أو الاعتداء بظلمه أي نوع من أنواع الظلم باليمين معتقداً بأن اليمين قد قطعت العلاقة فيما بينه وبين غريمه المعتدى عليه أمام الله تعالى فهذا الإنسان خاطئ في اعتقاده بأن اليمين قد جعلته في حل أو جعلته غير مسئول أمام الله لكونه قد كفر عن يمينه هذه بأي نوع من أنواع الكفارة المذكورة في القرآن أن هذه الكفارة غير مسوغة لأخذ مال أخيه بغير حق من الحقوق الشرعية وغير مجوزة للظلم الذي صدر منه ولا زال مسئولاً أمام الله عز وجل عن أخذ المال أو عن ظلمه لأخيه بأي نوع من أنواع الظلم وإن كان قد أصبح بريئاً أمام القاضي لأن حكم القاضي ينفذ ظاهراً لا باطناً كما دلت عليه الأدلة الصحيحة من السنة النبوية المطهرة على صاحبها وعلى آله أفضل الصلاة والسلام فمن ادعى على إنسان أن لديه مبلغاً من المال فأنكر المدعى عليه هذه الدعوى وطالب بالبرهان على الدعوى ولم يتمكن المدعي من إقامة البرهان لكون مستنداته قد ضلَت أو لم يكن قد كتب على غريمه مستنداً فيما عنده له واضطر إلى طلب اليمين من غريمه المنكر فحلف الغريم فإن القاضي سيحكم على المدعي بالقنوع وبكف الخطاب عن المدعى عليه وسيكون هذا الحكم نافذاً في الظاهر بمعنى أنه لم يبق للمدعي أي حق في المطالبة للغريم ما دام لم يتمكن من البرهان على دعواه وطلب من المدعى عليه اليمين وحلف المدعى عليه فعلاً، أما في الباطن فإن الحكم غير نافذ ولا يزال المدعى عليه مسئولاً أمام الله تعالى.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 66
  },
  {
    "serial_number": "4644392",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": " السؤال الثالث عشر: ما هي اليمين الغموس وهل لها كفارة ؟ الجواب: اليمين الغموس هي اليمين التي يحلف الحالف بها يميناً فاجرة لأجل أن يأخذ بها مال أخيه المسلم بغير حق ولا كفارة لها بل يتوب ويرجع ما أخذ.  السؤال الرابع عشر: ما حكم يمين المكره ؟ الجواب: يمين المكره لا يجب عليه الوفاء بها ولا يأثم بالحنث فيها ولا تلزمه كفارة وحد الإكراه هو أن يهدد الشخص بالقتل أو قطع عضو من أعضائه ويكون المهدد قادراً على تهديده وبيده آلة القتل أو القطع كأن يكون معه البندق أو المسدس لقتله أو السكين أو نحوها لتقطيع أجزائه وأن يكون المُهدِد قد أغلق على المكره الباب وحبسه في مكان على انفراد والمُهدِد قادر متمكن من تنفيذ التهديد وقد غلب على ظن الحالف أن المهدد سينفذ التهديد ففي مثل هذه الحالة يعتبر الإكراه، أما إذا هُدد المُكره بالحبس أو نحوه فلا يُعد إكراهاً.  السؤال الخامس عشر: إذا وقف الإنسان في موقف محرج وليس أمامه مخرج إلا اليمين فما حكم اليمين هنا ؟ الجواب: الإحراج شيء والإكراه شيء آخر فمن حلف محرجاً فهو آثم ومن طلق محرجاً طلقت زوجته لأن الإحراج غير الإكراه.  السؤال السادس عشر: هل يجوز الحلف على جهة المزح وهل يعتبر من لغو اليمين ؟ الجواب: لا يجوز لأي إنسان أن يحلف مزحاً ولا هزلاً فالهزل والمزح باليمين حرام ولا تسمى يمينه يمين لغو وهو مؤاخذ بها.  السؤال السابع عشر: ما الحكم في من يحلف أن هذه السلعة بكذا وكذا وليست كما يقول؟ هل يعتبر هذا من اليمين الغموس أفيدونا مأجورين ؟ الجواب: هذه اليمين حرام مطلقاً وإذا كان سيقتطع بها مال مسلم فهي غموس.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 67
  },
  {
    "serial_number": "4644393",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": " السؤال الثامن عشر: ما حكم الشرع في من يحلف بالحرام والطلاق ؟ الجواب: لا يجوز ولا ينبغي الحلف بالطلاق وإذا حلف بقوله\" علي الحرام والطلاق أو حرام وطلاق\" فيرجع إلى نيته فإن كان قد نوى الطلاق وقعت طلقة لأن هذا الكلام من كنايات الطلاق وكنايات الطلاق إن كان قد نوى بها الطلاق وقعت طلقة وإن نوى اليمين أخرج كفارة اليمين والقول قوله وعليه اليمين يحلف بالله العظيم أنه ما نوى الطلاق فيرحم نفسه ولا يحلف إلا على يقين وإلا فإنه سيعاقب عقاب اليمين ثم عقاب بقاء المرأة لديه وقد حرمت عليه.  السؤال التاسع عشر: ما حكم الشرع في من قال لزوجته حرمت عليَّ ؟ الجواب: هذه كناية طلاق إن نوى بها الطلاق وقعت طلقة وإن لم ينوِ بها الطلاق لا تقع طلقة وعليه كفارة يمين إن نوى بها اليمين والقول قوله وعليه اليمين يحلف أنه ما نوى الطلاق.  السؤال العشرون: ما الحكم في من يقول حرام وطلاق ؟ الجواب: هذه كناية من كنايات الطلاق إن كان المتكلم قد نوى الطلاق وقعت طلقة وإلا فلا والقول قوله وعليه اليمين يحلف بالله أنه ما نوى الطلاق وإذا حلف لا تقع طلقة فيرحم نفسه ولا يحلف إلا على يقين.  السؤال الحادي والعشرون: ما حكم الشرع في من يقول عليَّ الطلاق؟ هل يعتبر هذا طلاقاً ؟ الجواب: هذه كناية طلاق إن نوى الطلاق وقعت طلقة وإن نوى اليمين عليه كفارة يمين والقول قوله وعليه اليمين فليتق الله ولا يحلف إلا على يقين وإلا فالعقاب عظيم.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 68
  },
  {
    "serial_number": "4644394",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": " السؤال الثاني والعشرون: إذا قال الرجل حرام ويمين فهل تسمى لفظة حرام طلاق أو يمين؟ وهل عليه كفارة ؟ الجواب: لفظة حرام إن نوى بها الشخص طلاقاً تقع طلاقاً وإن نوى بها يميناً تقع يميناً والسيد العلامة/ محمد بن إسماعيل الأمير قال: لا تقع طلاقاً ولا يميناً لأنها ليست صفة من صفات الله تعالى وليس عليها كفارة.  السؤال الثالث والعشرون: ما حكم الشرع الحنيف في رجل قال لزوجته حرام وطلاق لو تذهبين بيت والدك ما تدخلي لي بيت ؟ الجواب: إذا نوى الطلاق وخالفت وقعت طلقة.  السؤال الرابع والعشرون: رجل قال لزوجته حرام وطلاق ما تمسي لي في بيت ثم أمست في بيته هل تعتبر طلقة ؟ الجواب: إذا نوى الطلاق وقعت طلقة وإلا فلا.  السؤال الخامس والعشرون: ما حكم الشرع في من يقول علي الحرام ؟ الجواب: هذه كناية طلاق لا طلاق صحيح فإذا نوى الطلاق وقعت طلقة إذا خالف وإن نوى اليمين تقع يميناً.  السؤال السادس والعشرون: ما الحكم في شخص قال لزوجته لو تذهبين عند العرس لا أحرمش مثل أمي فذهبت عند العرس هل يُعد هذا طلاقاً ؟ الجواب: هذا فعل مضارع للمستقبل لا يقع.  السؤال السابع والعشرون: ما الحكم في رجل قال لزوجته حرام وطلاق لو تذهبين عند العرس أنك مطلقة ؟ الجواب: طلاق وشرط فلا تذهب وإذا ذهبت وقعت طلقة وإن لم تذهب لا يقع.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 69
  },
  {
    "serial_number": "4644395",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": " السؤال الثامن والعشرون: جرت على ألسنة الشباب في بلادنا كلمة حرام وطلاق حيث يقولها معظمهم على أتفه الأسباب مثل \" حرام وطلاق لا تأتي عندنا الليلة، وحرام وطلاق لأُعطينَّك الفلوس غداً\" فما حكم هذه الكلمة وهل تعد طلاقاً أم لا ؟ الجواب: هذه من كناية الطلاق إن نوى المتكلم بها الطلاق وقعت طلقة وإن نوى اليمين يخرج كفارة يمين والقول قوله وعليه اليمين فيرحم نفسه ولا يحلف إلا على يقين وإلا فعليه عقابان.  السؤال التاسع والعشرون: ما الحكم في من حلف بالله أو بالطلاق على شيء ثم عمله ناسياً ؟ الجواب: لا يؤاخذ.  السؤال الثلاثون: هل تقبل الشهادة بعد قبول اليمين ؟ الجواب: هذه مسألة خلافية بين العلماء ذهب الهادوية وجماعة من العلماء إلى أن الشهادة تقبل والإمام يحيى بن محمد حميد الدين ذهب في اختياراته إلى أنه لا تقبل الشهادة العادلة بعد أخذ اليمين \"لحديث شاهداك أو يمينه\" فقد أتى في الحديث بلفظ \"أو التخييرية\" وما دام وقد حلف المدعى عليه فقد استوجب النار بالحنث في يمينه إذا اقتطع به مال امرئٍ مسلم ولكن بشرط أن يكون أداء اليمين بحسب طلب الغريم وبحضوره، أما إذا حلف المدعى عليه بدون طلب اليمين منه فلا تسقط الشهادة وإن حلف بدون حضور المدعي فعليه أن يعيد اليمين بحضور المدعي إن طلب المدعي ذلك وهذا القول الأخير هو الراجح عند شيخ الإسلام الشوكاني رحمه الله.  السؤال الحادي والثلاثون: هل تنعقد اليمين على الغير ؟ الجواب: عند الهادويه أن اليمين تنعقد على الغير فبناءً على هذا القول فمن حلف على إنسان آخر ولم يبر قسمه فيجب على الحالف أن يكفر ولكن علماء اليمن المتأخرين مثل المقبلي والجلال والشوكاني والأمير قالوا: إن اليمين لا تنعقد على الغير لأن الإنسان الآخر ليس تحت سلطة الحالف ولأنّ للغير إرادته وقدرته وطاقته وللحالف إرادته وقدرته وطاقته والإنسان لا يحاسب إلَاّ على أفعال نفسه ولا يحاسب على أفعال الغير. وكان الأولى بالإنسان الآخر أن يبر قسم أخيه. ويلبي طلب أخيه جبراً لخاطره وقد أساء الإنسان الآخر بعدم إبرار قسم أخيه وأثم.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 70
  },
  {
    "serial_number": "4644396",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": " السؤال الثاني والثلاثون: إذا دعى رجلٌ رجلاً أن يتناول طعام الغداء عنده وحلف الداعي على المدعو ويغلب في ظن الداعي أن المدعو سيستجيب له ولكن المدعو لم يحضر فهل يحنث الحالف وتجب عليه كفارة ؟ الجواب: لا يحنث الحالف لأن اليمين على الغير لا تنعقد ويأثم المحلوف عليه بعدم إبرار قسم الحالف ولا تجب عليه كفارة هذا ما ذهب إليه جماعة من العلماء منهم الإمام شرف الدين والجلال والمقبلي والأمير والشوكاني.  السؤال الثالث والثلاثون: دعوت أحد أصدقائي للغداء فلم يرض فقلت له والله لابد أن تصل وتتغدى عندي فانتظرته ولم يصل فسألت بعض العلماء: فقال عليك كفارة وسألت آخرين فقالوا لا كفارة عليَّ فتحيرت فأفيدوني جزاكم الله خيراً ؟ الجواب: من أجابك أيها السائل أن عليك الكفارة فهو مبني على أن اليمين تنعقد على الغير وهو مذهب الهادي ومن أجابك أنه لا كفارة عليك فهو مبني على أن اليمين لا تنعقد على الغير وهو مذهب المقبلي والأمير والشوكاني وبناءً على ذلك فعليك الكفارة عند الهادوية وليس عليك كفارة عند الشوكاني والأمير وغيرهم. ورأيي الشخصي هو عدم وجوب الكفارة لأن اليمين على الغير لا تنعقد لأمور هي: 1) لأنه غير داخل في مقدور الحالف وغير داخل في إمكانه والعلماء يشترطون في اليمين أن يكون في مقدور الحالف. 2) قال تعالى: \" وَاحْفَظُوا أَيْمَانَكُمْ\" وحفظها على الغير غير ممكن. 3) الرؤيا التي فسرها أبو بكر رضي الله عنه عند النبي صلى الله عليه وآله وسلم وقال له الرسول صلى الله عليه وعلى آله وسلم أصبت بعضاً وأخطأت بعضاً فقال أبو بكر رضي الله عنه والله لتحدثني ما الذي أخطأت فقال له النبي صلى الله عليه وعلى آله وسلم \" لا تقسم\" ولم يبين له حكماً يترتب على قسمه ولم يأمره بالكفارة مع أنه في وقت حاجة وتأخير البيان عن وقت الحاجة لا يجوز.  السؤال الرابع والثلاثون: ما الحكم في من حلف على شيء فجاءه آخر وقال أنا أكفر عنك يمينك هل يجوز أن يكفر شخص عن آخر ؟ الجواب: لا مانع بعد أن يوكله الحالف ويُنيبه.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 71
  },
  {
    "serial_number": "4644397",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": " السؤال الخامس والثلاثون: ما حكم الاستثناء في الأيمان ؟ الجواب: يجوز الاستثناء في الأيمان ولكن بشرط أن يكون الاستثناء متصلاً ولا يجوز التراخي فيه إلا لضرورة كسعال أو بلع ريق أو عطاس أو نحوه.  السؤال السادس والثلاثون: من حلف وقال سراً إن شاء الله فما حكم يمينه ؟ الجواب: إن شاء الله لا تكون استثناءً إلا إذا علق اليمين بشيء في المستقبل أما إذا حلف أنه ما عمل شيئاً قد مضى فلا عمل بقوله إن شاء الله لأن الناس قد تلاعبوا بلفظة\" إن شاء الله\".  السؤال السادس والثلاثون [*]: هل هناك قول للعلماء بجواز التراخي في الاستثناء في الأيمان ؟ الجواب: هو مذهب حبر الأمة\" عبدالله بن عباس\" ولكنه مذهب ضعيف لأنه سيؤدي إلى عدم إتمام المعاملات المالية وغيرها من العقود كالبيع والشفعة والإجارة وبيعة الخلفاء وغيرها من عقود المعاملات.  السؤال السابع والثلاثون: ما حكم الشرع في من حلف أن لا يكلم شخصاً معيناً، أو صديقاًأو لا يدخل دار اثم يريدأن يكلم صديقه أويدخل ذلك الدار فماذا يلزمه ؟ الجواب: يخرج الكفارة ثم يكلمه.  السؤال الثامن والثلاثون: إذا حلف الشخص على شيء ليس في الحنث فيه وليس في فعل الشيء خير. فهل يشرع للحالف التكفير عن اليمين حتى وإن لم يكن في فعله خيرٌ ؟ الجواب: لا يكفر الحالف إلا إذا كان في فعل الشيء المحلوف بعدم فعله خير، أما إذا لم يكن في فعله خير فلا يكفر.  السؤال التاسع والثلاثون: حلفت ألا أتزوج أبداً إلا عندما يقول لي إخواني وقد أقسمت عدة مرات ألا أتزوج فما يلزمني إذا أردت الزواج ؟ الجواب: اعلم أنه عند أن تتيسر لك زوجة وتعقد بها، عليك إخراج كفارة وهي إطعام عشرة مساكين لأن النبي صلى الله عليه وسلم أمر بذلك في الحديث الصحيح المصرح بأن من حلف على شيء ورأى شيئاً خيراً منه فليأت الذي هو خير وليكفر عن يمينه\" والزواج خير من العزوبة لحديث \"يا معشر الشباب من استطاع منكم الباءة فليتزوج ومن لم يستطع فعليه بالصوم\".",
    "foot_note": "1. [*] قال مُعِدُّ الكتاب للشاملة: كذا بالأصل، تكرر الرقم",
    "book_id": "85",
    "new_page_number": 72
  },
  {
    "serial_number": "4644398",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": " السؤال الأربعون: حلفت على شيء وبعد ذلك رأيت أن أعمل خلافه فما الحكم ؟ الجواب: قال النبي صلى الله عليه وسلم\" من حلف على شيء ورأى غيره خيراً منه فليكفر عن يمينه وليأتي الذي هو خير\" فإذا كان الذي حلفت على أن لا تعمله خيراً فكفر واعمله وإن كان لا خير فيه فلا تأته ولا تكفر عنه فمثلاً: \" إذا حلفت أن لا تكلم صديقك فكفر وكلمه وإن حلفت أن لا تشرب الدخان فلا تشرب الدخان ولا تكفر لأن الدخان ليس بخير وإنما هو شيء مضر كما قرره الأطباء.  السؤال الحادي والأربعون: ما الحكم في من حلف أن لا يخزن وأن لا يشرب الدخان ثم عاد لهما ؟ الجواب: هو آثم لرجوعه وعلى هذا الشخص ترك ما حلف أنه لا يعمله والإقلاع عنه.  السؤال الثاني والأربعون: هل اليمين على نية الحالف أم على نية المستحلف وما حكم الشرع في من يحلف على شيء ويضمر غيره ؟ الجواب: اليمين على نية المُحلِف في الحقوق لا على نية الحالف إلا في ما كان في دعوى باطلة آثمة وفي من يطلب من المواطن ما لا حق له فيه وإنما إدخال الضرر والأذى عليه.  السؤال الثالث والأربعون: ما حكم الشرع في من قال أنا بريء من الإسلام على جهة اليمين ؟ الجواب: هذا حرام وعليه التوبة ولا يكون يميناً.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 73
  },
  {
    "serial_number": "4644399",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": " السؤال الرابع والأربعون: ما نصيحتكم - فضيلة الشيخ- في من يقول: هو يهودي ليفعلن كذا أو ليأتين بكذا ثم لا يفعل هل يعتبر يميناً وهل تلزم فيه كفارة ؟ الجواب: عليه التوبة النصوح.  السؤال الخامس والأربعون: ما الحكم في من يحلف ويقول\" هو يهودي وعليه الطلاق\" هل يعتبر هذا طلاق أم يمين إذا حنث ؟ الجواب: قوله هو يهودي عليه التوبة النصوح، وقوله وعليه الطلاق كناية من كنايات الطلاق إن نوى بهذه الكلمة الطلاق وقعت طلقة وإن نوى بها اليمين فعليه كفارة يمين وعليه أن يحلف بالله العظيم أنه لم ينو الطلاق، وإذا حلف لا تقع طلقة فيرحم نفسه ولا يحلف إلا على يقين وإلا فإنه سيعاقب عقاب اليمين إذا كان فاجراً وعقاب بقاء المرأة بعد طلاقها.  السؤال السادس والأربعون: هل يجوز إطعام كفارة اليمين مسكيناً واحداً لمدة عشرة أيام أو يعطي النقود لمسكين واحد ؟ الجواب: الجمهور يقولون يجب على الحانث إطعام عشرة مساكين لقوله تعالى: \"إِطْعَامُ عَشَرَةِ مَسَاكِينَ\" فيطعم الحانث عشرة مساكين خلافاً للحنفية فهم يقولون يطعم الحانث مسكيناً عشرة أيام ويؤولون قوله تعالى: \"إِطْعَامُ عَشَرَةِ مَسَاكِينَ\" بأن يخرج الحانث إطعام عشرة مساكين حتى ولو أعطاهم لمسكين واحد وهو تأويل بعيد.  السؤال السابع والأربعون: هل إطعام العشرة المساكين وجبة واحدة أم وجبتين؟ وهل يمكن إعطاؤهم نقوداً بدل الطعام ؟ الجواب: قال العلماء يطعمون وجبتين أما جواز إعطائهم نقوداً فينظر إلى حال الفقير فإن كان سيصرف النقود في ثمن علاج أو إطعام لأولاده فيعطى نقوداً وإن كان سيصرف النقود في ثمن قات أو سيجارة فيطعم الحالف ولا يعطى الفقير نقوداً.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 74
  },
  {
    "serial_number": "4644400",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": " السؤال الثامن والأربعون: إذا حلف شخص وأراد أن يكفر بإطعام عشرة مساكين فهل يجوز له أن يطعم أهله مع أنهم من أفقر الناس ؟ الجواب: إن كان الشخص غنياً فيطعم عشرة مساكين من غير أهله وإن كان فقيراً فيصوم ثلاثة أيام.  السؤال التاسع والأربعون: إذا كثرت الأيمان فهل يكفر عن كل يمين أم تكفي كفارة واحدة ؟ الجواب: إذا كانت الأيمان على أشياء مختلفة مثل أن يقول والله لن أقرأ فقرأ والله لن أدخل البيت فدخل البيت، والله لن أكتب كذا فكتب. فبُكفر عن كل يمين حلفه كفارة. وإن كانت الأيمان على شيء واحد مثل أن يقول والله لا أدخل البيت فيقال له في اليوم الثاني ادخل البيت فقال والله لا أدخل البيت وفي اليوم الثالث قيل له ادخل البيت فقال والله لا ادخل البيت فهذا لا يخلو أما أن يكون الحالف قد كفر فيما بينها فيكفر عن كل يمين كفارة وإن لم يكن قد كفر فيكفر كفارة واحدة لأن الأيمان عبارة عن يمين واحدة فتعتبر اليمين الثانية مؤكدة للأولى والثالثة مؤكدة للثانية وهكذا.  السؤال الخمسون: هل يجوز إخراج الكفارة للمساكين من الأقارب ؟ الجواب: نعم يجوز وتكون صلة وكفارة.  السؤال الحادي والخمسون: هل يجوز إعطاء الكفارة لجمعية خيرية ؟ الجواب: إذا كان للجمعية الخيرية بند لأخذ الكفارة وصرفها للمساكين فيجوز بشرط أن يوضح الشخص المعطي لهم أنها كفارة يمين لكي يصرفوها للمساكين.  السؤال الثاني والخمسون: هل يجوز إخراج الكفارة للمجاهدين ؟ الجواب: النص ورد في إعطائها للمساكين ولكن إذا أعطاها للمجاهدين فلا مانع إن كانوا مساكين.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 75
  },
  {
    "serial_number": "4644401",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": " السؤال الثالث والخمسون: هل كفارة اليمين على وجه التخيير أم على وجه الترتيب ؟ الجواب: على وجه الترتيب لا على الوجه التخيير لأن الله تعالى يقول في القرآن\"فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيَّامٍ\".  السؤال الرابع والخمسون: هل يشترط التتابع في صوم الكفارة ؟ الجواب: نعم لقراءة ابن مسعود \"متتابعات\"  السؤال الخامس والخمسون: هل يجزئ إخراج القيمة بدلاً عن الكفارة ؟ الجواب: لا مانع.  السؤال السادس والخمسون: أولاً: حدث أن امرأة قالت لابنها: بأنها لن تكلم ابنها مرة ثانية وإذا كلمته ستكون له مثل أخواته فما قول العلماء في ذلك؟ ثانياً: ما قولكم في أم كثيراً ما تفتش ملابس أولادها من أجل المحافظة عليهم من أي مكروه فهل يوجد مانع من ذلك أو أنه لا مانع أفيدونا ؟ الجواب: اعلمي أيتها الأخت السائلة بأنها إذا حلفت باسم من أسماء الله أو بصفة من صفات الله ثم حنثت باليمين فعليها الكفارة وهي إطعام عشرة مساكين وإذا هي لم تتمكن من إطعامهم لفقرها فعليها صيام ثلاثة أيام متتابعة وأما الكلام المذكور في السؤال فلا يجوز فيه الكفارة وإن كان فيه ما يخالف الأدب الذي يجب أن تتحلى به المرأة المسلمة ولاسيما إذا كانت المرأة هي أم مع ولدها. والجواب على الثاني: اعلمي أنه لا مانع من ذلك.  السؤال السابع والخمسون: ما حكم الشرع في من يشترط الحلف على المصحف الشريف، أو على سورة معينة منه مثل سورة الحشر ؟ الجواب: لا لزوم لذلك لكن إذا رأى الحاكم الشرعي أن المصلحة في ذلك عملها وذلك أن بعض المواطنين إذا خوفوه بالحلف على المصحف أو في المسمورة والمنقورة خاف ونكل وإذا قالوا له يحلف في أي مكانٍ على أي صفة حلف.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 76
  },
  {
    "serial_number": "4644402",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": " السؤال الثامن والخمسون: ما حكم الشرع في من يشترط على المحَّلف أن يحلف على رؤوس أولاده أو يحلف على حاله وماله ؟ الجواب: الحلف لا يكون إلا باسم من أسماء الله أو بصفة من صفاته ولا يكون الحلف بغير ذلك كما دل عليه الدليل.  السؤال التاسع والخمسون: ما الحكم في الشرع لمن يشترط اليمين عند قبر ولي من الأولياء ؟ الجواب: هذا لا يجوز.  السؤال الستون: هل لتشبيك الأيدي عند الحلف أصل في الشرع؟ وهل يجوز ذلك ؟ الجواب: هذه عادة لا شرع.  السؤال الحادي والستون: ما الحكم في الحلف في الجامع الكبير بين المسمورة والمنقورة ؟ الجواب إذا رأى القاضي أو الغريم المصلحة في هذه البقعة فلا مانع وإلا فلا لزوم.  السؤال الثاني والستون: ما حكم تخصيص الحلف بقبلة الجامع وعلى سورة الحشر ؟ الجواب: إذا رأى الحاكم أو الغريم أو المتوسطون المصلحة في هذه المسألة فلا مانع وإلا فلا.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 77
  },
  {
    "serial_number": "4644403",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": " المراجع العلمية 1 - الجامع لأحكام القرآن ـ للقرطبي ـ المكتبة التوفيقية، ودار عالم الكتب. 2 - تفسير البغوي ـ دار طيبة ـ تحقيق: محمد النمر وعثمان جمعة وسيلمان الجراش. 3 - مفردات ألفاظ القرآن للراغب الأصفهاني ـ دار القلم دمشق ـ الدار الشامية ـ تحقيق: صفوان عدنان داوودي. 4 - تفسير المنار للسيد محمد رشيد رضا ـ دار الكتب العلمية ـ بيروت. 5 - فتح القدير للقاضي محمد بن علي الشوكاني ـ دار ابن كثير ودار الكلم الطيب. 6 - أضواء البيان في تفسير القرآن بالقرآن للشنقيطي. دار الفكر ــ بيروت. 7 - المعجم المفهرس لألفاظ القرآن الكريم - لمحمد فؤاد عبدالباقي - دار الحديث القاهرة 8 - نزهة الأعين النواظر في علم الوجوه والنظائر ـ لأبي الفرج بن الجوزي ـ مؤسسة الرسالة ـ بيروت ـ تحقيق: محمد عبدالكريم كاظم الراضي. 9 - فتح الباري شرح صحيح البخاري للحافظ ابن حجر العسقلاني ـ دار السلام ـ دار الفيحاء. 10 - صحيح البخاري _ دار الشعب _ القاهرة. 11 - صحيح مسلم بشرح النووي ـ دار الآثار. 12 - إكمال المعلم شرح صحيح مسلم للقاضي عياض. 13 - عون المعبود شرح سنن أبي داود لأبي الطيب شمس الحق العظيم آبادي. 14 - سنن أبي داود السجستاني _ دار الكتاب العربي _ بيروت. 15 - سنن النسائي بشرح الحافظ السيوطي وحاشية السندي ـ دار المعرفة. 16 - سنن الترمذي _ دار الغرب الإسلامي _ بيروت. 17 - سنن ابن ماجة _ دار الفكر _ بيروت _ تحقيق: محمد فؤاد عبد الباقي. 18 - صحيح سنن الترمذي ـ للألباني ـ مكتبة التربية العربي لدول الخليج. 19 - صحيح سنن ابن ماجه للألباني ـ مكتبة المعارف ـ الرياض. 20 - تحفة الأحوذي شرح جامع الترمذي للمباركفوري ـ دار الحديث ـ الرياض. 21 - صحيح ابن حبان بتحقيق شعيب الأرنؤوط ـ مؤسسة الرسالة. 22 - المستدرك على الصحيحين للحاكم النيسابوري - دار الكتب العلمية بيروت 23 - صحيح موارد الظمآن إلى زوائد ابن حبان للألباني ـ دار العصيمي. 24 - معجم الطبراني الصغير _ المكتب الإسلامي _ بيروت _ تحقيق: محمد شكور محمود. 25 - معجم الطبراني الأوسط ـ منشورات دار الحرمين ـ القاهرة.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 78
  },
  {
    "serial_number": "4644404",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "26 - معجم الطبراني الكبير ـ دار إحياء التراث العربي. 27 - السنن الكبرى للبيهقي ـ دار الكتب العلمية بيروت ـ تحقيق: محمد عبدالقادر عطا. 28 - مسند الإمام أحمد _ مؤسسة الرسالة _ تحقيق: شعيب الأرنؤوط ، وعادل مرشد. 29 - مسند البزار _ مكتبة العلوم والحكم _ المدينة المنورة. 30 - مسند أبي يعلى _ دار المأمون للتراث _ دمشق _ تحقيق: حسين سليم أسد. 31 - شعب الإيمان للبيهقي _ دار الكتب العلمية _ بيروت _ تحقيق: محمد السعيد بسيوني. 32 - حلية الأولياء وطبقات الأصفياء لأبي نعيم الأصبهاني _ دار الكتاب العربي _ بيروت. 33 - جمع الفوائد من جامع الأصول ومجمع الزوائد للمغربي - مكتبة ابن كثير، ودار ابن حزم بتحقيق سليمان العازمي. 34 - مجمع الزوائد ومنبع الفوائد للهيتمي ـ تحقيق: عبدالله محمد الدرويش ـ دار الفكر. 35 - إرواء الغليل في تخريج أحاديث منار السبيل للألباني ـ المكتب الإسلامي. 36 - صحيح الجامع الصغير وزيادته للألباني ـ المكتب الإسلامي. 37 - صحيح الترغيب والترهيب ـ للألباني ـ مكتبة المعارف. 38 - الجامع الصحيح مما ليس في الصحيحين للشيخ مقبل الوادعي ـ دار الحرمين القاهرة. 39 - النهاية في غريب الحديث والأثر لابن الأثير ـ مؤسسة التاريخ العربي. 40 - لسان العرب لبن منظور ـ دار الفكر. 41 - المصباح المنير في غريب الشرح الكبير للرافعي للعلامة المقري الفيومي ـ دار الباز مكة المكرمة. 42 - تاج العروس من جواهر القاموس للمرتضى الزبيدي _ دار الهداية _. 43 - القاموس المحيط ـ للفيروز آبادي ـ دار إحياء التراث العربي. 44 - البداية والنهاية للحافظ ابن كثير الدمشقي - دار إحياء التراث العربي. 45 - تاريخ الطبري لأبي جعفر محمد بن جرير الطبري- تحقيق: محمد أبو الفضل إبراهيم - بيروت- لبنان. 46 - عصر المأمون للدكتور: أحمد فريد رفاعي- دار الكتب المصرية - القاهرة. 47 - البناية شرح الهداية لبدر الدين العيني ـ دار الكتب العلمية. 48 - التوقيف على مهمات التعاريف لمحمد عبد الرؤوف المناوي _ دار الفكر المعاصر _ تحقيق: د/ محمد رضوان الداية. 49 - بدائع الصنائع في ترتيب الشرائع ـ دار إحياء التراث العربي. 50 - الفروق للإمام القرافي ـ المكتبة العصرية.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 79
  },
  {
    "serial_number": "4644405",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "51 - المجموع للإمام النووي ـ دار إحياء التراث العربي. 52 - المغني للإمام ابن قدامة المقدسي ـ دار الحديث. 53 - روضة الطالبين وعمدة المفتين للنووي ـ المكتبة الإسلامية. 54 - المحلى لابن حزم ـ تحقيق: أحمد شاكر ـ دار التراث ـ القاهرة. 55 - رد المحتار على الدر المختار لبن عابدين ـ دار إحياء التراث العربي. 56 - بداية المجتهد ونهاية المقتصد لابن رشد الحفيد ـ تحقيق: حلاق ـ مكتبة ابن تيمية. 57 - مدونة الفقه المالكي للدكتور الصادق عبدالرحمن الغرياني ـ مؤسسة الريان. 58 - نيل الأوطان بشرح منتقى الأخبار: للشوكاني ـ دار الحديث. 59 - سبل السلام: للعلامة محمد بن إسماعيل الأمير الصنعاني ـ دار العقيدة. 60 - توضح الأحكام من بلوغ المرام للبسام ـ مكتبة النهضة الحديثة ـ مكة المكرمة. 61 - الشرح الممتع على زاد المستقنع للعلامة ابن عثيمين ـ مكتبة الأنصار. 62 - الروض المربع ـشرح زاد المستقنع لمنصور البهوتي - تحقيق: السعدي وابن عثيمين ـ دار المؤيد ومؤسسة الرسالة. 63 - الإقناع لابن المنذر ـ تحقيق: صغير الأنصاري ـ مكتبة مكة الثقافية. 64 - الدراري المضية شرح الدرر البهية للشوكاني ـ تحقيق: حلاق ـ مكتبة الإرشاد. 65 - السراج الوهاج على متن المنهاج للإمام النووي ـ دار الفكر. 66 - السيل الجرار المتدفق على حدائق الأزهار للعلامة الشوكاني ـ دار ابن حزم. 67 - كتاب الفقه على المذاهب الأربعة: للحريري ـ دار الحديث. 68 - زاد المعاد من هدى خير العباد لبن القيم الجوزية ـ تحقيق: شعيب وعبدالقادر الأزنؤوط ـ مؤسسة الرسالة. 69 - الفقه الإسلامي وأدلته ـ د/ وهبة الزحيلي ـ دار الفكر. 70 - المفصل من أحكام المرأة د /عبدالكريم زيدان ـ مؤسسة الرسالة. 71 - الأخبار العلمية والاختيارات الفقهية لشيح الإسلام ابن تيمية- تأليف علاء الدين الدمشقي مع تعليق ابن عثيمين- دار العاصمة. 72 - مجموع فتاوى شيخ الإسلام ابن تيمية دار الوفاء، والفتاوى الكبرى لابن تيمية ـ دار الكتب العلمية. 73 - إعلام الموقعين عن رب العالمين لا بن القيم الجوزية ـ دار الفكر. 74 - الطرق الحُكمية في السياسة الشرعية لابن القيم الجوزية ـ دار الحديث ـ القاهرة. 75 - فتح المجيد ـ شرح كتاب التوحيد لعبدالرحمن بن حسن ـ طبعة جمعية الإحسان.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 80
  },
  {
    "serial_number": "4644406",
    "category_id": "19",
    "category": "مسائل فقهية",
    "book_title": "واحفظوا أيمانكم",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "76 - إغاثة اللهفان من مصائد الشيطان لابن القيم ـ دار الحديث. 77 - أثر الاختلاف في القواعد الأصولية في اختلاف الفقهاء د/ مصطفى الخن ـ مؤسسة الرسالة. 78 - فقه السنة للسيد سابق ـ دار إحياء التراث العربي. 79 - أحكام الأسرة في الشريعة الإسلامية د/القليصي ـ مكتبة الجيل الجديد. 80 - القضاء والإثبات الشرعي د/ صالح الضبياني. 81 - فتاوى الشيخ مصطفى الزرقاء ـ دار القلم. 82 - فتاوى المرأة المسلمة لا بن عثيمين. 83 - الشبكة الإسلامية ـ موسوعة الفتاوى. 84 - الموسوعة الفقهية وزارة الأوقاف والشئون الإسلامية بالكويت. 85 - فتاوى السيد محمد رشيد رضا - دار الكتاب الجديد - بيروت. 86 - الاحتجاج بالقراءة الشاذة وأثرها في اختلاف الفقهاء لمحمد مشهوري محمد نعيم.",
    "foot_note": "None",
    "book_id": "85",
    "new_page_number": 81
  }
]