[
  {
    "text": "Akhbar fi al-Nahw (News in Grammar)\nAuthor: أبو طاهر عبد الواحد بن عمر بن محمد بن أبى هاشم المقرئ\nYear: 349",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Akhbar fi al-Nahw (News in Grammar)",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 1
  },
  {
    "text": "sn: 2101\nbook_title: أخبار في النحو\nbook_link: https://shamela.ws/book/857\nbook_id: 857\nauthor_name: أبو طاهر عبد الواحد بن عمر بن محمد بن أبى هاشم المقرئ\nauthor_year: 349\nnickname: أبو طاهر\nauthor_link: https://shamela.ws/author/688\nauthor_ID: 688\neditor: الدكتور محمد أحمد الدالي\npublisher: الجفان والجابي للطباعة والنشر\nedition: الأولى، 1413 هـ - 1993 م\npages: 64\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب السنة\ncategory_id: 6",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Akhbar fi al-Nahw (News in Grammar)",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 2
  },
  {
    "serial_number": "1210441",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw (News in Grammar)",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sunnah Books\nBook: Akhbar fi al-Nahw (News in Grammar)\nNarration of: Abu Tahir Abdul Wahid bin Umar bin Abi Hashim (Died 349 AH) from his Sheikhs\nInvestigated and annotated by: Dr. Muhammad Ahmad Al-Dali\n\nBook: Akhbar fi al-Nahw\nNarration of: Abu Tahir Abdul Wahid bin Umar bin Abi Hashim (Died 349 AH) from his Sheikhs\nInvestigated and annotated by: Dr. Muhammad Ahmad Al-Dali\n\nNarration of: Abu Tahir Abdul Wahid bin Umar bin Abi Hashim (Died 349 AH) from his Sheikhs\nInvestigated and annotated by: Dr. Muhammad Ahmad Al-Dali\n\nInvestigated and annotated by: Dr. Muhammad Ahmad Al-Dali\n\n\n\n\n[Numbering matches the printed version]",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 3
  },
  {
    "serial_number": "1210442",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, Lord of the Worlds, and peace and blessings be upon the Master of Prophets and Messengers, Muhammad, and upon his good and pure family.\nTo proceed, these are \"News in Grammar\" narrated by the master reciter (Al-Muqri), the trustworthy Abu Tahir Abdul Wahid bin Umar bin Abi Hashim Al-Baghdadi from his Sheikhs.\nI have preceded it with an introduction about its narrator Abu Tahir, and mentioned his Sheikhs, students, and works. Then I mentioned the two manuscripts of the News and the chain of their narration, then I alluded to their content.\nI commented on the News with brief comments, and provided biographies of the narrators of the News from Abu Tahir and those whom I knew from the men of the chains of narration and the News. I shortened the biographies and sufficed with mentioning some of their sources.\nI placed following the text of the News the layers (Tabaq) of hearing it, then I mentioned the sources and references I referred to in investigating the News and commenting on it.\nThese News were published for the first time in Damascus University Journal in issue 15, year 1988. Only those who came across the journal issue saw it, and they are few.\nThis is a second edition, increased with revision, commentary, and correction, which I present to the readers of Arabic after exerting effort in investigating the News, commenting on them, and providing biographies of those I knew of their men.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 4
  },
  {
    "serial_number": "1210443",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 6,
    "volume_number": 1,
    "text": "I ask Allah Almighty to guide me to what is good, and to Him belongs praise in the first and the last. Upon Him I rely and to Him I turn.\nWritten by Dr. Muhammad Ahmad Al-Dali\nMasyaf, Thursday 13 Rabi' al-Awwal 1413 AH\n10 September 1992 CE\nThen Doha, Thursday 22 Jumada al-Thani 1413 AH\n17 December 1992 CE",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 5
  },
  {
    "serial_number": "1210444",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 7,
    "volume_number": 1,
    "text": "Abu Tahir bin Abi Hashim (1)\nHe is Abu Tahir Abdul Wahid (2) bin Umar bin Muhammad bin Abi Hashim Yasar Al-Baghdadi Al-Bazzar (3).\nHis birth was in Rajab in the year 280 AH, and he died on Thursday with ten [days] remaining of Shawwal in the year 349 AH (4). His son prayed over him in the Mosque of Rusafa, and he was buried in the Khayzuran cemetery.\nHe dedicated himself to memorizing the Holy Quran and seeking the sciences of Quran, Hadith, Arabic language, and literature. He read some of Sibawayh's book under Ibn Durustawayh. He used to follow the Kufan school in grammar and was proficient in it.\nHe devoted himself to the readings (Recitations), so he heard from the prominent reciters of his era, and memorized what he received and comprehended it, so he became a master Imam, and led the teaching of recitation after his Sheikh, Imam Abu Bakr bin Mujahid.",
    "foot_note": "1. See his biography and sources in Al-Fihrist 35, Tarikh Baghdad 11/7-8 no. 5659, Tabaqat al-Nahwiyyin wa al-Lughawiyyin 120-121, Inbah al-Ruwat 2/215 no. 416, Ma'rifat al-Qurra' al-Kibar 1/312-313 no. 229, Siyar A'lam al-Nubala 16/21-22 no. 8, Al-Ibar 2/282, Ghayat al-Nihayah 1/475-477 no. 1983, Fihrist Ibn Khayr 32-33, Hadiyat al-Arifin 1/633, and Mu'jam al-Mu'allifin 6/211. Ibn al-Jazari erred when he mentioned that Abu Tahir is the father of Abu Umar al-Zahid Ghulam Tha'lab Muhammad bin Abdul Wahid bin Abi Hashim, for Abu Umar al-Zahid was born in 261 AH and died in 345 AH. See his biography in Inbah al-Ruwat 3/171-177 no. 678, and Siyar A'lam al-Nubala 15/508-513 no. 288.\n2. Al-Zubaidi was unique in naming him \"Abdullah\".\n3. In Ghayat al-Nihayah: Al-Bazzaz, which is a misspelling.\n4. Al-Zubaidi and Al-Qifti contradicted this and mentioned that he died in the year 344.",
    "book_id": "857",
    "new_page_number": 6
  },
  {
    "serial_number": "1210445",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 8,
    "volume_number": 1,
    "text": "Al-Nadim (5) said of him: \"He was brilliant in delivery and teaching recitation, and knew a good portion of grammar.\" Al-Khatib said: \"He was one of the most knowledgeable people regarding the letters of the Quran and the aspects of recitations.\" Al-Dani described him saying: \"There was no one after Ibn Mujahid like Abu Tahir in his knowledge and understanding, along with the truthfulness of his dialect and the straightness of his path.\" Al-Dhahabi described him saying: \"The reciter, one of the notables, and one in whom skill in Quran performance culminated.\" Ibn al-Jazari described him as \"The Great Master, the Scholar, the Trustworthy.\" His student Abdul Aziz Al-Farisi said: \"When Ibn Mujahid died, they agreed to put forward our Sheikh Abu Tahir, so he led the teaching of recitation in his assembly, and the seniors sought him out and formed circles around him.\"\nAbu Tahir used to teach recitation in the alley of Abdul Samad bin Ali bin Abdul Rahman bin Al-Abbas in Baghdad. He used to punish for linguistic errors (Lah'n) in reading. His student Al-Hussein bin Ali bin Muhammad Abu Al-Abbas Al-Halabi said: \"He used to sit for teaching recitation with keys in front of him. He would perhaps strike the reciter's head if he made a linguistic error, so I feared that and did not read to him, but heard his books from him.\"\nHe knew his own worth, and knew what he possessed and took pride in it. He entered \"one day into the assembly of Ibn Mujahid after they had finished an issue that occurred between them. He said to them: 'Bring it forth.' They said: 'The answer to it has been exhausted.' He said: 'Bring it forth, for when lions are present, foxes pass wind.'\"",
    "foot_note": "5. He is also called \"Ibn al-Nadim\". See the introduction of the editor of \"Al-Fihrist\" Tehran edition, Al-A'lam 6/29, Mu'jam al-Mu'allifin 9/41, Khazanat al-Adab 3/83, Kashf al-Zunun 1303, Hadiyat al-Arifin 2/55, and the places where he was mentioned in Wafayat al-A'yan, Fawat al-Wafayat, Inbah al-Ruwat, and Siyar A'lam al-Nubala (see the indexes of notable figures in these sources).",
    "book_id": "857",
    "new_page_number": 7
  },
  {
    "serial_number": "1210446",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 9,
    "volume_number": 1,
    "text": "He authored several works on recitations, among those mentioned are:\n1 - Kitab al-Intisar li Hamzah (Book of Victory for Hamzah).\n2 - Kitab al-Bayan, on the seven recitations. Quoted from in Tarikh Baghdad 2/207, Ma'rifat al-Qurra 1/308, and Al-Murshid al-Wajiz 161-162.\n3 - Kitab al-Khilaf bayn Ashab Asim wa Hafs bin Sulaiman (Book of Disagreement between the Companions of Asim and Hafs bin Sulaiman).\n4 - Kitab al-Khilaf bayn Abi Amr wa al-Kisa'i (Book of Disagreement between Abu Amr and Al-Kisa'i).\n5 - Kitab al-Risalah fi al-Jahr bi Bismillah al-Rahman al-Rahim (Book of the Treatise on Reciting Bismillah al-Rahman al-Rahim Aloud).\n6 - Kitab Shawadh al-Sab'a (Book of Anomalies of the Seven).\n7 - Kitab al-Fasl bayn Abi Amr wa al-Kisa'i (Book of Distinction between Abu Amr and Al-Kisa'i).\n8 - Kitab Qira'at al-A'mash (Book of Al-A'mash's Recitation).\n9 - Kitab Qira'at Hafs (Book of Hafs's Recitation).\n10 - Kitab Qira'at Hamzah al-Kabir (The Great Book of Hamzah's Recitation).\n11 - Kitab Qira'at al-Kisa'i al-Kabir (The Great Book of Al-Kisa'i's Recitation).\n12 - Kitab al-Ha'at (Book of Has).\n13 - Kitab al-Ya'at (Book of Yas).\nNone of these have reached us, as far as I know.\nAs for his Sheikhs from whom he received knowledge, these are the names of those mentioned by sources, arranged alphabetically, with mention of the source of biography for those I recognized:\n1 - Ibrahim bin Muhammad bin Ayyub. Ghayat al-Nihayah 1/23 no. 96.\n2 - Ibrahim bin Muhammad bin Arafa, Abu Abdullah Niftawayh (d. 325 AH). Ma'rifat al-Qurra al-Kibar 1/173 no. 189, and Ghayat al-Nihayah 1/25 no. 102.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 8
  },
  {
    "serial_number": "1210447",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 10,
    "volume_number": 1,
    "text": "3 - Ahmad bin Ishaq bin al-Bahlul, Abu Ja'far al-Tanukhi (d. 318 AH). His biography will come in the ninth [section]. He narrated News 9-14 from him.\n4 - Ahmad bin Sahl al-Ushnani, Abu al-Abbas (d. 307 AH). Ma'rifat al-Qurra 1/248 no. 154, and Ghayat al-Nihayah 1/59 no. 257.\n5 - Ahmad bin Ubaydullah al-Makhzumi. Ghayat al-Nihayah 1/79 no. 359.\n6 - Ahmad bin Ali bin al-Hasan.\n7 - Ahmad bin Farah bin Jibril, Abu Ja'far al-Baghdadi (d. 303 AH). Ma'rifat al-Qurra 1/238 no. 139, and Ghayat al-Nihayah 1/95 no. 437.\n8 - Ahmad bin Muhammad bin Rustam. Ghayat al-Nihayah 1/115 no. 529.\n9 - Ahmad bin Muhammad bin Saeed. Ghayat al-Nihayah 1/116 no. 535.\n10 - Ahmad bin Muhammad al-Sha'rani.\n11 - Ahmad bin Mansur al-Sarraj. Ghayat al-Nihayah 1/139 no. 661.\n12 - Ahmad bin Musa bin al-Abbas bin Mujahid (d. 324 AH). He narrated News 8 from him. His biography will come in the Appendix.\n13 - Ishaq bin Ibrahim bin Abi Hassan (d. 302 AH). Ghayat al-Nihayah 1/155 no. 722.\n14 - Ishaq bin Ahmad al-Khuza'i, Abu Muhammad al-Makki (d. 308 AH). Ma'rifat al-Qurra 1/227 no. 126, and Ghayat al-Nihayah 1/156 no. 727.\n15 - Ismail bin Abdullah al-Farsi. Ghayat al-Nihayah 1/165 no. 769.\n16 - Ismail bin Yunus, Abu Ishaq al-Sabi'i al-Baghdadi. Ghayat al-Nihayah 1/170 no. 795.\nAbu Bakr bin Abi Dawood = Abdullah bin Sulaiman bin al-Ash'ath.\n17 - Al-Hasan bin al-Hubab, Abu Ali al-Baghdadi (d. 301 AH). Ma'rifat al-Qurra 1/229 no. 128, and Ghayat al-Nihayah 1/209 no. 965.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 9
  },
  {
    "serial_number": "1210448",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 11,
    "volume_number": 1,
    "text": "18 - Al-Hasan bin al-Sari bin Sahl al-Attar, Abu Ali al-Baghdadi. Ghayat al-Nihayah 1/213 no. 977.\n19 - Al-Hasan bin Abdul Rahman al-Karkhi. Ghayat al-Nihayah 1/216 no. 988.\n20 - Al-Hasan bin Ali.\n21 - Saeed bin Abdul Rahim al-Darir, Abu Uthman al-Baghdadi (d. after 310 AH). Ma'rifat al-Qurra 1/242 no. 145, and Ghayat al-Nihayah 1/306 no. 1347.\n22 - Salih bin Ahmad bin Abi Muqatil (d. 316 or 310 AH). Mizan al-I'tidal 2/287 no. 3767.\n23 - Al-Abbas bin Ahmad al-Birti, Abu Khubayb. Ghayat al-Nihayah 1/352 no. 1510.\n24 - Abdullah bin Ja'far bin Durustawayh (d. 347 AH). Inbah al-Ruwat 2/113 no. 321.\n25 - Abdullah bin Sulaiman bin al-Ash'ath, Abu Bakr bin Abi Dawood (d. 316 AH). Mizan al-I'tidal 2/433-436 no. 4368.\n26 - Abdullah bin al-Saqr, Abu al-Abbas al-Baghdadi al-Sukkari (d. 302 AH). Ghayat al-Nihayah 1/423 no. 1788.\n27 - Abdullah bin Muhammad bin Yasin, Abu al-Hasan, also called Abu Ahmad al-Farsi al-Dawlabi al-Baghdadi. Ghayat al-Nihayah 1/455 no. 1900.\n28 - Abdul Wahhab bin Isa, Abu al-Qasim al-Baghdadi. Ghayat al-Nihayah 1/480 no. 1999.\n29 - Muhammad, Abu Muhammad al-Marwazi. Ghayat al-Nihayah 1/497 no. 2067.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 10
  },
  {
    "serial_number": "1210449",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 12,
    "volume_number": 1,
    "text": "30 - Ali bin Ahmad bin Hatim al-Baghdadi. Ghayat al-Nihayah 1/518 no. 2144.\n31 - Ali bin Ahmad bin Abi Quba, Abu al-Hasan al-Ijli al-Baghdadi. Ghayat al-Nihayah 1/523 no. 2159.\n32 - Ali bin al-Hasan bin Sulaiman al-Qati'i, Abu al-Hasan. Ghayat al-Nihayah 1/530 no. 2188.\n33 - Ali bin al-Abbas bin Isa, Abu al-Hasan al-Bajali. Ghayat al-Nihayah 1/547 no. 2238.\n34 - Ali bin Muhammad al-Qadi.\n35 - Ali bin Musa bin Hamzah, Abu al-Qasim al-Baghdadi. Ghayat al-Nihayah 1/581 no. 2359.\n36 - Ayyash bin Muhammad, Abu al-Fadl al-Jawhari. Ghayat al-Nihayah 1/607 no. 2485.\n37 - Al-Qasim bin Zakariya, Abu Bakr al-Baghdadi al-Mutarriz (d. 305 AH). Ma'rifat al-Qurra 1/240 no. 141, and Ghayat al-Nihayah 2/17 no. 2589.\nIbn Mujahid = Ahmad bin Musa.\n38 - Muhammad bin Ahmad bin Abdullah bin Khalid al-Barmaki, Abu Khalid. Ghayat al-Nihayah 2/68 no. 2743.\n39 - Muhammad bin Ahmad bin Qatan, Abu Isa al-Wakil al-Baghdadi (d. after 318 AH). Ghayat al-Nihayah 2/79 no. 2774.\n40 - Muhammad bin Jarir al-Tabari, Abu Ja'far (d. 310 AH). Ma'rifat al-Qurra 1/264 no. 181, and Ghayat al-Nihayah 2/106 no. 2886.\n41 - Muhammad bin Ja'far al-Qattat, Abu Umar al-Kufi (d. 300 AH). Tarikh Baghdad 2/129 no. 522.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 11
  },
  {
    "serial_number": "1210450",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 13,
    "volume_number": 1,
    "text": "42 - Muhammad bin al-Hussein bin Hafs bin Umar al-Ushnani, Abu Ja'far (d. 315 AH). Tarikh Baghdad 2/234 no. 690, and Al-Ibar 2/162.\n43 - Muhammad bin al-Hussein bin Humaid bin al-Rabi', Abu al-Tayyib (d. 318 AH). His biography will come in 25. He narrated News 25 from him.\n44 - Muhammad bin al-Hussein bin Shahryar, Abu Bakr al-Qattan. Ghayat al-Nihayah 2/130 no. 2964.\n45 - Muhammad bin Khalaf known as Waki' (d. 306 AH). His biography will come in 18. He narrated News 18 and 19 from him.\n46 - Muhammad bin Sahl bin Abdul Rahman, Abu Bakr al-Wakil. Ghayat al-Nihayah 2/151 no. 3052.\n47 - Muhammad bin al-Abbas bin Muhammad bin Abi Muhammad al-Yazidi, Abu Abdullah al-Baghdadi. Ghayat al-Nihayah 2/158 no. 3088.\n48 - Muhammad bin Abdul Rahman.\n49 - Muhammad bin Ali bin Ismail al-Tawwazi, Abu Bakr. His biography will come in the First. He narrated News 1, 2, 3, 6, and 8 from him.\n50 - Muhammad bin al-Fath, Abu Isa al-Khazzaz. Ghayat al-Nihayah 2/228 no. 3356.\n51 - Muhammad bin al-Qasim bin Muhammad bin Bashar, Abu Bakr bin al-Anbari (d. 328 AH). Ghayat al-Nihayah 2/230 no. 3373, and Siyar A'lam al-Nubala 15/274 no. 122.\n52 - Muhammad bin Quraysh bin Abdul Wahid al-A'rabi. Ghayat al-Nihayah 2/233 no. 3381.\n53 - Muhammad bin Muhammad bin al-Dahhak, Abu al-Hasan. Ghayat al-Nihayah 2/240 no. 3413.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 12
  },
  {
    "serial_number": "1210451",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 14,
    "volume_number": 1,
    "text": "54 - Muhammad bin Muhammad bin al-Wazir, Abu Bakr al-Basri. Ghayat al-Nihayah 2/257 no. 3449.\n55 - Muhammad bin Musa al-Abbasi (d. 318 AH). Ghayat al-Nihayah 2/267 no. 3489.\n56 - Muhammad bin Yunus, Abu Bakr al-Hadrami al-Baghdadi. Ma'rifat al-Qurra 1/284 no. 197, and Ghayat al-Nihayah 2/289 no. 3570.\nAbu Muzahim al-Khaqani = Musa bin Ubaydullah.\n57 - Al-Mufaddal bin Muhammad bin Ibrahim, Abu Saeed. Ghayat al-Nihayah 2/307 no. 3638.\n58 - Musa bin Ubaydullah bin Khaqan, Abu Muzahim (d. 325 AH). His biography will come in 20. He narrated News 20-24 from him.\nWaki' al-Qadi = Muhammad bin Khalaf.\n\nA group of notables studied under him, including:\n1 - Ibrahim bin Mukhlid bin Ja'far bin al-Mu'addil.\n2 - Ahmad bin Abdullah bin al-Khidr, Abu al-Hussein al-Susanjardi (d. 402 AH). Ma'rifat al-Qurra 1/363 no. 292, and Ghayat al-Nihayah 1/73 no. 321.\n3 - Ahmad bin Musa bin Abdul Rahman, Abu al-Faraj al-Baghdadi. Ghayat al-Nihayah 1/142 no. 664.\n4 - Ja'far bin Muhammad bin al-Fadl, Abu al-Qasim al-Maristani al-Baghdadi (d. after 380 AH). Ghayat al-Nihayah 1/197 no. 905.\n5 - Al-Hussein bin Ali bin Muhammad bin Ishaq, Abu al-Abbas al-Halabi (d. after 380 AH). Ghayat al-Nihayah 1/246 no. 1117.\n6 - Abdul Aziz bin Ja'far bin Muhammad bin Ishaq bin Muhammad bin Khawasti, Abu",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 13
  },
  {
    "serial_number": "1210452",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 15,
    "volume_number": 1,
    "text": "al-Qasim al-Farsi (d. 412 AH). Ma'rifat al-Qurra 1/374 no. 305, and Ghayat al-Nihayah 1/392 no. 1671.\n7 - Abdullah bin Muhammad bin Abdullah al-Shahid.\n8 - Ubaydullah bin Ahmad bin Ali, Abu al-Qasim known as Ibn al-Saydalani (d. 400 AH). Ghayat al-Nihayah 1/485 no. 2016.\n9 - Ubaydullah bin Umar bin Muhammad bin Isa, Abu al-Faraj al-Masahifi al-Baghdadi (d. 401 AH). Ghayat al-Nihayah 1/490 no. 2038.\n10 - Uqayl bin Ali al-Baghdadi, known as Ibn al-Basri (d. 370 AH). Ghayat al-Nihayah 1/514 no. 2127.\n11 - Ali bin Ahmad bin Umar bin Hafs bin Abdullah, Abu al-Hasan al-Hamami (d. 417 AH). His biography will come in the men of the chain of the News. The News are narrated from his path.\n12 - Ali bin al-Hussein al-Dhahabi.\n13 - Ali bin Muhammad bin Yusuf bin Ya'qub bin Ali, Abu al-Hasan bin al-Allaf al-Baghdadi (d. 396 AH). Ma'rifat al-Qurra 1/362 no. 291, and Ghayat al-Nihayah 1/577 no. 2341.\n14 - Ali bin Muhammad, Abu al-Hasan al-Jawhari al-Baghdadi al-Shahid. Ghayat al-Nihayah 1/578 no. 2344.\n15 - Muhammad bin Ahmad bin Abi al-Jud, Abu al-Faraj al-Baghdadi (d. 395 AH). Ghayat al-Nihayah 2/60 no. 2715.\n16 - Muhammad bin Sabghun, Abu Hashim al-Malati (d. around 380 AH). Ghayat al-Nihayah 2/156 no. 3079, but his reading under him was not explicitly stated.\n* * *",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 14
  },
  {
    "serial_number": "1210453",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 16,
    "volume_number": 1,
    "text": "Manuscripts of the News, Chains of Narration, Title, and Content\n\n1 - Manuscripts of the News\nNo one who wrote the biography of Abu Tahir mentioned this treatise. Al-Rudani mentioned it in his book \"Silat al-Khalaf bi-Mawsul al-Salaf\" (1). I came across it some time ago in a collection preserved in the Bodleian Library in Oxford under number (F 77). It constitutes folios 47-51 of it, written in clear Naskh script, and the texts of the News and some names are vocalized, and their vocalization is correct.\nOn the first page is written the following text:\n\"News in Grammar / Narration of Abu Tahir Abdul Wahid bin Umar bin / Abi Hashim from his Sheikhs\"\nBelow this is the text:\n\"I read all these News to our Sheikh, the Imam, the Allama, Taj al-Din, Hujjat / al-Arab, Abu al-Yumn Zaid bin al-Hasan al-Kindi, may Allah preserve him. And the mentioned group heard / with the chain mentioned at its beginning. I also heard from him Al-Mujtana by Ibn Duraid / and that was in sessions, the last of which was the second of Rajab in the year five hundred and ninety-nine. Written by / Muhammad bin Ismail bin Abdul Jabbar bin Abi al-Hajjaj, may Allah benefit him.\nThis is correct, written by Abu al-Yumn al-Kindi in his handwriting.\"\nAt the end of it is the hearing of a group, including Ibn Abi al-Hajjaj the owner of the copy, from Abu al-Yumn al-Kindi, which I have established at the end of the text.\nThen I came across a second copy of it in collection number 1148 in Dar al-Kutub al-Zahiriyyah in Damascus. It constitutes folios 71-75 of it. It is written in clear Naskh script, and most of its words are not vocalized. On the first page of it is written the text:",
    "foot_note": "1. Journal of the Institute of Arabic Manuscripts in Kuwait, Volume 28 Part 1 p. 84. See below p. 20.",
    "book_id": "857",
    "new_page_number": 15
  },
  {
    "serial_number": "1210454",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 17,
    "volume_number": 1,
    "text": "\"Encouragement to Learn Grammar / The Imam, the Hafiz, Sheikh of Islam, Pride of Imams, Beauty of Hafizs, Remnant of the Predecessors, Abu Tahir Ahmad bin Muhammad bin Ahmad bin Muhammad al-Silafi al-Asbahani informed us....\" (1).\nIn the left margin of it is the text:\n\"A part containing the Virtue of Grammar and Encouragement to Learn It / Collection of Abu Tahir Abdul Wahid bin Abi Hashim / Al-Muqri, may Allah Almighty have mercy on him / Narration of Abu al-Hasan Ali bin Ahmad bin Umar bin Hafs / bin al-Hamami al-Muqri from him / Narration of Abu al-Hasan Ali bin Muhammad bin Ali bin al-Allaf from him / Narration of Abu Tahir Ahmad bin Muhammad bin Ahmad bin Muhammad bin Ibrahim al-Silafi and Abu Muhammad / Abdullah bin Mansur bin Hibatullah / bin al-Mawsili, both from him / Narration of Abu Amr Uthman bin Ali / al-Qurashi from al-Silafi by Ijazah / Narration of Abu al-Fida Ismail / bin Umar bin Abi al-Fadl bin Nasr / al-Hamawi by hearing from him / And narration of Abu Talib / Abdul Latif bin Muhammad / bin al-Qubayti from Ibn al-Allaf (2) / Narration of Abu Muhammad Al-Qasim bin Muzaffar / bin Mahmud bin Asakir by Ijazah from him\".\nAt the end of it in folio 74/2 is a hearing layer of a group including the owner of the copy Abu Abdullah Muhammad bin al-Mujalli and the scribe of the hearing Abdul Rahman bin Marwan al-Tabib from Abu Tahir al-Silafi in the year 575 AH, and at the end of the hearing in al-Silafi's handwriting is the text \"This is correct, written by Ahmad bin Muhammad al-Asbahani\".\nIn folio 75/1 are two hearing layers: The first contains the hearing of a group from Abu Abdullah Muhammad bin Ibrahim bin Ahmad al-Khabri in the year 588 AH, and below it in al-Khabri's handwriting is the text \"Correct hearing according to what is written above my handwriting. Written by Muhammad bin Ibrahim bin Ahmad al-Khabri al-Farsi known as al-Firuzabadi on the date mentioned above in Cairo al-Mu'izziyyah, may Allah Almighty protect it\".\nThe second layer contains the mention of the hearing of a group including al-Silafi, Sibt al-Khayat, Ibn al-Mawsili...",
    "foot_note": "1. See the chain of the copy in the beginning of the News and the commentary on it there.\n2. Thus it occurred, and it is an error, the correct is: from Ibn al-Mawsili.",
    "book_id": "857",
    "new_page_number": 16
  },
  {
    "serial_number": "1210455",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 18,
    "volume_number": 1,
    "text": "...and Abu al-Barakat al-Bazughani from Ibn al-Allaf, and the hearing of a group from these.\nI have established all this at the end of the text.\nI compared my copy from the Bodleian copy - symbolizing it with the letter \"B\" - with this Zahiriyyah manuscript, symbolizing it with the letter \"Z\". I finished investigating the News, commenting on them, and providing biographies for those I knew of their men on 3 Rabi' al-Awwal 1407 AH / 5 November 1986 CE.\nAfter finishing all that, I received from the dear brother, the virtuous investigator Dr. Hatim Salih al-Damin on 3/12/1986 a letter informing me that the News of Abu Tahir - I had told him its story - had been published in Egypt and he sent me a photocopy of it, may Allah thank him and reward him. The title of the printed version is \"Akhbar al-Nahwiyyin, by Sheikh of Reciters Abu Tahir Abdul Wahid bin Umar bin Muhammad bin Abi Hashim al-Muqri\", investigated and introduced by Professor Dr. Muhammad Ibrahim al-Banna from a unique copy preserved in Dar al-Kutub al-Misriyyah under number 2187 in the Hadith index, and published by Dar al-I'tisam in Cairo 1981 CE.\nI looked at the work of the virtuous doctor and saw that he did not give it its due of effort and scrutiny. It appears he found the News easy and was in a hurry, so he hastened in copying and commenting on them. He referenced some of the News he came across with approximate referencing, and shortened the biographies of the men he knew severely. So he misspelled words, omitted some words, was not correct in commenting in places of his footnotes, and erred in the biography of some of the men he provided biographies for. He remained silent about the biography of many of them, a large crowd, and about referencing some News. He did not notice some of its problems. Elaborating on all that deserves an article devoted to it. I did not see fit to allude to any of that in my comments, as it would require changing the structure of the work and enlarging it uselessly. There is a difference between our two works from every aspect as seen by the one who looks at them. However, I mentioned the chain of narration of the copy...",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 17
  },
  {
    "serial_number": "1210456",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 19,
    "volume_number": 1,
    "text": "...from which the printed version was published.\n\n2 - Chains of Narration of the News (*)\n* Bodleian copy \"B\": Narration of a group including Ibn Abi al-Hajjaj, from Abu al-Yumn al-Kindi, from Sibt al-Khayat, from Ibn al-Allaf, from al-Hamami, from Abu Tahir the collector of the News.\n* Zahiriyyah copy \"Z\": Narration of a group including Abu Abdullah Muhammad bin al-Mujalli, from Abu Tahir al-Silafi, from Ibn al-Allaf.\nIn the hearing that I established at the end of the text are other chains from Ibn al-Allaf:\n1 - Narration of Abu al-Barakat al-Bazughani, from him.\n2 - Narration of Abu al-Fida Ismail bin Umar al-Hamawi, from Abu Amr al-Qurashi Ibn Khatib al-Qarafah, from al-Silafi, from him.\n3 - Narration of Muhammad bin Ibrahim al-Khabri, from al-Silafi, from him.\n4 - Narration of Abu Muhammad Al-Qasim bin Muzaffar bin Asakir, from Abu Talib bin al-Qubayti, from Ibn al-Mawsili, from him.\n5 - Narration of Abu Ya'la bin al-Qubayti, from Ibn al-Mawsili, from him.\n6 - Narration of Ibn al-Akhdar (1), from Ibn al-Mawsili, from him.\n* Dar al-Kutub al-Misriyyah copy \"Printed\": Narration of Al-Hasan bin Ali al-Irbili, from Abu Abdullah Muhammad bin Ibrahim al-Salami, from Abu al-Wafa Ibrahim bin Muhammad al-Halabi, from Salah al-Din Muhammad bin Abi Umar al-Maqdisi, from Ibn al-Bukhari (2) with his three chains to Ibn...",
    "foot_note": "1. (*) I provided biographies for those I knew of the men of chains and News in the commentary on the News. I provided biographies for some of those mentioned in the hearing of copy \"Z\" in its place in the conclusion of the text.\n1. I provided biographies for Al-Khabri, Abu Ya'la, and Ibn al-Akhdar in the commentary on the hearing in its place.\n2. He is Abu al-Hasan Ali bin Ahmad bin Abdul Wahid al-Maqdisi known as Ibn al-Bukhari, Musnad of his time, trustworthy Imam (d. 690). His biography and sources in Shadharat al-Dhahab 5/414, Ghayat al-Nihayah 1/520 no. 2151, and Al-A'lam 4/257.",
    "book_id": "857",
    "new_page_number": 18
  },
  {
    "serial_number": "1210457",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 20,
    "volume_number": 1,
    "text": "...al-Allaf:\nFirst: From Ibn al-Akhdar, from Ibn al-Mawsili, from him.\nSecond: From Ibn al-Husari (1), from Abu al-Barakat al-Bazughani, from him.\nThird: From Abu al-Yumn al-Kindi, from Sibt al-Khayat, from him.\nAt the end of this introduction is a diagram showing all these chains.\n\n3 - Title of the Treatise\nIt appears that the collector of the News, Abu Tahir bin Abi Hashim, did not name it. That is why the copies differed in naming it: It was named in the Bodleian copy \"B\" as \"Akhbar fi al-Nahw\" (News in Grammar). It was named in the Dar al-Kutub al-Zahiriyyah copy \"Z\" as \"Al-Hath 'ala Ta'lim (2) al-Nahw\" (Encouragement to Teach Grammar), and named in its margin (3): \"Fadl al-Nahw wa al-Hath 'ala Ta'allumihi\" (Virtue of Grammar and Encouragement to Learn It). It was named in the Dar al-Kutub al-Misriyyah copy (4) \"Printed\" as \"Akhbar al-Nahwiyyin\" (News of Grammarians).\nThe first name is the most accurate and correct of these names, and it encompasses the other names, and only News 6 falls outside it. As for the other names, some News fall under them while the rest fall outside.",
    "foot_note": "1. He is Abu al-Futuh Nasr bin Abi al-Faraj Muhammad bin Ali al-Baghdadi, Ibn al-Husari, the Sheikh, Imam, Scholar, Hafiz, Proficient, Reciter, Tajweed expert, Sheikh of the Haram (d. 619 AH). His biography and sources in Siyar A'lam al-Nubala 22/163-165 no. 111.\n2. Perhaps the correct face is \"Ta'allum\" (Learning) as appeared in its left margin, and likewise its name in \"Silat al-Khalaf bi-Mawsul al-Salaf\" by Al-Rudani. See Journal of the Institute of Arabic Manuscripts Volume 82 Part 1/84. It is narrated from Ibn al-Bukhari from Abu al-Yumn al-Kindi with his chain mentioned in the chains of narration of the News.\n3. Written at the top of the left margin is the text: \"A part containing the Virtue of Grammar and Encouragement to Learn It\".\n4. Written at the top of the first page of it: \"A part containing News of Grammarians\". Al-Rudani had mentioned the book \"Akhbar al-Nahwiyyin\" by Abu Tahir, so it appeared to be different from \"Al-Hath 'ala Ta'allum al-Nahw\". See Journal of the Institute of Arabic Manuscripts Volume 27 Part 2/427.",
    "book_id": "857",
    "new_page_number": 19
  },
  {
    "serial_number": "1210458",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 21,
    "volume_number": 1,
    "text": "4 - Its Content\nThese News narrated by Abu Tahir bin Abi Hashim from his Sheikhs - numbering twenty-five news items - included mention of the first to establish grammar and the early grammarians (News 4 and 5), encouragement to learn Arabic and care for it (News 10, 11, 13, 16, 17, 25), the care of Mawali (non-Arab clients) for teaching grammar (News 7), and a poem by Al-Kisa'i describing grammar and encouraging its learning (News 25). Also mention of linguistic errors (Lah'n) (News 3, 9, 15, 18), disliking it (News 12), punishing for it (News 14), avoiding it (News 21), seeking forgiveness for it (News 22), and mention of men who do not make linguistic errors (News 1, 2, 8), and men who make linguistic errors (News 19, 20, 23, 24).\nAs for News (6), it is not of the chapter of these news, but rather of the chapter of criticism of men. News (18) may also fall under this chapter.\nMost of the News are famous, and I have mentioned some of their locations. I did not find News (9, 18, 19). I spared no effort in investigating the News, commenting on them, and providing biographies for those I knew of their men. I ask Allah to make us among the sincere benefactors, and our last prayer is that praise be to Allah, Lord of the Worlds.\n* * *",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 20
  },
  {
    "serial_number": "1210459",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 22,
    "volume_number": 1,
    "text": "Diagram of Chains of Narration of the News from Abu Tahir",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 21
  },
  {
    "serial_number": "1210460",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 23,
    "volume_number": 1,
    "text": "First page of Copy \"B\"",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 22
  },
  {
    "serial_number": "1210461",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 24,
    "volume_number": 1,
    "text": "Last page of Copy \"B\"",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 23
  },
  {
    "serial_number": "1210462",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 25,
    "volume_number": 1,
    "text": "First page of Copy \"Z\"",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 24
  },
  {
    "serial_number": "1210463",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 26,
    "volume_number": 1,
    "text": "Last page of Copy \"Z\"",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 25
  },
  {
    "serial_number": "1210464",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 27,
    "volume_number": 1,
    "text": "Akhbar fi al-Nahw\nNarration of Abu Tahir Abdul Wahid bin Umar bin Abi Hashim from his Sheikhs\n• Narration of Abu al-Hasan Ali bin Ahmad al-Hamami, from him\nNarration of Abu al-Hasan Ali bin Muhammad bin al-Allaf, from him\nNarration of Abu Muhammad Abdullah bin Ali Sibt al-Khayat, from him\nNarration of Abu al-Yumn Zaid bin al-Hasan al-Kindi, from him\nNarration of Muhammad bin Ismail bin Abi al-Hajjaj and others, from him\n• •\nAnd Narration of Abu Tahir Ahmad bin Muhammad al-Silafi from Ibn al-Allaf\nNarration of Abu Abdullah Muhammad bin al-Mujalli and others, from him\nAnd Narration of Abu Amr Uthman bin Ali al-Qurashi from al-Silafi by Ijazah\nNarration of Abu al-Fida Ismail bin Umar al-Hamawi, from him\n• • •\nAnd Narration of Abu Muhammad Abdullah bin Mansur bin al-Mawsili, from Ibn al-Allaf\nNarration of Abu Talib Abdul Latif bin Muhammad bin al-Qubayti, from him\nNarration of Abu Muhammad Al-Qasim bin Muzaffar bin Mahmud bin Asakir, from him",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 26
  },
  {
    "serial_number": "1210465",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 28,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nMy Lord, help with Your mercy\n• The Sheikh, the Imam, the Magnificent, the Unique, Taj al-Din, Master of the Literate, Abu al-Yumn Zaid bin al-Hasan bin Zaid al-Kindi informed me, in Damascus - may Allah protect it - in several sessions, in the year five hundred and ninety-nine = he said:\nThe Sheikh, the Imam, the Scholar, the Ascetic, the Trustworthy, Abu Muhammad Abdullah bin Ali, the Reciter, the Grammarian informed us, he said:\nThe Chamberlain Abu al-Hasan Ali bin Muhammad bin al-Allaf informed us, he said:\nAbu al-Hasan Ali bin Ahmad bin Umar bin Hafs al-Hamami the Reciter informed us by reading to him in Rabi' al-Akhir of the year four hundred and seventeen (*) he said:",
    "foot_note": "1. * Men of the chain in this copy (Bodleian copy \"B\"):\n1 - The narrator from Abu al-Yumn is a group including the owner of the copy, Judge Diya' al-Din Abu al-Hussein Muhammad bin Abi al-Tahir Ismail bin Abdul Jabbar bin Abi al-Hajjaj (d. 647 AH). His biography in Al-Dhayl 'ala al-Rawdatayn 184.\n2 - Abu al-Yumn Zaid bin al-Hasan bin Zaid al-Kindi (d. 613 AH). Sheikh of Reciters and Grammarians in Damascus, was a proof in transmission, deeply knowledgeable in several sciences. His biography and sources in Ma'rifat al-Qurra al-Kibar 2/586-588 no. 546, Siyar A'lam al-Nubala 22/34-41 no. 28, Inbah al-Ruwat 2/10-14 no. 254, and Al-A'lam 3/57.\n3 - Abu Muhammad Abdullah bin Ali Sibt al-Khayat (d. 541 AH). The brilliant master, reciter, grammarian, was an investigator Imam with vast knowledge. His biography and sources in Ma'rifat al-Qurra 1/494-497 no. 443, Siyar A'lam al-Nubala 20/130-134 no. 80, Inbah al-Ruwat 2/122-123 no. 332, and Al-A'lam 4/105.\n4 - The Chamberlain Abu al-Hasan Ali bin Muhammad bin al-Allaf (d. 505 AH). The magnificent master, chamberlain, trustworthy, Musnad of Iraq from a house of narration and knowledge and from the chamberlains of the Caliphate. His biography =",
    "book_id": "857",
    "new_page_number": 27
  },
  {
    "serial_number": "1210466",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 29,
    "volume_number": 1,
    "text": ".....................................\n\n• Chain of Dar al-Kutub al-Zahiriyyah copy \"Z\":\nThe Imam, the Hafiz, Sheikh of Islam, Pride of Imams, Beauty of Hafizs, Remnant of the Predecessors, Abu Tahir Ahmad bin Muhammad bin Ahmad bin Muhammad al-Silafi al-Asbahani, may Allah be pleased with him, informed us by reading to him while I was listening at the beginning of Muharram year five hundred and seventy-five: The Chamberlain Abu al-Hasan Ali bin Muhammad bin Ali bin al-Allaf al-Muqri informed us by my reading to him in Baghdad, Abu al-Hasan Ali bin Ahmad bin Umar bin Hafs al-Muqri al-Hamami informed us, Abu Tahir bin Abi Hashim our Sheikh told us, he said:\n• Other chains mentioned in the first paper in the left margin of it:\n\n1 - Abu Tahir Abdul Wahid bin Umar (1) told us, he said (2): Abu Bakr Muhammad bin",
    "foot_note": "1. = And its sources in Al-Ibar 4/9-10, Shadharat al-Dhahab 4/10, and Siyar A'lam al-Nubala 19/242-243 no. 150.\n5 - Abu al-Hasan Ali bin Ahmad bin Umar bin Hafs al-Hamami (died in Sha'ban year 417 AH). The Imam, Muhaddith, Reciter of Iraq and Musnad of the Horizons. His biography and sources in Ma'rifat al-Qurra 1/376-377 no. 307, Siyar A'lam al-Nubala 17/402-403 no. 265, and Ghayat al-Nihayah 1/521-522 no. 2157. The News were read to him about four months before his death.\n\n1. Men of the chain of this copy:\n1 - The narrator from al-Silafi is a group including the owner of the copy Abu Abdullah Muhammad bin al-Mujalli and the scribe of the hearing Abdul Rahman bin Marwan al-Tabib.\n2 - Abu Tahir al-Silafi Ahmad bin Muhammad bin Ahmad (Silfa) bin Muhammad bin Ibrahim al-Asbahani (d. 576 AH). The Allama, Muhaddith, Hafiz, Mufti, Sheikh of Islam. His biography and sources in Wafayat al-A'yan 1/105-107 no. 44, and Siyar A'lam al-Nubala 5/21-39 no. 1.\n3 - The Chamberlain Abu al-Hasan Ali bin Muhammad bin al-Allaf. We provided his biography in the men of the chain of the first copy.\n4 - Abu al-Hasan Ali bin Ahmad bin Umar bin Hafs al-Hamami. We provided his biography in the men of the chain of the first copy.\n\n1. See the discussion on the two manuscripts of the News in the Introduction.\n2. \"He said\" before the term of narration like \"Haddathana, Haddathani...\" was deleted in all News in \"Z\".",
    "book_id": "857",
    "new_page_number": 28
  },
  {
    "serial_number": "1210468",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 30,
    "volume_number": 1,
    "text": ".....................................\n\nAli bin Ismail al-Tawwazi told us: He said: Umar bin Shabba told us, he said: Affan told us, he said: Hammam said: Whatever I narrated to you from Qatadah that has grammatical errors (malhunan), correct its grammar (3), for indeed Qatadah did not make grammatical errors (4).",
    "foot_note": "1. Men of the First Chain:\n1 - Abu al-Fida Ismail bin Umar bin Abi al-Fadl bin Nasr al-Hamawi (d. 727 AH). The Head, the Worshipper, the Trustworthy, Diya' al-Din al-Hamawi al-Dimashqi the Scribe. See his biography in Shadharat al-Dhahab 6/76.\n2 - Abu Amr Uthman bin Ali al-Qurashi (d. 656 AH). The Sheikh, Scholar, Scribe, Ibn Khatib al-Qarafah, has a special Ijazah from al-Silafi by which he narrated much. See his biography and sources in Shadharat al-Dhahab 5/278, and Siyar A'lam al-Nubala 23/347-348 no. 245.\n3 - Abu Tahir al-Silafi, from Ibn al-Allaf, from al-Hamami. We provided biographies for them.\nMen of the Second Chain:\n1 - Abu Muhammad Al-Qasim bin Muzaffar bin Asakir (d. 723 AH) Musnad of Sham. See his biography in Shadharat al-Dhahab 6/61.\n2 - Abu Talib Abdul Latif bin Muhammad bin al-Qubayti (d. 641 AH). The Majestic Sheikh, Trustworthy, Musnad of Iraq. See his biography and sources in Siyar A'lam al-Nubala 23/87-89 no. 64.\n3 - Abu Muhammad Abdullah bin Mansur bin Hibatullah bin al-Mawsili (d. 567 AH). See his biography in Shadharat al-Dhahab 4/222.\n4 - Ibn al-Allaf, from al-Hamami. We provided biographies for them.\nMen of other chains mentioned in the layers of hearing, we provided biographies for some of them in the footnotes there.\n\n3. It reads in \"B\" \"fa'rifuhu\" (so know it), as the scribe dotted the Fa and did not verify the drawing of the head of the Fa and placing a dot under it, and did not vocalize the word, and the correct is what I established.\n4. The news is in Siyar A'lam al-Nubala 5/274, and its text therein is: \"Affan said: Hammam said to me: Everything I say to you 'Qatadah said', I heard it from him, so if there is a grammatical error (Lah'n) in it, correct its grammar, for indeed Qatadah did not make grammatical errors.\" Lah'n means: Error, this is its meaning wherever it occurred in these News except in News (15) where other than that was said about it, see the comment on it in its place.",
    "book_id": "857",
    "new_page_number": 29
  },
  {
    "serial_number": "1210471",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 31,
    "volume_number": 1,
    "text": ".....................................\n\n2 - Abu Tahir told us, he said (1): Abu Bakr told us, he said: Abu Zaid said to us: Affan said to me - or (2) Abu al-Walid -: Yazid bin Abi Umar (3) was such that if he narrated from Al-Hasan he would use correct grammar, and if he narrated from Ibn Sirin he would make grammatical errors (4).",
    "foot_note": "None\n\n1. This phrase \"Abu Tahir told us, he said\" was deleted from all News in \"Z\".\n2. \"Aw\" (or) dropped from \"B\".\n3. In \"B\" Kana Ibn Abi Umar.\n4. The news is in Tahdhib al-Tahdhib 11/312 from Abu al-Walid, he said: \"I have not seen anyone smarter than him [meaning Yazid], he would narrate from Al-Hasan and use correct grammar, and narrate to us from Ibn Sirin and make grammatical errors.\" It had \"fayughrib\" (doing strange things) as a misspelling.\n1 - Abu Bakr is Muhammad bin Ismail al-Tawwazi, mentioned in News 1.\n2 - Abu Zaid is Umar bin Shabba, mentioned in News 1. =",
    "book_id": "857",
    "new_page_number": 30
  },
  {
    "serial_number": "1210473",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 32,
    "volume_number": 1,
    "text": ".....................................\n\n3 - Abu Tahir told us, he said: Abu Bakr told us, he said: Abu Zaid said to us: Affan said to me, Hammad bin Salamah said to me: Whoever makes a grammatical error is not narrating from me (1).",
    "foot_note": "1. 3 - Affan, mentioned in News 1.\n4 - Abu al-Walid is Hisham bin Abdul Malik Abu al-Walid al-Tayalisi (d. 227 AH). The Imam, Hafiz, Critic, Sheikh of Islam. His biography and sources in Siyar A'lam al-Nubala 10/341-347 no. 84, and Al-A'lam 8/87.\n5 - Yazid bin Abi Umar is Yazid bin Ibrahim al-Tustari (d. 163 AH, and said otherwise). The Trustworthy Imam narrated from Al-Hasan and Ibn Sirin and others, and Affan and Abu al-Walid narrated from him. Perhaps \"Abu Umar\" is his father's or grandfather's kunya, and I did not find a text on that. His biography and sources in Tahdhib al-Tahdhib 11/311-313 no. 598, Mizan al-I'tidal 4/418-419 no. 9670, and Siyar A'lam al-Nubala 7/292-294 no. 90.\n6 - Al-Hasan is Al-Hasan bin Abi al-Hasan Yasar Abu Saeed al-Basri (d. 110 AH). Master of the people of his time in knowledge and action, was comprehensive, scholar, lofty, jurist, trustworthy, proof, trusted, worshipper, of much knowledge, eloquent, beautiful, handsome. His biography and sources in Tahdhib al-Kamal 6/95-127 no. 1216, Siyar A'lam al-Nubala 4/563-588 no. 223, and Al-A'lam 2/226.\n6 - Ibn Sirin, Muhammad bin Sirin Abu Bakr al-Ansari al-Basri (d. 110 AH). The Imam, Sheikh of Islam, was a jurist, pious, famous for dream interpretation. His biography and sources in Siyar A'lam al-Nubala 4/606-622 no. 246, and Al-A'lam 6/154.\n\n1. The news is in Akhbar al-Nahwiyyin al-Basriyyin 43, Nuzhat al-Alba 50, and Mu'jam al-Udaba 10/255 and its text is: \"Whoever makes a grammatical error in my narration has lied against me.\" This news was advanced in \"Z\" before the second news.\n1 - Abu Bakr is Abu Bakr al-Tawwazi, mentioned in News 1 and 2.\n2 - Abu Zaid is Umar bin Shabba, mentioned in News 1 and 2.\n3 - Affan, mentioned in News 1 and 2.\n4 - Hammad bin Salamah (d. 167 AH). The Imam, Role Model, Sheikh of Islam, Abu Salamah al-Basri, was a sea of knowledge, truthful, proof. His biography and sources in Siyar A'lam al-Nubala 7/444-456 no. 168, and Al-A'lam 2/272.",
    "book_id": "857",
    "new_page_number": 31
  },
  {
    "serial_number": "1210475",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 33,
    "volume_number": 1,
    "text": "4 - Abu Tahir told us, he said: Muhammad told us, he said: Umar told us, he said: Abdullah bin Muhammad - meaning al-Tawwazi - told us: He said: I heard Abu Ubaidah say (1): The first to establish grammar was Abu al-Aswad al-Du'ali (2), then Maimun al-Aqran (3), then Anbasa al-Fil, then Abdullah bin Abi Ishaq. He said: And Isa bin Umar composed two books in grammar, naming one of them \"Al-Jami'\" (The Collector) and the other \"Al-Mukmal\" (The Completer) (4). So the poet said (5):\nGrammar has all become void\nExcept what Isa bin Umar innovated",
    "foot_note": "1. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf wa al-Ibtida 43-44 from his father from Umar bin Shabba from al-Tawwazi from Abu Ubaidah. The first part of it was cited by Al-Dani in Al-Muhkam fi Naqt al-Masahif 6, Yaqut in Mu'jam al-Udaba 19/209, and Al-Qifti in Inbah al-Ruwat 3/337.\n2. With Damma on Dal and Hamza on the open Waw, thus drawn in \"Z\" here, and it is the most famous face in attributing Abu al-Aswad. It is said \"Al-Du'ili\" with Damma on Dal and Kasra on Hamza, thus drawn here and in News 5 in \"B\". It is said \"Al-Dili\" with Kasra on Dal and with Ya, thus drawn in \"Z\" in News 5 without vocalization. See their discussion on attributing Abu al-Aswad in Al-Ansab 5/364-367, Al-Ikmal 3/346-348, Wafayat al-A'yan 2/539, Siyar A'lam al-Nubala 4/84-85, Al-Lubab 2/514-515, Inbah al-Ruwat 1/14-15, Mukhtalif al-Qaba'il wa Mu'talifuha 46-47, Al-Inas bi-Ilm al-Ansab 86-87, Al-Ishtiqaq 325, Jamharat Ansab al-Arab 184, Tabaqat Fuhul al-Shu'ara 12, Simt al-La'ali 66, Al-Lisan (Da'al), and others.\n3. \"Al-Aqran\" is not in \"B\".\n4. And it is said \"Al-Ikmal\" as occurred in the poetry, and so it occurred in \"Z\", perhaps this is a change from narrators.\n5. In Idah al-Waqf \"So Al-Khalil bin Ahmad said\". The two verses belong to Al-Khalil in Al-Fihrist 47, and Akhbar al-Nahwiyyin 31-32 and from it in Tahdhib al-Kamal 8/330, Tabaqat al-Nahwiyyin wa al-Lughawiyyin 23, Tarikh al-Ulama al-Nahwiyyin 133, Maratib al-Nahwiyyin 47, Mu'jam al-Udaba 16/147, Inbah al-Ruwat 2/375, Wafayat al-A'yan 2/486-487, and others. =",
    "book_id": "857",
    "new_page_number": 32
  },
  {
    "serial_number": "1210476",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 34,
    "volume_number": 1,
    "text": ".....................................\n\nThat is Ikmal (Perfection) and this is Jami' (Collector)\nAnd they are for people a sun and a moon\n\n5 - Abu Tahir told us, he said: Muhammad told us, he said: Umar bin Shabba told us, he said: Hayyan bin Bishr told us, he said: Yahya bin Adam told us, from Abu Bakr, from Asim, he said (1):",
    "foot_note": "None\n\nNone\n\n1. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 42-43 from his father from Umar bin Shabba with the chain mentioned in the text from Asim, and mentioned by Al-Dhahabi in Siyar A'lam al-Nubala 4/84 from Umar bin Shabba with the chain =",
    "book_id": "857",
    "new_page_number": 33
  },
  {
    "serial_number": "1210479",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 35,
    "volume_number": 1,
    "text": "The first to establish Arabic (Grammar) was Abu al-Aswad al-Du'ali. He came to Ziyad in Basra and said: I see the Arabs have mixed with non-Arabs and their tongues have changed, so do you permit me to establish for the Arabs a speech by which they know and straighten their speech? He said (2): No. He said (3): So a man came to",
    "foot_note": "1. = mentioned from Asim also, and narrated by Abu al-Faraj al-Asbahani in his Amali with his chain from Abu Bakr bin Ayyash from Asim (see \"Sabab Wad' al-Arabiyya by Al-Suyuti\" - Al-Tuhfa al-Bahiyya 52) and mentioned by Al-Zubaidi in Tabaqat al-Nahwiyyin 22 from Ibn Abi Sa'd from Abu Bakr bin Ayyash from Asim, and the complete chain is what the author mentioned. Mentioned by Al-Qifti in Inbah al-Ruwat 1/15, and Ibn Khallikan in Wafayat al-A'yan 2/536-537. In Al-Muhkam by Al-Dani 3 there is another narration of the news with a difference.\n2. In \"Z\": So he said.\n3. Not in \"B\".\n1 - Muhammad is Abu Bakr al-Tawwazi, mentioned in News 1-4.\n2 - Umar bin Shabba, mentioned in News 1-4.\n3 - Hayyan bin Bishr, Abu Bishr al-Asadi (d. 237 AH) from the people of Hadith, held judiciary in Isfahan then Baghdad. His biography in Tarikh Baghdad 8/284-286 no. 4383, and Al-Jarh wa Al-Ta'dil 3/248 no. 1105.\n4 - Yahya bin Adam, Abu Zakariya al-Qurashi (d. 203 AH). The Allama, Hafiz, Reciter, Tajweed expert. His biography and sources in Ma'rifat al-Qurra 1/166-168 no. 74, Siyar A'lam al-Nubala 9/522-529 no. 204, and Al-A'lam 8/133-134.\n5 - Abu Bakr, is Abu Bakr bin Ayyash al-Asadi, his name is his kunya, said to be Shu'ba, and said otherwise (d. 193 AH). The Reciter, Jurist, Muhaddith, Imam, Sheikh of Islam. His biography and sources in Ma'rifat al-Qurra 1/134-138 no. 50, and Siyar A'lam al-Nubala 8/435-446 no. 131.\n6 - Asim, is Asim bin Abi al-Nujud al-Asadi, Abu Bakr (d. 127 or 128 AH). The Great Imam, Reciter of the Age, one of the Seven. His biography and sources in Ma'rifat al-Qurra 1/88-94 no. 35, and Siyar A'lam al-Nubala 5/256-261 no. 119.\n7 - Abu al-Aswad al-Du'ali, mentioned in News 4.\n8 - Ziyad, is Ziyad bin Abihi (d. 53 AH). A prince among the cunning leaders, conquerors, governors, differed =",
    "book_id": "857",
    "new_page_number": 34
  },
  {
    "serial_number": "1210480",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 36,
    "volume_number": 1,
    "text": "Ziyad and said: May Allah reform the Prince -, our father died (Tuwuffiya Abana - grammatical error, should be Abuna) and left sons (Banun - grammatical error, should be Banin)!! So he said: Call Abu al-Aswad for me. He said: Establish for the people what I had forbidden you to establish for them.\n\n6 - Abu Tahir told us, he said: Abu Bakr told us, he said: Umar told us, he said: Abu Bakr bin Khallad told us, he said: I heard Al-Mu'tamir bin Sulaiman narrating from his father, he said: For the people of Kufa there are two liars: Al-Suddi and Al-Kalbi (1).",
    "foot_note": "1. = on his father's name, said to be Abu Sufyan and said to be Ubayd al-Thaqafi. His biography and sources in Tahdhib Tarikh Dimashq 5/409-426, Mizan al-I'tidal 2/86-87 no. 2923, and Al-A'lam 3/53.\n\n1. The news was narrated by Ibn Abi Hatim in Al-Jarh wa Al-Ta'dil 7/270 in the biography of Al-Kalbi, he said: \"Umar bin Shabba al-Numayri al-Basri told us in Samarra, Abu Bakr bin Khallad told me, Mu'tamir told us from his father, he said: There were two liars in Kufa, one of them Al-Kalbi.\" In Mizan al-I'tidal 1/237 in the biography of Al-Suddi that this saying belongs to Layth bin Abi Sulaym narrated from him by Al-Mu'tamir, and its text is: \"There were two liars in Kufa and one of them died: Al-Suddi and Al-Kalbi.\" See the margin of Siyar A'lam al-Nubala 6/249. Layth bin Abi Sulaym is a Muhaddith of Kufa and one of its prominent scholars despite weakness in his Hadith due to poor memory (d. 138 or 143 AH). See his biography and sources in Siyar A'lam al-Nubala 6/179-184 no. 84.\n1 - Abu Bakr, is Muhammad bin Ali al-Tawwazi, mentioned in News 1-5.\n2 - Umar, is Umar bin Shabba, mentioned in News 1-5.\n3 - Abu Bakr bin Khallad, Muhammad bin Khallad al-Bahili (d. 240 AH or said otherwise). Trustworthy. His biography in Al-Jarh wa Al-Ta'dil 7/246 no. 1352, Al-Mu'jam al-Mushtamil 239 no. 817, Tahdhib al-Tahdhib 9/152 no. 219, and Taqrib al-Tahdhib 2/159 no. 196.\n4 - Al-Mu'tamir bin Sulaiman (d. 187 AH). The Hafiz, Trustworthy, Abu Muhammad al-Taymi al-Basri, Muhaddith of Basra. His biography and sources in Tadhkirat al-Huffaz 1/266-267 no. 351, and Siyar A'lam al-Nubala 8/420-422 no. 123. =",
    "book_id": "857",
    "new_page_number": 35
  },
  {
    "serial_number": "1210482",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 37,
    "volume_number": 1,
    "text": ".....................................\n\n7 - Abu Zaid said: Al-Sha'bi entered the mosque of Kufa and a number of Mawali (clients) were teaching Arabic. So he said to them (1): Yes, fix your tongues for indeed you are the ones who corrupted it (2).\n\n8 - Abu Tahir told us, he said: Abu Bakr our Sheikh, may Allah have mercy on him, told us, he said: Ubaidullah bin Muhammad al-Yazidi told us, he said: The nephew of Al-Asma'i told us from his uncle, he said:",
    "foot_note": "1. 5 - Abu al-Mu'tamir, Sulaiman al-Taymi (d. 143 AH). The Hafiz, Sheikh of Islam. His biography and sources in Tadhkirat al-Huffaz 1/150-152 no. 145, and Siyar A'lam al-Nubala 6/195-202 no. 92.\n6 - Al-Suddi, Ismail bin Abdul Rahman bin Abi Karima al-Suddi, Abu Muhammad (d. 129 AH, or said otherwise). The Imam, Exegete, truthful but errs, some declared him trustworthy and others weakened him. His biography and sources in Tahdhib al-Kamal 3/132-138 no. 462, Mizan al-I'tidal 1/236-237 no. 907, Taqrib al-Tahdhib 1/71 no. 531, and Siyar A'lam al-Nubala 5/264-265 no. 124.\n7 - Al-Kalbi, Muhammad bin al-Sa'ib al-Kalbi, Abu al-Nadr (d. 146 AH). The Exegete, Genealogist, Historian. Accused of lying and charged with Rafd. His biography and sources in Al-Jarh wa Al-Ta'dil 7/270 no. 1478, Mizan al-I'tidal 3/556-559 no. 7574, Taqrib al-Tahdhib 2/163 no. 240, and Siyar A'lam al-Nubala 6/248-249 no. 111.\n\n1. Not in \"B\".\n2. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 51-52 from his father from Abu Zaid Umar bin Shabba. It is similar in Al-Bayan wa al-Tabyin 2/69, Al-Kamil 578, and Al-Iqd al-Farid 2/478.\n1 - Abu Zaid, is Umar bin Shabba, mentioned in News 1-6.\n2 - Al-Sha'bi, Amir bin Sharahil, Abu Amr (d. around 140 AH). The Imam, Jurist, Mark of the Age, proverbially known for his memory. His biography and sources in Siyar A'lam al-Nubala 4/294-319 no. 113, and Al-A'lam 3/251.\n\nNone",
    "book_id": "857",
    "new_page_number": 36
  },
  {
    "serial_number": "1210485",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 38,
    "volume_number": 1,
    "text": "When I heard Abu Amr speaking I would think he knew nothing, he does not make grammatical errors, speaking an easy speech (1).\n\n9 - Abu Tahir told us, he said: Ahmad bin Ishaq al-Tanukhi told us, he said: My father told me,",
    "foot_note": "1. The news was narrated by Abu Bakr bin Mujahid with this chain in the book \"Al-Sab'a\" p. 83 and in it \"and he does not make grammatical errors\". In Ma'rifat al-Qurra al-Kibar 1/104, and Siyar A'lam al-Nubala 6/410: \"... I thought him knowing nothing, he used to speak...\". The Ta in \"Kuntu\" (I was), \"Sami'tu\" (I heard), and \"Zanantu\" (I thought) was vocalized in Z and sources with Damma as being for the speaker, and the face is Fatha as being for the addressee.\n1 - Abu Bakr. He is Ahmad bin Musa bin Mujahid (d. 324 AH). The Imam, Reciter, Master, Muhaddith, Grammarian, Sheikh of Reciters, author of the book \"Al-Sab'a\". His biography and sources in Ma'rifat al-Qurra 1/269-271 no. 186, and Siyar A'lam al-Nubala 15/272-274 no. 121.\n2 - Ubaidullah bin Muhammad al-Yazidi, Abu al-Qasim (d. 284 AH). Famous Sheikh, was trustworthy and taught grammar. His biography and sources in Ghayat al-Nihayah 1/492-493 no. 2049, and Inbah al-Ruwat 2/153 no. 396.\n3 - The nephew of Al-Asma'i, Abdul Rahman bin Abdullah. Was trustworthy in what he narrates from his uncle. His biography and sources in Inbah al-Ruwat 2/161 no. 377.\n4 - Al-Asma'i, Abdul Malik bin Qurayb, Abu Saeed (d. 216 AH or said otherwise). The Imam, Allama, Hafiz, Proof of Literature, Tongue of Arabs, Linguist, Historian, one of the Notables. His biography and sources in Inbah al-Ruwat 2/197-205 no. 408, Siyar A'lam al-Nubala 10/175-181 no. 32, and Al-A'lam 4/162.\n5 - Abu Amr bin al-Ala, his name is Zabban according to the most correct (d. 154 AH). The Imam, Sheikh of Reciters and a master among the great masters of Arabic, Reciter of the people of Basra. His biography and sources in Inbah al-Ruwat 4/125-133 no. 919, Ma'rifat al-Qurra 1/100-105 no. 39, Siyar A'lam al-Nubala 6/407-410 no. 167, and Al-A'lam 3/41.\n\nNone",
    "book_id": "857",
    "new_page_number": 37
  },
  {
    "serial_number": "1210487",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 39,
    "volume_number": 1,
    "text": "from Hussein al-Ju'fi, from Abbad, from Umar bin Nafi' (1) from his father, he said: A man was praying beside Ibn Umar and made grammatical errors, so he sent to him: Either you move away (2) from us or we move away from you.",
    "foot_note": "1. In \"B\": From Abbad from his uncle Umar from Nafi', which is a distortion and error.\n2. In \"Z\": Tatanahha.\n1 - Ahmad bin Ishaq al-Tanukhi, Abu Ja'far (d. 318 AH). (See Author's Sheikhs no. 3). The trustworthy Muhaddith, was of great esteem, wide literature, good knowledge of the school of the people of Iraq, and literature prevailed over him. His biography in Tarikh Baghdad 4/30-34 no. 1635.\n2 - His father, Ishaq bin al-Bahlul al-Tanukhi Abu Ahmad (d. 252 AH). The Trustworthy Muhaddith, Jurist, had good knowledge of language, grammar, and poetry. His biography in Tarikh Baghdad 6/366-369 no. 3390.\n3 - Hussein bin Ali al-Ju'fi, Abu Abdullah, also called Abu Ali and Abu Muhammad (d. 203 AH). The Imam, Role Model, Hafiz, Reciter, Tajweed expert, Ascetic, remnant of the Notables. His biography and sources in Tahdhib al-Kamal 6/449-454 no. 1324, Ma'rifat al-Qurra 1/164-165 no. 72, Tadhkirat al-Huffaz 1/349 no. 336, and Siyar A'lam al-Nubala 9/397-401 no. 129.\n4 - Abbad, perhaps Abbad bin Kathir bin Qais al-Ramli (d. 170 AH) mentioned later in News 12. Some declared him trustworthy and others weakened him. His biography in Al-Jarh wa Al-Ta'dil 6/85 no. 434, and Mizan al-I'tidal 2/370 no. 4133.\n5 - Umar bin Nafi', trustworthy, truthful. His biography in Mizan al-I'tidal 3/226 no. 6228.\n6 - His father, Nafi' Abu Abdullah al-Qurashi client of Ibn Umar and his narrator (d. 117 AH). The Imam, Mufti, Proven, Scholar of Arabic. His biography and sources in Tadhkirat al-Huffaz 1/99-100 no. 92, and Siyar A'lam al-Nubala 5/95-101 no. 34.\n7 - Ibn Umar, Abdullah bin Umar bin al-Khattab, Abu Abdul Rahman (d. 73 or 74 AH). The Imam, Role Model, Sheikh of Islam, was like his father in virtue. His biography and sources in Siyar A'lam al-Nubala 3/203-239 no. 45, and Al-A'lam 4/108.",
    "book_id": "857",
    "new_page_number": 38
  },
  {
    "serial_number": "1210488",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 40,
    "volume_number": 1,
    "text": "10 - Abu Tahir told us: Ahmad (1) told us, he said: My father told me, he said: Zaid bin al-Hubab told us, from Abdul Warith bin (2) Saeed al-Anbari: He said: Abu Muslim told me fifty years ago that Umar bin al-Khattab may Allah be pleased with him said: Learn Arabic for it increases chivalry (Muru'ah) (3).",
    "foot_note": "1. In \"Z\": Ahmad bin Ishaq.\n2. It was in both copies \"Abdul Warith from Saeed al-Anbari\" which is a distortion. See commentary on (3).\n3. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 31, and its text therein is: Learn Arabic for it strengthens the mind and increases chivalry.\n1 - Ahmad, is Ahmad bin Ishaq al-Tanukhi, mentioned in News 9.\n2 - His father, Ishaq bin al-Bahlul, mentioned in News 9.\n3 - Zaid bin al-Hubab, Abu al-Hussein al-Ukli (d. 203 AH). The Imam, Hafiz, Trustworthy, Ascetic. His biography and sources in Siyar A'lam al-Nubala 9/393-395 no. 126, and Tadhkirat al-Huffaz 1/350-351 no. 338.\n4 - Abdul Warith, is Abdul Warith bin Saeed Abu Ubaidah al-Anbari (d. 180 AH). The Hafiz, Reciter, Imam, Proven. His biography and sources in Ma'rifat al-Qurra 1/163 no. 71, Tadhkirat al-Huffaz 1/257-258 no. 243, and Siyar A'lam al-Nubala 8/267-270 no. 80.\n5 - Abu Muslim, I do not know him. Unless a man or two fell from the chain between him and Abdul Warith and the intended is Abu Muslim al-Khawlani. His name is correctly Abdullah bin Thawb (d. 62 AH). Master of Tabi'in, ascetic of the age, sweet basil of Sham and sage of this nation. His biography and sources in Siyar A'lam al-Nubala 4/7-14 no. 2, and Al-A'lam 4/75.\n7 - Umar bin al-Khattab may Allah be pleased with him (d. 23 AH). The second of the Rightly Guided Caliphs, the great companion, brave, decisive, just. His biography and sources in Al-A'lam 5/45-46.",
    "book_id": "857",
    "new_page_number": 39
  },
  {
    "serial_number": "1210489",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 41,
    "volume_number": 1,
    "text": "11 - Abu Tahir told us, he said: Ahmad told us, he said: My father told me, he said: Zaid bin al-Hubab (1) told me, from Talha bin Yahya al-Makki, he said. Ata told us, he said: It reached me that Umar bin al-Khattab may Allah be pleased with him heard a man speaking Persian during Tawaf, so he took him by his upper arm and said: Seek a way to Arabic.\n\n12 - Abu Tahir told us, he said: Ahmad told us, he said: My father told me, from Hussein al-Ju'fi, from Abbad bin Kathir, from Zakariya, from Al-Sha'bi, he said (1): Abu Bakr Al-Siddiq may Allah be pleased with him said: That I read and drop (miss something) is more beloved to me than that I read and make grammatical errors (2).",
    "foot_note": "1. In \"Z\": Ahmad bin Ishaq told us he said... Zaid bin al-Hubab told us. This news was advanced in it before the tenth news.\n1 - Ahmad, is Ahmad bin Ishaq al-Tanukhi, mentioned in News 9 and 10.\n2 - His father, Ishaq bin al-Bahlul, mentioned in News 9 and 10.\n3 - Zaid bin al-Hubab, mentioned in News 10.\n4 - Talha bin Yahya al-Makki, thus it occurred. He is Talha bin Amr bin Uthman al-Hadrami al-Makki companion of Ata (d. 152 AH). Matruk (Abandoned). His biography in Al-Jarh wa Al-Ta'dil 4/478 no. 2097, Mizan al-I'tidal 2/340-342 no. 4008, Taqrib al-Tahdhib 1/379 no. 37, and Tahdhib al-Tahdhib 5/23-24 no. 38.\n5 - Ata, is Ata bin Abi Rabah Abu Muhammad al-Qurashi their client al-Makki (d. 115 AH). The Imam, Sheikh of Islam, Mufti of the Haram. His biography and sources in Siyar A'lam al-Nubala 5/78-88 no. 29, and Al-A'lam 4/235.\n6 - Umar bin al-Khattab, mentioned in News 10.\n\n1. Not in \"B\".\n2. The news is in Maratib al-Nahwiyyin 23, and narrated for Al-Sha'bi in Mu'jam al-Udaba 1/89. =",
    "book_id": "857",
    "new_page_number": 40
  },
  {
    "serial_number": "1210491",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 42,
    "volume_number": 1,
    "text": ".....................................\n\n13 - He said: And Umar bin al-Khattab may Allah be pleased with him said (1): Whoever reads the Quran and parses it (reads with correct grammar) and dies (2), he will have with Allah on the Day of Resurrection the reward of a martyr (3).",
    "foot_note": "None\n\n1. In \"B\" He said.\n2. In \"Z\": And Umar said whoever reads... then dies.\n3. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 20. With his chain to Abbad bin Kathir from Zakariya bin Hakim from Al-Sha'bi.\n1 - Umar bin al-Khattab, mentioned in News 10 and 11.",
    "book_id": "857",
    "new_page_number": 41
  },
  {
    "serial_number": "1210493",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 43,
    "volume_number": 1,
    "text": "14 - Abu Tahir told us, he said: Ahmad told us, he said: My father told me, he said: Zaid bin al-Hubab told us, from Abu al-Rabi' al-Samman, from Amr bin Dinar: That Ibn Umar and Ibn Abbas used to strike their children for grammatical errors (1).\n\n15 - Abu Tahir told me, he said: Ahmad told us, he said: My father told me, he said: Mahbub bin al-Hasan told us, from Abu Harun al-Ghanawi, from Muslim bin Shaddad al-Laythi, from Ubayy bin",
    "foot_note": "1. In B \"about grammatical errors\". It was narrated from Nafi' client of Ibn Umar that Ibn Umar used to strike his sons for grammatical errors. See Idah al-Waqf 24-25, Al-Adhdad 244, Mu'jam al-Udaba 1/89, Mizan al-I'tidal 3/639, and I'rab al-Qira'at al-Sab' wa 'Ilaluha 28.\n1 - Ahmad, is Ahmad bin Ishaq al-Tanukhi, mentioned in News 9-12.\n2 - His father, Ishaq al-Bahlul, mentioned in News 9-12.\n3 - Zaid bin al-Hubab, mentioned in News 10 and 11.\n4 - Abu al-Rabi' al-Samman, is Ash'ath bin Saeed, abandoned. His biography and sources in Tahdhib al-Kamal 3/261 no. 523, Al-Jarh wa Al-Ta'dil 2/272 no. 980, Mizan al-I'tidal 1/263 no. 995, Taqrib al-Tahdhib 1/79 no. 598.\n5 - Amr bin Dinar, Abu Muhammad al-Jumahi (d. 126 AH). The Great Imam, Hafiz, one of the Notables, Sheikh of the Haram in his time. His biography and sources in Tadhkirat al-Huffaz 1/16 no. 6, Siyar A'lam al-Nubala 5/300-307, and Al-A'lam 5/77.\n6 - Ibn Umar, mentioned in News 9.\n7 - Ibn Abbas, Abdullah bin al-Abbas bin Abdul Muttalib (d. 67 or 68 AH). The Scholar of the Nation, Interpreter of the Quran, Jurist of the Era, and Imam of Exegetes. His biography and sources in Siyar A'lam al-Nubala 3/331-359 no. 51, and Al-A'lam 4/95.\n\nNone",
    "book_id": "857",
    "new_page_number": 42
  },
  {
    "serial_number": "1210495",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 44,
    "volume_number": 1,
    "text": "Ka'b, he said: Learn the grammatical error (Lah'n) (1) in the Quran just as you learn it (2).\n\n16 - Abu Tahir told us, he said: Ahmad told us, he said: My father told me, he said: We were told by",
    "foot_note": "1. In \"Z\": Learn Arabic, and it appears this is a change from the narrators, see News 16.\n2. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 17, 24 with his chain to Mahbub bin al-Hasan from Abu Harun al-Ghanawi from Muslim bin Shaddad from Ubayd bin Umair from Ubayy. And he narrated it in Idah al-Waqf 23, and Al-Adhdad 239 with another chain to Abu Harun al-Ghanawi with the mentioned chain from Ubayy. And Ibn Khalawayh narrated it in I'rab al-Qira'at al-Sab' wa 'Ilaluha 27 with his chain to Abu Harun al-Ghanawi with the mentioned chain from Ubayy. \"Ubayd bin Umair\" fell from the chain of the news narration in Akhbar between Shaddad and Ubayy, and \"Lah'n\" here also means: Error, which is its meaning in the rest of the News where it occurred. So if the reader knows the error he knows the correct. It was said Lah'n here: Correct, and said: Grammar, said: Language, see Al-Adhdad 239-240, and Al-Lisan (Lahn).\n1 - Ahmad, is Ahmad bin Ishaq al-Tanukhi, mentioned in News 9-12 and in News 14.\n2 - His father, Ishaq bin al-Bahlul, mentioned in News 9-12, in News 14.\n3 - Mahbub bin al-Hasan, it is said Mahbub is a nickname for him, his name is Muhammad bin al-Hasan bin Ismail Abu Ja'far al-Qawariri. Truthful, has leniency and was accused of Qadar. His biography in Al-Jarh wa Al-Ta'dil 8/388-389 no. 1779, Mizan al-I'tidal 3/441-442 no. 7082 and 3/514 no. 7381, Taqrib al-Tahdhib 2/154 no. 142 and 2/130 no. 934, and Ghayat al-Nihayah 2/115 no. 2616.\n4 - Abu Harun al-Ghanawi, Ibrahim bin al-Ala. Trustworthy, his biography in Taqrib al-Tahdhib 2/483 no. 2, Al-Jarh wa Al-Ta'dil 2/120 no. 367, and Mizan al-I'tidal 1/49 no. 152. =\n\nNone",
    "book_id": "857",
    "new_page_number": 43
  },
  {
    "serial_number": "1210496",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 45,
    "volume_number": 1,
    "text": ".....................................\n\nIshaq and Muhammad the two sons of al-Tabba', from Hammad bin Zaid, from Wasil client of Abu (1) Uyaynah, from Yahya bin Aqil, from Yahya bin Ya'mar, from Ubayy bin Ka'b, he said: Learn Arabic in the Quran just as you learn its memorization (2).",
    "foot_note": "1. 5 - Muslim bin Shaddad al-Laythi from Ubayy bin Ka'b. Thus it occurred, and there is a drop in the chain, and its completion as in Al-Adhdad by Abu Bakr bin al-Anbari 239 and Idah al-Waqf wa al-Ibtida by him 17, 23, 24, and I'rab al-Qira'at al-Sab' wa 'Ilaluha by Ibn Khalawayh 27: Muslim bin Shaddad, [from Ubayd bin Umair] from Ubayy. Muslim bin Shaddad al-Laythi mentioned him in Al-Jarh wa Al-Ta'dil 8/186 no. 814. And Ubayd bin Umair is Abu Asim al-Laythi al-Makki (d. 74 AH). Consensus on his trustworthiness. His biography in Tadhkirat al-Huffaz 1/50 no. 28, and Taqrib al-Tahdhib 1/544 no. 1561 and see some narrations of Muslim bin Shaddad from him in Idah al-Waqf 8, 17, 23, 24. See Siyar A'lam al-Nubala 7/293 where there is a news narrated from Ubayy via Yazid bin Ibrahim al-Tustari, from Abu Harun al-Ghanawi from Muslim bin Shaddad from Ubayd bin Umair, from him. From this path Ibn Khalawayh narrated the mentioned news.\n6 - Ubayy bin Ka'b, Abu al-Mundhir al-Ansari (d. 22 AH, and said otherwise). Master of Reciters and most read of the Nation, was a head in knowledge and action. His biography and sources in Tadhkirat al-Huffaz 1/16 no. 6, Ma'rifat al-Qurra 1/28-31 no. 3, Siyar A'lam al-Nubala 1/389-402 no. 82, and Al-A'lam 1/82.\n\n1. Not in \"B\".\n2. This saying was narrated from Abu Dharr. Abu Bakr bin al-Anbari narrated the news in Idah al-Waqf 23 with his chain to Hammad bin Zaid from Wasil client of Abu Uyaynah from Yahya bin Aqil from Yahya bin Ya'mar that Abu Dharr said: Learn... etc. It was narrated from Umar also, as Abu Ja'far al-Nahhas narrated it in the beginning of his book I'rab al-Quran 1/115 with his chain to Wasil client of Abu Uyaynah he said: \"Umar bin al-Khattab may Allah be pleased with him said learn the I'rab of Quran just as... \". =",
    "book_id": "857",
    "new_page_number": 44
  },
  {
    "serial_number": "1210499",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 46,
    "volume_number": 1,
    "text": ".....................................\n\n17 - Abu Tahir told us, he said: Ahmad told us, he said: My father told me, he said: Muhammad bin Isa and Malik bin Ismail told us, from Sharik, from Jabir, from Muhammad bin",
    "foot_note": "None\n\nNone",
    "book_id": "857",
    "new_page_number": 45
  },
  {
    "serial_number": "1210501",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 47,
    "volume_number": 1,
    "text": "Abdul Rahman bin Zaid (1): That Abu Bakr and Umar - may Allah be pleased with them both - said: To preserve some I'rab (grammar/parsing) of the Quran is more pleasing to us than preserving some of its letters (2).\n\n18 - Abu Tahir told us, he said: Waki' bin Khalaf told us, he said: Muhammad bin Khallad told me, he said:",
    "foot_note": "1. His saying \"... bin Zaid\" is a distortion, the correct is either \"... bin Yazid\" or \"... from Zaid\" see what will come of commentary on (2).\n2. The news was narrated by Abu Bakr bin al-Anbari in Idah al-Waqf 20 with his chain to Sharik from Jabir from Muhammad bin Abdul Rahman from Zaid.\n1 - Ahmad, is Ahmad bin Ishaq al-Tanukhi, mentioned in News 9-12 and 14-16.\n2 - His father, Ishaq bin al-Bahlul, mentioned in News 9-12 and 14-16.\n3 - Muhammad bin Isa, is Ibn al-Tabba', mentioned in News 16.\n4 - Malik bin Ismail, Abu Ghassan al-Nahdi (d. 219 AH). The Hafiz, Proof, Trustworthy, Proficient. His biography in Tadhkirat al-Huffaz 1/402 no. 404, Taqrib al-Tahdhib 2/223 no. 858, and Mizan al-I'tidal 3/424 no. 7008.\n5 - Sharik, is Sharik bin Abdullah, Abu Abdullah al-Nakha'i (d. 177 AH). The Judge, one of the notable Imams, was good in Hadith, Imam, Jurist, Muhaddith, prolific. His biography in Al-Jarh wa Al-Ta'dil 4/365-367 no. 1602, Tarikh Baghdad 9/279-295 no. 4838, Tadhkirat al-Huffaz 1/232 no. 218, Mizan al-I'tidal 2/270-274 no. 3697, Taqrib al-Tahdhib 1/351 no. 64, and Al-A'lam 3/163.\n6 - Jabir, is Jabir bin Yazid al-Ju'fi, Abu Abdullah, also called Abu Yazid, and Abu Muhammad (d. 127 or 128 AH). Was of wide narration, abundant knowledge, some declared him trustworthy and others weakened him. =\n\nNone",
    "book_id": "857",
    "new_page_number": 46
  },
  {
    "serial_number": "1210502",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 48,
    "volume_number": 1,
    "text": ".....................................\n\nI heard a man say to Abu Zaid: Do you suspect me in the religion of Allah? He said: I suspect you in the language (1) of the Messenger of Allah, peace and blessings be upon him.",
    "foot_note": "1. = His biography in Tahdhib al-Kamal 4/465-472 no. 879, Al-Jarh wa Al-Ta'dil 2/479-498 no. 2043, Mizan al-I'tidal 1/379-384 no. 1425, Taqrib al-Tahdhib 1/123 no. 17, and Al-A'lam 2/105.\n7 - Muhammad bin Abdul Rahman bin Zaid thus it occurred. He is Muhammad bin Abdul Rahman bin Yazid bin Qais al-Nakha'i, narrated from his father and others, he is trustworthy, was of high status among the prominent. His biography and sources in Siyar A'lam al-Nubala 4/78 no. 25. His father is Abdul Rahman bin Yazid, Abu Bakr al-Nakha'i the Imam, Jurist, narrated from Umar and Uthman and Ibn Mas'ud and others. His biography and sources in Siyar A'lam al-Nubala 4/78 no. 24. What occurred in the chain of the news in Idah al-Waqf 20: \"... from Muhammad bin Abdul Rahman from Zaid he said Abu Bakr and Umar said...\"? And Zaid is Zaid bin Aslam (d. 136 AH) and his father is Aslam client of Umar. His biography and sources in Siyar A'lam al-Nubala 5/316-317 no. 153.\n8 - Abu Bakr Al-Siddiq, mentioned in News 12.\n9 - Umar bin al-Khattab: mentioned in News 10, 11, and 13.\n\n1. In \"B\": in the Sunnah of the Messenger of Allah? It appears to be an error from the scribe. The news with slight difference in its wording is in Al-Basa'ir wa Al-Dhakha'ir 3/1/316-317 from Abu al-Ayna from Abu Zaid.\n1 - Waki' bin Khalaf, is Muhammad bin Khalaf nicknamed Waki' (d. 306 AH). (See Author's Sheikhs no. 45). The Imam, Muhaddith, Historian, Judge, Abu Bakr, trustworthy, glorious. His biography and sources in Siyar A'lam al-Nubala 14/234 no. 140, Mizan al-I'tidal 3/538 no. 7489, Ghayat al-Nihayah 2/137 no. 2991, and Al-A'lam 6/114.\n2 - Muhammad bin Khallad, mentioned in News 6. =",
    "book_id": "857",
    "new_page_number": 47
  },
  {
    "serial_number": "1210505",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 49,
    "volume_number": 1,
    "text": ".....................................\n\n19 - Abu Tahir told us, he said: Waki' told us, he said: Muhammad bin Khallad told me, he said: Al-Walid bin Hisham al-Qahdhami told us, he said: Khalid bin Safwan entered the bathhouse and there was a man with his son, so he wanted to show Khalid what he had of eloquence, so he said: O my son, start with your two hands and your two feet (using wrong grammar), then he turned to Khalid and said: O Abu (1) Safwan, this is speech whose people have gone. He said: This is speech for which Allah never created people (2).\n\n20 - Abu Tahir told us, he said: Musa bin Ubaydullah told us, he said: Ibn Abi Sa'd (1) al-Warraq told us, he said: Ahmad bin Umar bin Ismail bin Abdul Aziz al-Zuhri told us, he said: Muhammad bin al-Harith al-Makhzumi told me, he said:",
    "foot_note": "1. = 3 - Abu Zaid, Saeed bin Aws al-Ansari (d. 215 AH). The Imam, Allama, Trustworthy, Proof of Arabs. His biography and sources in Inbah al-Ruwat 2/30-35 no. 269, and Siyar A'lam al-Nubala 9/494-496 no. 186.\n\n1. In \"B\" Aba.\n2. In \"Z\": Ma khalaq Allah 'azza wa jalla lahu. The news with difference in narration is in Al-Basa'ir wa Al-Dhakha'ir 3/1/317 from Abu al-Ayna from Abu Zaid, and Ghurar al-Khasa'is 174 without chain.\n1 - Waki', mentioned in News 18.\n2 - Muhammad bin Khallad, mentioned in News 6 and 18.\n3 - Al-Walid bin Hisham al-Qahdhami (d. 222 AH). Trustworthy. His biography in Al-Jarh wa Al-Ta'dil 9/20 no. 85, Mizan al-I'tidal 4/349 no. 9415, and Al-Ansab 10/67.\n4 - Khalid bin Safwan (d. around 133 AH). Of the famous eloquent Arabs, has current words. His biography and sources in Al-A'lam 2/297.\n\n1. In both copies here \"Saeed\" and so in \"Z\" in News 21-24, which is a distortion.",
    "book_id": "857",
    "new_page_number": 48
  },
  {
    "serial_number": "1210508",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 50,
    "volume_number": 1,
    "text": "A man entered upon Abdul Aziz bin Marwan complaining about a son-in-law of his, saying: My son-in-law (Khatani - can also mean circumciser) did such and such to me. Abdul Aziz said to him: Who circumcised you (Khatanaka)? He said to him: The circumciser (Khattan) who circumcises people!! Abdul Aziz said to his scribe: Woe to you, with what did he answer me?! He said (2): O Prince, you made a grammatical error (Lahanta), and he does not know grammatical error. You should have said to him: And who is your son-in-law (Khatanuka). Abdul Aziz said: I see myself speaking with a speech Arabs do not know! I will not witness (meet) people until I know grammatical error (3). He said: So he stayed in the house for a week not appearing, and with him was someone teaching him Arabic. He said: So he prayed Friday prayer with the people while being one of the most eloquent people. He said (4): He used to give for Arabic and deprive for grammatical error, until visitors from the people of Medina and the people of Mecca from Quraysh came to him. He started saying to a man among them: From whom are you? He says: From Banu so-and-so. He says to the scribe: Give him two hundred Dinars. Until a man from Banu Abd al-Dar bin Qusai came to him. He said: From whom are you? He said: From Banu (should be Bani) Abd al-Dar. He said: You find it in your prize (referring to the error). He said to the scribe: Give him one hundred Dinars.",
    "foot_note": "2. Not in \"B\".\n3. The first part of the news was cited by Abu Bakr bin al-Anbari in Al-Adhdad 246 with slight abridgment, and narrated by Ibn Asakir in Tarikh Dimashq (its summary by Ibn Manzur 15/155-156) to his saying in the second part \"... and deprive for grammatical error\". It occurred in Al-Mahasin wa Al-Masawi by Al-Bayhaqi 424, Al-Iqd 2/48, Ghurar al-Khasa'is 173, and Al-Fakhri fi Al-Adab Al-Sultaniyya 127 abbreviated with difference, and in these sources the news happened with Al-Walid bin Abdul Malik and with him was Umar bin Abdul Aziz.\n4. Not in \"B\".\n1 - Musa bin Ubaydullah, Abu Muzahim al-Khaqani (d. 325 AH). (See Author's Sheikhs no. 58). The Imam, Reciter, Muhaddith. His biography and sources in Tarikh Baghdad 13/59 no. 7035, and Ma'rifat al-Qurra 1/274 no. 190.\n2 - Ibn Abi Sa'd al-Warraq, is Abdullah bin Abi Sa'd Amr bin Abdul Rahman al-Ansari, Abu Muhammad al-Warraq (d. 274 AH). Was trustworthy, possessor of news, literature, and anecdotes. His biography in Tarikh Baghdad 10/25-26 no. 5144. =",
    "book_id": "857",
    "new_page_number": 49
  },
  {
    "serial_number": "1210509",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 51,
    "volume_number": 1,
    "text": ".....................................\n\n21 - Abu Tahir told us, he said: Musa told us, he said: Ibn Abi Sa'd told us, he said: Muhammad bin Ishaq al-Sahmi told us, he said: This Sheikh - meaning Abu Sufyan al-Kufi - told us from Ja'far bin Uqba al-Hanzali, he said: It was said to Abdul Malik bin Marwan: Gray hair hastened to you!! He said: The frequency of ascending the pulpit and the fear of grammatical error turned me gray (1).\n\n22 - Abu Tahir told us, he said: Musa told us, he said: Ibn Abi Sa'd told us, he said: Ismail bin Ibrahim bin al-Mughira al-Marwazi told us, he said: Al-Nadr bin Shumayl told us, he said: Al-Khalil bin Ahmad told us, he said:",
    "foot_note": "1. 3 - Ahmad bin Umar bin Ismail bin Abdul Aziz al-Zuhri. Thus it occurred, and I do not know him.\n4 - Muhammad bin al-Harith al-Makhzumi, Maqbul (Acceptable). His biography in Al-Jarh wa Al-Ta'dil 7/230 no. 1265, and Taqrib al-Tahdhib 2/152 no. 120.\n5 - Abdul Aziz bin Marwan, Emir of Egypt (d. 85 AH). Was alert, knowledgeable in politics of lands, brave, generous. His biography and sources in Al-A'lam 4/28.\n\n1. The news is in Al-Iqd 2/479, Al-Fakhri fi Al-Adab Al-Sultaniyya 124, and Al-Sina'atayn 17 with slight difference. In \"B\": \"thinness of grammatical error\" which is an error.\n1 - Musa, is Musa bin Abdullah, mentioned in News 20.\n2 - Ibn Abi Sa'd, mentioned in News 20.\n3 - Muhammad bin Ishaq al-Sahmi was a hafiz of sciences of Hadith and literature, knowledgeable in days of people, but his knowledge was not trusted. His biography in Tarikh Baghdad 1/234-236 no. 52.\n4 - Abu Sufyan al-Kufi.\n5 - Ja'far bin Uqba al-Hanzali.\n6 - Abdul Malik bin Marwan (d. 86 AH). One of the greatest Caliphs and their cunning ones. His biography and sources in Al-A'lam 4/165.\n\nNone",
    "book_id": "857",
    "new_page_number": 50
  },
  {
    "serial_number": "1210512",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 52,
    "volume_number": 1,
    "text": "Ayyub Al-Sakhtiyani made a grammatical error in a letter, so he said: I ask forgiveness of Allah (1).",
    "foot_note": "1. The news was narrated by Al-Mizzi in Tahdhib al-Kamal 8/328 in the biography of Al-Khalil from Ibn Abi Sa'd with the chain mentioned in the text. Abu Bakr bin al-Anbari narrated it in Idah al-Waqf 33 with his chain to Ismail bin Ibrahim from Al-Nadr from Al-Khalil. Yaqut mentioned it in Mu'jam al-Udaba 1/79 from Al-Nadr from Al-Khalil. Al-Suli mentioned it in Adab al-Kuttab 129 with another chain.\n1 - Musa, is Musa bin Ubaydullah, mentioned in News 20 and 21.\n2 - Ibn Abi Sa'd, mentioned in News 20 and 21.\n3 - Ismail bin Ibrahim bin al-Mughira al-Marwazi.\n4 - Al-Nadr bin Shumayl, Abu al-Hasan al-Mazini al-Basri (d. 204 AH). The Allama, Imam, Hafiz, Grammarian. His biography and sources in Inbah al-Ruwat 3/348-352 no. 798 and Siyar A'lam al-Nubala 9/328-332 no. 108.\n5 - Al-Khalil bin Ahmad, Abu Abdul Rahman al-Farahidi (d. around 170 AH). The Imam, Master of Masters of Arabic and founder of Prosody, was a head in the tongue of Arabs, religious, pious, content, humble, of great status. His biography and sources in Inbah al-Ruwat 1/341-347 no. 235, Siyar A'lam al-Nubala 7/429-431 no. 161, and Al-A'lam 2/314.\n6 - Ayyub Al-Sakhtiyani, is Abu Bakr Ayyub bin Abi Tamima Kaysan Al-Sakhtiyani (d. 131 AH). The Imam, Hafiz, Master of Scholars. His biography and sources in Al-Jarh wa Al-Ta'dil 2/255-256 no. 915, Tadhkirat al-Huffaz 1/130 no. 117, Tahdhib al-Kamal 3/457-464 no. 607, and Siyar A'lam al-Nubala 6/15-26 no. 7. And (Al-Sakhtiyani) with Fatha on Sin and Sukun on Kha and Kasra on Ta, stated by Al-Sam'ani in Al-Ansab 7/53, Ibn al-Athir in Al-Lubab 2/108, and Ibn Hajar in Taqrib al-Tahdhib 1/89. Kasra on Sin was narrated, but Fatha is the most common and eloquent, see Al-Taj (S kh t).",
    "book_id": "857",
    "new_page_number": 51
  },
  {
    "serial_number": "1210513",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 53,
    "volume_number": 1,
    "text": "23 - Abu Tahir told us, he said: Musa told us, he said: Ibn Abi Sa'd told us, he said: Ismail bin Ya'qub told us, he said: Muhammad bin Sallam told us, he said: Abu Abdullah al-Shanziri (1) told me, he said: Ibrahim was reading to Al-A'mash, so he said: (Qala liman hawlihu ala tastami'un) [Surah Ash-Shu'ara: 25] (using wrong case). Al-A'mash said to him: (Liman hawlahu). He said: Didn't (2) you tell me that \"Min\" drags (makes genitive) what follows it?! (3).",
    "foot_note": "1. In \"Z\" Al-Shaniqitri?.\n2. In \"Z\": \"Al-A'mash said to him Liman ala tastami'un didn't...\" and it has omission and error.\n3. Abu Bakr bin al-Anbari narrated from his father from Muhammad bin al-Jahm from Al-Farra from Mandal bin Ali al-Ghanawi from Al-A'mash, he said: \"I said in the presence of Ibrahim al-Nakha'i and Talha bin Musarrif: (Qala liman hawlahu ala tastami'un). He said: So Ibrahim said: You cease not to bring us a more heinous letter, it is only (Qala liman hawlihu), I said: No, it is only (Liman hawlahu). He said: So Ibrahim said to Talha bin Musarrif: How do you say? He said: As you said (Liman hawlihu). Al-A'mash said: I said: You both made a grammatical error, I will not sit with you today.\" Idah al-Waqf 60, and see Ma'ani al-Quran by Al-Farra 2/76, and Ta'wil Mushkil al-Quran 61-62.\n1 - Musa, is Musa bin Ubaydullah, mentioned in News 20-22.\n2 - Ibn Abi Sa'd, mentioned in News 20-22.\n3 - Ismail bin Ya'qub. Perhaps Ismail bin Ya'qub al-Subayhi Abu Muhammad al-Harrani (d. after 272 AH). His biography in Tahdhib al-Kamal 3/215-216 no. 495, and Taqrib al-Tahdhib 1/75 no. 565.\n4 - Muhammad bin Sallam, Abu Abdullah al-Jumahi (d. 231 AH). The Allama, was a scholar, historian, brilliant litterateur. His biography and sources in Siyar A'lam al-Nubala 10/651-652 no. 233, and Al-A'lam 6/146.\n5 - Abu Abdullah al-Shanziri (Z: Al-Shaniqitri).\n6 - Ibrahim, is Ibrahim bin Yazid bin Qais al-Nakha'i, Abu Imran (d. 96 AH). The famous Imam, Righteous, Ascetic, Scholar. His biography and sources in Al-Jarh wa Al-Ta'dil 2/144-145 =",
    "book_id": "857",
    "new_page_number": 52
  },
  {
    "serial_number": "1210514",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 54,
    "volume_number": 1,
    "text": ".....................................\n\n24 - Abu Tahir told us, he said: Musa told us, he said: Ibn Abi Sa'd told us, he said: Al-Mufaddal told us, he said: Abu Mushir said (1): Al-Awza'i used to make grammatical errors.\n\n25 - Abu Tahir recited to us, he said: Abu al-Tayyib Muhammad bin al-Hussein bin Humaid bin al-Rabi' recited to us, he said: Abu al-Hasan Ali bin al-Harith al-Murhibi recited to me, he said: Anbasa",
    "foot_note": "1. = no. 473, Ghayat al-Nihayah 1/29 no. 125, and Al-A'lam 1/80.\n7 - Al-A'mash, is Sulaiman bin Mihran, Abu Muhammad al-Asadi al-Kahili al-Kufi (d. 148 AH). The Imam, Sheikh of Islam, Sheikh of Reciters and Muhaddithin. His biography and sources in Ma'rifat al-Qurra 1/94-96 no. 36, Siyar A'lam al-Nubala 6/226-248 no. 110, and Al-A'lam 3/135.\n\n1. In B: And said, inserting Waw.\n1 - Musa, is Musa bin Ubaydullah, mentioned in News 20-23.\n2 - Ibn Abi Sa'd, mentioned in News 20-23.\n3 - Al-Mufaddal.\n4 - Abu Mushir, is Abdul A'la bin Mushir, Abu Mushir al-Ghassani (d. 218 AH). The Imam, Jurist, Sheikh of Sham. His biography and sources in Tarikh Dimashq by Ibn Asakir vol 39/379-402, Tadhkirat al-Huffaz 1/381 no. 379, Siyar A'lam al-Nubala 10/228-238 no. 60, and Al-A'lam 3/269.\n5 - Al-Awza'i, Abu Amr Abdul Rahman bin Amr (d. 157 AH). Sheikh of Islam, Imam of the Levant region in Fiqh and Asceticism. His biography and sources in Tadhkirat al-Huffaz 1/178-183 no. 177, Siyar A'lam al-Nubala 7/107-134 no. 48, and Al-A'lam 3/320.\n\nNone",
    "book_id": "857",
    "new_page_number": 53
  },
  {
    "serial_number": "1210517",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 55,
    "volume_number": 1,
    "text": "bin al-Nadr recited to us for Ali bin Hamzah al-Kisa'i al-Asadi (1):\nGrammar is but an analogy followed\nAnd in every matter it is benefited from\nSo if the youth sees (learns) grammar\nHe passes in logic (speech) a passing and expands\nSo everyone who sits with him fears him\nFrom a speaking sitter or a listener\nAnd if the youth does not see grammar\nHe fears to speak out of cowardice so he stops\nSo you see him raising the accusative and what\nWas of genitive and of accusative he raised (nominative) (2)\nHe reads the Quran not knowing what\nThe I'rab (parsing) conjugated in it and made (3)\nAnd he who knows it reads it\nSo if he doubts in a letter he returns\nLooking into it and into its parsing\nSo if he knows the grammatical error he splits (corrects) (4)\nSo they are equal in it according to you\nSunnah among us is not like innovations (5)",
    "foot_note": "1. Al-Khatib recited the verses in Tarikh Baghdad 1/412 from Ali bin Ahmad bin Umar al-Hamami from Abu Tahir with the mentioned chain. They are in Mu'jam al-Udaba 13/191-192, Inbah al-Ruwat 2/267, verses (1-5) in Mu'jam al-Shu'ara 138, and verses (1-8) in I'rab al-Quran attributed to Al-Zajjaj [1] 1/8-9.\n2. Also narrated: \"So you see him accusatizing the nominative and what ... was of accusative and of genitive he raised\". And in \"Z\": \"So you see him accusatizing the nominative\".\n3. In \"T\": Wa wada'a (and placed), which is a distortion.\n4. In \"Z\": And if he knows.\n5. In \"Z\": Fihi ka-al-bida', which is an error.\n[1]. The author of this book is Jami' al-Ulum Ali bin al-Hussein al-Asbahani (d. 543 AH), and the name of the book is \"Al-Jawahir\". See the precious investigation written by our professor, the Allama of Arabic in Bilad al-Sham, Ahmad Ratib al-Naffakh, may Allah have mercy on him, in his two articles devoted to investigating the attribution of this book and its name, published in the Journal of the Arab Academy of Damascus (Vol 48 Part 4 and Vol 49 Part 1), and see what I wrote in my article \"Kitab I'rab al-Quran al-Mansub ila al-Zajjaj huwa Kitab al-Jawahir li Jami' al-Ulum al-Asbahani\" in the Journal of the Arab Academy of Damascus Vol 66 Part 1 year 1990.",
    "book_id": "857",
    "new_page_number": 54
  },
  {
    "serial_number": "1210518",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 56,
    "volume_number": 1,
    "text": "How many a lowly one grammar raised and how many\nA noble we saw him lower\n\nThe Book is completed, and praise be to Allah Lord of the Worlds, and His blessings be upon our master Muhammad the Prophet sent to all creation, and upon his family and companions forever (6).",
    "foot_note": "None\n\n6. End of copy \"Z\": \"Its end\" and praise be to Allah alone and blessings upon our master Muhammad and upon his family and companions and peace completely.",
    "book_id": "857",
    "new_page_number": 55
  },
  {
    "serial_number": "1210520",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 57,
    "volume_number": 1,
    "text": "[Hearing of Bodleian Library Copy \"B\"]\nAll these News were heard on our Master, the Magnificent Sheikh, the Master Imam, the Unique Scholar, the Great Leader, Taj al-Din Jamal al-Islam Abu al-Yumn Zaid bin al-Hasan bin Zaid al-Kindi by his hearing from his Sheikh Abu Muhammad Abdullah bin Ali bin Ahmad al-Muqri with his chain in its beginning = The owner of the part, the Magnificent Judge, the Unique Master Diya' al-Din Abu (1) al-Hussein Muhammad bin Judge Alam al-Din Abu al-Tahir Ismail bin Abi al-Hajjaj may Allah grant him success, and Abu al-Qasim Ali bin Imam Hafiz Abu Muhammad Al-Qasim bin Ali bin al-Hasan bin Abdullah al-Shafi'i, and Abu Muhammad Abdullah bin al-Muslim bin Hammad bin Maysara al-Azdi, and Abu Muhammad Abdullah bin Muhammad bin Nasr Allah bin Abi Talib al-Rahbi, and Abu Bakr Ahmad bin Muhammad bin al-Hussein bin Abdul Samad al-Sahmi, and Abu Bakr Abdullah bin Abdul Wahid bin Ali bin al-Khidr, and Abu Ishaq Ibrahim bin Muhammad bin Abi Bakr al-Afsi, and al-Khidr bin Abdul Rahman bin al-Khidr al-Samli; and that was on Tuesday the second of Rajab year five hundred and ninety-nine, in the Mosque in Damascus = by reading of the owner of the part to the group, so it was correct and established. And praise be to Allah alone and His blessings upon our master Muhammad the Prophet and upon his family and peace completely.\n* * *\n[Hearing of Dar al-Kutub al-Zahiriyyah Copy \"Z\"]\nHeard from the beginning of \"Encouragement to Teach Grammar (2)\" on the Sheikh, Imam, Hafiz, Sheikh of Islam, Pride of Imams, Beauty of Hafizs, Remnant of Predecessors, Support of Successors, Abu Tahir Ahmad bin Muhammad bin Ahmad al-Silafi al-Asbahani may Allah be pleased with him by reading of Abdul Karim bin Isa (al-Sawa'i) = his companion Sheikh Abu Abdullah Muhammad bin al-Mujalli al-Jazari, and the Sheikhs:",
    "foot_note": "1. In original \"Abi\" which is error.\n2. This is the title of the News in this copy.",
    "book_id": "857",
    "new_page_number": 56
  },
  {
    "serial_number": "1210521",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 58,
    "volume_number": 1,
    "text": "Abu al-Hasan Ali bin Shaqha, Abu Muhammad Abdullah bin Khalaf (al-Dani), Abu al-Qasim bin Hasan (al-Jumayzi), Musharraf bin Badr and his son Mustafa, Abdullah bin al-Hussein al-Safrawi, Murshid al-Khatib, Abdullah bin Abdul Jabbar al-Uthmani, Abu Marwan Abdul Malik bin Muhammad al-Tawzari, Abdul Khaliq bin Hasan bin (Fattah) al-Sami, Muhammad bin al-Marzban al-Khuwayyi, Hasan bin Ahmad al-Awaqi, Umar bin Muhammad al-Qaysi, Futuh bin Khaluf al-Hamdani and his son Abdul Mu'ti, Muhammad bin Abdullah al-Nafrawi, Yahya bin Muhammad al-Tanji, and Abdul Rahman bin Marwan al-Tabib - and the hearing is in his handwriting - in Muharram year five hundred and seventy-five in Alexandria, and praise be to Allah alone and His blessings upon our master Muhammad. This is correct, written by Ahmad bin Muhammad al-Asbahani.\n[Another Hearing]\nHeard all that the part contains on the Sheikh, Imam, Jurist, Fakhr al-Din, Beauty of Sheikhs, Abu Abdullah Muhammad bin Ibrahim bin Ahmad al-Khabri al-Farsi known as al-Firuzabadi by reading of the owner of the part Sheikh Imam Salih Abu Musa Imran bin Bakran bin Imran known as al-Jazari = The Sheikhs Imams: Shams al-Din Abu al-Thana' Mahmud bin Razin (Kajar) bin Abdul Wahhab, Muhammad bin Abi Bakr bin Muhammad al-Sijzi, Abu Bakr bin Abi al-Ali bin Abi al-Yamin al-Qazwini, Muhammad bin Abi Bakr bin Muhammad al-Shirazi, Muhammad bin Abi Nasr bin Ali al-Mawsili, and Abdul Kafi bin Abi al-Mu'alla bin Amiri al-Sarkani and he is the scribe of the hearing, and that was in the Ribat of Sufis in Cairo the Guarded on nine passed of the month of Allah al-Asamm Rajab year five hundred and eighty-eight. Correct hearing according to what is written above my handwriting /",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 57
  },
  {
    "serial_number": "1210522",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 59,
    "volume_number": 1,
    "text": "And written by Muhammad bin Ibrahim bin Ahmad al-Khabri (1) al-Farsi / known as al-Firuzabadi, on the date mentioned above / in Cairo al-Mu'izziyyah, may Allah protect it.\n* * *\n[Another Hearing]\nAbu Tahir al-Silafi heard this part on Abu al-Hasan bin al-Allaf by his reading. And Abu Muhammad Abdullah bin Mansur bin Hibatullah bin al-Mawsili, Abu Muhammad Abdullah bin Ali bin Ahmad Sibt Abi Mansur al-Khayat, and Abu al-Barakat Ahmad bin Abdul Malik al-Bazughani heard it from him on different dates. And Abu al-Yumn Zaid bin al-Hasan al-Kindi heard it on Abu Muhammad Abdullah bin Ali bin Ahmad al-Muqri. And Abu Ya'la (2) Hamza bin Ali bin al-Qubayti and his sister's son Abu Talib Abdul Latif bin Muhammad, and Abdul Aziz bin Mahmud bin al-Akhdar (3), and others heard it on Abu Muhammad Abdullah bin Mansur bin Hibatullah bin al-Mawsili on Wednesday the sixteenth of Jumada al-Ula year five hundred and sixty in Baghdad. And it was heard on Sheikh Najm al-Din Abu Amr Uthman bin Ali bin Abdul Wahid al-Qurashi by his license from Abu Tahir al-Silafi by his hearing from Ibn al-Allaf = by reading of Ahmad bin Yahya al-Maliqi his brother Yahya, and Diya' al-Din Ismail bin Umar bin Abi al-Fadl bin Nasr al-Hamawi (4),",
    "foot_note": "1. The Great Ascetic Sufi (d. 622 AH) heard much from al-Silafi. See his biography and sources in Siyar A'lam al-Nubala 22/179-181 no. 120.\n2. Sheikh of Reciters was of beautiful writing, proficient Imam (d. 602 AH). See his biography and sources in Siyar A'lam al-Nubala 21/441-442 no. 233.\n3. The Imam, Scholar, Muhaddith, Long-lived, Benefactor of Iraq (d. 611 AH). See his biography and sources in Siyar A'lam al-Nubala 22/31-32 no. 26.\n4. Biographies of Ibn al-Allaf, Abu Muhammad Abdullah bin Mansur bin al-Mawsili, Abu Talib Abdul Latif bin al-Qubayti, Abu Amr Uthman bin Ali al-Qurashi, and Ismail bin Umar bin Abi al-Fadl al-Hamawi preceded in the commentary on the men of the chain of this copy p. 29-30.",
    "book_id": "857",
    "new_page_number": 58
  },
  {
    "serial_number": "1210523",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 60,
    "volume_number": 1,
    "text": "and others on Tuesday the seventh of Dhu al-Qi'dah year six hundred and fifty-four / in the Mosque of the Head in Damascus the Guarded. Transcribed by the poor unto Allah Almighty Muhammad bin Ali bin Muhammad bin (....) bin Ghanim (.....).",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 59
  },
  {
    "serial_number": "1210524",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 63,
    "volume_number": 1,
    "text": "Works of the Investigator\nPublished Articles\n• Badawi al-Jabal, Summit of Poetry in this Era, Al-Thawra Newspaper no. 4865 / 6/1/1979.\n• The Proofreader in our Literary Press, Al-Thawra Newspaper no. 4901 / 17/2/1979.\n• Mala'ib al-Asinna, Al-Majalla Al-Arabiyya no. 12 / 1981.\n• Commentary on the Critique of Kitab al-Amil wa al-Ma'mul attributed to Al-Jahiz, Journal of Jordan Academy of Arabic Language, Double Issue 25-26 / 1984.\n• A Comment from Amali Ibn Duraid, Al-Faisal Magazine no. 100 July 1985.\n• Kitab al-Amil wa al-Ma'mul attributed to Al-Jahiz - Investigation of its attribution and views on it, Al-Faisal Magazine no. 102 / September 1985.\n• Views on Sharh Hashimiyyat al-Kumait, Journal of Iraqi Scientific Academy Vol 36 Part 1 / 1985.\n• Views on Names of Arab Horses and their Lineages and Mention of their Riders, by Al-Ghandajani, Journal of the Institute of Arabic Manuscripts in Kuwait, Vol 29 Part 1 / 1985.\n• Al-Wasit fi al-Amthal, attributed to Al-Wahidi, Investigation of its attribution and views on it, Journal of the Institute of Arabic Manuscripts in Kuwait, Vol 29 Part 2 / 1985.\n• Sharh Abyat Sibawayh attributed to Abu Ja'far al-Nahhas, Journal of Arab Heritage in Damascus, Issue 19 / 1985.\n• Views on Sharh Abyat Sibawayh by Ibn al-Sirafi, Journal of Arab Academy in Damascus Vol 26 Parts 2 and 3 / 1985.\n• The phrase \"Hal laka fi kadha wa kadha\", Journal of Arab Academy in Damascus, Vol 62 Part 2 / 1987.\n• Akhbar fi al-Nahw, Narration of Abu Tahir Abdul Wahid bin Umar bin Abi Hashim from his Sheikhs, Damascus University Journal, Vol 4, Issue 15 / 1988.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 60
  },
  {
    "serial_number": "1210525",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Akhbar fi al-Nahw",
    "edition": "First Edition, 1413 AH - 1993 CE",
    "publisher": "Al-Jaffan and Al-Jabi for Printing and Publishing",
    "page_number": 64,
    "volume_number": 1,
    "text": "• Texts from Majalis Tha'lab or his Majalisat or Amali omitted by the printed version and additions to it, Damascus University Journal, Vol 5, Issue 20 / 1989.\n• Their saying \"Li-yahnika kadha wa kadha\", Journal of Arab Academy in Damascus, Vol 64 Part 2 / 1989.\n• A Tour of Jami' al-Ulum al-Asbahani with Abu Ali al-Farsi in Kitab al-Hujjah, Journal of Arab Academy in Damascus, Vol 64 Part 3 / 1989.\n• The Conjunction Waw meaning \"With\" in the like of Kuthayyir's saying: \"Wa inni wa tahyami... la-kal-murtaji\", Journal of Arab Academy in Damascus, Vol 65 Part 1 / 1990.\n• Kitab I'rab al-Quran attributed to Al-Zajjaj is Al-Jawahir by Jami' al-Ulum al-Asbahani, Journal of Arab Academy in Damascus Vol 66 Part 1 / 1990.\n• Rhymes whose wording agreed and meaning differed, the poem of Al-Khal and others, Damascus University Journal Vol 6 Issue 22 / 1990.\n• An Issue on the Divisions of \"Idha\" and its Answer and the Operator in it, by Ibn Barri, Damascus University Journal Vol 6 Issue 24 / 1990.\n• Pauses with Al-Dibaj by Abu Ubaidah, Journal of the Institute of Arabic Manuscripts in Cairo Vol 35 Part 1, 2 / 1991.\n• Views on the Book of Al-Hussein bin Ali and Hujr bin Adi, Journal of Islamic Culture (Cultural Chancellery of the Islamic Republic of Iran in Damascus) Issue 44 / 1992.\n• Remainder of Al-Khatiriyyat by Ibn Jinni, Journal of Arab Academy in Damascus Vol 67 Part 3 / 1992.\n• An Issue on the Word of Testimony, by Al-Zamakhshari, Journal of Arab Academy in Damascus 68 Part 1 / 1993.\nBooks\n• Adab al-Katib, by Ibn Qutaybah, printed in Mu'assasat al-Risalah in Beirut 1981.\n• Safar al-Sa'adah wa Safir al-Ifadah, by Alam al-Din al-Sakhawi, printed in Arab Academy in Damascus 1983.\n• Al-Kamil, by Abu al-Abbas al-Mubarrad, printed in Mu'assasat al-Risalah in Beirut 1986.\n• Kashf al-Mushkilat wa Idah al-Mu'dilat, by Jami' al-Ulum al-Asbahani, being printed in Arab Academy.",
    "foot_note": "None",
    "book_id": "857",
    "new_page_number": 61
  }
]