[
  {
    "text": "Mastery in the Controls of Recording the Qur'an\nAuthor: عرفة بن طنطاوي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "new_page_number": 1
  },
  {
    "text": "sn: 1681\nbook_title: الإِتْقَانِ فِي ضَوَابِطِ تَسْجِيِلِ القُرْآنِ\nbook_link: https://shamela.ws/book/937\nbook_id: 937\nauthor_name: عرفة بن طنطاوي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3169\nauthor_ID: 3169\neditor: Null\npublisher: مجلة البحوث الإسلامية\nedition: العدد 71، ذو الحجة 1442 هـ\npages: 71\nvolumes: 71\npagination: [ترقيم صفحات البحث موافق للمجلة. ورقم الجزء هو رقم العدد]\ncategory: التجويد والقراءات\ncategory_id: 5",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "new_page_number": 2
  },
  {
    "serial_number": "1144745",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Tajweed and Readings\nBook: Mastery in the Controls of Recording the Qur'an (Al-Itqan fi Dawabit Tasjil al-Qur'an)\nAuthor: Arafa bin Tantawi\nResearch published in: Journal of Islamic Research (Majallat al-Bahuth al-Islamiyyah), Issue 71, Dhu al-Hijjah 1442 AH\nJournal of Islamic Research: An Egyptian peer-reviewed journal, started in 1436 AH, published monthly. Its Editor-in-Chief is Prof. Dr. Abd al-Fattah Mahmoud Idris, Professor in the Department of Comparative Jurisprudence at the Faculty of Sharia and Law, Al-Azhar University.\nNote: The research sent by the author - may Allah preserve him - contains sections that did not appear in the printed version of the journal. We have included them all and indicated them in their places.\n[The pagination of the research matches the journal. The volume number corresponds to the issue number]\nDate of publication in Shamela: 24 Dhu al-Hijjah 1443",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 3
  },
  {
    "serial_number": "1144746",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Research Abstract: This is a research titled \"Mastery in the Controls of Recording the Qur'an.\" In it, the researcher addressed the issues that hinder the preservation of the Qur'an when \"recorded,\" and established scientific, foundational controls, standards, and criteria for it, consistent with the outcome of the compilation of the Qur'an in its three eras. He addressed this issue in a manner suitable and appropriate for the current challenges in contemporary reality. Then, he warned most severely against boldness towards the Book of Allah in all its forms and shapes, especially reciting it using what are called \"Musical Maqamat\" (Musical Modes), out of glorification, reverence, and magnification of His Speech - Exalted be He in His Majesty.\n\nPREAMBLE OF THE RESEARCH\nPraise be to Allah, who began by praising His Exalted Self before any praiser praised Him. I bear witness that there is no god but Allah alone, having no partner, to Whom belongs all praise; the One, the Eternal Refuge, who neither begets nor is born, nor is there to Him any equivalent. All the people of His obedience are worshippers of Him, and they are devoutly obedient to Him, standing, bowing, and prostrating. The Living who does not die; the Self-Subsisting who does not sleep; Possessor of Majesty and Honor, and of great and magnificent gifts. He spoke the Qur'an, created man, taught him speech, eloquence, and expression, and bestowed upon His servants guidance and faith. He sent His Messenger Muhammad, peace be upon him, to all mankind and jinn, and supported him with proof and evidence that renew with the renewal of day and night (1); He sent him with a clear Arabic Book,",
    "foot_note": "1. Al-Malawan: Night and Day, or the two ends of the day. The Jadidan (Two News) are also Night and Day. See: Qamus al-Ma'ani al-Jami'.",
    "book_id": "937",
    "new_page_number": 4
  },
  {
    "serial_number": "1144747",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "clear and manifest, and made it a criterion between Monotheism and Polytheism, between guidance and error, darkness and light, doubt and certainty. He revealed it in the briefest wording and most miraculous style, so its rhetoric exhausted the eloquent and its similarity silenced them; its fluency incapacitated the fluent and its opposition baffled them; its wisdom silenced the wise and its contradiction wearied them; its magnificence stunned the orators and its imitation and address incapacitated them. They cannot produce the like of it, even if they assisted one another, as our Lord said regarding that in a clear statement: (Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants.\") (Al-Isra: 88).\n\nResearch Plan:\nThe researcher included in his research a plan consisting of two chapters. Under each chapter falls a number of sections (Mabahith), and under each section falls a number of requirements (Matalib). In it, he clarified the following:\nFirst: The importance of the research topic.\nSecond: The most important and prominent previous studies.\nThird: Reasons and motives for choosing the research topic.\nFourth: The research problem and its objectives.\nFifth: Research methodology.\nSixth: Conclusion of the research, and a statement of the most important results reached by this brief study.\nSeventh: Collection of indexes.\n\nThe research plan includes two chapters as follows:\nChapter One: Care for the Qur'an. It contains seven sections:\nSection One: The obligation of the Ummah to care for the Qur'an in every aspect. It has two requirements:\nRequirement One: The obligation of the Ummah's care for the Audio Compilation of the Qur'an \"specifically\".\nRequirement Two: The duty of the concerned authorities in the Ummah towards individual recordings.\nSection Two: The Heart (Spiritual) Controls when recording the Qur'an. It has four requirements:\nRequirement One: Sincerity (Ikhlas) in reciting the Qur'an.\nRequirement Two: Warning against reciting the Qur'an for other than Allah.\nRequirement Three: Classes of people and their states regarding Qur'an recitation.\nRequirement Four: Sincerity is from the deeds of the heart.\nSection Three: Takhliyah (Emptying/Purifying) and Tahliyah (Adorning) for the reciter of the Qur'an. It has four requirements:\nRequirement One: That the reciter be acting upon the Qur'an, characterized by purification (from vices) and adorned (with virtues).\nRequirement Two: The stance of the Companions, may Allah be pleased with them, regarding acting upon the Qur'an.\nRequirement Three: The effect of the Qur'an on the souls of the Companions, may Allah be pleased with them.\nRequirement Four: The stance of the Tabi'in (Successors), may Allah have mercy on them, regarding acting upon the Qur'an.\nSection Four: The most important Practical Controls that must be observed when recording the Qur'an. It has eight requirements:\nRequirement One: Observing the general rules of Tajweed when recording the Qur'an.\nRequirement Two: Absence of affectation and arbitrariness when reading.\nRequirement Three: Observing correctness of performance.\nRequirement Four: Reading with deliberation and tranquility.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 5
  },
  {
    "serial_number": "1144748",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Requirement Five: The reciter's attention to Waqf (Stopping) and Ibtida' (Starting).\nRequirement Six: The quality of mastery of the science of Waqf and Ibtida'.\nRequirement Seven: The importance of observing Waqf and Ibtida'.\nRequirement Eight: The Salaf's care for Waqf and Ibtida'.\nSection Five: Reading with Khushu' (humility), Takhashu' (submission), and presence of heart. It has two requirements:\nRequirement One: The concept of Khushu' linguistically and legally (Shar'an).\nRequirement Two: How the servant benefits from the Qur'an.\nSection Six: Improving the voice in recitation. It has three requirements:\nRequirement One: The description of improving the voice in recitation.\nRequirement Two: The correct concept of the \"Psalms of the Family of David\" (Mazamir Al Dawud).\nRequirement Three: Improving the voice does not contradict sincerity.\nSection Seven: Resolving the dispute between Taghanni (Chanting/Singing) and \"Musical Maqamat\" (Musical Modes). It has nine requirements:\nRequirement One: The concept of the meaning of Tarannum (Humming/Chanting).\nRequirement Two: The concept of the meaning of \"Music\".\nRequirement Three: The early vigilance of the Salaf regarding the confusion in the concepts of some terms.\nRequirement Four: The decisive word on \"Musical Maqamat\".\nRequirement Five: The consensus of the Salaf on the prohibition of reading the Qur'an with musical tunes.\nRequirement Six: The consensus of contemporary scholars on the prohibition of reading the Qur'an with musical tunes.\nRequirement Seven: The obligation to purify the Qur'an from \"Musical Maqamat\", out of glorification, reverence, and magnification of the Speech of Allah.\nRequirement Eight: Warning against boldness towards the Book of Allah.\nRequirement Nine: Tafkhim (Aggrandizing/Thickening) the voice in recitation.\nChapter Two: The Quranic Ijazah (Authorization) and related matters. It has two sections:\nSection One: Controls of the Quranic Ijazah. It has eight requirements:\nRequirement One: That the reciter be a Hafiz (memorizer), Mujaz (authorized), and Musnad (having a chain of transmission).\nRequirement Two: The concept of Quranic Ijazah.\nRequirement Three: The importance of Ijazah.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 6
  },
  {
    "serial_number": "1144749",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Requirement Four: The condition of Ijazah for whom the Qur'an is recorded.\nRequirement Five: Ijazah is a followed Sunnah.\nRequirement Six: Prominent figures whom the Prophet, peace be upon him, commended.\nRequirement Seven: The value and status of Prophetic commendations.\nRequirement Eight: The status of Isnad (Chain of Transmission) in the Religion.\nSection Two: That the recording of the Qur'an be by the voice of a \"male\" man. It has four requirements:\nRequirement One: The ruling on a woman's voice.\nRequirement Two: Women's Tasbih (saying Subhan Allah) in prayer if in the presence of men.\nRequirement Three: Prohibition of women from being soft in speech (Khudu' bil-Qawl).\nRequirement Four: Motives for discussing the control of recording the Qur'an (by a \"male\" man's voice).\n\nResearch Methodology\nFirst: Importance of the Research Topic\nThe importance of the research topic lies in the exposure of Qur'an recording to pests and obstacles that prevent it from being recorded in the correct form, as the compilation ended in its three eras written in hearts and preserved in lines. This research came to set the controls, standards, criteria, foundations, and scientific rules that ensure its preservation when recorded via modern recording means, free from any obvious or hidden error (Lahn), protected from any change, alteration, addition, or decrease, just as it was in the three eras of compilation, in realization of the promise of Allah - Exalted in His Majesty - mentioned in His saying in His decisive verses: (Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.) (Al-Hijr: 9).\n\nSecond: The Most Important and Prominent Previous Studies\nThe researcher did not find, within the narrow limits of his research, a foundational study that addressed the \"Controls of Recording the Qur'an\" in an independent, comprehensive scientific research covering all aspects. However, the discussion of some of these controls appeared within the context of the compilation of the Qur'an in its three stages in a number of scientific researches, or was mentioned as a note rather than study, discussion, and verification in others. Among the most prominent of those studies are:\nStudy One: \"The First Audio Compilation of the Holy Qur'an, or, The Chanted Mushaf: Its Motives and Plans\", Author: Dr. Labib Al-Said, Publisher: Dar Al-Kitab Al-Arabi for Printing and Publishing - Cairo, Date of Publication: 1387 AH, 1967 AD, (No edition).\nDescription of the Research: This research is considered the vanguard of the early works of audio compilation of the Holy Qur'an in this era, and this stage is considered the fourth stage of collecting the Qur'an, after",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 7
  },
  {
    "serial_number": "1144750",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "its compilation in its three eras. The history of this collection goes back more than six decades, when its idea crystallized in the heart and mind of the noble Dr. Labib Al-Said (born: 1914 AD - died: 1988 AD). He immediately presented his idea and his gigantic project - which had no precedent in the history of Islam - to the Board of Directors of the General Society for the Preservation of the Holy Qur'an in Cairo, of which he was the chairman at the time. That was specifically in late February or early March 1959 AD. His research (The First Audio Compilation of the Holy Qur'an) came as a scientific and practical translation of this project, the first of its kind in the history of Islam, which Dar Al-Kitab Al-Arabi in Cairo undertook to print in 1387 AH, as we mentioned earlier. The truth is also that this research, despite being a historical research telling the story of the first audio compilation of the Qur'an in the history of Islam, and in which the researcher explains the story of its compilation, motives, causes, goals, objectives, and the obstacles it faced until his dream was realized and his project came to light, and although he presented the imams of recitation in recording the recitations of his project, he, may Allah have mercy on him, did not address the controls of recording the Qur'an. However, the core of his research and the early work in it practically translate many of these controls, even if he did not refer to them verbally or in writing.\nStudy Two: \"Compilation of the Qur'an in its Historical Stages from the Prophetic Era to the Modern Era\", Author: Muhammad Shar'i Abu Zaid, Master's Thesis, College of Sharia, Kuwait University, Year of Publication: 1419 AH.\nDescription of the Research: This research highlights the Muslims' care for preserving the Qur'an from the era of Prophethood until now, confirms that the transmission of the Qur'an received the utmost care from Muslims, and responds to the suspicions of the detractors among the enemies of Islam regarding the transmission of the Holy Qur'an. Due to the quality of the research, its good phrasing, quality of presentation, casting of its style, and strength of its argument, many researchers have benefited from it and drawn from it. The researcher addressed the audio compilation of the Qur'an in the fifth chapter of his research, discussing: its idea, goals, value, plan, execution, and evaluation - only - because it is a sub-research and part of a scientific thesis. As for the controls of its recording and its conditions, he did not address them, because the objectives of his research are related to its title: \"Compilation of the Qur'an in its Historical Stages from the Prophetic Era to the Era\", and he intended by discussing the audio compilation the beginning of its idea and implementation plan... etc.\nStudy Three: \"Audio Recording of the Qur'an - A Critical Study\", by: Dr. Kamal Qaddah,",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 8
  },
  {
    "serial_number": "1144751",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Assistant Professor in the Department of Arabic Language and Literature, Research published in the Journal of Research and Studies, Issue Seven, for the year: 2009 AD, affiliated with the Institute of Languages and Literature, University Center - Hama Lakhdar University - El Oued - Algeria.\nDescription of the Research: This research is not considered a scientific research (in the full sense), but rather an article or research paper because it is very brief, containing only 18 pages. As its author says: It addresses the subject of audio recording of the Qur'an from the beginning of its appearance to our present time, where its author discusses the importance of those recordings recorded by great reciters. His study also dealt with critiquing the chanted Mushafs, revealing some errors that occurred in some of them, so that the listener would be aware of them and not accept everything he hears. He also called for presenting those recordings to specialized committees before broadcasting and publishing them. Despite the small size of this research, the researcher did well and provided benefit. He critiqued some apparent errors that some reciters fell into, noted the importance of benefiting from the recordings of great reciters, and excelled in warning against relying on those recordings for learning because they are auxiliary means and are not considered a source for receiving the Qur'an and learning it alone. There is no doubt that listening to those recordings is extremely beneficial for the learner, but they are not considered a source for reception and should not be relied upon for learning alone, as learning requires receiving orally from the mouths of skilled teachers and sheikhs, just as the Prophet, peace be upon him, received the Qur'an from Gabriel, peace be upon him, and as his Companions, may Allah be pleased with them, received it from him, and as the Tabi'in received it from the Companions. Thus, the Qur'an was transmitted by Tawatur (successive narration) and oral reception from generation to generation until it reached us this way. The researcher was obliged to observe important aspects and pay attention to them, most notably:\n1 - His critique of some apparent errors committed by specific reciters by name. It would have been better for him to note the errors without mentioning the reciter's name, because no one is free from error except the infallible one supported by revelation.\n2 - His claim that his research: \"addresses the subject of audio recording of the Qur'an from the beginning of its appearance to our present time.\" The observer of his research finds that this statement in the reality of the research does not match its title; rather, he finds it quite far from it because he did not address this subject with research and study, except that he alluded to it - only - and it seems that the brevity of the research played a prominent role in that, and Allah knows best.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 9
  },
  {
    "serial_number": "1144752",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "3 - It was incumbent upon the researcher to discuss the controls of recording the Qur'an, research them, and study them from all aspects, because the topic of his research is: \"Audio Recording of the Qur'an - A Critical Study\". The truth is that he did not address the controls of recording the Qur'an, and there is a correlative relationship between these controls and audio recording. He only spoke about the necessity of taking care to control it at the time of its recording - only -, and this is not sufficient at all.\n\nThird: Reasons and Motives for Choosing the Research Topic\nAs for the reasons and motives for choosing the research topic, they are many, but among the most prominent is the spread of those recorded recitations by large numbers of unqualified reciters through various types and names of modern technical means. So this brief and humble study came to address this phenomenon according to scientific, foundational controls, standards, and criteria appropriate for the current challenges in our present reality, which hinder the emergence of those recordings in the correct form in which the preservation of the Qur'an ended in its three eras.\n\nFourth: Research Problem and Objectives\nA - Research Problem\nThe research problem lies in the rapid spread of those undisciplined recorded recitations via modern technology like wildfire, despite the obvious and hidden errors (Lahns) they contain between their folds. They have become, for large masses of lay Muslims, sources of reception and sources of learning the Qur'an, due to the appreciation of melodious voices without regard to the quality of recitation and correctness of performance.\n\nB - Research Objectives\nThis research has great and noble objectives, most notably:\n1 - Alerting to the Ummah's responsibility and noting its duty towards the Book of its Lord to rise to care for it and maintain it from every aspect.\n2 - Establishing foundations, controls, and scientific and practical ingredients that must be realized in the one for whom the Qur'an is recorded.\n3 - Alerting to the duty of the concerned authorities in the Ummah towards undisciplined individual recordings spread via modern technology - specifically.\n4 - This study also came to note the reprehensible matters that accompany the audio recording of the Qur'an in general and what is called \"Musical Maqamat\" in particular.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 10
  },
  {
    "serial_number": "1144753",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "5 - Just as that study noted the common mistakes during the audio recording of the Qur'an and warned against them, it offered possible and available solutions and alternatives within human capabilities, and held the concerned authorities in Islamic countries responsible to play their constructive role in addressing that phenomenon as much as possible and available, acting upon the Almighty's saying: (So fear Allah as much as you are able) (At-Taghabun: 16).\n6 - Establishing controls for the Quranic Ijazah (Authorization) to be the correct path, the straight way, and the final bridge by which one crosses to audio recording.\n\nFifth: Research Methodology\nDescriptive Analytical Approach: The researcher prepared the scientific material related to his research topic \"Controls of Recording the Qur'an\", then presented it in an analytical presentation arranged according to importance. He then identified the ailment and offered the beneficial remedy for it. As for the most important objectives and most prominent problems of his research, he evaluated, balanced, and countered them by establishing results and appropriate solutions according to the contemporary challenges facing his research topic. He established possible and available solutions capable of addressing his research problem effectively, not formally, and addressed the concerned authorities who hold the power to solve these dilemmas according to the controls, conditions, foundations, and rules he established for recording the Holy Qur'an.\n\nChapter One: Care for the Qur'an\nIt contains seven sections:\n\nSection One: The obligation of the Ummah to care for the Qur'an in every aspect\nIt contains two requirements:\n\nRequirement One: The obligation of the Ummah's care for the Audio Compilation of the Qur'an \"specifically\"\nOne of the aspects of glorifying the speech of Allah Almighty is caring for it in every way, and among the greatest of those ways is caring for it when recording it. Just as the Qur'an was cared for in its collection in its three eras, so it was controlled preserved in the hearts, and controlled likewise written in lines, it should likewise be controlled when recording it via diverse contemporary recording means.\n\nRequirement Two: The duty of the concerned authorities in the Ummah towards individual recordings\nAlert: It is of paramount importance to note here great matters related to this affair, most notably:",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 11
  },
  {
    "serial_number": "1144754",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "First: It is known and observed that there are recordings of many different and scattered recitations on radio stations and broadcasting media, the abundance of which only Allah can count.\nSecond: Among these recordings are those that attained and deserved the degree of mastery but were not subject to the supervision of any specialized, accredited, and trusted scientific body.\nThird: Those recordings must be subject to the censorship and supervision of accredited scientific committees of leading specialists, to ensure their production is free from any error on the one hand, and to gain the reassurance of Muslims and their trust in them on the other.\nFourth: If we wanted to compare the fourth compilation of the Qur'an, which is the \"Audio Compilation,\" to its compilation in its second and third eras during the reign of the two Rightly Guided Caliphs, we would find that despite their trust in all the Companions, they formed a committee led by Zaid bin Thabit and established firm foundations, controls, and conditions for it, by which they guaranteed - after Allah's success and help - the production of the Mushaf free from errors.\nFifth: The scientific committees supervising the audio compilation must resemble the compilation committee in its second and third eras. Just as the supervising committee in those two eras was at the highest level of expertise, mastery, honesty, and piety, so too must be the case in the audio compilation committees. Scientific committees should be formed at the highest level from specialists among the scholars of Qira'at (Readings), controlling the script (Rasm), and Tajweed, who are attested for leadership in that by the people of their time, by specialized and accredited scientific bodies. Just as the compilation in these two eras was official by those whom Allah entrusted with the affairs of Muslims, so too must this \"Audio\" compilation take an \"Official\" character. And just as printed Mushafs are not printed or published except under the supervision of high official, secure, trusted, and accredited bodies in Islamic countries, such as the King Fahd Complex in Saudi Arabia and Al-Azhar in Egypt, so too must it be for recorded chanted Mushafs, equally, by analogy to the Qur'an compilation committee in its second and third eras to ensure the safety of those recordings that will remain in the hands of Muslims until Allah wills.\nSixth: Therefore, it must be emphasized that individual recordings must be strictly prohibited, and their release, broadcast, and publication to Muslims must be prevented until they are subject to the supervision of specialized and accredited scientific committees - officially - as we mentioned. Thus, the noose is tightened on individual works until they are subject to censorship and scientific supervision from trusted and accredited scientific bodies in the lands of",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 12
  },
  {
    "serial_number": "1144755",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Islam. By this, we ensure no tampering with the Book of Allah and limiting those recordings that did not rise to the required level of mastery and quality, and how many they are.\n\nSection Two: The Heart (Spiritual) Controls when recording the Qur'an\nIt has four requirements:\nSince it is of paramount importance to clarify the most important standards and controls that should be realized in the one for whom the Qur'an is recorded, namely the \"Reciter,\" who must possess the observance of outward etiquette of recitation - which often indicates inward etiquette - and the required quality of performance, it was incumbent upon the researcher to discuss and study those controls according to the following steps:\n\nRequirement One: Sincerity (Ikhlas) in reciting the Qur'an\nSincerity to Allah Almighty is a precious requirement and a precious intent. It is evidence of the servant's righteousness, the truthfulness of his intention, the goodness of his conscience, the purification of his soul, the soundness of his faith, and the truthfulness of his certainty. It is one of the greatest demands of religion. Observance of the aspect of sincerity to Allah Almighty in reciting the Qur'an is one of the greatest matters urged by the purified Sharia, because Allah Almighty does not accept deeds except what is purely for His sake and in accordance with His law. Among that is the recitation of the Qur'an, which is one of the most glorious acts of worship, and acts of worship are built upon sincerity to Allah Almighty; as our Lord, Glory be to Him, said: {And they were not commanded except to worship Allah, [being] sincere to Him in religion, inclining to truth, and to establish prayer and to give zakah. And that is the correct religion.} (Al-Bayyinah: 5).\n\nRequirement Two: Warning against reciting the Qur'an for other than Allah\nThe Prophet, peace be upon him, warned his Ummah and frightened them greatly, saying in what Abu Huraira, may Allah be pleased with him, narrated from him: \"Indeed, Allah, Blessed and Exalted, when it is the Day of Resurrection, descends to the servants (1), to judge between them, and every nation will be kneeling. The first to be called will be a man who collected (memorized) the Qur'an, a man who was killed in the cause of Allah, and a man of much wealth. Allah Almighty will say to the reciter: 'Did I not teach you what I revealed to My Messenger?' He says: 'Yes, O Lord.' He says: 'So what did you do with what you learned?' He says: 'I used to stand with it (in prayer) during the hours of the night and the hours of the day.' Allah Almighty says to him: 'You have lied,' and the angels say to him: 'You have lied.' Allah, Blessed and Exalted, says: 'Rather, you wanted it to be said: So-and-so is a reciter, and that has been said.' And the owner of",
    "foot_note": "1. This is a descent in reality befitting His Exalted Self, and this is the belief of Ahl al-Sunnah, just as their belief regarding all attributes of the Lord, Glory be to Him - affirming them in reality - in a manner befitting His Essence, Exalted be He, without interpretation (Ta'wil), negation (Ta'til), asking how (Takyif), likening (Tashbih), or representation (Tamthil), as our Lord said: (There is nothing like unto Him, and He is the Hearing, the Seeing) (Ash-Shura: 11).",
    "book_id": "937",
    "new_page_number": 13
  },
  {
    "serial_number": "1144756",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "wealth is brought, and Allah Almighty says: 'Did I not expand upon you (in wealth) until I did not leave you needing anyone?' He says: 'Yes, O Lord.' He says: 'So what did you do with what I gave you?' He says: 'I used to join ties of kinship and give charity.' Allah says to him: 'You have lied,' and the angels say: 'You have lied.' Allah, Blessed and Exalted, says: 'Rather, you wanted it to be said: So-and-so is generous, and that has been said.' And the one who was killed in the cause of Allah is brought, and Allah says to him: 'For what were you killed?' He says: 'O Lord! I was commanded to strive in Your cause, so I fought until I was killed.' Allah says to him: 'You have lied,' and the angels say: 'You have lied.' Allah says: 'Rather, you wanted it to be said: So-and-so is brave, and that has been said.' Then the Messenger of Allah struck my knee and said: 'O Abu Huraira, those three are the first of Allah's creation by whom the Fire will be kindled on the Day of Resurrection.'\" (1).\nIt was said: These three were the first of Allah's creation by whom the Fire is kindled because these acts of worship (learning and teaching Qur'an, Jihad, and spending) are of high status with Allah Almighty; so when their doers did not seek the Face of Allah Almighty with them, but rather sought the immediate [reward] in the world with them, and preferred the perishable in it over the everlasting in the Hereafter; Allah Almighty requited them by making them the first by whom the Fire is kindled; for the punishment is according to the magnitude of the crime. In the Hadith: Warning against Riya' (showing off), and clarification of the severity of its punishment. (2)\nAnd on the authority of Jundub bin Abdullah, may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: \"Whoever lets (his deeds) be heard, Allah will let him be heard of (expose him), and whoever shows off, Allah will show him off (expose him). (3)\nAl-Khattabi (d. 388 AH), may Allah have mercy on him, commenting on this Hadith, said: Meaning: Whoever does a deed without sincerity, only wanting people to see him and hear him, will be requited for that by Allah exposing him and disgracing him, and revealing what he used to conceal and hide of that. (4)\nAnd he, peace be upon him, said: \"Learn the Qur'an, and ask Allah by it for Paradise, before a people learn it who ask with it for the world. For indeed, the Qur'an is learned by three: a man who boasts with it, a man who eats with it, and a man who reads it for Allah.\" (5)\nDue to the great value and status of the Qur'an, it should not be used to seek a fleeting gain of the worldly gains, such as high status among people, their good praise of him, turning their faces towards him, or elevation",
    "foot_note": "1. Reported by At-Tirmidhi (2382), and authenticated by Al-Albani in Sahih At-Targhib wat-Tarhib (22).\n2. See: Sharh al-Hadith - Dorar Sunniyah.\n3. Reported by Al-Bukhari in Kitab al-Riqaq, Chapter on Riya' and Sum'ah 11/336 (6499), and Muslim in Kitab al-Zuhd wal-Riqaq, Chapter on whoever associates other than Allah in his deed 4/2289 (2987).\n4. Al-Kaba'ir, by Al-Dhahabi (p. 65).\n5. Authenticated by Al-Albani in Al-Silsilah Al-Sahihah (285), and see: Qiyam Al-Layl, Muhammad bin Nasr Al-Marwazi (p. 74).",
    "book_id": "937",
    "new_page_number": 14
  },
  {
    "serial_number": "1144757",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "above his peers, or seeking leadership, prestige, or money, or to fulfill his needs, having space made for him in gatherings and being given the front seat, or similar things other than drawing close to Allah Almighty... from the shares of the self and its desires. One of the greatest things that deter from these blameworthy traits is the saying of Allah Almighty: {And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.} (Az-Zumar: 65).\n\nRequirement Three: Classes of people and their states regarding Qur'an recitation\nThe Prophet, peace be upon him, mentioned the states of people regarding reading the Qur'an, and its effect on them: As established in the Two Sahihs from the hadith of Abu Musa Al-Ash'ari - may Allah be pleased with him - who said: The Messenger of Allah, peace be upon him, said: \"The likeness of the believer who reads the Qur'an is like the citron (Utrujjah); its fragrance is good and its taste is good. And the likeness of the believer who does not read the Qur'an is like the date; it has no fragrance and its taste is sweet. And the likeness of the hypocrite who reads the Qur'an is like the basil (Rayhanah); its fragrance is good and its taste is bitter. And the likeness of the hypocrite who does not read the Qur'an is like the colocynth (Hanzalah); it has no fragrance and its taste is bitter. (1)\nAl-Hafiz Ibn Hajar (d. 852 AH), may Allah have mercy on him, said in \"Al-Fath\": His saying: 'its taste is good, and its fragrance is good'. It was said: The attribute of faith was specified by taste, and the attribute of recitation by fragrance; because faith is more necessary for the believer than the Qur'an, as faith can be obtained without reading. (2)\nAnd on the authority of Iyas bin Amir, he said: Ali bin Abi Talib (d. 40 AH), may Allah be pleased with him, took my hand and said: If you remain, the Qur'an will be read by three classes: a class for Allah, a class for argument, and a class for the world; and whoever seeks by it will attain. (3). Meaning he attained what he read the Qur'an for, and this is a real and observed matter in people's lives.\nIbn al-Qayyim, may Allah have mercy on him, said: People in this are of four classes:\nThe first: The people of the Qur'an and faith, and they are the best of people.\nThe second: Those who lack the Qur'an and faith.\nThe third: Those who were given the Qur'an, but were not given faith.\nThe fourth: Those who were given faith, but were not given the Qur'an.\nThey said: Just as one who is given faith without the Qur'an is better than one who is given the Qur'an without faith, likewise one who is given contemplation and understanding in recitation is better than one who is given abundance of reading and its speed without contemplation. (4)",
    "foot_note": "1. Sahih Al-Bukhari, No. (5427), and the wording is his, and Sahih Muslim, No. (797).\n2. Fath Al-Bari (11/81).\n3. Sunan Al-Darimi (2/526).\n4. Zad Al-Ma'ad (1/338, 339). Zad Al-Ma'ad fi Hadyi Khayr Al-'Ibad, Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH), Publisher: Mu'assasat al-Risalah, Beirut - Maktabat al-Manar al-Islamiyyah, Kuwait, Edition: 27th, 1415 AH / 1994 AD, Number of Parts: 5.",
    "book_id": "937",
    "new_page_number": 15
  },
  {
    "serial_number": "1144758",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "In a similar vein, one of the contemporary reciters narrates saying: Our long-lived Sheikh, the Reciter: Abu Munir; Muhammad Al-Sayyid Ismail (1) - may Allah preserve him and prolong his life - narrated to us: \"Sultan Abdul Hamid the Ottoman gathered the senior reciters from the regions of the Islamic world in Yildiz Palace, 'which is the palace of the Ottoman Caliphate in Istanbul', and asked to hear from them. The last of them to read was the Reciter Sheikh: Hussein Musa Sharaf al-Din al-Masri al-Azhari 'who is one of the sheikhs of the sheikhs of Sheikh Muhammad, the narrator of the story; who is mentioned in the tree of reciters and was residing in the Badra'iyyah School in Damascus'. After he finished the reading, the Sultan's wife clapped from behind the curtain: indicating that the last reciter should read again. When the Sultan asked the Sheikh to repeat the reading; the Sheikh got angry and refused, saying: 'We read for Allah; and we do not read for So-and-so, and So-and-so'.\" (2). Where are the reciters of our time compared to this?!\nAl-Hasan Al-Basri (d. 110 AH), may Allah have mercy on him, said: The readers of the Qur'an are three:\nThe first: A man who took it as merchandise to transport from city to city, seeking with it what people have.\nThe second: And a people who memorized its letters, and wasted its limits, and sought favors from governors with it, and acted arrogantly with it over the people of their lands.\nThe third: And a man who read the Qur'an, and started with what he knows of the medicine of the Qur'an, so he placed it on the disease of his heart, so he stayed up his night, and his eyes shed tears, and they clothed themselves in reverence, and wore sadness, and stood in their prayer niches, and persevered in their cloaks. So by them Allah sends down rain, and reveals mercy, and lifts calamity. By Allah, this type among the bearers of the Qur'an is rarer than Red Sulfur. (3)\n\nRequirement Four: Sincerity is from the deeds of the heart\nSincerity is an act of the heart. Although sincerity is one of the acts of the hearts that no one knows except the Knower of the Unseen, Allah has made what points to that in the outward appearance, which indicates what is in the inner self often, namely adorning oneself with Khushu' (reverence) in recitation. Whoever adorns himself with Khushu' in his reading, the effect of that appears on him to those of understanding. That is the confirmation of what Ibn Majah narrated in the Sunan from the hadith of Jabir bin Abdullah, may Allah be pleased with him, who said the Messenger of Allah, peace be upon him, said: \"Indeed, among the people with the best voices with the Qur'an is the one whom, when you hear him read, you deem that he fears Allah\" (4). There is no doubt that Khushu' is an act of the heart, but Allah manifested it on the limbs.",
    "foot_note": "1. Sheikh: Abu Munir; Muhammad Al-Sayyid Ismail: Born in Eastern Ghouta of Damascus - Arbil (Arbin) around 1913 AD. He is one of my sheikhs (Speech of Abu al-Khair Salah Karanbah - author of the article). We met him about a month ago in the city of the Messenger of Allah, peace be upon him, where he came as a visitor after performing Umrah. He is, by the grace of Allah, in full mental and physical strength, but what hindered him from giving in the field of Qira'at is his hearing became a little weak. May Allah bless him and the likes of him from the -elite- people of the Qur'an, the people of Allah and His special ones.\n2. Sincerity in reciting the Qur'an, Abu al-Khair Salah Karanbah, Multaqa Ahl al-Tafsir on: 5/7/1428 AH.\n3. 'Uyun al-Akhbar, by Ibn Qutaybah al-Dinawari: (2/148).\n4. Al-Suyuti listed it in Al-Jami' Al-Saghir (3965) and attributed it to Ibn Majah from Jabir. Al-Mundhiri listed it in Al-Targhib wal-Tarhib and said: \"It was narrated,\" which is a sign of weakness for him as mentioned in his introduction. Sheikh Abu Ishaq Al-Juwaini extracted it in his answers to the questions of reciters in Majallat Al-Tawhid Al-Masriyyah, issue of Rajab 1425 in the Q&A section. He said in its extraction: Narrated by Ibn Majah (9331), Al-Ajurri in \"Akhlaq Hamalat al-Qur'an\" (38), and in his \"Fawa'id\", and Ibn Abi Dawud in \"Kitab al-Shari'ah\" - as in \"Ithaf al-Sadah\" (4/125) - from paths via Abdullah bin Ja'far al-Madini, from Ibrahim bin Ismail bin Mujammi', from Abu al-Zubayr, from Jabir explicitly mentioned. Al-Iraqi said in \"Takhrij Ahadith al-Ihya\" (1/682): \"Its chain is weak.\" Al-Busiri said in \"Al-Zawa'id\" (634/1): \"This chain is weak due to the weakness of Ibrahim bin Ismail bin Mujammi' and Abdullah bin Ja'far.\" I say: And the 'an'anah (narrating with 'from') of Abu al-Zubayr as well, so the correct view is that the chain is very weak, and Allah knows best. End. However, Al-Albani authenticated it in Sahih Al-Jami' (2202), and in Sahih Ibn Majah Vol 1 Hadith, and also extracted it in Al-Sahihah (1583).",
    "book_id": "937",
    "new_page_number": 16
  },
  {
    "serial_number": "1144759",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "For worshipping Allah Almighty by reciting the Qur'an is one of the best acts of worship, especially if it is with contemplation, reverence, and acting upon what is in it. In order for reverence to occur in recitation, Allah Almighty commanded good recitation with contemplation. In this Hadith: The Prophet, peace be upon him, informs about that; where he said: \"Indeed, among the people with the best voices with the Qur'an\", meaning: the best voices in reciting the Qur'an \"is the one whom, when you hear him read, you deem that he fears Allah\", meaning: that the requirement of improving the voice with the Qur'an is that its reading produces fear of Allah. So whoever you see fear in, has improved the voice with the Qur'an. This is an encouragement from the Prophet, peace be upon him, to improve the voice with it, and to recite it in a measured way (Tartil). If he reads with this description, it is more impactful on the heart and stronger in effect on its listener. (1)\nAnd his saying: (you deem him to fear Allah) means the requirement of improving the voice with the Qur'an is that its reading produces fear of Allah. So whoever you see fear in, has improved the voice with the Qur'an as required legally, so he is counted among the people with the best voices. (2)\nTherefore, the fear of falling into Riya' (showing off) in reading must be a motive for the reader to be sincere in his reading, and that matter should not be a discouragement for him from proceeding in reading with reverence and presence of heart; for Satan frightens the servant, brandishing the weapon of Riya' in his face, to induce him to abandon righteous deeds. So the believer reads and improves his reading seeking thereby the Face of Allah Almighty, relying on Him, saying to himself \"Abandoning deeds for the sake of people is Riya', and doing deeds for the sake of people is Shirk, and sincerity is that Allah cures you of both\" (3). And no one has done a deed except that two impulses passed through his heart (4), if the first of them is for Allah, the latter should not deter him. (5). Ibn Al-Athir (d. 606 AH), may Allah have mercy on him, said: The meaning is: If he intends an action and his intention in it is correct, then Satan whispers to him saying: 'You intend Riya' by this,' this should not prevent him from doing it. (6)",
    "foot_note": "1. See: Sharh al-Hadith - Dorar Sunniyah\n2. Hashiyat al-Sindi 'ala Ibn Majah: (1/403).\n3. Reported by Al-Bayhaqi in Shu'ab al-Iman (6879) Abu Abd al-Rahman al-Sulami told us, he said: I heard Ali bin Bundar say: I heard Abdullah bin Mahmud say: I heard Muhammad bin Abd Rabbih say: I heard Al-Fudayl say: He mentioned it, and its chain is weak.\n4. Ibn Al-Athir said in Al-Nihayah (2/420) Sawrah means a rush of sharpness. From it, the quarreler is called Sawwar.\n5. Reported by Abu Ubayd, in Gharib al-Hadith (4/451) he said: I heard Ibn Adi narrating, from Awf, from Al-Hasan Al-Basri, he said: He mentioned it, and its chain is authentic.\n6. Al-Nihayah fi Gharib al-Hadith wal-Athar (5/286). Al-Nihayah fi Gharib al-Hadith wal-Athar Author: Majd al-Din Abu al-Sa'adat al-Mubarak bin Muhammad bin Muhammad bin Muhammad Ibn Abd al-Karim al-Shaybani al-Jazari Ibn al-Athir (Died: 606 AH) Publisher: Al-Maktabah Al-Ilmiyyah - Beirut, 1399 AH - 1979 AD Investigation: Tahir Ahmad Al-Zawi - Mahmoud Muhammad Al-Tanahi Number of Parts: 5.",
    "book_id": "937",
    "new_page_number": 17
  },
  {
    "serial_number": "1144760",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Sincerity is that people have no share in the worship, and the worshipper does not leave anything of it for their sake. (1). If a person opened upon himself the door of observing people, and guarding against the intrusion of their false thoughts, most doors of goodness would be closed to him, and he would lose a great deal of the important matters of religion for himself. This is not the way of the knowers (of Allah) (2). So let the servant turn to his Lord and seek refuge in Allah from the accursed Satan, as our Great Lord said: (So when you recite the Qur'an, [first] seek refuge in Allah from Satan, the expelled [from His mercy]. Indeed, there is for him no authority over those who have believed and rely upon their Lord. His authority is only over those who take him as an ally and those who through him associate others with Allah.) (An-Nahl: 98-101). Thus, the intention must be present when reciting the Qur'an, and let his recitation be in response to His command, Glory be to Him, who says in His Noble Book: {I have only been commanded to worship the Lord of this city, Who made it sacred and to Whom [belongs] all things. And I am commanded to be of the Muslims [those who submit to Allah] And to recite the Qur'an. And whoever is guided is only guided for [the benefit of] himself; and whoever strays - say, \"I am only [one] of the warners.\"} (An-Naml: 91-92).\n\nSection: Takhliyah (Emptying/Purifying) and Tahliyah (Adorning) for the reciter of the Qur'an [*]\nIt has four requirements:\n\nRequirement One: That the reciter be acting upon the Qur'an, characterized by purification (from vices) and adorned (with virtues)\nThe original motive for this control is what the Rightly Guided Caliph and the First Truthful One, Abu Bakr, may Allah be pleased with him, enacted when he chose \"Zaid\" to carry out the task of the second compilation. He said to him: \"You are a young, intelligent man; we do not accuse you, and you used to write the revelation for the Messenger of Allah, peace be upon him. So search for the Qur'an and collect it.\" (1)\nHis saying: \"we do not accuse you\" contains the meaning of Takhliyah (emptying) from everything the soul leans towards, and everything one is accused of regarding invalidating impediments such as breaches of chivalry and shameful traits and characteristics.\nAnd his saying: \"and you used to write the revelation for the Messenger of Allah, peace be upon him\" contains the meaning of Tahliyah (adorning), because the Prophet's choice, peace be upon him, of Zaid as a \"scribe of revelation\" is a commendation for him of the highest commendations. Also, Al-Siddiq's adoption of the method of \"Takhliyah and Tahliyah\" in his choice of Zaid makes him the first in Islam to enact the sunnah of \"Certificate of Experience\" after the Messenger of Allah, peace be upon him (2). Thereby, trust is established in him and the soul feels reassured towards him.\nAlso, this description which was combined in Zaid in the first compilation, was adopted and decided by the third Rightly Guided Caliph Uthman, may Allah be pleased with him, in the third compilation in his choice of Zaid to undertake the task of the third compilation. In that is an endorsement of what Al-Siddiq, may Allah be pleased with him, executed and adopted in choosing Zaid, may Allah be pleased with him.\n\nThis description that Zaid was characterized with must be characterized by everyone who undertakes it in every era of its eras - likewise -, even if the description is relative between the description of a Companion and the description of others. There is no doubt that the fourth compilation, \"The Audio Compilation,\" falls under the name of \"Compilation\".\n\nRequirement Two: The stance of the Companions, may Allah be pleased with them, regarding acting upon the Qur'an\nAllah Almighty revealed the Qur'an to His Noble Messenger, peace be upon him, to teach it to his nation, and for it to be a methodology for them in their lives, studying it and acting upon it, obeying its commands and refraining from its prohibitions. On the authority of Jundub bin Abdullah, may Allah be pleased with him, said: We were with the Prophet, peace be upon him, while we were strong youths (Hazawirah), so we learned faith before we learned the Qur'an, then we learned the Qur'an, and we increased in faith by it. (1)\nAl-Sindi (d. 1138 AH), may Allah have mercy on him, said: (Hazawirah) is the plural of Hazwar, and it is said: Hazuwwar with Shaddah on the Waw; it is the boy when he becomes strong, capable, and resolute. So in Al-Sahah, and in Al-Nihayah: It is one who approached puberty. His saying: (and we increased by it) means due to the Qur'an. (2)\nRegarding this etiquette, Abu Ubayd Al-Qasim bin Salam Al-Harawi (d. 224 AH), may Allah have mercy on him, says: The reader of the Qur'an should be keen to act upon what he reads of the Holy Qur'an in his worldly life so that the recitation will be an argument for him on the Day of Resurrection and not an argument against him.\" (3)\nThis is the state described by Ibn Umar (d. 73 AH), may Allah be pleased with them both, saying: We lived for a period of our time and one of us would be given faith before the Qur'an. The Surah would be revealed to Muhammad, peace be upon him, and he would learn its lawful and prohibited matters, and what should be stopped at in it, just as you learn the Qur'an. Then he said: I have seen men, one of whom is given the Qur'an and reads what is between its Opening (Fatihah) to its end, not knowing its command nor its deterrent, nor what should be stopped at in it; he scatters it like the scattering of bad dates (Daqal). (4).. (5)\n\nSheikh Al-Islam Ibn Taymiyyah (d. 728 AH), may Allah have mercy on him, said: - The Companions took the wording of the Qur'an and its meaning from the Messenger. Rather, they used to take the meanings from him stripped of their wordings using other wordings, as Jundub bin Abdullah Al-Bajali and Abdullah bin Umar said: We learned faith then we learned the Qur'an, so we increased in faith. He used to teach them faith, which is the meanings revealed in the Qur'an of what is commanded and reported, received with obedience and belief. This is true, for the memorizers of the Qur'an were fewer than the general believers. (1)\nThe precedence of faith over memorizing the Qur'an in the generation of the Companions contributed to this, because among the first of the Qur'an revealed in the Meccan era were the \"Mufassal Surahs\" which focus on issues of faith in Allah and the Last Day and establish the creedal aspect upon which the foundation of Islam was built. Ibn Mas'ud, may Allah be pleased with him, used to call the Mufassal Surahs \"The Core (Lubab) of the Qur'an\". \"Because what was summarized elsewhere was detailed in them\". (2)\nOn the authority of Aisha, Mother of the Believers, may Allah be pleased with her, she said: \"Indeed, the first of what was revealed thereof was a Surah from Al-Mufassal, in which Paradise and Hell are mentioned. Until when the people returned to Islam, the Halal and Haram were revealed. If the first thing revealed was: 'Do not drink wine', they would have said: 'We will never leave wine', and if it was revealed: 'Do not commit adultery', they would have said: 'We will never leave adultery'. Indeed, it was revealed in Mecca to Muhammad, peace be upon him, while I was a young girl playing: (But the Hour is their appointment [for due punishment], and the Hour is more disastrous and more bitter) (Al-Qamar: 46). And Surah Al-Baqarah and An-Nisa were not revealed except while I was with him.\" (3)\nImam Malik narrated in his \"Muwatta\" from Yahya bin Saeed Al-Qattan, that Abdullah bin Mas'ud, may Allah be pleased with him, said to a person: \"You are in a time where its reciters are few and its jurists are many; the limits of the Qur'an are preserved in it, and its letters are neglected; few are those who ask, many are those who give; they lengthen the prayer, and shorten the sermon; they put their deeds before their desires. And there will come upon the people a time where its reciters are many, its jurists are few; the letters of the Qur'an are preserved in it, and its limits are neglected; many are those who ask, few are those who give; they lengthen the sermon, and shorten the prayer; and they put their desires before their deeds.\" (4)\n\nOnly those among them who collected some Surahs of the Qur'an were considered great, because their custom was acting upon the Qur'an. Therefore, Anas, may Allah be pleased with him, says: \"When a man read Al-Baqarah and Al-Imran, he became great in our eyes.\" (1), meaning: his status became great and his value rose among us, due to his acting upon the requirements of what he memorized.\nIbn Umar, may Allah be pleased with them both, confirms this meaning saying: The virtuous among the Companions of the Messenger of Allah in the beginning of this Ummah did not memorize of the Qur'an except a Surah or so, and they were blessed with acting upon the Qur'an. But the last of this Ummah read the Qur'an, among them the child and the blind, and they are not blessed with acting upon it. (2)\nTo achieve this supreme requirement, you see them delaying greatly in memorizing a Surah of the Qur'an. This is not out of inability to memorize or deficiency in that, but rather due to their preoccupation with acting upon what the verses of that Surah indicated. Among that is what Malik narrated from Nafi' from Ibn Umar, may Allah be pleased with them both, who said: Umar, may Allah be pleased with him, learned Al-Baqarah in twelve years; when he finished it, he slaughtered a camel. (3)\nThis narration shows that the length of Umar's stay, may Allah be pleased with him, in learning Surah Al-Baqarah was not out of inability, laziness, or slackness - far be it from him, and he is of such virtue, status, and precedence in every good and righteousness - but because knowledge of the Qur'an for them was coupled with acting upon it. And here is Ibn Mas'ud (d. 32 AH), may Allah be pleased with him, confirming the same meaning, saying: It was difficult for us to memorize the words of the Qur'an, but easy for us to act upon it; and for those after us, it is easy for them to memorize the Qur'an but difficult for them to act upon it. (4)\n\nRequirement Three: The effect of the Qur'an on the souls of the Companions, may Allah be pleased with them\n- On the authority of Asma' bint Abi Bakr (d. 73 AH), may Allah be pleased with them both, she said: The Companions of the Messenger of Allah, peace be upon him, when the Qur'an was read to them, were as Allah described them: their eyes shed tears and their skins shivered. (1) And they are as Allah described His allies in His saying: (Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide.) (Az-Zumar: 23).\nIbn Manzur (d. 711 AH), may Allah have mercy on him, said: Qusha'rirah (shivering): Trembling. (2)\nIbn Kathir (d. 774 AH), may Allah have mercy on him, said: His saying: (The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah) means this is the description of the righteous, upon hearing the words of the Compeller, the Hegemon, the Almighty, the Forgiver, because of what they understand from it of promise and threat, and intimidation and warning. Their skins shiver from it out of fear and dread, (then their skins and their hearts relax at the remembrance of Allah) because of what they hope for and expect of His mercy and kindness. They are different from others among the disbelievers in several ways:\nFirst: That the listening of these is the recitation of verses, while the listening of those is melodies of verses, from the voices of singing girls. (3)\n\nSecond: That when the verses of the Most Merciful are recited to them, they fall down prostrate and weeping, with manners, fear, hope, love, understanding, and knowledge.\nThird: That they adhere to etiquette when hearing it, as the Companions, may Allah be pleased with them, were when hearing the Speech of Allah from the recitation of the Messenger of Allah, peace be upon him: their skins shivered, then relaxed along with their hearts at the remembrance of Allah. They did not scream nor feign what was not in them; rather, they possessed stability, calmness, etiquette, and fear such that no one could match them in that; and for this, they won the highest prize in this world and the Hereafter.\nAbd al-Razzaq said: Ma'mar told us: Qatadah, may Allah have mercy on him, recited: (The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah) and said: \"This is the description of the allies (Awliya) of Allah. Allah described them that their skins shiver, their eyes weep, and their hearts find rest at the remembrance of Allah. He did not describe them with losing their minds and fainting over them. This is only in the people of innovation, and this is from Satan.\" (1)\n\nRequirement Four: The stance of the Tabi'in (Successors), may Allah have mercy on them, regarding acting upon the Qur'an\nThe matter was likewise in the generation of the Tabi'in. Regarding this, Al-Hasan Al-Basri, may Allah have mercy on him, says: This Qur'an was read by slaves and boys who have no knowledge of its interpretation, and they did not approach the matter from its beginning. Allah Almighty said: (A Book We have sent down to you, blessed, that they may reflect upon its verses) (Sad: 29), and reflecting upon its verses is nothing but following it. It is not by memorizing its letters and wasting its limits, until one of them says: I have read the whole Qur'an and did not drop a letter from it, while he - by Allah - has dropped it all; you do not see the Qur'an in his character or action. Until one of them says: I read the Surah in one breath. By Allah, these are not reciters, nor scholars, nor wise men, nor pious. When did reciters say such things? May Allah not increase the likes of these among people. (2)\n\nRegarding this, Ibn al-Qayyim, may Allah have mercy on him, says narrating from some of the Salaf: The Qur'an was revealed to be acted upon, so they took its recitation as an action; therefore, the people of the Qur'an are those who act upon it and act upon what is in it, even if they have not memorized it by heart. As for he who memorized it but did not understand it and did not act upon what is in it, he is not of its people, even if he straightened its letters like the straightening of an arrow. (1)\n\nSection Four: The most important Practical Controls that must be observed when recording the Qur'an\nIt has eight requirements:\n\nRequirement One: Observing the general rules of Tajweed when recording the Qur'an\nReading the Qur'an with observance of Tajweed rules is one of the most obligatory duties for the reciter to attend to, especially when recording the Qur'an, which will remain until Allah wills, and to which whomever Allah wills of His servants - whose number only He, Glory be to Him, can count - will listen.\nIbn al-Jazari (d. 833 AH), may Allah have mercy on him, said in \"Al-Nashr\": Tajweed is a verbal noun from Jawwada Tajwidan... For them, it is an expression for bringing the reading with improved wording, free from badness in pronunciation. Its meaning is the utmost end in correction and reaching the limit in improvement. There is no doubt that the Ummah, just as they are devoted to understanding the meanings of the Qur'an and establishing its limits, are devoted to correcting its words and establishing its letters according to the quality received from the Imams of Recitation connected to the Prophet, peace be upon him, the most eloquent",
    "foot_note": "1. See: Sharh 'Umdat al-Ahkam by Ibn al-Attar (3/1719). Al-'Uddah fi Sharh al-'Umdah fi Ahadith al-Ahkam Author: Ali bin Ibrahim bin Dawud bin Salman bin Sulayman, Abu al-Hasan, Ala' al-Din Ibn al-Attar (Died: 724 AH) Supervised printing and care: Nizam Muhammad Salih Yaqubi Publisher: Dar al-Bashair al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon Edition: First, 1427 AH - 2006 AD Number of Parts: 3.\n2. Al-Adhkar, by Al-Nawawi (p. 10). Al-Adhkar Author: Abu Zakariya Muhyi al-Din Yahya bin Sharaf al-Nawawi (Died: 676 AH) Investigation: Abd al-Qadir al-Arna'ut, may Allah have mercy on him Publisher: Dar al-Fikr for Printing, Publishing and Distribution, Beirut - Lebanon New revised edition, 1414 AH - 1994 AD.\n\n1. Al-Bukhari, Tafsir: 4311, Fadail al-Qur'an: 4603, Al-Ahkam: 6654.\n2. He did so following the example of the Messenger of Allah, peace be upon him, when he hired Abdullah bin Urayqit, who was a polytheist but a skilled guide (Khirrit), to guide him to the road to Medina. Al-Bukhari narrated from Aisha, may Allah be pleased with her, the wife of the Prophet, peace be upon him, who said: The Messenger of Allah, peace be upon him, and Abu Bakr hired a man from Bani Al-Dil who was a skilled guide, and he was on the religion of the disbelievers of Quraysh. They gave him their two mounts and promised him at the Cave of Thawr after three nights with their two mounts on the morning of the third. The Hadith was narrated by Al-Bukhari under number (2264). Khirrit: Expert in desert roads. His use, peace be upon him, of a man with prior experience in knowing the road is considered what we call in our present time: \"Certificate of Experience\".\n[*] (Shamela Comment): This section is not in the printed version of the journal and is established in what was sent to us from the author - may Allah preserve him -\n\n1. Reported by Ibn Majah (61), and authenticated by Al-Albani in \"Sahih Sunan Ibn Majah (1/37-38).\n2. Hashiyat al-Sindi (1/31).\n3. Fadail al-Qur'an by Abu Ubayd Al-Qasim bin Salam (p. 51, 75), Al-Burhan (1/449-474). Fadail al-Qur'an: Author: Abu Ubayd Al-Qasim bin Salam bin Abdullah Al-Harawi Al-Baghdadi (Died: 224 AH) Investigation: Marwan Al-Attiyah, Muhsin Kharabah, and Wafa Taqi Al-Din Publisher: Dar Ibn Kathir (Damascus - Beirut) Edition: First, 1415 AH - 1995 AD.\n4. With Fath on the un-dotted Dal followed by Fath on Qaf: It is bad, dry dates and what has no specific name. It is said: It is the worst dates. Gharib al-Hadith by Ibrahim al-Harbi (2/889) and Al-Nihayah by Ibn al-Athir (2/172).\n5. Reported by Al-Tahawi in Sharh Mushkil al-Athar (4/84), reported by Al-Hakim in Al-Mustadrak (1/35), and he said: This is an authentic hadith according to the conditions of the two Sheikhs, and I do not know any defect in it, and Al-Dhahabi agreed with him. Ibn Mandah authenticated it in \"Al-Iman\" (106), and Al-Haythami in \"Majma' al-Zawa'id\" (1/170).\n\n1. Jawab al-I'tiradat al-Masriyyah (p. 12). Jawab al-I'tiradat al-Masriyyah 'ala al-Futya al-Hamawiyyah, ed. ... Uzair Shams; Publisher: Islamic Fiqh Academy - Jeddah; Number of Volumes 1.\n2. Mir'at al-Mafatih, Book of Virtues of the Qur'an (7/254). Mir'at al-Mafatih Sharh Mishkat al-Masabih Author: Abu al-Hasan Ubayd Allah bin Muhammad Abd al-Salam bin Khan Muhammad bin Aman Allah bin Husam al-Din al-Rahmani al-Mubarakpuri (Died: 1414 AH) Publisher: Department of Scientific Research, Da'wah and Ifta - Salafi University - Banaras, India Edition: Third - 1404 AH, 1984 AD.\n3. Reported by Al-Bukhari (4993).\n4. Muwatta Malik, Book of Shortening Prayer in Travel, Chapter on Combining Prayers (1/598). Al-Muwatta Author: Malik bin Anas bin Malik bin Amir Al-Asbahi Al-Madani (Died: 179 AH) Investigator: Muhammad Mustafa Al-A'zami Publisher: Zayed bin Sultan Al Nahyan Charitable and Humanitarian Foundation - Abu Dhabi - UAE Edition: First, 1425 AH - 2004 AD Number of Parts: 8.\n\n1. Tafsir Al-Baghawi: (8/238). Ma'alim al-Tanzil fi Tafsir al-Qur'an, Author: Muhyi al-Sunnah, Abu Muhammad Al-Hussein bin Mas'ud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i (Died: 510 AH) Investigator: Abd al-Razzaq al-Mahdi Publisher: Dar Ihya al-Turath al-Arabi - Beirut Edition: First, 1420 AH Number of Parts: 5\n2. Tafsir Al-Qurtubi (1/39). Al-Jami' li-Ahkam al-Qur'an, Author: Abu Abdullah Muhammad bin Ahmad bin Abi Bakr bin Farah Al-Ansari Al-Khazraji Shams al-Din Al-Qurtubi (Died: 671 AH) Investigation: Ahmad Al-Barduni and Ibrahim Atfayish Publisher: Dar al-Kutub al-Masriyyah - Cairo Edition: Second, 1384 AH - 1964 AD Number of Parts: 20 parts (in 10 volumes).\n3. Extracted by Al-Bayhaqi in Shu'ab al-Iman: (3/346), and see: Tafsir Al-Qurtubi: (1/40).\n4. Akhlaq Ahl al-Qur'an by Al-Ajurri (p. 10) Akhlaq Ahl al-Qur'an Author: Abu Bakr Muhammad bin Al-Hussein bin Abdullah Al-Ajurri Al-Baghdadi (Died: 360 AH) Investigated and extracted its hadiths: Sheikh Muhammad Amr Abd al-Latif under the supervision of Al-Maktab Al-Salafi for Heritage Verification Publisher: Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon Edition: Third, 1424 AH - 2003 AD Number of Parts: 1, and see: Tafsir Al-Qurtubi (1/40).\n\n1. Extracted by Ibn Abi Hatim in his Tafsir: (18383) Tafsir Ibn Abi Hatim: Tafsir al-Qur'an al-Azim: Author: Abu Muhammad Abd al-Rahman bin Muhammad bin Idris bin Al-Mundhir Al-Tamimi, Al-Hanzali, Al-Razi Ibn Abi Hatim (Died: 327 AH) Investigator: As'ad Muhammad Al-Tayyib Publisher: Maktabat Nizar Mustafa Al-Baz - Kingdom of Saudi Arabia Edition: Third - 1419 AH, and see: Tafsir Al-Qurtubi: (15/249).\n2. Lisan Al-Arab, by Ibn Manzur (5/95). Lisan Al-Arab Author: Muhammad bin Mukarram bin Ali, Abu al-Fadl, Jamal al-Din Ibn Manzur Al-Ansari Al-Ruwayfi'i Al-Ifriqi (Died: 711 AH) Publisher: Dar Sader - Beirut Edition: Third - 1414 AH Number of Parts: 15.\n3. Al-Qaynat: with Fath on Qaf, and Sukun on Ya: meaning female singing slaves. See: Mirqat al-Mafatih Sharh Mishkat al-Masabih, by Al-Tabrizi, Book of Tribulations, Chapter on Signs of the Hour (1/78).\n\n1. Tafsir Ibn Kathir: (7/55-56), Tafsir Ibn Kathir: Tafsir al-Qur'an al-Azim Author: Abu al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Investigator: Sami bin Muhammad Salamah Publisher: Dar Taybah for Publishing and Distribution, 2nd ed., 1420 AH - 1999 AD, Number of Parts: 8. See also: Tafsir Al-Qurtubi (12/59).\n2. Mukhtasar Qiyam al-Layl, by Al-Marwazi, p (176) Mukhtasar Qiyam al-Layl wa Qiyam Ramadan wa Kitab al-Witr, Author: Abu Abdullah Muhammad bin Nasr bin Al-Hajjaj Al-Marwazi (Died: 294 AH) Abridged by: The Scholar Ahmad bin Ali Al-Maqrizi Publisher: Hadith Academy, Faisalabad - Pakistan Edition: First, 1408 AH - 1988 AD Number of Parts: 1, and Al-Zuhd by Ibn Al-Mubarak, p (274). Al-Zuhd wal-Riqaq by Ibn Al-Mubarak (followed by \"What Nu'aym bin Hammad narrated in his copy in addition to what Al-Marwazi narrated from Ibn Al-Mubarak in Kitab Al-Zuhd\") Author: Abu Abd al-Rahman Abdullah bin Al-Mubarak bin Wadih Al-Hanzali, Al-Turki then Al-Marwazi (Died: 181 AH) Investigator: Habib al-Rahman al-A'zami Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut Number of Parts: 1.\n\n1. Zad Al-Ma'ad, by Ibn Al-Qayyim (1/323).\n\nNone",
    "book_id": "937",
    "new_page_number": 18
  },
  {
    "serial_number": "1144769",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "who spoke Arabic (1), which it is not permissible to oppose or deviate from to another. People in this regard are between a rewarded doer of good and a sinner doing evil or one who is excused. Whoever is capable of correcting the words of Allah with the correct, eloquent Arabic pronunciation and deviates to the corrupt, foreign, or ugly Nabatean pronunciation, dispensing with himself, tyrannical with his opinion and guess, relying on what he is accustomed to from his memorization, and arrogant about returning to a scholar who would stop him at the correct pronunciation, is undoubtedly negligent, undoubtedly sinful, and undoubtedly cheating. (2).\nHowever, it must be observed that there should be no affectation (Takalluf) or arbitrariness (Ta'assuf) in reading, nor exaggeration in establishing the letters of the Qur'an, nor affectation and pedantry in pronouncing them. This affectation and pedantry was generally forbidden by the Infallible One, peace be upon him, who said: \"The extremists (Mutanatti'un) have perished,\" he said it three times. (3) The Mutanatti'un are: The deep divers, the exaggerators, those who exceed the limits in their words and deeds.\nThe scholar, Sheikh of Reciters and Literati, Abu al-Hasan Alam al-Din, Abu al-Hasan Ali bin Muhammad Al-Sakhawi (d. 643 AH), may Allah have mercy on him, said in the opening of his poem titled: ('Umdat al-Mufid wa 'Uddat al-Mujid fi Ma'rifat al-Tajweed) (4):\nO you who desire recitation of the Qur'an * And seek the goal of the Imams of mastery\nDo not deem Tajweed an excessive elongation * Or stretching what contains no stretch for a moment\nOr strengthening a Hamzah after a Mudd * Or chewing the letter like a drunkard\nOr uttering a Hamzah while retching * So its hearer flees from nausea\nThe letter has a balance, so do not be tyrannical * In it, nor be one who causes loss in the balance.\nThis affectation in establishing the letters of the Qur'an distracts from the highest goal and supreme demand for which the Qur'an was revealed, which is: pondering its verses, acting upon it, complying with its commands, refraining from its prohibitions, preserving its limits, and establishing them as Allah commanded therein.",
    "foot_note": "1. It is in the original like this \"The Prophetic Most Eloquent Presence\" (Al-Hadrah Al-Nabawiyyah Al-Afsahiyyah), and these are words that were not common in the speech of the Salaf, but rather are closer to the speech of the Sufis who believe in his presence, peace be upon him, in their gatherings. \"And (Dervishes) call the religious ceremonies they revive regularly, every Friday: the name (Hadras).\" See: Encyclopedia of Islam (15/140).\n2. Al-Nashr fi al-Qira'at al-Ashr (1/210-213). With slight adaptation. Al-Nashr fi al-Qira'at al-Ashr Author: Shams al-Din Abu al-Khair Ibn al-Jazari, Muhammad bin Muhammad bin Yusuf (Died: 833 AH) Investigator: Ali Muhammad Al-Dabba' (Died 1380 AH) Publisher: Al-Matba'ah Al-Tijariyyah Al-Kubra [Reprint Dar Al-Kitab Al-Ilmiyyah] Number of Parts: 2.\n3. Reported by Muslim (2670).\n4. 'Umdat al-Mufid has many manuscript copies, including: Al-Zahiriyyah copy 3 (83-85) Index of Al-Zahiriyyah 1/222-224, 7659 (45-47).",
    "book_id": "937",
    "new_page_number": 19
  },
  {
    "serial_number": "1144770",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "And Ibn al-Jazari, may Allah have mercy on him (d. 833 AH), said in his Muqaddimah (Introduction):\nPerfecting without any affectation * With gentleness in pronunciation without arbitrariness. (1)\n\nRequirement Two: Absence of affectation and arbitrariness when reading\nDescribing the correct reading, Makki bin Abi Talib Al-Qaisi (d. 437 AH), may Allah have mercy on him, says: The reader must be moderate in pronouncing it, and not be arbitrary in the intensity of bringing it out when he pronounces it, but bring it out with gentleness and kindness, because it is a letter whose exit is far, so pronouncing it is difficult due to its difficulty. (2)\nIbn al-Jazari, may Allah have mercy on him, says: Tajweed is not chewing the tongue, nor deepening the mouth, nor twisting the jaw, nor trembling the voice, nor stretching the emphasized (Mushaddad), nor cutting the Madd, nor buzzing the Ghunnahs, nor confining the Ra's; a reading that natures shy away from, and hearts and ears reject. Rather, it is the easy, sweet, pleasant, gentle reading, in which there is no chewing, no twisting, no arbitrariness, no affectation, no fabrication, no pedantry, and does not depart from the nature of the Arabs and the speech of the eloquent in any way of the readings and performance. For Tajweed is the ornament of recitation and the decoration of reading. It is giving the letters their rights and arranging their ranks, returning the letter to its exit and origin, attaching it to its like, correcting its pronunciation, and softening the utterance of it in the state of its form and perfection of its shape without excess, arbitrariness, exaggeration, or affectation...\nThen he, may Allah have mercy on him, also says: And this is the Sunnah of Allah, Blessed and Exalted, in whomever reads the Qur'an with Tajweed, corrected as revealed: ears delight in its recitation, and hearts humble when reading it, until it almost steals minds and takes hold of intellects; a secret from the secrets of Allah Almighty that He deposits in whom He wills of His creation. We have met among our sheikhs those who had no good voice or knowledge of melodies, except that they were good in performance, upright in wording, so when they read, they thrilled the hearing and captivated the hearts. People used to crowd over them and gather to meet them... while leaving groups of those with beautiful voices knowledgeable in Maqamat and melodies due to their departure from Tajweed",
    "foot_note": "1. Muqaddimah Ibn al-Jazari, Chapter on Tajweed, Verse No: (32).\n2. Al-Ri'ayah li-Tajweed al-Qira'ah wa Tahqiq Lafz al-Tilawah, by Makki bin Abi Talib Al-Qaisi (p. 145). Al-Ri'ayah li-Tajweed al-Qira'ah wa Tahqiq Lafz al-Tilawah: Author: Makki bin Abi Talib bin Hayyus bin Muhammad bin Mukhtar Al-Qaisi Al-Qayrawani then Al-Andalusi Al-Qurtubi - Investigation: Ahmad Hasan Farhat, Year of Publication: 2018 AD, Ed: 1, Publisher: Dar Ibn Kathir - Damascus - Syria, Number of Volumes: 1.",
    "book_id": "937",
    "new_page_number": 20
  },
  {
    "serial_number": "1144771",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "and mastery... As for today, this is a closed door and a blocked path. We ask Allah for success, and we seek refuge in Him from shortage of determination and the popularity of the market of ignorance among Arabs and non-Arabs. (1)\nIn a similar vein, Abu Shama Al-Maqdisi (d. 665 AH), may Allah have mercy on him, says: Most of those who seek the Mighty Qur'an have no concern left except for the strength of memorizing it, the speed of reciting it, the refining of pronouncing its words, the search for the exits of its letters, and the desire for a good voice in it. All of this, even if good, above it is what is more important, complete, worthy, and appropriate, which is understanding its meanings, reflecting upon it, acting according to its requirements, standing at its limits, and the fruit of fearing Allah Almighty from proper recitation. (2)\nIbn al-Jawzi (d. 597 AH) warns against this blameworthy affectation, describing the reading of some worshippers, saying, may Allah Almighty have mercy on him: Iblis has confused some worshippers regarding the exits of letters, so you see one saying: Al-Hamd, Al-Hamd. So he exits the canon of prayer etiquette by repeating the word. Sometimes he confuses him in achieving the Tashdid (emphasis), and sometimes in outputting the Dad of Al-Maghdub. I have seen someone saying Al-Maghdub and spitting comes out with the output of the Dad due to the strength of his emphasis. The intent is merely achieving the letter, but Iblis takes these people out by excess beyond the limit of achievement and distracts them with exaggeration in letters from understanding the recitation, and all these whispers are from Iblis. (3)\nThe Scholar Reciter Abu al-Hasan Ali bin Muhammad Al-Nouri Al-Sfaqisi, may Allah have mercy on him (d. 1118 AH), said: Those knowledgeable in the craft of Tajweed used to pronounce it fluently, easily, gently, without arbitrariness, affectation, or severe tone. No one is enabled to do that except through exercise and receiving that from the mouths of the people of knowledge in reading. (4)\nMentioning the categories of the deluded among the people of worship and action, Abu Hamid Al-Ghazali (d. 505 AH), may Allah have mercy on him, says: Another group: Whispers (Waswasah) overcome them in outputting the letters of Al-Fatihah and other Azkar (remembrances) from their exits. He keeps being cautious in Tashdids (emphases) and the difference between Dad and Za', and correcting the exits of letters in all his prayer, caring for nothing else, not thinking about anything else, oblivious to the meaning of the Qur'an and taking lessons from it and directing understanding to its secrets. This is one of the ugliest types of delusion, for creation was not tasked in reciting the Qur'an with achieving the exits of letters except according to what their custom in speech ran. The example of these is: the example of one who carried a message to the council of a Sultan and was ordered to deliver it properly, so he started delivering the message and being elegant in the exits of letters, repeating them and reiterating them time after time, while being heedless of the purpose of the message and observing the sanctity of the council. How deserving is he to have punishment executed upon him, be sent to the madhouse, and be judged as having lost his mind. (5)\nAl-Hafiz Al-Dhahabi (d. 748 AH), may Allah have mercy on him, said: The reciters who focus on Tajweed: have pedantry and excessive refinement that leads the reciting Mujawwid (one who does Tajweed) to remain focused on observing the letters and being pedantic in their Tajweed, such that it distracts him from pondering the meanings of the Book of Allah Almighty, diverts him from reverence in recitation, and leaves him self-righteous, scorning the memorizers of the Book of Allah Almighty. So he looks at them with an eye of loathing, thinking that Muslims make mistakes (Lahn), and that reciters do not memorize the anomalous (Shadh) readings. I wonder, what have you known and what have you done?! As for your knowledge, it is poor but valid, and as for your recitation, it is heavy, devoid of fear, sadness, and dread. So may Allah Almighty grant you success, show you your right path, and wake you from the sleep of ignorance and showing off. Opposite to them are the reciters of melodies and stretching. Among these, those who read with a heart and fear may provide benefit in general. I have seen among them those who read correctly",
    "foot_note": "1. See: Al-Nashr fi al-Qira'at al-Ashr (1/165), Al-La'ali' Al-Saniyyah Sharh Al-Muqaddimah Al-Jazariyyah (p. 69).\n2. Al-Murshid Al-Wajiz (p. 421). Al-Murshid Al-Wajiz ila 'Ulum Tata'allaq bi-l-Kitab al-Aziz Author: Abu al-Qasim Shihab al-Din Abd al-Rahman bin Ismail bin Ibrahim Al-Maqdisi Al-Dimashqi known as Abu Shama (Died: 665 AH) Investigator: Tayyar Altikulac, Publisher: Dar Sader - Beirut Year of Publication: 1395 AH - 1975 AD Number of Parts: 1.\n3. Talbis Iblis, by Ibn al-Jawzi (1/126). Talbis Iblis Author: Jamal al-Din Abu al-Faraj Abd al-Rahman bin Ali bin Muhammad Al-Jawzi (Died: 597 AH) Publisher: Dar Al-Fikr for Printing and Publishing, Beirut, Lebanon Edition: First Edition, 1421 AH/2001 AD Number of Parts: 1.\n4. Tanbih al-Ghafilin wa Irshad al-Jahilin, by Al-Sfaqisi (p. 47). Tanbih al-Ghafilin wa Irshad al-Jahilin 'amma Yaqa'u lahum min al-Khata' hal Tilawatihim li-Kitab Allah al-Mubin Author: Ali bin Muhammad bin Salim, Abu al-Hasan Al-Nouri Al-Sfaqisi (Died: 1118 AH) Investigator: Muhammad Al-Shadhili Al-Nayfar Publisher: Mu'assasat Abd al-Karim bin Abdullah Number of Parts: 1.\n5. Al-Ihya, Al-Ghazali, (3/510).",
    "book_id": "937",
    "new_page_number": 21
  },
  {
    "serial_number": "1144772",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "and thrill and make weep, and I have seen among them those who, when they read, harden hearts, annoy souls, and alter the speech of Allah. The worst of them in condition are the \"Funeral Reciters\" (Jana'iziyyah). (1)\nAs for reading with Narrations (Riwayat) and Combining (Jam'), it is the furthest thing from Khushu' (reverence) and the most intrusive thing upon recitation in a way that removes it from the intent. Their slogan is multiplying the faces of Hamzah, thickening those Lams, and thinning the Ra's. Read, O man, and spare us the thickening and thinning, excessive Imalah and Madds, and stops of Hamzah! How long will this go on?! Another one of them: If he attends a completion (Khatmah) or recites in a niche (Mihrab), his habit is bringing strange faces, silence (Sakt), and retching with Tashil (easing of Hamzah), bringing every disagreement and calling out about himself: \"I am Abu... know me, for I am knowledgeable in the Seven.\" What shall we do with you?! No, and may Allah not give you a good morning, you are a catapult stone and lead upon the hearts. (2).\n[Upon this meaning came the speech of others among the people of knowledge. Here is Imam Ibn al-Qayyim, may Allah have mercy on him, saying while mentioning the machinations of Satan against man: And among that: Whispers (Waswasah) in the exits of letters and pedantry in them... Whoever contemplates the guidance of the Messenger of Allah, peace be upon him, and his approval of the people of every tongue in their reading, it becomes clear to him that pedantry, tightening the jaw, and obsession in outputting letters is not from his Sunnah (3)]. [*]\n\nRequirement Three: Observing correctness of performance\nThe conclusion of this requirement belongs to the Basil of Performance, Sheikh Mahmoud Khalil Al-Husari (d. 1400 AH), where he says, may Allah have mercy on him, regarding the correctness of Tartil (measured recitation):\nTartil: It is improving its words, straightening its letters, and perfecting its performance, by giving every letter its right, and granting it its due of excellence and mastery, verification and goodness. This cannot happen except by correcting the output of every letter from its original exit specific to it, a correction that distinguishes it from what is close to it, and fulfilling every letter's attribute known to it, a fulfillment that distinguishes it from its genus, while easing pronunciation with its true attribute and Quranic form. And with care for clarifying letters, distinguishing some from others, showing Tashdids (emphases), achieving Hamzahs, fulfilling Ghunnahs, completing vowels, and performing each of Izhar, Idgham, Qalb, and Ikhfa' according to its reality reported from the Imams of the Qur'an. And with thickening what must be thickened of letters, thinning what must be thinned of them, shortening what should be shortened, and stretching what is designated to be stretched, and with observing the permissible stops and the prohibited ones; to stop on what is valid to stop on, and connect what is not valid to stop on.\nThen he warns against affectation and jaw-tightening, saying:\nprovided that all of this is without jaw-tightening or excess, nor fabrication or arbitrariness, nor exiting the path to the limit of excess which may",
    "foot_note": "1. Jana'iziyyah: attributed to funerals (Jana'iz). Perhaps he means the reciters who read Qur'an at funerals with forbidden melodies as previously explained, and Allah knows best.\n2. Bayan Zaghal al-Ilm bil-Talab, Al-Dhahabi, p (4-5), Al-Maqdisi edition, and see: Bida' al-Qurra' al-Qadimah wal-Mu'asirah, Bakr Abu Zaid (p. 24-25). Bida' al-Qurra' al-Qadimah wal-Mu'asirah, Author: Bakr bin Abdullah Abu Zaid, Publisher: Dar Al-Faruq, Year of Publication: 1410 - 1990, Ed: 1, Number of Volumes: 1.\n3. Ighathat al-Lahfan, Ibn al-Qayyim, (1/252, 254). Ighathat al-Lahfan min Masa'id al-Shaytan Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH) Investigator: Muhammad Hamid Al-Faqi Publisher: Maktabat Al-Ma'arif, Riyadh, Kingdom of Saudi Arabia Number of Parts: 2. See also: Bida' al-Qurra' al-Qadimah wal-Mu'asirah, Bakr Abu Zaid, p (10). For more, see: Bid'at al-Tanattu' bil-Qira'ah wal-Waswasah fi Makharij al-Huruf wal-Bu'd 'an al-Tadabbur wal-Ta'ammul, Muhammad bin Abdullah Al-Muqdi, Ihsan Center for Educational Consultations.\n[*] (Shamela Comment): What is between brackets is not in the printed version of the journal and is established in what was sent to us from the author - may Allah preserve him -",
    "book_id": "937",
    "new_page_number": 22
  },
  {
    "serial_number": "1144773",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "result in moving the silent letters (Sakin), generating letters, repeating Ra's, and buzzing Nuns by exaggerating Ghunnahs, and other things that sound nature shies away from and straight taste refuses.\nThen he warns the reader against haste and rushing in reading, and directs towards deliberation and tranquility, saying, may Allah have mercy on him:\nAnd provided that all of this - also - is with deliberation and tranquility, and distance from haste and rushing. This manner is the one in which the Holy Qur'an was revealed, and it is what is intended by Tartil which Allah commanded His Prophet Muhammad, peace be upon him, with in His saying: (And recite the Qur'an with measured recitation.) (Al-Muzzammil: 4). (1)\n\nRequirement Four: Reading with deliberation and tranquility\nThis control is of paramount importance to avoid any hidden error (Lahn Khafi), as many contemporary reciters have clear and obvious thefts (Ikhtilasat - stealing vowels) that appear to the people of verification and scrutiny from the Imams of performance and masters of recitation at first glance. This is often due to the dialect of the reciter and his upbringing, as local dialects of some countries and tribes are dominated by stealing some movements of letters as is known. The requirement from the reader of the Qur'an is reading with deliberation, tranquility, slowness, and slowness while taking care to clarify the letters, without haste that disrupts reading; as Allah Almighty said: (And recite the Qur'an with measured recitation.) (Al-Muzzammil: 4). Tartil, as is known, is clarifying the letters and showing them, and that cannot be except by outputting them from their exits.\nAl-Zajjaj (d. 311 AH), may Allah have mercy on him, said: Recite the Qur'an with Tartil, clarify it clearly. Clarification is not accomplished by rushing in the Qur'an; rather, it is accomplished by clarifying all letters and fulfilling their right of saturation. (2)\nIbn al-Jazari (d. 833 AH), may Allah have mercy on him, said: Tartil is a source from 'ratala fulan kalamahu'; if he followed parts of it with others with a pause... The author of Al-Ain said: \"Rataltu al-kalam: I was slow/deliberate in it. (3)\nThe ranks of reading, although some people of Tajweed said they are four ranks in terms of speed and slowness, namely: \"Tahqiq, Tadwir, Tartil, and Hadr\" (4), and some",
    "foot_note": "1. Ahkam Qira'at al-Qur'an al-Karim, by Sheikh Mahmoud Khalil Al-Husari (p. 389). Ahkam Qira'at al-Qur'an al-Karim - Mahmoud Khalil Al-Husari, died in the year 1401 AH, Investigation: Muhammad Talhah Bilal, Qur'an Memorization Group in Makkah Al-Mukarramah, First Edition 1416 AH - 1995 AD.\n2. See: Tafsir Al-Fakhr Al-Razi (16/107).\n3. Al-Tamhid, by Ibn Al-Jazari (1/59).\n4. Such as \"Al-Qastalani\" in Al-La'ali' Al-Saniyyah p. 52.",
    "book_id": "937",
    "new_page_number": 23
  },
  {
    "serial_number": "1144774",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "made them three: (Tartil, Tadwir, and Hadr) (1). The origin of the dispute between these sayings goes back to the rank of \"Tahqiq\". Some make it with Tartil one rank, like Al-Indarabi in \"Al-Idah\". Some make Tartil a characteristic of Tahqiq, like Al-Dani in \"Al-Tahdid\" (2). Some make it an independent rank, like Al-Qastalani in \"Al-La'ali' Al-Saniyyah\" (3). And some see that Tartil is the origin and the other ranks fall under it and emerge from it, so Tartil includes Tahqiq, Hadr, and Tadwir.\nIbn al-Jazari, may Allah have mercy on him, said in \"Al-Nashr\": The speech of Allah Almighty is read with Tahqiq, Hadr, and Tadwir - which is the intermediate between the two states - recited (Murattal) with Tajweed according to the dialects of the Arabs and their voices, and improving the pronunciation and voice as much as possible... Then he proceeded to speak about each rank separately until he said regarding Tahqiq: It is a type of Tartil... And he also said: So Tahqiq enters into Tartil as we presented, and Allah knows best. (4)\nThe conclusion is that everyone who reads with these three ranks is in reality reciting (Murattil) the Qur'an as Allah commanded, as long as he reads it as Allah commanded him with its rules that were taken orally and transmitted by Tawatur. He is in that complying with His saying: (And recite the Qur'an with measured recitation.) (Al-Muzzammil: 4). The other three ranks are where the reader reads with the rules of Tajweed, but they vary among themselves according to the state of the reader and the situation requiring speed or slowness in reading. The reader might be in a situation where he wants to speed up somewhat, like one who wants to review and adjust memorization for example, or be in Tahajjud prayer in Ramadan or otherwise, so he speeds up while giving letters their due right and entitlement. In another situation, he might want to slow down somewhat, like one who reads with contemplation and scrutiny of the meanings of the verses he recites. He might be in a position of teaching and dictation, so he needs to slow down reading more to clarify the attributes of letters, their exits, their vowels, and the rules of recitation to the learners clearly, so he reads with the rank of Tahqiq. Or the reader might want to read for himself, so he is slightly faster, and so on.",
    "foot_note": "1. Such as \"Al-Indarabi\" in Al-Idah p. 290.\n2. See: Al-Tahdid by Al-Dani p. 69. Al-Tahdid fi al-Itqan wal-Tajweed Author: Uthman bin Saeed bin Uthman bin Umar Abu Amr Al-Dani (Died: 444 AH) Investigator: Dr. Ghanim Qaddouri Hamad Publisher: Maktabat Dar Al-Anbar - Baghdad / University of Baghdad helped print it Edition: First 1407 AH - 1988 AD Number of Parts: 1.\n3. See: Al-La'ali' Al-Saniyyah by Al-Qastalani p. 52.\n4. Al-Nashr fi al-Qira'at al-Ashr, by Ibn al-Jazari (1/205).",
    "book_id": "937",
    "new_page_number": 24
  },
  {
    "serial_number": "1144775",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Abu Amr Al-Dani (d. 444 AH), may Allah have mercy on him, says in \"Al-Tahdid\": Tartil is for contemplation, thinking, and deduction; and Tahqiq is for exercising the tongues, thinning the thick words, establishing the reading, and giving every letter its due. (1)\nSo in all these ranks, the reader reads with deliberation, tranquility, whether he is fast, medium in his speed of recitation, or reading between that. This depends on the context in which he reads (2), as well as the skill of the reader, the exercise of his tongue, and his abundant training and practice with reading. In all those ranks, the reader must take care of the rules of Tajweed. Thus, the ranks of reading in this issue return to the legal interest of what the reader recites.\nIn a similar vein, Ibn al-Jazari - may Allah have mercy on him - says in \"Al-Nashr\": I do not know a reason for reaching the end of mastery and Tajweed, and arriving at the limit of correction and precision - like the exercise of tongues, and repetition of the utterance received from the mouth of the benefactor. (3)\nAs for equality and controlling the amounts of Madds, Ghunnahs, and observing the ranks of Tafkhim and Tarqiq etc., this is a matter that requires reception, adjustment, and presentation orally to the people of mastery among the Imams of recitation, with the obligation of caring for this aspect because, along with its status and value, it is also part of the ornament of recitation. Along with oral reception, there must be training, practice, and exercise until this aspect becomes a second nature in the reader's recitation.\n\nRequirement Five: The reciter's attention to Waqf (Stopping) and Ibtida' (Starting)\nThe science of Waqf and Ibtida' is one of the most glorious sciences of the Qur'an related to clarifying the facets of the meanings of the Qur'an. It is one of the most important sciences used to understand Allah's intent from His speech. There is no doubt that the reliance of the scholars of Waqf and Ibtida' in placing those known and observed signs in the Mushafs was built upon contemplation of the meanings of the Quranic verses, such that the reader stops and starts according to what is required by the meanings and words upon which it is good to stop or start with. There is no doubt that observing those signs and adhering to them is considered one of the greatest causes aiding the understanding of the speech of Allah and pondering His verses. Its reliance was taken from",
    "foot_note": "1. See: Al-Tahdid by Al-Dani, p. 72.\n2. Meaning teaching, or recitation for review to adjust memorization, or reading where one needs to speed up reading due to the large amount read such as in night prayer in Ramadan and otherwise - and similar contexts and states the reader encounters.\n3. Al-Nashr fi al-Qira'at al-Ashr, by Ibn al-Jazari (1/210-215).",
    "book_id": "937",
    "new_page_number": 25
  },
  {
    "serial_number": "1144776",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "the transmitted (Manqul) and the rational (Ma'qul). In a similar vein, Alam al-Din Al-Sakhawi, may Allah have mercy on him, says: In the knowledge of Waqf and Ibtida' which the scholars recorded is the clarification of the meanings of the Mighty Qur'an, definition of its purposes, and manifestation of its benefits; and by it, diving for its pearls and unique gems is made possible. (1)\nIbn Al-Nakzawi (2) said: The chapter of Waqf is of great destiny, grave importance; because it is not possible for anyone to know the meanings of the Qur'an nor deduce legal evidences from it except by knowing the separators... (3)\nIbn Al-Anbari (d. 926 AH), may Allah have mercy on him, said: Part of the completeness of knowing the Qur'an is knowing Waqf and Ibtida'; for it is not possible for anyone to know the meanings of the Qur'an except by knowing the separators. This is the most indicative proof of the obligation of learning and teaching it. (4)\nThis science is a precise and delicate science; few master it and rarely does anyone do it well. Often you hear from some reciters an ugly stop contradicting the intended meaning, disturbing your hearing and saddening your heart. Therefore, the reader of the Qur'an should care about controlling the general rules of Waqf and Ibtida' and pay attention to their precise places, because of the generation of correct meanings resulting from that, for which the signs of Waqf and Ibtida' were placed in the Mushafs. (5)",
    "foot_note": "1. Jamal al-Qurra' (p. 553). Jamal al-Qurra' wa Kamal al-Iqra' Author: Ali bin Muhammad bin Abd al-Samad al-Hamadani al-Masri al-Shafi'i, Abu al-Hasan, Alam al-Din Al-Sakhawi (Died: 643 AH) Investigation: Dr. Marwan Al-Attiyah - Dr. Muhsin Kharabah Publisher: Dar Al-Ma'mun for Heritage - Damascus - Beirut Edition: First 1418 AH - 1997 AD Number of Parts: 1.\n2. Mu'in al-Din Abu Muhammad Abdullah bin Muhammad bin Abdullah bin Umar bin Abi Zaid Al-Ansari Al-Madani originally then Al-Iskandarani Al-Masri, known as Al-Nakzawi (612-683 AH). See: Ghayat al-Nihayah 1: 452 and Husn al-Muhadarah 1: 288, and see his biography in: Al-A'lam by Al-Zirikli.\n3. See: Al-Itqan, by Al-Suyuti: (1/230). Al-Itqan fi 'Ulum al-Qur'an Author: Abd al-Rahman bin Abi Bakr, Jalal al-Din Al-Suyuti (Died: 911 AH) Investigator: Muhammad Abu al-Fadl Ibrahim Publisher: The Egyptian General Book Organization Edition: 1394 AH/1974 AD Number of Parts: 4.\n4. Manar al-Huda fi Bayan al-Waqf wal-Ibtida' (1/13). Manar al-Huda fi Bayan al-Waqf wal-Ibtida' wa ma'ahu Al-Maqsad li-Talkhis ma fi Al-Murshid Author of Manar al-Huda: Ahmad bin Abd al-Karim bin Muhammad bin Abd al-Karim Al-Ashmuni Al-Masri Al-Shafi'i (Died: around 1100 AH) Author of Al-Maqsad li-Talkhis ma fi Al-Murshid: Zakariya bin Muhammad bin Ahmad bin Zakariya Al-Ansari, Zain al-Din Abu Yahya Al-Sunaiki (Died: 926 AH) Investigator: Sharif Abu al-Ala Al-Adawi Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut Edition: First, 1422 AH - 2002 AD Number of Parts: 1.\n5. This speech was not written by the pen of the researcher, so he transferred it like this, and did not find an attribution for it, and thus the note was made.",
    "book_id": "937",
    "new_page_number": 26
  },
  {
    "serial_number": "1144777",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Requirement Six: The quality of mastery of the science of Waqf and Ibtida'\nDue to the status and value of the science of Waqf and Ibtida', the Imams of performance mentioned a collection of sciences that must be realized in one who undertakes it completely, leads in it, and masters it with perfection and excellence. Abu Bakr bin Mujahid Al-Tamimi (d. 324 AH), may Allah have mercy on him, said: No one performs it completely except a grammarian, knowledgeable in Qira'at (readings), knowledgeable in Tafsir (interpretation), knowledgeable in stories and summarizing some from others, knowledgeable in the language in which the Qur'an was revealed. (1)\n\nRequirement Seven: The importance of observing Waqf and Ibtida'\nEvidences have combined regarding the importance of observing Waqf and Ibtida'; and quotations indicating the care of the predecessors of the Ummah (Salaf) for this majestic science and its practical application when reciting the Qur'an have abounded. Allah Almighty said: {And recite the Qur'an with measured recitation.} (Al-Muzzammil: 4). This is a command from Allah Almighty to recite the Qur'an with Tartil, and a recommendation from Him, Glory be to Him, to the servants to recite His revealed speech; and observing stops is undoubtedly implicitly included in that.\nIbn Abbas (d. 68 AH), may Allah be pleased with them both, said regarding His saying: {And recite the Qur'an with measured recitation}: (Clarify it clearly) (2). Al-Hasan said: Read it a clear reading. Mujahid said: Some of it following some with deliberation. He also said: (Proceed in it deliberately) (3). Ibn Kathir, may Allah have mercy on him, said: Read it a reading with slowness, for it aids in understanding the Qur'an and pondering it. (4)\nAnd Allah Almighty said: {The Most Merciful. Taught the Qur'an. Created man, [and] taught him eloquence (Al-Bayan).} (Ar-Rahman: 1-4). Ibn Al-Nahhas (d. 338 AH), may Allah have mercy on him, said: Part of Al-Bayan (clarification) is distinguishing letters and stopping",
    "foot_note": "1. Al-Qat' wal-Isti'naf. (p. 94).\n2. Reported by Ahmad bin Mani' in his Musnad as in Al-Matalib Al-Aliyah bi-Zawa'id Al-Masanid Al-Thamaniyah by Al-Hafiz Ibn Hajar, the attributed copy (4/3777) and Mukhtasar Ithaf Al-Maharah bi-Zawa'id Al-Masanid Al-Ashrah by Al-Busiri (8/6590) and reported by Al-Tabari in Jami' al-Bayan (12/1/127) and Ibn Al-Nahhas in Al-Qat' (1/74) and see: Al-Durr Al-Manthur fi Al-Tafsir bi-l-Ma'thur (6/277).\n3. Musannaf Abd al-Razzaq (2/490) and Musannaf Ibn Abi Shaybah (10/525), Jami' al-Bayan (12/1/127) and Al-Tamhid fi Ma'rifat al-Tajweed by Abu al-Ala al-Hamadhani: (141) and Al-Durr Al-Manthur: (6/277).\n4. Tafsir Ibn Kathir (4/363). And it was said: Ali, may Allah be pleased with him, was asked about this verse, so he said: Tartil is Tajweed of the letters and knowing the stops\" Al-Nashr (298) (1, 316) and I (Al-Maymuni) did not find it in the Tafsirs that care for narrations. It was narrated by Al-Hudhali in Al-Kamil folio (34) (manuscript). See Al-Waqf wal-Ibtida' by Al-Ghazal Al-Naysaburi (1/6) PhD thesis investigation by Dr. Al-Uthman supervision of Sheikh Muhammad Muhammad Salim Muhaisin.",
    "book_id": "937",
    "new_page_number": 27
  },
  {
    "serial_number": "1144778",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "on what its meaning is complete thereof. (1)\nIbn Al-Nahhas, Abu Amr Al-Dani, and others have narrated the consensus of scholars on the importance of observing Waqf and Ibtida' (2). They cited as evidence for that the saying of Abdullah bin Umar, may Allah be pleased with them both: We lived for a period of our time... Then he said: I have seen men, one of whom is given the Qur'an and reads what is between its Opening to its end, not knowing its command nor its deterrent, nor what should be stopped at in it; he scatters it like the scattering of bad dates (Daqal) (3).. (4)\nThis narration shows the status of Waqf and Ibtida' among the Companions, may Allah be pleased with them, and the extent of their care for it in the manner they received from the Messenger of Allah, peace be upon him, and that their care for it was like their care for knowing the meanings of the Holy Qur'an and understanding its lawful and prohibited matters. Ibn Umar, may Allah be pleased with them both, likened the lack of care for reading to the scattering of Daqal, which is bad, dry dates.\n\nRequirement Eight: The Salaf's care for Waqf and Ibtida'\nThe care of the Salaf (Predecessors), may Allah have mercy on them, for this science became famous to the point that Ibn al-Jazari counted it as Mutawatir (consecutive) from them... Ibn al-Jazari, may Allah have mercy on him, said: Its learning and care for it from the Salaf is authentic, rather Mutawatir with us... until he said: ...and their speech regarding that is known and their texts on it are famous in books. Hence, many of the later Imams stipulated on the licenser (Mujiz) not to license anyone except after his knowledge of Waqf and Ibtida'. Our Imams used to stop us at every letter and point out to us with fingers, a Sunnah for that which they took from their early sheikhs. (5). They used to care for that during recitation teaching.\nScholars have urged learning Waqf and Ibtida' and acting upon it, and explained its great virtue. This is mentioned in the introductions of many books of Waqf and Ibtida', and in many books of the art of Tajweed, and included in books of Quranic sciences. Among what they wrote regarding that is the saying of Ibn Al-Anbari - may Allah have mercy on him -: Part of the completeness of knowing the Qur'an, its meanings, and its strange words is knowing Waqf and Ibtida' in it. So the reader should know the Complete Stop (Tam), the Sufficient Stop (Kafi) which is not complete, and the",
    "foot_note": "1. Al-Qat' by Ibn Al-Nahhas (1/74). Al-Qat' wal-I'tinaf Author: Abu Ja'far Ahmad bin Muhammad bin Ismail Al-Nahhas Investigator: Dr. Abd al-Rahman bin Ibrahim Al-Matroudi Publisher: Dar Alam Al-Kutub - Kingdom of Saudi Arabia Edition: First, 1413 AH - 1992 AD.\n2. Al-Qat' (1/87), Al-Katfi (135) and Al-Nashr (1/225).\n3. With Fath on the un-dotted Dal followed by Fath on Qaf: It is bad, dry dates and what has no specific name. It is said: It is the worst dates. Gharib al-Hadith by Ibrahim al-Harbi (2/889) and Al-Nihayah by Ibn al-Athir (2/172).\n4. Reported by Al-Tahawi in Sharh Mushkil al-Athar (4/84), reported by Al-Hakim in Al-Mustadrak (1/35), and he said: This is an authentic hadith according to the conditions of the two Sheikhs, and I do not know any defect in it, and Al-Dhahabi agreed with him. Ibn Mandah authenticated it in \"Al-Iman\" (106), and Al-Haythami in \"Majma' al-Zawa'id\" (1/170).\n5. Al-Nashr (255/1).",
    "book_id": "937",
    "new_page_number": 28
  },
  {
    "serial_number": "1144779",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Ugly Stop (Qabih) which is neither complete nor sufficient (1). Al-Hudhali (d. 167 AH) said in his Kamil: Stopping is the ornament of recitation, the decoration of the reciter, the communication of the reader, the understanding of the listener, and the pride of the scholar. By it, the difference between two differing meanings, two conflicting opposites, and two varying rulings is known. (2)\nAbu Bakr Al-Anbari (d. 328 AH) said: And part of the completeness of knowing the grammatical analysis of the Qur'an, its meanings, and its strange words is knowing Waqf and Ibtida' in it. (3)\n\nSection Four: Reading with Khushu' (humility), Takhashu' (submission), and presence of heart\nIt has two requirements:\n\nRequirement One: The concept of Khushu' linguistically and legally (Shar'an)\nA - Khushu' Linguistically:\nIbn Faris (d. 395 AH), may Allah have mercy on him, said: Khasha'a: The Kha, Shin, and Ayn are one root indicating lowering. It is said: Khasha'a (he humbled) if he lowered and bowed his head. He Yakhsha'u Khushu'an. It is close in meaning to Khudu' (submission), except that Khudu' is in the body... and Khushu' is in the voice and sight. Allah Almighty said: (Their eyes humbled) (Ta-Ha: 108). Ibn Duraid said: The Khashi' (humble one): The submissive and bowing one. (4)\nAl-Fairuzabadi (d. 817 AH), may Allah have mercy on him, said: Khushu': Khudu', like Ikhtisha' - and the verb is like Mana'a - or it is close to Khudu', or it is in the body and Khushu' is in the voice and sight. Khushu': Stillness and self-abasement. (5)\nKhushu': Submission, stillness, and self-abasement. The verb from it is: Khasha'a; it is said: The person humbled to his Lord: meaning he submitted, became submissive, implored, and abased himself. Khushu' can be in the body, or the voice,",
    "foot_note": "1. Al-Idah fi al-Waqf wal-Ibtida' (1/108). Al-Idah fi al-Waqf wal-Ibtida': by Ibn Al-Anbari, Damascus ed. 1390 AH - 1971 AD, investigation by Muhyi al-Din Abd al-Rahman Ramadan, publications of the Arabic Language Academy. See also: Kitab Fadl 'Ilm al-Waqf wal-Ibtida' wa Hukm al-Waqf 'ala Ru'us al-Ayat, Abdullah Al-Maymuni (p. 17).\n2. Al-Qawl al-Mufid by Sheikh Muhammad Makki Nasr, p. 195 Al-Maktabah Al-Ilmiyyah Lahore India (n.d).\n3. Idah al-Waqf wal-Ibtida' fi Kitab Allah Azz wa Jall, (1/108).\n4. Mu'jam Maqayis al-Lughah by Abu al-Hussein Ahmad bin Faris, died 395 AH, investigation by Shihab al-Din Abu Amr, Dar Al-Fikr, Beirut, First Edition 1415 AH, Book of Kha, Chapter of Kha and Shin..., p. 316.\n5. Al-Qamus Al-Muhit, by Muhammad bin Yaqub Al-Fairuzabadi, d. 817 AH, Chapter of Ayn, Section of Kha, p. 921. Al-Qamus Al-Muhit, Author: The Linguist Scholar Majd al-Din Muhammad bin Yaqub Al-Fairuzabadi died 817 AH, Investigation: Heritage Investigation Office at Mu'assasat al-Risalah, under supervision of: Muhammad Na'im Al-Arqsus, Publisher: Mu'assasat al-Risalah for Printing, Publishing and Distribution, Beirut - Lebanon, Edition: Eighth, 1426 AH - 2005 AD, Number of Parts 1.",
    "book_id": "937",
    "new_page_number": 29
  },
  {
    "serial_number": "1144780",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "or sight. (1)\nAbu Al-Sa'adat Ibn Al-Athir (d. 606 AH), may Allah have mercy on him, said: Khushu' in voice and sight is like Khudu' in the body. (2)\nIbn al-Qayyim, may Allah have mercy on him, said: Khushu' in the origin of the language: Lowliness, abasement, and stillness. Allah Almighty said: (And voices will be humbled [Khasha'at] for the Most Merciful, so you will not hear except a whisper.) (Ta-Ha: 108) meaning they became still, abased, and submissive. From it is the description of the earth as having Khushu', which is its dryness, lowness, and lack of elevation with irrigation and vegetation. Allah Almighty said: (And of His signs is that you see the earth stilled [Khashi'ah], but when We send down upon it rain, it quivers and swells. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.) (Fussilat: 39). (3)\nB - Khushu' Legally (Shar'an):\nKhushu' in the Sharia is: The submission of the heart and its abasement to Allah - Glory be to Him - as defined by Imam Ibn al-Qayyim, may Allah have mercy on him. It was said that it is: Acceptance and compliance with truth and correctness without any prevention, even if the truth differs with desire and wish. Ibn Rajab Al-Hanbali added in defining Khushu' that it is: Softness of the heart with tenderness, brokenness, and burning. It should be noted that Khushu' is in the heart, with the manifestation of its effects on the limbs. (4) Among the places where it is appropriate for a Muslim to have Khushu' is during his recitation of the verses of the Holy Qur'an; whether in prayer or outside it, except that in prayer it is more emphasized. (5)\nIbn al-Qayyim, may Allah have mercy on him, said: The knowers agreed that the locus of Khushu' is the heart, and its fruit is on the limbs, and they display it. (6)\nIbn Rajab Al-Hanbali (d. 695 AH), may Allah have mercy on him, said: The origin of Khushu' is: the heart's tenderness, softness, stillness, submission, brokenness, and burning. If the heart humbles, the humility of all limbs and organs follows it; because they are followers of it, as the Prophet, peace be upon him, said: \"...Unquestionably, in the body there is a lump of flesh; if it is sound, the whole body is sound, and if it is corrupt, the whole body is corrupt. Unquestionably, it is the heart.\" (7).\nAnd Takhashu': Feigning Khushu'. (8).\n\nRequirement Two: How the servant benefits from the Qur'an\nIbn al-Qayyim, may Allah have mercy on him, said in the book \"Al-Fawa'id\":\nA Grand Rule: If you want to benefit from the Qur'an, gather your heart when reciting and listening to it, cast your hearing, and be present like one who is addressed by it from the One who spoke it, Glory be to Him, from Him to you. For it is a speech from Him to you upon the tongue of His Messenger. Allah Almighty said: (Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].) (Qaf: 37). And that is because the perfection of the effect, since it is dependent on an influencing agent, a receptive locus, a condition for the occurrence of the effect, and the absence of",
    "foot_note": "1. Definition and meaning of Khasha'a in Mu'jam al-Ma'ani al-Jami' - Arabic Dictionary, with adaptation.\n2. Al-Nihayah fi Gharib al-Hadith wal-Athar, Chapter of Kha with Shin (2/34).\n3. Madarij al-Salikin, by Ibn Al-Qayyim (1/520). Madarij al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH) Investigator: Muhammad Al-Mu'tasim Billah Al-Baghdadi Publisher: Dar Al-Kitab Al-Arabi - Beirut Edition: Third, 1416 AH - 1996 AD Number of Parts: 2.\n4. Dr. Muhammad Al-Sabbagh (1999 AD), Al-Khushu' fi Al-Salah (Third Edition), Saudi Arabia: Maktabat Al-Warraq: (n.d), page 12-16.\n5. Salat al-Mu'min - Mafhum, wa Fada'il, wa Adab, wa Anwa', wa Ahkam, wa Kayfiyatuha fi Daw' al-Kitab wal-Sunnah (Fourth Edition), Author: Dr. Saeed bin Wahf Al-Qahtani: (1/310). With adaptation.\n6. Madarij al-Salikin, by Ibn Al-Qayyim (1/521).\n7. Agreed upon: Al-Bukhari, Book of Faith, Chapter on Merit of whoever clears himself for his religion, No. 52, and Muslim, Book of Musaqah and Muzara'ah, No. 1599.\n8. Mukhtar al-Sahah by Al-Razi, Entry: (Khasha'a) (p. 74).",
    "book_id": "937",
    "new_page_number": 30
  },
  {
    "serial_number": "1144781",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "the barrier that prevents it; the verse included the clarification of all that in the briefest, clearest, and most indicative wording of the intent. His saying {Indeed in that is a reminder} pointed to what preceded from the beginning of the Surah to here, and this is the Influencer. And His saying {for whoever has a heart}: this is the Receptive Locus, and what is meant by it is the living heart that understands from Allah, as Allah Almighty said {It is not but a reminder and a clear Qur'an * To warn whoever is alive} meaning alive of heart. And His saying {or who listens} meaning directed his hearing and inclined the sense of his hearing to what is said to him, and this is the Condition of being affected by speech. And His saying {while he is present [in mind]} meaning a witnessing heart, present not absent. Ibn Qutaybah Al-Dinawari (d. 276 AH), may Allah have mercy on him, said: Listen to the Book of Allah while being a witness of heart and understanding, not heedless or forgetful. And it is an indication of the Barrier from the occurrence of the effect, which is the heart's distraction and absence from understanding what is said to it, looking into it, and pondering it. So if the Influencer exists, which is the Qur'an, and the Receptive Locus, which is the living heart, and the Condition is found, which is Listening, and the Barrier is absent, which is the preoccupation of the heart and its oblivion from the meaning of the address and its turning away from it to something else; the Effect occurs, which is benefitting and remembering. (1)\n\nSection Six: Improving the voice in recitation\nIt has three requirements:\n\nRequirement One: The description of improving the voice in recitation\nThe Qur'an is the speech of Allah, He revealed it to the heart of His Noble Messenger, peace be upon him; to recite it to the people with delay (Mukth); as our Lord said: {And [it is] a Qur'an which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively.} (Al-Isra: 106), and his Lord said to him: (And recite the Qur'an with measured recitation.) (Al-Muzzammil: 4).\nAl-Qurtubi (d. 671 AH), may Allah have mercy on him, said in his Tafsir: Tartil is arranging, coordinating, and good organization. From it is a well-arranged (Ratil/Ratal) mouth (teeth), with Kasra and Fatha on the Ayn: if it is well-arranged. (2)\nWhen the Qur'an is recited, the ears of the believers listen to it, so their hearts submit to it and humble, and their souls guide themselves to its commands and submit, especially if its recitation is from a good voice reciting its verses with Tartil and humility. The texts of the Sunnah have indicated the encouragement of improving the voice in reading the Holy Qur'an. Whoever improves his voice with the Qur'an without affectation or arbitrariness in compliance with the command of the purified Sharia, then excellent is what he did, and he has followed and complied. The Two Sheikhs (Bukhari and Muslim) narrated from the hadith of Abu",
    "foot_note": "1. Al-Fawa'id, by Ibn Al-Qayyim: (p. 3).\n2. Tafsir Al-Qurtubi: (19/37).",
    "book_id": "937",
    "new_page_number": 31
  },
  {
    "serial_number": "1144782",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "Huraira, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"Allah has not listened to anything as He listens to a Prophet with a good voice chanting (Yataghanna) the Qur'an, reciting it aloud.\" (1).\nSheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: Its interpretation - Taghanni - according to the majority like Al-Shafi'i, Ahmad bin Hanbal, and others is improving the voice with it. (2)\nSo the intended meaning of Taghanni is improving the voice with the Qur'an. Taghanni with the Qur'an is by reciting it aloud with improving the voice with it and having Khushu' in it; to move hearts with it; because among the purposes of reading the Qur'an is moving hearts with it so they are affected, humble, and submit to their Creator; thus benefiting from the Qur'an and its guidance. The meaning of his saying: \"Allah has not listened (Ma adhina Allah)\"; implies: Allah has not listened (Ma istama'a Allah); and listening here is listening in reality befitting the Essence of Allah Almighty, and it is a listening that does not resemble the listening of created beings, just like all other attributes of the Lord, Glory be to Him - it is said regarding His listening, Glory be to Him, and His permission (Idhn) just as it is said regarding His other attributes, Glory be to Him, and the affirmation of all attributes of the Lord, Glory be to Him, is in the manner befitting Him, Glory be to Him, as our Lord said: (There is nothing like unto Him, and He is the Hearing, the Seeing) (Ash-Shura: 11).\nAbu Dawud narrated from the hadith of Abu Lubabah, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"He who does not chant (Yataghanna) the Qur'an is not one of us\" (3). And \"whoever does not chant\" is whoever does not improve his voice. (4)\nAl-Tabari (d. 310 AH), may Allah have mercy on him, said: What is known in the speech of the Arabs is that Taghanni is indeed singing (Ghina) which is good voice with modulation (Tarji'). (5)\nAl-Nawawi (d. 676 AH), may Allah have mercy on him, said: Know that groups of the Salaf used to ask those with good voices in reading to read while they listened. This is agreed upon as desirable, and it is the habit of the righteous, the worshippers, and the righteous servants of Allah. It is an established Sunnah from the Messenger of Allah, peace be upon him. It is authentically reported from Abdullah bin Mas'ud, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said to me: 'Recite the Qur'an to me.' I said: 'O Messenger of Allah, should I read to you while it was revealed to you?' He said: 'I love to hear it from someone else.' So I read Surat An-Nisa to him until I reached this verse (So how [will it be] when We bring from every nation a witness and we bring you against these [people] as a witness?) (An-Nisa: 41). He said: 'Enough for now.' I turned to him and behold, his eyes were shedding tears. (6)\nAl-Hakim also narrated from the hadith of Al-Bara' bin",
    "foot_note": "1. Reported by Al-Bukhari (5023), Muslim (Vol 1 Hadith 233).\n2. See: Jami' al-Masa'il by Ibn Taymiyyah (3/304)\n3. Authenticated by Al-Albani in Sahih Abu Dawud (Vol 1 Hadith 1305).\n4. This is the opinion of the majority, narrated by Al-Nawawi in Al-Tibyan (1/110).\n5. Sharh Al-Bukhari by Ibn Battal (1/261).\n6. Al-Bukhari (4582), Al-Tibyan (114)",
    "book_id": "937",
    "new_page_number": 32
  },
  {
    "serial_number": "1144783",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Azib that the Messenger of Allah, peace be upon him, said: \"Adorn the Qur'an with your voices, for the good voice increases the Qur'an in beauty.\" (1). And in a narration \"Good voice is the ornament of the Qur'an.\" (2)\n\nRequirement Two: The correct concept of the Psalms of the Family of David (Mazamir Al Dawud)\nIt is established in the Two Sahihs that the Prophet, peace be upon him, heard the voice of Abu Musa Al-Ash'ari - may Allah be pleased with him - reading at night, so he stopped and listened to his reading, then said: \"He has been given a Mizar (Flute/Psalm) of the Mazamir (Psalms) of the family of David\" (3). In a narration, the Messenger of Allah, peace be upon him, said to Abu Musa: \"If you could have seen me while I was listening to your reading last night! You have been given a Mizmar of the Mazamir of the family of David\" (4). Abu Musa said: \"If I knew, O Messenger of Allah, that you were listening to me, I would have adorned it for you greatly (Habbartuhu Tahbira).\" (5)\nRegarding his saying: \"a Mizmar of the Mazamir of the family of David\": Al-Nawawi - may Allah have mercy on him - said: The scholars said: The intent by Mizmar here is the good voice. The origin of Zamr is singing. The family of David is David himself, and the family of so-and-so may be applied to the person himself. David, peace be upon him, had a very good voice.\" (6)\nWhat supports Al-Nawawi's speech and confirms that the intent by Mizmar here is the good voice, not melodies, is his saying - peace be upon him - to Abu Musa (You have been given) - in the passive voice - indicating that the One who granted him the good voice is Allah Almighty, and that he did not acquire it through learning, practice, and exercise.\nIbn Al-Athir - may Allah have mercy on him - said in \"Al-Nihayah\": In the hadith of Abu Musa, the Prophet, peace be upon him, heard him reading and said: (You have been given a Mizmar of the Mazamir of the family of David). He likened the beauty of his voice and sweetness of his tone to the sound of the Mizmar. David is the Prophet - peace be upon him - and to him belongs the utmost in good voice in reading. (7)\nIbn Khaldun (d. 1332 AH), may Allah have mercy on him, said: As for his saying - peace be upon him (You have been given a Mizmar of the Mazamir of the family of David), it does not mean repetition and composing melodies (Talhin), rather it means good voice, performance of reading, and clarity in the exits of letters and pronouncing them. (8)",
    "foot_note": "1. Reported by Al-Hakim in Al-Mustadrak (2125), and Al-Darimi (3501), and authenticated by Al-Albani in Sahih Al-Jami' (Vol 1 Hadith 3581), and in Mishkat al-Masabih (2208).\n2. Reported by Al-Tabarani in Al-Kabir (9881), and graded Hasan by Al-Albani in Sahih Al-Jami' (3144).\n3. Extracted by Al-Bukhari in his Sahih, Book (Virtues of the Qur'an), Chapter (Good Voice in Reading the Qur'an) No: 4660, and Muslim in his Sahih, Book (Prayer of Travelers and its Shortening) Chapter on Desirability of improving the voice with the Qur'an No: 1322.\n4. Sahih Muslim Book of Prayer of Travelers, Hadith No 793.\n5. See: Fath Al-Bari (14/272)\n6. Sharh Al-Nawawi on Sahih Muslim Vol 3 p 146\n7. Al-Nihayah, by Ibn Al-Athir (2/778).\n8. Tarikh Ibn Khaldun (1/426).",
    "book_id": "937",
    "new_page_number": 33
  },
  {
    "serial_number": "1144784",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "And Abu Musa's saying \"I would have adorned it for you greatly\" means I would have made it into beautiful types for you, which is Talhin (melodizing), taken from the adorned garment (Thawb Muhabbar), which is striped with colors. Hearts humble to the beautiful voice just as they submit to the beautiful face. What the hearts are affected by in piety is greater in reward and closer to the softening of hearts and removal of hardness from them. Beautiful voices are a blessing from Allah Almighty, an increase in creation, and a favor. The most deserving thing to be clothed in this precious suit and generous gift is the Book of Allah; for the blessings of Allah, if spent in obedience, the right of the blessing has been fulfilled. (1)\nOur Eminence Sheikh Imam Ibn Baz (d. 1421 AH), may Allah have mercy on him, says: The Prophet, peace be upon him, did not deny that from him; this indicates that adorning the voice, improving the voice, and caring for the Qur'an is a required matter; so that the reader and the listener may humble, and this one and that one may benefit. (2).\n\nRequirement Three: Improving the voice does not contradict sincerity\nRegarding this, Imam Abu Bakr Al-Ajurri (d. 360 AH), may Allah have mercy on him, says: It behooves him whom Allah has granted a good voice with the Qur'an to know that Allah has singled him out with a great good; so let him know the value of what Allah has singled him out with, and let him read for Allah, not for creatures. Let him beware of inclining towards being listened to in order to gain favor with listeners out of desire for the world, and inclining towards good praise and status with the sons of the world, and gifts from kings, rather than gifts from common people. Whoever's soul inclines to what I have forbidden him from: I fear that his good voice will be a trial (Fitnah) for him. His good voice only benefits him if he fears Allah Almighty in secret and public, and his intention is that the Qur'an be heard from him so that the heedless wake up from their heedlessness, desire what Allah Almighty encouraged them in, and refrain from what He forbade them. Whoever has this attribute benefits from his good voice, and people benefit from him. (3)\n\nSection Seven: Resolving the dispute between Taghanni and \"Musical Maqamat\"\nIt has nine requirements:\n\nRequirement One: The concept of the meaning of Tarannum (Humming/Chanting)\nThe researcher clarifies here the reality of Taghanni with the Qur'an mandated by Sharia and reading with \"Musical Maqamat,\" which some call \"Sound Maqamat\" escaping from",
    "foot_note": "1. Ahkam al-Qur'an, by Ibn Al-Arabi Al-Maliki (4/1595)\n2. Published in the book (Fatawa Islamiyah), collected and arranged by Sheikh/ Muhammad Al-Musnad, Vol 4, p: 18. (Majmu' Fatawa wa Maqalat Sheikh Ibn Baz 24/378). Majmu' Fatawa Al-Allamah Abd al-Aziz bin Baz, may Allah have mercy on him Author: Abd al-Aziz bin Abdullah bin Baz (Died: 1420 AH) Supervised collection and printing: Muhammad bin Sa'd Al-Shuway'ir Number of Parts: 30 parts.\n3. Akhlaq Ahl al-Qur'an, by Al-Ajurri (p 161).",
    "book_id": "937",
    "new_page_number": 34
  },
  {
    "serial_number": "1144785",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "its original name, along with clarifying and illuminating the difference between them. Naming it by other than its name comes from the door of overturning facts to promote falsehood, so that it becomes palatable for the recipient to accept and appreciate it, not magnifying its prohibition, due to what those names - which \"overturn facts\" from their origin to a palatable mold \"verbally\" - impart of glittering names, to belittle its atrocity, rudeness, and the severity of its ugliness and prohibition. Satan had the lead in this track, because he was the first to enact that bad sunnah which overturns established facts by changing their implications with other words - out of cunning, deception, lying, and fraud - so that his allies receive and snatch them from him, and inspire one another with decorative speech in delusion, as our Lord said: (And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and that which they invent.) (Az-Zukhruf: 12). Among the most obvious examples is his overturning of the reality of the tree which Allah forbade the two parents from approaching, so he named it with other than its name; he named it the \"Tree of Eternity and a kingdom that does not fade.\"\nIbn al-Qayyim - may Allah have mercy on him in Ighathat al-Lahfan - said: The enemy of Allah only lied to them, deceived them, and tricked them; by naming that tree the \"Tree of Eternity\". This is the first cunning and plotting, and from it his followers inherited naming forbidden matters with names whose referents souls love. So they named wine the Mother of Joys, and named its sister the Morsel of Comfort (1), and named Usury (Riba) Transaction (Mu'amalah), and named Taxes (Mukus) Royal Rights, and named the ugliest and most obscene injustice the Law of the Divan, and named the most profound disbelief - which is denying the attributes of the Lord - Transcendance (Tanzih), and named gatherings of immorality Gatherings of Goodness! When he named it \"Tree of Eternity\", he said: Your Lord did not forbid you from this tree except that you become angels or become of the immortal. (2).\nWhen facts are overturned from their intended meanings, one must resort to the language of the Arabs in which the Qur'an was revealed, and with which the most eloquent of creation, peace be upon him, spoke. Whoever contemplates the words in which the Sharia encouraged improving the voice finds them returning to linguistic phrases revolving around this meaning, such as the words \"Taghanni with the Qur'an\", or other words that appeared on the tongues of some commentators of hadiths in which the Sharia encouraged improving the voice, such as the word \"Tarannum\", the word \"Nagham\", and the word \"Tatrib\". Whoever contemplates those words finds their material revolving around improving the voice in recitation and reciting it aloud only.",
    "foot_note": "1. Perhaps he means Hashish.\n2. Ighathat al-Lahfan fi Masa'id al-Shaytan: (1/112-113).",
    "book_id": "937",
    "new_page_number": 35
  },
  {
    "serial_number": "1144786",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "We can contemplate the meaning of Tarannum which Al-Zubaidi (d. 1205 AH) cited in Taj Al-Arus where he says - may Allah have mercy on him:\nFirst: He said regarding the meaning of \"Tarannum\": ((And) Al-Ranam (with vowel movement: The Voice). And Ranim with Kasra: If he modulated (Rajja'a) his voice as in Al-Sahah, (and Al-Ranim and Al-Tarnim: is its Tatrib/Enchanting) as in Al-Muhkam. Al-Jawhari said: And Al-Tarnim: Modulation (Tarji') of the voice). And Tarji' of the voice is: repeating it in the throat. (1)\nSecond: He said regarding the meaning of \"Nagham\": (Al-Nagham: with vowel movement, and Sukun: The hidden speech, the singular with Ha'), our Sheikh said: So its singular follows its plural in diacritics, ended. And So-and-so has good Naghmah, meaning: good voice in reading, as in Al-Sahah). And Al-Naghmah: The sound of the word and goodness of voice in reading and otherwise. (2)\nThird: He said regarding the meaning of \"Ghina\" (Singing): ((And Al-Ghina', like Kisa'; from the voice: what is enchanted (Turriba) with) Humaid bin Thawr said: I wondered at it, how can its singing be? And in Al-Sahah: Al-Ghina', with Kasra, is from Sama' (listening). And in Al-Nihayah: It is raising the voice and continuing it. And in Al-Misbah: Its analogy is Damma because it is a sound). Al-Hafiz Ibn Hajar, may Allah have mercy on him, said: Ghina is applied to raising the voice, and to Tarannum which the Arabs call (Al-Nasb), and to Huda' (camel singing), and its doer is not called Mughanni (singer); rather, he who recites with stretching, breaking, provoking, and longing containing allusion to obscenities or explicitness is called that. (3)\nFourth: He said regarding the meaning of \"Tatrib\": (And Al-Tatrib in the voice: extending it and improving it. And Tarraba in his reading: extended and modulated. And the bird Tarraba in its voice likewise. And some of them specified Al-Mukka' with it. And So-and-so: read with Tatrib). (4) And Tarraba in his voice: modulated it, extended it, and improved it. (5)\nIn light of the linguistic concept of the words Tarannum, Nagham, Ghina, and Tatrib, it becomes clear and evident that they are words indicating improving the voice, its elevation, and its resonance in the throat, and from it Ghina was named Ghina.",
    "foot_note": "1. Definition and meaning of Tarji' al-Sawt in Mu'jam al-Ma'ani al-Jami'.\n2. Lisan Al-Arab: Entry Nagham.\n3. Fath Al-Bari (2/442). Fath Al-Bari Sharh Sahih Al-Bukhari Author: Ahmad bin Ali bin Hajar Abu al-Fadl Al-Asqalani Al-Shafi'i Publisher: Dar Al-Ma'rifah - Beirut, 1379 Numbered its books, chapters and hadiths: Muhammad Fuad Abd al-Baqi Directed, corrected and supervised printing: Muhibb al-Din al-Khatib Commentary by Al-Allamah: Abd al-Aziz bin Abdullah bin Baz Number of Parts: 13.\n4. See: Taj Al-Arus - Al-Zubaidi (2/182). Taj Al-Arus min Jawahir Al-Qamus Author: Muhammad bin Muhammad bin Abd al-Razzaq Al-Husseini, Abu al-Faid, nicknamed Murtada, Al-Zubaidi (Died: 1205 AH) Investigator: A group of investigators Publisher: Dar Al-Hidayah.\n5. Definition and meaning of Tatrib in Mu'jam al-Ma'ani al-Jami'",
    "book_id": "937",
    "new_page_number": 36
  },
  {
    "serial_number": "1144787",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "Requirement Two: Concept of the meaning of \"Music\"\nAs for the word: \"Music\": It is \"a Greek word and has no Arabic root originally. It is a word that accepts masculine and feminine forms, and applies to the arts of playing instruments of Tarab (enchantment)... And music in terminology: A science by which the states of melodies and rhythms are known, and how to compose tunes and create instruments\". (1)\nIt was said: It is a science that discusses the principles of tones in terms of dissonance and harmony, composing melodies, and the states of times that intervene between them. (2)\nTaghanni with the Qur'an, improving the voice, and reciting it aloud has no relation to music and its Maqamat. Therefore, the danger of those musical instruments (Ma'azif) and their tools should be known, and that it is not fitting for the recitation of the Qur'an to be linked to them and their Maqamat.\n\nRequirement Three: Penalty for making musical instruments lawful\nIf a people make musical instruments lawful, they will be transformed into monkeys and pigs. Regarding this, the Prophet, peace be upon him, says: \"There will be among my Ummah people who will make lawful Al-Hir (illegal intercourse), silk, wine, and musical instruments (Ma'azif). And people will descend to the side of a mountain; one who goes freely to them (with their flocks) comes to them - meaning the poor - for a need, so they say: Come back to us tomorrow. So Allah destroys them at night, and places the mountain (upon them), and transforms others into monkeys and pigs until the Day of Resurrection.\" (3)",
    "foot_note": "1. See: Al-Mawsu'ah Al-Fiqhiyyah (38/168). Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah Issued by: Ministry of Awqaf and Islamic Affairs - Kuwait Number of Parts: 45 parts Edition: (from 1404 - 1427 AH) .. Parts 1-23: Second Edition, Dar Al-Salasil - Kuwait .. Parts 24-38: First Edition, Matabi' Dar Al-Safwah - Egypt .. Parts 39-45: Second Edition, Ministry Printing. Note: Biographies of Jurists in the paper original are appended to the end of each volume, so they were collected here - in this electronic book - at the end of the Encyclopedia to facilitate access to them, while maintaining pagination.\n2. See: Definition and meaning of Music in Mu'jam al-Ma'ani al-Jami'.\n3. Reported by Al-Bukhari in Kitab al-Ashribah suspended (Mu'allaq) asserted as authentic, and connected by Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (6317), Al-Tabarani in \"Al-Mu'jam Al-Kabir\" (3/319) and Ibn Hibban in his \"Sahih\" (8/265, 266), and authenticated by Ibn al-Qayyim in \"Tahdhib al-Sunan\" (5/270-272) and Al-Hafiz Ibn Hajar in \"Al-Fath\" (10/51) and Al-Albani in \"Al-Sahihah\" (91). Ibn Hazm claimed it is disconnected (Munqati'), and some imitators followed him in that, but the verifying Imams refuted him. Al-Hafiz Abu Amr Ibn Al-Salah said: Ibn Hazm claimed that it is disconnected between Al-Bukhari and Hisham, and made that an answer to using it as evidence for the prohibition of musical instruments, and he erred in that from several aspects. The hadith is authentic, known to be connected according to the condition of the Sahih. Al-Bukhari might do such a thing because he mentioned that hadith in another place in his book with a connected chain, or he might do that for other reasons not accompanied by the defect of disconnection.\" Also, Ibn Al-Salah narrated consensus on the prohibition of listening (to music). See: Muqaddimah Abi Amr Ibn Al-Salah (p. 36).",
    "book_id": "937",
    "new_page_number": 37
  },
  {
    "serial_number": "1144788",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "Imam Abu Amr Ibn Al-Salah (d. 463 AH) narrated the consensus on the prohibition of listening (to music) in \"Adab al-Mufti wal-Mustafti\", saying, may Allah have mercy on him: Let it be known that the tambourine, flute, and singing, if combined: listening to that is forbidden (Haram) according to the Imams of the schools of thought and other Muslim scholars. It has not been established from anyone whose word is counted in consensus and disagreement that he permitted this listening. (1)\nTherefore, scholars of Islam have warned against the danger of those musical instruments most severely. Sheikh Al-Islam Ibn Taymiyyah (d. 728 AH), may Allah have mercy on him, said: Musical instruments are the wine of souls; they do to souls greater than what cups of wine do. If they become intoxicated with sounds, Shirk descends upon them, and they incline towards obscenities and injustice, so they commit Shirk, kill the soul which Allah has forbidden, and commit adultery. These three exist abundantly among the people of listening to musical instruments. (2)\nIbn al-Qayyim (d. 751 AH), may Allah have mercy on him, said: What we and others have witnessed and known by experiences: Musical instruments and instruments of amusement never appeared in a people and spread among them and they busied themselves with them: except that Allah empowered the enemy over them, and they were afflicted with drought, barrenness, and bad rulers. The wise person contemplates the conditions of the world and observes, and Allah is the One sought for help. (3)\nIf this becomes clear to us, the prohibition and danger of learning \"Musical Maqamat\" becomes known, and consequently the prohibition of reading the Qur'an, which is the speech of the Most Merciful, upon the stations (Maqamat) of \"Satan\". Those who were deluded, erred, and slipped in this chapter mostly did so due to their misunderstanding of the words used by some scholars, such as Tarnim, Taghanni, Tatrib, and similar words, which the scholars defined according to what the language of the Arabs indicated. In this regard, Ibn Jarir Al-Tabari (d. 310 AH), may Allah have mercy on him, says: The meaning of the Hadith is improving the voice and the reasonable singing which is the reciter making the hearer of his voice sad, just as singing with poetry is reasonable singing that thrills its listener.. (4)\nAl-Hafiz Ibn Hajar (d. 852 AH), may Allah have mercy on him, said: Improving his voice with it, reciting aloud, chanting (Mutaranniman) on the path of sadness... There is no doubt that souls incline towards reading with Tarannum more than their inclination to one who does not use Tarannum. Because Tatrib has an effect in softening the heart and drawing tears. (5)",
    "foot_note": "1. Adab al-Mufti wal-Mustafti, by Ibn Al-Salah (2/500).\n2. Majmu' al-Fatawa (10/417).\n3. Madarij al-Salikin (1/500).\n4. Sharh Ibn Battal (10/260), Zad Al-Ma'ad (1/486).\n5. Fath Al-Bari (9/72).",
    "book_id": "937",
    "new_page_number": 38
  },
  {
    "serial_number": "1144789",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "So Ibn Jarir interpreted \"Taghanni\" as singing (Ghina), and Ibn Hajar interpreted improving the voice as \"Tarannum\" and \"Tatrib\", but all that was according to what the language indicated. However, the opponents interpreted these words and their likes according to the common, widespread colloquial meaning in people's usage. If they had referred to the meanings indicated by those words in the language of the Arabs, I think the journey would have ended for them and the truth would have appeared clearly to them, if they were among those who search for the truth and strip themselves of desire.\n\nRequirement Three: The early vigilance of the Salaf regarding the confusion in the concepts of some terms\nVigilance of the Salaf regarding this early on: Because of this and similar matters, the prohibition was reported from some of the Salaf regarding narrating some of these Hadiths that contain encouragement for Taghanni with the Qur'an and improving the voice with it, fearing that those texts would be interpreted contrary to their intent, such as what we are dealing with regarding carrying those words to allow engaging in those melodies marked as \"Musical Maqamat\" which are characteristics of the people of immorality and obscenity who engage in obscene singing accompanied by musical instruments.\nAbu Ubayd Al-Qasim bin Salam (d. 224 AH), may Allah have mercy on him, said: Yahya bin Saeed Al-Qattan told me from Shu'bah bin Al-Hajjaj, who said: \"Ayyub forbade me to narrate this Hadith: 'Adorn the Qur'an with your voices'\" (1). Abu Ubayd - may Allah have mercy on him - said: Ayyub only disliked, as we see, that people would interpret this Hadith as a license from the Messenger of Allah - peace be upon him - regarding these innovative melodies, so for this reason, he forbade him to narrate it. (2)\nSo interpreting these Arabic words and using them as evidence and proof for the permissibility of using \"Musical Maqamat\" and reading the Qur'an with them, and permitting them, because similar words appeared in some Hadiths and usage of scholars, is undoubtedly a clear and obvious error. A group of scholars have alerted to this, including: Sheikh Al-Islam Ibn Taymiyyah, his student Ibn al-Qayyim, Ibn Kathir, and other established scholars.\n\nRequirement Four: The decisive word on \"Musical Maqamat\"\nIbn al-Qayyim's decisive word on the dispute in this issue: Imam Ibn al-Qayyim resolved the dispute in this issue, and mentioned the consensus of the Salaf on",
    "foot_note": "1. Extracted by Al-Bukhari suspended before Hadith (7544), from the Hadith of Al-Bara' bin Azib - may Allah be pleased with him, and extracted connected by Abu Dawud (1468), Al-Nasa'i (1015), Ibn Majah (1342), Ahmad (18517) briefly, and Al-Hakim (2125) and the wording is his. Its chain is authentic, and its origin is in Sifat al-Salah by Al-Albani (2/570).\n2. Fadail al-Qur'an by Abu Ubayd (1/335).",
    "book_id": "937",
    "new_page_number": 39
  },
  {
    "serial_number": "1144790",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "preventing reading with musical melodies, and reciting the Qur'an in the manner of the people of immorality and debauchery used by the dissolute among singers and their likes, which is known in our present time as \"Musical Maqamat\". He also distinguished, may Allah have mercy on him, between natural disposition in reading and blameworthy affectation in Taghanni with the Qur'an until it reaches the limit of stretching (Tamtit), which they do not achieve except through learning, practice, and fabrication, as the people of singing do with melodies and specific rhythms on specific invented weights.\nHe elaborated on it - may Allah have mercy on him - after citing the silencing evidences by which he demonstrated the invalidity of that heinous act, then he clarified here that Taghanni has a praiseworthy type and a blameworthy type. He said regarding that, may Allah have mercy on him:\nThe resolution of the dispute is to say that Tatrib and Taghanni are of two types:\nOne of them: What nature necessitates and allows without affectation, practice, or teaching. Rather, if left to his nature and his disposition flows, it comes with that Tatrib and Talhin (melodizing), then that is permissible. Even if he aids his nature with the grace of decoration and improvement, as Abu Musa Al-Ash'ari said to the Prophet - peace be upon him - \"If I knew you were listening, I would have adorned it for you greatly\" (1). And the sad person and the one stirred by Tarab, love, and longing cannot help but have sadness and Tatrib in reading, but souls accept it and find it sweet for its agreement with nature and lack of affectation and fabrication in it. It is natural not feigned, inherent not affected. This is what the Salaf used to do and use, and it is the praised, commendable Taghanni, and it is what affects the reciter and the listener. Upon this type, all evidences of the proponents of this view are carried.\nThe second type: What is a craft among crafts, not allowed by nature, but obtained only by affectation, fabrication, and practice, just as voices of singing are learned with types of simple and compound melodies on specific rhythms and invented weights that are not obtained except by learning and affectation. This is what the Salaf disliked, criticized, blamed, prevented reading with, and denounced whoever read with it. The evidences of the proponents of this view (prohibition) address this type. With this detail, ambiguity is removed and truth becomes distinct from other things. Anyone who has knowledge of the states of the Salaf knows definitively that they are innocent of reading with musical melodies that are affected rhythms and measured, counted, limited movements, and that they are more pious to Allah than to read with them and permit them. He knows definitively that they used to read with sadness and Tatrib, and improve their voices with the Qur'an, reading it with sorrow at times, with Tarab at times, and with longing at times. This is a matter embedded in natures demanding it, and the Lawgiver did not forbid",
    "foot_note": "1. See: Fath Al-Bari (14/272)",
    "book_id": "937",
    "new_page_number": 40
  },
  {
    "serial_number": "1144791",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "it despite the strong demand of natures for it; rather, he guided to it and encouraged it, and informed of Allah's listening to whoever reads with it, and said: (He is not of us who did not Taghanna with the Qur'an) (1). There are two interpretations of this: First: That it is informing of the reality that we all do. Second: That it is a negation of the guidance of whoever does not do it, from his guidance and way. (2)\nIn a similar vein, Ibn Kathir, may Allah have mercy on him, says in \"Fadail al-Qur'an\": The purpose is that what is required by Sharia is only improvement of the voice that incites pondering the Qur'an, understanding it, humility, submission, and compliance with obedience. As for voices with innovative tunes composed on entertaining weights and positions and musical law, the Qur'an is exalted above this and is too majestic and great for this path to be followed in its performance. (3)\nAl-Hafiz Ibn Rajab Al-Hanbali (d. 695 AH) also noted this in \"Nuzhat al-Asma'\", saying may Allah have mercy on him: In reality, these innovative, enchanting melodies excite natures and distract from pondering what is obtained from listening, until the pleasure becomes merely hearing the measured tones and enchanting voices. This prevents the intended purpose of pondering the meanings of the Qur'an. The Sunnah only mentioned improving the voice with the Qur'an, not reading with melodies, and there is a wide difference between them. (4)\nSheikh Al-Islam Ibn Taymiyyah (d. 728 AH), may Allah have mercy on him, said: It is not permissible for the Qur'an to be read with the melodies of singing, nor to accompany it with melodies that accompany singing from instruments and others, neither according to those who say it is permissible nor according to those who forbid it. Rather, Muslims are agreed on denouncing the coupling of improving the voice in Qur'an with entertaining instruments of the mouth like flutes, and of the hand like tambourines. If someone were to say: The Prophet - peace be upon him - read the Qur'an, and asked Ibn Mas'ud to read it, and listened to Abu Musa's reading, and said: \"He has been given a Mizmar of the Mazamir of the family of David\" (5), so if someone says: If that was permissible without these melodies, the ruling does not change by hearing it with melodies, this would be a rejected statement and falsehood by the agreement of people. (6)\nHe said, may Allah have mercy on him, in another place: And the Salaf",
    "foot_note": "1. Extracted by Al-Bukhari in his Sahih (7527)\n2. Zad Al-Ma'ad, by Ibn Al-Qayyim (1/470).\n3. Fadail al-Qur'an (p. 114). Fadail al-Qur'an Author: Abu al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH) Publisher: Maktabat Ibn Taymiyyah Edition: First Edition - 1416 AH Number of Parts: 1.\n4. Nuzhat al-Asma', by Ibn Rajab (p. 70)\n5. Sahih Muslim Book of Prayer of Travelers, Hadith No 793.\n6. Al-Istiqamah, by Ibn Taymiyyah 1/241).",
    "book_id": "937",
    "new_page_number": 41
  },
  {
    "serial_number": "1144792",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "used to improve the Qur'an with their voices without affecting the weights of singing like Abu Musa Al-Ash'ari, may Allah be pleased with him, used to do. (1)\nAl-Qurtubi (d. 671 AH), may Allah have mercy on him, said while speaking about the sanctity of the Qur'an: And part of its sanctity is not to deepen the throat in reading it like the action of these innovative Hamzites and pedants in bringing out speech from those stinking mouths with affectation, for that is an innovation Satan cast to them and they accepted from him. And part of its sanctity is not to read it with the melodies of singing like the melodies of the people of immorality. (2)\nAbu Ubayd Al-Qasim bin Salam (d. 224 AH), may Allah have mercy on him, said: Upon this are these Hadiths borne which we mentioned regarding good voice; it is only the path of sadness, frightening, and longing. This is clarified by the hadith of Abu Musa: that the wives of the Prophet, peace be upon him, listened to his reading, so he was informed of that, and he said: (If I knew, I would have thrilled with thrilling, or adorned with adorning. So this is its aspect, not the enchanting, distracting melodies (3).\n\nRequirement Five: The consensus of the Salaf on the prohibition of reading the Qur'an with musical melodies\nThe Salaf agreed on the prohibition of reading the Qur'an with musical melodies. Consensus was reported by a group of scholars, and prohibited absolutely by others, among them:\n1 - Ibn al-Qayyim and Ibn Taymiyyah: Their words have passed previously.\n2 - Ibn Rajab Al-Hanbali: Ibn Rajab reported in \"Nuzhat al-Asma'\" the consensus of the Salaf - as well - on the prohibition of reading the Qur'an with musical melodies from Abu Ubayd and others of the Imams. He said: Most scholars denounced that, and some of them narrated it as consensus, and did not establish any dispute in it; among them Abu Ubayd and others of the Imams. (4)\n3 - Ibn Sirin: Among those who narrated this consensus - as well - is Muhammad bin Sirin (d. 110 AH) where he says: They used to see these melodies in the Qur'an as an innovation (Muhdathah). (5). And his saying: \"They used to\" means the Companions and the Tabi'in.\n4 - Ibn Kathir: Al-Hafiz Ibn Kathir - may Allah have mercy on him in the introduction of his Tafsir - after mentioning the words of the Salaf in forbidding reading with melodies - said: This indicates that it is a major prohibition, which is",
    "foot_note": "1. Jami' al-Masa'il: (3/304).\n2. Tafsir Al-Qurtubi (1/29).\n3. Fadail al-Qur'an, by Abu Ubayd Al-Qasim bin Salam (p. 164).\n4. Nuzhat al-Asma' (p. 70).\n5. Reported by Al-Darimi (3546).",
    "book_id": "937",
    "new_page_number": 42
  },
  {
    "serial_number": "1144793",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "reading the Qur'an with melodies that follow the ways of singing. The Imams, may Allah have mercy on them, have stated the prohibition of it. As for if it exits to obscene stretching which causes a letter to be added or a letter to be decreased, scholars have agreed on its prohibition. (1)\n5 - Ibn al-Jawzi: Ibn al-Jawzi considers it one of the breaches of chivalry that drops credibility (Adalah), where he says, may Allah have mercy on him: Melodizing (Talhin) in reading is the melodizing of singing and poetry. It drops credibility and is one of the causes for rejecting testimony, judicially. The first occurrence of this innovation was in the fourth century at the hands of the Mawali. One of the grossest innovations in this is that atheistic call to read the Qur'an to the rhythm of songs accompanied by instruments and flutes. (2)\nHe said in another place: As for the melodies that reciters of this time fabricate, they are disliked by scholars because they are taken from the methods of singing. (3)\nHe also said in another place, may Allah have mercy on him: As for what was innovated after them - meaning the Salaf - of affectation in reading to the melodies of singing, this is forbidden according to the majority of scholars; because it is an innovation. (4)\n6 - Abu al-Abbas Al-Qurtubi: Abu al-Abbas Al-Qurtubi (d. 656 AH) said in \"Kashf al-Qina'\": - The manner of reading the Qur'an was transmitted to us by consecutive transmission (Tawatur), and there is nothing in it that resembles melodizing, nor the styles of reciting poetry. So it is not appropriate to permit other than it. We only said that because we read the Qur'an to our Sheikhs, and they are a large number and a great multitude, and our Sheikhs to their Sheikhs, and so on to the Noble Era, and we received from them the manner of reading it orally. If melodizing in it were prescribed, they would have learned it from their Sheikhs and transmitted it from them, just as they transmitted from them Madd and Qasr, what is between two pronunciations, Imalah, Fath, Idgham, Izhar, and the manner of outputting letters from their exits. For when the later generations transmitted it from the earlier ones and taught it, that connected to us and we received it from them. This came with plentiful motives for transmission and many deep divers among the reciters exaggerating in the manner of reading it. Yet, nothing of that was transmitted from any of the famous reciters, nor from narrators from them. This indicates that melodizing the Qur'an was not known to them, nor acted upon among them. So it is obligatory not to act upon it, nor turn to it, for it is an innovated matter, and every innovated matter is a heresy (Bid'ah), \"and every heresy is misguidance\" (5). (6).",
    "foot_note": "1. Tafsir Ibn Kathir (1/65).\n2. Talbis Iblis (p. 113-114)\n3. Kashf al-Mushkil min Hadith al-Sahihayn, by Ibn al-Jawzi (1/269)\n4. Previous Reference (3/304-305).\n5. Authenticated by Al-Albani in Sahih Abu Dawud (4607)\n6. Kashf al-Qina' 'an Hukm al-Wajd wal-Sama' (p. 113).",
    "book_id": "937",
    "new_page_number": 43
  },
  {
    "serial_number": "1144794",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "The saying of Abu al-Abbas Al-Qurtubi is among the best said on this issue.\n\nRequirement Six: The consensus of contemporary scholars on the prohibition of reading the Qur'an with musical melodies\nContemporary scholars have agreed on the prohibition of reading the Qur'an with musical melodies. Among the most prominent of these are:\n1 - Our Eminence Imam Ibn Baz - may Allah have mercy on him -: His Eminence says: It is not permissible for a believer to read the Qur'an with the melodies of singing and the method of singers. Rather, he must read it as our righteous Salaf from the Companions of the Messenger, peace be upon him, and their followers in goodness read it. He should read it with Tartil, sadness, and feigned humility so that it affects the hearts that hear it and so that he is affected by that. As for reading it in the attribute of singers and their way, this is not permissible. (1)\n2 - Our Sheikh, the Mark, Saleh bin Fawzan Al-Fawzan - may Allah preserve him -: He was asked what is the ruling on reciting the Qur'an on musical Maqamat? He answered - may Allah preserve him - saying: We seek refuge in Allah from that. It is not permissible to read the Qur'an with melodies and make it songs. These Maqamat are for songs according to the Sufis. It is not permissible to read the Qur'an upon them, nor is it permissible to take the Qur'an as songs. Rather, the Qur'an is recited as the Prophet - peace be upon him - his Companions, and the people of knowledge used to recite it. As for reciting it as the Sufis, innovators, and singers recite it, this is Haram. (2). The saying of our Sheikh Al-Fawzan regarding the obligation of following the example of the Prophet, peace be upon him, and his Companions is the same as the saying of our Sheikh Imam Ibn Baz, may Allah have mercy on him, as if it emerged from a single niche.\n3 - Dr. Ibrahim bin Saeed Al-Dosari: (3) He says: Reading with melodies does not go beyond two cases:\nCase One: Melodies that human nature allows without affectation. This is what most people do when reading the Qur'an, for everyone who chants (Taghanna) the Qur'an does not go beyond that simple melodizing. That is permissible, and it is the praised, commendable Taghanni, as the Messenger, peace be upon him, said: (He is not of us who did not Taghanna with the Qur'an) (4). Upon this case the ruling of permissibility and desirability is carried.\nCase Two: Manufactured melodies and musical rhythms that",
    "foot_note": "1. Majmu' Fatawa wa Maqalat Mutanawwi'ah: by His Eminence Sheikh Allamah Abd al-Aziz bin Abdullah bin Baz, may Allah have mercy on him. Vol 9 p 290.\n2. From the official website of His Eminence Sheikh Al-Fawzan.\n3. Vice Chairman of the Board of Directors of the Saudi Scientific Association for the Holy Qur'an and its Sciences and Head of the Department of Qur'an and its Sciences at Imam Muhammad bin Saud Islamic University in Riyadh.\n4. Extracted by Al-Bukhari in his Sahih (7527)",
    "book_id": "937",
    "new_page_number": 44
  },
  {
    "serial_number": "1144795",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "are not obtained except by learning and practice, and have sound quantities and ratios that are not complete without them. That is not permissible; because the performance of the Qur'an has its transmitted Tajweed quantities that cannot be compatible with the quantities of the rules of those melodies except at the expense of violating the rules of Tajweed, and that is a forbidden matter. (1)\nA group of prominent contemporaries also issued fatwas prohibiting it, including but not limited to their Eminences:\n1 - Scholars of the Standing Committee for Ifta in the Kingdom of Saudi Arabia. (2) - And they suffice you -\n2 - The Faqih and Mark Sheikh Muhammad bin Saleh Al-Uthaymeen, may Allah have mercy on him.\n3 - The Mark Sheikh Abd al-Rahman bin Nasser Al-Barrak.\n4 - The Mark Sheikh Bakr bin Abdullah Abu Zaid, may Allah have mercy on him, although he was among the members of the Standing Committee, he has an independent fatwa prohibiting it as well.\n4 - The Mark Sheikh Abdullah bin Abd al-Rahman bin Jibreen, may Allah have mercy on him.\n5 - His Eminence Sheikh Ahmed bin Isa Al-Ma'sarawi, Sheikh of All Egyptian Maqari' (Recitation Centers).\n6 - Fatwas of Al-Azhar Scholars.\nNo disagreement is known from any of the established, respected contemporary scholars regarding the prohibition of reading the Qur'an with those innovative \"Musical Maqamat\" which are not based on the practice of the Salaf. What some people call for regarding melodizing the Qur'an claiming to depict meanings and adjust tones, and perhaps some went further and demanded what compares those melodies to musical instruments: all of that is boldness towards the Book of Allah - Exalted is His mention and Holy is His name. There is no doubt that engaging in those tones leads the reader into altering words, and distracts the listener from pondering meanings, rather it leads to changing them, and the Glorious Book of Allah Almighty is far above that. (3)\nWe wonder at one who became famous in the Islamic world for his good reading, that his way in learning and mastering reading was: obscene songs! Some of them admitted that they used to listen to the song with",
    "foot_note": "1. Report on a meeting (Reading with Melodies between Prohibition and Permission, Theory and Application), article from Al-Alukah website, Dr. Abdulrahman bin Mu'adah Al-Shehri, - Date added: 29/10/2010 AD - 21/11/1431 AH.\n2. See: Fatawa of the Standing Committee for Ifta: (26/37). Fatawa of the Standing Committee - First Group Author: Standing Committee for Scientific Research and Ifta Collection and Arrangement: Ahmed bin Abd al-Razzaq Al-Duwish Number of Parts: 26 parts Publisher: Presidency of the Administration of Scientific Research and Ifta - General Administration for Printing - Riyadh.\n3. Quoted from an article in \"Multaqa Ahl al-Tafsir\".",
    "book_id": "937",
    "new_page_number": 45
  },
  {
    "serial_number": "1144796",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "instruments to learn the method of reading! A picture of some senior reciters spread while he was beside a \"Piano\"! Furthermore, an Arab radio station stipulates that every reciter in it must hold a certificate from a music institute! Otherwise, he is deprived of reading in it. Allah Almighty has granted success to many reciters in the Islamic world, and they affected people with their reading and did not learn a Maqam nor hear a song. Some of those obsessed with these Maqamat hear a proficient, successful reciter and attribute his reading to one of the Maqamat, deluding themselves and others that this reciter is one who follows his method in reading according to a song or a specific melody, but the matter is not so; rather, it is pure delusion. (1)\n\nRequirement Seven: The obligation to purify the Qur'an from \"Musical Maqamat\", out of glorification, reverence, and magnification of the Speech of Allah\nHere are important alerts that should be noted and paid attention to. Finally, after the deficient research in this issue, reference must be made to some important alerts as follows:\nFirst Alert: Reading the Qur'an with those \"Maqamat\" is an innovated matter that is not based on the practice of the Salaf. Therefore, it is not lawful for a Muslim to read the Qur'an except in the manner by which the Prophet Muhammad, peace be upon him, worshipped Allah Almighty, which he received from the Trustworthy Gabriel, peace be upon him, and taught his Companions, and which was transmitted orally by Tawatur from them until it reached us in the first state in which the Qur'an was revealed.\nSecond Alert: The Qur'an must be purified from tampering in any form and under any name, especially by what is called \"Musical Maqamat\", out of glorification, reverence, and magnification of the Speech of Allah, Exalted be He in His Majesty.\nThird Alert: Allah revealed the Qur'an to be pondered as He, Glory be to Him, said: ([This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded.) (Sad: 29), meaning: that they might ponder the proofs of Allah in it, and what He legislated in it of His laws, so they take heed and act upon it (2). There is no doubt that learning those Maqamat distracts from the contemplation for which the Qur'an was revealed. Regarding that, Sheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, says: And because that contains a resemblance of the Qur'an to singing, and because that causes the heart of the reader to remain focused on weighing the word with the scale of",
    "foot_note": "1. Quoted from an article, Recitation of the Qur'an on Maqamat, Islam Question and Answer, Date: 25/5/2011 AD. With slight adaptation.\n2. Tafsir Al-Tabari (79/20).",
    "book_id": "937",
    "new_page_number": 46
  },
  {
    "serial_number": "1144797",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "singing, not pondering it or understanding it, and the listeners remain listening to it for the sake of the melodious sound as singing is listened to, not for the sake of listening to the Qur'an, understanding it, pondering it, and benefiting from it. (1)\nIbn Rajab (d. 695 AH), may Allah have mercy on him, says: In reality, these innovative, enchanting melodies excite natures and distract from pondering what is obtained from listening, until the pleasure becomes merely hearing the measured tones and enchanting voices. This prevents the intended purpose of pondering the meanings of the Qur'an. (2)\nIbn Al-Salt Al-Ahwazi (d. 408 AH), may Allah have mercy on him, said: I heard a group of my sheikhs saying: It is not permissible for the reciter to read with five types: Taraqqi (ascending), Tar'id (trembling), Tatrib (enchanting), Talhin (melodizing), and Tahzin (saddening); since they have no trace or transmission from any of the Salaf. Rather, it has reached us that some of the Salaf used to dislike reading with them. (3)\nAbu Bakr Al-Tartushi (d. 520 AH), may Allah have mercy on him, said: This prevents reading with enchanting melodies resembling songs; because that yields blocking of reverence and the opposite of fear and dread. (4).\n\nRequirement Eight: Warning against boldness towards the Book of Allah\nOf the Greatest Calamities: Among the greatest major calamities we heard about in the past is the daring of a famous female singer to record some verses of the Holy Qur'an with her voice. Among those calamities resulting from opening this door wide is also the daring of some contemporary people of singing to request official permission to record the Qur'an with their voice from Al-Azhar, and their request was strongly rejected. Ibn Kayyal Al-Dimashqi (d. 929 AH) wrote a book on forbidding the reading of the Qur'an with melodies, naming it \"Al-Anjum Al-Zawahir fi Tahrim Al-Qira'ah bi-Luhun Ahl Al-Fisq wal-Kaba'ir\" (The Shining Stars in Prohibiting Reading with the Melodies of the People of Immorality and Major Sins). (5)\n\nRequirement Nine: Tafkhim (Aggrandizing/Thickening) the voice in recitation\nAmong the etiquettes of reciting the Qur'an also: That the reader thickens his recitation without affectation or arbitrariness. Al-Halimi said: Its meaning is that he reads it according to the reading of men, and does not soften the voice in it",
    "foot_note": "1. Jami' al-Masa'il (3/305).\n2. Nuzhat al-Asma' fi Mas'alat al-Sama': (p. 85).\n3. Al-Iqna' fi al-Qira'at al-Sab' (1/155).\n4. Al-Hawadith wal-Bida': (p. 87).\n5. Al-Dhayl 'ala Kashf al-Zunun (1/131).",
    "book_id": "937",
    "new_page_number": 47
  },
  {
    "serial_number": "1144798",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "like the speech of women. (1)\nThe intended meaning of Tafkhim here is: That he does not read it with a soft, melodious voice like the voice of women - for example -, nor with a voice that has a kind of fluidness, like the recitations that spread in such a manner. Rather, he reads it and thickens it as a man, and reads with his instinct and nature without affectation or arbitrariness. So the man reads with his nature and instinct, just as the woman - also - reads with her nature and instinct, each with their nature and instinct. Among those who noted such is the author of Al-Burhan. (2)\nMentioning this control is of paramount importance as a warning and alert to what is seen of the prevalence of some youthful voices that have affectation of softness and melody as if they were women's voices.\n\nChapter Two: The Quranic Ijazah (Authorization) and related matters\nIt has two sections:\n\nSection One: Controls of the Quranic Ijazah\nIt has eight requirements:\n\nRequirement One: That the reciter be a Hafiz (memorizer), Mujaz (authorized), and Musnad (having a chain of transmission)\nAdd to the previously mentioned controls: That the reciter intending to record the Qur'an with his voice be among the proficient memorizers to enable quality of pronunciation and lack of stuttering that often afflicts those who have not memorized. And that he be authorized (Mujaz) in the reading or narration he wants to record with his voice from the established Imams of his time and region with a connected chain (Sanad) to the one upon whom the Qur'an was revealed, peace be upon him, who received it from Gabriel, peace be upon him, as Allah Blessed and Exalted clarified in His saying: (And indeed, you are receiving the Qur'an from One, Wise and Knowing.) (An-Naml: 6). His saying (And indeed, you are receiving the Qur'an) means: It is cast upon you, so you receive it, learn it, and take it (3). The mention of the one who taught him and from whom he received it came clearly and explicitly in His saying: (Taught to him by one intense in strength) (An-Najm: 5), and (one intense in strength) is Gabriel, peace be upon him. The Lord of Might, Exalted be He in His Majesty, spoke the Qur'an with letter and voice, and Gabriel, peace be upon him, heard it likewise from the Lord of Might with letter and voice, so he descended with it to the heart of the Prophet, peace be upon him, and conveyed it to him as he heard it. Regarding that, He, Glory be to Him, said: (The Trustworthy Spirit has brought it down * Upon your heart, [O Muhammad] - that you may be of the warners - * In a clear Arabic language.) (Ash-Shu'ara: 193-195). So Allah made his heart conscious of it and established it in it so he never forgets it. He, peace be upon him, conveyed it to his Ummah as he received and heard from Gabriel, peace be upon him, without the slightest alteration in it. (4)",
    "foot_note": "1. Al-Itqan, by Al-Suyuti: (1/109).\n2. Al-Burhan fi 'Ulum al-Qur'an: (1/467).\n3. Tafsir Al-Qurtubi (7/105).\n4. And (The Qur'an is the speech of Allah, from Him it began, without modality in speech, and He sent it down to His Messenger as revelation. The believers believed it as such, and were certain that it is the speech of Allah Almighty in reality, not created like the speech of creation. Whoever hears it and claims it is the speech of humans has disbelieved. (Al-Tahawiyyah 1/168 (Scientific Committee)).",
    "book_id": "937",
    "new_page_number": 48
  },
  {
    "serial_number": "1144799",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Requirement Two: The concept of Quranic Ijazah\nQuranic Ijazah: It is the process of audio transmission of the Holy Qur'an from generation to generation, in which the licenser (Mujiz) testifies that the recitation of the licensee (Mujaz) has become one hundred percent correct regarding the narration - or narrations - with which he authorized him, then he permits him to read and teach others the Holy Qur'an. (1)\nBased on this, the considered Ijazah is one wherein the licensing Sheikh hears from the licensed reciter the entire Qur'an from its opening to its end, letter by letter, receiving it from him part by part.\n\nRequirement Three: The importance of Ijazah\nThere is no doubt that seeking Ijazah in reading the Holy Qur'an, a correct reading, with a connected chain to the Messenger of Allah, peace be upon him, is a matter praised in Sharia. How could it not be when traveling to seek Hadith was reported from some of the Salaf, may Allah have mercy on them? Traveling to seek mastery of Qur'an recitation is more worthy, and its doer is rewarded and thanked.\nThe importance of Ijazah is highlighted by the fact that: It is not valid for anyone to teach the Holy Qur'an until he takes it completely from the mouths of knowledgeable, proficient Sheikhs, and is permitted to teach. If he is not permitted to teach, he should not teach the Qur'an even if he read the Qur'an many times. For hearing and presentation are not sufficient for the correctness of performing the Qur'an after the time of widespread Lahn (errors); rather, there must be with them an Ijazah and permission to read and teach. This is because a student might read the entire Qur'an to his Sheikh repeatedly and not master the performance, so the Sheikh does not authorize him. An example of that is what Ibn al-Jazari - may Allah have mercy on him - mentioned about Imam Ahmad bin Ahmad bin Ibrahim Al-Hashimi (d. 646 AH) that Abu Ja'far bin Al-Zubayr read the narration of Warsh to him several complete times (Khatmat), and he said: He did not authorize me, but some of my peers read to him and he authorized them.\nHence: Some of the Salaf, may Allah have mercy on them, used to ask some of their students to repeat reading the Qur'an many times until they were certain of their mastery. Among that: Mujahid bin Jabr Al-Makki read to Ibn Abbas thirty Khatmat, stopping him at every verse asking him about it. (2)\nAmong that: Imam Abu Ja'far presented the Qur'an to his master Abdullah bin Ayyash, and to Abdullah bin Abbas, and to Abu Huraira, may Allah be pleased with them both.\nAmong that: Imam Nafi' bin Abi Nu'aym said:",
    "foot_note": "1. Scientific Standards for Teaching the Holy Qur'an in the Field of Quranic Ijazah with Connected Chain to the Messenger of Allah, peace be upon him, Global Council of Sheikhs of Recitation, Date: 25 Rabi' al-Thani 1440 AH.\n2. (Al-Tabaqat Al-Kubra by Ibn Sa'd Vol 6 p 19), (Al-Jarh) 8/319, (Al-Hilyah) 3/280, (Tahdhib Al-Asma') 2/83, (Tahdhib Al-Kamal) 3/1305, (Al-Ibar) 1/95",
    "book_id": "937",
    "new_page_number": 49
  },
  {
    "serial_number": "1144800",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "I read to seventy of the Tabi'in. (1)\nIf the licensing Sheikh authorizes the reciter with a valid authorization meeting its considered condition among researchers, his chain becomes connected by that authorization to the chain of the Messenger of Allah, peace be upon him, and he becomes part of the series of transmitters of the Holy Qur'an with the authentic chain established by mutawatir transmission connected to the Messenger of Allah, peace be upon him, and he becomes thereby eligible to authorize others.\n\nRequirement Four: The condition of Ijazah for whom the Qur'an is recorded\nThe condition of Ijazah for one for whom the Qur'an is recorded is that he be authorized by the established Imams of his time and region. This is for several reasons, most importantly:\n1 - To ensure lack of leniency in authorization which occurred in later times.\n2 - To increase verification of this authorization, due to the fame of the Imams of every era and region among the people of their time and their prominence among them, so authorization of one whom they did not authorize would not be attributed to them.\n3 - To push reciters to seek mastery and seek high Isnad (chain) and taking and receiving from the seniors to qualify before coming forward.\n\nRequirement Five: Ijazah is a followed Sunnah\nThe Prophet, peace be upon him, commended a group of his Companions who received from him and mastered the reading of the Qur'an. The Prophet, peace be upon him, was keen to teach his Companions the Qur'an since the dawn of its revelation in the Cave. Likewise, his Companions were keen to receive and take from him, peace be upon him, and they competed in this field greatly. The star of a number of them shone, so they cared for the Qur'an, learning it, and mastering it until they distinguished themselves in their learning, so the Prophet, peace be upon him, commended them and urged and encouraged receiving and taking from them.\n\nRequirement Six: The status of Isnad (Chain of Transmission) in the Religion\nAbdullah bin Al-Mubarak (d. 181 AH), may Allah have mercy on him, said: Isnad is part of the Religion, and were it not for Isnad, whoever wished would have said whatever he wished. If it is said to him: Who told you? He remains... meaning: he remains confused not knowing what to say, because he has no Isnad by which he knows the authenticity or weakness of the Hadith. (2)",
    "foot_note": "1. Scientific Standards for Teaching the Holy Qur'an in the Field of Quranic Ijazah with Connected Chain to the Messenger of Allah, peace be upon him, Global Council of Sheikhs of Recitation, Date: 25 Rabi' al-Thani 1440 AH.\n2. Introduction to Sahih Muslim, Chapter on Isnad being part of Religion and that narration is only from trustworthy people..., 1/15, and Al-Ilal Al-Saghir printed at the end of Al-Sunan, Muhammad bin Isa Al-Tirmidhi, Investigation: Ahmad Shakir, (Cairo: Matba'at Al-Halabi wa Shurakah, n.d.), 5/740. For expansion on this important word and its misspellings see: Abu Ghuddah, Abd al-Fattah, Al-Isnad min Al-Din wa Safhah Mushriqah min Tarikh Sama' Al-Hadith 'ind Al-Muhaddithin, First Edition, (Damascus: Dar Al-Qalam, 1412 AH 1992 AD), (p. 51).",
    "book_id": "937",
    "new_page_number": 50
  },
  {
    "serial_number": "1144801",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Al-Hafiz Ibn Hajar - may Allah have mercy on him - said: Isnad is a virtuous characteristic of the characteristics of this Ummah, and an emphasized Sunnah. We have narrated via Abu al-Abbas Al-Daghuli who said: I heard Muhammad bin Hatim bin Al-Muzaffar say: Allah Almighty has honored, ennobled, and favored this Ummah with Isnad. No one from all the nations, ancient and modern, has a connected Isnad; rather, they have scriptures in their hands, and they have mixed their news with their books, so they have no distinction between what was revealed of the Torah and Gospel and what they attached to their books of news which they took from untrustworthy sources. (1)\n\nRequirement: Prominent figures whom the Prophet, peace be upon him, commended [*]\nFirst: Collective Commendations\nThe Prophet, peace be upon him, commended a group who distinguished themselves in receiving from him. Among those he commended collectively for their precedence and virtue are four persons. It is established in the Two Sahihs that Abdullah bin Mas'ud was mentioned in the presence of Abdullah bin Amr, so he said: That is a man I still love. I heard the Prophet, peace be upon him, say: Take the Qur'an from four: from Abdullah bin Mas'ud - and he started with him -, Salim, the freed slave of Abu Hudhayfah, Mu'adh bin Jabal, and Ubayy bin Ka'b. (1)\nThese collective commendations for these four Companions are equivalent to an Ijazah (Authorization). His saying (Take the Qur'an from four) is considered an explicit authorization, and is also considered a commendation for them above which there is no commendation, as the command to take from them came in an explicit wording from the Prophet, peace be upon him.\nSecond: Commendation of Ubayy bin Ka'b, may Allah be pleased with him:\nIt is established in the Two Sahihs from the hadith of Anas bin Malik, may Allah be pleased with him, that the Prophet, peace be upon him, said to Ubayy: \"Indeed, Allah commanded me to read the Qur'an to you.\" Ubayy said: \"Did Allah name me to you?\" He said: \"Allah named you to me.\" So Ubayy started weeping. Qatadah said: I was informed that he read to him: (Those who disbelieved among the People of the Scripture were not...) (Al-Bayyinah: 1). (2)\nIt is established in Al-Tirmidhi and others with an authentic chain from the hadith of Anas bin Malik, may Allah be pleased with him, that the Prophet, peace be upon him, said: \"...And the most learned of them in the Book of Allah is Ubayy bin Ka'b...\" (3). This is undoubtedly an explicit commendation for the Master of Reciters, may Allah be pleased with him.\nThird: Commendation of Abdullah bin Mas'ud, may Allah be pleased with him:\nIt is established in Al-Musnad with an authentic chain from Zirr bin Hubaish from a hadith of Ibn Mas'ud, may Allah be pleased with him, who said: ...Whoever is pleased to read the Qur'an fresh as it was revealed, let him read it according to the reading of Ibn Umm Abd... (4). This is a commendation rarely surpassed, and with that, it is a great and majestic virtue. Here is Abdullah bin Mas'ud - may Allah be pleased with him - saying about himself: \"By Allah, other than Whom there is no god, no Surah was revealed from the Book of Allah except that I know where it was revealed, and no verse was revealed from the Book of Allah except that I know regarding what it was revealed. And if I knew anyone more knowledgeable than me in the Book of Allah reachable by camels, I would ride to him.\" (5)\nShaqiq bin Salamah said: Abdullah bin Mas'ud - may Allah be pleased with them - addressed us saying: \"By Allah, I took from the mouth of the Messenger of Allah, peace be upon him, seventy-odd Surahs. By Allah, the Companions of the Prophet, peace be upon him, knew that I am of the most knowledgeable of them in the Book of Allah, and I am not the best of them.\" Shaqiq said: So I sat in the circles listening to what they say, and I did not hear a rejector saying otherwise. (6)\nFourth: Commendation of Abu Musa Al-Ash'ari, may Allah be pleased with him:\nThe Messenger of Allah, peace be upon him, listened to the reading of Abu Musa then said to him: \"If you could have seen me while I was listening to your reading last night! You have been given a Mizmar of the Mazamir of the family of David\" (7). His eagerness, peace be upon him, to listen to Abu Musa's reading is considered a commendation of the highest commendations.\nFifth: Commendation of Mus'ab bin Umair and Abdullah bin Umm Maktum, may Allah be pleased with them both:\nThe Prophet, peace be upon him, sent Mus'ab bin Umair Al-Abdari and Abdullah bin Umm Maktum, may Allah be pleased with them both, to teach people the Qur'an in Medina before his migration. There is no doubt that sending them for teaching and carrying out this majestic task is considered a commendation for them. It is established in Al-Bukhari from the hadith of Al-Bara' bin Azib, may Allah be pleased with him, who said: The first who came to us were Mus'ab bin Umair and Ibn Umm Maktum, and they used to teach people recitation... (8).\nSixth: Commendation of Umar bin Al-Khattab and Hisham bin Hakim bin Hizam, may Allah be pleased with them:\nUmar bin Al-Khattab, may Allah be pleased with him, said: I heard Hisham bin Hakim bin Hizam reading Surat Al-Furqan, and he read in it letters that the Prophet of Allah, peace be upon him, had not taught me. I said: Who taught you this Surah? He said: The Messenger of Allah, peace be upon him. I said: You lied! The Messenger of Allah, peace be upon him, did not teach you like this! So I took his hand leading him to the Messenger of Allah, peace be upon him, and said: O Messenger of Allah! You taught me Surat Al-Furqan, and I heard this man reading in it letters you did not teach me! The Messenger of Allah, peace be upon him, said: Read, O Hisham. So he read as he was reading. The Messenger of Allah, peace be upon him, said: Thus it was revealed. Then he said: Read, O Umar. So I read. He said: Thus it was revealed. Then the Messenger of Allah, peace be upon him, said: Indeed, the Qur'an was revealed in seven letters (Ahruf). (9).\nHis saying, peace be upon him: \"Read, O Hisham\"... then his saying: \"Thus it was revealed.\" Then his saying: \"Read, O Umar\"... then his saying: \"Thus it was revealed,\" this is a commendation for them indicating the correctness of their readings. Other than these commendations, many were narrated on the tongue of the one to whom the Qur'an was revealed, peace be upon him.\n\nRequirement: The value and status of Prophetic commendations [*]\nThese Prophetic commendations mentioned in the previous hadiths indicate clearly the Prophet's, peace be upon him, commendation of those individuals from his noble Companions, may Allah be pleased with them all. They are commendations equivalent to and having the status of verbal Ijazahs (Authorizations) known among scholars in general and people of recitation in particular. Although they are commendations, they have the ruling of verbal Ijazahs. There is no doubt that those commendations and verbal Ijazahs have their status and value, and even precedence over written Ijazahs. They are considered equivalent to auditory Ijazahs, and have their value and status considering the value and status of the best Licenser and best Licensed. He, peace be upon him, also commended a group of his Companions other than these and praised their reading and recitation as well. Among the most prominent of these is Zaid bin Thabit who - it was said - witnessed the Final Presentation (10) and for that reason Abu Bakr and Umar relied on him in its compilation, and Uthman entrusted him with writing the Mushafs. (11).\nLikewise, the commendation of the Scribes of Revelation, and they are a large group. Some of them wrote occasionally, and some of them were consistent in writing revelation, dedicated and specialized in it. Among these scribes were those whom the Prophet, peace be upon him, employed in Mecca before Migration, and some he employed after Migration in Medina and added to them, and some he employed after Al-Hudaybiyah and added to them as well. Mahmoud Shakir mentioned them by name in \"Islamic History\". (12). Employing these scribes for revelation is considered a commendation surpassed by no other commendation, as the Prophet, peace be upon him, entrusted them with writing the revelation for their knowledge of writing and their good religiosity and honesty.\n\nSection Two: That the recording of the Qur'an be by the voice of a \"male\" man\nIt has four requirements:\n\nRequirement One: The ruling on a woman's voice\nScholars differed regarding the ruling on a woman's voice: Is it 'Awrah (nakedness/to be concealed) or not? The correct view in the more authentic of the two scholarly opinions is that the voice of a woman is not 'Awrah in itself at all. This view is what agrees with the general evidences. A woman is only prevented from revealing her voice to non-mahram foreign men without need, just as she is prevented most severely from that in the case of revealing it in a manner of softening (Tarkhim), or having in it melody, softness, stretching, breaking in speech, softening, or tempting coquetry, or in a manner containing informality and intimacy, or in a manner containing clear mixing with laughter and joking, or in any way by which temptation (Fitnah) might occur due to her voice.\nIt was stated in the Kuwaiti Fiqh Encyclopedia: If it is the voice of a woman, if the listener takes pleasure in it, or fears temptation for himself, listening to it is forbidden for him, otherwise it is not forbidden. The Companions', may Allah be pleased with them, listening to the voices of women when talking to them is interpreted according to this. A woman does not have the right to soften the voice, melodize it, and make it tender, because of what is in it of inciting temptation, due to His Almighty's saying: (then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech) (Al-Ahzab: 32) (1). Allah Glorified be He forbade them from softness in speech to prevent Fitnah and lest the people of corruption and desires and those with diseased hearts covet them.\nThe members of the Standing Committee for Ifta in Saudi Arabia were asked: What is the ruling on holding competitions for",
    "foot_note": "1. Al-Zurqani, Muhammad bin Abd al-Baqi, Sharh Al-Allamah Al-Zurqani 'ala Al-Mawahib Al-Ladunniyyah bil-Minah Al-Muhammadiyyah lil-Qastalani, Investigation: Muhammad Abd al-Aziz Al-Khalidi, First Edition, (Beirut: Dar Al-Kutub Al-Ilmiyyah, 1417 AH 1996 AD), 7/474.\n\n1. Extracted by Al-Bukhari in his Sahih, Book: Merits of the Ansar, Chapter: Merits of Ubayy bin Ka'b (779) Hadith No (3808), and Al-Tirmidhi in his Jami', Book of Virtues, Chapter: Virtues of Abdullah bin Mas'ud (864) No (3810), and he said: \"Hasan Sahih Hadith\", and Ahmad in his Musnad (2/163).\n2. Reported by Al-Bukhari (4960) and wording is his, and Muslim (799). From the hadith of Anas bin Malik, may Allah be pleased with him.\n3. Reported by At-Tirmidhi (3791), and Al-Nasa'i in ((Al-Sunan Al-Kubra)) (8242), and authenticated by Al-Albani in Sahih At-Tirmidhi (3791).\n4. Musnad Imam Ahmad 7/359 No 4340. Shu'ayb Al-Arna'ut and his team said: \"Authentic with its supporting evidences, and this chain is Hasan\". Al-Albani graded it Hasan in Al-Silsilah Al-Sahihah 5/379 No 2301.\n5. Sahih Al-Bukhari, Book of Virtues of the Qur'an (4716)\n6. Sahih Al-Bukhari, Book of Virtues of the Qur'an - Chapter: Reciters among the Companions of the Prophet, peace be upon him, Hadith No: (4641).\n7. Sahih Muslim Book of Prayer of Travelers, Hadith No 793.\n8. Sahih Al-Bukhari (3925), and see: Al-Taj Al-Jami' lil-Usul fi Ahadith Al-Rasul, Book of Prophethood and Message (3/238).\n9. Extracted by Al-Bukhari (2419), Muslim (818), Abu Dawud (1475), Al-Tirmidhi (2943), Al-Nasa'i (936) and wording is his, and Ahmad (158).\n10. The establishment of Zaid bin Thabit witnessing the Final Presentation is a matter of consideration among verification scholars due to the weakness of narrations reported about it. As for what is established with authentic chains, it is: Abdullah bin Mas'ud's witnessing of it. As for Zaid's witnessing, it is merely famous. Despite its fame, the researcher did not stand upon an authentic established chain relied upon for his witnessing of the Final Presentation except what was rumored in the works of Quranic sciences and some books of Tafsir. Therefore, Al-Baghawi said in \"Sharh al-Sunnah\" (4/525): It is said that Zaid bin Thabit witnessed the Final Presentation, wherein what was abrogated and what remained was clarified. He narrated it with the passive voice indicating weakness \"It is said\" and did not declare his witnessing of it. What is mentioned of Zaid witnessing the Final Presentation in the folds of the research is mentioned in line with what was rumored, famous, and widespread, not on what is established and settled. The Researcher.\n11. Reported by Ahmad in his Musnad, Musnad Bani Hashim (1/598) H 3412, and reported by Al-Nasa'i in Al-Sunan Al-Kubra, Book of Virtues of the Qur'an (3/7), and Book of Virtues (4/36).\n12. Al-Tarikh Al-Islami - Mahmoud Shakir, (p 937-380).\n[*] (Shamela Comment): These two requirements are not in the printed version of the journal and establish in what was sent to us from the author - may Allah preserve him -\n\n1. Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah (90/4).",
    "book_id": "937",
    "new_page_number": 51
  },
  {
    "serial_number": "1144804",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "reciting the Holy Qur'an for women in the presence of men? The Committee answered: Recitation of girls for the Qur'an in the presence of men is not permissible; because of the fear of Fitnah regarding them, and Sharia came to block the means leading to Haram. (1)\nOur Sheikh, the Faqih and Mark Ibn Uthaymeen, may Allah have mercy on him, was asked: What is the ruling on improving the voice in reading the Qur'an for female students before a male teacher in college, even though she is not required to do so? He answered, may Allah have mercy on him, saying: I do not see that she should improve her voice; because Allah Almighty says: (then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech) (Al-Ahzab: 32). So the student bringing the Qur'an in a manner of Ghunnah (nasalization) and improving the voice, Fitnah is feared from it. It is sufficient for her to read the Qur'an in a plain, normal reading. (2).\nThis is while maintaining that the principle for a woman is that she teaches her own gender of women, and the principle for a man is that he teaches his own gender of men, except what need and necessity call for, and with legal controls, and say the same for medication, medical practice, and treatment.\nOur Sheikh, the Mark and Muhaddith Muhammad Nasir al-Din Al-Albani (d. 1421 AH), may Allah have mercy on him, says: If the reciter teaches women via the phone; then they read and let the reciter hear their voice; the ruling is as if he heard their voice from behind a curtain, and does not see their bodies; Fitnah occurs in both ways: He heard their voice via ether and air without the means of these wires, or via wires; the voice is the woman's voice itself. And the woman's voice is not 'Awrah; contrary to what is famous among people; but it is stipulated in that, that her voice be that natural voice; but while she reads with Ghunnah, Iqlab, Izhar, and... and... etc., and Madd Tabie, Muttasil, and Munfasil, and this is Tajweed. And his saying comes, peace be upon him \"He who does not Taghanna (chant) with the Qur'an is not of us (3)\" so she should Taghanna with the Qur'an. It is not appropriate for this to be in front of men at all, whether this is via radio, or via telephone. (4)\nOur Sheikh, the Mark Saleh bin Fawzan Al-Fawzan - may Allah preserve him - was asked: Regarding the woman's voice; there are some programs in reciting the Qur'an where among the participants via phone are women reciting the Qur'an, is there anything in that? He said - may Allah preserve him -: On the radio, you mean?",
    "foot_note": "1. Fatawa of the Standing Committee for Ifta in the Kingdom of Saudi Arabia Number: (5413)\n2. From Fatawa Al-Liqa' Al-Shahri, by Sheikh Ibn Uthaymeen, Meeting No. (42), and see: Islam Question and Answer.\n3. Reported by Al-Bukhari (7527).\n4. Source: Fatawa Jeddah: Tape: 20 / Side One / Minute: 1:47 to Minute: 3:53.",
    "book_id": "937",
    "new_page_number": 52
  },
  {
    "serial_number": "1144805",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "The Questioner: That is what appears, O Sheikh... He answered - may Allah preserve him -: This is not permissible. It is not permissible for her to let men hear her voice and people hear it through the radio. This is not permissible. This is an innovated thing, and it does not exist even in radio stations of the whole world! What exists is not that women read on the radio. This is something they innovated now in our Qur'an radio station, in the radio also the General Program... Ignorant people innovated it. This is not permissible at all. They must be informed and told this is not permissible. Yes, O brother, radio stations of all Arab countries do not have women reading. This radio station is the most deserving of radio stations to act upon the Sunnah and not innovate something that has no precedent in Sharia. (1)\n\nRequirement Two: Women's Tasbih (saying Subhan Allah) in prayer if in the presence of men\nMen's Tasbih and Women's Tasfih (Clapping) for alerting in Prayer\nIt is established in the Two Sahihs from the hadith of Sahl bin Sa'd Al-Sa'idi, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"...Whoever notices something in his prayer, let him say Tasbih (Subhan Allah); for if he says Tasbih, notice will be taken of him. And Tasfih is only for women.\" In a narration: \"Tasfiq (Clapping) is only for women\" (2). Tasfih is: Clapping, as the second narration clarified.\nThe wisdom of differentiating between men and women in alerting during prayer is obvious. The woman is commanded to lower her voice in prayer absolutely; fearing temptation by her in the presence of foreign men. So clapping was legislated for her instead of Tasbih. It was disputed if she is not in the presence of foreign men, should she say Tasbih? It was said she says Tasbih; because Tasbih is a prescribed remembrance in prayer, and due to the absence of the cause; because the Prophet, peace be upon him, intended differentiation by his saying: \"Tasbih is for men and Tasfiq is for women\" if she is in the presence of foreigners, and this is valid. (3) And it was said: She claps absolutely due to the generality of the text, and there is no indication in it of differentiation between the presence of foreign men or absence thereof, and this opinion is stronger due to the apparent meaning of the Hadith. (4)\nIf a woman is required to clap with her Safh, i.e., with her \"palm\" in return and substitution",
    "foot_note": "1. From the lesson \"Al-Muntaqa min Akhbar Sayyid Al-Mursalin\" on: 6/4/1434 AH\n2. Extracted by Al-Bukhari in \"Book of Adhan\" \"Chapter: Whoever entered to lead people then the first Imam came...\" (684), and Extracted by Muslim (421), and Extracted by Al-Nasa'i in \"Book of Imamate\" \"Chapter: If a man from the subjects advances then the governor comes...\" (783).\n3. See: Fath Al-Bari by Ibn Rajab (9/310).\n4. This opinion is the choice of our Sheikh Al-Uthaymeen, may Allah have mercy on him, and there is no doubt it is a valid opinion, where the Sheikh stood with the text. See: His commentary on Muslim (3/127). The researcher says: Even though she may recite aloud in the aloud prayer when leading women.",
    "book_id": "937",
    "new_page_number": 53
  },
  {
    "serial_number": "1144806",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "for what pertains to men of Tasbih in situations of alerting in prayer, which is a place of humility, submission, abasement, presence of heart, stillness of limbs, and glorification of the Lord, Exalted be He, then what do you think of other situations!.\nIf reciting the Qur'an from a reader with a good voice affects the listener and attracts him, there is no doubt that a woman who reads the Qur'an, recites it with Tartil and Tajweed, will try to influence the listeners with all her might as well. She will strive to improve her voice, beautify it, soften it, thin it, and embellish it, and consequently will be more influential. This matter is what opens the door to being tempted by her voice, especially by those with diseased hearts.\n\nRequirement Three: Prohibition of women from being soft in speech (Khudu' bil-Qawl)\nAllah Blessed and Exalted has forbidden the wives of the Prophet, peace be upon him, from being soft in speech. And who are they in honor, high status, and elevated rank?! They are the Mothers of the Believers, the purified, the exonerated. They are among the noblest women of the worlds. They are the ones whom no one matches in virtue, station, status, and destiny. They are the wives of the Prophet, peace be upon him, in this world and the Hereafter. They are mothers to the believers in honor, veneration, appreciation, virtue, status, reverence, glorification, magnification, and aggrandizement. Allah Almighty said: {The Prophet is more worthy of the believers than themselves, and his wives are their mothers.} (Al-Ahzab: 6).\nSheikh Al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: Muslims have agreed on the prohibition of marrying them after his death, peace be upon him, and on the obligation of respecting them. They are mothers of the believers in sanctity and prohibition (of marriage), but they are not mothers of the believers in Mahram-relationship (being unmarriageable kin for viewing/travel). (1).\nThey are the ones whom no human would ever covet. Yet with all that, He, Glory be to Him, said to them: (then do not be soft in speech [to men], lest he in whose heart is disease should covet, but speak with appropriate speech) (Al-Ahzab: 32). This was in the era of the best companions of the best Prophet. Although the address is directed to the wives of the Prophet, peace be upon him, is it not more appropriate that it be directed to the general women of the Ummah as well, as they follow them in that? Especially in the time of alienation (Ghurba), distance from the light of revelation and the niche of Prophethood, prevalence of ignorance, spread and prevalence of vices, abundance and prevalence of the presence of the Ruwaybidah (foolish speaking on public affairs) and empowering them to appear in various media, and abundance of callers to liberation, urbanization, and breaking loose from values and morals in the name of freedom. Not to mention the loud voice of many of those with inverted nature among the callers to moral decay who love that immorality should spread among those who believe. These are the ones whom Allah Almighty threatened with punishment in His saying: (Indeed,",
    "foot_note": "1. See: Minhaj al-Sunnah by Ibn Taymiyyah. (4/207), with adaptation.",
    "book_id": "937",
    "new_page_number": 54
  },
  {
    "serial_number": "1144807",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "those who like that immorality should be spread [or publicized] among those who have believed will have a painful punishment in this world and the Hereafter. And Allah knows and you do not know.) (An-Nur: 19). They are the ones whose eagerness you see to bring pure, chaste women out of their secluded chambers by every means and under the name of any goal.\n\nRequirement Four: Motives for discussing the control of recording the Qur'an (by a \"male\" man's voice)\nFinally, the researcher did not find a discussion of this section or its isolation for research, discussion, and study by any of the contemporary researchers in the context of the section on \"recording the Qur'an\"?! So why was this control discussed then?! And I wonder, what are the motives for his singularity in researching this control, discussing it, and studying it, while no one discussed it in independent research to his knowledge?! Does his discussion count as superfluous talk, and of affectation and arbitrariness for which there is no need to mention originally because it is a matter known intuitively that the one for whom the Qur'an will be recorded must be a male man not a woman, or is it from the core and foundation of the research topic?!\nThe researcher explains the most important of those motives, saying:\nFirst: Among the most important of those motives is rectifying the non-recurrence of that incident which many might consider unlikely to happen originally. Recording the voice of women for the Qur'an actually occurred and recurred in the twenties of the last Gregorian century by some female reciters in Egypt. Those recordings were broadcast on private radio stations, and some were broadcast on international radio stations during World War II. Some of those recordings still exist and circulate, and the researcher has come across some of them, and they are broadcast via modern technical means. (1)",
    "foot_note": "1. - Among these female reciters:\n1. Sheikha Umm Muhammad: The first female reciter of the Holy Qur'an in Egypt. She appeared in the era of \"Muhammad Ali Pasha\" and her habit was to enliven the nights of the month of Ramadan in the Wali's Harem (women's quarters). She used to enliven the nights of mourning in the palaces of army commanders and senior state officials. She was admired by Muhammad Ali, who ordered her to travel to Istanbul to enliven the nights of Ramadan in the Sultan's Harem. Sheikha \"Umm Muhammad\" died late in the rule of Muhammad Ali and was buried in a cemetery built specifically for her in the Imam Al-Shafi'i Mosque, and the funeral procession took place in a great celebration. (With reservation regarding burying the dead in mosques, due to the prohibition reported regarding taking graves as places of worship in many hadiths, including for example his saying - peace be upon him: \"Do not sit on graves, and do not pray towards them.\" Reported by Muslim (972) from the hadith of Abu Marthad Al-Ghanawi, may Allah be pleased with him).\n2. Sheikha Sakina Hassan: The first female voice to record her recitation of the Qur'an on phonograph records.\n3. Sheikha Karima Al-Adliya: The female voice that invaded the private radio stations with Quran recitation. Recently, a recording of her more than a century old was found in which she reads the first part of Surah Al-Isra.\n4. Sheikha Munira Abdo: The youngest female Quran reciter, her voice crossed the borders of Egypt. In her 18th year, the radio broadcast some recitations for her (1920 AD). Although she was blind, she managed to be the only one allowed to read the Qur'an on the radio, and she used to receive 5 pounds for that. Her fame spread until it reached several countries in the Arab world, to the point that a wealthy man from Tunisia offered her to enliven the nights of Ramadan in his palace, but she could not travel.\n5. Sheikha Mabrouka: For whom a recording exactly one hundred years old was discovered, in which she reads the beginning of Surah Al-Isra with her full, resonant voice.\n6. Sheikha Nabawiya Al-Nahhas: Who died in 1973 AD. She used to recite in public and religious occasions, weddings, and funerals. With this, the page of women reciting the Qur'an was folded, and listening to her was restricted to women. For more, see: The book \"Alhan min Al-Sama\" (Melodies from Heaven) by \"Mahmoud Al-Sa'dani\" (p. 36 and following). Al-Sa'dani wrote biographies for them in five pages of his book. These biographies were transferred with adaptation, summarization, arrangement, and refinement by the researcher, and the book has severe observations that are difficult to enumerate.\n7. Sheikha Khoja Ismail: Researcher Ismat Al-Nimr says in an article published by \"Al-Hilal\" magazine: The radio presented in the following week a third female reciter, Sheikha \"Khoja Ismail\". Her first radio recitation came at ten in the morning on Sunday, April 19, 1936. The Egyptian Radio magazine noted on page 16, issue 571 for April 18, 1936, that the number of recitations in the first appearance of Sheikha Khoja Ismail reached three morning recitations on April 19, 21, and 23, 1936 AD.\" Other names of some female reciters also appeared, such as: Munira Ahmed Al-Masri, Hajjah Darbala, Hajjah Khadra in Menoufia, Sitt Aziza in Alexandria, Sitt Ratiba in Mansoura, and Sheikha Umm Zaghloul in Suez. Recitations for most of these female reciters were published in cooperation with Radio \"Masrphone\" which provided those old audio recordings, and some of them are spread on the World Wide Web.",
    "book_id": "937",
    "new_page_number": 55
  },
  {
    "serial_number": "1144808",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "Second: That supporting the return of recording women's recitations on radio stations has become not unlikely; due to the declared positions supporting the necessity of the presence of female reciters of the Qur'an on radio stations. Recently, the desire of some people of shamelessness appeared to record the Qur'an with their voices. One of them requested official permission to record the Qur'an with his voice, and along with him, other voices rose calling for the return of recording the Qur'an with female voices as it was in the twenties of the last Gregorian century. In 1958 AD, newspapers of an Arab country published a proposal to record the entire Qur'an with the voice of a famous female singer whose fame reached the horizons, and that singer had previously dared to record some verses of the Qur'an and broadcast them among creation. This issue had previously been raised in 1950 AD as well.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 56
  },
  {
    "serial_number": "1144809",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "Third: Among the most prominent of those motives is the fear that we might be attacked from within the ranks, making the calamity grave. The head of the Quran Reciters' Syndicate in an Islamic country had previously submitted a request to his country's radio in 2009 AD to approve accepting female reciters of the Qur'an on the radio, shortly after the Syndicate accepted the membership of dozens of female reciters. However, rejection was the fate of that attempt. (1).\n- One of the famous great reciters (2) recorded that stance in press statements saying: \"The voice of a woman is not 'Awrah, due to the Almighty's saying in Surah Al-Ahzab (And when you ask [his wives] for something, ask them from behind a partition) (Al-Ahzab: 53), adding \"The origin in things is permissibility, and what is lawful remains lawful while what is forbidden remains forbidden. Meaning that a woman who speaks with deliberate thinning of her voice, her voice is primarily considered softness in speech (Khudu' bil-Qawl) and it is not permissible for her to recite the Qur'an in this manner, whereas the poised woman who is knowledgeable in the rules of Tajweed and rulings of Tartil, there is no dust on her reading (it is acceptable).\" (3)\nFinally, the wise woman who advises herself and the servants of Allah finds her place in teaching the Holy Qur'an to the daughters of her gender. There is no doubt that in this is a great reward and abundant recompense that only Allah can count, if they are sincere in intention and correct in conscience. Also, in that, there is sufficiency from a woman recording her voice.\nThe researcher asks his Lord to grant him success to follow the path of the believers, and to avoid him and his Muslim brothers from innovation and heresy in religion. And our final call is that praise be to Allah, Lord of the Worlds.\n\nConclusion of the research, and a statement of the most important results reached by this brief study.\n\nA - Conclusion of the Research\nIn the conclusion of this research, the researcher praises his Lord for the success in completing it in a manner he hopes will achieve exoneration before Allah in clarifying the obligation of the Ummah's care for the Book of its Lord from every aspect, especially in the fourth stage of compilation (preserving the Qur'an recorded), and clarifying the duty of",
    "foot_note": "1. - See, The Journey of Ban and Siege for Female Reciters of the Holy Qur'an in Egypt, Sameh Fayez, from Hafryat website, Date: 6/6/2018 AD.\n2. - And despite this, he was at the time the head of the Reciters' Syndicate in an Islamic country until his death - may Allah have mercy on him.\n3. - See, The Journey of Ban and Siege for Female Reciters of the Holy Qur'an in Egypt, Sameh Fayez, from Hafryat website, Date: 6/6/2018 AD. With adaptation.",
    "book_id": "937",
    "new_page_number": 57
  },
  {
    "serial_number": "1144810",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "the concerned authorities in the lands of Islam regarding this duty specifically, and clarifying the correct ways and controls that must be observed when recording the Holy Qur'an.\n\nB - Statement of the Most Important Results\nThis humble and brief study reached numerous results, the clearest of which are:\n1 - That a great duty falls upon the shoulders of the concerned authorities in the lands of Islam regarding the Book of their Lord, especially concerning its recording.\n2 - The concerned authorities must pay attention to the fact that anyone who wishes to proceed with recording the Qur'an must possess a set of heart-based, scientific, and practical ingredients and controls.\n3 - That reading the Qur'an with what is called \"Musical Maqamat\" is a reprehensible matter not based on the practice of the Salaf, and the Qur'an must be purified from it. The consensus of the Salaf, and the consensus of contemporary scholars - as well - took place regarding its prohibition.\n4 - That the control of Quranic Ijazah (Authorization) with its conditions considered by specialists among the people of knowledge and verification is considered one of the most important controls that must be realized in whoever wishes to proceed with recording the Qur'an.\n5 - That the control of recording the Qur'an by the voice of a \"male\" man does not contain any type of arbitrariness or affectation, nor is it a strange opinion. Rather, it is a fundamental condition and control that has its consideration. The researcher has cited enough transmitted and rational evidence to establish the argument against the opponent, just as he clarified and explained the clear path for whoever wants to follow the path of guidance, the way of righteousness, and follow the path of the believers.\n\nIndex of References\n1 - Al-Adhkar (The Remembrances), Author: Abu Zakariya Muhyi al-Din Yahya bin Sharaf Al-Nawawi (Died: 676 AH), Investigation: Abd al-Qadir Al-Arna'ut, may Allah have mercy on him, Publisher: Dar Al-Fikr for Printing, Publishing and Distribution, Beirut - Lebanon, New Revised Edition, 1414 AH - 1994 AD.\n2 - Ighathat al-Lahfan min Masa'id al-Shaytan (Rescuing the Distraught from the Traps of Satan), Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH), Investigator: Muhammad Hamid Al-Faqi, Publisher: Maktabat Al-Ma'arif, Riyadh, Kingdom of Saudi Arabia, Number of Parts: 2.\n3 - Akhlaq Ahl al-Qur'an (Character of the People of the Qur'an), Author: Abu Bakr Muhammad bin Al-Hussein bin Abdullah Al-Ajurri Al-Baghdadi (Died: 360 AH), Investigated and hadiths extracted by: Sheikh Muhammad Amr Abd al-Latif under the supervision of Al-Maktab Al-Salafi for Heritage Verification, Publisher: Dar Al-Kutub Al-Ilmiyyah, Beirut - Lebanon, Edition: Third, 1424 AH - 2003 AD, Number of Parts: 1.",
    "foot_note": "None\n\nNone",
    "book_id": "937",
    "new_page_number": 58
  },
  {
    "serial_number": "1144812",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "4 - Ahkam Qira'at al-Qur'an al-Karim (Rulings of Reciting the Holy Qur'an) - Mahmoud Khalil Al-Husari, died in the year 1401 AH, Investigation: Muhammad Talhah Bilal, Qur'an Memorization Group in Makkah Al-Mukarramah, First Edition 1416 AH - 1995 AD.\n5 - Al-Itqan fi 'Ulum al-Qur'an (The Perfection in the Sciences of the Qur'an), Author: Abd al-Rahman bin Abi Bakr, Jalal al-Din Al-Suyuti (Died: 911 AH), Investigator: Muhammad Abu al-Fadl Ibrahim, Publisher: The Egyptian General Book Organization, Edition: 1394 AH/1974 AD, Number of Parts: 4.\n6 - Al-Idah fi al-Waqf wal-Ibtida' (Clarification in Stopping and Starting): by Ibn Al-Anbari, Damascus ed. 1390 AH - 1971 AD, Investigation: Muhyi al-Din Abd al-Rahman Ramadan, Publications of the Arabic Language Academy.\n7 - Bida' al-Qurra' al-Qadimah wal-Mu'asirah (Old and Contemporary Innovations of Reciters), Author: Bakr bin Abdullah Abu Zaid, Publisher: Dar Al-Faruq, Year of Publication: 1410 - 1990, Ed: 1, Number of Volumes: 1.\n8 - Taj al-Arus min Jawahir al-Qamus (Crown of the Bride from the Jewels of the Dictionary), Author: Muhammad bin Muhammad bin Abd al-Razzaq Al-Husseini, Abu al-Faid, nicknamed Murtada, Al-Zubaidi (Died: 1205 AH), Investigator: A group of investigators, Publisher: Dar Al-Hidayah.\n9 - Tafsir Ibn Kathir: Tafsir al-Qur'an al-Azim: Author: Abu al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH), Investigator: Sami bin Muhammad Salamah, Publisher: Dar Taybah for Publishing and Distribution, 2nd ed., 1420 AH - 1999 AD, Number of Parts: 8.\n10 - Tafsir Ibn Abi Hatim: Tafsir al-Qur'an al-Azim: Author: Abu Muhammad Abd al-Rahman bin Muhammad bin Idris bin Al-Mundhir Al-Tamimi, Al-Hanzali, Al-Razi Ibn Abi Hatim (Died: 327 AH), Investigator: As'ad Muhammad Al-Tayyib, Publisher: Maktabat Nizar Mustafa Al-Baz - Kingdom of Saudi Arabia, Edition: Third - 1419 AH.\n11 - Tafsir Al-Baghawi: Ma'alim al-Tanzil fi Tafsir al-Qur'an, Author: Muhyi al-Sunnah, Abu Muhammad Al-Hussein bin Mas'ud bin Muhammad bin Al-Farra' Al-Baghawi Al-Shafi'i (Died: 510 AH), Investigator: Abd al-Razzaq Al-Mahdi, Publisher: Dar Ihya Al-Turath Al-Arabi - Beirut, Edition: First, 1420 AH, Number of Parts: 5.\n12 - Tafsir Al-Qurtubi: Al-Jami' li-Ahkam al-Qur'an, Author: Abu Abdullah Muhammad bin Ahmad bin Abi Bakr bin Farah Al-Ansari Al-Khazraji Shams al-Din Al-Qurtubi (Died: 671 AH), Investigation: Ahmad Al-Barduni and Ibrahim Atfayish, Publisher: Dar Al-Kutub Al-Masriyyah - Cairo, Edition: Second, 1384 AH - 1964 AD, Number of Parts: 20 parts (in 10 volumes).\n13 - Talbis Iblis (The Devil's Deception), Author: Jamal al-Din Abu al-Faraj Abd al-Rahman bin Ali bin Muhammad Al-Jawzi (Died: 597 AH), Publisher: Dar Al-Fikr for Printing and Publishing, Beirut, Lebanon, Edition: First Edition, 1421 AH/2001 AD, Number of Parts: 1.\n14 - Tanbih al-Ghafilin wa Irshad al-Jahilin 'amma Yaqa'u lahum min al-Khata' hal Tilawatihim li-Kitab Allah al-Mubin (Alerting the Heedless and Guiding the Ignorant regarding Errors occurring during their recitation of the Clear Book of Allah), Author: Ali bin Muhammad bin Salim, Abu al-Hasan Al-Nouri Al-Sfaqisi (Died: 1118 AH), Investigator: Muhammad Al-Shadhili Al-Nayfar, Publisher: Mu'assasat Abd al-Karim bin Abdullah, Number of Parts: 1.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 59
  },
  {
    "serial_number": "1144813",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "15 - Al-Tahdid fi al-Itqan wal-Tajweed (The Specification in Mastery and Tajweed), Author: Uthman bin Saeed bin Uthman bin Umar Abu Amr Al-Dani (Died: 444 AH), Investigator: Dr. Ghanim Qaddouri Hamad, Publisher: Maktabat Dar Al-Anbar - Baghdad / University of Baghdad helped print it, Edition: First 1407 AH - 1988 AD, Number of Parts: 1.\n16 - Jamal al-Qurra' wa Kamal al-Iqra' (Beauty of Reciters and Perfection of Recitation), Author: Ali bin Muhammad bin Abd al-Samad Al-Hamadani Al-Masri Al-Shafi'i, Abu al-Hasan, Alam al-Din Al-Sakhawi (Died: 643 AH), Investigation: Dr. Marwan Al-Attiyah - Dr. Muhsin Kharabah, Publisher: Dar Al-Ma'mun for Heritage - Damascus - Beirut, Edition: First 1418 AH - 1997 AD, Number of Parts: 1.\n17 - Jawab al-I'tiradat al-Masriyyah 'ala al-Futya al-Hamawiyyah (Answer to the Egyptian Objections to the Hamawiyyah Fatwa), ed. ... Uzair Shams; Publisher: Islamic Fiqh Academy - Jeddah; Number of Volumes 1.\n18 - Al-Ri'ayah li-Tajweed al-Qira'ah wa Tahqiq Lafz al-Tilawah (Care for Tajweed of Reading and Verification of Recitation Pronunciation): Author: Makki bin Abi Talib bin Hayyus bin Muhammad bin Mukhtar Al-Qaisi Al-Qayrawani then Al-Andalusi Al-Qurtubi - Investigation: Ahmad Hasan Farhat, Year of Publication: 2018 AD, Ed: 1, Publisher: Dar Ibn Kathir - Damascus - Syria, Number of Volumes: 1.\n19 - Zad Al-Ma'ad fi Hadyi Khayr Al-'Ibad (Provisions for the Hereafter in the Guidance of the Best of Servants), Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH), Publisher: Mu'assasat Al-Risalah, Beirut - Maktabat Al-Manar Al-Islamiyyah, Kuwait, Edition: 27th, 1415 AH / 1994 AD, Number of Parts: 5.\n20 - Al-Zuhd wal-Riqaq (Asceticism and Softening of Hearts) by Ibn Al-Mubarak (followed by \"What Nu'aym bin Hammad narrated in his copy in addition to what Al-Marwazi narrated from Ibn Al-Mubarak in Kitab Al-Zuhd\"), Author: Abu Abd al-Rahman Abdullah bin Al-Mubarak bin Wadih Al-Hanzali, Al-Turki then Al-Marwazi (Died: 181 AH), Investigator: Habib al-Rahman Al-A'zami, Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut, Number of Parts: 1.\n21 - Sharh Al-Allamah Al-Zurqani 'ala Al-Mawahib Al-Ladunniyyah bil-Minah Al-Muhammadiyyah lil-Qastalani (Commentary of the Mark Al-Zurqani on the Divinely Bestowed Talents with Muhammadan Grants by Al-Qastalani), Investigation: Muhammad Abd al-Aziz Al-Khalidi, First Edition, (Beirut: Dar Al-Kutub Al-Ilmiyyah, 1417 AH 1996 AD).\n22 - Al-Khushu' fi Al-Salah (Humility in Prayer) (Third Edition), Saudi Arabia: Maktabat Al-Warraq: (n.d).\n23 - Sharh al-Aqidah al-Tahawiyyah (Explanation of the Tahawi Creed), Author: Sadr al-Din Muhammad bin Ala' al-Din Ali bin Muhammad Ibn Abi al-Izz Al-Hanafi, Al-Adhra'i Al-Salihi Al-Dimashqi (Died: 792 AH), Investigation: A group of scholars, Extraction of hadiths: Nasir al-Din Al-Albani, Publisher: Dar Al-Salam for Printing, Publishing, Distribution and Translation (from the print of the Islamic Office), Edition: First Egyptian Edition, 1426 AH - 2005 AD, Number of Parts: 1.\n24 - Salat al-Mu'min - Mafhum, wa Fada'il, wa Adab, wa Anwa', wa Ahkam, wa Kayfiyatuha fi Daw' al-Kitab wal-Sunnah (The Believer's Prayer - Concept, Virtues, Etiquettes, Types, Rulings, and Method in Light of the Book and Sunnah) (Fourth Edition), Author: Dr. Saeed bin Wahf Al-Qahtani.\n25 - Arafa bin Tantawi: Introduction to his book: (Al-Madkhal Al-Mawsu'i li-Dirasat Al-Tafsir Al-Mawdu'i) (The Encyclopedic Introduction to the Study of Thematic Interpretation).\n26 - Al-'Uddah fi Sharh al-'Umdah fi Ahadith al-Ahkam (The Preparation in Explaining Al-Umdah in Hadiths of Rulings), Author: Ali bin Ibrahim bin Dawud bin Salman bin Sulayman, Abu al-Hasan, Ala' al-Din Ibn al-Attar (Died: 724 AH), Supervised printing and care: Nizam Muhammad Salih Yaqubi, Publisher: Dar Al-Bashair Al-Islamiyyah for Printing, Publishing and Distribution, Beirut - Lebanon, Edition: First, 1427 AH - 2006 AD, Number of Parts: 3.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 60
  },
  {
    "serial_number": "1144814",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "27 - Fath Al-Bari Sharh Sahih Al-Bukhari, Author: Ahmad bin Ali bin Hajar Abu al-Fadl Al-Asqalani Al-Shafi'i, Publisher: Dar Al-Ma'rifah - Beirut, 1379, Numbered its books, chapters and hadiths: Muhammad Fuad Abd al-Baqi, Directed, corrected and supervised printing: Muhibb al-Din Al-Khatib, Commentary by Al-Allamah: Abd al-Aziz bin Abdullah bin Baz, Number of Parts: 13.\n28 - Fadail al-Qur'an (Virtues of the Qur'an): Author: Abu Ubayd Al-Qasim bin Salam bin Abdullah Al-Harawi Al-Baghdadi (Died: 224 AH), Investigation: Marwan Al-Attiyah, Muhsin Kharabah, and Wafa Taqi Al-Din, Publisher: Dar Ibn Kathir (Damascus - Beirut), Edition: First, 1415 AH - 1995 AD.\n29 - Fadail al-Qur'an: Author: Abu al-Fida Ismail bin Umar bin Kathir Al-Qurashi Al-Basri then Al-Dimashqi (Died: 774 AH), Publisher: Maktabat Ibn Taymiyyah, Edition: First Edition - 1416 AH, Number of Parts: 1.\n30 - Fatawa Al-Lajnah Al-Da'imah (Fatwas of the Standing Committee) - First Group, Author: Standing Committee for Scientific Research and Ifta, Collection and Arrangement: Ahmed bin Abd al-Razzaq Al-Duwish, Number of Parts: 26 parts, Publisher: Presidency of the Administration of Scientific Research and Ifta - General Administration for Printing - Riyadh.\n31 - Al-Qat' wal-I'tinaf (Stopping and Resuming), Author: Abu Ja'far Ahmad bin Muhammad bin Ismail Al-Nahhas, Investigator: Dr. Abd al-Rahman bin Ibrahim Al-Matroudi, Publisher: Dar Alam Al-Kutub - Kingdom of Saudi Arabia, Edition: First, 1413 AH - 1992 AD.\n32 - Al-Qamus Al-Muhit (The Surrounding Dictionary), Author: The Linguist Scholar Majd al-Din Muhammad bin Yaqub Al-Fairuzabadi died 817 AH, Investigation: Heritage Investigation Office at Mu'assasat al-Risalah, under supervision of: Muhammad Na'im Al-Arqsus, Publisher: Mu'assasat al-Risalah for Printing, Publishing and Distribution, Beirut - Lebanon, Edition: Eighth, 1426 AH - 2005 AD, Number of Parts 1.\n33 - Lisan Al-Arab (The Tongue of Arabs), by Ibn Manzur (5/95). Lisan Al-Arab Author: Muhammad bin Mukarram bin Ali, Abu al-Fadl, Jamal al-Din Ibn Manzur Al-Ansari Al-Ruwayfi'i Al-Ifriqi (Died: 711 AH), Publisher: Dar Sader - Beirut, Edition: Third - 1414 AH, Number of Parts: 15.\n34 - Majmu' Al-Fatawa (Collection of Fatwas), Author: Taqi al-Din Abu al-Abbas Ahmad bin Abd al-Halim bin Taymiyyah Al-Harrani (d: 728 AH), Investigator: Abd al-Rahman bin Muhammad bin Qasim, Publisher: King Fahd Complex for the Printing of the Holy Quran, The Prophetic City, Kingdom of Saudi Arabia, 1416 AH - 1995 AD.\n35 - Majmu' Fatawa Al-Allamah Abd al-Aziz bin Baz, may Allah have mercy on him, Author: Abd al-Aziz bin Abdullah bin Baz (Died: 1420 AH), Supervised collection and printing: Muhammad bin Sa'd Al-Shuway'ir, Number of Parts: 30 parts.\n36 - Miftah Dar Al-Sa'adah wa Manshur Wilayat Al-Ilm wal-Iradah (Key to the Abode of Happiness and the Patent of the Authority of Knowledge and Will), Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH), Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut, Number of Parts: 2 in 1 volume.\n37 - Mu'jam Maqayis al-Lughah (Dictionary of Language Standards) by Abu al-Hussein Ahmad bin Faris, died 395 AH, Investigation: Shihab al-Din Abu Amr, Dar Al-Fikr, Beirut, First Edition 1415 AH.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 61
  },
  {
    "serial_number": "1144815",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "38 - Al-Muwatta, Author: Malik bin Anas bin Malik bin Amir Al-Asbahi Al-Madani (Died: 179 AH), Investigator: Muhammad Mustafa Al-A'zami, Publisher: Zayed bin Sultan Al Nahyan Charitable and Humanitarian Foundation - Abu Dhabi - UAE, Edition: First, 1425 AH - 2004 AD, Number of Parts: 8.\n39 - Al-Muwafaqat by Al-Shatibi: Author: Ibrahim bin Musa bin Muhammad Al-Lakhmi Al-Gharnati famous as Al-Shatibi (Died: 790 AH), Investigator: Abu Ubaidah Mashhoor bin Hasan Al-Salman, Publisher: Dar Ibn Affan, Edition: First Edition 1417 AH / 1997 AD, Number of Parts: 7.\n40 - Mir'at al-Mafatih Sharh Mishkat al-Masabih, Author: Abu al-Hasan Ubayd Allah bin Muhammad Abd al-Salam bin Khan Muhammad bin Aman Allah bin Husam al-Din al-Rahmani al-Mubarakpuri (Died: 1414 AH), Publisher: Department of Scientific Research, Da'wah and Ifta - Salafi University - Banaras, India, Edition: Third - 1404 AH, 1984 AD.\n41 - Al-Murshid Al-Wajiz ila 'Ulum Tata'allaq bi-l-Kitab al-Aziz (The Brief Guide to Sciences Related to the Mighty Book), Author: Abu al-Qasim Shihab al-Din Abd al-Rahman bin Ismail bin Ibrahim Al-Maqdisi Al-Dimashqi known as Abu Shama (Died: 665 AH), Investigator: Tayyar Altikulac, Publisher: Dar Sader - Beirut, Year of Publication: 1395 AH - 1975 AD, Number of Parts: 1.\n42 - Manar al-Huda fi Bayan al-Waqf wal-Ibtida' wa ma'ahu Al-Maqsad li-Talkhis ma fi Al-Murshid (Lighthouse of Guidance in Explaining Stopping and Starting, accompanied by The Purpose in Summarizing what is in The Guide), Author of Manar al-Huda: Ahmad bin Abd al-Karim bin Muhammad bin Abd al-Karim Al-Ashmuni Al-Masri Al-Shafi'i (Died: around 1100 AH), Author of Al-Maqsad li-Talkhis ma fi Al-Murshid: Zakariya bin Muhammad bin Ahmad bin Zakariya Al-Ansari, Zain al-Din Abu Yahya Al-Sunaiki (Died: 926 AH), Investigator: Sharif Abu al-Ala Al-Adawi, Publisher: Dar Al-Kutub Al-Ilmiyyah - Beirut, Edition: First, 1422 AH - 2002 AD, Number of Parts: 1.\n43 - Madarij al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in (Ranks of the Seekers between the Stations of 'You we worship and You we ask for help'), Author: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died: 751 AH), Investigator: Muhammad Al-Mu'tasim Billah Al-Baghdadi, Publisher: Dar Al-Kitab Al-Arabi - Beirut, Edition: Third, 1416 AH - 1996 AD, Number of Parts: 2.\n44 - Mukhtasar Qiyam al-Layl wa Qiyam Ramadan wa Kitab al-Witr (Abridgment of Night Prayer, Ramadan Prayer, and Book of Witr), Author: Abu Abdullah Muhammad bin Nasr bin Al-Hajjaj Al-Marwazi (Died: 294 AH), Abridged by: The Scholar Ahmad bin Ali Al-Maqrizi, Publisher: Hadith Academy, Faisalabad - Pakistan, Edition: First, 1408 AH - 1988 AD, Number of Parts: 1.\n45 - Al-Mawsu'ah Al-Fiqhiyyah Al-Kuwaitiyyah (Kuwaiti Fiqh Encyclopedia), Issued by: Ministry of Awqaf and Islamic Affairs - Kuwait, Number of Parts: 45 parts, Edition: (from 1404 - 1427 AH) .. Parts 1-23: Second Edition, Dar Al-Salasil - Kuwait .. Parts 24-38: First Edition, Matabi' Dar Al-Safwah - Egypt .. Parts 39-45: Second Edition, Ministry Printing. Note: Biographies of Jurists in the paper original are appended to the end of each volume, so they were collected here - in this electronic book - at the end of the Encyclopedia to facilitate access to them, while maintaining pagination.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 62
  },
  {
    "serial_number": "1144816",
    "category_id": "5",
    "category": "Tajweed and Quran Readings",
    "book_title": "Mastery in the Controls of Recording the Qur'an",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "46 - Scientific Standards for Teaching the Holy Qur'an in the Field of Quranic Ijazah with Connected Chain to the Messenger of Allah, peace be upon him, Global Council of Sheikhs of Recitation, Date: 25 Rabi' al-Thani 1440 AH.\n47 - Al-Nashr fi al-Qira'at al-Ashr (The Publication in the Ten Readings), Author: Shams al-Din Abu al-Khair Ibn al-Jazari, Muhammad bin Muhammad bin Yusuf (Died: 833 AH), Investigator: Ali Muhammad Al-Dabba' (Died 1380 AH), Publisher: Al-Matba'ah Al-Tijariyyah Al-Kubra [Reprint Dar Al-Kitab Al-Ilmiyyah], Number of Parts: 2.\n48 - Al-Nihayah fi Gharib al-Hadith wal-Athar (The Ultimate in Strange Hadith and Narrations), Author: Majd al-Din Abu al-Sa'adat al-Mubarak bin Muhammad bin Muhammad bin Muhammad Ibn Abd al-Karim Al-Shaybani Al-Jazari Ibn al-Athir (Died: 606 AH), Publisher: Al-Maktabah Al-Ilmiyyah - Beirut, 1399 AH - 1979 AD, Investigation: Tahir Ahmad Al-Zawi - Mahmoud Muhammad Al-Tanahi, Number of Parts: 5.",
    "foot_note": "None",
    "book_id": "937",
    "new_page_number": 63
  }
]