[
  {
    "text": "Usul al-Shashi\nAuthor: أبو علي الشاشي\nYear: 344",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Usul al-Shashi",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 3700\nbook_title: أصول الشاشي\nbook_link: https://shamela.ws/book/6302\nbook_id: 6302\nauthor_name: أبو علي الشاشي\nauthor_year: 344\nnickname: أبو علي\nauthor_link: https://shamela.ws/author/1694\nauthor_ID: 1694\neditor: Null\npublisher: دار الكتاب العربي، بيروت - لبنان\nedition: 1402 هـ - 1982 م\npages: 394\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Usul al-Shashi",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "3420471",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Principles of Jurisprudence\nBook: Usul al-Shashi\nAnd on its margin: 'Umdat al-Hawashi by the Mawla Muhammad Fayd al-Hasan al-Gangohi\nAuthor: Abu Ali al-Shashi (Died 344 AH)\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Repeated Metadata]:\nBook: Usul al-Shashi\nAnd on its margin: 'Umdat al-Hawashi by the Mawla Muhammad Fayd al-Hasan al-Gangohi\nAuthor: Abu Ali al-Shashi (Died 344 AH)\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAnd on its margin: 'Umdat al-Hawashi by the Mawla Muhammad Fayd al-Hasan al-Gangohi\nAuthor: Abu Ali al-Shashi (Died 344 AH)\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Abu Ali al-Shashi (Died 344 AH)\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nYear of Publication: 1402 AH - 1982 CE\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book pagination matches the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 3
  },
  {
    "serial_number": "3420472",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 13,
    "volume_number": 1,
    "text": "Discussion: The Principles of Jurisprudence are Four\n\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, who raised the status of the believers through His noble address, elevated the rank of the scholars through the meanings of His Book, and singled out those among them who deduce [rulings] with increased correctness and reward.\nBlessings be upon the Prophet and his Companions, and peace be upon Abu Hanifa and his beloveds.\n\nTo proceed: The sources of Jurisprudence (Usul al-Fiqh) are four: The Book of Allah Almighty, the Sunnah of His Messenger, the Consensus (Ijma') of the Nation (Ummah), and Analogy (Qiyas).\nIt is necessary to discuss each one of these sections so that the method of extracting rulings may be known thereby.\n\nThe First Discussion: Regarding the Book of Allah Almighty\n\n1 - Chapter on the Specific (al-Khass) and the General (al-Amm)\nThe Specific (al-Khass) is a word coined for a known meaning or a known named entity in isolation. Such as our saying regarding the specification of an individual: \"Zayd\"; and regarding the specification of a type: \"Man\"; and regarding the specification of a genus: \"Human\".",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 4
  },
  {
    "serial_number": "3420473",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 17,
    "volume_number": 1,
    "text": "1 - 1 Discussion of the General (al-Amm) and the Specific (al-Khass)\n\nThe General (al-Amm) is every word that encompasses a group of individuals, either by wording, such as our saying \"Muslims\" and \"Polytheists\", or by meaning, such as our saying \"Man\" (Whoever) and \"Ma\" (What/That which).\n\nThe rule of the Specific (al-Khass) in the Book is the obligation to act upon it inevitably. If a singular report (Khabar al-Wahid) or Analogy (Qiyas) contradicts it, then if it is possible to reconcile them without changing the ruling of the Specific, both are acted upon. Otherwise, the Book is acted upon and what contradicts it is abandoned.\n\nAn example of this is in His Almighty's saying: {They (women) shall wait concerning themselves for three Quru' (menstrual periods/purities)} [2:228].\nThe word \"Three\" is Specific in defining a known number, so it is obligatory to act upon it. Even if \"al-Aqra'\" (plural of Quru') were interpreted as \"purities\" (al-Athar)—as al-Shafi'i went to, considering that \"Tuhr\" (purity) is masculine while \"Hayd\" (menstruation) is not, and the Book used the plural form with the feminine marker [Thalathata], indicating that the plural of the masculine (which is Purity) is intended—it would necessitate abandoning action with this Specific [number]. This is because interpreting it as purity does not necessitate three purities, but rather two purities and part of the third, which is the one in which the divorce occurred. Based on this, the ruling of returning (Raj'ah) in the third menstruation and its expiration, the validation of marriage to another and its invalidation, the ruling of imprisonment and release, housing and spending, Khul' and divorce, the husband marrying her sister or four others besides her, and the rules of inheritance with their numerous calculations, are all derived. And likewise His Almighty's saying...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 5
  },
  {
    "serial_number": "3420474",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 20,
    "volume_number": 1,
    "text": "2 - 2 Discussion of the Division of the General into Two Parts\n\n{We already know what We have ordained for them concerning their wives} [33:50] is Specific regarding the legal estimation. Therefore, acting upon it is not abandoned by considering it a financial contract and thus comparing it to [other] financial contracts where the estimation of money is entrusted to the opinion of the spouses, as mentioned by al-Shafi'i.\nIt branches from this that freeing oneself for voluntary worship is better than occupying oneself with marriage. And He permitted its termination by divorce however the husband wishes, whether combined or separated. And He permitted sending three [divorces] at once. And He made the marriage contract susceptible to annulment by Khul'.\n\nLikewise, His Almighty's saying: {Until she marries a husband other than him} [2:230] is Specific regarding the existence of marriage (Nikah) by the woman. So, acting upon it is not abandoned due to what was narrated from the Prophet, peace be upon him: \"Any woman who marries herself without the permission of her guardian, her marriage is void, void, void.\" From this stems the disagreement regarding the lawfulness of intercourse, the obligation of the dowry, maintenance, housing, the occurrence of divorce, and [the validity of] marriage after three divorces, according to what his earlier companions held, contrary to what the later ones among them chose.\n\nAs for the General (al-Amm), it is of two types: A General from which some parts have been specified, and a General from which nothing has been specified. The latter is like the Specific in terms of the obligation to act upon it inevitably. Based on this, we said: If the hand of a thief is cut off after the stolen item has perished in his possession, no compensation (Daman) is obligated upon him, because the cutting is the recompense for all that he acquired.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 6
  },
  {
    "serial_number": "3420475",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 23,
    "volume_number": 1,
    "text": "1 - 3 Discussion on the Generality of the word \"Ma\" (What/That which)\n\nIndeed, the word \"Ma\" is General, encompassing all that is found with the thief. By estimating the obligation of compensation, the penalty would become the combination [of cutting and paying], and acting upon the Analogy (Qiyas) with Usurpation (Ghasb) is not abandoned.\nThe evidence that the word \"Ma\" is General is what Muhammad, may Allah have mercy on him, mentioned: If a master says to his slave girl, \"If *what* (Ma) is in your womb is a boy, then you are free,\" and she gives birth to a boy and a girl, she is not set free.\n\nSimilarly, we say regarding His Almighty's saying: {So read what is easy [for you] of the Quran} [73:20]. It is General regarding all that is easy of the Quran. A necessity of this is that permissibility [of prayer] does not depend on the recitation of Al-Fatiha.\nHowever, it came in the Report (Hadith) that he said: \"There is no prayer except with the Fatiha of the Book.\" So we acted upon both in a way that the ruling of the Book does not change, by interpreting the Report as negating perfection, such that absolute recitation is Fard (obligatory) by the ruling of the Book, and the recitation of Al-Fatiha is Wajib (necessary) by the ruling of the Report.\n\nWe said likewise regarding His Almighty's saying: {And do not eat of that on which the name of Allah has not been mentioned} [6:121], that it necessitates the prohibition of what is intentionally left without the Tasmiyah (mentioning Allah's name). Yet it came in the Report that he, peace be upon him, was asked about the one who intentionally omits the Tasmiyah, and he said: \"Eat it, for the name of Allah Almighty is in the heart of every Muslim man.\" It is not possible to reconcile them, because if lawfulness were established when leaving it intentionally, lawfulness would be established when leaving it forgetfully; in that case, the ruling of the Book would be lifted, so the Report is abandoned.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 7
  },
  {
    "serial_number": "3420476",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 26,
    "volume_number": 1,
    "text": "1 - 4 Discussion of the General from which Some has been Specified\n\nLikewise, His Almighty's saying: {And your mothers who breastfed you} [4:23] implies by its Generality the prohibition of marriage to the wet nurse [regardless of the amount]. However, it came in the Report: \"One suck does not prohibit, nor do two sucks, nor one imlajah (suckling), nor two imlajahs.\" It was not possible to reconcile between them, so the Report is abandoned.\n\n(As for the General from which some has been specified, its ruling is:) It is obligatory to act upon it regarding the remainder, albeit with probability [rather than absolute certainty].\nSo if evidence is established for the specification of the remainder, it is permissible to specify it by a singular report (Khabar al-Wahid) or Analogy (Qiyas), until [only] one third remains; after that, it is not permissible [to specify further], so acting upon it becomes obligatory.\nThis is permitted because the Specifier (Mukhassis) that excluded 'some' from the 'whole'—if it excluded an unknown portion—establishes probability in every specific individual, so it is possible that it remains under the ruling of the General, and it is possible that it enters under the evidence of the specification. Thus, the two sides become equal regarding the specific individual. So if legal evidence is established that it is among what entered under the evidence of specification, the side of its specification is preferred.\nAnd if the Specifier excluded a known portion from the whole, it is possible that it is caused by a cause (illah) present in this specific individual. So if legal evidence stands for the existence of that cause in other than this specific individual, the direction of its specification is preferred, so it is acted upon despite the existence of probability.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 8
  },
  {
    "serial_number": "3420477",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Second Chapter: Chapter on the Absolute (Mutlaq) and the Restricted (Muqayyad)\n\n2 - / 1 Discussion of the Absolute\nIf it is possible to act upon it, adding to it is not permitted.\nOur companions went to the view that the Absolute (Mutlaq) in the Book of Allah Almighty, if it is possible to act upon its absolute nature, then adding to it by a singular report or Analogy is not permitted.\n\nAn example is in His Almighty's saying: {So wash your faces} [5:6]. The commanded act is washing in the absolute sense. Therefore, the condition of Intention (Niyyah), Order (Tartib), Continuity (Muwalat), and Tasmiyah based on the Report are not added to it. However, the Report is acted upon in a way that the ruling of the Book is not changed. So it is said: The Absolute Washing is Fard (Obligatory) by the ruling of the Book, and the Intention is Sunnah by the ruling of the Report.\n\nLikewise, we said regarding His Almighty's saying: {The woman and the man guilty of illegal sexual intercourse, flog each of them with a hundred stripes} [24:2]. Indeed, the Book made the flogging of a hundred a Hadd (limit/punishment) for Zina. Therefore, Exile (Taghrib) is not added to it as a Hadd due to his saying, peace be upon him: \"The virgin with the virgin: flogging of a hundred and exile for a year.\" Rather, the Report is acted upon in a way that the ruling of the Book is not changed, so the flogging is a legal Hadd by the ruling of the Book, and the Exile is legislated as a policy (Siyasah) by the ruling of the Report.\n\nLikewise, His Almighty's saying: {And let them circumambulate the Ancient House} [22:29] is Absolute regarding the named action of Tawaf around the House. So the condition of Wudu is not added to it by the Report. Rather, it is acted upon in a way that the ruling of the Book is not changed, such that the Absolute Tawaf is Fard by the ruling of the Book, and Wudu is Wajib by the ruling of the Report. Thus, the deficiency caused by leaving the Wajib Wudu is compensated for by [sacrificing] blood.\n\nLikewise, His Almighty's saying: {And bow with those who bow}...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 9
  },
  {
    "serial_number": "3420478",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 33,
    "volume_number": 1,
    "text": "2 - / 2 Discussion on the Permissibility of Performing Wudu with Saffron Water and its Likes\n\n...is Absolute regarding the named action of Ruku' (bowing). Therefore, the condition of Ta'dil (composure/stillness) is not added to it by the ruling of the Report. However, the Report is acted upon in a way that the ruling of the Book is not changed, so the Absolute Bowing is Fard by the ruling of the Book, and the Ta'dil is Wajib by the ruling of the Report.\n\nBased on this, we said: It is permissible to perform Wudu with saffron water and with every water that a pure substance has mixed with and changed one of its qualities. This is because the condition for resorting to Tayammum is the absence of Absolute Water, and this remains water in an absolute sense. For indeed, the restriction of the addition [i.e., calling it saffron water] did not remove the name of 'Water' from it, but rather established it, so it enters under the ruling of Absolute Water. The condition of it remaining on the attribute of being sent down from the sky was a restriction for this Absolute.\nBy this, the ruling of saffron water, soap [water], potash [water], and their likes is derived.\nExcluded from this proposition is impure water due to His Almighty's saying: {But He wants to purify you} [5:6], and the impure does not impart purity. By this indication, it is known that Hadath (ritual impurity) is a condition for the obligation of Wudu, for acquiring purity without the existence of Hadath is impossible.\n\nAbu Hanifa, may Allah be pleased with him, said: If the one performing Dhihar has intercourse with his wife during the feeding [expiation], he does not restart the feeding. This is because the Book is Absolute regarding the right of feeding, so the condition of non-touching is not added to it by Analogy with Fasting. Rather, the Absolute runs upon its absoluteness, and the Restricted upon its restriction.\nLikewise, we said: The 'Neck' (slave) in the expiation of Dhihar and Oath is Absolute, so the condition of Faith is not added to it by Analogy with the expiation of Murder.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 10
  },
  {
    "serial_number": "3420479",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 36,
    "volume_number": 1,
    "text": "Discussion of the Homonym (al-Mushtarak) and the Interpreted (al-Mu'awwal)\n\nIf it is said that the Book, regarding wiping the head, mandates the wiping of an absolute 'part', yet you restricted it to the amount of the forelock based on the Report; and the Book is Absolute regarding the end of the severe prohibition by marriage [in the case of the thrice-divorced woman], yet you restricted it to 'intercourse' based on the Hadith of the wife of Rifa'ah?\nWe say: The Book is not Absolute in the chapter of Wiping. For the ruling of the Absolute is that one who brings any individual [member of the category] is considered as bringing the commanded act. But the one who brings *any* portion here is not considered as bringing the commanded act; for if he wiped half or two-thirds, the whole would not be Fard. By this, the Absolute differs from the Ambiguous (Mujmal).\nAs for the restriction of 'Intercourse', some said that 'Nikah' (marriage) in the text is interpreted as Intercourse, since the contract is utilized from the word 'Husband' (Zawj) [in the verse \"until she marries a husband other than him\"], and by this, the question is removed. And some said: The restriction of 'Intercourse' is established by the Report, and they made it among the Well-Known (Mashahir) reports, so they are not bound by restricting the Book by a singular report.\n\nThe Third Chapter: Chapter on the Homonym (al-Mushtarak) and the Interpreted (al-Mu'awwal)\n\nThe Homonym (al-Mushtarak) is that which was coined for two different meanings or for meanings of different realities.\nAn example is our saying \"Jariyah\", for it covers the female slave and the ship.\nAnd \"al-Mushtari\", for it covers the acceptor of a sale contract and the star in the sky (Jupiter).\nAnd our saying \"Ba'in\", for it implies separation (Bayn) and clarity (Bayan).\nThe rule of the Homonym is that if one meaning is designated as intended...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 11
  },
  {
    "serial_number": "3420480",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 39,
    "volume_number": 1,
    "text": "...the consideration of intending the other falls.\nFor this reason, the scholars, may Allah Almighty have mercy on them, agreed that the word \"Quru'\" mentioned in the Book of Allah Almighty is carried either upon Menstruation, as is our school, or upon Purity, as is the school of al-Shafi'i.\n\nMuhammad said: If one makes a bequest to the Mawali (clients) of the tribe of so-and-so, and the tribe of so-and-so has Mawali from above (freedmen who freed them) and Mawali from below (freed slaves), and he dies, the bequest becomes void regarding both groups due to the impossibility of combining them and the lack of preponderance.\n\nAbu Hanifa said: If one says to his wife, \"You are upon me like my mother,\" he is not a Dhahir (one who pronounces Zihar) because the wording is shared (Mushtarak) between Honor and Prohibition, so the side of Prohibition is not preferred except by Intention.\n\nBased on this, we said: A counterpart is not obligated in the penalty of hunting regarding His Almighty's saying: {The compensation is an equivalent of what he killed of livestock} [5:95], because \"Al-Mithl\" (Equivalent/Like) is shared between the equivalent in form and the equivalent in meaning, which is the Value. The equivalent in terms of meaning is intended by this text in [the case of] killing, since there is no generality for the Homonym at all, so the consideration of form falls due to the impossibility of combination.\n\nThen, if one of the aspects of the Homonym is preferred by predominant opinion, it becomes Interpreted (Mu'awwal). The rule of the Interpreted is the obligation to act upon it with the probability of error.\nAn example in legal rulings is what we said: If \"Price\" is used absolutely in a sale, it is based on the predominant currency of the land, and that is by way of Interpretation (Ta'wil). If the currencies differ, the sale is invalid based on what we mentioned.\nAnd carrying \"al-Aqra'\" (Quru') upon menstruation...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 12
  },
  {
    "serial_number": "3420481",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 42,
    "volume_number": 1,
    "text": "Discussion of the Literal (Haqiqah) and Metaphorical (Majaz)\n\n...[and] carrying \"Nikah\" in the verse upon Intercourse, and carrying Metaphors (Kinayat) during the discussion of divorce upon Divorce, are of this category.\n\nBased on this, we said: The debt that prevents Zakat is deducted from the easiest of the two assets to pay the debt.\nMuhammad branched from this and said: If one marries a woman for a Nisab (minimum amount), and he has a Nisab of sheep and a Nisab of Dirhams, the debt is directed to the Dirhams; so even if a year passes over both of them, Zakat is obligatory upon him in the Nisab of sheep, and it is not obligatory in the Dirhams.\n\nIf one of the aspects of the Homonym is preferred by a clarification from the speaker, it is Explained (Mufassar). Its rule is that it is obligatory to act upon it with certainty.\nAn example is if he says: \"I owe so-and-so ten Dirhams of Bukhari currency.\" His saying \"of Bukhari currency\" is an explanation for it. Were it not for that, it would have been directed to the predominant currency of the land by way of Interpretation. Thus, the Explained takes precedence, so the currency of the land is not obligatory.\n\nThe Fourth Chapter: Chapter on the Literal (Haqiqah) and Metaphorical (Majaz)\n\nEvery word that the coiner of the language placed opposite a thing is a Literal (Haqiqah) for it. If it is used for other than it, it is a Metaphor (Majaz), not a Literal.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 13
  },
  {
    "serial_number": "3420482",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 43,
    "volume_number": 1,
    "text": "Then, the Literal (Haqiqah) and the Metaphorical (Majaz) cannot be combined in intention from a single word in a single state. For this reason, we said: When what is contained within the Sa' (a unit of measurement) is intended by his saying, upon him be peace, (Do not sell a Dirham for two Dirhams, nor a Sa' for two Sa's), consideration of the Sa' itself drops, to the extent that selling one of it for two becomes permissible [if the vessel is meant, not the content]. And when intercourse is intended by the verse of 'touching' (Mulamasah), consideration of the intention of touching with the hand drops.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 14
  },
  {
    "serial_number": "3420483",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Literal and the Metaphorical: Muhammad said: If one makes a bequest to his Mawali (freed slaves/clients), and he has Mawali whom he freed, and his Mawali have Mawali whom they freed, the bequest is for his [direct] Mawali to the exclusion of the Mawali of his Mawali. In Al-Siyar Al-Kabir: If the people of war seek safety (Aman) for their fathers, the grandfathers are not included in the safety; and if they seek safety for their mothers, safety is not established for the grandmothers. Based on this, we said: If one makes a bequest to the virgins of the Banu Fulan, the one who has lost her virginity through immorality is not included in the ruling of the bequest. If one makes a bequest to the sons of Fulan, and he has sons and sons of his sons, the bequest is for his sons to the exclusion of the sons of his sons. Our companions said: If he swore not to marry such-and-such woman, and she is a stranger (non-mahram), this applies to the contract; so even if he commits adultery with her, he does not break the oath. However, if he said: 'If he swears not to set his foot in the house of Fulan,' he breaks the oath if he enters it barefoot, wearing shoes, or riding. Likewise, if he swears not to dwell in the house of Fulan, he breaks the oath if the house is owned by Fulan, or is rented, or borrowed. This is a combination of the Literal and the Metaphorical. Similarly, if he said his slave is free 'the day Fulan arrives,' and Fulan arrives at night or during the day, he breaks the oath. We said: 'Setting the foot' has become a metaphor for entering by the ruling of custom, and entering does not differ in the two cases. And 'the house of Fulan' has become a metaphor for a house inhabited by him, and that does not differ whether it is owned by him or rented by him.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 15
  },
  {
    "serial_number": "3420484",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 49,
    "volume_number": 1,
    "text": "4 - / 1 Discussion on the division of the Literal (Haqiqah) into three categories: 'The day' in the issue of arrival is an expression for absolute time, because 'the day,' when annexed to an act that does not extend, becomes an expression for absolute time as is known; so the breaking of the oath was by this method, not by the method of combining the Literal and the Metaphorical. Then, the Literal is of three types: Impossible (Muta'adhdhira), Abandoned (Mahjura), and Used (Musta'mala). In the first two categories, one resorts to the Metaphorical by agreement. An example of the Impossible: If he swears not to eat from this tree or from this pot, for indeed eating the tree or the pot is impossible, so this is diverted to the fruit of the tree and to what is contained in the pot, such that if he ate from the substance of the tree or the substance of the pot with some type of affectation, he does not break the oath. Based on this, we said: If he swears not to drink from this well, this is diverted to scooping [water], such that if we assumed that if he drank directly with his mouth (Kara') with some type of affectation, he does not break the oath by agreement. An example of the Abandoned: If he swears not to place his foot in the house of Fulan, for indeed the intention of merely placing the foot is abandoned customarily. Based on this, we said: Appointing an agent for the 'dispute' itself is diverted to the absolute response to the opponent, such that it is permissible for the agent to answer with 'Yes' just as it is permissible for him to answer with 'No,' because appointing an agent for the dispute itself is abandoned legally and customarily.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 16
  },
  {
    "serial_number": "3420485",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 50,
    "volume_number": 1,
    "text": "And if the Literal is Used (Musta'mala), then if it does not have a customary Metaphorical meaning, the Literal takes precedence without disagreement. But if it has a customary Metaphorical meaning...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 17
  },
  {
    "serial_number": "3420486",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 52,
    "volume_number": 1,
    "text": "4 - / 2 Discussion on the Metaphorical being a substitute for the Literal according to Abu Hanifa: The Literal takes precedence according to Abu Hanifa, while according to them (Abu Yusuf and Muhammad), acting upon the generality of the Metaphor takes precedence. Example: If he swears not to eat from this wheat; it is diverted to the substance itself according to him (Abu Hanifa), such that if he eats from the bread made from it, he does not break the oath according to him. According to them, it is diverted to what the wheat implies by way of the generality of the Metaphor, so he breaks the oath by eating it [the grain] and by eating the bread made from it. Likewise, if he swears not to drink from the Euphrates; it is diverted to drinking from it directly with the mouth according to him. According to them, it is diverted to the customary Metaphor, which is drinking its water by any method. Then, the Metaphor according to Abu Hanifa is a substitute for the Literal regarding the wording, and according to them, it is a substitute for the Literal regarding the ruling. So, if the Literal is possible in itself but acting upon it is prevented due to an impediment, one resorts to the Metaphor, otherwise the speech becomes void. According to him, one resorts to the Metaphor even if the Literal is not possible in itself. Examples of this: If he says to his slave who is older than him in age, 'This is my son,' one does not resort to the Metaphor according to them due to the impossibility of the Literal. According to him, one resorts to the Metaphor so that the slave is emancipated.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 18
  },
  {
    "serial_number": "3420487",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 53,
    "volume_number": 1,
    "text": "Based on this, the ruling is derived in his saying: 'He is owed a thousand by me, or [it is] upon this wall,' and his saying: 'My slave or my donkey is free.' And this is not binding [as a counter-argument] if he says to his wife, 'This is my daughter,' while she has a known lineage from someone else, where she does not become prohibited to him.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 19
  },
  {
    "serial_number": "3420488",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 56,
    "volume_number": 1,
    "text": "And that is not made a metaphor for divorce, whether the woman is younger than him in age or older, because this utterance, if its meaning were valid, would be negating the marriage, thus negating its ruling, which is divorce. And there is no borrowing (Isti'arah) with the existence of negation, contrary to his saying 'This is my son,' for indeed sonship does not negate the establishment of ownership for the father; rather, ownership is established for him, then he [the slave/son] is emancipated upon him. Chapter Five: A chapter on defining the method of Borrowing (Metaphor/Isti'arah). Know that Isti'arah in the rulings of the Sharia is consistent through two methods: One of them is due to the existence of a connection between the Cause ('Illah) and the Ruling, and the second is due to the existence of a connection between the Cause, the Pure Attribute, and the Ruling. The first of them necessitates the validity of the Isti'arah from both sides, and the second necessitates its validity from one of the two sides, which is the borrowing of the Principal (Asl) for the Branch (Far'). An example of the first is: If he said, 'If I own a slave, then he is free,' and he owned half a slave, then sold him, then owned the other half, he is not emancipated because the entire slave did not come together in his ownership. But if he said, 'If I purchase a slave, then he is free,' and he purchased half a slave, then sold him, then...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 20
  },
  {
    "serial_number": "3420489",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 57,
    "volume_number": 1,
    "text": "...purchased the other half, the second half is emancipated. And if he meant by 'ownership' the 'purchase,' or by 'purchase' the 'ownership,' his intention is valid by way of Metaphor, because purchase is the cause of ownership and ownership is its ruling; so the Isti'arah is general between the Cause and the Effect from both sides.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 21
  },
  {
    "serial_number": "3420490",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 60,
    "volume_number": 1,
    "text": "Except that in what constitutes a mitigation in his right, he is not believed regarding the judiciary specifically, due to the implication of accusation, not due to the lack of validity of the Isti'arah. An example of the second: If he says to his wife, 'I have freed you' (Harrartuki), and intends divorce by it, it is valid because 'liberation' (Tahrir) in its literal sense necessitates the removal of ownership of the neck (person) by means of the removal of ownership of the neck, so it was a pure cause for the removal of ownership of enjoyment (Mut'ah). Thus, it is permissible that it be borrowed for divorce, which is the remover of the ownership of enjoyment. And it is not said: 'If it were made a metaphor for divorce, it would necessitate that the divorce occurring by it be revocable like explicit divorce,' because we say: We do not make it a metaphor for divorce [generally], but for that which removes the ownership of enjoyment, and that is in the irrevocable (Ba'in), since the revocable does not remove the ownership of enjoyment according to us. And if he said to his bondmaid, 'I have divorced you,' and intended liberation by it, it is not valid, because the Principal is permitted to establish the Branch, but as for the Branch, it is not permissible for the Principal to be established by it. Based on this, we say: Marriage is contracted by the wording of gift, transfer of ownership, and sale, because gift in its literal sense necessitates ownership of the neck, and ownership of the neck necessitates ownership of enjoyment in bondmaids. So the gift was a pure cause for the establishment of ownership of enjoyment, thus it was permissible to be borrowed for marriage.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 22
  },
  {
    "serial_number": "3420491",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 61,
    "volume_number": 1,
    "text": "However, the wording of transfer of ownership and sale is not reversible, such that sale and gift are not contracted by the wording of marriage. Then, in every place where the locus is specific to a type of metaphor, it does not require intention therein. It is not said: 'Since the possibility of the Literal is a condition for the validity of the Metaphor according to them [the two disciples]...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 23
  },
  {
    "serial_number": "3420492",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 64,
    "volume_number": 1,
    "text": "...how is the Metaphor resorted to in the form of marriage with the wording of gift, despite the fact that owning a free woman by sale and gift is impossible?' For we say: That is possible generally, such as if she apostatizes and joins the Abode of War, then is taken captive. This becomes analogous to 'touching the sky' and its sisters. Chapter Six: A chapter on the Explicit (Sarih) and the Allusive (Kinayah). The Explicit is a word whose intended meaning is apparent, such as saying 'I sold' and 'I purchased' and the like. Its ruling is that it necessitates the establishment of its meaning by any method, whether by information, description, or call. And of its ruling is that it dispenses with intention. Based on this, we said: If he says to his wife 'You are divorced' or 'I divorced you' or 'O divorced one,' the divorce occurs whether he intended divorce or did not intend. Likewise, if he says to his slave 'You are free' or 'I freed you' or 'O free one.' Based on this, we said that Tayammum (dry ablution) provides purification, because the saying of the Exalted {but He intends to purify you} is explicit in the occurrence of purification by it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 24
  },
  {
    "serial_number": "3420493",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 65,
    "volume_number": 1,
    "text": "And Al-Shafi'i has two opinions regarding it: One of them is that it is a necessary purification, and the other is that it is not a purification, but rather a covering for the ritual impurity. Based on this, issues are derived according to the two schools, regarding its permissibility before the time [of prayer], performing two obligatory prayers with one Tayammum, the leadership (Imamate) of the one performing Tayammum for those performing ablution (Wudu), its permissibility without fear of destruction of life or limb by using water, its permissibility for Eid and funeral prayers, and its permissibility with the intention of purification. The Allusive (Kinayah) is that whose meaning is concealed. And the Metaphor, before it becomes customary, is in the status of the Allusive. The ruling of the Allusive is the establishment of the ruling by it...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 25
  },
  {
    "serial_number": "3420494",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 68,
    "volume_number": 1,
    "text": "...upon the existence of intention or by the indication of the circumstance, for there must be for it a proof by which hesitation is removed and some aspects are preferred. For this meaning, the wording of 'Separation' (Baynunah) and 'Prohibition' (Tahrim) is named Kinayah in the chapter of divorce due to the meaning of hesitation and the concealment of the intent, not because it performs the work of divorce. And from it branches the ruling of Allusions regarding the absence of the right of return (Raj'ah). And due to the existence of the meaning of hesitation in the Allusion, punishments (Hudud) are not established by it. Such that if one confesses against himself in the chapter of adultery or theft, the Hadd punishment is not carried out on him unless he mentions the explicit word. For this meaning, the Hadd is not carried out on the mute by gesture. And if he accuses a man of adultery and the other says 'You spoke the truth,' the Hadd is not obligatory due to the probability of confirming him in something else. Chapter Seven: A chapter on the Opposites. It means the Apparent (Zahir), the Text (Nass), the Explained (Mufassar), and the Unequivocal (Muhkam), with what opposes them of the Obscure (Khafi), the Difficult (Mushkil), the Ambivalent (Mujmal), and the Ambiguous (Mutashabih). The Apparent (Zahir) is a name for every speech whose meaning is apparent to the listener by the mere hearing without contemplation. The Text (Nass) is what the speech was driven for [to explain]. An example of it is in the saying of the Exalted {And Allah has permitted trade and forbidden usury}. The verse was driven to explain the distinction between trade and usury as a rebuttal to what the disbelievers claimed of equality between them, where they said {Trade is only like usury}.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 26
  },
  {
    "serial_number": "3420495",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 69,
    "volume_number": 1,
    "text": "And the permissibility of trade and the prohibition of usury became known by the mere hearing, so that became a Text (Nass) in the distinction, and Apparent (Zahir) in the permissibility of trade and the prohibition of usury.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 27
  },
  {
    "serial_number": "3420496",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 72,
    "volume_number": 1,
    "text": "7 - / 1 Discussion on the obligation of acting upon the ruling of the Apparent (Zahir) and the Text (Nass). Likewise is the saying of the Exalted {Then marry those that please you of women, two or three or four}. The speech was driven to explain the number, and the unrestricted permission and authorization became known by the mere hearing. So that became Apparent regarding the right of unrestricted permission, and a Text regarding the explanation of the number. Likewise, the saying of the Exalted {There is no blame upon you if you divorce women you have not touched nor specified for them an obligation} is a Text regarding the ruling of the one for whom no dowry was named, and Apparent regarding the husband's independent right to divorce, and an indication that marriage without mentioning the dowry is valid. Likewise, his saying, upon him be peace, 'Whoever owns a Mahram relative, he is emancipated upon him,' is a Text regarding the entitlement of emancipation for the relative, and Apparent regarding the establishment of ownership for him. The ruling of the Apparent and the Text is the obligation to act upon both of them, whether they are general or specific, with the probability of another meaning intended; and that is in the status of the Metaphor with the Literal. Based on this, we said: If he purchases his relative such that he is emancipated upon him, he is the emancipator and the right of loyalty (Wala') belongs to him. The difference between them only appears at the time of opposition.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 28
  },
  {
    "serial_number": "3420497",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 73,
    "volume_number": 1,
    "text": "For this reason, if he said to her 'Divorce yourself,' and she said 'I have separated myself,' a revocable divorce occurs, because this [her statement] is a Text (Nass) regarding divorce [as it answers his request] and Apparent (Zahir) regarding separation (Baynunah), so acting upon the Text is preferred. Likewise, his saying, upon him be peace, to the people of Uraynah (Drink from their urine and their milk) is a Text regarding the explanation of the cause of healing, and Apparent regarding the permission to drink urine. And his saying, upon him be peace, (Cleanse yourselves from urine, for indeed the generality of the punishment of the grave is from it) is a Text regarding the obligation of avoiding urine. So the Text is preferred over the Apparent, thus drinking urine is not permissible at all.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 29
  },
  {
    "serial_number": "3420498",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 76,
    "volume_number": 1,
    "text": "7 - / 2 Discussion on the preference of the Explained (Mufassar) over the Text (Nass). And his saying, upon him be peace, (Whatever the sky waters, in it is the tithe/Ushr) is a Text explaining the tithe. And his saying, upon him be peace, (There is no charity/Sadaqah in vegetables) is interpreted to negate the tithe, because 'charity' bears multiple meanings, so the first is preferred over the second. As for the Explained (Mufassar), it is that whose intended meaning is apparent from the wording by an explanation from the speaker such that no probability of interpretation or specification remains with it. An example of it is in the saying of the Exalted {So the angels prostrated, all of them, together}. The noun 'angels' is Apparent in generality, except that the probability of specification exists, so the door of specification was closed by His saying (all of them). Then the probability of division in prostration remained, so the door of interpretation was closed by His saying (together). And in legal matters: If he said 'I married Fulanah for a month for such-and-such.' His saying 'I married' is Apparent regarding marriage, except that the probability of Mut'ah (temporary marriage) exists. So by his saying 'for a month,' he explained the intended meaning, so we said this is Mut'ah and not marriage. And if he said to Fulan 'I owe a thousand from the price of this slave' or 'from the price of this merchandise.' His saying 'I owe a thousand' is a Text regarding the obligation of the thousand, except that the probability of explanation remains. So by his saying 'from the price of this slave' or 'from the price of this merchandise,' he clarified the intended meaning, so the Explained is preferred over the Text, such that the money is not binding upon him except upon taking possession of the slave or the merchandise.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 30
  },
  {
    "serial_number": "3420499",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 77,
    "volume_number": 1,
    "text": "And his saying 'I owe Fulan a thousand' is Apparent regarding acknowledgement, and a Text regarding the currency of the land. So if he says 'from the currency of such-and-such land,' the Explained is preferred over the Text, so the currency of the land is not binding upon him, but rather the currency of such-and-such land. And based on this are its analogues.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 31
  },
  {
    "serial_number": "3420500",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 80,
    "volume_number": 1,
    "text": "7 - / 3 Discussion on the Obscure (Khafi), the Difficult (Mushkil), the Ambivalent (Mujmal), and the Ambiguous (Mutashabih). As for the Unequivocal (Muhkam), it is what has increased in strength over the Explained, such that its contrary is not permissible at all. An example of it in the Book is {Indeed, Allah is Knowing of all things} and {Indeed, Allah does not wrong the people at all}. And in legal judgments, what we said regarding the acknowledgement 'Indeed I owe Fulan a thousand from the price of this slave'; for indeed this wording is Unequivocal (Muhkam) regarding its obligation as a substitute for it. And based on this are its analogues. The ruling of the Explained and the Unequivocal is the necessity of acting upon them inevitably. Then, for these four, there are another four that oppose them: The opposite of the Apparent is the Obscure (Khafi), the opposite of the Text is the Difficult (Mushkil), the opposite of the Explained is the Ambivalent (Mujmal), and the opposite of the Unequivocal is the Ambiguous (Mutashabih). The Obscure (Khafi) is what the intended meaning is obscured by an accident, not from the perspective of the wording. An example of it is in the saying of the Exalted {And the male thief and the female thief, cut off their hands}. For it is Apparent regarding the right of the thief, Obscure regarding the pickpocket (Tarrar) and the grave robber (Nabbash). Likewise, the saying of the Exalted {The female fornicator and the male fornicator} is Apparent regarding the right of the fornicator, Obscure regarding the right of the sodomite. And if he swears not to eat fruit, it is Apparent regarding what is eaten for pleasure, Obscure regarding the right of grapes and pomegranates.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 32
  },
  {
    "serial_number": "3420501",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 81,
    "volume_number": 1,
    "text": "The rule of the Obscure (al-Khafi) is the obligation of research until the obscurity is removed from it.\nAs for the Problematic (al-Mushkil), it is that which has increased in obscurity over the Obscure, as if after being obscure to the listener in reality, it entered into its similar forms and likes, such that the intended meaning is not attained except by research, then by reflection, until it is distinguished from its likes.\nIts counterpart in legal rulings is: If he swore \"I will not eat Idam (condiment/sauce),\" it is apparent regarding vinegar and dibs (molasses). But it is Problematic regarding meat, eggs, and cheese, until he researches the meaning of Idam, then reflects whether that meaning exists in meat, eggs, and cheese or not.\nThen above the Problematic is the Ambiguous (al-Mujmal), which is that which bears [multiple] aspects, becoming such that the intended meaning cannot be grasped except by a clarification from the speaker.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 33
  },
  {
    "serial_number": "3420502",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 85,
    "volume_number": 1,
    "text": "Its counterpart in legal matters is His Almighty's saying: {And He forbade Riba}. For the concept understood from Riba is absolute increase, and that is not intended. Rather, the intended is the increase devoid of a counter-value in the sale of homogeneous measurable items. The word has no indication of this, so the intended meaning is not attained by reflection.\nThen above the Ambiguous in obscurity is the Allegorical (al-Mutashabih). An example of the Allegorical is the disjointed letters at the beginnings of the Surahs. The rule of the Ambiguous and the Allegorical is the belief in the truthfulness of the intended meaning until the clarification comes.\n\nThe Eighth Chapter: Chapter regarding that by which the literal meanings of words are abandoned.\nThat by which the literal meaning of the word is abandoned is of five types.\nThe first is the indication of Custom (Urf). That is because the establishment of rulings by words is only due to the indication of the word upon the meaning intended by the speaker. So if the meaning is customary among people, that customary meaning is evidence that it is the intended meaning apparently, so the ruling is based on it.\nAn example is if he swore he would not buy a \"head\" (ra's), it is based on what people are accustomed to, so he does not violate the oath by [buying] the head of a sparrow or a pigeon.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 34
  },
  {
    "serial_number": "3420503",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 86,
    "volume_number": 1,
    "text": "Likewise, if he swore he would not eat \"eggs,\" that would be based on the customary usage, so he does not violate the oath by consuming the eggs of a sparrow or a pigeon.\nBy this, it becomes clear that abandoning the Literal (Haqiqah) does not necessitate resorting to the Metaphor (Majaz); rather, it is permissible that a Deficient Literal (Haqiqah Qasirah) is established by it. An example of this is restricting the General (Amm) to some [parts].",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 35
  },
  {
    "serial_number": "3420504",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 89,
    "volume_number": 1,
    "text": "Discussion: Abandoning the Literal by an indication within the speech itself.\nLikewise, if he vowed a Hajj or walking to the House of Allah Almighty, or to strike the Hatim of the Kaaba with his garment, the Hajj becomes binding upon him with known actions due to the existence of Custom.\n\nThe Second: The Literal may be abandoned by an indication within the speech itself.\nAn example is if he says: \"Every Mamluk (owned slave) of mine is free.\" His Mukatabs (contracted slaves) are not set free, nor is the one of whom a part is freed, unless he intends their inclusion. This is because the word Mamluk is absolute and covers the Mamluk from every aspect, and the Mukatab is not a Mamluk from every aspect. For this reason, his disposal of him is not permitted, nor is sexual intercourse with the female Mukatabah lawful for him. If the Mukatab marries the daughter of his master, then the master dies and the daughter inherits him, the marriage is not invalidated. And since he is not a Mamluk from every aspect, he does not enter under the absolute word Mamluk.\nThis is contrary to the Mudabbar and the Umm al-Walad, for the ownership in them is complete. Therefore, intercourse with the Mudabbarah and the Umm al-Walad is lawful. The deficiency in slavery is only in that it ceases upon death inevitably.\nBased on this, we said: If he frees a Mukatab for the expiation (Kaffarah) of his oath or his Zihar, it is valid. But freeing the Mudabbar and Umm al-Walad is not valid for them. This is because the requirement is Tahrir (liberation), which is establishing freedom by removing slavery. So if the slavery in the Mukatab is complete, his liberation is a liberation from all aspects. And in the Mudabbar and Umm al-Walad, since the slavery was defective, the...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 36
  },
  {
    "serial_number": "3420505",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 90,
    "volume_number": 1,
    "text": "...liberation is not a liberation from all aspects.\nThe Third: The Literal may be abandoned by the indication of the context (Siyaq) of the speech. He said in (al-Siyar al-Kabir): If a Muslim says to a Harbi (warrior from non-Muslim lands): \"Descend,\" and he descends, he is safe.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 37
  },
  {
    "serial_number": "3420506",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 93,
    "volume_number": 1,
    "text": "Discussion: Abandoning the Literal by an indication from the speaker.\nAnd if he said: \"Descend if you are a man,\" and he descended, he is not safe. If the Harbi said: \"Safety, Safety (Al-Aman, Al-Aman),\" and the Muslim said: \"Safety, Safety,\" he is safe. If he said: \"Safety? You will know what you will meet tomorrow,\" or \"Do not rush until you see,\" and he descended, he is not safe.\nIf he said: \"Buy me a girl to serve me,\" and he bought a blind or paralyzed one, it is not permissible. If he said: \"Buy me a girl so I may have intercourse with her,\" and he bought his sister through breastfeeding, it is not on behalf of the principal.\nBased on this, we said regarding his saying, peace be upon him: (If a fly falls into the food of one of you, dip it then throw it away, for in one of its wings is a disease and in the other is a cure, and it brings the disease forward over the cure): The context of the speech indicates that the dipping is to repel harm from us, not for a devotional matter as a right of the Sharia, so it is not for obligation.\nAnd His Almighty's saying: {Zakah expenditures are only for the poor...} [9:60] following His Almighty's saying: {And among them are some who criticize you concerning the [distribution of] charities} [9:58] indicates that mentioning the categories is to cut off their greed for the charities by clarifying the recipients for them. Therefore, discharging the responsibility does not depend on paying to all [categories].\nThe Fourth: The Literal may be abandoned by an indication from the speaker. An example is His Almighty's saying: {So whoever wills, let him believe; and whoever wills, let him disbelieve}.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 38
  },
  {
    "serial_number": "3420507",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 94,
    "volume_number": 1,
    "text": "That is because Allah Almighty is Wise, and disbelief (Kufr) is ugly, and the Wise does not command it. So the indication of the word for 'Command' is abandoned due to the wisdom of the Commander.\nBased on this, we said: If he appoints an agent to buy meat; if he is a traveler stopping on the road, it applies to cooked or roasted meat. If he is a resident owner of a home, it applies to raw meat.\nFrom this type is the Oath of Immediacy (Yamin al-Fawr). An example is: If he says, \"Come have lunch with me,\" and he says, \"By Allah, I will not have lunch,\" this is directed to the lunch he was invited to. Even if he has lunch after that in his home with him or with someone else on that day, he does not violate the oath. Likewise, if the woman stood up wanting to go out, and the husband said, \"If you go out, you are such-and-such,\" the ruling is restricted to the immediate situation. Even if she goes out after that, he does not violate the oath.\nThe Fifth: The Literal may be abandoned by the indication of the locus of speech, such that the locus does not accept the literal meaning of the word. An example is the contracting of marriage of a free woman using the words of sale, gift, transfer of ownership, and charity. And his saying to his slave—who has a known lineage from someone else—\"This is my son.\" Likewise, if he says to his slave who is older in age than the master, \"This is my son,\" it is a Metaphor (Majaz) for emancipation according to Abu Hanifa, may Allah be pleased with him, contrary to the two of them [Abu Yusuf and Muhammad], based on what we mentioned: that the Metaphor is a successor to the Literal regarding the word according to him, and regarding the ruling according to them.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 39
  },
  {
    "serial_number": "3420508",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 99,
    "volume_number": 1,
    "text": "The Ninth Chapter: Chapter on the Implications of Texts.\nWe mean by them: The Explicit Meaning of the Text (Ibarat al-Nass), the Allusion of the Text (Isharat al-Nass), the Inference of the Text (Dalalat al-Nass), and the Requirement of the Text (Iqtida' al-Nass).\nAs for the Explicit Meaning of the Text, it is that for which the speech was formulated and which was intended by it purposefully.\nAs for the Allusion of the Text (Isharah), it is what is established by the wording of the text...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 40
  },
  {
    "serial_number": "3420509",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 101,
    "volume_number": 1,
    "text": "...without addition, and it is not apparent from every aspect, nor was the speech formulated for its sake.\nAn example is in His Almighty's saying: {(Charity is) for the poor emigrants who were expelled from their homes...} [59:8] the verse. It was formulated to explain the entitlement to booty (Ghanimah), so it became an Explicit Text (Nass) regarding that. Their poverty was established by the wording of the text, so it was an Allusion (Isharah) that the seizure by the disbeliever of the Muslim's wealth is a cause for the establishment of ownership for the disbeliever. For if the wealth remained in their ownership, their poverty would not be established. From this, the ruling in the issue of seizure is derived, and the ruling of the establishment of ownership for the merchant by purchasing from them, and his disposals through sale, gift, and manumission; and the ruling of the establishment of taking booty (Istighnam) and the establishment of ownership for the warrior (Ghazi), and the inability of the owner to extract it from his hand, and its branches.\nLikewise, His Almighty's saying: {It has been made lawful for you the night of fasting to go in unto your wives} until His Almighty's saying: {Then complete the fast until the night} [2:187]. Refraining (Imsak) at the beginning of dawn is realized while in a state of major ritual impurity (Janabah), because a necessity of the lawfulness of intercourse until dawn is that the first part of the day exists with the presence of Janabah. And Refraining in that part is a Fast which the servant is commanded to complete. So this was an Allusion (Isharah) that Janabah does not negate the Fast. And it follows from this that rinsing the mouth and sniffing water into the nose do not negate the continuation of the Fast.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 41
  },
  {
    "serial_number": "3420510",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 102,
    "volume_number": 1,
    "text": "And it branches from this that whoever tastes something with his mouth, his fast is not invalidated. For if the water were salty and he finds its taste during rinsing, the fast is not invalidated by it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 42
  },
  {
    "serial_number": "3420511",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 104,
    "volume_number": 1,
    "text": "Discussion: The ruling of the Inference of the Text (Dalalat al-Nass) is the generality of the ruling stated in the text.\nThe ruling of wet dreams, cupping, and applying oil is known from it. Because the Book, when it named the Refraining (Imsak)—which is necessary by means of ceasing from the three mentioned things at the beginning of dawn—as \"Fasting\" (Sawm), it became known that the pillar of the Fast is completed by ceasing from the three things. On this basis, the ruling in the issue of Tabyit (forming intention at night) is derived. For the intention to perform the commanded act is only required upon the direction of the command, and the command is only directed after the first part [of the day] due to His Almighty's saying: {Then complete the fast until the night}.\nAs for the Inference of the Text (Dalalat al-Nass), it is what is known to be the effective cause (Illah) for the ruling stated in the text linguistically, not by independent juristic reasoning (Ijtihad) nor by deduction (Istinbat). An example is in His Almighty's saying: {So do not say to them [so much as], \"uff,\" and do not repel them} [17:23]. One knowledgeable of the structures of the language understands by the first hearing that the prohibition of saying \"uff\" is to prevent harm from them. The rule of this type is the generality of the ruling stated in the text due to the generality of its effective cause. For this meaning, we held the prohibition of hitting, cursing, employing [the parent] through hiring, imprisoning due to debt, and killing in retaliation (Qisas).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 43
  },
  {
    "serial_number": "3420512",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 105,
    "volume_number": 1,
    "text": "Then, the Inference of the Text (Dalalat al-Nass) is in the status of the Text (Nass), such that establishing punishment by the Inference of the Text is valid. Our companions said: Expiation (Kaffarah) is obligatory for sexual intercourse by the Text, and for eating and drinking by the Inference of the Text.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 44
  },
  {
    "serial_number": "3420513",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 108,
    "volume_number": 1,
    "text": "Discussion: The Requirement (al-Muqtada) is an addition to the Text.\nBased on the consideration of this meaning [the effective cause], wherever the effective cause turns, the ruling turns. Imam Judge Abu Zayd said: If a people consider saying \"uff\" to be an honor, saying \"uff\" to the parents would not be prohibited for them.\nLikewise, we said regarding His Almighty's saying: {O you who have believed, when [the adhan] is called...} [62:9] the verse. If we assume a sale that does not prevent the contracting parties from hastening to the Friday prayer—such as if they were on a ship sailing towards the central mosque—the sale is not disliked.\nBased on this, we said: If he swears he will not strike his wife, then he pulls her hair, bites her, or chokes her, he violates the oath if it is in a manner causing pain. If the form of striking and pulling hair exists during foreplay without causing pain, he does not violate it. Whoever swears not to strike So-and-so, then strikes him after his death, does not violate it due to the absence of the meaning of striking, which is causing pain. Likewise, if he swears not to speak to So-and-so, then speaks to him after his death, he does not violate it due to the lack of causing understanding.\nConsidering this meaning, it is said: If he swears he will not eat meat, then eats the meat of fish or locusts, he does not violate it. If he eats the meat of a pig or a human, he violates it. Because the one who knows [the language], upon the first hearing, knows...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 45
  },
  {
    "serial_number": "3420514",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 109,
    "volume_number": 1,
    "text": "...that the motive for this oath is only precaution against what originates from blood. So the precaution is against consuming blood-creatures, and the ruling revolves around that.\nAs for the Requirement (al-Muqtada), it is an addition to the Text; the meaning of the Text is not realized except by it, as if the Text required it so that it may be valid in itself.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 46
  },
  {
    "serial_number": "3420515",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 112,
    "volume_number": 1,
    "text": "Discussion: Acceptance is a Pillar in the Chapter of Sale.\nIts meaning, for example in legal matters, is his saying: \"You are divorced (Taliq).\" This is a description of the woman, but the description requires the source (verbal noun), so it is as if the source exists by way of Requirement (Iqtida).\nIf he says: \"Free your slave on my behalf for a thousand dirhams,\" and he says: \"I have freed him,\" the emancipation occurs on behalf of the commander, and the thousand becomes obligatory upon him. If the commander intended it for expiation (Kaffarah), it occurs for what he intended. That is because his saying \"Free him on my behalf for a thousand dirhams\" requires the meaning of his saying: \"Sell him to me for a thousand, then be my agent in emancipating, so free him on my behalf.\" Thus, the sale is established by way of Requirement, and Acceptance is established likewise because it is a pillar in the chapter of sale.\nFor this reason, Abu Yusuf said: If he says, \"Free your slave on my behalf for nothing,\" and he says, \"I have freed him,\" the emancipation occurs on behalf of the commander. This becomes a requirement for Gift and Agency. Possession (Qabd) is not needed in it because it is in the position of Acceptance in the chapter of sale.\nBut we say: Acceptance is a pillar in the chapter of sale. So if we establish the sale by Requirement, we establish Acceptance by necessity. This is contrary to Possession in the chapter of Gift, for it is not a pillar in the Gift such that the judgment of Gift by way of Requirement would be a judgment of Possession.\nThe rule of the Requirement (Muqtada) is that it is established by way of necessity, so it is estimated according to the measure of the necessity. For this reason, we said: If he says, \"You are divorced,\" and intends three by it, it is not valid [to count as three], because Divorce...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 47
  },
  {
    "serial_number": "3420516",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 113,
    "volume_number": 1,
    "text": "...is estimated to be mentioned by way of Requirement (Iqtida). So it is estimated according to the measure of the necessity. The necessity is removed by one, so it is estimated as mentioned regarding one.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 48
  },
  {
    "serial_number": "3420517",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 116,
    "volume_number": 1,
    "text": "Based on this, the ruling is derived in his saying: \"If I eat,\" and he intends by it a specific food other than [another] food; it is not valid. Because \"eating\" requires \"food,\" so that is established by way of Requirement according to the measure of necessity. The necessity is removed by the absolute individual [food], and there is no specification in the absolute individual, because specification relies on generality.\nIf he says after consummation: \"Count the waiting period (Iddah),\" and intends Divorce by it, Divorce occurs by Requirement. Because counting the Iddah [implies] the existence of Divorce, so Divorce is estimated to be present by necessity. For this reason, the divorce occurring by it is Revocable (Raj'i), because the attribute of Irrevocability (Baynunah) is in excess of the measure of necessity, so it is not established by way of Requirement. And nothing occurs except one [divorce] due to what we mentioned.\nThe Tenth Chapter: Chapter on the Command (al-Amr).\nThe Command in the language is the saying of the speaker to another: \"Do\" (If'al). In the Sharia, it is the act of binding the action upon another.\nSome Imams mentioned that the intent of 'Command' is specific to this formula. It is impossible that its meaning is that the literal reality of Command is specific to this formula. For Allah Almighty is a Speaker in Pre-eternity (Azal) according to us, and His speech is Command, Prohibition, Information, and Inquiry, and the existence of this formula in Pre-eternity is impossible.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 49
  },
  {
    "serial_number": "3420518",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 117,
    "volume_number": 1,
    "text": "It is also impossible that its meaning is that the intent of the Command for the [sake of] Command is specific to this formula. For the intent of the Lawgiver by the Command is the obligation of the action upon the servant—which is the meaning of Testing (Ibtila') according to us—and Obligation is established without this formula. Is it not the case that Faith is obligatory upon the one whom the Call [of Islam] did not reach, without the arrival of the Revelation (Sam' / Hearing)?",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 50
  },
  {
    "serial_number": "3420519",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 120,
    "volume_number": 1,
    "text": "Abu Hanifa said: If Allah Almighty had not sent a Messenger, it would have been obligatory upon rational beings to know Him through their intellects.\nSo that [statement about specificity] is interpreted to mean that the intent of the Command is specific to this formula regarding the servant in legal matters (Shar'iyyat). Thus, the action of the Messenger is not in the status of his saying \"Do,\" and the belief in Obligation is not binding by it. Following him in his actions, peace be upon him, is only obligatory in cases of persistence (Muwazabah) and the absence of evidence of exclusivity.\nDiscussion: Verification of the Effect of the Absolute Command.\nChapter: People differed regarding the Absolute Command, meaning the one stripped of contextual indication signifying Necessity or Lack of Necessity. Like His Almighty's saying: {And when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} [7:204], and His Almighty's saying: {And do not approach this tree, lest you be among the wrongdoers} [2:35].\nThe correct view of the School is that its effect is Obligation (Wujub), unless evidence stands to the contrary. Because abandoning the command is disobedience (Ma'siyah), just as complying with the command is obedience. Al-Hamasi said:\n\"I obeyed your commander by cutting my rope...\nOrder them regarding their loved ones to do that...\nIf they obey you, then obey them;\nAnd if they disobey you, then disobey whoever disobeyed you.\"",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 51
  },
  {
    "serial_number": "3420520",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 123,
    "volume_number": 1,
    "text": "Disobedience in matters returning to the right of the Law (Shar') is a cause for punishment. The verification of this is that the obligation to comply corresponds to the extent of the commander's authority over the one addressed. For this reason, if the form of the command is directed to someone who is not obligated to obey you at all, this does not necessitate compliance. But if you direct it to someone obligated to obey you, such as slaves, compliance becomes inevitably binding upon him, such that if he leaves it by choice, he deserves punishment customarily and legally. Based on this, we know that the obligation of compliance is according to the extent of the authority of the command. If this is established, we say that Allah the Exalted has complete ownership over every part of the parts of the universe, and He has the right of disposal however He wills and desires. And if it is established that for the one who has limited ownership over a slave, the abandonment of compliance is a cause for punishment, then what is your thought regarding the abandonment of the command of the One who brought you into existence from non-existence and poured upon you showers of blessings? Section: The command for an action does not imply repetition. For this reason, we said: If he says, 'Divorce my wife,' and the agent divorces her, then the principal marries her again, the agent does not have the right to divorce her a second time using the first command.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 52
  },
  {
    "serial_number": "3420521",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 124,
    "volume_number": 1,
    "text": "And if he said, 'Marry me a woman,' this does not cover marrying time after time. And if he said to his slave, 'Get married,' this does not cover anything but one time. This is because the command for an action is a request for the realization of the action in a brief manner; for his saying 'Strike' (idrib) is an abbreviation of his saying 'Do the striking' (if'al al-darb).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 53
  },
  {
    "serial_number": "3420522",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 127,
    "volume_number": 1,
    "text": "Discussion: The repetition of acts of worship through the repetition of their causes. The act of striking, and the abbreviated speech and the elongated speech are equal in ruling. Then, the command to strike is a command for a known genus of disposal, and the ruling of the generic noun is that it applies to the minimum when mentioned absolutely, though it potentially encompasses the entire genus. Based on this, we said: If he swears he will not drink water, he breaks the oath by drinking the minimum drop of it; but if he intended by it all the waters of the world, his intention is valid. For this reason, we said: If he says to her, 'Divorce yourself,' and she says, 'I have divorced,' one divorce occurs. If she intended three, her intention is valid. Likewise, if the other says, 'Divorce her,' it covers one divorce when absolute, but if he intended three, his intention is valid. However, if he intended two, it is not valid, unless the woman being married is a bondmaid, for the intention of two in her regard is an intention for the entire genus. And if he says to his slave, 'Get married,' it applies to marrying one woman; but if he intended two, his intention is valid because that is the entire genus in the right of the slave. The section on the repetition of worships does not fit under this principle, for that [repetition] is not established by the [initial] command, but by the repetition of their causes by which the obligation is established. The command...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 54
  },
  {
    "serial_number": "3420523",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 128,
    "volume_number": 1,
    "text": "...is to request the performance of what has become obligatory in the liability (Dhimmah) due to a preceding cause, not to establish the origin of the obligation. This is like the saying of a man, 'Pay the price of the sold item' or 'Pay the maintenance of the wife.' When the worship becomes obligatory due to its cause, the command is directed toward the performance of what has become obligatory of it upon him. Then, since the command covers the genus...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 55
  },
  {
    "serial_number": "3420524",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 131,
    "volume_number": 1,
    "text": "...the genus covers what is obligatory upon him. An example of this is what is said: The obligation at the time of Zuhr is the Zuhr [prayer], so the command is directed to perform that obligation. Then, if the time repeats, the obligation repeats, so the command covers that other obligation necessarily, as it covers the entire genus obligatory upon him, whether it is fasting or prayer. Thus, the repetition of the repeated worship is by this method, not by the method that the command [itself] implies repetition. Discussion: The two types of the commanded act: Absolute and Restricted. Absolute regarding time and Restricted by it. The ruling of the Absolute is that the performance is obligatory with delay (Tarakhi), on the condition that he does not miss it within his lifetime. Based on this, Muhammad said in Al-Jami': If one vows to perform I'tikaf for a month, he may perform I'tikaf any month he wishes; and if he vows to fast a month, he may fast any month he wishes. Regarding Zakat, Sadaqat al-Fitr, and Ushr, the known school is that one does not become negligent by delaying; for if the quorum (Nisab) perishes, the obligation drops. And the one who broke an oath, if his wealth goes away and he becomes poor, he makes expiation by fasting. Based on this, the makeup (Qada') of prayers is not obligatory in the disliked times, because when it became obligatory absolutely, it became obligatory completely, so one does not exit the responsibility by performing the deficient. Thus...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 56
  },
  {
    "serial_number": "3420525",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 132,
    "volume_number": 1,
    "text": "...performing Asr at the time of redness (sunset) is Ada' (performance on time), and Qada' (makeup) is not permissible [at that time]. And it is reported from Al-Karkhi, may Allah have mercy on him, that the requirement of the absolute command...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 57
  },
  {
    "serial_number": "3420526",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 135,
    "volume_number": 1,
    "text": "...is obligation immediately (Fawr). The disagreement with him is regarding the obligation, but there is no disagreement that hastening to comply is recommended. Discussion: The two types of the commanded act (Absolute and Restricted) and their rulings. As for the Timed (Muwaqqat), it is of two types. One type is where the time is a vessel (Zarf) for the action, such that encompassing the entire time with the action is not a condition, like Prayer. From the ruling of this type is that the obligation of the action within it does not negate the obligation of another action within it of its same genus; such that if he vows to pray such and such cycles (Rak'ahs) during the time of Zuhr, it becomes binding upon him. And from its ruling is that the obligation of the Prayer within it does not negate the validity of another prayer within it, such that if he occupied the entire time of Zuhr with other than Zuhr, it is permissible. Its ruling is that the commanded act is not fulfilled except with a specific intention, because since other acts are legislated within the time, the act itself is not specified [automatically], even if the time becomes tight; for the consideration of the intention is due to the competitor, and the competition remains when the time is tight. The second type is where the time is a standard/measure (Mi'yar) for it, and that is the section of Fasting, for it is measured by the time, which is the day. From its ruling is that if the Law specifies a time for it, no other act is obligatory in that time, and the performance of another act is not permissible within it. Such that if a resident person in sound health were to locate...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 58
  },
  {
    "serial_number": "3420527",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 136,
    "volume_number": 1,
    "text": "...his withholding (fasting) in Ramadan for another obligation, it occurs for Ramadan, not for what he intended. When the competitor is repelled in the time, the condition of specification drops, for that [specification] is to cut off the competition. However, the origin of intention (Niyyah) does not drop, because withholding does not become Fasting except with intention.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 59
  },
  {
    "serial_number": "3420528",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 138,
    "volume_number": 1,
    "text": "Discussion on one of the two types of the commanded act, i.e., the Restricted. Fasting in the Sharia is withholding from eating, drinking, and intercourse during the day with intention. If the Law did not specify a time for it, the time is not specified for it by the servant's specification; such that if the servant specified days for the makeup (Qada') of Ramadan, they do not become specified [exclusively] for the makeup. Fasting for expiation and voluntary fasting is permissible in them, and the makeup of Ramadan is permissible in them and in others. From the ruling of this type is that specifying the intention is a condition due to the existence of the competitor. Then, the servant may obligate something upon himself, timed or non-timed, but he does not have the right to change the ruling of the Sharia. An example of this: If he vows to fast a specific day, that becomes binding upon him; yet if he fasts it for the makeup of Ramadan or for the expiation of his oath, it is permissible, because the Sharia made the makeup absolute, so the servant is not able to change it by restricting it to other than that day. This is not contradicted by the case where if he fasts it as a voluntary fast (Nafl), it occurs for the Vow, not for what he intended; because the voluntary fast is the right of the servant, as he acts independently in leaving it or realizing it, so it is permissible that his action affects what is his right, not what is the right of the Sharia. Considering this meaning, our Sheikhs said: If they stipulated in Khula' that she has no maintenance (Nafaqah) and no housing (Sukna), the maintenance drops but not the housing, so...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 60
  },
  {
    "serial_number": "3420529",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 139,
    "volume_number": 1,
    "text": "...the husband is not able to evict her from the house of the waiting period (Iddah), because housing in the house of the waiting period is a right of the Sharia, so the servant is not able to drop it, unlike maintenance.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 61
  },
  {
    "serial_number": "3420530",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 142,
    "volume_number": 1,
    "text": "Discussion: The commanded act being of two types regarding Goodness (Husn). Section: The command for a thing indicates the goodness of the commanded act if the commander is wise, because the command is to explain that the commanded act is among what should exist, so that necessitates its goodness. Then, the commanded act regarding goodness is of two types: Good in itself, and Good for [the sake of] another. The Good in itself is like belief in Allah the Exalted, thanking the Benefactor, truthfulness, justice, prayer, and similar pure acts of worship. The ruling of this type is that if its performance becomes obligatory upon the servant, it does not drop except by performance. This is regarding what does not accept dropping, like belief in Allah the Exalted. As for what accepts dropping, it drops by performance or by the dropping of the command. Based on this, we said: If prayer becomes obligatory at the beginning of the time, the obligation drops by performance or by the occurrence of insanity, menstruation, or postpartum bleeding at the end of the time, considering that the Sharia dropped it from him/her upon these impediments. It does not drop by the tightness of time, lack of water, or lack of clothing, and the like. The second type is what is good by means of another, and that is like walking to the Friday prayer (Jumu'ah) and ablution (Wudu) for prayer; for walking is good by means of it leading to the performance of Jumu'ah...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 62
  },
  {
    "serial_number": "3420531",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 143,
    "volume_number": 1,
    "text": "...and ablution is good by means of it being a key to prayer. The ruling of this type is that it drops by the dropping of that means, such that walking is not obligatory on one who has no Jumu'ah upon him, and ablution is not obligatory on one who has no prayer upon him. If he walked to Jumu'ah but was carried under coercion to another place where Jumu'ah is established, walking becomes obligatory upon him a second time.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 63
  },
  {
    "serial_number": "3420532",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 146,
    "volume_number": 1,
    "text": "And if he was performing I'tikaf in the central mosque (Jami'), walking is dropped for him. Likewise, if he performed ablution and then broke his ritual purity before performing the prayer, ablution becomes obligatory upon him a second time. But if he was in a state of ablution at the time the prayer became obligatory, renewing the ablution is not obligatory for him. Close to this type are the legal punishments (Hudud), retaliation (Qisas), and Jihad; for the Hadd punishment is good by means of deterrence from the crime, and Jihad is good by means of repelling the evil of the disbelievers and elevating the word of Truth. If we assumed the absence of the means, that would not remain commanded; for were it not for the crime, the Hadd would not be obligatory, and were it not for the disbelief leading to war, Jihad would not be obligatory upon him. Section: The Obligatory (Wajib) by the ruling of the command is of two types: Performance (Ada') and Make-up (Qada'). Performance is an expression for delivering the specific obligation to its deserving recipient. Make-up is an expression for delivering a like of the obligation to its deserving recipient. Then, Performance is of two types: Complete (Kamil) and Deficient (Qasir). The Complete is like performing prayer in its time in congregation, or Tawaf while in a state of ablution, and delivering the sold item soundly as the contract necessitated to the buyer...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 64
  },
  {
    "serial_number": "3420533",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 147,
    "volume_number": 1,
    "text": "...and the usurper delivering the usurped item just as he usurped it. The ruling of this type is that it is judged as exiting the responsibility by it. Based on this, we said: If the usurper sells the usurped item to the owner, or pledges it to him, or gifts it to him and delivers it to him, he exits the responsibility and that is a performance (Ada') of his right, and what he explicitly stated of sale or gift becomes void. And if he usurped food and fed it to its owner while he [the owner] did not know it was his food, or usurped a garment and clothed its owner with it while he did not know it was his garment, that is a performance of his right.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 65
  },
  {
    "serial_number": "3420534",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 150,
    "volume_number": 1,
    "text": "And the buyer in a corrupt (Fasid) sale, if he lends the sold item to the seller, or pledges it to him, or leases it to him, or sells it to him, or gifts it to him and delivers it, that is a performance of his right, and what he explicitly stated of sale, gift, and the like becomes void. Discussion: Deficient Performance and its ruling. As for Deficient Performance, it is delivering the specific obligation with a deficiency in its attribute, like prayer without the stillness of limbs (Ta'dil al-Arkan), or Tawaf while in a state of minor impurity, or returning the sold item occupied by debt or by a crime, or returning the usurped item while its blood is permissible [to shed] due to murder or occupied by debt or a crime due to a cause with the usurper, and paying counterfeit coins in place of good ones if the creditor did not know that. The ruling of this type is that if it is possible to compensate for the deficiency with a like, it is compensated by it; otherwise, the ruling of the deficiency drops except regarding the sin. Based on this, if one leaves the stillness of limbs in the chapter of prayer, it is not possible to remedy it with a like, since it has no like in the place of worship, so it drops. And if he leaves the prayer in the Days of Tashreeq, then makes it up in other than the Days of Tashreeq, he does not say the Takbir, because he has no right to the Takbir aloud legally [outside those days].",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 66
  },
  {
    "serial_number": "3420535",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 154,
    "volume_number": 1,
    "text": "And we said regarding the omission of the recitation of Al-Fatiha, the Qunut, the Tashahhud, and the Takbirs of the two Eids, that it is compensated (yujbar) by the Prostration of Forgetfulness (Saju al-Sahw). And if one performs the obligatory Tawaf while in a state of minor ritual impurity, that is compensated by a blood sacrifice (Dam), which is a 'like' (Mithl) for it legally.\nBased on this, if he paid counterfeit [coins] in place of good ones, and they perished with the receiver, he owes nothing to the debtor according to Abu Hanifa, because the quality of 'goodness' (Jawdah) has no isolated 'like' such that it could be compensated by a 'like'.\nAnd if he handed over a slave whose blood was lawful [to shed] due to a crime committed while with the usurper (Ghasib), or while with the seller after the sale, and then [the slave] died with the owner or the buyer before the payment, the price becomes binding upon him, and the usurper is absolved due to the consideration of the principle of delivery. But if he was executed due to that crime, the destruction is attributed to its first cause, so it becomes as if the delivery did not exist according to Abu Hanifa.\nAnd if the usurped animal is returned pregnant due to an act while with the usurper, and she dies during birth with the owner, the usurper is not absolved from the guarantee (Daman) according to Abu Hanifa.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 67
  },
  {
    "serial_number": "3420536",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 157,
    "volume_number": 1,
    "text": "Discussion: Makeup (Qada') and its two types: Complete and Deficient.\nThe principle in this chapter is that [the default] is Performance (Ada'), whether complete or deficient. One only resorts to Makeup (Qada') when Performance is impossible.\nFor this reason, the specific property (Mal) is designated in Deposit (Wadi'ah), Agency (Wakalah), and Usurpation (Ghasb). If the trustee, the agent, or the usurper wanted to keep the specific item and pay what is similar to it, he does not have that right.\nAnd if he sold something and delivered it, then a defect appeared in it, the buyer has the choice between taking it or leaving it.\nConsidering that the principle is Performance (Ada'), Al-Shafi'i says: The obligation upon the usurper is to return the usurped item itself, even if it has changed drastically in the hand of the usurper, and the indemnity (Arsh) for the decrease is obligated. Based on this, if he usurped wheat and ground it, or a teak beam and built a house upon it, or a sheep and slaughtered and roasted it, or grapes and pressed them, or wheat and sowed it and the crop grew; that remains the property of the owner according to him.\nWe said: All of it belongs to the usurper, and returning the value is obligated upon him.\nIf he usurped silver and minted it into Dirhams, or gold bullion and made it into Dinars, or a sheep and slaughtered it, the owner's right is not cut off according to the Zahir al-Riwayah (manifest narration). Likewise, if he usurped cotton and spun it, or yarn and wove it, the owner's right is not cut off in the Zahir al-Riwayah.\nBranching from this is the issue of guaranteed items (Madmunat). For this reason, he said: If the slave appeared...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 68
  },
  {
    "serial_number": "3420537",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 158,
    "volume_number": 1,
    "text": "...usurped after the owner took his guarantee from the usurper, the slave belongs to the owner, and the owner is obligated to return what he took of the slave's value.\nAs for Makeup (Qada'), it is of two types: Complete (Kamil) and Deficient (Qasir).\nThe Complete is delivering the 'like' of the obligation in form and meaning, like one who usurps a Cafiz of wheat and consumes it; he guarantees a Cafiz of wheat. The paid item is a 'like' to the first in form and meaning. The ruling is the same for all fungibles (Mithliyyat).\nAs for the Deficient, it is that which does not match the obligation in form but matches in meaning, like one who usurps a sheep and it perishes; he guarantees its value. The value is a 'like' to the sheep regarding meaning, not regarding form.\nThe principle in Makeup is the Complete type.\nBased on this, Abu Hanifa said: If he usurps a fungible item and it perishes in his hand, and [access to it] is cut off from the hands of the people, he guarantees its value on the Day of Dispute. This is because the inability to deliver the Complete 'Like' only becomes apparent at the time of the dispute. As for before the dispute, obtaining the 'like' from every aspect is imaginable.\nAs for that which has no 'like', neither in form nor in meaning, establishing Makeup regarding it by a 'like' is not possible. For this reason, we said that Usufructs (Manafi') are not guaranteed by destruction (Itlaf), because establishing the guarantee by a 'like' is impossible, and establishing it by the item itself is likewise, because the item does not match the usufruct neither in form nor in meaning.\nJust as if he usurped a slave and used him for a month, or a house and lived in it for a month, then returned the usurped item to the owner, the guarantee of usufructs is not obligated upon him—contrary to Al-Shafi'i. However, the sin remains as a ruling for it, and its recompense is transferred to the Abode of the Hereafter.\nFor this reason, we said: The benefits of marital access (Bud') are not guaranteed by false testimony regarding divorce, nor by killing the wife of another, nor...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 69
  },
  {
    "serial_number": "3420538",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 159,
    "volume_number": 1,
    "text": "...by intercourse. Even if he has intercourse with a man's wife, he does not guarantee anything to the husband, unless the Sharia specifies a 'like', even though it does not match it in form and meaning, so it becomes a 'like' for it legally. Thus, its makeup is obligated by the legal 'like'.\nIts counterpart is what we said: That the Fidya (expiation) regarding the very old man is a 'like' for Fasting, and the Diyah (blood money) in accidental killing is a 'like' for the Soul, even though there is no similarity between them.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 70
  },
  {
    "serial_number": "3420539",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 165,
    "volume_number": 1,
    "text": "Discussion: Division of Prohibition (Nahy) into Two Parts\n\nThe Eleventh Chapter: Chapter on Prohibition\n\nProhibition is of two types: Prohibition of sensory acts, such as Zina (adultery), drinking wine, lying, and injustice. And Prohibition of legal dispositions (Shar'iyyah), such as the prohibition of fasting on the Day of Sacrifice, prayer at disliked times, and selling one Dirham for two Dirhams.\nThe rule of the first type is that the prohibited act is the very essence of what the prohibition addressed, so its essence is ugly (Qabih), thus it is not legitimate (Mashru') at all.\nThe rule of the second type is that the prohibited act is other than what the prohibition was attributed to, so it [the act] is good (Hasan) in itself, ugly due to another factor (li-ghayrihi). The doer is committing Haram due to the other factor, not due to the act itself.\nBased on this, our companions said: Prohibition regarding legal dispositions implies their establishment (Taqrir). By that, it is meant that the disposition after the prohibition remains legitimate as it was. Because if it did not remain legitimate, the servant would be incapable of acquiring the legitimate act; in that case, it would be a prohibition addressed to the incapable, and that is impossible from the Lawgiver.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 71
  },
  {
    "serial_number": "3420540",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 168,
    "volume_number": 1,
    "text": "Discussion: Prohibition of Sensory and Legal Acts\nBy this, it differs from sensory acts, because if their essence were ugly, that would not lead to prohibiting the incapable [since they are physical acts, not legal constructs].\nBecause of this description, the Day of Sacrifice and all forms of legal dispositions are not rendered incapacitated despite the arrival of prohibition regarding them.\nBranching from this is the ruling of Corrupt Sale (Bay' Fasid), Corrupt Lease (Ijarah Fasidah), the Vow to fast on the Day of Sacrifice, and all forms of legal dispositions despite the arrival of prohibition regarding them.\nSo we said: The Corrupt Sale imparts ownership upon possession, considering that it is a 'Sale'. And undoing it is obligatory considering that it is Haram due to another factor.\nThis is contrary to the marriage of polytheist women, the father's wife, another's wife observing Iddah and his wife, marriage to Mahrams (incestuous relations), and marriage without witnesses. This is because the effect of marriage is the lawfulness of the act (sexual access), and the effect of Prohibition is the unlawfulness of the act; combining them is impossible. So the prohibition is carried upon negation [of validity].\nAs for the effect of Sale, it is the establishment of ownership, and the effect of Prohibition is the unlawfulness of the action (disposal). It is possible to combine them, such that ownership is established and the action is prohibited. Is it not the case that if juice ferments in the ownership of a Muslim, his ownership of it remains, yet the action (drinking/selling) is prohibited?",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 72
  },
  {
    "serial_number": "3420541",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 169,
    "volume_number": 1,
    "text": "Based on this, our companions said: If one vows to fast on the Day of Sacrifice [or] the Days of Tashriq, his vow is valid, because it is a vow for a legitimate fast. Likewise, if he vows to pray at disliked times, it is valid, because it is a vow for a legitimate act of worship based on what we mentioned: that Prohibition necessitates the continuation of the disposition as legitimate.\nFor this reason, we said: If he starts a voluntary prayer (Nafl) at these times, it becomes binding upon him by the commencement. Committing the Haram is not necessary for the necessity of completion; for if he waits until the prayer becomes lawful by the rising of the sun, or its setting, or its decline, he can complete it without dislike.\nBy this, it differs from the fast of the Day of Eid. If he starts it, it does not become binding upon him according to Abu Hanifa and Muhammad, because the completion cannot be separated from committing the Haram.\nFrom this type is intercourse with a menstruating woman. The prohibition of approaching her is due to the harm (Adha), due to His Almighty's saying: {And they ask you about menstruation. Say, \"It is harm, so keep away from wives during menstruation. And do not approach them until they are pure.\"} [2:222].\nFor this reason, we said: Rulings are arranged upon this intercourse. Thus, the Ihsan (legal status of being married) of the one having intercourse is established by it, and the woman becomes lawful for the first husband [if this was a remarriage after three divorces], and the ruling of the Dowry, Iddah, and Maintenance is established by it. If she refused to submit herself due to the dowry, she is considered rebellious (Nashizah) according to them both, so she does not deserve maintenance.\nThe unlawfulness of the act does not negate the arrangement of legal rulings, like the divorce of a menstruating woman, performing Wudu with usurped waters, hunting with a usurped bow, slaughtering with a usurped knife, praying on usurped land, and selling at the time of the Call to Prayer [on Friday]. Indeed, the ruling is arranged upon these dispositions despite their inclusion of unlawfulness.\nConsidering this principle, we said regarding His Almighty's saying: {And do not accept for them testimony, ever} [24:4]...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 73
  },
  {
    "serial_number": "3420542",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 175,
    "volume_number": 1,
    "text": "The Twelfth Chapter: Chapter on Defining the Method of [Knowing] the Intent of Texts\n\n...that the Fasiq (sinner) is among the people of testimony. Thus, marriage is contracted by the testimony of Fasiqs. This is because prohibiting the acceptance of testimony is impossible without the [existence of] testimony. Their testimony was only not accepted due to corruption in the performance, not due to the absence of testimony fundamentally. Based on this, Lian (curse oath) is not obligated upon them, because that is the performance of testimony, and there is no performance with a Fasiq.\n\nDiscussion: The Method of Knowing the Intent of Texts\nKnow that there are methods for knowing the intent of texts.\nAmong them:\n1 - If a word is Literal (Haqiqah) for a meaning and Metaphorical (Majaz) for another, the Literal takes precedence.\nAn example is what our scholars said: The daughter created from the water of Zina (adultery); marrying her is prohibited for the adulterer. Al-Shafi'i, may Allah have mercy on him, said: It is lawful. The correct view is what we said, because she is his daughter literally, so she enters under His Almighty's saying: {Prohibited to you are your mothers and your daughters} [4:23]. Branching from this are the rulings in the two schools regarding the lawfulness of intercourse, the obligation of dowry, the necessity of maintenance, the flow of inheritance, and the guardianship of preventing her from going out and appearing.\n\n2 - Among them is that if one of two interpretations necessitates a specification (Takhsis) in the text while the other does not, the interpretation upon what does not necessitate specification is preferred.\nAn example is in His Almighty's saying: {Or you have touched (Lamastum) women} [4:43]. If 'Touching' is interpreted as Intercourse...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 74
  },
  {
    "serial_number": "3420543",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 176,
    "volume_number": 1,
    "text": "...the text is acted upon in all forms of its existence. But if it is interpreted as touching with the hand, the text becomes specified (Makhsus) regarding it in many forms. For touching Mahrams (incestuous relatives) and the very young girl does not break Wudu in the soundest of Al-Shafi'i's two views. Branching from this are the rulings in the two schools regarding the permissibility of prayer, touching the Mushaf, entering the mosque, the validity of leading prayer, the necessity of Tayammum when water is lacking, and remembering the touch during prayer.\n\n3 - Among them is that if the text is read with two readings (Qira'at) or narrated with two narrations, acting upon it in a way that implements both aspects is preferred.\nAn example is in His Almighty's saying: {And your feet (Arjulakum)} [5:6]. It is read with Nasb (accusative) conjoined to the washed parts, and with Khafd (genitive) conjoined to the wiped part. The reading of Khafd was carried upon the state of wearing Khuffs (leather socks), and the reading of Nasb upon the state of not wearing Khuffs. Considering this meaning, some said: The permissibility of wiping [the Khuffs] is established by the Book.\nLikewise, His Almighty's saying: {Until they are pure (Yathurna)} [2:222]. It is read with Tashdid (Yattahharna) and Takhfif (Yathurna). The reading of Takhfif is acted upon when her days are ten [maximum menstruation], and the reading of Tashdid when her days are less than ten.\nBased on this, our companions said: If the menstrual blood stops at less than ten...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 75
  },
  {
    "serial_number": "3420544",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 177,
    "volume_number": 1,
    "text": "...days, intercourse with the menstruating woman is not permissible until she performs Ghusl (bathes), because the perfection of purity is established by bathing [acting on Tashdid]. But if her blood stops at ten days, intercourse with her is permissible before Ghusl, because absolute purity is established by the cessation of blood [acting on Takhfif].\nFor this reason, we said: If the menstrual blood stops at ten days at the end of the prayer time, the obligatory prayer of that time becomes binding upon her, even if there does not remain of the time an amount in which she can bathe. But if her blood stops at less than ten days at the end of the prayer time: if there remains of the time an amount in which she can bathe and say the Takbir for prayer, the obligation binds her; otherwise, it does not.\n\nThen we mention methods of weak deductions (Tamassukat) so that this may be an alert to the place of defect in this type.\nAmong them: Arguing by what was narrated from the Prophet, may Allah bless him and grant him peace, (that he vomited and did not perform Wudu) to prove that vomit does not break Wudu is weak. This is because the trace indicates that vomit does not necessitate Wudu *immediately*, and there is no dispute in that; the dispute is only regarding it being a nullifier.\nLikewise, arguing by His Almighty's saying: {Prohibited to you is dead animals (Al-Maitah)} [5:3] to prove the corruption of water by the death of a fly is weak. This is because the text establishes the prohibition of [eating] the Maitah, and there is no dispute in that; the dispute is only regarding the spoiling of the water.\nLikewise, arguing by his saying, peace be upon him: (Scrape it, then pinch/rub it with water, then wash it with water) to prove that vinegar does not remove impurity is weak. This is because the Report implies the obligation of washing the blood with water, so it is restricted to the case of the presence of blood on the locus, and there is no dispute in that; the dispute is only regarding the purity of the locus after the removal of blood by vinegar.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 76
  },
  {
    "serial_number": "3420545",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 178,
    "volume_number": 1,
    "text": "Likewise, arguing by his saying, peace be upon him: (In forty sheep, a sheep) to prove the impermissibility of paying the value is weak. This is because it implies the obligation of the sheep, and there is no dispute in that; the dispute is only regarding the dropping of the obligation by performing the payment of the value.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 77
  },
  {
    "serial_number": "3420546",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 185,
    "volume_number": 1,
    "text": "Discussion: Weak and Corrupt Deductions\n\nLikewise, arguing by His Almighty's saying: {And complete the Hajj and Umrah for Allah} [2:196] to prove the obligation of Umrah initially is weak. This is because the text implies the obligation of completion, and that is only after commencement, and there is no dispute in that; the dispute is only regarding its obligation initially.\nLikewise, arguing by his saying, peace be upon him: (Do not sell one Dirham for two Dirhams, nor one Sa' for two Sa's) to prove that Corrupt Sale does not impart ownership is weak. This is because the text implies the prohibition of the Corrupt Sale, and there is no dispute in that; the dispute is only regarding the establishment of ownership or lack thereof.\nLikewise, arguing by his saying, peace be upon him: (Do not fast on these days, for they are days of eating, drinking, and conjugal relations) to prove that a Vow to fast on the Day of Sacrifice is not valid is weak. This is because the text implies the unlawfulness of the act, and there is no dispute regarding it being Haram; the dispute is only regarding the utility of legal rulings despite it being Haram.\nThe unlawfulness of the act does not negate the arrangement of legal rulings. For if a father impregnates his son's slave girl, it is Haram, yet ownership [of the girl] is established for the father. If one slaughters a sheep with a usurped knife, it is Haram, yet the slaughtered animal becomes Halal. If one washes an impure garment with usurped water, it is Haram, yet the garment becomes pure by it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 78
  },
  {
    "serial_number": "3420547",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 186,
    "volume_number": 1,
    "text": "And if one has intercourse with a woman in the state of menstruation, it is Haram, yet the Ihsan (legal status of marriage) of the one having intercourse is established by it, and lawfulness for the first husband is established.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 79
  },
  {
    "serial_number": "3420548",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 189,
    "volume_number": 1,
    "text": "The Thirteenth Chapter: Establishing the Particles of Meanings (Huruf al-Ma'ani)\n\nThe Waw (And) is for Absolute Collection. It is said that Al-Shafi'i made it for Order (Tartib). Based on this, Order is obligatory in the chapter of Wudu.\nOur scholars, may Allah have mercy on them, said: If he says to his wife, \"If I speak to Zayd OR (wa - and) Amr, you are divorced,\" and he speaks to Amr then Zayd, she is divorced. The meaning of order and comparison is not a condition in it.\nIf he says: \"If you enter this house AND this house, you are divorced,\" and she enters the second then enters the first, she is divorced.\nMuhammad, may Allah have mercy on him, said: If he says, \"If you enter the house, you are divorced,\" she is divorced immediately? [No], if that implied order, divorce would be ordered by it upon entry, and that would be a suspension (Ta'liq), not an immediate effect (Tanjiz).\nThe Waw may be for the Circumstantial State (Hal), combining the State (Hal) and the Owner of the State (Dhu al-Hal); in that case, it conveys the meaning of a Condition.\nAn example is what he said regarding the Authorized Slave (Ma'dhun): If he says to his slave, \"Pay me a thousand AND you are free,\" the payment is a condition for freedom.\nMuhammad said in Al-Siyar Al-Kabir: If the Imam says to the disbelievers, \"Open the door AND you are safe,\" they are not safe without opening. If he says to the Harbi (enemy warrior), \"Descend AND you are safe,\" he is not safe without descending.\nThe Waw is only carried upon the Hal by way of Metaphor (Majaz), so there must be...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 80
  },
  {
    "serial_number": "3420549",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 190,
    "volume_number": 1,
    "text": "...a possibility in the word for that, and the existence of an indication for its establishment. As in the master's saying to his slave: \"Pay me a thousand AND you are free.\" Indeed, freedom is realized at the moment of payment, and the indication for that is established: for the master is not owed money by his slave while slavery exists in him [since the slave and his wealth belong to the master]. Yet, suspension [of freedom] on it is valid, so it is carried upon that.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 81
  },
  {
    "serial_number": "3420550",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 193,
    "volume_number": 1,
    "text": "Discussion on 'Waw' (And) being for absolute conjunction and 'Fa' (Then/So) for immediate succession. If he says, 'You are divorced and you are sick' or '...praying,' she is divorced immediately. Even if he intended suspension (Ta'liq), his intention is valid between him and Allah the Exalted, because the wording, although it bears the meaning of the state (Hal), the apparent meaning is contrary to it; but when it is supported by his intent, it is established [religiously]. If he says, 'Take this thousand as Mudarabah and work with it in cloth,' the work is not restricted to cloth, and the Mudarabah is general, because working in cloth is not suitable as a state (Hal) for taking the thousand as Mudarabah, so the beginning of the speech is not restricted by it. Based on this, Abu Hanifa said: If she says to her husband, '(Divorce me and you have a thousand),' and he divorces her, nothing is owed to him from her, because her saying 'and you have a thousand' does not signify a state of obligation of the thousand upon her, and her saying 'Divorce me' is significant by itself, so acting upon it is not abandoned without proof. This is contrary to his saying, 'Carry this merchandise and you have a dirham,' because the indication of hire (Ijara) prevents acting upon the literal meaning of the word [as a mere gift/offer], and for this reason, it is used in retributions because it follows the condition. Our companions, may Allah have mercy on them, said: If he says, 'I sold this slave to you for a thousand,' and the other says...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 82
  },
  {
    "serial_number": "3420551",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 194,
    "volume_number": 1,
    "text": "...'Then (Fa) he is free,' this is accepted as a sale by implication, and emancipation is established from him following the sale. This is contrary to what if he said, 'And he is free' or 'He is free,' for it would be a rejection of the sale. And if he says to a tailor, 'Look at this cloth, is it sufficient for me as a shirt?' and he looks and says 'Yes,' then the owner of the cloth says, 'Then (Fa) cut it,' and he cuts it, but it turns out not to be sufficient, the tailor is liable. This is because he ordered him to cut following [the confirmation of] sufficiency. This is contrary to what if he said, 'Cut it' or 'And cut it,' and he cuts it, for the tailor would not be liable. If he said, 'I sold this garment to you for ten, then (Fa) cut it,' and he cuts it and says nothing, the sale is complete. If he says, 'If you enter this house, then (Fa) this house, you are divorced,' the condition is entering the second immediately following the entering of the first, connected to it. So if she enters the second first, or last but after a duration, the divorce does not occur.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 83
  },
  {
    "serial_number": "3420552",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 198,
    "volume_number": 1,
    "text": "Discussion that 'Fa' may be used to explain causality ('Illah). And 'Fa' may be for the explanation of the cause. An example is if he says to his slave, 'Pay me a thousand, so (Fa) you are free,' the slave is free immediately even if he does not pay anything. And if he says to a warmonger (Harbi), 'Descend, so (Fa) you are safe,' he is safe even if he does not descend. And in Al-Jami': If he says, 'The matter of my wife is in your hand, so divorce her,' and he divorces her in the session, she is divorced with one irrevocable (Ba'in) divorce, and the second clause is not an appointment of agency for a divorce other than the first; it becomes as if he said, 'Divorce her because her matter is in your hand.' If he said, 'Divorce her, so (Fa) I have made her matter in your hand,' and he divorces her in the session, she is divorced with a revocable divorce. If he said, 'Divorce her and (Wa) I have made her matter in your hand,' and he divorces her in the session, she is divorced with two divorces. Likewise, if he said, 'Divorce her and separate her' or 'Separate her and divorce her,' and he divorces her in the session, two divorces occur. Based on this, our companions said: If a married bondmaid is emancipated, the option (Khiyar) is established for her, whether her husband is a slave or free. This is because his saying, upon him be peace, to Buraydah when she was emancipated, (You owned your vulva, so choose), established the option for her due to her owning her vulva by emancipation. This meaning does not differ between the husband being a slave or free. And from this branches the issue of 'Consideration of divorce is by women'; for the vulva of the bondmaid...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 84
  },
  {
    "serial_number": "3420553",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 199,
    "volume_number": 1,
    "text": "...is the property of the husband [via marriage] and did not leave his ownership by her emancipation. So necessity called for saying that ownership increases by her emancipation, such that ownership in the excess is established for him, and that becomes a cause for the establishment of the option for her. And the increase of ownership of the vulva by her emancipation is the meaning of the issue 'Consideration of divorce is by women.' Thus, the ruling of owning three [divorces] revolves around the emancipation of the wife, not the emancipation of the husband, as is the school of Al-Shafi'i, may Allah have mercy on him.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 85
  },
  {
    "serial_number": "3420554",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 203,
    "volume_number": 1,
    "text": "Section: 'Thumma' (Then) is for delay. However, according to Abu Hanifa, it indicates delay in wording and ruling. According to them (Abu Yusuf and Muhammad), it indicates delay in ruling [only]. Its explanation is in the case where he says to a woman with whom marriage has not been consummated, 'If you enter the house, then you are divorced, then (Thumma) divorced.' According to him (Abu Hanifa), the first is attached to the entry, and the second occurs immediately, and the third is void. According to them, all are attached to the entry; then upon entry, the sequence appears, so only one occurs. If he said, 'You are divorced, then divorced, then divorced if you enter the house'; according to Abu Hanifa, the first occurs immediately, and the second and third are void. According to them, one occurs upon entry due to what we mentioned. If the woman was consummated with, if he advanced the condition, the first is attached to the entry and two occur immediately according to Abu Hanifa. If he delayed the condition, two occur immediately and the third is attached to the entry. According to them, all are attached to the entry in both sections.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 86
  },
  {
    "serial_number": "3420555",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 206,
    "volume_number": 1,
    "text": "Discussion on 'Bal' (Nay/Rather) being placed to rectify a mistake. Section: 'Bal' is for rectifying a mistake by establishing the second in place of the first. If he says to a woman with whom marriage has not been consummated, 'You are divorced once, no, rather (Bal) two,' one occurs. This is because his saying 'no, rather two' is a retraction from the first by establishing the second in place of the first, and his retraction is not valid [in creating divorce], so the first occurs. Thus, the locus [of divorce] does not remain at his saying 'two.' If she was consummated with, three occur. This is contrary to what if he said, 'I owe Fulan a thousand, no, rather two thousand,' where three thousand is not obligatory according to us. Zufar said: Three thousand is obligatory, because the reality of the word is to rectify the mistake by establishing the second in place of the first, and invalidating the first is not valid from him [in debt], so validating the second while the first remains is obligatory. That is by way of increasing the thousand upon the first thousand. This is contrary to his saying 'You are divorced once, no, rather two,' because this is origination (Insha'), and that [debt] is reporting (Ikhbar). Mistake occurs in reporting, not in origination. So it was possible to validate the wording by rectifying the mistake in acknowledgement, but not in divorce. Even if the divorce was by way of reporting, such as saying, 'I had divorced you yesterday once, no, rather two,' two would occur due to what we mentioned.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 87
  },
  {
    "serial_number": "3420556",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 209,
    "volume_number": 1,
    "text": "Discussion on 'Lakin' (But) being for rectification after negation. Section: 'Lakin' is for rectification after negation, so its requirement is the affirmation of what follows it. As for the negation of what precedes it, it is established by its own evidence. Conjunction with this word is only realized when the speech is consistent. If the speech is consistent, the negation relates to the affirmation that follows it; otherwise, it is a new sentence. An example is what Muhammad mentioned in Al-Jami': If he says, 'I owe Fulan a thousand as a loan,' and Fulan says, 'No, but as usurpation,' the money is binding upon him because the speech is consistent; so it appeared that the negation was regarding the cause, not the money itself. Similarly, if he says, 'I owe Fulan a thousand from the price of this slave,' and Fulan says, 'No, the slave is yours, but I have a thousand against you,' the money is binding upon him. So it appeared that the negation was regarding the cause, not regarding the principal of the money. If he had a slave in his hand and said, 'This belongs to Fulan,' and Fulan said, 'He was never mine, but he belongs to another Fulan': If the speech is connected, the slave belongs to the second acknowledged person because the negation relates to the affirmation. If separated, the slave belongs to the first acknowledged person, and the statement of the acknowledged person becomes a rejection of the acknowledgement.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 88
  },
  {
    "serial_number": "3420557",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 210,
    "volume_number": 1,
    "text": "And if a bondmaid married herself without her master's permission for one hundred dirhams, and the master said, 'I do not authorize the contract for one hundred, but I authorize it for one hundred and fifty,' the contract is void. This is because the speech is not consistent, for negating the authorization and affirming it [the same authorization] regarding the same thing is not realized. So his saying 'but I authorize it' was an affirmation after the rejection of the contract. Similarly, if he said, 'I do not authorize it, but I authorize it if you add fifty to the hundred,' it is an annulment of the marriage due to the lack of possibility of explanation (Bayan), because its condition is consistency, and there is no consistency.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 89
  },
  {
    "serial_number": "3420558",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 213,
    "volume_number": 1,
    "text": "Discussion on 'Aw' (Or) covering one of the mentioned items. Section: 'Aw' is for covering one of the mentioned items. For this reason, if he said, 'This one is free or this one,' it is in the status of his saying 'One of them is free,' such that he has the authority of explanation (Bayan). If he said, 'I appointed [you] to sell this slave, this one or this one,' the agent is for one of them, and the sale is permitted for each one of them. If he sold one of them, then the slave returned to the ownership of the principal, the other does not have the right to sell him. If he said regarding three wives of his, 'This one is divorced or this one and this one,' one of the first two is divorced, and the third is divorced immediately due to her being conjoined to the divorced one of them. The choice belongs to the husband in specifying the divorced one among the [first] two, in the status of if he said 'One of you two is divorced and this one.' Based on this, Zufar said: If he said, 'I will not speak to this one or this one or this one,' it is in the status of his saying 'I will not speak to one of these two and this one.' So he does not break the oath unless he speaks to one of the first two and the third. According to us, if he speaks to the first one alone, he breaks the oath; and if he speaks to one of the others [implying the second or third in a different grouping context, or specifically the second part of the 'or'], he does not break the oath unless he speaks to both. If he said, 'Sell this slave or this one,' he has the right to sell one of them, whichever he wishes. If he entered into paying the dowry by marrying her 'for this or for this'...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 90
  },
  {
    "serial_number": "3420559",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 215,
    "volume_number": 1,
    "text": "...the fair dower (Mahr al-Mithl) is judged according to Abu Hanifa, because the wording covers one of them, and the original requirement is the fair dower, so what resembles it is preferred. Based on this, we said: The Tashahhud is not a pillar in the prayer, because his saying, upon him be peace, (If you said this or did this, your prayer is complete)...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 91
  },
  {
    "serial_number": "3420560",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 218,
    "volume_number": 1,
    "text": "...suspended the completion upon one of them, so each one of them is not a condition. And the sitting is a condition by agreement, so the recitation of the Tashahhud is not a condition. Then, this word in the place of negation necessitates the negation of each one of the mentioned items, such that if he says, 'I will not speak to this one or this one,' he breaks the oath if he speaks to one of them. In affirmation, it covers one of them with the attribute of choice, like their saying 'Take this or that.' And from the necessity of choice is the generality of permission. Allah the Exalted said: {So its expiation is the feeding of ten needy people from the average of that which you feed your families or clothing them or the freeing of a slave}. Discussion: The coming of 'Aw' to cover one of the mentioned items. And 'Aw' may be in the meaning of 'Hatta' (Until/Unless). Allah the Exalted said: {You have no decision in the matter or [unless] He turns to them in forgiveness}. It is said its meaning is 'Until He turns to them.' Our companions said: If he said, 'I will not enter this house or [until] I enter this house,' 'Aw' is in the meaning of 'Hatta,' such that if he enters the first, he does not break the oath; and if he enters the second first, he is absolved in his oath.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 92
  },
  {
    "serial_number": "3420561",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 221,
    "volume_number": 1,
    "text": "And similar to it is if he said, 'I will not part from you or [until] you pay my debt,' it is in the meaning of 'Hatta' you pay my debt. Discussion: 'Hatta' providing the meaning of the limit/end (Ghaya). Section: 'Hatta' is for the limit, like 'Ila' (To). So if what is before it is capable of extension and what is after it is suitable to be a limit for it, the word operates on its literal meaning. An example is what Muhammad said: If he says, 'My slave is free if I do not beat you until Fulan intercedes' or 'until you scream' or 'until you complain before me' or 'until the night enters,' the word operates on its literal meaning, because beating accepts extension through repetition, and the intercession of Fulan and its likes are suitable as a limit for beating. So if he refrained from beating before the limit, he breaks the oath. And if he swore not to part from his debtor until he pays him his debt, and he parted before the payment of the debt, he breaks the oath. If acting upon the literal meaning is impossible due to an impediment like custom—such as if he swore to beat him until he dies or until he kills him—it is interpreted as severe beating considering custom. If the first is not capable of extension and the other is not suitable as a limit, but the first is suitable as a cause and the other as a recompense, it is interpreted as recompense (Jaza').",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 93
  },
  {
    "serial_number": "3420562",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 222,
    "volume_number": 1,
    "text": "An example is what Muhammad, may Allah have mercy on him, said: If he says to another, 'My slave is free if I do not come to you until you give me lunch,' and he comes to him but he [the other] does not give him lunch, he does not break the oath. This is because giving lunch is not suitable as a limit for coming; rather, it is a motive for the excess of coming, and it is suitable as a recompense. So it is interpreted as recompense, thus being in the meaning of the Lam of purpose (Lam Kai). So it became as if he said, 'If I do not come to you a coming whose recompense is giving lunch.' If this is impossible because the latter is not suitable as a recompense for the former, it is interpreted as pure conjunction. An example is what Muhammad, may Allah have mercy on him, said: If he says, 'My slave is free if I do not come to you until I have lunch with you today' or 'if you do not come to me until you have lunch with me today,' and he came to him but did not have lunch with him on that day, he breaks the oath. That is because since each of the two actions is attributed to a single essence, his action is not suitable to be a recompense for his [own] action. So it is interpreted as pure conjunction, and the aggregate becomes the condition for fulfillment (Birr).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 94
  },
  {
    "serial_number": "3420563",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 226,
    "volume_number": 1,
    "text": "Discussion on 'Ila' (To) being placed for the end of the limit. Section: 'Ila' is for the end of the limit. Then, in some forms, it provides the meaning of extending the ruling, and in some forms, it provides the meaning of dropping [exclusion]. If it provides extension, the limit is not included in the ruling; and if it provides dropping, it is included. An example of the first: 'I bought this place to (Ila) this wall'; the wall is not included in the sale. An example of the second: 'He sold with the condition of option to (Ila) three days.' Similar to it is if he swore 'I will not speak to Fulan to (Ila) a month'; the month is included in the ruling. It has provided the benefit of dropping [i.e., dropping the wash/ruling from beyond the limit by including the limit] here. Based on this, we said: The elbow and the ankle are included under the ruling of washing in the saying of the Exalted {To the elbows}, because the word {Ila} here is for dropping; for were it not for it, the obligation would have encompassed the entire arm. For this reason, we said: The knee is from the Awrah (nakedness), because the word {Ila} in his saying, upon him be peace, (The Awrah of a man is what is below the navel to the knee) provides the benefit of dropping [exclusion of what is beyond], so the knee enters into the ruling. And his word {Ila} may provide the benefit of delaying the ruling to the limit. For this reason we said: If...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 95
  },
  {
    "serial_number": "3420564",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 227,
    "volume_number": 1,
    "text": "...he says to his wife, 'You are divorced to (Ila) a month,' and he has no intention, the divorce does not occur immediately according to us, contrary to Zufar. This is because mentioning the month is suitable for extending the ruling and dropping [it from the immediate time] legally, and divorce accepts delay by suspension, so it is interpreted as such.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 96
  },
  {
    "serial_number": "3420565",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 229,
    "volume_number": 1,
    "text": "Discussion on the word 'Ala' (Upon) being for obligation and 'Fi' (In) for containment. Section: The word 'Ala' is for obligation. Its origin is to provide the meaning of superiority and elevation. For this reason, if he said, 'Upon me (Li 'alayya) is a thousand for Fulan,' it is interpreted as debt, contrary to if he said 'I have (Indi)' or 'With me (Ma'i)' or 'Before me (Qibali).' Based on this, he said in Al-Siyar Al-Kabir: If the head of the fortress said, 'Grant me safety upon (Ala) ten of the people of the fortress,' and we did so, the ten are other than him, and the option of specification is his. If he said, 'Grant me safety and ten' or 'So ten' or 'Then ten,' and we did so, it is likewise [other than him], and the option of specification belongs to the [granter of] safety. 'Ala' may be in the meaning of 'Ba' (By/For) metaphorically, such that if he said, 'I sold you this upon (Ala) a thousand,' 'Ala' is in the meaning of 'Ba' due to the existence of the indication of exchange. And 'Ala' may be in the meaning of the condition. Allah the Exalted said: {They pledge allegiance to you upon [the condition] that they will not associate anything with Allah}. For this reason, Abu Hanifa said: If she says to her husband, 'Divorce me three times upon (Ala) a thousand,' and he divorces her once, the money is not obligatory, because the word here provides the meaning of the condition, so the three becomes a condition for the obligation of the money.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 97
  },
  {
    "serial_number": "3420566",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 232,
    "volume_number": 1,
    "text": "Discussion on 'Fi' (In) providing the meaning of containment. Section: The word 'Fi' is for containment. Considering this principle, our companions said: If he said, 'I usurped a garment in (Fi) a handkerchief' or 'dates in a basket (Qawsarah),' he is liable for both of them. Then, this word is used for time, place, and action. As for if it is used for time, such as saying 'You are divorced in (Fi) tomorrow': Abu Yusuf and Muhammad said the omission or manifestation of it ['in'] are equal, such that if he said 'You are divorced in tomorrow,' it is in the status of his saying 'You are divorced tomorrow'; the divorce occurs as the dawn breaks in both cases. Abu Hanifa, may Allah have mercy on him, held that if it is omitted, the divorce occurs as the dawn breaks. But if it is manifested [included], the meaning is the occurrence of divorce in a part of tomorrow by way of indefiniteness; so were it not for the existence of intention, the divorce would occur at the first part due to the lack of a competitor for it. And if he intended the end of the day, his intention is valid. An example of that is in the saying of a man, 'If you fast the month, then you are such-and-such'; it applies to the fasting of the [whole] month. But if he said, 'If you fast in the month, then you are such-and-such,' this applies to withholding for an hour in the month.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 98
  },
  {
    "serial_number": "3420567",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 233,
    "volume_number": 1,
    "text": "As for regarding Place: Like his saying \"You are divorced in the house (fi al-dar)\" and \"in Mecca\"; this is a divorce in an absolute sense in all places.\nConsidering the meaning of Adverbiality (Zarfiyyah), we said: If he swears regarding an action and attributes it to a time or place; if the action is of what is completed by the agent, the presence of the agent in that time or place is conditioned. And if the action extends to a locus (mahall), the presence of the locus in that time and place is conditioned, because the action is realized by its effect, and its effect is in the locus.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 99
  },
  {
    "serial_number": "3420568",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 236,
    "volume_number": 1,
    "text": "Discussion: The Function of the word \"Fi\" (In) for the meaning of Adverbiality.\nMuhammad said in Al-Jami' Al-Kabir: If he says, \"If I insult you IN the mosque, then such-and-such [penalty/divorce],\" then he insults him while he [the insulter] is in the mosque and the insulted is outside the mosque, he violates the oath. But if the insulter was outside the mosque and the insulted was inside the mosque, he does not violate it.\nAnd if he says, \"If I hit you or wound you IN the mosque, then such-and-such,\" it is conditioned that the one hit and wounded be inside the mosque, and it is not conditioned that the hitter and wounder be inside it.\nIf he says, \"If I kill you IN Thursday, then such-and-such,\" and he wounds him before Thursday but he dies on Thursday, he violates the oath. But if he wounds him on Thursday and he dies on Friday, he does not violate it.\nIf the word [Fi] enters upon the action, it conveys the meaning of a Condition.\nMuhammad, may Allah have mercy on him, said: If he says, \"You are divorced IN (Fi) your entering the house,\" it is in the meaning of a condition, so divorce does not occur before entering the house.\nIf he says, \"You are divorced IN your menstruation\": if she is currently in menstruation, the divorce occurs immediately. Otherwise, the divorce is attached to [the occurrence of] menstruation.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 100
  },
  {
    "serial_number": "3420569",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 237,
    "volume_number": 1,
    "text": "In Al-Jami': If he says, \"You are divorced IN the coming of a day,\" she is not divorced until dawn breaks. If he says, \"IN the passing of a day\": if that was at night, the divorce occurs at sunset the next day due to the fulfillment of the condition. And if it was during the day, she is divorced when that same hour comes the next day.\nIn Al-Ziyadat: If he says, \"You are divorced IN the will of Allah Almighty\" or \"IN the wish of Allah Almighty,\" that is in the meaning of a condition, so she is not divorced.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 101
  },
  {
    "serial_number": "3420570",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 240,
    "volume_number": 1,
    "text": "Discussion: The Function of the Particle \"Ba\" for Attachment (Ilsaq).\n\nChapter: The particle \"Ba\" is for Attachment in linguistic usage. For this reason, it accompanies prices (Athman).\nThe verification of this is that the Sold Item (Mabi') is the principal (Asl) in the sale, and the Price (Thaman) is a condition in it. For this reason, the destruction of the Sold Item necessitates the cancellation of the sale, unlike the destruction of the Price.\nSince this is established, we say: The principle is that the follower (Tabi') is attached to the principal, not that the principal is attached to the follower. So if the particle \"Ba\" enters upon the counter-value in the chapter of Sale, it indicates that it is a follower attached to the principal, so it is not the Sold Item, thus it is the Price.\nBased on this, we said: If he says, \"I sold you this slave FOR (Bi) a Kurr of wheat\" and describes it, the slave is the Sold Item and the Kurr is the Price, so substitution [of the Kurr] is permissible before possession.\nBut if he says, \"I sold you a Kurr of wheat\" and describes it \"FOR (Bi) this slave,\" the slave is the Price and the Kurr is the Sold Item, and the contract is Salam (advance payment), which is not valid unless deferred.\nOur scholars, may Allah have mercy on them, said: If he says to his slave, \"If you inform me OF (Bi) the arrival of So-and-so, you are free,\" that is contingent upon truthful information, so that the information is attached to the arrival.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 102
  },
  {
    "serial_number": "3420571",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 241,
    "volume_number": 1,
    "text": "So if he informs falsely, he is not set free. But if he says, \"If you inform me THAT So-and-so arrived, you are free,\" that is contingent upon absolute information [speech], so even if he informs him falsely, he is set free.\nIf he says to his wife, \"If you leave the house EXCEPT WITH (Bi) my permission, you are such-and-such,\" she needs permission every time. Since the exception is an exit attached to permission. So if she leaves a second time without permission, she is divorced.\nBut if he says, \"If you leave the house UNLESS I give you permission,\" that applies to permission once. So even if she leaves another time without permission, she is not divorced.\nIn Al-Ziyadat: If he says, \"You are divorced BY (Bi) the will of Allah Almighty\" or \"BY the wish of Allah Almighty\" or \"BY His command,\" she is not divorced.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 103
  },
  {
    "serial_number": "3420572",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 245,
    "volume_number": 1,
    "text": "The Fourteenth Chapter: Clarification of Confirmation (Taqrir) and Clarification of Explanation (Tafsir).\n\nChapter on Types of Clarification (Bayan)\nClarification is of seven types: Clarification of Confirmation (Taqrir), Clarification of Explanation (Tafsir), Clarification of Change (Taghyir), Clarification of Necessity (Darurah), Clarification of State (Hal), Clarification of Conjunction (Atf), and Clarification of Substitution (Tabdil).\n\nAs for the First (Taqrir), it is when the meaning of the word is apparent but bears the possibility of another meaning, so he clarifies the intended meaning with what is apparent. Thus, the ruling of the apparent is confirmed by his clarification.\nAn example is if he says: \"I owe So-and-so a Qafiz of wheat, of the town's Qafiz\" or \"A thousand, of the town's currency.\" This is a Clarification of Confirmation, because the absolute word was carried upon the town's Qafiz and its currency, with the possibility that another was intended. So when he clarified that, he confirmed it with his clarification.\nLikewise, if he says: \"I have a thousand for So-and-so as a deposit (Wadi'ah).\" The word \"I have\" (Indi) by its absoluteness implies Trust (Amanah), with the possibility that another meaning was intended. So when he said \"deposit,\" he confirmed the ruling of the apparent with his clarification.\n\nChapter: As for Clarification of Explanation (Tafsir), it is when the intended meaning of the word is not revealed, so he reveals it with his clarification.\nAn example is if he says: \"I owe So-and-so a 'Thing' (Shay'),\" then he explains the 'Thing' as a garment. Or he says: \"I owe ten Dirhams 'and some' (wa nayyif),\" then he explains the 'some'...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 104
  },
  {
    "serial_number": "3420573",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 246,
    "volume_number": 1,
    "text": "...or he says: \"I owe Dirhams,\" and explains them as ten, for example.\nThe rule of these two types of clarification is that it is valid whether connected (Mawsul) or separated (Mafsul).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 105
  },
  {
    "serial_number": "3420574",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 249,
    "volume_number": 1,
    "text": "Discussion: Clarification of Change (Taghyir).\n\nChapter: As for Clarification of Change, it is when the meaning of his speech is changed by his clarification. Its counterpart is Suspension (Ta'liq) and Exception (Istithna').\nThe jurists differed regarding these two sections.\nOur companions said: That which is suspended on a condition is a cause (Sabab) at the existence of the condition, not before it.\nAl-Shafi'i, may Allah have mercy on him, said: The suspension is a cause immediately, except that the absence of the condition is an impediment (Mani') to its ruling.\nThe benefit of the disagreement appears in the case where he says to a strange woman: \"If I marry you, you are divorced,\" or to another's slave: \"If I own you, you are free.\"\nThe suspension is void according to him [Al-Shafi'i], because the rule of suspension is the contracting of the beginning of the speech as a cause (Illah). But Divorce and Manumission here did not contract as a cause due to their lack of attribution to a [valid] locus (Mahall). So the rule of suspension is void, thus the suspension is not valid.\nAccording to us, the suspension is valid. So if he marries her, divorce occurs. This is because his speech contracts as a cause only at the existence of the condition, and ownership is established at the existence of the condition, so the suspension is valid.\nFor this reason, we said: The condition for the validity of suspension for occurrence in a case of...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 106
  },
  {
    "serial_number": "3420575",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 250,
    "volume_number": 1,
    "text": "...non-ownership is that it be attributed to ownership or to the cause of ownership. So if he says to a strange woman, \"If you enter the house, you are divorced,\" then he marries her and the condition is met, divorce does not occur.\n\nLikewise, the financial capability (Tawl) of [marrying] a free woman prevents the permissibility of marrying a slave girl according to him [Al-Shafi'i], because the Book suspended the marriage of a slave girl on the absence of Tawl. So when Tawl exists, the condition is absent, and the absence of the condition is an impediment to the ruling according to him.\nAccording to us, since the absence of the condition is not an impediment to the ruling, it is permissible for the ruling to be established by its evidence. So marrying a slave girl is permissible [even with Tawl], and maintenance is obligatory due to general texts.\n\nLikewise, Al-Shafi'i said: There is no maintenance for the thrice-divorced woman (Mabtutah) unless she is pregnant, because the Book suspended spending on pregnancy, due to His Almighty's saying: {And if they should be pregnant, then spend on them until they give birth} [65:6]. So when pregnancy is absent, the condition is absent, and the absence of the condition is an impediment to the ruling according to him.\nAccording to us, since the absence of the condition is not an impediment to the ruling, it is permissible for the ruling to be established by its evidence. So maintenance is obligatory due to general texts.\n\nFrom the followers of this type is arranging a ruling on a noun described by an adjective. For this is in the status of suspending the ruling on that description according to him.\nBased on this, Al-Shafi'i, may Allah have mercy on him, said: Marrying a kitabi (People of the Book) slave girl is not permissible, because the Text arranged the ruling on a believing slave girl, due to His Almighty's saying: {From your believing girls} [4:25]. So it is restricted to the believer, thus the ruling is prevented when the description is absent. So marrying a kitabi slave girl is not permissible.\nAnd among the forms of Clarification of Change is Exception (Istithna').",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 107
  },
  {
    "serial_number": "3420576",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 256,
    "volume_number": 1,
    "text": "Discussion on Exception (Istithna') being a form of Explanation of Change. Our companions went to the view that Exception is speaking about the remainder after the exclusion, as if he did not speak except about what remained. According to him [the opponent], the beginning of the speech is established as a cause for the obligation of the whole, but the Exception prevents it from operating, in the status of the absence of a condition in the chapter of suspension. An example of this is in his saying, peace be upon him: (Do not sell food for food except like for like). According to Al-Shafi'i, may Allah have mercy on him, the beginning of the speech is established as a cause for the prohibition of selling food for food absolutely, and the form of equality exited from this totality by the Exception, so the remainder remained under the ruling of the beginning. The result of this is the prohibition of selling a handful of food for two handfuls of it. According to us, the sale of a handful does not enter under the Text, because the intended meaning of the prohibited [act] is restricted to a form of sale in which the servant is able to establish equality and inequality, so as not to lead to prohibiting the incapable. So whatever does not fall under the standard of equality is outside the implication of the Hadith. Among the forms of Explanation of Change is if he says: 'I owe Fulan a thousand as a deposit.' His saying 'I owe' implies obligation...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 108
  },
  {
    "serial_number": "3420577",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 257,
    "volume_number": 1,
    "text": "...and by his saying 'a deposit,' he changed it to preservation. And his saying 'You gave me' or 'You lent me a thousand but I did not receive it' is from the totality of Explanation of Change. Likewise if he said: 'I owe Fulan a thousand bad coins (Zuyuf).' The ruling of Explanation of Change is that it is valid when connected [to the speech] and is not valid when separated. Then after this, there are issues in which the scholars differed whether they are from the totality of Explanation of Change, thus valid with the condition of connection, or from the totality of Explanation of Alteration (Abrogation), thus not valid. A part of this will come in the Explanation of Alteration.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 109
  },
  {
    "serial_number": "3420578",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 261,
    "volume_number": 1,
    "text": "Discussion on Explanation of Necessity (Bayan al-Darurah) and Explanation of Circumstance (Bayan al-Hal). Section: As for Explanation of Necessity, its example is in the saying of the Exalted {And his parents inherit from him, so for his mother is one-third}. He established partnership between the parents, then explained the mother's share, so that became an explanation for the father's share. Based on this, we said: If they explain the share of the Mudarib (worker) and remain silent about the share of the capital owner, the partnership is valid. Likewise, if they explain the share of the capital owner and remain silent about the share of the Mudarib, it is an explanation. Based on this is the ruling of agricultural partnership (Muzara'ah). Likewise, if he bequeathed a thousand to Fulan and Fulan, then explained the share of one of them, that was an explanation for the share of the other. If he divorced one of his two wives then had intercourse with one of them, that is an explanation of the divorce for the other. This is contrary to intercourse in the case of ambiguous manumission according to Abu Hanifa, because the lawfulness of intercourse regarding bondmaids is established by two methods, so the direction of ownership is not specified by considering the lawfulness of intercourse. Section: As for Explanation of Circumstance, its example is when the Lawgiver sees a matter directly witnessed and does not forbid it...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 110
  },
  {
    "serial_number": "3420579",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 262,
    "volume_number": 1,
    "text": "...his silence is in the status of an explanation that it is legislated. And the pre-emptor (Shafi'), if he learns of the sale and remains silent, that is in the status of an explanation that he is pleased with it. And the virgin, if she learns of the guardian's marrying her off and remains silent about rejecting, that is in the status of an explanation of consent and permission. And the master, if he sees his slave buying and selling in the market and remains silent, that is in the status of permission, so he becomes authorized in trade. And the defendant, if he refuses [the oath] in the court session, the refusal is in the status of consent to the obligation of the money by way of acknowledgement according to them [the two disciples], or by way of offering according to Abu Hanifa, may Allah have mercy on him. The conclusion is that silence in a place where explanation is needed is in the status of explanation. By this method, we said Consensus (Ijma') is concluded by the text of some and the silence of the rest.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 111
  },
  {
    "serial_number": "3420580",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 266,
    "volume_number": 1,
    "text": "Discussion on Explanation of Conjunction (Bayan al-Atf). Section: As for Explanation of Conjunction, it is like conjoining a measured or weighed item to an ambiguous clause; that becomes an explanation for the ambiguous clause. An example is if he says: 'I owe Fulan a hundred dirhams' or 'a hundred and a Qafiz of wheat'; the conjunction is in the status of explanation that the whole is from that genus. Likewise if he says 'One hundred and three garments' or 'One hundred and three dirhams' or 'One hundred and three slaves,' it is an explanation that the hundred is of that genus, in the status of his saying 'twenty-one dirhams.' This is contrary to his saying 'A hundred and a garment' or 'A hundred and a sheep,' where that is not an explanation for the hundred. This is specific to the conjunction of the single [unit] with what is suitable as a debt in the liability, like measured and weighed items. Abu Yusuf, may Allah have mercy on him, said: It is an explanation in 'A hundred and a sheep' and 'A hundred and a garment' according to this principle.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 112
  },
  {
    "serial_number": "3420581",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 268,
    "volume_number": 1,
    "text": "Discussion on the Sunnah of the Messenger of Allah, may Allah bless him and grant him peace. Section: As for Explanation of Alteration, which is Abrogation (Naskh), that is permissible from the Lawgiver and not permissible from the servants. Based on this, the exception of the whole from the whole is void because it is abrogating the ruling. And retracting an acknowledgement, divorce, and manumission is not permissible because it is abrogation, and the servant does not have that right. If he says 'I owe Fulan a thousand as a loan or price of a sold item,' and says 'and they are bad coins (Zuyuf),' that is Explanation of Change according to them, so it is valid when connected. But it is Explanation of Alteration according to Abu Hanifa, may Allah have mercy on him, so it is not valid even if connected. If he says 'I owe Fulan a thousand from the price of a bondmaid he sold me and I did not receive, and the bondmaid has no trace,' that is Explanation of Alteration according to Abu Hanifa, may Allah have mercy on him, because the acknowledgement of the obligation of the price is an acknowledgement of receipt upon the destruction of the sold item; for if it perished before receipt, the sale would be annulled so the price would not remain obligatory. The Second Discussion: Regarding the Sunnah of the Messenger of Allah, may Allah bless him and grant him peace, which is more than the number of sand and pebbles.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 113
  },
  {
    "serial_number": "3420582",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 269,
    "volume_number": 1,
    "text": "Section on the divisions of the Report (Khabar). The report of the Messenger of Allah, may Allah bless him and grant him peace, is in the status of the Book regarding the obligation of knowledge and action upon it, for whoever obeys him has obeyed Allah. So what was mentioned regarding the discussion of the Specific, General, Shared, and Ambivalent in the Book applies likewise regarding the Sunnah, except that the doubt in the chapter of the Report is in its establishment from the Messenger of Allah, may Allah bless him and grant him peace, and its connection to him. For this meaning, the Report became of three divisions: 1. A division that is authentic from the Messenger of Allah, may Allah bless him and grant him peace, and established from him without doubt; this is the Mutawatir (Mass-Transmitted). 2. A division in which there is a type of doubt; this is the Mashhur (Famous). 3. A division in which there is probability and doubt; this is the Ahad (Solitary).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 114
  },
  {
    "serial_number": "3420583",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 272,
    "volume_number": 1,
    "text": "Discussion on the Mutawatir necessitating definitive knowledge. The Mutawatir is what a group transmitted from a group whose agreement on a lie is inconceivable due to their large number, and it connected to you in this manner. Examples of it are the transmission of the Qur'an, the numbers of Rak'ahs, and the amounts of Zakat. The Mashhur is what was initially like the Ahad, then it became famous in the second and third eras, and the Ummah received it with acceptance, so it became like the Mutawatir until it connected to you. That is like the Hadith of wiping over the leather socks and stoning in the chapter of adultery. Then, the Mutawatir necessitates definitive knowledge, and rejecting it is Disbelief (Kufr). The Mashhur necessitates the knowledge of tranquility, and rejecting it is Innovation (Bid'ah). There is no disagreement among scholars regarding the obligation of acting upon both. The discussion is only regarding the Ahad. We say: The Solitary Report (Khabar al-Wahid) is what one transmitted from one, or one from a group, or a group from one, and there is no consideration for the number if it does not reach the limit of the Mashhur. It necessitates action upon it in legal rulings with the condition of the narrator's Islam, justice, precision, and intellect, and that it connects to you from the Messenger of Allah, may Allah bless him and grant him peace, with this condition.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 115
  },
  {
    "serial_number": "3420584",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 275,
    "volume_number": 1,
    "text": "Discussion on dividing the narrator into two categories. Then, the narrator is originally of two categories: 1. Known for knowledge and Ijtihad, like the four Caliphs, Abdullah ibn Mas'ud, Abdullah ibn Abbas, Abdullah ibn Umar, Zayd ibn Thabit, Mu'adh ibn Jabal, and their likes, may Allah be pleased with them. So if their narration from the Messenger of Allah, may Allah bless him and grant him peace, is authentic to you, acting upon their narration is preferred over acting upon Analogy (Qiyas). For this reason, Muhammad, may Allah have mercy on him, narrated the Hadith of the Bedouin who had an ailment in his eye regarding the issue of loud laughter and abandoned Qiyas. And he narrated the Hadith of placing women behind in the issue of alignment and abandoned Qiyas. And he narrated from Aisha the Hadith of vomiting and abandoned Qiyas by it. And he narrated from Ibn Mas'ud the Hadith of prostration of forgetfulness after the Salam and abandoned Qiyas. The second category of narrators are those known for memory and justice but not Ijtihad and Fatwa, like Abu Huraira and Anas ibn Malik. If the narration of their likes is authentic to you, if the report agrees with Qiyas, there is no obscurity in the obligation to act upon it. But if it opposes it, acting upon Qiyas is preferred. An example is what Abu Huraira narrated regarding ablution from what fire has touched...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 116
  },
  {
    "serial_number": "3420585",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 276,
    "volume_number": 1,
    "text": "...so Ibn Abbas said to him: 'Do you see if you performed ablution with heated water, would you perform ablution [again] from it?' And he remained silent. He only rejected it by Qiyas; for if he had a report, he would have narrated it. Based on this, our companions abandoned the narration of Abu Huraira in the issue of the Musarrah (animal with retained milk) due to Qiyas and considering the difference in the states of the narrators.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 117
  },
  {
    "serial_number": "3420586",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 280,
    "volume_number": 1,
    "text": "Discussion on the condition of acting upon the Solitary Report. We said: The condition for acting upon the Solitary Report is that it must not be contrary to the Book and the Famous Sunnah, and that it must not be contrary to the Apparent (Zahir). He said, peace be upon him: (Hadiths will multiply for you after me. So if a Hadith is narrated to you from me, compare it against the Book of Allah; whatever agrees, accept it, and whatever opposes, reject it). The verification of that is in what was narrated from Ali ibn Abi Talib, that he said: Narrators were of three categories: 1. A sincere believer who accompanied the Messenger of Allah, may Allah bless him and grant him peace, and knew the meaning of his speech. 2. A Bedouin who came from a tribe, heard some of what he heard but did not know the reality of the speech of the Messenger of Allah, may Allah bless him and grant him peace, then returned to his tribe and narrated with other than the wording of the Messenger of Allah, may Allah bless him and grant him peace, so the meaning changed while he thought the meaning did not differ. 3. A hypocrite whose hypocrisy was not known, so he narrated what he did not hear and fabricated; people heard from him and thought him a sincere believer, so they narrated that and it became famous among people. For this meaning, it became obligatory to compare the Report against the Book and the Famous Sunnah. An example of comparing against the Book is in the Hadith of touching the penis, regarding what is narrated from him: (Whoever touches his penis, let him perform ablution). We compared it against the Book, and it came out contrary to the saying of the Exalted {In it are men who love to purify themselves}, for they used to clean themselves with stones then wash with water. If touching the penis were an event breaking ritual purity, this would be defilement, not purification absolutely. Likewise his saying, peace be upon him: (Any woman who marries herself without the permission of her guardian, her marriage is void, void, void) came out contrary to the saying of the Exalted {Do not prevent them from marrying their husbands}...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 118
  },
  {
    "serial_number": "3420587",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 281,
    "volume_number": 1,
    "text": "...for the Book necessitates the realization of marriage from them. An example of comparing against the Famous Report is the narration of judging based on a witness and an oath; for it came out contrary to his saying, upon him be [peace]: (The evidence is upon the claimant and the oath is upon the denier).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 119
  },
  {
    "serial_number": "3420588",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 284,
    "volume_number": 1,
    "text": "Discussion on abandoning action upon the Solitary Report if it opposes the Apparent. Considering this meaning, we said: If the Solitary Report comes out contrary to the Apparent, it is not acted upon. Among the forms of opposing the Apparent is the lack of fame of the Report regarding matters of general necessity in the first and second eras, because they are not accused of negligence in following the Sunnah. So if the Report does not become famous despite the intense need and general necessity, that is a sign of its lack of authenticity. An example in legal judgments: If one person informs that his wife became forbidden to him due to breastfeeding that occurred [later], it is permissible to rely on his report and marry her sister. But if he informed that the contract was void by the ruling of breastfeeding [initially], his report is not accepted. Likewise, if a woman informs of the death of her husband or his divorcing her while he is absent, it is permissible [for her] to rely on his report and marry another. If the Qiblah is confusing to him and one person informs him about it, acting upon it is obligatory. If he finds blood [or fluid] whose state he does not know, and one person informs him of its impurity, he does not perform ablution with it; rather, he performs Tayammum.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 120
  },
  {
    "serial_number": "3420589",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 287,
    "volume_number": 1,
    "text": "Discussion on the authority of the Solitary Report in four places. Section: The Solitary Report is a proof in four places: [1] Pure right of Allah the Exalted which is not a punishment. [2] Pure right of the servant which involves pure obligation. [3] Pure right of His [implied servant/Allah] which involves no obligation. [4] Pure right of His [or servant] which involves obligation from one perspective. As for the first, the report of one person is accepted in it, for the Messenger of Allah, may Allah bless him and grant him peace, accepted the testimony of a Bedouin regarding the crescent of Ramadan. As for the second, number and justice are conditions in it; its parallel is disputes. As for the third, the report of a single person is accepted in it, whether just or unrighteous; its parallel is transactions. As for the fourth, either number or justice is a condition in it according to Abu Hanifa, may Allah be pleased with him; its parallel is dismissal [of an agent] and interdiction. The Third Discussion: On Consensus (Ijma'). Section: The Consensus of this Ummah after the Messenger of Allah, may Allah bless him and grant him peace, passed away regarding branches...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 121
  },
  {
    "serial_number": "3420590",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 288,
    "volume_number": 1,
    "text": "...of the religion is a proof necessitating action upon it legally, as an honor to this Ummah. Then Consensus is of four divisions: 1. Consensus of the Companions, may Allah be pleased with them, on the ruling of an incident explicitly. 2. Then their consensus by the text of some and the silence of the rest regarding rejection.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 122
  },
  {
    "serial_number": "3420591",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 291,
    "volume_number": 1,
    "text": "Discussion on Consensus being of four divisions. 3. Then the consensus of those after them regarding what the statement of the predecessors was not found in. 4. Then the consensus on one of the statements of the predecessors. As for the first, it is in the status of a verse from the Book of Allah the Exalted. Then the consensus by the text of some and the silence of the rest is in the status of the Mutawatir. Then the consensus of those after them is in the status of the Mashhur of reports. Then the consensus of the later scholars on one of the statements of the predecessors is in the status of the Authentic of the Solitary Reports. What is considered in this chapter is the consensus of the people of opinion and Ijtihad; the statement of the commoners, the theologian, and the hadith scholar who has no insight into the principles of jurisprudence is not considered. Then after that, Consensus is of two types: Compound and Non-Compound. Compound is what opinions agreed upon regarding the ruling of the incident while differing in the cause. An example is the consensus on the existence of [wudu] breakage upon vomiting and touching a woman. According to us, it is based on vomiting; and according to him [Shafi'i], it is based on touching. Then this type of consensus does not remain a proof after the appearance of invalidity...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 123
  },
  {
    "serial_number": "3420592",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 292,
    "volume_number": 1,
    "text": "...in one of the two bases. So if it is established that vomiting is not a breaker, Abu Hanifa does not say there is breakage in it. And if it is established that touching is not a breaker, Al-Shafi'i does not say there is breakage in it, due to the invalidity of the cause upon which the ruling was built. And the invalidity is imagined in both sides, due to the possibility that Abu Hanifa, may Allah have mercy on him, is correct in the issue of touching [that it doesn't break] and mistaken in the issue of vomiting, and Al-Shafi'i is correct in the issue of vomiting [that it doesn't break] and mistaken in the issue of touching. So this does not lead to building the existence of consensus on falsehood.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 124
  },
  {
    "serial_number": "3420593",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 295,
    "volume_number": 1,
    "text": "Discussion on a type of Consensus which is the absence of a proponent of separation. Section: Contrary to the previously mentioned consensus. The conclusion is that the lifting of this consensus is permissible due to the appearance of invalidity in what it was built upon. For this reason, if a judge judges in an incident, then the slavery of the witnesses appears, or their lying [is proven] by retraction, his judgment becomes void, even if that does not appear regarding the right of the claimant. Considering this meaning, [the share of] 'those whose hearts are to be reconciled' dropped from the eight categories due to the cessation of the cause. And the share of the relatives dropped due to the cessation of its cause. Based on this, if an impure garment is washed with vinegar so the impurity is removed, the purity of the locus is judged due to the cessation of its cause [the impurity]. Or by this, the difference between Hadath (ritual impurity) and Khabath (physical impurity) is established; for vinegar removes impurity from the locus, but vinegar does not provide purity of the locus, rather the purifier provides it, which is water. Section: Then after that is a type of Consensus, which is the absence of a proponent of separation. That is of two types: One of them is when the origin of the disagreement in the two sections is one.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 125
  },
  {
    "serial_number": "3420594",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 296,
    "volume_number": 1,
    "text": "Allah Blessed and Exalted, may Allah be pleased with them, the Lord Mighty and Majestic. And the second is when the origin is different. The first is a proof, and the second is not a proof. An example of the first is in what the scholars derived of jurisprudential issues based on a single principle. Its parallel: If we establish that the prohibition of legal disposals necessitates their confirmation, we say: A vow to fast on the Day of Sacrifice is valid, and a corrupt sale provides ownership, due to the absence of a proponent of separation. If we say that suspension is a cause upon the existence of the condition, we say: Suspending divorce and manumission on ownership [is valid], and the cause of ownership is valid. Likewise, if we establish that arranging a ruling on a noun described with an attribute does not necessitate suspending the ruling on it, we say: The affluence of a free woman does not prevent the permissibility of marrying a bondmaid, since it is authentic by the transfer of the predecessors that Al-Shafi'i, may Allah have mercy on him, branched the issue of the free woman's affluence on this principle. If we establish the permissibility of marrying a believing bondmaid despite affluence, the marriage of a Kitabi bondmaid is permissible by this principle. Based on this is the example of what we mentioned previously. The parallel of the second: If we say that vomiting is a breaker, then corrupt sale provides ownership due to the absence of a proponent of separation. Or intentional killing necessitates retaliation due to the absence of a proponent of separation. Or like this: Vomiting is not a breaker, so touching is a breaker. This is not a proof, because the correctness of the branch, although it indicates the correctness of its origin, it does not necessitate the correctness of another origin until the other issue branches from it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 126
  },
  {
    "serial_number": "3420595",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 300,
    "volume_number": 1,
    "text": "Discussion on the explanation of the duty upon the Mujtahid. Section: The duty upon the Mujtahid is to seek the ruling of the incident from the Book of Allah the Exalted, then from the Sunnah of the Messenger of Allah, may Allah bless him and grant him peace, by the explicit text or its indication as mentioned before. For there is no way to act upon opinion (Ra'y) with the possibility of acting upon the Text. For this reason, if the Qiblah is confusing to him and one person informs him about it, it is not permissible for him to investigate. And if he finds water and a just person informs him that it is impure, it is not permissible for him to perform ablution with it; rather, he performs Tayammum. Considering that acting upon opinion is inferior to acting upon the Text, we said that doubt in the locus is stronger than doubt in the conjecture, such that the consideration of the servant's conjecture drops in the first section. An example is if he has intercourse with his son's bondmaid; he is not punished (Hadd) even if he says 'I knew she is forbidden to me,' and the lineage of the child is established from him, because the doubt of ownership is established by the Text in the son's wealth. He said, upon him be blessings and peace: (You and your wealth belong to your father). So the consideration of his conjecture regarding lawfulness and prohibition drops in that. But if the son has intercourse with his father's bondmaid, his conjecture regarding lawfulness and prohibition is considered, such that if he said 'I thought she was forbidden to me,' the Hadd is obligatory.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 127
  },
  {
    "serial_number": "3420596",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 301,
    "volume_number": 1,
    "text": "And if he says: \"I thought that she was lawful for me,\" the Hadd (punishment) is not obligated. This is because the doubt of ownership (Shubhat al-Mulk) regarding the father's wealth is established by the Text, so his opinion is considered. However, the lineage of the child is not established even if he claims it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 128
  },
  {
    "serial_number": "3420597",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 304,
    "volume_number": 1,
    "text": "Discussion: What the Mujtahid does when two proofs contradict.\nThen, if two proofs contradict according to the Mujtahid: If the contradiction is between two Verses, he leans towards the Sunnah. If it is between two Sunnahs, he leans towards the traces of the Companions, may Allah Almighty be pleased with them, and sound Analogy (Qiyas). Then, if two Analogies contradict according to the Mujtahid, he investigates (yataharr'a) and acts upon one of them, because there is no legal proof inferior to Analogy to which one can resort.\nBased on this, we said: If a traveler has two vessels, one pure and one impure, he does not investigate between them; rather, he performs Tayammum. But if he has two garments, one pure and one impure, he investigates between them. This is because water has a substitute, which is soil, while the garment has no substitute to resort to.\nIt is established by this that acting upon opinion (Ra'y) is only upon the absence of other evidence in the Sharia.\nThen, if he investigates and his investigation is confirmed by action, that is not annulled by mere [later] investigation. Its explanation is in the case where he investigates between two garments and prays Dhuhr in one of them, then his investigation for Asr falls upon the other garment; it is not permissible for him to pray Asr in the other. This is because the first [opinion] was confirmed by action, so it is not invalidated by mere investigation.\nThis is contrary to the case where he investigates the Qibla, then his opinion changes and his investigation falls upon another direction; he turns towards it. This is because the Qibla accepts transition (Intiqal), so moving the...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 129
  },
  {
    "serial_number": "3420598",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 305,
    "volume_number": 1,
    "text": "...ruling is possible, similar to the abrogation of a Text. Upon this are the issues of Al-Jami' Al-Kabir regarding the Takbirs of Eid and the changing of the slave's opinion, as is known.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 130
  },
  {
    "serial_number": "3420599",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 308,
    "volume_number": 1,
    "text": "Discussion: The Authority of Analogy (Qiyas) and the Obligation to Act upon it.\nThe Fourth Discussion: Chapter on Analogy (Qiyas).\nAnalogy is one of the proofs of the Sharia. It is obligatory to act upon it when there is an absence of superior evidence regarding the incident. Reports and Traces have been narrated concerning this.\nUpon sending Mu'adh bin Jabal to Yemen, he (the Prophet), peace and blessings be upon him, said: \"By what will you judge, O Mu'adh?\" He said: \"By the Book of Allah Almighty.\" He said: \"If you do not find [it there]?\" He said: \"By the Sunnah of the Messenger of Allah, may Allah bless him and grant him peace.\" He said: \"If you do not find [it there]?\" He said: \"I will strive with my opinion (Ajiahidu Ra'yi).\" The Messenger of Allah, may Allah bless him and grant him peace, approved of him and said: \"Praise be to Allah Who guided the messenger of the Messenger of Allah to what He loves and is pleased with.\"\nIt was narrated that a Khath'ami woman came to the Messenger of Allah, may Allah bless him and grant him peace, and said: \"Indeed, my father is an old man; the Hajj has become obligatory upon him but he cannot hold himself upon the mount. Does it suffice me to perform Hajj on his behalf?\" He, peace be upon him, said: \"Do you see, if your father had a debt and you paid it, would it suffice you?\" She said: \"Yes.\" He, peace be upon him, said: \"Then the debt of Allah is more worthy and deserving.\"\nThe Messenger of Allah, peace be upon him, joined the Hajj regarding the senile old man with financial rights, and he indicated an effective cause (Illah) influential in permissibility, which is \"Paying/Fulfillment\" (Al-Qada'). And this is Analogy (Qiyas).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 131
  },
  {
    "serial_number": "3420600",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 312,
    "volume_number": 1,
    "text": "Discussion: Reports that Establish the Authority of Analogy.\n1 - Ibn al-Sabbagh, who is among the leaders of the Shafi'i scholars, narrated in his book named \"Al-Shamil\" from Qays bin Talq bin Ali that he said: A man came to the Messenger of Allah, may Allah bless him and grant him peace, appearing to be a Bedouin, and said: \"O Prophet of Allah, what do you say about a man touching his penis after he has performed Wudu?\" He said: \"Is it but a piece of flesh from him?\" And this is Analogy.\n2 - And Ibn Mas'ud was asked about one who married a woman and did not name a dowry for her, and her husband died before consummation. He asked for a month's respite, then said: \"I will strive in it with my opinion. If it is correct, it is from Allah, and if it is a mistake, it is from Ibn Umm Abd (himself).\" He said: \"I see for her a dowry similar to that of her womenfolk (Mahr al-Mithl), without reduction and without excess.\"",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 132
  },
  {
    "serial_number": "3420601",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 314,
    "volume_number": 1,
    "text": "Discussion: The Conditions for the Validity of Analogy are Five.\nChapter: The conditions for the validity of Analogy are five.\nFirst: That it does not oppose the Text.\nSecond: That it does not imply changing a ruling of the Text.\nThird: That the extended ruling is not one whose meaning is beyond reason (La Ya'qilu Ma'nahu).\nFourth: That the reasoning (Ta'lil) occurs for a legal matter, not for a linguistic matter.\nFifth: That the Branch (Al-Far') is not already specified in the Text.\n\nAn example of Analogy opposing the Text is what is narrated that Al-Hasan bin Ziyad was asked about loud laughter (Qahqahah) in prayer. He said: \"Purity is broken by it.\" The questioner said: \"If one slanders a chaste woman during prayer, Wudu is not broken by it, even though slandering a chaste woman is a greater crime. So how is it broken by laughter, which is lesser than it?\" This is an Analogy opposing the Text, which is the Hadith of the Bedouin who had an ailment in his eyes.\nLikewise, if we said: \"The Hajj of a woman is permissible with a Mahram, so it is permissible with trustworthy women,\" this would be an Analogy opposing the Text, which is his saying, peace be upon him: \"It is not lawful for a woman who believes in Allah and the Last Day to travel for more than three days and nights unless her father, husband, or a Mahram relative is with her.\"\n\nAn example of the Second, which is what implies changing a ruling of the Text, is what is said: \"Intention (Niyyah) is a condition in Wudu by Analogy to Tayammum.\" For this necessitates...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 133
  },
  {
    "serial_number": "3420602",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 315,
    "volume_number": 1,
    "text": "...changing the Verse of Wudu from Absoluteness (Itlaq) to Restriction (Taqyid).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 134
  },
  {
    "serial_number": "3420603",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 318,
    "volume_number": 1,
    "text": "Discussion: Clarifying Examples of the Conditions of Analogy.\nLikewise, if we say: \"Tawaf around the House is Prayer according to the Report, so Purity and covering the 'Awrah are conditions for it like Prayer,\" this would be an Analogy necessitating the change of the Text of Tawaf from Absoluteness to Restriction.\n\nAn example of the Third, which is what is beyond reason (cannot be rationalized), is regarding the permissibility of performing Wudu with Date Nabidh (Infusion). If one said: \"It is permissible with other types of Nabidh by Analogy to Date Nabidh,\" or said: \"If one receives a wound in his prayer or has a wet dream, he builds upon his prayer by Analogy to the case where Hadath (impurity) precedes him [accidentally],\" it is not valid. This is because the ruling in the Original (Asl) is not rationalized in its meaning, so extending it to the Branch is impossible.\nSimilar to this is what the Shafi'i scholars, may Allah have mercy on them, said: \"Two impure Qullahs (large jars), if they combine, become pure. So if they separate, they remain upon purity by Analogy to when impurity falls into two Qullahs.\" Because the ruling, if established in the Original, would have a meaning that is not rational.\n\nAn example of the Fourth, which is that the reasoning be for a legal matter not a linguistic matter, is in their saying: \"Cooked juice (Monassaf) is Khamr (Wine), because Khamr is only Khamr because it clouds (Khamara) the mind, and the other clouds the mind as well, so it is Khamr by Analogy.\" And: \"The thief (Sariq) is only a thief because he took the wealth of another by way of stealth, and the grave-robber (Nabash) shares this meaning with him, so he is a thief by Analogy.\" This is Analogy in Language, despite his admission that the Name was not coined for it in the language.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 135
  },
  {
    "serial_number": "3420604",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 319,
    "volume_number": 1,
    "text": "The evidence for the corruption of this type of Analogy is that the Arab calls the horse \"Adham\" due to its blackness and \"Kumayt\" due to its reddish-blackness, yet he does not apply this name to the Zanj (black person) or the red garment. If Analogy were valid in linguistic names, that would have been permissible due to the existence of the Cause (Illah). Also, because this leads to invalidating legal causes (Asbab). That is because the Sharia made Theft a cause for a type of ruling; so if we suspend the ruling on what is more general than Theft—which is taking another's property by way of stealth—it becomes clear that the cause in the Original was a meaning other than Theft. Likewise, it made drinking Khamr a cause for a type of ruling; so if we suspend the ruling on a matter more general than Khamr, it becomes clear that the ruling in the Original was attached to other than Khamr.\n\nAn example of the Fifth Condition, which is (That the Branch is not already specified in the Text), is as it is said: \"Freeing a disbelieving neck (slave) in the expiation (Kaffarah) of Oaths and Dhihar is not permissible by Analogy to the expiation of Murder.\" And: \"If the one doing Dhihar has intercourse during the feeding, he restarts the feeding by Analogy to Fasting.\" And: \"It is permissible for the Muhsar (blocked pilgrim) to decompose (Tahallul) by Fasting by Analogy to the Mutamatti'.\" And: \"The Mutamatti', if he does not fast during the days of Tashriq, fasts after them by Analogy to the makeup (Qada') of Ramadan.\"",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 136
  },
  {
    "serial_number": "3420605",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 325,
    "volume_number": 1,
    "text": "Discussion: Defining Legal Analogy (Qiyas Shar'i)\nChapter: Legal Analogy is the arrangement of a ruling in a non-textual case based on a meaning that is the Cause (Illah) for that ruling in the textual case.\nFurthermore, the status of the meaning as a Cause is known by the Book, the Sunnah, Consensus (Ijma'), and by Ijtihad and Deduction (Istinbat).\n\nDiscussion: The Cause Known by the Book\nAn example of the Cause known by the Book is \"Frequent Circulation\" (Kathrat al-Tawaf). It was made a Cause for the dropping of difficulty (Haraj) in seeking permission [to enter] in His Almighty's saying: {There is no blame upon you nor upon them after that; [they are] those who circulate among you, some of you among others} [24:58].\nThen the Messenger of Allah, peace and blessings be upon him, dropped the difficulty of the impurity of the cat's saliva by the ruling of this Cause, saying, peace be upon him: \"The cat is not impure; indeed, it is of those who circulate among you (Al-Tawwafin) and those (females) who circulate (Al-Tawwafat).\"\nSo our companions drew an analogy for all that resides in houses, such as the mouse and the snake, to the cat based on the Cause of Circulation (Tawaf).\n\nLikewise, His Almighty's saying: {Allah intends for you ease and does not intend for you hardship} [2:185]. The Sharia clarified that breaking the fast for the sick and the traveler is to make the matter easy for them, so that they may be able to realize what they deem preferable: either performing the duty of the time or delaying it to other days.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 137
  },
  {
    "serial_number": "3420606",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 326,
    "volume_number": 1,
    "text": "Considering this meaning, Abu Hanifa, may Allah have mercy on him, said: If the traveler intends another duty during the days of Ramadan, it counts for the other duty. Because since concessions were established for him regarding what relates to the interests of his body—which is breaking the fast—then for that to be established for him regarding what relates to the interests of his religion—which is discharging the self from the liability of duty—is even more fitting.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 138
  },
  {
    "serial_number": "3420607",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 329,
    "volume_number": 1,
    "text": "Discussion: The Cause Known by the Sunnah\nAn example of the Cause known by the Sunnah is in his saying, peace and blessings be upon him: \"Wudu is not upon one who sleeps standing, sitting, bowing, or prostrating; Wudu is only upon one who sleeps reclining.\" For if he sleeps reclining, his joints relax. He made the relaxation of joints a Cause. Thus, the ruling extends by this Cause to sleeping while leaning or propped against something such that if it were removed, he would fall. Likewise, the ruling extends by this Cause to fainting and intoxication.\nLikewise, his saying, peace be upon him: \"Perform Wudu and pray, even if blood drips onto the mat drippingly, for it is a vein that burst.\" He made the bursting of blood a Cause, so the ruling extends by this Cause to Venesection (Fasd) and Cupping (Hijama).\n\nAn example of the Cause known by Consensus (Ijma') is what we said: \"Minority\" (Sighar) is a Cause for the guardianship of the father regarding the young boy, so the ruling is established regarding the young girl due to the existence of the Cause. And \"Puberty with Reason\" is a Cause for the removal of the father's guardianship regarding the boy, so the ruling extends to the girl by this Cause. And the bursting of blood is a Cause for the breaking of Purity regarding the woman with Istihadah, so the ruling extends to others due to the existence of the Cause.\n\nThen after that, we say: Analogy is of two types.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 139
  },
  {
    "serial_number": "3420608",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 330,
    "volume_number": 1,
    "text": "The first is that the Extended Ruling is of the same Type (Nau') as the ruling established in the Original. The second is that it is of its Genus (Jins).\nAn example of Unity in Type is what we said: That Minority is a Cause for the guardianship of marriage regarding the boy, so the guardianship of marriage is established regarding the girl due to the existence of the Cause in her. And by it, the ruling is established regarding the minor non-virgin (Thayyib).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 140
  },
  {
    "serial_number": "3420609",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 333,
    "volume_number": 1,
    "text": "Discussion: The Cause Derived by Consensus [Analogy of Genus]\nLikewise, we said: Circulation (Tawaf) is the Cause for the dropping of impurity of saliva in the cat's saliva, so the ruling extends to the saliva of the dwellers of houses due to the existence of the Cause. And the Puberty of the boy with reason is the Cause for the removal of marriage guardianship, so the guardianship is removed from the girl by the rule of this Cause.\n\nAn example of Unity in Genus is what is said: Frequent Circulation (Tawaf) is the Cause for dropping the difficulty of Seeking Permission regarding those whom our right hands possess (slaves), so the difficulty of the impurity of saliva drops by this Cause. For indeed, this difficulty is of the Genus of that difficulty, not of its Type.\nLikewise, Minority is the Cause for the father's guardianship of disposal regarding Property, so the guardianship of disposal regarding the Self (Marriage) is established by the rule of this Cause. And indeed, the puberty of the girl with reason is the Cause for the removal of the father's guardianship regarding Property, so his guardianship regarding the Self is removed by this Cause.\nThen, in this type of Analogy, it is necessary to Generalize the Cause (Tajnis al-Illah), by saying: The father's guardianship regarding the property of the minor girl is only established because she is incapable of disposal by herself; so the Sharia established the father's guardianship so that her interests related to that would not be neglected. And she is incapable of disposal regarding herself, so holding the father's guardianship over her becomes obligatory. And upon this are its counterparts.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 141
  },
  {
    "serial_number": "3420610",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 334,
    "volume_number": 1,
    "text": "The rule of the First Analogy is that it is not invalidated by the Distinction (Al-Farq), because the Original and the Branch, when they are united in the Cause, their unity in the Ruling is obligatory, even if they differ in other than this Cause.\nThe rule of the Second Analogy is its corruption by prohibiting the Generalization (Muman'at al-Tajnis) and by Specific Distinction (Al-Farq Al-Khass), which is showing that the effect of Minority in the guardianship of disposal regarding Property is stronger than its effect in the guardianship of disposal regarding the Self.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 142
  },
  {
    "serial_number": "3420611",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 338,
    "volume_number": 1,
    "text": "Discussion: The Cause Known by Opinion and Ijtihad\nThe explanation of the Third Division, which is Analogy by a Cause deduced by Opinion and Ijtihad, is apparent.\nThe verification of that is: If we find a description suitable (Munasib) for the ruling, and it is such that it necessitates the establishment of the ruling and requires it upon considering it, and the ruling is paired with it in the place of Consensus; the ruling is attributed to it due to suitability, not due to the testimony of the Sharia that it is a Cause.\nIts counterpart is: If we see a person giving a Dirham to a poor man, it predominates in opinion that the giving is to repel the need of the poor man and to acquire the benefits of reward.\nIf this is known, we say: If we see a description suitable for the ruling, and the ruling is paired with it in the place of Consensus, opinion predominates to attribute the ruling to that description. Predominance of opinion (Ghalabat al-Zann) in the Sharia necessitates action when superior evidence is lacking. It is like the traveler: if it predominates in his opinion that water is near him, Tayammum is not permissible for him. Upon this are the issues of Investigation (Taharri).\nThe rule of this Analogy is that it is invalidated by a Suitable Distinction (Al-Farq Al-Munasib). Because in that case, there exists another suitable factor in the form of the ruling, so the opinion of attributing the ruling to it [the first cause] does not remain. Thus, the ruling is not established by it, because it was based on the predominance of opinion, and that has been annulled by the Distinction.\nBased on this, acting upon the First Type was like judging by testimony after the validation (Tazkiyah) and probity check of the witness.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 143
  },
  {
    "serial_number": "3420612",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 339,
    "volume_number": 1,
    "text": "And the Second Type is like testimony upon the appearance of justice before the validation (Tazkiyah). And the Third Type is like the testimony of the one of unknown status (Mastur).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 144
  },
  {
    "serial_number": "3420613",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 341,
    "volume_number": 1,
    "text": "Discussion: The Objections Directed at Analogy\nChapter: The Objections directed at Analogy are eight: Denial (Al-Muman'ah), Saying according to the Implication of the Cause (Al-Qawl bi-Mujab al-Illah), Inversion (Al-Qalb), Reversal (Al-'Aks), Corruption of Placement (Fasad al-Wad'), Distinction (Al-Farq), Inconsistency (Al-Naqd), and Contradiction (Al-Mu'arada).\nAs for Denial (Al-Muman'ah), it is of two types: First is denying the Description (Wasf). Second is denying the Ruling (Hukm).\nAn example [of denying the Ruling] is in their saying: \"Sadaqat al-Fitr became obligatory due to the Breaking of Fast (Fitr), so it does not drop by his death on the night of Fitr.\" We said: We do not concede its obligation due to Fitr; rather, according to us, it is obligatory due to a 'Head' (Ra's) that he supports and has guardianship over.\nLikewise, if it is said: \"The amount of Zakat is obligatory in the liability (Dhimmah), so it does not drop by the destruction of the Nisab, like a debt.\" We said: We do not concede that the amount of Zakat is obligatory in the liability; rather, its performance is obligatory. And if he says: \"Its performance is obligatory, so it does not drop by destruction, like a debt after the demand.\" We said: We do not concede that performance is obligatory in the form of a debt; rather, withholding is prohibited until he discharges the responsibility by releasing [the wealth]. This is of the category of denying the Ruling.\nLikewise, if he says: \"Wiping is a pillar in the chapter of Wudu, so tripling it is not [Sunnah] like Washing.\"",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 145
  },
  {
    "serial_number": "3420614",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 342,
    "volume_number": 1,
    "text": "We said: We do not concede that tripling is Sunnah in Washing; rather, prolonging the action on the locus of the obligation is an addition to the obligatory, like prolonging the standing and recitation in the chapter of Prayer. However, prolonging in the chapter of Washing is not imaginable except by repetition to encompass the locus with the action. And we say the like thereof in the chapter of Wiping: that prolonging is Sunnah by way of Encompassing (Istia'ab).\nLikewise, it is said: \"Taking possession (Taqabud) in the sale of food for food is a condition, like Money (Nuqud).\" We said: We do not concede that Taqabud is a condition in the chapter of Money; rather, the condition is Specification (Ta'yin) so that it does not become a sale of debt for debt. However, Money is not specified except by Taking Possession according to us.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 146
  },
  {
    "serial_number": "3420615",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 346,
    "volume_number": 1,
    "text": "Discussion: Saying according to the Implication of the Cause (Al-Qawl bi-Mujab al-Illah)\nAs for \"Saying according to the Implication of the Cause,\" it is admitting that the Description is a Cause, but clarifying that its Effect (Ma'lul) is other than what the Proponent claimed.\nAn example is: \"The elbow is a Limit (Hadd) in the chapter of Wudu, so it does not enter under the washing, because the Limit does not enter into the Limited.\" We said: The elbow is the Limit of the Dropped part, so it does not enter under the ruling of the Dropped part, because the Limit does not enter into the Limited [thus it remains washed].\nLikewise, it is said: \"The Fast of Ramadan is an obligatory Fast, so it is not valid without Specification (Ta'yin), like Makeup (Qada').\" We said: The obligatory fast is not valid without Specification, except that Specification exists here from the side of the Sharia. And if he says: \"The Fast of Ramadan is not valid without Specification from the Servant, like Qada'.\" We said: Qada' is not valid without Specification because Specification was not established from the side of the Sharia in Qada', so for that reason, the Servant's specification is conditioned. But here, Specification is found from the side of the Sharia, so the Servant's specification is not conditioned.\n\nAs for Inversion (Al-Qalb), it is of two types.\nOne of them is that he makes what the Proponent made a Cause for the ruling, an Effect for that ruling.\nAn example in legal matters: \"The flow of Riba in the large quantity necessitates its flow in the small quantity, like Prices (Athman), so selling a handful of food for two handfuls of it is prohibited.\"",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 147
  },
  {
    "serial_number": "3420616",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 347,
    "volume_number": 1,
    "text": "We said: No, rather the flow of Riba in the small quantity necessitates its flow in the large quantity, like Prices.\nLikewise in the issue of the refugee in the Haram (Sanctuary): \"The prohibition of destroying the Soul necessitates the prohibition of destroying the Limb, like Game.\" We said: Rather, the prohibition of destroying the Limb necessitates the prohibition of destroying the Soul, like Game. So if you made its Cause an Effect for that ruling, it does not remain a Cause for it, due to the impossibility of one thing being a Cause for a thing and an Effect for it.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 148
  },
  {
    "serial_number": "3420617",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar al-Kitab al-Arabi, Beirut - Lebanon",
    "page_number": 350,
    "volume_number": 1,
    "text": "Discussion: Dividing Inversion (Al-Qalb) into Two Parts\nThe Second Type of Inversion is that the Questioner makes what the Proponent made a Cause for the ruling he claimed, a Cause for the opposite of that ruling. Thus, it becomes a proof for the Questioner after it was a proof for the Proponent.\nAn example is: \"The Fast of Ramadan is an obligatory Fast, so Specification is a condition for it, like Makeup (Qada').\" We said: Since the Fast is obligatory [and time-fixed], Specification is not a condition for it after the day has been specified for it, like Qada' [would be if fixed].\n\nAs for Reversal (Al-'Aks), we mean by it that the Questioner holds on to the Proponent's principle in a way that the Proponent is forced into the mode of comparison between the Original and the Branch.\nAn example is: \"Jewelry prepared for daily use (Ibtidhal); Zakat is not obligatory in it, like clothes for daily use.\" We said: If Jewelry were in the status of Clothes, Zakat would not be obligatory in men's jewelry, like clothes for daily use.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 149
  },
  {
    "serial_number": "3420618",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 352,
    "volume_number": 1,
    "text": "Discussion on the Converse (Aks), Invalidity of Placement (Fasad al-Wad'), and Inconsistency (Naqd). As for Invalidity of Placement, what is meant by it is making a description a Cause ('Illah) that is not suitable for that ruling. An example of this is their statement regarding the Islam of one of the spouses: 'Difference of religion has occurred upon the marriage, so it corrupts it, like the apostasy of one of the spouses.' For he made Islam a cause for the removal of ownership [of marriage]. We said: Islam is known to be a protector of ownership, so it cannot be effective in the removal of ownership. Likewise, in the issue of the affluence of a free woman: 'He is a free man capable of marriage [to a free woman], so marrying a bondmaid is not permissible for him, just as if he had a free woman under him.' We said: The description of being free and capable implies the permissibility of marriage, so it cannot be effective in the non-permissibility. As for Inconsistency (Naqd), it is like what is said: 'Ablution is a purification, so intention is a condition for it, like Tayammum.' We said: This is inconsistent [breached] by the washing of a garment and a vessel. As for Opposition (Mu'aradah), it is like what is said: 'Wiping is a pillar in ablution, so performing it thrice is Sunnah, like washing.' We said: Wiping is a pillar, so performing it thrice is not Sunnah, like wiping over leather socks and Tayammum.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 150
  },
  {
    "serial_number": "3420619",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 353,
    "volume_number": 1,
    "text": "Section: The Ruling relates to its Cause (Sabab), is established by its Effective Cause ('Illah), and is found at its Condition (Shart). The Cause (Sabab) is that which is a path to a thing through a medium, like a road; for it is a cause for arriving at the destination through the medium of walking. And the rope; for it is a cause for reaching water by letting the bucket down. Based on this, whatever is a path to a ruling through a medium is called a Cause (Sabab) for it legally, and the medium is called the Effective Cause ('Illah). An example of this is opening the door of the stable and cutting the tether of the slave; for it is a cause of the destruction through the medium found from the animal, the bird, and the slave.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 151
  },
  {
    "serial_number": "3420620",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 356,
    "volume_number": 1,
    "text": "Discussion on the difference between the Cause (Sabab) and the Effective Cause ('Illah). When the Cause and the Effective Cause come together, the ruling is attributed to the Effective Cause, not the Cause, unless attributing it to the Effective Cause is impossible; then it is attributed to the Cause. Based on this, our companions said: If one gives a knife to a boy and he kills himself with it, he [the giver] is not liable. But if it falls from the boy's hand and wounds him, he is liable. If one places a boy on an animal and makes it walk, and it prances right and left, and he falls and dies, he is not liable. If one guides a person to the property of another and he steals it, or to a person and he kills him, or to a caravan and he robs them, liability is not obligatory upon the guide. This is contrary to the depositary if he guides a thief to the deposit and he steals it, or a person in Ihram guides another to the game of the Sanctuary and he kills it. For the obligation of liability on the depositary is due to abandoning the protection obligatory upon him, not due to the guidance. And upon the person in Ihram, it is because guidance is prohibited by his Ihram, like touching perfume and wearing sewn garments, so he is liable for committing the prohibition, not due to the guidance [itself causing the destruction]. However, the crime is only established by the reality of killing; as for before that, it has no ruling due to the possibility of the effect of the crime being lifted, similar to healing in the chapter of wounds.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 152
  },
  {
    "serial_number": "3420621",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 359,
    "volume_number": 1,
    "text": "Discussion on the Cause (Sabab) sometimes being in the meaning of the Effective Cause ('Illah). The Cause may be in the meaning of the Effective Cause, so the ruling is attributed to it. An example is when the Effective Cause is established by the Cause; thus the Cause is in the meaning of the Effective Cause, because since the Effective Cause is established by the Cause, it becomes in the meaning of the 'Cause of the Effective Cause,' so the ruling is attributed to it. For this reason, we said: If one drives an animal and it destroys something, the driver is liable. And the witness, if he destroys wealth by his testimony, then its falsehood appears by retraction, he is liable. This is because the walking of the animal is attributed to the driving, and the judgment of the judge is attributed to the testimony; since he has no choice but to judge after the truth appears via the testimony of a just person before him, he becomes like one compelled in that, similar to the animal by the action of the driver. Then, the Cause may be established in the place of the Effective Cause...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 153
  },
  {
    "serial_number": "3420622",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 361,
    "volume_number": 1,
    "text": "...when it is impossible to ascertain the reality of the Effective Cause, to make the matter easy for the subject (Mukallaf). The consideration of the [actual] Effective Cause drops, and the ruling revolves around the Cause. An example of this in legal matters is complete sleep; since it was established in the place of impurity (Hadath) [escaping gas etc.], the consideration of the reality of impurity drops, and the breaking of wudu revolves around the completeness of sleep. Likewise, valid privacy (Khulwah Sahihah); since it was established in the place of intercourse, the consideration of the reality of intercourse drops, and the ruling revolves around the validity of the privacy regarding the right of the full dowry and the obligation of the waiting period (Iddah). Likewise, travel; since it was established in the place of hardship regarding the concession, the consideration of the reality of hardship drops, and the ruling revolves around the travel itself. Even if a Sultan were to tour the borders of his kingdom intending the distance of travel, he would have the concession of breaking the fast and shortening the prayer. Sometimes, what is not a cause is metaphorically called a cause, like an oath; it is called a cause for expiation, though it is not a cause in reality, for a cause does not negate the existence of the effect, while the oath negates the obligation of expiation, for expiation only becomes obligatory by breaking the oath (Hinth), and by that, the oath ends.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 154
  },
  {
    "serial_number": "3420623",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 362,
    "volume_number": 1,
    "text": "Likewise, suspending a ruling on a condition, like divorce and emancipation, is called a cause metaphorically, but it is not a cause in reality. This is because the ruling is only established at the condition, and the suspension ends with the existence of the condition, so it cannot be a cause with the existence of mutual negation between them.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 155
  },
  {
    "serial_number": "3420624",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 364,
    "volume_number": 1,
    "text": "Discussion on the attachment of legal rulings to their causes. Section: Legal rulings are attached to their causes. This is because the [reality of] obligation is hidden from us, so there must be a sign by which the servant knows the obligation of the ruling. By this consideration, rulings are attributed to causes. So, the cause for the obligation of prayer is the Time, by the proof that the address to perform the prayer is not directed before the entry of the time, but is directed only after the entry of the time. The address (Khitab) establishes the obligation of performance and informs the servant of the cause of obligation before it. This is like our saying: 'Pay the price of the sold item' and 'Pay the maintenance of the wife.' There is nothing existing here that defines it for the servant except the entry of the time. Thus, it becomes clear that the obligation is established by the entry of the time. Also, because the obligation is established upon those whom the address does not cover, like the sleeper and the one who has fainted, and there is no obligation before the time, so it is established by the entry of the time. By this, it appears that the first part [of the time] is the cause for the obligation. Then after that, there are two ways: One of them is the transfer of causality from the first part to the second if he does not perform it in the first part, then to the third and the fourth, until it ends at the last of the time. The obligation is then established [firmly], and the state of the servant in that part is considered, and the attribute of that part is considered. The explanation of considering the state of the servant in it is: If he was a child at the beginning of the time and became an adult in that [last] part...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 156
  },
  {
    "serial_number": "3420625",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 365,
    "volume_number": 1,
    "text": "...or was a disbeliever at the beginning of the time and became Muslim in that part, or she was menstruating or in postpartum bleeding at the beginning of the time and became pure in that part, the prayer becomes obligatory. Based on this are all forms of the occurrence of legal capacity at the end of the time. And conversely: If menstruation, postpartum bleeding, encompassing insanity, or extended fainting occurs in that part, the prayer drops from him. If he was a traveler at the beginning of the time and a resident at its end, he prays four. If he was a resident at the beginning of the time and a traveler at its end, he prays two cycles. The explanation of considering the attribute of that part: If that part is complete [valid time], the duty is established as complete, so one does not fulfill the responsibility by performing it in disliked times. An example is what is said: The end of the time in Fajr is complete, and the time only becomes corrupt by the rising of the sun, which is after the exit of the time; so the obligation is established with the attribute of perfection. Thus, if the sun rises during the prayer, the obligatory prayer becomes void, because he cannot complete the prayer except with the attribute of deficiency due to the time. But if that part was deficient, as in the Asr prayer—for the end of the time is the time of the sun's reddening, and the time then is corrupt—the duty is established with the attribute of deficiency. For this reason, it is necessary to say it is permissible [to pray Asr] then, despite the corruption of the time. The second way is to make every part of the parts of the time a cause, not by way of transfer—for saying that implies invalidating the causality established by the Law—and this does not entail the multiplication of the obligation, for the second part only establishes...",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 157
  },
  {
    "serial_number": "3420626",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 366,
    "volume_number": 1,
    "text": "...the essence of what the first part established. This belongs to the category of overlapping causes and the multiplicity of witnesses in the chapter of disputes. The cause of the obligation of Fasting is the witnessing of the month, due to the direction of the address upon witnessing the month and the attribution of fasting to it. The cause of the obligation of Zakat is the ownership of a productive Nisab (minimum taxable amount), essentially or legally. Considering the obligation of the cause, hastening is permissible in the chapter of performance. The cause of the obligation of Hajj is the House [Kaaba], due to its attribution to the House and the non-repetition of the duty in one's lifetime. Based on this, if one performs Hajj before the existence of ability [financial/physical means], it stands in for the Hajj of Islam due to the existence of the cause. In this, it differs from the payment of Zakat before the existence of the Nisab, due to the absence of the cause.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 158
  },
  {
    "serial_number": "3420627",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 373,
    "volume_number": 1,
    "text": "Discussion on Impediments (Mawani') being four. The cause for the obligation of Sadaqat al-Fitr is the person [head] whom one supports and has authority over. Considering the cause, hastening is permissible, such that its performance before the day of Fitr is permissible. The cause for the obligation of Ushr (tithe) is productive land by the reality of the yield. The cause for the obligation of Kharaj (land tax) is land suitable for cultivation, so it is productive legally. The cause for the obligation of Wudu is Prayer according to some; for this reason, Wudu is obligatory on the one upon whom Prayer is obligatory, and there is no Wudu on the one upon whom there is no Prayer. Some said the cause of its obligation is Hadath (impurity), and the obligation of Prayer is a condition; this has been narrated from Muhammad explicitly. The cause for the obligation of Ghusl is menstruation, postpartum bleeding, and sexual impurity (Janabah). Section: The Judge and Imam Abu Zaid said: Impediments are of four divisions: An impediment that prevents the convening of the Effective Cause ('Illah). An impediment that prevents its completion. An impediment that prevents the beginning of the ruling. And an impediment that prevents its continuation.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 159
  },
  {
    "serial_number": "3420628",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 374,
    "volume_number": 1,
    "text": "The parallel of the first: The sale of a free person, carrion, and blood. For the absence of the locus prevents the transaction from convening as an effective cause for providing the ruling. Based on this are all suspensions (Ta'liqat) according to us, for suspension prevents the transaction from convening as an effective cause before the existence of the condition, according to what we mentioned. For this reason, if he swore not to divorce his wife, then suspended the divorce of his wife on entering the house, he does not break the oath. An example of the second: The destruction of the Nisab during the year, the refusal of one of the two witnesses to testify, and the rejection of half the contract. An example of the third: Sale with a condition of option, and the remaining of time regarding the person with an excuse. An example of the fourth: The option of puberty, manumission, and inspection; lack of compatibility; and healing in the chapter of wounds, based on this principle. This is considering the permissibility of specifying the legal effective cause. As for the opinion of those who do not say the specification of the effective cause is permissible, the impediment according to him is of three divisions: An impediment preventing the beginning of the effective cause, an impediment preventing its completion, and an impediment preventing the continuation of the ruling. But upon the completion of the effective cause, the ruling is established inevitably. Based on this, whatever the first group made an impediment to the establishment of the ruling, the second group made it an impediment to the completion of the effective cause.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 160
  },
  {
    "serial_number": "3420629",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 375,
    "volume_number": 1,
    "text": "And upon this principle, the discussion revolves between the two groups.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 161
  },
  {
    "serial_number": "3420630",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 379,
    "volume_number": 1,
    "text": "Discussion explaining the meaning of Fard (Obligatory) linguistically and legally. Section: Fard linguistically is estimation (Taqdir). The 'Mafruḍat' of the Sharia are its estimated measures such that they do not accept increase or decrease. In the Sharia, it is what is established by a definitive proof (Dalil Qat'i) in which there is no doubt. Its ruling is the obligation to act upon it and to believe in it. And Wajib (Necessary) is the 'falling' [or landing], meaning what falls upon the servant without choice from him. It is said it is from 'al-Wajbah,' which is agitation/disturbance. The Wajib is named such because it is agitated between the Fard and the Nafl (Voluntary). So it became Fard regarding action, such that leaving it is not permissible, and Nafl regarding belief, so believing in it decisively is not binding upon us. In the Sharia, it is what is established by a proof in which there is doubt, like an interpreted verse or an authentic solitary report (Ahad). Its ruling is what we mentioned. The Sunnah is an expression for the path followed and pleasing in the chapter of religion, whether it is from the Messenger of Allah, may Allah bless him and grant him peace, or from the Companions. He, peace be upon him, said: (Upon you is my Sunnah and the Sunnah of the Caliphs after me; bite onto it with your molars).",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 162
  },
  {
    "serial_number": "3420631",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 380,
    "volume_number": 1,
    "text": "Its ruling is that a person is demanded to keep it alive and deserves blame for leaving it, unless he leaves it with an excuse. Nafl (Voluntary) is an expression for increase. Booty (Ghanimah) is called Nafl because it is an increase over what is the objective of Jihad. In the Sharia, it is an expression for what is an increase over the Fara'id (Obligatory acts) and Wajibat (Necessary acts). Its ruling is that a person is rewarded for doing it and is not punished for leaving it. Nafl and Tatawwu' are parallels.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 163
  },
  {
    "serial_number": "3420632",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 383,
    "volume_number": 1,
    "text": "Discussion on what 'Azimah (Resolve/Strict Law) is linguistically and legally. Section: 'Azimah is the intent when it is at the utmost firmness. For this reason, we said that the 'resolve' to have intercourse is a 'return' in the chapter of Zihar, because it is like the existent, so it is permissible to consider it existent when the indication stands. For this reason, if he said 'I resolve' [to swear], he becomes a swearer. In the Sharia, it is an expression for the rulings that bind us primarily. It was named 'Azimah because it is at the utmost firmness due to the firmness of its cause, which is that the Commander is obligated to be obeyed by the ruling that He is our God and we are His slaves. The divisions of 'Azimah are what we mentioned of Fard and Wajib.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 164
  },
  {
    "serial_number": "3420633",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 385,
    "volume_number": 1,
    "text": "Discussion explaining Rukhsa (Concession/License) linguistically and legally. As for Rukhsa, it is an expression for ease and facility. In the Sharia, it is diverting the command from difficulty to ease by means of an excuse in the subject (Mukallaf). Its types vary due to the variation of their causes, which are the excuses of the servants. In the outcome, they revert to two types. One of them is the license of action while the prohibition remains, similar to pardon in the chapter of crimes. That is like running a word of disbelief on the tongue with the tranquility of the heart during coercion, reviling the Prophet, peace be upon him, destroying the property of a Muslim, and killing a soul unjustly. Its ruling is that if he was patient until he was killed, he would be rewarded for refraining from the forbidden out of veneration for the prohibition of the Lawgiver, peace be upon him. The second type is changing the attribute of the action such that it becomes permissible (Mubah) in his right. Allah the Exalted said: {But whoever is forced by severe hunger}. That is like coercion to eat carrion and drink wine. Its ruling is that if he refrained from consuming it until he was killed, he would be a sinner for refraining from the permissible, and he becomes like the killer of himself.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 165
  },
  {
    "serial_number": "3420634",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 388,
    "volume_number": 1,
    "text": "Discussion that arguing without proof is of types. Section: Argumentation without proof is of types. Among them: 1 - Reasoning by the absence of the cause for the absence of the ruling. Example: Vomit does not break wudu because it did not exit from the two passages. And a brother does not emancipate [automatically] upon a brother because there is no birth [relationship] between them. Muhammad, may Allah have mercy on him, was asked: 'Is retaliation (Qisas) obligatory on the partner of a boy [in murder]?' He said: 'No, because the Pen is lifted from the boy.' The questioner said: 'Then it must be obligatory on the partner of the father, because the Pen is not lifted from the father.' So holding onto the absence of the cause for the absence of the ruling became like saying: 'Fulan did not die because he did not fall from the roof.' Unless the cause of the ruling is restricted to a meaning, such that that meaning is necessary for the ruling; then one argues by its negation for the absence of the ruling. An example is what was narrated from Muhammad, may Allah have mercy on him, that he said: 'The offspring of the usurped [animal] is not guaranteed because it is not usurped.' And 'There is no retaliation on the witness in the issue of witnesses to retaliation if they retract, because he is not a killer.' This is because usurpation is necessary for the liability of usurpation, and killing is necessary for the existence of retaliation.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 166
  },
  {
    "serial_number": "3420635",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 389,
    "volume_number": 1,
    "text": "Likewise, holding onto 'Presumption of Continuity' (Istishab al-Hal) is holding onto the absence of proof, since the existence of a thing does not necessitate its remaining. So it is suitable for defense, not for imposition (Ilzam). Based on this, we said: If someone claims slavery against a person of unknown lineage, then commits a crime against him, the indemnity (Arsh) of a free man is not obligatory upon him, because imposing the indemnity of a free man is an imposition, so it is not established without proof. Based on this, we said: If blood exceeds ten [days] in menstruation and the woman has a known habit, she is returned to the days of her habit, and the excess is Istihadah (irregular bleeding). This is because the excess over the habit is connected to the blood of menstruation and the blood of Istihadah, so it bore both possibilities. If we judged by the breaking of the waiting period [ruling it as new menses], we would be acting without proof. Likewise, if she started as a beginner with puberty having Istihadah, her menstruation is ten days, because what is less than ten bears the possibility of menstruation and Istihadah. If we judged by the lifting of menstruation [before ten], we would be acting without proof. This is contrary to what is after ten, due to the existence of proof that menstruation does not exceed ten. Among the proofs that there is no proof in it [Istishab] except as an argument for defense, not imposition, is the issue of the Missing Person (Mafqud). For indeed, no one else is entitled to his inheritance [defense of his ownership], but if one of his relatives dies during his absence, he does not inherit from him [cannot impose ownership]. So the entitlement of another is repelled without proof, but entitlement is not established for him without proof.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 167
  },
  {
    "serial_number": "3420636",
    "category_id": "11",
    "category": "Principles of Fiqh",
    "book_title": "Usul al-Shashi",
    "edition": "None",
    "publisher": "Dar Al-Kitab Al-Arabi, Beirut - Lebanon",
    "page_number": 394,
    "volume_number": 1,
    "text": "Discussion that there is no Khums (one-fifth tax) in Ambergris according to Abu Hanifa. If it is said: It has been narrated from Abu Hanifa, may Allah have mercy on him, that he said: 'There is no Khums in Ambergris because the report (Athar) has not been transmitted regarding it,' and this is holding onto the absence of proof. We said: He only mentioned that to explain his excuse for not saying there is Khums in Ambergris. For this reason, it is narrated that Muhammad asked about Khums in Ambergris. He [Abu Hanifa] said: 'What is the case of Ambergris that there is no Khums in it?' He said: 'Because it is like fish.' He said: 'And what is the case of fish that there is no Khums in it?' He said: 'Because it is like water, and there is no Khums in it.' And Allah the Exalted knows best the truth. Usul al-Shashi is completed with 'Umdat al-Hawashi.",
    "foot_note": "None",
    "book_id": "6302",
    "new_page_number": 168
  }
]