[
  {
    "text": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 1
  },
  {
    "text": "sn: 3243\nbook_title: تصحيح حديث إفطار الصائم قبل سفرة بعد الفجر\nbook_link: https://shamela.ws/book/11097\nbook_id: 11097\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مكتبة المعارف\nedition: الطبعة الشرعية الوحيدة 1421هـ -2001م\npages: 58\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التخريج والأطراف\ncategory_id: 8",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 2
  },
  {
    "serial_number": "3197557",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Takhrij and Atraf\nBook: Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 3
  },
  {
    "serial_number": "3197558",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction...\nIn the name of Allah, the Most Gracious, the Most Merciful.\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow him.\nTo proceed: Today, I present to the noble readers intriguing research and useful discussions, if Allah the Exalted wills. It offers them a new color of combined Hadith and Fiqh scientific verification regarding a very important issue that often arises for some, the need for it, and knowing the correct opinion regarding it. That is: \"The fasting person breaking his fast in Ramadan before his travel after dawn.\"\nIt is indeed strange that some people today proceed to deny the Hadith reported regarding this, which defines for the Muslim the stance he must take regarding it, despite the authenticity of its chain of narration (Isnad), the probity of its narrators, its conformity with the apparent meaning of the Qur'an, the testimony of the Salaf's traditions (Athar) for it, and its agreement with a principle from the principles of the glorious Sharia: {Allah intends for you ease and does not intend for you...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 4
  },
  {
    "serial_number": "3197559",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 4,
    "volume_number": 1,
    "text": "...hardship} [Al-Baqarah: 185], and a group of Imams of Fiqh and Hadith acted upon it. [Their denial] is nothing but partisanship for their jurisprudential branch, contrary to what was authentically reported from their Imam as a principle among his principles: \"If the Hadith is authentic, then it is my madhhab (school of thought).\"\nI had published these researches in the flourishing magazine \"Al-Tamaddun Al-Islami\" (Issues 25-36, year 1379) in three consecutive articles. It then appeared to me to separate them from the magazine and publish them in an independent treatise as they appeared in the magazine, hoping that the benefit from them would be more widespread and our reward, if Allah the Exalted wills, would be greater.\nI ask Allah, the Mighty and Majestic, to make it purely for His Noble Face and to bring about general benefit through it.\nDamascus, evening of the Day of Arafah, year 1379 AH.\nMuhammad Nasir al-Din al-Albani.",
    "foot_note": "1. See the introduction to our book \"The Description of the Prophet's Prayer (peace and blessings of Allah be upon him)\", which is among the publications of Maktabat Al-Ma'arif in Riyadh.",
    "book_id": "11097",
    "new_page_number": 5
  },
  {
    "serial_number": "3197560",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 5,
    "volume_number": 1,
    "text": "Entrance...\nThe Professor Sheikh Nasir al-Din al-Albani previously commented with a word on a fatwa in this magazine regarding this subject, clarifying that it is from the Sunnah for the fasting person to break his fast in his house before leaving it. We received a word from Professor Sheikh Abdullah bin Muhammad al-Harari - through Professor Sheikh Hamdi al-Juwayjani - in which he mentioned that some readers presented that word [of Al-Albani] to him, and he saw it as relying on a weak Hadith. We showed Professor Al-Albani the word of Professor Al-Harari, so he supported what he held previously with a new word. We publish the two words in what follows:\n\n1 - Professor Al-Harari said:\n\"In the Jami' of Al-Tirmidhi: Chapter regarding one who eats then leaves for travel. Qutaybah narrated to us, Abdullah bin Ja'far narrated to us, from Zaid bin Aslam, from Muhammad bin al-Munkadir, from Muhammad bin Ka'b who said: I came to Anas bin Malik in Ramadan while he intended to travel; his mount had been prepared and he had worn the clothes of travel. He called for food and ate. I said: 'Is it Sunnah?' He said: 'It is Sunnah.' Then...",
    "foot_note": "None\n\nNone",
    "book_id": "11097",
    "new_page_number": 6
  },
  {
    "serial_number": "3197562",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 6,
    "volume_number": 1,
    "text": "...he rode.\nMuhammad bin Ismail narrated to us, Sa'id bin Abi Maryam narrated to us, Muhammad bin Ja'far narrated to us, Zaid bin Aslam narrated to me, Muhammad bin al-Munkadir narrated to me, from Muhammad bin Ka'b who said: I came to Anas bin Malik in Ramadan, and he mentioned something similar.\nAbu Isa [Al-Tirmidhi] said: This is a Hasan (Good) Hadith. Muhammad bin Ja'far is Ibn Abi Kathir, a Madinan, trustworthy (Thiqah), and he is the brother of Ismail bin Ja'far. Abdullah bin Ja'far is Ibn Abi Najih, the father of Ali bin al-Madini, and Yahya bin Ma'in used to weaken him. Some people of knowledge have adopted this Hadith and said: The traveler may break his fast in his house before he leaves, and he may not shorten the prayer until he exits the wall of the city or the village. This is the saying of Ishaq.\nThis grading of 'Hasan' by Al-Tirmidhi is rejected, for two Hafizs (Memorizers of Hadith) have weakened this Hadith; one from the predecessors and the other from the successors:",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 7
  },
  {
    "serial_number": "3197563",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 7,
    "volume_number": 1,
    "text": "The first: The critic Hafiz Abu Hatim al-Razi. His son, Hafiz Abdur-Rahman, said in 'Al-Ilal' (p. 240) the following text: 'I asked my father about a Hadith narrated by Abdul-Aziz bin Muhammad al-Darawardi from Zaid bin Aslam from Muhammad bin Ka'b that he came to Anas bin Malik in Ramadan while he intended to travel, and he found that his mount had been prepared and he had worn the clothes of travel. He called for food and ate. We said: Is it Sunnah? He said: It is not Sunnah. And Muhammad bin Abdur-Rahman bin Mujbar narrated it from Ibn al-Munkadir from Muhammad bin Ka'b that he came to Anas bin Malik... and he mentioned the Hadith. He said: I said: Is it Sunnah? He said: It is Sunnah. My father said: The Hadith of Al-Darawardi is more correct.' End quote.\nThis is, as is apparent, explicit that the narration of Al-Tirmidhi is outweighed (Marjuh) and that the preponderant narration is the narration of negation.\nThe second: He is Al-Hafiz Al-Iraqi, Zain al-Din Abdur-Rahim, the Sheikh of...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 8
  },
  {
    "serial_number": "3197564",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 8,
    "volume_number": 1,
    "text": "...Hafiz Ibn Hajar. He said in his commentary on Al-Tirmidhi: 'There is a manuscript copy in the Mahmudiya Library in Medina, number 168': This Hadith of Anas was uniquely narrated by Al-Tirmidhi, and he graded it Hasan due to the follow-up (Mutaba'ah) of Muhammad bin Ja'far for Abdullah bin Ja'far. Otherwise, Abdullah is weak, as the author reported his weakening from Ibn Ma'in, for he said regarding him: He is nothing. Abu Hatim al-Razi said regarding him: Very Munkar (denounced) in Hadith. Al-Nasa'i said regarding him: Matruk (abandoned) in Hadith. Al-Fallas said: Weak in Hadith. Al-Daraqutni said regarding him: Has many Munkar narrations. Abu Hatim said: He used to have delusions in reports, bringing them inverted, and he makes mistakes in traditions (Athar) so that they seem inverted. Ibn Adi said: Most of his Hadiths are not followed up by anyone, but despite his weakness, he is among those whose Hadith is written down. The author of Al-Mizan said: He is agreed upon to be weak. End quote.\nHe said: And Al-Tirmidhi only graded the Hadith Hasan because Abdullah bin Ja'far was not alone in narrating it; rather, Muhammad bin Ja'far bin Abi Kathir followed him up in it...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 9
  },
  {
    "serial_number": "3197565",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 9,
    "volume_number": 1,
    "text": "...Al-Madani, and he is trustworthy (Thiqah) as Al-Tirmidhi said.\nIf this is established, there is a matter that must be noted: The point of evidence in the Hadith is Anas saying in it that 'it is Sunnah'. The ruling of a Companion on a 'matter' that it is Sunnah takes the ruling of a Marfu' (traceable to the Prophet) Hadith, as is established in the sciences of Hadith and Usul. This phrase was only narrated with certainty (Jazm) by Abdullah bin Ja'far, and he is agreed upon to be weak as mentioned previously.\nAs for the path of Muhammad bin Ja'far, Al-Tirmidhi did not cite its wording; rather, he said, 'and he mentioned something similar'. This does not imply that it is identical in wording, as is established in the sciences of Hadith.\nThen we searched for the wording of the narration of Muhammad bin Ja'far bin Abi Kathir, and we found that he did not state this phrase with certainty as Abdullah bin Ja'far did. Ismail bin Ishaq Al-Qadi narrated it likewise in the book 'Al-Siyam'. He said: Isa bin Mina narrated to us, he said: Muhammad bin Ja'far bin Abi Kathir narrated to us, from Zaid bin Aslam, from Ibn al-Munkadir, from Muhammad bin Ka'b...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 10
  },
  {
    "serial_number": "3197566",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 10,
    "volume_number": 1,
    "text": "...he said: I came to Anas bin Malik in Ramadan while he intended to travel, so he ate. I said: 'Sunnah?' I do not think but that he said: 'Yes.'\nThis is the wording of Muhammad bin Ja'far's narration, and some of its narrators doubted regarding this phrase which is the basis of the argument. However, Al-Daraqutni narrated it in his Sunan from Abu Bakr al-Naysaburi from Ismail bin Ishaq bin Sahl from Ibn Abi Maryam from Muhammad bin Ja'far, and he mentioned it and did not doubt regarding this phrase; rather he said: I said: 'Sunnah?' He said: 'Yes.'\nIbn al-Arabi said: The Hadith of Anas is authentic (Sahih), but no one adopted it except Ahmad bin Hanbal.\nI say: There is disagreement regarding it upon Ali bin Sa'id bin Abi Maryam. Ismail bin Ishaq reported from him what preceded, while Yahya bin Ayyub al-Allaf contradicted him and made the story about breaking the fast on the Day of Doubt, not the intention to travel. Al-Tabarani narrated it likewise in 'Al-Mu'jam Al-Awsat'. He said: Yahya bin Ayyub al-Allaf narrated to us, he said: Sa'id bin Abi Maryam narrated to us, narrated to us...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 11
  },
  {
    "serial_number": "3197567",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 11,
    "volume_number": 1,
    "text": "...Muhammad bin Ja'far bin Abi Kathir from Zaid bin Aslam from Muhammad bin al-Munkadir from Muhammad bin Ka'b who said: I entered upon Anas bin Malik at Asr time on a day they were doubting [whether it was Ramadan or not], and I wanted to greet him. He called for food and ate. I said: 'Is what you have done Sunnah?' He said: 'Yes.'\nKhalid bin Nazar followed up Sa'id bin Abi Maryam on his narration in this manner. Al-Tabarani also narrated it in 'Al-Awsat', saying: Al-Miqdam, who is Ibn Dawud, narrated to us, Khalid bin Nazar narrated to us, Muhammad bin Ja'far narrated to us. So if the Hadith is disturbed (Mudtarib), it is not authentic.\nThen we searched to see if we could find anyone who followed up Abdullah bin Ja'far and Muhammad bin Ja'far in narrating this Hadith from Zaid bin Aslam to strengthen one of the two narrations. We found Abdul-Aziz bin Muhammad al-Darawardi, who is one of the narrators of the Sahih, had narrated it from Zaid bin Aslam contrary to the narration of Abdullah bin Ja'far. Ismail Al-Qadi also narrated it likewise. He said: Ali bin al-Madini and Ibrahim bin...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 12
  },
  {
    "serial_number": "3197568",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 12,
    "volume_number": 1,
    "text": "...Hamzah narrated to us from Al-Darawardi from Zaid bin Aslam with his chain of narration, and he said in it: So I said to him: 'Sunnah?' He said: 'No', then he rode.\nThis path is stronger than the path of Abdullah bin Ja'far. So we found the two paths to be authentic: one contains doubt regarding the phrase, and the other contradicts it. In Al-Tabarani, the Hadith is carried upon a meaning other than breaking fast for travel. Thus, the weakness of the narration affirming it as Sunnah becomes clear. And Allah knows best.\nScholars have differed on this issue upon several opinions:\nThe first: Which is the opinion of the majority of scholars, that whoever starts the day fasting and then travels, he is not permitted to break his fast that day at all, neither before commencing travel nor after it. This is the opinion of Ibrahim al-Nakha'i, Al-Zuhri, Yahya bin Sa'id al-Ansari, Al-Awza'i, Abu Hanifa and his companions, Malik, Al-Shafi'i, and Abu Thawr.\nThe second: That he may break his fast if he leaves and emerges beyond the houses. This is the opinion of Ahmad bin Hanbal, and it was narrated from Abdullah bin Umar and Al-Sha'bi.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 13
  },
  {
    "serial_number": "3197569",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 13,
    "volume_number": 1,
    "text": "Some of them argued for the permissibility of breaking the fast with the authentic Hadith regarding his (peace and blessings of Allah be upon him) leaving in Ramadan for Mecca, and that he fasted until he reached Al-Kadid, then he broke his fast. In a narration: 'until he reached Kura' al-Ghamim'. So whoever used this as evidence imagined that Al-Kadid and Al-Kura' are near Medina and that the Prophet (peace and blessings of Allah be upon him) started the day in Medina fasting and then reached them in the remainder of his day and broke his fast. Thus, using this Hadith as evidence for that is invalid.\nThe third: That he may break his fast if he places his foot in the saddle. This was said by Dawud, and Ibn Abd al-Barr related it from Ishaq. This is contrary to what Al-Tirmidhi related from him [Ishaq], that he may break his fast in his house before he leaves, unless it is interpreted that he placed his foot in the saddle while he was in his house then ate before leaving. But the Hadith of Anas contradicts it in that he called for his food and ate then rode. And Allah knows best.\nThe fourth: That he may break his fast in his house on the day he intends to leave. This is the opinion of Anas and Al-Hasan al-Basri as narrated from him, and the author [Al-Tirmidhi] related it from...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 14
  },
  {
    "serial_number": "3197570",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 14,
    "volume_number": 1,
    "text": "...Ibn Rahwaih as preceded.\nIbn Abd al-Barr said: 'They agreed regarding the one who intends to travel in Ramadan that it is not permissible for him to intend to break the fast the night before, because the traveler does not become a traveler by intention; he only becomes a traveler by setting out on his journey.' End of Al-Iraqi's words.\nAl-Bukhari narrated from Ibn Abbas: The Prophet (peace and blessings of Allah be upon him) left Medina in Ramadan with ten thousand Muslims; he fasted and they fasted until he reached Al-Kadid, then he broke the fast and they broke the fast.\nAl-Hafiz Ibn Hajar said: If one intends to fast while resident then travels during the day, is he permitted to break his fast during that day? The majority forbade it. Ahmad and Ishaq said it is permissible, and Al-Muzani chose it, using this Hadith as evidence. It was said to him: He said that thinking that he (peace and blessings of Allah be upon him) broke the fast on the day he left Medina. But it is not so, for between Medina and Al-Kadid are several days.\nLikewise, there is no proof for the opponent in the Hadith of Abu Basrah al-Ghifari which Ahmad and Abu Dawood narrated via Ubayd bin Jubayr who said: I rode...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 15
  },
  {
    "serial_number": "3197571",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 15,
    "volume_number": 1,
    "text": "...with Abu Basrah al-Ghifari in a ship from Fustat in Ramadan. He pushed off, then brought his morning meal (Ghada') near, then said: 'Come near.' I said: 'Do you not see the houses?' He said: 'Do you desire to turn away from the Sunnah of the Messenger of Allah (peace and blessings of Allah be upon him)?' So he ate.\n[There is no proof in this] for two reasons:\nFirst: According to the reliable view, Abu Dawood's silence on what he narrates in his Sunan is not sufficient for the authenticity of the Hadith. Rather, it must be examined, and that is the task of the Hafiz (Hadith master), as established in the sciences of Hadith regarding the condition of memorization (Hifz) for distinguishing the authentic from the sickly Hadith, as stated by Al-Hakim in 'Ma'rifat Ulum al-Hadith'. As for the claim of this opponent that he possesses such qualification himself, it is but an empty claim.\nSecond: Even if it were authentic, there is no proof in it, because it does not state that he left after dawn then rode then ate. It is possible that he left his house before dawn and boarded the ship, so eating became permissible for him, as is the position of the majority: that whoever leaves before dawn is permitted to eat during that very day, unlike whoever leaves after dawn, for he may not break his fast in...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 16
  },
  {
    "serial_number": "3197572",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 16,
    "volume_number": 1,
    "text": "...that day, except for what follows it.\nWhat supports our interpretation of this Hadith is the narrator's saying: 'then he brought his Ghada' (morning meal) near'. Al-Ghada' in the language is what is eaten at the beginning of the day, contrary to what is customary today in the colloquial language where Al-Ghada' (lunch) is applied to what is eaten in the middle of the day just before noon or after it, for this is a newly invented usage. In 'Al-Qamus': 'Al-Ghada' is the food of the Ghadwah (early morning), and 'taghadda' means he ate at the beginning of the day.' And in it: 'Al-Ghadwah: The early morning or what is between the Fajr prayer and sunrise.' And Allah knows best.\"",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 17
  },
  {
    "serial_number": "3197573",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 17,
    "volume_number": 1,
    "text": "2 - Muhammad Nasir al-Din says, seeking help from Allah alone, the Lord of the worlds:\nThe Sheikh's words are confined to four matters:\nFirst: Weakening the Hadith of Anas.\nSecond: The Fiqh (jurisprudence) of the Hadith and who held that opinion.\nThird: Weakening the Hadith of Abu Basrah al-Ghifari.\nFourth: Its lack of indication, according to him, of what the Hadith of Anas indicated.\nI will discuss these matters in what follows, one after another in the mentioned order, asking the Master, Glory be to Him and Exalted is He, to inspire me with correctness in all of that and to grant success to the sincere ones to accept it and act upon the Fiqh contained therein. Indeed, He is Hearing and Responsive.\n\n1 - Confirmation of the Authenticity of Anas's Hadith.\nAs for the Hadith of Anas, I contemplated the Sheikh's words regarding it, and I found in them nothing but what increased my insight into its authenticity and certainty regarding the weakness of his speech and the flimsiness of what he clung to in weakening it. For he did not bring against what it indicates anything that is suitable...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 18
  },
  {
    "serial_number": "3197574",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 18,
    "volume_number": 1,
    "text": "...to be considered a doubt (Shubhah) regarding its authenticity, let alone being a proof for its weakness, if that were presented to the rules of the science of Hadith and its principles and the testimonies of the scholars to its establishment. Here is the detail:\nThe Sheikh had the audacity - contrary to what we knew of him in some of his treatises - to assert decisively the error of Al-Tirmidhi in his grading of the Hadith as Hasan, and he did not care at all about Imam Ibn al-Arabi's grading of it as authentic (Sahih) and others whom we will mention. He clung in doing so to matters that can be summarized in four:\nFirst: Abu Hatim's preference for the narration of Al-Darawardi with the wording: \"It is not Sunnah\" over the other narration: \"He said: Yes, Sunnah.\" We will express it as \"The Narration of Affirmation\".\nSecond: Al-Hafiz Al-Iraqi's weakening of the other narration.\nThird: The lack of certainty (Jazm) of some narrators regarding it.\nFourth: The disagreement regarding its text (Matn) upon Sa'id bin Abi Maryam; some mentioned from him: that the breaking of the fast was due to travel, and some that it...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 19
  },
  {
    "serial_number": "3197575",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 19,
    "volume_number": 1,
    "text": "...was due to the Day of Doubt.\n\nThe Answer to the First Matter:\n1- If that is clear, we say in answering the first matter:\nFirst: Understanding Abu Hatim's saying: \"The Hadith of Al-Darawardi is more correct than the Hadith of Ibn Mujbar\" to mean that the narration of Al-Tirmidhi is outweighed and weak, and that the preponderant one is the narration of negation, indicates - unfortunately - extreme ignorance of the methods of the Muhaddithin in weighing preferences (Tarjih) and a misunderstanding of their intents behind that. For Abu Hatim's preference is limited between two narrations, neither of which is Al-Tirmidhi's narration. Furthermore, it is a correct preference because Al-Darawardi is trustworthy (Thiqah) despite slight weakness in his memory as will come, unlike his opponent: Ibn Mujbar, for he is agreed to be weak. Abu Hatim himself said about him: \"Not strong,\" and his companion Abu Zur'ah said: \"Wahi al-Hadith\" (Flimsy in Hadith).",
    "foot_note": "1. \"Al-Jarh wa al-Ta'dil\" by Ibn Abi Hatim \"3/2/320\".",
    "book_id": "11097",
    "new_page_number": 20
  },
  {
    "serial_number": "3197576",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 20,
    "volume_number": 1,
    "text": "But what scholar, nay what sane person possessing a little understanding of Arabic style, understands from this a preference of this narration of Al-Darawardi over the narration of Al-Tirmidhi, when the latter was not mentioned in Abu Hatim's words, neither explicitly nor implicitly? Indeed, perhaps he did not come across it at all. Moreover, it [Al-Tirmidhi's narration] is stronger and more preponderant than Al-Darawardi's narration, as I will explain in the following point.\nThus falls the Sheikh's saying following Abu Hatim's words: \"It is explicit that the narration of Al-Tirmidhi is outweighed and that the preponderant narration is the narration of negation.\"\nSecond: Al-Darawardi's saying in his narration \"It is not Sunnah\" is Munkar (denounced) or at least Shadh (anomalous) for two reasons:\nA - His contradiction of one who is more trustworthy than him, namely Muhammad bin Ja'far bin Abi Kathir, who is trustworthy (Thiqah) as Al-Tirmidhi said, and the Sheikh himself quoted it from him. There is no dispute regarding him among the critical Imams; rather, the Two Sheikhs [Bukhari and Muslim] and all the authors of the Sunan relied on him as proof. So his narration is the preponderant one upon...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 21
  },
  {
    "serial_number": "3197577",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 21,
    "volume_number": 1,
    "text": "...conflict over the narration of Al-Darawardi, because the latter is disputed. Abu Zur'ah and others described him as having \"bad memory\", so naturally Al-Bukhari did not use him as proof, whereas they all used his opponent [Muhammad bin Ja'far] as proof.\nThus it is established that his narration is more deserving of preference than Al-Darawardi's narration, and no fair person who has smelled the scent of Hadith terminology doubts this.\nB - That Al-Darawardi's narration has no follower (Mutaabi') and no witness (Shahid), contrary to the narration of Muhammad bin Ja'far, for it has a follower and a witness:\nAs for the follower (Mutaabi'), it is Abdullah bin Ja'far in Al-Tirmidhi. Even if he is weak, his Hadith is written down as Ibn Adi said, so he is acceptable in follow-ups and witnesses.\nAs for the witness (Shahid), it is the Hadith of Ibn al-Mujbar which the Sheikh quoted from Ibn Abi Hatim. His weakness does not harm because it is in [the context of] witnesses, as is not hidden, and I do not think the Sheikh disagrees with that because he mentioned something similar in his treatise \"Al-Ta'aqub Al-Hathith\" (p. 5).",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 22
  },
  {
    "serial_number": "3197578",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 22,
    "volume_number": 1,
    "text": "Thus, by this verification, the Sheikh's attachment to Abu Hatim's words falls, and it becomes clear that the correct version is the Narration of Affirmation, and that Al-Darawardi's narration of negation is an error that cannot be relied upon.\n\nThe Answer to the Second Matter:\n2 - As for the second matter, which is Al-Iraqi's weakening of the Narration of Affirmation, the answer is from two aspects:\nFirst: Opposing it with the authentication of those who authenticated the Hadith, and they are a group. Their saying is weightier upon conflict than the saying of one who opposed them, who is an individual. Among those who authenticated it: Al-Tirmidhi, Ibn al-Arabi, Al-Diya al-Maqdisi - as will come - Ibn al-Qayyim in \"Zad al-Ma'ad\", and Abu al-Mahasin al-Maqdisi in \"Mukhtasar Ahadith al-Ahkam\" (fol. 61/1). To them can be added Imam Ahmad and Ishaq bin Rahwaih, for they adopted the Hadith and acted upon it by Al-Iraqi's own admission, and that is proof - if Allah the Exalted wills - that the Hadith is established according to them, which is the desired point.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 23
  },
  {
    "serial_number": "3197579",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 23,
    "volume_number": 1,
    "text": "Second: That the rules of the science of Hadith indicate the error of the mentioned weakening. I hope that neither the Professor Sheikh nor any of those partisan to him or others will exploit this to hasten to denounce us because of this declaration, for the truth is above persons, and scientific verification knows no hypocrisy.\nMoreover, the Sheikh has preceded me to such fault-finding; he decided on Al-Tirmidhi's error as you saw. So likewise, I decide on the error of Al-Iraqi and the Sheikh together, with a fundamental difference between me and him. He faults Al-Tirmidhi in imitation of Al-Iraqi, and this is preferring without a preferrer (Tarjih bila Murajjih) as is not hidden. If someone were to reverse the matter on him and imitate Al-Tirmidhi and fault Al-Iraqi, he would find no way to fault him except mere claim or following desire. As for us, we only find fault by following the scientific rules that scholars established as a scale to know error from correctness. What a difference between this and that.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 24
  },
  {
    "serial_number": "3197580",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 24,
    "volume_number": 1,
    "text": "Al-Iraqi's errors regarding the Hadith:\nThe meticulous researcher into the words of Hafiz Al-Iraqi, which the Sheikh quoted, will find in them many errors that must be revealed in defense of the Hadith, not persons.\nThe first: He acknowledges Al-Tirmidhi's grading of the Hadith as Hasan due to the follow-up of Muhammad bin Ja'far, then says regarding the Narration of Affirmation: \"It was only narrated with certainty (Jazm) by Abdullah bin Ja'far, and he is agreed upon to be weak,\" even though he mentioned shortly after that that Al-Daraqutni narrated it with certainty from the path of Muhammad bin Ja'far, the trustworthy narrator. So how then is his mentioned statement correct, which implies restricting this narration to the weak Abdullah?\nSimilarly, his saying regarding the narration of this Muhammad: \"He did not state this phrase with certainty as Abdullah bin Ja'far did.\" There is no doubt that this saying and that one are an error contrary to reality.\nSecond: His saying that the narration of Muhammad bin Ja'far is with doubt, even though...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 25
  },
  {
    "serial_number": "3197581",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 25,
    "volume_number": 1,
    "text": "...this narration from him is not established [as doubtful], and if it were established, it would not contradict the established narration from him, as will be explained in the answer referred to.\nThird: His finding a defect in the Hadith due to the disagreement upon Sa'id bin Abi Maryam with the narration of Al-Allaf from him, even though it is a Shadh (anomalous) narration contradicting the narration of trustworthy narrators from Sa'id, as will be verified in the answer to the third matter.\nFourth: Mentioning the narration of Al-Darawardi then saying: \"It is stronger than the path of Abdullah bin Ja'far.\" This is true, but it creates the illusion that Abdullah was not followed up on his narration, even though he mentioned that Muhammad bin Ja'far followed him up on his wording in Al-Daraqutni as preceded. So the narration of Muhammad and Abdullah [together] is sounder than the narration of Al-Darawardi as previously explained.\nThese errors are the pillars of Hafiz Al-Iraqi's statement regarding the \"weakness of the narration affirming it as Sunnah.\" Since these pillars have collapsed, his statement based on them has collapsed.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 26
  },
  {
    "serial_number": "3197582",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 26,
    "volume_number": 1,
    "text": "And consequently, the Sheikh's clinging to it falls, and he returns empty-handed.\nIn the following two answers, there is further clarification of what we summarized here.\n\nThe Answer to the Third Matter:\n3 - As for the answer to the third matter, which is the lack of certainty (Jazm) of some narrators regarding the Narration of Affirmation, it is that it is not permissible to use it to find a defect in the other narrations that are certain about the affirmation. Rather, these [certain ones] expose the defect of that [uncertain] one's narration, due to several points:\nFirst: That the one who did not possess certainty means he has no knowledge of the matter and did not memorize it, unlike the one who possessed certainty, for it indicates that he knew it and memorized it. So how can the narration of one who did not memorize be preferred over the narration of one who memorized?\nIs this not contrary to what is accepted by all scholars: that he who memorized is a proof against he who did not memorize, and he who knew is a proof against he who did not know? And contrary to the rule established among them which says:",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 27
  },
  {
    "serial_number": "3197583",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 27,
    "volume_number": 1,
    "text": "\"The Affirmer takes precedence over the Denier (or Negator).\"\nHow then, when this one who did not possess certainty does not deny; rather, he affirmed but without certainty? So this narration is in reality supporting the Narration of Affirmation and strengthening it. How then is it correct to make it a defect for it?\nSecond: That the narration of the one who did not possess certainty regarding the affirmation is not authentic originally, so it is not permissible to use it as evidence, let alone to oppose with it what the trustworthy, firm narrators reported from Muhammad bin Ja'far regarding the certainty of affirmation. This is because this narration was uniquely reported from Muhammad by Isa bin Mina, and he is weak. Al-Dhahabi said in \"Al-Mughni\": \"A proof in Recitation (Qira'ah), not in Hadith. Ahmad bin Salih was asked about him? He laughed and said: They write from everyone.\"\nThird: That regarding this Isa, the Hadith has been reported from him with affirmation as the trustworthy narrators reported it. Al-Diya al-Maqdisi narrated it from him in \"Al-Ahadith Al-Mukhtara\"...",
    "foot_note": "1. \"Shadharat al-Dhahab\" \"2/48\" and similarly in \"Al-Mizan\".",
    "book_id": "11097",
    "new_page_number": 28
  },
  {
    "serial_number": "3197584",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 28,
    "volume_number": 1,
    "text": "...(fol. 124/2, No. 2602) via the path of Ibrahim bin al-Husayn, Isa bin Mina told us about it with the wording: \"I said to him: Sunnah? He said: Yes.\" So he was certain about the affirmation and did not doubt. Al-Maqdisi said after it: \"Al-Tirmidhi narrated it from Muhammad bin Ismail from Sa'id bin Abi Maryam from Muhammad bin Ja'far and said: A Hasan Hadith,\" and he affirmed it. This Ibn al-Husayn is Ibn Dizil, and he is trustworthy and trusted as stated by Hafiz Ibn Nasir al-Din al-Dimashqi.\nThis is clear evidence that Isa's narration is like the narration of others in the certainty of affirmation. It appears that Ismail Al-Qadi himself is the one who did not record the narration from Isa well, although he indicated at the same time that it [the affirmation] is the preponderant one according to him by his saying: \"...I do not think but that he said...\" and that is from his precision, may Allah the Exalted have mercy on him.\nFourth: That a group of trustworthy narrators contradicted him in that, all of them...",
    "foot_note": "1. Shadharat \"1/177\".",
    "book_id": "11097",
    "new_page_number": 29
  },
  {
    "serial_number": "3197585",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 29,
    "volume_number": 1,
    "text": "They asserted with certainty in their narration from Muhammad bin Ja'far that Anas said: \"Yes,\" without any doubt. These trustworthy narrators are:\nFirst: Uthman bin Sa'id al-Darimi, who is a trustworthy, firm, Hafiz, and Imam. The wording of his hadith is... from Muhammad bin Ka'b who said: I came to Anas bin Malik in Ramadan while he intended to travel; his riding beast had been prepared, he had worn the clothes of travel, and sunset was approaching. He called for food and ate from it, then rode. I said to him: \"Sunnah?\" He said: \"Yes.\"\nAl-Bayhaqi reported it in his \"Sunan al-Kubra\" (4/247).\nSecond: Ismail bin Ishaq bin Sahl, who is truthful (Saduq) as stated by Ibn Abi Hatim (1/1/158). His wording is exactly like the wording of Al-Darimi's hadith. Al-Daraqutni reported it (p. 241). The Sheikh himself attributed it to him via Al-Iraqi, which is one of his oddities, for he remained silent about it despite it being authentic...",
    "foot_note": "1. Shadharat (1/176).",
    "book_id": "11097",
    "new_page_number": 30
  },
  {
    "serial_number": "3197586",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 30,
    "volume_number": 1,
    "text": "...in chain of narration, and he preferred over it the narration of doubt despite its weakness, denouncement (Nakarah), and unsuitability for opposition even if it were authentic, as preceded.\nThird: Muhammad bin Ismail, who is Imam Al-Bukhari, the author of \"Al-Jami' Al-Sahih\". Al-Tirmidhi reported it from him (1/152), and although he did not quote his wording, he referred it to the wording of Abdullah bin Ja'far which explicitly states the affirmation, by saying after it: \"Similar to it (Nahwahu),\" indicating thereby that it is like it in meaning.\nThis statement from Al-Tirmidhi, even if it does not imply that Al-Bukhari's narration is identical in wording to Abdullah bin Ja'far's hadith as Al-Iraqi said, it does not negate that it is like it in meaning. Rather, it is a text stating their unity in meaning as is explained in the science of \"Mustalah al-Hadith\".",
    "foot_note": "1. See Introduction to the Sciences of Hadith by Ibn al-Salah (p. 199), Aleppo edition.",
    "book_id": "11097",
    "new_page_number": 31
  },
  {
    "serial_number": "3197587",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 31,
    "volume_number": 1,
    "text": "If it is an accepted matter that words are vessels for meanings and that meanings are what is essentially intended, then it does not harm us thereafter whether the words agreed or were unified. For this reason, the majority of scholars agreed on the permissibility of narrating Hadith by meaning, with details mentioned in the appropriate place in this science: \"Al-Mustalah\". They said: \"It is befitting for one who narrates a hadith by meaning to say: 'Or as he said' or 'Something like this'.\"\nSo if Al-Bukhari's narration were like Ibn Mina's narration in meaning [i.e., doubtful], it would not be permissible to say after it \"Similar to it\" [referring to the certain narration], because it is not like it in meaning. This is contrary to the narration of Abdullah bin Ja'far, for it is united in meaning with Al-Bukhari's narration. Therefore, it was permissible for Al-Tirmidhi - who is among the Imams of this science - to say after it \"Similar to it,\" meaning similar to Ibn Ja'far's hadith in wording and like it in meaning.\nIf this becomes clear, then finding relief in the fact that the wording is different is of no avail as long as the meaning is one.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 32
  },
  {
    "serial_number": "3197588",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 32,
    "volume_number": 1,
    "text": "Moreover, Al-Tirmidhi's saying \"Similar to it\" does not negate agreement between the two narrations in some words of the hadith. If it is established that the wording of Muhammad bin Ja'far's hadith is upon affirmation by the narration of the two aforementioned trustworthy narrators, then it is most likely that this is what is intended by this narration of Al-Bukhari, and not the narration of the weak Ibn Mina. For the default in the narrations of trustworthy narrators is agreement, not difference, unless there is evidence, and here it is nonexistent. So it is proven from that that Al-Bukhari's narration is like the narration of the two trustworthy narrators before him, and that is what is intended.\nFourth: Yahya bin Ayyub al-Allaf, and he is truthful (Saduq) as stated by Hafiz Ibn Hajar and others. Al-Tabarani reported his hadith in \"Al-Mu'jam Al-Awsat\" (2/98/1 from the combination of it and Al-Mu'jam Al-Saghir). Although he differed from those before him in part of the hadith, as will be verified, he followed them in narrating the hadith correctly in the rest of it, so there is proof in that...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 33
  },
  {
    "serial_number": "3197589",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 33,
    "volume_number": 1,
    "text": "...for the correctness of the affirmation narration. These four trustworthy narrators have all agreed that the narration of the trustworthy Muhammad bin Ja'far for this hadith is upon affirmation, and that in this regard, it is exactly like the narration of Abdullah bin Ja'far.\nSo if you recall that Isa bin Mina opposed them regarding him in this narration - according to the detail previously explained - and that he is weak, it is not permissible in any way to prefer his narration over theirs, nor to assert that his narration is the wording of Muhammad bin Ja'far's narration as Al-Iraqi did - may Allah forgive him. Rather, the opposite is the truth, as is not hidden from those of intellect.\nThis is because it is established in the science of Hadith that if a trustworthy narrator contradicts in his hadith one who is better in memory or greater in number than him, his hadith is Anomalous (Shadh). And if the contradictor is weak, his hadith is Denounced (Munkar). So if Ibn Mina were trustworthy, his hadith would be Anomalous and rejected, so how about when he is weak? There is no doubt...",
    "foot_note": "1. See \"Tadrib al-Rawi\" (pp. 151-152), printed by Al-Maktabah Al-Ilmiyyah in Medina.",
    "book_id": "11097",
    "new_page_number": 34
  },
  {
    "serial_number": "3197590",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 34,
    "volume_number": 1,
    "text": "...that his hadith is Denounced (Munkar) and rejected. Here we pause to ask: Did the virtuous Sheikh Al-Habashi become aware of the narration of these trustworthy narrators, or was it hidden from him?\n\nThe Answer to the Fourth Matter:\nAs for the fourth matter, which is the disagreement regarding it upon Sa'id bin Abi Maryam, the answer to it can be taken from the previous chapter, but it must be clarified. So I say: None of those who narrated this hadith from Ibn Abi Maryam or anyone else, whether trustworthy or weak, said that the story occurred on the \"Day of Doubt\" (Yawm Yashukkun) which is shortly before Ramadan, except Yahya bin Ayyub al-Allaf mentioned previously, contrary to the narration of the other trustworthy narrators who were mentioned before him. They are Uthman al-Darimi, Ismail bin Ishaq, and Al-Bukhari. All of these said regarding Ibn Abi Maryam: That the story was in Ramadan. Likewise, Isa bin Mina said regarding Muhammad bin Ja'far, and likewise said...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 35
  },
  {
    "serial_number": "3197591",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 35,
    "volume_number": 1,
    "text": "...Al-Darawardi and Abdullah bin Ja'far from Zaid bin Aslam from Muhammad bin al-Munkadir. And likewise said Ibn Mujbar from Ibn al-Munkadir. So the agreement of all of these on that, contrary to the narration of Al-Allaf, is the greatest proof of the weakness of his narration and its anomalous nature (Shudhudh).\nAs for the Sheikh finding relief in Khalid bin Nazar's follow-up of Ibn Abi Maryam, it carries no weight with those who know that, because Khalid himself has weakness regarding his memory, as indicated by the Hafiz's saying about him: \"Truthful, he makes mistakes.\" Furthermore, the narrator from him, Al-Miqdam bin Dawud, is very flimsy (Wahin Jiddan); Al-Nasa'i said: \"He is not trustworthy.\" So would a scholar of Hadith rules, who has an atom of fairness, rely on this follow-up given the condition of its author and the narrator from it, along with its explicit contradiction of what the firm trustworthy narrators reported?\nFrom this, it becomes clear that this disagreement upon Ibn Maryam has no effect on the authenticity of the hadith, and that the breaking of the fast in it was indeed in Ramadan due to...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 36
  },
  {
    "serial_number": "3197592",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 36,
    "volume_number": 1,
    "text": "...travel, not before it due to the Day of Doubt. With that, the last thing the Sheikh clung to in his weakening of the hadith falls, and the authenticity of the hadith with the wording reported by Al-Tirmidhi becomes clear to everyone with two eyes; the one with which the Sheikh began his article.\nOne of the matters that never ceases to amaze is the Sheikh's declaration in his treatise \"Al-Ta'aqub\" (p. 21) that someone like him does not have the function of correcting (Tashih) and weakening (Tad'if) [Hadith], yet you see him in this article declaring the weakening of what scholars have successively corrected from Al-Tirmidhi to Ibn al-Qayyim, with the support of Hadith rules for that.\n\nThe Testimony of the Quran for the Hadith:\nFurthermore, it is known among those occupied with the Sunnah that a hadith which comes through a path containing non-severe weakness is strengthened by its coming through another path or by the existence of a witness for it, even if similar in weakness. So how about if the hadith has a sound chain of narration and has a witness from the Holy Quran...",
    "foot_note": "None\n\nNone",
    "book_id": "11097",
    "new_page_number": 37
  },
  {
    "serial_number": "3197594",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 37,
    "volume_number": 1,
    "text": "...let alone the Purified Sunnah? In such a case, no one with the slightest knowledge of this science would doubt the authenticity of the hadith, even if it had a weak chain. So how about if it has a sound chain of narration in itself? There is no doubt that by that it increases in strength upon strength. Our hadith here is of this type, for it has a sound chain as we have proven by judging it according to the rules of this science, while finding reassurance in the sayings of the scholars previously mentioned who corrected it. And it has a witness from the Holy Quran and the Sunnah.\nAs for the Quran, it is the saying of Allah the Blessed and Exalted: {So whoever among you is ill or on a journey, then an equal number of other days.} [Al-Baqarah: 184]. For His saying {on a journey} includes one who has prepared for travel even if he has not yet left. Imam Al-Qurtubi explicitly stated in his Tafsir \"Al-Jami' li-Ahkam al-Qur'an\", as will come, that this is the implication of the verse. This is clear and undoubted by fair-minded people who are knowledgeable, if Allah the Blessed and Exalted wills.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 38
  },
  {
    "serial_number": "3197595",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 38,
    "volume_number": 1,
    "text": "A Witness for the Hadith from the Sunnah:\nAs for the witness from the Sunnah, it is what Ahmad reported (6/398) via the path of Mansur al-Kalbi from Dihya bin Khalifa (may Allah be pleased with him) that he set out from his village to a place near the village of Aqaba in Ramadan. Then he broke his fast, and people broke their fast with him, while others disliked breaking their fast. He said: When he returned to his village, he said: 'By Allah, I have seen something today I did not think I would see; that a people turned away from the guidance of the Messenger of Allah (peace and blessings of Allah be upon him) and his Companions.' He said that regarding those who fasted. Then he said at that moment: 'O Allah, take me to You.'\nAbu Dawood also reported it (No. 2413).\nI say: The men of its chain are trustworthy and relied upon in the Two Sahihs, except for this Mansur. Al-Ijli said about him in \"Kitab al-Thiqat\": \"Egyptian, Tabi'i, Trustworthy.\" Ibn Hibban also declared him trustworthy and included him in \"Al-Thiqat\" (1/124). However, Ibn al-Madini and others said about him: \"Unknown\" (Majhul). And this is...",
    "foot_note": "1. No. 1375 in my copy of \"Tartib Thiqat al-Ijli\" by Al-Subki.",
    "book_id": "11097",
    "new_page_number": 39
  },
  {
    "serial_number": "3197596",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 39,
    "volume_number": 1,
    "text": "...what is preponderant to me: that he is unknown, which is the meaning of the Hafiz's saying about him: \"Mastur\" (Hidden condition). However, this does not prevent us, nor the Sheikh, from using his hadith as a witness, because that is what is established in \"Al-Mustalah\".\nHere is what Sheikh Al-Habashi himself said on a similar occasion in \"Al-Ta'aqub\" (p. 5): \"So ignorance (Jahalah) is of the category that if its owner follows up another who is like him or above him, his weakness is mended and his hadith becomes acceptable and Hasan.\"\nAccordingly, the hadith is acceptable to the Sheikh, or it necessitates that it be acceptable to him because it came through another path, which is the path of Anas, even if we concede to him that it is weak. So how about when it is authentic according to what has been verified?\nRather, the Sheikh is obliged to declare the chain of the hadith sound in itself if he wishes not to be contradictory in applying the methodology he followed in correcting some hadiths in his referenced treatise. This is because the hadith does not contain anyone whose probity is doubted except Mansur...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 40
  },
  {
    "serial_number": "3197597",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 40,
    "volume_number": 1,
    "text": "...al-Kalbi, and Ibn Hibban declared him trustworthy as mentioned. And Ibn Hibban's authentication is considered valid by the Sheikh. For he declared Khuzaimah and Kinanah, who are unknown, to be trustworthy in his treatise (pp. 19 & 23) based on Ibn Hibban's authentication of them. And he said (pp. 23 & 26) in answer to our declaring them unknown following Hafiz Al-Dhahabi: \"Ignorance of condition and ignorance of person are lifted by the authentication of a Hafiz from the Imams of criticism, and Ibn Hibban has authenticated them.\"\nSince the matter is so with the Sheikh, he is obliged to assert the probity of this Mansur. In that case, the hadith is authentic (Sahih) according to him, with no defect in it. This is a binding necessity from which the Sheikh has no escape, and he cannot dispute it if he is a seeker of truth and fair-minded, as I hope.\nFurthermore, the indication of the hadith for what Anas's hadith indicated regarding the permissibility of the disputed breaking of the fast is clear as day. For his saying: \"Then he broke his fast, and people broke their fast with him\" is explicit or like explicit that they left the village fasting and then broke the fast. So what the Sheikh raised against...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 41
  },
  {
    "serial_number": "3197598",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 41,
    "volume_number": 1,
    "text": "...the hadith of Abu Basrah regarding its lack of indication for the desired point, according to his claim, does not apply to it. Perhaps for this reason, the Sheikh turned away from mentioning it and did not address it with an answer at all, because it is a proof against him. This is something we would like to declare the Sheikh above doing, but the matter requires assistance from him. The hadith of Abu Basrah referred to is in reality a second witness for the hadith, and the answer to the Sheikh's words regarding it will come shortly, if Allah the Exalted wills.\n\nAuthentic Traditions (Athar) Witnessing for the Hadith:\nMoreover, what increases the hadith in strength is that action according to what is in it - and contrary to what the prohibiters of breaking fast after leaving hold - has been reported from a group of Companions and others. I mention the narrations I came across from them to complete the benefit:\n1 - From Al-Lajlaj, they said [So in the original, perhaps: Al-Lajlaj and others said]: We used to travel with Umar (may Allah be pleased with him) for three miles; he would be lenient in prayer and would break the fast. Reported by Ibn Abi Shaybah in \"Al-Musannaf\"...",
    "foot_note": "None\n\nNone",
    "book_id": "11097",
    "new_page_number": 42
  },
  {
    "serial_number": "3197600",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 42,
    "volume_number": 1,
    "text": "...(2/151/2) with a Hasan chain or close to it.\n2 - From Anas bin Malik who said: Abu Musa said to me: Have I not been informed that when you leave, you leave fasting, and when you enter, you enter fasting? If you leave, leave breaking the fast. And if you enter, enter breaking the fast. Reported by Al-Daraqutni (p. 241) and Al-Bayhaqi (4/247) with a Sahih chain meeting the conditions of the Six [Books].\n3 - From Nafi' from Ibn Umar that he left in Ramadan and broke the fast. Reported by Ibn Abi Shaybah (2/151/1) with a chain whose men are trustworthy.\n4 - From Ibn Abbas who said: If he wishes he fasts, and if he wishes he breaks the fast. Reported by Ibn Abi Shaybah in \"Chapter: What they said regarding a man whom Ramadan overtakes so he fasts then travels\" (2/151/1), and its chain is Sahih.\n5 - From Mughirah who said: Abu Maysarah set out in Ramadan as a traveler...",
    "foot_note": "1. His name is Amr bin Shurahbil al-Hamdani. Al-Hafiz said: \"Trustworthy, worshipper, Mukhadram (lived in Jahiliyyah and Islam), died in year 63.\"",
    "book_id": "11097",
    "new_page_number": 43
  },
  {
    "serial_number": "3197601",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 43,
    "volume_number": 1,
    "text": "...He passed by the Euphrates while fasting, took a sip from it, drank, and broke his fast. Reported by Ibn Abi Shaybah (2/151/1) with a Sahih chain. He then reported it (2/151/2) and Al-Bayhaqi (4/247) with another chain from him in abbreviated form, and it is also Sahih.\n6 & 7 - From Sa'id bin al-Musayyib and Al-Hasan al-Basri, they said: He breaks the fast if he wishes. Reported by Ibn Abi Shaybah following the previous tradition, and his chain is Sahih. In a narration from Al-Hasan al-Basri: \"He breaks the fast if he wishes in his house on the day he intends to leave.\" Al-Qurtubi mentioned it in his Tafsir (2/279).\nIn conclusion, a hadith like this, witnessed to by the Quran, the Sunnah, and authentic traditions from the Salaf - among them some of the Rightly Guided Caliphs -...",
    "foot_note": "1. So where are those who resented our call to revive the authentic Sunnah in the Rak'ahs of Tarawih and attributed to us - falsely and slanderously - attacking the Rightly Guided Caliph Umar bin al-Khattab (may Allah be pleased with him) because of our disagreement with what is narrated from him regarding...",
    "book_id": "11097",
    "new_page_number": 44
  },
  {
    "serial_number": "3197602",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 44,
    "volume_number": 1,
    "text": "...is worthy not to be a subject of controversy and hesitation regarding its authenticity, no matter what is said about its chain or text, were it not that some people show partisanship to their schools of thought in a way they do not show for the established Law from their Prophet, following what they are accustomed to. O Allah, Your mercy and guidance.\n\n2 - The Fiqh (Jurisprudence) of the Hadith and who held it.\nIf it is clarified that the hadith is authentic with the wording of affirmation, then it is a clear proof for what Imam Ishaq bin Rahwaih held, as related by...",
    "foot_note": "1. ...the twenty Rak'ahs, even though it is not established from him; rather, what is correct from him agrees with what we call to from the Sunnah, as we explained in detail in our refutation of them in \"Salat al-Tarawih\". I say: Where are these people regarding their consensus on opposing Umar bin al-Khattab and those with him from the noble Companions and great Salaf in this issue, especially when the authentic Sunnah is with them? So praise be to Allah who guided us to follow the Sunnah here and there, and we ask Him for more of His grace and success. We also ask Him to guide the opponents to it, to make us live and die upon it, and to gather us under the banner of its owner (peace and blessings be upon him): {The Day when there will not benefit [anyone] wealth or children, But only one who comes to Allah with a sound heart.}",
    "book_id": "11097",
    "new_page_number": 45
  },
  {
    "serial_number": "3197603",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 45,
    "volume_number": 1,
    "text": "...Al-Tirmidhi from him. The Sheikh also quoted it from him. In the book \"Al-Masa'il\" by Ishaq bin Mansur al-Marwazi (fol. 29/1-2) is the following text: \"I said [meaning to Imam Ahmad]: If one leaves as a traveler, when does he break the fast? He said: When he emerges past the houses. Ishaq [meaning Ibn Rahwaih] said: Rather, when he puts his foot [in the stirrup/outside], he has the right to break the fast, as Anas bin Malik did, and the Prophet (peace and blessings of Allah be upon him) established it as Sunnah. And if he passes the houses, he shortens [the prayer].\"\n\nIbn al-Arabi's Following of the Hadith Contrary to the Madhhab:\nImam Ibn al-Arabi (may Allah have mercy on him) was fair, for he went towards acting upon the hadith in this issue, contrary to many scholars of...",
    "foot_note": "1. Among the wonders is Ibn al-Arabi's saying - as will come -: \"That no one held it except Ahmad\", even though that appeared in the book of Al-Tirmidhi which Ibn al-Arabi himself explained. So glory be to the One who does not overlook.\n2. This supports what I had preferred, that this hadith of Anas should be authentic according to those who held it, like Ahmad and Ishaq. I had preferred that before coming across this text. So praise be to Allah for His success.",
    "book_id": "11097",
    "new_page_number": 46
  },
  {
    "serial_number": "3197604",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 46,
    "volume_number": 1,
    "text": "...the Malikis. Al-Qurtubi and others followed him in that, and Hafiz Ibn Abd al-Barr preceded them in declaring that openly. Ibn al-Arabi said in \"Aridat al-Ahwadhi\" (4/13-16) commenting on the hadith: \"This is authentic (Sahih). No one held it except Ahmad bin Hanbal. As for our scholars [meaning the Malikis], they prevented it. But they differed: if he ate, does he owe expiation (Kaffarah) or not? Malik said in 'Kitab Ibn Habib': 'No expiation is upon him.' Ashhab said: 'Yes, because he is interpreting [erroneously].' Others said: He owes expiation. But it should be that he does not owe expiation due to the authenticity of the hadith... and it implies the permissibility of breaking the fast with the preparation for travel.\"\nAl-Qurtubi said in his Tafsir \"Al-Jami' li-Ahkam al-Qur'an\" (2/278-279) after recounting the difference Ibn al-Arabi mentioned: \"I say: Ashhab's saying negating the expiation is good, because he did what was permissible for him to do, and the liability is free [of obligation] so nothing is established in it except with certainty, and there is no certainty with disagreement. Furthermore, it is the implication of His saying, Exalted is He: {or on...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 47
  },
  {
    "serial_number": "3197605",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 47,
    "volume_number": 1,
    "text": "...a journey}. Abu Umar [he is Ibn Abd al-Barr] said: This is the most correct of their sayings in this issue. Even if eating with the intention of travel obligated expiation upon him because it was before his departure, his departure dropped it from him. So contemplate that, you will find it so, if Allah the Exalted wills.\"\nThen Ibn Abd al-Barr mentioned those who said he should not break the fast and that he owes expiation if he breaks it, then he said: \"This is nothing, because Allah, Glory be to Him, has permitted breaking the fast in the Book and the Sunnah. As for their saying: 'He does not break the fast', that is only a recommendation to complete what he started. If he takes Allah's license, he owes makeup (Qada), but as for expiation, there is no basis for it. Whoever obligates it has obligated what neither Allah nor His Messenger (peace and blessings of Allah be upon him) obligated.\"\nThis is what the erudite scholar Al-San'ani considered apparent in \"Subul al-Salam\" (2/629). It is what we assert decisively due to this authentic hadith, for it is a text in the...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 48
  },
  {
    "serial_number": "3197606",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 48,
    "volume_number": 1,
    "text": "...issue that does not accept interpretation, supported by the apparent meaning of the Quran and the authentic traditions from the Salaf (may Allah be pleased with them).\nFrom what preceded, it is known that the saying prohibiting breaking the fast and obligating expiation on the one who breaks it is something for which there is no evidence in the Law. So whoever sets himself up to refute us and tries to weaken the authentic hadith in support of his school of thought must bring evidence with which he convinces himself before others of the correctness of what he holds. Otherwise, he is, according to us and as we have explained, opposing the apparent meaning of the Quran and the texts of the authentic traditions, and that is sufficient to prove his error even if the hadith were weak according to him. Let the fair-minded of various schools of thought contemplate this; the correctness of what we mentioned will become clear to them, if Allah the Exalted wills, and He is the Guardian of success.\nIt is good to draw attention to the fact that the good stance Ibn al-Arabi and those with him took regarding the hadith is what every Muslim must take regarding this hadith specifically and other...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 49
  },
  {
    "serial_number": "3197607",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 49,
    "volume_number": 1,
    "text": "...Hadiths in general, even if it is contrary to the opinion of fathers and Sheikhs. Because it is the only stance that agrees with true faith, as He the Exalted said: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [Al-Nisa: 65]. No wonder the Imams ordered their followers to do that and insisted upon them with many famous phrases, and I mentioned many of them in the introduction to my book \"The Description of the Prophet's Prayer (peace and blessings of Allah be upon him)\". So whoever wishes may refer to it.\n\n3 - The Hadith of Abu Basrah al-Ghifari.\nWhatever remains for us is to discuss the hadith of Abu Basrah al-Ghifari. The Sheikh mentioned that Abu Dawood's silence on it is not sufficient, according to the reliable view, for the authenticity of the hadith.\nOur answer to that is from several aspects:\nFirst: That what he mentioned is correct regarding the critical scholar who knows the ways of disparagement and validation (Jarh wa Ta'dil) and correction and weakening. For such a person...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 50
  },
  {
    "serial_number": "3197608",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 50,
    "volume_number": 1,
    "text": "...Abu Dawood's silence on the hadith does not convince him, because he knows for certain that he remained silent on innumerable hadiths that are clearly weak, as scholars like Al-Nawawi, Al-Asqalani, and others have established. We explained that with many examples in our critique of the book \"Al-Taj Al-Jami' lil-Usul Al-Khamsah\". So his knowledge obliges him to refer to the chain and judge it by the rules of this science, either correcting or weakening.\nAs for the blind follower (Muqallid) who \"does not have the function of correcting and weakening\" like the virtuous Sheikh by his own admission as previously quoted from him, he must regard Abu Dawood's silence on the hadith until he comes across the saying of another scholar more trustworthy than him [Abu Dawood] to him regarding the weakness of the hadith. As for himself, he is not permitted to proceed to weaken it intuitively, because he has no knowledge of that. This is something clear that I do not think...",
    "foot_note": "1. We began publishing a useful summary of it in consecutive articles in \"Al-Muslimun\" magazine, and the first article of it has been issued.",
    "book_id": "11097",
    "new_page_number": 51
  },
  {
    "serial_number": "3197609",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 51,
    "volume_number": 1,
    "text": "...any sane, fair person would dispute. So why then is the Sheikh not satisfied with Abu Dawood's silence, which indicates that the hadith is valid (Salih) according to him? Rather, he strives - even though he believes it is forbidden for him - to go and weaken the hadith, as indicated by his saying: \"If it were authentic...\" without any scientific argument or proof, not even by imitating an Imam?\nSecond: I believe that what befits the Sheikh's method, which we knew from him in \"Al-Ta'aqub Al-Hathith\", is to move towards declaring this hadith authentic, not weakening it. This is because the men of its chain in Abu Dawood (No. 2413) and Ahmad (6/398) are all trustworthy and relied upon in the Two Sahihs, except Kulayb bin Dhuhl. Ibn Hibban declared him trustworthy (2/253), and the Hafiz said in his biography in \"Al-Taqrib\": \"Acceptable\" (Maqbul). As for Ubayd bin Jabr, the Hafiz inclined to the view that he has Companionship (Suhbah). Ya'qub bin Sufyan mentioned him in \"Al-Thiqat\". Al-Ijli said (No...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 52
  },
  {
    "serial_number": "3197610",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 52,
    "volume_number": 1,
    "text": "...884): \"Egyptian, Tabi'i, Trustworthy.\" Ibn Hibban also mentioned him in \"Al-Thiqat\" (1/140), except that he said: \"He is the client of Al-Hakam bin Abi al-Aas,\" so I do not know if it is this one or another. We are accustomed to the Sheikh regarding Ibn Hibban's authentication of unknown narrators as valid, as previously explained from his words. So why then does the Sheikh weaken this hadith and not correct it, even though it is authentic according to his condition?\nI do not want to say: He uses two measures, and his methodology in correcting and weakening is not according to what is established in \"Mustalah al-Hadith\", even though he declares that he is not of its people as previously quoted from him. But perhaps when the hadith contradicts his school of thought, he is not energetic in verifying the saying regarding it according to the requirement of the science of Hadith - to the extent of his knowledge of it - fearing that its authenticity might become clear to him. So he suffices in weakening it with anything he stumbles upon, even if it is...",
    "foot_note": "1. Al-Shawkani said in \"Nayl al-Awtar\": \"Abu Dawood, Al-Mundhiri, and Ibn Hajar in 'Al-Talkhis' remained silent about it, and the men of its chain are trustworthy.\"",
    "book_id": "11097",
    "new_page_number": 53
  },
  {
    "serial_number": "3197611",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 53,
    "volume_number": 1,
    "text": "...like the threads of the moon [flimsy]. And if the hadith agrees with his school of thought, he is also not energetic in looking into it, fearing that its weakness might become clear to him, and he is content in correcting it with any saying he finds, even if contrary to scientific rules.\nIn summary: This hadith is authentic according to the Sheikh's method. As for us, it suffices us that it is a second witness for the hadith of Anas, even if its chain has what the first witness has. So the Sheikh's weakening of it is a clear error on all possibilities, as is not hidden, because its lowest state is that it is Hasan due to others (Hasan li-Ghayrihi).\n\n4 - The Indication of the Hadith for what Anas's Hadith indicated.\nAs for the Sheikh's saying: \"If the Hadith were authentic, there is no proof in it, because it does not state that he left after the morning (Subh) then rode then ate. It is possible that he left his house before dawn.\" I say: The mentioned possibility is invalid for several reasons:\nFirst: It is contrary to what immediately comes to mind from the hadith.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 54
  },
  {
    "serial_number": "3197612",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 54,
    "volume_number": 1,
    "text": "Second: It is contrary to what the scholars who extracted it understood from it. Here is Abu Dawood titling it saying: \"Chapter: When does the traveler break fast if he leaves?\" He indicates by that that Abu Basrah left fasting then broke the fast. Also, Al-Majd Ibn Taymiyyah titled it saying: \"Whoever travels during the day, does he break fast in it? And when does he break fast?\" Similar to it and more explicit is the saying of Al-Bayhaqi coming shortly, if Allah the Exalted wills.\nThird: If Abu Basrah had left before dawn - as the Sheikh claimed - it would mean that he traveled before fasting became obligatory upon him due to the absence of its condition, which is residency (Iqamah). It is known that for such a person, eating after dawn is permissible by the text of the Quran and the agreement of Muslims; indeed, some obligated it upon him. Since the matter is so, is it conceivable that Ubayd bin Jabr would object to him saying: \"Do you not see the houses?\" There is no doubt that this statement from him is proof that Abu Basrah left fasting and that he ate after dawn and broke the fast. So Ubayd (may Allah have mercy on him) wanted to draw his attention to what he thought was a preventative to...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 55
  },
  {
    "serial_number": "3197613",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 55,
    "volume_number": 1,
    "text": "...breaking the fast, which is being still under the ruling of a resident because he had not passed the houses. So Abu Basrah (may Allah be pleased with him) informed him that passing [the houses] is not a condition and that clinging to it is contrary to the Sunnah.\nThis is the meaning that can be understood from the hadith if we strip ourselves of desire and blind imitation, and it is what the scholars understood as I mentioned in the first point.\nAlso witnessing to this is Al-Bayhaqi's titling of the hadith with his saying: \"Chapter: Whoever says he breaks the fast even if he leaves after the break of dawn.\" This is a decisive text on the invalidity of the meaning the Sheikh interpreted the hadith with. It indicates that the Sheikh strives in understanding Hadiths - contrary to what he pretends - and it is as if he - may Allah inspire us all with correctness - strives to demolish them and invalidate their meanings so they do not conflict with his school of thought. The Madhhab is the original source for him and the Hadith is subordinate to it. This is contrary to what a Muslim should be upon, as previously noted (p. 37), and contrary to what fair-minded scholars followed, even those known for their following...",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 56
  },
  {
    "serial_number": "3197614",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 56,
    "volume_number": 1,
    "text": "...of one of the four schools. The closest witness we have to that is Imam Al-Bayhaqi (may Allah have mercy on him). For despite his following of the Shafi'i Madhhab and supporting it in most of its issues, he explained the hadith with his saying that I mentioned previously, contrary to what Imam Al-Shafi'i (may Allah the Exalted have mercy on him) held. He did not carry it upon a meaning it does not bear and which Arabic taste and sound understanding do not support, as others did while also belonging to the Shafi'i Madhhab.\nFourth: Ubayd bin Jabr's saying: \"Then he brought his morning meal (Ghada') near.\" In it is an indication that the leaving and eating were in the early morning (Ghadwah), which is between the Fajr prayer and sunrise, as the Sheikh himself quoted from Al-Qamus. If this is established, I do not know what supports the interpretation the Sheikh went to regarding the meaning of the hadith by this statement of Ubayd? Because Abu Basrah's eating, whether it was in the beginning of the day - which is after dawn - or was after sunrise, does not support in any way the Sheikh's saying that the leaving was before dawn.",
    "foot_note": "None",
    "book_id": "11097",
    "new_page_number": 57
  },
  {
    "serial_number": "3197615",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 57,
    "volume_number": 1,
    "text": "If a sane person contemplates these four aspects, it will become clear to him without any doubt that the hadith is a radiant proof for the permissibility of the disputed breaking of the fast, and that in this regard it is like the hadith of Anas (may Allah be pleased with him). The investigator Al-Shawkani explicitly stated this in \"Nayl al-Awtar\" (4/195).\n\nSummary:\nThe summary of the speech is that the Sheikh erred in his refutation in several matters:\n1 - His weakening of the hadith of Anas, which is authentic as required by the rules of the science of Hadith.\n2 - His turning away from imitating those who authenticated it, even though they are more numerous than those who weakened it. This is contrary to what is assumed of blind followers (Muqallidin) and their logic, which usually argues by majority and the great mass.\n3 - His weakening of the hadith of Abu Basrah, which is authentic according to the requirement of his methodology.\n4 - His turning away from using it as evidence even though it is valid for that according to him.\n5 - His concealing of the hadith of Dihya even though it is also authentic according to his methodology.",
    "foot_note": "None\n\nNone",
    "book_id": "11097",
    "new_page_number": 58
  },
  {
    "serial_number": "3197617",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Correction of the Hadith about the Fasting Person Breaking Fast Before Travel After Dawn",
    "edition": "The only legitimate edition 1421 AH - 2001 CE",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 58,
    "volume_number": 1,
    "text": "That is only because it is explicit in indication contrary to his school of thought.\n6 - His heedlessness of the Quran's support for the three hadiths.\n7 - His heedlessness also of the traditions (Athar) supporting them, some of which are from Umar Al-Faruq (may Allah be pleased with him).\n\nConclusion:\nTherefore, I conclude this word by requesting the virtuous Sheikh Al-Habashi to reconsider his stance on this hadith and the ruling it contained, to which the Holy Quran bore witness. Reminding him of His saying, Exalted is He, regarding it: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [Al-Nisa: 65]. {O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.} [Al-Anfal: 24].",
    "foot_note": "None\n\nNone",
    "book_id": "11097",
    "new_page_number": 59
  }
]