[
  {
    "text": "Az-Zuhd (Asceticism)\nAuthor: أبو سعيد أسد بن موسى بن إبراهيم بن الوليد بن عبد الملك بن مروان الأموي القرشي الملقب بأسد السنة\nYear: 212",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Az-Zuhd (Asceticism)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5240\nbook_title: الزهد\nbook_link: https://shamela.ws/book/263\nbook_id: 263\nauthor_name: أبو سعيد أسد بن موسى بن إبراهيم بن الوليد بن عبد الملك بن مروان الأموي القرشي الملقب بأسد السنة\nauthor_year: 212\nnickname: أبو سعيد\nauthor_link: https://shamela.ws/author/303\nauthor_ID: 303\neditor: أبو اسحق الحويني الأثري\npublisher: مكتبة التوعية الإسلامية لإحياء التراث الإسلامي، مكتبة الوعي الإسلامي\nedition: الأولى، 1413 هـ - 1993 م\npages: 80\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Az-Zuhd (Asceticism)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4952482",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquettes, and Adhkar\nBook: Az-Zuhd (Asceticism)\nAuthor: Abu Sa'id Asad bin Musa bin Ibrahim bin Al-Walid bin Abd al-Malik bin Marwan Al-Umawi Al-Qurashi, nicknamed Asad al-Sunnah (Lion of the Sunnah) (d. 212 AH)\nInvestigator: Abu Ishaq Al-Huweini Al-Athari\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nBook: Az-Zuhd\nAuthor: Abu Sa'id Asad bin Musa... (d. 212 AH)\nInvestigator: Abu Ishaq Al-Huweini Al-Athari\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nAuthor: Abu Sa'id Asad bin Musa... (d. 212 AH)\nInvestigator: Abu Ishaq Al-Huweini Al-Athari\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nInvestigator: Abu Ishaq Al-Huweini Al-Athari\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\n[Book pagination matches the printed version]\nShamela Publication Date: 8 Dhu al-Hijjah 1431\n\nShamela Publication Date: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 3
  },
  {
    "serial_number": "4952483",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 13,
    "volume_number": 1,
    "text": "The Sheikh, the Imam, the Scholar, the Hafiz, Shams al-Din Abu Abdullah Muhammad bin Abd al-Mun'im bin Ammar bin Hamil Al-Harrani told us via reading upon him, he said: Our Sheikh, the Imam, the Scholar, the Hafiz, Diya' al-Din Abu Abdullah Muhammad bin Abd al-Wahid bin Ahmed Al-Maqdisi informed us, via my reading upon him at Mount Salihie, and that was on Thursday, the eleventh of Shawwal, year 635. He said: Abu al-Qasim Abd al-Wahid bin al-Qasim bin al-Fadl informed us, and that was on the second of Shawwal, year 578. He said: Abu Nahshal Abd al-Samad bin Ahmed bin al-Fadl Al-Anbari informed us. Our Sheikh Diya' al-Din Muhammad said: And Abu Ja'far Muhammad bin Ahmed bin Nasr bin Abi al-Fath informed [us] in the aforementioned year. He said: Abu al-Khayr Abd al-Karim bin Ali bin Fawrajah informed us. And our Sheikh, the Imam Abu Tahir Isma'il bin Zafar bin Ahmed Al-Nabulsi informed us via my reading upon him in Damascus in the year 637. He said: Abu al-Qasim bin Abi al-Mutahhar al-Qasim bin al-Fadl bin Abd al-Wahid Al-Saydalani informed us. He said: Abu Nahshal informed us. And our Sheikh, the Imam, the Hafiz Shams al-Din Yusuf bin Khalil bin Abdullah Al-Dimashqi informed us via my reading upon him in Aleppo on the eighth of Dhu al-Qi'dah in the year 638. He said: The Sheikhs Abu al-Qasim Abd al-Wahid bin Abi al-Mutahhar al-Qasim bin al-Fadl, and Sheikh Zayn al-Din Abu al-Ma'ali Mas'ud bin Abi al-Fada'il Mahmud bin Khalaf Al-Ijli, and the Sheikh",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 4
  },
  {
    "serial_number": "4952484",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 14,
    "volume_number": 1,
    "text": "Abu al-Khayr Mas'ud bin Abi al-Mansur bin Muhammad bin al-Hasan Al-Khayyat informed us, all three of them said: Ibn Fawrajah and Abu Nahshal informed us; Abu al-Husayn Ahmed bin Muhammad bin Ahmed bin al-Husayn bin Fashadhah informed us; Abu al-Qasim Sulayman bin Ahmed bin Ayyub Al-Tabarani told us; He said: Abu Yazid Yusuf bin Yazid Al-Qaratisi informed us; He said: Asad bin Musa informed us; He said: \n1 - Marwan bin Mu'awiyah told us, Isma'il bin Sumay' told us, from Abu Razin, from Ibn Abbas, regarding His saying (Blessed and Exalted is He): {So let them laugh a little and [then] weep much} [At-Tawbah: 82], he said: \"The world is little, so let them laugh in it as they wish. For when it is cut off and they return to Allah Almighty, they will begin a weeping that will never cease from them.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 5
  },
  {
    "serial_number": "4952485",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 15,
    "volume_number": 1,
    "text": "2 - Muhammad bin Yusuf told us, from Anas bin Abi al-Qasim, from Ibn Ka'b bin Malik, from his father, who attributed it to the Prophet (peace be upon him) as far as I reckon - regarding His saying Almighty: {It is all the same for us whether we show intolerance or are patient: there is no place of escape for us} [Ibrahim: 21], he said: \"The people of the Fire will say: 'Come, let us be patient.' He said: So they will be patient for five hundred years. When they see that it does not benefit them, they will say: 'Come, let us show intolerance (panic).' He said: So they will weep for five hundred years. When they see that it does not benefit them, they will say: {It is all the same for us whether we show intolerance or are patient: there is no place of escape for us} [Ibrahim: 21].\"\n\n3 - Muhammad bin Muslim Al-Ta'ifi told us, Amr bin Dinar informed us, he said: It reached me that when the people of the Fire call out: {O Malik, let your Lord put an end to us!} [Az-Zukhruf: 77], he remained silent from them for a thousand years, then said: {Indeed, you will remain} [Az-Zukhruf: 77].",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 6
  },
  {
    "serial_number": "4952487",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 16,
    "volume_number": 1,
    "text": "4 - Muhammad bin Yusuf told us, from Sufyan, from Ata bin Al-Sa'ib, from Abu Al-Hasan, from Ibn Abbas, regarding His saying (Blessed and Exalted is He): {And they will call, 'O Malik, let your Lord put an end to us!'} [Az-Zukhruf: 77], he said: \"He remained silent from them for a thousand years, then said: {Indeed, you will remain} [Az-Zukhruf: 77].\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 7
  },
  {
    "serial_number": "4952488",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 17,
    "volume_number": 1,
    "text": "Chapter on the Mention of the People of Hell with the Lightest Punishment\n\n5 - Israil told us, from Abu Ishaq, from An-Nu'man bin Bashir, he said: I heard the Messenger of Allah (peace be upon him) say: \"Indeed, the person among the people of the Fire with the lightest punishment on the Day of Resurrection is a man who has two embers in the hollow of his feet, from which his brain boils just as a cauldron or flask boils.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 8
  },
  {
    "serial_number": "4952490",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 19,
    "volume_number": 1,
    "text": "6 - Hammad bin Salamah told us, from Thabit, from Abu Uthman Al-Nahdi, that the Messenger of Allah (peace be upon him) said: \"Indeed, the person among the people of the Fire with the lightest punishment on the Day of Resurrection is Abu Talib; he has two sandals of fire from which his brain boils.\"\n\n7 - Abu Al-Ahwas told us, from Abu Ishaq, from Amr bin Maimun, he said: Abdullah [Ibn Mas'ud] said: \"Indeed, among the people of the Fire with the lightest punishment is a man who has two sandals and two straps of fire, from which his brain boils just as a flask or cauldron boils. He does not see that anyone among the people of the Fire has a more severe punishment than him, while there is no one among the people of the Fire with a lighter punishment than him.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 9
  },
  {
    "serial_number": "4952492",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 20,
    "volume_number": 1,
    "text": "8 - Muhammad bin Khazim told us, from Al-A'mash, from Mujahid, from Ubaid bin Umayr, he said: The Messenger of Allah (peace be upon him) said: \"Indeed, the person with the lowest rank in Paradise is a man who has a house made of a single pearl, including its rooms and doors. And indeed, the person among the people of the Fire with the lightest punishment is a man wearing two sandals of fire from which his brain boils just as a cauldron boils. His ears are embers, his molars are embers, his eyelids are flames of fire, and his intestines come out from his sides and feet. The rest of them [the people of Hell] are like a few grains in much water, boiling.\"\n\n9 - Rawh told us, from Hammad, he said: \"It was mentioned to me that for the people of the Fire, fire enters through their mouths and eyes and exits through their posteriors, and it enters through their posteriors and exits through their mouths and eyes.\"\n\n10 - Al-Mubarak bin Fadalah told us, from Al-Hasan, regarding His saying (Blessed and Exalted is He): {In which they will remain for ages [huqub]} [An-Naba: 23], he said: \"It has no deadline. Every time eras pass, they enter into others.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 10
  },
  {
    "serial_number": "4952495",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 22,
    "volume_number": 1,
    "text": "Chapter on the Mention of the Valleys and Mountains of Hell\n\n11 - Israil told us, from Abu Ishaq, from Abu Ubaidah, from Abdullah [Ibn Mas'ud], regarding His saying: {So they will encounter Ghayy} [Maryam: 59], he said: \"A valley in Hell.\"\n\n12 - Qays bin Al-Rabi' told us, from Abu Ishaq, from Abu Ubaidah, from Abdullah: {So they will encounter Ghayy} [Maryam: 59], he said: \"A river in Hell.\"\n\n13 - Marwan bin Mu'awiyah told us, from Al-Ala' bin Al-Musayyib, from Abu Ubaidah, from Abdullah, he said: \"It is a river in the Fire called: Ghayy.\"\n\n14 - Abu Al-Ahwas told us, from Abu Ishaq, from Abu Ubaidah, from his father, he said: \"Al-Ghayy is a river in Hell into which those who followed lusts are cast.\"",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 11
  },
  {
    "serial_number": "4952500",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 23,
    "volume_number": 1,
    "text": "15 - Ibn Lahi'ah told us, Darraj told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Messenger of Allah (peace be upon him), that he said: \"'Wayl' (Woe): A valley in Hell, into which the disbeliever falls for forty autumns before reaching its bottom. And 'Al-Sa'ud': A mountain of fire which he climbs for seventy autumns, then falls down from it, like that forever.\"\n\n16 - Qays bin Al-Rabi' told us, from Al-A'mash, from Ziyad, from Abu Iyad, from Ibn Abbas, he said: \"'Wayl': A valley in Hell known only to Allah Almighty.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 12
  },
  {
    "serial_number": "4952502",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 24,
    "volume_number": 1,
    "text": "17 - Marwan bin Mu'awiyah told us, Al-Ala' bin Al-Musayyib told us, from his father, he said: \"It is a valley in the Fire called: Wayl.\"\n\n18 - Sufyan bin Uyainah told us, from Ammar Al-Duhni, from Atiyyah - meaning Ibn Sa'd Al-Awfi, from Abu Sa'id Al-Khudri, regarding His saying (Blessed and Exalted is He): {I will impose upon him an arduous ascent (Sa'ud)} [Al-Muddaththir: 17], he said: \"It is a rock in Hell. If they place their hands on it, they melt, and if they lift them, they return.\"\n\n19 - Uthman bin Miqsam told us, from Al-Kalbi, he said: \"A solid rock in Hell into which one falls for seventy autumns.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 13
  },
  {
    "serial_number": "4952505",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 25,
    "volume_number": 1,
    "text": "20 - Qays told us, from Ibrahim bin Al-Muhajir, from Atiyyah bin Sa'd, from Sa'id bin Al-Musayyib, he said: \"A mountain in Hell which they are tasked to climb. Whenever they place their hands on it, they melt, and when they lift them, they return.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 14
  },
  {
    "serial_number": "4952506",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 26,
    "volume_number": 1,
    "text": "Chapter on the Mention of the Snakes and Scorpions of the Fire\n\n21 - Hammad bin Salamah told us, from Ali bin Zayd, from Ammar bin Abi Ammar, from Abu Hurairah (may Allah be pleased with him), he said: \"Between the skin of the disbeliever and his flesh are worms running like wild donkeys. Its snakes are like the necks of Bactrian camels, and its scorpions are like dark mules.\"\n\n22 - Ibn Lahi'ah, Darraj told us, that it reached him that Abdullah bin Jaz' Al-Zubaidi, the Companion of the Prophet (peace be upon him), says: The Messenger of Allah (peace be upon him) said: \"Indeed, there are snakes in the Fire like the necks of Bactrian camels. One of them strikes a sting, and he feels its heat for forty autumns. And indeed, there are scorpions in it like saddled mules. One of them strikes a sting, and he feels its heat for forty autumns.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 15
  },
  {
    "serial_number": "4952509",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 27,
    "volume_number": 1,
    "text": "23 - Waki' told us, from Al-A'mash, he said: I heard a Sheikh in the mosque narrating from Amr bin Maimun, he said: \"The noise of the worms between the skin of the disbeliever and his flesh can be heard like the noise of wild beasts.\"\n\n24 - Bakr bin Khunays told us, from Yazid Al-Shami, from Thawr bin Yazid, that the Prophet (peace be upon him) came out to them one day with his color changed, then he said: \"Indeed, there is a valley in Hell, and Hell seeks refuge from the evil of that valley seven times every day. And indeed, in that valley is a pit; Hell and that valley seek refuge from that pit. And indeed, in that pit is a snake; Hell, the valley, and that pit seek refuge in Allah (Mighty and Majestic) from that snake seven times. Allah prepared it for the wretched among the bearers of the Quran who disobey Allah regarding it.\"\n\n25 - Isma'il bin Ayyash told us, from Al-Rabi', from Al-Bara' bin Azib, that the Prophet (peace be upon him) [p. 28] was asked about the saying of Allah (Blessed and Exalted is He): {We will increase them in punishment over [their] punishment} [An-Nahl: 88], he said: \"Scorpions like tall palm trees that bite them in Hell.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 16
  },
  {
    "serial_number": "4952512",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 28,
    "volume_number": 1,
    "text": "26 - Yahya bin Isa told us, from Al-A'mash, from Abdullah bin Murrah, from Masruq, from Abdullah bin Mas'ud, regarding the saying of Allah (Blessed and Exalted is He): {We will increase them in punishment over [their] punishment} [An-Nahl: 88], he said: \"Scorpions whose fangs are like tall palm trees.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 17
  },
  {
    "serial_number": "4952513",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 29,
    "volume_number": 1,
    "text": "Chapter on the Mention of the Drink of the People of Hell\n\n27 - Ibn Lahi'ah told us, Darraj Abu Al-Samh told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Messenger of Allah (peace be upon him), regarding His saying (Blessed and Exalted is He): {Like murky oil (Al-Muhl)} [Al-Kahf: 29], he said: \"Like the sediment of oil. When he brings it near him, the skin of his face falls into it.\"\n\n28 - Asbat bin Muhammad told us, from Mutarrif, from Atiyyah Al-Awfi, he said: Ibn Abbas was asked about His saying Almighty: {Like murky oil (Al-Muhl)} [Al-Kahf: 29], he said: \"Thick water like the dregs of oil.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 18
  },
  {
    "serial_number": "4952516",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 30,
    "volume_number": 1,
    "text": "29 - Marwan bin Mu'awiyah told us, Juwaybir told us, from Al-Dahhak, {With water like murky oil, which scalds the faces} [Al-Kahf: 29], he said: \"Black water.\"\n\n30 - Ibn Lahi'ah told us, from Darraj, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Prophet (peace be upon him), he said: \"If a bucket of Ghassaq (foul fluid from Hell) were spilled in the world, the people of the world would stink [from it].\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 19
  },
  {
    "serial_number": "4952518",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 31,
    "volume_number": 1,
    "text": "31 - Sa'id bin Salim told us, from Abd al-Wahhab bin Mujahid, from his father, regarding His saying (Blessed and Exalted is He): {So let them taste it - scalding water and [foul] purulence (Ghassaq)} [Sad: 57], he said: \"Al-Ghassaq is cold that cannot be borne.\"\n\n32 - Ibn Lahi'ah told us, Abu Qabil told us, he said: I heard Abu Hubayrah Al-Ziyadi say: I heard Abdullah bin Amr bin Al-Aas say: \"Do you know what Al-Ghassaq is?\" They said: Allah knows best. He said: \"It is thick pus. If a drop of it were spilled [p. 32] in the West, the people of the East would stink [from it], and if it were spilled in the East, the people of the West would stink [from it].\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 20
  },
  {
    "serial_number": "4952520",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 32,
    "volume_number": 1,
    "text": "33 - Nuh bin Qays told us, he said: Awn bin Abi Shaddad told us, he said: Abdullah bin Abbas was sitting in the Hatim (of the Kaaba), and he said: \"I seek refuge in Allah from the Fire. If a gulp of Ghislin were brought down to the earth, it would spoil their livelihood for them.\"\n\n34 - Al-Mubarak bin Fadalah told us, from Al-Hasan, regarding His saying (Blessed and Exalted is He): {They will be given drink from a boiling spring (Aniyah)} [Al-Ghashiyah: 5], he said: \"The Arabs used to say when the heat of something reached its peak, and nothing could be hotter than it: 'Its heat has reached its peak (Ana).' So Allah (Blessed and Exalted is He) revealed: {They will be given drink from a boiling spring (Aniyah)}. He said: Hell has been stoked over it since it was created, so its heat has reached its peak.\"\n\n35 - Al-Tabarani said: Abdullah bin Ahmed bin Hanbal told us, he said: Yahya bin Ma'in narrated to me, Abd al-Wahid bin Wasil and Abu Ubaidah Al-Haddad told us, Hisham bin Hassan told us, from Muhammad bin Shabib, from Ja'far bin Abi Wahshiyah, from Sa'id bin Jubayr, from [p. 33] Abu Hurairah, he said: The Messenger of Allah (peace be upon him) said: \"If a drop of the tar (Qatiran) of Hell fell onto the earth, it would burn the earth and whoever is on it.\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 21
  },
  {
    "serial_number": "4952523",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 33,
    "volume_number": 1,
    "text": "36 - Yahya bin Isa told us, from Al-A'mash, from Abu Yahya, from Mujahid, from Ibn Abbas, he said: \"If a drop of Zaqqum of Hell descended to the world, it would spoil the people's livelihood.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 22
  },
  {
    "serial_number": "4952524",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 34,
    "volume_number": 1,
    "text": "Chapter on the Mention of the Severity of the Punishment of the People of Hell\n\n37 - Al-Fudayl bin Iyad told us, from Hisham, from Al-Hasan, he said: \"The Fire eats them seventy thousand times every day. Whenever it ripens them and eats them, it is said: 'Return,' so they return as they were the first time.\"\n\n38 - Uthman bin Miqsam told us, from Amr, from Al-Hasan, and Qatadah, regarding His saying Almighty: {I will impose upon him an arduous ascent (Sa'ud)} [Al-Muddaththir: 17], he said: \"A punishment in which there is no rest.\"\n\n39 - Muhammad bin Khazim told us, from Al-A'mash, from Mujahid, he said: \"Scabies is cast upon the people of the Fire, so they scratch until the bone appears. They say: 'Why [p. 35] has this afflicted us?' He says: 'Because of your harming the believers.'\"",
    "foot_note": "None\n\nNone\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 23
  },
  {
    "serial_number": "4952528",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 35,
    "volume_number": 1,
    "text": "40 - Isma'il bin Ayyash told us, from Tha'labah bin Muslim Al-Khath'ami, from Ayyub bin Bashir Al-Ijli, from Shufayy bin Mati' Al-Asbahi, from the Messenger of Allah (peace be upon him) that he said: \"Four people annoy the people of the Fire despite the harm they are already in. They run between the Hamim (scalding water) and the Jahim (hellfire), calling out woe and destruction. The people of the Fire say to one another: 'What is the matter with these people who have annoyed us on top of the harm we are already in?' He said: So, a man upon whom a coffin of embers is locked; a man dragging his intestines; a man whose mouth flows with pus and blood; and a man eating his own flesh. He said: It is said to the owner of the coffin: 'What is the matter with the remote one (you) that he has annoyed us on top of the harm we are in?' He said: He says: 'The remote one died while he had peoples' wealth on his neck (debt), finding no way to repay or fulfill it.' Then it is said to the one dragging his intestines: 'What is the matter with the remote one that he has [p. 36] annoyed us on top of the harm we are in?' It is said: 'The remote one did not care where urine touched him and did not wash it.' Then it is said to the one whose mouth flows with pus and blood: 'What is the matter with the remote one that he has annoyed us on top of the harm we are in?' It is said: 'The remote one used to look at a wicked word and find pleasure in it just as he finds pleasure in obscenity.' He said: Then it is said to the one eating his own flesh: 'What is the matter with the remote one that he has annoyed us on top of the harm we are in?' It is said: 'The remote one used to eat the flesh of people through backbiting, and walk about with calumny.'\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 24
  },
  {
    "serial_number": "4952529",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 36,
    "volume_number": 1,
    "text": "41 - Bakr bin Khunays told us, from Abdullah bin Al-Hasan, from Al-Hasan, he said: The Messenger of Allah (peace be upon him) said: \"'O Gabriel, tell me about the Fire.' He said: 'By the One who sent you [p. 37] with the truth, if the like of a needle's eye were opened from it, all the people of the earth would burn. And by the One who sent you with the truth, if a keeper from the keepers of Hell were brought out, the people of the earth would die when they looked at him; because of what they see of the distortion of his creation. And by the One who sent you with the truth, if a garment from the garments of the people of Hell were hung between the heaven and the earth, the people of the earth would die from the stench of its smell.'\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 25
  },
  {
    "serial_number": "4952530",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 37,
    "volume_number": 1,
    "text": "42 - Yazid bin Ata' told us, from Aban, from Abu Qilabah, from the Prophet (peace be upon him), he said: \"While the Messenger of Allah (peace be upon him) was on a journey of his during intense heat, he stopped at noon, and a structure was set up for him. The heat of the sun became intense upon the people from above them, and the scorching ground from beneath them, until a man would almost reach for his feet [in pain], then wrap himself in his cloak, then fall down in the sun. The Prophet (peace be upon him) wanted to console them, so he called out to them: 'Do I not see you panicking from the heat of the sun, while between you and the heaven is a distance of five hundred years? By the One in whose hand is the soul of Muhammad, if a door from the doors of Hell were opened in the East, the brains of people in the West would boil until their nostrils flowed due to its heat.'\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 26
  },
  {
    "serial_number": "4952531",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 38,
    "volume_number": 1,
    "text": "Chapter on the Mention of the Sirat (Path) and Crossing it\n\n43 - Hammad bin Salamah told us, from Thabit Al-Bunani, from Abu Uthman Al-Nahdi, from Salman Al-Farsi, he said: \"The Sirat will be brought, its edge like the edge of a razor. The angels will say: 'O our Lord - or a word other than this, my strongest thought is that it is - who will pass over this?' He will say: 'Whomever I will of My creation.' He said: So they will say: 'Our Lord, we have not worshiped You with the true worship due to You.'\"\n\n44 - Mahdi bin Maimun told us, Muhammad bin Abdullah bin Abi Ya'qub told us, from Bishr bin Shaghaf, from Abdullah bin Salam, he said: \"The most noble of Allah's creation to Allah Almighty was Abu Al-Qasim (peace be upon him). Indeed, Paradise is in [p. 39] the heaven, and Hell is in the earth. When it is the Day of Resurrection, Allah will gather the creatures nation by nation, and prophet by prophet, until Ahmed (peace be upon him) and his nation are the last of the people in station. Then a bridge is placed over Hell. Then a caller calls out: 'Where is Ahmed and his nation?' He said: So he stands and his nation follows him, its righteous and its wicked. They take to the bridge, and Allah obliterates the sight of His enemies, so they fall into it from right and left. The Prophet (peace be upon him) and the righteous with him pass, and the angels meet them, showing them their places in Paradise on your right and on your left, until he ends up at his Lord (Blessed and Exalted is He). A chair is placed for him on the right of Allah (Blessed and Exalted is He). Then a caller calls out: 'Where is Jesus and his nation?' He said: So he stands, and his nation follows him, its righteous and its wicked. They take to the bridge, and Allah obliterates the sight of His enemies, so they fall into it from left and from right. The Prophet [Jesus] (peace be upon him) and the righteous with him are saved, and the angels meet them, showing them their places in Paradise on your right and on your left, until he ends up at his Lord Almighty. A chair is placed for him on the other side. Then the prophets and nations follow, until the last of them is Noah (peace be upon him).\"",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 27
  },
  {
    "serial_number": "4952534",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 39,
    "volume_number": 1,
    "text": "45 - Muhammad bin Talhah told us, from Zubayd, from Mujahid, he said: \"The Sirat is like the edge of a sword - or like the sharp side of a sword - slippery and unstable. On its two sides are angels with hooks, saying: 'O Allah, save, save.' He said: So people pass over it like lightning, like birds, like the wind, like excellent horses, and riders. So among them are those saved [p. 40] securely, those saved but scratched, and those piled into the Fire.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 28
  },
  {
    "serial_number": "4952535",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 40,
    "volume_number": 1,
    "text": "46 - Ibn Lahi'ah told us, Abu Al-Zubayr told us, from Jabir, he said: I heard the Messenger of Allah (peace be upon him) say: \"Every human, hypocrite and believer, is given a light, and darkness covers him. Then they follow him, with the hypocrites among them, on the bridge of Hell. In it are hooks and thorns which seize whom Allah wills. Then the light of the hypocrite is extinguished, and the believer is saved. The first group is saved, their faces like the moon on the night of the full moon, seventy thousand who will not be held to account. Then those who follow them are like the brightest star in the sky, then likewise until intercession becomes lawful, and they intercede.\"\n\n47 - Marwan bin Mu'awiyah told us, he said: Al-Hasan bin Salim bin Abi Al-Ja'd told us, from his father, he said: \"Over the Fire are three bridges: A bridge upon which is the Trust (Amanah); no betrayer of trust passes by it except that it says: 'My Lord, this one betrayed me.' A bridge upon which is Kinship (Rahim); no severer of kinship ties passes by it except that it says: 'My Lord, this one cut me off.' And a bridge upon which Allah (Blessed and Exalted is He) is on the watch.\" Salim said: And none is saved from it except the saved one.",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 29
  },
  {
    "serial_number": "4952537",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 41,
    "volume_number": 1,
    "text": "48 - Marwan bin Mu'awiyah told us, he said: Abu Al-Fayd informed us, he said: I heard Al-Sha'bi say: The Messenger of Allah (peace be upon him) said: \"Over Hell is a bridge over which a man passes faster than lightning, than wind, and than birds.\"\n\n49 - Al-Mubarak bin Fadalah told us, from Al-Hasan, he said: The Messenger of Allah (peace be upon him) said: \"The Sirat is between the two sides of Hell. Its sides have hooks and many thorns. Allah detains by it whom He wills of the hypocrites. The hypocrites on that day are with the believers. A light is given to every believer and hypocrite by which they walk on the Sirat. Suddenly darkness covers them and begins to extinguish the light of the hypocrites, while the light of the believers shines until they enter Paradise. A wall is struck between them with a door, its interior containing mercy, and its exterior, facing it, is punishment.\" The mercy is Paradise. Al-Hasan said: There, Allah's deception overtakes them, and that is His saying Almighty: {They [think to] deceive Allah, but He is deceiving them} [An-Nisa: 142] on the Sirat.",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 30
  },
  {
    "serial_number": "4952539",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 42,
    "volume_number": 1,
    "text": "50 - Waki' told us, from Israil, from Abu Ishaq, from Abu Al-Ahwas, from Abdullah [Ibn Mas'ud], regarding His saying (Blessed and Exalted is He): {And there is none of you except he will come to it} [Maryam: 71], he said: \"The Sirat.\"\n\n51 - Sa'id bin Zarbi told us, he said: Thabit Al-Bunani narrated to me, he said: Anas bin Malik narrated to me, he said: The Messenger of Allah (peace be upon him) narrated to me, he said: \"Gabriel (peace be upon him) narrated to me: The last one to enter Paradise is a man to whom it is said: 'O servant of Allah, pass over the Sirat.' He said: So he passes, and his foot slips, but he holds on with the other. Then his knee slips, but he holds on with the other. The Fire takes from him, throwing its sparks at him and scorching him with its flame. Whenever something of it touches him, he strikes it with his hand and says: ...... until he is saved from it by the mercy of Allah.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 31
  },
  {
    "serial_number": "4952541",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 43,
    "volume_number": 1,
    "text": "Chapter on the Descent of Allah (Blessed and Exalted is He) in Shadows of Clouds for the Account\n\n52 - Ghassan bin Burzin Al-Tuhawi told us, Sayyar bin Salamah Al-Riyahi told us, from Abu Al-Aliyah Al-Riyahi, from Abdullah bin Abbas, he said: \"When it is the Day of Resurrection, the Jinn and Humans will gather on a single plain, none of them speaking to another. The Jinn and Humans will be ten parts; the Jinn will be nine parts, and the Humans will be one part. Then the nearest heaven will split, and the angels will descend in rows, with a leader for every row. The people of the earth will call out to them, saying: 'Is our Lord (Mighty and Majestic) among you?' They will say: 'He is not among us, but He is coming.' So the people of the nearest heaven and the Humans will be ten parts; the people of the nearest heaven will be nine parts, and the Jinn and Humans will be one part. Then the second heaven will split, and the angels will descend in rows, with a leader for every row. The people of the earth will say: 'Is our Lord (Blessed and Exalted is He) among you?' They will say: 'He is not among us, but He is coming.' So the people of the second heaven, the people of the nearest heaven, the Jinn, and the Humans will be ten parts; the people of the second heaven will be nine parts, and the people of the nearest heaven, the Jinn, and the Humans [p. 44] will be one part. Then the third heaven will split, and the angels will descend in rows, with a leader for every row. The people of the earth will say: 'Is our Lord (Blessed and Exalted is He) among you?' They will say: 'He is not among us, but He is coming.' So the people of the third heaven and the heavens below it, and the Jinn and Humans will be ten parts; the people of the third heaven will be nine parts, and the heavens below it, the Jinn, and the Humans will be one part. Then the people of the heavens will be like this until it reaches the seventh [heaven]. Until your Lord comes in shadows of clouds, and the angels in rows, not speaking.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 32
  },
  {
    "serial_number": "4952543",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 44,
    "volume_number": 1,
    "text": "53 - Abu Ali told us, from Hammad, from Ali bin Zayd, from Yusuf bin Mihran, from Ibn Abbas, he said: \"The Lord (Blessed and Exalted is He) will come among the Karubiyyun (Cherubim angels), and they are more numerous than the seven heavens, the seven earths, and the bearers of the Throne. The distance between the sole of the foot of one of them to his heel is a journey of five hundred years. From his heel to his knees is a journey of five hundred years. From his knees to the tip of his nose is a journey of five hundred years. From the tip of his nose to his collarbone is a journey of five hundred years. And from his collarbone to the place of his earring is a journey of five hundred years.\"\n\n54 - Ibn Lahi'ah told us, Abu Al-Zubayr told us, that he asked Jabir bin Abdullah about the Arrival (Al-Wurud), so Jabir said: I heard the Messenger of Allah (peace be upon him) say: \"We, on the Day of Resurrection, will be on a mound above the people. The nations will be called with their idols and what they used to worship, one after the other. Until [p. 45] our Lord comes to us after that, and He says: 'What are you waiting for?' They say: 'We are waiting for our Lord (Mighty and Majestic).' He says: 'I am your Lord.' They say: '[Not] until we look at You.' So He reveals Himself to them, laughing.\" Jabir said: Then I heard the Messenger of Allah (peace be upon him) say: \"Then He departs, and they follow Him.\"",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 33
  },
  {
    "serial_number": "4952545",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Az-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Islamic Awareness Library for Reviving Islamic Heritage, Islamic Awareness Library",
    "page_number": 45,
    "volume_number": 1,
    "text": "55 - Al-Mubarak bin Fadalah told us, from Al-Hasan, he said: The Messenger of Allah (peace be upon him) said: \"On the Day of Resurrection, what every people used to worship besides Allah will be raised for them. Whoever used to worship a sun, a moon, or an idol will follow it until they fall into the Fire. Then the Jews are brought, and it is said to them: 'What did you use to worship?' They say: 'We used to worship Allah and Uzair,' except for a few of them. So it is said to them: 'Go.' Then the Christians are brought, and it is said to them: 'What did you use to worship?' They say: 'We used to worship Allah and the Messiah,' except for a few of them. So it is said to them: 'Go.' He said: Then our Lord (Mighty and Majestic) comes to us while we are on a high mound, and He says: 'What are you waiting for?' We say: '[We are waiting for] our Lord.' [p. 46] So it is said to them: 'Do you know your Lord (Mighty and Majestic) without having seen Him?' They say: 'Yes, we know Him; He has no equal.' Thereupon our Lord (Mighty and Majestic) reveals Himself to us while laughing. He said: So we follow our Lord, and He takes us across the Sirat.\"",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 34
  },
  {
    "serial_number": "4952546",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 46,
    "volume_number": 1,
    "text": "56 - Muhammad bin Khazim told us, from Suhayl bin Abi Salih, from his father, from Abu Huraira, who said: They said: O Messenger of Allah, shall we see our Lord? He said: «Do you not see the moon on the night of the full moon without harm? By Allah, you will surely see Him just as you see the moon on the night of the full moon without harm.» He said: «Then a caller will call out: 'Let every nation follow what it used to worship in the world.' He said: So what they used to worship in the world will be represented to every people, and it will take them until it leads them into the Fire. Then whoever crosses the Sirat (bridge) and spent a pair from his wealth in the path of Allah, the gatekeepers of Paradise will race to him: 'O servant of Allah, O Muslim, this is good, so come.'» He said: So the Messenger of Allah, peace and blessings be upon him, struck the thigh of Abu Bakr, may Allah be pleased with him, and said: «Indeed, you are one of them.»\n\n57 - Hammad bin Salamah told us, from Ya'la bin Ata, from Waki' bin Hudus, from his uncle Abu Razin, who said: I said: O Messenger of Allah, will all of us see his Lord, Mighty and Majestic, on the Day of Resurrection? And what is the sign of that in His creation? He said: «Does not all of you see the moon while being alone with it?» I said: Yes. He said: «Then He is greater.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 35
  },
  {
    "serial_number": "4952548",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 47,
    "volume_number": 1,
    "text": "58 - Sufyan bin Uyaynah and Abda bin Sulaiman told us, from Ismail bin Abi Khalid, from Qais bin Abi Hazim, from Jarir bin Abdullah, that the Messenger of Allah, peace and blessings be upon him, said: «You will see your Lord, Mighty and Majestic, not being harmed in seeing Him, just as you look at the moon on the night of the full moon.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 36
  },
  {
    "serial_number": "4952549",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 48,
    "volume_number": 1,
    "text": "59 - Some companions of Ibn Lahi'ah told us, from Ibn Lahi'ah, from Abu Qabil, from Ka'b al-Ahbar, who said: Four mountains on the Day of Resurrection: Al-Khalil, Lebanon, Al-Tur, and Al-Judi. Each one of them will be a white pearl, illuminating what is between the heavens and the earth. They will return to Bayt al-Maqdis (Jerusalem) to be placed in its corners. Then the Compeller will place His Throne upon them until Allah judges between the people of Paradise and the people of the Fire, and the angels around the Throne {exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise is [due] to Allah, Lord of the worlds.\"} [Az-Zumar: 75]\n\n60 - Fudayl bin Marzuq told us, from Abu Ishaq, from Abdullah bin Ata, from Uqbah bin Amir Al-Juhani, who said: «The first and the last will be gathered on a single plain, then the Possessor of Glory will manifest Himself to them.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 37
  },
  {
    "serial_number": "4952551",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 49,
    "volume_number": 1,
    "text": "Chapter: The Intercession of the Prophet, peace and blessings be upon him, for the People of the Standing (Mawqif)\n\n61 - Isra'il told us, from Abu Ishaq, from Silah, from Hudhayfah, who said: «Muhammad, peace and blessings be upon him, will be called, and he will say: Here I am at Your service and at Your command (Labbayk wa Sa'dayk), and all good is in Your hands, and evil is not attributed to You, and the guided one is he whom You guided, and Your servant is before You, and through You and to You, there is no refuge nor escape from You except to You, Blessed are You and Exalted, Glory be to You, Lord of the House. That is the Praiseworthy Station (Al-Maqam Al-Mahmud).»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 38
  },
  {
    "serial_number": "4952553",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 50,
    "volume_number": 1,
    "text": "62 - Al-Mubarak bin Fadalah told us, from Al-Hasan, who said: The Messenger of Allah, peace and blessings be upon him, said: «They say: Whom do you know who can intercede for us with our Lord, so He may save us from the severity of this day and its distress and grief? They say: We do not know a creation more honored by Allah than Adam, He created him with His Hand, breathed into him from His Spirit, and commanded the angels so they prostrated to him. So they come to Adam, peace be upon him, and say: O Adam, intercede for us with your Lord, Mighty and Majestic, to save us from the severity of this day and its distress and grief. He says: I am not fit for that, and he mentions his sin, but go to Noah, peace be upon him, for he is the first of the prophets. So they come to Noah, peace be upon him, and he says: I am not fit for that, but go to Abraham whom Allah took as a close friend (Khalil). So they come to Abraham, peace be upon him, and he says: I am not fit for that, but go to Moses whom Allah spoke to directly. So they come to Moses, and he says: I am not fit for that, but go to Jesus. So they come to Jesus, and he says: I am not fit for that. So they return to Adam and say: O our father, we did not find anyone to intercede for us with our Lord, Mighty and Majestic. He says: O my children, do you see if one of you took a vessel and put his goods in it, then sealed it so that no one could reach what is in the vessel until he breaks the seal? They say: No. He says: Indeed, Muhammad is the Seal of the Prophets, so go to him, he will intercede for you with your Lord, Mighty and Majestic.» The Messenger of Allah, peace and blessings be upon him, said: «So the people come to me and say: O Muhammad, this is the Praiseworthy Station, intercede for us with your Lord to save us from the length of this day and its grief and distress. He said: So he says: I am for it. He said: So I proceed until I come to the gate of Paradise, take the rings of the gate and ask for it to be opened.» Al-Hasan said: And he has been forgiven his past and future sins, so he does not come with any sin. «My Lord says: Open for My servant Ahmad, peace and blessings be upon him. So the gate is opened for me, and I enter Paradise and find my Lord sitting on His Throne (Kursi) in His Paradise, so I fall down prostrating to my Lord. He said: So my Lord teaches me praises that no one before me praised Him with. Then He says to me: O Muhammad, raise your head, say and you will be heard, ask and you will be given, intercede and your intercession will be accepted. So I raise my head and say: O Lord, my Ummah (nation). So my Lord sets a limit for me. Then I fall down prostrating. He says: O Muhammad, raise your head, say and you will be heard, ask and you will be given, intercede and your intercession will be accepted. So I raise my head and say: O Lord, my Ummah, my Ummah. He said: So He sets a limit for me. Then I am permitted to intercede.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 39
  },
  {
    "serial_number": "4952554",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 51,
    "volume_number": 1,
    "text": "63 - Abu Al-Ahwas told us, from Adam bin Ali, who said: I heard Ibn Umar say: «The people will become kneeling groups on the Day of Resurrection, every nation following its prophet, saying: O so-and-so, intercede for us; O so-and-so, intercede for us, until intercession ends up with Muhammad, peace and blessings be upon him. That is the Praiseworthy Station.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 40
  },
  {
    "serial_number": "4952555",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 52,
    "volume_number": 1,
    "text": "64 - Abu Awanah told us, from Qatadah, from Anas, who said: The Messenger of Allah, peace and blessings be upon him, said: «The people will be gathered on the Day of Resurrection, and they will be concerned about that, and they will say: If only we seek intercession so He relieves us from this place of ours. So they come to Adam and say: O Adam, you are the one whom Allah created with His Hand, breathed into you from His Spirit, and commanded the angels so they prostrated to you. Intercede for us with your Lord, Mighty and Majestic, so He may relieve us from this place of ours. He says: I am not fit for that, and he mentions his sin, so his Lord, Mighty and Majestic, shies away from it (or he feels shy from his Lord because of it). But go to Noah, the first messenger Allah sent. So they come to Noah and he says: I am not fit for that, and he mentions his sin, so his Lord shies away from it (or he feels shy from his Lord because of it). But go to Abraham whom Allah took as a close friend. Then he mentioned Moses and Jesus, and he says: I am not fit for you, but go to Muhammad, peace and blessings be upon him, a servant whom Allah forgave his past and future sins. He said: So they come to me, and I ask permission from my Lord, and permission is granted to me. When I see Him, I fall down prostrating.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 41
  },
  {
    "serial_number": "4952556",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 53,
    "volume_number": 1,
    "text": "65 - Ibn Lahi'ah told us, he said: Darraj told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, that the Messenger of Allah, peace and blessings be upon him, said: «If the seven heavens and the seven earths were in one pan [of a scale], and 'La ilaha illa Allah' (There is no god but Allah) in a pan, 'La ilaha illa Allah' would outweigh them.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 42
  },
  {
    "serial_number": "4952557",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 54,
    "volume_number": 1,
    "text": "Chapter: Mentioning the Scales on the Day of Resurrection\n\n66 - Hammad bin Salamah told us, from Thabit Al-Bunani, from Abu Uthman Al-Nahdi, from Salman Al-Farsi, who said: «The Scale will be brought on the Day of Resurrection. If the heavens and the earth and whoever is in them were placed in its pan, it would encompass them. The angels will say: Our Lord, whom will You weigh with this? He says: Whomever I wish of My creation. The angels will say: Our Lord, we have not worshipped You as You deserve to be worshipped.»\n\n67 - Marwan bin Mu'awiyah told us, he said: Abu Al-Fayd informed us, he said: I heard Al-Sha'bi say: Aisha said: O Messenger of Allah, will we not recognize each other on the Day of Resurrection, for I hear Allah saying: {So there will be no kinship among them that Day, nor will they ask about one another} [Al-Mu'minun: 101]. The Messenger of Allah, peace and blessings be upon him, said: «Three situations in which every soul will be distracted from others: When the book is thrown to every human, until he sees whether he takes his book with his right hand or his left. And at the Scales, until he sees whether it is heavy or light. And the bridge of Hell (Sirat), a man passes over it faster than lightning, and than wind, and than birds.»",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 43
  },
  {
    "serial_number": "4952560",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 55,
    "volume_number": 1,
    "text": "68 - Sufyan told us, from Amr bin Dinar, he heard Ubayd bin Umayr say: «The tall, huge man will be brought on the Day of Resurrection and placed in the Scale, but he will not weigh with Allah, Mighty and Majestic, the weight of a mosquito's wing», then he recited {Those are the ones who disbelieved in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any weight} [Al-Kahf: 105]\n\n69 - Waki' and Yahya bin Isa told us, from Al-A'mash, from Shamir bin Atiyyah, from Abu Yahya, from Ka'b bin Ujrah, who said: «The man will be brought on the Day of Resurrection and weighed against a grain, but he will not outweigh it, and weighed against a mosquito's wing, but he will not outweigh it», and he recited: {And We will not assign to them on the Day of Resurrection any weight} [Al-Kahf: 105]",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 44
  },
  {
    "serial_number": "4952562",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 56,
    "volume_number": 1,
    "text": "70 - Bakr bin Khunais told us, from Dirar bin Amr, from Yazid Al-Raqashi, from Anas, from the Prophet, peace and blessings be upon him, who said: «The Scales will be set up on the Day of Resurrection. The people of prayer, the people of fasting, the people of charity, and the people of Hajj will be brought, and they will be given their due by the Scales. And the people of tribulation (affliction) will be brought, but no scale will be set up for them nor a register spread for them, and reward will be poured upon them abundantly without account.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 45
  },
  {
    "serial_number": "4952563",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 57,
    "volume_number": 1,
    "text": "Chapter: The Placement of the Account on the Day of Resurrection\n\n71 - Sulaiman bin Al-Mughirah told us, from Humaid bin Hilal, who said: «It was mentioned to us that a man will be called to the Account on the Day of Resurrection, and it will be said: O so-and-so son of so-and-so, come to the Account, until he says: No one other than me is meant by what pertains to the Account.»\n\n72 - Sa'id bin Salim told us, from Talha bin Amr, who said: Ata used to say to me: «O Talha, how many names are upon your name and my name! But when it is the Day of Resurrection and it is said: O so-and-so, no one else will stand up. He says: No one will stand up except the one who is meant.»\n\n73 - Sulaiman bin Hayyan told us, from Ja'far bin Sulaiman, from Abu Al-Jawza', regarding His saying, Blessed and Exalted: {And they fear the terrible accounting} [Ar-Ra'd: 21], he said: «Strict discussion of deeds.»\n\n74 - Nasr bin Tarif told us, from Farqad Al-Sabakhi, from Ibrahim, who said: I heard him say: {Those will have the terrible accounting} [Ar-Ra'd: 18], he said: «No good deed will be accepted from them, and no bad deed will be overlooked.»",
    "foot_note": "None\n\nNone\n\nNone\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 46
  },
  {
    "serial_number": "4952568",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 58,
    "volume_number": 1,
    "text": "75 - Ibn Lahi'ah told us, Abu Al-Aswad told us, from Urwah, from Aisha, that the Messenger of Allah, peace and blessings be upon him, said: «No one will be held accountable on the Day of Resurrection and then forgiven. The Muslim sees his deeds in his grave.» And Allah Almighty says: {So on that Day no question will be asked about his sin of man or jinn} [Ar-Rahman: 39] .. {The criminals will be known by their marks} [Ar-Rahman: 41]\n\n76 - Muhammad bin Khazim told us, from Hisham bin Urwah, from his father, from Aisha, that the Messenger of Allah, peace and blessings be upon him, said: «Whoever is held accountable enters Paradise; Allah Almighty says {Then as for he who is given his record in his right hand, He will be judged with an easy account} [Al-Inshiqaq: 8]. And the other says: {So on that Day no question will be asked about his sin of man or jinn. So which of the favors of your Lord would you deny? The criminals will be known by their marks, and they will be seized by the forelocks and the feet} [Ar-Rahman: 39-41]»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 47
  },
  {
    "serial_number": "4952570",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 60,
    "volume_number": 1,
    "text": "Chapter: Mentioning What is Called Out on the Day of Resurrection\n\n77 - Fudayl bin Marzuq told us, from Abu Ishaq Al-Sabi'i, from Abdullah bin Ata, from Uqbah bin Amir Al-Juhani, who said: «The Possessor of Glory will manifest Himself and say: The gathering will know to whom belongs generosity today, three times. Let those rise whose {sides part from [their] beds; they supplicate their Lord in fear and hope, and from what We have provided them, they spend} [As-Sajdah: 16]. He said: So they will rise. Then He says: The people of the gathering will know to whom belongs generosity today, three times. Let those rise whom {neither commerce nor sale distracts from the remembrance of Allah and performance of prayer and giving of zakah. They fear a Day in which the hearts and eyes will fearfully turn about} [An-Nur: 37]. So they will rise. Then He says: The people of the gathering will know to whom belongs generosity today, three times. Let the Hammadun (those who praise Allah much) rise.» Fudayl said: So I asked Abu Ishaq: Who are the Hammadun? He said: The nation of Muhammad, peace and blessings be upon him.\n\n78 - Ghassan bin Burzin Al-Tuhawi told us, Sayyar bin Salamah Al-Riyahi told us, from Abu Al-Aliyah Al-Riyahi, from Ibn Abbas, who said: «A caller will stand and call out: The people of the gathering will know who are the people of generosity? Where are those who praise Allah in every condition? So they will rise, and they will be ordered to Paradise. Then he stands and calls out a second time, saying: The people of the gathering will know today who are the people of generosity? Where are those whose {sides part from [their] beds; they supplicate their Lord in fear and hope, and from what We have provided them, they spend} [As-Sajdah: 16]? He said: So they will rise, and they will be ordered to Paradise. Then he stands and calls out a third time, saying: The people of the gathering will know today who are the people of generosity? Where are those whom {neither commerce nor sale distracts from the remembrance of Allah and performance of prayer and giving of zakah. They fear a Day in which the hearts and eyes will fearfully turn about} [An-Nur: 37]? So they will rise, and they will be ordered to Paradise. Then a neck will emerge from the Fire and overlook the creations, having two seeing eyes and an eloquent tongue, saying: I have been commanded with three: With every obstinate tyrant. It sees them better than a bird sees a sesame seed. So it picks them up and imprisons them in Hell. Then it comes out a second time and says: I have been commanded with those who used to harm Allah and His Messenger. It sees them better than a bird sees a sesame seed. So it picks them up and imprisons them in Hell. Then it comes out a third time and says: I have been commanded with the image-makers (Musawwirin). It sees them better than a bird sees a sesame seed. So it picks them up and imprisons them in Hell. Then the records will fly from the hands of women and men.»",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 48
  },
  {
    "serial_number": "4952573",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 64,
    "volume_number": 1,
    "text": "79 - Sa'id bin Salim told us, from Talha bin Amr, from Ata, from Abu Huraira, who said: «Allah Almighty will say on the Day of Resurrection: O people, I established a lineage (relationship based on piety), and you established a lineage (based on worldly status). I said: {Indeed, the most noble of you in the sight of Allah is the most righteous of you}, and you refused except to say: So-and-so son of so-and-so and so-and-so son of so-and-so is more noble than so-and-so. Today I elevate My lineage and debase your lineage. Where are the righteous (Al-Muttaqun)?» Talha said: Ata used to say: He says O Talha, no one will stand up except the one who is meant.",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 49
  },
  {
    "serial_number": "4952574",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 65,
    "volume_number": 1,
    "text": "80 - Al-Mubarak bin Fadalah told us, he said: A man told me, he heard Al-Hasan say: «When the nations kneel before the Lord of the Worlds on the Day of Resurrection, they will be called: Let him rise whose reward is upon Allah. So no one will rise except he who pardoned in the world.»\n\n81 - Ibn Lahi'ah told us, Darraj Abu Al-Samh told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Messenger of Allah, peace and blessings be upon him, that he said: «The Lord, Mighty and Majestic, will say on the Day of Resurrection: The people of the gathering will know today: Who are the people of generosity? It was said: And who are the people of generosity, O Messenger of Allah? He said: The people of Remembrance (Dhikr) in the gatherings.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 50
  },
  {
    "serial_number": "4952576",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 67,
    "volume_number": 1,
    "text": "Chapter: Mentioning Allah, Blessed and Exalted, Holding the Servants Accountable on the Day of Resurrection\n\n82 - Hammad bin Salamah told us, from Humaid and Thabit, from Al-Hasan, who said: «The son of Adam will be made to stand on the Day of Resurrection as if he were a lamb (badhaj). Allah Almighty will say: Son of Adam, where is what I entrusted to you? He says: O Lord, I saved it and invested it, and left it more abundant than it was.»\n\n83 - Abu Hilal told us, Qatadah told us, from Anas, who said: «The son of Adam will be made to stand before Allah, Mighty and Majestic, as if he were a lamb (badhaj). He said: He will say: What did you do with what I entrusted to you and enriched you with? He says: O Lord, I collected it and invested it, so send me back and I will bring it to You more abundant than it was. He says to him: What did you send forth from it? He says: O Lord, I collected it and invested it, so send me back and I will bring it to You more abundant than it was. He says: No, but what you sent forth will be accounted for. So if he has no good, he will be ordered to the Fire.»",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 51
  },
  {
    "serial_number": "4952579",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 68,
    "volume_number": 1,
    "text": "84 - Hammad bin Salamah told us, from Ishaq bin Abdullah bin Abi Talha, from Abu Salih, from Abu Huraira, that the Messenger of Allah, peace and blessings be upon him, said: «Allah, Mighty and Majestic, will say on the Day of Resurrection: O son of Adam, did I not carry you on horses and camels, marry you to women, and make you lead and be obeyed (tarba' wa tar'as)? He says: Yes. Allah Almighty says: O son of Adam, so where is the gratitude for that?»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 52
  },
  {
    "serial_number": "4952580",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 69,
    "volume_number": 1,
    "text": "85 - Uthman bin Miqsam told us, from Qatadah, who said: Anas bin Malik told me, that the Messenger of Allah, peace and blessings be upon him, said: «It will be said to the disbeliever: If you had the earth full of gold, would you ransom yourself with it? He said: He says: Yes. It will be said: You lied, you were asked for something easier than that, but you did not do it: There is no god but Allah.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 53
  },
  {
    "serial_number": "4952581",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 70,
    "volume_number": 1,
    "text": "86 - Hammad bin Salamah told us, from Thabit Al-Bunani, from Anas, that the Prophet, peace and blessings be upon him, said: «A man from the people of Paradise will be brought on the Day of Resurrection, and it will be said to him: How did you find your abode? He says: The best abode. It will be said: Ask and wish. He says: I do not ask and I do not wish except that You return me to the world so that I may be killed in Your path ten times. He said: And a man from the people of the Fire will be brought, and He says: Son of Adam, how did you find your abode? He says: The worst abode. He says: Ransom yourself with the earth full of gold. He says: Yes. He says: You lied, you were asked for something easier than that.»\n\n87 - Hammad bin Salamah told us, from Thabit, from Anas bin Malik, from the Prophet, peace and blessings be upon him, who said: «The most luxurious person in the world will be brought on the Day of Resurrection, and He says: Dip him once in the Fire. Then he is brought, and He says: O son of Adam, did you ever see any good? Did you ever see any delight? Did you ever see any joy? He says: No, by Your Might, I never saw any good, nor any joy, nor any delight. He said: He says: Return him. He said: And the person who suffered the most misery, harm, and hardship in the world will be brought, and He says: Dip him once in Paradise. He said: Then He says: O son of Adam, did you ever see any misery or anything you dislike? He says: No, by Your Might, I never saw anything I dislike.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 54
  },
  {
    "serial_number": "4952583",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 71,
    "volume_number": 1,
    "text": "88 - Yazid bin Ata told us, from Abu Sinan, from Shaqiq bin Salamah, who said: «Allah Almighty will call the servant on the Day of Resurrection, screen him with His Hand, and then say to him: Do you recognize [your sins]? He says: Yes, O Lord. He says: Indeed, I have forgiven them for you.»\n\n89 - Adi bin Al-Fadl told us, from Yunus bin Ubaid, from Humaid bin Hilal, from Abu Burdah, from Abu Musa Al-Ash'ari, who said: «When it is the Day of Resurrection, the believer will be given his book between him and his Lord. Allah, Mighty and Majestic, will make him confess his sins, saying: My servant, did you commit such and such sin? He says: Yes. So Allah forgives them for him and replaces them with good deeds. That is when he says: {Here, read my record!}. So he wishes that everyone on earth would look into his book. As for the hypocrite, he is given his book, and He says: My servant, did you commit such and such sin? He says: By Your Might, I did not do it. The Angel says: Did you not do such and such in such and such hour? He says: No, by Your Might, what was written against me is nothing but false. He says: Did you do such and such? He says: No. The Angel says: Did you not do such and such on such and such day in such and such hour? He says: No, by Your Might. So his mouth is sealed.» Al-Ash'ari said: I thought he said: Indeed, the first thing to speak from him is his right thigh.",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 55
  },
  {
    "serial_number": "4952585",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 73,
    "volume_number": 1,
    "text": "90 - Adi bin Al-Fadl told us, from Bahz bin Hakim, from his father, from his grandfather Mu'awiyah bin Haydah, that he heard the Messenger of Allah, peace and blessings be upon him, say: «You will be called on the Day of Resurrection with your mouths muzzled with Al-Fidam (muzzles), and the first thing to speak clearly from one of you will be his thigh or his palm.»\n\n91 - Yazid bin Ata told us, from Aban, from Bakr bin Abdullah Al-Muzani, from Abu Rafi', who said: «It has reached us that on the Day of Resurrection, three registers will be brought for the son of Adam: A register containing blessings, a register containing deeds (good deeds), and a register containing his sins. It will be said to the smallest of those blessings: Stand and take your price from the deeds. So it will consume all of that deed, and his sins will remain, and the blessings will remain as they are. Hence the servant says: {Indeed, our Lord is Forgiving and Appreciative} [Fatir: 34]»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 56
  },
  {
    "serial_number": "4952587",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 74,
    "volume_number": 1,
    "text": "92 - Ibn Lahi'ah told us, Darraj told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Messenger of Allah, peace and blessings be upon him, who said: «When it is the Day of Resurrection, the disbeliever will be informed of his deeds, but he will deny and argue. It will be said: These are your neighbors testifying against you. He says: They lied. It will be said: Your family and clan? He says: They lied. It will be said: Swear, and they will swear. Then Allah will silence them, and their tongues will testify, then He will enter them into the Fire.»",
    "foot_note": "None",
    "book_id": "263",
    "new_page_number": 57
  },
  {
    "serial_number": "4952588",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 75,
    "volume_number": 1,
    "text": "93 - Ibn Lahi'ah told us, Al-Harith bin Yazid told us, from Kathir Al-A'raj, from Uqbah bin Amir, that he heard him say: «On the Day of Resurrection, a man will be asked about by his wife, his servant, his sons, his clan, and the earth. If they praise him with good, Allah purifies him. And if they praise him with evil, his left thigh will cry out until it is heard, then Allah will invalidate his argument.»\n\n94 - Al-Mubarak bin Fadalah told us, from Al-Hasan, from the Prophet, peace and blessings be upon him, who said: «The son of Adam will be brought on the Day of Resurrection as if he were a lamb (badhaj) - meaning: like a young sheep - and his Lord will say to him: O son of Adam, where is what I entrusted to you, and where is what you possessed, and where is what I gave you? He says: Lord, I collected it, invested it, and left it more abundant than it was. He says: Bring what you sent forth from it. But He sees that he sent forth nothing, and he will not return to what is after it.»\n\n95 - Yahya bin Isa told us, from Al-A'mash, from Khaythamah, from Adi bin Hatim, who said: The Messenger of Allah, peace and blessings be upon him, said: «There is none among you but that Allah will speak to him on the Day of Resurrection, with no interpreter between Him and him. He will look to his right and see nothing but what he sent forth, and look to his left and see nothing but what he sent forth, and look in front of him and see the Fire. So whoever can protect his face from the Fire, let him do so, even with half a date.»",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 58
  },
  {
    "serial_number": "4952591",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 76,
    "volume_number": 1,
    "text": "96 - Sharik told us, from Hilal Al-Wazzan, from Abdullah bin Ukaym, who said: I heard Abu Mas'ud, who began with an oath before the hadith, saying: «By Allah, there is none among you but that Allah, Mighty and Majestic, will be alone with him on the Day of Resurrection just as one of you is alone with the moon on the night of the full moon - or he said: on its night - saying: What deceived you regarding Me, O son of Adam? What deceived you regarding Me, O son of Adam? What did you do with what you knew? O son of Adam, what did you answer the Messengers?»\n\n97 - Hammad bin Salamah told us, from Ali bin Zaid, from Abu Rafi', from Abu Huraira, that the Messenger of Allah, peace and blessings be upon him, said: «Four will present an argument and excuse on the Day of Resurrection: An old man who reached Islam while senile, a deaf-mute person, an insane person, and a man who died during the interval (Fatrah, period between prophets). Allah, Mighty and Majestic, will say: Indeed, I am sending a messenger to you, so obey him. The Messenger will come to them and fuel a fire for them to enter. Whoever enters it, it will be cool and safe for him, and whoever does not enter it, the word of punishment will be justified against him.» 98 - Hammad bin Salamah told us, from Hammad, from Ibrahim, from Abu Huraira, similar to it.",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 59
  },
  {
    "serial_number": "4952593",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 78,
    "volume_number": 1,
    "text": "Chapter: Mentioning Retribution (Qisas) on the Day of Resurrection\n\n99 - Ibn Lahi'ah told us, Darraj told us, from Abu Al-Haytham, from Abu Sa'id Al-Khudri, from the Messenger of Allah, peace and blessings be upon him, who said: «By the One in Whose Hand is my soul, you will surely dispute, even two sheep regarding their butting each other.»\n\n100 - Al-Mubarak bin Fadalah told us, from Al-Hasan, who said: The Messenger of Allah, peace and blessings be upon him, said: «By the One in Whose Hand is my soul, the people of Paradise will be detained after they emerge from the Fire before entering Paradise, then retribution will be taken for some of them from others for their injustices among themselves, then it will be said to them: {You have done well, so enter it to abide eternally} [Az-Zumar: 73]»",
    "foot_note": "None\n\nNone\n\nNone",
    "book_id": "263",
    "new_page_number": 60
  },
  {
    "serial_number": "4952596",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 79,
    "volume_number": 1,
    "text": "101 - Al-Mubarak bin Fadalah told us, from Al-Hasan, who said: The Messenger of Allah, peace and blessings be upon him, said: «By the One in Whose Hand is my soul, good deeds will be raised for a servant on the Day of Resurrection, hoping that Allah will forgive him because of them. But a man keeps saying: O Lord, this servant of Yours wronged me. So Allah takes from his good deeds and puts them on the good deeds of the oppressed. Then another comes and says: O Lord, similar to that. It continues like that until no good deed remains for him, then he is given goodness (or rewarded).»\n\n102 - Abd al-Aziz bin Muhammad told us, from Al-Ala' bin Abd al-Rahman, from his father, from Abu Huraira, that the Messenger of Allah, peace and blessings be upon him, said: «You will surely render back rights to their owners, to the extent that retribution will be taken for the hornless sheep from the horned sheep on the Day of Resurrection.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 61
  },
  {
    "serial_number": "4952598",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "Al-Zuhd (Asceticism)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Library of Islamic Awareness for the Revival of Islamic Heritage, Library of Islamic Consciousness",
    "page_number": 80,
    "volume_number": 1,
    "text": "103 - Ibn Lahi'ah told us, Ibn Sawadah told us, from Abu Tamim Al-Jayshani, who said: We entered upon Abu Dharr Al-Ghifari, and I heard him say: «By the One in Whose Hand is my soul, the sheep will surely be asked about butting its companion, and the stone will be asked about bruising a man's finger.»\n\n104 - Hammad bin Salamah told us, from Amr bin Dinar, from Suhaib Al-Hadhdha, from Abdullah bin Amr bin Al-Aas, that the Messenger of Allah, peace and blessings be upon him, said: «Whoever kills a sparrow without its right, Allah will ask him about it on the Day of Resurrection.»",
    "foot_note": "None\n\nNone",
    "book_id": "263",
    "new_page_number": 62
  }
]