[
  {
    "text": "Fiqh al-Waqi' (Jurisprudence of Reality)\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8177\nbook_title: فقه الواقع\nbook_link: https://shamela.ws/book/710\nbook_id: 710\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: Null\nedition: Null\npages: 29\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7517813",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books\nBook: Fiqh al-Waqi' (Jurisprudence of Reality)\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nBook: Fiqh al-Waqi'\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\nAuthor: Muhammad Nasir al-Din al-Albani (Died 1420 AH)\n\n\n[The book's numbering matches the printed version]",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 3
  },
  {
    "serial_number": "7517814",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Regarding Fiqh al-Waqi' (The Jurisprudence of Reality) by the Allamah Muhammad Nasir al-Din al-Albani",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 4
  },
  {
    "serial_number": "7517815",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Indeed, all praise is due to Allah; we praise Him, we seek His help, and we ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, there is none to misguide him, and whomever He misguides, there is none to guide him. I bear witness that there is no deity worthy of worship but Allah alone, having no partner, and I bear witness that Muhammad is His slave and Messenger. To proceed: The Messenger of Allah, Muhammad (peace and blessings be upon him), says: ('The nations are about to gather against you just as eaters gather around their bowl.') A speaker asked: 'Is it because we will be few on that day?' He said: ('Rather, on that day you will be many, but you will be like the foam/scum of the torrent. Allah will surely remove the fear of you from the hearts of your enemies and will surely cast Wahn (weakness) into your hearts.') A speaker asked: 'O Messenger of Allah, what is Wahn?' He said: ('Love of the world and hatred of death.') [A specific authentic Hadith, you can see it referenced in (Al-Sahihah) (958)].",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 5
  },
  {
    "serial_number": "7517816",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "The Reality of Muslims: This noble Prophetic Hadith has manifested in its strongest appearance and clearest image in the great tribulation (Fitnah) that struck the Muslims, dividing their word and scattering (their ranks). A part of this harsh tribulation has struck the root of the hearts of a large number of preachers and students of knowledge, so they divided, regrettably, against themselves. Some began (speaking ill) of others, while the (other) part criticizes the rest and refutes them... and so on.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 6
  },
  {
    "serial_number": "7517817",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Knowing the Truth through Refutation: Those refutations (in themselves) or those criticisms (alone) are not harmful to any of these or those, whether the refuter or the refuted. This is because the truth is known by its light and evidence, not by its narrator and speaker, according to the people of fairness, though not to those of prejudice and arbitrariness. Rather, what harms these or those is: speaking without knowledge, casting words aimlessly, and speaking about the servants of Allah without right.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 7
  },
  {
    "serial_number": "7517818",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "The Issue of (Fiqh al-Waqi'): During that blind, deaf, and dumb tribulation, various issues of jurisprudence, methodology, and advocacy (Da'wah) were raised. We had scientific answers for them at that time, praise be to Allah the Glorified and His grace. Among the issues that followed that tribulation and were heavily discussed is what (some) termed (Fiqh al-Waqi' - Jurisprudence of Reality). I do not disagree with the form of this knowledge for which they invented this name, namely (Fiqh al-Waqi'), because many scholars have stated that those who undertake guiding the nation and formulating answers to solve their problems should be knowledgeable and aware of their reality. Therefore, it was among their famous sayings: (The ruling on a thing is a branch of conceptualizing it). This cannot be achieved except by knowing the (reality) surrounding the issue intended for research. This is from the rules of issuing Fatwas specifically and the fundamentals of knowledge generally. So, Fiqh al-Waqi', then, is understanding what concerns Muslims regarding their affairs or the plots of their enemies to warn them and to uplift them realistically, not through theoretical speech [As for (theoretical) speech which has no one to (adopt) it practically and bring it into the realm of (reality) effectively], or being preoccupied with the news of the disbelievers... or drowning in their analyses and ideas.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 8
  },
  {
    "serial_number": "7517819",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Importance of Knowing Reality: Knowing reality to arrive at the legal ruling through it is an important duty that must be performed by a specialized group of intelligent Muslim students of knowledge, just like any of the Sharia, social, economic, or military sciences, or any science that benefits the Islamic nation and brings it closer to the steps of returning to its glory, honor, and sovereignty, especially as these sciences develop with the development of times and places.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 9
  },
  {
    "serial_number": "7517820",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Among the Types of (Fiqh) that are Obligatory: What must be pointed out in this context is that the types of Fiqh required from the general body of Muslims are not only that jurisprudential Fiqh (of schools of thought) which they know and learn, or this (Fiqh) which some young preachers have noticed and drawn attention to. The types of Fiqh obligatory upon Muslims to perform, even if only as a collective duty (Kifa'i) at the very least, are greater than all that and wider in scope. For example: (Fiqh of the Book [Quran]), (Fiqh of the Sunnah), (Fiqh of Language), (Fiqh of Cosmic Laws), (Fiqh of Disagreement/Khilaf), and similar matters. These types of Fiqh, in general, are no less important than the two types of Fiqh referred to earlier, whether the known Fiqh or (Fiqh al-Waqi') which we are in the process of clarifying. Despite all this, we do not see anyone drawing attention to these types of Fiqh or referring to them, especially (Fiqh of the Book and the Sunnah), which is the head and foundation of these types. This is the Fiqh regarding which, if someone were to say it is an individual obligation (Fard Ayn), they would not be far from the truth due to the Muslims' great need for it and its intense necessity for them. Despite that: we do not hear anyone humming around it, establishing its methodology, occupying the youth with it, and raising them upon it.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 10
  },
  {
    "serial_number": "7517821",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "We Want (Methodology), Not Just Talk: Yes, there are many, praise be to Allah, who speak about the Book and the Sunnah today and refer to them. But the duty we want is not just a written piece or a lecture here and there. Rather, what we want is to make the Book and the Sunnah the general framework for every small and large matter, and that their methodology becomes the slogan and covering for the Da'wah (call) from beginning to end. Consequently, the thinking of those invited, including the youth and others, should be rooted according to this great methodology, without which there is no rectification for the nation. Therefore, there must be scholars in all the aforementioned types of Fiqh, especially (Fiqh of the Book and the Sunnah), with clear controls and explained rules.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 11
  },
  {
    "serial_number": "7517822",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "The Division Regarding (Fiqh al-Waqi'): However, we have heard and noticed that many Muslim youth have fallen into confusion regarding this type of knowledge, which was previously referred to by their naming it (Fiqh al-Waqi'). They divided into two sections and unfortunately became two parties, as some exaggerated in this matter while others fell short. You see and hear from those who aggrandize the status of (Fiqh al-Waqi') and place it in a lofty rank above its correct scientific rank, that they want every scholar of Sharia to be knowledgeable in what they called (Fiqh al-Waqi'). The opposite is also occurring among them; they have deluded their listeners and those gathered around them into thinking that anyone who is aware of the reality of the Islamic world is a Faqih (jurist) in the Book and the Sunnah and upon the methodology of the Righteous Predecessors, and this is not necessarily the case, as is apparent.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 12
  },
  {
    "serial_number": "7517823",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Perfection is Rare, So Cooperation is Obligatory: We do not imagine the existence of a human being who is perfect in every sense of this word, meaning: that he is knowledgeable in all these sciences that I referred to and discussed previously. The duty, therefore, is: the cooperation of those who have dedicated themselves to knowing the reality of the Islamic nation and what is plotted against it, with the scholars of the Book and the Sunnah and upon the path of the nation's predecessors. The former present their perceptions and ideas, and the latter clarify regarding them the judgment of Allah the Glorified, based on authentic evidence and clear proof. As for the speaker on (Fiqh al-Waqi') becoming, in the minds of his listeners, one of the scholars and muftis simply because he spoke about this referred (Fiqh), this cannot be judged as correct in any way, as his speech is taken as a support to reject the fatwas of scholars and invalidate their ijtihads (juridical reasonings) and rulings.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 13
  },
  {
    "serial_number": "7517824",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "A Scholar's Error Does Not Invalidate Him: It is important to clarify in this context that a scholar might err in his judgment on a specific issue among those realistic issues. This is a matter that (has happened) and happens. But... does this invalidate this scholar or that one, and make those who disagree with him describe him with offensive words that should not be directed at him? For example, it might be said - and has been said: 'This is a scholar of Sharia and not a scholar of reality.' This is a division that contradicts both Sharia and reality. Their entire speech referred to implies an obligation on the scholars of the Book and Sunnah to also be knowledgeable in economics, sociology, politics, military systems, methods of using modern weapons, and so on. I do not think there is a rational human being who imagines the gathering of all these sciences and knowledge in the chest of one human being, no matter how learned or (perfect) he is.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 14
  },
  {
    "serial_number": "7517825",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "The Error of (Ignorance) of Reality: We have also heard about people saying: (What do we care to know this reality?). This, if it occurs, is also an error. The fair statement is to say: In every branch of knowledge, there must be those who are knowledgeable and specialized in it, cooperating among themselves in a sincere Islamic brotherly cooperation with no partisanship or tribalism, to achieve the interest of the Islamic nation and establish what every Muslim seeks: creating the Islamic society and applying Allah's law on His earth. All those sciences are obligatory as a collective duty (Fard Kifayah) upon the collective body of Muslim scholars, and it is not obligatory at all that a single individual gathers them all, let alone the impossibility of that in reality. For example: A doctor is not permitted to justify performing a specific surgery at times unless he seeks the opinion of the scholar learned in the Book of Allah the Glorified and the Sunnah of the Messenger of Allah (peace be upon him) and upon the methodology of the Righteous Predecessors, as it is difficult, if not to say impossible, for a doctor proficient in his field to also be knowledgeable in the Book and the Sunnah, proficient in their jurisprudence and knowledge of their rulings.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 15
  },
  {
    "serial_number": "7517826",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Emphasizing the Obligation of Cooperation: Therefore, cooperation is essential, acting upon the saying of the Lord of the Worlds in His Noble Book: (And cooperate in righteousness and piety, but do not cooperate in sin and aggression) [Al-Ma'idah: 2]. Thereby, the hoped-for interests of the Islamic nation are realized. This issue is self-evident, for a Muslim can hardly imagine a scholar learned in the Book and the Sunnah who is simultaneously an expert doctor, and furthermore knows what they call today (Fiqh al-Waqi'). For to the extent one occupies himself with this science, he is distracted from that science, and to the extent of his concern with that science, he turns away from this science... and so on. Perfection cannot exist, as I mentioned earlier, except through the cooperation of all these, each in his specialty, with the others. By this, and only by this, are the Sharia objectives achieved for all Muslims, and they are saved from clear loss, as the Lord of the Worlds said: (By time, indeed, mankind is in loss, except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.)",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 16
  },
  {
    "serial_number": "7517827",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Exaggeration in What is Necessary: However, what we have noticed and continue to notice is that unbridled enthusiastic emotions, which have no limits, have multiple negative effects, including exaggeration in what is necessary. The necessary duty is divided into two parts: First: The Individual Obligation (Fard Ayn), which is obligatory upon every Muslim. Second: The Collective Obligation (Fard Kifayah), which is that if some perform it, it falls off the rest. It is not permissible to make the collective obligation like the individual obligation, equal in ruling. Even if we were to say for the sake of argument: rising students of knowledge must be aware of Fiqh al-Waqi', we cannot apply this statement to the great scholars of Muslims, let alone obligate students of knowledge with the necessity of knowing reality and the jurisprudence resulting from this knowledge that gives each case its ruling.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 17
  },
  {
    "serial_number": "7517828",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "(Fiqh al-Waqi') is Not Denied: Likewise, in this case, it is not permissible for any student of knowledge to deny the necessity of this understanding of reality. This is because it is impossible to reach the achievement of the goal sought by the consensus of Muslims - which is liberation from disbelieving colonialism of Islamic lands, or at least some of them - except by knowing what they conspire with or what they agree upon, to be wary of it and warn against it, so that their colonization and enslavement of the Islamic world does not continue. Part of this can only happen by raising the youth on a creedal, scientific, methodological upbringing based on the foundation of purifying Islam from the impurities that have attached to it, and built on the rule of education upon the purified Islam as it was revealed to the heart of the Messenger (peace and blessings be upon him).",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 18
  },
  {
    "serial_number": "7517829",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Between Scholars and Rulers: Among the matters that should be mentioned here: Those who can compel the nation to what is obligatory upon it, whether individually or collectively, are not the enthusiastic orators nor the theoretical jurists. Rather, they are the rulers who hold the command, execution, and the power to bind and loose. Nor is it those enthusiastic youth or emotional preachers. The orators, scholars, and preachers must educate Muslims to accept the ruling of Islam and submit to it, then invite the rulers with what is best to what is most upright, to seek the help of jurists and scholars [for they are for the Muslims, groups and individuals, the light of the path and the beacon of the road, and upon their approach they walk], according to their varying knowledge and diverse jurisprudence: Fiqh of the Book and Sunnah, Fiqh of Language, Fiqh of Cosmic Laws, Fiqh al-Waqi'... and other important matters, implementing the great Islamic principle, the principle of Shura (consultation). On that day, matters will be set right, and the believers will rejoice in the victory of Allah. (But if they turn away, We have not sent you over them as a guardian) [Ash-Shura: 48].",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 19
  },
  {
    "serial_number": "7517830",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "The Cause of Muslims' Humiliation: It is essential here to clarify a very important matter that many overlook. I say: The cause of the Muslims remaining in their current state of humiliation and the enslavement by disbelievers - even the Jews - of some Islamic states is not the ignorance of many people of knowledge regarding Fiqh al-Waqi', nor the lack of awareness of the plots and conspiracies of the disbelievers, as is imagined.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 20
  },
  {
    "serial_number": "7517831",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Among the Mistakes of Some (Preachers): Therefore, I see that paying excessive attention to Fiqh al-Waqi', such that it becomes a methodology for preachers and youth to be raised upon, thinking it is the path of salvation, is a clear error and an obvious mistake. The matter upon which no two jurists disagree and about which no two goats would butt heads is: That the fundamental cause of the humiliation that has settled among Muslims is: First: The Muslims' ignorance of the Islam that Allah revealed to the heart of our Prophet, peace and blessings be upon him. Second: That many Muslims who know the rulings of Islam in some of their affairs do not act upon them.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 21
  },
  {
    "serial_number": "7517832",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Purification and Education (Tasfiyah wa Tarbyah): Thus: The key to the return of Islam's glory is: applying beneficial knowledge and performing righteous deeds. This is a majestic matter that Muslims cannot reach except by implementing the methodology of Purification (Tasfiyah) and Education (Tarbyah). These are two important, great duties. By the first, I mean several things: First: Purifying the Islamic creed from what is foreign to it, such as Shirk (polytheism), denial of Divine Attributes, interpreting them metaphorically, and rejecting authentic Hadiths because they relate to creed, and the like. Second: Purifying Islamic jurisprudence from erroneous ijtihads that contradict the Book and the Sunnah, and liberating minds from the shackles of blind imitation and the darkness of partisanship. Third: Purifying books of Tafsir, Fiqh, Raqa'iq (heart-softeners), and others from weak and fabricated Hadiths, Israelite narratives (Isra'iliyyat), and denounced reports (Munkarat). As for the other duty: I mean by it raising the emerging generation upon this purified Islam, free from all we mentioned, a correct Islamic upbringing from their earliest age, without any influence from the disbelieving Western education. There is no doubt that achieving these two duties requires immense, sincere efforts among all Muslims: groups and individuals, those who truly care about establishing the desired Islamic society, each in his field and specialty.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 22
  },
  {
    "serial_number": "7517833",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "The Correct Islam: Therefore, scholars who are knowledgeable of the rulings of correct Islam must care about inviting Muslims to this correct Islam, helping them understand it, and then raising them upon it, as Allah the Exalted said: (But be pious scholars/educators [Rabbaniyyin] because of what you have taught of the Scripture and because of what you have studied.) [Ali 'Imran: 79]. This is the only solution brought by the texts of the Book and the Sunnah, as in the Almighty's saying: (If you support Allah, He will support you and plant firmly your feet.) [Muhammad: 7] and many others.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 23
  },
  {
    "serial_number": "7517834",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "How Does Allah's Victory Come? It is agreed upon without dispute among Muslims, praise be to Allah, that the meaning of (If you support Allah) is: If you act upon what He commanded you: Allah will give you victory over your enemies. Among the most important texts supporting this meaning, which perfectly fits the reality we live in, describing both the disease and the cure together, is his saying (peace be upon him): ('If you transact in Einah [a type of usury], follow the tails of cows, are content with agriculture, and abandon Jihad, Allah will impose upon you a humiliation that He will not remove from you until you return to your religion') [It is referenced in my book (Silsilat al-Ahadith al-Sahihah) (No.: 11)].",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 24
  },
  {
    "serial_number": "7517835",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "The Cause of the Muslims' (Disease): Thus: The disease of Muslims today is not their ignorance of a specific science - I say this acknowledging that every science beneficial to Muslims is obligatory according to its measure - but the cause of the humiliation that has befallen Muslims is not their ignorance of this jurisprudence called today (Fiqh al-Waqi'). Rather, the cause, as stated in this authentic Hadith, is their negligence in acting upon the rulings of the religion, Book and Sunnah. His saying (peace be upon him): ('If you transact in Einah') is a reference to a type of usurious transaction involving a trick against the Sharia. His saying (peace be upon him): ('and follow the tails of cows') is a reference to preoccupation with worldly matters and relying on them, and lack of concern for the Sharia and its rulings. Similar is his saying (peace be upon him): ('and are content with agriculture'). And his saying (peace be upon him): ('and abandon Jihad') is the fruit of clinging eternally to the world, as in the Almighty's saying: (O you who have believed, what is [the matter] with you that, when you are told to go forth in the cause of Allah, you adhere heavily to the earth? Are you satisfied with the life of this world rather than the Hereafter? But what is the enjoyment of worldly life compared to the Hereafter except a [very] little.) [At-Tawbah: 38]. And his saying (peace be upon him): ('...Allah will impose upon you a humiliation that He will not remove from you until you return to your religion') contains an explicit indication that the religion which must be returned to is the one Allah Almighty mentioned in more than one noble verse, such as His saying, Glory be to Him: (This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion.) [Al-Ma'idah: 3]. In the famous comment of Imam Malik on this verse is what clarifies the intended meaning, as he said (may Allah have mercy on him): (Whatever was not religion then, cannot be religion today; and the latter part of this nation will not be rectified except by what rectified its first part).",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 25
  },
  {
    "serial_number": "7517836",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Exaggeration in (Fiqh al-Waqi'): As for those preachers who hum today around (Fiqh al-Waqi'), aggrandizing its matter and raising its status - and this is true in principle - they exaggerate in it to the point where they understand, and make others understand, perhaps unintentionally, that every scholar, indeed every student of knowledge, must be knowledgeable in this Fiqh. Yet many of these preachers know well that the concepts of this religion which our Lord Almighty chose for the nation of Islam have changed since ancient times, even regarding creed. So we find very many people testifying that (There is no deity but Allah) and performing other pillars, and they may even worship with voluntary acts of worship like night prayer and charities and the like, but they have deviated from the likes of His saying, the Exalted: (So know that there is no deity except Allah) [Muhammad: 19].",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 26
  },
  {
    "serial_number": "7517837",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Reality of (Preachers) with (Fiqh al-Waqi'): We know that many of those (preachers) share with us the knowledge of the root cause of the bad reality Muslims live in today, which is their distance from the correct understanding of Islam regarding what is obligatory upon every individual, not just what is obligatory upon some individuals. The duty is: correcting the creed, correcting the worship, and correcting the behavior. Where are those in this nation who have undertaken this Individual Obligation (Fard Ayn), not the Collective Obligation (Fard Kifayah)? Since the collective obligation comes after the individual obligation, not before it. Therefore: Preoccupation and concern with inviting the elite of the Islamic nation to care for a collective duty, namely (Fiqh al-Waqi'), while reducing interest in the Fiqh obligatory individually on every Muslim, which is (Fiqh of the Book and the Sunnah) as I indicated: is excessiveness and a waste [see previous page 14] of what is emphatically obligatory upon every individual of the Muslim nation, and an exaggeration in raising the status of a matter that is in reality no more than a collective obligation.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 27
  },
  {
    "serial_number": "7517838",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "The True Middle Statement regarding (Fiqh al-Waqi'): The matter is then as Allah the Exalted said: (And thus we have made you a just/middle community) [Al-Baqarah: 143]. So Fiqh al-Waqi' in its correct Sharia meaning is undoubtedly obligatory, but as a collective duty; if some scholars perform it, it falls off the rest of the scholars, let alone the students of knowledge, let alone the general Muslims. Therefore, there must be moderation in inviting Muslims to know (Fiqh al-Waqi'), and not drowning them in political news and analyses of Western thinkers. Rather, the duty is always and forever to hum around purifying Islam from the impurities attached to it, then raising Muslims: groups and individuals, upon this purified Islam, and connecting them to the authentic methodology of Da'wah: The Book and the Sunnah with the understanding of the Nation's Predecessors.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 28
  },
  {
    "serial_number": "7517839",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "The Obligation of Love and Loyalty: It is also obligatory upon scholars, across their various specialties, as well as the rest of the nation, to comply with the saying of their Prophet (peace and blessings be upon him): ('The likeness of the believers in their mutual love and mercy is like a single body...') [Referenced in (Al-Sahihah) (1083)]. This great Prophetic example with its wonderfully beautiful meaning cannot be realized except by the cooperation of scholars with members of society in teaching, learning, calling, and application. Thus, those who know the Fiqh of Sharia with its evidences and rulings should cooperate with those who know Fiqh al-Waqi' in its correct practical form, not theoretical. The former supply the latter with the knowledge and Fiqh they have, and the latter inform the former of what has become clear to them so they may be wary and warn others. From this sincere cooperation between scholars and preachers across their diverse specialties, what every jealous Muslim seeks can be achieved.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 29
  },
  {
    "serial_number": "7517840",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "The Danger of Defaming Scholars: As for defaming some scholars or students of knowledge, labeling them with ignorance of Fiqh al-Waqi', and accusing them of things one is ashamed to mention: this is a clear error and mistake that must not continue. It is part of the mutual hatred that many Hadiths came to forbid Muslims from, commanding them instead to its opposite: mutual love, reconciliation, and cooperation.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 30
  },
  {
    "serial_number": "7517841",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "How Do We Treat Mistakes? As for the duty of any Muslim who sees a matter in which a scholar or (preacher) has erred: it is to remind and advise him. If the error is in a confined place: the alert should be in that same place without publicizing or broadcasting it, and in the best manner for what is most upright. If the error is announced and famous, there is no harm in alerting and clarifying this error in a public manner, but as Allah the Exalted said: (Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best) [An-Nahl: 125]. It is important to clarify that the correction referred to here is not the correction based on the enthusiasm of youth and their emotions without knowledge or clear proof. No, rather what is meant is: correction based on argument, clarification, evidence, and proof. This correction in this gentle, wise form only occurs between sincere scholars and advising students of knowledge who are, in their knowledge and advocacy, upon a common word based on the Book and the Sunnah and upon the approach of the Nation's Predecessors. But if the one intended for correction is among those deviating from this Divine methodology, then he has a special treatment and a special style befitting the extent of his deviation and distance from the path of truth and correctness.",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 31
  },
  {
    "serial_number": "7517842",
    "category_id": "39",
    "category": "General Books",
    "book_title": "Fiqh al-Waqi' (Jurisprudence of Reality)",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "The Danger of Contemporary (Politics): Finally, Muslims must be informed of a very important matter in this chapter. I say: Satisfaction with Fiqh al-Waqi' in its legitimate form or preoccupation with it should not push us to enter the doors of contemporary politics whose people are unjust, being deceived by the words of politicians, repeating their methods, drowning in their ways. Rather, the duty is to proceed upon the Sharia Policy (Siyasah Shar'iyyah), which is (care for the affairs of the nation). This care cannot be except in the light of the Book and the Sunnah and upon the methodology of the Righteous Predecessors, and at the hands of those in authority among the practicing scholars and just rulers. For Allah restrains through the Sultan what He does not restrain through the Quran [See (Al-Durr Al-Manthur) (4 / 99)]. As for that Western politics that opens its doors and deceives its companions: it has no religion. Anyone who drifts behind it or drowns in its sea: its might strikes him and its hellfire hits him because he occupied himself with the branch before the root. May Allah have mercy on he who said: (Whoever rushes a thing before its time: is punished by being deprived of it). And Allah is the Grantor of success to what is right. And our final call is that all praise is due to Allah, Lord of the Worlds. [12] Question and Answer regarding Fiqh al-Waqi' by the Allamah, Sheikh al-Islam Al-Albani",
    "foot_note": "None",
    "book_id": "710",
    "new_page_number": 32
  }
]