[
  {
    "text": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba\nAuthor: أحمد بن فضلان بن العباس بن راشد ابن حماد\nYear: 310",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6865\nbook_title: رحلة ابن فضلان إلى بلاد الترك والروس والصقالبة\nbook_link: https://shamela.ws/book/11772\nbook_id: 11772\nauthor_name: أحمد بن فضلان بن العباس بن راشد ابن حماد\nauthor_year: 310\nnickname: Null\nauthor_link: https://shamela.ws/author/772\nauthor_ID: 772\neditor: Null\npublisher: دار السويدي، أبو ظبي\nedition: الأولى، 2003 م\npages: 151\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6278720",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Journeys\nBook: Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba [Slavs/Volga Bulgars]\nAuthor: Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad (Died after 310 AH)\n\nBook: Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba\nAuthor: Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad (Died after 310 AH)\n\nAuthor: Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad (Died after 310 AH)\n\n\n\n\n[Book pagination matches the printed version]\n\nAhmad ibn Fadlan\nAhmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad lived in the second half of the third century and the first half of the fourth century AH (the ninth and tenth centuries AD). There is some confusion regarding his name: Yaqut al-Hamawi referred to him as Ahmad, while his name appeared in the manuscript copy of the book in two forms, Ahmad and Muhammad. However, it seems that the name Ahmad stems from a scribe's error. He was one of the *Mawali* (clients) of the conqueror of Egypt, Muhammad ibn Sulayman al-Munfiq al-Katib, who was killed in the year 304 AH / 916 AD at the Citadel of Rayy [Iran] while fighting Ahmad ibn Ali, the brother of Muhammad ibn Ali al-Sa'luk. As for his place of birth and lineage, there is no information in this regard. The only noteworthy point is the statement of the King of the Saqaliba [Slavs/Volga Bulgars] addressing Ibn Fadlan: 'I do not know these people; I only know you, for these people are non-Arabs (*Ajam*).' Did the King know he was an Arab or that his language was Arabic, or did he address him as such out of ignorance and lack of knowledge?\n\nIbn Fadlan was not a professional traveler; rather, he traveled in the company of a group of dignitaries to the land of the Slavs on the banks of the Volga River [Russia], commissioned by the Abbasid Caliph al-Muqtadir. This occurred when the King of the Saqaliba wrote to the Caliph in the year 309 AH / 921 AD, via Abdullah ibn Bashtu al-Khazari, asking him to send someone to instruct him in religion, teach him the laws of Islam, build him a mosque, and erect a pulpit for him so that the call to prayer could be established for him in his land and all his kingdom. He also asked him to build a fortress to protect himself from kings who opposed him. Thus, Caliph al-Muqtadir sent a delegation to the King of the Saqaliba consisting of four main men and several accompanying jurists, teachers, and servants, including Ibn Fadlan. It is assumed that an ambassador sent to the ends of the earth must possess much wisdom and sophistication, and that a mission such as his required a man of reasonable culture, which is what we assume to be his case.",
    "foot_note": "None\n\nNone",
    "book_id": "11772",
    "new_page_number": 3
  },
  {
    "serial_number": "6278722",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 3,
    "volume_number": 1,
    "text": "[Book Specifications]\nJourney of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba 921\nEdited and Introduced by: Shakir Lu'aybi",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 4
  },
  {
    "serial_number": "6278723",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 4,
    "volume_number": 1,
    "text": "Series Supervisor: Nuri al-Jarrah",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 5
  },
  {
    "serial_number": "6278724",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 5,
    "volume_number": 1,
    "text": "[From the text of the Journey, p. 108]\n... «When it was time for the Asr prayer on Friday, they brought the slave girl to something they had made resembling a door frame. She placed her feet on the palms of the men and looked over that frame. She spoke some words in her language, then they brought her down. Then they lifted her up a second time, and she did as she had done the first time. Then they brought her down and lifted her up a third time, and she did as she had done the previous two times. Then they handed her a chicken; she cut off its head and threw it away, and they took the chicken and threw it into the ship. I asked the interpreter about her actions, and he said: 'She said the first time they lifted her: Behold, I see my father and my mother. And she said the second time: Behold, I see all my deceased relatives sitting. And she said the third time: Behold, I see my master sitting in Paradise, and Paradise is beautiful and green, and with him are men and boys, and he is calling me, so take me to him.' So they passed with her towards the ship. She removed two bracelets she was wearing and gave them to the woman called the Angel of Death, who is the one to kill her. She removed two anklets she was wearing and gave them to the two slave girls who were serving her, who are the daughters of the woman known as the Angel of Death. Then they lifted her onto the ship but did not bring her into the pavilion. Men came with shields and sticks and handed her a cup of *Nabidh* [fermented drink]. She sang over it and drank it. The interpreter told me: 'She is bidding farewell to her female companions with that.' Then another cup was handed to her; she took it and prolonged her singing, while the old woman urged her to drink it and enter the pavilion where her master was. I saw her become dazed. She wanted to enter the pavilion but put her head between it and the ship, so the old woman took her head and put it into the pavilion and entered with her. The men began to strike the shields with the sticks so that the sound of her screaming would not be heard, lest other slave girls become terrified and not seek death with their masters. Then six men entered the pavilion and all of them had intercourse with the slave girl. Then they laid her down beside her master. Two held her feet and two held her hands. The old woman called the Angel of Death placed a looped rope around her neck and gave it to two men to pull. She approached with a broad-bladed dagger and began thrusting it between her ribs, place after place, and withdrawing it, while the two men strangled her with the rope until she died.» From the text of the Journey, p. 108",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 6
  },
  {
    "serial_number": "6278725",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 7,
    "volume_number": 1,
    "text": "Foreword\nThis series aims to revive one of the most deep-rooted genres of writing in our Arab culture by presenting the classics of travel literature, as well as revealing unknown texts by Arab and Muslim writers and travelers who roamed the world, recorded their diaries and impressions, and conveyed images of what they saw and experienced in its regions, both near and far. This is particularly true of the past two centuries, which witnessed the birth of interest in the Western experience among the Arab cultural elites, and the attempt to get to know societies and people in the West. In reality, this Arab interest in the Other cannot be isolated from the phenomenon of Orientalism and the Orientalists who filled the paths of the East and drew images of it that would fill countless volumes, especially in English, French, German, and Italian. They did this from their powerful position on the map of the world and science, and from the standpoint of those who possess things and are prepared to promote images of an \"Arabian Nights East\" that feed the minds and imaginations of Westerners, and consequently pave the way for public opinion to accept the intellectual and military invasion of this East. Perhaps Napoleon's campaign in Egypt, with all its military and intellectual repercussions in our Arab culture, is the most complete model of this. The Arabic printing press entered Egypt towed behind the French cannon cart,",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 7
  },
  {
    "serial_number": "6278726",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 8,
    "volume_number": 1,
    "text": "to establish the colonial phenomenon in its military and intellectual aspects. However, the Western phenomenon of reading and interpreting the Other was a motive and an instigator for the Arab cultural elites who found themselves facing Western images of their societies that were new to them. This provoked a civilizational nerve in them, finding themselves, in turn, possessing the motives and reasons to set out towards the Other, searching and exploring, and returning with what they could convey, display, and say about his civilization, lifestyle, and conditions, setting examples for people. Thus, for the first time in Arab societies, a sharp intellectual conflict arose, polarizing the vital forces in society between those who supported the West, were loyal to it, and enthusiastic about its ideas and formulations, and those who were hostile to the West, rejected it, and were ready to fight it. While Western travel literature managed to stereotype the East and Easterners by drawing inferior images of them through an imagination hungry for the magical, the erotic, and the wondrous, Arab travel literature to the West and the world, as will become clear through the texts of this series, focused primarily on tracking the features of the scientific and industrial renaissance, the development of urbanization, and the manifestations of modernization represented in the evolution occurring in lifestyle, construction, sociology, and rights. Arab travelers devoted themselves to feasting their eyes on the images of modern renaissance in those societies, driven mostly by a passion for searching for the new, and by a deep, sweeping desire not only to explore out of cognitive curiosity but primarily to seek knowledge, draw inspiration from experiences, attempt to adopt the data of modern development, and trace the path of the Other to exit the state of civilizational paralysis that Arabs found themselves prey to. Here, on this turn, we find one of the primary sources establishing the Eastern view dazzled by the West and its civilization, which is the view of one aspiring to civilization and its modernity from",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 8
  },
  {
    "serial_number": "6278727",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 9,
    "volume_number": 1,
    "text": "his lower position on the margin of modern civilization, regretful of his glorious past, and yearning to return to the heart of civilizational effectiveness. One of the goals of this series of Arab travel books to the world is to reveal the nature of the awareness of the Other that was formed through travel, the ideas that leaked through the lines of the travelers, and the observations that characterized their view of countries, people, and ideas. Travel literature, in this regard, constitutes a great wealth of knowledge and a storehouse of stories, phenomena, and ideas, in addition to being engaging narrative material containing the amusing, the strange, and the astonishing captured by wandering eyes, souls reacting to what they see, and a consciousness that comprehends things, analyzes them, observes phenomena, and reflects upon them. Finally, it must be noted that this series, which may reach one hundred books, would establish, for the first time, an independent Arab library composed of rich texts revealing the Arab's determination to explore horizons and his readiness for adventure for the sake of gaining knowledge coupled with pleasure. Furthermore, it covers the inhabited world in the four corners of the earth and its five continents. It combines the pursuit of knowing the Other and his world with the search for the components of the Arab and Muslim civilizational self through those journeys undertaken by writers, thinkers, Sufis, pilgrims, scholars, and other Arab travelers throughout their Arab and Islamic lands.\n\nMohammed Ahmed Al-Suwaidi",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 9
  },
  {
    "serial_number": "6278728",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 11,
    "volume_number": 1,
    "text": "Introduction\nIf Ibn Fadlan's journey, undertaken in 921 AD, deserved exceptional attention from researchers and editors, it is because it is one of the earliest Arab journeys that have reached us. Compared to the journey of Abu Dulaf in 942 AD and the journey of Al-Maqdisi in 985-990 AD, Ibn Fadlan's journey remains occupied with a purely documentary concern more than its interest in geographical matters. It is an anthropological description centered around one specific subject from which it does not deviate, despite the brevity of the copy that has reached us. Ibn Fadlan set off on Thursday, 11 Safar 309 AH, corresponding to June 21, 921 AD, on an interesting journey commissioned by the Abbasid Caliph al-Muqtadir, from whom the Saqaliba [Slavs/Volga Bulgars] had requested aid. The outward journey took eleven months and was full of adventures, hardships, political difficulties, and openness to the culturally different Other. The Saqaliba are the inhabitants of the north of the European continent, and they used to live on the banks of the Volga River. Their capital was located near present-day Kazan [Russia], on a line parallel to the city of Moscow [Russia]. The delegation of Caliph al-Muqtadir to the King of the Saqaliba consisted of four main men and several accompanying jurists, teachers, and servants.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 10
  },
  {
    "serial_number": "6278729",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 12,
    "volume_number": 1,
    "text": "The Unique Manuscript Copy of Ibn Fadlan's Epistle:\nThe first edition of \"Risalat Ibn Fadlan\" (The Epistle of Ibn Fadlan) was published in Damascus [Syria] in 1959 by the Arabic Language Academy in Damascus, edited by Dr. Sami al-Dahan, with an extensive introduction and comprehensive explanations. Then its second edition was published by the Directorate of Revival of Arab Heritage at the Ministry of Culture and National Guidance in Syria in 1977. A third edition (labeled as the second edition!) was published in 1987 by the Universal Culture Library in Beirut [Lebanon], and this is the one we rely on in this edition of ours. Dr. al-Dahan uses a (photocopy) of Ibn Fadlan's epistle as the origin for the investigation he conducted. Here are the details of the matter: In 1924, Markwart published a study on the traveler in Leipzig [Germany]. In the same year, the Asiatic Institute of Oriental Studies in Petersburg [Russia] received two photocopied pages of the manuscript copy discovered in the Iranian city of Mashhad (Tus). The rest of the pages arrived as photocopies ten years later to the Institute. Since that same year, an article was published in Russian introducing the manuscript copy discovered in the manuscript treasury in Mashhad. In 1926, the catalog of this treasury was issued, containing a description of this copy under number 2 \"Akhbar al-Buldan\" (News of Countries) - Arabic. The manuscript was written in Naskh script, with 19 lines on each page, and consists of 212 pages, the last of which is mutilated and perforated. The first to edit the Mashhad manuscript, comment on it, and translate it was the Turkish researcher Zeki Validi Togan, who compared it with what appeared in Yaqut al-Hamawi's work and published it in Arabic letters with a German translation, printing it in 1939. In the same year, the great orientalist Krachkovsky translated it and wrote a comprehensive introduction for it. At the end of his study, he published a complete photographic copy of the epistle from the Mashhad manuscript in large size (1). Dr. al-Dahan's entire investigation relies on the basis of these photocopies published by Krachkovsky",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 11
  },
  {
    "serial_number": "6278730",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 13,
    "volume_number": 1,
    "text": "and with the help, as I reckon, of Zeki Validi Togan's Arabic-German edition.\n\nYaqut al-Hamawi Leads to Ibn Fadlan\nBefore the discovery of the Mashhad manuscript published by Dr. al-Dahan, the quotations made by Yaqut al-Hamawi in (Mu'jam al-Buldan - Dictionary of Countries) from Ibn Fadlan's journey were what led orientalists and researchers to take an interest in Ibn Fadlan, attempting to find a copy of his work, which is what they finally achieved. Dr. al-Dahan proves that al-Istakhri (2), Ibn Rusta, and al-Masudi had read Ibn Fadlan's epistle and quoted from him without stating that they had quoted from him. However, returning to these authors proves that what they mention about the Rus, the Khazars, and the Bulgars does not seem to correspond much with Ibn Fadlan's epistle except incidentally and in common informational points that could be available to any serious geographer without necessarily quoting from another. Al-Dahan mentions that Yaqut, in the seventh century, was the (first) to point to Ibn Fadlan, selecting chapters from his epistle and including them in his dictionary, declaring, that is Yaqut, in the clearest",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 12
  },
  {
    "serial_number": "6278731",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 14,
    "volume_number": 1,
    "text": "terms, that he is quoting from him, especially under the entries: Khwarazm, Bashghird [Bashkirs], Bulgar, Itil [Volga], Rus, and Khazar. Yaqut included nearly twenty pages of the epistle and left out fifteen pages, so it is as if, as Dr. al-Dahan says, he copied two-thirds of it and at least one-third remained unknown. Was Yaqut truly the first and only one to openly declare his quoting from Ibn Fadlan, as Dr. al-Dahan says and everyone follows thereafter? No. And this is one of the results of our research into Ibn Fadlan's epistle and one of the virtues of our current edition, as we shall see. Let us return to the orientalists interested in the history of the Rus and the Bulgars, and see that their interest in the year 1800 led them to publish what the Arabs said about the Rus, including al-Idrisi, al-Masudi, and Ibn Fadlan (only through what Yaqut quotes because the Mashhad copy was unknown). In 1841, the orientalist Rasmussen collected excerpts from Yaqut's chapters quoted from Ibn Fadlan and translated them into Russian, and Nicholson translated them from him into English four years later. In 1819, the German orientalist Fraehn collected Yaqut's manuscripts to extract what the latter quoted from Ibn Fadlan and published them successively starting in 1822. In 1863, Wüstenfeld published a study in German on the travels in Yaqut, including Ibn Fadlan's journey, while collecting Yaqut's manuscripts to publish Mu'jam al-Buldan. In 1899, Festberg published a study on Ibn Fadlan as well. In 1902, the orientalist von Rosen published an article in Russian about Ibn Fadlan too. In 1911, the Czech orientalist Dvorak wrote a study on Ibn Fadlan's journey published in Prague [Czech Republic], and two years later Barthold published a study in Russian on the subject of travels to Russia in Arab works. Ibn Fadlan (quoted via Yaqut al-Hamawi) was at the core of these orientalists' interests. Thus, Yaqut was a link and a means of introduction to the man before the discovery of the aforementioned Mashhad manuscript. Yaqut al-Hamawi (born 1178 AD - died 1228 AD) was a man of letters and an encyclopedist, born in the Syrian city of Hama. He is famous for his book \"Irshad al-Arib ila Ma'rifat",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 13
  },
  {
    "serial_number": "6278732",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 15,
    "volume_number": 1,
    "text": "al-Adib\" (Guidance of the Intelligent to the Knowledge of the Man of Letters), in which he collected news of writers up to his days, arranging them alphabetically and indicating who among them worked in writing, paper-selling, copying, or poetry. The book is considered a massive encyclopedia of writers. Yaqut mentioned in his introduction the many biographical books he benefited from, and the large list he mentioned indicates that he was one of the luminaries of encyclopedists in history. This is also evidenced by his authorship of the book \"Mu'jam al-Buldan\" (Dictionary of Countries), a massive geographical encyclopedia spanning several volumes, also arranged alphabetically, containing extremely diverse and rich literary, historical, and linguistic information.\n\nYaqut al-Hamawi is Not the Only One to Refer to Ibn Fadlan\nFrom that time until our day, Yaqut al-Hamawi has been considered the only compiler who quotes from Ibn Fadlan and explicitly refers to that with expressions such as: \"I read an epistle created by Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad, client of Muhammad ibn Sulayman, the messenger of al-Muqtadir Billah to the King of the Saqaliba, in which he mentioned what he witnessed from the time he left Baghdad until he returned to it\" or \"I read in the book of Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad, messenger of al-Muqtadir to the land of the Saqaliba,\" or with critical expressions regarding ideas he found in the epistle contrary to logic and reason. However, we have discovered that Yaqut is not the only one who admits to quoting and citing Ibn Fadlan. Al-Qazwini did so in his book (Athar al-Bilad wa Akhbar al-Ibad - Monuments of Lands and News of Servants) in three places in his book:\n1- \"Ibn Fadlan said in his epistle: I saw the Jayhun [Amu Darya] frozen seventeen spans thick. And Allah knows best about its authenticity.\"\n2- \"Ahmad ibn Fadlan, messenger of al-Muqtadir Billah to the King of the Saqaliba when he converted to Islam, related, saying: At the mention of Bashghird [Bashkirs], we fell into...\" etc.\n3- \"Ahmad ibn Fadlan related when al-Muqtadir Billah sent him to the King of the Saqaliba, who had converted to Islam, carrying robes of honor to him. He mentioned strange customs of the Saqaliba, including saying: We entered",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 14
  },
  {
    "serial_number": "6278733",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 16,
    "volume_number": 1,
    "text": "upon him...\" These citations are included in full in the footnotes of our current edition. Al-Qazwini is Abu Abdullah ibn Zakariya ibn Muhammad al-Qazwini; his lineage traces back to Anas ibn Malik, the scholar of Medina. He was born in Qazvin [Iran] around the year 605 AH (1184 AD) and died in 628 AH (1261 AD) [Translator's Note: Death date in source seems contradictory or a typo in original text, usually cited as 682 AH/1283 AD]. He worked in the judiciary for a while, but his work did not distract him from writing in scientific fields. He was passionate about astronomy, nature, and biology, and his most significant works were his theories in meteorology. His main work is his famous book (Aja'ib al-Makhluqat wa Ghara'ib al-Mawjudat - Marvels of Creatures and Strange Things Existing), which contains a description of the sky and what it contains of stars, bodies, and constellations, and the earth with its mountains, valleys, rivers, etc. He arranged this in precise alphabetical order. He also wrote his compilation (Athar al-Bilad wa Akhbar al-Ibad), which contains three introductions on the need to establish cities and villages, the properties of countries, and the effect of the environment on inhabitants, plants, and animals. He also presented the regions of the earth known at that time, their countries, cities, peoples, and the characteristics of each. Yaqut died in 1228 AD, while al-Qazwini died in 1261 AD, meaning there are only 33 years between them. Thus, Yaqut al-Hamawi precedes al-Qazwini by a few years. Is it permissible that al-Qazwini quoted the passages related to Ibn Fadlan from Yaqut? I deeply doubt that, because it is not at all unlikely (indeed certain) that a copy of Ibn Fadlan's book fell into his own hands due to the nature of his explicit references to Ibn Fadlan's epistle, in addition to the fact that his being a contemporary of another author working like him on the same available material and information in their eras does not negate a copy of the epistle falling into his hands. In any case, we are facing a new fact, which perhaps escaped those who treated and studied Ibn Fadlan, which is that al-Qazwini, and not Yaqut alone, used him openly as one of his references, calling him by name and admitting to quoting from him.\n\nDid Ibn Fadlan Visit the Scandinavian Countries?\nAfter the pioneering work of Dr. Sami al-Dahan, we paused, with less attention, before another book",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 15
  },
  {
    "serial_number": "6278734",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 17,
    "volume_number": 1,
    "text": "containing, in addition to the journey edited by al-Dahan, what its author considers the missing part, whose original is lost. Indeed, he seeks to present a new revelation regarding its path, claiming that the man reached Scandinavian countries. The book in question was published under the title: \"Risalat Ibn Fadlan: Envoy of the Abbasid Caliph al-Muqtadir to the Land of the Saqaliba, regarding his journey to the lands of the Turks, Khazars, Saqaliba, Rus, and Scandinavia in the tenth century AD\", collected, translated, and introduced by Dr. Haider Mohammed Ghaiba, Al-Sharika Al-Alamiya lil-Kitab S.A.L. with others, Syria 1991. In the long text of Crichton's work, which Dr. Haider Mohammed Ghaiba calls the (English Text) of the journey, Ibn Fadlan appears pushed to be a medieval knight and adventurer in the Scandinavian manner. From where did Dr. Ghaiba get this text? I will pause briefly, and at necessary length if the matter requires, to discuss this work due to the confusion and extreme levity with scientific pretension with which Dr. Haider Mohammed Ghaiba accomplished his work. Dr. Haider Mohammed Ghaiba mentions in his introduction that his wife handed him in 1984 a book in English by Mr. Michael Crichton titled: (Eaters of The Dead: The Manuscript of Ibn Fadlan Relating His Experiences With The North Men In A.D. 922), which is a book published by \"Bantam Foundation\" by agreement with Alfred A. Knopf, Inc. in 1976 (3). Published in 1976 by Alfred A. Knopf, Inc. 193 Pages.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 16
  },
  {
    "serial_number": "6278735",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 18,
    "volume_number": 1,
    "text": "It is exciting that we read on the back cover of the book, as Dr. Ghaiba quotes, the following description of the work: (Eaters of the Dead: The new terrifying novel by the author of \"The Great Train Robbery\"). This is the first indication that does not inspire confidence at all in the nature of Mr. Crichton's work, because it describes it as a (novel). However, Dr. Ghaiba, like the author Crichton himself, wants to convince readers that the work is of a reliable historical nature, beyond doubt, which is what we will discuss. The summary of the matter is that Dr. Ghaiba is convinced through his reading and translation of Crichton's book of the following two things:\nFirst: That the writer, Crichton, limited his task to collecting parts of Ibn Fadlan's epistle, translating some of them, introducing them, and commenting on them, relying in the first three chapters on Ibn Fadlan's manuscript as translated by Robert P. Blake and Richard N. Frye, and by Albert Stanburrough Cook.\nSecond: That the author Crichton relies for the rest of his work on the Norwegian translation of Ibn Fadlan's epistle made by the Norwegian professor Per Fraus-Dolus, who collected the scattered parts of the epistle (4) in different languages and translated them into Norwegian between the years 1951 and his death in 1959. From here all the ambiguities in Dr. Ghaiba's work begin. Are the first three chapters in Crichton's work those translated from the Mashhad manuscript? We do not have an answer, although the appearance of the text suggests so. And if that is the case, then no harm done to him or us, for we are again in the core of Ibn Fadlan's work that we know. But if the compilation work - which is the nerve of the other chapters - performed by the Norwegian researcher Per Fraus-Dolus is those",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 17
  },
  {
    "serial_number": "6278736",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 19,
    "volume_number": 1,
    "text": "weird and strange adventures that have no connection to the spirit of the Mashhad manuscript, then a great doubt hovers around his sources. What are his sources? Dr. Ghaiba mentions that both Crichton, author of (Eaters of the Dead), and the Norwegian researcher relied on translations of excerpts found in Yaqut's dictionary and translations of Ibn Fadlan's epistle up to the year 1951 in Arabic, Latin, French, Danish, Swedish, and English, without the Mashhad copy being among them (5). Dr. Ghaiba adds, in one of his many contradictions, that it is strange that the Mashhad copy published in Berlin with its Arabic text and German translation in 1939 was neglected. Here is a second confusion. It is clear that those translations of excerpts are nothing but the chapters Yaqut quoted from Ibn Fadlan and nothing else. Because we really know nothing else before the Mashhad manuscript except late fragments of no value in the Persian language. Dr. Ghaiba picks up a note written by Dr. Sami al-Dahan mentioning that there is a lost leaf or two from the (Mashhad) manuscript to make us believe that the long pages of adventures from Crichton's (novel) \"Eaters of the Dead: The Manuscript of Ibn Fadlan Relating His Experiences With The North Men In A.D. 922\" are what fills the place of those two leaves. This is a far-fetched injustice and a form of scientific inaccuracy, for those pages cover, in reality, dozens if not hundreds of manuscript leaves. Instead of the itinerary of the journey that we know, which suffers, in any case, from some defects due to the loss of parts of the Mashhad manuscript, Dr. Ghaiba proposes, based on the Arabic-Norwegian and English versions, the following itinerary:\nA: Outbound\n1- Lands of the Persians (Ajam) and Turks\n2- Russia",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 18
  },
  {
    "serial_number": "6278737",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 20,
    "volume_number": 1,
    "text": "3- Northern Europe and Scandinavia\nB: Inbound (Return route to Baghdad)\n1- Land of the Saqaliba\n2- Region of the Khazars\nPlacing Northern Europe and Scandinavia at the core of Ibn Fadlan's journey, which actually appears in his book (his translation of Crichton's book, i.e., the English Text), where this hypothetical journey occupies the long chapters from 5 to 16. This arrangement aims, as he himself says, to reconcile the Arabic and English texts. But what if Crichton's English text is merely beautiful fantasies penned by a skilled novelist? This is what Dr. Ghaiba does not answer, although he himself raises doubts about the credibility of the English text here and there, forgetting his enthusiasm for it. If we leave aside Dr. Ghaiba's introduction and turn to Crichton's introduction, scientific and historical research mixes with the novelist's imagination. In a long section titled (Source of the Manuscript), we do not know whether he is speaking again about the works of orientalists translating the chapters of Ibn Fadlan's epistle transmitted to us by Yaqut, or about an original manuscript by Ibn Fadlan. This confusion is indeed dizzying. Were it not for space constraints and fear of prolongation, we would have discussed every paragraph of this section. I will stop at only some of them: After Crichton speaks about the sections of Ibn Fadlan's epistle in Yaqut's dictionary translated repeatedly, he tells us suddenly: \"Another fragment was discovered in Russia in 1817 and was published in German by the Academy of St. Petersburg in 1823. It includes certain passages previously published by J.L. Rasmussen in 1814. Rasmussen worked from a manuscript he found in Copenhagen, which has since been lost, and from other dubious sources. Swedish, French, and English translations also appeared at that time, but they were known for their inaccuracy and apparent lack of new material.\" One of the references in this section points to the two photocopied leaves from the manuscript copy discovered in the Iranian city of Mashhad (Tus) which were received by the Asiatic Institute of Oriental Studies in Petersburg, whereas",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 19
  },
  {
    "serial_number": "6278738",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 21,
    "volume_number": 1,
    "text": "the Copenhagen manuscript, as Crichton himself says, is dubious, and the translations he mentions are inaccurate and add nothing new. Immediately after that, he says: \"Two new manuscripts were discovered in 1878 in the private antiquities collection of the former British ambassador in Constantinople, Sir John Emerson... One of them is by Ahmad Tusi and dates reliably to 1047 AD. This makes it closer to the original Ibn Fadlan manuscript... However, scholars consider the Tusi manuscript less reliable than all sources, and many authors hesitate to accept his works due to the abundance of apparent errors and contradictions, although he quotes lengthy excerpts from Ibn al-Faqih who visited the North country.\" This source, according to Crichton himself, is also dubious, and does not seem at all to be conveying a text by Ibn Fadlan but rather collecting stories about the North country from different authors (Ibn al-Faqih for example, as Crichton himself says). Here Crichton appears to be confusing things most severely despite his outwardly confident tone. Then he goes on to say about the sources of his manuscripts: \"The date of the second manuscript by Amin Razi falls between 1585 and 1595 AD. It was written in Latin and translated directly from the Arabic text of the Ibn Fadlan manuscript, as its author claims. The Razi manuscript contains some texts about the Oguz Turks and several passages about battles with the 'mist monsters' which were not mentioned in other sources.\" Here one needs a little clear-mindedness to distinguish the meanings of the words in the text of the novelist Crichton, which is that Razi quotes (only passages from Ibn Fadlan's text). This is also what Dr. al-Dahan says in a footnote of his which we cited in our work: \"As for the book (Haft Iqlim - Seven Climes) by Razi, the detail increases the importance of the text, and he quoted from a manuscript of Ibn Fadlan that was lost.\" Crichton's text itself suggests that Razi's text deals with a number of issues and does not relate to Ibn Fadlan's epistle alone. There is, then, a new confusion. The rest of Crichton's investigations are of the same logic: all the originals he relies on are dubious or speak of the North country based on multiple sources, especially Latin ones, and not from a single unique source which is Ibn Fadlan. Perhaps Crichton's sources mentioned Ibn Fadlan casually or via another author quoting him, but they are absolutely not another original manuscript",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 20
  },
  {
    "serial_number": "6278739",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 22,
    "volume_number": 1,
    "text": "of the Arab traveler's epistle other than the one we know, although Crichton wants to imply, in a twisted style, that his work is based on one of its manuscripts. In this suggestion lies a brilliant fictional game that has no connection to solid research. This is what Crichton does with supreme skill that confused Dr. Ghaiba and others from university professors (like Dr. Abdullah Ibrahim) until they deemed his words accurate, scientific, and documented. Let us say a word at the beginning about the novelist: He is the American (John) Michael Crichton, a novelist and filmmaker born in 1942. He finished his studies at Harvard University, then moved between studying anthropology and biology, and finally dedicated himself to writing. He published many literary studies and wrote many screenplays, some of which he directed or produced himself. He also wrote many fictional novels or novels derived from historical material, some of which were bestsellers in America: (The Andromeda Strain - 1969), (The Terminal Man - 1972), (The Great Train Robbery - 1975), the novel that concerns us here (Eaters of the Dead - 1976), (Congo - 1980), (Sphere - 1987), (Jurassic Park - 1990), (Rising Sun - 1992), (Disclosure - 1993), (The Lost World - 1995), (Airframe - 1996), (Timeline - 1999), and others (6). Crichton writes a historical novel, no more, no less, and points to that on the second cover of his book. It is a historical fiction novel in the style of Amin Maalouf's novels (Leo the African, for example). But unlike Maalouf, who cares greatly about historical details and formulates according to an imaginative narrative plan, Crichton collects very few details inspired casually about his hero Ibn Fadlan, and formulates the rest entirely according to a completely fabricated narrative plan. However, he uses an amazing fictional trick, which is writing a semi-serious introductory introduction",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 21
  },
  {
    "serial_number": "6278740",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 23,
    "volume_number": 1,
    "text": "about Ibn Fadlan, enumerating his sources in a very ambiguous way that suggests he is in the heart of a historical work. He also places many footnotes in the folds of his text explaining an Islamic ritual or tradition, giving the reading a new dimension that intentionally seeks to blur the boundaries between the imagined and the real. This beautiful, but dangerous, trick seeks an inescapable fusion between truth and fiction, suggesting to readers that they are in the heart of a historical event that he has done nothing but convey to them (which unfortunately Crichton has not said the contrary of until this moment). A Hollywood novelist's trick of a high caliber. But this trick was not lost on his more serious American critics who described the work in the press as: \"A fictionalized account taken from the manuscript of an Arabic ambassador to the court of the Caliph of Baghdad\" (7).\nThe novelist's works are, in the words of American critic David Lonergan:\n\"The paper chronicles the variety of means with which the novelist Michael Crichton has attempted to give his works the appearance of nonfiction. The specific and successful techniques utilized in Eaters of the Dead are noted, and the resulting erroneous classifications by the Library of Congress and subsequent cataloguers discussed.\"\nBut the trick escaped others among them, those who are deeply ignorant of our history",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 22
  },
  {
    "serial_number": "6278741",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 24,
    "volume_number": 1,
    "text": "Arabo-Islamic (8). Dr. Ghaiba translated Crichton's fictional novel and gave us the opportunity to view it, believing that he was translating a historical document. And there is a vast difference between the two. Ibn Fadlan appears in the novel as one of the main characters, but he is a hero who carries all the negative traits that some Western thought has ceaselessly attached to Arabs. Ibn Fadlan in it is a symbol of the Arab (Crichton does not know that the man was a client (Mawla)! And how could he know). He is cowardly to the extreme, possesses no sense of humor, constantly scolded for his rude interference in what does not concern him, trembling with fear (9) and \"does not want to be a hero,\" rigid in his religiosity at first then contradictory to his religious beliefs. Stupid, does not know how to swim, amazed by the greenery of forests that his desert does not know. In contrast, the Northmen, the Vikings, appear, and by the words of the narrator Ibn Fadlan himself, as tough, fearing nothing, daring and brave to the degree that Ibn Fadlan seems among them a trivial rat hiding in his hole, and at best, enjoyable exotic decor. There is extreme mockery and degradation of Arabs in Crichton's work and rude ridicule of their monotheistic religious tendency (10), which calls for astonishment and a great question mark regarding the nature of Dr. Ghaiba's thinking, who considered the work historical documentation, and further astonishment at the work of the critic Dr. Abdullah Ibrahim, who went on analyzing with methodological enthusiasm the (mechanisms of narration) in Crichton's personal blasphemies and his mockery of Arabs, considering them an original text by Ibn Fadlan. Is it not a great wonder that such bitter mockery, glaring with its condescending signals, escaped pens like the pens of these two virtuous doctors.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 23
  },
  {
    "serial_number": "6278742",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 25,
    "volume_number": 1,
    "text": "Here are these passages: \"Your hearts (O Arabs) are a large bag overflowing with reasons\" (11) mocking the rational tendency among Arabs. \"You Arabs are stupider than can be imagined\" (12). \"I do not want to hear questions from a fool\" (13) meaning from an Arab. \"If he wasn't bewitched, he might have become an Arab since he washes his underclothes and body every day\" (14) mocking the tendency for constant cleanliness and purity among Muslims. And he said to the slave girl: \"He is still an Arab\" (15) due to Crichton's hero Ibn Fadlan groaning after his wounds were washed with salt water by a Northern girl. In Crichton's novel, Ibn Fadlan speaks Latin and communicates in it, and here is a matter Dr. Ghaiba should have paused before at length, but he did not. However, facing the growth and escalation of the severity of contradictions and signs confirming that the work is fabricated as a novel, he was forced to pause and question a few times. In his comment on what appeared in the novel about Ibn Fadlan passing by and seeing the city of Bulgar from the deck of his boat from afar, Dr. Ghaiba says: \"If Ibn Fadlan knows nothing about this city until now, this contradicts the belief that he visited Bulgar, the King of the Saqaliba, before visiting the rest of the lands of the Rus and Northern Europe. And if his visit to the land of the Saqaliba was after his return from the North country, it conflicts with his meeting his companions in the land of the Saqaliba without any introduction or reference to their reunion, unless his talk about that is from the mutilated parts that have not been found until now, as we hinted in",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 24
  },
  {
    "serial_number": "6278743",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 26,
    "volume_number": 1,
    "text": "the introduction\" (16). In another footnote by Dr. Ghaiba regarding Ibn Fadlan's amazed comment on the existence of huge marine animals which the novelist calls on his tongue sea monsters, Dr. Ghaiba says: \"It is clear that the sea monsters Ibn Fadlan spoke about are whales. However, it is strange that he is ignorant of their existence in the sea\" (17). And when the novelist makes him engage in sex with a woman, following the unlimited lust of the Northerners, Dr. Ghaiba comments with some naivety: \"It is difficult to explain this confession by Ibn Fadlan, being the pious Muslim, unless the slave girl was a bondmaid owned by him, considering enjoyment of such was permissible, or that he lost some of his piety (...) or that humans sometimes weaken before temptation\" (18). But the virtuous doctor declares openly after a few pages his high doubts about Crichton's text, writing at the bottom of the page: \"These statements and some following phrases increase the doubt about the authenticity of the text, that doubt which intensifies particularly with some phrases of the ninth chapter that betray modern pedantry and culture\" (19). Why didn't Dr. Haider Mohammed Ghaiba doubt the authenticity of the text from the start? And why did he write a lengthy analysis in his introduction presenting Crichton's work as if it were a real historical continuation of Ibn Fadlan's journey? And why did Dr. Abdullah Ibrahim consider the text originally by Ibn Fadlan, despite a vague reference by him to the lack of authenticity of only some passages (see the footnote below)? There is a devastating defect in the current Arab culture expressed by the example of these two doctors who ought to",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 25
  },
  {
    "serial_number": "6278744",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 27,
    "volume_number": 1,
    "text": "teach us, they before others, methodological caution: one of the conditions of scientific research (20). What is worse is that the author himself, Crichton, as noted by a French observer, wants today to exclude this work from the collection of his works (21) (see also what American critic Danny Yee wrote in this same direction) (22). Why? Because the historical introduction he wrote confidently as being based on reliable historical data appears not based on anything reliable, and he perhaps fears a cultural scandal, especially since he did not read, as is clear, the text of the Mashhad manuscript translated repeatedly into several languages, English being at the forefront. He writes pure fantasy which was actually produced later, in 1999, as a cinematic adventure film in the American style under the title \"The 13th Warrior\" (1999) (he was a partner in its production).",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 26
  },
  {
    "serial_number": "6278745",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 28,
    "volume_number": 1,
    "text": "If we are discussing what Dr. Ghaiba did at this length, it is because his deed is harmful and detrimental to the right of Ibn Fadlan's journey, and because this deed might circulate among readers, let alone doctors like the virtuous Dr. Abdullah Ibrahim, as irrefutable historical facts. A not insignificant part of Dr. Ibrahim's serious and rigorous analysis relies, oh wonder, on this imagined fictional work. Let us read: \"Writing plays an important role in establishing his visions (meaning Ibn Fadlan), conceptions, and judgments, as long as he moves in his cultural sphere, inside the Abode of Islam. Once he slips into the world of the infidels, writing stops. That main part concerning the Other is lost from the manuscript. As if a magical force snatched away everything related to the Other. The Arabic original has not been found until now. Everything related to the Other was restored, collected, and translated into Arabic based on fragments scattered in Latin, German, French, Danish, Swedish, English, and other languages. The languages of the Other are what returned to us Ibn Fadlan's point of view on the Other.\" Of course, Dr. Ibrahim's reference to those languages is a reference to Crichton's Hollywood novel. Is there someone laughing at our beards: there with sarcastic writing about one of our travelers, and here with writing no less sarcastic and bitter but with the mask of a knower only. Dr. Abdullah Ibrahim will end up doubting Yaqut himself who could not, according to Ibrahim, believe Ibn Fadlan's text about the Scandinavian countries, so he deleted it (23)? He reclaims",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 27
  },
  {
    "serial_number": "6278746",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 29,
    "volume_number": 1,
    "text": "Dr. Ibrahim reclaims the text deleted by Crichton, of course. And he goes into a long analysis about the (absence of the text). Except that the text is not lost, by Allah, for the long pages offered by the Mashhad manuscript are a (certain text), deserving contemplation and examination despite its brevity and the loss of some of its leaves. We are not surprised that readers stand in a position of wonder at this pattern of brilliant pseudo-intellectual discourse.\n\nWho is Ibn Fadlan?\nIbn Fadlan fortunately established his name: Ahmad ibn Fadlan ibn al-Abbas ibn Rashid ibn Hammad, and told us nothing else about his life, except that he, as the epistle says, was a client of the conqueror of Egypt, Muhammad ibn Sulayman. Yaqut says he was a client of Muhammad ibn Sulayman then a client of the Commander of the Faithful, so he is of the non-Arab clients (Mawali). Was he born in Iraq or in the land of the Persians? And what was his position in the Abbasid administration? Did he write literary works other than this epistle? Or is his journey nothing more than a report among these reports written by ambassadors to their states?",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 28
  },
  {
    "serial_number": "6278747",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 30,
    "volume_number": 1,
    "text": "It occurs to us that an ambassador sent to the ends of the earth must have possessed much wisdom and sophistication, so we think he was in his forties when commissioned with his mission. It also occurs to us that a mission like his required a man of reasonable culture, which is what we assume his condition to be, and this is indicated by his deliberate description of the countries and traditions he witnessed with his own eyes. We believe that his appearance and attire were extremely dignified, and that he was chosen to meet the kings of the Saqaliba, the Khazars, and the Rus because his appearance was acceptable to them and close to the appearances of the peoples he visited. No documentation of Ibn Fadlan's life appeared in any of the references in our hands, exactly just as there are only the fewest details about the life of al-Maqdisi, author of the brilliant \"Ahsan al-Taqasim fi Ma'rifat al-Aqalim,\" nor the life of the traveler Abu Dulaf. In that, there is a clear indication now of the indifference that characterized Arab culture's view of the works of Arab travelers, and the lack of consideration for writing in travel literature as a high-level art deserving of listing its authors among the authors of other genres of literature who are revered and chronicled with the most and most accurate details (jurists, poets, doctors, grammarians, etc.). The importance of Ibn Fadlan's journey lies in the fact that it provides world history with important fragments about the lifestyles of peoples rarely recorded. It fills a historical gap in this field and is considered a pioneer in referring to the history of Serbian [sic; likely means Slavic/Northern] peoples, and the Rus among them in particular. Much has been said about this journey, and it has been translated more than once into all major languages in the world today. We wish here to point out two things:\n1- The relationship of Arabs with the Other: The relationship of the Arab world, or at least the culture of Arabic speakers - Arabs and non-Arabs who used Arabic in a civilization where this language was something sublime and essential - does not appear as alienated as it is today with the Other, which is what Ibn Fadlan's journey proves. The axiomatic difference between the Self and the Other did not escalate to the level described in the writings of some contemporary Arab researchers who describe the relationship with other civilizations with the logic of caution and suspicion. Indeed, a final and absolute binary between the (Abode of Islam) and the (Abode of Disbelief) did not",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 29
  },
  {
    "serial_number": "6278748",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 31,
    "volume_number": 1,
    "text": "It operates in practical reality just as it operates on the purely theoretical level, like many other prevailing concepts. This is proven by the large-scale migration of Indian geographers and astronomers, Chinese potters, and others, all coming from the Abode of Disbelief (India) and (China) to reside in (Dar al-Islam), Abbasid Baghdad [Iraq]. We can now list dozens of their names. The scheme upon which some build their contemporary analyses regarding this duality remains of a purely fabricated nature. On the contrary, Ibn Fadlan and his companions appear in a position of confidence, to the degree that he would command and forbid the King of the Saqaliba [Volga Bulgars] himself: \"So I began and read the beginning of the letter. When I reached 'Peace be upon you, for I praise to you Allah, other than Whom there is no god,' I said: 'Return the greeting to the Commander of the Faithful.' So he replied, and they all replied entirely.\" This confidence comes from the entrenchment and strength of the Islamic civilization in the ancient world. Just as the American today does not feel intimidated by the presence of the other, the Arab and the Muslim did not suffer from this feeling. 2- The migration of labor follows centers of wealth: The great rich capitals, in moments of civilizational prosperity, become stations for comers from various parts of the world searching for a livelihood. The accumulation of wealth in a certain spot means, among other things, that those capitals have become a home for the accumulation of large quantities of gold. This is what we see in the capitals of the earth today: France, Germany, the United States of America, Switzerland, etc., which attract more immigrants of various specializations. The general rule in economic history is that the migration of labor follows the centers of gold movement: the symbol of wealth. This is the case of Baghdad [Iraq] in the prosperous Abbasid eras, whose situation was exactly similar to the wealthy capitals in our current time. It resembles it exactly even in the most minute details. The presence of communities and markets for foreign communities like Indians, Chinese, and Arabs in France and New York today had a counterpart in (Souq Khudr) for sellers and makers of ceramics and Chinese pottery in Abbasid Baghdad, and in the increasing numbers of Indians working in the fields of astrology and mathematics, and Byzantines working in the fields of...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 30
  },
  {
    "serial_number": "6278749",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 32,
    "volume_number": 1,
    "text": "...precision industries like the astrolabe (such as Bastulus mentioned by Ibn al-Nadim), not to mention the decorators and calligraphers (such as Yaqut al-Musta'simi al-Rumi, the Byzantine). There was also, as we know, an increasing need for translators, not only from those who transferred the books of other nations into Arabic but from those who played the role of diplomatic ambassadors between the Islamic Empire and the neighboring states. Thus, various languages, traditions, and peoples flocked to the capital and resided in Baghdad [Iraq] in search of a livelihood. This explains to us a fundamental element of Ibn Fadlan's journey which concerns us here, namely that it was formed of a delegation consisting of four persons (24): 1- Susan al-Rassi, whose surname al-Rassi suggests he was from the lands of the Rus. 2- Baris al-Saqlabi, and his name clearly indicates that he was Slavic. 3- Takin al-Turki: He is a Turk without a doubt, fluent in the languages of the Turks through whose lands the delegation passes on its way to the Volga, and he used to work as a blacksmith in Khwarazm. 4- Ahmad ibn Fadlan, who was the head of the delegation and was ignorant of foreign languages as he says himself; however, he was not an Arab at all, but rather one of the Mawali (clients/freedmen), and perhaps he was of Persian origin. He was a Mawla of Muhammad ibn Sulayman ibn al-Munfiq Abu Ali the Scribe, who conquered Egypt, dispersed the Tulunids, entered it in the year 292 AH, and was killed in the year 304 AH. However, being a Mawla does not mean, as we see, that he mastered Arabic alone, despite his deep knowledge of it, and perhaps he mastered the language of his ancestors. Ibn Fadlan does not emerge as a main hero (25) in the journey except because he simply wrote the journey, and he did not obscure his other companions for any deliberate or calculated reason. Quite the opposite; were it not for his journey, we would not have known any fragment about them. His writing of the journey, mostly, was not done to build a literary glory for himself, nor to restore consideration for himself as some say, especially since we do not know of another work by him other than it. He was a mere ambassador who recorded for us valuable notes...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 31
  },
  {
    "serial_number": "6278750",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 33,
    "volume_number": 1,
    "text": "...about what he witnessed, some of which is quite accurate and others less so. Reading Ibn Fadlan gives a pleasure that one rarely meets in a work of the same literary genre, for reasons the reader will discover alone when he starts reading the work. What path did Ibn Fadlan chart? If we track the places and cities mentioned by Ibn Fadlan, we will record that the path of the journey as it is in our hands now is the lands of: The Persians and Turks - The Saqaliba - The Rus - The Khazars. This path has sparked much debate, as it was necessary to talk about the land of the Khazars before talking about the Rus because the road to the Rus passes first through the Khazars. Was something lost from the manuscript, as Dr. Al-Dahan says? Or was Ibn Fadlan himself not interested in recording the affairs of the Rus and Khazars as much as his interest in the Saqaliba, the goal of his journey, and thus he recorded his impressions haphazardly about those two countries? Or does the Mashhad manuscript itself suffer from a logical defect due to its copyist or damage to a part of it? If this hypothesis is correct, was the copy that fell into the hands of Yaqut also suffering from the same defect? I do not think so, and in my certainty, Ibn Fadlan wrote the manuscript in this form that we know, inserting impressions and stories he saw or heard in the two concerned countries. He absolutely did not visit the Scandinavian countries as the Hollywood writer Crichton claims, and likewise Dr. Ghayba, and followed by Dr. Abdullah Ibrahim in a hurry unbecoming of culture. Had he done so and visited them, those who quoted him would have transmitted a small fragment, I mean Yaqut and Al-Qazwini, especially the latter who was fond of oddities of every kind. Migration of labor follows centers of wealth: A latent conflict as a necessary cause, and a final existential contradiction between the Self and the Other, did not exist. Instead, there was much openness, and this openness was rather...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 32
  },
  {
    "serial_number": "6278751",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 34,
    "volume_number": 1,
    "text": "...the necessary cause and the internal engine for any civilization in its moments of prosperity. The vocabulary of the Abbasid kitchen expresses this openness best, as we rarely meet in it a totally authentic local dish. The vocabulary of the Indian kitchen mixed with the Persian and the Arabic in the strongest mixture. Everyone eats at everyone's table in the same banquet, albeit with real difficulties in some cases, of course. Some take these natural difficulties as a basis to interpret the relationship between the Self and the Other with much arbitrariness. Except that the communities and cultures of the ancient world, the more and less developed, suffered from withdrawals into the self for reasons including the narrow space of contact and the difficulty of transportation. The problem of identity in its current sense was not raised (the idea of identity in this sense is a contemporary cultural invention), and perhaps something similar to it was present for reasons related to the kinship system, land inheritances, and the economic system of a group seeking to achieve self-sufficiency. The Other is distant in geography, so he is mysterious, unknown, magical, and a home for myths. This type of declaring (strangeness) about the Other was what was dominant, not those questions of a complex intellectual nature about the relationship of the Self to the Other. The more the Other struck into the distant and unknown, the more the pace of inaccurate tales about him escalated. This self-evident reason has no necessary kinship with the problems of ideology: (Dar al-Kufr / Abode of Disbelief) and (Dar al-Islam / Abode of Islam). An amazing openness, reaching the degree of respect for the different others, governed the relationship of Dar al-Islam with the ancient pagan civilizations, especially the Indian and Chinese (which is explained by Dr. Aziz Al-Azmeh in one of his books \"The Arabs and the Barbarians\"). The Self is in fact multiple and the Other is integrated into it, which is proven by the nature of the delegation accompanying Ibn Fadlan. Shakir Lu'aybi, Abu Dhabi [United Arab Emirates], September 12, 2002.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 33
  },
  {
    "serial_number": "6278752",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 35,
    "volume_number": 1,
    "text": "Route of the Journey: Baghdad [Iraq] - Al-Nahrawan - Al-Daskarah - Hulwan - Qirmisin [Kermanshah, Iran] - Hamadhan [Hamadan, Iran] - Sawah [Saveh, Iran] - Al-Rayy (near Tehran today) [Iran] - Khuwar Al-Rayy - Semnan [Iran] - Al-Damghan [Iran] - Nishapur [Neyshabur, Iran] - Sarakhs [Iran/Turkmenistan] - Merv [Mary, Turkmenistan] - Qushmahan - Amul [Turkmenabat, Turkmenistan].",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 34
  },
  {
    "serial_number": "6278753",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 36,
    "volume_number": 1,
    "text": "Afrir - Baykand - Bukhara [Uzbekistan] - Khwarazm - Al-Jurjaniyah [Konye-Urgench, Turkmenistan] - Jit - Land of the Saqaliba [Volga Bulgars] - Al-Rusiyyah - Al-Khazar.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 35
  },
  {
    "serial_number": "6278754",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 37,
    "volume_number": 1,
    "text": "Text of the Journey. Ahmad ibn Fadlan said: When the letter of Almish ibn Yiltawar (1), King of the Saqaliba (2), arrived...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 36
  },
  {
    "serial_number": "6278755",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 39,
    "volume_number": 1,
    "text": "...to the Commander of the Faithful Al-Muqtadir (3), asking him therein to send to him someone who would instruct him in religion (4), make known to him the laws of Islam, build a mosque for him, and erect a pulpit for him to establish the call for him [the Caliph] in his city and all his kingdom, and asking him to build a fortress in which he could fortify himself against the kings opposing him. So his request for that was answered. His ambassador was Nadhir al-Halami (5), and I was assigned to read the letter to him, hand over what was gifted...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 37
  },
  {
    "serial_number": "6278756",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 40,
    "volume_number": 1,
    "text": "...to him, and supervise the jurists and teachers (6). The money carried to him for the construction of what we mentioned and for the salaries (8) of the jurists and teachers was arranged (7) from the estate known as Arthakhshamthin (9) in...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 38
  },
  {
    "serial_number": "6278757",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 41,
    "volume_number": 1,
    "text": "...the land of Khwarazm (10), from the estates of Ibn al-Furat (11).",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 39
  },
  {
    "serial_number": "6278758",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 42,
    "volume_number": 1,
    "text": "The messenger (12) to Al-Muqtadir from the ruler of the Saqaliba was a man called Abdullah ibn Bashtu al-Khazari (13). The messenger from the Sultan (14) was Susan al-Rassi (15), the Mawla of Nadhir al-Halami (16), along with Takin al-Turki, Baris al-Saqlabi (17), and myself with them as I mentioned. So I handed over the gifts to him, his wife, his children, his brothers, and his commanders, as well as medicines he had written to Nadhir requesting (18).",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 40
  },
  {
    "serial_number": "6278759",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 43,
    "volume_number": 1,
    "text": "The Persians and Turks. So we departed from the City of Peace [Baghdad, Iraq] (19) on Thursday, when eleven nights had passed of Safar in the year three hundred and nine (20). We stayed at Al-Nahrawan (21) for one day, and departed diligently (22) until we reached Al-Daskarah (23), where we stayed for three days. Then we departed aiming straight, not twisting for anything, until we came to Hulwan (24), where we stayed for two days. We traveled from there to Qirmisin [Kermanshah, Iran] (25) and stayed there for two days. Then we departed and traveled until we arrived at Hamadhan [Hamadan, Iran] (26) and stayed there for three days. Then we traveled until we reached Sawah [Saveh, Iran] (27) and stayed there for two days, and from there to Al-Rayy [Tehran, Iran] (28) and stayed there...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 41
  },
  {
    "serial_number": "6278760",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 44,
    "volume_number": 1,
    "text": "...eleven days waiting for Ahmad ibn Ali, the brother of Su'luk (29), because he was in Khuwar Al-Rayy (30). Then we departed to Khuwar Al-Rayy and stayed there for three days. Then we departed to Semnan [Iran] (31), then from there to Al-Damghan [Iran] (32). We encountered Ibn Qarin (33) there on behalf of the Da'i (34), so we disguised ourselves in the caravan...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 42
  },
  {
    "serial_number": "6278761",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 45,
    "volume_number": 1,
    "text": "...and traveled diligently until we reached Nishapur [Neyshabur, Iran] (35). Layla bin Nu'man (36) had already been killed. We found there (37) Hamawayh Kusa, the commander of the army of Khorasan (38). Then we departed to Sarakhs [Iran/Turkmenistan] (39), then from there to Merv [Mary, Turkmenistan] (40), then from there to Qushmahan (41), which is the edge of the desert of Amul [Turkmenabat, Turkmenistan] (42). We stayed there for three days resting the camels for entering the desert. Then we crossed the desert to Amul, then we crossed the Jayhun [Amu Darya] (43) and came to Afrir (44), the Ribat of Tahir bin Ali (45).",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 43
  },
  {
    "serial_number": "6278762",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 46,
    "volume_number": 1,
    "text": "Then we departed to Baykand (46), then we entered Bukhara [Uzbekistan] (47) and went (48) to Al-Jayhani (49), who was the secretary of the Amir of Khorasan, and he is called in Khorasan 'The Elder Support' (Al-Shaykh al-Amid). He ordered a house to be taken for us and appointed a man to fulfill our needs and remove our difficulties (50) in everything we wanted, so we stayed for days. Then he sought permission for us to enter upon Nasr bin Ahmad (51), so we entered upon him, and he was a beardless boy. We greeted him with the title of Amir, and he ordered us to sit. The first thing he began with us was that he said: \"How did you leave my master the Commander of the Faithful? May Allah prolong his remaining and his safety in himself, his young men, and his allies?\" We said: \"In good health.\" He said: \"May Allah increase him in goodness.\" Then the letter was read to him regarding the handover of Arthakhshamthin (52) from Al-Fadl bin Musa the Christian (53), the agent of Ibn al-Furat (54), and handing it over to Ahmad ibn Musa al-Khwarazmi (55), and sending us and the letter...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 44
  },
  {
    "serial_number": "6278763",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 47,
    "volume_number": 1,
    "text": "...to his agent in Khwarazm to leave the property (56) for us, and the letter to the Gate of the Turks to escort us (57) and leave the property for us. He said: \"And where is Ahmad ibn Musa?\" We said: \"We left him in the City of Peace [Baghdad] to come out after us in five days.\" He said: \"Hearing and obedience to what my master the Commander of the Faithful, may Allah prolong his remaining, commanded.\" He said: The news reached Al-Fadl bin Musa the Christian, the agent of Ibn al-Furat, so he devised a trick in the matter of Ahmad ibn Musa. He wrote to the officials of the Ma'awin (police/security) (58) on the road of Khorasan from the army of Sarakhs to Baykand: \"Set spies (59) on Ahmad ibn Musa al-Khwarazmi in the Khans (inns) (60) and observation posts (61), and he is a man of such description and trait. Whoever finds him, let him detain him until our letter returns to him regarding the inquiry.\" So he was seized in Merv and detained. We stayed in Bukhara for twenty-eight days. Al-Fadl bin Musa had also conspired with Abdullah ibn Bashtu and others of our companions to say: \"If we stay, winter will attack and we will miss the entry, and Ahmad ibn Musa, when he arrives, will catch up with us.\" He said (62): I saw dirhams in Bukhara of various colors. Among them were dirhams called Al-Ghitrifiyyah (63): they are of copper, alloy (64), and brass, taken by number without weight; one hundred of them for a silver dirham. And if...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 45
  },
  {
    "serial_number": "6278764",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 48,
    "volume_number": 1,
    "text": "...their conditions regarding the dowries of their women: 'So-and-so son of So-and-so married So-and-so daughter of So-and-so for such and such thousand Ghitrifiyyah dirhams.' Likewise is the purchase of their real estate and the purchase of their slaves; they do not mention other dirhams. They have other dirhams of brass alone, forty of them for a Daniq. They also have brass dirhams called Al-Samarqandiyyah (65), six of them for a Daniq. When I heard the speech of Abdullah ibn Bashtu and the speech of others warning me of the attack of winter, we departed from Bukhara returning to the river. We rented a boat to Khwarazm, and the distance to it from the place where we rented the boat is more than two hundred farsakhs (66). We used to travel part of the day, and its travel was not smooth for us at all due to the cold and its severity, until we arrived at Khwarazm. We entered upon its Amir, Muhammad ibn Iraq Khwarazm Shah (67). He honored us, brought us close, and lodged us in a house. After three days, he summoned us and debated with us (68) regarding entering the land of the Turks. He said: \"I do not permit you to do that, and it is not lawful for me to let you risk (69) your blood. I know it is a trick orchestrated by this boy,\" meaning Takin (70), \"because he was a blacksmith with us and has known (71) the sale of iron in the land of the disbelievers (72). He is the one who deceived (73) Nadhir and induced him to speak to the Commander of the Faithful (74) and deliver the letter of the King of the Saqaliba...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 46
  },
  {
    "serial_number": "6278765",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 49,
    "volume_number": 1,
    "text": "...to him. The Grand Amir,\" meaning the Amir of Khorasan, \"was more entitled to establish the call for the Commander of the Faithful in that country if he found a way (75). Furthermore, between you and this country you mention are a thousand tribes of disbelievers. This is a deception (76) of the Sultan, and I have advised you. It is necessary to write to the Grand Amir so that he may consult the Sultan, may Allah support him, regarding the correspondence, and you shall stay until the answer returns.\" So we left him that day, then we returned to him and ceased not to be gentle with him and say: \"This is the command of the Commander of the Faithful and his letter, so what is the reason for consultation regarding it?\" until he permitted us. So we descended from Khwarazm to Al-Jurjaniyah [Konye-Urgench, Turkmenistan] (77). Between it and Khwarazm by water is fifty farsakhs. I saw the dirhams of Khwarazm were counterfeit, lead, spurious (78), and brass. They call the dirham Tazajah (79), and its weight is four and a half Daniqs. The moneychanger among them sells dice (80), spinning tops (81), and dirhams. They are the most barbaric people in speech and nature; their speech is most like the clamor of starlings. It has a village...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 47
  },
  {
    "serial_number": "6278766",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 50,
    "volume_number": 1,
    "text": "...at a day's distance called Ar-Daku (82). Its people are called Al-Kardaliyah (83). Their speech is most like the croaking of frogs. They renounce the Commander of the Faithful Ali bin Abi Talib (84), may Allah be pleased with him, at the end (85) of every prayer. We stayed in Al-Jurjaniyah [Konye-Urgench] for days, and the river Jayhun [Amu Darya] froze from its beginning to its end, and the thickness of the ice was...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 48
  },
  {
    "serial_number": "6278767",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 51,
    "volume_number": 1,
    "text": "seventeen spans. Horses, mules, donkeys, and carts passed over it as they pass over roads. It remained firm and did not shake. It stayed like that for three months. We saw a land that we thought was nothing but a gate of *Zamharir* (extreme cold) opened upon us. Snow does not fall there without a violent, severe wind accompanying it. If a man from among its people wanted to treat his friend well and show him kindness, he would say to him: \"Come to me so we can talk, for I have a pleasant fire.\" This is if he went to extremes in his kindness and connection. However, Allah the Exalted has been kind to them regarding firewood; He made it cheap for them: a cartload of firewood...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 49
  },
  {
    "serial_number": "6278768",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 52,
    "volume_number": 1,
    "text": "...of *Tagh* [Saxaul] for two dirhams of their currency, weighing about three thousand pounds. The custom of their beggars is not to stand at the door, but to enter the house of one of them, sit for an hour by his fire to warm up, then say: \"Bakand,\" meaning bread. If they give him something, he takes it; otherwise, he leaves. Our stay in Al-Jurjaniyah [Konye-Urgench] was prolonged; we stayed there for days of Rajab, Sha'ban, the month of Ramadan, and Shawwal. The length of our stay was due to the cold and its severity. I was informed that two men drove twelve camels to carry firewood upon them from some of the thickets, but they forgot to take with them a flint and tinder. They spent the night without fire, and by morning, they and the camels were dead from the severity of the cold. I saw because of the cold air there, that the market and the streets would be empty, such that a person could roam most of the streets and markets and find no one, nor meet a single human. I would come out of the bathhouse, and when I entered the house, I would look at my beard and it was a single lump of ice, until I...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 50
  },
  {
    "serial_number": "6278769",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 53,
    "volume_number": 1,
    "text": "...brought it close to the fire.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 51
  },
  {
    "serial_number": "6278770",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 58,
    "volume_number": 1,
    "text": "I used to sleep in a house inside a house, in which there was a Turkish felt yurt, wrapped in blankets and fur coats, yet sometimes my cheek would stick to the pillow. I saw jubbahs being covered with sheepskin coats (*Bustins*) made of sheep leather so they wouldn't crack and break, but that availed nothing. I saw the earth crack into great ravines due to the severity of the cold, and a great, old tree would split into two halves because of it. When the middle of Shawwal of the year three hundred and nine [922 AD] came, the season began to change, and the Jayhun river [Amu Darya] thawed. We began gathering what we needed of travel equipment, bought Turkish camels, and made travel bags (*Sufur*) from camel skins to cross the rivers we needed...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 52
  },
  {
    "serial_number": "6278771",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 59,
    "volume_number": 1,
    "text": "...to cross in the land of the Turks. We provisioned ourselves with bread, millet, and dried salted meat (*Namaksudh*) for three months. Those of the people of the country we were friendly with advised us to be prudent regarding clothing and to have plenty of it. They terrified us about the matter and magnified the story. When we witnessed it, it was double what had been described to us. Each man among us had on a tunic (*Qartaq*), over it a caftan, over it a sheepskin coat (*Bustin*), over it a felt coat (*Lubbadah*), and a hooded cloak (*Burnus*) from which only his eyes were visible. He also wore a pair of simple trousers and another lined pair, gaiters (*Ran*), a boot of shagreen leather (*Kimakht*), and over the boot another boot. So when one of us mounted a camel, he could not move due to the clothes he was wearing. The jurist, the teacher, and the young servants who came out...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 53
  },
  {
    "serial_number": "6278772",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 60,
    "volume_number": 1,
    "text": "...with us from Madinat al-Salam [Baghdad] lagged behind us out of fear of entering that country. I traveled with the Ambassador, his brother-in-law, and the two servants Takin and Baris. When it was the day we resolved to depart, I said to them: \"O people, the King's servant is with you, and he is aware of your entire affair. You have the Sultan's letters, and I do not doubt that they mention the sending of four thousand Musayyabiyah dinars to him. You are going to a non-Arab (*A'jami*) king, and he will demand that from you.\" They said: \"Do not fear this, for he will not demand it of us.\" I warned them and said: \"I know that he will demand it of you,\" but they did not accept. The affair of the caravan was organized, and we hired a guide named Qalwas from the people of Al-Jurjaniyah. Then we relied upon Allah, Mighty and Majestic, and entrusted our affair to Him. We departed from Al-Jurjaniyah on Monday, with two nights passed of Dhu al-Qi'dah in the year three hundred and nine. We stopped at a ribat called Zamjan, which is...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 54
  },
  {
    "serial_number": "6278773",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 61,
    "volume_number": 1,
    "text": "...at the gate of the Turks. Then we departed the next day and stopped at a station called Jit. Snow came upon us until the camels were walking in it up to their knees, so we stayed at this station for two days. Then we penetrated into the land of the Turks, not pausing for anything, and no one met us in a barren wasteland without mountains. We traveled in it for ten days. We encountered adversity, hardship, severe cold, and continuous snows, compared to which the cold of Khwarazm seemed like summer days. We forgot everything that had passed and were on the verge of losing our lives. One day, a severe cold struck us. Takin was riding beside me, and next to him was a man from the Turks speaking to him in Turkish. Takin laughed and said: \"This Turk is saying to you: 'What does our Lord want from us? Behold, He is killing us with cold. If we knew what He wanted, we would offer it to Him.'\" I said to him: \"Tell him: 'He wants you to say: There is no god but Allah.'\" He laughed and said: \"If we knew, we would do it.\" Then, after that, we arrived at a place containing a great amount of *Tagh* firewood, so we camped there. The caravan lit fires, warmed themselves, removed their clothes, and dried them. Then we departed. We continued to travel every night from midnight until the time of Asr or until noon, with the most intense and greatest speed possible, then we would stop. When we had traveled for fifteen nights, we reached a great mountain with many stones, containing springs that cut across it, and water settles in the hollows. When we crossed it, we came upon a tribe of Turks known as the Ghuzziyah [Oghuz]. Suddenly, they were bedouins having...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 55
  },
  {
    "serial_number": "6278774",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 62,
    "volume_number": 1,
    "text": "...tents of hair. They settle and travel. You see their tents in one place, and similar ones in another place, following the practice of nomads and their movement. They are in misery. Yet, with that, they are like stray donkeys; they do not profess a religion for Allah, nor do they return to reason, nor do they worship anything. Rather, they call their elders \"Lords\" (*Arbab*). If one of them consults his chief about something, he says to him: \"O Lord, what should I do in such and such?\" Their affair is by consultation among them, except that whenever they agree on something and resolve upon it, the vilest and most despicable of them comes and breaks what they had agreed upon. I heard them saying: \"There is no god but Allah, Muhammad is the Messenger of Allah,\" trying to get close by this saying to the Muslims who pass by them, not out of belief in it. If one of them is wronged or something he dislikes happens to him, he raises his head to the sky and says: \"Bir Tangri,\" which is \"The One God\" in Turkish, because \"Bir\" in Turkish is one and \"Tangri\" is Allah in the language of the Turks. They do not clean themselves after defecation or urination, nor do they wash from major ritual impurity (*Janabah*) or other things. There is no interaction between them and water, especially in winter. Their women do not cover themselves from their men or others. Likewise, the woman does not cover anything of her body from anyone. We stopped one day with a man of theirs and sat down. The man's wife was with us. While she was talking to us, she uncovered her vulva and scratched it. We were looking at her, so we covered our faces and said: \"I seek forgiveness from Allah.\" Her husband laughed and said to the interpreter: \"Tell them: She uncovers it in your presence so you see it and she protects it, so it is not reached. That is...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 56
  },
  {
    "serial_number": "6278775",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 63,
    "volume_number": 1,
    "text": "...better than if she covered it and allowed access to it.\" They do not know fornication/adultery. Assuming they discover someone doing any of that action, they tear him in two halves. That is, they bring together the branches of two trees, tie him to the branches, and release the two trees, so the one tied to them is torn apart. One of them said, hearing me recite the Quran—he found the Quran beautiful—and began saying to the interpreter: \"Tell him: Do not fall silent.\" This man said to me one day via the interpreter: \"Ask this Arab: Does our Lord, Mighty and Majestic, have a wife?\" I considered this a grave matter, glorified Allah, and sought His forgiveness. He glorified and sought forgiveness just as I did. This is the custom of the Turk: whenever he hears a Muslim glorify Allah (*Tasbih*) or declare His oneness (*Tahlil*), he says the same. Their marriage customs: One of them proposes to another for a female under his guardianship—either his daughter, his sister, or anyone he has authority over—for such and such amount of Khwarazmian garments. If he agrees, he carries her to him. The dowry might be camels, beasts, or other things. No one can approach his wife until he pays the dowry that her guardian agreed upon. If he pays it, he comes without shyness, enters the house where she is, and takes her in the presence of her father, mother, and brothers; they do not prevent him from that. If a man dies and has a wife and children, the eldest of his sons marries his wife if she is not his mother. None of the merchants or others can wash from major ritual impurity in their presence except at night, where they cannot see him. This is because they get angry and say: \"This one wants to bewitch us because he has immersed himself in water,\" and they fine him money.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 57
  },
  {
    "serial_number": "6278776",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 64,
    "volume_number": 1,
    "text": "No Muslim can pass through their country until he makes a friend among them with whom he stays. He brings him a garment from the land of Islam, and for his wife a veil (*Miqna'a*), some pepper, millet, raisins, and walnuts. When he arrives at his friend's place, the friend pitches a tent for him and brings him sheep according to his status, so the Muslim takes charge of slaughtering them, because the Turks do not slaughter; rather, one of them strikes the head of the sheep until it dies. If a man among them wants to travel, and he needs some of his camels or beasts, or needs money, he leaves what he has with his Turkish friend, takes what he needs of his friend's camels, beasts, and money, and departs. When he returns from the direction he intended, he pays him back his money and returns his camels and beasts. Likewise, if a person whom the Turk does not know passes by him and says: \"I am your guest and I want some of your camels, beasts, and dirhams,\" he gives him what he wants. If the merchant dies during that journey and the caravan returns, the Turk meets them and asks: \"Where is my guest?\" If they say: \"He died,\" he unloads the caravan, then goes to the noblest merchant he sees among them, unties his goods while the merchant watches, and takes from his dirhams the equivalent of his wealth that was with that merchant, without adding a grain. He likewise takes from his beasts and camels and says: \"That was your cousin, and you are the most rightful to pay his debt.\" If he ran away, he would also do that action and say to him: \"That was a Muslim like you; you take it from him.\" If the Muslim does not meet his guest on the main road, he asks about his land: \"Where is he?\" If he is guided to him, he travels seeking him for a journey of days until he comes to him, and he delivers his wealth to him as well as what he gifts him. This is also the way of the Turk: if he enters Al-Jurjaniyah, he asks for his guest and stays with him...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 58
  },
  {
    "serial_number": "6278777",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 65,
    "volume_number": 1,
    "text": "...until he departs. Whenever a Turk dies while with his Muslim friend, and the caravan passes by with his friend in it, they kill him and say: \"You killed him by detaining him; had you not detained him, he would not have died.\" Likewise, if he gave him *Nabidh* (fermented drink) and he fell from a wall, they kill him for it. If he is not in the caravan, they target the most prominent person in it and kill him. The matter of sodomy is very grave among them. A man from the people of Khwarazm stayed with the clan of Kutharkin—who is the deputy of the King of the Turks—and stayed with a host of his for a period to buy sheep. The Turk had a beardless son. The Khwarazmian kept cajoling him and soliciting him until he yielded to what he wanted. The Turk came and found them in their act. The Turk reported this to Kutharkin. He said to him: \"Gather the Turks.\" So he gathered them. When they gathered, he said to the Turk: \"Do you want me to judge by the truth or by falsehood?\" He said: \"By the truth.\" He said: \"Bring your son.\" He brought him. He said: \"He and the merchant must both be killed.\" The Turk was angered by that and said: \"I will not surrender my son.\" He said: \"Then the merchant ransoms himself.\" He did so and paid the Turk sheep for the act with his son, and paid Kutharkin four hundred sheep for lifting the penalty from him. We departed from the land of the Turks. The first of their kings and chiefs we met was Yanal the Little. He had converted to Islam, but it was said to him: \"If you become Muslim, you will not lead us,\" so he renounced his Islam. When we reached the place where he was, he said: \"I will not let you pass, for this is something we have never heard of...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 59
  },
  {
    "serial_number": "6278778",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 66,
    "volume_number": 1,
    "text": "...ever, nor did we think it could happen.\" We treated him gently until he was satisfied with a Jurjani caftan worth ten dirhams, a piece of *Baybaf* cloth, loaves of bread, a handful of raisins, and a hundred walnuts. When we gave this to him, he prostrated to us. This is their custom: if a man honors another man, he prostrates to him. He said: \"Were it not that my houses are far from the road, I would have brought you sheep and wheat.\" He turned away from us, and we departed. The next day, a single man from the Turks met us. He was ugly in creation, shabby in clothes, despicable in appearance, and vile in news. Heavy rain had overtaken us. He said: \"Stop.\" The entire caravan stopped, consisting of about three thousand beasts and five thousand men. Then he said: \"None of you shall pass.\" We stopped in obedience to his command. We said to him: \"We are friends of Kutharkin.\" He began to laugh and say: \"Who is Kutharkin? I shit on Kutharkin's beard.\" Then he said: \"Bakand,\" meaning bread in the language of Khwarazm. I gave him some loaves. He took them and said: \"Go, I have had mercy on you.\" He said: If a man among them falls sick and has slave girls and slaves, they serve him, and no one from his family approaches him. They pitch a tent for him apart from the houses, and he remains in it until he dies or recovers. If he is a slave or poor, they throw him into the desert and move away from him. If a man among them dies, they dig a large pit for him like the shape of a house. They take him, dress him in his tunic, his belt, and his bow. They place a wooden cup with *Nabidh* in his hand and leave a wooden vessel with *Nabidh* before him. They bring all his property and put it with him in that house.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 60
  },
  {
    "serial_number": "6278779",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 67,
    "volume_number": 1,
    "text": "Then they sit him in it, roof the house over him, and make something like a clay dome over it. Then they take his beasts, according to their number; they kill a hundred heads, or two hundred heads, or one head, and eat their meat except for the head, the legs, the hide, and the tail, for they hang those on wood. They say: \"These are his beasts; he will ride them to Paradise.\" If he had killed a human and was brave, they carve wooden images according to the number of those he killed and place them on his grave, saying: \"These are his servants who will serve him in Paradise.\" Sometimes they neglect killing the beasts for a day or two, so an elder from among their seniors urges them, saying: \"I saw So-and-so—meaning the deceased—in my sleep, and he said to me: 'Behold, you see me. My companions have outstripped me, and my feet are cracked from following them. I cannot catch up to them, and I have been left alone.'\" Upon that, they proceed to his beasts, kill them, and hang them at his grave. After a day or two, that elder comes to them and says: \"I saw So-and-so, and he said: 'Inform my family and companions that I have caught up with those who preceded me and have rested from fatigue.'\" He said: All the Turks pluck their beards except for their mustaches. You might see a decrepit elder among them who has plucked his beard and left a little bit of it under his chin, wearing a sheepskin coat; if a person saw him from afar, he would not doubt that he is a billy goat. The King of the Oghuz Turks is called Yabghu; this is the title of the Prince, and everyone who rules this tribe is called by this name. His deputy is called Kutharkin, and likewise, anyone who succeeds a chief among them is called Kutharkin. Then, after our departure from the region of these people, we stopped with the commander of their army, who is called Atrak...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 61
  },
  {
    "serial_number": "6278780",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 68,
    "volume_number": 1,
    "text": "...bin al-Qatghan. He pitched Turkish tents for us and lodged us in them. He had a large retinue, entourage, and large houses. He drove sheep to us and brought horses for us to slaughter the sheep and ride the horses. He invited a group of his family and cousins and killed many sheep for them. We had given him a gift of garments, raisins, walnuts, pepper, and millet. I saw his wife—who had been his father's wife—taking meat, milk, and some of what we had gifted him. She went out of the houses into the desert, dug a pit, and buried what she had with her in it. She spoke some words. I said to the interpreter: \"What is she saying?\" He said: \"She says: 'This is a gift for al-Qatghan, the father of Atrak, which the Arabs have gifted to him.'\" When it was night, I and the interpreter entered upon him while he was sitting in his tent. We had with us the letter of Nadhir al-Harami to him, commanding him to accept Islam and urging him to do so. He sent him fifty dinars, including several Musayyabiyah dinars, three mithqals of musk, tanned hides, and Mervian garments. We cut out for him from them two tunics, a leather boot, a brocade garment, and five silk garments. We gave him his gift and gave his wife a veil and a ring.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 62
  },
  {
    "serial_number": "6278781",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 69,
    "volume_number": 1,
    "text": "I read the letter to him. He said to the interpreter: \"I will not say anything to you until you return, and I will write to the Sultan regarding what I have decided.\" He took off the brocade garment he was wearing to put on the robes of honor we mentioned. I saw the tunic underneath it was torn apart from dirt, for their custom is that one does not remove the garment next to his body until it falls apart in pieces. He had plucked his entire beard and mustache, remaining like a eunuch. I saw the Turks mentioning that he was the best horseman among them. I saw him one day riding beside us on his horse when a flying goose passed. He strung his bow, moved his beast under it, then shot it, and behold, he had brought it down. One day, he sent for the commanders who follow him, namely: Tarxan, Yanal, their nephew, and Ilghuz. Tarxan was the noblest and most distinguished of them, but he was lame, blind, and paralyzed. He [Atrak] said to them: \"These are the messengers of the King of the Arabs to my son-in-law Almish bin Shilki. It is not my choice to release them except upon your consultation.\" Tarxan said: \"This is something we have never seen nor heard of. No messenger of a Sultan has passed by us since we and our fathers existed. I think nothing but that the Sultan has devised a trick and sent these men to the Khazars to raise an army with them against us. The best course is to cut these...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 63
  },
  {
    "serial_number": "6278782",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 70,
    "volume_number": 1,
    "text": "...messengers in half, two by two, and take what they have.\" Another one of them said: \"No, rather we take what they have and leave them naked to return from where they came.\" Another said: \"No, but we have captives with the King of the Khazars, so let us send these men to ransom those.\" They continued discussing these matters among themselves for seven days while we were in a state of death, until their opinion united on letting us go and proceed. We gave Tarxan a Mervian caftan and two pieces of *Baybaf* cloth. To his companions, we gave a tunic each, and likewise to Yanal. We gave them pepper, millet, and loaves of bread, and they turned away from us. We traveled until we reached the River Yaghindi. The people took out their travel bags (*Sufur*), which are made of camel skins, spread them out, and took the furnishings from the Turkish camels, because they are round, and placed them inside until they stretched tight. Then they stuffed them with clothes and luggage. When they were full, a group of five, six, four, or less or more sat in each bag. They took birch wood (*Khadank*) in their hands...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 64
  },
  {
    "serial_number": "6278783",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 71,
    "volume_number": 1,
    "text": "...using it like oars. They keep rowing, and the water carries it while it spins, until we cross. As for the beasts and camels, they are shouted at and they cross swimming. A group of warriors with weapons must cross before anything from the caravan crosses, to be a vanguard for the people out of fear of the Bashghird [Bashkirs], lest they raid the people while they are crossing.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 65
  },
  {
    "serial_number": "6278784",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 72,
    "volume_number": 1,
    "text": "So we crossed Yaghindi in the manner we described. Then after that, we crossed a river called Jam in the travel bags as well, then we crossed Jakhish, then Adhil, then Ardan, then Warish, then Akhti, then Waba. All these are large rivers. Then after that, we came to the Pechenegs (*Banjak*). They were encamped by water resembling a sea, not flowing. They are dark brown, intensely dark, and they shave their beards. They are poor, unlike the Ghuzziyah [Oghuz], for I saw among the Ghuzziyah those who owned ten thousand beasts and a hundred thousand head of sheep. Most of the sheep graze beneath the snow, digging with their hooves seeking grass. If they don't find it, they chew the snow and become extremely fat. When it is summer and they eat grass, they become thin. We stayed with the Pechenegs for one day, then departed. We stopped at the River Jaykh [Ural River], which is the biggest, greatest, and swiftest river we saw. I saw a travel bag overturn in it, and those in it drowned; many people were lost, and a number of camels and beasts drowned. We did not cross it except with great effort.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 66
  },
  {
    "serial_number": "6278785",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 73,
    "volume_number": 1,
    "text": "Then we traveled for days and crossed the River Jakha, then after it the River Arkhaz, then Bajagh, then Samur, then Kinal, then the River Sukh, then the River Kinjlu. We stopped in the land of a people of the Turks called the Bashghird [Bashkirs]. We were wary of them with the utmost caution, for they are the worst of the Turks, the dirtiest, and the most daring in killing. A man meets another man, slices off his head, takes it, and leaves him. They shave their beards and eat lice. One of them traces the seam of his tunic and crunches the lice with his teeth. There was one of them with us who had become Muslim and served us. I saw him find a louse in his garment, crush it with his fingernail, then lick it and say when he saw me: \"Good.\" Each one of them carves a piece of wood the size of a phallus and hangs it on himself. If he wants to travel or meet an enemy, he kisses it, prostrates to it, and says: \"O Lord, do such and such for me.\" I said to the interpreter: \"Ask one of them, what is their reasoning in this, and why did he make it his Lord?\" He said: \"Because I came out of something like it, and I know of no creator for myself other than it.\" Among them are those who claim to have twelve gods: a god for winter, a god for summer, a god for rain, a god for wind...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 67
  },
  {
    "serial_number": "6278786",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 74,
    "volume_number": 1,
    "text": "...a god for trees, a god for people, a god for beasts, a god for water, a god for night, a god for day, a god for death, and a god for the earth. The Lord who is in the sky is the greatest of them, except that He unites with these in agreement, and each one of them is pleased with what His partner does. Exalted is Allah high above what the wrongdoers say. We saw a group of them worshipping snakes, a group worshipping fish, and a group worshipping cranes. They informed me that they were fighting a people of their enemies and were defeated, but the cranes cried out behind them [the enemies], so they [the enemies] were terrified and defeated. Thus, they [the Bashkirs] defeated them, so they worshipped the cranes for that reason and said: \"These are our Lord, and these are his deeds; he defeated our enemies.\" Therefore, they worship them. He said: We traveled from the land of these people and crossed the River Jarmashan, then the River Uran, then the River Uram, then the River Bayanakh, then the River Watigh, then the River Niyasnah, then the River Jawshiz. Between one river and the next of those we mentioned is a journey of two, three, or four days, less than that or more.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 68
  },
  {
    "serial_number": "6278787",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi",
    "page_number": 75,
    "volume_number": 1,
    "text": "The Saqaliba [Volga Bulgars]: When we were a day and a night's journey away from the King of the Saqaliba—who was the one we intended to visit—he sent the four kings under his authority, his brothers, and his children to meet us. They met us carrying bread, meat, and millet, and traveled with us. When we were two farsakhs away from him, he met us personally. When he saw us, he dismounted and fell prostrate, thanking Allah, Mighty and Majestic. He had dirhams in his sleeve which he scattered over us. He set up tents for us, and we settled in them. Our arrival to him was on Sunday, twelve nights passed of Al-Muharram in the year three hundred and ten [May 12, 922 AD]. The distance from Al-Jurjaniyah to his country was seventy days. We stayed Sunday, Monday, Tuesday, and Wednesday in the tents pitched for us until he gathered the kings, the commanders, and the people of his country to hear the reading of the letter. When it was Thursday and they had gathered, we unfurled the two banners that were with us, saddled the beast with the saddle sent to him, dressed him in black, and turbaned him. I took out the Caliph's letter and said to him: \"It is not permissible for us to sit...\"",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 69
  },
  {
    "serial_number": "6278788",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 76,
    "volume_number": 1,
    "text": "and the letter was being read. He stood upon his feet, he and those present of the notables of the people of his kingdom; and he was a very stout and pot-bellied man (233). I began and read the beginning of the letter. When I reached from it: \"Peace be upon you, for I praise to you Allah, other than Whom there is no god,\" I said: \"Return the greeting to the Commander of the Faithful.\" So he replied, and they all replied entirely. The interpreter did not cease translating for us letter by letter. When we completed reading it, they shouted \"Allahu Akbar\" (Allah is Great) with a shout by which the earth trembled. Then I read the letter of the Vizier Hamid ibn al-Abbas (234) while he was standing, then I ordered him to sit, so he sat during the reading of the letter of Nadhir al-Halami. When I completed it, his companions scattered many dirhams (silver coins) upon him. Then I brought out the gifts of perfume, clothes, and pearls for him and his wife. I ceased not to display to him and to her item by item until we finished that. Then I placed the robe of honor (235) upon his wife in the presence of the people, and she was sitting by his side; this is their custom and their fashion. When I placed the robe upon her, the women scattered dirhams upon her, and we departed. After an hour had passed, he sent for us, so we entered upon him while he was in his tent, and the kings were on his right. He ordered us to sit on his left, and his children were sitting in front of him, and he was alone on a throne covered with Byzantine brocade (236). He called for the table, and it was brought, having upon it roasted meat alone. He started, took a knife, cut a morsel and ate it, and a second, and a third. Then he cut a piece and handed it to Sawsan the Ambassador. When he took it, a small table was brought and placed before him. Such is the protocol (237): no one extends...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 70
  },
  {
    "serial_number": "6278789",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 77,
    "volume_number": 1,
    "text": "...his hand to eat until the King hands him a morsel. The moment he takes it, a table is brought to him. Then he handed to me, and a table came to me. Then he cut a piece and handed it to the king who was on his right, and a table came to him. Then he handed to the second king, and a table came to him. Then he handed to the fourth king, and a table came to him. Then he handed to his children, and tables came to them. We ate, each one from his own table; no one shared it with him, nor did he take anything from the table of another. When he finished the food, each one of them carried what remained on his table to his home (238). When we had eaten, he called for a honey drink which they call *Saju* (239) for his day and his night...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 71
  },
  {
    "serial_number": "6278790",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 78,
    "volume_number": 1,
    "text": "...so he drank a cup, then stood up straight and said: \"This is my joy for my master the Commander of the Faithful, may Allah prolong his remaining.\" The four kings and his children stood up because of his standing, and we stood up as well, until he did that three times, then we departed from him. Before my arrival, the sermon (Khutbah) used to be delivered for him on his pulpit [saying]: \"O Allah, set right the King Yiltawar, King of Bulgar.\" So I said to him: \"Verily Allah is the King, and no one is named on the pulpit by this name other than Him, Mighty and Majestic is He. This is your master, the Commander of the Faithful; he has been satisfied for himself that it be said on his pulpits in the East and the West: 'O Allah, set right Your servant and Your Caliph, Ja'far the Imam al-Muqtadir Billah, Commander of the Faithful' (240)...\"",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 72
  },
  {
    "serial_number": "6278791",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 79,
    "volume_number": 1,
    "text": "...and likewise, those who were before him of his forefathers, the Caliphs. The Prophet, may Allah bless him and grant him peace, said: \"Do not...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 73
  },
  {
    "serial_number": "6278792",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 80,
    "volume_number": 1,
    "text": "...extol me (241) as the Christians extolled Jesus, son of Mary, for I am but a servant; so say: The Servant of Allah and His Messenger.\" He said to me: \"So how is it permissible for the sermon to be delivered for me?\" I said: \"By your name and your father's name.\" He said: \"My father was a disbeliever, and I do not like to mention his name on the pulpit. And I, too, do not like my name to be mentioned, since the one who named me with it was a disbeliever. But what is the name of my master, the Commander of the Faithful?\" I said: \"Ja'far.\" He said: \"Is it permissible for me to be named by his name?\" I said: \"Yes.\" He said: \"I have made my name Ja'far and my father's name Abdullah.\" So he instructed the preacher (Khatib) with that. I did so. Thus, the sermon was delivered for him: \"O Allah, set right Your servant Ja'far ibn Abdullah, the Amir of Bulgar, Client of the Commander of the Faithful.\" Three days after reading the letter and delivering the gifts, he sent for me. The matter of the four thousand dinars and the trickery of the Christian in delaying it had reached him, and the news of it was in the letter. When I entered upon him, he ordered me to sit, so I sat. He threw the letter of the Commander of the Faithful to me and said: \"Who brought this letter?\" I said: \"I did.\" Then he threw the letter of the Vizier to me and said: \"And this too?\" I said: \"I did.\" He said: \"So the money that was mentioned in them, what was done with it?\" I said: \"It was impossible to collect it, time was tight, and we feared missing the entry [to the north], so we left it to catch up with us.\" He said: \"You have all come, and my master has spent on you what he spent to carry this money to me so that I may build with it a fortress that protects me from the Jews who have enslaved me. As for the gift, my slave boy could have brought it.\" I said: \"It is...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 74
  },
  {
    "serial_number": "6278793",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 81,
    "volume_number": 1,
    "text": "...so, except that we strove diligently.\" He said to the interpreter: \"Tell him: I do not know these people; I only know you. That is because these are non-Arab people (Ajam). If the Master (242)—may Allah support him—knew that they convey what you convey, he would not have sent you to preserve [matters] for me, read my letter, and hear my answer. I do not demand a dirham from anyone but you. So produce the money (243), for it is better for you.\" I departed from his presence terrified and distressed. He was a man of imposing appearance and dignity, stout and broad, as if he spoke from a large jar (244). I went out from his presence, gathered my companions, and informed them of what happened between me and him, and I said to them: \"Of this, I warned you.\" His Muezzin used to double the Iqama (245) when he called to prayer. I said to him: \"Your master, the Commander of the Faithful, singles the Iqama in his abode.\" He said to the Muezzin: \"Accept what he says to you and do not oppose him.\" The Muezzin stayed on that for days, while [the King] asked me about the money and debated with me about it, and I made him despair (246) of it and argued about it. When he despaired of it, he instructed the Muezzin to double the Iqama, and he did so. He intended by that to make it a path to debate with me (247). When I heard his doubling of the Iqama, I forbade him and shouted at him. The King knew, so he summoned me and summoned my companions. When we gathered, the interpreter said: \"Tell him (meaning me...): What does he say about two Muezzins; one singled [the Iqama] and the other doubled, then each one of them led a group in prayer. Is the prayer permissible or not?\" I said: \"The prayer is permissible.\" He said: \"By difference of opinion or by consensus?\" I said: \"By consensus.\" He said: \"Tell him: What does he say about a man who gave money to a group for weak, besieged, enslaved people, and they betrayed him?\" I said: \"This is not permissible, and these are evil people.\" He said: \"By difference of opinion or by consensus?\" I said: \"By consensus.\" He said to the interpreter: \"Tell him: Do you know that the Caliph—may Allah prolong his remaining—if he sent an army to me, would he be able to defeat me?\" I said: \"No.\" He said: \"Then the Amir of Khorasan?\" I said: \"No.\" He said: \"Is it not because of the distance and the large number of...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 75
  },
  {
    "serial_number": "6278794",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 82,
    "volume_number": 1,
    "text": "...tribes of disbelievers between us?\" I said: \"Yes.\" He said: \"Tell him: By Allah, I am in my distant place where you see me, and indeed I am afraid of my master the Commander of the Faithful. That is because I fear that something he dislikes might reach him about me, so he would curse me, and I would perish in my place while he is in his kingdom, and between me and him are vast lands. Yet you eat his bread, wear his clothes, and see him at all times, but you betrayed him in the amount of a message he sent you with to me, to weak people, and you betrayed the Muslims. I do not accept from you any matter of my religion until someone comes to me who is sincere to me in what he says. If a person of this description comes to me, I will accept from him.\" He silenced us (248), and we could not return an answer, so we departed from his presence. He [Ibn Fadlan] said (249): After this statement, he used to favor me, bring me close, and keep my companions at a distance, and he called me Abu Bakr al-Siddiq. I saw in his country wonders that I cannot count due to their multitude. Among them: The first night we spent in his country, I saw the horizon of the sky an hour (250) before sunset turn intensely red. I heard in the atmosphere intense sounds and a loud humming (251). I raised my head, and behold, there was a red cloud like fire near me, and behold, that humming and those sounds were coming from it. And behold, inside it were likenesses of people and beasts, and in the hands of the phantoms inside it, which resembled humans, were spears and swords that I could distinguish and imagine. And behold, there was another piece [cloud] like it, in which I also saw men, beasts, and weapons. This piece advanced and charged against that one, just as a battalion (252) charges against a battalion. We were terrified by that and turned to supplication and prayer, while they laughed at us and marveled at our action. He said: We were looking at the piece charging against the piece; they would mix together for a while and then separate. The matter continued like that for a while of the night, then they disappeared. We asked the King about that, and he claimed...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 76
  },
  {
    "serial_number": "6278795",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 83,
    "volume_number": 1,
    "text": "...that his ancestors used to say: 'These are from the believing Jinn and their disbelievers; they fight every evening, and indeed they have not lacked (253) this since they existed, every night' (254). He said: I and a tailor of the King who was from the people of Baghdad [Iraq]—who had ended up in that region—entered my tent to talk. We talked for the amount of time a person reads less than half a seventh [of the Quran], and we were waiting for the Adhan (call to prayer) of the Isha (night prayer). Suddenly, there was the Adhan, so we went out of the tent, and the dawn had already risen. I said to the Muezzin: 'What did you call for?' He said: 'The Adhan of Fajr (dawn).' I said: 'Then what about the last Isha?' He said: 'We pray it with Maghrib (sunset prayer).' I said: 'Then the night?' He said: 'As you see.' It used to be even shorter than this, but it has begun to lengthen. He mentioned that for a month he had not slept for fear of missing the morning prayer. That is because a person puts the pot on the fire at the time of Maghrib, then...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 77
  },
  {
    "serial_number": "6278796",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 84,
    "volume_number": 1,
    "text": "...he prays the morning prayer, and it [the food] has not had time to cook. He said: I saw the day with them is very long. It happens that it lengthens with them for a period of the year and the night shortens, then the night lengthens and the day shortens. When it was the second night, I sat outside the tent and observed the sky. I did not see of the stars except a small number, I thought it was about fifteen scattered stars. And behold, the red twilight that is before Maghrib does not disappear at all. And behold, the night has little darkness; a man recognizes a man in it from more than a bow-shot distance (255). He said: I saw the moon does not reach the middle of the sky; rather, it rises in its sides for an hour, then the dawn rises and the moon disappears. The King told me that beyond his country by a journey of three months is a people called Wisu (256); the night with them is less than an hour. He said: I saw the country at sunrise; everything in it turns red—the earth, the mountains, and everything a human looks at. When the sun rises, it is like a great cloud, and the redness remains like that until the sky is at its zenith. The people of the country informed me that when winter comes, the night returns to the length of the day, and the day returns to the shortness of the night, so that a man of us goes out to a place called Itil [Volga] (257)—between us and it is less than a farsakh's journey—at the time of dawn, and he does not reach it by the time of Isha until...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 78
  },
  {
    "serial_number": "6278797",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 85,
    "volume_number": 1,
    "text": "...the time of the rising of all the stars, so that the sky is covered (258). We did not leave the country until the night lengthened and the day shortened. I saw them seeking blessings from the howling of dogs greatly; they rejoice at it and say: \"A year of fertility, blessing, and safety.\" I saw snakes were numerous with them, so that ten or more would wrap around the branch of a tree, and they do not kill them, nor do they harm them. Until I saw in some places a tall tree, its length being more than a hundred cubits, and it had fallen. Behold, its trunk was very huge. I stood looking at it, then it moved, which terrified me. I looked closely at it, and behold, there was a snake upon it, close to it in thickness and length. When it saw me, it fell off it and disappeared among the trees. I came terrified and told the King and those in his council. They did not care about that, and he said: \"Do not panic, for it will not harm you.\" We stopped at a campsite with the King. I, my companions Takin, Sawsan, and Baris, and a man from the King's companions entered among the trees. We saw a small green stick, like the thinness of a spindle but longer, containing a green vein. On top of the vein was a broad leaf spread on the ground, spread out like a plant, containing seeds. The one who eats it does not doubt that it is a smooth pomegranate (259). We ate from it, and behold, it had a great bitterness but with pleasure, so we ceased not to follow it and eat it. I saw they had green apples, intensely green and more acidic than wine vinegar, and...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 79
  },
  {
    "serial_number": "6278798",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 86,
    "volume_number": 1,
    "text": "...the slave girls eat it and grow fat on it. I did not see anything in their country more abundant than hazelnut trees (260). I saw forests of it; a forest (261) would be forty farsakhs in its like. I saw they had a tree, I do not know what it is, excessively tall, and its trunk is devoid of leaves. Its top is like the top of a palm tree; it has thin leaves (262), but they are gathered. They come to a place they know on its trunk, pierce it, and place a vessel under it. Water flows to it from that hole, sweeter than honey. If a person drinks much of it, it intoxicates him just as wine intoxicates (263). Most of their eating is millet and the meat of the beast, although wheat and barley are plentiful. Everyone who plants something takes it for himself; the King has no right to it, except that they pay him every year a sable skin from every house (264). If he orders a detachment to raid some countries and it gains booty, he has a share with them. It is necessary for everyone who holds a wedding feast (265) or gives a banquet to give a portion (266) to the King according to the size of the feast, and a flask (267) of honey wine (mead) and bad wheat (268), because their land is black and smelly. They do not have places to store their food; rather, they dig wells in the ground...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 80
  },
  {
    "serial_number": "6278799",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 87,
    "volume_number": 1,
    "text": "...and put the food in them. Only a few days pass until it changes and smells (269), so it cannot be used. They have no olive oil, nor sesame oil (270), nor any fat at all. They only use fish oil in place of these oils; thus, everything they use it in becomes smelly. They make soup from barley which the slave girls and boys sip. Perhaps they cook barley with meat; the masters eat the meat and feed the slave girls the barley, unless it is the head of a goat (271), then meat is fed [to them]. All of them wear caps (qalansuwah) (272). If the King rides, he rides alone without a servant or anyone with him. When he passes through the market, no one remains but that he stands and takes his cap off his head and puts it under his armpit. When he passes them, they return their caps to their heads. Likewise, everyone who enters upon the King, small or large, even his children and brothers, the moment they look at him, they take their caps and put them under their armpits, then nod to him with their heads and sit. Then they stand until he orders them to sit. Everyone who sits before him sits kneeling; he does not take out his cap nor show it until he exits from his presence, then he wears it at that time. All of them are in tents, except that the King's tent is very large, holding a thousand souls or more, furnished with Armenian carpets (273). In the middle of it, he has a throne covered with Byzantine brocade. Among their customs is that if a son is born to a man's son, his grandfather takes him instead of his father and says: \"I have more right to him than his father in his custody until he becomes a man.\" If a man among them dies, his brother inherits from him, not his son. I informed the King that this is not permissible and informed him how inheritance works until he understood it.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 81
  },
  {
    "serial_number": "6278800",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 88,
    "volume_number": 1,
    "text": "I did not see more thunderbolts [lightning] than in their country. If a thunderbolt falls upon a house, they do not approach it and leave it in its state, along with everyone in it—man, wealth, and otherwise—until time destroys it. They say: \"This is a house upon which anger has fallen.\" If a man among them kills a man intentionally, they retaliate (274) against him. If he kills him by mistake, they make a box for him of Khadang wood (275), put him inside it, nail it shut over him, put three loaves of bread and a jug of water with him, set up three pieces of wood for him like tripods (276), and suspend him between them. They say: \"We put him between the sky and the earth; the rain and sun will hit him, perhaps Allah may have mercy on him.\" He remains suspended until time wears him out and the winds blow him away. If they see a person who has agility and knowledge of things, they say: \"This one, it is his right to serve our Lord.\" So they take him, put a rope around his neck, and hang him on a tree until he is torn apart. The King's interpreter told me that a Sindhi man (277) ended up (278) in that country and stayed with the King for a period of time serving him. He was agile and understanding. A group of them wanted to go out for their trade, so the Sindhi asked the King for permission to go out with them. He forbade him from that, but he insisted until he permitted him. He went out with them in a boat. They saw he was agile (279) and clever (280), so they conspired among themselves and said: \"This one is suitable for the service of our Lord, so let us send him to Him.\" They passed a forest on their way, so they brought him out to it, put a rope around his neck, tied him to the top of a high tree, left him, and went on. If they are traveling on a road and one of them wants to urinate and urinates while wearing his weapons, they loot him...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 82
  },
  {
    "serial_number": "6278801",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 89,
    "volume_number": 1,
    "text": "...and take his weapons, his clothes, and everything with him. This is a custom of theirs. Whoever puts down (281) his weapons from him, puts them aside, and urinates, they do not interfere with him. Men and women go down to the river and bathe together naked; they do not cover themselves from one another, but they do not commit adultery in any way or cause. Whoever commits adultery among them, whoever he may be, they drive four stakes for him, tie his hands and feet to them, and cut with an axe from his neck to his thighs. They do likewise with the woman as well. Then every piece of him and her is hung on a tree. I ceased not to strive that the women cover themselves from the men in swimming, but it did not work out for me (282). They kill the thief just as they kill the adulterer (283). In their forests, there is much honey in the dwellings of bees which they know, so they go out to seek...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 83
  },
  {
    "serial_number": "6278802",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 92,
    "volume_number": 1,
    "text": "...that, and perhaps a group of their enemies falls upon them and kills them. Among them are many merchants who go out to the land of the Turks and bring back sheep, and to (284) a country called Wisu and bring back sable and black fox.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 84
  },
  {
    "serial_number": "6278803",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 93,
    "volume_number": 1,
    "text": "We saw among them a household (285) consisting of five thousand souls, women and men, who had all converted to Islam. They are known as Al-Baranjar (286). They built a mosque of wood for themselves in which they pray, but they do not know how to read, so I taught a group what they could pray with. A man called Talut converted to Islam at my hands, so I named him Abdullah. He said: \"I want you to name me with your name, Muhammad.\" So I did. His wife, mother, and children converted, and they were all named Muhammad. I taught him \"Al-Hamdu Lillah\" (Surah Al-Fatiha) and \"Qul Huwa Allahu Ahad\" (Surah Al-Ikhlas). His joy with these two Surahs was greater than his joy if he were to become the King of the Saqaliba [Volga Bulgars] (287). When we arrived at the King, we found him camped at a water called Khaljah (288), which consists of three lakes: two large ones and one small one, except that in all of them there is nothing whose bottom can be reached (289). Between this place and a great river of theirs that flows to the land of the Khazars, called the River Itil [Volga] (290), is about a farsakh. On this river is a place of a market that is held every short period (291), and many precious goods are sold in it.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 85
  },
  {
    "serial_number": "6278804",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 94,
    "volume_number": 1,
    "text": "Takin had told me (292) that in the King's country was a man of very huge build. When I came...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 86
  },
  {
    "serial_number": "6278805",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 95,
    "volume_number": 1,
    "text": "...to the country, I asked the King about him. He said: \"Yes, he was in our country and died. He was not from the people of the country nor from ordinary people either. His story was that a group of merchants went out to the River Itil [Volga], which is a river between us and between which is one day's journey, as they usually go out. This river had risen and its water overflowed. One day, suddenly a group of merchants came to me and said: 'O King, a man has floated (293) upon the water. If he is from a nation near us, we have no residence in these lands, and we have nothing left but to move (294).' I rode with them until I came to the river, and behold, I was with the man. Behold, he was twelve cubits by my arm. Behold, he had a head like the largest of cooking pots, a nose more than a span, two huge eyes, and fingers that were more than a span each. His matter terrified me, and the panic that entered the people entered me. We began speaking to him, but he did not speak to us, but rather looked at us (295). I carried him to my place and wrote to the people of Wisu—and they are three months away from us—asking them about him. They wrote to me informing me that this man is from Yajuj (Gog)...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 87
  },
  {
    "serial_number": "6278806",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 96,
    "volume_number": 1,
    "text": "...and Majuj (Magog) (296). They are three months from us, naked. The sea separates (297) us from them because they are on its shore. They are like beasts; they have intercourse with each other. Allah, Mighty and Majestic, brings out a fish for them every day from the sea. One of them comes with a knife (298) and cuts from it the amount that suffices him and suffices his family. If he takes more than what satisfies him, his belly complains (aches), and likewise his family complain of their bellies; perhaps he dies and they all die entirely. When they have taken their need from it, it turns over and falls into the sea. They are like that every day. Between us and them is the sea on one side, and mountains surround them from other sides, and the Barrier also separates them from the gate from which they used to exit. When Allah, Mighty and Majestic, wants to bring them out to the civilized lands, He will cause the opening of the Barrier for them, the drying up of the sea, and the cutting off of the fish from them. He said: So I asked him about the man. He said: He stayed with me for a period. No boy looked at him but that he died, and no pregnant woman but that she cast her load (miscarried). If he gained power over a human, he squeezed him with his hands until he killed him. When I saw that, I hung him on a high tree until he died. If you want to look at his bones and his head, I will go with you so you can look at them. I said: By Allah, I would love that. So he rode with me to a large forest in which were huge trees. He led me to a tree under which his bones and head had fallen. I saw his head like a large beehive (299). Behold, his ribs were larger than the clusters of date palms (300), and likewise the bones of his legs and arms. I marveled at him and departed. He said...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 88
  },
  {
    "serial_number": "6278807",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 97,
    "volume_number": 1,
    "text": "...and the King moved from the water called Khaljah to a river called Jawshiz (301) and stayed there for two months. Then he wanted to travel, so he sent to a people called Suwaz (302) ordering them to travel with him. They refused him and separated into two parties: a party with his son-in-law, who had become king over them and whose name was Wyrgh (303). The King sent to them saying: 'Allah, Mighty and Majestic, has bestowed Islam and the state of the Commander of the Faithful upon me, so I am his slave, and this nation has invested me with authority. Whoever opposes me, I will meet him with the sword.' The other party was with a king from a tribe known as the King of Eskel (304). He was in his obedience, except that he had not entered into Islam. When he sent this message to them, they feared his side, so they traveled all together with him to the River Jawshiz. It is a river of small width, its width being five cubits. Its water is up to the navel, and in some places to the collarbone (305), and most of it is a man's height. Around it are many trees of Khadang (306) and others. Near it is a vast desert; they mention that in it is an animal smaller than a camel in size but larger than a bull. Its head is the head of a camel, its tail the tail of a bull, its body the body of a mule, and its hooves like the cloven hooves of a bull. It has in the middle of its head a single thick round horn; the higher it gets, the thinner it becomes until it becomes like the spearhead. Some of them are five cubits long, to three cubits, to more or less. It grazes (307) on the leaves of trees of good greenness. If it sees a horseman, it heads for him. If he has a fast horse under him, he is safe from it with effort. If it catches him, it takes him from the back of his beast with its horn, then tosses (308) him in the air and meets him with its horn. It ceases not to do so until it kills him.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 89
  },
  {
    "serial_number": "6278808",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 98,
    "volume_number": 1,
    "text": "It does not interfere with the beast in any way or cause. They seek it in the desert and forests to kill it. That is because they climb the high trees amongst which it is found, and a number of archers with poisoned arrows gather for that. When it is in their midst, they shoot it until they weaken it and kill it. I saw with the King three large bowls (309) resembling Yemeni Onyx (310). He informed me that they were made from the base of the horn of this animal. Some people of the country mentioned that it is the Rhinoceros (Karkaddan) (311). He said: I did not see a person among them who has a red complexion; rather, most of them are sickly. Perhaps most of them die of colic (312), so that it even happens to the nursing infant among them. If a Muslim dies among them, or the husband of a Khwarazmian woman, they wash him with the washing of the Muslims, then carry him on a wagon that drags him, with a spear (313) in front of him, until they reach the place where they bury him. When they reach it, they take him off the wagon and put him on the ground. Then they draw a line around him and aim it, then dig his grave inside that line, make a niche (Lahd) for him, and bury him. They do likewise with their dead. Women do not weep over the dead; rather, the men among them weep over him. They come on the day he died, stand at the door of his tent, and shout with the ugliest weeping there is and the wildest. These are the free men. When their weeping ends, the slaves come with braided leather strips (314). They cease not to weep and strike their sides and what is visible of their bodies with those straps until it becomes like the stroke of a whip on their bodies. They must set up a spear at the door of his tent and bring his weapons and place them around his grave. They do not stop weeping for two years. When the two years end, they take down the spear and cut from their hair. The relatives of the dead person call for a banquet...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 90
  },
  {
    "serial_number": "6278809",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 99,
    "volume_number": 1,
    "text": "...by which his exit from grief is known. If he had a wife, she marries. This is if he was one of the chiefs. As for the common people, they do some of this with their dead. Upon the King of the Saqaliba [Volga Bulgars] is a tax he pays to the King of the Khazars: from every house in his kingdom, a sable skin. If a ship arrives from the land of the Khazars to the land of the Saqaliba, the King rides out, counts what is in it, and takes from everything the tithe (tenth) (315). If the Rus or others of the rest of the races arrive with slaves (316), the King has the right to choose one head from every ten heads. The son of the King of the Saqaliba is a hostage with the King of the Khazars. News had reached the King of the Khazars about the beauty of the daughter of the King of the Saqaliba, so he sent asking for her hand. He [the Bulgar King] made excuses to him and refused him. So he sent and took her by force, and he is a Jew while she is a Muslim, so she died with him. Then he sent asking for another daughter of his. The moment that reached the King of the Saqaliba, he hastened and married her to the King of Eskel, who is under his authority, for fear that he would snatch her from him as he did with her sister. The only thing that prompted the King of the Saqaliba to correspond with the Sultan and ask him to build a fortress for him was fear of the King of the Khazars. He said: I asked him one day, saying: \"Your kingdom is vast, your wealth is abundant, and your revenue is much; so why did you ask the Sultan to build a fortress with money from him which is of no amount [to you]?\" He said: \"I saw the State of Islam is rising, and their wealth is taken from its lawful source. So I sought that for this reason. Had I wanted to build a fortress from my own wealth of silver or gold, that would not have been difficult for me. I only sought blessing by the money of the Commander of the Faithful, so I asked him for that.\"",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 91
  },
  {
    "serial_number": "6278810",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 100,
    "volume_number": 1,
    "text": "The Rus (317). He said: I saw the Rus when they arrived in their trade and camped by the river...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 92
  },
  {
    "serial_number": "6278811",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 101,
    "volume_number": 1,
    "text": "Itil [Volga], and I have never seen bodies more perfect than theirs. They are like palm trees, blond, reddish. They do not wear...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 93
  },
  {
    "serial_number": "6278812",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 102,
    "volume_number": 1,
    "text": "...tunics (318) nor caftans (319). Rather, the man among them wears a cloak with which he covers one of his sides and brings out one of his hands from it. With every one of them is an axe, a sword, and a knife; all of what we mentioned does not leave him. Their swords are broad plates (320), grooved (321), Frankish (322). From the tip of the fingernail of one of them to his neck is green [tattoos] of trees and images (323) and other things. Every woman among them has a box (324) on her breast, fastened either of iron, silver, copper, or gold, according to the wealth of her husband and his amount. In every box is a ring with a knife fastened to the breast as well. Around their necks are necklaces of gold and silver, for if the man possesses ten thousand dirhams, he fashions a necklace for his wife; if he possesses twenty thousand, he fashions two necklaces for her; and likewise, every ten thousand increases a necklace for his wife. Thus, one of them might have many necklaces around her neck.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 94
  },
  {
    "serial_number": "6278813",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 103,
    "volume_number": 1,
    "text": "The most magnificent ornament to them is green beads (325) made of clay (326) which are found on ships. They exaggerate regarding them and buy a bead for a dirham and string them as necklaces for their women. They are the filthiest of Allah's creation. They do not clean themselves after excrement or urine, nor do they wash themselves from impurity (Janabah), nor do they wash their hands after food; rather, they are like wandering donkeys. They come from their country and anchor their ships at Itil [Volga], which is a large river, and build large houses of wood on its bank. In one house, ten or twenty, less or more, gather. Each one has a bench (327) he sits on. With them are beautiful slave girls (328) for the merchants. So one has intercourse with his slave girl while his companion looks at him. Perhaps a group of them gathers in this state, some facing others. Perhaps a merchant enters upon them to buy a slave girl from one of them and finds him having intercourse with her, and he does not move away from her until he satisfies his need (329). They must wash their faces and heads every day with the filthiest and most impure water (330). That is because the slave girl arrives every day in the morning with a large bowl (331) containing water. She presents it to her master, and he washes his hands, his face, and the hair of his head in it. He washes it and combs it with a comb into the bowl. Then he blows his nose and spits into it, leaving nothing of filth but that he does it in that water. When he finishes what he needs, the slave girl carries the bowl to the one next to him, and he does like the action of his companion. She ceases not to lift it from one to another until she circles it among all those in the house. Each one of them blows his nose, spits, and washes his face and hair in it. The moment their ships arrive at this anchorage, every one of them goes out carrying bread, meat...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 95
  },
  {
    "serial_number": "6278814",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 104,
    "volume_number": 1,
    "text": "...onions, milk, and Nabidh (fermented drink), until he reaches a long piece of wood set up, having a face resembling the face of a human, and around it are small images (332), and behind those images are long pieces of wood set up in the ground. He reaches the large image and prostrates to it, then says to it: \"O Lord, I have come from a distant land, and with me are such and such number of slave girls, and such and such number of sable skins,\" until he mentions all that he brought of his trade. Then he says: \"And I have come to you with this gift,\" then he leaves what is with him before the piece of wood and says: \"I want you to grant me a merchant with many dinars and dirhams, who will buy from me everything I want and not oppose me in what I say.\" Then he departs. If his sale is difficult and his days [waiting] become long, he returns with a second and third gift. If what he wants is impossible, he carries a gift to every image of those small images and asks it for intercession, saying: \"These are the wives of our Lord, and his daughters, and his sons.\" He ceases not to go to image after image asking it and seeking intercession through it and humbling himself before it. Perhaps the sale is made easy for him and he sells. Then he says: \"My Lord has fulfilled my need, and I need to recompense Him.\" So he intends [to do] what he wants [sic] and does not oppose me in what I say, then he departs to a number of sheep or cows and kills them, gives some of the meat as charity, and carries the rest and throws it before that large piece of wood and the small ones around it. He hangs the heads of the cows or sheep on that wood set up in the ground. When night comes, the dogs arrive and eat all of that. So he says: \"My Lord is pleased with me and has eaten my gift.\" If one of them falls sick, they set up a tent for him away from them and throw him into it, putting some bread and water with him. They do not approach him or speak to him, rather they do not visit him during all the days of his illness, especially...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 96
  },
  {
    "serial_number": "6278815",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 105,
    "volume_number": 1,
    "text": "...especially if he is weak or a slave. If he recovers and stands up, he returns to them. If he dies, they burn him (333). If he was a slave, they leave him in his state to be eaten by dogs and birds of prey. If they catch a thief or a robber, they bring him to a thick tree, tie a strong rope around his neck, and hang him on it. He remains hanging until he falls apart from remaining (334) in the winds and rains (335). It used to be said to me that they do things with their chiefs upon death, the least of which is burning. I wanted to stand upon [witness] that, until the death of a prominent man among them reached me. They placed him in his grave and roofed it over him...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 97
  },
  {
    "serial_number": "6278816",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 106,
    "volume_number": 1,
    "text": "...for ten days until they finished cutting his clothes and sewing them. That is because for a poor man among them, they make a small boat, put him in it, and burn it. As for the rich, they gather his wealth and make it into three thirds: one third for his family, one third with which they cut clothes for him, and one third with which they brew Nabidh (fermented drink) which they drink on the day his slave girl kills herself and is burned with her master. They are addicted (336) to Nabidh, drinking it night and day. Perhaps one of them dies with the cup in his hand. When a chief among them dies, his family says to his slave girls and servants: \"Who among you will die with him?\" One of them says: \"I.\" If she says that, it becomes incumbent upon her; it is not possible for her to ever turn back. Even if she wanted to, she would not be left. Most of those who do this are the slave girls. When that man whom I mentioned died, they said to his slave girls: \"Who will die with him?\" One of them said: \"I.\" So they appointed two slave girls to guard her and be with her wherever she went, to the point that they would wash her feet with their hands. They began his affair, cutting clothes for him, and preparing what he needed. The slave girl every day drank and sang, happy and rejoicing. When it was the day in which he and the slave girl were to be burned, I attended the river where his ship was. Behold, it had been brought out, and four corner posts of Khadang wood and others were made for it. Also, around it was made something like large granaries (337) of wood. Then it was pulled until it was placed on that wood. They approached, going and coming, speaking speech I did not understand. He was still in his grave; they had not brought him out. Then they brought a couch and placed it on the ship and covered it with quilted fabrics (338) of Byzantine brocade (339) and cushions of Byzantine brocade. Then an old woman came whom they call the Angel of Death. She spread the bedding we mentioned on the couch. She is responsible for sewing it and preparing it, and she kills...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 98
  },
  {
    "serial_number": "6278817",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 107,
    "volume_number": 1,
    "text": "...the slave girls. I saw her as a witch (340), huge and grim. When they arrived at his grave, they removed the soil from the wood, removed the wood, and extracted him in the wrapper in which he had died. I saw he had turned black from the cold of the country. They had put Nabidh, fruit, and a lute (341) with him in his grave. They took all of that out. Behold, he had not smelled nor had anything of him changed except his color. So they dressed him in trousers (342), leggings (343), boots (344), a tunic (qartaq), and a caftan of brocade with gold buttons. They put a cap of sable brocade (345) on his head. They carried him until they brought him into the tent (pavilion) which is on the ship, sat him on the mattress, and propped him up with cushions. They brought Nabidh, fruit, and basil and put them with him. They brought bread, meat, and onions and threw them before him. They brought a dog, cut it in two halves, and threw it into the ship. Then they brought all his weapons and placed them by his side. Then they took two horses (beasts), ran them until they sweated, then cut them with the sword and threw their meat into the ship. Then they brought two cows, cut them up as well, and threw them into it. Then they brought a rooster and a hen, killed them, and threw them into it. The slave girl who wanted to be killed went back and forth entering tent after tent of their tents, and...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 99
  },
  {
    "serial_number": "6278818",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 108,
    "volume_number": 1,
    "text": "...the owner of the tent (346) has intercourse with her and says to her: \"Tell your master I only did this out of love for you.\" When it was the time of Asr (afternoon) on Friday, they brought the slave girl to something they had made like a door frame (347). She placed her feet on the palms of the men and looked over that frame. She spoke some words of hers, then they lowered her. Then they raised her a second time, and she did like her action the first time. Then they lowered her and raised her a third time, and she did her action of the two times. Then they handed her a hen; she cut off its head and threw it away. They took the hen and threw it into the ship. I asked the interpreter about her action. He said: \"She said the first time they raised her: 'Behold, I see my father and my mother.' She said the second time: 'Behold, I see all my deceased relatives sitting.' She said the third time: 'Behold, I see my master sitting in Paradise. Paradise is beautiful and green, and with him are men and boys. He calls me, so take me to him.'\" So they passed with her towards the ship. She removed two bracelets that were on her and gave them to the woman called the Angel of Death, who is the one who kills her. She removed two anklets that were on her and gave them to the two slave girls who were serving her, who are the daughters of the woman known as the Angel of Death. Then they raised her onto the ship but did not enter her into the tent. Men came with shields (348) and wood. They handed her a cup of Nabidh; she sang over it and drank it. The interpreter told me: \"She is bidding farewell to her female companions with that.\" Then another cup was handed to her; she took it and prolonged the singing. The old woman was urging her to drink it and to enter the tent in which her master was. I saw her dazed (349). She wanted to enter the tent but put her head between it and the ship, so the old woman took her head...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 100
  },
  {
    "serial_number": "6278819",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 109,
    "volume_number": 1,
    "text": "...and put it into the tent, and she entered with her. The men began to strike with the wood on the shields so that the sound of her screaming would not be heard, lest other slave girls become terrified and not seek death with their masters. Then six men entered the tent and all had intercourse with the slave girl. Then they laid her down beside her master. Two held her feet and two her hands. The old woman called the Angel of Death put a looped rope around her neck and gave it to two to pull it. She advanced with a broad-bladed dagger and began thrusting it between her ribs, place after place, and pulling it out, while the two men strangled her with the rope until she died. Then the closest relative to that dead man arrived, took a piece of wood, and lit it with fire. Then he walked backward towards the ship, his face to the people and the lit wood in one hand, and his other hand on his anus, being naked, until he ignited the stacked wood beneath the ship after they had placed the slave girl they killed beside her master. Then the people arrived with wood and firewood. Each one had a piece of wood with its head aflame; he threw it into that wood. The fire took hold in the firewood, then in the ship, then in the tent, the man, the slave girl, and everything in it. Then a great, terrible wind blew, so the flame of the fire intensified and its blazing flared (350). A man from the Rus was beside me. I heard him speak to the interpreter who was with me. I asked him what he said to him. He said: \"He says: 'You Arabs are fools.'\" I said: \"Why is that?\" He said: \"You take the most beloved of people to you and the most honored among you and throw him into the dust, so the dust, vermin, and worms eat him. We burn him with fire in an instant, so he enters Paradise at his very moment and hour.\" Then he laughed excessively. I asked about that. He said: \"Out of the love of his Lord for him, He sent the wind so it would take him in an hour.\" Indeed, an hour did not pass until the ship, the firewood, the slave girl, and the master became ash and dust. Then they built upon the place of the ship—and they had pulled it out of the river—something resembling a round mound.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 101
  },
  {
    "serial_number": "6278820",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 110,
    "volume_number": 1,
    "text": "...and they set up in the middle of it a large piece of Khadang wood (351) and wrote on it the name of the man and the name of the King of the Rus, and they departed (352). He said: It is the custom of the King of the Rus to have with him in his palace four hundred men from the brave warriors...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 102
  },
  {
    "serial_number": "6278821",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Ibn Fadlan's Journey to the Lands of the Turks, the Rus, and the Slavs",
    "edition": "First, 2003 AD",
    "publisher": "Al Suwaidi Publishing, Abu Dhabi",
    "page_number": 111,
    "volume_number": 1,
    "text": "His companions and those he trusts with him—when he dies, they die with him and are killed on his behalf. Each of them has a slave girl who serves him, washes his head, and prepares his food and drink. Another slave girl is given to him for sexual purposes. These four hundred men sit beneath his bed, whose bed is grand and inlaid with precious gems. On the bed itself, forty slave girls sit for his comfort, and he may engage sexually with any one of them in the presence of the companions mentioned above. He never dismounts from his bed; if he needs to relieve himself, he does so in a basin. If he wishes to ride, his mount is brought to the bed and he mounts from it; if he wishes to dismount, the mount is brought to him so that he descends directly onto it. He has a deputy who commands the armies, confronts the enemies, and administers his subjects. As for the Khazars, the king, named Khaghan, appears only once every four months in public, and he is called...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 103
  },
  {
    "serial_number": "6278822",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 115,
    "volume_number": 1,
    "text": "The Great Khagan. His deputy is called Khagan Beh, and he is the one who leads the armies, manages them, governs the affairs of the kingdom, undertakes them, appears, and conducts raids. The kings who neighbor him submit to him. He enters upon the Great Khagan every day humbly, displaying submissiveness and tranquility. He does not enter upon him except barefoot, carrying wood in his hand. When he greets him, he lights that wood before him. When he finishes lighting it, he sits with the King on his throne to his right. He is succeeded by a man called Kunda Khagan, and this one is succeeded...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 104
  },
  {
    "serial_number": "6278823",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 116,
    "volume_number": 1,
    "text": "...by a man called Jawshighar. The custom of the Great King is that he does not sit for the people, nor does he speak to them, and no one enters upon him except those we have mentioned. The authority to bind and loose, to punish, and to manage the kingdom belongs to his deputy, Khagan Beh. It is the custom of the Great King that when he dies, a great house is built for him containing twenty chambers. A grave is dug for him in each of the chambers. Stones are broken until they become like kohl (powder) and are spread therein, and quicklime is thrown over that. Beneath the house is a river, and the river is a large flowing river. They place the grave over that river and say: 'So that no devil, human, worm, or creeping thing can reach him.' When he is buried, the necks of those who buried him are struck so that it is not known in which of those chambers his grave is. His grave is called 'Paradise,' and they say: 'He has entered Paradise.' All the chambers are carpeted with brocade woven with gold. The custom of the King of the Khazars is to have twenty-five wives; each wife is the daughter of one of the kings who border him, taken either voluntarily or by force. He has sixty concubines for his bed, each of them possessing surpassing beauty. Each of the freeborn wives and the concubines is in a separate palace having a dome covered with teak. Around each dome is an enclosure. Each one of them has a servant (eunuch) who guards her. If he wants to have intercourse with one of them, he sends for the servant guarding her, and he brings her in...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 105
  },
  {
    "serial_number": "6278824",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 117,
    "volume_number": 1,
    "text": "...faster than the blink of an eye, placing her in his bed. The servant stands at the door of the King's dome. When he has intercourse with her, he takes her hand and departs, and does not leave her for a single moment after that. When this Great King rides out, all the armies ride out for his riding. There is a mile between him and the procession. None of his subjects sees him without falling to his face, prostrating to him, not lifting his head until he has passed. The duration of their kingship is forty years. If he exceeds it by a single day, the subjects and his elite kill him, saying: 'This one's mind has diminished and his judgment has become confused.' If he sends out a military detachment, it does not turn its back (retreat) for any reason or cause. If it is defeated, everyone who returns from it is killed. As for the commanders and his deputy, if they are defeated, he brings them, and brings their wives and children, and gives them away to others in their presence while they watch. Likewise [he confiscates] their beasts, their goods, their weapons, and their houses. Sometimes he cuts each one of them into two pieces and crucifies them. Sometimes he hangs them by their necks from trees. Sometimes, if he shows them kindness, he makes them grooms (stablemen). The King of the Khazars has a great city on the river Itil [Volga]. It has two sides: on one side are the Muslims, and on the other side are the King and his companions. Over the Muslims is a man from the King's pages called Khazz, and he is a Muslim. The legal judgments regarding Muslims residing in the land of the Khazars and those visiting them for trade...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 106
  },
  {
    "serial_number": "6278825",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 118,
    "volume_number": 1,
    "text": "...are referred to that Muslim page. No one else looks into their affairs or judges between them.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 107
  },
  {
    "serial_number": "6278826",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 123,
    "volume_number": 1,
    "text": "Appendix: Ibn Fadlan\nIgnatius Krachkovsky\n\n...In contrast to this, a number of travelers emerged in his era who visited regions close to the Soviet Union and gained wide fame thanks to the descriptions of the journeys they left behind, although one of them enjoyed some reputation as a poet as well. Ibn Fadlan occupies the first place among them, whether in terms of chronology or intrinsic importance, due to his famous Epistle (Risala), interest in which has been renewed in recent years to the same degree it enjoyed for the first time one hundred and twenty years ago. This work is undoubtedly worthy of this attention, especially at the present time after it has become, for the first time, accessible to everyone in a nearly complete edition. In it, we find a work that is interesting for its era; it provides us with a vivid picture of the political conditions in the Islamic world and the relations between the lands of Islam and the countries bordering them in Central Asia or the remote regions that represented the edges of the civilized world at that time, such as the Volga basin. The Epistle is full of very valuable and uniquely diverse ethnographic material, touching on a number of nomadic Turkish tribes inhabiting Central Asia, and a number of peoples who were playing a fundamental role in the history of Eastern Europe at that time, such as the Bulgars, the Rus, and the Khazars. Its literary value, smooth narrative style, and vivid imagery language, which is not devoid from time to time of some humor that perhaps was unintentional, cannot be denied. This embassy was prepared at the request of the Volga Bulgars, who sent a messenger to the capital of the Caliphate requesting aid against the pressure of the Khazars on them from the south, and that someone be sent to them to instruct them in religion and acquaint them with the rituals of Islam, which they had embraced not long before. An embassy was sent to them under the leadership of Sawsan al-Rassi, among whose members was Ahmad ibn Fadlan as an expert jurist; and although there is no information about him, he always attempts...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 108
  },
  {
    "serial_number": "6278827",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 124,
    "volume_number": 1,
    "text": "...in the \"Epistle\" to attribute the leading role to himself. This embassy left Baghdad on the eleventh of Safar in the year 309 AH (June 21, 921 AD) and arrived in Bulgar on the eighteenth of Muharram in the year 310 AH (May 12, 922 AD). On its way, it passed through Hamadan [Iran], Rayy [Iran], Nishapur [Iran], Merv [Turkmenistan], and Bukhara [Uzbekistan], where Ibn Fadlan met in September of 921 AD with the vizier of the Samanids and the famous geographer Al-Jayhani. Then they traveled along the Jayhun [Amu Darya] river to Khwarazm [Khiva] near the Aral Sea and crossed the Ust-Urt plateau, then the Yayiql [Ural] river, arriving at the Volga basin. As for the date and route of the return, it is not known to us because the conclusion of the \"Epistle\" has been lost. It is natural that scholars of the North were the first to draw the attention of scientific circles in Europe to Ibn Fadlan; this happened in Denmark and Russia. His journey remained known for a long time only through Yaqut, who preserved a large part of it in his geographical dictionary. Then the Russian Orientalist Fraehn devoted a magnificent study to it, which was like a brilliant opening in the history of Russian Arabism, and it remained for nearly eighty years unsurpassed, and even stimulated the appearance of a number of studies by representatives of various scientific trends; among them, the research of Rosen and Barthold occupied a prominent place. The discovery of the Mashhad manuscript in the 1920s led to a noticeable expansion of material on Ibn Fadlan, and if we disregard its missing conclusion, this latest manuscript enables us for the first time to judge the Epistle in its complete form. The study of Ibn Fadlan soon entered a new phase thanks to the research carried out by A.P. Kovalevsky (1939). It is, of course, impossible to assert that all issues related to the text of the Epistle have been finally resolved, but the existence of the Mashhad manuscript will prevent, in any case, the repetition of such errors that crept into the works of Hennig, who always attributes to Ibn Fadlan the narratives of the Persian author Aufi who lived in the early thirteenth century. Despite the scarcity of information about the person of Ibn Fadlan, there has been no doubt whatsoever about the authenticity of the attribution of the Epistle to him. And if some have expressed doubt from time to time...",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 109
  },
  {
    "serial_number": "6278828",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [UAE]",
    "page_number": 125,
    "volume_number": 1,
    "text": "...regarding it, as the archaeologist Spitzin did, that usually touches upon some details and does not stand up to the test of rigorous criticism.\n\nFrom the book \"History of Arabic Geographical Literature\", Part One\nTranslated by Salah al-Din Uthman Hashim, printed in Cairo 1961.",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 110
  },
  {
    "serial_number": "6278829",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 127,
    "volume_number": 1,
    "text": "Civilizational Index and Indices",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 111
  },
  {
    "serial_number": "6278830",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 129,
    "volume_number": 1,
    "text": "Names (Al-A'lam)\n\n(Alif)\nIbn al-Furat 41, 46, 47\nIbn Qarin 44\nAtrak bin al-Qatghan 67, 68\nAhmad bin Ali, brother of Sa'luk 44\nAhmad bin Musa al-Khawarizmi 46, 47\nAlmish bin Shilki 69\nAlmish bin Yiltawar: King of the Saqaliba 37\nIlghuz 69\n\n(Ba)\nBaris al-Saqlabi 42, 60, 85\n\n(Ta)\nTakin al-Turki 42, 48, 60, 61, 85, 94\n\n(Jim)\nJa'far (Al-Muqtadir) 38, 78, 80\nJa'far bin Abdullah, Prince of Bulgar 80\nAl-Jayhani 46\n\n(Ha)\nHamid bin al-Abbas, the Vizier 76\nHamawayh Kusa, Commander of the Army of Khurasan 45",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 112
  },
  {
    "serial_number": "6278831",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 130,
    "volume_number": 1,
    "text": "(Kha)\nKhagan (King of the Khazars) 111\n\n(Dal)\nAl-Da'i (The Caller) 44\n\n(Sin)\nSawsan al-Rassi: Client of Nadhir al-Harami 42, 76, 85\n\n(Ta)\nTalut (Saul) 93\nTahir bin Ali 45\nTarxan 69, 70\n\n(Ayn)\nAbdullah bin Bashtu al-Khazari 42, 47, 48\nAli bin Abi Talib 50\nIsa bin Maryam (Jesus son of Mary) 80\n\n(Fa)\nAl-Fadl bin Musa al-Nasrani, Agent of Ibn al-Furat 46, 47\n\n(Qaf)\nQalwas (One of Ibn Fadlan's guides) 60",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 113
  },
  {
    "serial_number": "6278832",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 131,
    "volume_number": 1,
    "text": "(Kaf)\nKunda Khagan 115\nKutharkin 65, 66, 67\n\n(Lam)\nLayla bin Nu'man 45\n\n(Mim)\nMuhammad bin Iraq Khwarazm Shah: Emir of Khwarazm 48\nKing of Eskel 97\nKing of the Turks 65, 67\nKing of the Saqaliba 37, 42, 48, 75, 93, 99\nKing of Bulgar 78\n\n(Nun)\nNadhir al-Harami 39, 42, 48, 68, 76\nNasr bin Ahmad 46\n\n(Waw)\nWyrgh 97\n\n(Ya)\nYajuj and Majuj (Gog and Magog) 95\nYabghu 67\nYaghindi (River) 70, 72\nYanal the Younger 65, 70",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 114
  },
  {
    "serial_number": "6278833",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 132,
    "volume_number": 1,
    "text": "Races and Tribes\n\n(Ba)\nAl-Bashghird [Bashkirs] 71, 73\nAl-Baranjar 93\nBulgar 78, 80\nAl-Banjak Tribe [Pechenegs] 72\n\n(Ta)\nAl-Turk [Turks] 48, 59, 61, 62, 64, 65, 67, 68, 69, 92\n\n(Kha)\nAl-Khazar [Khazars] 69, 70, 93, 99, 103, 111, 116, 117\n\n(Ra)\nAl-Raqiq (Slaves) 99\nAl-Rus [Rus/Varangians] 99, 110\n\n(Sin)\nSuwaz (A people) 97\n\n(Sad)\nAl-Saqaliba [Slavs/Volga Bulgars] 37, 42, 48, 75, 93, 99",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 115
  },
  {
    "serial_number": "6278834",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 133,
    "volume_number": 1,
    "text": "(Kaf)\nAl-Kurdaliyah 50\n\n(Nun)\nAl-Nasara (Christians) 80\n\n(Waw)\nWisu 84, 92, 95\n\n(Ya)\nYajuj and Majuj (Gog and Magog) 95, 96\nThe Jews 80\n\nPlaces\n\n(Alif)\nArthakhshmithin 40, 46\nArdaku 50\nAfrir 45\nAmul [Amul, Turkmenistan] 45\n\n(Ba)\nBab al-Turk [Gate of the Turks] 47, 61\nBukhara [Bukhara, Uzbekistan] 46, 48\nBilad al-Khazar [Land of the Khazars] 93, 99, 117\nBaykand [Paikend] 46, 47",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 116
  },
  {
    "serial_number": "6278835",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 134,
    "volume_number": 1,
    "text": "(Jim)\nAl-Jurjaniyah [Konye-Urgench] 49, 60, 64, 75\n\n(Ha)\nHulwan [Sarpol-e Zahab] 43\nHayy Kutharkin (Camp of Kutharkin) 65\n\n(Kha)\nKhurasan 45, 46, 47, 49, 81\nKhaljah 93\nKhuwar al-Rayy 44\nKhwarazm 41, 47, 48, 49, 61, 65, 66\n\n(Dal)\nAl-Damghan [Damghan] 44\nAl-Daskara 43\n\n(Ra)\nAl-Rusiyyah [Land of the Rus] 100, 109\nAl-Rayy [Ray] 43\n\n(Zay)\nZamjan (Ribat) 60\n\n(Sin)\nSawah [Saveh] 43\nSarakhs 45, 74\nSemnan 44, 45",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 117
  },
  {
    "serial_number": "6278836",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 135,
    "volume_number": 1,
    "text": "(Qaf)\nQarmisin (which is the Arabization of Kermanshah) 43\nQashmahan 45\n\n(Mim)\nMadinat al-Salam [Baghdad] 43, 47, 60\nMerv 45, 47\nMafazat Amul (Desert of Amul)\n\n(Nun)\nAl-Nahrawan 43\nNaysabur [Nishapur] 45\n\n(Ha)\nHamadhan [Hamadan] 43",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 118
  },
  {
    "serial_number": "6278837",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 136,
    "volume_number": 1,
    "text": "Terrains and Geography\n\n(Ghayn)\nAl-Ghaydah (The Thicket) 86\n\n(Nun)\nNahr Itil [Volga River] 93, 95, 101, 117\nNahr Akhti [River Akhti] 72\nNahr Adhil [River Adhil] 72\nNahr Arkhaz [River Arkhaz] 73\nNahr Ardan [River Ardan] 72\nNahr Uram [River Uram] 74\nNahr Uran [River Uran] 74\nNahr Bajagh [River Bajagh] 73\nNahr Bayanakh [River Bayanakh] 74\nNahr Jakha [River Jakha] 73\nNahr Jakhish [River Jakhish] 72\nNahr Jam [River Jam] 72\nNahr Jawshiz [River Jawshiz] 74, 97\nNahr Jarmashan [River Cheremshan] 74\nNahr Jayhun [Amu Darya] 45, 50, 58\nNahr Jaykh [Ural River] 72\nNahr Samur [River Samara] 73\nNahr Sukh [River Sok] 73\nNahr Kinal [River Kinel] 73\nNahr Kinjlu [River Kinjlu] 73",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 119
  },
  {
    "serial_number": "6278838",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 137,
    "volume_number": 1,
    "text": "Nahr Niyasnah [River Niyasnah] 74\nNahr Warish [River Warish] 72\nNahr Watba [River Watba] 72\nNahr Watigh [River Watigh] 74\n\nPlants\n\n(Ba)\nShajar al-Bunduq (Hazelnut trees) 86\n\n(Ta)\nTuffah (Apple) 85\n\n(Ha)\nAl-Hintah (Wheat) 86\n\n(Ra)\nRumman Amlisi (Seedless Pomegranate) 85\n\n(Sin)\nAl-Saj (Teak) 116\n\n(Shin)\nAl-Sha'ir (Barley) 86",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 120
  },
  {
    "serial_number": "6278839",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 138,
    "volume_number": 1,
    "text": "Animals\n\n(Alif)\nWazzah (Goose) 69\n\n(Ba)\nAl-Bighal (Mules) 51\n\n(Ta)\nTays (Billy goat) 67, 87\n\n(Tha)\nAl-Thawr (Bull) 97\nAl-Tha'lab al-Aswad (Black Fox) 92\n\n(Jim)\nAl-Jimal al-Turkiyah (Turkish Camels) 58, 70\n\n(Ha)\nAl-Hamir (Donkeys) 51\nAl-Hayyat (Snakes) 74, 85\n\n(Kha)\nAl-Khayl (Horses) 51",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 121
  },
  {
    "serial_number": "6278840",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 139,
    "volume_number": 1,
    "text": "(Zay)\nAl-Zarazir (Starlings) 49\n\n(Sin)\nAl-Samak (Fish) [Fish oil] 74, 87, 96\nSammur (Sable) 86, 92, 99, 104\n\n(Shin)\nAl-Shah (Sheep) 64\n\n(Dad)\nAl-Dafadi' (Frogs) 50\n\n(Ayn)\nAl-Ijl (Calf) 51\n\n(Kaf)\nAl-Kuraki (Cranes) 74\nAl-Karkadann (Rhinoceros) 98\nAl-Kilab (Dogs) 85, 104, 105\n\nMaterials and Minerals\n\n(Jim)\nJulud Adim (Tanned leather) 68\nJulud al-Jimal (Camel skins) 58, 70",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 122
  },
  {
    "serial_number": "6278841",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 140,
    "volume_number": 1,
    "text": "(Ha)\nAl-Hadid (Iron) 48\nHatab al-Tagh (Tagh firewood - Saxaul) 52, 61\n\n(Kha)\nKhashab al-Khadank (Khadang wood - Birch/Poplar) 70, 88, 97, 106\n\n(Nun)\nAl-Nurah (Lime/Quicklime) 116\n\nTools and Means\n\n(Alif)\nAl-Anabir (Granaries/Barns) 106\n\n(Ba)\nBuyut Sha'r (Hair tents) 62\n\n(Ha)\nHarraqah (Fire ship/striker) 52\n\n(Kha)\nKhabiyah (Jar) 81\n\n(Sin)\nSakharikh (Vessels) 86",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 123
  },
  {
    "serial_number": "6278842",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 141,
    "volume_number": 1,
    "text": "Sa'ah Qiyasiyyah (Measuring clock/Sundial) 82\nAl-Sufur: pl. Sufrah (Travel bags/rafts) 58, 72\nAl-Safinah (Ship) 48, 99, 106, 107, 108, 109\nSikkin (Knife)\n\n(Shin)\nShabbah (Alum/Bronze) 48\n\n(Sad)\nSafa'ih Mushattabah Ifranjiyyah (Frankish ridged plates/blades) 102\nAl-Sufr (Yellow Copper/Brass) 47\n\n(Ta)\nTasht (Basin) 111\nTunbur (Lute) 107\nTayfuriyat (Serving dishes) 98\n\n(Ayn)\nAjalah (Cart) 51\n\n(Fa)\nFa's (Axe) 102\nAl-Farsh al-Armani (Armenian bedding/carpets) 87\n\n(Qaf)\nQaddahah (Flint/Fire striker) 92",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 124
  },
  {
    "serial_number": "6278843",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 142,
    "volume_number": 1,
    "text": "Qas'ah (Bowl) 103\nAl-Qafir (Basket/Hive) 96\n\n(Kaf)\nKuz (Mug) 88\n\n(Mim)\nMithqal (Weight unit) 68\nAl-Marasid (Observatories/Watchposts) 47\nAl-Masanid (Cushions) 106\nAl-Musht (Comb) 103\nAl-Mudarraqat (Quilted coats) 106\nMitrad (Spear) 75, 98\n\nWeapons\n\n(Sin)\nAl-Tiras (Shields) 108, 109\nAl-Siham al-Masmuumah (Poisoned arrows) 98\n\nCurrency\n\n(Ha)\nHabbah (Grain - weight) 64\n\n(Dal)\nAl-Darahim al-Samarqandiyah (Samarkand Dirhams) 48",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 125
  },
  {
    "serial_number": "6278844",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 143,
    "volume_number": 1,
    "text": "Darahim Tazijah (Fresh Dirhams) 49\nAl-Darahim al-Ghitrifiyyah (Ghitrifir Dirhams) 47, 48\nDarahim Muzayyafah (Counterfeit Dirhams) 49\nAl-Dawwamat (Spinning tops/Beads) 49\nDinar Musayyabiyyah (Musayyabi Dinars) 60, 68\n\n(Zay)\nAl-Zuyuf: Dirhams (Bad coins) 49\n\n(Kaf)\nAl-Ki'ab (Dice/Knucklebones) 49\n\nJewelry and Gems\n\n(Jim)\nAl-Jaza' al-Yamani (Yemeni Onyx/Agate) 98\n\n(Kha)\nAl-Kharaz al-Akhdar (Green beads) 103\n\nClothing\n\n(Alif)\nAthwab Harir (Silk garments) 68\n\n(Ba)\nBaybaf (Fabric) 70",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 126
  },
  {
    "serial_number": "6278845",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 144,
    "volume_number": 1,
    "text": "Burnus (Hooded cloak) 59\nBustin (Sheepskin/Fur coat) 58, 59, 67\n\n(Tha)\nThawb Khawarizmi (Khwarazmian garment) 63\nThawb Dibaj (Brocade garment) 68\nThiyab Marwiyyah (Mervian garments) 68\n\n(Jim)\nAl-Jibab (Jubbahs) 58\nJulud Madfurah (Braided leather straps) 98\n\n(Kha)\nKhuff (Boot) 59, 107\nKhuff Adim (Leather boot) 68\nKhuff Kimakht (Shagreen boot) 59\nKhaftan Jurjani (Jurjani Caftan) 66\nKhaftan Marwi (Mervian Caftan) 77\n\n(Ra)\nRan (Gaiters) 59\n\n(Sin)\nSarawil (Trousers) 107\nSarawil Taq (Single trousers) 59\nAl-Suyur (Belts/Straps) 98",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 127
  },
  {
    "serial_number": "6278846",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 145,
    "volume_number": 1,
    "text": "(Fa)\nAl-Fara: pl. Farwah (Furs) 58\n\n(Qaf)\nQartaq (Tunic) 59, 66, 68, 69, 70, 73, 107\nAl-Qalanis (Caps) 87\n\n(Lam)\nLabbadah (Felt coat) 59\nLubud Turkiyah (Turkish felts) 58\n\n(Mim)\nMubattan (Lined trousers) 59\nMintaqah (Belt)\nMiqna'ah (Veil) 64, 68\n\nFood and Drink\n\n(Ba)\nBasal (Onion) 104, 701\nBakand meaning Bread 52, 66\n\n(Ta)\nTuffah (Apple) 85\n\n(Jim)\nAl-Jawars (Millet) 59, 75, 86",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 128
  },
  {
    "serial_number": "6278847",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 146,
    "volume_number": 1,
    "text": "(Kha)\nKhall al-Khamr (Wine vinegar) 85\n\n(Dal)\nDuhn al-Samak (Fish oil) 74, 78, 96\n\n(Ra)\nRumman Amlisi (Seedless Pomegranate) 85\n\n(Zay)\nZayt (Oil) 87\n\n(Sin)\nAl-Saju (Mead) 77\n\n(Shin)\nNabidh al-Asal (Honey wine) 86\nAl-Sha'ir bi-l-Lahm (Barley with meat - a type of food) 87\nShiraj (Sesame oil) 87\n\n(Ayn)\nAsal (Honey) 86\n\n(Fa)\nFulful (Pepper) 64",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 129
  },
  {
    "serial_number": "6278848",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 147,
    "volume_number": 1,
    "text": "(Lam)\nLaban (Milk) 68, 104\nAl-Lahm al-Mashwi (Grilled meat) 76\n\n(Nun)\nNabidh (Fermented drink/Wine) 65, 66, 86, 104, 106, 107, 108\nAl-Namaksud (Dried salted meat) 59\n\nCustoms\n\n(Lam)\nAl-Liwat (Sodomy) 65\n\n(Nun)\nNatf al-Liha (Plucking beards) 67, 69\n\nDiseases and Disasters\n\n(Qaf)\nAl-Qawlanj (Colic) 98\n\nDrugs, Perfumes and Incense\n\n(Mim)\nMisk (Musk) 68",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 130
  },
  {
    "serial_number": "6278849",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 148,
    "volume_number": 1,
    "text": "Industries\n\n(Kha)\nAl-Khazaf (Pottery/Ceramics) 103\n\n(Dal)\nAl-Dibaj al-Rumi (Roman/Byzantine Brocade) 76, 87, 106\n\nFacilities\n\n(Ha)\nAl-Hammam (The Bathhouse) 52\n\n(Kha)\nAl-Khanat (Inns/Caravanserais) 47",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 131
  },
  {
    "serial_number": "6278850",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 149,
    "volume_number": 1,
    "text": "Terms\n\n(Ba)\nAl-Badhraqah: Guards/Escort men 47\nBir Tangri: Turkish for The One Allah 62\n\n(Ta)\nAl-Turjuman (The Interpreter) 63, 68, 76, 81, 108, 109\n\n(Jim)\nJawshighar 116\nAl-Jarayah (Daily ration/salary) 40\nJawan Birah (or Jawan wa Birah, or Jawanbirah as in Dozy): The Witch/Sorceress 107\nJit (A station) 61\n\n(Ra)\nRatl (Unit of weight) 52\n\n(Fa)\nFarsakh (Parasang) 48, 84",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 132
  },
  {
    "serial_number": "6278851",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Journey of Ibn Fadlan to the Land of the Turks, Rus, and Saqaliba",
    "edition": "First, 2003 AD",
    "publisher": "Dar Al-Suwaidi, Abu Dhabi [United Arab Emirates]",
    "page_number": 151,
    "volume_number": 1,
    "text": "Contents\n\nForeword 7\nIntroduction 11\nRoute of the Journey 35\nText of the Journey 37\nAppendix: Ignatius Krachkovsky 123",
    "foot_note": "None",
    "book_id": "11772",
    "new_page_number": 133
  }
]