[
  {
    "text": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan (Hills of Coral in Mentioning Famous Cities Everywhere)\nAuthor: إسحاق بن الحسين المنجم\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan (Hills of Coral in Mentioning Famous Cities Everywhere)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6871\nbook_title: آكام المرجان في ذكر المدائن المشهورة في كل مكان\nbook_link: https://shamela.ws/book/11568\nbook_id: 11568\nauthor_name: إسحاق بن الحسين المنجم\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1935\nauthor_ID: 1935\neditor: Null\npublisher: عالم الكتب، بيروت\nedition: الأولى، 1408 هـ\npages: 144\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan (Hills of Coral in Mentioning Famous Cities Everywhere)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6265659",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan (Hills of Coral in Mentioning Famous Cities Everywhere)",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Journeys. Book: Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan. Author: Ishaq bin al-Husayn al-Munajjim (Died 4th Century AH). Publisher: Alam Al Kutub, Beirut [Beirut, Lebanon]. Edition: First, 1408 AH. Number of pages: 144 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan. Author: Ishaq bin al-Husayn al-Munajjim (Died 4th Century AH). Publisher: Alam Al Kutub, Beirut [Beirut, Lebanon]. Edition: First, 1408 AH. Number of pages: 144 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Ishaq bin al-Husayn al-Munajjim (Died 4th Century AH). Publisher: Alam Al Kutub, Beirut [Beirut, Lebanon]. Edition: First, 1408 AH. Number of pages: 144 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 144 [Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering matches the printed version]. Publication date in Shamela: 8 Dhu al-Hijjah 1431.\nPublication date in Shamela: 8 Dhu al-Hijjah 1431.\n\nIshaq bin al-Husayn al-Munajjim is semi-unknown; nothing is known about him other than his name. A group of orientalists have conducted some investigations regarding the author, including Minorsky, Armenyakov, and Brockelmann, without reaching a decisive conclusion. The summary of these investigations is that the author lived in the third Hijri century. Another opinion says he lived around 340 AH, and a third opinion is that he lived in a period not exceeding 454 AH, the year in which the city of Marrakesh [Marrakesh, Morocco] was founded, which was not mentioned by him. There are those who said that the author was Andalusian, evidenced by the presence of echoes of the Andalusian dialect in his book Akam al-Marjan.",
    "foot_note": "None\n\nNone",
    "book_id": "11568",
    "new_page_number": 3
  },
  {
    "serial_number": "6265661",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction to the Investigation. In the name of Allah, the Most Gracious, the Most Merciful. Since the twenties of this century, the book (Akam al-Marjan) has remained a subject of research due to the ambiguity surrounding it and its author. The author, Ishaq bin al-Husayn al-Munajjim, is semi-unknown; nothing is known about him except his name. However, we certainly know that the manuscript is Yemeni, written by its scribe \"Ahsan bin Ali bin Ubayd Allah al-Ansi al-Kawkabani,\" which he \"served to the Commander of the Faithful Al-Qasim bin al-Husayn,\" one of the Imams of Yemen, who assumed power from the year 1128 AH until his death in the year 1139 AH. The manuscript concluded with the completion of its copying in the month of Sha'ban 1129 AH. Mrs. Angiolo Codazzi described the Ambrosiana manuscript, stating that it consists of 33 papers measuring 21.5 x 20.1 cm with 12 lines per page. Some stains mixed with the manuscript on papers 5-6 and 30-31, and it is...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 4
  },
  {
    "serial_number": "6265662",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 6,
    "volume_number": 1,
    "text": "...written in Yemeni Naskh script, and it is marred by many errors, while the back of the first paper and the face of the second paper were written in a beautiful Thuluth script «1». The book was published through the efforts of Mrs. Codazzi, but it remained full of errors, whether from words lacking dots or words written incorrectly. However, the major errors that marred this work are what was omitted from the copy, sometimes reaching entire paragraphs, or the omission of definitions of entire cities and provinces. I have attempted in my work to rectify what was omitted and present this compilation in a form that corrects most of the errors that appeared in it. A group of orientalists conducted some investigations regarding the author, including Minorsky, Armenyakov, and Brockelmann, without reaching a decisive conclusion. The summary of these investigations is that the author lived in the third Hijri century. Another opinion says he lived around 340 AH, and a third opinion is that he lived in a period not exceeding 454 AH, the year in which the city of Marrakesh [Marrakesh, Morocco] was founded, which was not mentioned by him. There are those who said that the author was Andalusian, evidenced by...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 5
  },
  {
    "serial_number": "6265663",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 7,
    "volume_number": 1,
    "text": "...the presence of echoes of the Andalusian dialect in his book «2». The matter is made more confusing by his omission of the authors or narrators from whom he took information, with the exception of the mention of the name Qutaybah in his discussion of Isfahan [Isfahan, Iran]. Since I expected there to be an error in the name, I reviewed what Ibn Qutaybah wrote in (Al-Akhbar al-Tiwal) about the conquests of the East, but I found nothing. I returned to examine Andalusian sources, and found Ibn Khaldun declaring his sources by stating that he \"aligns\" in his geographical information \"with what appeared in the book Nuzhat al-Mushtaq fi Ikhtiraq al-Afaq, which was authored by Al-Alawi Al-Andalusi Al-Hamoudi for the King of Sicily from the Franks, who is Roger [Roger II], when he was staying with him in Sicily after Sicily exited the Emirate of Malaga. His authorship of the book was in the middle of the sixth century, and he collected for it numerous books by Al-Masudi, Ibn Khurdadhbih, Al-Hawqali, Al-Qardi, Ibn Ishaq al-Munajjim, Ptolemy, and others\" «3». As for Al-Idrisi, born in the city of Ceuta [Ceuta, Spain] in the year 493 AH, he declared in \"Nuzhat al-Mushtaq\" his sources \"by seeking what is in the books...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 6
  },
  {
    "serial_number": "6265664",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 8,
    "volume_number": 1,
    "text": "...authored in this art of science as well, all of it. Such as Al-Aja'ib by Al-Masudi, the book of Abu Nasr Sa'id al-Jayhani, the book of Abu al-Qasim Muhammad al-Hawqali al-Baghdadi, the book of Janakh bin Khaqan al-Kimaki, the book of Musa bin Qasim al-Qardi, the book of Ahmad bin Ya'qub known as al-Ya'qubi, the book of Ishaq bin al-Husayn al-Munajjim, and the book of Ptolemy the Claudian...\" «4». Our writer belongs to the school of mathematical geography, the foundations of which were laid by Ptolemy. The rules of this school are summarized by dividing the world into seven climes (regions), and relying on lines of longitude and latitude to locate cities and villages. Ishaq bin al-Husayn clarified his reliance on \"the first line of the earth, which is the line of the West, and the Equator, which is the middle line of the earth.\" Although \"Al-Akam\" appears as a geographical dictionary, the author followed a special approach in which he blended presenting the importance of the city and the cities of a single region, abandoning alphabetical order. He presents the Islamic holy cities first, then returns to Baghdad [Baghdad, Iraq] \"because it is the origin of cities,\" then to Surra Man Ra'a (Samarra) [Samarra, Iraq], which is the second capital of the Abbasids, then to Kufa [Kufa, Iraq], Basra [Basra, Iraq], and Wasit [Wasit, Iraq], the first garrison cities that...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 7
  },
  {
    "serial_number": "6265665",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 9,
    "volume_number": 1,
    "text": "...were built by the Arabs. Then he moves to the south of the Arabian Peninsula, mentioning the city of Sanaa [Sanaa, Yemen] \"may Allah the Almighty protect it,\" then Aden [Aden, Yemen], Oman, Saba, Ma'rib [Marib, Yemen], Hadhramaut [Hadhramaut, Yemen], Socotra [Socotra, Yemen], Bahrain, Hajar, then Taif [Taif, Saudi Arabia] and Al-Yamama. Then the author continues his direction towards the Levant (Bilad al-Sham), and from there to the countries of the Islamic East, to Azerbaijan, Hamadan [Hamadan, Iran], and Nahavand [Nahavand, Iran], then Isfahan [Isfahan, Iran] and Rayy [Rayy, Iran], until he reaches Kerman [Kerman, Iran], Khwarazm, Balkh [Balkh, Afghanistan], Bukhara [Bukhara, Uzbekistan], and Samarkand [Samarkand, Uzbekistan]. What we notice about what he wrote in this section of his geography: A- The author's admiration for both Baghdad and Sanaa. In the first, he is influenced by what he read or quoted from the works of geographers, where the features of Al-Ya'qubi, Ibn Rustah, Ibn Khurdadhbih, Ibn al-Faqih, and Al-Istakhri appear, to the point that entire passages agree with what appeared in those sources. In the second, loyalty to his homeland appears apparent, and if there is an initial assumption saying the author is of Andalusian origin, this does not prevent his sympathy with Yemen, and he likewise provides detailed information about the south of the peninsula. B- In the author's discussion of the Levant, we see him talking about Antioch [Antakya, Turkey] during his discussion of Aleppo [Aleppo, Syria]. Yet he considers it the capital of the Islamic Frontiers, which is what Antioch was before the year 358 AH / 959 AD, the year of its fall into the hands of the leaders of the Emperor...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 8
  },
  {
    "serial_number": "6265666",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 10,
    "volume_number": 1,
    "text": "...Nikephoros Phocas the Byzantine. He talks elsewhere about the successive wars between the Arabs and the Byzantines in (the lands of Sham). C- Beside that, Ishaq bin al-Husayn provides new information that no one before him had presented. He is the first Arab source to mention the Ili River during his discussion of the city of Jurjan, and is almost the only one who indicated that Khwarazm was known as Al-Jurjaniyah. In addition to this, our author provides information about the land tax (Kharaj) of the countries of the East, the origins of their inhabitants, and some industries for which they were famous, with complete brevity, and here he is close to economic geography. In the second section of his geography, our author moves to talk about the regions of Africa. He starts with Alexandria [Alexandria, Egypt], Damietta [Damietta, Egypt], Tinnis, and Misr (Fustat) [Old Cairo, Egypt], then moves to Madyan, and returns to Ain Shams [Heliopolis, Egypt] and Suez (Al-Qulzum) [Suez, Egypt]. Then he moves to North Africa, starting with Tripoli [Tripoli, Libya], then to Sirte [Sirte, Libya] and Ajdabiya [Ajdabiya, Libya], then returns to the Gulf of Aqaba (Ayla) [Aqaba, Jordan], and moves again to Ifriqiya mentioning Kairouan [Kairouan, Tunisia], then to Tahert [Tiaret, Algeria]. Before concluding this section, the author pauses to apologize that he will mention the locations generally and broadly, seeking brevity and abbreviation. After that, he continues to the land of the Berbers, mentioning Tenes [Tenes, Algeria], then moves...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 9
  },
  {
    "serial_number": "6265667",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 11,
    "volume_number": 1,
    "text": "...to Kastiliya [Tozeur region, Tunisia], Fez [Fez, Morocco], Cordoba [Cordoba, Spain], Melilla [Melilla, Spain], Tlemcen [Tlemcen, Algeria], Nakur, Ceuta [Ceuta, Spain], Tangier [Tangier, Morocco], Aghmat [Aghmat, Morocco], and Sijilmasa [Sijilmasa, Morocco] \"the last of the Berber lands.\" Afterwards, the author moves to the land of Sudan, by which he means the Zanj. He mentions some of the lands in Abyssinia [Ethiopia], Mali, and Nubia. Before we move with the author to Europe, we pause to record the following observations: A- That the cities or places mentioned by the author are characterized by being cities deep-rooted in history, or that some of them are historical stations (Alexandria, Misr, Madyan, Carthage, Kairouan, Tinnis). B- Most of the places are characterized by being seaports and centers for maritime trade activity, or they are overland trade stations, and here he touches upon the historical geography of the Islamic world. And if we sense the occurrence of this matter without a declaration from the author, Abu Ubayd al-Bakri al-Andalusi was clear in this regard. In his discussions on North Africa, he would always point to the ports and the corresponding ports on the eastern shores of Andalusia, and he also insisted on highlighting the strong relationship between the ports of both shores.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 10
  },
  {
    "serial_number": "6265668",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 12,
    "volume_number": 1,
    "text": "C- The author did not address the mention of Cairo, which was founded by Jawhar in the year 359 AH and to which Al-Mu'izz the Fatimid moved in the year 362 AH. This is undoubtedly an important event, whether on the political level, with the arrival of Fatimid influence to Egypt and its threatening of the Levant, or on the intellectual level which mandated the establishment of Al-Azhar Mosque as a center for graduating Fatimid preachers and spreading their doctrine. Then the author moves to talk about Andalusia. Here we see him as knowledgeable and observant. He talks about its coastal administrative units, then moves to the interior, and places the region of the Frontiers (Al-Thughur) against what corresponds to it of Christian Spain. This is accompanied by a presentation containing historical information about the conquest of Andalusia. But he stops us with the information he provided about conditions contemporary to him. While talking about Valencia [Valencia, Spain], Ishaq bin al-Husayn said: \"It is near the sea, and its base today is Almeria [Almería, Spain], and it is on the Levantine Sea.\" Then he mentions the city of (Abrara??) and says: \"And its base today is Denia [Dénia, Spain].\" The second part of this discussion contradicts the first part of it, for the slope on the eastern shore from north to south passes by Denia before passing by Almeria. In any case, let us stop at Almeria because it is historically established. It is known that...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 11
  },
  {
    "serial_number": "6265669",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 13,
    "volume_number": 1,
    "text": "...the city of Pechina (Bajana) was the base of the province of Valencia. Pechina is a city established by a group of merchants and Andalusian seafarers who were working between the shores of Andalusia and the Maghreb. They saw that their activity needed support and protection, so they formed a union of merchants, of whom Abu Ubayd mentioned: Al-Karkabi, Abu Aisha, Al-Saqr, and Suhayb. They built a small city next to Tenes on the coast of Algiers and named it \"New Tenes\" «5» in the year 262 AH / 875 AD. A few years later, a group of merchants landed in the port of Oran [Oran, Algeria] and made it an important seaport in the year 290 / 902, and this group moved its activity to the Moroccan shore, establishing several ports, such as Bejaia [Béjaïa, Algeria], Bone (Annaba) [Annaba, Algeria], and Marsa al-Dajaj «6». When the merchants wished to move their trade to their original homeland in Andalusia, they chose the gulf on which the town of Pechina «7» is located, then it became known as Almeria. This area was a feudal estate in the hands of a group of Yemeni Arabs, left to them by the Emirate of Cordoba, on the condition that they protect the coasts from sea raiders, until it became known as \"Arsh al-Yaman\" (Throne of Yemen). Then the merchants obtained the right to establish a walled city. The prosperity of Pechina reached its peak in the era of Al-Nasir (died 355 AH / 961 AD). Where...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 12
  },
  {
    "serial_number": "6265670",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 14,
    "volume_number": 1,
    "text": "...he admired Almeria, so he moved the base of the district to it in the year 344 / 955 and established in it large buildings and facilities, until it became one of the major ports of Andalusia. In the author's discussion of the cities of the Upper Frontier facing Christian Spanish lands, we do not see him alluding to the political change that might have occurred to them. He considers them Muslim lands that have to confront the Christian lands. We can decide that this was in the days of strong rule, meaning in the era of Al-Nasir and his successor Al-Hakam II. Islamic influence extended to the mountainous areas to which the Christians had retreated during the conquest, which is what the author mentions at the conclusion of his discussion on the island of Andalusia. The era of Abd al-Rahman al-Nasir and his son Al-Hakam II is considered the Golden Age of Andalusia, where the Christians of Spain submitted and established good relations with the Muslims, to the point that Cordoba became the destination of Christian Spaniards seeking its arbitration in their disputes. It appeared that the movement of the Christian Reconquista had been curbed with no return. Another observation stops us, which is that the author did not talk about Al-Zahra (Madinat al-Zahra), rather he did not mention it. It is known that its construction began in the year 350 AH and finished in the year 365 AH, which leads to the belief that the author wrote his compilation before its establishment.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 13
  },
  {
    "serial_number": "6265671",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 15,
    "volume_number": 1,
    "text": "After the author finishes with the Andalusian Peninsula, he moves to mention the Christian lands, evidenced by the fact that he left the discussion of Asia Minor previously and placed it within this last section dedicated to Europe, then appended to it the lands of the Khazars, Al-Shash [Tashkent, Uzbekistan], and the non-Muslim Turks. Ibn al-Husayn al-Munajjim begins his discussion about Italy, France, and the lands of the Saqaliba (Slavs), and here reflects the anxiety that prevailed in Europe with the invasions of the Normans and Hungarians. His information here is closely related to the information of the Eastern geographers, and this appears clear in the quotation about Constantinople [Istanbul, Turkey], which is a matter that calls for disappointment. After the impact of the Fatimids on political developments in North Africa was absent from his discussion, we see him again neglecting the Andalusian-Byzantine relations that were active in the fourth Hijri century, except perhaps for a semi-hidden touch of the edge of the subject. While talking about the Byzantines, he says: \"Their kingdom is great, and they are people of might and valor, and they fight the Slavs and the Franks, and the Muslims also fight them in the lands of Sham.\" As for the discussion of the lands of the Khazars and Bulgars, he provides somewhat new information, where we see him closer to what Ibn Fadlan mentioned in his embassy in 309 AH. Now, and in light of what we have presented regarding the absence of some major cities from this dictionary, such as Marrakesh (454 AH), Cairo...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 14
  },
  {
    "serial_number": "6265672",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 16,
    "volume_number": 1,
    "text": "...(359 AH) and Al-Zahra (350-365 AH), we can decide that the author wrote his compilation before 350 AH, and after 344 AH, meaning before the building of Al-Zahra and after Al-Nasir adopted Almeria as the base of the district. As for the manuscript, it is established that it is Yemeni, and we have previously pointed to the relationship between the Yemenis and Andalusia, where the Yemenis landed on the eastern shores of Andalusia, and they were afforded the opportunity to be simultaneously fighters, farmers, and merchants. Whatever confusion in information mars the manuscript, the responsibility does not fall on the author. As for the coordinated information dealing with the Islamic East, it is due to the author's reliance on quoting from previous geographical writings, whereas his information about Africa and the Andalusian Peninsula was more abundant and detailed, despite the author's clear inclination towards brevity in the entirety of his work. Therefore, we tend to say that Ishaq bin al-Husayn al-Munajjim is of Andalusian origin. Meaning that he lived in the Andalusian Peninsula or in the Andalusian commercial colonies on the African shores, and in a final probability, he might be one of the Yemenis who lived in Andalusia and then returned to Yemen, along with the existence of a probability that one of the Yemenis might have transported this manuscript to Yemen. Finally, and at the conclusion of this quick overview, I indicate that I did not wish to detail the relationship between Ishaq bin al-Husayn and those who preceded him, or those who...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 15
  },
  {
    "serial_number": "6265673",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhurah fi Kul Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 17,
    "volume_number": 1,
    "text": "...followed him. I have indicated in the footnotes the places where he meets with them or quotes from them. As for who quoted from him, we have indicated at the beginning of this research Al-Idrisi and Ibn Khaldun. As for the relationship between our author and Abu Ubayd al-Bakri, its place is other than this place, and other than this occasion. And Allah is the Guardian of success. Beirut [Beirut, Lebanon]. Fahmi Sa'ad. January 1988.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 16
  },
  {
    "serial_number": "6265674",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan (Coral Hills in Mentioning Famous Cities Everywhere)",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 23,
    "volume_number": 1,
    "text": "The book \"Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan\" (Coral Hills in Mentioning Famous Cities Everywhere), authored by the Sheikh Ishaq bin al-Husayn al-Munajjim, may Allah cause him to dwell in the gardens of Paradise by the right of Muhammad and his family, and may Allah bless the Prophet and his family.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 17
  },
  {
    "serial_number": "6265675",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "Mention of the Honored City of Mecca [Makkah, Saudi Arabia]\nIn the name of Allah, the Most Gracious, the Most Merciful.\nIshaq bin al-Husayn, may Allah the Exalted have mercy on him, said: We only mentioned Mecca [Makkah, Saudi Arabia] before other lands because it is the Sacred House of Allah, and the first house placed on earth. Its distance from the line of the beginning of the earth is sixty-nine degrees. A degree is thirty-six miles and two-thirds of a mile, and likewise for every degree we mention regarding other cities. Similarly, «1» when we mention the distance from the western line [Prime Meridian of antiquity], we only mean the beginning of the earth, and likewise the distance from the Equator, we only mean the distance from the line of the middle of the earth, in reality, regarding the inhabited part of the earth, because the inhabited part of the earth is very small. Based on what is mentioned regarding the dimensions of cities from the western line and the Equator, one can know some of them from others, and what is between them of...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 18
  },
  {
    "serial_number": "6265676",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "distances, by way of calculation, and knowing that is a great science. So the distance of Mecca [Makkah, Saudi Arabia] from the western line is sixty-seven degrees, and that in miles is four thousand four hundred and twenty-two miles. [And its distance is twenty-three degrees, and it is said: twenty-one] «2» from the Equator in the direction of the north. Most of the cities that we will mention after this are only [in] the northern direction, because the inhabited part of the earth is only the northern quarter which follows the North Pole and Banat Na'sh (Ursa Major). Mecca is in the belly of a valley «3» between mountains and valleys. Among its great mountains are: Abu Qubays, al-Muhassab, and Thabir. It was the abode of Adam, peace be upon him. The [Black Stone] «4» remained there until the Flood occurred. Then Allah the Exalted commanded Ibrahim [Abraham], the Friend, to build it. [Abu Ja'far] al-Mansur «5» increased the building of the house of the Kaaba...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 19
  },
  {
    "serial_number": "6265677",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "[And the beginning of his work was in Muharram of the year one hundred and thirty-seven, and the completion of it was in Dhu al-Hijjah of the year forty. Then his son al-Mahdi expanded it in the year] «6» one hundred and sixty-four. The length of the Mosque is four hundred cubits, and its width is three hundred «7». It has twenty-three doors. From al-Safa to al-Marwa is four hundred and forty cubits, and the height of the House is twenty-eight cubits «8». It is the Qibla for all countries. So the Qibla of the people of Kufa [Kufa, Iraq], Baghdad [Baghdad, Iraq], and what...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 20
  },
  {
    "serial_number": "6265678",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "was with it, on one line, is the Levantine Corner which is between the Door and the Stone. And the Qibla of the people of Basra [Basra, Iraq] and what aligns with it of the cities is the door of the Kaaba. And the Qibla of the people of Yemen [Yemen] is the Yemeni Corner. And the Qibla of the people of India [India] and Sindh [Pakistan] is the Black Stone. And the Qibla of the people of al-Sham [Syria/Levant] is the door of the Kaaba. And the people of al-Hijaz [Saudi Arabia] are likewise, except that it is slightly deviated. And the people of Yemen face towards the people of Armenia [Armenia].",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 21
  },
  {
    "serial_number": "6265679",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "The City of the Prophet, may Allah bless him and his family and grant them peace\nIt is the place of emigration «1» of the Messenger of Allah, may Allah bless him and his family and grant them peace, and the place of his settlement. In it is his grave, may Allah bless him and grant him peace, and the graves of his companions. He named it Taybah, because from its direction you find the scent of perfume (Tayyib) from its side for many miles. Its distance from the western line is one hundred and sixty degrees, and that in miles is [seven thousand five hundred and fifty-six]. «2» Its distance from the Equator is twenty-five degrees, and that in miles is one thousand six hundred and fifty miles. The City [Medina, Saudi Arabia] is on level ground, its soil is noble and majestic. It has two mountains: one of them is Uhud, and the other mountain is Radwa.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 22
  },
  {
    "serial_number": "6265680",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "Its people are from the Emigrants (Muhajirun), the Helpers (Ansar), the Successors (Tabi'un), and the tribes of the Arabs. It has four valleys «3» whose water comes at the time of rains, and the greatest of them is Wadi al-Aqiq. Most of its wealth is palm trees, which is the livelihood of its people «4». The Great Sea [Red Sea] is at a distance of three days [from it] «5». In it is the Mosque of the Messenger of Allah, may Allah bless him and his family and grant them peace, and his pulpit and his grave, may Allah bless him and his family and grant them peace. The Mosque's length is three hundred cubits, and its width is two hundred cubits «6». Its columns are three hundred columns «7». As for the Noble Pulpit, Muawiyah bin Abi Sufyan added six steps to it «8». And there is the Rawdah (Garden), which is one of the gardens of Paradise «9», between the elevated Grave and the Pulpit.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 23
  },
  {
    "serial_number": "6265681",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "Mention of Bayt al-Maqdis (Jerusalem), Aelia «1»\nIt is one of the great ancient cities [Jerusalem, Palestine/Israel]. In it are the graves of the prophets, Allah's blessings be upon them, and their traces «2». Its distance from the western line is fifty-six degrees, and that in miles is three thousand six hundred and ninety-six miles. Its distance from the Equator in the northern direction is thirty-two degrees, and that in miles is two thousand one hundred and twelve miles. It is majestic, and its water is from rains. Outside of it are gardens, vineyards, farms, trees, and olives «3». In it is the Palm Tree of Maryam under which she gave birth to Isa [Jesus] [peace be upon him] «4». In it is the Mihrab (Sanctuary) of Dawud [David], peace be upon him «5».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 24
  },
  {
    "serial_number": "6265682",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "In it is the Suspended Rock. In it is a great mountain, from which Isa [Jesus] [peace be upon him] was raised to the sky. In it is a very great mosque, which is the greatest of the mosques of the world, and in it is the Gate of Mercy. Every nation makes pilgrimage to it and venerates it, and in it are prayer niches (Miharib).",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 25
  },
  {
    "serial_number": "6265683",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "Mention of the City of Baghdad\nWe only returned to the mention of the city of Baghdad [Baghdad, Iraq], after presenting what was necessary to present, because it is the origin of cities, the best of them in construction, and the finest of them in air/climate. It is in the middle of the Fourth Clime, which is the most cherished of climes, and its people are the greatest of people in varieties of intellect and understanding. Abu Ja'far al-Mansur, from the Banu Abbas, built it, and he began that in the beginning, in the year one hundred and forty-one «1». He transported builders, skilled workers, and craftsmen from all countries to it. He made it circular, and expanded its gardens «2» and its alleys. Those who took charge of that from the people of calculation and engineers were:",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 26
  },
  {
    "serial_number": "6265684",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "Al-Hajjaj bin Artah the Calculator «3», al-Tabari, and Ibrahim al-Fazari. It has paths «4» with gates; in its circumference is twenty cubits. It has four gates, and between each gate is five thousand cubits: the Gate of Kufa, the Gate of Basra, the Gate of Khurasan, and the Gate of al-Sham [Syria]. On every gate is a casing of iron; only a group of men can close it. For every gate of them is a vestibule, and on every gate of them is a great dome adorned with gold. Around the Palace are the houses of the children of the Banu Abbas and the people of service. The Palace is in the middle of the city, and to its side is the Great Mosque. It is between the Tigris River and the Euphrates. In ancient times, there were a thousand mosques and twenty thousand baths «5» in it. Its distance from the western line is seventy degrees, and that in miles is four thousand six hundred and twenty miles.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 27
  },
  {
    "serial_number": "6265685",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "Its distance from the Equator in the north is thirty-three degrees, and that in miles is two thousand one hundred and seventy-eight miles. Al-Mansur had transported palm trees and trees to it, so they sprouted and grew in a short period, and that is due to the goodness of its water and the temperateness of its air. Likewise, he transported marble, columns, and craftsmen from every land to it. He ordered the people of service that each one of them should take a plot and build, so they took plots «6» and increased the building, and it rose in the shortest period. Its orchards are watered by the water of the Tigris and the Euphrates in canals. Al-Mansur's residence before that was in the city of al-Anbar [Al-Anbar, Iraq], which «7» al-Saffah, the first of the Caliphs of the Banu Abbas, had settled in.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 28
  },
  {
    "serial_number": "6265686",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "Mention of the City of Surra Man Ra'a (Samarra)\nAs for the city of Surra Man Ra'a [Samarra, Iraq], it was built by al-Mu'tasim bin Harun al-Rashid «1». Before that, it was a desert with no buildings in it. In ancient times, there was a monastery for Christians in it. The reason for its construction was that al-Mu'tasim used to acquire many Turks. When the Caliphate passed «2» to him, he persisted in seeking them. Those Turks, when they rode animals, would gallop and collide with people, so the mob would leap upon them and kill some of them and beat some of them. That became heavy upon al-Mu'tasim, so he went out from Baghdad [Iraq] and sought a place to dig a river [canal] in, until he reached al-Qatul. He began the building and allotted land to the commanders, the scribes, and the people, so they built on al-Qatul and the Tigris.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 29
  },
  {
    "serial_number": "6265687",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "Then he went to the location of Surra Man Ra'a [Samarra, Iraq], bought the monastery, and wrote to bring in laborers, builders, people of professions, and all craftsmen. Then he allotted the fiefs to the commanders, the scribes, and the people, and he separated the fiefs of the Turks from the fiefs of all the people. He ordered the building of mosques and markets. He bought slave girls for the Turks and married them to them, and forbade them from marrying or intermarrying with any of the Muwalladun (locally born/mixed heritage), and he established fixed provisions for the slave girls. When he finished the building, he dug rivers from the Tigris, and brought palm trees from Baghdad [Iraq], Basra [Iraq], and the rest of the Sawad [Fertile alluvial land of Iraq], al-Jazira [Upper Mesopotamia], al-Sham [Syria/Levant], and all other lands. Al-Mu'tasim built edifices and palaces, and placed a palace in every garden, containing sitting rooms, pools, and squares. Al-Mu'tasim Billah died in the year two hundred and twenty-seven. Harun al-Wathiq bin al-Mu'tasim built the Haruni Palace in it. Al-Mutawakkil bin al-Mu'tasim took charge and settled in the Haruni, settled his son Muhammad al-Muntasir in al-Jawsaq, settled his son Ibrahim al-Mu'ayyad in al-Matirah, and settled his son al-Mu'tazz in Balkuwara. Al-Mutawakkil built al-Ja'fariyya and the Congregational Mosque] «3».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 30
  },
  {
    "serial_number": "6265688",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "[Mention of the City of Kufa]\n[It is in the Third Clime. Its distance from the western line is sixty-nine and a half degrees. And from the Equator is thirty-one and two-thirds degrees. It is on the Euphrates [River]. Its air is healthy and its water is sweet. Kufa [Kufa, Iraq] is the great city of Iraq [Iraq], the dome of Islam, and the abode of emigration for the Muslims. It contains plans for the tribes of the Arabs. In Kufa is the grave of the Commander of the Faithful Ali, Allah's blessings be upon him. Sa'd bin Abi Waqqas established it as a garrison city] «2» in the caliphate of Ibn al-Khattab. It is the first city established by the Muslims after Basra.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 31
  },
  {
    "serial_number": "6265689",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "Mention of the City of Basra\nIt is in the Fourth Clime. Its distance from the western line is sixty-four degrees, and that in miles is four thousand eight hundred and eighty-four miles. Basra [Basra, Iraq] is the city of the world, the base of Iraq [Iraq], and the season of merchants. It is elongated, two farsakhs (leagues) in length by one farsakh in width. Utbah bin Ghazwan «1», one of the first Emigrants, established it as a garrison city in the caliphate of Umar bin al-Khattab, in the year fourteen of the Hijra. He is the one who conquered al-Ubulla «2».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 32
  },
  {
    "serial_number": "6265690",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "And from it in the northern direction is a river that comes from al-Batihah [Marshes of Iraq], at a distance of three farsakhs. It has sweet water «3». The two cities «4» of Kufa [Kufa, Iraq] and Basra [Basra, Iraq] are on one line, and between them is a sea [waterway] of seven days' journey. In the middle of the distance from it is the city of Wasit [Wasit, Iraq].",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 33
  },
  {
    "serial_number": "6265691",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "Mention of the city of Wasit [Wasit, Iraq]. It is in the fourth clime. Its distance from the Equator is like the distance of the cities of Basra [Basra, Iraq] and Kufa [Kufa, Iraq]. Its distance from the line of the West (Prime Meridian of the ancients) is seventy-one degrees, which in miles is four thousand six hundred and thirty-six miles. It was named Wasit only because it is situated in the middle (Wasat) between Kufa [Kufa, Iraq] and Basra [Basra, Iraq]. [It] is not ancient; it was built by Al-Hajjaj bin Yusuf, the governor of Abd al-Malik bin Marwan. The reason for its construction was that Abd al-Malik sent soldiers from the people of...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 34
  },
  {
    "serial_number": "6265692",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "...Sham (Syria) to Al-Hajjaj bin Yusuf, to be of assistance to him in wars. The people of Iraq became distressed by them, because they used to stay with them in the houses and look continuously at their women. They complained of this to Abd al-Malik bin Marwan, so he ordered Al-Hajjaj to build a city for the people of Sham to which he would transfer them.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 35
  },
  {
    "serial_number": "6265693",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "Mention of the city of Abadan [Abadan, Iran] in Ahwaz [Ahvaz, Iran]. It is in the fourth clime. Its distance from the line of the West is seventy-five degrees, which in miles is four thousand nine hundred and fifty miles. Its distance from the Equator is thirty-one degrees, which in miles is two thousand two hundred and thirty-six miles. It is on the coast of the Sea of Iraq, connected to the Great Green Sea. It is populated with its people, and in it are the Murabitun (garrison soldiers) and ascetics. The Abadani mats are made there. Near it, the Euphrates falls into the Great Sea.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 36
  },
  {
    "serial_number": "6265694",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "Mention of the city of Siraf [Bandar Siraf, Iran]. It is in the third clime. Its distance from the line of the West is seventy-nine degrees, which in miles is [five] thousand two hundred and twenty-four miles. It is on the coast of the Sea of Iraq, among the districts of Fars [Fars Province, Iran]. It is a majestic city, a pleasant spot, where governors stay. It has spaciousness in its houses, and wondrous orchards containing aromatic plants and varieties of trees. Its people drink from springs that come from a mountain. Most of its inhabitants are Persian nobles (Ajam Ashraf). Its districts were conquered by Abdullah bin Amir bin Kurayz during the caliphate of Uthman bin Affan.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 37
  },
  {
    "serial_number": "6265695",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "Mention of the city of Sanaa [Sanaa, Yemen], may Allah the Almighty protect it. It is a city in Yemen, and its capital; there is none greater than it therein. It is mountainous and land-based, with temperate air and good water. Trees bear fruit for them there, and they harvest crops twice a year, because they have two winters and two summers. This is the [case] for every land whose distance from the Equator is less than fourteen degrees. It is in the first clime. Its houses are painted with red and green, and its carpets are spread out, awaiting the rains at known times that do not vary. [Thus] it rains on them for one month in the summer and one month in the winter. And the most that...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 38
  },
  {
    "serial_number": "6265696",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "...occurs is in the evening/afternoon. So they hurry to return to their homes. The floodwater sweeps out all the dirt that is in it, because it is paved, and it comes to their farms in canals. It has a wall and a street overlooking a valley. In its congregational mosque is the grave of a prophet among the prophets. They have many fruits. Fine garments and wondrous vessels are made there. They are crafters of gem stones and boring of pearls. They gather in the mosque to read sciences and the Dear Book (Quran), may Allah benefit via it, Amen.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 39
  },
  {
    "serial_number": "6265697",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "Mention of the city of Aden [Aden, Yemen]. It is in the first clime. Its distance from the line of the West is sixty-five degrees, which in miles is eight hundred and twenty miles. It has two summers and two winters. It is intensely hot because the sun passes over their heads twice a year. That is the [case] for all lands that are in the first clime. Aden is on the coast of the Great Sea. In it are fishermen, and they extract pearls from the sea. In it are cisterns and rivers. Its people resemble the Arabs. It cannot be entered except from one side.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 40
  },
  {
    "serial_number": "6265698",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "It is large and populated. There are no trees or crops in it. Their livelihood is from fish. Fine garments and wondrous vessels are made there.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 41
  },
  {
    "serial_number": "6265699",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "The city of Oman [Oman]. It is in the second clime. Its distance from the line of the West is eighty-four degrees, which in miles is five thousand five hundred and forty miles. Its distance from the Equator is thirty degrees, which in miles is one thousand seven hundred and eighty miles. It is on the sea coast. It is fortified and has iron gates. In it are flowing waters, populated markets, orchards, palm trees, bananas, and all other fruits. It has wheat, barley, and rice. Its territories are vast, eighty parasangs by the like, plains...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 42
  },
  {
    "serial_number": "6265700",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "...and mountains. In it is sugar cane. On the heads of its people are long locks of hair (Jumam), and on the heads of the nobles are tall caps (Qalanis).",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 43
  },
  {
    "serial_number": "6265701",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "The city of Saba [Marib, Yemen]. It is in the second clime. Its distance from the line of the West is sixty-five degrees, which in miles is four thousand two hundred and ninety miles. Its distance from the Equator is seventeen degrees, which in miles is one thousand and eighty miles. In it are mines of gold. It is the city of Bilqis, and in it was her throne. Her traces remain in the pillars that were upon it, until they were cut off in the time of Solomon son of David, peace be upon them both. Near it is the city of Ma'rib [Marib, Yemen]. It used to have abundant blessings and trees. A woman would go out with her basket on her head and her spindle in her hand...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 44
  },
  {
    "serial_number": "6265702",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "...walking among the trees, which were continuous and extended, and she would not return except that the [basket] was filled with fruits falling without picking or harvesting. But they disbelieved, so Allah sent upon them the flood of Arim (the dam); it would demolish the dam by night what they used to repair by day. It is the one Allah mentioned in His Dear Book: \"There was for Saba, in their dwelling place, a sign: two gardens.\"",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 45
  },
  {
    "serial_number": "6265703",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "Hadhramaut [Hadhramaut, Yemen]. It is in the first clime. Its distance from the line of the West is seventy-one degrees, which in miles is four thousand six hundred and eighty. Its distance from the Equator is twelve degrees, which in miles is seven hundred and ninety-two miles. It is from the lands of Yemen. The lands of Hadhramaut are numerous and continuous, possessing palm trees, trees, and farms. Its people are many tribes, and they judge by the rulings of the Commander of the Faithful, Ali bin Abi Talib, and Fatimah the daughter of the Messenger of Allah, peace be upon them both. They say: \"In every creed, there is no judgment except the judgment of Allah and His messenger.\" Between Aden [Aden, Yemen] and Hadhramaut are deserts and great mountains, possessing trees...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 46
  },
  {
    "serial_number": "6265704",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 54,
    "volume_number": 1,
    "text": "...and in it are monkeys that persist in the vineyards and trees, and they hunt them with dogs. Most of their trees are palm trees. Alum (or vitriol) becomes a river from flowing springs, then it solidifies and becomes stones. Near Oman [Oman] is the city of Socotra [Socotra, Yemen], and in it is the Socotran ambergris. The people of Yemen are a people of acumen and intellect. Allah Almighty and Majestic said: \"Then depart from the place from where [all] the people depart.\"",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 47
  },
  {
    "serial_number": "6265705",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 55,
    "volume_number": 1,
    "text": "The city of Bahrain [Bahrain/Eastern Arabia]. It is in the second clime. It is in the beginning of Yemen. It is a majestic city. The water in it is near (the surface), dug by hand. In it are palm trees, pomegranates, citrons, and figs. They do not walk except in the early morning and evening due to the heat of the land. In it are great mountains of sand, driven by the winds, and perhaps they rise over their towns. There used to be a road between Bahrain and Oman [Oman] in the past, but the mountains of sand cut it off, so one cannot reach Oman from Bahrain except by sea. In it are two great mountains, and between the sea and them is a journey of ten days. Hajar [Al-Hasa, Saudi Arabia] is the capital of Bahrain. Its people are Arabs, and they are the ones who came as a delegation to the Messenger of Allah, may Allah bless him and his family and grant them peace.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 48
  },
  {
    "serial_number": "6265706",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 56,
    "volume_number": 1,
    "text": "Taif [Taif, Saudi Arabia] and Al-Yamama [Al-Yamama/Al-Kharj, Saudi Arabia]. They are in the second clime along with Mecca [Makkah, Saudi Arabia] on one line. Their distance from the Equator is equal. Taif is closer to Mecca than Al-Yamama. From Mecca to Taif is a journey of two days, and likewise between Taif and Al-Yamama. Their people are Arabs. The capital is Hajar al-Yamamah [Riyadh region, Saudi Arabia]. It has abundant fertility and goodness, and most of its trees are palm trees.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 49
  },
  {
    "serial_number": "6265707",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 57,
    "volume_number": 1,
    "text": "The city of Damascus [Damascus, Syria]. It is in the fourth clime. Its distance from the Equator is thirty-three degrees, and its distance from the line of the West is sixty degrees. It is an ancient city; there is none like it in the land of Islam or the land of the Romans (Byzantium). It has a wall of stone, and its circumference is twelve miles. Abu Ubaydah bin al-Jarrah conquered it by treaty, and they possess the treaty document. In it is the grave of Yahya bin Zakariya (John the Baptist) in a church called Al-Qasqar. In it is the River Orontes [Orontes River/Barada River], upon which are the buildings, estates, and orchards.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 50
  },
  {
    "serial_number": "6265708",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 58,
    "volume_number": 1,
    "text": "In it are many springs coming from mountain channels, entering every direction. Its people are a folk from the non-Arabs (Ajam). In it also are a folk from the Arabs. Its mosque is one of the wonders of the world in beauty and perfection.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 51
  },
  {
    "serial_number": "6265709",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 59,
    "volume_number": 1,
    "text": "Mention of the city of Aleppo [Aleppo, Syria] as well. It is in the fourth clime, close to Antioch [Antakya, Turkey]. The governors of Al-Awasim (The Border Fortresses) stay there. It is populated with its people, and in it are the homes of Banu Hashim. Its distance from the line of the West is sixty-three degrees.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 52
  },
  {
    "serial_number": "6265710",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 60,
    "volume_number": 1,
    "text": "Mention of the city of Tiberias [Tiberias, Israel]. Its distance from the line of the West is fifty-eight degrees, and from the Equator thirty-two degrees. It is the city of Jordan. It is below mountains on a great lake, from which a river exits. In it is a hot spring from which channels exit to the baths; they do not need to heat them. Amr bin al-Aas conquered it in the year fourteen. In it is the Pit of Joseph, peace be upon him.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 53
  },
  {
    "serial_number": "6265711",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 61,
    "volume_number": 1,
    "text": "The City of Asqalan [Ashkelon, Israel]\nIt is in the Fourth Clime. Its distance from the Equator is thirty-three degrees. It is on the coast of the Levantine Sea [Mediterranean Sea] «1». It is paved with marble and has many markets. It has palm trees, and its water is from springs. Ibrahim [Abraham], peace be upon him, was there, and in it are wondrous ruins of Namrud bin Kan'an [Nimrod son of Canaan]. It is between the borders of Egypt [Egypt] and al-Sham [Syria/Levant] «2».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 54
  },
  {
    "serial_number": "6265712",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 62,
    "volume_number": 1,
    "text": "The City of Tarsus [Tarsus, Turkey]\nIt is in the Fourth Clime. Its distance from the western line is fifty-eight degrees. And from the Equator is thirty-six degrees. Al-Rashid built it in the year one hundred and seventy «1». In it is a flowing river «2» that comes from the land of the Romans [Byzantine Empire] and cuts through its middle. Its people are a mixture of people. The land tax (Kharaj) of Damascus [Damascus, Syria] and its districts reaches six hundred thousand dinars «3», and the land tax of Tarsus is three hundred thousand dinars.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 55
  },
  {
    "serial_number": "6265713",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "The City of al-Mosul [Mosul, Iraq]\nIt is in the Fourth Clime. Its distance from the western line is sixty-nine degrees. It is in the western province of the Tigris [River]. Muhammad bin Marwan bin al-Hakam «1» built it when he governed al-Jazira [Upper Mesopotamia] during the caliphate of his brother Abd al-Malik bin Marwan, and he moved people to it. It has many rivers «2», and it is noble and great. The land tax of al-Mosul «3» reaches six thousand thousand [six million], and most of its people are from Hamadan.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 56
  },
  {
    "serial_number": "6265714",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "The road from al-Mosul to Azerbaijan [Azerbaijan/Northwestern Iran] is a month. Azerbaijan «4» is a great city [region], having districts and works. In it is a Fire House [Temple] that has been maintained for the Majus [Zoroastrians], may Allah the Exalted curse them.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 57
  },
  {
    "serial_number": "6265715",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 65,
    "volume_number": 1,
    "text": "The City of Hamadhan [Hamadan, Iran]\nIt is in the Fourth Clime. Its distance from the western line is seventy-three degrees, and from the Equator is thirty-six degrees. Hamadhan is a vast land with many provinces and districts «1». It was conquered in the year twenty-three, and its wealth remained in the treasury of Basra. The drinking water of its people is from springs and valleys that flow in winter and summer. From Hamadhan to Nahavand [Nahavand, Iran] is two stages. It is a noble city where the gathering of the Persians «3» used to be.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 58
  },
  {
    "serial_number": "6265716",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 66,
    "volume_number": 1,
    "text": "The City of Isfahan [Isfahan, Iran]\nIt is in the Fourth Clime. Its distance from the western line is seventy-five degrees. It is a noble city, and its people are a mixture of people, most of them being Ajam [Persians] «1». It has waters from valleys and springs «2». Qutayba «3» said: Abu Musa al-Ash'ari conquered Isfahan by force in the time of Umar bin al-Khattab; it was conquered in the year twenty-three «4». The amount of its land tax is ten thousand thousand [ten million] dirhams «5». Anushirvan, the King of the Persians «6», was born there.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 59
  },
  {
    "serial_number": "6265717",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 67,
    "volume_number": 1,
    "text": "The City of al-Rayy [Rayy, Tehran, Iran]\nIt is in the Fourth Clime. Its distance from the western line is seventy-four degrees. From the Equator, it is thirty-four degrees. It is a noble city. Its people are a mixture of people, from the Persians, Arabs, and Turks «1». Its name is al-Mahdiyya «2», because al-Mahdi settled in it during the caliphate of al-Mansur, and al-Rashid was born there. Qarzah bin Ka'b al-Ansari conquered it in the caliphate of Umar bin al-Khattab in the year twenty-four «3». Its people drink from springs and great rivers coming from the lands of Daylam [Gilan, Iran]. It has many trees «4».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 60
  },
  {
    "serial_number": "6265718",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 68,
    "volume_number": 1,
    "text": "Mention of the City of Hulwan [Sarpol-e Zahab, Iran]\nIt is in the Fourth Clime. Its distance from the Equator is thirty-four degrees. From the western line, it is seventy-two degrees. It is a noble city. Its people are a mixture of Arabs, Persians, and Kurds «1». It was conquered in the days of Umar bin al-Khattab. In it are ruins of the Kings of the Persians, and in it are rivers, some above others. Between Hulwan and Baghdad is the city of Tabaristan «2».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 61
  },
  {
    "serial_number": "6265719",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 69,
    "volume_number": 1,
    "text": "The City of Tabaristan [Mazandaran, Iran] «1»\nIt is in the works of Khurasan [Greater Khorasan], a great kingdom. It is a land of many fortresses, fortified by valleys «2». Its people are the nobles of the Ajam [Persians] and the sons of their kings. They are the best of people in faces (appearance) «3». It is mentioned that Yazdegerd left his slave girls and daughters there at the time of the conquest over the Persians, so the people of Tabaristan married them «4». Sa'id bin al-As conquered it by peace treaty in the time of Uthman. And Umar bin al-Ala conquered it «5» in the year [one hundred and] fifty-seven.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 62
  },
  {
    "serial_number": "6265720",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "Mention of the City of Jurjan [Gorgan, Iran]\nIt is in the Fifth Clime. Its distance from the western line is eighty degrees, and from the Equator is thirty-nine degrees. It is among the cities of Khurasan up to the river al-Ayli «1». It was conquered in the caliphate of Muawiyah bin Abi Sufyan «2», then its people apostatized from Islam, until Yazid bin al-Muhallab conquered it in the caliphate of Sulayman bin Abd al-Malik. It is great, and its land tax reaches ten thousand thousand [ten million] dinars «3».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 63
  },
  {
    "serial_number": "6265721",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 71,
    "volume_number": 1,
    "text": "In it, good wood is made from Khalanj (Tree heath) «4» and others, and varieties of silk garments. It has the great Bakhati [Bactrian] camels «5», and it has many palm trees. Between it and al-Rayy [Tehran, Iran] is nine stages.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 64
  },
  {
    "serial_number": "6265722",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 72,
    "volume_number": 1,
    "text": "Mention of the City of Nishapur [Neyshabur, Iran]\nIt is in the Fifth Clime. Its distance from the western line is eighty-two degrees, and from the Equator is thirty-nine degrees. Nishapur is a vast land with many districts «1». Abdullah bin Amir bin Kurayz conquered it in the caliphate of Uthman bin Affan, [may Allah be pleased with] him, in the year thirty. Its people are a mixture of Arabs and Ajam [Persians] «2». Its drinking source is from valleys and springs, and its land tax is five thousand thousand [five million] dirhams «3». It is from the works of Khurasan, and fine garments of silk and cotton «4» are made there.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 65
  },
  {
    "serial_number": "6265723",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 73,
    "volume_number": 1,
    "text": "[Tus] Among its districts «1» is the city of Tus [Tus, Iran]. In it are a people from the Arabs, but most of its people are Ajam [Persians] «2». The Commander of the Faithful al-Rashid died there, and his grave is there «3». Its distance from the western line is eighty-three degrees, and from the Equator is thirty-nine degrees. Its land tax enters into the land tax of Nishapur «4».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 66
  },
  {
    "serial_number": "6265724",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 74,
    "volume_number": 1,
    "text": "Mention of the City of Marw [Merv, Turkmenistan]\nIt is in the Fifth Clime. Its distance from the western line is eighty-five degrees, and from the Equator is thirty-eight degrees. It «1» is among the most glorious districts of Khurasan. Hatim bin al-Nu'man al-Bahili conquered it in the caliphate of Uthman in the year thirty-one «2». Its people are nobles from the Ajam [Persians], and in it are a people of the Arabs from al-Azd «3». The governors of Khurasan stay there «4».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 67
  },
  {
    "serial_number": "6265725",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 75,
    "volume_number": 1,
    "text": "Its people drink from springs of valleys «5». The Marwi garments of cotton are made there. From the city of Marw to the city of Sarakhs [Sarakhs, Iran/Turkmenistan border] is three stages.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 68
  },
  {
    "serial_number": "6265726",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 76,
    "volume_number": 1,
    "text": "The City of Sarakhs [Sarakhs, Iran]\nIt is in the Fifth Clime. Its distance from the western line is eighty-four degrees. And from the Equator is thirty-eight degrees. It is a noble land and a great noble city. It is wilderness, mountains, and sands «1». In it are mixtures of people. Abdullah bin Hatim al-Sulami «2» conquered it in the caliphate of Uthman. The drinking water of its people is from wells, and there is no river or spring in it «3». Its land tax is one thousand thousand [one million] dirhams, and it is from the districts of Khurasan «4». From Nishapur to Herat [Herat, Afghanistan] is ten stages, every stage a full Barid (post distance) «5».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 69
  },
  {
    "serial_number": "6265727",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 77,
    "volume_number": 1,
    "text": "The City of Herat [Herat, Afghanistan]\nIt is in the Fifth Clime. It is one of the largest lands of Khurasan «1». It is populated, and its people have the best faces among people. Al-Ahnaf bin Qays conquered it in the caliphate of Uthman bin Affan. Its people are nobles from the Ajam [Persians], and in it are a people from the Arabs. The drinking water of its people is from springs and valleys. Its land tax is included in the land tax of Khurasan «2». From Herat to Sijistan [Sistan, Iran/Afghanistan] is three stages.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 70
  },
  {
    "serial_number": "6265728",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 78,
    "volume_number": 1,
    "text": "The City of Kirman [Kerman, Iran] «1»\nIt is in the Third Clime. Its distance from the western line is ninety degrees. And from the Equator is thirty degrees. It is great and noble, having districts and provinces, and its waters are few «2». Abd al-Rahman bin Samura bin Habib conquered it, and he made peace with its people for two thousand thousand [two million] dirhams «3» in the caliphate of Uthman. The best of its works is the city of Kirman which is next to al-Sind [Pakistan].",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 71
  },
  {
    "serial_number": "6265729",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 79,
    "volume_number": 1,
    "text": "The City of Khwarazm [Khiva/Urgench, Uzbekistan/Turkmenistan] «1»\nIt is in the Sixth Clime. Its distance from the western line is ninety-one degrees. And from the Equator is forty-two degrees. It is among the cities of Khurasan. It is great. A great dam used to surround it and its works, but most of it was destroyed «2». It is in the middle of a desert and sands. Between it and Sijistan [Sistan] is a stage. It is known as Jurjan «3».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 72
  },
  {
    "serial_number": "6265730",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 80,
    "volume_number": 1,
    "text": "The City of Sijistan [Sistan, Iran/Afghanistan] «1»\nIt is in the Fourth Clime. Its distance from the western line is sixty-four degrees, and from the Equator is thirty-two degrees. It is a noble land having many districts, comparable in districts to the districts of Khurasan «2». It is isolated yet connected to the lands of al-Sind [Pakistan] «3», and the road to it is in deserts and wastelands. The first of the governors to settle in it was Ma'n bin Zaida al-Shaybani «4». Then it acted hypocritically many times. It was conquered in the caliphate of Uthman bin Affan first, and in all his days its ownership continued by way of peace treaty. When Abu Ja'far al-Mansur of the Banu Abbas assumed the Caliphate...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 73
  },
  {
    "serial_number": "6265731",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 81,
    "volume_number": 1,
    "text": "spent it on the administration of Khurasan [Khorasan region, Iran/Afghanistan/Turkmenistan], and appointed Ma'n bin Za'idah al-Shaybani as its governor. And Khurasan, its land tax (kharaj) is ten thousand thousand (ten million).",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 74
  },
  {
    "serial_number": "6265732",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 82,
    "volume_number": 1,
    "text": "Mention of the City of Balkh [Balkh, Afghanistan]. It is in the Fifth Clime. Its distance from the line of the West is eighty-eight degrees. From the Equator, thirty-seven degrees. It has many cities and districts, and it has forty-nine cemeteries. It is the capital of Greater Khurasan. It is great and of high esteem, has a wall, and has twelve gates. It is in the middle of the lands of Khurasan, containing palaces and homes of the Barmakids, due to the length of their governorship over the works of Khurasan during the caliphate of Banu al-Abbas. On the eastern side of Balkh is a great river.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 75
  },
  {
    "serial_number": "6265733",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 83,
    "volume_number": 1,
    "text": "Mention of the City of Bukhara [Bukhara, Uzbekistan]. It is in the Fifth Clime. Its distance from the line of the West is eighty-seven degrees. It is a vast land, which has never ceased to be of strong defense and fortification. Sa'id bin Uthman bin Affan conquered it in the time of Mu'awiyah bin Abi Sufyan, then it turned hypocritical (rebelled), and was conquered in the caliphate of Yazid bin Mu'awiyah, then it resisted until Qutaybah bin Muslim came to it in the time of Al-Walid bin Abd al-Malik bin Marwan, so he conquered it. Its land tax is one thousand thousand (one million) dirhams. From Bukhara to the lands of India is seven stages.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 76
  },
  {
    "serial_number": "6265734",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 84,
    "volume_number": 1,
    "text": "Mention of the City of Samarqand [Samarkand, Uzbekistan]. It is in the Fifth Clime. Its distance from the line of the West is eighty-nine degrees, and from the Equator thirty-six degrees. It is among the most majestic of lands and the greatest, the most unassailable, and having the most men. It is at the throat of the lands of the Turks. It turned hypocritical after it was conquered, then Qutaybah bin Muslim conquered it in the time of Al-Walid, and made a peace treaty with its king. [It has] a great river coming from the lands of the Turks called Asaf.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 77
  },
  {
    "serial_number": "6265735",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 85,
    "volume_number": 1,
    "text": "Mention of the City of Alexandria [Alexandria, Egypt]. It is in the West of the land of Egypt. Its distance from the line of the West is fifty-one degrees, and from the Equator, thirty degrees. It is one of the wonders of the lands. In it is an amazing structure; it is mentioned that it was built in three hundred years, and that its people remained for seventy years not walking in it during the day except with black rags on their faces, out of fear for their eyesight due to the intensity of its whiteness. Upon its houses is a crab of marble, and the Lighthouse (Pharos) is upon four pillars, and its height is three hundred cubits. The walls of the city are of marble, as is its wall.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 78
  },
  {
    "serial_number": "6265736",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 86,
    "volume_number": 1,
    "text": "In it is a dome that belonged to Pharaoh, and in it is the palace of Solomon son of David, peace be upon him; it has fallen into ruin and its ruins remain. In it is a pillar that rotates for all time. In it are ribats (fortified hospices) on the sea coast where worshippers and strangers stay. In ancient times, upon its lighthouse was a large mirror made by the wise men, by which one could look upon Constantinople [Istanbul, Turkey] and the lands of the Romans (Byzantines), until a trick was used to bring it down, so no one was able to restore it.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 79
  },
  {
    "serial_number": "6265737",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 87,
    "volume_number": 1,
    "text": "Mention of the City of Dimyat [Damietta, Egypt]. It is in the Fourth Clime. Its distance from the line of the West is fifty-three degrees. It is on the coast of the Levantine Sea. Its people are rich, and they have no work except the making of fine garments, the like of which is not made in other lands, due to the mildness of its air. Because the sea surrounds it from the north side, and the canals of the Nile separate upon it. From Dimyat, one rides to the lands of the Romans. The island of Cyprus [Cyprus] and the island of Crete [Crete, Greece] are near it in the sea. Flour and fruits are carried from it to the harbor of Dimyat. Near the city of Dimyat on the sea is the city of Tinnis, and it is on the same line with it.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 80
  },
  {
    "serial_number": "6265738",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 88,
    "volume_number": 1,
    "text": "Mention of the City of Tinnis [Tennis, Egypt]. It is in the Fourth Clime. Its distance from the line of the West is fifty-four degrees, and from the Equator, thirty-one degrees. It is large, and most of its people are Christians; they work on the Sultan's embroidery, containing varieties of fine garments. The sea surrounds it, and there is no way to it except on boats. It has a wall of stone, which the waves of the sea strike. Its water is salty for six months of the year, but when the Nile floods, its waters become fresh, due to the reaching of the Nile's flood into the canals. Its people are rich, and fish are plentiful there; they come out to the coast without being fished.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 81
  },
  {
    "serial_number": "6265739",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 89,
    "volume_number": 1,
    "text": "Mention of the City of Misr [Cairo, Egypt]. It is in the Third Clime. Its distance from the line of the West is fifty-four degrees, and from the Equator twenty-nine degrees. It is great; its length along the Nile is parasangs. It has many estates in the Upper Sa'id, opposite the lands of Nubia. In it are the two Pyramids; their height is one hundred cubits. They are of rock, and in them food used to be gathered in the days of Yusuf, peace be upon him. In some of its baths is a girl of marble, water flows over her private part; it is said: She is a slave girl from the slave girls of Pharaoh.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 82
  },
  {
    "serial_number": "6265740",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 90,
    "volume_number": 1,
    "text": "Upon the Nile is a structure built of rock, containing signs of outflow regarding its increase and decrease. A group has been entrusted with it to monitor it; so if it goes out, it waters all their estates and farms. The Nile comes from the lands of the Sudan; its exit is from the Mountain of the Moon, behind the Equator, and hardly anyone can reach it. In Misr, there are palm trees, bananas, and sugar cane. Near the Muqattam Mountain is their cemetery.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 83
  },
  {
    "serial_number": "6265741",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 91,
    "volume_number": 1,
    "text": "Mention of the City of Madyan [Al-Bad', Saudi Arabia]. It is in the Third Clime. Its distance from the line of the West is sixty-one degrees, and from the Equator, twenty-nine degrees. It is between the borders of Al-Sham and the borders of Egypt. It is the city of Shu'ayb, peace be upon him. In it is his cave where he used to shelter with his sheep. In it are many mountains, and in them are caves and caverns under the earth, containing decaying bones, upon which are established structures. They are the people of Shu'ayb, when Allah the Almighty destroyed them, so \"the Blast seized them,\" and they entered the caverns under the earth so as not to hear the Blast, but they all died.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 84
  },
  {
    "serial_number": "6265742",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 92,
    "volume_number": 1,
    "text": "And in Madyan is the Well from which Musa, peace be upon him, drew water, and [upon it] is a built grave.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 85
  },
  {
    "serial_number": "6265743",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 93,
    "volume_number": 1,
    "text": "Mention of Ayn al-Shams [Heliopolis/Cairo, Egypt]. It is in the Third Clime. Its distance from the Equator is thirty degrees, and from the line of the West fifty-four degrees. It was the city of Pharaoh, and the site of his kingship. In it are amazing traces and buildings, and in it are pillars, statues, and inscriptions. There is a river set in a rock, around which is a chair of marble; [Pharaoh] used to sit upon it with his slave girls. The river used to flow with wine and honey. In it is an image of marble; it is mentioned that she was the hair-comber of Pharaoh's wife, [and it is] a transformed image. In it are two idols of stone; one of them weeps, and the other laughs.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 86
  },
  {
    "serial_number": "6265744",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 94,
    "volume_number": 1,
    "text": "Mention of the City of Al-Qulzum, which is Suez [Suez, Egypt]. It is in the Third Clime. Its distance from the line of the West is fifty-six degrees, and from the Equator twenty-eight degrees. It is on the Sea of Al-Qulzum. From it, one crosses the sea [to] Mecca [Makkah, Saudi Arabia] and the Hijaz from there at the city of Jeddah [Jeddah, Saudi Arabia]. Between Misr (Cairo) and the city of Al-Qulzum is a journey of three days in deserts; there is no habitation in it nor property. It is the land of Al-Tih (The Wandering) in which the Children of Israel wandered in this place. The Sea of Al-Qulzum is the one Allah the Almighty split for Musa bin Imran, peace be upon him, at the time of his crossing with the Children of Israel in the sea, and his trace is in it. That place is [fearsome and not traversed]. Rarely do ships remain safe in it.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 87
  },
  {
    "serial_number": "6265745",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 95,
    "volume_number": 1,
    "text": "In it is a bridge. And sleeping places for the monks. Then one ascends the mountain on six thousand five hundred steps; at its top are a church and amazing traces. It is the one which \"He made level\" when He, Mighty and Majestic, manifested to Musa bin Imran. The city of Al-Qulzum is a mine for merchants, and in it is the harbor for ships from the lands of India.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 88
  },
  {
    "serial_number": "6265746",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 96,
    "volume_number": 1,
    "text": "Mention of the City of Tarablus [Tripoli, Libya]. It is in the Fourth Clime. Its distance from the line of the West is thirty-six degrees, and from the Equator thirty-four degrees. It is on the Levantine Sea. In it is a great harbor, containing a thousand ships. Its people are from Quraysh; Mu'awiyah bin Abi Sufyan transferred them to it. It has fig and olive trees. It has many villages. Between it and Al-Qayrawan [Kairouan, Tunisia] is a journey of six days, and between it and Sirte [Sirte, Libya] in the east are sands and deserts with no water in them. The city of Sirte is large; it has a congregational mosque and a small flowing river",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 89
  },
  {
    "serial_number": "6265747",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 97,
    "volume_number": 1,
    "text": "and palm trees. It is near the Levantine Sea. Between it and Ajdabiya is a journey of three days. Ajdabiya [Ajdabiya, Libya] is in sands; there are no trees in it except the Arak. These cities are in the first passage between Al-Qayrawan and Misr (Egypt). The city of Ayla [Aqaba, Jordan] contains a group of Jews; in their hands is a covenant of the Prophet, may Allah bless him and his family and grant them peace, in the handwriting of Ali bin Abi Talib, may Allah be pleased with him.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 90
  },
  {
    "serial_number": "6265748",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 98,
    "volume_number": 1,
    "text": "Mention of the City of Al-Qayrawan [Kairouan, Tunisia]. It is in the Fourth Clime. Its distance from the line of the West is thirty-one degrees. It is the capital of Ifriqiya and its fortress. It is large and majestic, not ancient; it was built in the caliphate of Mu'awiyah bin Abi Sufyan. That is because when Mu'awiyah appointed Uqbah bin Nafi' al-Fihri al-Qurashi over the land of Egypt and Ifriqiya, he laid out the city of Al-Qayrawan. Before that, it was a thicket and a forest that could not be sought, nor entered due to the large number of predatory beasts, lions, and snakes. He prayed to Allah against them, so nothing remained of them but that it went out fleeing from it, to the point that the predatory beasts and lions were carrying their young in their mouths and with their paws. So he was named Abu al-Rabi'.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 91
  },
  {
    "serial_number": "6265749",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 99,
    "volume_number": 1,
    "text": "Near the gate of the city is a great pool in which ships sail. In it is a congregational mosque. In it are two pillars that exude water every Friday before the rising of the sun. The King of the Romans had sent for them to take them, and offered monies for them, but it was not accepted from him.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 92
  },
  {
    "serial_number": "6265750",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 100,
    "volume_number": 1,
    "text": "Mention of the City of Tahert [Tiaret, Algeria]. It is in the Fourth Clime. Its distance from the line of the West is twenty-two degrees, and from the Equator, thirty-three degrees. It is the capital of the people of the Berbers. It is near the Levantine Sea. In it is a congregational mosque, and it has three gates. It is among the grandest of the lands of the Berbers. What is around it are sands, deserts, and settlements. The dwelling of the Berbers is in tents, and they move from place to place, similar to the action of the Arabs. They are a people of harshness and ignorance; they fight one another. Ishaq bin al-Husayn, the author of the book, said: We have mentioned the famous cities specifically for each city; let us now mention the places in sum and generally, seeking brevity and conciseness. And Allah is the Granter of success to what is right.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 93
  },
  {
    "serial_number": "6265751",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 101,
    "volume_number": 1,
    "text": "The Land of the Berbers and its Mention\nIt is in the Fourth Clime. It is vast, taking [in] the north and the south across the width of the Fourth and Third Climes, up to the first borders of the Land of the Sudan [Sub-Saharan Africa] in the south, to the Levantine Sea [Mediterranean Sea] in the north, to the Western Ocean, the Greatest Ocean [Atlantic Ocean] in the west at Tangier [Tangier, Morocco], and to the land of Ifriqiya [Tunisia] in the east. Among its cities is the city of Tanas [Tenes, Algeria] «1». It is on the Levantine Sea and is a port for those crossing from the Sea of Andalusia, entering the city of Bajjana [Pechina, Spain] «2». It is a beautiful city with abundant good things, containing a mosque. Its people eat dogs, and there are butchers in it who cut up their meat. Between Qastiliya [Tozeur region, Tunisia] «3» and Tahart [Tiaret, Algeria] is a journey of ten days, and to Fes [Fez, Morocco] is fifteen days, through deserts and sands.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 94
  },
  {
    "serial_number": "6265752",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 102,
    "volume_number": 1,
    "text": "The city of Fes [Fez, Morocco] has abundant good things. In it is a congregational mosque, flowing waters, trees, and rivers «4». On the Levantine Sea [Mediterranean Sea], in what faces the Island of Andalusia [Iberian Peninsula], are many cities, including: The city of Qartajannah [Cartagena, Spain], the city of Malila [Melilla, Spain], Tlemcen [Tlemcen, Algeria], and the city of Nakur [Nekor, Morocco] «5» up to the city of Tangier [Tangier, Morocco]. It is near the city of Ceuta [Ceuta, Spain]. It is the port and the crossing point to the Island of Andalusia. Beyond Tangier, heading in the direction of the south, is the city of Aghmat [Aghmat, Morocco] «6» and other cities, up to the city of Sijilmasa [Sijilmasa, Morocco] «7», which is the end of the land of the Berbers next to the Sudan [Sub-Saharan Africa].",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 95
  },
  {
    "serial_number": "6265753",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 103,
    "volume_number": 1,
    "text": "The Land of the Sudan [Land of the Blacks]\nIt is large and vast, taking in length from the Sea of the West [Atlantic Ocean] «1» to the Sea of al-Qulzum [Red Sea]. It is great and majestic. Between the city of Ghana [Ghana Empire, Mauritania/Mali] «2» and the land of Nubia [Sudan/Egypt], there are many lands of deserts and sands. The land of Nubia has intense heat, little rain, few rivers, plants, and trees. Its people walk naked due to the intensity of the heat among them; the woman covers her private parts and nothing else. They raise their children in holes they make in the sand. It is a land with many lions, wild beasts, and terrible, huge animals. Their land has much gold, but they prefer yellow copper (brass/bronze) over",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 96
  },
  {
    "serial_number": "6265754",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 104,
    "volume_number": 1,
    "text": "gold; they make jewelry from it for women around the waists. The land of Nubia is [on the east of the Nile, and their capital is Dunqula (Dongola)] «3». They take the skins of mules and wear them for years; they do not tear due to their durability. The capital of the land of Abyssinia [Ethiopia] is the city of Jarmi «4»; it is the abode of the Kingdom of Abyssinia, belonging to the Najashi (Negus). In it, gold dust is bought with copper. Its people do not understand [foreign languages]. If a merchant wants to trade with one of them, he places [what he desires to] «5» give him on the ground. If he is pleased with it, he takes it; if he is not pleased, he takes his gold and leaves. Among their cities is the city of Zaghawa [Zaghawa, Chad/Sudan] «6», which is the border of the land of Nubia on the Nile, the city of Kus [Qus, Egypt], the city of Kawkaw [Gao, Mali] «7», and the city of Alwa [Alodia, Sudan] in the land of Nubia on the Nile «8».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 97
  },
  {
    "serial_number": "6265755",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 105,
    "volume_number": 1,
    "text": "The land of Nubia is on the canal between the Nile and the river that comes from beneath the Equator. Whatever is behind these lands in the south is uninhabited due to the intensity of the heat there.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 98
  },
  {
    "serial_number": "6265756",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 106,
    "volume_number": 1,
    "text": "The Island of Andalusia [Iberian Peninsula]\nIt is large, surrounded by seas. It takes from the Western Sea in length at the city of Ukhshunba [Ossónoba/Faro, Portugal] «1» to the junction of the Southern Sea and the Ocean, at the Mountain of Haykal al-Zuhara (Temple of Venus) «2», in what neighbors it, and the city of Tarkuna [Tarragona, Spain] «3» and the city of Barshiluna [Barcelona, Spain], and there is the Gate of Andalusia. It takes in width the Fifth and Sixth Climes from the Levantine Sea [Mediterranean] in the south to the Ocean in the north. The capital of Andalusia is the city of Qurtuba [Cordoba, Spain] «4». It is the abode of the Sunnah,",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 99
  },
  {
    "serial_number": "6265757",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 107,
    "volume_number": 1,
    "text": "and the gathering place of every marvel. There is nothing like it in the world, so that suffices from mentioning [details about] it. Among the cities of Andalusia is the city of Ishbiliya [Seville, Spain] «5», which is in the west. It is a city of abundant goods and olive trees. It is on the great river that [passes through] Cordoba «6». Among its cities: The city of Tulaytula [Toledo, Spain] «7», which is noble and ancient. It was the capital «8» and the abode of the kingdom for the Goths, and it is fortified. Among its cities: The city of Saraqusta [Zaragoza, Spain] «9», which is great, wondrous, with many rivers, orchards, and trees on Wadi Shalun [Jalon River]. And Jilliq «10», which resembles Iraq and imitates al-Sadir and al-Khawarnaq, and the Upper March (Al-Thagh al-A'la) in what neighbors the land of the Shamakisa. From the Eastern March is Washqa [Huesca, Spain] «11», and opposite it is the land of the Franks,",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 100
  },
  {
    "serial_number": "6265758",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 108,
    "volume_number": 1,
    "text": "and Tutila [Tudela, Spain] «12», and opposite it is the land of Shalun (Chalon?), and Qal'at Ayyub [Calatayud, Spain] «13» and Madinat Salim [Medinaceli, Spain] «14», and opposite it is Aragon [Aragon, Spain], and Barbashtar [Barbastro, Spain] «15» and Larida [Lleida, Spain] «16» and Massun [Monzón, Spain] «17» and Qallahra [Calahorra, Spain] «18», and opposite it is the land of Qashtala [Castile, Spain] «19». Among the cities of Andalusia is the city of Marida [Merida, Spain] «20», which was the capital of the Goths. Whatever is behind the land of Jaliqiya [Galicia, Spain] «21» takes in the north to the Southern Ocean. Among its cities is the city of Balansiya [Valencia, Spain] «22», which is near the sea, and its capital today is Al-Mariyah [Almeria, Spain] «23», which is on the Levantine Sea. Likewise,",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 101
  },
  {
    "serial_number": "6265759",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 109,
    "volume_number": 1,
    "text": "the city of Malaqa [Malaga, Spain] «24», which has much good. And the city of Tartusha [Tortosa, Spain], which is on the Levantine Sea «25» adjacent to the land of the Franks. And the city of Ibrara (Evora?) «26», and its capital today is Daniya [Denia, Spain], opposite the two islands of Manurqa [Menorca, Spain] and Mayurqa [Mallorca, Spain] «27». The Island of Andalusia was conquered in the month of Ramadan of the year ninety-two «28». Tariq bin Ziyad al-Nafzi «29» conquered it; he was the agent of Musa bin Nusayr, the agent of Al-Walid bin Abd al-Malik over the lands of Ifriqiya. The King of the Goths in Andalusia was called Ghitisha (Witiza/Roderic context) «30». He had four cities he moved to during the four seasons of the year. He was in",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 102
  },
  {
    "serial_number": "6265760",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 110,
    "volume_number": 1,
    "text": "the winter season in the city of Toledo [Toledo, Spain], which was the abode «31» of his kingdom. He was in Seville [Seville, Spain] during the fasting days (Lent) for the sake of the fish (Whale), since meat is forbidden to them in their fast. He was in the city of Merida [Merida, Spain] during the days of spring due to the abundance of hunting, clarified butter, and honey there. And he was in Cordoba [Cordoba, Spain] during the days of Pentecost (Ansara) for fruits and drinks. When he entered Seville [after besieging it for months] «32», he annexed it to himself, and that was difficult for the people of his kingdom. The agent (Julian) rebelled against the Island (Algeciras/Ceuta) and built there. He came to Musa bin Nusayr and announced to him the news of Andalusia and its goodness, and ordered him to rise to it to fight it «33». He did not resolve on that until he went to Al-Walid and informed him of that. Al-Walid prevented him and said: \"The frontiers of the Muslims are in the sea.\" He said: \"O Commander of the Faithful, I will send Tariq with my army along with the Berbers. If they succeed, it is ours; and if they are stricken, it is not upon us, for they are like enemies.\" So he ordered him to rise for that. When Tariq crossed the sea, he went out to the mountain attributed to him [Gibraltar]. Then he put forward the Sudan (Blacks) for the war. When the Goths saw terrible forms,",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 103
  },
  {
    "serial_number": "6265761",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 111,
    "volume_number": 1,
    "text": "that terrified them. The Sudan used to take captives from the Goths and Christians and slaughter them, showing that they were eating them. That increased their fear and panic. Tariq did not pass by a city but that its people fled in fear of him, until he ended up at Toledo. The King had been killed, and Ludhriq (Roderic) succeeded him in his place, so Tariq killed him as well. Christendom was defeated from the towns and plains until they fortified themselves in the rugged terrains and mountains. Obedience to the Muslims reached up to Jaliqiya [Galicia, Spain] and Ifranja (Frankish lands). He made peace with its people, so they used to pay the tribute until their wealth decreased. They became poor and refused it, so he sent armies out to them and drove them into the farthest lands, so they scattered in them.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 104
  },
  {
    "serial_number": "6265762",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 112,
    "volume_number": 1,
    "text": "The Romans (Byzantines) and the Franks «1»\nThese are many vast lands, taking in length from the Gate of Andalusia [Pyrenees] along the Levantine Sea [Mediterranean] to the city of Constantinople [Istanbul, Turkey]. And in width, to the land of the Saqaliba (Slavs) «2» in the width of the Seventh Clime. They fight the Slavs and enslave them. They are in many islands of the sea. Their lands are cold, with much rain, fruits, mountains, and rugged terrains. [And among] their cities is the city of Rumiyah al-Kubra (Rome the Great), which is on the sea.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 105
  },
  {
    "serial_number": "6265763",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 113,
    "volume_number": 1,
    "text": "The City of Rumiyah [Rome, Italy]\nIt is in the Sixth Clime. Its distance from the western line is thirty-five degrees, and from the Equator is forty-two degrees. It is a great city, the abode of the Kingdom of the Romans in ancient times. There is no city in their lands [more beautiful] than it nor greater. Its length is twenty-eight miles. It has two walls, and between them is a great river [Tiber] coming from the sea, upon which are homes and shops [built with yellow copper/brass] «1», because that river is paved with yellow copper in rows and dams ... «2» upon all the people of its work. A great amount of copper was gathered,",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 106
  },
  {
    "serial_number": "6265764",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 114,
    "volume_number": 1,
    "text": "so the edge of the river was paved with it, in what faces the city. From that time, the Christians date from [the Era of] Copper. In the middle of the city is the Great Church [St. Peter's Basilica] «3». Its length is two farsakhs. In it is the grave of Sham'un (Simon/Peter) the Disciple, [one of the disciples of Isa bin Maryam, peace be upon him]. When it is the day of the feast, the King comes, opens the door of the palace, descends into it, shaves his head, then goes out and gives every single man of the people of his kingdom a hair; they seek blessings through it. The walls of the church are adorned with gold. In it are a thousand crosses of gold, and twelve crosses according to the number of the Disciples. In the church are five thousand priests and deacons. In it are one thousand two hundred cups of gold, encrusted with jewels, for drinking wine [and] for the Eucharist. In it is a house (hall) fifty cubits long, furnished with brocade, for the sitting of the deacons, and upon them are clothes of brocade. In the church is a column pillar of red ruby; the house lights up from it at night, and no lamp is needed with it. In the church is a man (statue) built of copper, and on top of it is a starling (Zarzur) of copper. When it is the days of olives, no starling remains but that it takes an olive in its beak «4» and throws it onto that image, until there gathers from",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 107
  },
  {
    "serial_number": "6265765",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 115,
    "volume_number": 1,
    "text": "the olives many Mudds (measures), so they make oil from it for the lamps of the churches specifically. In the city are many churches, about five thousand churches, and around it are the towers of the monks who converse at night. In it are ten thousand baths «5». The people of the city sit «6» in the churches from Saturday until the end of Sunday, not occupying themselves with craft or trade. In it is a council for the people of knowledge, calculation, philosophy, astrology, and the wise in medicine. In it are [six thousand] «7» thousand copies of the Gospel written in gold, and great treasuries containing books of sciences.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 108
  },
  {
    "serial_number": "6265766",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 116,
    "volume_number": 1,
    "text": "The City of Constantinople [Istanbul, Turkey]\nIt is in the Sixth Clime. Its distance from the western line is forty-nine degrees, and from the Equator is forty-five degrees. It is a great, noble city, having [no] equal. [It has] three «1» gates and sides: two sides to the sea, and a side to the land towards the Romans. Rome the Great is surrounded by many great walls, and from it is [the origin of] Rome, and it is older than it. The one who built Constantinople was Constantine son of the King of the Romans. That is because he was the first to enter the religion of the Christians and manifest it, and believed in Isa [Jesus] [peace be upon him]. The people of his kingdom, Rome, disapproved of that, so he departed from it and built Constantinople and named it after himself. He did not cease moving from the Romans to it until it became the capital and the abode of the kingdom «2».",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 109
  },
  {
    "serial_number": "6265767",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 117,
    "volume_number": 1,
    "text": "In it are great churches, and mosques for the Muslims. They treat the Muslim captives who are with them well and provide them with provisions. Their kingdom is a great kingdom; they are people of might and courage. They fight the Slavs and the Franks, and the Muslims from the lands of al-Shamat [Levant] also fight them «3». In it are talismans and wondrous ruins of the ancients. The people of Rome and its districts shave their beards and the middles of their heads (tonsure), as expiation for what they did to the disciples of Isa bin Maryam, peace be upon him; Allah sent him to them, and they did likewise to them «4». Adjacent to Constantinople and opposite it behind the gulf are the lands of Amuriya [Amorium, Turkey] and al-Kahf and al-Raqim.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 110
  },
  {
    "serial_number": "6265768",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 118,
    "volume_number": 1,
    "text": "Mention of al-Raqim and al-Kahf (The Inscription and the Cave)\nIt is in the Fifth Clime, between Amuriya [Amorium, Turkey] and Anqara [Ankara, Turkey] «1». It is a great mountain with a cave underground, which is a place of columns. It has a door of stone. Inside it are dead people as if they are alive, their eyes open in a great darkness; their faces cannot be distinguished except with lamps. Upon them are hair shirts (sackcloth) that scatter when touched. Their bodies have dried up and their skins are stuck to the bones, and their hair remains. No one enters upon them without being seized by a great awe. He finished with [Constantinople and moved to the islands of] «2» the Greatest Sea",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 111
  },
  {
    "serial_number": "6265769",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 119,
    "volume_number": 1,
    "text": "[Ocean]. The greatest of those islands is the island of Sarandib [Sri Lanka]. Among the cities of India is the city of al-Zabij.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 112
  },
  {
    "serial_number": "6265770",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Akam al-Marjan fi Dhikr al-Mada'in al-Mashhura fi Kulli Makan",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 120,
    "volume_number": 1,
    "text": "The City of al-Zabij in India [likely Srivijaya/Sumatra, Indonesia]\nIt is a great city. It has a wall and four gates. Their King inhabits a city called Muljaman, which is the city of al-Zabij, at a distance of twenty days journey. They fight the Zabaj (or are the Zabaj?). It is known as the Land of Gold. In it are mountains containing mines of gold and lead «1», and from it lead is carried to the lands. They have dinars with which they transact; on the dinars is the image of the King. Its people resemble the Turks, except that they are dark (tan) and tall. They have cloves, walnuts (nutmeg?), types of sandalwood, and camphor (Shahm al-Tib) «2». In the land of India are elephants. They hunt them «3» by digging for them in the earth, surrounding them with grass, kissing (taming) them, and taking...",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 113
  },
  {
    "serial_number": "6265771",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 121,
    "volume_number": 1,
    "text": "...its tusks and carry them to China [China], where the people of China make jewelry for their women from them. The people of India [India] include people of knowledge and omens/superstition.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 114
  },
  {
    "serial_number": "6265772",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 122,
    "volume_number": 1,
    "text": "The Land of the Khazars and Al-Shash [Tashkent, Uzbekistan]. It is a vast, great land on the borders of Sindh [Sindh, Pakistan]. Their greatest king follows the Jewish religion. They fight the Turks, and the people of Sindh fight them. Their king has great armies. In their lands are farms, orchards, and fruits, and it has many cities. Among their cities is Balkar [Balkar, Russia/Caucasus region], which obeys the King of the Khazars; ten thousand fighters emerge from it. They have appearances and bodies resembling the Turks.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 115
  },
  {
    "serial_number": "6265773",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 123,
    "volume_number": 1,
    "text": "When a woman reaches maturity among them, she chooses whomever she wants among men and leaves the authority of her father and mother. It is in a plain of land, and most of its trees are Khalanj (heath/briar wood), and from it, it is brought to Khurasan [Khorasan region], and it constitutes most of their wealth. They have farms. Most of them profess [Christianity]. Among its cities is the city of Al-Tan Yinu (likely Atil/Itil) [Astrakhan region, Russia], which is great and majestic on the Greatest River flowing from the Sea of the Khazars [Caspian Sea] to the Sea of Khurasan [Aral Sea/Caspian Sea]. They have cemeteries like the cemeteries of the Muslims, but most of them burn their dead as an expiation for them.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 116
  },
  {
    "serial_number": "6265774",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 124,
    "volume_number": 1,
    "text": "The Land of the Turks. It is a great, vast land. It connects to the Levantine Sea [Mediterranean Sea/Black Sea] to the north, and the land of the Taghuzghuz (Toquz Oghuz) [Central Asia] to the east. They are people of might and valor, and they have appearances and bodies. They are the most skillful of people in making felt, because it is their clothing. They have milk, and game is abundant. Their lands have much cold and snow. They have tunnels in the earth which they enter due to the severity of the cold.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 117
  },
  {
    "serial_number": "6265775",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 125,
    "volume_number": 1,
    "text": "They are idol worshippers, may Allah the Almighty make them ugly. They burn their dead. They pray twice a day and fast for one day. Its river flows into the Sea of Tabaristan [Caspian Sea], and in it are fish that cling to the legs. It dries up in the summer, and they do not drink except from marshes. In it is a great mountain, and in it is a tree containing traces of two hands, two feet, and a knee, as if it were a [man] prostrating. So every one of them who passes by it prostrates to it. In it are wild horses that have become feral in the deserts.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 118
  },
  {
    "serial_number": "6265776",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 126,
    "volume_number": 1,
    "text": "Conclusion. This has ended, and praise be to Allah abundantly, and may Allah bless the one He sent as a bringer of good tidings and a warner, and a luminous lamp. From what was presented to the station of the high master, the sea of overflowing generosity, the Commander of the Faithful, and the Master of the Muslims, the one who relies on Allah, the Lord of the Worlds, Al-Qasim bin al-Husayn bin the Commander of the Faithful, the flag of truth and pillar of the law, the refuge of the Ummah, and the remover of every grief from Islam. May Allah prolong his existence, perpetuate his generosity, preserve him, support him, and renew his victory and happiness at every time. Amen, O Allah, Amen. Date: The month of the noble Sha'ban, the year 1129 [1717 AD]. By the pen of its scribe, the one in need of Allah the Almighty, Ahsan bin Ali bin Ubayd Allah al-Ansi al-Kawkabani. May Allah forgive him and his parents. Amen, O Allah, Amen.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 119
  },
  {
    "serial_number": "6265777",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 127,
    "volume_number": 1,
    "text": "List of Sources and References. - Al-Azraqi, Muhammad bin Abdullah bin Ahmad. *Tarikh Makkah* (History of Mecca), edited by Rushdi Malhas, Dar al-Andalus, Beirut. - Al-Istakhri, Ibrahim bin Muhammad. *Masalik al-Mamalik* (Routes of the Realms), edited by de Goeje, Leiden, 1927. - Ibn A'tham al-Kufi. *Kitab al-Futuh* (Book of Conquests), Hyderabad. - Buzurg ibn Shahriyar. *Aja'ib al-Hind* (Wonders of India), edited by Nicola Ziadeh, Beirut, 1974. - Al-Baghdadi, Al-Khatib, Ahmad bin Ali. *Tarikh Baghdad* (History of Baghdad), Dar al-Kitab al-Arabi, Beirut. - Al-Bakri, Abu Ubayd, Abdullah bin Abd al-Aziz. *Jughrafiyat al-Andalus wa Urubba* (Geography of Andalusia and Europe), edited by Abd al-Rahman Ali al-Hajji, Dar al-Irshad, Beirut, 1967.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 120
  },
  {
    "serial_number": "6265778",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 128,
    "volume_number": 1,
    "text": "Al-Maghrib fi Dhikr Bilad al-Maghrib (Description de l'Afrique septentrionale), edited by de Slane, Algiers, 1857. - Al-Baladhuri, Ahmad bin Yahya bin Jabir. *Futuh al-Buldan* (Conquest of the Lands), edited by Salah al-Din al-Munajjid, Cairo, 1956. - Ibn Jubayr, Muhammad bin Ahmad. *Rihlat Ibn Jubayr* (Travels of Ibn Jubayr), Dar Sader, Beirut. - Ibn Hawqal, Muhammad bin Ali. *Surat al-Ard* (Face of the Earth), Dar Maktabat al-Hayah, Beirut. - Ibn Khurdadhbih, Ubayd Allah bin Abdullah. *Al-Masalik wa al-Mamalik* (Routes and Realms), edited by de Goeje, Leiden, 1889. - Al-Dumunki, Father Marmaji. *Buldayniyat Filastin* (Geography of Palestine), Alam Al Kutub, Beirut, 1987. - Al-Diyar Bakri, Husayn bin Muhammad. *Tarikh al-Khamis fi Ahwal Anfus Nafis*, Beirut (photocopy). - Ibn Rustah, Ahmad bin Umar. *Al-A'laq al-Nafisah*, edited by de Goeje, Leiden, 1892. - Ibn Sa'id al-Maghribi, Ali bin Musa. *Kitab al-Jughrafiya*, edited by Ismail al-Arabi, Dar al-Afaq al-Arabiyya, Beirut.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 121
  },
  {
    "serial_number": "6265779",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 129,
    "volume_number": 1,
    "text": "- Al-Samhudi, Ali bin Abdullah. *Wafa' al-Wafa bi Akhbar Dar al-Mustafa* (Faithfulness in the News of the Abode of the Chosen One), Dar al-Kitab al-Arabi, Beirut. - Al-Sirafi, Abu Zayd. *Min Akhbar al-Sin wa al-Hind* (Accounts of China and India), edited by Nicola Ziadeh, Beirut, 1974. - Ibn Shahin al-Zahiri, Izz al-Din Khalil. *Zubdat Kashf al-Mamalik*, edited by Paul Ravaisse, Paris. - Shaykh al-Rabwah, Muhammad bin Talib al-Dimashqi. *Nukhbat al-Dahr*, edited by Mehren, Leipzig. - Ibn Abd al-Hakam, Abd al-Rahim bin Abdullah. *Futuh Misr wa Akhbaruha* (Conquest of Egypt and Its News), edited by Charles Torrey, Leiden, 1920. - Al-Fasi al-Makki, Muhammad bin Ahmad. *Al-Iqd al-Thamin fi Tarikh al-Balad al-Amin*, Mu'assasat al-Risalah, Beirut, 1986. - Abu al-Fida, Ismail bin Muhammad bin Umar. *Taqwim al-Buldan* (Sketch of the Countries), edited by de Slane, Paris, 1840. - Ibn Fadlan, Ahmad. - *Risalat Ibn Fadlan* (Mission of Ibn Fadlan), edited by Sami al-Dahan, Damascus, 1977. - Ibn al-Faqih al-Hamadani, Ahmad bin Muhammad.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 122
  },
  {
    "serial_number": "6265780",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 130,
    "volume_number": 1,
    "text": "*Baghdad Madinat al-Salam* (Baghdad: City of Peace), edited by Saleh Ahmad al-Ali, Baghdad, 1977. *Mukhtasar Kitab al-Buldan* (Summary of the Book of Countries), edited by de Goeje, Leiden, 1885. - Ibn Qutaybah al-Dinawari, Abdullah bin Muslim. *Al-Ma'arif* (Knowledge), edited by Muhammad Ismail al-Sawi, Beirut, 1970. - Qudamah bin Ja'far, Abu al-Faraj. *Nubadh min Kitab al-Kharaj* (Excerpts from the Book of Land Tax), edited by de Goeje, Leiden, 1899. - Le Strange, Guy. *Buldan al-Khilafah al-Sharqiyah* (The Lands of the Eastern Caliphate), Mu'assasat al-Risalah, Beirut. - Al-Maqdisi al-Bashari, Muhammad bin Ahmad. *Ahsan al-Taqasim fi Ma'rifat al-Aqalim* (The Best Divisions for Knowledge of the Regions), edited by de Goeje, Leiden, 1906. - Mu'nis, Husayn. *Ibn Battuta wa Rihlatuhu* (Ibn Battuta and His Travels), Dar al-Ma'arif, Cairo. - Al-Hamdani, Al-Hasan bin Ahmad bin Ya'qub. *Sifat Jazirat al-Arab* (Description of the Arabian Peninsula), edited by Muhammad bin Ali al-Akwa', Dar al-Yamamah, Riyadh, 1974. - Al-Ya'qubi, Ahmad bin Ya'qub bin Wadih. *Al-Buldan* (The Countries), edited by de Goeje, Leiden, 1892. *Tarikh al-Ya'qubi* (History of al-Ya'qubi), Dar Sader, Beirut.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 123
  },
  {
    "serial_number": "6265781",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 131,
    "volume_number": 1,
    "text": "General Index: 1- Index of Noble Quranic Verses. 2- Index of Notables, Tribes, and Nations. 3- Index of Geographical Places and Locations. 4- Contents.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 124
  },
  {
    "serial_number": "6265782",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 133,
    "volume_number": 1,
    "text": "1- Index of Noble Quranic Verses. Verse / Surah / Verse Number / Page. 'There was for Saba, in their dwelling place, a sign: two gardens' / Saba / 15 / 52. 'Then depart from the place from where [all] the people depart' / Al-Baqarah / 199 / 54. 'And the Blast seized those who had wronged' / Hud / 94 / 91. 'He made it level' / Al-A'raf / 143 / 95.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 125
  },
  {
    "serial_number": "6265783",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 134,
    "volume_number": 1,
    "text": "2- Index of Notables, Tribes, and Nations. Adam (peace be upon him) 26. Ibrahim al-Khalil (peace be upon him) 26, 61. Ibrahim al-Fazari 34. Ibrahim al-Mu'ayyad al-Abbasi 37. Turks (Atrak) -> Turk. Ahsan bin Ali (The Scribe) 126. Al-Ahnaf bin Qays 77. Al-Azd 74. Ishaq bin al-Husayn (The Author) 25, 100. Banu Isra'il (Children of Israel) 94. Al-Ifranj (The Franks) 112, 117. Kurds (Al-Akrad) -> Kurd. Anushirvan 66. Barmakids (Al-Baramikah) 82. Berbers (Al-Barbar) 100, 110. Bilqis 51. Turk 36, 37, 67, 120, 122. Taghuzghuz 124. Abu Ja'far al-Mansur 9, 33, 35, 78. Hatim bin al-Nu'man al-Bahili 74. Al-Hajjaj bin Arta'ah 34. Al-Hajjaj bin Yusuf 41, 42. Dawud (David) (peace be upon him) 31. The Messenger of Allah, peace and blessings be upon him, 55, 97. Romans (Al-Rum) 98, 112, 113. Sa'd bin Abi Waqqas 38. Sa'id bin al-Aas 69. Sa'id bin Uthman bin Affan 83. Al-Saffah Abu al-Abbas 35. Sulayman bin Dawud (Solomon) (peace be upon him) 57, 81. Sulayman bin Abd al-Malik 70.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 126
  },
  {
    "serial_number": "6265784",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 135,
    "volume_number": 1,
    "text": "Sudan 110, 111. Shu'ayb (peace be upon him) 91. Sham'un al-Hawari (Simon the Disciple) 114. Saqaliba (Slavs) 117. Tariq bin Ziyad 109, 110, 111. Al-Tabari al-Munajjim 33. Banu al-Abbas 33, 34, 78, 82. Abd al-Rahman bin Samurah bin Habib 80. Abdullah bin Hatim al-Sulami 76. Abdullah bin Amir bin Kurayz 44, 72. Abd al-Malik bin Marwan 41, 42, 43. Abu Ubaydah bin al-Jarrah 57. Utbah bin Ghazwan 39. Uthman bin Affan 44, 76, 77, 78, 80. Ajam (Non-Arabs/Persians) 69, 72, 73, 77. Arabs 64, 68, 72, 77. Uqbah bin Nafi' 98. Ali bin Abi Talib 38, 53, 83. Umar bin al-Ala 69. Umar bin al-Khattab 38, 39, 66, 67, 68. Amr bin al-Aas 60. Isa (Jesus) (peace be upon him) 31, 32, 114, 116, 117. Ghutayshah (Witiza) 109. Fatimah daughter of the Messenger of Allah, peace be upon him, 53. Fir'awn (Pharaoh) 86, 89, 93. Persians (Al-Furs) 66, 68. Franks (Al-Faranjah) -> Al-Ifranj. Al-Qasim bin al-Husayn 126. Qutaybah 66. Qutaybah bin Muslim 83, 84. Qarazah bin Ka'b al-Ansari 67. Constantine (The Emperor) 116. Goths (Al-Qut) 109, 110, 111. Kurd 67. Roderic (Ladhriq) 111. Al-Mutawakkil 37. Muhammad bin Marwan bin al-Hakam 63.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 127
  },
  {
    "serial_number": "6265785",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 136,
    "volume_number": 1,
    "text": "Muhammad bin al-Muntasir (The Caliph) 37. Muslims 123. Mu'awiyah bin Abi Sufyan 30, 70, 83, 96, 98. Al-Mu'tazz 37. Al-Mu'tasim bin Harun al-Rashid 36, 37. Ma'n Za'idah 78, 79. Al-Mahdi bin al-Mansur 27. Musa (Moses) (peace be upon him) 89, 94, 95. Abu Musa al-Ash'ari 66. Musa bin Nusayr 109, 110. The Negus (Al-Najashi) 104. Christians (Al-Nasara) 123. Nimrod bin Kan'an 61. Harun al-Rashid 62, 67, 68. Banu Hashim 59. Al-Wathiq 37. Al-Walid bin Abd al-Malik 83, 84, 109, 110. Yahya bin Zakariya (John the Baptist) (peace be upon him) 57. Yazdegerd 69. Yazid bin Mu'awiyah 83. Yazid bin al-Muhallab 70. Jews (Al-Yahud) 97, 122. Yusuf (Joseph) (peace be upon him) 89.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 128
  },
  {
    "serial_number": "6265786",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 137,
    "volume_number": 1,
    "text": "3- Geographical Places and Locations. Abrara 109. Al-Ubulla 39. Uhud 29. Akhshanbah (Oxus/Amu Darya?) 106. Azerbaijan 64. Jordan 60. Aragon 108. Armenia 28. Socotra -> Suqutra. Alexandria 85. Seville 107, 109. Aghmat 101. Al-Ifranj (Land of the Franks) 107, 109. Ifriqiya 98, 101, 109. Al-Anbar 35. Crete 87. Andalusia 101, 102, 106, 108, 109, 110, 112. Antioch 59. Ankara 118. Ahwaz 43. Ayla 97. Ili, River 60. Aelia (Jerusalem) 31. Bab al-Basra 34. Bab Khurasan 34. Bab al-Rahmah 32. Bab al-Sham 34. Bab al-Kufa 34. Bahr al-Shami (Levantine Sea) 61, 87, 96, 97, 100, 101, 102, 108, 112, 124. Bahr Tabaristan (Caspian Sea) 125. Bahr al-Iraq 43, 44.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 129
  },
  {
    "serial_number": "6265787",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 138,
    "volume_number": 1,
    "text": "Al-Bahr al-A'zam (The Greatest Sea) 43, 101. Bahr al-Qulzum (Red Sea) 94, 103. Al-Bahr al-Maghribi (Western Sea) 101, 103. Bahrain 55. Buhayrat Khurasan (Lake of Khurasan/Aral) 123. Buhayrat al-Khazar (Lake of the Khazars/Caspian) 123. Buhayrat Tabariyah (Sea of Galilee) 60. Bajana (Pechina) 106. Bukhara 83. Barbastro 108. Barcelona 106. Basra 28, 37, 38, 39, 40, 41, 65. Al-Batihah 40. Baghdad 27, 33, 36, 37, 68. Balkh 102. Balkar 122. Balkuwara 37. Valencia 108. Banat Na'sh 30. Bilad al-Barbar (Land of Berbers) 100, 101, 102. Bilad al-Turk (Land of Turks) 84, 124. Bilad al-Rum (Land of Romans/Byzantium) 62, 86, 87. Bilad al-Sudan (Land of Blacks) 90, 101, 102, 103. Bilad al-Shamat (Lands of the Levant) 117. Bilad al-Shamakisah 107. Bilad al-Saqaliba (Land of Slavs) 112. Bilad al-Nuba (Nubia) 89. Bayt al-Maqdis (Jerusalem) 31. Tahert 100, 101. Tarragona 106. Tudela 108. Tenes 101. Tinnis 88, 97. Al-Tih (The Wilderness) 94. Al-Thaghr al-A'la (Upper Frontier) 107. Al-Thaghr al-Sharqi (Eastern Frontier) 107. Jubb Yusuf (Pit of Joseph) (peace be upon him) 60. Gibraltar 110. Jabal al-Qamar (Mountain of the Moon) 90. Jabal al-Muqattam 90. Jurjan 70. Al-Jurjaniyah 87. Jarmi 104.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 130
  },
  {
    "serial_number": "6265789",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 139,
    "volume_number": 1,
    "text": "Al-Jazira (Mesopotamia) 63. Al-Ja'fariyah 37. Jillaq (Damascus) 107. Galicia 108, 109. Al-Jawsaq 37. Abyssinia (Al-Habasha) 104. Hejaz 28. Black Stone 26, 28. Hajar al-Yamamah 56. Hadhramaut 53. Aleppo 59. Al-Hamma 60. Hulwan 68. Khurasan 69, 70, 72, 74, 76, 77, 78, 79, 81, 82, 123. Khazars 152. Khwarazm 81. Al-Khawarnaq 107. Denia 109. Tigris (River) 34, 35, 36, 37. Damascus 57, 62. Damietta 87. Dongola 104. Abu al-Rabi' 98. Radwa 29. Al-Raqim 117, 118. Yemeni Corner 28. Al-Rawdah 30. Rome 112, 113, 116. Rayy 67, 71. Zabag (Sumatra/Java) 119, 120. Zaghawa 104. Saba 51. Ceuta 101. Sijistan 77, 78, 81. Sijilmasa 101. Al-Sadir 107. Surra Man Ra'a (Samarra) 36, 37. Sirte 96. Sarakhs 75, 76. Zaragoza 89. Serendib (Sri Lanka) 119. Socotra 36. Samarkand 84.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 131
  },
  {
    "serial_number": "6265790",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 140,
    "volume_number": 1,
    "text": "Sindh 28, 78, 80, 122. Al-Sawad 37. Suez 94. Al-Shash (Tashkent) 122. Al-Sham (Syria/Levant) 28, 37, 41, 61, 91. Chalon? (Shalun) 107. The Rock (Dome of the Rock) 32. Al-Sa'id al-A'la (Upper Egypt) 79. Al-Safa 27. Sanaa 45. China 121. Taif 56. Al-Tan Yinu 123. Tabaristan 68, 69. Tiberias 60. Tripoli 96. Tarsus 62. Tortosa 109. Toledo 107, 110. Tangier 101. Tus 73. Taybah (Medina) 29. Abadan 43. Aden 47, 53. Ashkelon 61. Iraq 38, 42, 107. Alwa 104. Oman 49, 54, 55. Amorium 117, 118. Al-Awasim 41. Ayn al-Shams 93. Ghana 103. Fars 44. Fez 102. Euphrates 35, 38, 43. Al-Qatul 36. Cyprus 87. Abu Qubays 26. Cordoba 106, 110. Cartagena 102. Constantinople 83, 103, 112, 116, 117, 118. Kastiliya (Tozeur region) 101. Castile 108. North Pole 26.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 132
  },
  {
    "serial_number": "6265791",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 141,
    "volume_number": 1,
    "text": "Al-Qulzum -> Suez. Calatayud (Qal'at Ayyub) 108. Calahorra (Qalahrah) 108. Kairouan 96, 98. Kerman 80. Kaaba 28. Church of Al-Qasqar 57. The Cave 117, 118. Qus 104. Kufa 27, 38, 40, 41. Kuku (Gao?) 104. Lleida (Larida) 108. Ma'rib 51. Merida 108, 110. Malaga 109. Mihrab Dawud (peace be upon him) 13. Al-Muhassab 8. Madyan 91, 92. Medinaceli (Madinat Salim) 27. City of Misr (Fustat/Cairo) 89, 97. City of the Prophet, peace be upon him (Medina) 29. Merv 74, 75. Al-Marwah 27. Almeria 108. Mosque of the Prophet, peace be upon him 30. The Great Mosque (Baghdad) 34. Massoun? (Masasun) 108. Egypt (Misr) 61, 85, 98. Mecca 25, 26, 56. Mulhaman? 120. Melilla 102. Menorca 109. Mahdia 67. Mosul 63, 64, 65. Mallorca 109. Nakur 102. Nahavand 65, 66. River Orontes 101. Nile River 88, 90, 97, 103, 104, 105. Nubia 103, 104, 105. Nishapur 72, 73, 75. Al-Haruni (Palace) 37. Hajar 63, 65. Herat 76, 77. The Two Pyramids 89.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 133
  },
  {
    "serial_number": "6265792",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 142,
    "volume_number": 1,
    "text": "Hamadan 63, 65. India 28, 83, 95, 119, 120. Temple of Venus 106. Wadi al-Aqiq 30. Wasit 40, 41. Huesca (Washka) 107. Al-Yamama 56. Yemen 28, 45, 53, 54, 55.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 134
  },
  {
    "serial_number": "6265793",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 143,
    "volume_number": 1,
    "text": "Contents: Introduction 5. Honored Mecca 25. The City of the Prophet, peace be upon him 29. Bayt al-Maqdis (Jerusalem) Aelia 31. Baghdad 33. Surra Man Ra'a (Samarra) 36. Kufa 38. Basra 39. Wasit 41. Abadan 43. Siraf 44. Sanaa 45. Aden 47. Oman 49. Saba 51. Hadhramaut 53. Socotra 54. Bahrain 55. Hajar 55. Taif and Al-Yamama 56. Damascus 57. Aleppo 59. Tiberias 60. Ashkelon 61. Tarsus 62. Mosul 63. Azerbaijan 64. Hamadan 65. Nahavand 65. Isfahan 66. Rayy 67. Hulwan 68. Tabaristan 69. Jurjan 71.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 135
  },
  {
    "serial_number": "6265794",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Hills of Coral in Mentioning Famous Cities Everywhere",
    "edition": "First, 1408 AH",
    "publisher": "Alam Al Kutub, Beirut",
    "page_number": 144,
    "volume_number": 1,
    "text": "Nishapur 72. Tus 73. Merv 74. Sarakhs 76. Herat 77. Sijistan 78. Kerman 80. Khwarazm 81. Balkh 82. Bukhara 83. Samarkand 84. Alexandria 85. Damietta 87. Tinnis 88. Madyan 91. Ayn al-Shams 93. Tripoli 96. Sirte 96. Ajdabiya 97. Ayla 97. Al-Qulzum or Suez 94. Land of Al-Tih (Wilderness) 94. Kairouan 98. Tahert 100. Land of Berbers 101. Pechina 101. Kastiliya 101. Land of Sudan 103. Ghana 103. Al-Tawbah (Likely Nubia) 104. Abyssinia 104. Zaghawa 104. Island of Andalusia 106. Romans and Franks 112. City of Rome 113. City of Constantinople 116. Al-Raqim and the Cave 118. Zabag in India 120. Land of Khazars and Al-Shash 122. Land of Turks 124.",
    "foot_note": "None",
    "book_id": "11568",
    "new_page_number": 136
  }
]