[
  {
    "text": "Treatise on the Ruling of the Price of Dogs (Risalah fi Hukm Thaman al-Kilab)\nAuthor: أحمد بن عوض\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Treatise on the Ruling of the Price of Dogs (Risalah fi Hukm Thaman al-Kilab)",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 1
  },
  {
    "text": "sn: 4902\nbook_title: رسالة في حكم ثمن الكلاب\nbook_link: https://shamela.ws/book/994\nbook_id: 994\nauthor_name: أحمد بن عوض\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1273\nauthor_ID: 1273\neditor: راجعه وقدم له: مصطفى بن العدوي\npublisher: دار اللؤلؤة للنشر والتوزيع، المنصورة - مصر\nedition: الأولى، 2018 م\npages: 90\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: مسائل فقهية\ncategory_id: 19",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Treatise on the Ruling of the Price of Dogs (Risalah fi Hukm Thaman al-Kilab)",
    "category_id": "19",
    "category": "Fiqh Issues",
    "new_page_number": 2
  },
  {
    "serial_number": "4626828",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs (Risalah fi Hukm Thaman al-Kilab)",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Fiqh Issues\nBook: Risalah fi Hukm Thaman al-Kilab\nAuthor: Ahmad bin Awad\nReviewed and Introduced by: Mustafa bin Al-Adawi",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 3
  },
  {
    "serial_number": "4626829",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 1,
    "volume_number": 1,
    "text": "Treatise on the Ruling of the Price of Dogs\n(Selling dogs - Fining the killer of a dog its price - Renting a dog - Price of training a dog - Price of treating a dog)\nAuthored by Ahmad bin Awad\nReviewed and Introduced by His Eminence Sheikh / Mustafa bin Al-Adawi",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 4
  },
  {
    "serial_number": "4626830",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nForeword\n\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah, may Allah bless him and grant him peace. To proceed:\nThis is a concise research on the ruling of selling dogs and some related matters, prepared by my brother in Allah, Ahmad bin Awad - may Allah preserve him. He has taken care of both the Hadith and Fiqh aspects equally. He referenced the Hadiths and Athar (narrations), judged each as it deserves, and cited the sayings of the Imams of Fiqh in this regard. Furthermore...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 5
  },
  {
    "serial_number": "4626831",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 4,
    "volume_number": 1,
    "text": "...he cited the Athar from the Companions, the Successors (Tabi'in), and the Successors of the Successors in this regard, and judged them - as I mentioned previously - as they deserve, along with their referencing.\nI reviewed his work with him and found it - praise be to Allah - beneficial. May Allah reward him with good for what he has done and increase him in success. O Allah, send peace and blessings upon our Prophet Muhammad, and praise be to Allah, Lord of the Worlds.\nWritten by / Abu Abdullah Mustafa bin Al-Adawi",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 6
  },
  {
    "serial_number": "4626832",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 5,
    "volume_number": 1,
    "text": "Author's Introduction:\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah. To proceed:\nThis is a treatise in which I collected what has been reported in the Book (Quran) and the Sunnah regarding the ruling on selling dogs. I followed that with the sayings of the Companions, the Successors, and the sayings of the scholars of the four schools of thought and others. I clarified therein every opinion, what evidence was used, the method of inference, and how the opponent's evidence was refuted. I discussed the Hadiths and Athar in terms of authenticity and weakness, and quoted every saying from its source.\nI presented this to our Sheikh Mustafa bin Al-Adawi - may Allah preserve him and bless his knowledge, work...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 7
  },
  {
    "serial_number": "4626833",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 6,
    "volume_number": 1,
    "text": "...life, and offspring. He reviewed it gratefully. May Allah reward him with the best reward on my behalf and on behalf of students of knowledge for the advice, effort, and time he expends.\nThis, and praise be to Allah, Lord of the Worlds, and peace be upon the Messengers.\nWritten by / Ahmad bin Awad",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 8
  },
  {
    "serial_number": "4626834",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 7,
    "volume_number": 1,
    "text": "Scholars' Opinions on the Ruling of Selling Dogs in Summary.\nScholars differed on this issue into five opinions:\nFirst Opinion: It is not permissible to sell a dog absolutely, whether trained or untrained.\nSecond Opinion: It is permissible to sell a dog absolutely.\nThird Opinion: It is permissible to buy hunting dogs but not to sell them.\nFourth Opinion: It is permissible to buy and sell dogs that are permitted to be kept.\nFifth Opinion: It is permissible to sell a trained dog.",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 9
  },
  {
    "serial_number": "4626835",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 8,
    "volume_number": 1,
    "text": "It can be divided into two main opinions: an opinion permitting the sale of dogs, and an opinion prohibiting it. However, I detailed the discussion on it in order to attribute each opinion to its scholar without adding to his words. Here are their opinions in detail.",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 10
  },
  {
    "serial_number": "4626836",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 9,
    "volume_number": 1,
    "text": "First Opinion: It is not permissible to sell dogs absolutely (trained or untrained).\nThis is the opinion of: Malik in the well-known view from him (authenticated by Ibn Abd al-Barr), the Shafi'is, the Hanbalis, Ibn Hazm, and others (1).\nTheir evidences:\n1. From Abu Mas'ud al-Ansari, may Allah be pleased with him: \"The Messenger of Allah, may Allah bless him and grant him peace, forbade the price of a dog, the dowry of a prostitute, and the fee of a soothsayer\" (2).",
    "foot_note": "1. Their opinions will be mentioned in detail after citing the evidences. \n2. Agreed upon: Al-Bukhari (2282), Muslim (1567).",
    "book_id": "994",
    "new_page_number": 11
  },
  {
    "serial_number": "4626837",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 10,
    "volume_number": 1,
    "text": "2. From Awn bin Abi Juhayfah, may Allah be pleased with him, he said: I saw my father buying a cupper (hajjām), then he ordered his cupping instruments to be broken. I asked him about that, and he said: \"Indeed, the Messenger of Allah, may Allah bless him and grant him peace, forbade the price of blood, the price of a dog, and the earnings of a slave girl (from prostitution), and he cursed the one who tattoos and the one who asks to be tattooed, the one who consumes usury and the one who pays it, and he cursed the image-maker\" (1).\n3. From Rafi' bin Khadij, may Allah be pleased with him, he said: I heard the Prophet, may Allah bless him and grant him peace, say: \"The worst of earnings are the dowry of a prostitute, the price of a dog, and the earnings of a cupper\" (2).\n4. From Abu al-Zubayr, he said: I asked Jabir about the price of a dog and a cat? ... He said: \"The Prophet, may Allah bless him and grant him peace, rebuked...",
    "foot_note": "1. Authentic (Sahih): Narrated by Al-Bukhari (2238). \n2. Authentic (Sahih): Muslim (1568).",
    "book_id": "994",
    "new_page_number": 12
  },
  {
    "serial_number": "4626838",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 11,
    "volume_number": 1,
    "text": "...that\" (1).\n5. From Abu Huraira, may Allah be pleased with him, he said: \"The Messenger of Allah, may Allah bless him and grant him peace, forbade the earnings of a cupper, the price of a dog, and the stud fee of a stallion\" (2).",
    "foot_note": "1. Narrated by Muslim (1569) via Ma'qal bin Ubaydullah al-Jazari, from Abu al-Zubayr, with it. However, Ma'qal's narrations from Abu al-Zubayr are criticized. Ibn Rajab said: \"Ahmad used to consider his hadith from Abu al-Zubayr specifically as weak and say: (His hadith resembles the hadith of Ibn Lahi'ah). Whoever wants to know the reality of this should look at his hadiths from Abu al-Zubayr; he will find them with Ibn Lahi'ah narrating them from Abu al-Zubayr just as Ma'qal narrates them.\" Sharh Ilal al-Tirmidhi (Ed. Hammam 2/ 793). See also Jami' al-Ulum wa al-Hikam (Ed. al-Arna'ut 2/ 453). \n2. Good (Hasan): Narrated by Ahmad (7976), and Al-Nasa'i (4673).",
    "book_id": "994",
    "new_page_number": 13
  },
  {
    "serial_number": "4626839",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 12,
    "volume_number": 1,
    "text": "6. From Ibn Abbas, may Allah be pleased with him, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"May Allah curse the Jews; fats were forbidden for them, so they sold them and ate their prices. And indeed, when Allah Almighty forbids eating something, He forbids its price\" (1).\n7. From Ali, may Allah be pleased with him: \"The Prophet, may Allah bless him and grant him peace, forbade the price of a dog\" (2).\n8. From Abdullah bin Abbas, may Allah be pleased with them both, he said: \"The Messenger of Allah, may Allah bless him and grant him peace, forbade the price of a dog. If someone comes asking for the price of a dog, fill his palm with dust\" (3).",
    "foot_note": "1. Good (Hasan): Narrated by Ahmad (2678), and Abu Dawood (3488). \n2. Good due to supporting evidence (Hasan bi-shawāhidihi): Narrated by Al-Tahawi in \"Sharh Ma'ani al-Athar\" (5682). \n3. Narrated by Ahmad (3273), and Abu Dawood (3482). Its chain includes Qays bin Habtar: Al-Nasa'i authenticated him, and Ibn Hibban mentioned him in (Al-Thiqat), and (Zufar al-Ijli, Abd al-Karim bin Malik al-Jazari, Ali bin Badhima, and Ghalib bin Abbad) narrated from him. But Sheikh Mustafa Al-Adawi - may Allah preserve him - said: Al-Nasa'i often uniquely authenticates some narrators contrary to famous scholars, while they are not famous, so there is reservation about his authentication, and Allah knows best.",
    "book_id": "994",
    "new_page_number": 14
  },
  {
    "serial_number": "4626840",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 13,
    "volume_number": 1,
    "text": "9. From Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"The price of a dog is not lawful, nor the fee of a soothsayer, nor the dowry of a prostitute\" (1).\n10. From Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, may Allah bless him and grant him peace: \"Forbade the price of a dog, even if it is trained for hunting (dāriyan)\" (2).",
    "foot_note": "1. Weak (Da'if): Narrated by Abu Dawood (3484), Al-Nasa'i (4293), and Abu Awana (5273). Its chain includes Ma'ruf bin Suwayd: who is weak. \n2. Weak (Da'if): Narrated by Al-Tahawi in \"Sharh Ma'ani al-Athar\" (5686). Its chain includes Ibn Lahi'ah, who is weak.",
    "book_id": "994",
    "new_page_number": 15
  },
  {
    "serial_number": "4626841",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 14,
    "volume_number": 1,
    "text": "• Among the Companions and Successors who held this view are:\n1. From Abu Huraira, may Allah be pleased with him, he said: \"The price of a dog is Suht (illicit gain)\" (1).\n2. From Shu'bah, he said: I heard Al-Hakam and Hammad \"disliking the price of a dog\" (2).\n3. From Abd al-Rahman bin Abi Layla, he said: \"I do not care whether I eat the price of a dog or the price of a pig\" (3).\n4. From Ash'ath, from Ibn Sirin, he said: \"The most malicious...",
    "foot_note": "1. Weak (Da'if): Narrated by Ibn Abi Shaybah in (his Musannaf 20906). Its chain includes: Sa'id Mawla Khalifa, and no reliable critic authenticated him; Ibn Hibban only mentioned him in \"Al-Thiqat\" as per his habit of authenticating unknown narrators. \n2. Authentic (Sahih): Narrated by Ibn Abi Shaybah in (his Musannaf 20915). \n3. Good (Hasan): Narrated by Ibn Abi Shaybah in (his Musannaf 20914).",
    "book_id": "994",
    "new_page_number": 16
  },
  {
    "serial_number": "4626842",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 15,
    "volume_number": 1,
    "text": "...earning is the earning of a flute player and the price of a dog\" (1).\n• They used Analogy (Qiyas) as evidence: Analogous to the pig, based on the shared prohibition of keeping them except in cases of need (2).\n• The aspect of inference from the previous hadiths: The prohibition of the price of a dog is absolute, including trained and untrained, and what is permissible to keep and what is not. Whoever restricts it to the untrained dog or the dog that is not permissible to keep must provide evidence specifying this absolute prohibition (3).",
    "foot_note": "1. Its narrators are trustworthy except Ash'ath, whom I do not know: Narrated by Ibn Abi Shaybah in (his Musannaf 20913). \n2. Al-Buyu' al-Muharramah wa al-Manhi 'anha p. 182, PhD thesis by Abd al-Nasir bin Khidr Milad. \n3. Al-Mu'amalat al-Maliyah Asalah wa Mu'asarah (3/ 421).",
    "book_id": "994",
    "new_page_number": 17
  },
  {
    "serial_number": "4626843",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 16,
    "volume_number": 1,
    "text": "And because it is an impure animal, its sale is not permissible like the pig (1).\nThese evidences were discussed as follows:\nA - These hadiths are abrogated; they were from the time when killing dogs was commanded, when there was no permissible benefit in dogs. When the command to kill dogs was abrogated and permission came to keep some of them, it was established that the prohibiting hadiths were abrogated.\nB - Pairing the price of a dog with the dowry of a prostitute and the fee of a soothsayer does not indicate that their ruling is the same. This is evidence of coupling (dalālat al-iqtirān), which is weak (2).",
    "foot_note": "1. Al-Majmu' Sharh al-Muhadhdhab (9/ 229). \n2. Aridat al-Ahwadhi (5/ 42), and the evidences and refutation will be explained in the second opinion.",
    "book_id": "994",
    "new_page_number": 18
  },
  {
    "serial_number": "4626844",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 17,
    "volume_number": 1,
    "text": "The response to this is:\n1. The concession for hunting and sheep dogs occurred after the command to kill dogs. Thus, the dog which the Messenger of Allah, may Allah bless him and grant him peace, permitted to be kept is the one whose price he forbade and declared wicked, not the dog he ordered to be killed. For the one ordered to be killed is not kept such that the Ummah would need clarification of the ruling of its price, nor was there a custom of selling and buying it. Unlike the dog permitted to be kept, for the need to clarify the ruling of its price is greater than their need for clarification of what was not customary to sell. Rather, they were ordered to kill them, as in the hadith of Ibn Umar: \"The Messenger of Allah, may Allah bless him and grant him peace, ordered the killing of dogs, except a hunting dog or a sheep or livestock dog.\" It was said to Ibn Umar: Abu Huraira says: \"Or a farm dog.\" Ibn Umar said: \"Abu Huraira has...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 19
  },
  {
    "serial_number": "4626845",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 18,
    "volume_number": 1,
    "text": "...farm land\" (1). And as in the hadith of Ibn al-Mughaffal, he said: The Messenger of Allah, may Allah bless him and grant him peace, ordered the killing of dogs, then said: \"What is the matter with them and dogs?\" Then he granted a concession for the hunting dog and the sheep dog (2), (3).\n2. Inferring from the prohibition is prioritised because the default in prohibition is forbiddance (Tahrim). As for evidence of coupling, it is weak. Therefore, the Messenger, may Allah bless him and grant him peace, paired the prohibition of the price of a dog with the prohibition of the cupper's earnings; the first is forbidden (Haram), and the second is disliked (Makruh) (4).",
    "foot_note": "1. Agreed upon: Al-Bukhari (3323), Muslim (1571) and the wording is his. \n2. Authentic (Sahih): Muslim (1573). \n3. Zad al-Ma'ad fi Hady Khayr al-Ibad (5/ 701). \n4. Al-Mu'amalat al-Maliyah Asalah wa Mu'asarah (3/ 422).",
    "book_id": "994",
    "new_page_number": 20
  },
  {
    "serial_number": "4626846",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 19,
    "volume_number": 1,
    "text": "Opinions of Scholars in Detail\nFirst: The Malikis:\nMalik, may Allah have mercy on him, said: \"I dislike the price of a trained dog and an untrained one; due to the prohibition of the Messenger of Allah, may Allah bless him and grant him peace, of the price of a dog\" (1). Sahnun said to Ibn al-Qasim: \"What do you think about dogs? Does Malik permit selling them? Malik said: Their sale is not permissible\" (2). Ibn Rushd the Grandfather, may Allah have mercy on him, said: \"It is known from the saying of...",
    "foot_note": "1. Muwatta Malik (1919) Investigation by Bashar. \n2. Al-Mudawwana (1/ 511).",
    "book_id": "994",
    "new_page_number": 21
  },
  {
    "serial_number": "4626847",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 20,
    "volume_number": 1,
    "text": "...Ibn al-Qasim, and his narration from Malik: That it is not permissible to sell a dog, even if it is one of the dogs permitted to be kept for hunting, livestock, and farming, based on the apparent meaning of the Prophet's saying, may Allah bless him and grant him peace, in his prohibition of the price of a dog generally, without specifying one dog from another. This is strengthened by what was narrated from Ibn Umar, may Allah be pleased with him: 'The Messenger of Allah, may Allah bless him and grant him peace, forbade the price of a dog, even if it is trained for hunting'\" (1).\nIbn Abd al-Barr, may Allah have mercy on him, said: \"Whatever is permissible to eat its meat is permissible to buy and sell. What is not permissible to eat its meat is divided into two parts: One: What is beneficial while alive, and the other has no benefit. So everything that has the benefit of riding, adornment, hunting, and other benefits for...",
    "foot_note": "1. Al-Bayan wa al-Tahsil (8/ 82).",
    "book_id": "994",
    "new_page_number": 22
  },
  {
    "serial_number": "4626848",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 21,
    "volume_number": 1,
    "text": "...humans, its sale and purchase is permissible except the dog alone; due to the prohibition of the Messenger of Allah, may Allah bless him and grant him peace, of the price of a dog. It has been said regarding hunting and livestock dogs that their sale is permissible, and this was also narrated from Malik, but the first is the conclusion of his school, and it is the correct view, God willing\" (1).\n\nSecond: The Shafi'is:\nAl-Shafi'i, may Allah have mercy on him, said: \"And this is what we say: a price is not lawful for a dog in any case\" (2).\nAl-Nawawi, may Allah have mercy on him, said: \"As for the prohibition of the price of a dog, and its being among the worst earnings, and its being wicked, it indicates...",
    "foot_note": "1. Al-Kafi fi Fiqh Ahl al-Madinah (2/ 674). For more, see if you wish: Sharh al-Talqin (2/ 429), Mawahib al-Jalil (4/ 267). \n2. Al-Umm (3/ 11).",
    "book_id": "994",
    "new_page_number": 23
  },
  {
    "serial_number": "4626849",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 22,
    "volume_number": 1,
    "text": "...the prohibition of its sale, and that its sale is invalid, its price is not lawful, and there is no value (compensation) upon its destroyer, whether it is trained or not, and whether it is of those permissible to keep or not. This is what the majority of scholars said\" (1).\nIbn Hajar, may Allah have mercy on him, said: \"The apparent meaning of the prohibition is the forbidding of its sale. This is general for every dog, whether trained or otherwise, whether permissible to keep or not. A necessary consequence of this is that there is no value upon its destroyer. The majority held this view\" (2).\n\nThird: The Hanbalis:\nAhmad bin Hanbal, may Allah have mercy on him, said: \"The sale of dogs is void\" (3).",
    "foot_note": "1. Sharh Muslim (10/ 232). \n2. Fath al-Bari (4/ 426). For more, see if you wish: Nihayat al-Muhtaj ila Sharh al-Minhaj (3/ 392), Al-Hawi al-Kabir (5/ 375), Al-Tahdhib fi Fiqh al-Imam al-Shafi'i (3/ 562). \n3. Al-Istidhkar (6/ 431). I did not find Ahmad's statement in Hanbali books.",
    "book_id": "994",
    "new_page_number": 24
  },
  {
    "serial_number": "4626850",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 23,
    "volume_number": 1,
    "text": "Ibn Qudamah, may Allah have mercy on him, said: \"There is no difference in the school that the sale of a dog is void, whatever dog it may be\" (1).\nAl-Mardawi, may Allah have mercy on him, said: \"His saying: (And selling a dog is not permissible), this is the school absolutely, and upon it are the companions (of the school), and they were definitive about it\" (2).\n\nFourth: The Zahiris:\nIbn Hazm, may Allah have mercy on him, said: \"It is not lawful to sell a dog at all, neither the one permitted to be kept nor others; due to the authenticity of the prohibition of the Prophet, may Allah bless him and grant him peace, regarding it. We will mention it in the Book of Sales, God willing...",
    "foot_note": "1. Al-Mughni (4/ 189). \n2. Al-Insaf (4/ 280). For more, see if you wish: Al-Kafi (2/ 7), Al-Sharh al-Kabir (4/ 13), Sharh al-Zarkashi (3/ 670), Manar al-Sabil (1/ 308).",
    "book_id": "994",
    "new_page_number": 25
  },
  {
    "serial_number": "4626851",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 24,
    "volume_number": 1,
    "text": "...Whoever is compelled to it may take it from someone who does not need it without a price. If he is unable to do that, he may buy it, and the price is forbidden for the seller, remaining in the ownership of the buyer. It is only like a bribe in a grievance, and ransom for a prisoner; because it is taking money unjustly. And with Allah Almighty is success\" (1).\nAmong those who held this opinion as well: Ibn al-Mundhir and others.\nIbn al-Mundhir, may Allah have mercy on him, said: \"It is not permissible to sell dogs, nor are they divided if found in spoils of war. But the Imam gives what is among them of those permissible to benefit from, to whomever he wishes of those entitled to shares. We prevented its value only because of the prohibition of the Prophet, may Allah bless him and grant him peace, of the price of a dog, so that is general\" (2).",
    "foot_note": "1. Al-Muhalla (6/ 175), and the saying of Dawud al-Zahiri will come. \n2. Al-Awsat (11/ 205).",
    "book_id": "994",
    "new_page_number": 26
  },
  {
    "serial_number": "4626852",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 25,
    "volume_number": 1,
    "text": "Al-Nawawi, may Allah have mercy on him, said: \"Its price is not lawful, nor is there value upon its destroyer, whether trained or not, and whether permissible to keep or not. This is what the majority of scholars said... and Al-Hasan Al-Basri, Rabi'ah, Al-Awza'i, Al-Hakam, Hammad... and Dawud... and others\" (1).\nA group of contemporary scholars also held this view:\nIbn Uthaymeen, may Allah have mercy on him, said: \"The sale of a dog is not valid, even if it is a hunting dog, and even if trained, although there is permissible benefit in it; because the Prophet, may Allah bless him and grant him peace, forbade the price of a dog\" (2).\nAl-Shanqiti, may Allah preserve him, said: \"The most correct of these opinions is the opinion of the impermissibility of selling a dog absolutely\" (3).",
    "foot_note": "1. Sharh Muslim (10/ 232). \n2. Al-Sharh al-Mumti' (8/ 113). \n3. Sharh Zad al-Mustaqni' (144/ 6) Shamela numbering.",
    "book_id": "994",
    "new_page_number": 27
  },
  {
    "serial_number": "4626853",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 26,
    "volume_number": 1,
    "text": "It was stated in the Fatwas of the Permanent Committee: \"It is not permissible to sell dogs, nor is their price lawful, whether they are guard dogs, hunting dogs, or otherwise\" (1).\nIt was stated in the Collection of Fatwas of Ibn Baz: \"What should be done with the price of a dog, O Sheikh? He replied, may Allah have mercy on him: It is returned to its owner; the sale is void\" (2).\nIt was stated in the Encyclopedia of Sales Originality and Contemporary: \"It is not permissible to sell a dog. It is permissible to acquire a hunting dog and similar dogs needed. If a person needs...",
    "foot_note": "1. (13/ 36) First Group. Signed by: Sheikh Ibn Baz (President), Sheikh Abd al-Razzaq Afifi (Deputy President), Sheikh Abdullah bin Qa'ud (Member), and Sheikh Abdullah bin Ghudayyan (Member). \n2. (19/ 39).",
    "book_id": "994",
    "new_page_number": 28
  },
  {
    "serial_number": "4626854",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 27,
    "volume_number": 1,
    "text": "...a guard dog and the like, and finds no one who will give it to him except by sale, then it is permissible to buy it, after advising its seller. The sin is on the seller. If a person cannot reach his right except through purchase, the sin is on the one who forced him to do so. And Allah knows best\" (1).\nIt was stated on the Islam Question and Answer website supervised by Sheikh Muhammad bin Salih Al-Munajjid: \"As for selling dogs, their sale is forbidden (Haram), even if the dog is of those permissible to keep. Many hadiths have been reported from the Prophet, may Allah bless him and grant him peace, forbidding the sale of dogs, and in their generality, they include all dogs, those permissible to keep and those not\" (2).",
    "foot_note": "1. Al-Mu'amalat al-Maliyah (3/ 432). \n2. Fatwa No. (69818).",
    "book_id": "994",
    "new_page_number": 29
  },
  {
    "serial_number": "4626855",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 28,
    "volume_number": 1,
    "text": "It was stated in the Journal of Islamic Research in Riyadh: \"Given the fixed prohibition in the authentic hadith regarding the price of a dog, there is no doubt about the preponderance of the majority opinion regarding the impermissibility of selling it. This prohibition remains; no authentic evidence has been established to divert it from its apparent meaning. Rather, all that the proponents of the second opinion—those claiming the validity of its sale—clung to are weak narrations (Athar) and rejected reasonings. And Allah Almighty knows best\" (1).",
    "foot_note": "1. (76/ 369).",
    "book_id": "994",
    "new_page_number": 30
  },
  {
    "serial_number": "4626856",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 29,
    "volume_number": 1,
    "text": "Second Opinion: It is permissible to sell dogs absolutely.\nThis is the opinion of: The Hanafis, a narration from Malik, and this was held by Ibn al-Arabi al-Maliki (1).\nTheir evidences:\n1 - The saying of the Almighty: {They ask you, [O Muhammad], what has been made lawful for them. Say, \"Lawful for you are [all] good foods and [game caught by] what you have trained of hunting animals which you train as Allah has taught you. So eat of what they catch for you, and mention the name of Allah upon it, and fear Allah. Indeed, Allah is swift in account.\" (4)} [Surah Al-Ma'idah: 4].\nThe aspect of inference: The word \"making lawful\" implies the permissibility of...",
    "foot_note": "1. Their opinions will be mentioned in detail after citing the evidences.",
    "book_id": "994",
    "new_page_number": 31
  },
  {
    "serial_number": "4626857",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 30,
    "volume_number": 1,
    "text": "...all forms of benefit, and sale is one of them. So its permissibility is obligatory; due to the generality of the word (1).\nAl-Qurtubi, may Allah have mercy on him, said: \"Some who wrote on the rulings of the Quran mentioned that the verse indicates that permissibility covers what we have taught of hunting animals (Jawarih), which includes the dog and all birds of prey. This necessitates the permissibility of all forms of benefit. This indicates the permissibility of selling the dog and hunting animals, and benefiting from them in all forms of benefit, except what evidence has excluded, which is eating the hunting animals; i.e., earning dogs and predatory birds\" (2).",
    "foot_note": "1. Sharh Mukhtasar al-Tahawi by Al-Jassas (3/ 104). \n2. Tafsir Al-Qurtubi (6/ 66), and the one who mentioned that is Abu Bakr Al-Jassas in his Ahkam (2/ 394).",
    "book_id": "994",
    "new_page_number": 32
  },
  {
    "serial_number": "4626858",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 31,
    "volume_number": 1,
    "text": "The response to this is: The verse contains no evidence for the permissibility of sale, nor does it address it; for the utmost it contains is permission to hunt with these dogs in His saying: {So eat of what they catch for you}. Where is the mention of permissible sale? And the mention of permissible price? (1).\n1. From Abdullah bin Umar, may Allah be pleased with them both, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever keeps a dog, except a livestock dog or a trained hunting dog, two qirats will be deducted from his deeds every day\" (2).\n2. From Sufyan bin Abi Zuhayr al-Shana'i, may Allah be pleased with him, that he heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"Whoever keeps a dog that does not avail him for crops or livestock, one qirat will be deducted from his deeds every day.\" Al-Sa'ib said: Did you hear this from the Messenger of Allah, may Allah bless him and grant him peace?",
    "foot_note": "1. Al-Buyu' al-Muharramah wa al-Manhi 'anha p. 184. \n2. Agreed upon: Al-Bukhari (5482), Muslim (1574).",
    "book_id": "994",
    "new_page_number": 33
  },
  {
    "serial_number": "4626859",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 32,
    "volume_number": 1,
    "text": "He said: Yes, by the Lord of this Qiblah (1).\n3 - From Abu Huraira, may Allah be pleased with him, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever keeps a dog, one qirat will be deducted from his deeds every day, except a dog for farming or livestock\" (2).\nAspect of Inference: Acquisition (Iqtina') is ownership (Tamalluk); because Qunya is ownership. It is said: 'Abd Qinn', meaning: owned. This wording implies the permissibility of all aspects of acquisition, and buying is one of them. Thus, its permissibility is obligatory by generality (3).\nThe response to this is: If you say: It is permissible for hunting, farming, and livestock, so its sale is permissible because there are benefits in it; then the meaning of that is you are adding to the exception of the Lawgiver. And the Lawgiver...",
    "foot_note": "1. Agreed upon: Al-Bukhari (3325), Muslim (1576). \n2. Agreed upon: Al-Bukhari (2322), Muslim (1575). \n3. Sharh Mukhtasar al-Tahawi (3/ 106).",
    "book_id": "994",
    "new_page_number": 34
  },
  {
    "serial_number": "4626860",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 33,
    "volume_number": 1,
    "text": "...only excepted three situations: that you make it for guarding crops or livestock, or hunt with it (1).\n4. From Abu Rafi', may Allah be pleased with him, he said: The Messenger of Allah, may Allah bless him and grant him peace, ordered us to kill dogs. The people said: O Messenger of Allah, what is lawful for us from this nation (species) which you ordered to be killed? So Allah revealed: {They ask you, [O Muhammad], what has been made lawful for them. Say, \"Lawful for you are [all] good foods and [game caught by] what you have trained of hunting animals which you train...} [Surah Al-Ma'idah: 4] (2).",
    "foot_note": "1. Al-Sharh al-Mumti' (8/ 117). \n2. Weak: Narrated by Al-Tabari in \"Al-Tafsir\" (11134), Al-Ruyani in \"Al-Musnad\" (698), Al-Tahawi in \"Sharh Ma'ani al-Athar\" (5726), Al-Tabarani in \"Al-Mu'jam al-Kabir\" (971), and others. It contains Musa bin Ubayd al-Rabadhi: who is weak. And narrated by Al-Hakim (3212), and from him Al-Bayhaqi in \"Al-Sunan Al-Kubra\" (18866), and others. It contains Muhammad bin Ishaq: A mudallis (one who conceals defects in transmission) and he used 'an'ana (said 'from'). It has a witness from Adi bin Hatim: at Al-Tabarani in \"Al-Mu'jam al-Kabir\" (158), and it contains Umar bin Bashir who is weak.",
    "book_id": "994",
    "new_page_number": 35
  },
  {
    "serial_number": "4626861",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 34,
    "volume_number": 1,
    "text": "Aspect of Inference: The wording of the hadith implied that permissibility covered what we taught of hunting animals, which includes the dog and all birds of prey. This necessitates the permissibility of all forms of benefitting from them. Thus it indicates the permissibility of selling the dog and hunting animals, and benefitting from them; by all forms of benefit except what evidence excluded, which is eating (1).\nThe response to this is: The hadith is weak (2).\n5. From Jabir bin Abdullah, may Allah be pleased with him, he said: \"The Messenger of Allah, may Allah bless him and grant him peace, forbade...",
    "foot_note": "1. Ahkam al-Quran by Al-Jassas, Ilmiyya Ed. (2/ 394). \n2. Al-Majmu' Sharh al-Muhadhdhab (9/ 229).",
    "book_id": "994",
    "new_page_number": 36
  },
  {
    "serial_number": "4626862",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 35,
    "volume_number": 1,
    "text": "...the price of a dog, except the trained dog\" (1).",
    "foot_note": "1. Weak Hadith: Its pivot is on Hammad bin Salama, from Abu al-Zubayr, from Jabir. There is disagreement regarding Hammad on whether it is Marfu' (attributed to Prophet) or Mawquf (stopped at companion). Al-Nasa'i (4295, 4668) narrated it via Hajjaj bin Muhammad. And Al-Daraqutni (in his Sunan 3068) via Al-Haytham bin Jamil. Both: from Hammad with it as Marfu'. Al-Daraqutni narrated it in (Al-Sunan 3067) via Ubaydullah bin Musa, from Hammad with it but doubted its Marfu' status. Al-Daraqutni narrated it in (Al-Sunan 3069) via Suwayd bin Amr from Hammad with it as Mawquf. Al-Bayhaqi narrated it (in his Sunan Al-Kubra 11012) via Abd al-Wahid bin Ghiyath from Hammad with it as Mawquf. Ibn Abi Shaybah narrated it as Mawquf (in his Musannaf 20910) with another wording, saying: Waki' told us, from Hammad bin Salama, =",
    "book_id": "994",
    "new_page_number": 37
  },
  {
    "serial_number": "4626863",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 36,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = From Abu al-Zubayr, from Jabir, and from Abu al-Muhazzim, from Abu Huraira: «That they both disliked the price of a dog except a hunting dog». We say: Hammad bin Salama is not strong in his narration from Abu al-Zubayr, as Ibn Rajab said, and there is disagreement about him regarding raising it (to the Prophet) or stopping it (at the Companion). This indicates his confusion and lack of precision, especially since the hadith is famous without the phrase: «except a hunting dog». This is how Muslim narrated it in (Al-Sahih 1569) via Ma'qal from Abu al-Zubayr with it. That is why Al-Nasa'i said after Hammad's narration: \"This is Munkar (rejected/odd)\", and said: \"The hadith of Hajjaj from Hammad bin Salama is not correct\". Al-Bayhaqi said after Hammad's narration: \"The authentic hadiths from the Prophet, may Allah bless him and grant him peace, regarding the prohibition of the price of a dog are devoid of this exception. The exception is only in the authentic hadiths regarding the prohibition of keeping (acquisition), and perhaps it was confused by those who mentioned...",
    "book_id": "994",
    "new_page_number": 38
  },
  {
    "serial_number": "4626864",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 37,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = ...it in the hadith prohibiting its price from these narrators who are below the Companions and Successors, and Allah knows best\". Al-Daraqutni corrected the Mawquf path, saying after Suwayd bin Amr's narration: Hammad did not mention 'from the Prophet, may Allah bless him and grant him peace', this is more correct than the one before it. Ibn Rajab said in Jami' al-Ulum wa al-Hikam (2/ 452) after mentioning the hadith: \"Al-Nasa'i extracted it and said: 'It is a Munkar hadith', and also said: 'It is not correct', and Al-Daraqutni mentioned that the correct is stopping it at Jabir. Ahmad said: 'No license for hunting dogs has been authentically reported from the Prophet, may Allah bless him and grant him peace.' Al-Bayhaqi and others pointed out that 'this exception was confused by some narrators, thinking it was regarding sale, while it is regarding acquisition'. Hammad bin Salama in his narrations from Abu al-Zubayr is not strong. Whoever says: 'This hadith is on the condition of Muslim' - as a group of late scholars thought - has erred, because Muslim did not extract anything for Hammad bin Salama from Abu al-Zubayr. He clarified in the book 'Al-Tamyiz' that his narrations from many of his sheikhs or most of them are not strong\". We say: Al-Hasan bin Abi Ja'far followed Hammad at (Ahmad 14411), but he is weak.",
    "book_id": "994",
    "new_page_number": 39
  },
  {
    "serial_number": "4626865",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 38,
    "volume_number": 1,
    "text": "6. From Abu Huraira, may Allah be pleased with him, from the Prophet, may Allah bless him and grant him peace, he said: «Three are all Suht (illicit): the earning of a cupper, the dowry of a prostitute, and the price of a dog except the hunting dog (Al-Dāri)» (1).\nAspect of Inference: The permissibility of the price of the trained dog indicates the permissibility of selling dogs from which benefit is derived from...",
    "foot_note": "1. Weak Hadith: Narrated by Al-Daraqutni in \"Al-Sunan\" (3064, 3066). It contains Ubayd bin Muhammad bin Ibrahim al-San'ani, Muhammad bin Umar bin Abi Muslim, Muhammad bin Mus'ab al-Qarqasani, and Al-Walid bin Ubaydullah bin Abi Rabah, and they are weak. Al-Daraqutni weakened it due to Al-Walid bin Ubayd. Ibn al-Jawzi mentioned in \"Al-Tahqiq\" (2/ 191) the hadiths of selling the trained dog and weakened them.",
    "book_id": "994",
    "new_page_number": 40
  },
  {
    "serial_number": "4626866",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 39,
    "volume_number": 1,
    "text": "...two aspects:\nOne: If it is permissible to sell the trained dog, it is permissible to sell other dogs.\nTwo: He mentioned the trained dog because of the benefit in it, so anything from which benefit can be derived is like it (1).\n\nThe response to this is:\n1. The two hadiths are weak (2).\n2. The dog's sale is prevented due to the prohibition of the Prophet, may Allah bless him and grant him peace, of the price of a dog (3).",
    "foot_note": "1. Sharh Mukhtasar al-Tahawi (3/ 107). \n2. Al-Majmu' Sharh al-Muhadhdhab (9/ 229). \n3. Al-Sharh al-Mumti' (8/ 117).",
    "book_id": "994",
    "new_page_number": 41
  },
  {
    "serial_number": "4626867",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 40,
    "volume_number": 1,
    "text": "They said: As for what was narrated from the Prophet, may Allah bless him and grant him peace, of reports forbidding the price of a dog, and that the price of a dog is Haram, our report judges over them; because the prohibition exists in it with the exception of the trained dog. And because the prohibition was during the time of the command to kill them, and the permission to keep them is inevitably later than it (1).\n\nThe response to this is:\n1. The hadiths permitting the trained dog are defective and not authentic (2).\n2. There is no evidence of abrogation as previously mentioned (3).",
    "foot_note": "1. Sharh Mukhtasar al-Tahawi (3/ 107). See if you wish: Sharh Ma'ani al-Athar (4/ 53). \n2. Al-Majmu' Sharh al-Muhadhdhab (9/ 229). \n3. pp. (8, 9).",
    "book_id": "994",
    "new_page_number": 42
  },
  {
    "serial_number": "4626868",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 41,
    "volume_number": 1,
    "text": "Among those who held this opinion from the Companions and Successors:\n1. From Jabir and Abu Huraira, may Allah be pleased with him: «That they both disliked the price of a dog except a hunting dog» (1).\n2. From Ibrahim al-Nakha'i, he said: «There is no harm in the price of a hunting dog» (2).",
    "foot_note": "1. Weak: Narrated by Ibn Abi Shaybah in (his Musannaf 20910) via Hammad bin Salama, from Abu al-Zubayr, from Jabir, and from Abu al-Muhazzim, from Abu Huraira. Abu al-Muhazzim al-Tamimi al-Basri is Matruk (abandoned). Hammad bin Salama in his narrations from Abu al-Zubayr is not strong. Abu al-Zubayr is a mudallis and used 'an'ana. \n2. Weak: Narrated by Ibn Abi Shaybah in (his Musannaf 20917) via Sa'id bin Abd al-Rahman bin Abdullah al-Zubaydi from Ibrahim. Sa'id was not authenticated by a reliable critic. And narrated by Ibn Abi Shaybah (20922), and Al-Tahawi (5732), via Muhammad bin Fudayl - Al-Tahawi paired him with Sharik - both: from Mughira from Ibrahim with it. It is weak; due to the 'an'ana of Mughira bin Miqsam, who is a mudallis especially from Ibrahim.",
    "book_id": "994",
    "new_page_number": 43
  },
  {
    "serial_number": "4626869",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 42,
    "volume_number": 1,
    "text": "3. From Ata bin Abi Rabah, he said: «There is no harm in the price of the Saluki dog» (1).\n\nThey used as evidence Athar (reports) stating that whoever kills a dog is fined its price:\n1. From Abdullah bin Amr, may Allah be pleased with them both: «He judged in the case of a hunting dog killed by a man, forty dirhams, and judged in the case of a livestock dog a ram» (2).",
    "foot_note": "1. Weak: Narrated by Ibn Abi Shaybah (20918) via Jabir al-Ju'fi, who is Matruk (abandoned) and accused of being a Rafidi. \n2. Weak: Narrated by Abd al-Razzaq \"Musannaf\" (18414), Al-Tahawi \"Sharh Ma'ani al-Athar\" (5727), Al-Bayhaqi \"Al-Sunan Al-Kubra\" (11014) via Ibn Jurayj, =",
    "book_id": "994",
    "new_page_number": 44
  },
  {
    "serial_number": "4626870",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 43,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = from Amr bin Shu'ayb, from his father, from his grandfather Abdullah bin Amr. This is weak; due to the 'an'ana of Ibn Jurayj, who is a famous mudallis; indeed, Al-Daraqutni said: He only conceals defects in what he heard from a wounded (unreliable) narrator. There is disagreement about Ibn Jurayj's hearing from Amr bin Shu'ayb; Al-Bukhari denied it, but Ibn Jurayj declared hearing from Amr in more than one narration, see for example: Musannaf Abd al-Razzaq (\"2333\", \"10215\", \"11462\"); that is why Ali bin al-Madini said about Amr bin Shu'ayb: \"Whatever Ayyub and Ibn Jurayj narrated from him, that is all authentic\" (Su'alat Ibn Abi Shaybah li-Ibn al-Madini 116). Abd al-Razzaq (18413) narrated it from Ibn Jurayj, he said: Al-Harith informed me that a man from Hudhayl informed him that he heard Abdullah bin Amr bin al-As. This is weak; due to the anonymity of the man from Hudhayl. Abd al-Razzaq (18415), Ibn Abi Shaybah (20921), and Al-Daraqutni (4598) narrated it via Ismail bin Justas, he said: I was with Abdullah bin Amr, so a man asked him: What is the blood money of a hunting dog? He said: «Forty dirhams». He said: What is the blood money of a sheep dog? He said: «A sheep from the flock». He said: What is the blood money of a crop dog? He said: «A Faraq (measure) of grain». He said: What is the blood money of a house dog? He said: «A Faraq of dust; a duty on the killer to pay it, and a duty on its owner to accept it, and it decreases the reward». Ismail is weak, and Al-Bukhari said in (Al-Tarikh Al-Kabir): \"And this is a hadith he was not followed on\" End.",
    "book_id": "994",
    "new_page_number": 45
  },
  {
    "serial_number": "4626871",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 44,
    "volume_number": 1,
    "text": "2. From Imran bin Abi Anas, he said: «That Uthman fined a man the price of a dog he killed twenty camels» (1).",
    "foot_note": "1. Weak: Narrated by Al-Bayhaqi in \"Al-Sunan wa al-Athar\" (11539) from Al-Shafi'i, from some of those who debated him, he said: Some of our companions informed me, from Muhammad bin Ishaq, from Imran bin Abi Anas, «That Uthman fined a man the price of a dog he killed twenty camels». Al-Shafi'i said: I said to him: Don't you see if this hadith from Uthman were established, you would have accomplished nothing in arguing against something established from the Messenger of Allah, may Allah bless him and grant him peace, and what is established from Uthman is the contrary? He said: So he mentioned it. I said: A trustworthy person informed us, from Yunus, from Al-Hasan, he said: «I heard Uthman bin Affan preaching, and he was ordering the killing of dogs». Al-Shafi'i said: So how can he order the killing of what he fines the value for its killer?. Al-Bayhaqi said: This which is narrated from Uthman regarding fining the price of a dog is interrupted (Munqati'). It was narrated from another perspective from Yahya bin Sa'id al-Ansari, that he mentioned it from Uthman in a story he mentioned which is interrupted.",
    "book_id": "994",
    "new_page_number": 46
  },
  {
    "serial_number": "4626872",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 45,
    "volume_number": 1,
    "text": "3. From Ibn Shihab al-Zuhri, that he said: «If a trained dog is killed, its value is evaluated and the one who killed it pays it» (1).",
    "foot_note": "1. Weak: Narrated by Al-Tahawi in \"Ma'ani al-Athar\" (5730). Its chain includes Abdullah bin Salih, the scribe of Al-Layth, who is weak.",
    "book_id": "994",
    "new_page_number": 47
  },
  {
    "serial_number": "4626873",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 46,
    "volume_number": 1,
    "text": "4. In the chapter from Ata bin Abi Rabah, he said: «If you kill a dog that is not biting (aggressive), then pay its price to its family» (1).\n\nThe response to this is: The Athar are weak except the Athar of Ata bin Abi Rabah.\n\nThey reasoned by Analogy (Qiyas): They said: \"Since the dog is something permissible to benefit from, without it having a right to prevent sale, it resembled the domestic donkey, the cat, and all other things permissible to benefit from without a right for the sold object to prevent the sale. Thus, it must be permissible. This is not contradicted by the Umm al-Walad (slave mother) and the Mudabbar (slave promised freedom upon death); because they have a right...",
    "foot_note": "1. Authentic: Narrated by Ibn Abi Shaybah (in his Musannaf 20919).",
    "book_id": "994",
    "new_page_number": 48
  },
  {
    "serial_number": "4626874",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 47,
    "volume_number": 1,
    "text": "...to prevent sale; to fulfill the emancipation they deserved upon death, if permitting sale would invalidate it.\nAlso: We all agreed that the dog is inherited from its owner, and it is permissible to bequeath it. Thus, its sale must be permissible; because it is something in which the transfer of ownership is valid through inheritance and bequest, like all other inherited things.\nIf it is said: Inheritance and bequest are not a basis for the permissibility of sale; because they are valid for unknown things (Majahil), and the sale of the unknown is not valid.\nIt is said to him: Their difference in this aspect does not prevent combining them in the aspect we mentioned regarding the permissibility of sale. Do you not see that everything whose sale was invalid due to its ignorance, when the ignorance is removed, the sale becomes permissible? There is no ignorance here preventing the sale of a dog, so in this aspect, it is like...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 49
  },
  {
    "serial_number": "4626875",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 48,
    "volume_number": 1,
    "text": "...the inherited and bequeathed item\" (1).\n\nThe response to this is:\n1. The donkey, cheetah, and similar animals are pure, unlike the dog, for it is impure (2).\n2. It is incorrect to analogize predatory animals suitable for hunting to the dog; because they enter under the generality of the Almighty's saying: {And Allah has permitted trade} [Al-Baqarah: 275]; and because they are less harmful than the dog. For if a dog licks a vessel, it must be washed seven times, one of them with dust, whereas other predatory animals do not require washing seven times nor using dust. Thus, the difference appeared, and analogy is prevented (3).",
    "foot_note": "1. Sharh Mukhtasar al-Tahawi by Al-Jassas (3/ 108). \n2. Al-Majmu' Sharh al-Muhadhdhab (9/ 229). \n3. Al-Sharh al-Mumti' (8/ 117).",
    "book_id": "994",
    "new_page_number": 50
  },
  {
    "serial_number": "4626876",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 AD",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 49,
    "volume_number": 1,
    "text": "3. Bequest tolerates what others do not tolerate, which is why bequest of the unknown, the nonexistent, and the runaway slave is permissible, and Allah knows best (1).\nThey also said: \"And for us, the dog is wealth (Mal), so it is a subject for sale like the falcon and the hawk. The evidence that it is wealth is that it is benefitted from in reality, and benefitting from it is permitted in Sharia absolutely, so it is wealth. There is no doubt that it is benefitted from in reality. The evidence that benefit from it is permitted in Sharia (2) absolutely is that...",
    "foot_note": "1. Al-Majmu' Sharh al-Muhadhdhab (9/ 229). \n2. The Hanafis do not stipulate purity in wealth, hence they permit the sale of impure manure. They do not stipulate permissible benefit in wealth, so they consider wine as wealth, but they divide wealth into valuable (Mutaqawwam) and non-valuable. The majority, however, stipulate in wealth that it be pure and of permissible benefit. \"Al-Mu'amalat al-Maliyah Asalah wa Mu'asarah\" (3/ 421).",
    "book_id": "994",
    "new_page_number": 51
  },
  {
    "serial_number": "4626877",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 50,
    "volume_number": 1,
    "text": "The benefit from it in terms of guarding and hunting is generally [permissible] in Sharia in all situations, so it became a subject for sale. Because if the sale involves a subject that is truly beneficial and permissible to benefit from absolutely, there is a need to legislate its [sale]. For legislating its [sale] becomes a cause and a means for exclusive ownership that cuts off disputes, since the need is to cut off disputes regarding what is absolutely permissible to benefit from in Sharia, not in what is merely permissible\" (1). \nThe response to this is: A dog is not property (mal) from every aspect. Rather, it is property only in specific, designated things that came by way of concession (rukhsah), so it is not permissible to expand upon them. Because if you say: 'It is permissible for hunting, farming, and livestock, so its sale is permissible because there are benefits in it', then that means you are...",
    "foot_note": "1. Bada'i' al-Sana'i' (5/143).",
    "book_id": "994",
    "new_page_number": 52
  },
  {
    "serial_number": "4626878",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 51,
    "volume_number": 1,
    "text": "...adding to the exception made by the Sharia. The Sharia only excepted three situations: that you keep it for guarding crops, or livestock, or to hunt with it (1).",
    "foot_note": "1. Al-Sharh al-Mumti' (8/117).",
    "book_id": "994",
    "new_page_number": 53
  },
  {
    "serial_number": "4626879",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 52,
    "volume_number": 1,
    "text": "Detailed Opinions of the Scholars\nAl-Tahawi, may Allah have mercy on him, said: \"And the sale of dogs that are benefited from, and falcons, and cheetahs, and cats is permissible\" (1).\nHe also said, after mentioning the evidence of the Hanafis regarding the sale of dogs: \"And this is the opinion of Abu Hanifa, Abu Yusuf, and Muhammad, may Allah have mercy on them all\" (2).\nAbu al-Fadl al-Hanafi, may Allah have mercy on him, said: \"And it is permissible to sell dogs, cheetahs, and predatory animals, whether trained or untrained; because it is an animal that is benefited from for guarding and hunting, so it is permissible. For this reason...",
    "foot_note": "1. Sharh Mukhtasar al-Tahawi by al-Jassas (3/104).\n2. Sharh Ma'ani al-Athar (4/53).",
    "book_id": "994",
    "new_page_number": 54
  },
  {
    "serial_number": "4626880",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 53,
    "volume_number": 1,
    "text": "...it transfers to the ownership of the legatee and the heir, unlike insects/vermin such as snakes, scorpions, lizards (dabb), hedgehogs, and the like; because they are not benefited from (1). It is narrated from Abu Yusuf: That it is not permissible to sell a biting dog (al-kalb al-'aqur); because keeping it is prohibited and killing it is commanded (2).\" End quote.",
    "foot_note": "1. Al-Ikhtiyar li-Ta'lil al-Mukhtar (2/9).\n2. There are weak hadiths regarding this; among them is what Abdullah bin Wahb narrated in his Muwatta (11), he said: Abdul Rahman bin Salman informed me, from Uqail bin Khalid, from Ibn Shihab, from Abu Bakr, from the Prophet, peace and blessings be upon him, that he said: \"Three things are unlawful earnings (suht): the payment of a soothsayer, the dowry of a prostitute, and the price of a biting dog.\" This chain is weak; because Ibn Shihab did not meet Abu Bakr, and Abdul Rahman has weakness. Ibn Wahb also narrated under number (12), he said: Shamir bin Numair told us, from Ibn Damira, who is Husayn bin Abdullah, from his father, from his grandfather, from Ali bin Abi Talib, \"that the Prophet, peace and blessings be upon him, forbade the price of a biting dog.\" Shamir and Ibn Damira are abandoned (matruk). Abu Yusuf used evidence for the prohibition of selling a biting dog, including:\n1. That the Messenger of Allah - peace and blessings be upon him - forbade keeping it and ordered killing it. Among that is: the hadith of Abdullah bin Umar - may Allah be pleased with them both - who said: Hafsa - may Allah be pleased with her - said: The Messenger of Allah - peace and blessings be upon him - said: \"Five animals, there is no sin on whoever kills them: the crow, the kite, the mouse, the scorpion, and the biting dog.\"\n2. That it is not benefited from. See: \"Al-Inaya Sharh al-Hidaya\" (7/118), and the research (Ruling on Selling Police Dogs) on the \"University of Faith\" website.",
    "book_id": "994",
    "new_page_number": 55
  },
  {
    "serial_number": "4626881",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 54,
    "volume_number": 1,
    "text": "Al-Nawawi, may Allah have mercy on him, said: \"Abu Hanifa said: The sale of all dogs that have benefit is valid, and value is due upon the one who destroys it... And Malik said: The sale of a dog is not permissible, but value is due upon the one who destroys it, even if it is a hunting or livestock dog.",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 56
  },
  {
    "serial_number": "4626882",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 55,
    "volume_number": 1,
    "text": "And there is a narration from him like our school (Shafi'i), and a narration like the school of Abu Hanifa\" (1).\nIbn al-Arabi al-Maliki, may Allah have mercy on him, said: \"Our companions differed regarding its sale: is it prohibited or disliked (makruh)? Malik explicitly stated prohibition in [several] places, but the correct view based on evidence is the permissibility of sale, and this is what Abu Hanifa said\" (2).\nAl-Kasani, may Allah have mercy on him, said: \"It is permissible to sell every bird with talons, whether trained or untrained, without disagreement. As for the sale of every predatory animal with fangs, except the pig, such as the dog, cheetah, lion, leopard, wolf, cat, and the like, it is permissible according to our companions\" (3).\nIbn Hajar, may Allah have mercy on him, said: \"Al-Qurtubi said: The well-known...",
    "foot_note": "1. Al-Majmu' Sharh al-Muhadhdhab (9/228).\n2. 'Aridat al-Ahwadhi (5/42).\n3. Bada'i' al-Sana'i' (5/142).",
    "book_id": "994",
    "new_page_number": 57
  },
  {
    "serial_number": "4626883",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 56,
    "volume_number": 1,
    "text": "...opinion of the school of Malik is the permissibility of keeping a dog and the dislike (karahah) of selling it, but [the sale] is not annulled if it occurs. It is as if, since it is not impure (najis) according to him and permission was given to keep it for its permissible benefits, its ruling was the ruling of all commodities. However, the Sharia forbade its sale as a matter of propriety (tanzihan); because it is not from noble character. He said: As for equating it in prohibition with the dowry of a prostitute and the payment of a soothsayer, this is interpreted to refer to the dog that is not permitted to be kept. And assuming generality for every dog, the prohibition in these three regarding the common element of dislike is more general than tanzih (dislike of propriety) and tahrim (absolute prohibition); since each one of them is forbidden. Then the specific nature of each one of them is taken from another evidence. For we knew the prohibition of the prostitute's dowry and the soothsayer's payment from consensus, not from the mere prohibition [in this hadith]. And it does not follow from sharing in conjunction (being listed together) that they share in all aspects;",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 58
  },
  {
    "serial_number": "4626884",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 57,
    "volume_number": 1,
    "text": "since a command may be conjoined with a prohibition, and an obligation with a negation of judgment\" (1).",
    "foot_note": "1. Fath al-Bari by Ibn Hajar (4/427).",
    "book_id": "994",
    "new_page_number": 59
  },
  {
    "serial_number": "4626885",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 58,
    "volume_number": 1,
    "text": "The Third Opinion: It is permissible to buy hunting dogs, but he should not sell them.\nThis is the opinion of Ibn al-Qasim, may Allah have mercy on him. He said: \"There is no harm in buying dogs, hunting dogs, but I do not like selling them\" (1).\nEvidence for this was drawn from analogy (qiyas):\nIbn Rushd the Grandfather, may Allah have mercy on him, said: \"Ibn al-Qasim's permission in this narration to buy a dog but not sell it is similar to the opinion of Ashhab in Al-Mudawwana regarding manure: the buyer is more excused in buying it than the seller; because need may compel him to buy...",
    "foot_note": "1. Al-Bayan wa al-Tahsil by Ibn Rushd the Grandfather (8/82).",
    "book_id": "994",
    "new_page_number": 60
  },
  {
    "serial_number": "4626886",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 59,
    "volume_number": 1,
    "text": "...a dog for hunting, and similar things which he is permitted to keep. Likewise manure, if he does not find someone to give it to him without a price. But there is no need for anyone to sell that; because if he does not need it, he leaves it for someone who needs it\" (1).\nIbn al-Qasim's opinion is close to the opinion of Ibn Hazm, and Allah knows best.",
    "foot_note": "1. Al-Bayan wa al-Tahsil (8/83).",
    "book_id": "994",
    "new_page_number": 61
  },
  {
    "serial_number": "4626887",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 60,
    "volume_number": 1,
    "text": "The Fourth Opinion: It is permissible to buy and sell dogs that are permitted to be kept.\nThis is the opinion of: most Malikis, and Ibn Rushd the Grandfather authenticated it, and it is a narration from Malik (1).\nThey used as evidence: the hadith of Sufyan bin Abi Zuhair Al-Shana'i, may Allah be pleased with him, that he heard the Messenger of Allah, peace and blessings be upon him, say: \"Whoever keeps a dog that does not avail him for crops or livestock, a qirat (a large amount) will be deducted from his deeds every day.\" Al-Sa'ib said: \"Did you hear this from the Messenger of Allah, peace and blessings be upon him?\"...",
    "foot_note": "1. Their opinions will be mentioned in detail after mentioning the evidence.",
    "book_id": "994",
    "new_page_number": 62
  },
  {
    "serial_number": "4626888",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 61,
    "volume_number": 1,
    "text": "...He said: \"Yes, by the Lord of this Qibla\" (1).\nPoint of Evidence: Acquisition (iqtina') cannot happen except by purchasing (ishtira') (2).\nThey used analogy as evidence: They said: Because if it is permissible to benefit from a dog permitted to be kept, it must be permissible to sell it, even if eating it is not lawful, like the domestic donkey which is not lawful to eat, but it is permissible to sell it because it is permissible to benefit from it (3).\nThey said: The prohibition of the Prophet, peace and blessings be upon him, regarding the price of a dog is specific to the dog that is not permitted to be kept (4).\nThey said: And the reason for permitting the sale of what is permitted to be kept of...",
    "foot_note": "1. Agreed upon: Al-Bukhari (3325), Muslim (1576).\n2. Al-Bayan wa al-Tahsil (8/83).\n3. Al-Bayan wa al-Tahsil (8/83).\n4. Al-Bayan wa al-Tahsil (16/237).",
    "book_id": "994",
    "new_page_number": 63
  },
  {
    "serial_number": "4626889",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 62,
    "volume_number": 1,
    "text": "...dogs; because the hadith that mentioned the prohibition of the price of a dog mentioned with it the payment of a soothsayer and the dowry of a prostitute, and none of this is permissible. (So this indicated) that it refers to the dog that is not permissible to be kept, and Allah knows best; because among dogs there are those permitted to be kept and benefited from, so selling those is permissible (1).\nThey said: It has been said regarding the meaning of what Ibn Umar narrated from the Prophet, peace and blessings be upon him, \"of his prohibition regarding the price of a dog, even if it is trained (darian)\" (2), that the meaning of that was when the ruling on dogs was that they should all be killed, and it was not lawful for anyone to keep any of them, according to what was narrated from Abu Rafi', who said:",
    "foot_note": "1. Al-Istidhkar (6/429).\n2. Weak: Narrated by Al-Tahawi in \"Sharh Ma'ani al-Athar\" (5686), and in its chain is Ibn Lahi'ah who is weak.",
    "book_id": "994",
    "new_page_number": 64
  },
  {
    "serial_number": "4626890",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 63,
    "volume_number": 1,
    "text": "\"The Prophet, peace and blessings be upon him, ordered me to kill dogs. So I went out to kill them. I did not see a dog except I killed it, until I came to a place, so-and-so - and he named it - and there was a dog running around and panting. So I went to kill it, but a person called out to me from inside the house: 'O servant of Allah, what do you want to do?' I said: 'I want to kill this dog.' She said: 'I am a woman in a neglected house, and this dog chases away predatory animals from me and alerts me to comers. So go to the Prophet, peace and blessings be upon him, and mention that to him.' So I came to the Prophet, peace and blessings be upon him, and mentioned that to him, so he ordered me to kill it\" (1). Then it came from him, peace and blessings be upon him: That he ordered the killing of dogs, except a hunting dog or a livestock dog (2). And that he said: \"Whoever...",
    "foot_note": "1. Narrated by Ahmad (27188) from the path of Salim bin Abdullah, from Abu Rafi'. Al-Bukhari said: \"I do not know if Salim from Abu Rafi' is authentic or not.\"\n2. Previously mentioned.",
    "book_id": "994",
    "new_page_number": 65
  },
  {
    "serial_number": "4626891",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 64,
    "volume_number": 1,
    "text": "...keeps a dog, that is not a hunting dog, nor a livestock dog, nor a land (farming) dog, then two qirats will be deducted from his reward every day\" (1). So he abrogated with that his first command to kill dogs in general (2).\nThey said: As for the dog that is not permissible to be kept, there is no disagreement that selling it is not permissible and its price is not lawful. It was narrated from Ibn Abbas from the Prophet, peace and blessings be upon him, that he said: \"The price of a dog is forbidden (haram)\" (3).\nThey said: Achieving the interests of the servants, and observing what brings benefit to them, requires saying it is permissible to sell a dog; for guarding, farming, livestock, and similar things...",
    "foot_note": "1. Agreed upon: Al-Bukhari (5482), Muslim (1574).\n2. Al-Bayan wa al-Tahsil (8/83).\n3. Al-Bayan wa al-Tahsil (18/613), Bidayat al-Mujtahid (3/146).",
    "book_id": "994",
    "new_page_number": 66
  },
  {
    "serial_number": "4626892",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 65,
    "volume_number": 1,
    "text": "...that are used for the interests of the servants, such as hunting and the like; in order to achieve the interests of the servants that are considered in legal rulings. - And they said it is permissible to sell dogs trained for guarding, and police dogs trained to detect criminals -, especially since the need is intense for this type of dog, and among them are those trained to serve the blind and help them reach their destinations (1).\nThis has all been answered.",
    "foot_note": "1. Prohibited and Forbidden Sales p. (182), PhD thesis, by Abdul Nasser Milad.",
    "book_id": "994",
    "new_page_number": 67
  },
  {
    "serial_number": "4626893",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 66,
    "volume_number": 1,
    "text": "Detailed Opinions of the Scholars\nThe Maliki Opinion: Ibn Rushd, may Allah have mercy on him, said: \"Ibn al-Qasim said: There is no harm in buying dogs; hunting dogs, but I do not like selling them. Sahnun said: Yes, and one may perform Hajj with their price. These are the dogs that are for farming, livestock, and hunting (1). He (Ibn Rushd) said, may Allah have mercy on him: Sahnun's opinion permitting the dog that is allowed to be kept is the opinion of Ibn Nafi', Ibn Kinana, and most scholars, and it is the correct opinion in reasoning\" (2).",
    "foot_note": "1. Al-Bayan wa al-Tahsil (8/82).\n2. Al-Bayan wa al-Tahsil (8/83).",
    "book_id": "994",
    "new_page_number": 68
  },
  {
    "serial_number": "4626894",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 67,
    "volume_number": 1,
    "text": "Ibn Abd al-Barr, may Allah have mercy on him, said: \"The companions of Malik differed, and the narration from him differed regarding the price of the dog that is permitted to be kept. He permitted the price of the trained hunting dog at one time, and forbade it another time\" (1).",
    "foot_note": "1. Al-Istidhkar (6/429).",
    "book_id": "994",
    "new_page_number": 69
  },
  {
    "serial_number": "4626895",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 68,
    "volume_number": 1,
    "text": "The Fifth Opinion: It is permissible to sell a trained dog.\nThis is the opinion of some later Hanbalis. Al-Zarkashi, may Allah have mercy on him, said: Some scholars permitted the sale of the trained one excluding others, and this is what some later scholars of our school lean towards (1).\nTheir evidence:\n1. The narration of Hammad bin Salamah, from Abu al-Zubair, from Jabir bin Abdullah, may Allah be pleased with him, who said: \"The Messenger of Allah, peace and blessings be upon him, forbade the price of a dog and a cat, except a hunting dog\" (2).",
    "foot_note": "1. Sharh al-Zarkashi 'ala Mukhtasar al-Khiraqi (3/671).\n2. Previously mentioned.",
    "book_id": "994",
    "new_page_number": 70
  },
  {
    "serial_number": "4626896",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 69,
    "volume_number": 1,
    "text": "2. From Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, who said: \"Three things are all unlawful earning (suht): the earning of a cupper, the dowry of a prostitute, and the price of a dog, except a trained hunting dog\" (1).\nThis has been answered.\nThe Preponderant Opinion: The impermissibility of selling a dog due to the prohibition of the Prophet, peace and blessings be upon him, regarding its price, and there is no authentic, explicit evidence permitting the price of a dog.",
    "foot_note": "1. Previously mentioned.",
    "book_id": "994",
    "new_page_number": 71
  },
  {
    "serial_number": "4626897",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 70,
    "volume_number": 1,
    "text": "Sub-topics related to the above:\nFirst Topic: Does one who kills a dog owe its price?\nThe scholars differed on two opinions:\nFirst Opinion: He does not owe its price. This is the opinion of the majority, except Malik, for there are differing narrations from him.\nSecond Opinion: He owes its price. This is the opinion of the Hanafis, and a narration from Malik.\nAl-Nawawi, may Allah have mercy on him, said: \"No value is due on the one who destroys it, whether it is trained or not, and whether it is of those permitted to be kept or not. This is what the majority of scholars said, including: Abu Huraira, Al-Hasan Al-Basri, Rabi'a, Al-Awza'i, Al-Hakam, Hammad, Al-Shafi'i, Ahmad, Dawud, Ibn Al-Mundhir...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 72
  },
  {
    "serial_number": "4626898",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 71,
    "volume_number": 1,
    "text": "...and others\" (1).\nIbn Hajar, may Allah have mercy on him, said: \"It follows from that, that no value is due on the one who destroys it. This is what the majority said. Malik said: Its sale is not permissible, but value is due on the one who destroys it. And from him: like the majority. And from him: like the opinion of Abu Hanifa; it is permissible [to sell] and value is due\" (2).\nIbn Abd al-Barr, may Allah have mercy on him, said: \"There is no disagreement from him that whoever kills a hunting, livestock, or farming dog, owes the value. And whoever kills a household dog owes nothing, unless it is allowed to roam with livestock\" (3).\nThere are narrations on this topic, and they have passed (4).",
    "foot_note": "1. Sharh Muslim (10/232).\n2. Fath al-Bari by Ibn Hajar (4/426).\n3. Al-Istidhkar (6/429).\n4. Pages (22, 23, 24).",
    "book_id": "994",
    "new_page_number": 73
  },
  {
    "serial_number": "4626899",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 72,
    "volume_number": 1,
    "text": "Second Topic: The Ruling on Renting/Leasing a Dog.\nThe scholars differed on two opinions:\nFirst Opinion: Prohibition of renting. This is the opinion of: Malik, Al-Shafi'i, Ahmad, and an opinion of the Hanafis, and the correct view according to the Shafi'is, and the established position of the Hanbalis (1).\nThey reasoned:\n1. That the benefit sought from it is not capable...",
    "foot_note": "1. Their opinions will be mentioned in detail after mentioning the evidence.",
    "book_id": "994",
    "new_page_number": 74
  },
  {
    "serial_number": "4626900",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 73,
    "volume_number": 1,
    "text": "...of being fulfilled/delivered; since the dog cannot be forced to hunt, so the benefit was not capable of being fulfilled for the renter, thus it is not permissible (1).\n2. And because it is an animal whose sale is prohibited due to its impurity/evil, so its leasing is prohibited, like the pig (2).\n3. ... And because its benefit is not guaranteed in usurpation (ghasb); for if a usurper took it for a period, no compensation would be due from him for that, so it is not permissible to take compensation for it in leasing, like the benefit of a pig (3).\n4. That the dog was permitted for need, so it is not permissible to take compensation for it (4).",
    "foot_note": "1. Bada'i' al-Sana'i' fi Tartib al-Shara'i' (4/189).\n2. Al-Mughni by Ibn Qudamah (4/190).\n3. Al-Mughni by Ibn Qudamah (4/190).\n4. Al-Manthur fi al-Qawa'id al-Fiqhiyyah (3/139).",
    "book_id": "994",
    "new_page_number": 75
  },
  {
    "serial_number": "4626901",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 74,
    "volume_number": 1,
    "text": "Their Statements:\nIbn Rushd, may Allah have mercy on him, said: \"Leasing a dog also falls under this chapter, and it is not permissible according to Al-Shafi'i nor according to Malik\" (1).\nIbn Qudamah, may Allah have mercy on him, said: \"Its leasing is not permissible, Ahmad explicitly stated this\" (2).\nAl-Kasani, may Allah have mercy on him, said: \"And leasing a trained dog, and a trained hawk, for hunting; it is not permissible\" (3).\nAl-Nawawi, may Allah have mercy on him, said: \"Leasing a trained dog; for hunting and guarding, is invalid according to the correct view\" (4).",
    "foot_note": "1. Bidayat al-Mujtahid wa Nihayat al-Muqtasid, Dar al-Fikr ed. (2/181).\n2. Al-Mughni by Ibn Qudamah (4/190).\n3. Bada'i' al-Sana'i' fi Tartib al-Shara'i' (4/189).\n4. Rawdat al-Talibin wa Umdat al-Muftin (5/178).",
    "book_id": "994",
    "new_page_number": 76
  },
  {
    "serial_number": "4626902",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 75,
    "volume_number": 1,
    "text": "Al-Mardawi, may Allah have mercy on him, said: \"It is not permissible to lease a dog absolutely, according to the correct view of the school (Hanbali), and this is what the companions hold, and most of them stated it definitively\" (1).\nSecond Opinion: Permissibility of leasing:\nThis is an opinion of: the Hanafis, some Malikis, an opinion of the Shafi'is, an opinion of the Hanbalis which is not well-known, and Ibn Hazm (2).\nThey reasoned:\n* That the benefit of a dog is a permissible benefit, so its leasing is permissible, like other permissible benefits (3).\n* And that the contract of leasing differs from selling:",
    "foot_note": "1. Al-Insaf fi Ma'rifat al-Rajih min al-Khilaf (6/25).\n2. Their opinions will be mentioned in detail after mentioning the evidence.\n3. Nihayat al-Matlab fi Dirayat al-Madhhab (5/491).",
    "book_id": "994",
    "new_page_number": 77
  },
  {
    "serial_number": "4626903",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 76,
    "volume_number": 1,
    "text": "For in selling, the contract is upon the object itself, and selling its object is prohibited. Whereas in the contract of leasing, the contract is upon the benefit, and it is permissible (1).\n* Ibn Hazm argued for permissibility using the Zahiri method, which is that selling is different from leasing, and selling the dog was forbidden, but leasing it was not forbidden. And the analogy of leasing to selling is a false analogy, even if analogy were valid, so how about when it is entirely false!! Because they agree on the leasing of a free person himself, while forbidding his sale (2).",
    "foot_note": "1. Asna al-Matalib (2/417).\n2. Al-Muhalla bi al-Athar (7/14), Al-Buyu' al-Maliyyah Asalah wa Mu'asarah (9/100).",
    "book_id": "994",
    "new_page_number": 78
  },
  {
    "serial_number": "4626904",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 77,
    "volume_number": 1,
    "text": "Their Statements:\nIbn Abidin Al-Hanafi, may Allah have mercy on him, said: \"His saying (and regarding the dog); meaning a hunting or guarding dog... (his saying two opinions) meaning: two narrations mentioned by Qadi Khan: The first: The wage is not obligatory, and the second: If he specified a known time, it is obligatory, otherwise not\" (1).\nAbu Al-Hasan Al-Adawi Al-Maliki, may Allah have mercy on him, said: \"It is permissible to lease a sacrificial animal during its life, and its skin after its slaughter, just as it is permissible to lease a hunting dog\" (2).\nAl-Nawawi, may Allah have mercy on him, said: \"Leasing a trained dog;",
    "foot_note": "1. Al-Durr al-Mukhtar (6/96), for more see non-commanded: Al-Fatawa al-Hindiyyah (4/454).\n2. Hashiyat al-Adawi (1/573).",
    "book_id": "994",
    "new_page_number": 79
  },
  {
    "serial_number": "4626905",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 78,
    "volume_number": 1,
    "text": "for hunting and guarding, is invalid according to the correct view. And it was said: It is permissible like the cheetah, hawk, and net; for hunting, and the cat; for repelling mice\" (1).\nAl-Mardawi, may Allah have mercy on him, said: \"And it was said: It is permissible to lease a dog that is permitted to be kept\" (2).\nIbn Hazm, may Allah have mercy on him, said: \"It is permissible to lease everything that is lawful to own, even if it is not lawful to sell, like the dog\" (3).\nThe Preponderant Opinion: Impermissibility, due to the prohibition of the Prophet, peace and blessings be upon him, regarding the price of a dog.",
    "foot_note": "1. Rawdat al-Talibin (5/178), for more see non-commanded: Sharh Umdat al-Ahkam by Ibn al-Mulaqqin (7/114).\n2. Al-Insaf (6/25).\n3. Al-Muhalla bi al-Athar (7/14).",
    "book_id": "994",
    "new_page_number": 80
  },
  {
    "serial_number": "4626906",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 79,
    "volume_number": 1,
    "text": "Third Topic: Taking wages for training a dog without selling it:\nIn the Fatwa Center of Islamweb - The Islamic Network - the following text appeared (1):\n\"Praise be to Allah and peace and blessings be upon the Messenger of Allah, and his family and companions. To proceed:\nThe ruling on working in training dogs called: police dogs, and likewise working in using them to detect drugs and similar crimes, is based on the preponderant opinion among the scholars regarding the ruling on keeping...",
    "foot_note": "1. Fatwa number (121735) State of Qatar.",
    "book_id": "994",
    "new_page_number": 81
  },
  {
    "serial_number": "4626907",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 80,
    "volume_number": 1,
    "text": "...a dog for other than what was mentioned in the hadith. What we see as correct is: that it is permissible to keep them for interest and benefit that is not less than what was mentioned in the hadith.\nSheikh al-Islam Ibn Taymiyyah said: Keeping a dog is not permitted except for necessity, to bring a benefit, such as hunting, or repelling harm from livestock and crops... End quote.\nThe interest of teaching dogs to detect crimes, and keeping them for that purpose, exceeds the interest of protecting livestock and using a dog in farming. It has been proven that this type of trained dogs has a high ability to smell drugs and discover their locations, and this is a great interest involving protection of society from the harm of corrupters.\nIt came in the Fatwas of the Permanent Committee: When asked about working in the Customs Department with...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 82
  },
  {
    "serial_number": "4626908",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 81,
    "volume_number": 1,
    "text": "...police dogs: There is no harm in working in that, with the obligation to guard against their impurity, and washing what touches clothes and body from them; of saliva, urine, or otherwise. Likewise washing utensils from which they lick seven times; the first with dirt, or what takes its place. And success is with Allah. End quote, and Allah knows best.\" End of quote.\nI sent a question to the Egyptian Dar al-Ifta website, and this is its text (1): If there is a man who adopts the opinion of the majority regarding the prohibition of selling a dog, what is the ruling on taking money for training the dog according to the majority's opinion, training itself is not selling?",
    "foot_note": "1. Fatwa serial number (997466).",
    "book_id": "994",
    "new_page_number": 83
  },
  {
    "serial_number": "4626909",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 82,
    "volume_number": 1,
    "text": "This is the text of their answer: \"There is no harm in taking a wage for training a dog, if its training is for a legitimate benefit, such as guarding, or hunting, and similar aspects of benefit which the Lawgiver did not forbid. The jurists have agreed: that it is not permissible to keep a dog except for a need, such as hunting, guarding, for livestock, or for crops, and helping the blind, and other aspects of benefit which the Lawgiver did not forbid. It is permissible to raise a small dog which is expected to be taught hunting; to be kept for these mentioned benefits. It should not be kept for other than the mentioned benefits, and Allah knows best.\"",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 84
  },
  {
    "serial_number": "4626910",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 83,
    "volume_number": 1,
    "text": "I sent the same question to the Islam Question and Answer website, and this is its text (1): If there is a man who adopts the opinion of the majority regarding the prohibition of selling a dog, what is the ruling on taking money for training the dog according to the majority's opinion, training itself is not selling?\nThis is the text of their answer: Praise be to Allah. Training dogs, if it is for using them in matters for which the Sharia permitted keeping dogs, is not wrong. But for other than that, it is not permissible. Based on this: It is permissible to work in training dogs for...",
    "foot_note": "1. Supervised by Sheikh Salih Al-Munajjid, and this is the Fatwa number: (282068).",
    "book_id": "994",
    "new_page_number": 85
  },
  {
    "serial_number": "4626911",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 84,
    "volume_number": 1,
    "text": "...detecting criminals, or drugs, or training for hunting, and herding livestock. It may also include guarding facilities. As for training for other than these necessities, it is not permissible.\nI asked Sheikh Adel Al-Azzazi - may Allah preserve him - (1): \"He gave a fatwa of permissibility, and said: Likewise, whoever treats a dog, may take the price (fee).\"",
    "foot_note": "1. Author of the book (Tamam al-Minnah fi Fiqh al-Kitab wa al-Sunnah).",
    "book_id": "994",
    "new_page_number": 86
  },
  {
    "serial_number": "4626912",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 85,
    "volume_number": 1,
    "text": "Fourth Topic: Permissibility of taking the price (fee) for treating dogs.\nThe fee for treating dogs is from the kindness (ihsan) brought by the Sharia (1):\nQuestion: A veterinarian wants to open a small clinic for animals. When he charges the dog owner for the cost of medicine and service, is this money halal or haram?\nAnswer: \"Praise be to Allah. Kindness to animals is among the beauties of character that Islam brought, and regarding which...",
    "foot_note": "1. Islam Question and Answer Fatwa No. (199221).",
    "book_id": "994",
    "new_page_number": 87
  },
  {
    "serial_number": "4626913",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 86,
    "volume_number": 1,
    "text": "...noble Prophetic hadiths are recurrent (mutawatir). Among that: What is authentic from Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"While a man was on a road, his thirst became intense. He found a well, descended into it, drank, then came out. Behold, a dog panting; eating damp earth out of thirst. The man said: 'Thirst has reached this dog just as it reached me.' So he descended into the well, filled his shoe with water, then gave the dog to drink. So Allah thanked him and forgave him.\" They said: \"O Messenger of Allah, is there a reward for us in animals?\" He said: \"In every wet liver (living thing) there is a reward\" (1).\nIbn Battal, may Allah have mercy on him, says: \"In these hadiths is incitement to practice mercy towards all animals and gentleness with them, and that this is among what Allah forgives sins by, and expiates...",
    "foot_note": "1. Agreed upon: Al-Bukhari (2466), Muslim (2244).",
    "book_id": "994",
    "new_page_number": 88
  },
  {
    "serial_number": "4626914",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 87,
    "volume_number": 1,
    "text": "...errors. So every rational believer should desire to take his share of mercy, and use it towards the sons of his kind, and towards every animal. For Allah did not create it in vain. And everyone is responsible for what he was entrusted with and possessed of human or animal that cannot speak and clarify the harm in it. Likewise, one should have mercy on every animal, even if it is not in his possession. Do you not see that the one who watered the dog he found in the desert did not own it, yet Allah forgave him for taking the trouble to descend into the well and bringing water out in his shoe and giving it to drink. Likewise everything that has the meaning of watering, such as feeding. Do you not see his saying, peace be upon him: 'There is no Muslim who plants a tree, and a human or animal eats from it, except that it is charity for him'. Included in the meaning of watering animals and feeding them is lightening their loads, and burdening them with what they can bear. So that is from...",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 89
  },
  {
    "serial_number": "4626915",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 88,
    "volume_number": 1,
    "text": "...mercy towards them and kindness to them. And from that is abandoning transgression in beating them and harming them, and employing them at night and in other than times of employment\" (1).\nImam Al-Nawawi, may Allah have mercy on him, says: \"'In every wet liver there is a reward' means: In doing good to every living animal by watering it and the like, there is a reward. In this hadith: Encouragement to do good to the respected (protected) animal, which is what is not ordered to be killed. As for what is ordered to be killed, the command of the Sharia to kill it is obeyed. What is ordered to be killed: The biting dog, and the five pests mentioned in the hadith, and what is in their meaning. As for the respected one, reward is obtained by watering it, and doing good to it also...",
    "foot_note": "1. Sharh Sahih Al-Bukhari (9/219).",
    "book_id": "994",
    "new_page_number": 90
  },
  {
    "serial_number": "4626916",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 89,
    "volume_number": 1,
    "text": "...by feeding it and otherwise, whether it is owned or permissible (wild), and whether it is owned by him or by another\" (1).\nTherefore: There is no harm on you in treating dogs that people bring to your clinic. By that you are offering kindness and goodness. If you seek reward from Allah, we hope you attain the great reward mentioned in the previous hadith. It does not harm you that some who come to you are not permitted to keep a dog. You are not tasked with inspecting every visitor and the reason for his keeping the dog he brought you. Rather, you intend in your clinic to treat dogs permitted to be kept, and advising those who keep them without need about the prohibition of...",
    "foot_note": "1. Sharh Muslim (14/241).",
    "book_id": "994",
    "new_page_number": 91
  },
  {
    "serial_number": "4626917",
    "category_id": "19",
    "category": "Fiqh Issues",
    "book_title": "A Treatise on the Ruling of the Price of Dogs",
    "edition": "First, 2018 CE",
    "publisher": "Dar Al-Lu'lu'ah for Publishing and Distribution, Mansoura - Egypt",
    "page_number": 90,
    "volume_number": 1,
    "text": "...that and its health harm. And assuming most dogs are of those not needed to be kept, that does not prohibit treating them, or examining them, and caring for them.\" End quote.\nThis, and praise be to Allah Lord of the Worlds, and peace upon the Messengers.\nWritten by / Ahmed Awad",
    "foot_note": "None",
    "book_id": "994",
    "new_page_number": 92
  }
]