[
  {
    "text": "الانتصار في حجية قول الصحابة الأخيار\nالمؤلف: عبد العزيز بن ريس الريس\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "category_id": "11",
    "category": "أصول الفقه",
    "new_page_number": 1
  },
  {
    "text": "sn: 3940\nbook_title: الانتصار في حجية قول الصحابة الأخيار\nbook_link: https://shamela.ws/book/271\nbook_id: 271\nauthor_name: عبد العزيز بن ريس الريس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3093\nauthor_ID: 3093\neditor: Null\npublisher: مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة\nedition: الأولى، 1440 ه\npages: 56\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "category_id": "11",
    "category": "أصول الفقه",
    "new_page_number": 2
  },
  {
    "serial_number": "3428239",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: أصول الفقه الكتاب : الانتصار في حجية قول الصحابة الأخيار المؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالكتاب : الانتصار في حجية قول الصحابة الأخيار المؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالمؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالطبعة : الأولى ، 1440 هـ عدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nعدد الصفحات : 56 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nتاريخ النشر بالشاملة : 30 رمضان 1442",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 3
  },
  {
    "serial_number": "3428240",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 5,
    "volume_number": 1,
    "text": "مقدمة بسم الله الرحمن الرحيم سلام عليكم ورحمة الله وبركاته أما بعد: فهذا تفريغ (1) لدرس «حجية قول الصحابي»، الذي ألقيتُه ليلة التاسع والعشرين من الشهر الخامس لعام ثمان وثلاثين وأربعمائة وألف من هجرة النبي - صلى الله عليه وعلى آله وصحبه وسلم -. وانطلاقًا من أهمية هذا الدليل الذي يحتاج إليه كثيرًا، قمت بمراجعة المادة المفرَّغة وتنقيحها وتوثيقها لتخرج في هذه الرسالة المكونة من مقدمة، وتمهيدٍ، وثلاثة فصول، وخاتمة وسميتها «الانتصار لحجية قول الصحابة الأخيار»، وهي على النحو التالي: - المقدمة: وهي التي بين يديك الآن. - التمهيد: تعريف الصحابي ومذهبه، أشياء أخرى. - الفصل الأول: وهو خمسة مباحث: - المبحث الأول: تحرير محل النزاع في حجية مذهب الصحابي. - المبحث الثاني: أنواع مذهب الصحابي من حيث الجملة. - المبحث الثالث: مقدمتان هامتان.",
    "foot_note": "1. قام بتفريغه بعض الإخوة الأفاضل، ووثقوه، ونسقوا الأصل وزادوا فيه وغيروا في الأسلوب بما يقربه لكتاب مؤلف بدل كونه مفرغًا، ووضعوا له فهرسًا كشافًا، فقمتُ بمراجعته فألفيتُه طيبًا، فجزاهم الله خيرًا وبارك فيهم.",
    "book_id": "271",
    "new_page_number": 4
  },
  {
    "serial_number": "3428241",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 6,
    "volume_number": 1,
    "text": "- المبحث الرابع: الأدلة على حجية قول الصحابي. - المبحث الخامس: أقوى ما يتمسك به القائلون بعدم حجية قول الصحابي. - الفصل الثاني: مذهب الصحابي وأقسامه، وفيه ثلاثة مباحث: - المبحث الأول: ابتداء الصحابي لحكمٍ شرعيٍّ. - المبحث الثاني: تفسير الصحابي للنص، إما بتخصيص، أو تقييد، أو تبيين. - المبحث الثالث: العمل عند اختلاف الصحابة. - الفصل الثالث: تنبيهات مهمة، وفيه ثلاثة مباحث: - المبحث الأول: الرد على من قال: قول الصحابي حجةٌ في تفسير النص، لا في ابتداء الحكم. - المبحث الثاني: تحقيق مناط مذهب الصحابي. - المبحث الثالث: الذين ضيَّعوا الاحتجاج بمذهب الصحابي. - الخاتمة. والله أسأل أن يتقبل هذه الرسالة، وأن يجعلها نافعةً لخلقه، مقبولةً عنده سبحانه. والسلام عليكم ورحمة الله وبركاته. د. عبد العزيز بن ريس الريس المشرف على موقع الإسلام العتيق 18/ 4/ 1439 هـ",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 5
  },
  {
    "serial_number": "3428242",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 7,
    "volume_number": 1,
    "text": "تمهيد ينبغي أن يعلم أن الصحابي: هو كل من لقي النبي صلى الله عليه وسلم مؤمنًا به، ومات على ذلك، وإن تخلل ذلك رِدَّةٌ (1) . والدليل على أنه يشترط في الصحابي أن يلقى النبي صلى الله عليه وسلم مؤمنًا به دليلان: الدليل الأول: أخرج مسلم من حديث أبي هريرة، أن رسول الله صلى الله عليه وسلم قال: «وَدِدْتُ أَنَّا قَدْ رَأَيْنَا إِخْوَانَنَا» قَالُوا: أَوَلَسْنَا إِخْوَانَكَ؟ يَا رَسُولَ اللهِ قَالَ: «أَنْتُمْ أَصْحَابِي وَإِخْوَانُنَا الَّذِينَ لَمْ يَأْتُوا بَعْدُ» (2) . فالفرق بين أصحابه وإخوانه: أنه لقي أصحابه، ولم يلق إخوانه. فإذن كلاهما مؤمنٌ به، إلا أن أصحابه لقوه، دون إخوانه، وعليه فالصحابي من لقي النبي صلى الله عليه وسلم مؤمنًا به. الدليل الثاني: إجماع أهل السنة الذي حكاه الإمام أحمد في «أصول السنة» (3) ، بل حكى الإمام أحمد أن من لقي النبي صلى الله عليه وسلم ولو ساعة، فهو صحابيٌّ، وما حكاه في «أصول السنة» الأصل أنه مجمعٌ عليه عند أهل السنة، وحكى مثل هذا الإمام علي",
    "foot_note": "1. انظر في ذلك: «الإحكام» للآمدي (2/ 92)، و «البحر المحيط» للزركشي (6/ 190 - 191)، و «شرح مختصر الروضة» للطوفي (2/ 180 - 186)، و «شرح مختصر التحرير» لابن النجار (2/ 465)، و «فتح المغيث» للسخاوي (4/ 78 - 79)، و «تدريب الراوي» للسيوطي (2/ 667 - 670)، و «إرشاد الفحول» للشوكاني (1/ 188 - 189). \n2. أخرجه مسلم (249). \n3. انظر: «أصول السنة» للإمام أحمد (ص:39 - 41).",
    "book_id": "271",
    "new_page_number": 6
  },
  {
    "serial_number": "3428243",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 8,
    "volume_number": 1,
    "text": "بن المديني ـ رحمه الله تعالى ـ في عقيدته التي رواها اللالكائي (1) . إذا تبيَّن هذا، فستكون هذه الرسالة-بإذن الله- في بحث «حجية مذهب الصحابي»، وقد يعبَّر عنه بقولهم «حجية قول الصحابي»، والأمر سهل، إلا أن التعبير بـ «المذهب» أشمل؛ لأنه يدخل فيه القول والفعل والإقرار، ولعله اشتهر عند العلماء التعبير بقولهم: «قول الصحابي» من باب التغليب؛ لأن القول أكثر، والأمر في ذلك واسع. *  * *",
    "foot_note": "1. انظر: «شرح أصول اعتقاد أهل السنة» للالكائي (1/ 187 - 188).",
    "book_id": "271",
    "new_page_number": 7
  },
  {
    "serial_number": "3428244",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 9,
    "volume_number": 1,
    "text": "الفصل الأول وهو خمسة مباحث: * المبحث الأول تحرير محل النزاع في حجية مذهب الصحابي * المبحث الثاني أنواع مذهب الصحابي من حيث الجملة * المبحث الثالث مقدمتان هامتان * المبحث الرابع الأدلة على حجية قول الصحابي * المبحث الخامس أقوى ما يتمسك به القائلون بعدم حجية قول الصحابي",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 8
  },
  {
    "serial_number": "3428245",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 11,
    "volume_number": 1,
    "text": "المبحث الأول  تحرير محل النزاع في حجية مذهب الصحابي وتحرير محل النزاع في حجية مذهب الصحابي في أمور أربعة: الأمر الأول: ألا يخالف الصحابي نصا، فإذا خالف الصحابي نصا، فإن قوله مردودٌ، ذكر هذا شيخ الإسلام ابن تيمية في «مجموع الفتاوى» (1) ، وابن القيم في كتابه «إعلام الموقعين» (2) ، والعلائي في كتابه «إجمال الإصابة» (3) ، بل حكى الإمام الشافعي على ذلك الإجماع، حيث قال ـ رحمه الله تعالى ـ: «أجمع العلماء على أن من استبانت له سنة النبي صلى الله عليه وسلم، فليس له أن يدعها لقول أحد كائنا من كان» (4) . الأمر الثاني: ألا يخالف الصحابي صحابيا آخر، فإذا خالف الصحابي صحابيا آخر، فليس قول أحدهم أولى من الآخر، إلا ما سيأتي في مبحث الخلفاء الراشدين ـ إن شاء الله ـ. وعلى هذا إجماع أهل العلم، حكى الإجماع الآمدي (5) ، وشيخ الإسلام ابن تيمية كما في «مجموع الفتاوى» (6) ،، والعلائي في كتابه «إجمال الإصابة» (7) وأصله ابن القيم في كتابه «إعلام الموقعين» (8) .",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (1/ 283 - 284). \n2. انظر: «إعلام الموقعين» لابن القيم (6/ 36 - 37). \n3. انظر: «إجمال الإصابة» للعلائي (ص: 90 - 91). \n4. انظر: «إعلام الموقعين» لابن القيم (2/ 11). \n5. انظر: «الإحكام» للآمدي (4/ 149). \n6. انظر: «مجموع الفتاوى» لابن تيمية (1/ 283 - 284)، و (20/ 14). \n7. انظر: «إجمال الإصابة» للعلائي (ص: 78). \n8. انظر: «إعلام الموقعين» لابن القيم (5/ 546).",
    "book_id": "271",
    "new_page_number": 9
  },
  {
    "serial_number": "3428246",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 12,
    "volume_number": 1,
    "text": "الأمر الثالث: ألا يكون لقول الصحابي حكم الرفع، فقد يقول الصحابي قولا، أو يفعل فعلا، وله حكم الرفع، فما كان له حكم الرفع، فمثله حجةٌ؛ لأنه وَحْيٌ لا لأنه قول الصحابي، وقد بيَّن هذا الإمام ابن القيم ـ رحمه الله تعالى ـ في كتابه «إعلام الموقعين» (1) . الأمر الرابع: ألا يكون قول الصحابي مهجورًا، بمعنى: أن يتابع الصحابيَ أهلُ العلم، فلو ذهب الصحابي إلى مذهب، وأجمع العلماء على عدم العمل بهذا القول، فإن هذا القول ليس حجة، ويجب أن يترك، بل لو أجمع العلماء على ترك حديث نبوي، فإنه لا يعمل بهذا الحديث؛ لأن هذا الإجماع إما يدل على ضعف هذا الحديث، أو على أن الحديث منسوخٌ، فقول الصحابي من باب أولى. ومن أمثلة ذلك: ما روى البزار بإسناد صحيح، أن أبا طلحة الأنصاري رضي الله عنه أكل البرد، وهو صائم، وقال: ليس طعاما ولا شرابا (2) . هذا الأثر وهو أن البرد لا يفسد صوم الصائم، قد أجمع العلماء على خلافه، حكى الإجماع ابن الصلاح في كتابه «شرح مشكل الوسيط» (3) ، والشاطبي في كتابه «الموافقات» (4) .",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (6/ 31 - 33). \n2. أخرجه البزار في «المسند» (7428)، والطحاوي في «شرح مشكل الآثار» (5/ 115) وغيرهما، موقوفًا على أبي طلحة. وصححه موقوفًا ابن حزم في «المحلى» (4/ 304)، و «الإحكام» (6/ 83 - 84)، وكذلك الألباني في «السلسلة الضعيفة» (4/ 154). وجاء مرفوعا من طريق ضعيف كما عند أبي يعلى في «المسند» (1424)، و (3999) وغيره، وضعفه الألباني في «السلسلة الضعيفة» (63). \n3. انظر: «شرح مشكل الوسيط» لابن الصلاح (3/ 198 - 199). \n4. انظر: «الموافقات» للشاطبي (3/ 274 - 275).",
    "book_id": "271",
    "new_page_number": 10
  },
  {
    "serial_number": "3428247",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 13,
    "volume_number": 1,
    "text": "فإذا أجمع العلماء على عدم العمل بمذهب الصحابي سواء كان قولا أو فعلا أو تقريرا، فإنه لا يعمل به على ما تقدَّم تقريره. وبعد تحرير محل النزاع في حجية مذهب الصحابي يتضح: أن قول الصحابي حجة مطلقًا، فإذا تنازع العلماء في مسألة على قولين، وكان في أحد القولين قول الصحابة، فإن هذا القول يكون راجحًا؛ لأن الصحابي قد ذهب إلى هذا القول. *  * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 11
  },
  {
    "serial_number": "3428248",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 14,
    "volume_number": 1,
    "text": "المبحث الثاني أنواع مذهب الصحابي من حيث الجملة إذا تبين هذا، فإن مذهب الصحابي من حيث الجملة نوعان: النوع الأول: أن يكون قول الصحابي مشتهرا معروفًا، وذكر الإمام ابن القيم ـ رحمه الله تعالى ـ في كتابه «إعلام الموقعين» (1) أنه إذا قال الصحابي قولا فاشتهر، فإن طائفةً ذهبت إلى أنه إجماعٌ، وأخرى قالت: إنه حجةٌ وليس إجماعًا، وذهبت شرذمة من الفقهاء المتكلمين والمتأخرين إلى أنه ليس إجماعا ولا حجة. ثم ردَّ هذا الإمام ابن القيم ـ رحمه الله تعالى رحمة واسعة ـ، وسيأتي ما ذكره من الأدلة على حجية قول الصحابي في النوع الثاني، وهو دليل على أن النوع الأول حجةٌ من باب أولى. النوع الثاني: ألا يشتهر قول الصحابي، أو لا يعلم هل اشتهر أم لا، فقرر الإمام ابن القيم أنه حجةٌ، قال: هذا قول أبي حنيفة ومالك وأحمد والشافعي في القديم والجديد (2) . وقال بعد ذكر النقولات عن الشافعي: فهذا كلام الشافعي رحمه الله ورضي عنه- بنصه، ونحن نشهد باللَّه أنه لم يرجع عنه، بل كلامه في الجديد مطابق لهذا موافق له كما تقدم ذكر لفظه (3) . لأن بعض أصحاب الشافعي خالفوا، وقالوا: ليس هذا قولا للشافعي في الجديد (4) .",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (5/ 548 - 550). \n2. انظر: «إعلام الموقعين» لابن القيم (5/ 550 - 554). \n3. انظر: «إعلام الموقعين» لابن القيم (5/ 554). \n4. انظر: «إعلام الموقعين» لابن القيم (5/ 550 - 552).",
    "book_id": "271",
    "new_page_number": 12
  },
  {
    "serial_number": "3428249",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 15,
    "volume_number": 1,
    "text": "لكن العلائي في كتابه «إجمال الإصابة» (1) ـ وهو من الشافعية ـ قرَّر أنه قول الشافعي في القديم والجديد. وذكر البيهقي (2) أن للشافعي كلاما يدل على قوله بحجية قول الصحابي في الجديد، فهو قوله في القديم والجديد، وذكر مثل هذا شيخ الإسلام ابن تيمية كما في «مجموع الفتاوى» (3) . فإذن، هذا قول أئمة المذاهب الأربعة، وهو قول أبي عبيد القاسم بن سلام، وإسحاق بن راهويه (4) ، ثم ذكر الإمام ابن القيم رحمه الله ستة وأربعين دليلًا (5) على حجية قول الصحابي، وأطال النفس في ذلك رحمه الله رحمة واسعة ـ. وسأحاول في هذا الرسالة أن ألخص ما تيسَّر من الأمور المهمة التي أشار إليها ابن القيم رحمه الله؛ لأن أوسع وأحسن من بحث هذه المسألة هو الإمام ابن القيم رحمه الله في كتابه «إعلام الموقعين». * * *",
    "foot_note": "1. انظر: «إجمال الإصابة» للعلائي (ص: 36 - وما بعدها). \n2. انظر: «معرفة السنن والآثار» (1/ 183 - 184)، و «المدخل إلى السنن الكبرى» (ص:109 - 110). \n3. انظر: «مجموع الفتاوى» لابن تيمية (20/ 14). \n4. انظر: «إعلام الموقعين» لابن القيم (5/ 550). \n5. انظرها في: «إعلام الموقعين» لابن القيم (5/ 566) إلى (6/ 30).",
    "book_id": "271",
    "new_page_number": 13
  },
  {
    "serial_number": "3428250",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 16,
    "volume_number": 1,
    "text": "المبحث الثالث مقدمتان هامتان وقبل أن أبدأ بذكر الأدلة على حجية قول الصحابي أقدِّم بمقدمتين هامتين للغاية، وهما - في ظني - مفتاح هذه المسألة: المقدمة الأولى: ليس قول الصحابي حجة لذاته؛ فالصحابي في نفسه ليس معصومًا، بدليل أن الصحابة يختلفون على قولين، فإذن ليس قول الصحابي في نفسه حجة، وإنما هو حجة لما انضاف إليه، كما قاله الإمام ابن القيم رحمه الله (1) . وبهذا يجاب على إشكال يردده الظاهرية وبعض المتكلمين ومن تأثر بهم من أهل السنة، يقولون: كيف يقال: إن قول الصحابي حجة، وهو ليس معصوما، وقد يخطئ؟ وجواب هذا الإشكال أن يقال: هذا صحيح، وهو ليس حجة في ذاته، وإنما حجة لما انضاف إليه؛ وذلك أنه بعبارة تقريبية من وجه: صورةٌ من صور نقل الإجماع، فالصحابي إذا قال قولا، ولم يخالف، فإن هذا إجماعٌ، فهو حجةٌ لما انضاف إليه وهو الإجماع. المقدمة الثانية: قول الصحابي حجةٌ من باب الظن الغالب، وقد نصَّ على هذا ابن القيم في كتابه «إعلام الموقعين» (2) ؛ وذلك أن الإجماع الظني إجماع من باب الظن الغالب؛ لأن الإجماع نوعان: قطعي وظني، فما بني على نصٍّ ظاهر، كقوله تعالى: {أَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ}، فهو إجماع قطعي، وما ليس كذلك فهو إجماع ظني، فالقول بحجية قول الصحابي هو من باب الظن الغالب. * * *",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (6/ 37). \n2. انظر: «إعلام الموقعين» لابن القيم (6/ 21).",
    "book_id": "271",
    "new_page_number": 14
  },
  {
    "serial_number": "3428251",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 17,
    "volume_number": 1,
    "text": "المبحث الرابع الأدلة على حجية قول الصحابي بعد هاتين المقدمتين السابقتين فالأدلة على حجية قول الصحابي ما يلي: الدليل الأول: كل دليل على حجية دليل الإجماع، فهو دليل على أن مذهب الصحابي حجة؛ وذلك أن الصحابي أو الصحابيين أو الثلاثة أو الأربعة … إذا قالوا قولا، ولم يخالفوا، فإن هذا إجماعٌ، ولا يصح لأحد أن يقول: إن مثل هذا الإجماع لا يقبل، أو يقول ما شاع عند المتكلمين إن هذا إجماع سكوتي ثم يرده؛ وذلك أن مقتضى رد الإجماع السكوتي أنه لا إجماع؛ لأنه لا يوجد إجماع منطوق، بمعنى: أن كل عالم نطق بقول في هذه المسألة (1) . بل لو أردت أن تثبت عن أهل بدر أنهم قالوا بوجوب الصلوات الخمس لما استطعت أن تثبت ذلك، فإذا لم تستطع ذلك في الصلوات الخمس، وفي مثل أهل بدر، فغيرها من المسائل من باب أولى، فالقول بأنه لا بد أن ينطق كل عالم، مقتضى هذا إسقاط دليل الإجماع، وقد ذكر هذا بمعناه ابن قدامة رحمه الله في كتابه «روضة الناظر» (2) . إذن الدليل الأول: كل دليل يدل على حجية الإجماع يدل على حجية قول الصحابي، ومن ذلك: قوله تعالى: {وَمَن يُشَاقِقِ الرَّسُولَ مِن بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّى وَنُصْلِهِ جَهَنَّمَ وَسَاءَتْ مَصِيرًا}. إذا سئلت في مسألة يوجد فيها قولٌ للصحابة أو قولان أو ثلاثة أو أربعة: ما أعلى",
    "foot_note": "1. راجع في ذلك رسالتنا «حجية الإجماع وكشف بعض الشبهات». \n2. انظر: «روضة الناظر» لابن قدامة (1/ 437).",
    "book_id": "271",
    "new_page_number": 15
  },
  {
    "serial_number": "3428252",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 18,
    "volume_number": 1,
    "text": "قول في هذه المسألة؟ الجواب: هو قول الصحابي، إذن هو سبيل المؤمنين في هذه المسألة فيما تعلم، ومن خالفهم بعد فهو محجوجٌ بهم، إلى غير ذلك من الأدلة على حجية الإجماع (1) . الدليل الثاني: أدلةٌ خاصةٌ بالصحابة، وسأذكر دليلين: دليل نصي أثري، ودليل من جهة المعنى. أما الأول النصي الأثري: قد أخرجه مسلم من حديث أبي موسى الأشعري، أن النبي صلى الله عليه وسلم قال: «النُّجُومُ أَمَنَةٌ لِلسَّمَاءِ، فَإِذَا ذَهَبَتِ النُّجُومُ أَتَى السَّمَاءَ مَا تُوعَدُ، وَأَنَا أَمَنَةٌ لِأَصْحَابِي، فَإِذَا ذَهَبْتُ أَتَى أَصْحَابِي مَا يُوعَدُونَ، وَأَصْحَابِي أَمَنَةٌ لِأُمَّتِي، فَإِذَا ذَهَبَ أَصْحَابِي أَتَى أُمَّتِي مَا يُوعَدُونَ» (2) . شبَّه النبي صلى الله عليه وسلم نفسه بالنجم، والنجم يهتدى به، وشبَّه الصحابة بذلك، فدَلَّ على أنهم حجةٌ، فمن اهتدى بهم سلك الصراط المستقيم، ومن سار على منهاجهم نجا، هذا دليلٌ واضحٌ على حجية قول الصحابي. ومثل ذلك ما جاء في بعض الصحابة، كما أخرج الخمسة إلا النسائي، من حديث العرباض بن سارية رضي الله عنه، أن النبي صلى الله عليه وسلم قال: «عَلَيْكُمْ بِسُنَّتِي، وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ» (3) . هذا صريحٌ في حجية قول بعض الصحابة، كالخلفاء الراشدين، ومن ذلك ما أخرج مسلم من حديث أبي قتادة، أن النبي صلى الله عليه وسلم قال: «إنْ يطع الناس أَبَا بَكْرٍ،",
    "foot_note": "1. راجعها في رسالتي «حجية الإجماع وكشف بعض الشبهات». \n2. أخرجه مسلم (2531). \n3. أخرجه أحمد (4/ 126)، وابن ماجه (42)، وأبو داود (4607)، والترمذي (2676) وقال: حسن صحيح، وصححه الألباني في «صحيح سنن أبي داود» (4607) طبعة المعارف.",
    "book_id": "271",
    "new_page_number": 16
  },
  {
    "serial_number": "3428253",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 19,
    "volume_number": 1,
    "text": "وَعُمَرَ يَرْشُدُوا» (1) ، وهذا في بعض الصحابة أيضًا. أما الدليل الثاني الذي يرجع إلى المعنى: فهو ما ذكره ابن القيم رحمه الله، قال: «إننا والصحابة نشترك في مدارك، وينفصلون عنا بمدارك، والمدارك التي ينفصلون عنها كالتالي، وذلك أن الصحابي إذا قال قولا، يحتمل أنه سمعه من النبي صلى الله عليه وسلم، ويحتمل أنه سمعه ممن سمعه من النبي صلى الله عليه وسلم، ويحتمل أنه ينقل إجماعا في زمانهم، ويحتمل أنه فهمٌ ظهر له لم يظهر لنا، ويحتمل ـ هذا احتمال خامس ـ أنه أمْرٌ دلت عليه اللغة، وهم أئمة في باب اللغة، وعرفوه بالسياق واللغة وغير ذلك، وهذه الاحتمالات الخمسة تدل على أن قوله حجة. قالوا: هناك احتمالٌ سادسٌ: أن يكون اجتهد الصحابي فأخطأ، لكن هذه الأمور الستة ـ وهي المدارك التي انفصلوا بها عنا ـ تدل على أن قولهم حجة من باب الظن الغالب، والظن الغالب حجةٌ في الشريعة. هذه مدارك انفصلوا بها عنا (2) . وهناك مدارك اشتركنا نحن وإياهم فيها، لكن الفرق بينا وبينهم فيها كالفرق بين السماء والأرض، وذلك يُعرف بما ذكره ابن القيم ـ رحمه الله تعالى ـ،: أن الواحد منا إذا أراد أن يدرس اللغة، أخذ من ذهنه شعبة، أما الصحابي فهي سليقته التي نشأ عليها، والحديث أخذ من ذهنه شعبة، أما الصحابي يقول: رأيت محمدًا صلى الله عليه وسلم، وقال محمدٌ صلى الله عليه وسلم، وعلم الأصول أخذ من ذهنه شعبة، أما الصحابي لا يحتاج إلى ذلك، إلى أن قال بعد ذلك: ثم إذا انتهينا من هذا كله، وصلنا بأذهان قد كلَّت وتعبت، ومنا من يجدّ المسير، ومنا من لا يجدّ المسير، فهذا كله ليس عند الصحابي (3) .",
    "foot_note": "1. أخرجه مسلم (681). \n2. انظر: «إعلام الموقعين» لابن القيم (6/ 19 - 21). \n3. انظر: «إعلام الموقعين» لابن القيم (6/ 21 - 22).",
    "book_id": "271",
    "new_page_number": 17
  },
  {
    "serial_number": "3428254",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 20,
    "volume_number": 1,
    "text": "إذن، هذا أمْرٌ اشتركنا نحن وإياهم فيه، إلا أن الفرق بيننا وبينهم عظيمٌ للغاية رضي الله عنهم أرضاهم ـ. وخلاصة ما تقدم في شيئين: الشيء الأول: أن كل دليل يدل على حجية الإجماع يدل على حجية قول الصحابي، فهذا ليس خاصًّا بهم. والشيء الثاني: أن هناك أدلة خاصة بهم أو ببعضهم، ومنها ما سبق ذكره في المدارك المشتركة والمدارك المنفصلة. *  * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 18
  },
  {
    "serial_number": "3428255",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 21,
    "volume_number": 1,
    "text": "المبحث الخامس أقوى ما يتمسك به القائلون بعدم حجية قول الصحابي وأقوى ما يتمسك به القائلون بأن قول الصحابي ليس حجة أمران: الأمر الأول: أنه عند الخلاف يرجع إلى ما قال الله والرسول صلى الله عليه وسلم، قال سبحانه: {فَإِن تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ}، إلى غير ذلك من الأدلة، قالوا: ولم يقل الله: فردوه إلى أبي بكر وعمر، ولا إلى الصحابة. وهذا إذا نظرت في أول الأمر وبادئه، ظننته قويا، بيد أنَّه من أضعف الأدلة؛ وذلك أن مقتضى القول بحجية قول الصحابي أنه ردٌّ إلى الله ورسوله صلى الله عليه وسلم، والذين قالوا إن قول الصحابي حجة ما قالوه إلا أن الأدلة دلت على ذلك، وقد تقدم ذكر بعضها، هذا أولا. ثانيا: يلزم على هذا ألا يكون الإجماع حجةً، فبهذا نوافق المعتزلة؛ لأن أول من أنكر الإجماع هو النظَّام المعتزلي، كما ذكره ابن قدامة (1) ، وغيره من أهل العلم (2) . فإذن مقتضى الرجوع إلى كتاب الله وسنة النبي صلى الله عليه وسلم هو القول بأن قول الصحابي حجة؛ لأن الشريعة دلت على هذا. الأمر الثاني: أن الصحابة ليسوا معصومين، وقد يخطؤون، فكيف نرجع في معرفة الحق والباطل والحلال والحرام إلى أناس قد يخطؤون؟",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 379). قال أبو المعالي الجويني في «البرهان في أصول الفقه» (1/ 261): «أول من باح بِرَدِّه النظَّام، ثم تابعه طوائف من الروافض». \n2. راجع رسالتنا «حجية الإجماع وكشف بعض الشبهات».",
    "book_id": "271",
    "new_page_number": 19
  },
  {
    "serial_number": "3428256",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 22,
    "volume_number": 1,
    "text": "وقد تقدمت الإشارة إلى هذا، وأؤكد ذلك بما يلي: وهو أنه تقدَّم أن الحجة ليست في ذات الصحابي، والصحابي في ذاته ليس معصومًا، بل يخطئ ويصيب؛ لذا إذا اختلفوا على قولين، فالحق في أحد هذين القولين، وإنما الاحتجاج بقولهم من باب الظن الغالب، ثم هو ليس لذاته، وإنما لما انضاف إليه، وهو أنه صورةٌ من صور حكاية الإجماع. فبهذا إذا قال الصحابي قولا، ولم يخالَف، فالمسألة إجماعٌ فتكون الحجية في عدم مخالفة غيره له لا في ذات الصحابي. إذن، خلاصة الجواب أن يقال: إن الحجية ليست بذات الصحابي، وإنما لما انضاف إليه؛ وذلك أن الاحتجاج به من باب الظن الغالب، وهو صورةٌ من صور الإجماع. *  * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 20
  },
  {
    "serial_number": "3428257",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 23,
    "volume_number": 1,
    "text": "الفصل الثاني مذهب الصحابي وأقسامه ينقسم مذهب الصحابي إلى أقسام ثلاثة: القسم الأول: ابتداء الصحابي لحكمٍ شرعيٍّ. القسم الثاني: تفسير الصحابي للنص، إما بتخصيص، أو تقييد، أو تبيين. القسم الثالث: العمل عند اختلاف الصحابة.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 21
  },
  {
    "serial_number": "3428258",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 25,
    "volume_number": 1,
    "text": "المبحث الأول ابتداء الصحابي لحكمٍ شرعيٍّ هذا هو القسم الأول من أقسام مذهب الصحابي، ومن الأمثلة عليه ما يلي: المثال الأول: الجلوس للتشهد في سجدتي السهو إذا كان السجود بعد السلام، فقد جاء بذلك أحاديث مرفوعة، لكن لا تصح، كما بين ذلك ابن تيمية (1) وغيره، وإنما ثبت عن عبد الله بن مسعود رضي الله عنه فيما أخرجه ابن أبي شيبة (2) . وإلى هذا ذهب أبو حنيفة (3) وأحمد (4) ـ رحمهما الله تعالى ـ ولم يخالَف ابن مسعود، فيكون هذا القول حجة؛ لأن الصحابي قد ابتدأ حكما جديدًا، ولم يخالَف. المثال الثاني: الزكاة في عروض التجارة، لم يصح فيه حديث عن رسول الله صلى الله عليه وسلم، وإنما العمدة فيه على الآثار، وعلى الثبوت عن الصحابة، كابن عمر (5) وغيره (6) رضي الله عنهم وأرضاهم ـ.",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (23/ 48 - 51). \n2. أخرجه ابن أبي شيبة (4492)، و (4493). \n3. انظر: «الاختيار لتعليل المختار» لابن مودود الحنفي (1/ 72). \n4. انظر: «الأوسط» لابن المنذر (3/ 315). \n5. أخرجه ابن أبي شيبة (10560)، والبيهقي في «السنن الكبرى» (4/ 147). \n6. كعمر بن الخطاب رضي الله عنه، أخرجه عبد الرزاق (7099)، وابن أبي شيبة (10557)، و (10558)، وأبو عبيد في «الأموال» (1/ 520)، والبيهقي في «السنن الكبرى» (4/ 147) وغيرهم.",
    "book_id": "271",
    "new_page_number": 22
  },
  {
    "serial_number": "3428259",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 26,
    "volume_number": 1,
    "text": "وذهب إلى هذا جماهير أهل العلم؛ لأن الصحابي لم يخالَف في ذلك (1) . المثال الثالث: رفع اليدين في تكبيرات الجنازة، ما عدا تكبيرة الإحرام، تنازع فيها أهل العلم، وأصح الأقوال: أن اليدين ترفع في جميع تكبيرات الجنازة، والدليل على ذلك أنه ثبت عن ابن عمر رضي الله عنهما فيما رواه ابن أبي شيبة (2) وابن المنذر (3) ، فيكون رفع اليدين مستحبًا؛ لأنه قول صحابي لم يخالَف. المثال الرابع: وجوب الوضوء من تغسيل الميت: جاء فيها أحاديث مرفوعة، لكنها لا تصح (4) وإنما العمدة على ثبوته عن عبد الله بن عباس رضي الله عنهما عند عبد الرزاق (5) . وإليه ذهب الإمام أحمد (6) ، وقال ابن قدامة: وليس بين الصحابة خلاف في ذلك (7) ، فيكون حجةً.",
    "foot_note": "1. قال ابن قدامة في «المغني» (4493): «تجب الزكاة في قيمة عروض التجارة، في قول أكثر أهل العلم. قال ابن المنذر: أجمع أهل العلم على أن في العروض التي يراد بها التجارة الزكاة، إذا حال عليها الحول. روي ذلك عن عمر، وابنه، وابن عباس. وبه قال الفقهاء السبعة، والحسن، وجابر بن زيد، وميمون بن مهران، وطاوس، والنخعي، والثوري، والأوزاعي، والشافعي، وأبو عبيد، وإسحاق، وأصحاب الرأي». \n2. أخرجه ابن أبي شيبة (11498). \n3. أخرجه ابن المنذر في «الأوسط» (3108). \n4. قال ابن المنذر في «الأوسط» (5/ 350): «الاغتسال من غسل الميت لا يجب، وليس فيه خبر يثبت، قال أحمد: «لا يثبت فيه حديث»». \n5. أخرجه عبد الرزاق (6101)، وابن المنذر في «الأوسط» (2939). \n6. انظر: «الإنصاف» للمرداوي (1/ 215). \n7. انظر: «المغني» لابن قدامة (1/ 123)، حيث قال: «فروي عن ابن عمر وابن عباس أنهما كانا يأمران غاسل الميت بالوضوء. وعن أبي هريرة، قال: أقل ما فيه الوضوء. ولا نعلم لهم مخالفا في الصحابة».",
    "book_id": "271",
    "new_page_number": 23
  },
  {
    "serial_number": "3428260",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 27,
    "volume_number": 1,
    "text": "المثال الخامس: عدم انتقاض الطهارة بخروج الدم غير الفاحش: ثبت هذا عند عبد الرزاق عن ابن عمر (1) ، وعن غيره من الصحابة (2) ، وإلى هذا القول ذهب أبو حنيفة (3) وأحمد (4) ، وقال ابن قدامة: ليس بين الصحابة خلاف في ذلك (5) . إذن العمدة على قول صحابي أو صحابيين أو ثلاثة في المسائل المتقدمة أو غيرها، ولم يخالفهم غيرهم من الصحابة؛ فكل قول ابتدأه الصحابي، ولم يخالَف، فإنه يكون حجةً. *  * *",
    "foot_note": "1. أخرجه عبد الرزاق (553)، وابن أبي شيبة (1478)، وابن المنذر في «الأوسط» (65). \n2. كأبي هريرة وغيره كما عند عبد الرزاق (556)، وابن أبي شيبة (66)، وابن المنذر في «الأوسط» (66). \n3. انظر: «المغني» لابن قدامة (1/ 120). \n4. انظر: «المغني» لابن قدامة (1/ 120). \n5. انظر: «المغني» لابن قدامة (1/ 120)، حيث قال: «وهو المشهور عن الصحابة، رضي الله عنهم. قال ابن عباس في الدم: إذا كان فاحشا فعليه الإعادة. وابن أبي أوفى بزق دما ثم قام فصلى. وابن عمر عصر بثرة فخرج دم، وصلى، ولم يتوضأ. قال أبو عبد الله: عدة من الصحابة تكلموا فيه وأبو هريرة كان يدخل أصابعه في أنفه، وابن عمر عصر بثرة وابن أبي أوفى عصر دملا وابن عباس قال: إذا كان فاحشا. وجابر أدخل أصابعه في أنفه، وابن المسيب أدخل أصابعه العشرة في أنفه، وأخرجها متلطخة بالدم. يعني: وهو في الصلاة. وقال أبو حنيفة: إذا سال الدم ففيه الوضوء، وإن وقف على رأس الجرح، لم يجب».",
    "book_id": "271",
    "new_page_number": 24
  },
  {
    "serial_number": "3428261",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 28,
    "volume_number": 1,
    "text": "المبحث الثاني تفسير الصحابي للنص، إما بتخصيص، أو تقييد، أو تبيين هذا هو القسم الثاني وهو: أن يقول الصحابي قولا في تفسير نص، إما بتخصيص عام، أو تقييد مطلق، أو تبيين مجمل، وما كان كذلك، فإنه حجةٌ؛ لأن الأدلة دلَّت على حجية قول الصحابي ولم تفرِّق بين أن يكون ابتداء أو في تفسير نص. وبعبارة أخرى: إذا جاء نصٌّ عامٌّ، والنص العام حجةٌ، وجاء قول صحابي خاص، وقول الصحابي حجةٌ على ما تقدَّم، فالعمل بالحجتين أولى من إهمال أحدهما؛ فلذا يُخص العام، ويُقيد المطلق، ويُبين المجمل في مثل هذا بقول الصحابي. تنبيه: تنازع أهل العلم كثيرًا في أمثلة هذا القسم: هل هو من تفسير النص أو من مخالفة الصحابي للنص؟ فإذا كان من مخالفة الصحابي للنص فإنه يرد؛ لما تقدَّم في تحرير محل النزاع: أن قول الصحابي يرد إذا خالف النص بالإجماع، أما إذا كان تفسيرًا للنص، فإنه حجةٌ على ما تقدم تقريره. والضابط في هذا ما قرره الإمام ابن القيم ـ رحمه الله تعالى ـ في كتابه «إعلام الموقعين»، قال رحمه الله ما مفاده: إذا خالف الصحابي النص، لا بد أن ينكر عليه صحابيٌّ آخر، فإذا لم ينكر عليه صحابيٌّ آخر، فليس هو من مخالفة النص، وإنما من تبيين النص (1) . فلذا إذا شككت في قول صحابي هل هو مخالف للنص فيرد، أو مفسر له فيقبل؟ ينظر: هل خالفه صحابي آخر أم لا؟ فإذا لم يخالِفه صحابي آخر، فهو من تفسير النص وبيانه.",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (5/ 575 - 576).",
    "book_id": "271",
    "new_page_number": 25
  },
  {
    "serial_number": "3428262",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 29,
    "volume_number": 1,
    "text": "والدليل على هذا: أن الله سبحانه قال: {كُنتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنكَرِ}، قال ابن القيم: والقول الخطأ منكرٌ من وجه، فلو كان هذا القول مرجوحًا عند هذا الصحابي، فلا بد أن ينكر عليه صحابي آخر، فلما لم ينكر عليه صحابي آخر، دل على أن قوله ليس مرجوحًا، ولا يمكن أن ينقل الله لنا القول المرجوح، ويدع القول الراجح؛ وهو أمرنا باتباع سبيل المؤمنين (1) . وهذا الضابط إذا تأمَّله الناظر استطاع أن يميِّز بين القول الذي يُرَدُّ؛ لأنه مخالفٌ للنص، والقول الذي يُقبل؛ لأنه تفسيرٌ للنص، وما أكثر الاضطراب والاختلاف في مثل هذا، لكن إذا ضُبط هذا الضابط الذي ذكره ابن القيم اتضح الأمر جليا، و كان الدارس والناظر سائرا على خط مستقيم بلا اضطراب ولا تناقض. وقبل ذكر الأمثلة، ليعلم أنه قد يُتنازع في بعض الأمثلة: هل هي من ابتداء الحكم: أي من القسم الأول، أو من القسم الثاني؟ وقد يحصل شيء من النزاع في الفهم، لكن من حيث الجملة، سواء كان من القسم الأول أو الثاني، فإنه على كلا الحالين حجة. المثال الأول: أخرج الشيخان من حديث عائشة رضي الله عنها، قال النبي صلى الله عليه وسلم: «مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ» (2) . فقد ثبت عند أبي داود عن ابن عباس، أنه خصه بصيام النذر (3) ، إذن هذا من باب تفسير النص؛ لأن ابن عباس لم يخالَف، فيُحمل هذا الحديث على صيام النذر.",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (5/ 569). \n2. أخرجه البخاري (1952)، ومسلم (1147). \n3. أخرجه أبو داود (2401)، وصححه الألباني في «صحيح سنن أبي داود» (2401) طبعة المعارف.",
    "book_id": "271",
    "new_page_number": 26
  },
  {
    "serial_number": "3428263",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 30,
    "volume_number": 1,
    "text": "وإلى هذا ذهب الليث بن سعد (1) ، وأحمد في رواية (2) ، وهو اختيار ابن القيم (3) ، واختيار العلامة الألباني (4) ـ رحم الله الجميع ـ. المثال الثاني: الأخذ من اللحية مقدار القُبضة: جاءت الشريعة بالإعفاء والإرخاء إلى غير ذلك، ثم ثبت عند البخاري عن ابن عمر أنه كان يأخذ مقدار القبضة (5) . وجاء عن جابر عند أبي داود، أنه قال: «كنا نعفي السبال إلا في حج أو عمرة» (6) . وجاء أيضا عن أبي هريرة رضي الله عنه (7) . وأخرج ابن جرير عن ابن عباس، قال: {ثُمَّ لْيَقْضُوا تَفَثَهُمْ}، قال في تفسيره: أي يؤخذ من عارضيه (8) . والمقصود: أنَّ الذي جاء عن الصحابة هو مطلق الأخذ، لكن ابن عمر فسَّر ذلك بأنه مقدار القبضة، وما كان دون ذلك فلا، فإن الإعفاء الذي جاءت به الشريعة هو ما كان مقدار القبضة، فإذن ما زاد على القبضة فيؤخذ استحبابًا؛ لأن ابن عمر فعله رضي الله عنهما. وإلى هذا ذهب الإمام أحمد (9) والشافعي (10) ، وكان أحمد يأخذ من طولها",
    "foot_note": "1. انظر: «المغني» لابن قدامة (3/ 39). \n2. انظر: «إعلام الموقعين» لابن القيم (6/ 545)، و «الإنصاف» للمرداوي (3/ 336). \n3. انظر: «إعلام الموقعين» لابن القيم (6/ 545). \n4. انظر: «أحكام الجنائز» للألباني (ص:169 - 170)، و «التعليق على تمام المنة» للألباني (ص:427 - 428). \n5. أخرجه البخاري (5892)، وابن أبي شيبة (25997). \n6. أخرجه أبو داود (4201)، وضعفه الألباني في «ضعيف سنن أبي داود» (4201) طبعة المعارف. وأخرجه ابن أبي شيبة (25998) بإسنادٍ ضعيف أيضًا. \n7. أخرجه ابن أبي شيبة (25999). \n8. أخرجه الطبري في «التفسير» (16/ 526). \n9. انظر: «مسائل ابن هانئ» (1848)، و «الترجل» للخلال (1/ 129). \n10. انظر: «المجموع» للنووي (8/ 201).",
    "book_id": "271",
    "new_page_number": 27
  },
  {
    "serial_number": "3428264",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 31,
    "volume_number": 1,
    "text": "وعرضها (1) . إلا أن العلماء اختلفوا: هل هذا في الحج والعمرة أو عام؟ وأظهر القولين: أنه عامٌّ كما هو قول أحمد؛ لأن ابن عمر كان إذا أفطر من رمضان، إن أراد الحج لم يأخذ (2) ، فمفهوم المخالفة: إن لم يرد الحج أخذ ـ تجمَّلًا للعيد ـ، إذن حدَّد ابن عمر الإعفاء بمقدار القبضة، وهذا قول صحابي، وقوله حجةٌ في تفسير النص، وهو قول الشافعي والإمام أحمد كما تقدَّم، ونصره كثيرا العلامة محمد ناصر الدين الألباني (3) ـ رحم الله الجميع ـ. المثال الثالث: قال سبحانه: {فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ}، فالشريعة جاءت بالقضاء مطلقا، وجاءت بصيام النفل مطلقا، ولم تشترط في النفل ألا يبقى عليه فرض، وإنما جاءت باستحباب الصيام مطلقا، لكن ثبت عن أبي هريرة رضي الله عنه عند عبد الرزاق، أنه قال: «ابدأ بما افترض الله عليك» (4) ، فدل هذا على أنه لا يصح لأحد أن يصوم نفلا وعليه فرضٌ. وإلى هذا ذهب الإمام أحمد في رواية (5) ، والعمدة على أثر أبي هريرة رضي الله عنه. المثال الرابع: المسح على الجبيرة: ثبت المسح على الجبيرة عن ابن عمر رضي الله عنه، خرَّجه البيهقي وغيره (6) .",
    "foot_note": "1. انظر: «مسائل ابن هانئ» (1848). \n2. أخرجه مالك في «الموطأ - رواية يحيى الليثي» (888). \n3. انظر: «السلسلة الضعيفة» للألباني (5/ 125)، وتحت (2355)، و (6203). \n4. أخرجه عبد الرزاق (7715) عن أبي هريرة وسأله رجل قال: إن علي أياما من رمضان، أفأصوم العشر تطوعا؟ قال: «لا، ولم؟ ابدأ بحق الله، ثم تطوع بعدما شئت». \n5. انظر: «الإنصاف» للمرداوي (3/ 350). \n6. أخرجه البيهقي في «السنن الكبرى» (1/ 228) وصححه.",
    "book_id": "271",
    "new_page_number": 28
  },
  {
    "serial_number": "3428265",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 32,
    "volume_number": 1,
    "text": "وذهب إلى هذا أبو حنيفة (1) ، ومالك (2) ، وأحمد (3) ، والشافعي في قول له (4) ، والقول بالمسح على الجبيرة هو الصحيح؛ لأن ابن عمر لم يخالَف كما قاله ابن تيمية في شرح العمدة (5) ، وذكر البيهقي أنه لم يصح فيه حديث (6) . إذن، صار المسح على الجبيرة مشروعًا، والعمدة في ذلك فعل ابن عمر رضي الله عنه، وهذا يحتمل أن يكون من تفسير النص، ويحتمل أن يكون من ابتداء حكم، والأمر سهلٌ في ذلك كما تقدَّم. المثال الخامس: اشتراط مضي الحول في الزكاة، فإن الشريعة جاءت بالزكاة، ولولا ما جاء من الآثار في اشتراط مضي الحول لما قيل باشتراط مضي الحول. وهذا يحتمل أنه من تفسير النص، ويحتمل أنه من ابتداء حكم. قال البيهقي: لم يصح في ذلك حديث، وإنما العمدة على الآثار، وثبت هذا عن عثمان وابن عمر رضي الله عنهما (7) . وعليه المذاهب الأربعة (8) .",
    "foot_note": "1. انظر: «بدائع الصنائع» للكاساني (1/ 13). \n2. انظر: «المدونة» لمالك (1/ 129 - 130)، و «الأوسط» لابن المنذر (2/ 23). \n3. انظر: «الأوسط» لابن المنذر (2/ 23)، و «المغني» لابن قدامة (1/ 171 - 172)، و «الإنصاف» للمرداوي (1/ 171 - 172)، و «كشاف القناع» للبهوتي (1/ 112). \n4. انظر: الأوسط» لابن المنذر (2/ 144)، «المجموع» للنووي (1/ 476) مع (2/ 325 - 327). \n5. انظر: «شرح العمدة» لابن تيمية (1/ 285). \n6. انظر: «السنن الكبرى» للبيهقي (1/ 228). \n7. انظر: «السنن الكبرى» للبيهقي (4/ 95). \n8. انظر: «بدائع الصنائع» للكاساني (2/ 13)، و «الذخيرة» للقرافي (3/ 32)، و «المجموع» للنووي (6/ 8)، «مختصر الخرقي مع المغني» (2/ 257).",
    "book_id": "271",
    "new_page_number": 29
  },
  {
    "serial_number": "3428266",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 33,
    "volume_number": 1,
    "text": "المثال السادس: ثبت عند ابن أبي شيبة وغيره عن ابن عباس أنهم كانوا يَردُّون من دخل الحرم بلا إحرام (1) ، فلا يدخل أحدٌ الحرم إلا محرما، حتى لو لم يُرِدِ الحج أو العمرة. قال ابن تيمية في شرح العمدة: هذا قول ابن عباس، وليس له مخالف (2) . فإن قيل: ماذا يقال في حديث ابن عباس فيما أخرج الشيخان عنه، لما ذكر المواقيت قال: «هن لهن ولمن أتى عليهن من غير أهلهن ممن أراد الحج والعمرة» (3) ، مفهوم المخالفة: أن مَن لم يُرد الحج أو العمرة فلا يُحرم؟ يقال: قوله: «ممن أراد الحج والعمرة» خرج مخرج الغالب، وما خرج مخرج الغالب فلا مفهوم له، وأيضا لو قدِّر أن هذا المفهوم على ظاهره، فقول ابن عباس منطوقٌ، والحجة المنطوقة مقدَّمةٌ على الحجة المفهومة. وإلى هذا ذهب جمهور الحنفية (4) ، والمالكية (5) ، والحنابلة (6) ، وهو قول عند الشافعية (7) : أنه لا يدخل الحرم أحدٌ إلا محرما، ولو كان ممن لا يريد الحج أو العمرة.",
    "foot_note": "1. أخرجه ابن أبي شيبة (13691)، و (14386)، والطحاوي في شرح معاني الآثار (2/ 263)، و (3/ 329). \n2. انظر: «شرح العمدة» لابن تيمية (2/ 342). \n3. أخرجه البخاري (1524)، ومسلم (1181). \n4. انظر: «بدائع الصنائع» للكاساني (2/ 164)، و «البناية شرح الهداية» للعيني (4/ 162)، و «المغني» لابن قدامة (3/ 116 - 117). \n5. انظر: «المدونة» لمالك (1/ 405)، و «المغني» لابن قدامة (3/ 116 - 117). \n6. انظر: «المغني» لابن قدامة (3/ 116 - 117)، و «شرح العمدة» لابن تيمية (2/ 343 - 344). \n7. انظر: «المجموع» للنووي (7/ 10) وما بعدها.",
    "book_id": "271",
    "new_page_number": 30
  },
  {
    "serial_number": "3428267",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 34,
    "volume_number": 1,
    "text": "المثال السابع: أمر الله بزكاة ما خرج من الأرض، وهذا عامٌّ، لكن ثبت عند ابن أبي شيبة عن أبي موسى الأشعري أنه خصَّص ذلك في أربع: لا زكاة إلا في الحنطة والشعير والزبيب والتمر (1) . وجاء مرفوعًا، لكن لا يصح (2) ، وإنما الصواب أنه موقوفٌ على أبي موسى الأشعري رضي الله عنه، وهذا قول أحمد في رواية (3) ، فبقول أبي موسى الأشعري خُصِّص ذلك في هذه الأربع. والأمثلة على هذا كثيرةٌ، لكن أؤكد على أنه قد يُتنازَع في بعض الأمثلة: هل هي من تفسير النص أو ابتداء الحكم؟ وعلى كلا الحالين لا إشكال في ذلك على ما تقدم بيانه. *  * *",
    "foot_note": "1. أخرجه ابن أبي شيبة (10118). \n2. أخرجه أحمد (5/ 228) رقم (21989) وغيره، وصححه محققو المسند. \n3. انظر: «المغني» لابن قدامة (2/ 293).",
    "book_id": "271",
    "new_page_number": 31
  },
  {
    "serial_number": "3428268",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 35,
    "volume_number": 1,
    "text": "المبحث الثالث العمل إذا اختلف الصحابة يكون الكلام في هذا المبحث عن القسم الثالث من مذهب الصحابي وهو: ماذا لو اختلف الصحابة رضي الله عنهم في مسألة ما؟ ويحسن التنبيه إلى أن الأصل أنه لا خلاف بين الصحابة؛ فلذا لابد أن يُحاول التوفيق بين أقوالهم، بحيث تكون أقوالهم قولا واحدًا، وقد فعل ذلك جمعٌ من أهل العلم، منهم ابن قدامة ـ رحمه الله تعالى ـ في «المغني» في مسألة تتعلق بسجود التلاوة (1) ، ومنهم شيخ الإسلام ابن تيمية في «شرح العمدة» (2) لما أورد مسألة وأطال الكلام فيها، بيَّن رحمه الله أن الأصل أن أقوال الصحابة واحدةٌ، فوفَّق بين الأقوال، ورفع الخلاف في ذلك، وهذا حق، لأن الأصل في أقوال الصحابة أنها قولٌ واحدٌ، وأن الخلاف بينهم قليلٌ، وقُربهم من الوحي ومشاهدتهم رسول الله صلى الله عليه وسلم يُقلِّل الخلاف بينهم. لكن بشرط إذا جُمع بين أقوال الصحابة فلا يُخرَج بقول مُحدَث جديد. فلو أن العلماء مختلفون في مسألة على أقوال ثلاثة، وحصل بين الصحابة خلاف، وجمع بين أقوالهم، فصارت النتيجة قولا رابعا محدثا فهذا خطأ. وهذا القسم ـ وهو ما اختلف فيه الصحابة ـ على حالين: الحال الأولى: أن يكون في المسألة دليلٌ: فإذا ظهر في المسألة دليل، فيجب العمل",
    "foot_note": "1. انظر: «المغني» لابن قدامة (1/ 447) حيث قال فيها: « \n…. ولا مخالف لهم في عصرهم نعلمه إلا قول ابن عمر: إنما السجدة على من سمعها. فيحتمل أنه أراد من سمع عن قصد، فيحمل عليه كلامه جمعا بين أقوالهم». \n2. انظر: «شرح العمدة» لابن تيمية (1/ 105)",
    "book_id": "271",
    "new_page_number": 32
  },
  {
    "serial_number": "3428269",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 36,
    "volume_number": 1,
    "text": "بالدليل بالإجماع، فقد تقدَّم قول الشافعي: أجمع العلماء على أن من استبانت له سنة النبي صلى الله عليه وسلم لم يكن له أن يدعها لقول أحد كائنا من كان (1) . فلو أن أبا بكر وعمر وعثمان وعليا في كفة، وابن عباس في كفة، والدليل المنصوص مع ابن عباس، فالقول قول ابن عباس لوجوب العمل بالدليل. الحال الثانية: ألا يكون في المسألة دليل: وهذه الحال قسمان: القسم الأول: أن يكون في المسألة قول للخلفاء الراشدين، أو فيه قول أحدهم، لكن لم يخالَف، كأن يكون قول علي، لكن لم يخالفه أحدٌ من الخلفاء الراشدين، فإنه في مثل هذا يرجح قول الأربعة المجمعين، أو قول أحدهم الذي لم يخالف منهم؛ لما تقدَّم من حديث العرباض بن سارية: «عليكم بسنتي وسنة الخلفاء الراشدين المهديين» (2) ، وحديث أبي قتادة: «إن يطع الناس أبا بكر وعمر يرشدوا» (3) ، وثبت عن ابن عباس فيما رواه ابن عبد البر (4) وغيره، أنه كان يحتج بقول أبي بكر وعمر رضي الله عنهم وأرضاهم ـ. وإلى هذا ذهب الإمام الشافعي (5) وأحمد في رواية (6) ، وقرَّره بقوة الإمام ابن القيم رحمه الله في كتابه «إعلام الوقعين» (7) .",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (2/ 11). \n2. سبق تخريجه. \n3. سبق تخريجه. \n4. أخرجه ابن عبد البر في «جامع بيان العلم وفضله» (1600)، وهو عند ابن أبي شيبة (23448)، والحاكم (1/ 127) وقال: هذا حديث صحيح على شرط الشيخين، وفيه توقيف ولم يخرجاه. \n5. انظر: البحر المحيط» للزركشي (8/ 55)، و (8/ 58). \n6. انظر: «إعلام الموقعين» لابن القيم (5/ 546 - 547). \n7. انظر: «إعلام الموقعين» لابن القيم (3/ 556)، و (5/ 546 - 547)، و (6/ 5 - 6).",
    "book_id": "271",
    "new_page_number": 33
  },
  {
    "serial_number": "3428270",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 37,
    "volume_number": 1,
    "text": "ومن الأمثلة على ذلك ما يلي: المثال الأول: تنازع العلماء في قراءة الجنب للقرآن على قولين: قال ابن عباس فيما علَّقه البخاري: لا بأس للجنب أن يقرأ القرآن (1) . والقول الثاني: ثبت عن عمر وعلي، قال علي فيما رواه ابن أبي شيبة: لا يقرأ، ولا حرفا، يعني: الجنب (2) ، وثبت النهي للجنب عن قراءة القرآن عن عمر عند البيهقي في «الخلافيات» (3) ، فإذن يرجَّح القول بعدم جواز قراءة الجنب للقرآن؛ لأنه قولٌ عليه بعض الخلفاء الراشدين، وإلى هذا ذهب أئمة المذاهب الأربعة (4) . المثال الثاني: تنازع العلماء في المبيت بمنى للحاج، فذهب ابن عباس إلى أن المبيت بمنى ليس واجبا (5) ، وخالف عمر فيما روى مالك في «الموطأ» (6) ، وكان يرد الناس حتى يبيتوا في منى، فدل هذا على وجوب المبيت بمنى، وهذا هو الصواب، وإلى هذا القول ذهب مالك (7) ، والشافعي (8) ، وأحمد في رواية (9) . تنبيه: بيَّن ابن القيم أن الأربعة إذا اختلفوا فقول أبي بكر مقدَّمٌ على عمر، وقول أبي بكر وعمر مقدَّمٌ على عثمان، قال: من درس أغوار المسائل ظهرت له هذه المسألة أو شيئا من ذلك (10) .",
    "foot_note": "1. أخرجه البخاري تعليقًا في (1/ 68) قبل حديث (305). \n2. أخرجه ابن أبي شيبة (1092)، وهو عند عبد الرزاق (1306) وغيره. \n3. انظر: «الخلافيات» للبيهقي (2/ 38) رقم (325). \n4. انظر: «بدائع الصنائع» للكاساني (1/ 37 - 38)، و «الذخيرة» للقرافي (1/ 316)، و «المهذب مع المجموع» للشيرازي (1/ 64)، «مختصر الخرقي مع المغني» (1/ 96). \n5. أخرجه ابن أبي شيبة (14614)، وله رأيا آخر مثل رأي عمر رضي الله عنهما كما عند ابن أبي شيبة (14602) أيضًا. \n6. انظر: «الموطأ - رواية يحيى الليثي» (910)، ومثله عند ابن أبي شيبة (14603) وغيره. \n7. انظر: «المغني» لابن قدامة (2/ 231). \n8. انظر: «المغني» لابن قدامة (2/ 231). \n9. انظر: «المغني» لابن قدامة (2/ 231). \n10. انظر: «إعلام الموقعين» لابن القيم (5/ 546 - 547).",
    "book_id": "271",
    "new_page_number": 34
  },
  {
    "serial_number": "3428271",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 38,
    "volume_number": 1,
    "text": "القسم الثاني: ألا يكون في المسألة قول لأحد الخلفاء الراشدين الأربعة، وإنما الخلاف بين بقية الصحابة، -وأؤكد المسألة مطروحة إذا لم يوجد فيها نصٌّ-: فإذا اختلف الصحابة من غير الخلفاء الراشدين بعضهم مع بعض، فيرجَّح أشبه القولين بالكتاب والسنة، نصَّ على هذا الإمام الشافعي (1) وأحمد (2) ـ رحمهم الله تعالى رحمة واسعة ـ. وعلى هذا أمثلة: المثال الأول: تنازع العلماء في استقبال القبلة واستدبارها لمن أراد أن يقضي الحاجة، وللصحابة في هذه المسألة قولان: القول الأول: حرمة الاستقبال والاستدبار، حتى في البنيان، وهذا قول أبي أيوب الأنصاري في «الصحيحين» (3) . والقول الثاني: جواز الاستقبال والاستدبار في البنيان دون الصحراء، وهو قول ابن عمر رضي الله عنه، رواه الدارقطني وغيره، أنه لما أراد أن يقضي حاجته جعل أمامه دابته، وقضى حاجته، لما قيل له قال: إنما ذلك في الفضاء (4) .",
    "foot_note": "1. انظر: «الإحكام» للآمدي (4/ 149)، و «البحر المحيط» للزركشي (8/ 57). \n2. انظر: «الإحكام» للآمدي (4/ 149)، و «البحر المحيط» للزركشي (8/ 57)، و «إعلام الموقعين» لابن القيم (2/ 55). \n3. أخرجه البخاري (394)، ومسلم (264). وانظر رأيه في: «المصنف» لابن أبي شيبة (1/ 150)، و «المحلى» لابن حزم (1/ 189)، و «المجموع» للنووي (2/ 81). وهو أيضًا قول ابن مسعود، أبي هريرة كما في: «المحلى» لابن حزم (1/ 189). \n4. أخرجه الدارقطني (1/ 92) رقم (161)، وقال: هذا صحيح كلهم ثقات. وانظر رأيه في: «المحلى» لابن حزم (1/ 190)، «المجموع» للنووي (2/ 81). وهو أيضًا مروي عن العباس بن عبد المطلب كما في: «المجموع» (2/ 81)، و «شرح مسلم» (3/ 154) و «شرح أبي داود» (ص: 106) ثلاثتهم للنووي.",
    "book_id": "271",
    "new_page_number": 35
  },
  {
    "serial_number": "3428272",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 39,
    "volume_number": 1,
    "text": "فالمقصود أن ابن عمر فرق بينهما، بخلاف أبي أيوب الأنصاري. أردنا أن نتفقه وأن ننظر أي القولين أشبه بالكتاب والسنة، فوجدنا أنه ثبت عن رسول الله صلى الله عليه وسلم في «الصحيحين» (1) أنه بال مستدبرا للقبلة في البنيان، وهذا القول أشبه بقول المفرِّق بين البنيان والصحراء، فلذلك رجح قول ابن عمر. فإن قيل: لم لا يقال بجواز الاستدبار دون الاستقبال؟ يقال: لأن هذا القول ليس عند الصحابة، وإنما الصحابة اختلفوا على قولين، ولا يجوز أن نخرج عن قوليهم، وهذه قاعدةٌ مهمةٌ؛ سئل الإمام أحمد عن رجل يقول: إذا اختلف الصحابة على قولين فنخرج عن قوليهم، قال: هذا قولٌ خبيثٌ، هذا قول أهل البدع (2) ؛ لأننا مأمورون أن نتبع سبيل المؤمنين، فسبيل المؤمنين في هذه المسألة قولان، فلا نخرج عنهما. المثال الثاني: تنازع العلماء في صلاة سنن الرواتب للمسافر: هل تصلى أو لا تصلى؟ في المسألة قولان: القول الأول: قول ابن عمر: أنها لا تصلى (3) . والقول الثاني: أنها تصلى، وهو قول جمهور الصحابة، نقله الحسن البصري عن الصحابة، وهو قول جابر، وابن عباس، وجماعة من الصحابة (4) . وأشبه القولين بالكتاب والسنة يتضح بالنظر في الأدلة: فقد ثبت في «صحيح مسلم» من حديث أبي قتادة، أن النبي صلى الله عليه وسلم كان مسافرا،",
    "foot_note": "1. أخرجه البخاري (145)، و (148)، ومسلم (266). \n2. انظر: المسودة ص 315 و العدة لأبي يعلى (4/ 1059). \n3. أخرجه ابن المنذر في «الأوسط» (2763). وانظر: مسلم (689). \n4. انظر: «الأوسط» لابن المنذر (5/ 248).",
    "book_id": "271",
    "new_page_number": 36
  },
  {
    "serial_number": "3428273",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 40,
    "volume_number": 1,
    "text": "ففاتته صلاة الفجر، فقام وصلى راتبة الفجر، ثم صلى الفجر كما كان يصلي (1) . إذن صلى الراتبة، وهذا يوافق قول جمهور الصحابة فهو أشبه بالكتاب والسنة. ولو قال قائل: لا تصلى من الرواتب إلا راتبة الفجر، يقال: هذا قول محدثٌ من جهة أقوال الصحابة، ولم يثبت هذا فيما أعلم لا عن ابن عمر ولا عن غيره: أي الاستثناء، وإنما الذي ثبت عن ابن عمر أنه لا يُصلِّى مطلقا، أو يُفرِّق بين الليل والنهار: أي يجوز صلاة الراتبة في الليل دون النهار (2) . وعلى كلا الاحتمالين: فمقتضى مذهبه أن راتبة الفجر لا تصلى، وقد ثبت في السنة عن رسول الله صلى الله عليه وسلم أنه صلى راتبة الفجر في السفر، فدل هذا على أن المسافر يصلي الراتبة، وهذا هو القول المشهور عند المذاهب الأربعة، بل على هذا المذاهب الأربعة (3) . المثال الثالث: علّق البخاري عن بُريدة بن الحُصيب رضي الله عنه، أنه أوصى أن يجعل على قبره جريدان (4) ؛ لأنه ثبت عن رسول الله صلى الله عليه وسلم من حديث ابن عباس في «الصحيحين»، أنه وضع على القبر جريدا رطبا، ثم قال: «لعله يخفف عنهما ما لم ييبسا» (5) ، ففعل ذلك بُريدة بن الحُصيب رضي الله عنه وخالفه ابن عمر، ذكر البخاري أن ابن عمر لما رأى رجلا يظلل القبر، قال: لا تظله، وإنما يظله عمله (6) ، فالميت",
    "foot_note": "1. أخرجه مسلم (681). \n2. أخرجه ابن المنذر في «الأوسط» (2764) عن ابن عمر. \n3. انظر: «الدر المختار مع حاشية ابن عابدين» (2/ 131)، و «الاستذكار» لابن عبد البر (2/ 254)، و «المجموع» للنووي (4/ 400 - 401)، «الإنصاف» للمرداوي (2/ 322). \n4. أخرجه البخاري تعليقًا في (2/ 95) قبل حديث (1361). \n5. أخرجه البخاري (1361)، ومسلم (292). \n6. أخرجه البخاري تعليقًا في (2/ 95) قبل حديث (1361).",
    "book_id": "271",
    "new_page_number": 37
  },
  {
    "serial_number": "3428274",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 41,
    "volume_number": 1,
    "text": "لا ينفعه أن يظل قبره ولا أن يفعل شيء عليه، فابن عمر خالف بُريدة. وأشبه القولين بالكتاب والسنة يُعرَف بأن النبي صلى الله عليه وسلم علَّل وضع الجريد على القبرين بما يقتضي كشف الغيب؛ لأنه قال: «إنهما ليعذبان»، وهذا لا يكون لغيره، ولم يفعله لغيرهما صلى الله عليه وسلم، فدل هذا على أن الصواب مذهب ابن عمر رضي الله عنهما. المثال الرابع: ثبت أن ابن عمر كان يحاكي النبي صلى الله عليه وسلم، فيذهب مع الطريق الذي ذهب معه … إلخ (1) ، وثبت عن عمر عند ابن أبي شيبة أنه رأى أناسا يتتبعون أماكن النبي صلى الله عليه وسلم فأنكر عليهم: أي لما عادوا وقفلوا من الحج رأى أقواما يصلون في مكان، فسألهم، قالوا: صلى في هذا النبي صلى الله عليه وسلم، فأنكر عليهم، قال: إنما أهلك من كان قبلكم بتتبعهم مساجد وبيع أنبيائهم، فمن أدركت الصلاة فليصل، وإلا فليترك (2) ، فقول عمر مقدَّمٌ على قول ابن عمر؛ لأنه خليفة راشد، ولمُرجِّحات أخرى. والأمثلة على هذا كثيرة، وإنما أردت بهذه الأمثلة ذكر المثال؛ لِيُعرَف غيره، وليسهل تنزيل ذلك على غيرها من المسائل الكثيرة. *  * *",
    "foot_note": "1. أخرجه ابن أبي شيبة (35793)، والبيهقي في «السنن الكبرى» (5/ 249) وغيرهما. \n2. أخرجه ابن أبي شيبة (7632)، وهو عند عبد الرزاق (2734)، وابن وضاح في «البدع» (101) وغيرهما.",
    "book_id": "271",
    "new_page_number": 38
  },
  {
    "serial_number": "3428275",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 43,
    "volume_number": 1,
    "text": "الفصل الثالث تنبيهات هامة وفيه ثلاثة مباحث * المبحث الأول الرد على من قال: قول الصحابي حجةٌ في تفسير النص، لا في ابتداء الحكم * المبحث الثاني تحقيق مناط مذهب الصحابي * المبحث الثالث الذين ضيَّعوا الاحتجاج بمذهب الصحابي",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 39
  },
  {
    "serial_number": "3428276",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 45,
    "volume_number": 1,
    "text": "المبحث الأول الرد على من قال: قول الصحابي حجةٌ في تفسير النص، لا في ابتداء الحكم زعم بعضهم: أن قول الصحابي حجةٌ في تفسير النص، لا في ابتداء الحكم. وهذا تناقض بلا شك؛ لأن من قال: إنه حجةٌ في تفسير النص؛ لأنه سبيل المؤمنين … إلى غير ذلك من الأدلة، فالحجة حجةٌ سواء فسَّرت النص أو ابتدأت الحكم، وذلك إما أن يقال: إنه ليس حجة لا في تفسير النص ولا في ابتداء الحكم، أو أنه حجة في تفسير النص وابتداء الحكم؛ وذلك أن العمل بالدليلين أولى من إهمال أحدهما، أما أن يفرَّق بينهما فهو تفريقٌ بين المتماثلات، ومثل هذا تناقضٌ. * * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 40
  },
  {
    "serial_number": "3428277",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 46,
    "volume_number": 1,
    "text": "المبحث الثاني تحقيق مناط مذهب الصحابي قد يتفق عالمان أو اثنان من طلاب العلم على أن مذهب الصحابي حجةٌ، لكن يختلفان في تنزيل ذلك، وهذا باب واسع، ويسميه الأصوليون بـ «تحقيق المناط». وتحقيق المناط يطلق على أمرين: منها: تنزيل المسائل على الوقائع: فتنزيل المسائل على الواقع قد يتنازع فيه اثنان، فيقول قائلٌ: يجب العمل بقول الصحابي، وفي مسألة أخرى لا يعمل به؛ وذلك لأنه خفى عليه قول الصحابي، أو يظنه مخالفا للنص وليس كذلك … إلخ؛ لذلك لا ننقض أصول العالم بعمله، قال عطاء: أضعف العلم أن تقول: رأيت، خرَّجه ابن عبد البر في «جامع بيان العلم وفضله» (1) . وقد يؤصِّل العالم أشياء، لكن يخالف ذلك عمليا، وهذا باب واسع لاختلاف الناس في الفهم والمدارك. وكتاب شيخ الإسلام «رفع الملام» مفيد في هذا للغاية، وأرجعه شيخ الإسلام إلى ما يلي: الأمر الأول: قد لا يكون بلغ العالم هذا الدليل، وفيما نحن بصدده لم يبلغه الأثر. الأمر الثاني: قد يكون بلغه، لكن فهم فهما آخر. الأمر الثالث: قد يظنه منسوخا (2) .",
    "foot_note": "1. انظر: «بيان جامع العلم وفضله» لابن عبد البر (1/ 778). \n2. انظر: «رفع الملام عن الأئمة الأعلام» لابن تيمية (ص:9).",
    "book_id": "271",
    "new_page_number": 41
  },
  {
    "serial_number": "3428278",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 47,
    "volume_number": 1,
    "text": "وكلام شيخ الإسلام على ما يتعلق بأحاديث النبي صلى الله عليه وسلم، والبحث كله جار في ثبوت النص، فكيف وقد يختلف اثنان في ثبوت الأثر، كما يختلفان في ثبوت الحديث، والخلاف في هذا واسع، والمهم أن نتفق على الأصول. *  * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 42
  },
  {
    "serial_number": "3428279",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 48,
    "volume_number": 1,
    "text": "المبحث الثالث الذين ضيَّعوا الاحتجاج بمذهب الصحابي ضيَّع الاحتجاج بمذهب الصحابي طائفتان: الطائفة الأولى: الظاهرية: إن للظاهرية أصولا محدثة، وهي خمسة أصول، ذكر ابن القيم في «إعلام الموقعين» (1) أربعة، وذكر ابن رجب في شرحه على البخاري (2) ورسالته «فضل علم السلف على علم الخلف» (3) أمرا خامسا، فالظاهرية ضلت بأصول خمسة، يهمني الأصل الخامس، وهو الذي ذكره ابن رجب في رسالته «فضل علم السلف على علم الخلف» وفي شرحه على البخاري، وأشار إليه ابن تيمية رحمه الله في المجلد الخامس من كتابه «منهاج السنة» (4) . وذلك أن الظاهرية يرون إحداث قول جديد في الفقه، فلو اختلف الصحابة على قولين، بل لو أجمع الصحابة على قول، فلا يبالي به الظاهرية ويرون جواز إحداث قول جديد؛ لذلك مذهبهم ضال، ومن الخطأ أن يُنسب إلى أهل الحديث. وقد بيَّن هذا الخطأ ابن رجب رحمه الله في رسالته «فضل علم السلف على علم الخلف» (5) . وللأسف، كثيرون ينسبون مذهب داود ومذهب ابن حزم لأهل الحديث، وقد",
    "foot_note": "1. انظر: «إعلام الموقعين» لابن القيم (3/ 98 - 107). \n2. انظر: «فتح الباري» لابن رجب (4/ 242)، و (6/ 105). \n3. انظر: «مجموع رسائل ابن رجب - رسالة فضل علم السلف على الخلف» (2/ 24). \n4. انظر: «منهاج السنة» لابن تيمية (5/ 178). \n5. انظر: «مجموع رسائل ابن رجب - رسالة فضل علم السلف على الخلف» (2/ 24).",
    "book_id": "271",
    "new_page_number": 43
  },
  {
    "serial_number": "3428280",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 49,
    "volume_number": 1,
    "text": "ذكر الشاطبي رحمه الله في موضعين من كتابه «الاعتصام» (1) وذكر قبله ابن العربي (2) أن الظاهرية مبتدعةٌ؛ لأنهم ضلوا في أصول عظيمة، وقد سبق بحث هذا في رسالة «حجية الإجماع وكشف بعض الشبهات» (3) . فالمقصود أن قول الظاهرية بجواز إحداث قول جديد هو الذي شاع اليوم عند بعض طلاب العلم، وصاروا يسمون ذلك «مذهب أهل الحديث»، ويقولون: نحن مُحدِّثون، ومعتنون بالحديث، ولا يبالون بأقوال الصحابة، لا في تفسير النص، ولا في ابتداء الحكم، أو يعملون به في تفسير النص، لكن لا يعملون به في ابتداء الحكم، وهذا من التأثر بمذهب الظاهرية. أما الطائفة الثانية التي ضلَّت في هذا الباب: فهم متعصبة المذاهب الأربعة؛ وذلك أن متعصبة المذاهب الأربعة لم يضلوا في باب الإعراض عن حجية قول الصحابي فحسب، بل حتى عن القرآن والسنة، وعن الإجماع والقياس، وكل أدلة الشريعة، فالمهم عندهم التمسك بالمذهب، وقد كان التعصب للمذاهب الأربعة ميِّتا ودُفن في عصور الأئمة المجددين الثلاثة ابن باز والألباني وابن عثيمين-رحمهم الله. وقد انطلقت بداية محاربة التعصب بقوة في عصر الإمام محمد بن عبد الوهاب ـ رحمه الله تعالى ـ، حيث حارب التعصب محاربةً شديدةً، كما ذكر ذلك في مواضع مختلفة، منها «الأصول الستة» (4) ، و «كتاب التوحيد» (5) ، وفي رسالته إلى عبد الله بن محمد بن",
    "foot_note": "1. انظر: «الاعتصام» للشاطبي (2/ 457)، و (3/ 198). \n2. انظر: «سير أعلام النبلاء» للذهبي (18/ 188 - 190) حيث اشتد ابن العربي على الظاهرية وابن حزم، وتعقبه الذهبي في ذلك. \n3. انظر: «حجية الإجماع وكشف بعض الشبهات» (ص:). \n4. انظر: «الأصول الستة مع كشف الشبهات- الأصل السادس» لابن عبد الوهاب (ص: 148). \n5. انظر: «كتاب التوحيد مع القول المفيد - باب من أطاع العلماء والأمراء في تحريم ما أحل الله أو تحليل ما حرمه فقد اتخذهم أربابا» لابن عبد الوهاب (2/ 149).",
    "book_id": "271",
    "new_page_number": 44
  },
  {
    "serial_number": "3428281",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 50,
    "volume_number": 1,
    "text": "عبد اللطيف الموجودة في «الدرر السنية» (1) ، وشدَّد، وبيَّن له حرمة التعصب وأنه لا يصح، وذكر له المناظرة العظيمة التي نقلها ابن عبد البر عن المزني في كتابه «جامع بيان العلم وفضله» (2) ، وأن كل ما يتحجج به المتعصبة، فهو حجةٌ عليهم لا لهم. وهذا الجمود المذهبي أضر كثيرًا، لكن كان للإمام محمد بن عبد الوهاب دور كبير في القضاء عليه، واشتهرت الدعوة النجدية السلفية بمحاربة التعصب المذهبي؛ لذلك إذا شرحوا المتون الحنبلية يشرحونها ويصوِّرون المسائل، لكن يبيِّنون ما ظهر لهم بالدليل. وقد يشرحون على المذهب، لكن يبيِّنون اختيارات شيخ الإسلام ابن تيمية وابن القيم، وما جاء في المذهب من البدع ينكرونها، كالتبرك والقول بالتوسل البدعي وهكذا … ، ثم يفتون بالدليل الشرعي. وإنما يدرسون المذهب ويتفقهون عليه من باب الوسيلة للتفقه، ولا يبالون بهذه الوسيلة إلى أن جاء الإمام ابن باز والإمام الألباني، والإمام ابن عثيمين، فقضوا على ما بقي من تراث التعصب، وأذكر أن جمعا من الحنابلة الموجودين عندنا في نجد، من المتعصبين للمذهب، في أول أمرهم ما كانوا هكذا، بل كانوا يدرسون من باب الوسيلة، ثم بعد ذلك تعصَّبوا … ؛وذلك لأنه ما بقي عندهم إلا هذا العلم - وهو التفقه على المذهب من باب الوسيلة-، فذهبت عليهم أعمارهم في هذا الطريق، فاستحيوا أن يقولوا للناس: لا نعلم، ففزعوا إلى التعصب لأنه أسهل لهم، وكثيرٌ من مشايخهم لا يحقق المسائل، ولا يستطيع تحقيقها، فإنْ حقق جملة من المسائل لم يحقق أكثرها؛ فلذلك فزعوا إلى التعصب المذهبي؛ لأنه أسرع طريق ليوصف الرجل بأنه فقيه، فاشتهر هذا إلى أن قضى عليها هؤلاء العلماء الثلاثة، حتى أذكر أنني- قبل أكثر من عشرين سنة - التقيت أحد متعصبة",
    "foot_note": "1. انظر: «الدرر السنية في الكتب النجدية» (1/ 35 وما بعدها). \n2. انظر: «جامع بيان العلم وفضله» لابن عبد البر (2/ 992).",
    "book_id": "271",
    "new_page_number": 45
  },
  {
    "serial_number": "3428282",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 51,
    "volume_number": 1,
    "text": "المذهب الحنبلي، فلما فعل أمْرًا، قلت له: إن الذي تفعله مخالفٌ للدليل، قال سبحان الله!، آخذ قولك، وأترك قول الإمام أحمد الذي يحفظ ألف ألف حديث؟ هذا هو التعصب بعينه؛ {إِن يَتَّبِعُونَ إِلَّا الظَّنَّ}. وحقيقة هذا الاعتراض نقض للتعصب المذهبي - لو عقل - وذلك أن يقال له: آخذ قول أحمد، وأترك قول عمر وعثمان وعلي؛ وهم الصحابة الكرام؟ ثم يأتي شافعي ويقول: آخذ قول أحمد، وأترك قول شيخه الشافعي؟ حتى سمعت أحد الشافعية قبل فترة ابتدأ أول درسه قائلًا: إن المؤلف الذي نريد شرح كتابه على المذهب الشافعي، ثم قال: بهذه المناسبة أدعو من كان حاضرًا عندنا من الحنابلة أن يرجعوا إلى المذهب الشافعي؛ لأن الشافعي شيخ أحمد، وهو ثمرة من ثمرات الشافعي، فارجعوا إلى مذهب الشافعي … هذا دَرْسٌ في التوحيد واستهله بالتعصب والتقليد؟!. وعودًا على خبر الرجل الذي قال: آخذ قولك، وأدع قول الإمام أحمد الذي يحفظ ألف ألف حديث؟ فإنه مع المباحثة قال: أنا درست المذاهب الأربعة، وأفقهها جيدًا، لكن لا أترك مذهب أحمد، وقال: وحضرت عند الشيخ السعدي، وكل قول قاله الشيخ السعدي مخالف لقول أحمد، أضرب به عرض الحائط، ثم حضرت سنيات عند الشيخ ابن عثيمين، فكل قول قال ابن عثيمين يخالف مذهب أحمد، أضرب به عرض الحائط. أرأيتم كيف التعصب؟ إن هذا الرجل لم يصل إلى ما وصل إليه مباشرةً وإنما أولا: تفقه على المذهب، ثم ثانيا: عاب اتباع الدليل؛ إما لأنه صعب عليه أو لأن أحد مشايخه رباه على التعصب باسم التأصيل في الفقه … الخ.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 46
  },
  {
    "serial_number": "3428283",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 52,
    "volume_number": 1,
    "text": "وقد زرت أحد الناس قبل سنوات، بعد أن ولي ولاية شرعية، فجرت المباحثة في مسائل العلم، فإذا اشتد الخلاف يفتح «الروض»، ويقرأ المسألة، ثم يقول: صاحب «الروض» يقول كذا، ما عنده قال صلى الله عليه وسلم … !! ومن كلمات شيخنا ابن باز ـ رحمه الله تعالى ـ الكثيرة، وقد سمعتها منه مرارًا، وسمعها غيري أكثر وأكثر، أنه إذا قيل له في مسألة: قال ابن تيمية كذا، كيف تخالف ابن تيمية؟ قال: هو نبي؟ العبرة بالدليل، ويكرر هذا كثيرا رحمه الله. وقد أجريت معه مقابلة فأخبر عن نفسه أنه تفقه على المذهب الحنبلي، -ثم قال-: لكن لا أعرف عن نفسي يوما ما، أني أفتيت بغير الدليل، سواء وافق مذهب أحمد، أو خالفه (1) . إنه ينبغي أن نكون وسطا؛ فنتفقه على المذاهب، لكن لا نترك الاعتماد على الدليل، ولا نعيب هذا، بل نجمع بين الأمرين؛ لأن الوقت لا يتسع، فممكن تسير بطريقة تتفقه فيها على مذهب من المذاهب الأربعة في الفقه، وتتصور المسائل، وفي الوقت نفسه تدرسه بالدليل على موثوق؛ لأنه ليس هناك وقت، لم يعد الناس كما كانوا قبل يختمون «الزاد» في سنة يدرسونه في درس يومي يدرسونه رويدًا رويدًا، فلو وجد من يختم «الزاد» في سنة رويدًا رويدًا، ويصوِّر مسائله، كان من المفيد أن يدرس عليه «الزاد»، ثم بعد ذلك ينطلق في الاجتهاد ومعرفة الدليل لا أن يتوقف عند هذا الحد. وواقع كثيرين أنهم يبدؤون بالمتن المختصر، ثم بالمتوسط، ثم بالمطول، وهم على المذهب، فيدرسون هذا عشر سنين أو خمس عشرة سنة، ثم يفترون عن النظر",
    "foot_note": "1. انظر قريبًا منه في: «مجموع فتاوى ورسائل الشيخ ابن باز - لقاء مع صحيفة الراية السودانية» بعناية الشويعر (4/ 166).",
    "book_id": "271",
    "new_page_number": 47
  },
  {
    "serial_number": "3428284",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 53,
    "volume_number": 1,
    "text": "في الدليل ولم يريدوا أن يوصفوا بالجهل، فقالوا: نحن الحنابلة فعابوا على غيرهم ممن يدرس بالدليل، ثم ازدادوا تعصُّبا، ويبررون لتعصبهم بأمور منها: الأمر الأول: قوله: «أأنت أعلم من أحمد؟»، على أن هذا القول المذهبي ممكن لم يقل به أحمد، لذا قال الإمام محمد بن عبد الوهاب: وأكثر ما في «الإقناع» و «المنتهى» مخالفٌ لنصوص أحمد (1) ، بل ممكن قال بخلافه، أو نسب إليه تخريجا، وليس منصوصا، والتخريج مختلف في نسبته إلى الإمام ومع ذلك يقال: قال به أحمد، ولو دققت لعلك لا تجد أحمد قال به، بل تجد أحمد قال بخلافه. الأمر الثاني: قوله: لم تبلغ درجة الاجتهاد حتى تقول: قال الله كذا، وقال النبي صلى الله عليه وسلم كذا، وبقوله هذا رجعنا إلى إغلاق باب الاجتهاد، وقد لا يقولون بإغلاق باب الاجتهاد صراحة لكن يمنعون الاجتهاد بحجة أنك لم تبلغه ويَدعُون للتقليد والتعصب. وجواب هذا أن يقال: إن الاجتهاد يتجزَّأ، وقد درسنا آلة الاستدلال والاستنباط، وهذه المسألة درستها، وظهر لي كذا وكذا، والآلة الاجتهادية تقول كذا وكذا، فبأيِّ حجة عند الله أخالف ذلك؟ وأخيرًا: فكما يحارب التعصب للظاهرية باسم أهل الحديث، الذي بدأ يقل - ولله الحمد -، وإن كان لا يزال فكذلك يحارب التعصب للمذاهب. وقد أصبح هؤلاء المتعصبون أصنافا وأحزابا يحارب بعضهم بعضا؛ حتى إني رأيت أحدهم في بلد ما يعيب على الذين يشرحون المذهب الحنبلي على طريقة فلان …",
    "foot_note": "1. انظر: «حاشية الروض المربع» لابن قاسم (1/ 17 - 18).",
    "book_id": "271",
    "new_page_number": 48
  },
  {
    "serial_number": "3428285",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 54,
    "volume_number": 1,
    "text": "يقول هذا الرجل: كيف يشرح المذهب الحنبلي على طريقة الشيخ محمد بن عبد الوهاب هؤلاء أفسدوا المذهب، نريد المذهب كما هو: أي على طريقة أهل الشام القديمة التي اشتهرت عند أهل الشام، ومن أصحاب المذهب مَن يَردُّ على ذاك الرجل، ويقول: إن دعوتك هذه تفتح باب البدع؛ لأن الإمام محمد بن عبد الوهاب نقَّى المذهب من الأقوال البدعية مستندا في ذلك إلى قول شيخ الإسلام ابن تيمية وابن القيم والسلف، وهكذا .. . *  * *",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 49
  },
  {
    "serial_number": "3428286",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 55,
    "volume_number": 1,
    "text": "خاتمة أسأل الله الذي لا إله إلا هو أن يعلمنا ما ينفعنا، وأن ينفعنا بما علَّمنا، وأن يهدينا إلى الصراط المستقيم، وأن يحينا جميعا على التوحيد والسنة، وأن يميتنا على ذلك، وأن يجنبنا الفتن، ما ظهر منها وما بطن.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 50
  },
  {
    "serial_number": "3428287",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الانتصار في حجية قول الصحابة الأخيار",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 56,
    "volume_number": 1,
    "text": "أهم النتائج المستخلصة من هذه الرسالة ما يلي: 1 - تحرير محل النزاع في حجية قول الصحابة في أمور أربعة. 2 - قول الصحابة حجة سواء اشتهر أو لم يشتهر. 3 - حجية قول الصحابة من الظن الغالب. 4 - من أدلة حجية قول الصحابة أدلة حجية الإجماع. 5 - للصحابة مدارك نشاركهم فيها ومدارك ينفصلون عنا. 6 - قول الصحابة حجة سواء في ابتداء حكم أو تفسير نص بتخصيص أو تقييد أو تبيين. 7 - طريقة الجمع بين أقوال الصحابة عند الاختلاف. 8 - قول الخلفاء الراشدين مقدم على غيرهم. 9 - الظاهرية لا يرون حجية قول الصحابة وتأثر بعض أهل العلم بهم. 10 - تبديع أهل العلم للظاهرية وأنهم ليسوا من أهل الحديث. 11 - كما أن الظاهرية خطأ فالتعصب المذهبي خطأ مثله.",
    "foot_note": "None",
    "book_id": "271",
    "new_page_number": 51
  }
]