[
  {
    "text": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)\nAuthor: أبو محمد عز الدين عبد العزيز بن عبد السلام بن أبي القاسم بن الحسن السلمي الدمشقي الملقب بسلطان العلماء\nYear: 660",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "category_id": "24",
    "category": "Prophetic Biography",
    "new_page_number": 1
  },
  {
    "text": "sn: 5887\nbook_title: بداية السول في تفضيل الرسول صلى الله عليه وسلم\nbook_link: https://shamela.ws/book/348\nbook_id: 348\nauthor_name: أبو محمد عز الدين عبد العزيز بن عبد السلام بن أبي القاسم بن الحسن السلمي الدمشقي الملقب بسلطان العلماء\nauthor_year: 660\nnickname: أبو محمد\nauthor_link: https://shamela.ws/author/126\nauthor_ID: 126\neditor: تحقيق: محمد ناصر الدين الألباني\npublisher: المكتب الإسلامي - بيروت\nedition: الرابعة - 1406\npages: 70\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: السيرة النبوية\ncategory_id: 24",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "category_id": "24",
    "category": "Prophetic Biography",
    "new_page_number": 2
  },
  {
    "serial_number": "5128768",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Prophetic Biography. Book: Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH). Author: Abd al-Aziz bin Abd al-Salam bin Abi al-Qasim bin al-Hasan al-Sulami al-Dimashqi, Izz al-Din, titled Sultan of the Scholars (Died 660 AH). Publisher: The Islamic Office - Beirut. Edition: Fourth - 1406. Verification: Muhammad Nasir al-Din al-Albani. Number of Pages: 70 [Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH). Author: Abd al-Aziz bin Abd al-Salam bin Abi al-Qasim bin al-Hasan al-Sulami al-Dimashqi, Izz al-Din, titled Sultan of the Scholars (Died 660 AH). Publisher: The Islamic Office - Beirut. Edition: Fourth - 1406. Verification: Muhammad Nasir al-Din al-Albani. Number of Pages: 70 [Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abd al-Aziz bin Abd al-Salam bin Abi al-Qasim bin al-Hasan al-Sulami al-Dimashqi, Izz al-Din, titled Sultan of the Scholars (Died 660 AH). Publisher: The Islamic Office - Beirut. Edition: Fourth - 1406. Verification: Muhammad Nasir al-Din al-Albani. Number of Pages: 70 [Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nVerification: Muhammad Nasir al-Din al-Albani. Number of Pages: 70 [Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\n[Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 3
  },
  {
    "serial_number": "5128769",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 1,
    "volume_number": 1,
    "text": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl. Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH). Authored by the Scholar Al-Izz bin Abd al-Salam al-Sulami. Verification by Muhammad Nasir al-Din al-Albani. The Islamic Office, 4th Edition - 1406 AH.",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 4
  },
  {
    "serial_number": "5128770",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "(Authentic/Sahih) His saying, peace be upon him: \"For every Prophet there is an answered supplication which he invokes and is answered for him. I have reserved my supplication as intercession for my nation (Ummah) on the Day of Resurrection.\" [37]\n\n(Authentic/Sahih) Narrated by Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"There is no Prophet among the Prophets but was given signs [miracles] the likes of which caused mankind to believe in him. Indeed, what I was given is a Revelation that Allah revealed to me, so I hope that I will be the one with the most followers among them on the Day of Resurrection.\"",
    "foot_note": "None\n\nNone",
    "book_id": "348",
    "new_page_number": 5
  },
  {
    "serial_number": "5128772",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "(Authentic/Sahih) Narrated by Jabir bin Samura, who said: The Messenger of Allah, peace be upon him, said: \"I surely know a stone in Mecca that used to greet me before I was sent [as a Prophet]; I surely recognize it now.\" [39]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 6
  },
  {
    "serial_number": "5128773",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "(Authentic/Sahih) Narrated by Anas bin Malik and Ibn Abbas, may Allah be pleased with them both, that the Prophet, peace be upon him, used to preach while leaning on a tree trunk. When the pulpit was made, he went to the pulpit. The trunk then moaned, so he came to it and embraced it, and it calmed down. He said: \"Had I not embraced it, it would have moaned until the Day of Resurrection.\" [40]\n\n(Authentic/Sahih) Narrated by Anas bin Malik that he said: I saw the Messenger of Allah, peace be upon him, when the time for the Asr prayer approached. People sought water for ablution but could not find it. Then, water for ablution was brought to the Messenger of Allah, peace be upon him. The Messenger of Allah, peace be upon him, placed his hand in that vessel and ordered the people to perform ablution from it. He said: I saw water springing from beneath his fingers, and the people performed ablution until the very last of them had done so.",
    "foot_note": "None\n\nNone",
    "book_id": "348",
    "new_page_number": 7
  },
  {
    "serial_number": "5128775",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "Authentic due to its multiple chains (Sahih bi ta'addud turuqihi). Narrated by Asim bin Umar bin Qatadah, from his father, from his grandfather Qatadah ibn al-Nu'man, that his eye was injured on the day of Badr, and his pupil flowed out onto his cheek. They wanted to cut it off, so they asked the Prophet, peace be upon him, and he said: \"No.\" He then called for him and pressed his eye back with his palm, and it became such that he did not know which of his two eyes had been injured. [41]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 8
  },
  {
    "serial_number": "5128776",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "(Authentic/Sahih) Narrated by Abu Said al-Khudri directly attributable to the Prophet (Marfu') with the wording: Allah Almighty will say on the Day of Resurrection: \"O Adam.\" He will say: \"Here I am, our Lord, and at Your service.\" Then a voice will call out: \"Indeed, Allah commands you to bring out from your descendants a delegation to the Fire.\" He will say: \"O Lord, what is the delegation to the Fire?\" He will say: \"From every thousand\" - I think he said - \"nine hundred and ninety-nine.\" At that time, the pregnant woman will drop her load, the child will turn grey, and you will see people as if they are drunk, yet they are not drunk, but the punishment of Allah is severe. This distressed the people until their faces changed color. The Prophet, peace be upon him, then said: \"From Gog and Magog are nine hundred and ninety-nine, and from you is one. Furthermore, among the people, you are like a black hair on the side of a white ox, or like a white hair on the side of a black ox. And I surely hope that you will be one-quarter of the people of Paradise.\" So we said: \"Allahu Akbar (God is Great).\" Then he said: \"One-third of the people of Paradise.\" We said: \"Allahu Akbar.\" Then he said: \"Half of the people of Paradise.\" We said: \"Allahu Akbar.\" [43]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 9
  },
  {
    "serial_number": "5128777",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 63,
    "volume_number": 1,
    "text": "(Very Weak) Narrated by Abu Umamah who said: The Messenger of Allah, peace be upon him, said: \"My Lord presented to me that He would make the valley of Mecca into gold for me. I said: No, O Lord, but let me be satisfied one day and hungry one day. When I am hungry, I will humble myself before You and remember You, and when I am satisfied, I will praise You and thank You.\" [63]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 10
  },
  {
    "serial_number": "5128778",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 64,
    "volume_number": 1,
    "text": "(Authentic/Sahih) Narrated by Abu Huraira who said: Gabriel sat with the Prophet, peace be upon him, and looked at the sky, and behold, an angel was descending. Gabriel said to him: \"This angel has never descended since he was created until this hour.\" When he descended, he said: \"O Muhammad, your Lord has sent me to you; [shall He make you] a King-Prophet or a Slave-Messenger?\" Gabriel said to him: \"Humble yourself before your Lord, O Muhammad.\" So the Prophet, peace be upon him, said: \"No, rather a Slave-Messenger.\" [64]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 11
  },
  {
    "serial_number": "5128779",
    "category_id": "24",
    "category": "Prophetic Biography",
    "book_title": "Bidāyat al-Sūl fī Tafḍīl al-Rasūl (The Beginning of the Quest in Preferring the Messenger PBUH)",
    "edition": "Fourth - 1406",
    "publisher": "The Islamic Office (Al-Maktab Al-Islami) - Beirut",
    "page_number": 70,
    "volume_number": 1,
    "text": "Authentic (Sahih) Narrated by Ibn Umar who said: The Messenger of Allah, peace be upon him, said: \"Allah will never gather my nation (Ummah) upon misguidance, and the Hand of Allah is over the Congregation (Jama'ah).\" [70]",
    "foot_note": "None",
    "book_id": "348",
    "new_page_number": 12
  }
]