[
  {
    "text": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them\nAuthor: أبو بكر أحمد بن محمد بن هارون بن يزيد الخلال\nYear: 311",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 1
  },
  {
    "text": "sn: 1995\nbook_title: الحث على التجارة والصناعة والعمل، والإنكار على من يدعي التوكل في ترك العمل والحجة عليهم في ذلك\nbook_link: https://shamela.ws/book/805\nbook_id: 805\nauthor_name: أبو بكر أحمد بن محمد بن هارون بن يزيد الخلال\nauthor_year: 311\nnickname: أبو بكر\nauthor_link: https://shamela.ws/author/284\nauthor_ID: 284\neditor: د. فواز محمد العوضي\npublisher: بدون ناشر (على نفقة المحقق)\nedition: الأولى، 1443 هـ - 2022 م\npages: 60\nvolumes: Null\npagination: [ترقيم صفحات الكتاب موافق للمطبوع]\ncategory: كتب السنة\ncategory_id: 6",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 2
  },
  {
    "serial_number": "1261469",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sunnah Books\nBook: Al-Hath 'ala al-Tijarah wa al-Sina'ah wa al-'Amal (Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them)\nAuthor: Abu Bakr Ahmad bin Muhammad bin Harun Al-Khallal\nEditor: Dr. Fawaz Muhammad Al-Awadi\nCountry of Publication: Kuwait\n\nBook: Al-Hath 'ala al-Tijarah wa al-Sina'ah wa al-'Amal\nAuthor: Abu Bakr Ahmad bin Muhammad bin Harun Al-Khallal\nEditor: Dr. Fawaz Muhammad Al-Awadi\nCountry of Publication: Kuwait\n\nAuthor: Abu Bakr Ahmad bin Muhammad bin Harun Al-Khallal\nEditor: Dr. Fawaz Muhammad Al-Awadi\nCountry of Publication: Kuwait\n\nEditor: Dr. Fawaz Muhammad Al-Awadi\nCountry of Publication: Kuwait\n\nCountry of Publication: Kuwait\n\nCountry of Publication: Kuwait\n\n\n\n[The book's page numbering corresponds to the printed version]",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 3
  },
  {
    "serial_number": "1261470",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Book of\nEncouragement to Trade, Industry, and Work\nAnd Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work\nAnd the Argument Against Them in That\n\nAuthored by Abu Bakr Ahmad bin Muhammad bin Harun Al-Khallal (May Allah have mercy on him)\nFrom the issues of the Revered Imam Abu Abd Allah Ahmad bin Muhammad bin Hanbal (May Allah be pleased with him and please him)\n(234 - 311 AH)\n\nCared for by Fawaz Muhammad Al-Awadi",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 4
  },
  {
    "serial_number": "1261471",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 2,
    "volume_number": 1,
    "text": "All Rights Reserved\nFirst Edition\n14 Rajab 1443 AH\n15/2/2022 CE\n\nContact: fmd1430@gmail.com\nISBN: 978-9921-0-2135-6",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 5
  },
  {
    "serial_number": "1261472",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, Lord of the Worlds, and may Allah bless our Prophet Muhammad and all his family and companions.\nTo proceed...\nThis is the book of Al-Khallal, may Allah Almighty have mercy on him, in which he mentioned Hadiths and Athar (narrations) from the Companions, may Allah be pleased with them, and the Tabi'in (Successors) and those who came after them regarding the encouragement to earn a livelihood and the prohibition of asking (begging) from people.\nIn it, he refuted the Sufis, ascetics, and worshipers who deviated from the guidance of the Prophet, peace and blessings be upon him, and the guidance of the Companions, may Allah be pleased with them, in understanding the reality of what Allah sent His Prophet, peace and blessings be upon him, with, regarding his encouragement to earn and seek provision, and his warning against asking people.\nThe Prophet, peace and blessings be upon him, took a pledge from the Companions, may Allah be pleased with them, that they would not ask people for anything (1). And there is no Prophet among the Prophets except that he says to his people: {And I do not ask you for it any payment. My payment is only from the Lord of the worlds} [Ash-Shu'ara: 145]. So they do not ask people for wages or money, but rather they ask them for guidance.\nSects have deviated in this understanding. Among them are those who took the path of consuming people's wealth unjustly in the form of donations and charities, as Allah Almighty said: {O you who have believed, indeed many of the scholars and the monks devour the wealth of people unjustly and avert [them] from the way of Allah} [At-Tawbah: 34]. Sheikh al-Islam...",
    "foot_note": "1. Narrated by Muslim (1043).",
    "book_id": "805",
    "new_page_number": 6
  },
  {
    "serial_number": "1261473",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 4,
    "volume_number": 1,
    "text": "...Ibn Taymiyyah, may Allah have mercy on him, said in the interpretation of this verse: \"Thus it becomes clear that many of the scholars, monks, learned men, and worshipers consume people's wealth unjustly and avert from the way of Allah. And that the scholar who holds beliefs in issues of report and knowledge, and the worshiper who worships for himself, if they do not follow the legislated path, otherwise each of them is following his own desire\" (1). For this reason, Sufyan bin Uyaynah said: \"They used to say: Whoever becomes corrupt among our scholars has a resemblance to the Jews, and whoever becomes corrupt among our worshipers has a resemblance to the Christians\" (2).\nTherefore, you find many of these political Islamic movement groups competing in collecting charities. They have issued invalid fatwas; some allow investment of Zakat, some allow paying Zakat for elections, some allow building mosques and schools with Zakat funds, and there are scholars who wait for their financial percentage from the collection of charities.\nAmong those groups are people who took the path of seeking knowledge and abandoned seeking livelihood, thinking that seeking livelihood contradicts seeking knowledge, or that it is a deficiency in the description of a student of knowledge, or they believe they have a right to people's money, so they wait for someone to give them charity. These are most similar to the Sufi worshipers. Whoever looks at the state of the Companions, may Allah be pleased with them, knows the invalidity of what these people are upon.",
    "foot_note": "1. Jawab al-I'tiradat al-Misriyyah 'ala al-Fatwa al-Hamawiyyah (p. 99).\n2. Majmu' al-Fatawa by Sheikh al-Islam Ibn Taymiyyah (1/197).",
    "book_id": "805",
    "new_page_number": 7
  },
  {
    "serial_number": "1261474",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 5,
    "volume_number": 1,
    "text": "Here is the inspired narrator (Muhaddith), the Commander of the Faithful, Umar bin Al-Khattab, may Allah be pleased with him, taking turns with an Ansari in seeking livelihood (1). And here is Abdur-Rahman bin Awf, may Allah be pleased with him, who is one of the Ten Promised Paradise, saying: \"Show me the way to the market\" (2).\nWhoever adopts the Sunnah of the Prophet, peace and blessings be upon him, and is guided by the guidance of the Companions, may Allah be pleased with them, in seeking livelihood and trade, Allah Almighty will make him independent of what is in people's hands.\nOur Sheikh Muhammad Al-Anjari, may Allah preserve him and grant him success in all good, has great efforts in highlighting this subject, and he has an explanation of this treatise. We ask Allah Almighty to enrich us with His lawful provision over His prohibited, and with His bounty over anyone else, and to enlighten us in the matter of our religion, and guide us to His straight path.\n\nDescription of the Manuscripts:\n\nFirst: A clear copy within a collection from the Al-Zahiriyah Library, number (3854), folios (25 - 40), narrated by Muwaffaq al-Din Ibn Qudamah al-Maqdisi, heard from him in the year 614 AH. It is one of the most correct copies, and it has many hearing certificates (Sama'at). It is a complete copy, so reliance was placed upon it. The Kuwaiti Ministry of Awqaf has a copy of it under number (69447/7), and I symbolized it as (Al-Asl / The Original).",
    "foot_note": "1. Narrated by Al-Bukhari (4913) and Muslim (1479).\n2. Narrated by Al-Bukhari (2049).",
    "book_id": "805",
    "new_page_number": 8
  },
  {
    "serial_number": "1261475",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 6,
    "volume_number": 1,
    "text": "Second: A clear copy within a collection from the Al-Zahiriyah Library, number (3852), folios (101 - 113), narrated by Abdul Ghani bin Abdul Wahid bin Surur al-Maqdisi. Abdul Ghani heard it from Abdullah bin Mansur al-Mawsili in the year 564 AH. The last plate of the treatise has fallen from it. The Kuwaiti Ministry of Awqaf has a copy of it under number (69445/6), and I symbolized it as (Z).\nThe title of the treatise uses the word \"Al-Radd\" (Refutation) instead of \"Al-Inkar\" (Denial).\n\nThird: A clear copy within a collection, photocopied from the Kuwaiti Ministry of Awqaf under number (345/6). It is a complete copy written in the year 1333 AH. In the author's name, there is the addition of the title \"Al-Imam Al-Mubajjal\" (The Revered Imam).\n\nFourth: A clear photocopied copy from the Berlin Library under number (1807). It is a complete copy written in the year 1335 AH. It contains errors and omissions.\n\nFifth: A copy within a collection photocopied from King Saud University in Riyadh under number (1928). It is a copy written in the year 1339 AH. It is a complete copy, and it has much obliteration.\n\nThese last three copies were copied from the first copy narrated by Ibn Qudamah. I will point out important additions and variations in copies if needed.\nThere are two printed editions of the treatise: Al-Asima edition in 1407 AH, and Dar Al-Bashair Al-Islamiyah in 1415 AH. I have noted some errors occurring in them. I also wrote biographies for some narrators whose identification is needed.",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 9
  },
  {
    "serial_number": "1261476",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 7,
    "volume_number": 1,
    "text": "Whatever Hadith or Athar of a Companion appeared in the treatise, I have clarified its ruling regarding its chain of narration (Isnad).\n[Image of the first page of the First Manuscript (The Original)]",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 10
  },
  {
    "serial_number": "1261477",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 8,
    "volume_number": 1,
    "text": "[Image of the first page of the Second Manuscript (Z)]",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 11
  },
  {
    "serial_number": "1261478",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 9,
    "volume_number": 1,
    "text": "[Image of the first page of the Fifth Manuscript (King Saud University)]",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 12
  },
  {
    "serial_number": "1261479",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 10,
    "volume_number": 1,
    "text": "[Image of the first page of the Fourth Manuscript (Berlin)]",
    "foot_note": "None",
    "book_id": "805",
    "new_page_number": 13
  },
  {
    "serial_number": "1261480",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 11,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\n1 - My grandfather, the unique Imam, the scholar, Al-Muwaffaq Abu Muhammad Abdullah bin Ahmad bin Muhammad bin Qudamah Al-Maqdisi, may Allah be pleased with him, informed us, by reading to him while I was listening more than once outside Damascus, in the year fourteen and then in the year six hundred and twenty [620 AH], saying:\nAbu Muhammad Abdullah bin Mansur bin Hibatullah Al-Mawsili informed us in Dhu al-Qi'dah of the year five hundred and sixty-four [564 AH], Abu Al-Hussein Al-Mubarak bin Abdul Jabbar bin Ahmad Al-Qasim Al-Sayrafi informed us by reading to him while I was listening, Abu Al-Qasim Abdul Aziz bin Ali bin Ahmad bin Al-Fadl Al-Azji informed us in Jumada al-Akhirah of the year four hundred and forty-three [443 AH], Abu Bakr Abdul Aziz bin Ja'far bin Ahmad bin Yazdad bin Ma'ruf, and the jurist known as Ghulam Al-Khallal informed us by license (Ijazah).\nAl-Azji said: And it was read to Abu Al-Qasim Ibrahim bin Muhammad bin Ja'far Al-Saji while I was listening: Abu Bakr Abdul Aziz told us, saying: Abu Bakr Ahmad bin Muhammad bin Harun Al-Khallal told us, Abu Bakr Al-Marrudhi (1) told us, saying: I heard a man say to Abu Abd Allah (Imam Ahmad), may Allah have mercy on him: \"I have sufficiency (wealth).\" He said: «Stick to the market; through it you will uphold ties of kinship and visit (the sick/needy)» (2).",
    "foot_note": "1. In Al-Asima edition: Al-Marwazi. This is an error and its editor followed it. See Tabaqat Al-Hanabila (1/137). Ibn Makula said in Al-Ikmal (7/240): Chapter of Al-Marwazi and Al-Marrudhi: As for Al-Marwazi with 'Zai', it refers to everyone attributed to Marw al-Shahijan, and they are many, including Abdullah bin Al-Mubarak, Ahmad bin Hanbal, Yahya bin Ma'in, Ishaq bin Rahwayh, Ishaq bin Abi Isra'il, Suwayd bin Nasr, Al-Nadr bin Muhammad and many others, and they have histories. As for Al-Marrudhi with the dotted 'Dhal', it is an attribution to Marw al-Rudh, and most often it is said Al-Marurudhi, and sometimes Al-Marrudhi; among them is Abu Hamid Ahmad bin Bishr bin Amir Al-Marrudhi Al-Amiri, the jurist author of classifications in the Shafi'i school.\n2. See Kitab al-Tawakkul by Abu Ya'la (p. 55). In Hilyat al-Awliya (3/11) from Hammad bin Zaid, he said: Ayyub said to me: Stick to your market, for you will continue to be generous to your brothers as long as you do not need them. In Shu'ab al-Iman (2/451) from Ayyub al-Sakhtiyani, he said: Abu Qilaba said to me: Stick to your market, for in it is independence from people and righteousness in religion.",
    "book_id": "805",
    "new_page_number": 14
  },
  {
    "serial_number": "1261481",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 12,
    "volume_number": 1,
    "text": "2 - (Abdul Aziz bin Ja'far told us, he said Al-Khallal told us) (1) and Abu Bakr (Al-Marrudhi) (2) informed us, saying: A man from the companions of Ibn Aslam said to Abu Abd Allah (Imam Ahmad), may Allah have mercy on him: \"Do you see that I should work?\" He said: «Yes, and give the surplus in charity to your relatives» (3).\n3 - And Abu Bakr Al-Marrudhi informed us, saying: I heard Abu Abd Allah, may Allah have mercy on him, say: \"I have ordered them,\" meaning his son, \"to frequent the market and to engage in trade.\" And he said: It has been narrated from Aisha, may Allah Almighty be pleased with her, from the Prophet, peace and blessings be upon him, that he said: «Indeed, the best of what a man eats is from his earnings» (4).\n4 - Muhammad bin Al-Hussein informed me that Al-Fadl bin Ziyad told them, saying: I heard Abu Abd Allah ordering [people to go to] the market and saying: «How excellent is independence from people» (5).",
    "foot_note": "1. What is between parentheses is from (Z), Berlin, and Awqaf copies.\n2. Addition from King Saud University copy.\n3. Added in Al-Furu' by Ibn Muflih (6/180): \"and benefit yourself with it.\"\n4. A Hasan (good) Hadith due to its supporting evidences: Narrated by Ahmad (40/34), Abu Dawood (3528), Al-Tirmidhi (1358), Al-Nasa'i in Al-Kubra (6000), Ibn Majah (2290), and others, via Amara bin Umair, from his paternal aunt, that she asked Aisha, may Allah be pleased with her. This chain is weak due to the anonymity of Amara's aunt. It has another chain via Ibrahim, from Al-Aswad, from Aisha similarly, narrated by Ahmad (40/179), Ibn Majah (2137), and others. Sufyan Al-Thawri said - as in the Introduction to Al-Jarh wa Al-Ta'dil (1/69) -: This is an illusion (Wahm). Abu Zur'ah agreed with him as in Al-Ilal by Ibn Abi Hatim (1396). Al-Bayhaqi said in Al-Sunan Al-Kubra (7/480): And it is not preserved with this chain. Al-Albani declared it authentic in Sunan Abu Dawood. The Hadith has a basis in Sahih Al-Bukhari (2072) from Al-Miqdam, may Allah be pleased with him, from the Messenger of Allah, peace and blessings be upon him, who said: «No one has ever eaten food better than to eat from the work of his own hand, and indeed the Prophet of Allah David, peace be upon him, used to eat from the work of his own hand.»\n5. Ibn Abi Shaybah narrated (10765): From Umm al-Darda regarding Abu al-Darda: \"If I am in need after you, should I eat from charity?\" He said: \"No, work and eat.\" She said: \"If I am too weak to work?\" He said: \"Pick grains (glean), and do not eat charity.\"",
    "book_id": "805",
    "new_page_number": 15
  },
  {
    "serial_number": "1261482",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 13,
    "volume_number": 1,
    "text": "5 - Muhammad bin Musa informed me, saying: I heard Ali bin Ja'far say: My father went to Abu Abd Allah, may Allah have mercy on him, and took me with him. He said to him: \"O Abu Abd Allah, this is my son.\" So he prayed for me and said to my father: «Make him stick to the market, and keep him away from his peers (idlers)» (1).\n6 - Zakariya bin Yahya Abu Yahya Al-Naqid informed me, saying: I asked Abu Abd Allah, may Allah have mercy on him, saying: \"I work for hire, and my parents want me to take a shop for myself.\" He said: «So take a shop; there might be a funeral, there might be a sick person.» I said: \"It is hard work, and the partner - I mean - does not stand [for duties].\" He said: «Then return it [referring to hire or shop].» Zakariya bin Yahya said: He means in all of this that he encourages work and trade.\n7 - Abdul Malik Al-Maymuni informed me that Abu Abd Allah, may Allah have mercy on him, said: «A man said to Al-Sari bin Yahya - who used to trade by sea -: \"Do you ride the sea in pursuit of the world?!\" He said: \"I love to be independent from the likes of you (2) among people\"» (3).\n8 - Yusuf bin Musa informed me, saying: It was said to Abu Abd Allah, may Allah have mercy on him: Tawus said: \"O Allah, prevent me from wealth and children\" (4). He said: «This has been narrated",
    "foot_note": "1. Abdul Razzaq narrated in Al-Musannaf with a Sahih chain (7/387) from Ibn Jurayj, saying: I heard Ata' say: Let a man hire out his son for work if his father is in need.\n2. In Berlin copy: Adrabika (your types).\n3. And in Al-Ilal wa Ma'rifat al-Rijal by Ahmad, narration of his son Abdullah (2/42): .. from Said bin Al-Musayyib: The Companions of the Prophet, peace and blessings be upon him, used to trade by sea to the Romans, among them Talhah bin Ubaidullah and Said bin Zaid. And Samrah said: The Companions of the Messenger of Allah, peace and blessings be upon him, used to trade by sea to the Levant. Narrated by Al-Tabarani in Al-Awsat (3317).\n4. Saying of Tawus: Narrated by Ibn Abi Shaybah (10/192) and added: \"And grant me (faith) and deeds.\" As indicated by the investigator in the footnote in some copies. And Abu Nu'aym narrated it in Al-Hilya (4/9) with the wording: \"O Allah, deprive me of abundance of wealth and children.\"",
    "book_id": "805",
    "new_page_number": 16
  },
  {
    "serial_number": "1261483",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 14,
    "volume_number": 1,
    "text": "from Tawus; who was like Tawus?» Then he said: «Wealth is from well-being» (1).\n9 - Yaqub bin Yusuf (Abu Bakr) (2) Al-Mutawwi'i informed me, saying: I heard Abu Bakr bin (Janad) (3) say: I heard Al-Jassasi (4) say: I asked Ahmad bin Hanbal, may Allah have mercy on him, saying: \"Four dirhams: A dirham from righteous trade, a dirham from the connection (gifts) of brothers, a dirham from the wage of teaching (5), and a dirham from the revenue of Baghdad?\" He said: «The most beloved of them to me is from righteous trade, and the most disliked of them to me is that which is from the connection of brothers. As for the wage of (teaching) (6); if he needs it, let him take it (7). And as for the revenue of Baghdad, you know it; why do you ask me about it?» (8).\n10 - Abdul Malik Al-Maymuni informed me, saying: Abu Abd Allah, may Allah have mercy on him, said to me - and he encouraged me to (stick to) (9) the estate/farm - and said: «How wasted is the estate if",
    "foot_note": "1. Ibn Abi Shaybah narrated with a Sahih chain (22614) saying: Waki' told us, from Hammad bin Zaid, from Ayyub, he said: Abu Qilaba used to urge me to engage in craft and seek [livelihood], and Abu Qilaba said: Wealth is from well-being.\n2. Dropped from (Z).\n3. Established from (Z) and it is correct. As for the other copies, it came with the name Al-Khabbaz which is a misspelling.\n4. He is Musa bin Isa Al-Jassas Al-Baghdadi. Tabaqat Al-Hanabila (2/403).\n5. In Original: Al-Mu'allim (Teacher).\n6. Established from (Z). In other copies (The Teacher, Teaching) and the word (upon) came from the corrector of the Berlin copy.\n7. Narrated with a Sahih chain: Abdul Razzaq Al-San'ani (8/115) and the wording is his: from Al-Thawri, and Ibn Abi Shaybah (7/218) from Ibn Ulayyah, both: from Said Al-Jurayri, from Abdullah bin Shaqiq Al-Uqayli who said: «The Companions of Muhammad, peace and blessings be upon him, used to be strict about selling Qurans and disliked the wage for boys in teaching», and the wording of Ibn Abi Shaybah: He dislikes the wage of the teacher, for the Companions of the Messenger of Allah, peace and blessings be upon him, used to dislike it and consider it severe.\n8. Narrated by Al-Khatib in Tarikh Baghdad (1/294).\n9. Established from (Z), and in the Original: Kari (renting). And in Awqaf copy: (upon toil), and in King Saud University copy: (upon toil in), and in Berlin with corrector's correction: (upon my tending to).",
    "book_id": "805",
    "new_page_number": 17
  },
  {
    "serial_number": "1261484",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 15,
    "volume_number": 1,
    "text": "its owner does not approach it.» I said: \"I have not cultivated my estate since I left you, fleeing from the Sultan and hating him,\" and I complained (1) to him some of what I knew of debt and distress (2). He said to me: «What will you do if there is no escape from it?» Then he said to me: «There is nothing here except that you pray for it.» I said: \"Is there any escape from that (3)?\" He said: «So what will you do?» And I saw (4) most of his command was facilitation in it and permission.\nHe said: And Abu Abd Allah, may Allah have mercy on him, said one day initiating [the conversation]: «O Abu Al-Hasan, be independent of people through your effort, for I have not seen the like of independence from (5) people.» I said: \"Why did you initiate this with me?\" He said: «Because if you have something you improve and you are involved in it, and you improve it and become independent through it from people, then wealth is from well-being.» So he urged me more than once to cultivate, and to become independent by cultivating what I was blessed with from people, for wealth is from well-being, and he began to emphasize the severity of needing people.\nI said: \"Our estate is days away from Raqqa, and in it is a Christian monastery secluded from people, with only a small number of Christians in it, and near it is a city.\" He said: «Which city is it?» I said: \"It has a Mu'adhin.\" He said: «From Al-Sham?» I said: \"No, from Al-Jazira towards Ras al-Ayn.\" He said: «This is a suitable place - meaning the monastery.» I said: \"My heart is only occupied with one thing, that the monastery (6) is secluded from people, and I only love seclusion, and there are only Christians in it, and I only disliked",
    "foot_note": "1. In (Z): And I narrated.\n2. In Berlin copy: Restriction.\n3. Established from (Z) and in Original: That.\n4. Established from (Z) and in Original: I see him.\n5. Established from (Z) and in Original and Berlin: In.\n6. Established from (Z) and in Original: Stick.",
    "book_id": "805",
    "new_page_number": 18
  },
  {
    "serial_number": "1261485",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 16,
    "volume_number": 1,
    "text": "in it (1) that if I wanted to pray, I wouldn't find anyone to pray with.\" He said to me: «So when prayer time comes, call the Adhan and Iqamah, if someone comes to you [fine], otherwise pray.»\nAbdul Malik said: So Abu Abd Allah, may Allah have mercy on him, deemed this place good and desired it for me, and I saw the joy in him clearly when I described it to him and its seclusion. I said: \"The city is a mile away from me, I can enter for Friday prayer and prayers on other days in the monastery.\" He said to me: «In this place, if you do not have anyone to pray with you; what do you do? Then call Adhan and Iqamah and pray alone.»\nAbdul Malik said: And I used to see Abu Abd Allah stand and make something (2) with his hand, and repair it and tend to his homes. He said: And I entered upon Abu Abd Allah, may Allah have mercy on him, several times in a room, and saw him strike his hand to its floor, and level (3) its dirt with his hand.\n11 - Muhammad bin Musa informed me, saying: I heard Ahmad bin Abdul Rahman Al-Bazuri (4) say: Abu Abd Allah, may Allah Almighty have mercy on him, said to me in the year (5) nineteen, when Al-Mu'tasim arrived, I came to him while he was making something with his hand, repairing it with clay. Which (6) is this? And he pointed to the residence (7), as if he meant repairing it for renting.\n12 - Zuhair bin Salih bin Ahmad bin Hanbal, may Allah be pleased with him, informed me saying:",
    "foot_note": "1. Established from (Z) and in Original: From it.\n2. In Berlin copy: Dinner. In Awqaf and King Saud University copies: Evening.\n3. In Berlin copy: bought. Established from other copies.\n4. In all copies and both printed versions: Al-Zuhri. Correction from Tarikh Baghdad (5/406) and Tabaqat Al-Hanabila (1/121).\n5. Established from (Z), in other copies: Seven.\n6. In Berlin copy: From.\n7. In Berlin copy: Iskan.",
    "book_id": "805",
    "new_page_number": 19
  },
  {
    "serial_number": "1261486",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 17,
    "volume_number": 1,
    "text": "I heard my father say: «He used to perhaps take the adze and go out to the residence of the tenants to work on something with his hand.»\n13 - Muhammad bin Abi Harun (1) informed me that Ishaq bin Ibrahim bin Hani told them, saying: Abu Abd Allah, may Allah have mercy on him, said to me: «Little wealth, you improve it so it remains (2), and much does not remain with corruption.»\n14 - Harun bin Ziyad (3) informed us, Ibn Abi Umar told us, Sufyan told us, from Mis'ar, from Sa'd bin Ibrahim, from Hamid bin Abdul Rahman, that Umar bin Al-Khattab, may Allah be pleased with him, said: «Clumsiness in livelihood is more feared by me for you than poverty. Nothing decreases with improvement, and nothing remains with (4) corruption» (5).\n15 - Harb bin Ismail informed me, Al-Musayyib bin Wadih told us, saying: Ash'ath (6) - meaning Ibn Shu'ba - said: I said to Ibrahim bin Adham: \"I hire myself out in the market and I miss the prayer in congregation.\" He said: «Hire yourself out for a time (7), and be independent of people, and pray the prayers on time.»",
    "foot_note": "1. He is Muhammad bin Musa bin Yunus. See his biography in Tarikh Baghdad (4/393).\n2. Dropped from (Z).\n3. He is Harun bin Yusuf bin Harun bin Ziyad Abu Ahmad known as Ibn Miqrad Al-Shatwi. See Tarikh Baghdad (16/43), and Tahdhib al-Kamal in the biography of Muhammad bin Yahya bin Abi Umar, among those who narrated from him.\n4. In Original: On.\n5. Its chain is weak, Hamid bin Abdul Rahman did not hear from Umar. See Tahdhib al-Tahdhib (3/45).\n6. In Berlin copy: Ash'arna bin Al-Musha'ath. In Awqaf and King Saud copies: Ash'ath bin Shu'aib.\n7. In (Z) copy: Misr, and established from other copies.",
    "book_id": "805",
    "new_page_number": 20
  },
  {
    "serial_number": "1261487",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 18,
    "volume_number": 1,
    "text": "16 - Abu Bakr Al-Marrudhi informed us, saying: I heard Abu Ja'far Al-Khurasani (1) say: I heard Shu'aib say: I said to Sufyan Al-Thawri: \"What do you say about a man who is a bleacher/fuller, if he earns a dirham - in the dirham is what sustains him and sustains his dependents - he does not catch the prayer in congregation. But if he earns four daniqs (fractions of a dirham), he catches the prayer in congregation, but there isn't in the four daniqs what sustains him and sustains (2) his dependents. Which of them is better?\" He said: «He earns the dirham and prays alone is better» (3).\n17 - Abu Bakr Al-Marrudhi informed me, saying: I said to Abu Abd Allah: \"For what did Sufyan Al-Thawri go out to Yemen?\" He said: «He went out for trade and to meet Ma'mar.» They said: \"He had one hundred dinars.\" He said: «As for seventy, it is correct» (4).\n18 - Yahya bin Abi Talib Al-Antaki (5) informed us, Al-Musayyib bin Wadih told us, saying: Yusuf bin Asbat said to me: «Sufyan Al-Thawri died and left two hundred dinars.» I said to him: \"And from where did he have two hundred dinars when he was (6) the ascetic of scholars?\"",
    "foot_note": "1. He is Muhammad bin Harun bin Ibrahim. Al-Marrudhi explicitly mentioned his name in his book Akhbar Al-Shuyukh. See his biography in Tahdhib al-Kamal.\n2. In Berlin copy: Remainder.\n3. Narrated by Abu Nu'aym in Al-Hilya (7/16), and Al-Dinawari in Al-Mujalasah (2952) with an addition at the end: .. and praying alone is better so that he does not waste his dependents. End quote. Abu Nu'aym narrated in Al-Hilya (7/15) from Sufyan Al-Thawri that he said regarding His saying {Trade and sale do not divert them from the remembrance of Allah} the verse: They used to buy and sell and not leave the prescribed prayers in congregation. Al-Bayhaqi narrated in Al-Zuhd Al-Kabir (938) from Sufyan Al-Thawri that he said to Shu'aib bin Harb: Look at your dirham, where is it from? And pray in the last row.\n4. Mentioned by Al-Marrudhi in Al-Wara' (77).\n5. The Baghdadi originally from Wasit, see his biography in Tarikh Baghdad (16/323). It appeared in the two printed versions and other copies except (Z) copy: Yahya bin Talib.\n6. Dropped from (Z).",
    "book_id": "805",
    "new_page_number": 21
  },
  {
    "serial_number": "1261488",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 19,
    "volume_number": 1,
    "text": "He said: «He used to place (1) thing after thing with his brothers, so he was blessed in it.» He said: And Sufyan Al-Thawri used to say: «Strength (wealth) has not been, since Allah Almighty sent Muhammad, peace and blessings be upon him, more beneficial to its people than in this time» (2).\n19 - Muhammad bin Amr bin Mukarram informed me, saying: I heard Abu Al-Hasan Al-Zahid say: A man said to Sufyan bin Uyaynah: \"Can a man be an ascetic while having one hundred dinars?\" He said: «Yes.» He said: \"How is that?\" He said: «If it decreases, he does not grieve (3), and if it increases, he does not rejoice, and he does not hate death because of parting with it» (4).\n20 - Ali bin Al-Hasan (5) bin Harun informed me, Muhammad Al-Attar (6) told me, saying: And Hussein bin Ali bin Al-Aswad mentioned, from Ubaidullah (7) bin Musa, saying: I heard Sufyan Al-Thawri say: «Money in this time is a weapon» (8).\n21 - Al-Hasan (9) bin Abdul Wahhab informed me, Abu Bakr - meaning Ibn",
    "foot_note": "1. In Berlin copy: Make.\n2. From Dawud bin Abi Hind, he said: I said to Al-Hasan: A man spends on his family an expenditure, if he wished he could suffice with less? He said: O man, expand upon yourself as Allah has expanded upon you. Al-Hasan also said: The people of heaven and earth do not know what Allah rewards the servant for the thing with which he brings joy to his dependents, family, and child. Narrated by Ibn Abi Al-Dunya in Kitab al-Iyal (2/557).\n3. Established from (Z), and in other copies: Worry.\n4. See Kitab al-Tawakkul by Abu Ya'la (p. 39).\n5. In the two printed editions: Al-Hussein. See his biography in Tarikh Baghdad (13/311).\n6. In (Z): Muhammad bin Muhammad Al-Attar, and likewise in the two editions. Established from other copies: Muhammad Al-Attar. He is Muhammad bin Saeed Al-Attar. See his biography in Tahdhib al-Kamal.\n7. Established from (Z), and in Berlin and Awqaf copies: Abdullah.\n8. Narrated by Ibn Abi Al-Dunya in Islah al-Mal (79) from Ubaidullah bin Musa with it.\n9. In Berlin copy: Al-Hussein.",
    "book_id": "805",
    "new_page_number": 22
  },
  {
    "serial_number": "1261489",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 20,
    "volume_number": 1,
    "text": "Hammad Al-Muqri, told us, Ahmad bin Yaqub told us, Abu Al-Fath told us, saying: «Sufyan criticized those who do not see [the necessity of] work.» He said: «And Abu Bakr - meaning Al-Siddiq - saw a young man begging, so he hired him for himself.»\n22 - Ahmad bin Mansur Al-Ramadi informed us, Abdul Razzaq told us, Muhammad bin Thawr told us, saying: Sufyan Al-Thawri used to pass by us while we were sitting in the Sacred Mosque, and say: «What makes you sit?» We would say: \"So what should we do?\" He said: «Seek from the bounty of Allah, and do not be dependents on the Muslims (1)» (2).\n23 - Abdullah bin Ahmad bin Muhammad bin Hanbal, may Allah be pleased with them both, told us, saying: Muhanna told me: Abu Hazim, a Sheikh who was with us in Akka, told me, saying: Sufyan Al-Thawri said: «Seeking knowledge is obligatory upon a man if he has a handful of food» (3). And I heard Muhammad bin Ishaq mention from Abdullah bin Saeed (4), from Ibn Abi Ghaniyah (5), from Sufyan Al-Thawri saying: «If you have wheat, then worship; otherwise seek it - meaning from its lawful source.»",
    "foot_note": "1. In Berlin copy: People.\n2. Narrated by Al-Dinawari in Al-Mujalasah (1082), and Al-Bayhaqi in Shu'ab al-Iman (9/221). In Musnad Ibn al-Ja'd (1921): Umar bin Al-Khattab, may Allah be pleased with him, said: O readers (scholars), raise your heads for the path has become clear, race towards good deeds, and do not be dependents on Muslims.\n3. Al-Khatib narrated in Al-Jami' li Akhlaq al-Rawi (50) from Ubaid bin Janad, saying to the people of Hadith: A man should know where his food, clothing, and housing come from, and such and such, then seek knowledge.\n4. In (Z): Abi Saeed.\n5. He is Yahya bin Abdul Malik bin Humaid. And it appeared in the two printed versions: Abdullah bin Abi Saeed from Ibn Abi Utbah. Both are misspellings.",
    "book_id": "805",
    "new_page_number": 23
  },
  {
    "serial_number": "1261490",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 21,
    "volume_number": 1,
    "text": "24 - Abu Bakr Al-Marrudhi informed us, saying: I heard Abu Ja'far Al-Khurasani, Abu Salih told us, saying: I heard Yusuf bin Asbat say to Shu'aib bin Harb: «Did you feel that seeking the Halal (lawful) is an obligation?» He said: «Yes» (1).\n25 - Abu Bakr Al-Marrudhi informed us, from Abu Abd Allah (2), from Abu Ja'far Al-Hadhdha' (3), from Shu'aib bin Harb, saying: «Do not despise a penny through the earning of which Allah is obeyed. It is not the penny that is intended, it is only obedience that is intended. Perhaps you buy herbs with it, and it does not settle in your stomach until you are forgiven» (4).\n26 - Muhammad bin Abdul Samad Al-Muqri (5) informed me, Yusuf bin Muslim told us, saying: I heard Ali bin Bakkar say: «Ibrahim bin Adham used to hire himself out, and Sulaiman Al-Khawwas used to glean/scavenge, and Hudhayfa used to make bricks.»\n27 - Ahmad bin Al-Faraj Abu Utbah (6) Al-Himsi informed us, Baqiyyah told us, saying: «If it was said to Ibrahim bin Adham: How are you? He said: Good, as long as no one bears my burden» (7).",
    "foot_note": "1. Narrated by Abu Nu'aym in Hilyat al-Awliya (8/242). In Al-Adab Al-Shar'iyyah (3/277): Imam Ahmad was asked what softens the heart? He said: Eating Halal.\n2. Established from (Z), and in other copies: Abi Abdan.\n3. He is Muhammad bin Abdullah Abu Ja'far Al-Hadhdha' Al-Anbari. See his biography in Tarikh Baghdad (3/414).\n4. Narrated by Al-Marrudhi in Kitab al-Wara' (83).\n5. In the two printed editions: Ahmad bin Muhammad bin Abdul Samad. This is an error. He is Al-Massisi, one of Al-Khallal's teachers, he narrated from him in Kitab al-Sunnah and Risalat al-Amr bil Ma'ruf.\n6. In Berlin copy: Abu Abdul Rahman. Established from other copies.\n7. Narrated by Ibn Asakir in Tarikh Dimashq (6/342).",
    "book_id": "805",
    "new_page_number": 24
  },
  {
    "serial_number": "1261491",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 22,
    "volume_number": 1,
    "text": "28 - Harb bin Ismail informed us, Al-Musayyib bin Wadih told us, saying: Ash'ath bin Shu'ba (1) told us, from Ibrahim bin Adham that he said to some of his brothers: «Do not leave working (profession), for if you work you are busy (occupied), and if you do not work you are known (exposed).»\n29 - Muhammad bin Ahmad bin Al-Qasim Al-Azdi informed us, Tahir bin Muhammad Al-Tamimi told us, Al-Fayd bin Ishaq told us, saying: I asked Al-Fudayl bin Iyad, saying: \"If a man sat in his house, claiming he trusts in Allah so his provision comes to him?\" He said: «He means if he trusts in Him until he knows that he has trusted in Him, nothing he wanted would be prevented from him. But the Prophets and others did not do this. The Prophets used to hire themselves out, and the Prophet, peace and blessings be upon him, hired himself out, and Abu Bakr and Umar, may Allah be pleased with them. They did not say: We sit until Allah Almighty provides. And Allah has said in His Book: {And seek from the bounty of Allah} (2), and there is no escape from seeking livelihood» (3).\n30 - Umar bin Ali informed me, Harun bin Sufyan Al-Mustamli told us, saying: I heard Aswad bin Salim say: «Buy and sell even at capital price (without profit)» (4).\n31 - Abdul Malik Al-Maymuni informed me, Abu Al-Abbas the companion of Abu Utbah (5) told me, saying: I asked Bishr bin Al-Harith about earning. He said: «Yes, by my life.» He said: As if he was saying: I do not see otherwise. And he said: «A human should",
    "foot_note": "1. In Berlin copy: Sha'ath bin Al-Sha'tha. In Awqaf copy: Ash'ath bin Shu'aib.\n2. In Berlin copy: {So seek provision from Allah}.\n3. Al-Tabarani narrated in Al-Mu'jam Al-Kabir (6/219) from Salman, may Allah be pleased with him, said: Indeed, the soul, if it secures its provision, becomes reassured, free for worship, and whispers despair from it.\n4. Narrated by Abu Nu'aym in Hilyat al-Awliya (8/364).\n5. Established from (Z), in other copies: Abu Uqbah.",
    "book_id": "805",
    "new_page_number": 25
  },
  {
    "serial_number": "1261492",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 23,
    "volume_number": 1,
    "text": "look into his earnings, his food, and his dwelling. A human should investigate (1) his trade.» Then he said: «And were it not that I have no dependents, I would have worked and earned» (2).\n32 - Ahmad bin Muhammad bin Khalid Al-Barathi (3) informed us, saying: Bishr bin Al-Harith said to me when he was informed of what was spent on us from our father's inheritance: «What was spent on you from this money has saddened me (4). You must be gentle and economical in spending. For you to spend the night hungry while you have money is more pleasing to me than to spend the night full while you have no money.» And Bishr said to me, connected to his speech and his questions (5): «It has reached me that you do not stick to the market, so stick to the market.» Then talk circulated between me and him, so he repeated to me: «Stick to the market even if you do not.» It fell into my heart: He meant: even if you do not profit. And he said to me: «Read my greetings to your mother and say to her: You must be gentle and economical in spending» (6).\n33 - Abu Bakr Al-Marrudhi informed me, saying: I heard some of the Sheikhs say: I heard Abu Yusuf Al-Ghasuli say: «Twelve dirhams suffice me for the year, a dirham every month. And nothing drives me to work except the tongues of these reciters (worshipers) saying: Abu Yusuf, where does he eat from?» (7).",
    "foot_note": "1. Established from (Z), in other copies: Trade.\n2. Al-Hasan Al-Basri said: The one who restricts his dependents is a traitor. Ayyub said: If I knew that my dependents needed a bundle of herbs, I would not sit with you. Narrated by Ibn Abi Al-Dunya in Kitab al-Iyal (2/547).\n3. See his biography in Siyar A'lam al-Nubala (14/92).\n4. In the margin of (Z) appended from the hearing of Al-Tayuri, and it is present in the Original.\n5. In Original: His questioning.\n6. Narrated by Abu Nu'aym (8/340).\n7. In Shu'ab al-Iman (2/453) from Sufyan, he said: It was said to Ibn Al-A'rabi: Do you love Dirhams? He said: They benefit me and protect me.",
    "book_id": "805",
    "new_page_number": 26
  },
  {
    "serial_number": "1261493",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 24,
    "volume_number": 1,
    "text": "34 - And Abu Bakr informed me, saying: I heard Harami bin Yunus (1) say: I heard Abu Yusuf Al-Ghasuli say: «I have been learning Fiqh regarding my food for sixty years» (2).\n35 - Abu Bakr Al-Marrudhi informed me, saying: I heard Ishaq bin Dawud say: I heard Al-Hasan bin Al-Rabi' say: «To earn a Qirat (small fraction) is more beloved to me than someone (3) giving me ten dirhams.»\n36 - And Abu Bakr informed me, saying: I heard Muhammad bin Muqatil say: «A man should look at his loaf (4); where is it from? And look at his dirham; where is it from? Sufyan said: Do the deeds of heroes; meaning earning Halal» (5).\n37 - Abu Bakr Al-Marrudhi informed us that he read to Abu Abd Allah, may Allah have mercy on him: Ibn Mahdi (6), from Sufyan, from",
    "foot_note": "1. In the two printed editions: Harami bin Yusuf. This is an error, rather he is Harami bin Yunus bin Muhammad Al-Mu'addib, and Harami is a nickname and his name is Ibrahim. He has a biography in Tahdhib al-Kamal, and Tabaqat Al-Hanabila (1/404). Ibn Al-Jawzi quoted the narration in Sifat al-Safwa (4/277).\n2. In Al-Zuhd Al-Kabir by Al-Bayhaqi (914), Yunus bin Ubaid said: Nothing is more precious than two things: A good (pure) dirham, and a man who acts upon Sunnah.\n3. Dropped from (Z).\n4. In Berlin copy: In his loaf.\n5. Narrated by Al-Marrudhi in Kitab al-Wara' (38).\n6. In Berlin copy: That he read to Ali bin Abdullah bin Mahdi. In Awqaf copy: That he read to Ibn Abdullah bin Mahdi. In King University copy: That he read to Abu Abdullah bin Mahdi. All are misspellings.",
    "book_id": "805",
    "new_page_number": 27
  },
  {
    "serial_number": "1261494",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 25,
    "volume_number": 1,
    "text": "Amr bin Qais, from Asim, from Abu Wa'il, who said: «A dirham from trade is more beloved to me than ten from my stipend» (1).\n38 - Harb informed me, he said Muhammad bin Abdul Rahman Al-Ju'fi told us, Abu Usama told us, from Yazid bin Ibrahim Al-Tustari, from Al-Hasan who said: «Two foods are good: A man carrying on his back, and his work with his hand» (2).\n39 - Muhammad bin Ibrahim bin Mahdi (3) informed me, Abdullah bin Muhammad bin Rabi'ah (4) told us, Ibn Al-Mubarak (5) told us, Sufyan told us, from Amr bin Qais, from Asim bin Abi Al-Nujud, from Abu Wa'il this Hadith.\n40 - And Muhammad informed us, saying Waki' informed us, from Sufyan, from Amr bin Qais, from Asim bin Abi Al-Nujud, from Abu Wa'il, who said: «A dirham from trade is more beloved to me than ten from my stipend (6).»\n41 - Al-Hasan bin Arafa informed us, saying: Qudama bin Shihab Al-Mazini Al-Basri told me, from Ismail bin Abi Khalid, from Wabrah, from Ibn Umar (7)",
    "foot_note": "1. Narrated by Ibn Abi Shaybah (7/556), Ibn Sa'd in Al-Tabaqat (8/221), and Ibn Abi Al-Dunya in Islah al-Mal [Encyclopedia of Imam Ibn Abi Al-Dunya] (7/454) with the wording: (from gifts) instead of (my stipend).\n2. Narrated by Ahmad in Al-Zuhd (1552).\n3. He is Abu Bakr Al-Massisi. See Tarikh Dimashq (5/70).\n4. Established from (Z), and in other copies: Rabi'ah told us. This is an error, he is Abdullah bin Muhammad bin Rabi'ah bin Qudama Al-Qudami Al-Massisi. See Mizan al-I'tidal (2/488).\n5. Established from (Z), and dropped from other copies.\n6. In (Z): Giving.\n7. In Berlin copy: From Wabrah bin Amr.",
    "book_id": "805",
    "new_page_number": 28
  },
  {
    "serial_number": "1261495",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 26,
    "volume_number": 1,
    "text": "He said: The Messenger of Allah, peace and blessings be upon him, was asked about the best earning, so he said: «A man's work with his hand and every righteous sale» (1).\n42 - Ahmad bin Al-Faraj Abu Utbah Al-Himsi informed me, saying Baqiyyah told us, from Shu'ba, from Al-Hakam. And Ahmad (2) told us, Al-Hasan (3) informed us, Yahya bin Adam (4) told us, saying Abdul Salam and Ibn Al-Mubarak told us, from Shu'ba, from Al-Hakam, from Mujahid regarding His saying: «Eat from the good things We have provided you (5)» he said: «Trade».\n43 - And Al-Hasan bin Ali informed us, Yahya bin Adam told us, Warqa' told us, from Ibn Abi Najih (6), from Mujahid regarding His saying: {Spend from the good things which you have earned} he said: «From trade» (7).",
    "foot_note": "1. Weak Hadith, narrated with this chain by: Al-Tabarani in Al-Awsat (2140) and in Al-Kabir (13/215), Abu Ahmad Al-Hakim in his Fawa'id (78), and others, all from the route of Al-Hasan bin Arafa with it. Abu Hatim said as in Al-Ilal by his son (1172): This Hadith is false, and Qudama is not strong. It has another route narrated by Ahmad (15836), Ibn Abi Shaybah (23422), and Al-Bayhaqi (5/263) from the route of Wa'il bin Dawud, from Said bin Umair, he said: The Prophet, peace and blessings be upon him, was asked: Which earning is best? So he mentioned it. Abu Hatim said - as in Al-Ilal (2837) -: The Mursal is more likely. Al-Bayhaqi said: The correct one is the narration of Wa'il from Said bin Umair from the Prophet, peace and blessings be upon him, mursal. Al-Bukhari said: Some attributed it (made it Musnad) and it is an error. See Al-Tarikh Al-Kabir by Al-Bukhari (3/502).\n2. Dropped from (Z), established from Berlin and Awqaf copies.\n3. In (Z): And Al-Hasan informed us.\n4. Established from (Z), and in Original, Berlin and Awqaf: Yahya bin Nafi'. The established is correct, for Yahya bin Adam is famous for knowledge and abundant narration, and he narrated from Warqa' as in Tahdhib al-Kamal. As for Yahya bin Nafi', he is unknown, Ibn Hibban mentioned him in Al-Thiqat (7/614), and Al-Mu'allimi commented on him not finding his biography.\n5. In Original and (Z): What you earned.\n6. In Berlin and Awqaf: Ibn Abi Yahya.\n7. Narrated by Ibn Jarir in his Tafsir (4/695).",
    "book_id": "805",
    "new_page_number": 29
  },
  {
    "serial_number": "1261496",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 27,
    "volume_number": 1,
    "text": "44 - Abu Bakr Al-Marrudhi informed us, Al-Warakani (1) told us, saying Al-Mu'afa bin Imran told us, from Sufyan, from Al-A'mash, from Ibrahim, he said: «It used to be said: The merchant is better than the sitter (one who sits idly).»\n45 - Abdullah bin Ahmad bin Hanbal informed us, my father, may Allah have mercy on him, told me, Sufyan told us, from Abu Ishaq, he said: «They used to see abundance (wealth) as an aid to religion.» It was said to Sufyan: Did Sufyan Al-Thawri mention it? He said: «Yes.»\n46 - Muhammad bin Mahdi bin Ja'far Al-Suri informed us in Tyre, saying: I heard my father say: I was in Tarsus when Al-Ma'mun arrived in Tarsus, and with him were Ahmad bin Hanbal, may Allah have mercy on him, and Ibn Nuh. He and Ibn Nuh were shackled. He said: So Ahmad bin Hanbal, may Allah have mercy on him, wrote a note to me: \"You know what we are in, and were it not for that, we would have come to you. So if you see fit to come to us, come.\" So I went to them and narrated to them. Among what Ahmad bin Hanbal, may Allah Almighty have mercy on him, wrote from me: Damrah told us, from Raja' bin Abi Salamah, from Abd Rabbih bin Sulaiman bin Zaitun (2), from Ibn Muhayriz, he said: «There is no food with which I fill what is between my sides after my effort, wherein I am counted among the black and the red (everyone), more beloved to me than the food of a truthful merchant.»\n47 - And Bishr bin Musa Al-Asadi wrote to me, saying Abdullah bin Salih Al-Ijli told us, saying Isra'il told us, from Abu Hamza, he said: I asked Ibrahim about a man who leaves trade, meaning and turns to deeds (worship) and prayer, meaning",
    "foot_note": "1. He is Muhammad bin Ja'far Abu Imran. See Al-Jarh wa Al-Ta'dil (7/222).\n2. In the manuscripts and printed versions: Zanbur, this is an error, and Abd Rabbih has a biography in Tahdhib al-Kamal.",
    "book_id": "805",
    "new_page_number": 30
  },
  {
    "serial_number": "1261497",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 28,
    "volume_number": 1,
    "text": "and a man who occupies himself with trade, which of them is better? He said: «The honest merchant.»\n48 - Al-Hasan bin Ali bin Affan informed us, saying Yahya bin Adam told us, Qais told us, from Abdullah bin Ata, from Abu Ja'far who said: «Ibn Affan was not killed until the revenue of my (1) palm trees reached one hundred thousand.»\n49 - Al-Abbas bin Muhammad Al-Duri informed us, I asked him, Ja'far bin Awn told us, Al-A'mash told us, from Salamah (2), from Abu Dhabyan who said: Umar said: «O Abu Dhabyan, (if) (3) acquire wealth» (4).\n50 - Ahmad bin Mansur Zaj Al-Marwazi informed us, Al-Nadr bin Shumayl informed us, Shu'ba bin Al-Hajjaj told us, saying: I heard Qatada say: I heard Mutarrif bin Abdullah bin Al-Shikhkhir, from Hakim bin Qais, from Asim, from his father, that he",
    "foot_note": "1. Established from Original (Z). In Kitab al-Kharaj (263) by Yahya bin Adam: (revenue of Ali). In the two printed editions: revenue of his palm trees.\n2. In Berlin copy: From Abu Salamah.\n3. Addition from (Z).\n4. It is in Tarikh Ibn Ma'in narrated by Al-Duri (3/294): I asked Yahya about the Hadith of Al-A'mash from Abu Dhabyan saying: Umar said to me: O Abu Dhabyan, acquire wealth. Yahya said: This is not Abu Dhabyan who narrates from Ali, this is another Abu Dhabyan. In Su'alat Abi Ubaid Al-Ajurri li Abi Dawood (p. 146): I said to Abu Dawood: Al-A'mash from Salamah bin Kuhayl from Abu Dhabyan? He said: «This is not that one, this is a man from Quraysh.» Its chain is weak, Abu Dhabyan Al-Qurashi is unknown. See Al-Mizan (4/542). It has a witness in what Al-Bukhari narrated in Al-Adab Al-Mufrad (576) from Abu Dhabyan - who is Al-Janbi Husayn bin Jundub not the Qurashi mentioned earlier - he said: Umar bin Al-Khattab said to me: O Abu Dhabyan, how much is your stipend? I said: Two thousand five hundred. He said to him: O Abu Dhabyan, acquire from tillage and Sabiyah (livestock reproduction) before the boys of Quraysh rule over you, stipend will not be counted as wealth with them. End quote. He means by it offspring in livestock and their abundance. It is said the family of so-and-so has Sabiyah: i.e. many livestock. The plural is Sawabi, which is originally the membrane in which the fetus comes out. It is said it is the placenta. See Al-Nihayah (2/341).",
    "book_id": "805",
    "new_page_number": 31
  },
  {
    "serial_number": "1261498",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 29,
    "volume_number": 1,
    "text": "advised his sons saying: «Stick to wealth and acquiring it, for it is the alert/honor (1) of the noble, and by it one is independent of the mean. And beware of begging, for it is the last earning of a man. And when I die, do not wail over me, for indeed the Messenger of Allah, peace and blessings be upon him, was not wailed over» (2).\n51 - Harb bin Ismail Al-Kirmani informed us, Bashar bin Musa told us, Abbad told us, Yahya bin Saeed told us, from Said bin Al-Musayyib, he said: «There is no good in one who does not seek money to pay his debt with, protect his honor with, and fulfill his obligations with, and if he dies he leaves it as inheritance for those after him.»\n52 - Muhammad bin Ismail Al-Ahmasi (3) informed us, Waki' informed us, from Sufyan, from Yahya bin Saeed, from Said bin Al-Musayyib, that he left dinars and said: «O Allah, You know that I did not gather them except to protect my religion and my nobility with them. There is no good in one who does not gather money so he pays (4) his debt, and restrains his face (from begging) with it.»\n53 - Harb bin Ismail informed us, Abu Ma'n Al-Raqashi told us, Umar bin Dharr informed us, from Mujahid, he said: I heard him say: «If Allah provides one of you with a thousand dirhams, let him not spend it and say: Indeed Allah Almighty will provide for me, but let him seek in it from the bounty of Allah.»",
    "foot_note": "1. In Berlin copy: The wish of the noble.\n2. Narrated by Al-Bukhari in Al-Adab Al-Mufrad (361) and Al-Albani classed it Hasan.\n3. In Berlin copy: Al-Ahmar.\n4. In Berlin copy: So remains.",
    "book_id": "805",
    "new_page_number": 32
  },
  {
    "serial_number": "1261499",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 30,
    "volume_number": 1,
    "text": "54 - Muhammad bin Ismail informed me, Waki' informed us, from Musa bin Ali bin Rabah Al-Lakhmi, from his father who said: I heard Amr bin Al-Aas say: The Messenger of Allah, peace and blessings be upon him, said to me: «O Amr, tighten your clothes and weapons upon you, and come to me.» He said: So I tightened my clothes and weapons upon me, then I came to him and found him performing ablution. He raised his gaze at me and lowered it and said: «O Amr, I want to send you on a mission (face), so Allah Almighty accepts your safety and grants you spoils, and I desire for you a righteous desire regarding wealth.» He said: I said: \"O Messenger of Allah, I did not submit (become Muslim) out of desire for wealth, I only submitted out of desire for Jihad and being with you.\" He said: «O Amr, excellent is the righteous wealth for the righteous man» (1).\n55 - Muhammad informed us, Waki' informed us, from Shu'ba, from Al-Hakam, from Mujahid {Spend from the good things which you have earned (2)} he said: «Trade».\n56 - Muhammad informed us, Waki' told us, Yunus bin Abi Ishaq told us, from his father, from Abdul Rahman bin Abza who said: «Prophet David, peace be upon him, said: Excellent aid is wealth or affluence for religion» (3).",
    "foot_note": "1. Sahih Hadith, narrated by Ahmad (29/298), Ibn Abi Shaybah (7/557), Al-Bukhari in Al-Adab Al-Mufrad (299), Ibn Hibban (3211) and others from the route of Musa bin Ali with it. Al-Iraqi authenticated it in Al-Mughni (3253), Al-Albani as in Al-Adab Al-Mufrad, and Sheikh Muqbil in Al-Sahih Al-Musnad mimma laysa fi Al-Sahihayn (1006). In some printed copies of the Hadith: «And I give you a good portion (Za'bah) of money» i.e.: I give you a batch of money. The origin of Za'b: pushing and dividing. See Al-Nihayah (2/302).\n2. In all copies: What we provided you.\n3. Its chain has weakness due to the 'an'anah (narrating with 'from') of Abu Ishaq because he is a Mudallis, although he explicitly stated hearing from Abdul Rahman as in Al-Adab Al-Mufrad (138). The Athar was narrated by Ibn Abi Shaybah (35267), and Ibn Abi Al-Dunya in Islah al-Mal (67) via Waki' with it.",
    "book_id": "805",
    "new_page_number": 33
  },
  {
    "serial_number": "1261500",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 31,
    "volume_number": 1,
    "text": "57 - Muhammad informed us, Waki' informed us, from Sufyan, from Al-Ala bin Al-Musayyib, from Ibn Munabbih, who said: «Poverty is the Greater Death.»\n58 - Muhammad informed us, Waki' informed us, from Muhammad bin Sulaym, from Ibn Abi Mulaykah, from Aisha, may Allah Almighty be pleased with her, who said: «Abu Bakr, may Allah be pleased with him, was the most trading (merchant) of Quraysh until he entered into the Emirate» (1).\n59 - Muhammad informed us, Waki' informed us, from Al-A'mash, from Khaythamah (2) who said: Abu Al-Darda, may Allah be pleased with him, said: «I was a merchant before the Prophet, peace and blessings be upon him, was sent. When the Prophet, peace and blessings be upon him, was sent, I wanted to combine trade and worship but it did not straighten out, so I left trade and turned to worship» (3).",
    "foot_note": "1. Sahih Athar, narrated by Ibn Abi Shaybah (22605) from Waki' from Muhammad bin Sharik, and narrated by Abdullah bin Ahmad bin Hanbal in Al-Zuhd for his father (573) from Dawud bin Amr Al-Himsi from Abdul Jabbar bin Al-Ward, both: from Ibn Abi Mulaykah who said: Aisha, may Allah be pleased with her, said: And in it that Abu Bakr said: ... I used to be the most trading of Quraysh and the most wealthy of them, but when the Emirate occupied me, I saw that I acquire from wealth according to what occupied me... . And Ibn Abi Shaybah narrated with a Sahih chain (22603) saying: Waki' told us, he said: Al-A'mash told us, from Shaqiq, from Masruq, from Aisha, she said: Abu Bakr said in his illness in which he died: Look at what increased in my wealth since I entered the Caliphate and send it to the Caliph after me, for I used to consider it lawful, and I used to acquire from fat roughly what I used to acquire from trade. Aisha said: When he died we looked, and behold a Nubian slave carrying his children and a camel used for irrigation. She said: So we sent them to Umar. She said: My grandfather informed me that Umar wept and said: May Allah have mercy on Abu Bakr, he has tired those after him severely.\n2. In Berlin copy: Shu'ba.\n3. Weak, narrated by Ibn Sa'd in Al-Tabaqat (4/352) and Ahmad in Al-Zuhd (743), and Hannad bin Al-Sari in Al-Zuhd (2/353). Al-Duri said in Tarikh Ibn Ma'in (3/575): I asked Yahya about the Hadith of Khaythamah from Abu Al-Darda saying: I was a merchant before the Prophet was sent... He said: This is Mursal.",
    "book_id": "805",
    "new_page_number": 34
  },
  {
    "serial_number": "1261501",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 32,
    "volume_number": 1,
    "text": "60 - Muhammad informed us, Waki' informed us, from Mis'ar, from Abu [Bahr] (1), from a Sheikh of theirs who said: I saw a coarse lower garment (Izar) on Ali, and he said: «I bought it for five dirhams; whoever gives me a profit of one dirham on it, I will sell it» (2).\n61 - Muhammad informed us, Waki' informed us, from Sharik, from Simak bin Harb, from Ikrimah, from Ibn Abbas, may Allah be pleased with them both, who said: A caravan (3) arrived in Medina, so the Prophet, peace and blessings be upon him, bought from it and profited ounces (of silver). He divided them among the widows of Banu Abdul Muttalib and said: «I do not buy anything for which I do not have the price» (4).\n62 - Muhammad informed us, Waki' informed us, from Amr bin Isa Abu Na'ama, Harith bin Al-Rabi' Al-Adawi told us, saying: I heard Umar bin Al-Khattab, may Allah Almighty be pleased with him, say: «(Incited) (5) upon you are three travels: Hajj, Umrah, and a man seeking with his wealth in one of these ways. The independent and the charitable - meaning better. By Allah, for me to die in a facet of these facets seeking with my money",
    "foot_note": "1. In Original and (Z) and printed editions: Abu Yahya. This is an error, and the established is as in the sources, and his name is Tha'labah Al-Kufi. See Al-Tarikh Al-Kabir (2/174), and Al-Jarh wa Al-Ta'dil by Ibn Abi Hatim (2/463).\n2. Weak due to the anonymity of the narrator from Ali. The Athar was narrated by Ahmad in Al-Zuhd (694), and in Fada'il al-Sahaba (885), Al-Bayhaqi in Al-Sunan (5/538), and Ibn Al-Athir in Usud al-Ghaba (3/599). In Ahmad and Ibn Al-Athir: He said: And I saw tied dirhams with him, and he said: This is the remainder of our expenses from Yanbu.\n3. In Berlin copy: Caravan of Quraysh.\n4. Weak Hadith, narrated by Ahmad (2093), Abu Dawood (3344), Ibn Abi Shaybah (22190) and others via Waki' with it. Sharik is Saduq (truthful) but has bad memory, and Simak's narration from Ikrimah is confused. Al-Albani weakened it in Al-Da'ifah (4766).\n5. In the margin of the Original: This is not from lying (Kadhib), rather this is incitement (Ighra'), meaning stick to these things.",
    "book_id": "805",
    "new_page_number": 35
  },
  {
    "serial_number": "1261502",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 33,
    "volume_number": 1,
    "text": "from the bounty of Allah is more beloved to me than to die on my bed. And if I said: It is martyrdom, I would see that it is martyrdom» (1).\n63 - Yahya informed us, Abdul Wahhab told us, Said informed us, from Qatada, from Umar bin Al-Khattab, may Allah be pleased with him, who said: «O people, (incited) (2) upon you - i.e., decreed upon you - is that one of you takes his money and seeks in it from the bounty of Allah Almighty, for in it is worship and charity. By Allah, for me to die in the two branches of my saddle while I seek with my money in the land (3) from the bounty of Allah is more beloved to me than to die on my bed» (4).\n64 - Yahya informed us, Abdul Wahhab bin Ata Al-Ijli told us, Said bin Abi Aruba told us, from Qatada bin Di'ama that he said regarding this verse: {O you who have believed, do not consume one another's wealth unjustly but only [in lawful] business by mutual consent} he said: «Trade is a provision from the provision of Allah, lawful from the lawful of Allah for whoever seeks it with its truthfulness and righteousness» (5).",
    "foot_note": "1. Weak Athar, narrated by Abdul Razzaq (5/172), Ibn Abi Shaybah (22187), Abu Ubaid in Gharib al-Hadith (4/148) and others from Harith with it. Harith's condition is unknown, Al-Ijli and Ibn Hibban declared him trustworthy.\n2. In Berlin copy: Confirmed upon you.\n3. Here is an addition in Berlin copy: I seek.\n4. Weak Athar, containing the 'an'anah of Qatada and he did not meet the senior Companions, may Allah be pleased with them. Abdul Razzaq narrated it (11/464) from Ma'mar, from Al-Zuhri, from Ubaidullah bin Abdullah bin Umar, or others, he said: so he mentioned similarly. The correction is from Shu'ab al-Iman (2/450), Al-Bayhaqi narrated it from Ubaidullah from Umar or others, then said: And others narrated it saying: from Umar bin Al-Khattab, he did not doubt, and added: He recited this verse: {And others traveling throughout the land seeking the bounty of Allah}.\n5. Narrated by Ibn Jarir in his Tafsir (6/630). Ibn Jarir said commenting on the verse: In this verse is a clarification from Allah Almighty mentioning the falsification of the saying of the ignorant Sufis who deny seeking sustenance through trades and industries.",
    "book_id": "805",
    "new_page_number": 36
  },
  {
    "serial_number": "1261503",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 34,
    "volume_number": 1,
    "text": "65 - Yahya informed us, Abdul Wahhab informed us, Shu'ba informed us, from Al-Hakam bin Utaybah, from Mujahid that he said regarding this verse: {O you who have believed, spend from the good things which you have earned} he said: «From trade» (1).\n66 - Yahya told us, Abdul Wahhab informed us, Said informed us, from Qatada who said: «We used to be told that the truthful honest merchant is with the Seven under the shade of the Throne on the Day of Resurrection» (2).\n67 - Abu Bakr Al-Marrudhi informed us, from Abu Abd Allah, Abdul Razzaq told us, Ma'mar informed us, Hammam bin Munabbih told us, saying: This is what Abu Huraira, may Allah Almighty be pleased with him, told us from the Messenger of Allah, peace and blessings be upon him, who said: «David used not to eat except from the work of his hand» (3).\n68 - And Harb informed me, saying Muhammad bin Abdul Rahman told me, Abu Usama told us, from Hisham bin Urwa, from his father who said: «David used to address the people on his pulpit, then work palm leaves with his hand, and he would make a basket or something from it, then send it with someone to sell it and eat from its price» (4).\n69 - Harb informed me, Ahmad bin Hanbal told us, Harun told us, Damrah told us, from Ibn Ata, from his father, who said: «Solomon son of David used to work palm leaves with his hands and eat barley bread» (5).",
    "foot_note": "1. Narrated by Ibn Jarir in his Tafsir (4/695).\n2. Narrated by Ibn Jarir in his Tafsir (6/630).\n3. Narrated by Al-Bukhari (2073).\n4. Narrated by Ibn Asakir in Tarikh Dimashq (17/92).\n5. Narrated by Ahmad in Al-Zuhd (466).",
    "book_id": "805",
    "new_page_number": 37
  },
  {
    "serial_number": "1261504",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 35,
    "volume_number": 1,
    "text": "70 - Harb informed me, Ali bin Uthman told us, Hushaym told us, Al-Awwam bin Hawshab informed us, Al-Qasim bin Awf informed me saying: Ka'b said: «As for Idris, he was a righteous man who worshiped Allah and fasted and prayed, and he was a tailor who gave in charity from his earning what exceeded his sustenance» (1).\n71 - Harb informed me, Ali bin Uthman told us, Hammad bin Salamah told us, Thabit informed us. And Al-Duri (2) informed us, Arim told us, Hammad bin Salamah told us, from Thabit, from Abu Rafi', from Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «Zakariya was a carpenter» (3).\n72 - Al-Abbas Al-Duri informed us, Arim told us, Hammad bin Salamah told us, Ali bin Zaid told us, from Said bin Al-Musayyib «That Luqman was a tailor» (4).\n73 - And Abdul Malik bin Abdul Hamid Al-Maymuni informed me, Harun bin Ma'ruf told us, Sufyan told us saying: «It is not from your love of the world that you seek from it what reforms you» (5).",
    "foot_note": "1. Narrated by Al-Hakim in Al-Mustadrak with its meaning (2/652).\n2. In Berlin copy: Al-Darawardi.\n3. Narrated by Muslim (2379) and Ibn Hibban titled a chapter on it in his Sahih (11/452): Mention of the report refuting the saying of those among the Sufis who invalidate earning.\n4. Narrated by Ahmad in Al-Zuhd (268).\n5. It came as Marfu' (attributed to Prophet) but is not authentic, narrated by Ibn Adi in Al-Kamil (4/401), and Ibn Abdul Barr cited it in Jami' Bayan al-Ilm wa Fadlihi from Abu Darda (1328), and Ibn Muflih mentioned it in Al-Adab Al-Shar'iyyah (3/270). Al-Dinawari narrated in Al-Mujalasah (6/98) from Sufyan Al-Thawri saying: I love for the scholar to have sufficiency; because afflictions are quick to them, and people's tongues are quicker to them, and if he needs; he is humiliated. Were it not for this estate I have, kings would have used me as a handkerchief. If you see the reciter sticking to the door of kings; know that he is a thief.",
    "book_id": "805",
    "new_page_number": 38
  },
  {
    "serial_number": "1261505",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 36,
    "volume_number": 1,
    "text": "74 - Yazid bin Abdullah Al-Asbahani informed me, Al-Hussein bin Muhammad bin Sinan Al-Makki told us, he said I read to Al-Hussein (1) bin Al-Faraj, saying: Sufyan bin Uyaynah was asked about sustenance (Qut) and what is indispensable, is there an account for it [on Judgment Day]? He said: «No.»\n75 - Muhammad bin Ismail informed us, Waki' informed us, from Hammad bin Salamah, from Hisham bin Zaid, from Anas bin Malik, who said: The Messenger of Allah, peace and blessings be upon him, said: «If the Hour rises upon one of you and in his hand is a sapling, let him plant it» (2).\n76 - Muhammad bin Ahmad bin Hazim informed us, that Ishaq bin Mansur told them that he said to Abu Abd Allah the saying of Ali, may Allah Almighty be pleased with him: Four thousand and below is expenses (Nafaqah) and what is above that is Hoarding (Kanz). Ahmad said: «He means it is not appropriate for him to hold more than four thousand.» Ishaq bin Mansur said: Ishaq bin Rahwayh said: «Its meaning is the four thousand he needs.» As if he says: He is not asked about that, so what is above that is Kanz, and Kanz if its Zakat is paid, the name of Kanz leaves it (3).\n77 - Muhammad bin Ayyub informed us, Waki' told us, from Sufyan, from Abu Husayn, from Abu Al-Duha, from Ja'dah bin Hubayrah, from Ali, may Allah be pleased with him, who said: «Four thousand and below is expenses, so what is more than that is Kanz» (4).",
    "foot_note": "1. In the two printed editions: Al-Hasan. This is an error, see his biography in Lisan al-Mizan (3/200).\n2. Sahih chain, narrated by Ahmad (12902), Al-Bukhari in Al-Adab Al-Mufrad (479), Al-Tayalisi (2181) and others via Hammad with it. Al-Albani authenticated it as in Al-Adab Al-Mufrad, and Sheikh Muqbil in Al-Jami' Al-Sahih (38).\n3. See Masa'il Imam Ahmad bin Hanbal and Ibn Rahwayh (9/4680).\n4. Sahih chain, narrated by Abdul Razzaq (4/109), and Ja'dah heard from Ali, may Allah be pleased with him. Abu Al-Duha is Muslim bin Subayh, and Abu Husayn is Uthman bin Asim Al-Kufi.",
    "book_id": "805",
    "new_page_number": 39
  },
  {
    "serial_number": "1261506",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 37,
    "volume_number": 1,
    "text": "79 - And Harun bin Ziyad informed us, Ibn Abi Umar told us, Sufyan told us, from Mis'ar (1), from Abu Husayn, from Ja'dah bin Hubayrah, from Ali bin Abi Talib, may Allah be pleased with him, who said: «Four thousand (2) and below is expenses, so what is above that is Kanz.»",
    "foot_note": "1. In Berlin copy: Muslim.\n2. In Awqaf and Berlin copies: A thousand and below.",
    "book_id": "805",
    "new_page_number": 40
  },
  {
    "serial_number": "1261507",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 38,
    "volume_number": 1,
    "text": "And in this Chapter is the saying of the Prophet, peace and blessings be upon him: «It is sufficient sin for a man to waste those he sustains.»\n80 - Abu Bakr Al-Marrudhi informed us, saying I heard Abu Abd Allah say: Let the servant fear Allah and not feed them except what is good (pure/halal), meaning the dependents. I said to Abu Abd Allah: A man says: I will not earn until the intention becomes correct for me, and he has dependents. He said: «Since he has [dependents], it is obligatory upon him to keep them chaste, so part of the intention is protecting them» (1).\n81 - Muhammad bin Abi Harun informed me, that Ishaq bin Ibrahim bin Hani told them, saying I heard Abu Abd Allah being asked about the Hadith of the Prophet, peace and blessings be upon him: «It is sufficient sin for a man to waste those he sustains» (2). He said: «A man has relatives, so he travels and leaves them. If he leaves them alone, are they not wasted while they have no one but him?» I said: Yes. He said: «This is its meaning» (3).\n82 - Muhammad bin Abi Harun informed me, that Ishaq told them, saying: Abu Abd Allah was asked about a man who left dependents and young children, and fears they might be wasted, and he has",
    "foot_note": "1. In Sahih Muslim (994): From Abu Qilaba, from Abu Asma, from Thawban, he said: The Messenger of Allah, peace and blessings be upon him, said: The best Dinar a man spends is a Dinar he spends on his dependents, a Dinar a man spends on his riding beast in the cause of Allah, and a Dinar he spends on his companions in the cause of Allah. Abu Qilaba said: He started with dependents. Then Abu Qilaba said: And which man has greater reward than a man who spends on young dependents, keeping them chaste or Allah benefiting them through him, and enriching them. In Shu'ab al-Iman (2/438): Muhammad bin Wasi' said to Malik bin Dinar: Why don't you duel the heroes? He said: And what is dueling the heroes? He said: Earning from Halal and spending on dependents.\n2. Narrated by Muslim (996) with wording: «It is sufficient sin for a man to withhold from those whose provision he possesses». It is with the wording of the author in Ahmad (11/36) and Abu Dawood (1692).\n3. In Kitab al-Iyal by Ibn Abi Al-Dunya (2/560): From Ayyub al-Sakhtiyani that he used to say to his companions often: Tend to your children and families with righteousness and kindness and do not leave them coveting with their eyes what is in people's hands.",
    "book_id": "805",
    "new_page_number": 41
  },
  {
    "serial_number": "1261508",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 39,
    "volume_number": 1,
    "text": "performed Hajj and wants to go out to Kufa, and perhaps he might perform Hajj from Kufa. Abu Abd Allah said: «He should not go out and waste them.» Then he said: «It is sufficient sin for a man to waste those he sustains.»\n83 - Ahmad bin Al-Hussein bin Hassan and Yusuf bin Musa informed me that Abu Abd Allah was asked about the Hadith: «It is sufficient sin for a man to waste those he sustains.» He said: If he is striving for his dependents, how does he waste them? It was said to him: If he feeds them Haram, is it a wasting of them? He said: «Severely» (1).\n84 - Muhammad informed us, Waki' told us, from Isra'il, from Abu Ishaq, from Wahb bin Jabir Al-Khaywani, from Abdullah bin Amr that he said to a steward of his in the month of Ramadan: Have you measured out for our family their sustenance for this month? He said: Yes. Abdullah bin Amr, may Allah be pleased with them both, said: I heard the Prophet, peace and blessings be upon him, say: «It is sufficient sin for a man to waste those he sustains.»\n85 - Muhammad informed us, Waki' informed us, from Al-A'mash, from Abu Ishaq, from Wahb bin Jabir Al-Khaywani, from Abdullah bin Amr, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: «It is sufficient sin for a man to waste those he sustains.»\n86 - Muhammad bin Mu'adh informed me, Al-Qa'nabi told us, saying Abdul Aziz told us, from Thawr, from Abu Al-Ghayth, from Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace",
    "foot_note": "1. Ibn Sa'd narrated in Al-Tabaqat (4/82) from Al-Nu'man bin Humaid saying: I entered with my uncle upon Salman in Al-Mada'in, and he was working palm leaves. I heard him say: I buy palm leaves for a dirham, work it, sell it for three dirhams, put back one dirham into it, spend one dirham on my family, and give one dirham in charity. Even if Umar bin Al-Khattab forbade me from it, I would not stop.",
    "book_id": "805",
    "new_page_number": 42
  },
  {
    "serial_number": "1261509",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 40,
    "volume_number": 1,
    "text": "and blessings be upon him, said: «The one who strives for the widow and the poor is like the Mujahid in the cause of Allah, and like the one who stands [in prayer] at night and fasts during the day» (1).\n87 - And Abu Umayyah informed us, Mansur bin Salamah Al-Khuza'i and Abu Al-Jamahir told us, they said: Abdul Aziz bin Muhammad told us, from Thawr, from Abu Al-Ghayth, from Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: «The one who strives for the widow and the poor is like the Mujahid in the cause of Allah, and like the one who stands [in prayer] at night and fasts the day».",
    "foot_note": "1. Narrated by Al-Bukhari (5353) and Muslim (2982).",
    "book_id": "805",
    "new_page_number": 43
  },
  {
    "serial_number": "1261510",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 41,
    "volume_number": 1,
    "text": "And in this Chapter is the Dislike of Reducing Food and Entering Deserts without Provision and Money (1)\n88 - Ubaidullah bin Ibrahim bin Yaqub Al-Halabi (2) informed us, saying: I heard Abu Abd Allah, when Uqba bin Mukram said to him: These people who eat little and reduce their food? He said: «It does not please me. He said: I heard Abdul Rahman bin Mahdi say: A people did this so it cut them off from the obligatory duties» (3).\n89 - Ahmad bin Al-Hussein bin Hassan informed us that a man said to Abu Abd Allah (4): I (5) love to go out to Mecca, so do you order me to do that? He said to him: «If you are able, otherwise no, except with provision and a mount. Do not risk.» (6).\n90 - Ahmad bin Al-Hussein bin Hassan informed me in another place that Abu Abd Allah was asked about a man who enters the desert without provision. He denied it strongly",
    "foot_note": "1. In Al-Asima edition there is an addition: \"nor money\". I did not find it in the manuscripts.\n2. See his biography in Tabaqat Al-Hanabila (2/51). In Al-Asima edition: Al-Jili. In Al-Bashair edition: Al-Hanbali. Both are misspellings.\n3. See Tabaqat Al-Hanabila (2/176 - 178).\n4. In (Z): Asked about the man.\n5. Dropped from (Z).\n6. Ibn Khuzayma titled in his Sahih (4/132): Chapter on the desirability of taking provision for travel in emulation of the Prophet, peace and blessings be upon him, and opposing some Sufis of our time. Then he narrated from Aisha, may Allah be pleased with her, her saying: So the Messenger of Allah, peace and blessings be upon him, came - meaning to Abu Bakr's house - and asked permission, so permission was given to him. The Messenger of Allah, peace and blessings be upon him, said: «Indeed, permission has been given to me to exit (migrate).» Abu Bakr said: Companionship, may my father be your ransom, O Messenger of Allah? The Prophet, peace and blessings be upon him, said «Yes.» Aisha said: «So we equipped them with the quickest equipment and made a food bag for them in a leather sack. Asma bint Abi Bakr cut a piece from her belt and tied the sack with it, so for that she was named Dhat al-Nitaq (Possessor of the Belt).» The Hadith is in Sahih Al-Bukhari (3905).",
    "book_id": "805",
    "new_page_number": 44
  },
  {
    "serial_number": "1261511",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 42,
    "volume_number": 1,
    "text": "and said: «Uff Uff; No No» extending his voice with it, «except with provision and companions and a caravan» (1).\nAbu Bakr Al-Khallal said: Regarding Abu Abd Allah's statement in the first question of Ahmad bin Al-Hussein: «If you are able, otherwise no», if he is able and knows that he is strong enough for that, and does not beg nor look expectantly for himself to take and be given so he accepts, he is like the one relying on Truthfulness (Sidq). The scholars have permitted reliance on Truthfulness, and I will clarify that after this, and based on what Abu Abd Allah, may Allah have mercy on him, also did.\n91 - I heard Abu Bakr Al-Marrudhi say: I heard Abu Abd Allah, may Allah have mercy on him, say: «I performed Hajj five times, two of them on my feet, and fourteen dirhams sufficed some people to Mecca.» I said: Who, O Abu Abd Allah? He said: «Me.» So whoever is capable of this, then yes. But as for risking and going out without provision, while he does not hope this from himself, the scholars have disliked that. And Abu Abd Allah denied heavily upon those relying [falsely] in that.\n92 - Ibrahim bin Al-Khalil (2) informed me that Ahmad bin Nasr Abu Hamid told them, that Abu Abd Allah was asked by a man: Should he go out to Mecca relying [on God] carrying nothing with him? He said: «It does not please me, so from where will he eat?» He said: He relies [on God] so people give him. He said: «So if they do not give him, does he not look expectantly to them until they give him? This does not please me. It has not reached me that anyone of the Companions of the Messenger of Allah, peace and blessings be upon him, or the Tabi'in did this. But he should work and seek and (trade) (3).»",
    "foot_note": "1. See Kitab al-Tawakkul by Abu Ya'la (p. 55).\n2. Abu Ishaq Al-Jallab. See his biography in Kitab al-Irshad by Al-Khalili (2/335).\n3. It seems in (Z): Yataharras (investigates).",
    "book_id": "805",
    "new_page_number": 45
  },
  {
    "serial_number": "1261512",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 43,
    "volume_number": 1,
    "text": "Abu Bakr Al-Marrudhi said regarding this issue: A man from the companions of Ibn Aslam came to Abu Abd Allah and said: What do you say about a man who wants to travel, which is more beloved to you, that he carries provision with him or relies [on God]? Abu Abd Allah, may Allah have mercy on him, said to him: «He carries provision with him and relies [on God]» (1).\n93 - Muhammad bin Ali Al-Simsar informed us that Muhammad bin Musa bin Mushaysh told them that a Khurasani man (2) asked Abu Abd Allah saying: Shall I perform Hajj without provision? He said: «No, work and earn a profession and go out (3). Indeed the Prophet, peace and blessings be upon him, provided his companions.» The Khurasani said: So those who fight and perform Hajj without provision, are they in error? He said: «Yes, they are in error.»\n94 - And Muhammad bin Ahmad bin Jami' Al-Razi (4) informed me, saying I heard Abu Ma'in Al-Hussein bin Al-Hasan Al-Razi (5) say: I witnessed Ahmad bin Hanbal, may Allah be pleased with him, when a man from the people of Khurasan came to him and said: O Abu Abd Allah, I have a dirham - and I think he said: Shall I perform Hajj with this dirham? Ahmad said to him: «Go to Bab Al-Karkh and buy with this dirham a Maund (unit of weight) (6), and carry it on your head until you have three hundred. When you have three hundred, then perform Hajj.» He said: O Abu Abd Allah, what do you think of the people's earnings? Ahmad said: «Look at this wicked one,",
    "foot_note": "1. See Kitab al-Tawakkul by Abu Ya'la (p. 38).\n2. In (Z): Regarding a man.\n3. In Berlin copy: And told him that.\n4. In Berlin copy: Al-Barazi. In Al-Bashair edition: Ahmad bin Muhammad bin Jami'. This is an error.\n5. See Tarikh Dimashq (67/247), and Tarikh al-Islam (20/500) for spelling of his name.\n6. Established from Original and Awqaf. In Berlin copy: Basket. In Talbis Iblis (p. 369): Grains.",
    "book_id": "805",
    "new_page_number": 46
  },
  {
    "serial_number": "1261513",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 44,
    "volume_number": 1,
    "text": "he wants to spoil people's livelihoods for them.» He said: O Abu Abd Allah: «I am relying (Mutawakkil).» He said: «So do you enter the desert alone or with people?» He said: No, with people. He said: «You lied, you are not relying. Enter alone, otherwise you are relying on people's pockets (scabies) (1).»\n95 - Abu Bakr Ahmad bin Muhammad bin Abdullah bin Sadaqa informed me, saying: Ishaq bin Dawud bin Sabih told us, saying I said to Abdul Rahman bin Mahdi: O Abu Said, in our land there are people from these Sufis (2). He said: «Do not approach these people, for we have seen a people from these, some of them the matter drove to madness and some of them drove to heresy (Zandaqa).» Then he said: «Sufyan Al-Thawri went out on a journey and I saw him off, and he had a food bag with Faludhaj (sweet), and it had a lamb.»\n96 - Talib bin Qurrah Al-Adhani informed us, Muhammad bin Isa told us, Ibn Al-Mubarak told us saying: «I did not see a sane person among them» meaning the Sufis (3).\n97 - Ishaq bin Sayyar Al-Nasibi informed us, saying Abdul Malik bin Ziyad Al-Nasibi told me, saying: We were with Malik, so I mentioned to him Sufis in our land,",
    "foot_note": "1. In Berlin copy: Jarayan (flowing).\n2. Sufiyyah is attributed to wearing wool (Suf). Nu'aym bin Hammad narrated in Ziyadat al-Zuhd by Ibn Al-Mubarak (p. 482) and Abu Al-Sheikh Al-Asbahani in Akhlaq al-Nabi (2/234) and the wording is his, from Muhammad bin Sirin that Al-Salt bin Rashid entered upon him wearing a wool jubbah, wool izar, and wool turban. Muhammad was disgusted by him and said: I think people who wear wool say Jesus son of Mary peace be upon him wore it, and one whom I do not suspect told me: That the Messenger of Allah peace be upon him wore linen, cotton, and Yemeni cloaks, and the Sunnah of our Prophet peace be upon him is more worthy to be followed. End quote. See the speech of Sheikh al-Islam Ibn Taymiyyah in Majmu' al-Fatawa (11/6).\n3. Sufyan Al-Thawri said: We saw them abstaining from food, drink and clothing, but if one of them was disputed regarding leadership, he would butt heads like rams. Jami' al-Masa'il by Ibn Taymiyyah - First Group (p. 53).",
    "book_id": "805",
    "new_page_number": 47
  },
  {
    "serial_number": "1261514",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 45,
    "volume_number": 1,
    "text": "I said to him: They wear fine Yemeni clothes, and do such and such. He said: He said to me: «Woe to you, and are they Muslims (1)?» He said: «So he laughed until he lay on his back.» He said: One of those sitting with him said to me: What is this? I have not seen a greater trial upon this Sheikh than you; we have never seen him laughing at all (2).\n98 - Ahmad bin Mansur informed us, Abdul Razzaq told us, Ibn Uyaynah told us, from Abdul Malik, from Al-Sha'bi, regarding a reading (3): {And take provision}: «It is biscuits and dates» (4).\n99 - Ahmad told us saying Abdul Razzaq told us, Ibn Uyaynah told us, from Muhammad bin Sawqa, from Ikrimah. And Ahmad told us saying Abu Nu'aym told us, from Al-Thawri, from Muhammad bin Sawqa, from Said bin Jubayr, regarding His saying: {And take provision} he said: «Biscuits and Sawiq (barley mush)» (5).\n100 - Ahmad informed us, saying Abdul Razzaq told us, Umar bin Dharr told us, saying: I heard Mujahid say: «They used to perform Hajj and not take provision, so concession was made for them regarding provision, so it was revealed: {And take provision, but indeed, the best provision is fear of Allah} (6).»",
    "foot_note": "1. In the two printed editions: Or are they Muslims. Established from Original and other Zahiriyah copy.\n2. Al-Dinawari narrated in Al-Mujalasah (5/55) from Al-Nadr bin Shumayl saying: I said to some Sufis: Will you sell your wool jubbah? He said: If the fisherman sells his net; with what will he fish?\n3. In (Z): His saying.\n4. Narrated by Said bin Mansur in his Tafsir (348) with wording: Biscuits and Sawiq. And Ibn Jarir in his Tafsir (3/499) with wording: Dates and Sawiq.\n5. Narrated by Ibn Jarir in his Tafsir (3/495).\n6. Narrated by Ibn Jarir in his Tafsir (3/496).",
    "book_id": "805",
    "new_page_number": 48
  },
  {
    "serial_number": "1261515",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 46,
    "volume_number": 1,
    "text": "101 - Ahmad told us saying Abdul Razzaq told us, Ibn Uyaynah told us from Amr bin Dinar from Ikrimah who said: They used to perform Hajj without provision so they were ordered to take provision, then He said: The best provision is fear of Allah (1).\n102 - Al-Hasan (2) bin Ahmad Al-Kirmani informed us, saying Abu Bakr told us, Suwayd bin Amr Al-Kalbi (3) told us, from Abu Awanah, from Mughira, from Ibrahim {And take provision, but indeed, the best provision is fear of Allah} he said: «The people of the Arabs used to, when they performed Hajj and reached a mountain path or obstacle, not take provision, and leave the provision, and say: We rely [on God], so they were ordered to take provision» (4).\n103 - Al-Hasan (5) informed us, Abu Bakr told us, Shababah told us, Warqa' told us, from Amr bin Dinar, from Ikrimah, from Ibn Abbas, may Allah be pleased with them both, who said: «People from Yemen used to perform Hajj and not take provision, and say: We are relying (Mutawakkilun), so they perform Hajj and come to Mecca and ask (6) people, so Allah revealed: {And take provision, but indeed, the best provision is fear of Allah}» (7).",
    "foot_note": "1. Narrated by Ibn Jarir in his Tafsir (3/495).\n2. In Awqaf and King Saud University copies and Al-Asima edition: Al-Hussein. This is a misspelling. See his biography in Tarikh al-Islam by Al-Dhahabi (22/124).\n3. In manuscripts it came as: Al-Kinani. And likewise in the two editions. See his biography in Al-Tabaqat by Ibn Sa'd (8/532) and Al-Tarikh Al-Kabir by Al-Bukhari (4/148) and Al-Jarh wa Al-Ta'dil (4/239) and Tahdhib al-Kamal (12/263).\n4. Narrated by Said bin Mansur in his Tafsir (346), and Ibn Jarir in his Tafsir (3/499).\n5. In the two editions: Al-Hussein.\n6. In Awqaf and Berlin copies: They eat from.\n7. Narrated by Al-Bukhari (1523).",
    "book_id": "805",
    "new_page_number": 49
  },
  {
    "serial_number": "1261516",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 47,
    "volume_number": 1,
    "text": "104 - Abdul Rahman bin Abdullah bin Al-Hakam informed us, saying Muhammad bin Amr bin Al-Abbas Al-Bahili told us, Abu Asim told us, from Isa, from Ibn Abi Najih, from Mujahid regarding His saying Almighty: {And take provision} he said: «The people of the horizons used to go out for Hajj, reaching out (1) to people without provision, so they were ordered to take provision» (2).\n105 - Ahmad bin Yahya bin Ata bin Muslim Al-Harrani Al-Bahili informed us, Al-Mughira bin Siqlab told us, Abdul Aziz bin Abi Rawad told us, from Nafi', from Ibn Umar, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, sent an army containing a man called Hudair. That year they were afflicted with hardship from lack of food, so the Messenger of Allah, peace and blessings be upon him, provided them, and forgot to provide Hudair. He said: So Hudair went out patient, seeking reward. He said: Being at the rear of the caravan saying: There is no god but Allah, and Allah is Greatest, and Praise be to Allah, and Glory be to Allah, and there is no power nor strength except by Allah, and saying: Excellent Provision is He, O Lord. He said: He repeats it, being at the rear of the caravan. He said: Gabriel came to the Prophet, peace and blessings be upon him, and said to him: «Indeed my Lord sent me to you to inform you that you provided your companions, and forgot to provide Hudair, while he is at the rear of the caravan saying: There is no god but Allah, and Allah is Greatest, and Praise be to Allah and Glory be to Allah, and there is no power nor strength except by Allah, and saying: Excellent Provision is He, O Lord. He said: For his speech is a light on the Day of Resurrection between heaven and earth, so send him provision.» So the Prophet, peace and blessings be upon him, called a man and gave him Hudair's provision, and ordered him when he reaches him to memorize what he says, so when he gave him the provision he memorized what he said, and said to him:",
    "foot_note": "1. In Awqaf and Berlin copies: Relying. Established from other copies and Tafsir Ibn Jarir Al-Tabari.\n2. Narrated by Ibn Jarir in his Tafsir (3/496).",
    "book_id": "805",
    "new_page_number": 50
  },
  {
    "serial_number": "1261517",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 48,
    "volume_number": 1,
    "text": "«Indeed the Messenger of Allah, peace and blessings be upon him, sends you greetings and mercy of Allah, and informs you that he had forgotten to provide you, and that my Lord Blessed and Exalted sent Gabriel to me reminding me of you, so Gabriel reminded him and informed him of your place.» He said: He reached him while he was saying: There is no god but Allah, and Allah is Greatest, and Glory be to Allah, and Praise be to Allah, and there is no power nor strength except by Allah, and saying: Excellent Provision is He, O Lord. He said: So he approached him, then said to him: Indeed the Messenger of Allah, peace and blessings be upon him, sends you greetings and mercy of Allah, and has sent me to you with provision with me, and says: I only forgot you, so He sent Gabriel to me from heaven reminding me of you. He said: So he praised Allah, and extolled Him, and sent blessings on the Prophet, peace and blessings be upon him, then said (1): Praise be to Allah Lord of the Worlds, my Lord remembered me from above seven heavens, and from above His throne, and had mercy on my hunger and weakness. O Lord, as You did not forget Hudair, make Hudair not forget You. He said: So the man memorized what he said, and returned to the Prophet, peace and blessings be upon him, and informed him of what he heard from him when he came to him, and what he said when he informed him. The Messenger of Allah, peace and blessings be upon him, said: «Beware, indeed if you raised your head to the sky, you would see for his speech a beaming light between heaven and earth» (2).",
    "foot_note": "1. In (Z) addition: The Prophet peace be upon him.\n2. Weak chain, narrated by Ibn Mandah in Ma'rifat al-Sahaba (p. 432), and Abu Nu'aym in Ma'rifat al-Sahaba (2309) from the route of Ahmad bin Yahya with it. Al-Mughira bin Siqlab: Abu Hatim said of him: He is Salih al-Hadith (acceptable). Abu Zur'ah said: He is Jazari, there is no harm in him. Al-Jarh wa Al-Ta'dil (8/224). In Lisan al-Mizan (8/133): Abu Ja'far Al-Nufayli said: He was not trusted. Al-Daraqutni weakened him. Ibn Adi said in Al-Kamil (9/576): Munkar al-Hadith (denounced hadith), and most of what he narrates is not followed. End quote. So his solitariness is not tolerable.",
    "book_id": "805",
    "new_page_number": 51
  },
  {
    "serial_number": "1261518",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 49,
    "volume_number": 1,
    "text": "The Argument Against Those Who Claim They Rely (on God) So They Leave Work\n\n106 - Abu Bakr Al-Marrudhi informed us, saying: I said to Abu Abd Allah: These Mutawakkilah (Claimants of Reliance) who do not trade and do not work, they argue that the Prophet, peace and blessings be upon him, married for a Surah of the Quran, so did he have anything of the world? He said: «And what makes them know that he did not work?» He said: I said: They say: We sit and our provisions are upon Allah Almighty. He said: «This is a bad, malicious statement. Allah Blessed and Exalted says: {When the call is made for prayer on Friday, then hasten to the remembrance of Allah and leave sale}. So what is this but selling and buying?»\n107 - Abdul Samad bin Abdul Warith Al-Himsi told us, saying Yahya bin Salih told us, saying Muhammad bin Umar (1) Al-Makhzumi told us, Abdullah bin Busr Al-Mazini told us, that he used to, when he prayed Friday prayer, go out to the market interpreting this verse: {And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah} to the end of the verse (2).\n108 - And Al-Marrudhi informed us, saying I said to Abu Abd Allah: A group were in Mecca in a mosque, so a man came to them and said: Stand up, take this meat. They said: No, unless you go and grill it and bring it. He said: As for now, he has ordered work. Then he said: If he says: I do not work, and something from what has been worked and earned is brought to him, for what reason does he accept it? I said: He says: This is my provision. He said: He accepts",
    "foot_note": "1. In Original and (Z) and printed editions: Amr. It is an error, rather it is Muhammad bin Umar Al-Tai Al-Mahri, as in his biography in Tahdhib al-Kamal (6/456) and Tarikh al-Islam edited by Tadmuri (12/376). I fear that the word (Al-Mahri) was corrupted to (Al-Makhzumi).\n2. Chain is Hasan.",
    "book_id": "805",
    "new_page_number": 52
  },
  {
    "serial_number": "1261519",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 50,
    "volume_number": 1,
    "text": "from the one who works. «Ali bin Abi Talib, may Allah be pleased with him, used to work until his hand became calloused, and the Companions of the Messenger of Allah, peace and blessings be upon him, used to work» (1).\n109 - Abdullah bin Ahmad informed us, saying I asked my father, may Allah have mercy on him, about a people who say: We rely on Allah and do not earn. He said: People should all rely on Allah Almighty, but they return to themselves with earning. Allah Almighty said {Hasten to the remembrance of Allah and leave sale}. This indicates that they earn and work. And the Prophet, peace and blessings be upon him, said: «Whoever supports two or three daughters gets Paradise» (2). Meaning: Who said contrary to this? This is the saying of a foolish human. He said: And I heard my father, may Allah have mercy on him, say: Independence from people by seeking - meaning work - is more pleasing to us than sitting and waiting for what is in people's hands (3).\n110 - Muhammad bin Yahya Al-Kahhal informed me, that Abu Abd Allah, may Allah have mercy on him, said: It is narrated from the Prophet, peace and blessings be upon him, that he said: «Whoever has three children die who have not reached Hinth (puberty), the Fire will not touch him except for the fulfillment of the oath» (4). I said: Is Hinth puberty (Hulum)? He said: Yes.\n111 - Muhammad bin Ali informed me saying Salih told us, that he asked his father, may Allah have mercy on him, about Tawakkul (Reliance). He said: «Tawakkul is good, but a man should not be a dependent on people. He should work until he enriches himself and his family,",
    "foot_note": "1. See Kitab al-Tawakkul by Abu Ya'la (p. 44).\n2. Narrated by Muslim (2631).\n3. Mentioned by Ibn Muflih in Al-Adab Al-Shar'iyyah (3/276). In Tarikh al-Islam by Al-Dhahabi (4/73): Shu'ba used to say to the people of Hadith: Woe to you, stick to the market, for I am a dependent on my two brothers.\n4. Narrated by Al-Bukhari (1251) and Muslim (2632).",
    "book_id": "805",
    "new_page_number": 53
  },
  {
    "serial_number": "1261520",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 51,
    "volume_number": 1,
    "text": "and not leave work.» He said: And my father, may Allah have mercy on him, was asked - while I was witnessing - about a people who do not work and say: We are relying (Mutawakkilun). He said: «These are innovators» (1).\n112 - Abu Bakr Al-Marrudhi informed us, that he said to Abu Abd Allah, may Allah have mercy on him: Ibn Uyaynah used to say: They are innovators. Abu Abd Allah said: These are evil people, they want to disable the world (2).\n113 - And Abu Bakr Al-Marrudhi informed us, saying I heard Muthanna Al-Anbari say, I heard Bishr bin Al-Harith say: A man should, if he has something he finds good, feed himself with it, and purify himself from these filths.\n114 - And Abdullah bin Ahmad bin Hanbal informed us, saying I said to my father: Do you see if a man earns the sustenance of a day, is it better? He said: «If he earns a surplus and returns it to his relatives, or his neighbor (3), or a weak person (4), it is more beloved to me than not earning, and it is more beloved to me that he abstains (from begging) (5).»\n115 - Muhammad bin Ja'far informed us, that Abu Al-Harith told them saying: I asked",
    "foot_note": "1. Abu Al-Abbas Al-Ajurri said; he said: I asked Ahmad bin Hanbal about a man who sat in his house and said: I do not work and do not ask until my provision comes to me in my house. Ahmad said: This is a man who is ignorant of knowledge. Allah Almighty said: (And others traveling throughout the land seeking the bounty of Allah and others fighting in the cause of Allah) [Al-Muzzammil: 20]; and the Prophet, peace and blessings be upon him, said: «Allah placed my provision under the shadow of my spear», and the Companions of the Messenger of Allah, peace and blessings be upon him, used to trade by land and sea, and they are the role models. Narrated by Al-Dinawari in Al-Mujalasah (2948).\n2. See Al-Adab Al-Shar'iyyah by Ibn Muflih (3/270).\n3. In (Z): His neighbor.\n4. In printed editions: Guest.\n5. In Berlin copy: Be independent.",
    "book_id": "805",
    "new_page_number": 54
  },
  {
    "serial_number": "1261521",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 52,
    "volume_number": 1,
    "text": "Abu Abd Allah, saying: A man leaves work or sits, and says: I do not know anyone but an oppressor or usurper, so I take from their hands, and do not aid them, nor strengthen them in their oppression. He said: No one should leave work, and sit waiting for what is in people's hands. I choose work, and work is more beloved to me. If a man sits and does not have a profession, his soul invites him to take from what is in people's hands. If they give him or prevent him, he occupied himself with work (meaning he should occupy himself). And earning is abandoning greed. And he (peace be upon him) said: «For a man to carry a rope and gather wood then sell it in the market, and become independent by it, is better for him than to ask people, whether they give him or prevent him» (1). So the Prophet, peace and blessings be upon him, informed that work is better than begging. And Allah Almighty said: {Hasten to the remembrance of Allah and leave sale}, so His saying this implies buying and selling. And I choose for the man to move about seeking sustenance, and independence from what is in people's hands, and it is better in my view. I said: There are people here who say: We are Mutawakkilah (Relier's), and we do not see working except with other than oppressors and judges, and that is because I know no one but an oppressor. Abu Abd Allah said: How excellent is reliance on Allah Almighty, but no one should sit and not work anything until this one and that one feeds him. We choose work, and seek provision, and be independent of begging. Independence from people by work is more beloved to me than begging (2).\n116 - And Ahmad told us, Hafs bin Ghiyath told us, from Hisham bin Urwa, from his father, from Al-Zubair, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon",
    "foot_note": "1. Narrated by Al-Bukhari (1470) and Muslim (1042).\n2. Al-Dinawari narrated in Al-Mujalasah wa Jawahir Al-Ilm (7/117): Umar bin Al-Khattab, may Allah be pleased with him, said: I see a man and he pleases me, so I say: Does he have a profession? If they say: No; he falls from my eye.",
    "book_id": "805",
    "new_page_number": 55
  },
  {
    "serial_number": "1261522",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 53,
    "volume_number": 1,
    "text": "him, said: «For a man to carry a rope and gather wood, then come and put it in the market, then the man sells it and becomes independent and spends it on himself, is better for him than to ask people whether they give him or prevent him.»\n117 - Muhammad bin Ismail informed us, Waki' told us, from Hisham bin Urwa, from his father, from Al-Zubair, who said: The Messenger of Allah, peace and blessings be upon him, said: «For a man to carry a rope and gather wood, then come and put it in the market, then the man sells it and becomes independent and spends it on himself, is better for him than to ask people whether they give him or prevent him.»\n118 - Muhammad bin Ismail informed us, Waki' informed us, from Hisham bin Urwa, from his father, from his grandfather, who said: The Messenger of Allah, peace and blessings be upon him, said: «For one of you to take his rope, go to the mountain and bring a bundle of wood on his back, sell it and become independent with its price, is better for him than to ask people whether they give him or prevent him» (1).\n119 - Yahya bin Ja'far informed us, Abdul Wahhab told us, Al-Akhdar bin Ajlan told us, Abu Bakr Al-Hanafi told me, from Anas bin Malik, who said: A man came to the Prophet, peace and blessings be upon him, and complained to him of poverty, then returned and said: O Messenger of Allah, I came to you from a household that I do not see myself returning to them until some of them die. So he said to him: «Go, do you find anything?» He said: So he went and brought a saddle-blanket and a cup. He said: O Messenger of Allah, this saddle-blanket,",
    "foot_note": "1. Ibn Abi Shaybah narrated with a Sahih chain (22628) saying: Waki' told us, he said: Ja'far bin Burqan told us, from Maymun bin Mihran, he said: Ibn Umar contracted a slave of his (for freedom), so he came to him with his installment when it was due. He said: From where did you get this? He said: I was begging and working. He said: Do you want to feed me the filth of people? You are free and your installment is yours.",
    "book_id": "805",
    "new_page_number": 56
  },
  {
    "serial_number": "1261523",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 54,
    "volume_number": 1,
    "text": "they spread part of it and wear part of it. And this cup they drink in. So the Messenger of Allah, peace and blessings be upon him, said: «Who will take them from me for a dirham?» The man said: Me, O Messenger of Allah. The Messenger of Allah, peace and blessings be upon him, said: «Who increases on a dirham?» A man said: I take them for two. He said: «They are yours.» He said: So he called the man and said to him: «Buy an axe for a dirham, and food for your family for a dirham.» He said: So he did. Then he returned to the Prophet, peace and blessings be upon him, so he said: «Go to this valley and do not leave a thorn-bush or thorn or wood, and do not come to me for fifteen days.» So he went and earned ten dirhams. Then he came to the Prophet, peace and blessings be upon him, and informed him. He said: «So go and buy food (for your family) (1) for five dirhams, and clothing for your family for five.» He said: O Messenger of Allah, Allah has blessed me in what you ordered me. He said: «This is better than coming on the Day of Resurrection with a mark of begging in your face. Indeed, begging is not lawful except for three: For one with agonizing blood money (debt), or horrific debt, or abasing poverty» (2).",
    "foot_note": "1. Addition from (Z).\n2. Weak Hadith, narrated by Ahmad (19/182), Abu Dawood (1641), Ibn Majah (2198) and others via Al-Akhdar bin Ajlan with it. Al-Bukhari said of Abu Bakr Al-Hanafi: His Hadith is not correct. Ibn Qattan Al-Fasi said: His integrity is not established so his condition is unknown. Tahdhib al-Tahdhib (6/88). Al-Albani weakened it in Al-Irwa (867).",
    "book_id": "805",
    "new_page_number": 57
  },
  {
    "serial_number": "1261524",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 55,
    "volume_number": 1,
    "text": "Chapter: Comprehensive on Tawakkul for Whoever Uses it With Truthfulness\n\n120 - Abu Bakr Al-Marrudhi informed us, saying: It was said to Abu Abd Allah: What is the truthfulness of reliance on Allah Almighty? He said: «To rely on Allah, and there is no one in his heart from humans whom he hopes will bring him anything. If he is like that, Allah provides for him, and he is relying (Mutawakkil)» (1).\n121 - Abu Bakr told us, in another place, he said: I mentioned Tawakkul to Abu Abd Allah, may Allah have mercy on him, so he permitted it for whoever uses truthfulness in it (2).\n122 - And Abu Bakr informed us, saying: I asked Abu Abd Allah about a man who sat in his house and says: I sit and adhere to patience in the house, and I do not inform anyone of that, while he is one who sees that he should work. He said: If he went out and worked it would be more beloved to me. If he sits, I fear his sitting will lead him to something else. I said: To what does it lead him? He said: It leads him to expect that something will be sent to him. I said: So if something is sent to him he does not take it. He said: This is good. I said to Abu Abd Allah: A man in Mecca said: I will not eat anything until they feed me (3), and he entered the mountain of Abu Qubais. Two men came to him while he was wrapped in a rag and threw a shirt to him, but he did not wear it. So they took his hands and dressed him in the shirt, and placed something before him but he did not eat, until an iron key was placed",
    "foot_note": "1. See Kitab al-Tawakkul by Abu Ya'la (p. 38).\n2. See Al-Furu' (6/181).\n3. In Berlin copy: Feed me.",
    "book_id": "805",
    "new_page_number": 58
  },
  {
    "serial_number": "1261525",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 56,
    "volume_number": 1,
    "text": "in his mouth, and they started shoving into his mouth. Abu Abd Allah laughed and began to wonder. I said to Abu Abd Allah: A man left buying and selling, and committed himself that no gold or silver fall into his hand, and left his houses and did not order anything in them, and he used to walk in the road, so if he saw something thrown, he took from what was cast. Al-Marrudhi said: So I said to the man: What is your proof in this? (I do not see for you) (1) a proof upon it except Abu Mu'awiyah Al-Aswad. The man said: Yes, Uwais Al-Qarni, he used to pass by dunghills and pick up patches. So he confirmed him and said: He was strict on himself. Then he said: Two people came to me asking me about the like of this (2), so he said he passes in the road and finds something like herbs and the like. I said to them: If you engage in a work you expose yourselves (become famous). They said (3): What do we care about fame?\n123 - Muhammad bin Ahmad bin Mansur informed me, saying Al-Mazini asked Bishr bin Al-Harith about Tawakkul. He said: «The Mutawakkil does not rely on Allah to be sufficed (4). If this silver settled in the hearts of the Mutawakkilah (5), they would have cried out to Allah in regret and repentance. But the Mutawakkil, sufficiency from Allah Almighty settles in his heart, so he believes Allah Almighty in what He guaranteed.»\n124 - Al-Hasan bin Abdul Wahhab informed me that Ismail told them, Shurayh told us,",
    "foot_note": "1. In Berlin, Awqaf, and King Saud University copies: What is your evidence for it as proof.\n2. In Berlin copy: That.\n3. Here ends copy (Z).\n4. In Berlin copy: To seclude.\n5. In Berlin copy: Al-Mutawakkilin.",
    "book_id": "805",
    "new_page_number": 59
  },
  {
    "serial_number": "1261526",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 57,
    "volume_number": 1,
    "text": "from Abu Sufyan, from Sufyan, from Abu Sinan, from Said bin Jubayr, who said: «Tawakkul is the sum of faith» (1).\n125 - Al-Hasan informed me: That Ismail (2) told them from Salih bin Hatim, Al-Mu'tamir told us, saying I heard Abdul Jalil bin Atiyyah narrating from Al-Hasan, who said: «Indeed, the reliance of the servant on his Lord is that he knows that Allah is his trust» (3).\n126 - Harb bin Ismail Al-Kirmani informed me, saying Abdul Rahman bin Muhammad bin Salam told me, Hussein bin Ziyad Al-Marwazi (4) told us, saying I heard Sufyan bin Uyaynah say: «The sum of faith (5) is Tawakkul on Allah, and the interpretation of Tawakkul is to be pleased with what is done to him.»\n127 - Al-Duri informed us, Yahya told us, Ali bin Thabit told me, Al-Qasim bin Salman (6) told us, saying I heard Al-Sha'bi say: Indeed, Allah Blessed and Exalted has servants beyond Al-Andalus, as the distance between us and Al-Andalus, who do not see that Allah Almighty was disobeyed by a creation. Their pebbles are pearls and rubies, and their mountains are gold and silver. They do not plow, nor sow, nor work any work. They have trees at their doors having fruit which is their food, and trees having wide leaves which are their clothes (7).",
    "foot_note": "1. Narrated by Ibn Abi Shaybah in his Musannaf (30188).\n2. In King Saud University copy: Al-Hasan bin Ismail.\n3. Narrated by Ibn Abi Al-Dunya in Al-Tawakkul 'ala Allah (18).\n4. In Al-Bashair edition: Al-Marrudhi. See his biography in Al-Jarh wa Al-Ta'dil (3/53) and Al-Thiqat (8/186).\n5. In (Z) copy addition: Upon faith.\n6. In the two printed editions: Al-Qasim bin Sulaiman. This is an error. See his biography in Al-Tarikh Al-Kabir (7/165) and Al-Thiqat (7/336).\n7. See Tarikh Ibn Ma'in narrated by Al-Duri (2117) (3/432).",
    "book_id": "805",
    "new_page_number": 60
  },
  {
    "serial_number": "1261527",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 58,
    "volume_number": 1,
    "text": "128 - Abu Bakr bin Sadaqa informed us, Ali bin Al-Abbas Al-Atrush told us, Abu Bakr Al-Qazzaz (1) told me, saying I heard Shu'aib bin Harb say: A man said to Uwais Al-Qarni: From where is the livelihood? He said: Uwais says to him: Fie on these hearts, they doubted so they do not benefit from admonition (2).",
    "foot_note": "1. In the two printed editions: Al-Raddad. This is an error. Al-Qazzaz is Ahmad bin Al-Mundhir, of the men of Muslim.\n2. In King Saud University copy: Indeed the Quran to these hearts complained. In Awqaf copy without the word (Quran). In Berlin copy the word (thanked) instead of (complained). In Original the word (Quran) is unclear. In Tarikh Dimashq (9/330): .... so how is livelihood? Uwais said: Does doubt mix with these hearts that admonition does not benefit with it? In Fayd al-Qadir by Al-Munawi (4/170): He said: How is livelihood in it (i.e., Sham)? He said: Fie on these hearts, doubt has mixed with them so admonition does not benefit them.",
    "book_id": "805",
    "new_page_number": 61
  },
  {
    "serial_number": "1261528",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 59,
    "volume_number": 1,
    "text": "In the Original Copy: The Book is completed, praise be to Allah alone, and the presentation to the original transmitted from has been reached as much as possible.\nIn the beginning of Berlin Copy under the Book Title: Found at the end of this part: I read all of this part to the Sheikh, the Imam, the Scholar, the Ascetic Shams al-Din Abu Abd Allah Muhammad bin Abdul Rahim bin Abdul Wahid Al-Maqdisi, may Allah reward him with Paradise. He heard it from the Sheikh, the Imam, the Scholar Muwaffaq al-Din, may Allah have mercy on him, who heard it from (Muhammad bin) (1) Ahmad bin Sayyidihim Al-Aziz Al-Maqdisi. And that was in the year six hundred and fifty-five, sixth of Rabi' (Al-Awwal) (2), Saturday, at Al-Diya'iyyah School at the foot of Mount Qasioun outside Damascus. And Ismail bin Ibrahim bin Salim Al-Khabbaz wrote it, and may Allah bless our master Muhammad and all his family and companions.\nAnd the end of Berlin Copy: The Book is completed, and praise be to Allah Lord of the Worlds, and may Allah bless our master Muhammad and all his family and companions. Ended. Amen. Comparison and correction reached exactly. Writing of this book was completed on the morning of Friday, the twenty-second of the good month of Safar, year thirteen hundred and thirty-five Hijri by the hand of the poor, humble Ibrahim bin Abdul Ghani Al-Durubi Al-Baghdadi, may Allah forgive him and his parents. 22/Safar/1335 AH.\nAnd at the end of Awqaf Copy: The Book is completed, and praise be to Allah alone, and may Allah bless",
    "foot_note": "1. Addition from King Saud University copy.\n2. Addition from King Saud University copy.",
    "book_id": "805",
    "new_page_number": 62
  },
  {
    "serial_number": "1261529",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Encouragement to Trade, Industry, and Work, and Denial of Those Who Claim Reliance (Tawakkul) in Abandoning Work, and the Argument Against Them",
    "edition": "First Edition, 1443 AH - 2022 CE",
    "publisher": "No Publisher (at the expense of the editor)",
    "page_number": 60,
    "volume_number": 1,
    "text": "and grant peace to His servant and messenger, our master and prophet Muhammad, and his family after him and his companions. Amen. I finished it on the tenth of Dhu al-Hijjah year 1333 AH. This is the last of what was found of this treatise. And I ask Allah not to make what we learned a calamity against us and that He grants us working with what pleases Him, Glory be to Him and Exalted. O Allah, for its writer and owner and their parents and all Muslims. And praise be to Allah Lord of the Worlds.\nAnd at the end of King Saud University Copy: The Book is completed, and praise be to Allah alone, and may Allah bless and grant peace to our master Muhammad and his family and companions. 1339 AH (1).\nBenefit: Ibn Al-Mubarak said: Beware of trade in camels, for it is gain and loss (debt), and the most beloved trade to me is what has a barrier of safety between its gain and its loss (debt). From Muhadarat al-Udaba by Al-Raghib (2).",
    "foot_note": "1. Then he mentioned the conclusion of reading the treatise mentioned at the beginning of Berlin copy.\n2. (p. 547).",
    "book_id": "805",
    "new_page_number": 63
  }
]