[
  {
    "text": "The Status of the Sunnah in Islam\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Status of the Sunnah in Islam",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 1
  },
  {
    "text": "sn: 3526\nbook_title: منزلة السنة في الإسلام\nbook_link: https://shamela.ws/book/705\nbook_id: 705\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: الدار السلفية - الكويت\nedition: الرابعة - 1404 هـ - 1984 م\npages: 23\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم الحديث\ncategory_id: 10",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Status of the Sunnah in Islam",
    "category_id": "10",
    "category": "Hadith Sciences",
    "new_page_number": 2
  },
  {
    "serial_number": "3378963",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sciences of Hadith. Book: The Status of the Sunnah in Islam. Author: Abu Abd al-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Al-Dar Al-Salafiyyah - Kuwait. Edition: Fourth - 1404 AH - 1984 AD. Number of Pages: 23 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 28 Rabi' al-Awwal 1433.\nBook: The Status of the Sunnah in Islam. Author: Abu Abd al-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Al-Dar Al-Salafiyyah - Kuwait. Edition: Fourth - 1404 AH - 1984 AD. Number of Pages: 23 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 28 Rabi' al-Awwal 1433.\nAuthor: Abu Abd al-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH). Publisher: Al-Dar Al-Salafiyyah - Kuwait. Edition: Fourth - 1404 AH - 1984 AD. Number of Pages: 23 [Book numbering corresponds to the printed version]. Publication Date in Shamela: 28 Rabi' al-Awwal 1433.\n[Book numbering corresponds to the printed version]. Publication Date in Shamela: 28 Rabi' al-Awwal 1433.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 3
  },
  {
    "serial_number": "3378964",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Status of the Sunnah in Islam - Al-Albani",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 4
  },
  {
    "serial_number": "3378965",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 2,
    "volume_number": 1,
    "text": "Copyrights reserved for the publisher. Fourth Edition 1404 AH - 1984 AD. Publisher: Al-Dar Al-Salafiyyah. Hawalli - Tunis Street, opposite Hawalli Governorate. Telephone: 2517420. P.O. Box: 20857 Safat - Kuwait.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 5
  },
  {
    "serial_number": "3378966",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah, and peace and blessings be upon the Messenger of Allah, his family, his companions, and those who follow him. As for what follows:\nThis is a lecture I delivered in the city of Doha, the capital of Qatar, during the blessed month of Ramadan in the year 1392 AH. Some brothers suggested printing it due to the important benefits it contains and the Muslims' need for such material. In response to their request, I am publishing it to generalize its benefit and to preserve the memory and history. We have added some detailed headings to it to help the honorable reader gather its main ideas. I hope Allah, the Mighty and Majestic, writes me down among those who defend His religion and support His law, and that He rewards me for it. Indeed, He is the Most Generous of those asked.\nDamascus, 22 Muharram al-Haram 1394 AH.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 6
  },
  {
    "serial_number": "3378967",
    "category_id": "10",
    "category_en": "Hadith Sciences",
    "category_ar": "علوم الحديث",
    "book_title_en": "The Status of the Sunnah in Islam",
    "book_title_ar": "منزلة السنة في الإسلام",
    "edition": "الرابعة - 1404 هـ - 1984 م",
    "publisher": "الدار السلفية - الكويت",
    "page_number": 4,
    "volume_number": 1,
    "text_en": "The Status of the Sunnah in Islam, and a Clarification that the Qur’an Alone Is Not Sufficient Without It. All praise is due to Allah; we praise Him, seek His help, and ask His forgiveness. We seek refuge in Allah from the evils within ourselves and from our bad deeds. Whomever Allah guides, none can mislead; and whomever He leaves astray, none can guide. I bear witness that there is no deity worthy of worship except Allah, alone without partner, and I bear witness that Muhammad is His servant and Messenger. “O you who believe, fear Allah as He should be feared, and do not die except in a state of submission [to Him]” [Āl ‘Imrān: 102]. “O mankind, fear your Lord, who created you from a single soul, and created from it its mate, and dispersed from both of them many men and women. And fear Allah through whom you ask one another, and the wombs. Indeed, Allah is ever Watchful over you” [al-Nisā’: 1]. “O you who believe, fear Allah and speak words of appropriate justice. He will rectify your deeds for you and forgive your sins. And whoever obeys Allah and His Messenger has certainly attained a great success” [al-Aḥzāb: 70–71]. To proceed: Indeed, the most truthful speech is the Book of Allah, and the best...",
    "text_ar": "منزلة السنة في الإسلام وبيان أنه لا يستغنى عنها بالقرآن إن الحمد لله نحمده ونستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله. {يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ} [آل عمران: 102]، {يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا} [النساء: 1]، {يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا (70) يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا (71)} [الأحزاب: 70، 71]. أما بعد فإن أصدق الحديث كتاب الله وأحسن",
    "foot_note": "None",
    "book_id": "705",
    "text": "",
    "new_page_number": 7,
    "category": "Hadith Sciences"
  },
  {
    "serial_number": "3378968",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 5,
    "volume_number": 1,
    "text": "The guidance is the guidance of Muhammad (peace be upon him), and the worst of matters are newly invented ones, and every newly invented matter is an innovation, and every innovation is misguidance, and every misguidance is in the Fire. To proceed:\nI suspect that I will not be able to offer this noble gathering—especially with the presence of distinguished scholars and virtuous professors—any knowledge that they have not already encompassed. If my suspicion is true, it is enough for me in this speech to be a reminder, following the saying of Allah the Blessed and Exalted: {And remind, for indeed, the reminder benefits the believers} [Adh-Dhariyat: 55].\nI decided that my speech on this blessed night of the great month of Ramadan should not be about clarifying some of its virtues and rulings, the merit of praying at night during it, and similar topics that preachers and guides usually address to benefit those fasting and bring them goodness and blessings. Rather, I chose my talk to be on a very important topic because it is a fundamental principle of the illustrious Sharia, which is clarifying the importance of the Sunnah in Islamic legislation.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 8
  },
  {
    "serial_number": "3378969",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Function of the Sunnah regarding the Quran\nYou all know that Allah the Blessed and Exalted chose Muhammad (peace be upon him) for His prophethood and singled him out for His message. He revealed to him His Book, the Noble Quran, and commanded him in it—among other things—to explain it to the people. The Almighty said: {And We revealed to you the message [i.e., the Qur’an] that you may make clear to the people what was sent down to them} [An-Nahl: 44].\nWhat I see is that this explanation mentioned in this noble verse includes two types of explanation:\nFirst: Explanation of the wording and its arrangement, which is conveying the Quran, not concealing it, and delivering it to the Ummah as Allah the Blessed and Exalted revealed it to his heart (peace be upon him). This is what is meant by His saying: {O Messenger, announce that which has been revealed to you from your Lord} [Al-Ma'idah: 67]. Lady Aisha (may Allah be pleased with her) said in a hadith: \"Whoever tells you that Muhammad concealed anything he was commanded to convey has fabricated a great lie against Allah.\" Then she recited the mentioned verse.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 9
  },
  {
    "serial_number": "3378970",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 7,
    "volume_number": 1,
    "text": "The mentioned [verse].\" [Agreed upon]. In a narration by Muslim: \"If the Messenger of Allah (peace be upon him) were to conceal anything he was commanded to convey, he would have concealed His saying: {And [remember, O Muhammad], when you said to the one on whom Allah bestowed favor and you bestowed favor, 'Keep your wife and fear Allah,' while you concealed within yourself that which Allah is to disclose. And you feared the people, while Allah has more right that you fear Him} [Al-Ahzab: 37].\"\nThe other [type]: Explanation of the meaning of the word, sentence, or verse that the Ummah needs to have explained. This occurs mostly in ambiguous (Mujmal), general (Aam), or absolute (Mutlaq) verses. The Sunnah comes to clarify the ambiguous, specify the general, and restrict the absolute. This happens through his saying (peace be upon him), as well as through his action and approval...\nThe Necessity of the Sunnah to Understand the Quran and Examples of That\nHis saying: {As for the thief, the male and the female, amputate their hands} [Al-Ma'idah: 38] is a good example of this. The 'thief' in it is absolute, as is 'the hand'. The verbal Sunnah explained the first of them and restricted it to the thief who steals a quarter of a dinar, by his saying",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 10
  },
  {
    "serial_number": "3378971",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 8,
    "volume_number": 1,
    "text": "(peace be upon him): \"There is no amputation except for a quarter of a dinar and upwards\" [Agreed upon].\nIt also explained the latter through his action (peace be upon him) or the action of his companions and his approval, for they used to amputate the thief's hand from the joint [wrist], as is known in the books of Hadith. The verbal Sunnah also explained 'the hand' mentioned in the verse of Tayammum: {wipe over your faces and hands} [An-Nisa: 43, Al-Ma'idah: 6] as being the palm as well, by his saying (peace be upon him): \"Tayammum is a strike for the face and the palms\" [Narrated by Ahmad, the two Sheikhs, and others from the hadith of Ammar bin Yasir, may Allah be pleased with them both].\nHere are some other verses that could not be understood correctly according to Allah's intent except through the Sunnah:\n1 - His saying: {They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided} [Al-An'am: 82]. The Companions of the Prophet (peace be upon him) understood His saying: (with injustice) in its general sense which includes every injustice, even if small. Therefore, they found the verse problematic and said: \"O Messenger of Allah, which of us has not mixed his faith with injustice?\" He (peace be upon him) said: \"It is not that. It is",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 11
  },
  {
    "serial_number": "3378972",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 9,
    "volume_number": 1,
    "text": "only Shirk (polytheism). Do you not hear the saying of Luqman: {...indeed, association [with Him] is great injustice} [Luqman: 13]?\" [Agreed upon and others].\n2 - His saying: {And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you...} [An-Nisa: 101]. The apparent meaning of this verse implies that shortening the prayer during travel is conditional upon fear. Therefore, some of the Companions asked the Messenger of Allah (peace be upon him), saying: \"Why do we shorten [prayers] when we are safe?\" He said: \"It is a charity which Allah has bestowed upon you, so accept His charity.\" [Narrated by Muslim].\n3 - His saying: {Prohibited to you are dead animals, blood...} [Al-Ma'idah: 3]. The verbal Sunnah clarified that the dead of locusts and fish, and the liver and spleen from blood, are lawful. He (peace be upon him) said: \"Two dead things and two bloods have been made lawful for us: locusts and whales (meaning fish of all kinds), and the liver and spleen.\" [Narrated by Al-Bayhaqi and others as Marfu' (elevated to the Prophet) and Mawquf (stopped at a Companion). The chain of the Mawquf is authentic, and it has the ruling of Marfu' because it is not said based on opinion].",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 12
  },
  {
    "serial_number": "3378973",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 10,
    "volume_number": 1,
    "text": "4 - His saying: {Say, 'I do not find within that which was revealed to me [anything] forbidden to one who would eat it unless it be a dead animal or blood spilled out or the flesh of swine - for indeed, it is impure - or it be [that slaughtered in] disobedience, dedicated to other than Allah...} [Al-An'am: 145]. Then the Sunnah came and prohibited things not mentioned in this verse, such as his saying (peace be upon him): \"Every predator with a canine tooth and every bird with a claw is prohibited.\" There are other hadiths on this topic prohibiting that. Like his saying (peace be upon him) on the day of Khaybar: \"Allah and His Messenger forbid you from domestic donkeys, for they are impure (Rijs).\" [Agreed upon].\n5 - His saying: {Say, 'Who has forbidden the adornment of Allah which He has produced for His servants and the good [lawful] things of provision?...} [Al-A'raf: 32]. The Sunnah also clarified that some adornment is prohibited. It is proven from the Prophet (peace be upon him) that he went out one day to his companions with silk in one hand and gold in the other and said: \"These two are forbidden for the males of my nation, lawful for their females.\" [Narrated by Al-Hakim and he authenticated it]. The hadiths with this meaning are numerous and known in the \"Two Sahihs\" and others.\nAnd other numerous examples known to the scholars of Hadith and Fiqh.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 13
  },
  {
    "serial_number": "3378974",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 11,
    "volume_number": 1,
    "text": "From the foregoing, O brothers, the importance of the Sunnah in Islamic legislation becomes clear to us. If we re-examine the mentioned examples, let alone others we did not mention, we become certain that there is no way to understand the Noble Quran correctly except in conjunction with the Sunnah.\nIn the first example, the Companions understood (Injustice/Zulm) mentioned in the verse according to its apparent meaning. Even though they were (may Allah be pleased with them)—as Ibn Masud said—(the best of this Ummah, the most righteous in heart, the deepest in knowledge, and the least in affectation), they still erred in that understanding. Were it not that the Prophet (peace be upon him) turned them away from their error and guided them that the correct meaning of the mentioned (Injustice) is Shirk, we would have followed them in their error. But Allah the Blessed and Exalted protected us from that by the grace of his guidance (peace be upon him) and his Sunnah.\nIn the second example: Were it not for the mentioned hadith, we would have remained in doubt, at least, regarding shortening the prayer during travel in a state of safety, if not gone to the view that fear is a condition for it, as is the apparent meaning of the verse and as occurred to some Companions, were it not that they saw the Messenger of Allah (peace be upon him) shortening it and they shortened it with him while they were safe.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 14
  },
  {
    "serial_number": "3378975",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 12,
    "volume_number": 1,
    "text": "In the third example: Were it not for the hadith as well, we would have forbidden good things made lawful for us: locusts, fish, liver, and spleen.\nIn the fourth example: Were it not for the hadiths, some of which we mentioned, we would have deemed lawful what Allah forbade upon us through the tongue of His Prophet (peace be upon him) from predators and birds with claws.\nSimilarly, the fifth example: Were it not for the hadiths in it, we would have deemed lawful what Allah forbade through the tongue of His Prophet from gold and silk. Hence, some of the Salaf said: The Sunnah judges upon the Book.\n\nThe Misguidance of Those Who Dispense with the Sunnah using the Quran\nIt is regrettable that among some contemporary exegetes and writers, there are those who have gone to allow what was mentioned in the last two examples regarding the permissibility of eating predators and wearing gold and silk, relying on the Quran alone. Indeed, there exists at present a group calling themselves (Quranists) who interpret the Quran",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 15
  },
  {
    "serial_number": "3378976",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 13,
    "volume_number": 1,
    "text": "according to their whims and intellects without seeking help in that from the authentic Sunnah. Rather, the Sunnah to them is subordinate to their whims; whatever agrees with them they cling to, and whatever does not agree with them they cast behind their backs.\nIt is as if the Prophet (peace be upon him) pointed to these people with his saying in the authentic hadith: \"Let me not find one of you reclining on his couch when a command of what I have commanded or forbidden comes to him, and he says: 'I do not know. What we found in the Book of Allah, we followed.'\" [Narrated by At-Tirmidhi]. In another narration: \"What we found in it unlawful, we declared unlawful. Beware! I have been given the Quran and the like of it with it.\" And in another: \"Beware! What the Messenger of Allah has forbidden is like what Allah has forbidden.\"\nIndeed, it is regrettable that some virtuous writers authored a book on the Sharia of Islam and its creed and mentioned in its introduction that they authored it having no references except the Quran!\nThis authentic hadith indicates decisively that the Islamic Sharia is not Quran alone; rather, it is Quran and Sunnah. So whoever holds to one without the other has not held to either of them, because each of them commands holding to the other, as",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 16
  },
  {
    "serial_number": "3378977",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Almighty said: {He who obeys the Messenger has obeyed Allah...} [An-Nisa: 80].\nAnd He said: {But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.} [An-Nisa: 65].\nAnd He said: {It is not for a believing man or a believing woman, when Allah and His Messenger have decided a matter, that they should [thereafter] have any choice about their affair. And whoever disobeys Allah and His Messenger has certainly strayed into clear error.} [Al-Ahzab: 36].\nAnd He said: {...And whatever the Messenger has given you - take; and what he has forbidden you - refrain from...} [Al-Hashr: 7].\nOn the occasion of this verse, I am pleased by what is proven from Ibn Masud (may Allah be pleased with him), which is that a woman came to him and said: \"Are you the one who says: Allah has cursed the plucker of eyebrows and those who have them plucked, and those who tattoo... the hadith?\" He said: \"Yes.\" She said: \"I have read the Book of Allah from its beginning to its end and I did not find in it what you say.\" He said to her: \"If you had read it, you would have found it. Did you not read: {And whatever the Messenger has given you - take; and what he has forbidden you - refrain from} [Al-Hashr: 7]?\" She said: \"Yes.\" He said: \"I heard the Messenger of Allah (peace be upon him) say: Allah has cursed the plucker of eyebrows... the hadith.\" [Agreed upon].",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 17
  },
  {
    "serial_number": "3378978",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 15,
    "volume_number": 1,
    "text": "Insufficiency of Language to Understand the Quran\nFrom the foregoing, it appears clearly that there is no scope for anyone, no matter how knowledgeable in the Arabic language and its literature, to understand the Noble Quran without seeking help in that from the verbal and practical Sunnah of the Prophet (peace be upon him). For he was not more knowledgeable in the language than the Companions of the Prophet (peace be upon him), in whose language the Quran was revealed, and which had not yet been tainted by the impurity of foreign influence, slang, and grammatical errors. Yet, they erred in understanding the previous verses when they relied on their language alone.\nAccordingly, it is self-evident that the more a person is knowledgeable of the Sunnah, the more likely he is to understand the Quran and deduce rulings from it than one who is ignorant of it. So how about one who does not consider it or pay attention to it at all?\nTherefore, it was among the agreed-upon rules among the people of knowledge: That the Quran is interpreted by the Quran and the Sunnah (1), then by the sayings of",
    "foot_note": "1. (1) We did not say as is common among many scholars: The Quran is interpreted by the Quran, if there is no Sunnah, then by the Sunnah, because of what will be explained at the end of this treatise when discussing the hadith of Mu'adh bin Jabal (may Allah be pleased with him).",
    "book_id": "705",
    "new_page_number": 18
  },
  {
    "serial_number": "3378979",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 16,
    "volume_number": 1,
    "text": "the Companions... etc. From this, the misguidance of the theologians (Scholars of Kalam), ancient and modern, and their contradiction of the Salaf (may Allah be pleased with them) in their creeds, let alone their rulings, becomes clear to us. It is their distance from the Sunnah and knowledge of it, and their judging by their intellects and desires in the verses of Attributes and others.\nHow excellent is what came in \"Sharh al-Aqidah al-Tahawiyyah\" (p. 212, Fourth Edition): ((And how can one speak on the fundamentals of religion who does not receive it from the Book and the Sunnah, but receives it from the saying of so-and-so? And if he claims he takes it from the Book of Allah, he does not take the interpretation of the Book of Allah from the hadiths of the Messenger (peace be upon him), nor does he look into them, nor into what the Companions and those who followed them in goodness said, which is transmitted to us from the trustworthy ones selected by the critics. For they did not transmit the wording of the Quran alone, but transmitted its wording and its meaning. They did not learn the Quran as children learn it, but learned it with its meanings. And whoever does not follow their path",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 19
  },
  {
    "serial_number": "3378980",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 17,
    "volume_number": 1,
    "text": "speaks only from his opinion. And whoever speaks from his opinion and what he thinks is the religion of Allah, and did not receive that from the Book, he is sinful (!) even if he is correct. And whoever takes from the Book and the Sunnah is rewarded even if he errs. But if he is correct, his reward is doubled)).\nThen he said (p. 217): (So the obligation is complete submission to the Messenger (peace be upon him), compliance with his command, receiving his news with acceptance and belief without opposing it with a false imagination we call reasonable, or carrying a doubt or suspicion, or advancing upon it the opinions of men and the rubbish of their minds. So we single him out (peace be upon him) with judgment, submission, compliance, and obedience, just as we single out the Sender, Glory be to Him, with worship, humility, submission, repentance, and reliance).\nIn summary: It is obligatory upon all Muslims not to separate between the Quran and the Sunnah regarding the obligation of taking both of them and establishing legislation upon them together. For this is the guarantee for them not to deviate right or left and not to turn back in misguidance, as the Messenger of Allah (peace be upon him) clearly stated",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 20
  },
  {
    "serial_number": "3378981",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 18,
    "volume_number": 1,
    "text": "by his saying: \"I have left among you two things; you will never go astray as long as you hold fast to them: the Book of Allah and my Sunnah. And they will not separate until they come to me at the Pond (Al-Hawd).\" Narrated by Malik as Balagh (reaching him) and Al-Hakim connected with a good chain.\n\n... Important Note\nIt is self-evident after this to say: The Sunnah that has this importance in legislation is only the Sunnah proven from the Prophet (peace be upon him) by scientific methods and authentic chains known to the scholars of Hadith and its narrators.\nIt is not what is in the bellies of various books of Tafsir (exegesis), Fiqh (jurisprudence), Targhib and Tarhib (encouragement and warning), Raqa'iq (heart-softeners), sermons, and others. For in them are many weak, rejected (Munkar), and fabricated (Mawdu') hadiths, and some of which Islam is innocent of. Such as the hadith of Harut and Marut and the story of the Cranes (Gharaniq). I have",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 21
  },
  {
    "serial_number": "3378982",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 19,
    "volume_number": 1,
    "text": "a specific treatise invalidating it which is printed (1). I have verified a large group of them in my huge book \"Silsilat al-Ahadith al-Da'ifah wal-Mawdu'ah wa Atharuha al-Sayyi' fil-Ummah\" (Series of Weak and Fabricated Hadiths and their Evil Effect on the Ummah). Their number has reached so far nearly four thousand hadiths (2), ranging between weak and fabricated, and only five hundred of them have been printed!\nSo it is obligatory upon the people of knowledge, especially those who spread their jurisprudence and fatwas among people, not to dare to argue with a hadith except after confirming its authenticity. For the books of Fiqh they usually refer to are filled with flimsy, rejected hadiths and baseless ones, as is known to scholars.\nI had started a project I considered important and very useful for those occupied with Fiqh, which I named \"Weak and Fabricated Hadiths in the Mother Books of Fiqh.\" I mean by them:\n1 - Al-Hidayah by Al-Marghinani in Hanafi Fiqh.",
    "foot_note": "1. (1) Its name is \"Nasb al-Majaniq fi Nasf Qissat al-Gharaniq,\" printed by the Islamic Office.\n2. The number has now exceeded five thousand, and perhaps Allah will facilitate its printing soon.",
    "book_id": "705",
    "new_page_number": 22
  },
  {
    "serial_number": "3378983",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 20,
    "volume_number": 1,
    "text": "2 - Al-Mudawwanah by Ibn al-Qasim in Maliki Fiqh.\n3 - Sharh al-Wajiz by Al-Rafi'i in Shafi'i Fiqh.\n4 - Al-Mughni by Ibn Qudamah in Hanbali Fiqh.\n5 - Bidayat al-Mujtahid by Ibn Rushd Al-Andalusi in Comparative Fiqh.\nHowever, I was not able to complete it - unfortunately - because the Kuwaiti magazine (Al-Wa'i Al-Islami), which promised to publish it and welcomed it when they saw it, did not publish it.\nSince I missed that, perhaps I will be successful on another occasion, if Allah Almighty wills, to set for my brothers occupied with Fiqh a precise scientific methodology that helps them and facilitates for them the way to know the grade of a hadith by referring to the sources that must be referred to from the books of Hadith, explaining their properties and features and what can be relied upon from them. And Allah Almighty is the Grantor of success.\n***",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 23
  },
  {
    "serial_number": "3378984",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 21,
    "volume_number": 1,
    "text": "The Weakness of the Hadith of Mu'adh regarding Opinion (Ra'y) and What is Reprehensible in it\nBefore I end this speech of mine, I see that I must draw the attention of the brothers present to a famous hadith that is rarely absent from a book of Usul al-Fiqh (Principles of Jurisprudence), due to its weakness in terms of its chain and its contradiction with what we concluded in this speech regarding the impermissibility of differentiating in legislation between the Book and the Sunnah and the obligation of taking both together.\nThat is the hadith of Mu'adh bin Jabal - may Allah be pleased with him - that the Prophet (peace be upon him) said to him when he sent him to Yemen: \"By what will you judge?\" He said: \"By the Book of Allah.\" He said: \"If you do not find [it there]?\" He said: \"By the Sunnah of the Messenger of Allah.\" He said: \"If you do not find [it there]?\" He said: \"I will strive with my opinion (Ijtihad) and I will spare no effort.\" He said: \"Praise be to Allah who guided the messenger of the Messenger of Allah to what the Messenger of Allah loves.\"\nAs for the weakness of its chain, there is no room to explain it now, and I have explained that thoroughly, perhaps unprecedentedly, in the aforementioned Series (1). Suffice it for me now to mention that the Commander of the Faithful in",
    "foot_note": "1. (1) It is number 885 in the mentioned Series, and we hope the volume containing it will be printed soon, Allah willing.",
    "book_id": "705",
    "new_page_number": 24
  },
  {
    "serial_number": "3378985",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 22,
    "volume_number": 1,
    "text": "Hadith, Imam Al-Bukhari, may Allah Almighty have mercy on him, said about it: (A rejected [Munkar] hadith).\nAfter this, it is permissible for me to proceed in explaining the contradiction I pointed to. So I say: This hadith of Mu'adh sets a methodology for the judge in judgment in three stages. It does not allow searching for the ruling in opinion except after not finding it in the Sunnah, nor in the Sunnah except after not finding it in the Quran.\nRegarding opinion, this is a correct methodology according to all scholars. Likewise, they said: If the narration (Athar) is present, speculation becomes invalid. However, regarding the Sunnah, it is not correct because the Sunnah judges over the Book of Allah and explains it. So it is obligatory to search for the ruling in the Sunnah even if one thinks it exists in the Book, due to what we mentioned.\nSo the Sunnah with the Quran is not like opinion with the Sunnah. No, and again no. Rather, the Book and the Sunnah must be considered a single source with no separation between them ever. As indicated by his saying (peace be upon him): \"Beware! I have been given the Quran and the like of it with it,\" meaning the Sunnah. And his saying: \"They will not separate until they come to me at the Pond.\" So the mentioned classification between them is incorrect because it implies separation between them, and this is invalid as previously explained.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 25
  },
  {
    "serial_number": "3378986",
    "category_id": "10",
    "category": "Hadith Sciences",
    "book_title": "The Status of the Sunnah in Islam",
    "edition": "Fourth - 1404 AH - 1984 AD",
    "publisher": "Al-Dar Al-Salafiyyah - Kuwait",
    "page_number": 23,
    "volume_number": 1,
    "text": "This is what I wanted to draw attention to. If I am correct, it is from Allah. And if I erred, it is from myself. I ask Allah Almighty to protect us and you from slipping and from everything that does not please Him. And our final prayer is that praise be to Allah, Lord of the worlds.",
    "foot_note": "None",
    "book_id": "705",
    "new_page_number": 26
  }
]