[
  {
    "text": "Summary of Funeral Rulings\nAuthor: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nYear: 1420",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Summary of Funeral Rulings",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 1
  },
  {
    "text": "sn: 4509\nbook_title: تلخيص أحكام الجنائز\nbook_link: https://shamela.ws/book/11108\nbook_id: 11108\nauthor_name: أبو عبد الرحمن محمد ناصر الدين بن الحاج نوح بن نجاتي بن آدم الأشقودري الألباني\nauthor_year: 1420\nnickname: أبو عبد الرحمن\nauthor_link: https://shamela.ws/author/414\nauthor_ID: 414\neditor: Null\npublisher: مكتبة المعارف\nedition: الثالثة\npages: 94\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الفقه العام\ncategory_id: 18",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Summary of Funeral Rulings",
    "category_id": "18",
    "category": "General Fiqh",
    "new_page_number": 2
  },
  {
    "serial_number": "4356453",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Jurisprudence\nBook: Summary of Funeral Rulings (Talkhis Ahkam al-Jana'iz)\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Summary of Funeral Rulings\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Abu Abdur-Rahman Muhammad Nasir al-Din, bin al-Hajj Nuh bin Najati bin Adam, al-Ashqudari al-Albani (Died 1420 AH)\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches the printed version]\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431\n\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 3
  },
  {
    "serial_number": "4356454",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\nIndeed, all praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomsoever Allah guides, none can lead astray, and whomsoever He leaves astray, none can guide. I testify that there is no deity worthy of worship except Allah alone, having no partners, and I testify that Muhammad is His slave and Messenger.\n\nTo proceed: The interest of facilitating the review of funeral rulings necessitated that I summarize them and bring their rulings closer to those who wish to refer to them and gain a quick general idea about them, especially when an occasion arises, such as the death of a relative or a loved one. It is no secret that referring to my book 'Ahkam al-Jana'iz wa Bida'uha' (Funeral Rulings and Their Innovations), reading it entirely, and comprehending all the necessary rulings contained within it during such a situation is not feasible for most people.\n\nTherefore, I saw fit to summarize it and bring its benefits closer to the general readers. By doing so, I would have fulfilled the desire of that dear brother who was the direct reason for composing 'Al-Ahkam', as I mentioned in its introduction. It is a desire shared by many who love the Prophetic Sunnah and are keen on reviving it in various lands of the world, both Arab and non-Arab. Some even proceeded in Egypt to abridge the book without my permission or knowledge. Perhaps they intended only the reward in the Hereafter. However, many publishers and printers have started stealing my books and printing them to trade in them and consume their profits as illicit gain. The insolence of some of them reached the point where they printed on it the phrase 'Printed by The Islamic Office', thereby being a lying deceiver. We used to complain, and still do, about the theft of books and printing them as they are using the offset method. But lo and behold, this particular one had the audacity to print it by typesetting the letters and printing it anew, deceiving people that it is from the print of 'The Islamic Office' by printing the name of the Office on it. It has reached me that some of them issued a fatwa permitting the theft of books, printing them, and trading in them without the permission of their author and publisher. This is flagrant injustice and dishonorable exploitation of the efforts of others among authors and publishers who have taken writing and publishing as one of the most honorable means of earning a lawful livelihood. How does it befit a Muslim, nay even a disbeliever, to cut off the livelihood of these people and consume the profit of their efforts and toil himself, let alone issuing a fatwa permitting it? By Allah, it is indeed one of the great [sins]!",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 4
  },
  {
    "serial_number": "4356455",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 6,
    "volume_number": 1,
    "text": "It is strange that Western men become aware of such injustice and enact just laws to protect the rights of authors and publishers and to intervene between thieves and their injustice, yet some Muslims do not notice it, even though they know that their religion prohibits injustice absolutely, as in the saying of the Exalted in the Hadith Qudsi: 'O My servants, I have forbidden injustice for Myself and have made it forbidden amongst you, so do not oppress one another...' Narrated by Muslim in his Sahih. And the saying of the Prophet (peace and blessings of Allah be upon him): 'Beware of injustice, for injustice will be darknesses on the Day of Resurrection.' Narrated by Al-Bukhari and Muslim.\n\nI have heard from some foolish people who have no understanding that they deem such theft permissible under the pretext of spreading knowledge. Allah knows that the thieves have no concern for spreading knowledge; rather, their concern is gathering money through the efforts of others. The proof is that they may print books that do not please them from a scholarly or madhhab perspective, and that is only because they know of their popularity and people's demand for them. Yet, they proceed to print and steal them, acting upon the rule of those who have no morals: 'the end justifies the means'. Allah is their reckoner. {And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.\"} [Al-Furqan: 27].\n\nKnow, O noble reader, that in this summary, I have omitted the referencing (Takhrij) of the hadiths, sufficing with the original source, and because we adhered to authenticity in it as is our custom in all our writings, praise be to Allah always and forever. I also deleted some of its texts and many of the comments that do not have a strong connection to the subject of the book, and I added a few benefits that were not in the original.\n\nI ask Allah to make it beneficial for the Muslims and to make it, like its original and all my other writings, an aid for them in following the Book and the Sunnah and in resuming the Islamic life, to which there is no way except through beneficial knowledge and righteous action. Indeed, He is Hearing and Responsive.\n\nAmman - Jordan, 13 Jumada al-Akhira, 1402 AH.\nMuhammad Nasir al-Din al-Albani.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 5
  },
  {
    "serial_number": "4356456",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 7,
    "volume_number": 1,
    "text": "1- What is obligatory upon the sick person\n\n1 - The sick person must be satisfied with the decree of Allah, be patient with His destiny, and think well of his Lord. That is better for him, due to the saying of the Prophet (peace and blessings of Allah be upon him): 'How wonderful is the affair of the believer; his affair is all good, and this is for no one except the believer. If prosperity befalls him, he is thankful, so it is good for him. And if adversity befalls him, he is patient, so it is good for him.' And his saying (peace and blessings of Allah be upon him): 'None of you should die except while he thinks well of Allah the Exalted.'\n\n2 - He should be between fear and hope; fearing Allah's punishment for his sins and hoping for the mercy of his Lord, due to the hadith of Anas known in Al-Tirmidhi and others: That the Prophet (peace and blessings of Allah be upon him) entered upon a young man who was dying and said: 'How do you find yourself?' He said: 'By Allah, O Messenger of Allah, indeed I hope in Allah and I fear my sins.' The Messenger of Allah (peace and blessings of Allah be upon him) said: 'These two do not gather in the heart of a servant in such a situation except that Allah gives him what he hopes for and secures him from what he fears.'\n\n3 - No matter how severe the illness becomes, it is not permissible for him to wish for death. [Authentic]. If he must do so, let him say: 'O Allah, keep me alive as long as life is good for me, and cause me to die if death is better for me.'\n\n4 - If he has rights [debts/obligations] owed to others, he must restore them to their owners if that is easy for him; otherwise, he must advise [make a will] regarding them, due to his command (peace and blessings of Allah be upon him) regarding that.\n\n5 - One must hasten with such a will, due to his saying (peace and blessings of Allah be upon him): 'It is not right for a Muslim man who has something he wants to make a bequest about to sleep for two nights except that his will is written at his head.' Ibn Umar said:",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 6
  },
  {
    "serial_number": "4356457",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 8,
    "volume_number": 1,
    "text": "'No night has passed me since I heard the Messenger of Allah (peace and blessings of Allah be upon him) say that, except that my will is with me.'\n\n6 - He must make a bequest for relatives who do not inherit from him, due to the saying of Allah the Blessed and Exalted: {Prescribed for you when death approaches [any] one of you if he leaves wealth [is that he should make] a bequest for the parents and near relatives according to what is acceptable - a duty upon the righteous.} [Al-Baqarah: 180].\n\n7 - [Authentic]. He may bequeath one-third of his wealth, and it is not permissible to exceed that. Rather, it is better to reduce it, due to the hadith of Sa'd bin Abi Waqqas (may Allah be pleased with him) established in the Two Sahihs: 'I was with the Messenger of Allah (peace and blessings of Allah be upon him) during the Farewell Pilgrimage, and I became sick with an illness that brought me to the brink of death. The Messenger of Allah (peace and blessings of Allah be upon him) visited me, so I said: O Messenger of Allah, I have much wealth and no one inherits from me except a daughter of mine. Shall I bequeath two-thirds of my money? He said: No. I said: Half of my money? He said: No. I said: Then one-third of my money? He said: The third, and the third is much. Indeed, O Sa'd, that you leave your heirs rich is better for you than leaving them dependent, begging from people.' And he gestured with his hand, 'Indeed, O Sa'd, you will never spend a specific amount seeking thereby the Face of Allah the Exalted except that you will be rewarded for it, even the morsel you place in the mouth of your wife.' He said: So afterwards, the third became permissible. And due to the saying of Ibn Abbas (may Allah be pleased with him): 'I wish people would reduce from the third to the quarter in the will, because the Prophet (peace and blessings of Allah be upon him) said: The third is much.'\n\n8 - Two just Muslim men should witness that. If they cannot be found, then two men from non-Muslims, provided that verification is sought from them in case of doubt regarding their testimony, as explained in the saying of Allah the Blessed and Exalted: {O you who have believed, testimony [should be taken] among you when death approaches one of you at the time of bequest - [that of] two just men from among you or two others from outside if you are traveling through the land and the disaster of death should strike you. Detain them after the prayer and let them swear by Allah if you doubt, [saying], \"We will not exchange it...",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 7
  },
  {
    "serial_number": "4356458",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 9,
    "volume_number": 1,
    "text": "...for a price, even if he should be a near relative, and we will not conceal the testimony of Allah. Indeed, we would then be of the sinful.\" But if it is found that those two were guilty of sin, then two others shall stand in their place [who are] foremost [in claim] from those who have a lawful right. And let them swear by Allah, \"Our testimony is truer than their testimony, and we have not transgressed. Indeed, we would then be of the wrongdoers.\"} {That is more likely that they will give testimony according to its [true] objective or fear that oaths will be taken after their oaths. And fear Allah and listen; and Allah does not guide the defiantly disobedient people.} [Al-Ma'idah: 106-108].\n\n9 - As for a bequest to parents and relatives who inherit from the testator, it is not permissible because it is abrogated by the verse of inheritance. The Messenger of Allah (peace and blessings of Allah be upon him) clarified this most perfectly in his sermon during the Farewell Pilgrimage, saying: 'Indeed, Allah has given every one with a right his right, so there is no bequest for an heir.'\n\n10 - It is prohibited to cause harm in the will, such as bequeathing to deprive some heirs of their right to inheritance or favoring some over others in it, due to the saying of Allah the Blessed and Exalted: {For men is a share of what the parents and close relatives leave... from what is little or much - an obligatory share.} ... Then He said: {...after any bequest he [may have] made or debt, not being harmful [to the heirs]. An ordinance from Allah, and Allah is Knowing and Forbearing.} [An-Nisa: 7, 12]. And due to his saying (peace and blessings of Allah be upon him): 'There should be no harming and no reciprocation of harm. Whoever harms [others], Allah will harm him, and whoever causes difficulty, Allah will cause difficulty for him.'\n\n11 - An unjust will is void and rejected, due to his saying (peace and blessings of Allah be upon him): 'Whoever introduces into this matter of ours that which is not from it, it is rejected.'",
    "foot_note": "1. Meaning: If it is discovered that the two witnesses who swore the oath deserved sin by lying and concealing in the testimony, or by treachery and concealing something of the estate while trusted with it, then the obligation, or what is done to establish the truth, is that the oath returns to the heirs. Two other men stand in their place from the relatives of the deceased who are his heirs, those against whom the first two committed the sin by offending them and betraying them. This is in Tafsir al-Manar, and refer to the complete discussion in it 7/222.",
    "book_id": "11108",
    "new_page_number": 8
  },
  {
    "serial_number": "4356459",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 10,
    "volume_number": 1,
    "text": "12 - Since innovation in religion has become prevalent among many people in this time, especially regarding funerals, it has become obligatory for a Muslim to leave a will that he be prepared and buried according to the Sunnah, acting upon the saying of the Exalted: {O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.} [At-Tahrim: 6].\n\nFor this reason, the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) used to leave wills to that effect. The reports from them regarding what we mentioned are numerous; refer to them in the original [book]. Among them: From Hudhayfah who said: 'If I die, do not proclaim my death to anyone, for I fear that it would be a form of Na'i (forbidden death announcement), and I heard the Messenger of Allah (peace and blessings of Allah be upon him) forbidding Na'i.'\n\nFor this reason, Al-Nawawi, may Allah have mercy on him, said in Al-Adhkar: 'It is recommended for him, a confirmed recommendation, to advise them to avoid the innovations that have become customary in funerals, and to emphasize the covenant regarding that.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 9
  },
  {
    "serial_number": "4356460",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 11,
    "volume_number": 1,
    "text": "Prompting the Dying (Talqin)\n\n13 - If death approaches him, then those present must do several things:\n\nA - They should prompt him to say the Shahada, due to his saying (peace and blessings of Allah be upon him): 'Prompt your dying ones to say La ilaha illa Allah. Whoever's last words are La ilaha illa Allah at death will enter Paradise one day in time, even if he is afflicted before that with whatever he is afflicted.'\n\nB & C - They should supplicate for him and say nothing but good in his presence, due to his saying (peace and blessings of Allah be upon him): 'If you visit the sick or the dead, then say good, for the angels say Amen to what you say.'\n\n14 - Prompting (Talqin) is not merely mentioning the Shahada in the presence of the dying person and letting him hear it; rather, it is commanding him to say it, contrary to what some think. The proof is the hadith of Anas (may Allah be pleased with him): That the Messenger of Allah (peace and blessings of Allah be upon him) visited a man from the Ansar and said: 'O Uncle, say: La ilaha illa Allah.' He said: '[Am I] a maternal uncle or a paternal uncle?' He said: 'Rather, a maternal uncle.' He said: 'Is it better for me to say: La ilaha illa Allah?' The Prophet (peace and blessings of Allah be upon him) said: 'Yes.'\n\n15 - As for reading Surah Ya-Sin in his presence and directing him towards the Qiblah, no hadith is authentic regarding this. Rather, Sa'id bin al-Musayyib disliked directing him towards it and said: 'Is the dead person not a Muslim?' Narrated from Zur'ah bin Abdur-Rahman that he attended Sa'id bin al-Musayyib during his illness, and Abu Salamah bin Abdur-Rahman was with him. Sa'id fainted, so Abu Salamah ordered that his bed be turned towards the Kaaba. When he woke up, he said: 'Did you turn my bed?' They said: 'Yes.' He looked at Abu Salamah and said: 'I think it was by your knowledge?' He said: 'I ordered them.' So Sa'id ordered that his bed be returned [to its original position].",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 10
  },
  {
    "serial_number": "4356461",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 12,
    "volume_number": 1,
    "text": "16 - There is no harm for a Muslim to attend the death of a disbeliever to present Islam to him in the hope that he accepts it, due to the hadith of Anas (may Allah be pleased with him) who said: A Jewish boy used to serve the Prophet (peace and blessings of Allah be upon him), and he fell sick. The Prophet (peace and blessings of Allah be upon him) came to visit him and sat by his head. He said to him: 'Accept Islam.' He looked at his father who was with him. He [the father] said to him: 'Obey Abu al-Qasim.' So he accepted Islam. The Prophet (peace and blessings of Allah be upon him) went out saying: 'Praise be to Allah who saved him from the Fire.' When he died, he said: 'Pray over your companion.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 11
  },
  {
    "serial_number": "4356462",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 13,
    "volume_number": 1,
    "text": "3- What is incumbent upon those present after his death.\n\n17 - If he passes away and the soul departs, they must do several things:\n\nA & B - They should close his eyes and supplicate for him as well, due to the hadith of Umm Salamah who said: The Messenger of Allah (peace and blessings of Allah be upon him) entered upon Abu Salamah while his eyes were fixed open. He closed them and then said: 'Indeed, when the soul is taken, the sight follows it.' Some people from his family wailed, so he said: 'Do not supplicate against yourselves except for good, for the angels say Amen to what you say.' Then he said: 'O Allah, forgive Abu Salamah, raise his degree among the guided, grant him a successor in his descendants who remain, forgive us and him, O Lord of the worlds, make his grave spacious for him, and illuminate it for him.'\n\nC - They should cover him with a garment that conceals his entire body, due to the hadith of Aisha (may Allah be pleased with her): That the Messenger of Allah (peace and blessings of Allah be upon him), when he passed away, was covered with a Hibara garment [a type of Yemeni sheet].\n\nD - This applies to someone who did not die while in the state of Ihram. As for the Muhrim, his head and face are not covered, due to the hadith of Ibn Abbas who said: While a man was standing at Arafat, he fell from his mount and it broke his neck [or he said: killed him]. The Prophet (peace and blessings of Allah be upon him) said: 'Wash him with water and sidr (lote-tree leaves) and shroud him in two garments' - and in a narration: 'in his two garments in which he assumed Ihram'... 'And do not embalm him' - and in a narration: 'do not apply perfume to him, and do not cover his head or his face, for he will be resurrected on the Day of Resurrection reciting the Talbiyah.'\n\nE - They should hasten to prepare him and take him out if his death is confirmed, due to the hadith of Abu Hurayrah (may Allah be pleased with him), traceable to the Prophet: 'Hasten with the funeral...' The Hadith will follow in full in Issue 50.\n\nF - They should bury him in the land where he died and not transfer him to another, because that contradicts the hastening commanded in the hadith of Abu Hurayrah mentioned previously.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 12
  },
  {
    "serial_number": "4356463",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 14,
    "volume_number": 1,
    "text": "Therefore, Aisha said when a brother of hers died in the valley of Abyssinia and was carried from his place: 'Nothing I feel within myself or that saddens me creates regret except that I wish he had been buried in his place.' Al-Nawawi said in Al-Adhkar: 'If he directed in his will to be transferred to another land, his will is not executed, for the transfer is forbidden (Haram) according to the correct chosen view stated by the majority and explicitly mentioned by the investigators.'\n\nG - Some of them should hasten to pay off his debt from his wealth, even if it consumes all of it. If he has no wealth, the state must pay it on his behalf if he had striven to pay it. If the state does not do so, and some people volunteer to do it, it is permissible. There are hadiths regarding this which you can see in the original [book].",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 13
  },
  {
    "serial_number": "4356464",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 15,
    "volume_number": 1,
    "text": "4- What is permissible for those present and others.\n\n18 - It is permissible for them to uncover the face of the deceased and kiss him between his eyes, due to Abu Bakr kissing the Prophet (peace and blessings of Allah be upon him) after his death, and weeping over him for three days. This is due to the authentic hadith of Aisha (may Allah be pleased with her) who said: Abu Bakr (may Allah be pleased with him) came on his horse from his dwelling in Al-Sunh until he dismounted. He entered the mosque while Umar was speaking to the people. He did not speak to the people until he entered upon Aisha (may Allah be pleased with her) and approached the Prophet (peace and blessings of Allah be upon him), who was covered with a Hibara garment. He uncovered his face, then leaned over him and kissed him between his eyes, then wept and said: 'May my father and mother be sacrificed for you, O Prophet of Allah. Allah will not combine two deaths upon you. As for the death which was written for you, you have died it.' And in a narration: 'You have died the death after which you will never die.'\n\nAnd the hadith of Abdullah bin Ja'far (may Allah be pleased with him): That the Prophet (peace and blessings of Allah be upon him) gave the family of Ja'far three days respite to come to them, then he came to them and said: 'Do not weep over my brother after this day.' ... The Hadith. Its wording will come in the section on Condolences, if Allah the Exalted wills. [Authentic].\n\nAnd the hadith of Anas (may Allah be pleased with him) who said: We entered with the Messenger of Allah (peace and blessings of Allah be upon him) upon Abu Sayf - who was the wet nurse's husband for Ibrahim (peace be upon him). The Messenger of Allah (peace and blessings of Allah be upon him) took Ibrahim, kissed him, and smelled him. Then we entered upon him after that while Ibrahim was breathing his last. The eyes of the Messenger of Allah (peace and blessings of Allah be upon him) began to shed tears. Abdur-Rahman bin Awf said to him: 'Even you, O Messenger of Allah?' He said: 'O Ibn Awf, indeed it is mercy.' Then he followed it with another [tear] and said: 'Indeed the eye tears and the heart grieves, and we do not say except what pleases our Lord. And indeed, by your separation, O Ibrahim, we are saddened.'",
    "foot_note": "1. Meaning the husband of Ibrahim's (peace be upon him) wet nurse.",
    "book_id": "11108",
    "new_page_number": 14
  },
  {
    "serial_number": "4356465",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 16,
    "volume_number": 1,
    "text": "5- What is obligatory upon the relatives of the deceased.\n\n19 - When the news of his death reaches the relatives of the deceased, two things are obligatory upon them:\n\nFirst: Patience and acceptance of the decree, due to the saying of the Exalted: {And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient, Who, when disaster strikes them, say, \"Indeed we belong to Allah, and indeed to Him we will return.\" Those are the ones upon whom are blessings from their Lord and mercy. And it is those who are the [rightly] guided.} [Al-Baqarah: 155-157]. And due to the hadith of Anas bin Malik (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) passed by a woman at a grave who was weeping. He said to her: 'Fear Allah and be patient.' She said: 'Go away from me, for you have not been afflicted with my calamity.' He said: She did not recognize him. It was said to her: 'He is the Messenger of Allah (peace and blessings of Allah be upon him).' She was seized by something like death. She came to the door of the Messenger of Allah (peace and blessings of Allah be upon him) and did not find doorkeepers there. She said: 'O Messenger of Allah, I did not recognize you.' The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Indeed, patience is at the first shock.'\n\nPatience over the death of children has a great reward, and many hadiths have come regarding that. I mention some of them:\n\nFirst: 'No two Muslims have three children die who have not reached the age of puberty except that Allah and their parents enter Paradise by the virtue of His mercy.' He said: 'And they will be at one of the gates of Paradise, and it will be said to them: Enter Paradise. They will say: Not until our parents come. It will be said to them: Enter Paradise, you and your parents, by the virtue of Allah's mercy.'\n\nSecond: 'Any woman who has three children die, they will be a screen for her from the Fire.' A woman said: 'And two?' He said: 'And two.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 15
  },
  {
    "serial_number": "4356466",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 17,
    "volume_number": 1,
    "text": "Second: Istirja', which is to say: 'Inna lillahi wa inna ilayhi raji'un' (Indeed we belong to Allah, and indeed to Him we will return) based on the preceding verse. And one adds to it his saying: 'O Allah, reward me in my calamity and replace it for me with something better than it', due to the hadith of Umm Salamah in Sahih Muslim and others.\n\n20 - It does not contradict patience for a woman to refrain from all adornment in mourning for the death of her child or other than him, provided she does not exceed three days, except for her husband, for whom she mourns four months and ten days. This is due to the hadith of Zaynab bint Abi Salamah who said: I entered upon Umm Habibah, the wife of the Prophet (peace and blessings of Allah be upon him), and she said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: 'It is not lawful for a woman who believes in Allah and the Last Day to mourn for a dead person more than three nights, except for a husband, [for whom she mourns] four months and ten days.' Then I entered upon Zaynab bint Jahsh when her brother died. She called for perfume and applied it, then said: 'I have no need for perfume, except that I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: ...' and she mentioned the hadith.\n\n21 - However, if she does not mourn for other than her husband to please the husband and to fulfill his need for her, it is better for her, and much good is hoped for both of them from that, as happened to Umm Sulaym and her husband Abu Talha al-Ansari (may Allah be pleased with them both). Their story regarding that is long, and were it not for that, I would have cited it here; so let it be referred to in the original [book].",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 16
  },
  {
    "serial_number": "4356467",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 18,
    "volume_number": 1,
    "text": "6- What is prohibited for the relatives of the deceased.\n\n22 - The Messenger of Allah (peace and blessings of Allah be upon him) prohibited matters that some people used to commit - and still do - when a death occurs among them. It is obligatory to know them to avoid them, so they must be clarified:\n\nA - Wailing (Niyaha). There are many hadiths regarding it which you can see in the original, among them his saying (peace and blessings of Allah be upon him): 'Two things in people are Kufr (disbelief/ingratitude) for them: Defaming lineage and wailing over the dead.'\n\nB & C - Slapping cheeks and tearing pockets (garments), due to his saying (peace and blessings of Allah be upon him): 'He is not of us who slaps the cheeks, tears the pockets, and calls with the call of Jahiliyyah (Pre-Islamic ignorance).'\n\nD - Shaving the hair, due to the hadith of Abu Burdah bin Abi Musa who said: [Authentic] Abu Musa became sick with an illness and fainted, and his head was in the lap of a woman from his family. A woman from his family screamed, but he was unable to answer her with anything. When he woke up, he said: 'I am innocent of whom the Messenger of Allah (peace and blessings of Allah be upon him) declared himself innocent. Indeed, the Messenger of Allah (peace and blessings of Allah be upon him) declared himself innocent of the Saliqah, the Haliqah, and the Shaqqah.'\n\nE - Spreading the hair (disheveling), due to the hadith of a woman among those who pledged allegiance, who said: Among what the Messenger of Allah (peace and blessings of Allah be upon him) took from us in the pledge of righteousness that we would not disobey him in, was that we should not scratch a face, nor call out 'Woe', nor tear a pocket, nor spread hair.\n\nF - Some men letting their beards grow for a few days in grief for their deceased, then when the days pass, they return to shaving them. This letting grow is in the meaning of spreading the hair as is apparent. Added to that, it is an innovation, and he (peace and blessings of Allah be upon him) said: 'Every innovation is a misguidance, and every misguidance is in the Fire.'",
    "foot_note": "1. It is an action beyond weeping. Ibn al-Arabi said: Niyaha is what the people of Jahiliyyah used to do; women would stand facing each other, screaming, throwing dust on their heads, and hitting their faces. Quoted by Al-Ubbi on Muslim.\n2. She is the one who raises her voice during the calamity of death.",
    "book_id": "11108",
    "new_page_number": 17
  },
  {
    "serial_number": "4356468",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 19,
    "volume_number": 1,
    "text": "Knowing that adorning oneself by shaving it - as most do - is a manifest disobedience by the agreement of the four Imams and others, due to its contradiction of various legal evidences as you can see clarified in 'Adab al-Zafaf' (Etiquette of Wedding) p. 118 – 123.\n\nG - Announcing his death from the tops of minarets and similar places, because it is from Na'i (forbidden announcement). It is established from Hudhayfah bin al-Yaman that: 'When a dead person died among his [family], he would say: Do not proclaim him to anyone, for I fear that it would be Na'i. Indeed, I heard the Messenger of Allah (peace and blessings of Allah be upon him) forbidding Na'i.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 18
  },
  {
    "serial_number": "4356469",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 20,
    "volume_number": 1,
    "text": "7- Permissible Announcement (Na'i)\n\n23 - It is permissible to announce the death if it is not accompanied by what resembles the Na'i of Jahiliyyah. This may become obligatory if there is no one with him to fulfill his rights of washing, shrouding, and praying over him, and similar matters, due to the hadith of Abu Hurayrah: 'That the Messenger of Allah (peace and blessings of Allah be upon him) announced the death of Al-Najashi on the day he died...' The Hadith.\n\n24 - It is recommended for the informer to ask people to seek forgiveness for the deceased, due to his saying (peace and blessings of Allah be upon him) in the story of his prayer over Al-Najashi: 'Seek forgiveness for your brother.' This will be discussed in Issue 60 / Seventh.\n\nI say: So the saying of people in some countries: 'Al-Fatihah for the soul of so-and-so' is contrary to the mentioned Sunnah, so it is an innovation without doubt, especially since recitation does not reach the dead according to the correct view, as will be discussed if Allah the Exalted wills.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 19
  },
  {
    "serial_number": "4356470",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 21,
    "volume_number": 1,
    "text": "8- Signs of a Good Ending.\n\n25 - Furthermore, the Wise Lawgiver has set clear signs by which a good ending can be inferred - Allah has written them for us by His grace and favor. So whoever dies with one of them, it is a glad tiding for him, and what a glad tiding it is.\n\nFirst: Pronouncing the Shahada at death. There are hadiths mentioned in the original regarding this, including his saying (peace and blessings of Allah be upon him): 'He whose last words are La ilaha illa Allah enters Paradise.'\n\nSecond: Dying with sweat on the forehead, due to the hadith of Buraydah bin al-Hasib (may Allah be pleased with him): [Authentic] That he was in Khurasan and visited a brother of his who was sick. He found him dying, and behold, he was sweating on his forehead. He said: 'Allah is Great! I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: The death of a believer is with sweat on the forehead.'\n\nThird: [The hadith is Hasan or Sahih with the sum of its paths] Dying on the night of Friday or its day, due to his saying (peace and blessings of Allah be upon him): 'There is no Muslim who dies on Friday or the night of Friday except that Allah protects him from the trial of the grave.'\n\nFourth: Martyrdom on the battlefield. Allah the Exalted said: {And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision. Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them - that there will be no fear concerning them, nor will they grieve. They receive good tidings of favor from Allah and bounty and [of the fact] that Allah does not allow the reward of believers to be lost.} [Al-Imran: 169-171]. And he (peace and blessings of Allah be upon him) said: 'The martyr has six qualities with Allah: He is forgiven with the first flow of his blood, he sees his seat in Paradise, he is protected from the punishment of the grave, he is secured from the Greatest Terror, he is adorned with the garment of faith, he is married to the Hoor al-Ayn, and he intercedes for seventy people of his relatives.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 20
  },
  {
    "serial_number": "4356471",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 22,
    "volume_number": 1,
    "text": "Fifth: Dying as a fighter (Ghazi) in the cause of Allah, due to his saying (peace and blessings of Allah be upon him): 'What do you consider the martyr among you?' They said: 'O Messenger of Allah, whoever is killed in the cause of Allah is a martyr.' He said: 'Indeed, the martyrs of my nation would then be few.' They said: 'Then who are they, O Messenger of Allah?' He said: 'Whoever is killed in the cause of Allah is a martyr, whoever dies in the cause of Allah is a martyr, whoever dies of the plague is a martyr, whoever dies of an abdominal ailment is a martyr, and the drowned person is a martyr.'\n\nSixth: Dying of the plague. There are hadiths regarding it, including his saying (peace and blessings of Allah be upon him): 'The plague is martyrdom for every Muslim.'\n\nSeventh: Dying of an abdominal ailment, due to his saying (peace and blessings of Allah be upon him) in the previous hadith: 'And whoever dies in the belly [abdominal ailment] is a martyr.'\n\nEighth and Ninth: Dying by drowning and by a building collapsing, due to his saying (peace and blessings of Allah be upon him): 'The martyrs are five: The one who dies of plague, the one with an abdominal ailment, the drowned, the one who dies under debris, and the martyr in the cause of Allah.'\n\nTenth: The death of a woman in her postpartum period due to her child, due to the hadith of Ubadah bin al-Samit: That the Messenger of Allah (peace and blessings of Allah be upon him) visited Abdullah bin Rawahah. He said: He moved aside from his bed for him. He said: 'Do you know who the martyrs of my nation are?' They said: 'Being killed as a Muslim is martyrdom.' He said: 'Indeed, the martyrs of my nation would then be few. Being killed as a Muslim is martyrdom, the plague is martyrdom, and the woman killed by her child [in childbirth] - Jum'aa - is martyrdom; her child drags her by his umbilical cord into Paradise.'",
    "foot_note": "1. Meaning by abdominal disease, which is dropsy and swelling of the belly. It is said: It is diarrhea. And it is said: The one who complains of his belly.\n2. Even by riding the sea for trade if he was not disobedient and safety was thought probable, as said by Sheikh al-Islam Ibn Taymiyyah in Majmoo' al-Fatawa 24/293.\n3. With an un-dotted 'Ha' and emphasized 'Waw', meaning he moved away.\n4. She is the one who dies with a child in her womb. See the statement of Al-Nihaya in the upcoming comment shortly.\n5. 'Surar' is what remains after cutting from what the midwife cuts. And 'Surr' is what she cuts. It is also 'Surr' with a Damma.",
    "book_id": "11108",
    "new_page_number": 21
  },
  {
    "serial_number": "4356472",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 23,
    "volume_number": 1,
    "text": "Eleventh and Twelfth: Death by burning and Pleurisy. There are hadiths regarding this, the most famous being from Jabir bin Atik, traceable to the Prophet: 'Martyrs are seven besides killing in the cause of Allah: The one who dies of plague is a martyr, the drowned is a martyr, the one with pleurisy is a martyr, the one with an abdominal ailment is a martyr, the one who dies by burning is a martyr, the one who dies under debris is a martyr, and the woman who dies with a child (Jum'aa) is a martyr.'\n\nThirteenth: Death by Tuberculosis, due to his saying (peace and blessings of Allah be upon him): 'Killing in the cause of Allah is martyrdom, the woman in childbirth is martyrdom, burning is martyrdom, drowning is martyrdom, tuberculosis is martyrdom, and the belly [ailment] is martyrdom.'\n\nFourteenth: Dying in defense of property intended to be usurped. There are hadiths regarding this, including: 'Whoever is killed protecting his property' - and in a narration: 'Whoever's property is sought without right and he fights and is killed, then he is a martyr.'\n\nFifteenth and Sixteenth: Dying in defense of religion and self, due to his saying (peace and blessings of Allah be upon him): 'Whoever is killed protecting his property is a martyr, whoever is killed protecting his family is a martyr, whoever is killed protecting his religion is a martyr, and whoever is killed protecting his blood is a martyr.'",
    "foot_note": "1. It is a hot tumor that appears in the membrane lining the ribs.\n2. In Al-Nihaya: Meaning she dies with a child in her womb. It is said she is the one who dies as a virgin. 'Jum'aa' with a Damma is like 'Mujma', similar to 'Dhukhr' meaning 'Mudhukhur'. Al-Kisa'i pronounced the Jeem with a Kasra. The meaning is that she died with something gathered in her, not separated from her, whether a pregnancy or virginity. I say: The intent here is pregnancy definitively due to the evidence of the previous hadith in the tenth point with the wording 'killed by her child Jum'aa'.\n3. With two Fathas (Haraq). And likewise 'Gharaq' (Drowning), as in Hashiyat al-Musnad by al-Sindi vol 1/301, Maktabat Sheikh al-Islam in Medina.",
    "book_id": "11108",
    "new_page_number": 22
  },
  {
    "serial_number": "4356473",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 24,
    "volume_number": 1,
    "text": "Seventeenth: Dying while guarding in the cause of Allah (Murabit). There are two hadiths about it, one of them: 'Guarding for a day and a night is better than fasting a month and praying during it. And if he dies, the deeds he used to do continue for him, his provision is extended for him, and he is secured from the Tempter [of the grave].'\n\nEighteenth: Dying upon a righteous deed, due to his saying (peace and blessings of Allah be upon him): 'Whoever says La ilaha illa Allah seeking the Face of Allah and his life is sealed with it enters Paradise. Whoever fasts a day seeking the Face of Allah and his life is sealed with it enters Paradise. And whoever gives charity seeking the Face of Allah and his life is sealed with it enters Paradise.'\n\nNineteenth: One whom a tyrant ruler kills because he stood up to him and advised him, due to his saying (peace and blessings of Allah be upon him): 'The master of martyrs is Hamza bin Abdul-Muttalib, and a man who stood up to a tyrant ruler, ordered him and forbade him, so he killed him.' Narrated by Al-Hakim who authenticated it, and Al-Khatib.",
    "foot_note": "1. I say on this occasion: My older brother Muhammad Naji Abu Ahmad passed away in the pilgrimage season of last year 1401 [AH] upon a righteous deed, if Allah wills, at the Jamarat on the last of the Days of Tashreeq. He was sitting with some of his pilgrim companions, and some of them mentioned to me that one of those sitting with him offered him a cup of tea with his left hand. He said to him: 'O my brother, give with your right hand and do not oppose the Sunnah' - or as he said - and he died instantly. May Allah have mercy on him and gather us and him with the Prophets, the Truthful, the Martyrs, and the Righteous, and excellent are those as companions.\n2. See the verification of the discussion on it and the explanation of its authenticity in Al-Sahihah 374. Including what you do not see in [other] books. And praise be to Allah by whose grace good deeds are completed.",
    "book_id": "11108",
    "new_page_number": 23
  },
  {
    "serial_number": "4356474",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 25,
    "volume_number": 1,
    "text": "9- People's praise of the deceased.\n\n26 - Praise with good for the deceased from a group of truthful Muslims - the least being two of his neighbors who knew him, from people of righteousness and knowledge - necessitates Paradise for him. There are hadiths regarding this:\n\nFirst: From Anas (may Allah be pleased with him) who said: A funeral passed by the Prophet (peace and blessings of Allah be upon him) and it was praised with good, and tongues followed one another with good. They said: 'He used to - as far as we know - love Allah and His Messenger.' So the Prophet of Allah (peace and blessings of Allah be upon him) said: 'It has become binding, it has become binding, it has become binding.' Then a funeral passed and it was praised with evil, and tongues followed one another with evil. They said: 'What a wretched man he was in the religion of Allah.' So the Prophet of Allah (peace and blessings of Allah be upon him) said: 'It has become binding, it has become binding, it has become binding.' Umar said: 'May my father and mother be sacrificed for you. A funeral passed and was praised with good, so you said: It has become binding, it has become binding, it has become binding. And a funeral passed and was praised with evil, so you said: It has become binding, it has become binding, it has become binding?' The Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever you praised with good, Paradise has become binding for him. And whoever you praised with evil, the Fire has become binding for him. The angels are witnesses in Allah in the heaven, and you are Allah's witnesses on earth, you are Allah's witnesses on earth, you are Allah's witnesses on earth.' And in a narration: 'And the believers are Allah's witnesses on earth; indeed, Allah has angels who speak upon the tongues of the sons of Adam regarding what is in a person of good and evil.'\n\nSecond: From Abu al-Aswad al-Dili who said: I came to Medina while a disease had occurred in it, and they were dying a rapid death. I sat with Umar bin al-Khattab (may Allah be pleased with him), and a funeral passed by, and it was praised with good. Umar said: 'It is binding.' I said: 'What is binding, O Commander of the Faithful?' He said: 'I said as the Prophet (peace and blessings of Allah be upon him) said: Any Muslim for whom four testify with good, Allah enters him into Paradise.' We said: 'And three?' He said: 'And three.' We said: 'And two?' He said: 'And two.' Then we did not ask him about one.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 24
  },
  {
    "serial_number": "4356475",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 26,
    "volume_number": 1,
    "text": "Third: 'No Muslim dies and four from the people of the households of his nearest neighbors testify that they do not know anything but good about him, except that Allah the Blessed and Exalted says: I have accepted your statement - or he said: your testimony - and I have forgiven him for what you do not know.'\n\nKnow that the sum of these three hadiths indicates that this testimony is not specific to the Companions, but it is also for those after them among the believers who follow their path in faith, knowledge, and truthfulness. Al-Hafiz Ibn Hajar asserted this in Al-Fath, so let whoever wants more explanation refer to his words.\n\nFurthermore, the restriction of the testimony to four in the third hadith appears to have been before the hadith of Umar which preceded it, for in it [Umar's hadith] the testimony of two is sufficient, and it is the reliance.\n\nAs for people's saying after the funeral prayer: 'What do you testify regarding him? Testify good for him,' and they answer by saying: 'Righteous' or 'From the people of goodness' and similar things, this is not what is intended by the hadith at all. Rather, it is an ugly innovation because it was not from the practice of the Salaf (Predecessors), and because those who testify to that do not know the deceased in most cases. Indeed, they may testify contrary to what they know in response to the desire of the one asking for testimony of good, thinking that this benefits the deceased, and being ignorant that the beneficial testimony is only that which matches reality in the soul of the witness, as indicated by his saying in the hadith: 'Indeed, Allah has angels who speak upon the tongues of the sons of Adam regarding what is in a person of good and evil.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 25
  },
  {
    "serial_number": "4356476",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 27,
    "volume_number": 1,
    "text": "Death during Eclipses?\n\n27 - If the death of someone coincides with the eclipse of the sun or the moon, this does not indicate anything. Believing that it indicates the greatness of the deceased is merely from the superstitions of Jahiliyyah which the Messenger of Allah (peace and blessings of Allah be upon him) invalidated the day his son Ibrahim (peace be upon him) died and the sun eclipsed. He addressed the people, praised Allah and extolled Him, then said: [Authentic] 'To proceed, O people, indeed the people of Jahiliyyah used to say: The sun and the moon do not eclipse except for the death of a great person. Indeed, they are two signs from the signs of Allah; they do not eclipse for the death of anyone nor for his life. Rather, Allah frightens His servants with them. So if you see anything of that, then hasten to His remembrance, supplicating Him, seeking His forgiveness, giving charity, freeing slaves, and praying in the mosques until it clears.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 26
  },
  {
    "serial_number": "4356477",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat Al-Ma'arif",
    "page_number": 28,
    "volume_number": 1,
    "text": "10- Washing the Dead (Ghusl)\n\n28 - When the dead person dies, it is obligatory upon a group of people to hasten to wash him. As for hastening, its evidence has preceded in Chapter Three, Issue 17, Paragraph E. As for the obligation of washing, it is due to his command (peace and blessings of Allah be upon him) regarding it in more than one hadith:\n\nFirst: His saying (peace and blessings of Allah be upon him) regarding the Muhrim whose she-camel broke his neck: 'Wash him with water and sidr...' The Hadith. It has passed in full in the indicated Issue, Paragraph D.\n\nSecond: His saying (peace and blessings of Allah be upon him) regarding his daughter Zaynab (may Allah be pleased with her): 'Wash her three times, or five, or seven... or more than that...' The Hadith, and it will come in full in the following Issue.\n\n29 - The following matters are observed in washing him:\n\nFirst: Washing him three times or more, according to what those undertaking his washing see fit.\n\nSecond: That the washings be odd in number.\n\nThird: That sidr or what takes its place in cleaning, such as potash (ushnan) and soap, be combined with some of them.\n\nFourth: That some perfume be mixed with the last washing, and camphor is preferable.\n\nFifth: Undoing the braids and washing them thoroughly.\n\nSixth: Combing his hair.\n\nSeventh: Making it into three braids for a woman and placing them behind her.\n\nEighth: Starting with his right side and the places of ablution (Wudu).\n\nNinth: That men undertake washing a male and women undertake washing a female, except what is exempted as will be clarified.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 27
  },
  {
    "serial_number": "4356478",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 29,
    "volume_number": 1,
    "text": "The evidence for these matters is the Hadith of Umm Atiyyah (may Allah be pleased with her), who said: [Authentic] The Prophet (peace and blessings of Allah be upon him) entered upon us while we were washing his daughter Zainab, and he said: 'Wash her three, five, or seven times, or more than that if you see fit.' She said: I said: 'An odd number?' He said: 'Yes, and put camphor or something of camphor in the last washing. Then when you have finished, notify me.' So when we finished, we notified him, and he threw his *haqw* (waist wrapper) 1 to us and said: 'Make it her *shi'ar* (undergarment)' 2, meaning his Izar (lower garment). She said: And we combed her hair into three braids. In a narration: We undid it, washed it, and braided her hair into three thirds: her two horns (sides) and her forelock, and we threw them behind her. She said: And he said to us: 'Start with her right side and the places of ablution on her.'\n\nTenth: That he be washed with a cloth or the like under a cover for his body after stripping him of all his clothes, for that is how the practice was during the time of the Prophet (peace and blessings of Allah be upon him), as indicated by the Hadith of Aisha (may Allah be pleased with her): When they wanted to wash the Prophet (peace and blessings of Allah be upon him), they said: 'By Allah, we do not know whether to strip the Messenger of Allah (peace and blessings of Allah be upon him) of his clothes as we strip our dead, or to wash him while his clothes are upon him?' When they differed, Allah cast sleep upon them until there was not a man among them but his chin was on his chest. Then a speaker spoke to them from the side of the house, they did not know who he was: 'Wash the Prophet (peace and blessings of Allah be upon him) while his clothes are upon him.' So they stood up to the Messenger of Allah (peace and blessings of Allah be upon him) and washed him while his shirt was on him, pouring water over the shirt and rubbing him with the shirt and not their hands. Aisha used to say: 'If I had known beforehand what I know now, no one would have washed him except his wives.'",
    "foot_note": "1. 1 Meaning his Izar. Ibn Al-Athir said: The origin of *Al-Haqw* is the place where the Izar is tied (the waist), and its plural is *Ahuq* and *Ahqa'*, then the Izar was named by it due to proximity.\n2. 2 Meaning make it her *Shi'ar*. The *Shi'ar* is the garment that touches the body directly because it touches the hair (*Sha'r*).",
    "book_id": "11108",
    "new_page_number": 28
  },
  {
    "serial_number": "4356479",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 30,
    "volume_number": 1,
    "text": "Eleventh: [Good/Hasan] The purpose of covering his body and using a cloth is so that his *'Awrah* (private parts) are not seen or touched. The *'Awrah* of a man is from the navel to the knee according to the correct view, due to his saying (peace and blessings of Allah be upon him): 'What is between the navel and the knee is *'Awrah*.' 1 [Authentic] And his saying (peace and blessings of Allah be upon him): 'The thigh is *'Awrah*.' 2 As for a woman with a Muslim woman - naturally - she is *'Awrah* except for the places of adornment, which are the head, the ear, the neck, and the upper chest (place of the necklace), and the forearm with part of the upper arm (place of the armband), and the foot and lower leg (place of the anklet). Whatever is other than that is *'Awrah*; it is not permissible for a woman - like the *Mahrams* - to look at any of it, nor for her to reveal it, due to the explicit saying of Allah the Exalted: {And not display their adornment except what is apparent thereof and let them wrap their headcovers over their chests and not display their adornment except to their husbands, their fathers, their husbands' fathers, their sons, their husbands' sons, their brothers, their brothers' sons, their sisters' sons, or their women...} the Verse 3.\n\nTwelfth: An exception to what was mentioned in point four is the *Muhrim* (pilgrim in state of consecration); it is not permissible to perfume him, due to his saying in the Hadith referred to shortly before: 'Do not put *Hanoot* (perfume) on him,' and in a narration: 'And do not perfume him... for he will be resurrected on the Day of Judgment reciting the Talbiyah.'\n\nThirteenth: Also exempted from what was mentioned in point nine are the spouses. It is permissible for each of them to wash the other, as there is no evidence to prevent it, and the default ruling is permissibility, especially since it is supported by two Hadiths:\nThe First: [Authentic] The saying of Aisha (may Allah be pleased with her) in her previously mentioned Hadith: 'If I had known beforehand what I know now, no one would have washed the Prophet (peace and blessings of Allah be upon him) except his wives.'",
    "foot_note": "1. 1 See its extraction in Irwa' al-Ghalil 269, 271.\n2. 2 See its extraction in Irwa' al-Ghalil 269, 271.\n3. 3 The saying that the *'Awrah* of a woman with a woman is like the *'Awrah* of a man with a man is something for which I know no basis; rather, it is contrary to the mentioned Verse.",
    "book_id": "11108",
    "new_page_number": 29
  },
  {
    "serial_number": "4356480",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Second: Also from her, she said: The Messenger of Allah (peace and blessings of Allah be upon him) returned to me from a funeral at Al-Baqi', and I was suffering a headache and saying: 'Oh, my head!' He said: 'Rather, I, oh my head! What would harm you if you died before me, so I washed you, shrouded you, prayed over you, and buried you?'\n\nFourteenth: Those who are most knowledgeable about the Sunnah of washing should undertake his washing, especially if they are from his family and relatives, because those who undertook washing him (peace and blessings of Allah be upon him) were as we mentioned. Ali (may Allah be pleased with him) said: 'I washed the Messenger of Allah (peace and blessings of Allah be upon him) and I began to look for what usually comes from the deceased, but I saw nothing. He was pure in life and in death, may the peace and blessings of Allah be upon him.'\n\n30 - There is a great reward for the one who undertakes washing him, subject to two conditions:\nThe First: That he conceals him and does not speak of any dislikeable things he might see, due to his saying (peace and blessings of Allah be upon him): 'Whoever washes a Muslim and conceals him, Allah will forgive him forty times. And whoever digs a grave for him and buries him, he will be granted a reward like that of a dwelling he provided for him until the Day of Judgment. And whoever shrouds him, Allah will clothe him on the Day of Judgment with silk and brocade of Paradise.'\n\nThe Second: That he seeks the Face of Allah by that, desiring neither reward nor thanks nor anything of worldly matters, as it is established in the Sharia that Allah, Blessed and Exalted, does not accept acts of worship unless they are purely for His Noble Face. The evidences for this from the Book and Sunnah are very many; I will suffice here with mentioning two of them:\nThe First: The saying of Allah, Blessed and Exalted: {Say, \"I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.\"} Meaning: He does not intend by it other than the Face of Allah the Exalted.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 30
  },
  {
    "serial_number": "4356481",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 32,
    "volume_number": 1,
    "text": "The Second: His saying (peace and blessings of Allah be upon him): \"Actions are only by intentions, and every person will have only what he intended. So whoever's emigration was to Allah and His Messenger, then his emigration was to Allah and His Messenger. And whoever's emigration was to a worldly gain he would achieve or a woman he would marry, then his emigration was to that for which he emigrated.\"\n\n31 - It is recommended for the one who washed him to perform Ghusl (a full bath), due to his saying (peace and blessings of Allah be upon him): \"Whoever washes a dead person, let him perform Ghusl, and whoever carries him, let him perform Wudu (ablution).\" The apparent meaning of the command implies obligation, but we did not say it is obligatory due to two Hadiths:\nThe First: His saying (peace and blessings of Allah be upon him): \"You are not obligated to perform Ghusl for washing your dead, for if you wash him, your dead is not impure. It is sufficient for you to wash your hands.\"\nThe Second: The saying of Ibn Umar (may Allah be pleased with him): \"We used to wash the dead; some of us would perform Ghusl and some of us would not perform Ghusl.\"\n\n32 - It is not legislated to wash the martyr slain in battle, even if he happened to be *Junub* (in a state of major ritual impurity), and regarding that are several Hadiths:\nThe First: From Jabir who said: The Prophet (peace and blessings of Allah be upon him) said: \"Bury them in their blood\" - meaning on the day of Uhud - and he did not wash them. And in a narration, he said: \"I am a witness over these. Wrap them in their blood, for there is no wound suffered for the sake of Allah except that it will come on the Day of Judgment bleeding; its color is the color of blood and its scent is the scent of musk.\" And in a narration: \"Do not wash them, for every wound will exude musk on the Day of Judgment.\" And he did not pray over them.\n\nThe Second: From Abu Barzah that the Prophet (peace and blessings of Allah be upon him) was in a campaign of his, and Allah granted him booty. He said to his companions: \"Are you missing anyone?\" They said: \"Yes, so-and-so, so-and-so, and so-and-so.\" Then he said: \"Are you missing anyone?\" They said: \"No.\" He said: \"But I am missing Julaibib.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 31
  },
  {
    "serial_number": "4356482",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 33,
    "volume_number": 1,
    "text": "Search for him.\" So he was searched for among the dead and was found beside seven whom he had killed, then they killed him. The Prophet (peace and blessings of Allah be upon him) came to him, stood over him, and said: \"He killed seven then they killed him. He is from me and I am from him; he is from me and I am from him.\" He said it twice or three times. Then he extended his arms like this and spread them out. He said: So he placed him on his forearms; he had no bed except the forearms of the Prophet (peace and blessings of Allah be upon him). He said: So a grave was dug for him and he was placed in his grave. And he did not mention washing.\n\nThe Third: [Authentic] From Abdullah bin Az-Zubayr regarding the story of Uhud and the martyrdom of Hanzalah bin Abi Amir, he said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Indeed, your companion is being washed by the angels, so ask his wife.\" She said: \"He went out while he was *Junub* (ritually impure) when he heard the *Ha'i'ah*.\" 1 The Messenger of Allah (peace and blessings of Allah be upon him) said: \"That is why the angels washed him.\"",
    "foot_note": "1. 1 It is the sound upon which one is startled and frightened. (Nihayah).",
    "book_id": "11108",
    "new_page_number": 32
  },
  {
    "serial_number": "4356483",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 34,
    "volume_number": 1,
    "text": "11- Shrouding the Deceased.\n\n33 - After finishing washing the deceased, it is obligatory to shroud him due to the command of the Prophet (peace and blessings of Allah be upon him) regarding that in the Hadith of the *Muhrim* whose she-camel broke his neck: \"...and shroud him...\" the Hadith. It has been presented in full in Chapter 3, paragraph D.\n\n34 - The shroud or its price must be from the wealth of the deceased, even if he left nothing else, due to the Hadith of Khabbab bin Al-Aratt who said: [Authentic] We emigrated with the Messenger of Allah (peace and blessings of Allah be upon him) in the path of Allah, seeking the Face of Allah, so our reward became due upon Allah. Among us were those who passed away and did not consume any of their reward; among them was Mus'ab bin Umair. He was killed on the day of Uhud and nothing was found for him - and in a narration: And he left nothing except a *Namirah* (woolen garment). When we placed it over his head, his feet appeared, and when we placed it over his feet, his head appeared. So the Messenger of Allah (peace and blessings of Allah be upon him) said: \"Place it over what is next to his head - and in a narration: Cover his head with it - and put *Idhkhir* 1 on his feet.\" And among us are those whose fruit has ripened and he is harvesting it.\n\n35 - The shroud should be sufficient and ample, covering his entire body, due to the Hadith of Jabir bin Abdullah (may Allah be pleased with him): That the Prophet (peace and blessings of Allah be upon him) gave a sermon one day and mentioned a man from his companions who passed away and was shrouded in an insufficient shroud and was buried at night. So the Prophet (peace and blessings of Allah be upon him) rebuked burying a man at night until he is prayed over, unless",
    "foot_note": "1. 1 With Kasra on the Hamza and Kha, a well-known grass with a good scent.",
    "book_id": "11108",
    "new_page_number": 33
  },
  {
    "serial_number": "4356484",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 35,
    "volume_number": 1,
    "text": "a person is compelled to do so. And the Prophet (peace and blessings of Allah be upon him) said: \"If one of you shrouds his brother, let him shroud him well if he is able.\" The scholars said: The meaning of shrouding well is its cleanliness, thickness, covering capability, and moderation. It does not mean extravagance, excessiveness in cost, or preciousness.\n\n36 - If the shroud is too narrow for that and a full covering is not available, his head and what it covers of his body should be covered with it, and whatever remains exposed should have *Idhkhir* or other grass placed upon it, due to the Hadith of Khabbab bin Al-Aratt in the story of Mus'ab regarding his *Namirah* and his (peace and blessings of Allah be upon him) saying: \"Place it over what is next to his head - and in a narration: Cover his head with it - and put *Idhkhir* on his feet.\" This was presented fully in Issue 34.\n\n37 - If shrouds are scarce and the dead are many, it is permissible to shroud a group of them in a single shroud by distributing it among them, and the one who knew the most Qur'an among them is placed first towards the Qiblah, due to the Hadith of Anas (may Allah be pleased with him) who said: [Hasan/Good] When it was the day of Uhud, the Messenger of Allah (peace and blessings of Allah be upon him) passed by Hamza bin Abdul-Muttalib, and he had been mutilated and disfigured. He said: \"If it were not that Safiyyah would feel grief in her heart, I would have left him until the *Afiya* 1 ate him so that Allah would resurrect him from the bellies of birds and beasts.\" So he shrouded him in a *Namirah*. When she covered his head, his feet appeared, and when she covered his feet, his head appeared, so she covered his head. He did not pray over anyone among the martyrs other than him and said: \"I am a witness over you today.\" He said: The dead were many and the clothes were few. He said: So three and two were gathered",
    "foot_note": "1. 1 These are beasts and birds that land on corpses and eat them; the plural is *Al-Awafi*.",
    "book_id": "11108",
    "new_page_number": 34
  },
  {
    "serial_number": "4356485",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 36,
    "volume_number": 1,
    "text": "in one grave, and he would ask which of them knew more Qur'an, so he would place him first in the *Lahd* (niche). And two or three men were shrouded in a single cloth. 1\n\n38 - It is not permissible to remove the clothes of the martyr in which he was killed; rather, he is buried while they are on him, due to his saying (peace and blessings of Allah be upon him) regarding the slain of Uhud: \"Wrap them in their clothes.\"\n\n39 - It is recommended to shroud him with one garment or more over his clothes, as the Messenger of Allah (peace and blessings of Allah be upon him) did with Mus'ab bin Umair. His Hadith was presented in Issue 34.\n\n40 - The *Muhrim* is shrouded in his two garments in which he died, due to his saying (peace and blessings of Allah be upon him) regarding the *Muhrim* whose she-camel broke his neck: \"...and shroud him in his two garments in which he entered Ihram.\" This was presented fully in Chapter 3, paragraph D.\n\n41 - Several things are recommended regarding the shroud:\nFirst: Whiteness, due to his saying (peace and blessings of Allah be upon him): \"Wear white from your clothes, for they are the best of your clothes, and shroud your dead in them.\"\nSecond: That it be three cloths, due to the Hadith of Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings of Allah be upon him) was shrouded in three white Yamani *Sahuliyah* cloths of cotton, there was no shirt among them nor a turban; he was wrapped in them in layers.",
    "foot_note": "1. 1 Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: The meaning of the Hadith is that he used to divide the single cloth among the group, so each one would be shrouded with a part of it due to necessity, even if it only covered part of his body. The entirety of the Hadith indicates this, as he used to ask about the one who knew the most Qur'an to place him first in the *Lahd*. If they were all in one cloth collectively, he would have asked about the best of them before that so as not to lead to undoing the shrouding and repeating it. Mentioned in 'Awn al-Ma'bud 3/165. This interpretation is the correct one. As for the opinion of those who interpreted it literally, it is incorrect and contrary to the context of the story as explained by Ibn Taymiyyah. Even further from correctness is the one who said: \"one cloth\" means \"one grave,\" because this is explicitly mentioned in the Hadith, so there is no meaning in repeating it.",
    "book_id": "11108",
    "new_page_number": 35
  },
  {
    "serial_number": "4356486",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 37,
    "volume_number": 1,
    "text": "Third: That one of them be a *Hibara* garment 1 if available, due to his saying (peace and blessings of Allah be upon him): \"If one of you dies and finds something, let him be shrouded in a *Hibara* garment.\"\nFourth: [Authentic] Incensing it three times, due to his saying (peace and blessings of Allah be upon him): \"If you incense the deceased, incense him three times.\" This ruling does not include the *Muhrim*, due to his saying (peace and blessings of Allah be upon him) regarding the *Muhrim* whose she-camel broke his neck: \"...and do not perfume him...\"\n\n42 - It is not permissible to be extravagant in the shroud nor to exceed three (cloths), because it is contrary to what the Messenger of Allah (peace and blessings of Allah be upon him) was shrouded in, as presented in the previous issue. It also involves wasting money, which is prohibited, especially since the living have more right to it. The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Indeed, Allah disliked three things for you: Gossip ('it was said and he said'), wasting money, and asking too many questions.\"\nI am pleased on this occasion by what the scholar Abu At-Tayyib said in Ar-Rawdah An-Nadiyyah 1/165: \"Increasing the shrouds and being extravagant in their prices is not praiseworthy. Were it not for the Sharia mentioning it, it would have been a waste of money because the deceased does not benefit from it, nor does its benefit return to the living. May Allah have mercy on Abu Bakr As-Siddiq, as he said: 'The living has more right to the new,' when he was spoken to regarding his designation of one of his old garments for his shroud: 'This is worn out.'\"\n\n43 - The woman in this regard is like the man, as there is no evidence for differentiation.",
    "foot_note": "1. 1 With Kasra on the un-dotted Ha and Fatha on the Ba; it is a type of striped cloak (Burd), and what is meant here is one where white predominates.",
    "book_id": "11108",
    "new_page_number": 36
  },
  {
    "serial_number": "4356487",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 38,
    "volume_number": 1,
    "text": "12- Carrying the Funeral and Following It.\n\n44 - It is obligatory to carry the funeral and follow it; this is among the rights of a Muslim upon Muslims. There are Hadiths regarding this, of which I mention two:\nThe First: [Authentic] His saying (peace and blessings of Allah be upon him): \"The rights of a Muslim upon a Muslim - and in a narration: Duties of a Muslim to his brother - are five: Returning the greeting (Salam), visiting the sick, following funerals, accepting invitations, and replying to the sneezer (Tashmeet).\"\nThe Second: His saying also: \"Visit the sick and follow funerals; they remind you of the Hereafter.\"\n\n45 - Following it is of two levels:\nThe First: Following it from its family's house until the prayer over it.\nThe Other: Following it from its family's house until the completion of its burial.\nBoth of these were done by the Messenger of Allah (peace and blessings of Allah be upon him). Abu Sa'id Al-Khudri (may Allah be pleased with him) narrated saying: [Authentic] When the Prophet (peace and blessings of Allah be upon him) arrived - meaning in Medina - if a dead person among us was present, we would notify the Prophet (peace and blessings of Allah be upon him), so he would attend, seek forgiveness for him until he passed away. Then the Prophet (peace and blessings of Allah be upon him) and those with him would depart until he was buried. Sometimes this confinement would be prolonged for the Prophet (peace and blessings of Allah be upon him). So when we feared the hardship of that upon him, some of the people said to others: 'If only we would not notify the Prophet (peace and blessings of Allah be upon him) about anyone until he has passed away. Once he passes away, we notify him, so there would be no hardship or confinement upon him in that.' So we did that. We would notify him of the deceased after he died, so he would come and pray over him. Sometimes he would leave, and sometimes he would stay until the deceased was buried. We were upon that for a while. Then we said: 'If the Prophet (peace and blessings of Allah be upon him) did not travel (come out) and we carried our funeral to him so he could pray over it at his house, that would be easier for him.' So that became the practice until today.\n\n46 - There is no doubt that the second level is better than the first, due to his saying (peace and blessings of Allah be upon him): \"Whoever attends the funeral from its house - and in a narration: Whoever follows the funeral of a Muslim out of faith",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 37
  },
  {
    "serial_number": "4356488",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 39,
    "volume_number": 1,
    "text": "and seeking reward until he prays over it, he will have a *Qirat*. And whoever attends it until it is buried - and in another narration: until it is finished - he will have two *Qirats* of reward.\" It was said: \"O Messenger of Allah, what are the two *Qirats*?\" He said: \"Like two great mountains.\" In another narration: \"Every *Qirat* is like Uhud.\"\n\n47 - This merit in following funerals is specifically for men excluding women, due to the Prophet (peace and blessings of Allah be upon him) prohibiting women from following them. It is a prohibition of discouragement (Tanzeeh). Umm Atiyyah (may Allah be pleased with her) said: [Authentic] \"We were forbidden - and in a narration: The Messenger of Allah (peace and blessings of Allah be upon him) forbade us - from following funerals, but it was not strictly enforced upon us.\"\n\n48 - It is not permissible to follow funerals with anything that contradicts the Sharia. Two things have been specifically mentioned in texts: Raising the voice in weeping and following it with incense (fire). That is in his saying (peace and blessings of Allah be upon him): \"Do not follow the funeral with voice nor fire.\"\n\n49 - Attached to this is raising the voice with *Dhikr* (remembrance) in front of the funeral, because it is an innovation (*Bid'ah*), and due to the saying of Qais bin Abbad: \"The Companions of the Prophet (peace and blessings of Allah be upon him) used to dislike raising the voice near funerals.\" Also because it involves imitating the Christians, for they raise their voices with things from their gospels and remembrances with elongation, melodic intonation, and sadness. Even uglier than that is accompanying it with playing musical instruments in front of it, playing sorrowful tunes, as is done in some Islamic lands in imitation of the disbelievers. And Allah is the One sought for help.\nAl-Nawawi (may Allah have mercy on him) said in *Al-Adhkar* p. 203: \"Know that the correct and chosen way, and what the Salaf (may Allah be pleased with them) were upon, is silence while walking with the funeral. No voice should be raised with recitation, *Dhikr*, or anything else. The wisdom in this is apparent: it is more calming for his heart and more conducive to gathering his thoughts regarding the funeral, which is what is required in this situation. This is the truth; do not be deceived by the large number of those who oppose it. Abu Ali Al-Fudayl",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 38
  },
  {
    "serial_number": "4356489",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 40,
    "volume_number": 1,
    "text": "bin Iyad (may Allah be pleased with him) said words to the effect: 'Stick to the paths of guidance, and the small number of those walking them will not harm you. And beware of the paths of misguidance, and do not be deceived by the large number of those perishing.' We have narrated in *Sunan Al-Bayhaqi* what supports what I said - referring to the saying of Qais bin Abbad. As for what the ignorant do of recitation over the funeral in Damascus and elsewhere, reciting with elongation and taking words out of their places (intonation), it is forbidden (*Haram*) by consensus of the scholars. I have clarified its ugliness, the severity of its prohibition, and the sinfulness of whoever is able to denounce it but does not, in the book *Adab Al-Qira'ah* (Etiquettes of Recitation). And Allah is the One sought for help.\"\n\n50 - It is obligatory to hasten in walking with it, a pace less than running (*Raml*), due to his saying (peace and blessings of Allah be upon him): \"Hasten with the funeral. For if it is righteous, it is good you are advancing it to; and if it is other than that, it is an evil you are putting down from your necks.\"\nI say: The apparent meaning of the command implies obligation, and Ibn Hazm held this view (5/154-155). We did not find evidence diverting it to recommendation, so we stopped at that. Ibn Al-Qayyim said in *Zad Al-Ma'ad*: \"As for the creeping of people today, step by step, it is a disliked innovation, contrary to the Sunnah, and implies imitation of the People of the Book: the Jews.\"\n\n51 - It is permissible to walk in front of it, behind it, to its right, and to its left, provided one is close to it, except for the rider who travels behind it, due to his saying (peace and blessings of Allah be upon him): \"The rider travels behind the funeral, and the walker wherever he wishes around it: behind it, in front of it, to its right, and to its left, close to it. The child is prayed over, and forgiveness and mercy are supplicated for his parents.\"\n\n52 - Both walking in front of it and behind it are established from the Messenger of Allah (peace and blessings of Allah be upon him) in action, as Anas bin Malik (may Allah be pleased with him) said: \"That the Messenger of Allah (peace and blessings of Allah be upon him), Abu Bakr, and Umar used to walk in front of the funeral and behind it.\"\n\n53 - However, walking behind it is better because it is the implication of his saying (peace and blessings of Allah be upon him): \"And follow the funerals,\" and meanings similar to it. This is supported by the saying of Ali (may Allah be pleased with him):",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 39
  },
  {
    "serial_number": "4356490",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 41,
    "volume_number": 1,
    "text": "\"Walking behind it is better than walking in front of it, like the superiority of a man's prayer in congregation over his prayer alone.\"\n\n54 - Riding is permissible provided one travels behind it, due to his saying (peace and blessings of Allah be upon him) in the previous Hadith: \"The rider travels behind the funeral...\" However, walking is better because it is what is customary from him (peace and blessings of Allah be upon him), and it is not reported that he rode with it. Rather, Thawban (may Allah be pleased with him) said: An animal was brought to the Messenger of Allah (peace and blessings of Allah be upon him) while he was with the funeral, but he refused to ride it. When he departed, the animal was brought and he rode. He was asked about it? He said: \"Indeed the angels were walking, so I was not going to ride while they were walking. When they left, I rode.\"\n\n55 - As for riding after departing from it, it is permissible without dislike, due to the Hadith of Thawban mentioned just now. Similar to it is the Hadith of Jabir bin Samurah (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) prayed over Ibn Al-Dahdah and we were present - and in a narration: He went out to the funeral of Ibn Al-Dahdah walking, then a bare horse (without saddle) was brought, and a man tied it. He rode it when he departed, and it began to prance 1 with him while we followed running behind him - and in a narration: around him. He said: A man from the people said: The Prophet (peace and blessings of Allah be upon him) said: \"How many a hanging or drooping bunch of dates in Paradise is for Ibn Al-Dahdah.\"\n\n56 - As for carrying the funeral on a cart or a car designated for funerals and the followers following it while in cars, this form is not legislated at all, for several reasons:\nFirst: It is from the customs of the disbelievers, and it is established in the Sharia that it is not permissible to imitate them in that. There are very many Hadiths regarding this which I have compiled and extracted in my book *The Veil of the Muslim Woman in the Book and the Sunnah*. Some are commands and encouragement to differ from them in",
    "foot_note": "1. 1 Meaning it leaped and took short steps.",
    "book_id": "11108",
    "new_page_number": 40
  },
  {
    "serial_number": "4356491",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 42,
    "volume_number": 1,
    "text": "their worships, attire, and habits, and some are from his action (peace and blessings of Allah be upon him) in differing from them in that. Whoever wishes to view them may refer to it.\nSecond: It is an innovation in worship, while opposing the practical Sunnah in carrying the funeral. Anything of this sort among newly invented matters is misguidance by agreement.\nThird: It misses the purpose of carrying and following it, which is remembering the Hereafter, as explicitly stated by the Messenger of Allah (peace and blessings of Allah be upon him) in the Hadith mentioned at the beginning of this chapter with the wording: \"...and follow funerals; they remind you of the Hereafter.\"\nI say: Following it in that form causes people to miss this noble objective completely or partially. It is not hidden to the insightful person that carrying the deceased on shoulders and seeing the followers with it above their heads is more effective in realizing remembrance and admonition than following it in the mentioned form. I would not be exaggerating if I said: What drove the Europeans to this is only their fear of death and everything that reminds of it, due to the dominance of materialism over them and their disbelief in the Hereafter.\nFourth: It is a strong cause for reducing the number of those following it and those desiring to obtain the reward mentioned previously in Issue 46 of this chapter, because not everyone can hire a car to follow it.\nFifth: This form does not agree, remotely or closely, with what the pure, tolerant Sharia is known for regarding distance from formalities and protocols, especially in such a serious matter: Death. Truly I say: Even if this innovation had nothing but this violation, that would be enough to reject it. How then, when combined with the violations and corruptions previously explained and other things I have not mentioned?\n\n57 - Standing for it is abrogated. It is of two types:\nA - Standing of the seated person if it passes by him.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 41
  },
  {
    "serial_number": "4356492",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 43,
    "volume_number": 1,
    "text": "B - And the standing of the one following it when it reaches the grave until it is placed on the ground.\nThe evidence for this is the Hadith of Ali (may Allah be pleased with him): The Messenger of Allah (peace and blessings of Allah be upon him) stood for the funeral so we stood, then he sat so we sat. In a wording: He used to stand for funerals then he sat afterwards. In another: The Messenger of Allah (peace and blessings of Allah be upon him) used to order us to stand for the funeral, then he sat after that and ordered us to sit.\nIt is recommended for whoever carried it to perform Wudu (ablution), due to his saying (peace and blessings of Allah be upon him): \"Whoever washes a dead person, let him perform Ghusl, and whoever carries him, let him perform Wudu.\"",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 42
  },
  {
    "serial_number": "4356493",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 44,
    "volume_number": 1,
    "text": "13- The Prayer Over the Funeral (Janazah).\n\n58 - The prayer over the Muslim deceased is a communal obligation (*Fard Kifaya*) due to his command (peace and blessings of Allah be upon him) for it in Hadiths. I mention among them the Hadith of Zaid bin Khalid Al-Juhani: [Authentic] That a man from the companions of the Prophet (peace and blessings of Allah be upon him) died on the day of Khaibar. They mentioned that to the Messenger of Allah, so he said: \"Pray over your companion.\" The faces of the people changed at that. He said: \"Indeed your companion stole from the spoils (*Ghulul*) in the path of Allah.\" So we searched his belongings and found beads from the beads of the Jews not worth two dirhams.\n\n59 - Two persons are exempted from that, so prayer over them is not obligatory:\nThe First: The child who has not reached puberty, because the Prophet (peace and blessings of Allah be upon him) did not pray over his son Ibrahim (peace be upon him). Aisha (may Allah be pleased with her) said: Ibrahim, the son of the Prophet (peace and blessings of Allah be upon him), died while he was eighteen months old, and the Messenger of Allah (peace and blessings of Allah be upon him) did not pray over him.\nThe Second: The martyr, because the Prophet (peace and blessings of Allah be upon him) did not pray over the martyrs of Uhud and others as preceded. However, this does not negate the legitimacy of praying over them without obligation, as will come in the following issue.\n\n60 - Prayer is legislated over those mentioned below:\nThe First: The child, even if it was a miscarriage (*Siqt*), which is what falls from its mother's womb before completion, due to his saying (peace and blessings of Allah be upon him) in the Hadith preceding in Issue 51: \"...and the child - and in a narration: The miscarriage - is prayed over, and forgiveness and mercy are supplicated for his parents.\"\nIt appears that the miscarriage is only prayed over if the soul has been breathed into it. That is if it has completed four months then died. As for if it fell before that, then no,",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 43
  },
  {
    "serial_number": "4356494",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 45,
    "volume_number": 1,
    "text": "because it is not a 'dead person' (Mayyit) as is obvious. The basis for that is the Hadith of Abdullah bin Masud (may Allah be pleased with him) raised to the Prophet: \"Indeed the creation of one of you is gathered in his mother's womb for forty days, then it is a clot (*alaqa*) like that, then it is a lump of flesh (*mudgha*) like that, then Allah sends an angel to it... who breathes the soul into it.\"\n\nThe Second: The Martyr. There are many Hadiths regarding this; I suffice with mentioning some of them:\n1 - [Hasan] From Abdullah bin Az-Zubayr: That the Messenger of Allah (peace and blessings of Allah be upon him) ordered Hamza on the day of Uhud (to be brought), so he was covered with a cloak, then he prayed over him and said nine Takbirs. Then the slain were brought, lined up, and he prayed over them and over him (Hamza) with them.\n2 - From Uqbah bin Amir Al-Juhani: That the Prophet (peace and blessings of Allah be upon him) went out one day and prayed over the people of Uhud his prayer over the dead after eight years, like one bidding farewell to the living and the dead. Then he departed to the pulpit, praised Allah and extolled Him, then said: \"I am a predecessor for you, and I am a witness over you. Indeed your appointment is at the Basin (*Al-Hwadh*), and by Allah, I am looking at my Basin right now. Its width is like what is between Ayla and Juhfa. I have been given the keys to the treasures of the earth - or the keys of the earth - and by Allah, I do not fear for you that you will associate partners with Allah after me, but I fear for you the world, that you will compete in it and fight each other, and thus perish as those before you perished.\" He said: That was the last look I cast at the Messenger of Allah (peace and blessings of Allah be upon him).\n\nThe Third: One killed in a *Hadd* (legal punishment) of Allah's limits, due to the Hadith of 'Amir bin Husain: That a woman from Juhaynah came to the Prophet of Allah (peace and blessings of Allah be upon him) while she was pregnant from adultery. She said: \"O Prophet of Allah, I have committed an offense warranting a *Hadd*, so execute it upon me.\" The Prophet of Allah (peace and blessings of Allah be upon him) called her guardian and said: \"Treat her well, and when she delivers, bring her to me.\" So he did. Then the Prophet of Allah (peace and blessings of Allah be upon him) ordered regarding her, so her clothes were tied upon her, then he ordered regarding her and she was stoned. Then he prayed over her. Umar said to him: \"Do you pray",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 44
  },
  {
    "serial_number": "4356495",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 46,
    "volume_number": 1,
    "text": "over her, O Prophet of Allah, when she has committed adultery?\" He said: \"She has repented a repentance that if divided among seventy of the people of Medina, it would suffice them. And have you found a repentance better than her sacrificing herself to Allah the Exalted?\"\n\nThe Fourth: The immoral person immersed in sins and prohibitions, such as the abandoner of prayer and Zakat (while acknowledging their obligation), the adulterer, the addict of alcohol, and similar sinners. They are prayed over, except that it is appropriate for the people of knowledge and religion to leave praying over them as a punishment and a discipline for the likes of them, as the Prophet (peace and blessings of Allah be upon him) did. Regarding that are Hadiths, I mention one of them: From Abu Qatada who said: The Messenger of Allah (peace and blessings of Allah be upon him) used to ask about a funeral if he was invited to it. If it was praised with good, he stood and prayed over it. If it was praised with other than that, he said to its family: \"It is your affair with it,\" and he did not pray over it.\n\nThe Fifth: The debtor who did not leave enough wealth to pay off his debt. He is prayed over. The Messenger of Allah (peace and blessings of Allah be upon him) only refrained from praying over him in the beginning of the matter. Regarding this are Hadiths:\n1 - From Salamah bin Al-Akwa who said: We were sitting with the Prophet (peace and blessings of Allah be upon him) when a funeral was brought. They said: \"Pray over it.\" He said: \"Does he have any debt?\" They said: \"No.\" He said: \"Did he leave anything?\" They said: \"No.\" So he prayed over him. Then another funeral was brought and they said: \"O Messenger of Allah, pray over it.\" He said: \"Does he have any debt?\" It was said: \"Yes.\" He said: \"Did he leave anything?\" They said: \"Three dinars.\" He said: So he pointed with his fingers: three brands (count). So he prayed over him. Then a third was brought and they said: \"Pray over him.\" He said: \"Did he leave anything?\" They said: \"No.\" He said: \"Does he have any debt?\" They said: \"Three dinars.\" He said: \"Pray over your companion.\" A man from the Ansar called Abu Qatada said: \"Pray over him, O Messenger of Allah, and his debt is upon me.\"\n2 - From Abu Huraira: That the Messenger of Allah (peace and blessings of Allah be upon him) used to have a deceased man with debt brought to him. He would ask: \"Did he leave any payment?\" If he was told that he left enough to pay, he prayed over him; otherwise, he did not. He said: \"Pray over",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 45
  },
  {
    "serial_number": "4356496",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 47,
    "volume_number": 1,
    "text": "your companion.\" When Allah granted him conquests, he said: \"I am closer to the believers than their own selves in this world and the Hereafter. Read if you wish: {The Prophet is closer to the believers than their own selves}. So whoever dies leaving a debt and did not leave payment, its repayment is upon me. And whoever leaves wealth, it is for his heirs.\"\n\nThe Sixth: The one who was buried before being prayed over, or whom some prayed over but not others. They pray over him while he is in his grave, provided that the Imam in the second case is one of those who had not prayed over him. Regarding that are Hadiths; I suffice here with one of them: From Abdullah bin Abbas (may Allah be pleased with them both) who said: [Authentic] A man died - and the Messenger of Allah (peace and blessings of Allah be upon him) used to visit him (when sick) - so they buried him at night. When morning came, they informed him. He said: \"What prevented you from informing me?\" They said: \"It was night and darkness, so we disliked causing you hardship.\" So he came to his grave and prayed over him. He said: He led us, and we lined up behind him, and I was among them, and he said four Takbirs.\n\nThe Seventh: Whoever dies in a land where there is no one to pray the prayer of the present (*Salat al-Hadir*) over him. A group of Muslims prays the absentee prayer (*Salat al-Gha'ib*) over him, due to the prayer of the Prophet (peace and blessings of Allah be upon him) over An-Najashi (The Negus). A group of his companions (peace and blessings of Allah be upon him) narrated it, some adding to others. I have gathered their Hadiths regarding it and presented them in one context approximately for benefit. The context is for the Hadith of Abu Huraira: The Messenger of Allah (peace and blessings of Allah be upon him) announced the death of An-Najashi, Ashamah, the ruler of Abyssinia, to the people while he was in Medina on the day he died. He said: \"Indeed a brother of yours has died - and in a narration: Today a righteous slave of Allah has died in a land other than yours - so stand and pray over him.\" They said: \"Who is he?\" He said: \"An-Najashi.\" And he said: \"Seek forgiveness for your brother.\" He said: So he went out with them to the Musalla (prayer place) - and in a narration: Al-Baqi' - then he stepped forward and they lined up behind him in two rows. He said: So we lined up behind him as one lines up for the dead, and we prayed over him as one prays over the dead, and we did not think but that the funeral was placed in front of him. He said: So he led us and prayed over him and said four Takbirs over him. It was said: \"O Messenger of Allah, do you pray over",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 46
  },
  {
    "serial_number": "4356497",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 48,
    "volume_number": 1,
    "text": "an Abyssinian slave?\" So Allah Mighty and Majestic revealed: {And indeed, among the People of the Scripture are those who believe in Allah...} the Verse.\nIbn Al-Qayyim (may Allah have mercy on him) said in *Zad Al-Ma'ad* 1/205/206: \"It was not of his guidance (peace and blessings of Allah be upon him) and Sunnah to pray over every absent dead person. Many people died among the Muslims while absent, and he did not pray over them. But it is authentic that he prayed over An-Najashi the prayer over the dead.\"\nWhat supports the lack of legitimacy of praying over every absentee is that when the Rightly Guided Caliphs and others died, none of the Muslims prayed the absentee prayer over them. Had they done so, the report of it would have been widely transmitted (*Mutawatir*) from them. Compare this with what many Muslims do today of praying over every absentee, especially if he has fame or reputation, even if only politically, and is not known for righteousness or service to Islam, even if he died in the Meccan Sanctuary and thousands upon thousands prayed the present prayer over him during the Hajj season. Compare what we mentioned with such a prayer, and you will know with certainty that it is among the innovations about which a scholar of his Sunnah (peace and blessings of Allah be upon him) and the way of the Salaf (may Allah be pleased with them) has no doubt.\n\n61 - It is forbidden to pray over, seek forgiveness for, and ask mercy for disbelievers and hypocrites 1, due to the saying of Allah the Blessed and Exalted: {And do not pray [the funeral prayer, O Muhammad], over any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allah and His Messenger and died while they were defiantly disobedient.}\nAnd due to the Hadith of Ali (may Allah be pleased with him) who said: I heard a man seeking forgiveness for his parents while they were polytheists. I said: \"Do you seek forgiveness for your parents while they are polytheists?\" He said: \"Did Ibrahim not seek forgiveness for his father while he was a polytheist?\" He said: So I mentioned that",
    "foot_note": "1. 1 They are those who conceal disbelief and display Islam. Their disbelief only becomes apparent through what filters out of their words of insinuations against some rulings of the Sharia and regarding them as ugly, and their claim that they are contrary to reason and taste. Our Lord, Blessed and Exalted, pointed to this reality in His saying: {Or do those in whose hearts is disease think that Allah would never expose their feelings of hatred? And if We willed, We could show them to you, and you would know them by their mark; but you will surely know them by the tone of [their] speech. And Allah knows your deeds.} Examples of these hypocrites are many in our era, and Allah is the One sought for help.",
    "book_id": "11108",
    "new_page_number": 47
  },
  {
    "serial_number": "4356498",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 49,
    "volume_number": 1,
    "text": "to the Prophet (peace and blessings of Allah be upon him), so it was revealed: {It is not for the Prophet and those who have believed to ask forgiveness for the polytheists, even if they were relatives, after it has become clear to them that they are companions of Hellfire. And the request of forgiveness of Abraham for his father was only because of a promise he had made to him. But when it became apparent to him that he was an enemy to Allah, he disassociated himself from him. Indeed was Abraham compassionate and patient.}\nAl-Nawawi (may Allah have mercy on him) said in *Al-Majmu'* 5/144, 258: \"Prayer over the disbeliever and supplicating for forgiveness for him is forbidden by the text of the Qur'an and Consensus.\"\nI say: From that, you know the error of some Muslims today in asking for mercy and pleasure for some disbelievers. This occurs frequently from some newspaper and magazine owners. I heard one of the Arab leaders known for religiousness asking for mercy for the communist Stalin, who - along with his ideology - is among the fiercest and most bitter enemies of the religion. That was in a speech delivered by the mentioned leader on the occasion of the death of the aforementioned, broadcast on the radio. It is no wonder regarding this, for such a ruling might be hidden from him. But the wonder is from some Muslim preachers falling into the like of that, where one said in a letter of his: 'May Allah have mercy on Bernard Shaw...'\nSome trustworthy people informed me about a Sheikh who used to pray over those who died from the Ismailis, despite his belief that they are not Muslims, because they do not believe in prayer nor Hajj and they worship humans. Yet, he used to pray over them out of hypocrisy and flattery to them. To Allah is the complaint, and He is the One sought for help.\n\n62 - Congregation is obligatory in the funeral prayer just as it is obligatory in the prescribed prayers, due to two evidences:\nThe First: The perseverance of the Prophet (peace and blessings of Allah be upon him) upon it.\nThe Other: His saying (peace and blessings of Allah be upon him): \"Pray as you have seen me praying.\"\nWhat we mentioned is not disturbed by the prayer of the Companions over the Prophet (peace and blessings of Allah be upon him) individually without anyone leading them, because it is a special case whose reason is unknown. So it is not permissible to leave for its sake what he persevered upon",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 48
  },
  {
    "serial_number": "4356499",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 50,
    "volume_number": 1,
    "text": "(peace and blessings of Allah be upon him) throughout his blessed life. Especially since the mentioned case was not reported with an authentic chain that stands as proof. Even if it was narrated through paths that strengthen each other, if it is possible to reconcile it with what we mentioned of his guidance (peace and blessings of Allah be upon him) in gathering for the funeral, then good; otherwise, his guidance is prioritized because it is more established and better guided. If they pray over it individually, the obligation drops, but they bear sin for leaving the congregation. And Allah knows best.\nAl-Nawawi said in *Al-Majmu'* 5/314: \"It is permissible to pray the funeral prayer individually without disagreement, but the Sunnah is that it be prayed in congregation due to the famous Hadiths in the 'Sahih' regarding that along with the consensus of the Muslims.\"\n\n63 - The minimum number reported for the convening of congregation in it is three. In the Hadith of Abdullah bin Abi Talha: That Talha called the Messenger of Allah (peace and blessings of Allah be upon him) to Umair bin Abi Talha when he died. The Messenger of Allah (peace and blessings of Allah be upon him) came to him and prayed over him in their house. The Messenger of Allah (peace and blessings of Allah be upon him) stepped forward, Abu Talha was behind him, and Umm Sulaim was behind Abu Talha, and there was no one else with them.\n\n64 - The larger the gathering, the better for the deceased and the more beneficial, due to his saying (peace and blessings of Allah be upon him): \"There is no dead person whom a group of Muslims numbering one hundred prays over, all of them interceding for him, except that their intercession for him is accepted.\" And in another Hadith: \"He is forgiven.\"\nThe deceased may be forgiven even if the number is less than one hundred, if they are Muslims whose Monotheism is not mixed with any Shirk (polytheism), due to his saying (peace and blessings of Allah be upon him): \"There is no Muslim man who dies, and forty men who do not associate anything with Allah stand for his funeral prayer, except that Allah accepts their intercession for him.\"\n\n65 - It is recommended that they line up behind the Imam in three rows or more, due to two Hadiths narrated regarding that. The issue is strengthened by their combination; check them in the original.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 49
  },
  {
    "serial_number": "4356500",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 51,
    "volume_number": 1,
    "text": "66 - If there is no one with the Imam except one man, he does not stand beside him as is the Sunnah in other prayers; rather, he stands behind the Imam, due to the Hadith preceding in Issue 63.\n\n67 - The Ruler or his deputy has more right to the Imamate (leadership) in it than the guardian (family), due to the Hadith of Abu Hazim who said: \"I was present the day Al-Hasan bin Ali died. I saw Al-Husain bin Ali saying to Sa'id bin Al-Aas, poking him in his neck and saying: 'Step forward; were it not a Sunnah, I would not have put you forward.'\" Sa'id was the Amir of Medina on that day, and there was something between them.\n\n68 - If the Ruler or his deputy is not present, then the one most entitled to Imamate is the one who knows the Book of Allah most, then according to the order mentioned in his saying (peace and blessings of Allah be upon him): \"The people are led by the one who reads the Book of Allah most. If they are equal in reading, then the most knowledgeable of the Sunnah. If they are equal in the Sunnah, then the earliest in migration. If they are equal in migration, then the earliest in Islam. And a man should not lead a man in his authority, nor sit in his house on his place of honor except with his permission.\"\nThe one who reads most leads them even if he is a boy who has not reached puberty, due to the Hadith of Amr bin Salamah: That they - meaning his people - came as a delegation to the Prophet (peace and blessings of Allah be upon him). When they wanted to depart, they said: \"O Messenger of Allah, who leads us?\" He said: \"The one of you with the most collection of the Qur'an or taking of the Qur'an.\" There was no one among the people who had collected what I had collected, so they put me forward while I was a boy wearing a cloak of mine. He said: \"I did not attend a gathering of Jarm except that I was their Imam, and I pray over their funerals to this day.\"\n\n69 - If multiple funerals of men and women gather, one prayer is prayed over them. The males - even if they are young - are placed closest to the Imam, and the funerals of the females closest to the Qiblah, for it is the Sunnah. As Nafi' said on the authority of Ibn Umar: That he prayed 1 over nine funerals together. He placed the men next to the Imam and the women next to the Qiblah, lining them up in one row. The funeral of Umm Kulthum bint Ali, the wife of Umar bin",
    "foot_note": "1. 1 I say: Meaning as an Imam, as indicated by the context. Al-Bayhaqi explicitly stated this in a narration of his. This does not contradict his saying later \"And the Imam that day was Sa'id bin Al-Aas,\" because the meaning is that he was the Amir.",
    "book_id": "11108",
    "new_page_number": 50
  },
  {
    "serial_number": "4356501",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 52,
    "volume_number": 1,
    "text": "Al-Khattab, and a son of hers called Zaid were placed together. The Imam that day was Sa'id bin Al-Aas, and among the people were Ibn Abbas, Abu Huraira, Abu Sa'id, and Abu Qatada. The boy was placed next to the Imam. A man said: So I denied that, and I looked at Ibn Abbas, Abu Huraira, Abu Sa'id, and Abu Qatada and said: \"What is this?\" They said: \"It is the Sunnah.\"\n\n70 - It is permissible to pray a prayer for each one of the funerals, because it is the default, and because the Prophet (peace and blessings of Allah be upon him) did that regarding the martyrs of Uhud as preceded in Issue 60/1.\n\n71 - Praying over the funeral in the mosque is permissible, due to the Hadith of Aisha (may Allah be pleased with her) who said: [Authentic] When Sa'd bin Abi Waqqas died, the wives of the Prophet (peace and blessings of Allah be upon him) sent word to pass his funeral through the mosque so they could pray over him. So they did, and he was stopped at their apartments so they could pray over him. He was taken out through the Bab Al-Jana'iz (Funerals Door) which was towards the *Maqa'id* (sitting places). They were informed that the people criticized that and said: \"This is an innovation; funerals were not entered into the mosque.\" That reached Aisha, so she said: \"How quick are people to criticize what they have no knowledge of! They criticized us for passing a funeral through the mosque. By Allah, the Messenger of Allah (peace and blessings of Allah be upon him) did not pray over Suhail bin Bayda and his brother except inside the mosque.\"\n\n72 - However, it is better to pray over it outside the mosque in a place prepared for praying over funerals, as was the case during the time of the Prophet (peace and blessings of Allah be upon him), and it is the dominant practice of his guidance regarding it. Regarding that are Hadiths mentioned in the original, among them his prayer (peace and blessings of Allah be upon him) over An-Najashi in the Musalla near Al-Baqi' as preceded in Issue 60/7. And among them is the Hadith: That the Jews came to the Prophet (peace and blessings of Allah be upon him) with a man from them and a woman who committed adultery. He ordered regarding them, and they were stoned near the place of funerals by the mosque.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 51
  },
  {
    "serial_number": "4356502",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 53,
    "volume_number": 1,
    "text": "Al-Hafiz said in *Al-Fath*: The Musalla of funerals was adjacent to the Prophet's Mosque (peace and blessings of Allah be upon him) from the east side. He said in another place (12-108): The Musalla where Eid and funerals were prayed is from the direction of Baqi' Al-Gharqad.\n\n73 - It is not permissible to pray over it between the graves, due to the Hadith of Anas bin Malik (may Allah be pleased with him): That the Prophet (peace and blessings of Allah be upon him) forbade praying over funerals between the graves. And from him also: \"He used to dislike that a mosque be built between graves.\" The Hadith is supported by what is *Mutawatir* (mass transmitted) from the Prophet (peace and blessings of Allah be upon him) regarding the prohibition of taking graves as mosques. I mentioned what was reported regarding that in the beginning of my book *Tahdheer As-Sajid min Ittikhadh Al-Qubur Masajid* (Warning the Prostrator against Taking Graves as Mosques), and I will mention some of it in Issue 126, paragraph 9.\n\n74 - The Imam stands behind the head of the man and the middle of the woman. There are two Hadiths regarding this; the most comprehensive is the Hadith of Abu Ghalib Al-Khayyat who said: [Authentic] I witnessed Anas bin Malik pray over the funeral of a man, so he stood at his head - and in a narration: the head of the bier. When it was lifted, the funeral of a woman from Quraish or the Ansar was brought. It was said to him: \"O Abu Hamza, this is the funeral of so-and-so, daughter of so-and-so, pray over her.\" So he prayed over her and stood in her middle - and in a narration: at her buttocks - and upon her was a green coffin. Among us was Al-Ala bin Ziyad Al-Adawi 1. When he saw the difference in his standing for the man and the woman, he said: \"O Abu Hamza, is this how the Messenger of Allah (peace and blessings of Allah be upon him) used to stand where you stood, and for the woman where you stood?\" He said: \"Yes.\" He said: So Al-Ala turned to us and said: \"Memorize.\"",
    "foot_note": "1. 1 His Kunya is Abu Nasr. He is among the trustworthy Tabi'in and was among the worshippers and reciters of the people of Basra. He died in the year ninety-four.",
    "book_id": "11108",
    "new_page_number": 52
  },
  {
    "serial_number": "4356503",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 54,
    "volume_number": 1,
    "text": "Description of the Funeral Prayer.\n\n75 - He says Takbir over it four, or five, up to nine times. All of that is established from the Prophet (peace and blessings of Allah be upon him). Whichever he does is sufficient. It is better to vary, doing this sometimes and that sometimes, as is the case in similar matters like the opening supplications, the forms of Tashahhud, the Abrahamic prayers, and the like. If one must adhere to one type, then it is four, because the Hadiths regarding it are stronger and more numerous. The follower says Takbir as the Imam says Takbir. The explanation of that is in the original.\n\n76 - It is legislated for him to raise his hands in the first Takbir. There are two Hadiths regarding it, one strengthening the other, along with the consensus of the scholars upon it.\n\n77 - Then he places his right hand over the back of his left palm, the wrist, and the forearm, then he tightens them on his chest. Regarding that are well-known Hadiths; you can see some of them in the original. As for placing them below the navel, it is weak by agreement, as stated by Al-Nawawi, Al-Zayla'i, and others.\n\n78 - Then he recites after the first Takbir *Fatihat Al-Kitab* (The Opening of the Book) and a Surah, due to the Hadith of Talha bin Abdullah bin Awf who said: [Authentic] I prayed behind Ibn Abbas (may Allah be pleased with him) over a funeral, so he read *Fatihat Al-Kitab* and a Surah, and he recited loudly until he made us hear. When he finished, I took his hand and asked him? He said: \"I only recited loudly so you would know that it is a Sunnah and a right (truth).\"\n\n79 - And he recites silently, due to the Hadith of Abu Umamah bin Sahl who said: [Authentic] The Sunnah in the prayer over the funeral is to read in the first Takbir *Umm Al-Qur'an* (The Mother of the Quran) silently, then say Takbir three times, and the Taslim (salutation) is at the last one.\n\n80 - Then he says the second Takbir and sends blessings upon the Prophet (peace and blessings of Allah be upon him), due to the mentioned Hadith of Abu Umamah that a man from the companions of the Prophet (peace and blessings of Allah be upon him) told him: That the Sunnah in the prayer over the funeral is for the Imam to say Takbir, then read *Fatihat Al-Kitab* after",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 53
  },
  {
    "serial_number": "4356504",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 55,
    "volume_number": 1,
    "text": "the first Takbir silently to himself, then send blessings upon the Prophet (peace and blessings of Allah be upon him), and sincerely supplicate for the funeral in the three Takbirs, not reading in any of them 1, then say Taslim silently to himself when he turns to his right. The Sunnah is for the one behind him to do the same as his Imam did. As for the formula of sending blessings upon the Prophet (peace and blessings of Allah be upon him) in the funeral, I have not come across it in any of the authentic Hadiths. It appears that the funeral does not have a specific formula; rather, one uses one of the formulas established in the Tashahhud of the prescribed prayer 2.\n\n81 - Then he performs the rest of the Takbirs and sincerely supplicates in them for the deceased, due to the Hadith of Abu Umamah mentioned just now and his saying (peace and blessings of Allah be upon him): \"If you pray over the deceased, then be sincere in supplication for him.\" 3\n\n82 - He supplicates in it with what is established from him (peace and blessings of Allah be upon him) of supplications. I have found four of them:\nFirst: \"O Allah, forgive him and have mercy on him, give him well-being and pardon him, honor his reception and expand his entrance, wash him with water, snow, and hail, and cleanse him from sins as You cleansed - and in a narration: as the white garment is cleansed - of dirt. Exchange his home for a better home, his family for a better family, and his spouse - and in a narration: wife - for a better spouse. Admit him into Paradise and protect him from the punishment of the grave and from the punishment of the Fire.\"",
    "foot_note": "1. 1 Meaning from the Qur'an, so it does not contradict reciting the supplications established in them as will come shortly, Allah willing.\n2. 2 They are seven formulas I presented in *Description of the Prophet's Prayer*. The Islamic Office has printed it several times, the last being the ninth edition.\n3. 3 Al-Sindi said: Meaning single him out with supplication. Al-Munawi said: Meaning supplicate for him with sincerity and presence of heart, because the purpose of this prayer is seeking forgiveness and intercession for the deceased. Acceptance is only hoped for when sincerity and supplication are present. Therefore, supplication is legislated in the prayer over him that is not legislated similarly in supplication for the living. Ibn Al-Qayyim said: This invalidates the saying of those who claim that the dead do not benefit from the supplication of the living. I say: In the narration of Al-Hakim from the Hadith of Abu Umamah mentioned previously: \"And he makes the prayer sincere in the three Takbirs.\" Prayer (*Salah*) here means Supplication (*Dua*), evidenced by the first narration \"and makes the Dua sincere,\" because the original meaning of Salah in the language is Dua. Among the strange interpretations is what is in *Al-Qawl Al-Badi'* p. 152: \"And he makes the prayer sincere\" meaning he raises his voice in his prayer with the three Takbirs.",
    "book_id": "11108",
    "new_page_number": 54
  },
  {
    "serial_number": "4356505",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 56,
    "volume_number": 1,
    "text": "Second: \"O Allah, forgive our living and our dead, our present and our absent, our young and our old, our males and our females. O Allah, whomever You keep alive among us, keep him alive on Islam, and whomever You cause to die among us, cause him to die on Faith. O Allah, do not deprive us of his reward and do not lead us astray after him.\"\nThird: \"O Allah, indeed so-and-so son of so-and-so is under Your protection and the rope of Your security, so save him from the trial of the grave and the punishment of the Fire. You are the Possessor of faithfulness and truth, so forgive him and have mercy on him. Indeed You are the Forgiving, the Merciful.\"\nFourth: \"O Allah, Your slave and the son of Your bondswoman needed Your mercy, and You are free of need for his punishment. If he was a doer of good, then increase his good deeds, and if he was a wrongdoer, then overlook him.\" Then he supplicates whatever Allah wills him to supplicate.\n\n83 - Supplication between the last Takbir and the Taslim is legislated, due to the Hadith of Abu Ya'fur from Abdullah bin Abi Awfa (may Allah be pleased with him) who said: I witnessed him and he said Takbir over a funeral four times, then he stood for a while - meaning - supplicating. Then he said: \"Did you think I would say Takbir five times?\" They said: \"No.\" He said: \"Indeed the Messenger of Allah (peace and blessings of Allah be upon him) used to say Takbir four times.\"\n\n84 - Then he says two Taslims like his Taslim in the prescribed prayer, one to his right and the other to his left, due to the Hadith of Abdullah bin Masud (may Allah be pleased with him) who said: \"Three practices the Messenger of Allah (peace and blessings of Allah be upon him) used to do which people have abandoned: One of them is Taslim over the funeral like the Taslim in prayer.\" It is established in Sahih Muslim and others from Ibn Masud that the Prophet (peace and blessings of Allah be upon him) used to say two Taslims in prayer. This clarifies that the intended meaning of his saying in the first Hadith \"like the Taslim in prayer\" is the two customary Taslims.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 55
  },
  {
    "serial_number": "4356506",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 57,
    "volume_number": 1,
    "text": "85 - It is permissible to restrict oneself to the first Taslim only, due to the Hadith of Abu Huraira (may Allah be pleased with him): That the Messenger of Allah (peace and blessings of Allah be upon him) prayed over a funeral, so he said Takbir over it four times and said one Taslim.\n\n86 - The Sunnah is to say Taslim in the funeral silently; the Imam and those behind him are equal in that, due to the Hadith of Abu Umamah mentioned previously in Issue 80 with the wording: \"Then he says Taslim silently to himself when he departs. The Sunnah is for the one behind him to do the same as his Imam did.\"\n\n87 - It is not permissible to pray over the funeral in the three times during which prayer is forbidden unless out of necessity, due to the Hadith of Uqbah bin Amir (may Allah be pleased with him) who said: \"Three hours the Messenger of Allah (peace and blessings of Allah be upon him) used to forbid us to pray in or bury our dead in: When the sun rises appearing until it rises high, when the one standing at noon stands until the sun inclines, and when the sun leans towards setting until it sets.\" Its generality includes the prayer over the funeral, and this is what the Companions understood as I explained in the original.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 56
  },
  {
    "serial_number": "4356507",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 58,
    "volume_number": 1,
    "text": "14 - Burial and its Related Matters.\n\n88 - It is obligatory to bury the dead even if he was a disbeliever. Regarding that are two Hadiths:\nThe First: From a group of the companions of the Prophet (peace and blessings of Allah be upon him), among them Abu Talha Al-Ansari, and the context is his: That the Messenger of Allah (peace and blessings of Allah be upon him) ordered regarding twenty-four men from the leaders of Quraish on the day of Badr. They were dragged by their feet and thrown into a *Tawa* (pit) 1 from the pits of Badr, filthy and foul. Some were thrown onto others, except for Umayyah bin Khalaf, for he had swollen in his armor and filled it. So when they went to move him, he fell apart 2, so they left him and threw over him whatever earth and stones would cover him... the Hadith.\n\nThe Second: From Ali (may Allah be pleased with him) who said: When Abu Talib died, I came to the Prophet (peace and blessings of Allah be upon him) and said: \"Indeed your uncle, the misguided old man, has died; so who will bury him?\" He said: \"Go and bury him, then do not speak of anything until you come to me.\" He said: \"He died a polytheist.\" He said: \"Go and bury him.\" He said: So I buried him then came to him. He said: \"Go and perform Ghusl then do not speak of anything until you come to me.\" He said: So I performed Ghusl then came to him. He said: So he supplicated for me with supplications that I would not be pleased to exchange for red and black camels. He said: And Ali used to perform Ghusl if he washed the dead.\n\n89 - A Muslim is not buried with a disbeliever, nor a disbeliever with a Muslim. Rather, the Muslim is buried in the graveyards of the Muslims, and the disbeliever in the graveyards of the polytheists. Such was the order during the time of the Prophet (peace and blessings of Allah be upon him) and it has continued to our era. Among the evidences for that is the Hadith of Bashir bin Al-Khasasiyyah who said: While I was walking with the Messenger of Allah (peace and blessings of Allah be upon him), holding his hand, he said: \"O Ibn Al-Khasasiyyah, what",
    "foot_note": "1. 1 It is a well that was lined and reinforced with stones so it would hold and not collapse.\n2. 2 Meaning he disintegrated and his parts separated.",
    "book_id": "11108",
    "new_page_number": 57
  },
  {
    "serial_number": "4356508",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 59,
    "volume_number": 1,
    "text": "do you have to resent against Allah? 1 You are walking with the Messenger of Allah.\" He said: I think he said: Holding his hand. I said: \"O Messenger of Allah, may my father and mother be sacrificed for you, I do not resent anything against Allah; Allah has done every good for me.\" So he came upon the graves of the polytheists and said: \"These have missed much good\" - and in a narration: \"much good\" three times. Then he came upon the graves of the Muslims and said: \"These have attained much good\" three times. While he was walking, a glance from him fell upon a man walking among the graves wearing sandals. He said: \"O owner of the *Sabtiyyah* (tanned leather shoes), woe to you! Throw off your *Sabtiyyah*.\" He looked, and when the man recognized the Messenger of Allah (peace and blessings of Allah be upon him), he took off his sandals and threw them.\nIndeed, what confirms this is the Wise Lawgiver's differentiation between what a believer says if he visits the graves of Muslims and what he says if he passes by the graveyards of disbelievers, as will be explained shortly in the section on visiting graves.\n\n90 - The Sunnah is burial in the graveyard, because the Prophet (peace and blessings of Allah be upon him) used to bury the dead in the Baqi' graveyard, as reports of that are *Mutawatir* (mass transmitted). Some were presented in various occasions, the closest being the Hadith of Ibn Al-Khasasiyyah which I cited in the previous issue. It has not been reported from any of the Salaf that he was buried other than in a graveyard, except what is also *Mutawatir* that the Prophet (peace and blessings of Allah be upon him) was buried in his chamber. That is among his specific characteristics (peace and blessings of Allah be upon him), as indicated by the Hadith of Aisha (may Allah be pleased with her): She said: When the Messenger of Allah (peace and blessings of Allah be upon him) passed away, they differed regarding his burial. Abu Bakr said: I heard from the Messenger of Allah (peace and blessings of Allah be upon him) something I have not forgotten. He said: \"Allah does not take a Prophet except in the place he loves to be buried in.\" So they buried him in the place of his bedding.",
    "foot_note": "1. 1 He (peace be upon him) only said this to him because Bashir (may Allah be pleased with him) had shown some annoyance due to his distance from the land of his people. At-Tabarani narrated in Al-Kabir 1236 and Al-Awsat from Bashir himself saying: I came to the Prophet (peace and blessings of Allah be upon him) and caught up with him at Al-Baqi'. I heard him say: \"Peace be upon the people of the abodes of the believers,\" and my sandal strap broke. He said: \"Mend your strap.\" I said: \"O Messenger of Allah, my bachelorhood has been long and I am far from the abode of my people.\" He said: \"O Bashir, do you not praise Allah who took you by your forelock from among Rabi'ah, a people who believe that were it not for them the earth would overturn with those on it?\" Al-Haythami said in Al-Majma' 3/60: And its men are trustworthy. I say: There is some question in it.",
    "book_id": "11108",
    "new_page_number": 58
  },
  {
    "serial_number": "4356509",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 60,
    "volume_number": 1,
    "text": "91 - Exempted from the above are those who died as martyrs in battle; they are buried in the places of their martyrdom and are not moved to the graveyards, due to the Hadith of Jabir (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) went out from Medina to the polytheists to fight them. My father Abdullah said: \"O Jabir bin Abdullah, do not fail to be among the onlookers of the people of Medina until you know what our matter comes to. For by Allah, were it not that I leave daughters of mine behind me, I would have loved for you to be killed in front of me.\" He said: So while I was among the onlookers, my aunt came with my father and my uncle, balancing them on a camel. She entered Medina with them to bury them in our graveyards - when a man caught up calling out: \"Indeed the Messenger of Allah (peace and blessings of Allah be upon him) orders you to return with the slain and bury them in their places of death where they were killed.\" So we returned with them and buried them where they were killed.\n\n92 - Burial is not permissible in the following situations except for necessity:\nA - Burial in the three times, due to the Hadith of Uqbah bin Amir preceded in Issue 87 with the wording: \"Three hours the Messenger of Allah (peace and blessings of Allah be upon him) used to forbid us to pray in or bury our dead in...\" the Hadith.\nB - At night, due to the Hadith of Jabir (may Allah be pleased with him): \"...So the Prophet (peace and blessings of Allah be upon him) rebuked burying a man at night until he is prayed over 1 unless a person is compelled to do so.\" It has preceded in full in Issue 35.\n\n93 - If they are compelled to bury him at night, it is permissible even with the use of a lamp and descending with it into the grave to facilitate the burial process. The evidence is the Hadith of Ibn Abbas: \"That the Messenger of Allah (peace and blessings of Allah be upon him) put a man into his grave at night and lit a lamp in his grave.\"",
    "foot_note": "1. 1 Meaning during the day because it is a time likely to have a larger congregation.",
    "book_id": "11108",
    "new_page_number": 59
  },
  {
    "serial_number": "4356510",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 61,
    "volume_number": 1,
    "text": "94 - It is obligatory to deepen the grave, widen it, and improve it. Regarding this are two Hadiths:\nThe First: From Hisham bin Amir who said: When it was the day of Uhud, those of the Muslims who were struck were struck, and injuries befell the people. We said: \"O Messenger of Allah, digging for every person is difficult for us, so how do you command us?\" He said: \"Dig, widen, deepen, and improve. Bury two and three in a grave, and put forward the one who knew the most Qur'an. He said: My father was the third of three, and he knew the most Qur'an, so he was put forward.\"\n\nThe Second: From a man of the Ansar who said: We went out with the Messenger of Allah (peace and blessings of Allah be upon him) in the funeral of a man from the Ansar. I was a boy with my father. The Messenger of Allah (peace and blessings of Allah be upon him) sat at the hole of the grave and began instructing - and in a narration signaling to - the digger, saying: \"Widen from the direction of the head, and widen from the direction of the feet. For many a hanging bunch of dates is for him in Paradise.\" 1\n\n95 - *Lahd* (niche) 2 and *Shaqq* (trench) are permissible in the grave because practice proceeded upon both in the time of the Prophet (peace and blessings of Allah be upon him), but the first (*Lahd*) is better. Regarding that are Hadiths; I mention two of them:\nThe First: From Anas bin Malik who said: When the Prophet (peace and blessings of Allah be upon him) passed away, there was a man in Medina who made *Lahd* and another who made *Darih* (Shaqq). They said: \"We will seek guidance from our Lord and send for both of them; whichever arrives first, we will leave him (to do it).\" So they sent for both, and the maker of the *Lahd* arrived first, so they made a *Lahd* for the Prophet (peace and blessings of Allah be upon him).",
    "foot_note": "1. 1 I say: The apparent meaning of the command in the two Hadiths implies the obligation of what was mentioned in them regarding deepening, widening, and improving. It is known from the Shafi'is and others that deepening is recommended. As for Ibn Hazm, he explicitly stated in Al-Muhalla 5/116 its obligation. They differed on the limit of deepening according to sayings you can see in Al-Majmu' or elsewhere.\n2. 2 With Fatha on Lam and with Damma and Sukun on Ha; it is the excavation in the side of the grave from the direction of the Qiblah. The *Shaqq* is the *Darih*, which is to dig downwards like a river (trench).",
    "book_id": "11108",
    "new_page_number": 60
  },
  {
    "serial_number": "4356511",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 62,
    "volume_number": 1,
    "text": "The Second: From Ibn Abbas that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"The *Lahd* is for us, and the *Shaqq* is for others.\"\n\n96 - There is no harm in burying two or more in it in case of necessity, and the best of them is put forward. Regarding it are Hadiths; the Hadith of Anas in Issue 37 and the Hadith of Hisham bin Amir in Issue 100 94 have preceded.\n\n97 - Men, not women, undertake lowering the deceased, even if it is a female, for several reasons:\nFirst: It is the custom in the time of the Prophet (peace and blessings of Allah be upon him) and the practice of Muslims has continued upon it until today. The Hadith of Anas regarding it comes in Issue 99.\nSecond: Men are stronger for that.\nThird: If women undertook it, it would lead to the exposure of part of their bodies before strangers, which is not permissible.\n\n98 - The guardians (relatives) of the deceased have more right to lower him, due to the generality of His saying: {And those of [blood] relationship 1 are more entitled [to inheritance] in the decree of Allah.} And due to the Hadith of Ali (may Allah be pleased with him) who said: [Authentic] I washed the Messenger of Allah (peace and blessings of Allah be upon him) and went to see what usually comes from the deceased, but I saw nothing. He was pure in life and in death. Four people undertook his burial and laying him in the grave excluding the people: Ali, Al-Abbas, Al-Fadl, and Salih the freed slave of the Messenger of Allah (peace and blessings of Allah be upon him). A *Lahd* was made for the Messenger of Allah, and bricks were set up over him.\nAnd from Abdur-Rahman bin Abza who said: I prayed with Umar bin Al-Khattab over Zainab bint Jahsh in Medina. He said Takbir four times, then sent word to the wives of the Prophet (peace and blessings of Allah be upon him): \"Who do you order to put her into the grave?\" He said: And he liked to be the one to undertake that. So they sent word to him: \"Look at who used to see her during her life; let him be the one to put her into the grave.\" So Umar said: \"You have spoken the truth.\"",
    "foot_note": "1. 1 They are the father and his fathers, the son and his sons, then full brothers, then those for the father, then their sons, then paternal uncles for father and mother, then for father, then their sons, then every Mahram relative. So in Al-Muhalla 5/143. And similar in Al-Majmu' 5/290.",
    "book_id": "11108",
    "new_page_number": 61
  },
  {
    "serial_number": "4356512",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 63,
    "volume_number": 1,
    "text": "99 - It is permissible for the husband to undertake the burial of his wife himself, due to the Hadith of Aisha (may Allah be pleased with her) who said: The Messenger of Allah (peace and blessings of Allah be upon him) entered upon me on the day following the one in which his illness began, and I said: \"Oh my head!\" He said: \"I wish that had happened while I was alive, so I would prepare you and bury you.\" She said: So I said: Jealousy! It is as if I see you on that day as a bridegroom with one of your wives. He said: \"Rather, I, oh my head! Call for me your father and your brother so I can write a writing for Abu Bakr, for I fear that a sayer will say or a wisher will wish: 'I am more entitled,' while Allah Mighty and Majestic and the believers refuse anyone except Abu Bakr.\"\n\n100 - However, that is conditional upon him not having had intercourse that night; otherwise, it is not legislated for him to bury her, and someone else would be more entitled to bury her, even if a stranger, with the mentioned condition. Due to the Hadith of Anas bin Malik (may Allah be pleased with him) who said: We attended the funeral of a daughter of the Messenger of Allah (peace and blessings of Allah be upon him), and the Messenger of Allah (peace and blessings of Allah be upon him) was sitting by the grave. I saw his eyes tearing. Then he said: \"Is there a man among you who did not commit intercourse (*Yuqarif*) with his family last night?\" Abu Talha said: \"Yes, I am, O Messenger of Allah.\" He said: \"Then descend.\" He said: So he descended into her grave and buried her. 1\n\n101 - The Sunnah is to insert the deceased from the rear (foot end) of the grave, due to the Hadith of Abu Ishaq who said: Al-Harith instructed in his will that Abdullah bin Yazid pray over him. So he prayed over him, then put him into the grave from the direction of the grave's feet and said: \"This is from the Sunnah.\" And from Ibn Sirin who said: I was with Anas at a funeral, so he ordered concerning the deceased, so he was inserted from the direction of the feet of the grave.",
    "foot_note": "1. 1 I say: The Hadith indicates clearly what we titled for it, and Ibn Hazm held this view (may Allah have mercy on him) 5/144-145. It is strange that the general books of Fiqh that I came across or checked on this occasion did not address this issue either by negation or affirmation. This is one of many proofs that the Faqih cannot dispense with the books of Sunnah, contrary to what the fanatics of the Madhhabs think, that the books of Fiqh suffice instead of the books of Hadith, and even the Book of Allah, Blessed and Exalted, far above what the wrongdoers say. See *Silsilat Al-Ahadith Al-Sahihah* Vol 1, p 128-129, printed by the Islamic Office.",
    "book_id": "11108",
    "new_page_number": 62
  },
  {
    "serial_number": "4356513",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 64,
    "volume_number": 1,
    "text": "102 - The deceased is placed in his grave on his right side, his face facing the Qiblah, and his head and feet to the right and left of the Qiblah. This has been the practice of the people of Islam from the time of the Messenger of Allah (peace and blessings of Allah be upon him) to our day, and such is every graveyard on the face of the earth. Thus in Al-Muhalla 5/173 and others.\n\n103 - The one who places him in his *Lahd* says: \"In the name of Allah, and upon the Sunnah of the Messenger of Allah,\" or: \"the Millah (religion) of the Messenger of Allah (peace and blessings of Allah be upon him).\" Or he says: \"In the name of Allah, and by Allah, and upon the Millah of the Messenger of Allah (peace and blessings of Allah be upon him).\" He (peace and blessings of Allah be upon him) commanded all of that.\n\n104 - It is recommended for the one at the grave to throw three handfuls of dirt with both hands after finishing the closing of the *Lahd*, due to the Hadith of Abu Huraira: That the Messenger of Allah (peace and blessings of Allah be upon him) prayed over a funeral, then came to the deceased and threw earth upon him from the direction of his head three times.\n\n105 - After finishing his burial, several things are Sunnah:\nFirst: To raise the grave slightly above the ground, about a hand-span, and not to level it with the ground so it is distinguished, preserved, and not disrespected, due to the Hadith of Jabir (may Allah be pleased with him): That the Prophet (peace and blessings of Allah be upon him) had a *Lahd* made for him, bricks were set up over him, and his grave was raised from the ground about a hand-span.\nSecond: To make it mounded (*Musannam*), due to the Hadith of Sufyan At-Tammar who said: I saw the grave of the Prophet (peace and blessings of Allah be upon him) and the graves of Abu Bakr and Umar mounded.\nThird: To mark it with a stone or the like so that his family members who die can be buried near him, due to the Hadith of Al-Muttalib bin Abi Wada'ah (may Allah be pleased with him) who said: When Uthman bin Maz'un died, his funeral was taken out and he was buried. The Prophet (peace and blessings of Allah be upon him) ordered a man to",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 63
  },
  {
    "serial_number": "4356514",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 65,
    "volume_number": 1,
    "text": "bring him a rock, but he was unable to carry it. So the Messenger of Allah (peace and blessings of Allah be upon him) went to it and rolled up his sleeves from his arms. Al-Muttalib said: The one who told me about the Messenger of Allah (peace and blessings of Allah be upon him) said: It is as if I am looking at the whiteness of the arms of the Messenger of Allah (peace and blessings of Allah be upon him) when he uncovered them. Then he carried it and placed it at his head and said: \"I mark with it the grave of my brother, and I bury near him whoever dies of my family.\"\nFourth: Not to instruct (*Talqin*) the deceased with the instruction known today, because the Hadith reported regarding it is not authentic. Rather, one stands at the grave supplicating for steadfastness for him and seeking forgiveness for him, and ordering those present to do so, due to the Hadith of Uthman bin Affan (may Allah be pleased with him) who said: The Prophet (peace and blessings of Allah be upon him) used to, when he finished burying the deceased, stand over him and say: \"Seek forgiveness for your brother and ask for steadfastness for him, for he is now being questioned.\"\n\n106 - It is permissible to sit by him during the burial with the intention of reminding those present of death and what comes after it, due to the Hadith of Al-Bara' bin Azib. There is no harm in mentioning it at length due to what it contains of hope, fear, and admonition. He said: We went out with the Prophet (peace and blessings of Allah be upon him) in a funeral of a man from the Ansar. We reached the grave and the niche had not yet been dug. So the Messenger of Allah (peace and blessings of Allah be upon him) sat facing the Qiblah, and we sat around him as if birds were on our heads. In his hand was a stick with which he was scratching the ground. He began looking at the ground and raising his gaze and lowering it three times. Then he said: \"Seek refuge in Allah from the punishment of the grave\" twice or thrice. Then he said: \"O Allah, I seek refuge in You from the punishment of the grave\" three times. Then he said: \"Indeed, the believing servant, when he is in departure from this world and approach to the Hereafter, angels descend to him from the sky with white faces as if their faces were the sun, having with them a shroud from the shrouds of Paradise and perfume (*Hanoot*) from the perfume of Paradise, until they sit from him as far as the eye can see. Then the Angel of Death (peace be upon him) comes until he sits at his head and says: 'O good soul - and in a narration: reassured soul - come out to forgiveness from Allah and pleasure.' He said: So it comes out flowing as the drop flows from the mouth of the waterskin. So he takes it - and in a narration: until when his soul comes out, every angel between the sky and earth prays over it",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 64
  },
  {
    "serial_number": "4356515",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 66,
    "volume_number": 1,
    "text": "and every angel in the sky. And the gates of the sky are opened for him; there are no people of a gate except that they supplicate to Allah that his soul ascend through them. When he (Angel of Death) takes it, they do not leave it in his hand for the blink of an eye until they take it and place it in that shroud and that perfume. That is His saying, Exalted is He: {Our messengers take him, and they do not fail.} And there comes out from it like the best scent of musk found on the face of the earth. He said: So they ascend with it, and they do not pass - meaning with it - by a group of angels except that they say: 'What is this good soul?' So they say: 'So-and-so son of So-and-so' with the best of his names by which they used to name him in the world, until they reach the lowest heaven with it. They ask for it to be opened, and it is opened for them. Those closest to Allah in every heaven accompany it to the heaven that follows it until it reaches the seventh heaven. So Allah Mighty and Majestic says: 'Write the book of My servant in *Illiyyin*. {And what can make you know what is Illiyyun? It is a register inscribed, Which is witnessed by those brought near.}' So his book is written in *Illiyyin*. Then He says: 'Return him to the earth, for I promised them that from it I created them, and into it I return them, and from it I extract them another time.' He said: So he is returned to the earth, and his soul is returned to his body. He said: Indeed, he hears the tapping of the sandals of his companions when they turn away from him departing. Then two angels with severe rebuke come to him, rebuke him, and make him sit. They say to him: 'Who is your Lord?' He says: 'My Lord is Allah.' They say to him: 'What is your religion?' He says: 'My religion is Islam.' They say to him: 'Who is this man who was sent among you?' He says: 'He is the Messenger of Allah (peace and blessings of Allah be upon him).' They say to him: 'And what is your knowledge?' He says: 'I read the Book of Allah and believed in it and affirmed it.' So he rebukes him and says: 'Who is your Lord? What is your religion? Who is your Prophet?' And this is the last trial presented to the believer. That is when Allah Mighty and Majestic says: {Allah keeps firm those who believe, with the firm word, in worldly life}. So he says: 'My Lord is Allah, my religion is Islam, and my Prophet is Muhammad (peace and blessings of Allah be upon him).' Then a caller calls from the sky: 'My servant has spoken the truth, so spread out for him from Paradise and clothe him from",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 65
  },
  {
    "serial_number": "4356516",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 67,
    "volume_number": 1,
    "text": "Paradise, and open for him a door to Paradise.' He said: So its breeze and fragrance come to him, and his grave is expanded for him as far as his eye can see. He said: And in a narration: A man with a handsome face, handsome clothes, and good scent appears to him and says: 'Rejoice with what pleases you, rejoice with pleasure from Allah and gardens containing lasting bliss. This is your day which you were promised.' So he says to him: 'And you, may Allah give you glad tidings of good, who are you? For your face is the face that brings good.' So he says: 'I am your righteous deed. By Allah, I only knew you to be quick in the obedience of Allah, slow in the disobedience of Allah, so may Allah reward you with good.' Then a door from Paradise and a door from the Fire are opened for him, and it is said: 'This would have been your place had you disobeyed Allah; Allah has exchanged this for you.' When he sees what is in Paradise, he says: 'My Lord, hasten the establishment of the Hour so that I may return to my family and my wealth.' So it is said to him: 'Reside.' He said: And indeed the disbelieving servant - and in a narration: the wicked - when he is in departure from the world and approach to the Hereafter, angels descend to him from the sky, harsh and severe, with black faces, having with them *Masuh* (sackcloth) 1 from the Fire. They sit from him as far as the eye can see. Then the Angel of Death comes until he sits at his head and says: 'O foul soul, come out to anger from Allah and wrath.' He said: So it scatters throughout his body, and he pulls it out just as the multi-pronged skewer (*Saffud*) is pulled out of wet wool, tearing with it the veins and nerves. Every angel between the sky and earth and every angel in the sky curses him. The gates of the sky are closed; there are no people of a gate except that they supplicate to Allah that his soul not ascend through them. So he takes it. If he takes it, they do not leave it in his hand for the blink of an eye until they place it in that sackcloth. And there comes out from it like the foulest stench of a corpse found on the face of the earth. So they ascend with it, and they do not pass by a group of angels except that they say: 'What is this foul soul?' So they say: 'So-and-so son of So-and-so' - with the ugliest of his names by which he used to be called in the world, until they reach the lowest heaven with it. They ask for it to be opened for him, but it is not opened for him. Then the Messenger of Allah recited:",
    "foot_note": "1. 1 Plural of *Mas-h* with Kasra on the Mim; it is what is worn of woven hair on the body for austerity and suppression of the body.",
    "book_id": "11108",
    "new_page_number": 66
  },
  {
    "serial_number": "4356517",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 68,
    "volume_number": 1,
    "text": "(peace and blessings of Allah be upon him): {The gates of Heaven will not be opened for them, nor will they enter Paradise until a camel enters into the eye of a needle.} 1 So Allah Mighty and Majestic says: 'Write his book in *Sijjin* in the lowest earth.' Then it is said: 'Return My servant to the earth, for I promised them that from it I created them, and into it I return them, and from it I extract them another time.' So his soul is thrown from the sky, a throw until it falls into his body. Then he recited: {And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place.} So his soul is returned to his body. He said: Indeed he hears the tapping of the sandals of his companions when they turn away from him. Then two angels with severe rebuke come to him, rebuke him, and make him sit. They say to him: 'Who is your Lord?' He says: 'Haah, Haah 2, I do not know.' They say to him: 'What is your religion?' He says: 'Haah, Haah, I do not know.' They say to him: 'What do you say about this man who was sent among you?' He cannot find his name, so it is said: 'Muhammad.' He says: 'Haah, Haah, I do not know. I heard the people saying that.' He said: So it is said: 'You did not know nor did you recite.' Then a caller calls from the sky: 'He has lied, so spread out for him from the Fire, and open for him a door to the Fire.' So its heat and scorching wind come to him, and his grave tightens upon him until his ribs interlock. And there comes to him - and in a narration: there appears to him - a man with an ugly face, ugly clothes, and a foul stench who says: 'Receive tidings of what displeases you; this is your day which you were promised.' So he says: 'And you, may Allah give you tidings of evil, who are you? For your face is the face that brings evil.' He says: 'I am your foul deed. By Allah, I only knew you to be slow in the obedience of Allah, quick to the disobedience of Allah, so may Allah reward you with evil.' Then a blind, deaf, and mute (being) is appointed over him, in his hand a sledgehammer; if a mountain were struck with it, it would become dust. So he strikes him a blow until he becomes dust. Then Allah restores him as he was, and he strikes him another blow, so he screams a scream which everything hears",
    "foot_note": "1. 1 Meaning the hole of the needle. The *Jamal* (camel) is the well-known animal, which is what has reached nine years of age.\n2. 2 It is a word said in laughter and in threat, and it may be said for expressing pain, which is more fitting to the meaning of the Hadith. And Allah knows best. Thus in *At-Targhib*.",
    "book_id": "11108",
    "new_page_number": 67
  },
  {
    "serial_number": "4356518",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 69,
    "volume_number": 1,
    "text": "except the *Thaqalayn* (men and jinn). Then a door from the Fire is opened for him, and bedding from the Fire is spread out. So he says: 'My Lord, do not establish the Hour.'\n\n107 - It is permissible to exhume the deceased from the grave for a valid reason, such as if he was buried before being washed and shrouded and the like, due to the Hadith of Jabir bin Abdullah who said: [Authentic] The Messenger of Allah (peace and blessings of Allah be upon him) came to Abdullah bin Ubayy after he had been placed in his pit. He ordered regarding him, so he was taken out. He placed him on his knees, blew lightly (*nafatha*) upon him from his saliva, and clothed him in his shirt. Jabir said: And he prayed over him, so Allah knows best 1. And he had clothed Abbas in a shirt.\n\n108 - It is not recommended for a man to dig his grave before he dies, for the Prophet (peace and blessings of Allah be upon him) did not do that, nor did his companions. The servant does not know where he will die. If the man's intention is preparation for death, then this is from righteous deeds. Thus in *Al-Ikhtiyarat Al-'Ilmiyyah* of Sheikh al-Islam Ibn Taymiyyah, may Allah the Exalted have mercy on him.",
    "foot_note": "1. 1 Meaning regarding the wisdom for why he (peace and blessings of Allah be upon him) did that with Ibn Ubayy despite him being a hypocrite. It appears that this was before the revelation of the saying of the Exalted: {And do not pray [the funeral prayer, O Muhammad], over any of them who has died - ever - or stand at his grave} the Verse.",
    "book_id": "11108",
    "new_page_number": 68
  },
  {
    "serial_number": "4356519",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 70,
    "volume_number": 1,
    "text": "15- Condolences (*At-Ta'ziyah*).\n\n109 - Consoling the family of the deceased is legislated 1. Regarding it are two Hadiths:\nThe First: From Qurrah Al-Muzani (may Allah be pleased with him) who said: [Authentic] The Prophet of Allah (peace and blessings of Allah be upon him) used to, when he sat, have a group of his companions sit with him. Among them was a man who had a small son; he would come to him from behind his back and seat him in front of him. The Prophet (peace and blessings of Allah be upon him) said to him: \"Do you love him?\" He said: \"O Messenger of Allah, may Allah love you as I love him.\" Then he (the son) died. The man refrained from attending the circle due to the remembrance of his son, and he grieved for him. So the Prophet (peace and blessings of Allah be upon him) missed him and said: \"Why do I not see so-and-so?\" They said: \"O Messenger of Allah, his son whom you saw has died.\" So the Prophet (peace and blessings of Allah be upon him) met him and asked him about his son? He informed him that he had died. So he offered him condolences for him, then said: \"O so-and-so, which is more beloved to you: that you enjoy him for your lifespan, or that you do not come tomorrow to a gate from the gates of Paradise except that you find him having preceded you to it, opening it for you?\" He said: \"O Prophet of Allah, rather that he precedes me to the gate of Paradise and opens it for me is more beloved to me.\" He said: \"Then that is for you.\" A man from the Ansar said: \"O Messenger of Allah, may Allah make me your sacrifice, is it for him specifically or for all of us?\" He said: \"Rather, for all of you.\"\n\nThe Second: From Anas bin Malik (may Allah be pleased with him) from the Prophet (peace and blessings of Allah be upon him) who said: \"Whoever consoles his believing brother in his calamity, Allah will clothe him in a green garment of honor by which he will be delighted (*yuhbar*) on the Day of Judgment.\" It was said: \"O Messenger of Allah, what is *yuhbar*?\" He said: \"He will be envied (in a good way/ *yughbat*).\"",
    "foot_note": "1. 1 It is urging patience by promising reward and supplicating for the deceased and the afflicted.",
    "book_id": "11108",
    "new_page_number": 69
  },
  {
    "serial_number": "4356520",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 71,
    "volume_number": 1,
    "text": "110 - He should console them with what he thinks will comfort them, suppress their sadness, and encourage them to be content and patient, using what is established from the Prophet (peace and blessings of Allah be upon him) if he knows and recalls it. Otherwise, with whatever good words are available to him that achieve the purpose and do not contradict the Sharia, such as their saying: 'May He give you his remaining lifespan' (A'taka Umrahu). Regarding this are Hadiths:\nFirst: From Usama bin Zaid who said: One of the daughters of the Prophet (peace and blessings of Allah be upon him) sent a message to him: That a son of hers - or a daughter, and in a narration Umaymah bint Zainab 1 - is dying, so witness us. He said: So he sent a messenger to her conveying the Salam and saying: 'Indeed, to Allah belongs what He took, and to Allah belongs what He gave, and everything with Him has a fixed term. So let her be patient and seek reward from Allah...' The Hadith.\nI say: This wording of condolence, although reported regarding someone approaching death, using it for someone who has already died is more appropriate by indication of the text. For this reason, Al-Nawawi said in Al-Adhkar and elsewhere: 'This Hadith is the best form of condolence.'\nSecond: His saying (peace and blessings of Allah be upon him) to the Ansari woman, consoling her for her son: 'It has reached me that you are grieving over your son,' so he commanded her to fear Allah and be patient. She said: 'O Messenger of Allah, why should I not grieve when I am a *Raqoob* woman (childless), I do not give birth, and I had none but him?' The Messenger of Allah (peace and blessings of Allah be upon him) said: 'The *Raqoob* is the one whose child survives (and she dies without sending one ahead).' Then he said: 'There is no Muslim man or woman whose three children die, and they seek reward from Allah for them, except that Allah will admit them into Paradise because of them.' Umar, who was to the right of the Prophet (peace and blessings of Allah be upon him), said: 'May my father and mother be sacrificed for you, and two?' He said: 'And two.'",
    "foot_note": "1. 1 I say: Then this Umaymah - also called Umamah - lived until Ali married her after Fatima (may Allah be pleased with them).",
    "book_id": "11108",
    "new_page_number": 70
  },
  {
    "serial_number": "4356521",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 72,
    "volume_number": 1,
    "text": "Third: His saying (peace and blessings of Allah be upon him) when he entered upon Umm Salamah (may Allah be pleased with her) following the death of Abu Salamah: 'O Allah, forgive Abu Salamah, raise his degree among the guided, grant him a successor in his descendants who remain behind, forgive us and him, O Lord of the worlds, make his grave spacious for him, and light it for him.' This has been presented in full in Issue 17.\nFourth: His saying (peace and blessings of Allah be upon him) in his condolence to Abdullah bin Ja'far regarding his father: 'O Allah, grant Ja'far a successor in his family, and bless Abdullah in the transaction of his right hand.' He said it three times. It comes in full in the following issue.\n\n111 - Condolence is not limited to three days not to be exceeded; rather, whenever he sees a benefit in condolence, he should perform it. It is established from him (peace and blessings of Allah be upon him) that he offered condolences after three days in the Hadith of Abdullah bin Ja'far (may Allah be pleased with them both) who said: The Messenger of Allah (peace and blessings of Allah be upon him) sent an army and appointed Zaid bin Harithah over them and said: 'If Zaid is killed or martyred, then your commander is Ja'far. If he is killed or martyred, then your commander is Abdullah bin Rawahah.' They met the enemy, so Zaid took the banner and fought until he was killed. Then Ja'far took the banner and fought until he was killed. Then Abdullah took it and fought until he was killed. Then Khalid bin Al-Walid took the banner and Allah granted him victory. The news of them came to the Prophet (peace and blessings of Allah be upon him), so he went out to the people, praised Allah and extolled Him, and said: 'Indeed, your brothers met the enemy. Zaid took the banner and fought until he was killed and martyred. Then... then... then the banner was taken by a sword from the swords of Allah, Khalid bin Al-Walid, and Allah granted him victory.'",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 71
  },
  {
    "serial_number": "4356522",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 73,
    "volume_number": 1,
    "text": "So he waited, then gave the family of Ja'far three days respite to come to them. Then he came to them and said: 'Do not weep over my brother after this day. Call my nephews to me.' He said: So we were brought as if we were chicks. He said: 'Call the barber for me.' So the barber was brought and he shaved our heads. Then he said: 'As for Muhammad, he resembles our uncle Abu Talib. As for Abdullah, he resembles my physical creation and my character.' Then he took my hand and raised it and said: 'O Allah, grant Ja'far a successor in his family, and bless Abdullah in the transaction of his right hand.' He said it three times. He said: Then our mother came and mentioned our orphanhood to him and began to complain of grief 1 to him. He said: 'Are you afraid of poverty for them while I am their guardian in this world and the Hereafter?'\n\n112 - Two things should be avoided, even if people follow them customarily:\nA - Gathering for condolences in a specific place like a house, graveyard, or mosque.\nB - The family of the deceased preparing food to host those coming for condolences.\nThis is due to the Hadith of Jarir bin Abdullah Al-Bajali (may Allah be pleased with him) who said: 'We used to consider - and in a narration: see - gathering with the family of the deceased and making food after his burial as part of wailing (Niyahah).'\nAl-Nawawi said in Al-Majmu' 5/306: 'As for sitting for condolences, Al-Shafi'i, the author (Al-Shirazi), and all the companions (of the Shafi'i school) stated it is disliked (Makruh). They said: By sitting for it, they mean that the family of the deceased gathers in a house so that those who want to offer condolences come to them. They said: Rather, they should go about their needs, and whoever meets them consoles them. There is no difference between men and women in the dislike of sitting for it.'\nThe text of Imam Al-Shafi'i to which Al-Nawawi referred in Kitab Al-Umm 1/248 is:",
    "foot_note": "1. 1 Meaning she causes him grief and sadness. Derived from 'Afraha': if he saddened him and removed joy from him. 'Afrahahu Ad-Dayn': Debt burdened him.",
    "book_id": "11108",
    "new_page_number": 72
  },
  {
    "serial_number": "4356523",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 74,
    "volume_number": 1,
    "text": "'And I dislike *Al-Ma'atim* - which is the gathering (of people) - even if there is no crying, for that renews grief and imposes costs (burden), alongside what has passed in the narration regarding it.' It is as if he is referring to this Hadith of Jarir.\nAl-Nawawi said: 'The author and others argued for it with another proof, which is that it is an innovation (Muhdath).'\nLikewise, Ibn Al-Humam stated in Sharh Al-Hidayah 1/473 the dislike of the family of the deceased hosting a meal, and he said: 'It is an ugly innovation.' This is also the Madhhab of the Hanbalis as in Al-Insaf 2/565.\n\n113 - The Sunnah is only that the relatives and neighbors of the deceased make food for the family of the deceased that satisfies them, due to the Hadith of Abdullah bin Ja'far (may Allah be pleased with him) who said: When the news of Ja'far's death came, the Prophet (peace and blessings of Allah be upon him) said: 'Make food for the family of Ja'far, for there has come to them a matter that occupies them - or has come to them what occupies them.'\nImam Al-Shafi'i said in Al-Umm 1/247: 'And I like for the neighbors of the deceased or his relatives to make for the family of the deceased on the day he dies and its night food that satisfies them, for that is a Sunnah and a noble memory, and it is from the actions of the people of goodness before us and after us.' Then he quoted the mentioned Hadith from Abdullah bin Ja'far.\n\n114 - It is recommended to wipe the head of the orphan and honor him, due to the Hadith of Abdullah bin Ja'far who said: If you had seen me, Qutham, and Ubaidullah bin Abbas while we were young boys playing, when the Prophet (peace and blessings of Allah be upon him) passed by on a mount. He said: 'Lift this one to me.' He said: So he carried me in front of him. And he said to (concerning) Qutham: 'Lift this one to me,' so he carried him behind him. Ubaidullah was more beloved to Abbas than Qutham, so he did not feel shy from his uncle that he carried Qutham and left him. He said:",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 73
  },
  {
    "serial_number": "4356524",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 75,
    "volume_number": 1,
    "text": "Then he wiped over my head three times and said each time he wiped: 'O Allah, grant Ja'far a successor in his son.' He said: I said to Abdullah: What happened to Qutham? He said: He was martyred. He said: I said: Allah and His Messenger know best about the good. He said: Yes.\n\nWhat Benefits the Deceased.\n\n115 - The deceased benefits from the action of others in several matters:\nFirst: The supplication of a Muslim for him if the conditions of acceptance are met, due to the saying of Allah, Blessed and Exalted: {And those who came after them say: \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\"}\nAs for the Hadiths, they are very many; some have preceded and some will come in the section on visiting graves and the Prophet's supplication for them and his command to do so. Among them is his saying (peace and blessings of Allah be upon him): 'The supplication of a Muslim man for his brother in his absence is answered. At his head is an appointed angel; whenever he supplicates for his brother with good, the appointed angel says: Amen, and for you the same.' Indeed, the funeral prayer itself is largely evidence for this, because most of it is supplication for the deceased and seeking forgiveness for him, as previously explained.\n\nSecond: The guardian (Wali) of the deceased making up the fast of a vow (Nadhr) on his behalf. Regarding this are Hadiths:\nThe First: From Aisha (may Allah be pleased with her) that the Messenger of Allah (peace and blessings of Allah be upon him) said: 'Whoever dies while having fasting due upon him, his guardian fasts on his behalf.' This is interpreted as referring to the fast of a vow, not the fast of Ramadan, and its explanation is in the original.\nThe Second: From Ibn Abbas (may Allah be pleased with him): That a woman rode the sea and vowed that if Allah, Blessed and Exalted, saved her, she would fast",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 74
  },
  {
    "serial_number": "4356525",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 76,
    "volume_number": 1,
    "text": "a month. Allah, Mighty and Majestic, saved her, but she did not fast until she died. A female relative of hers, either her sister or her daughter, came to the Prophet (peace and blessings of Allah be upon him) and mentioned that to him. He said: 'Do you see that if she had a debt, you would pay it off?' She said: 'Yes.' He said: 'Then the debt of Allah has more right to be paid.' [So] 'Pay it (fast) on behalf of your mother.'\n\nThird: Paying off the debt on his behalf by any person, whether a guardian or otherwise, as preceded.\n\nFourth: The righteous deeds performed by the righteous child, for the parents have a reward similar to his reward without diminishing anything from his reward, because the child is from their striving and earning. Allah, Mighty and Majestic, says: {And that there is not for man except that [good] for which he strives}. And the Messenger of Allah (peace and blessings of Allah be upon him) said: 'Indeed the best of what a man eats is from his earning, and indeed his child is from his earning.'\nWhat the verse and Hadith indicate is supported by specific Hadiths reported regarding the parent benefiting from the deed of his righteous child, such as charity, fasting, freeing slaves, and the like. These are some of them:\nThe First: From Aisha (may Allah be pleased with her): That a man said: 'My mother passed away suddenly 1 and did not make a will. I think if she had spoken she would have given charity. Will she have a reward if I give charity on her behalf, and will I have a reward?' He said: 'Yes, give charity on her behalf.'\nThe Second: From Abdullah bin Umar: That Al-Aas bin Wa'il Al-Sahmi made a will that one hundred slaves be freed on his behalf. His son Hisham freed fifty slaves. His son Amr wanted to free the remaining fifty on his behalf, so he said: 'Until I ask the Messenger of Allah (peace and blessings of Allah be upon him).' So he came to the Prophet (peace and blessings of Allah be upon him) and said: 'O Messenger of Allah, indeed my father willed that one hundred slaves be freed on his behalf. Hisham freed fifty on his behalf, and fifty remain upon him. Should I free them on his behalf?' The Messenger of Allah (peace and blessings of Allah be upon him) said: 'If he was a Muslim, and you freed slaves on his behalf, or gave charity on his behalf, or performed Hajj on his behalf, that would reach him.' And in a narration: 'If he had affirmed Monotheism (Tawhid), and you fasted and gave charity on his behalf, that would benefit him.'",
    "foot_note": "1. 1 With Damma on the Ta and Kasra on the Lam (Uftulitat), meaning taken/snatched (passive voice), i.e., she died suddenly.",
    "book_id": "11108",
    "new_page_number": 75
  },
  {
    "serial_number": "4356526",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Abridgment of the Rulings of Funerals",
    "edition": "Third Edition",
    "publisher": "Maktabat al-Ma‘arif",
    "page_number": 77,
    "volume_number": 1,
    "text": "Fifth: What a person leaves behind after his death of righteous traces and ongoing charity. This is based on the saying of the Exalted: “We record what they have sent ahead and the traces they left behind,” and the saying of the Prophet ﷺ: “When a person dies, his deeds come to an end except for three things: ongoing charity, beneficial knowledge, or a righteous child who prays for him.” And from Jarir ibn ‘Abdullah رضي الله عنه who said: We were with the Messenger of Allah ﷺ at the beginning of the day when a group of people came to him—barefoot, wearing tattered striped cloaks or simple woolen garments, carrying swords, with no lower garments nor anything else. Most of them were from Mudar, rather, all of them were from Mudar. The face of the Messenger of Allah ﷺ changed— in another narration: it tightened (both expressions have the same meaning)—when he saw their state of extreme poverty. He entered his home, then came out and ordered Bilal to call the adhan. After the prayer of Dhuhr, he ascended a small pulpit and delivered a sermon. He praised Allah and glorified Him, then said: “To proceed: Allah has revealed in His Book: ‘O mankind! Fear your Lord who created you from a single soul, and created from it its spouse, and spread from the two of them many men and women. And fear Allah through whom you ask one another, and honor the ties of kinship. Indeed, Allah is ever watching over you.’ And the verse in Surah al-Hashr: ‘O you who believe! Fear Allah, and let every soul look to what it has sent forth for tomorrow. And fear Allah; indeed, Allah is fully aware of what you do. And do not be like those who forgot Allah, so He made them forget themselves. They are the defiantly disobedient. Not equal are the people of the Fire and the people of Paradise; the people of Paradise are the successful.’ Give charity before a time comes when charity will no longer be accepted from you. A man should give from his dinar, his dirham, his clothing, a measure of his wheat, a measure of his barley, a measure of his dates—even half a date. And none of you should think any form of charity insignificant.” But the people were slow to respond, and the signs of anger appeared on his face. Then a man from the Ansar came with a pouch of silver coins, and…",
    "foot_note": "1. He specified “righteous” (child) because reward is not obtained from an unrighteous child; as for sin, the parent does not bear the sin of the child if the parent’s intention was to cultivate goodness. Mentioning the child’s supplication was for encouragement, not as a condition—because the parent receives reward from the deeds of a righteous child whether the child prays for the parent or not, like someone who plants a tree: whoever eats from its fruit grants him reward whether they pray for him or not. Likewise for the mother. This is explained in *Mubāraq al-Azhār* in the commentary on *Mashāriq al-Anwār* by Ibn al-Malik.",
    "book_id": "11108",
    "new_page_number": 76
  },
  {
    "serial_number": "4356527",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 78,
    "volume_number": 1,
    "text": "narration: 'of gold, his palm almost failing to hold it, rather it had failed. He handed it to the Messenger of Allah (peace and blessings of Allah be upon him) while he was on his pulpit. He said: O Messenger of Allah, this is in the path of Allah. The Messenger of Allah (peace and blessings of Allah be upon him) took it. Then Abu Bakr stood up and gave, then Umar stood up and gave, then the Muhajirun and the Ansar stood up and gave. Then people followed in giving charities; some with a dinar, some with a dirham, some with this and some with that, until I saw two piles of food and clothes, until I saw the face of the Messenger of Allah (peace and blessings of Allah be upon him) beaming as if it were gilded. The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Whoever introduces a good practice (Sunnah Hasanah) in Islam, he will have its reward and the like of the reward of those who act upon it after him, without that decreasing anything from their rewards. And whoever introduces a bad practice (Sunnah Sayyi'ah) in Islam, upon him will be its burden and the like of the burden of those who act upon it after him, without that decreasing anything from their burdens.\" Then he recited this verse: {And We record what they have put forth and their footprints (traces).} He said: So he distributed it among them.' 1\n\nVisiting Graves:\n116 - Visiting graves is legislated for taking admonition from them and remembering the Hereafter, provided that one does not say at them what angers the Lord, Glory be to Him and Exalted, such as supplicating to the buried person, seeking help from him besides Allah the Exalted, or praising him excessively (*Tazkiyah*) and asserting Paradise for him, and the like. Regarding this are well-known Hadiths; there is no necessity to mention them here. Whoever wishes may refer to them in the original.\n\n117 - Women are like men in the recommendation of visiting graves for several reasons:\nFirst: The generality of his saying (peace and blessings of Allah be upon him): \"So visit the graves,\" which includes women. The explanation is: When the Prophet (peace and blessings of Allah be upon him) forbade visiting the grave in the beginning of the matter, there is no doubt that",
    "foot_note": "1. 1 I say: Let the noble reader reflect on the context of the Hadith and the occasion on which the Prophet (peace and blessings of Allah be upon him) said it. It will become clear to him that using it as evidence to prove 'good innovation' (Bid'ah Hasanah) in Islam is furthest from correctness. Because there is no mention in its context of an innovation that occurred. So how can it be correct to interpret the Hadith by their saying \"Whoever innovates a good innovation in Islam\" as the innovators say? He (peace and blessings of Allah be upon him) only said it on the occasion of the Ansari coming with his charity before others, then people followed with their charities after him. So he had the reward of his charity and the reward of their charities because he was the one who initiated ('Sanna') and started it in that gathering. Thus, the Hadith is about legislated charity and not about blameworthy innovation in a general sense. Thereby, it becomes clear to anyone with two eyes that the Hadith does not contradict his saying (peace and blessings of Allah be upon him): \"Every innovation is misguidance,\" and that it is not permissible to specify this universal rule which he (peace and blessings of Allah be upon him) used to teach people in their gatherings, especially in the Friday sermon.",
    "book_id": "11108",
    "new_page_number": 77
  },
  {
    "serial_number": "4356528",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 79,
    "volume_number": 1,
    "text": "the prohibition included men and women together. When he said: \"I had forbidden you from visiting graves,\" it was understood that he meant both genders necessarily, as he was informing them about what was in the beginning of the matter regarding the prohibition of both genders. Since the matter is so, it was necessary that the address in the second sentence of the Hadith, which is his saying: \"So visit them,\" he intended by it both genders as well.\nThis is supported by the fact that the address in the rest of the actions mentioned in his narration: \"And I had forbidden you from the meat of sacrificial animals beyond three days, so keep what seems good to you. And I had forbidden you from *Nabidh* (date-wine) except in a waterskin, so drink from all vessels but do not drink an intoxicant.\"\nI say: The address in all these actions is directed to both genders definitively, just as is the case in the first address: \"I had forbidden you.\" If it were said that the address in his saying: \"So visit them\" is specific to men, the order of speech would be disrupted and its elegance would be lost, a matter which is inappropriate to attribute to the one who was given comprehensive speech (*Jawami' al-Kalim*) and who is the most eloquent of those who spoke Arabic (peace and blessings of Allah be upon him). The following points increase its support:\nSecond: Their sharing with men in the cause (*Illah*) for which visiting graves was legislated: For it softens the heart, brings tears to the eyes, and reminds of the Hereafter.\nThird: That the Prophet (peace and blessings of Allah be upon him) granted them concession to visit graves in two Hadiths preserved for us by the Mother of the Believers Aisha (may Allah be pleased with her):\n1- From Abdullah bin Abi Mulaikah: That Aisha came one day from the graveyards. I said to her: \"O Mother of the Believers, where have you come from?\" She said: \"From the grave of Abdur-Rahman bin Abi Bakr.\" I said to her: \"Did not the Messenger of Allah (peace and blessings of Allah be upon him) forbid visiting graves?\" She said: \"Yes, then he ordered us to visit them.\" And in a narration from her: \"That the Messenger of Allah (peace and blessings of Allah be upon him) granted concession for visiting graves.\"\n2 - From Muhammad bin Qais bin Makhramah bin Al-Muttalib that he said one day: \"Shall I not tell you about myself",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 78
  },
  {
    "serial_number": "4356529",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 80,
    "volume_number": 1,
    "text": "and my mother?\" We thought he meant his mother who gave birth to him. He said: Aisha said: \"Shall I not tell you about myself and the Messenger of Allah (peace and blessings of Allah be upon him)?\" We said: \"Yes.\" She said: \"When it was my night in which the Prophet (peace and blessings of Allah be upon him) was with me, he turned over, placed his cloak, took off his sandals and placed them by his feet, and spread the edge of his Izar on his bed, then lay down. He stayed only until he thought I had fallen asleep, then he took his cloak slowly, put on his shoes slowly, opened the door slowly, went out, then closed it slowly. I put my shirt over my head, veiled myself, and covered myself with my Izar 1, then I set out on his track until he came to Al-Baqi'. He stood and prolonged the standing, then raised his hands three times, then turned away, so I turned away. He hastened, so I hastened. He ran (trotted), so I ran. He moved quickly, so I moved quickly. I outpaced him and entered. No sooner had I lain down than he entered. He said: 'What is the matter, O 'A'ish 2, out of breath 3 and chest heaving?' She said: I said: 'Nothing, O Messenger of Allah.' He said: 'Either you tell me or the Subtle, the Acquainted will inform me.' She said: I said: 'O Messenger of Allah, may my father and mother be sacrificed for you,' and I informed him of the news. He said: 'So you were the dark figure I saw in front of me?' I said: 'Yes.' So he nudged me in my chest a nudge 4 that hurt me, then said: 'Did you think that Allah and His Messenger would deal unjustly with you?' She said: 'Whatever people conceal, Allah knows it.' He said: 'Yes.' He said: 'Indeed Gabriel came to me when you saw. He called me but hid it from you, so I answered him and hid it from you. He was not going to enter upon you while you had laid aside your clothes. I thought you had fallen asleep, so I disliked waking you and feared you would feel lonely. He said: Indeed your Lord commands you to go to the people of Al-Baqi' and seek forgiveness for them.' She said: I said: 'How should I say to them, O Messenger of Allah (peace and blessings of Allah be upon him)?' He said: Say: \"Peace be upon the people of the abodes from the believers and Muslims. May Allah have mercy on those who have gone ahead among us and those who come later. Indeed we, if Allah wills, will join you.\"'\"",
    "foot_note": "1. 1 Without the Ba of transitivity, meaning 'I wore my Izar', so it is transitive by itself.\n2. 2 It is permissible in 'A'ish' to have Fatha on the Shin and Damma, both are valid aspects in all apocopated names (Murakham).\n3. 3 With Fatha on the un-dotted Ha and Sukun on the dotted Shin; meaning breathlessness has befallen you, which is the panting and agitation that occurs to one who hastens in walking due to the rising and frequency of breath. And his saying 'Rabiyah' means raised chest (heaving).\n4. 4 Al-Lahz: Striking with the closed fist on the chest.",
    "book_id": "11108",
    "new_page_number": 79
  },
  {
    "serial_number": "4356530",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 81,
    "volume_number": 1,
    "text": "118 - However, it is not permissible for them to visit graves frequently and repeatedly, because that might lead them to violate the Sharia, such as wailing, displaying adornment (*Tabarruj*), taking graves as places for picnics, and wasting time in idle talk, as is witnessed today in some Islamic lands. This is the intended meaning - Allah willing - of the famous Hadith: \"The Messenger of Allah (peace and blessings of Allah be upon him) cursed - and in a wording: Allah cursed - the women who frequently visit graves (*Zawwarat*).\"\nAl-Qurtubi said: \"The curse mentioned in the Hadith is only for those who visit frequently, due to what the intensive form (*Mubalaghah*) implies. perhaps the reason is what that leads to regarding neglecting the husband's rights, *Tabarruj*, and what arises of wailing and the like. It may be said: If all of that is safe from occurring, there is no impediment to permitting them, because remembering death is needed by both men and women.\"\nAl-Shawkani said in *Nail Al-Awtar* 4/95: \"This speech is what should be relied upon in reconciling the Hadiths of the chapter which are apparently contradictory.\"\n\n119 - It is permissible to visit the grave of one who died upon other than Islam for lesson/admonition only, due to the Hadith of Abu Huraira and others: The Prophet (peace and blessings of Allah be upon him) visited the grave of his mother, so he wept and made those around him weep. He said: \"I asked my Lord for permission to seek forgiveness for her, but He did not permit me. And I asked Him for permission to visit her grave, so He permitted me. So visit the graves, for they remind of death.\"\nThe purpose of visiting graves is two things:\n1- The visitor benefiting by remembering death and the dead, and that their destination is either Paradise or Hell. This is the primary purpose of the visit as indicated by the preceding Hadiths.\n2- Benefiting the deceased and doing good to him by greeting him (*Salam*), supplicating, and seeking forgiveness for him. This is specific to the Muslim. Regarding this are Hadiths; I mention some of their wordings:",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 80
  },
  {
    "serial_number": "4356531",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 82,
    "volume_number": 1,
    "text": "First: \"Peace be upon you, inhabitants of a dwelling of believing people. Indeed we and you, and what you are promised tomorrow is deferred, and indeed we, if Allah wills, will join you. O Allah, forgive the people of Baqi' Al-Gharqad.\"\nSecond: \"Peace be upon the people of the abodes from the believers and Muslims. May Allah have mercy on those who have gone ahead among us and those who come later. Indeed we, if Allah wills, will join you.\"\nThird: \"Peace be upon you, people of the abodes from the believers and Muslims. Indeed we, if Allah wills, will join you. You are predecessors (*Farat*) for us and we are followers for you. I ask Allah for us and for you well-being.\"\n\n120 - As for reciting the Qur'an when visiting them, it has no basis in the Sunnah. Rather, the Hadiths mentioned in the previous issue imply its lack of legitimacy. For had it been legislated, the Messenger of Allah (peace and blessings of Allah be upon him) would have done it and taught it to his companions. Especially since Aisha (may Allah be pleased with her), who is among the most beloved people to him (peace and blessings of Allah be upon him), asked him what she should say if she visited the graves? So he taught her the *Salam* and supplication, and did not teach her to read Al-Fatiha or anything else from the Qur'an. If reading was legislated, he would not have concealed that from her. How so, when delaying clarification beyond the time of need is not permissible as established in the science of *Usul*? So how about concealment? Had he (peace and blessings of Allah be upon him) taught them anything of that, it would have been transmitted to us. Since it has not been transmitted with an established chain, it indicates that it did not occur.\nWhat strengthens the lack of legitimacy is his saying (peace and blessings of Allah be upon him): \"Do not make your houses graveyards, for Satan flees from the house in which Surah Al-Baqarah is recited.\" He (peace and blessings of Allah be upon him) indicated that graves are not a place for recitation according to Sharia. Therefore, he encouraged reciting the Qur'an in houses and forbade making them like graveyards where recitation is not done. As he indicated in",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 81
  },
  {
    "serial_number": "4356532",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 83,
    "volume_number": 1,
    "text": "the other Hadith that they are not a place for prayer either, which is his saying: \"Pray in your houses and do not take them as graves.\" Al-Bukhari titled it saying: \"Chapter: The Dislike of Prayer in Graveyards,\" indicating by it that it implies the dislike of prayer in graveyards. Likewise, the Hadith before it implies the dislike of reciting the Qur'an in graveyards, and there is no difference. For this reason, the Madhhab of the majority of the Salaf, like Abu Hanifa, Malik, and others, was the dislike of recitation at graves. It is the saying of Imam Ahmad. Abu Dawud said in his *Masa'il* p. 158: \"I heard Ahmad being asked about recitation at the grave? He said: No.\"\n\n121 - It is permissible to raise hands in supplication for them, due to the Hadith of Aisha (may Allah be pleased with her) who said: [Hasan] The Messenger of Allah (peace and blessings of Allah be upon him) went out one night, so I sent Barirah to follow him to see where he went. She said: He took the path towards Baqi' Al-Gharqad, stood at the nearest part of Al-Baqi', then raised his hands, then departed. Barirah returned to me and informed me. When I woke up in the morning, I asked him and said: \"O Messenger of Allah, where did you go out tonight?\" He said: \"I was sent to the people of Al-Baqi' to pray for them.\"\n\n122 - But he should not face the graves when supplicating for them; rather, [he should face] the Kaaba, due to his prohibition (peace and blessings of Allah be upon him) of praying towards graves as will come. Supplication is the marrow of worship and its core as is known, so it has its ruling. He (peace and blessings of Allah be upon him) said: \"Supplication is worship,\" then recited: {And your Lord says, \"Call upon Me; I will respond to you.\"}\n\n123 - If he visits the grave of a disbeliever, he does not greet him nor supplicate for him; rather, he gives him tidings of the Fire. Such did the Messenger of Allah (peace and blessings of Allah be upon him) command in the Hadith of Sa'd bin Abi Waqqas who said: A Bedouin came to the Prophet (peace and blessings of Allah be upon him) and said: \"Indeed my father used to maintain ties of kinship and was... and was...",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 82
  },
  {
    "serial_number": "4356533",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 84,
    "volume_number": 1,
    "text": "So where is he?\" He said: \"In the Fire.\" It was as if the Bedouin felt something from that, so he said: \"O Messenger of Allah, then where is your father?\" He said: \"Wherever you pass by the grave of a disbeliever, give him tidings of the Fire.\" He said: So the Bedouin became Muslim later and said: \"The Messenger of Allah burdened me with a weary task; I did not pass by the grave of a disbeliever except that I gave him tidings of the Fire.\"\n\n124 - He should not walk between the graves of Muslims wearing his sandals, due to the Hadith of Bashir bin Al-Hanzaliyyah (Al-Khasasiyyah) mentioned previously. He said: While I was walking with the Messenger of Allah (peace and blessings of Allah be upon him), he came upon the graves of the Muslims... While he was walking, a glance from him fell upon a man walking among the graves wearing sandals. He said: \"O owner of the *Sabtiyyah* (tanned leather shoes), throw off your *Sabtiyyah*.\" He looked, and when the man recognized the Messenger of Allah (peace and blessings of Allah be upon him), he took off his sandals and threw them.\n\n125 - It is not legislated to place myrtle and the like of sweet-smelling plants and roses on graves, because it was not from the actions of the Salaf. Had it been good, they would have preceded us to it. Ibn Umar (may Allah be pleased with them both) said: \"Every innovation is misguidance, even if people see it as good.\"\n\nWhat is Prohibited at Graves.\n\n126 - The following are prohibited at graves:\n1 - Slaughtering for the sake of Allah, due to his saying (peace and blessings of Allah be upon him): \"There is no *'Aqr* (slaughtering at graves) in Islam.\" Abdur-Razzaq bin Hammam said: They used to slaughter (*Ya'qirun*) a cow or a sheep at the grave.\n2 - Raising them more than the dirt that came out of them.\n3 - Coating them with plaster (*Kils*) and the like.\n4 - Writing on them.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 83
  },
  {
    "serial_number": "4356534",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 85,
    "volume_number": 1,
    "text": "5 - Building over them.\n6 - Sitting on them.\nRegarding that are Hadiths:\nThe First: From Jabir (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) forbade plastering the grave, sitting on it, building over it, increasing upon it, or writing on it.\nThe Second: From Abu Sa'id - who is Al-Khudri: That the Prophet (peace and blessings of Allah be upon him) forbade building over the grave.\nThe Third: From Abu Al-Hayyaj Al-Asadi who said: Ali bin Abi Talib said to me: \"Shall I not send you on what the Messenger of Allah (peace and blessings of Allah be upon him) sent me on? That you do not leave an image - and in a narration: a picture - in a house except that you obliterate it, nor a raised grave except that you level it.\"\nThe Fourth: From Thumamah bin Shufayy who said: We went out with Fadalah bin Ubaid to the land of the Romans, and he was the governor for Mu'awiyah over the pass (*Darb*). And in a narration: We invaded the land of the Romans, and over that army was Fadalah bin Ubaid Al-Ansari. A cousin of ours was struck (died) at Rhodes 1, so Fadalah prayed over him and stood at his grave until he buried him. When we leveled his grave over him, he said: \"Flatten it over him - and in the other narration: Lighten (the mound) over him 2 - for indeed the Messenger of Allah (peace and blessings of Allah be upon him) used to command us to level the graves.\"\nIts apparent meaning is leveling it with the ground so that it is not raised at all. This is definitively not intended, evidenced by the fact that the Sunnah is raising it about a hand-span as indicated previously. This is supported from the Hadith",
    "foot_note": "1. 1 A well-known island in the Mediterranean Sea southwest of Turkey.\n2. 2 It has the same meaning as the narration before it, except this one is transitive with *Tashdid* (Khaffifu) and that one with Alif (Akhfu).",
    "book_id": "11108",
    "new_page_number": 84
  },
  {
    "serial_number": "4356535",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 86,
    "volume_number": 1,
    "text": "itself by the saying of Fadalah \"Lighten\" (*Khaffifu*), meaning the dirt, so he did not order removing the dirt from it completely. This is how the scholars interpreted it. See *Al-Mirqat* 2/372.\nThe Fifth: From Abu Huraira that the Messenger of Allah (peace and blessings of Allah be upon him) said: \"That one of you sits on a burning ember which burns his clothes and reaches his skin is better for him than that he sits\" - and in a narration: \"steps - on a grave.\"\nThe Sixth: From Uqbah bin Amir (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"That I walk on a burning ember or a sword or sew my sandal to my foot 1 is more beloved to me than that I walk on the grave of a Muslim. And I do not care whether I relieve myself in the middle of the graves or in the middle of the market.\"\nThe Seventh: From Abu Marthad Al-Ghanawi who said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"Do not pray towards graves and do not sit on them.\"\n\n7 - Praying towards graves, due to the Hadith mentioned just now. In it is evidence for the prohibition of praying towards the grave due to the apparent prohibition, and this is the choice of Al-Nawawi. Al-Munawi said in *Fayd Al-Qadir* explaining the Hadith: \"Meaning facing them due to what is in it of extreme veneration, for it is of the rank of the Deity. So he combined - meaning the Hadith in its entirety - between the prohibition of disrespect (sitting) and extreme veneration (praying towards).\" Then he said in another place: \"For that is disliked (*Makruh*). If a person intends seeking blessing (*Tabarruk*) in praying in that spot, he has innovated in the religion what Allah has not permitted.\" The intended meaning is dislike of discouragement (*Karahat Tanzih*). Al-Nawawi said: \"So said our companions. If it were said it is forbidden (*Haram*) due to the apparent meaning of the Hadith, it would not be far-fetched.\" It is taken from the Hadith the prohibition of praying in the graveyard; it is disliked with the dislike of prohibition (*Karahat Tahrim*). It should be known that the mentioned prohibition is only if one does not intend by facing",
    "foot_note": "1. 1 Meaning that is a difficult and severe matter if possible.",
    "book_id": "11108",
    "new_page_number": 85
  },
  {
    "serial_number": "4356536",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 87,
    "volume_number": 1,
    "text": "the graves the veneration of them; otherwise, it is Shirk (polytheism). Sheikh Ali Al-Qari said in *Al-Mirqat* 2/372 in his explanation of this Hadith: \"If this veneration was truly for the grave and its occupant, the venerator would disbelieve. So imitating it is disliked, and it should be a dislike of prohibition. In its meaning, rather more deserving than it: the placed funeral (Janazah), which is what the people of Mecca are afflicted with, where they place the funeral at the Kaaba and then face towards it.\"\n\n8 - Praying at them (graves) even without facing them. Regarding this are Hadiths:\nThe First: From Abu Sa'id Al-Khudri who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"The whole earth is a mosque except the graveyard and the bathroom.\"\nThe Second: From Anas: \"That the Prophet (peace and blessings of Allah be upon him) forbade praying between graves.\"\nThe Third: From Ibn Umar from the Prophet (peace and blessings of Allah be upon him) who said: \"Make some of your prayers in your houses and do not take them as graves.\"\nThe Fourth: From Abu Huraira who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Do not make your houses graveyards. Indeed, Satan flees from the house in which Surah Al-Baqarah is recited.\"\n\n9 - Building mosques over them. Regarding this are Hadiths; I mention some of them:\nThe First: From Aisha and Abdullah bin Abbas together, they said: When death approached the Messenger of Allah (peace and blessings of Allah be upon him), he began casting a sheet of his over his face. When he felt distressed by it, he uncovered his face and said while he was in that state: \"The curse of Allah be upon the Jews and the Christians; they took the graves of their prophets as mosques.\" He was warning against what they did.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 86
  },
  {
    "serial_number": "4356537",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 88,
    "volume_number": 1,
    "text": "She said in a narration: \"Were it not for that, his grave would have been made prominent, but he feared it would be taken as a mosque.\"\nThe Second: His saying (peace and blessings of Allah be upon him): \"O Allah, do not make my grave an idol. Allah cursed a people who took the graves of their prophets as mosques.\"\nThe Third: From Jundub who said: I heard the Prophet (peace and blessings of Allah be upon him) five days before he died saying: \"I had brothers and friends among you, and I clear myself to Allah that I should have a specialized friend (*Khalil*) from among you, for indeed Allah the Exalted has taken me as a Khalil just as He took Ibrahim as a Khalil. If I were to take a Khalil from my Ummah, I would have taken Abu Bakr as a Khalil. Beware! Those before you used to take the graves of their prophets and righteous ones as mosques. Beware! Do not take graves as mosques; indeed I forbid you from that.\"\nThe Fourth: From Abdullah bin Masud who said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"Indeed, among the worst of people are those upon whom the Hour comes while they are alive, and those who take graves as mosques.\"\nThe Fifth: From Aisha who said: During the illness of the Prophet (peace and blessings of Allah be upon him), some of his wives mentioned a church in the land of Abyssinia called Mariya. Umm Salamah and Umm Habibah had been to the land of Abyssinia, so they mentioned its beauty and its images. The Prophet (peace and blessings of Allah be upon him) said: \"Indeed, those people, if a righteous man among them died, they built a place of worship over his grave and depicted those images in it. Those are the worst of creation in the sight of Allah on the Day of Judgment.\"\nTaking (graves) mentioned in the preceding Hadiths includes several matters:\nFirst: Praying towards graves facing them.\nSecond: Prostrating on graves.\nThird: Building mosques over them.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 87
  },
  {
    "serial_number": "4356538",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 89,
    "volume_number": 1,
    "text": "The second meaning is apparent from \"taking,\" and the other two, while included in it, have been specifically mentioned in the texts of some preceding Hadiths. I detailed the discussion on that and cited the sayings of scholars as evidence in our special book *Tahdhir As-Sajid min Ittikhadh Al-Qubur Masajid* (Warning the Prostrator against Taking Graves as Mosques). I mentioned the history of including the Prophetic Grave into the Noble Mosque and the contradiction to the preceding Hadiths it entails, and that prayer is not disliked in it specifically despite that. So whoever wishes for a detailed discussion on all of that, let him refer to it.\n\n10 - Taking them as an *Eid* (festival/place of habitual return), frequented at specific times and known seasons for worship at them or otherwise, due to the Hadith of Abu Huraira (may Allah be pleased with him) who said: The Messenger of Allah (peace and blessings of Allah be upon him) said: \"Do not make my grave an *Eid*, and do not make your houses graveyards. And send blessings upon me wherever you are, for your blessings reach me.\"\n\n11 - Traveling to them: Regarding this are Hadiths:\nThe First: From Abu Huraira from the Prophet (peace and blessings of Allah be upon him) who said: \"Do not saddle the mounts (travel) except - and in a narration: Travel is only undertaken - to three mosques: The Sacred Mosque, the Mosque of the Messenger (peace and blessings of Allah be upon him), and Al-Aqsa Mosque.\"\nThe Second: From Abu Sa'id Al-Khudri who said: I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: \"Do not saddle - and in a wording: Do not saddle the mounts except to three mosques: This mosque of mine, the Sacred Mosque, and Al-Aqsa Mosque.\"\nThe Third: From Abu Basrah Al-Ghifari that he met Abu Huraira while he was coming. He said: \"Where are you coming from?\" He said: \"I came from At-Tur (Mount Sinai); I prayed in it.\" He said: \"If I had caught you (before you left), you would not have gone. Indeed I heard the Messenger of Allah (peace and blessings of Allah be upon him) say: 'Do not saddle the mounts except to three mosques: The Sacred Mosque, this mosque of mine, and Al-Aqsa Mosque.'\"",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 88
  },
  {
    "serial_number": "4356539",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 90,
    "volume_number": 1,
    "text": "The Fourth: From Qaza'ah who said: I wanted to go out to At-Tur, so I asked Ibn Umar. He said: \"Do you not know that the Prophet (peace and blessings of Allah be upon him) said: 'Do not saddle the mounts except to three mosques: The Sacred Mosque, the Mosque of the Prophet (peace and blessings of Allah be upon him), and Al-Aqsa Mosque.' Leave At-Tur and do not come to it.\"\n\n12 - Lighting lamps at them. The evidence for that is several matters:\nFirst: Being an introduced innovation unknown to the righteous Salaf. He (peace and blessings of Allah be upon him) said: \"Every innovation is misguidance, and every misguidance is in the Fire.\" Narrated by Al-Nasa'i and Ibn Khuzaymah in his Sahih with an authentic chain.\nSecond: It involves wasting wealth, which is textually forbidden as preceded in Issue 42.\nThird: It involves imitation of the Magians (Majoos), the fire worshippers. Ibn Hajar the Jurist said in *Al-Zawajir* 1/134: \"Our companions stated the prohibition of lamps on the grave, even if little, where neither a resident nor a visitor benefits from it. They reasoned it with extravagance, wasting wealth, and imitation of the Magians. It is not far-fetched for this to be a major sin.\"\nI say: He did not mention, in addition to the reasoning mentioned, our first evidence, although it is a valid evidence, perhaps even the strongest evidence. Because those who light lamps on graves intend by that drawing closer to Allah the Exalted - so they claim - and do not intend illumination for a resident or visitor, evidenced by their lighting them while the sun is rising in broad daylight. So for that reason, it was a misguided innovation.\n\n13 - Breaking their bones.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 89
  },
  {
    "serial_number": "4356540",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 91,
    "volume_number": 1,
    "text": "The evidence for it is his saying (peace and blessings of Allah be upon him): \"Breaking the bone of the believer when dead is like breaking it when alive.\"\nThe Hadith is evidence for the prohibition of breaking the bone of the believing deceased. Therefore, it came in the books of the Hanbalis: \"It is forbidden to cut any limb of the deceased, destroy his self, or burn him, even if he willed it.\" As in *Kashshaf Al-Qina'* 2/127. Similar is in other Madhhabs. Ibn Hajar the Jurist even asserted in *Al-Zawajir* 1/134 that it is among the major sins. He said: \"Because you knew from the Hadith that it is like breaking the bone of the living.\"\nAl-Nawawi said in *Al-Majmu'* 5/303 in summary: \"It is not permissible to exhume the grave without a legal reason by agreement of the companions (of the Madhhab). It is permissible for legal reasons like what preceded in Issue 107. And in summary: It is permissible to exhume the grave if the deceased has decayed and turned to dust. Then it is permissible to bury another in it, and it is permissible to cultivate that land, build on it, and all forms of benefit and disposal in it by agreement of the companions. All this is if no trace of the deceased remains, of bone or otherwise. This varies with the variation of lands and earth, and the statement of the experts in it is relied upon.\"\nI say: From this, you know the prohibition of what some Islamic governments commit of obliterating some Islamic graveyards and exhuming them for the sake of urban planning, without any regard for their sanctity or concern for the prohibition of treading on them, breaking their bones, and the like. Let no one imagine that the referred planning justifies such violations. Never! For it is not among the necessities; rather, it is among the luxuries for which it is not permissible to aggress against the dead. The living must organize their affairs without harming their dead. Among the wonders that draw attention is seeing these governments respecting stones",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 90
  },
  {
    "serial_number": "4356541",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 92,
    "volume_number": 1,
    "text": "and buildings standing over some dead more than their respect for the dead themselves. For if some of these buildings like domes or churches or the like stood in the way of the claimed planning, they leave them as they are and modify the planning map for their sake to preserve them, because they consider them ancient monuments. As for the graves of the dead themselves, they do not deserve such modification in their view. Indeed, some of those governments strive - as far as we know - to make graves outside the town and prevent burial in old graves. This is another violation in my view, because it causes Muslims to miss the Sunnah of visiting graves, as it is not easy for the general public to travel long distances to be able to reach them and undertake visiting them and supplicating for them.\nThe motive for these violations - as I believe - is only blind imitation of materialist disbelieving Europe, which wants to eliminate every manifestation of belief in the Hereafter and everything that reminds of it. It is not observance of health rules as they claim. Had that been true, they would have hastened to combat causes whose harm no rational person doubts, such as selling alcohol and drinking it, and immorality and debauchery in their various forms and names. Their lack of concern for eliminating these apparent evils and their striving to remove everything reminding of the Hereafter and distancing it from their eyes is the greatest proof that the intent is contrary to what they claim and declare, and what their chests conceal is greater.\n2 - That there is no sanctity for the bones of non-believers, due to the annexation of the bone to the believer in his saying: \"Bone of the believer.\" It implied that the bone of the disbeliever is not so. Al-Hafiz pointed to this meaning in *Al-Fath* by his saying: \"It is derived from it that the sanctity of the believer after his death remains as it was during his life.\" 1\nFrom this, the answer to the question repeated on the tongues of many students in medical colleges is known, which is: Is it permissible to break bones to examine them and conduct medical investigations on them?",
    "foot_note": "1. 1 Mentioned in *Al-Fayd* 4/551.",
    "book_id": "11108",
    "new_page_number": 91
  },
  {
    "serial_number": "4356542",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 93,
    "volume_number": 1,
    "text": "The Answer: That is not permissible for the bones of a believer, but it is permissible for others. This is supported by what comes in the following issue:\n\n127 - It is permissible to exhume the graves of disbelievers because they have no sanctity, as indicated by the implication of the previous Hadith. Witness to it is the Hadith of Anas bin Malik (may Allah be pleased with him) who said: The Prophet (peace and blessings of Allah be upon him) arrived and stayed in the upper part of Medina in a clan called Banu Amr bin Awf. He stayed among them for fourteen nights. Then he sent for Banu An-Najjar, and they came carrying swords. It is as if I am looking at the Prophet (peace and blessings of Allah be upon him) on his mount, Abu Bakr behind him, and a group of Banu An-Najjar around him, until he arrived at the courtyard of Abu Ayyub. He used to like to pray wherever prayer time caught him, and he would pray in sheep pens. He ordered the building of the mosque, so he sent for a group of Banu An-Najjar and said: \"O Banu An-Najjar, name a price for this garden of yours.\" They said: \"No, by Allah, we do not seek its price except from Allah.\" He said: In it were graves of polytheists, ruins, and date palms. So the Prophet (peace and blessings of Allah be upon him) ordered regarding the graves of polytheists, so they were exhumed; then regarding the ruins, so they were leveled; and regarding the date palms, so they were cut. They aligned the date palms in the Qiblah of the mosque and made its two jambs of stone. They began moving the rock while chanting poetry, and the Prophet (peace and blessings of Allah be upon him) was with them saying while moving the bricks: \"This load 1 is not the load of Khaibar. This is more righteous to our Lord and purer. O Allah, there is no good except the good of the Hereafter, so forgive the Ansar and the Muhajirah.\" And in a narration from the Hadith of Aisha (may Allah be pleased with her): \"O Allah, indeed the reward is the reward of the Hereafter, so have mercy on the Ansar and the Muhajirah.\"",
    "foot_note": "1. 1 With Kasra on the Ha (Himl); and that which is carried from Khaibar is dates. Meaning: this in the Hereafter is better than that and more praiseworthy in outcome. It is as if it is the plural of *Himl* with Kasra on Mim or *Hamal* with Fatha on Mim, or it could be the verbal noun of *Hamala* or *Hamil* as in *Al-Nihayah*.",
    "book_id": "11108",
    "new_page_number": 92
  },
  {
    "serial_number": "4356543",
    "category_id": "18",
    "category": "General Fiqh",
    "book_title": "Summary of Funeral Rulings",
    "edition": "Third",
    "publisher": "Maktabat al-Ma'arif",
    "page_number": 94,
    "volume_number": 1,
    "text": "Al-Hafiz (said) in *Al-Fath*: \"In the Hadith is the permissibility of disposal in a graveyard owned by gift or sale, the permissibility of exhuming obliterated graves if they are not respected (sacred), the permissibility of prayer in the graveyards of polytheists after exhuming them and removing what is in them, and the permissibility of building mosques in their places.\"\nThis is the last of what Allah, Blessed and Exalted, facilitated of summarizing the rulings of funerals, asking the Master, Mighty and Majestic, to grant us a good life, to cause us to die as believers, and to join us with the righteous. And our final call is that all praise is due to Allah, Lord of the worlds.",
    "foot_note": "None",
    "book_id": "11108",
    "new_page_number": 93
  }
]