[
  {
    "serial_number": "6208375",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Genealogy\nBook: Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)\nAuthor: Abu Al-Hasan Ali bin Umar bin Ahmed Al-Daraqutni (Died 385 AH)\nEditor: Basem Faisal Ahmed Al-Jawabra\nPublisher: Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nBook: Brothers and Sisters\nAuthor: Abu Al-Hasan Ali bin Umar bin Ahmed Al-Daraqutni (Died 385 AH)\nEditor: Basem Faisal Ahmed Al-Jawabra\nPublisher: Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nAuthor: Abu Al-Hasan Ali bin Umar bin Ahmed Al-Daraqutni (Died 385 AH)\nEditor: Basem Faisal Ahmed Al-Jawabra\nPublisher: Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nEditor: Basem Faisal Ahmed Al-Jawabra\nPublisher: Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nPublisher: Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nEdition: First, 1413 AH - 1993 AD\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nNumber of Pages: 72\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\n[Book numbering matches the printed version]\nPublication date in Al-Shamela: 6 Sha'ban 1442\n\nPublication date in Al-Shamela: 6 Sha'ban 1442",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208376",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 3,
    "volume_number": 1,
    "text": "Brothers and Sisters «Part One»\nBy Al-Hafiz Abu Al-Hasan Ali bin Umar bin Ahmed Al-Daraqutni\nDied in the year (385) Hijri, may Allah the Almighty have mercy on him\nInvestigation (Tahqiq) by Dr. Basem Faisal Ahmed Al-Jawabra\nAssociate Professor at the College of Fundamentals of Religion at Imam Muhammad bin Saud Islamic University in Riyadh\nDar Al-Raya for Publishing and Distribution",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208377",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 5,
    "volume_number": 1,
    "text": "Introduction\nIndeed, praise be to Allah. We praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whoever Allah guides, there is no one to misguide him, and whoever He misguides, there is no guide for him. I bear witness that there is no deity but Allah alone, having no partner. And I bear witness that Muhammad is His servant and Messenger, may Allah bless him, his family, and his companions and grant them peace.\nTo proceed:\nThis is the first part of the book \"Al-Ukhuwwah (1) wa Al-Akhawat\" (Brothers and Sisters) by Imam Al-Daraqutni. I present it—today—to the brothers, researchers, and students of knowledge. Before this, I had edited the book \"Al-Ikhwah Alladhina Ruwiya 'Anhum Al-Hadith\" (The Brothers From Whom Hadith Was Narrated) by Abu Dawood Al-Sijistani, and the book \"Tasmiyat Man Ruwiya 'Anhu Min Awlad Al-Asharah\" (Naming Those From Whom Narrations Were Reported Among the Children of the Ten [Promised Paradise]) by Imam Ali bin Al-Madini, which contains a large section on brothers and sisters who have narrations; I published them in one volume and named it \"Al-Ruwat Min Al-Ikhwah wa Al-Akhawat\" (The Narrators Among Brothers and Sisters).\nThis book is specific in mentioning brothers among the Companions of the Messenger of Allah, peace and blessings be upon him, those who narrated from him, or saw him and did not narrate from him, or were born in his era, or whose brother was born after the death of the Prophet, peace and blessings be upon him, from both men and women.",
    "foot_note": "1. Its Hamza is marked with a Damma (Ukhuwwah), and it is also permissible with a Kasra (Ikhuwwah).",
    "book_id": "26"
  },
  {
    "serial_number": "6208378",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 6,
    "volume_number": 1,
    "text": "It differs from the two previous books in the following ways:\n1 - This book is specific to the Sahaba (Companions), whereas the previous two books are general regarding all narrators, including Sahaba, Tabi'in (Followers), Atba' al-Tabi'in (Followers of the Followers), and others.\n2 - This book includes all Sahaba, whether they were narrators or not, whereas the previous two books are specific to narrators of Hadith.\n3 - Al-Daraqutni provides brief and useful biographical notes for the names he mentions, whereas in the previous two books, there are no biographies for the narrators.\n4 - Al-Daraqutni mentioned Hadiths in his book, some with his chain of transmission (Isnad) and others without Isnad, whereas in the previous two books, no Hadiths were mentioned, except for a few Hadiths at the end of Ali bin Al-Madini's book which are additions by Ibn Al-Daqqaq and not from the narration of Ali bin Al-Madini.\n\nMy Work on the Book:\n1 - I verified the text; I exerted my effort in adjusting the text and producing it sound and correct.\n2 - I wrote brief biographies for all the (Brothers) mentioned in the book.\n3 - I documented the text by referring to books of genealogy, Rijal (narrators), classes (Tabaqat), and biographies.\n4 - I extracted (Takhrij) the Hadiths found in the book.\n5 - I mentioned a number of sources for each biography mentioned in the book, limiting myself to",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208379",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 7,
    "volume_number": 1,
    "text": "\"Al-Tabaqat Al-Kubra\", \"Al-Siyar\", \"Al-Isabah\", and \"Usd Al-Ghabah\", and I might add others for a benefit that arises.\n6 - I created two indexes for the book:\nA - Index of Hadiths mentioned in the book.\nB - Index of Biographies.\nI ask Allah, Glory be to Him and the Most High, that my work be sincere for His Noble Face, and that I have been successful in it; indeed, He is All-Hearing, All-Responding. And our final prayer is that praise be to Allah, Lord of the Worlds.\nBasem Faisal Al-Jawabra\nRiyadh\nSaturday: 14 / 4 / 1413 AH",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208380",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 8,
    "volume_number": 1,
    "text": "Brief Definition of Imam Al-Daraqutni (1):\nMuch has been written about this Imam in terms of individual research and university dissertations (2), so I will limit myself to a brief introduction of this Imam:\nHe is: \"The Imam, the Hafiz, the Master, Sheikh al-Islam, the Flagship of Critical Scholars, Abu Al-Hasan Ali bin Umar bin Ahmed bin Mahdi bin Masud bin Al-Nu'man bin Dinar bin Abdullah Al-Baghdadi, the Reciter, the Muhaddith, from the people of the Dar Al-Qutn locality in Baghdad. He was born in the year three hundred and six.\"\nAl-Dhahabi said in \"Al-Siyar\": \"He was one of the oceans of knowledge, and one of the Imams of the world. He reached the pinnacle in memorization and knowledge of the defects ('Illal) of Hadith and its narrators, along with proficiency in Qira'at (Recitations) and their paths, and strength of participation",
    "foot_note": "1. Some sources of his biography: \"Tarikh Baghdad\" (12/34) by Al-Khatib, \"Al-Ansab\" (5/425) by Al-Sam'ani, \"Siyar A'lam Al-Nubala\" (16/449), \"Tadhkirat Al-Huffaz\" (3/991) by Al-Dhahabi, \"Tabaqat Al-Shafi'iyyah Al-Kubra\" (3/463) by Al-Subki, \"Al-Bidaya wa Al-Nihaya\" (11/317) by Ibn Kathir, \"Al-Nujum Al-Zahirah\" (1/683) by Ibn Taghri Bardi.\n2. Among them: A PhD dissertation submitted to Imam Muhammad bin Saud Islamic University, College of Fundamentals of Religion, Sunnah Department; titled \"Imam Al-Daraqutni and His Book Al-Sunan\" prepared by the virtuous brother Dr. Abdullah Daifullah Al-Ruhayli. Also, Brother Dr. Muwaffaq Abdullah wrote a lengthy study on Al-Daraqutni in the introduction to the book \"Al-Mu'talif wa Al-Mukhtalif\", which is a PhD dissertation submitted to Imam Muhammad bin Saud Islamic University, College of Fundamentals of Religion, Sunnah Department.",
    "book_id": "26"
  },
  {
    "serial_number": "6208381",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 9,
    "volume_number": 1,
    "text": "in Fiqh, differences of opinion, Maghazi (campaigns), history of people, and other than that.\" End quote.\nHis works amounted to more than eighty beneficial compilations, some of which reached more than ten volumes. Dr. Muwaffaq—may Allah grant him success—enumerated them in the introduction to the book \"Al-Mu'talif wa Al-Mukhtalif\", so let it be consulted.\nHe died—may Allah the Almighty have mercy on him—in the year three hundred and eighty-five, after a life full of knowledge, teaching, advocacy, and writing.\n* * * * *",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208382",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 10,
    "volume_number": 1,
    "text": "Description of the Manuscript:\nI relied in the verification on a unique photocopied manuscript from the Chester Beatty Library in Ireland. I obtained it from the Imam Muhammad bin Saud Islamic University Library, Manuscripts Department. This manuscript consists of eight folios, each folio having two sides, and each side containing (8 - 19) lines. It is narrated with Isnad (chain of transmission) as stated in the first paper, and it has hearing certificates (Sama'at) on the last paper as will come, Allah willing.\nWhat exists of this valuable book is only the first part. I have searched for the rest of the book but have not found it yet. May Allah, Glory be to Him and the Most High, facilitate finding the rest of the book.\nA gap (omission) occurred in this part in its middle on the fifth folio. This gap is at the end of the biography of the brothers from the children of Al-Abbas bin Abd al-Muttalib, and from the beginning of the biography of Abu Bakr and his children. I estimate this gap to be about two folios, and Allah knows best.\n* * * * *",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208383",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 11,
    "volume_number": 1,
    "text": "Validity of Attributing the Book to Al-Daraqutni:\nI assert that this book is authored by Al-Daraqutni for the following reasons:\n1 - The Isnad at the beginning of the book indicates that.\n2 - The Isnads inside the book; Al-Daraqutni narrated them from his Sheikhs; such as in biography number (33) where he said: \"Yahya bin Muhammad bin Sa'id told us this...\" and he is one of Al-Daraqutni's Sheikhs.\n3 - Al-Hafiz Ibn Hajar quoted many places from this book in \"Al-Isabah\" and in \"Al-Tahdhib\", and they are found in this book exactly:\nSee for example in \"Tahdhib Al-Tahdhib\" (8/362, 421), (11/72), and in \"Al-Isabah\" in the biography of Tammam bin Al-Abbas (1/376). And in the biography of Rabi'ah bin Al-Harith bin Abd al-Muttalib (1/376). And in the biography of Abdullah bin Al-Harith bin Abd al-Muttalib (2/462). And in the biography of Hind bin Abi Hala (6/558). And in the biography of Nawfal bin Al-Harith (6/480). And in the biography of Arwa bint Rabi'ah (7/479). And in the biography of Umamah bint Abi Al-As (7/504). And in the biography of Hind bint Atiq (8/157).",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208384",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 12,
    "volume_number": 1,
    "text": "And in the biography of Umm Al-Walid bint Umar bin Al-Khattab (8/322).\n4 - Al-Sakhawi quoted from it in \"Fath Al-Mughith\" (3/163).\n5 - It was circulated in lexicons (Ma'ajim) and collections of Sheikhs (Mashyakhat), as in \"Silat Al-Khalaf bi-Mawsul Al-Salaf\" (p. 133 - Dar Al-Gharb edition) by Al-Rudani.",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208385",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 13,
    "volume_number": 1,
    "text": "Image of the Manuscript Cover",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208386",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 14,
    "volume_number": 1,
    "text": "Image of the First Page of the Manuscript",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208387",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 15,
    "volume_number": 1,
    "text": "Image of the Last Page of the Manuscript",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208388",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 16,
    "volume_number": 1,
    "text": "Image of Some Hearing Certificates (Sama'at) Attached to the Manuscript",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208389",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 17,
    "volume_number": 1,
    "text": "Part One of the Book \"Brothers and Sisters\"\nAuthored by Abu Al-Hasan Ali bin Umar bin Ahmed bin Mahdi Al-Hafiz Al-Daraqutni\nNarration of Abu Al-Hasan Muhammad bin Abd al-Wahid bin Muhammad bin Ja'far bin Al-Adl from him.\nAnd from him, Sheikh Abu Al-Husayn Al-Mubarak bin Abd al-Jabbar bin Ahmed Al-Sayrafi.\nAnd from him, Al-Hafiz Al-Silafi Abu Tahir Ahmed bin Muhammad bin Ahmed bin Ibrahim Al-Asbahani.\nMakki bin Ahmed bin Ali bin Abdullah Al-Miknasi and his son Abu Al-Abbas Ahmed, may Allah restore him.",
    "foot_note": "None",
    "book_id": "26"
  },
  {
    "serial_number": "6208390",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 19,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nO Lord, facilitate by Your Mercy\nThe Jurist, the Imam, the Scholar, the Noble Abu Muhammad (1) Abdullah bin Abd al-Jabbar bin Abdullah Al-Uthmani informed us, by reading upon him while I was listening in his home in Alexandria; the Sheikh, the Hafiz Abu Tahir (2) Ahmed bin Muhammad bin Ahmed Al-Silafi Al-Asbahani, may Allah be pleased with him, informed us, saying: The Sheikh Abu Al-Husayn (3) Al-Mubarak bin Abd al-Jabbar informed us more than once—in what I read upon him in Shawwal of the year four hundred and ninety-four—saying: Abu Al-Hasan Muhammad bin Abd al-Wahid bin Muhammad bin Ja'far bin Al-Adl (4) informed us, saying: Abu Al-Hasan Ali bin Umar bin Ahmed bin Mahdi Al-Daraqutni the Hafiz informed us by reading upon him.",
    "foot_note": "1. Al-Mundhiri said in \"Al-Takmilah li-Wafiyat al-Naqalah\" (2/416): The Majestic Sheikh Abu Muhammad. See \"Shadharat al-Dhahab\" (5/60).\n2. Al-Dhahabi said in \"Al-Siyar\" (21/5): He is the Imam, the Allamah, the Muhaddith, the Hafiz, the Mufti, Sheikh al-Islam, and the honor of the long-lived ones.\n3. Al-Dhahabi said in \"Al-Siyar\" (19/213): The Imam, the Scholar, the Benefiter, the remnant of the prolific transmitters ... born in the year four hundred and eleven ... died in the middle of Dhu al-Qi'dah, year five hundred and ninety.\n4. Perhaps he is the one known as Ibn Zawj al-Hurrah. Al-Khatib Al-Baghdadi said in his \"Tarikh\" (2/361): = And we wrote from him and he was truthful. I heard him say: I was born in the year three hundred and seventy-one, and he died on the night of Sunday, mid-Jumada al-Akhirah, year four hundred and forty-two.",
    "book_id": "26"
  },
  {
    "serial_number": "6208391",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 20,
    "volume_number": 1,
    "text": "Mention of the Brothers who accompanied the Prophet, peace and blessings be upon him, and narrated from him, or saw him but did not narrate from him, or were born in his era, or whose brother was born after the death of the Prophet, peace and blessings be upon him, from among men and women.\nThe first whom we present mention of from the brothers are those who were from Banu Hashim bin Abd Manaf.\nAnd we begin among them by mentioning the children of the Messenger of Allah, peace and blessings be upon him, since his two daughters, Fatima and Zainab, peace be upon them, had Hadith narrated from them; so we mention them and their siblings, and clarify who among them narrated from him and who did not narrate from him.\nAnd Allah is the Granter of success to what is correct.\n* * * * *",
    "foot_note": "1. = (Continuation from previous footnote)...",
    "book_id": "26"
  },
  {
    "serial_number": "6208392",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 21,
    "volume_number": 1,
    "text": "* Children of the Messenger of Allah, peace and blessings be upon him -:\n1 - Fatima.\n2 - And Zainab.\n3 - And Ruqayyah.\n4 - And Umm Kulthum.",
    "foot_note": "1. 1 - Fatima Al-Zahra: The leader of the women of this nation. Ali married her in the second year of Hijra, and she died six months after the Prophet, peace and blessings be upon him, having barely exceeded twenty years of age. \"Al-Tabaqat Al-Kubra\" (8/19), \"Al-Isti'ab\" (4/373), \"Usd Al-Ghabah\" (7/220), \"Al-Ahad wa Al-Mathani\" (6/354), \"Al-Siyar\" (2/118), \"Al-Isabah\" (8/53), \"Al-Tahdhib\" (12/440).\n2 -. The eldest of her sisters among the female emigrants, and she was the first of the daughters of the Messenger of Allah to marry. She died during the time of the Prophet, peace and blessings be upon him. \"Al-Tabaqat Al-Kubra\" (8/30), \"Usd Al-Ghabah\" (7/130), \"Al-Siyar\" (2/246), \"Al-Isabah\" (7/665).\n3 -. Wife of Uthman bin Affan, and she migrated with him to Abyssinia in both migrations. She died while the Messenger of Allah, peace and blessings be upon him, was at Badr. \"Al-Tabaqat Al-Kubra\" (8/36), \"Usd Al-Ghabah\" (7/113), \"Al-Siyar\" (2/250), \"Al-Isabah\" (7/648).\n4 -. Uthman married her when her sister Ruqayyah died, and she did not bear him children. She died in Sha'ban of the year nine. \"Al-Tabaqat Al-Kubra\" (8/37), \"Usd Al-Ghabah\" (7/384), \"Al-Siyar\" (2/252), \"Al-Isabah\" (8/188).",
    "book_id": "26"
  },
  {
    "serial_number": "6208393",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 22,
    "volume_number": 1,
    "text": "* And from the Males:\n5 - Al-Qasim; and by him he was given his Kunya (Abu Al-Qasim), and he is his eldest child.\n6 - And Abdullah; and he is Al-Tayyib, and he is called: Al-Tahir (1). They were born after the Prophethood (2), and died young. It was also said: His male children from Khadijah are three: Al-Qasim, and Abdullah who is Al-Tahir, and Al-Tayyib. And it was said: They are four (3): Al-Qasim, Abdullah, Al-Tayyib, and Al-Tahir, but the first is more established.",
    "foot_note": "1. 5 - Al-Hafiz said: The first born to him, born before the Mission (Ba'tha), and died young. \"Usd Al-Ghabah\" (4/377), \"Al-Isabah\" (5/515).\n6 -. Born after the Prophethood, and died young. \"Al-Isabah\" (3/549).\n1. Al-Hafiz said in \"Al-Isabah\" (3/549) in the biography of Al-Tahir: \"Al-Zubair bin Bakkar said in the biography of Khadijah from 'Kitab Al-Nasab': My uncle Mus'ab told me: Khadijah bore for the Prophet, peace and blessings be upon him, Al-Qasim and Al-Tahir, and he used to be called: Al-Tayyib. Al-Tahir was born after the Prophethood and died young, and his name was Abdullah, and he mentioned the four daughters.\" Then Al-Hafiz said: And likewise Yazid bin Iyad from Al-Zuhri limited it to Al-Qasim and Abdullah.\n2. Ibn Majah narrated in his \"Sunan\", Book of Funerals (1/484) via the path of Al-Husayn bin Ali who said: When Al-Qasim, the son of the Messenger of Allah, peace and blessings be upon him, died, Khadijah said: O Messenger of Allah, Lubaynah's milk is flowing, if only Allah had kept him until he completed his breastfeeding. The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, the completion of his breastfeeding is in Paradise...\" the Hadith. Al-Hafiz said in \"Al-Isabah\" (5/516): This is very apparent that he died after Islam, but there is weakness in the chain. End quote. I say: It contains Hisham bin Abi Al-Walid, and he is abandoned (Matruk).\n3. Ibn Ishaq narrated in \"Al-Sirah\" (245) from Ibn Abbas who said: Khadijah bore for the Messenger of Allah, peace and blessings be upon him, two boys and four women: Al-Qasim, Abdullah, Fatima, Umm Kulthum, Zainab, and Ruqayyah. =",
    "book_id": "26"
  },
  {
    "serial_number": "6208394",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 23,
    "volume_number": 1,
    "text": "Their mother is all Khadijah (1) bint Khuwaylid bin Asad bin Abd al-Uzza bin Qusai.\n7 - And Ibrahim, the son of the Messenger of Allah, peace and blessings be upon him; his mother is Mariya (2) bint Sham'un the Copt. He lived for ten and some months (3), and died in the month of Rabi' al-Awwal in the year ten (4), and did not complete his breastfeeding, so the Prophet, peace and blessings be upon him, said:",
    "foot_note": "1. = Al-Hafiz said in \"Al-Isabah\" (3/549): Al-Zubair bin Bakkar said: And Ibrahim bin Hamza told me, saying: Khadijah bore Al-Qasim and Al-Tahir—and they say: Abdullah and Al-Tayyib—and he mentioned the daughters. And via the path of Ibn Lahi'ah from Abu Al-Aswad the orphan of Urwah, who said: Khadijah bore: Al-Qasim, Al-Tayyib, Al-Tahir, and Abdullah, and he mentioned the daughters. See \"Sirat Ibn Hisham\" (1/187-160).\n1. The leader of the women of the worlds in her time, and the mother of the children of the Messenger of Allah, peace and blessings be upon him. She was the first to believe in him and confirm him before anyone else, and she strengthened his resolve. She died three years before the Hijra. \"Al-Tabaqat Al-Kubra\" (8/52, 1/131), \"Usd Al-Ghabah\" (7/78), \"Al-Siyar\" (2/109), \"Al-Isabah\" (7/600).\n7 -. Born in Dhu al-Hijjah in the year eight, and the Prophet, peace and blessings be upon him, was very happy with his birth. He was born in Al-Aliyah. \"Usd Al-Ghabah\" (1/49), \"Al-Isabah\" (1/172).\n2. The freedwoman of the Messenger of Allah and his concubine. Al-Muqawqis, the ruler of Alexandria, gifted her to him. She died in the year sixteen during the caliphate of Umar. Umar used to gather people himself to attend her funeral, and Umar prayed over her, may Allah be pleased with her. \"Al-Tabaqat Al-Kubra\" (8/212), \"Usd Al-Ghabah\" (7/261), \"Al-Isabah\" (8/113).\n3. Al-Hafiz said in \"Al-Isabah\" (1/174): In \"Sahih Al-Bukhari\" it states he lived seventeen or eighteen months; doubtfully. Ahmad narrated in \"Al-Musnad\" (6/266) from Aisha: That he died when he was eighteen months old. Al-Hafiz said in \"Al-Isabah\" (1/173): Al-Bazzar and Abu Ya'la narrated it, and its chain is Hasan (good), and Ibn Hazm authenticated it.\n4. Al-Hafiz said in \"Al-Isabah\" (1/172): Mus'ab Al-Zubairi said: He died in the year ten. Al-Waqidi asserted it, and said: On Tuesday, the tenth of Rabi' al-Awwal. See \"Al-Fath\" (2/529).",
    "book_id": "26"
  },
  {
    "serial_number": "6208395",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 24,
    "volume_number": 1,
    "text": "\"Indeed, he has a wet nurse who completes his breastfeeding in Paradise\" (1).\n* * * * *",
    "foot_note": "1. Narrated by Al-Bukhari in the Book of Funerals (3/244) (No. 1382), Book of the Beginning of Creation (6/320) (No. 3255), and Book of Manners (10/577). And Ahmad in \"Al-Musnad\" (4/284, 289, 300, 302, 304) from Al-Bara who said: When Ibrahim, peace be upon him, died, the Messenger of Allah, peace and blessings be upon him, said: \"Indeed, he has a wet nurse in Paradise.\"",
    "book_id": "26"
  },
  {
    "serial_number": "6208396",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 25,
    "volume_number": 1,
    "text": "* And the brothers of the children of the Messenger of Allah, peace and blessings be upon him, from their mother Khadijah:\n8 - Hind bint Atiq bin Abid (1) bin Abdullah bin Umar bin Makhzum; she became Muslim (2) and got married, and nothing was narrated from her (3).\n9 - And Hind.\n10 - And Hala; the two sons of Abu Hala Malik (4) bin Al-Nabbash bin Zurara. And it was said: The name of Abu Hala (5) is: Hind bin Zurara bin Al-Nabbash, ally of Banu Abd al-Dar bin",
    "foot_note": "1. 8 - Al-Hafiz said in \"Al-Isabah\" (8/157): Ibn Sa'd said in the biography of Khadijah: After Abu Hala, Atiq bin Abid bin Abdullah bin Umar bin Makhzum succeeded [married] Khadijah, and she bore him a girl called: Hind. Sayfi bin Umayyah bin Abid, who was her cousin, married her.\n1. The author vocalized it in \"Al-Mu'talif\" (1540) with letters.\n2. Al-Hafiz indicated in \"Al-Isabah\" (8/157) the author's biography of her.\n3. Thus in \"The Original\", and in \"Al-Isabah\" quoting from \"Al-Ikhwah\": \"She did not narrate anything from him.\"\n9 -. Step-son of the Prophet, peace and blessings be upon him. It was said: He was martyred on the Day of the Camel with Ali, and it was said: He lived after that. \"Al-Isti'ab\" (3/600), \"Usd Al-Ghabah\" (5/417), \"Al-Isabah\" (6/557), \"Al-Tahdhib\" (11/72).\n10 -. He has Companionship (Suhbah). \"Usd Al-Ghabah\" (5/378), \"Al-Isabah\" (6/517).\n4. In \"Al-Isabah\" (6/558): Al-Zubair said: His name is: Malik bin Al-Nabbash bin Zurara.\n5. In \"Al-Isabah\" (6/558): Abu Muhammad Ibn Hazm said: The name of Abu Hala is: Hind bin Zurara bin Al-Nabbash. Al-Hafiz said in \"Al-Tahdhib\" (11/72): Al-Daraqutni narrated in the book \"Al-Ikhwah\": The name of Abu Hala is: Malik bin Al-Nabbash, and it is said: Hind bin Al-Nabbash, ally of Banu Abd al-Dar.",
    "book_id": "26"
  },
  {
    "serial_number": "6208397",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 26,
    "volume_number": 1,
    "text": "Qusai. Their mother is also Khadijah. Hind bin Abu Hala is the one from whom the two sons (1) of his sister (2), Al-Hasan and Al-Husayn, the sons of Ali, may Allah be pleased with them, narrated his hadith regarding the description (3) of the Prophet, peace and blessings be upon him. He was eloquent (4), and witnessed the Day of the Camel with Ali and was killed (5) on that day.\nAs for Fatima (6), the daughter of the Messenger of Allah, peace and blessings be upon him, she narrated from her father, peace and blessings be upon him. And Ali narrated from her,",
    "foot_note": "1. Because he is the brother of their mother from her mother, i.e., because Hala [Hind] is the brother of Fatima, the daughter of the Messenger of Allah, peace and blessings be upon him.\n2. In \"The Original\": \"his brother\", and the correct is what I established.\n3. Narrated by Al-Tirmidhi in \"Al-Shama'il\" (22), Ibn Sa'd in \"Al-Tabaqat\" (1/422-423), and Ibn Adi in \"Al-Kamil\" (2/59) from Al-Hasan bin Ali, may Allah be pleased with them both, who said: I asked my maternal uncle Hind bin Abi Hind—and he was a describer of the ornamentation of the Prophet, peace and blessings be upon him... the Hadith. Al-Hafiz said in \"Al-Tahdhib\" (11/72) regarding the Hadith: And in his Hadith there is one who is not known. Al-Ajurri said from Abu Dawood: I fear it might be fabricated. Sheikh Nasir said in \"Al-Silsilah Al-Sahihah\" (5/85): This is a weak chain, and it has two defects: First: The obscurity of Abu Abdullah Al-Tamimi, and Second: The weakness of Jami' bin Umayr, and some accused him.\n4. Ibn Abd al-Barr said in \"Al-Isti'ab\" (3/602): Hind was eloquent and articulate; he described the Messenger of Allah, peace and blessings be upon him, and did so well and accurately.\n5. In \"Al-Isti'ab\" and \"Al-Isabah\": Al-Zubair said: Hind was killed with Ali bin Abi Talib on the Day of the Camel. He added in \"Al-Isabah\": And so said Al-Daraqutni in the book \"Al-Ikhwah\".\n6. Ibn Abd al-Barr said in \"Al-Isti'ab\" (4/373): She and her sister Umm Kulthum were the youngest daughters of the Messenger of Allah, peace and blessings be upon him. There was disagreement regarding the youngest of them. It was said: Ruqayyah is younger than them, but that is not correct in my view... Mus'ab and Al-Zubair were confused—regarding the daughters of the Prophet, peace and blessings be upon him, which of them is youngest and eldest—a confusion that necessitates not paying attention to them in that. What the soul feels at ease with, according to what the reports have widely transmitted, is that the order of the daughters of the Messenger of Allah, peace and blessings be upon him, is that Zainab is the first, then the second is Ruqayyah, then the third is Umm Kulthum, then the fourth is =",
    "book_id": "26"
  },
  {
    "serial_number": "6208398",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 27,
    "volume_number": 1,
    "text": "bin Abi Talib, Aisha, and Umm Salamah, the Mothers of the Believers, may Allah be pleased with them, and others from the Companions of the Prophet, peace and blessings be upon him. Ali bin Abi Talib married her (1), and she bore Al-Hasan, Al-Husayn, Muhassin, Umm Kulthum, and Zainab.\nAs for:\n11 - Al-Hasan.\n12 - And Al-Husayn; they memorized from their grandfather, the Messenger of Allah, peace and blessings be upon him, and narrated from him.\nAs for:\n13 - Muhassin; he died young.\nAs for:",
    "foot_note": "1. = Al-Zahra, may Allah be pleased with them, and Allah knows best.\n1. He married her after the Battle of Uhud, as in \"Al-Isti'ab\" (4/374), and \"Al-Siyar\" (2/119).\n11 -. The grandson of the Messenger of Allah, peace and blessings be upon him, and his sweet basil. He accompanied him and memorized from him. He died a martyr by poison in the year forty-nine while he was forty-seven. It was said: He died in the year fifty, and it was said: After that. \"Al-Tarikh Al-Kabir\" (2/386), \"Al-Jarh wa Al-Ta'dil\" (3/19), \"Usd Al-Ghabah\" (2/9), \"Tahdhib Al-Kamal\" (6/220), \"Al-Siyar\" (3/245), \"Al-Tahdhib\" (2/295), \"Al-Isabah\" (2/68), \"Al-Ahad wa Al-Mathani\" (1/297).\n12 -. The grandson of the Messenger of Allah, peace and blessings be upon him, and his sweet basil. He memorized from him. He was martyred on the Day of Ashura in the year sixty-one, and he was fifty-six years old. \"Al-Tarikh Al-Kabir\" (2/381), \"Al-Jarh wa Al-Ta'dil\" (3/55), \"Al-Ahad wa Al-Mathani\" (1/305), \"Usd Al-Ghabah\" (2/81), \"Tahdhib Al-Kamal\" (6/396), \"Al-Siyar\" (3/280), \"Al-Tahdhib\" (2/345), \"Al-Isabah\" (2/76).\n13 -. Al-Hafiz said in \"Al-Isabah\" (6/234): With a Shadda on the un-dotted Seen. Ibn Fathun added him as a correction to Ibn Abd al-Barr, and said: I see he died young. Abu Musa added him as a correction to Ibn Mandah. End quote. In \"Al-Dhurriyah Al-Tahirah\" (114): Muhassin passed away young. Then Al-Hafiz mentioned in \"Al-Isabah\" a Hadith narrated by Imam Ahmad in his \"Musnad\" regarding the reason for naming Al-Hasan, Al-Husayn, and Muhassin, then Al-Hafiz said: Its chain is authentic. See \"Tabsira Al-Muntabih\" (4/1264).",
    "book_id": "26"
  },
  {
    "serial_number": "6208399",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 28,
    "volume_number": 1,
    "text": "14 - Umm Kulthum; Umar bin Al-Khattab married her, and she bore for him: Zaid (1), and Ruqayyah (2). Umar was killed leaving her a widow (3), so Muhammad (4) bin Ja'far married her, and he died (5) leaving her a widow,",
    "foot_note": "1. 14 - Umm Kulthum bint Ali bin Abi Talib, the full sister of Al-Hasan and Al-Husayn. She was born around the year six of the Hijra. She saw the Prophet, peace and blessings be upon him, but did not narrate anything from him. \"Tabaqat Ibn Sa'd\" (8/463), \"Al-Isti'ab\" (4/41), \"Usd Al-Ghabah\" (7/387), \"Al-Isabah\", (8/293).\n1. In \"Al-Siyar\" (3/502): Her son Zaid was one of the masters of the nobles of Quraysh. He died young and left no offspring. In \"Al-Isabah\" Al-Zubair said: She bore for Umar Zaid and Ruqayyah. Umm Kulthum and her son died on the same day... In \"Al-Tabaqat\" (8/464): Ibn Umar prayed over Umm Kulthum bint Ali and her son Zaid, placing him closer to himself, and said four Takbirs over them. Al-Hafiz said in \"Al-Isabah\" (8/295): And its chain is authentic.\n2. In \"Al-Siyar\" (3/501): Al-Zuhri and others reported: She bore for Umar Zaid, and it was said: She bore him Ruqayyah. The statement of Al-Zubair preceded in her brother's biography.\n3. Al-Hafiz said in \"Al-Isabah\" (8/294): Al-Daraqutni mentioned in the book \"Al-Ikhwah\": That Awn died leaving her a widow, then his brother Muhammad married her, then he died leaving her a widow, then his brother Abdullah bin Ja'far married her and she died with him. I say: What is in our copy of the book \"Al-Ikhwah\" is that Muhammad married Umm Kulthum after Umar, then Awn, then Abdullah, and this is the correct view as will come.\n4. He is Muhammad bin Ja'far bin Abi Talib Al-Hashimi, the cousin of the Prophet, peace and blessings be upon him. He was born in the land of Abyssinia. His mother is Asma bint Umays. \"Al-Isti'ab\" (3/346), \"Usd Al-Ghabah\" (5/83), \"Al-Isabah\" (6/8).\n5. It came in \"Al-Isti'ab\" in the biography of Muhammad: He is the one who married Umm Kulthum bint Ali after the death of Umar bin Al-Khattab. Similar is in \"Usd Al-Ghabah\". Al-Hafiz said in \"Al-Isabah\": Abu Umar mentioned from Al-Waqidi that he married Umm Kulthum bint Ali after Umar. It came in \"Al-Sirah\" by Ibn Ishaq (250), =",
    "book_id": "26"
  },
  {
    "serial_number": "6208400",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 29,
    "volume_number": 1,
    "text": "then Awn (1) bin Ja'far married her and died leaving her a widow, then Abdullah (2) bin Ja'far married her and she died with him (3).\nAs for:\n15 - Zainab bint Ali bin Abi Talib; her father married her to Abdullah bin Ja'far, and she bore (4) for him: Ali bin Abdullah, Umm Kulthum, and Ruqayyah (5).",
    "foot_note": "1. = and \"Al-Dhurriyah Al-Tahirah\" (114-117): That Awn married Umm Kulthum after Umar. Al-Dhahabi said in \"Al-Siyar\" (3/501): Ibn Ishaq said: Umar died leaving her, so Awn married her. In \"Al-Tabaqat\" it is similar.\n1. Born in the land of Abyssinia, and his father brought him in the Battle of Khaybar. It came in \"Al-Isti'ab\": He was martyred in the Battle of Tustar, and that was in the caliphate of Umar, and he had no offspring. I say: Thus it came, and it is a mistake because he married Ruqayyah [Umm Kulthum?] after the martyrdom of Umar, and the Battle of Tustar was in the year eighteen in the caliphate of Umar. \"Al-Isti'ab\" (3/161). Al-Hafiz said in \"Al-Isabah\" (4/744): There was disagreement regarding which of Ja'far's two sons, Muhammad or Awn, was older? As for Abdullah, he was older than both of them.\n2. One of the generous ones. Born in the land of Abyssinia and he has Companionship. He died in the year eighty, and he was eighty years old.\n3. Ibn Sa'd mentioned in \"Al-Tabaqat\" (8/463): That Umm Kulthum said: I am shy before Asma bint Umays; her two sons died while with me, and I fear for this third one. So she perished while with him and did not bear children for any of them.\n15 -. Born during the life of the Prophet, peace and blessings be upon him, and she was intelligent and judicious. \"Al-Tabaqat Al-Kubra\" (8/465) \"Al-Dhurriyah Al-Tahirah\" (119), \"Usd Al-Ghabah\" (7/132), \"Al-Isabah\" (7/684).\n4. In \"Al-Tabaqat Al-Kubra\": Abdullah bin Ja'far married her and she bore for him Ali, Awn Al-Akbar, Abbas, Muhammad, and Umm Kulthum. In \"Al-Dhurriyah Al-Tahirah\" (119): She had Ali, Ja'far, Awn, Abbas, and Umm Kulthum, the children of Abdullah bin Ja'far.\n5. I did not find independent biographies for these three.",
    "book_id": "26"
  },
  {
    "serial_number": "6208401",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 30,
    "volume_number": 1,
    "text": "As for Zainab, the daughter of the Messenger of Allah, peace and blessings be upon him, Abu Al-As (1) bin Al-Rabi' bin Abd al-Uzza bin Abd Shams married her. He is the son of her maternal aunt, Umm Hala bint Khuwaylid, the full sister of Khadijah (2). Zainab bore for Abu Al-As: Ali and Umamah.\nAs for:\n16 - Ali: The Messenger of Allah, peace and blessings be upon him, let him ride behind him on his mount on the Day of the Conquest (3). He died when he was nearing puberty (4).\nAs for:\n17 - Umamah: She is the one whom the Messenger of Allah, peace and blessings be upon him, used to carry on his shoulder while standing in prayer; and when he wanted to prostrate, he would place her on the ground (5). She grew up and Ali bin Abi",
    "foot_note": "1. There is disagreement regarding his name. It was said: Laqit, and it was said: Al-Zubair, and it was said: Hushaym... He used to be called: Al-Amin (The Trustworthy). He became Muslim five months before Al-Hudaybiyah, and died in the year twelve during the caliphate of Al-Siddiq. \"Tarikh Khalifah\" (119), \"Al-Isti'ab\" (4/125), \"Usd Al-Ghabah\" (6/185), \"Al-Siyar\" (1/330), \"Al-Isabah\" (7/248).\n2. As in \"Al-Isti'ab\" (4/125), and see \"Al-Dhurriyah Al-Tahirah\" (45).\n16 -. Ali was being wet-nursed among Banu Ghadirah, so the Messenger of Allah, peace and blessings be upon him, took him into his care, while his father was a polytheist. \"Al-Isti'ab\" (3/68), \"Usd Al-Ghabah\" (4/126), \"Al-Isabah\" (4/570).\n3. Al-Haythami cited this report in \"Majma' Al-Zawa'id\" (19/212) and attributed it to Al-Tabarani, then said: \"And Amr bin Abi Bakr: Is abandoned (Matruk).\"\n4. See \"Al-Isabah\" (4/571), and \"Al-Sirah\" (246) by Ibn Ishaq, and in both it states that he died while he was a boy.\n17 -. See her biography in \"Al-Tabaqat Al-Kubra\" (8/39), \"Al-Isti'ab\" (4/244), \"Usd Al-Ghabah\" (7/22), \"Al-Siyar\" (1/335).\n5. Narrated by Al-Bukhari in his \"Sahih\", Book of Prayer (1/590) No. (516), and Book of Manners (10/426) No. (5996). Muslim, Book of Mosques (1/385-386) No. (543), =",
    "book_id": "26"
  },
  {
    "serial_number": "6208402",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 31,
    "volume_number": 1,
    "text": "Talib married her after the death of Fatima, peace be upon her (1). It was said: Fatima had advised him to do so. Ali was killed leaving her a widow, and she did not bear him children (2). Then Al-Mughirah bin Nawfal bin Al-Harith married her (3). It was said: No, rather Abu Al-Hayyaj bin Abi Sufyan bin Al-Harith bin Abd al-Muttalib married her after Ali.\nAs for Ruqayyah, the daughter of the Messenger of Allah, peace and blessings be upon him, Uthman bin Affan married her (4), and she migrated with him",
    "foot_note": "1. = and Abu Dawood, Book of Prayer (1/241) No. (918), and Al-Nasa'i, Book of Prayer (2/45, 3/10), all of them via the path of Abu Qatadah.\n1. Ibn Ishaq said in \"Al-Sirah\" (246): Umamah remained until Ali married her after Fatima. Then after Ali was killed, she married Al-Mughirah bin Nawfal bin Al-Harith and perished while with him. See \"Al-Dhurriyah Al-Tahirah\" (45), and \"Al-Ma'rifah wa Al-Tarikh\" (3/270).\n2. In \"Al-Isabah\" (7/503) Al-Zubair said: Zainab [Umamah] has no offspring. Abu Umar said in \"Al-Isti'ab\": It has been said: She did not bear children for Ali, nor for Al-Mughirah likewise.\n3. Al-Hafiz said in \"Al-Isabah\" (6/201) in the biography of Mughirah: Al-Zubair bin Bakkar said: Mu'awiyah proposed to Umamah after Ali was killed, so she entrusted her affair to Al-Mughirah bin Nawfal, so he took a pledge from her then married her himself, and she died while with him. Al-Hafiz said in \"Al-Isabah\" (7/504): And Al-Daraqutni said in the book \"Al-Ikhwah\": Al-Mughirah bin Nawfal married her after Ali. And it was said: Rather, Abu Al-Hayyaj bin Abi Sufyan bin Al-Harith bin Abd al-Muttalib married her after him.\n4. Ibn Sa'd said (8/36): Utbah bin Abi Lahab had married her before the Prophethood. Al-Dhahabi said in \"Al-Siyar\" (2/251): \"So he said, but the correct view is: Before the Hijra. When {Perish the hands of Abu Lahab} was revealed, his father said: My head is forbidden from your head if you do not divorce his daughter. So he separated from her before consummation, and she became Muslim along with her mother and sisters, then Uthman married her. See \"Al-Dhurriyah Al-Tahirah\" (52).",
    "book_id": "26"
  },
  {
    "serial_number": "6208403",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 32,
    "volume_number": 1,
    "text": "in both migrations (1) to the land of Abyssinia, then to Medina. She bore for him Abdullah (2), and by him he was given his Kunya. She died in Medina while the Messenger of Allah, peace and blessings be upon him, was at Badr (3). Uthman witnessed her burial. The Messenger of Allah, peace and blessings be upon him, arrived from Badr and married Uthman to her sister Umm Kulthum (4). She died while with him and did not bear him children. There is no narration for them.\nRuqayyah is mentioned in a Hadith narrated to us by Abdullah (5) bin Muhammad bin Abd al-Aziz, Al-Khalil (6) bin Amr told us, Muhammad bin Salamah (7) told us, from Abu",
    "foot_note": "1. It came in \"Al-Tabaqat Al-Kubra\": She migrated with Uthman in both migrations.\n2. Ibn Sa'd said: In the first migration, she had miscarried a fetus from Uthman, then she bore him a son after that whom he named Abdullah. Uthman used to be called by his name [Abu Abdullah] in Islam. He reached six years of age, then a rooster pecked him in his face, and his face swelled, so he died. See \"Al-Dhurriyah Al-Tahirah\" (53), and \"Tarikh Al-Fasawi\" (3/159-163).\n3. Ibn Sa'd said: She fell ill while the Messenger of Allah was preparing for Badr, so the Messenger of Allah left Uthman bin Affan behind to care for her. She died while the Messenger of Allah, peace and blessings be upon him, was at Badr in the month of Ramadan.\n4. Ibn Sa'd said (8/37): Utbah bin Abi Lahab married her then separated from her before consummating the marriage. When Ruqayyah died, Uthman succeeded [married] her, and she was a virgin. She remained with him until she died and did not bear him anything. She died in Sha'ban of the year nine of the Hijra. The Messenger of Allah, peace and blessings be upon him, said: \"If I had ten, I would have married them to Uthman.\" This Hadith has paths indicated by Al-Haythami in \"Al-Majma'\" (9/83) which establish it. See \"Al-Dhurriyah Al-Tahirah\" (56), and \"Al-Ma'rifah wa Al-Tarikh\" (3/159, 269, 270).\n5. He is Abu Al-Qasim Al-Baghawi, the Hafiz. See his biography in \"Al-Siyar\" (14/440).\n6. Al-Thaqafi Abu Amr Al-Bazzar Al-Baghawi, truthful (Saduq) from the tenth layer, died in year (242/approx). \"Al-Tahdhib\" (3/168).\n7. Ibn Abdullah Al-Bahili Al-Harrani, trustworthy (Thiqah) from the ninth layer, died in year (191 according to the correct view). \"Al-Tahdhib\" (9/193).",
    "book_id": "26"
  },
  {
    "serial_number": "6208404",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 33,
    "volume_number": 1,
    "text": "Abd al-Rahim (1) from Zaid bin Abi Unaysah (2) from Muhammad bin Abdullah (3) from Al-Muttalib (4) from Abu Hurairah who said: I entered upon Uthman bin Affan and saw Ruqayyah with him... and he mentioned the Hadith (5).\nThere is a point of consideration in the Hadith; because Ruqayyah died on the day of Badr, and Abu Hurairah became Muslim in the year of Khaybar.",
    "foot_note": "1. He is Khalid bin Abi Yazid bin Sammal (a) bin Rustam Al-Umawi, their freedman, Al-Harrani. Trustworthy from the sixth layer, died (144/ Bukhari, Muslim, Abu Dawood, Nasa'i).\n2. Al-Jazari Abu Usamah, trustworthy, has unique narrations, from the sixth layer, died in year (119), and it was said: (124/All Six).\n3. In \"Tahdhib Al-Kamal\" in the biography of Zaid: A Sheikh narrating from Al-Muttalib from Abu Hurairah. In \"Al-Mustadrak\" by Al-Hakim, he said: From Muhammad bin Abdullah bin Amr bin Uthman. I say: He is Al-Dibaj, truthful/approx.\n4. He is Al-Muttalib bin Abdullah Al-Makhzumi, truthful, practiced much Tadlis (concealing defects in the chain) and Irsal (omitting the first narrator), from the fourth layer.\n5. The Hadith was narrated by Al-Fasawi in \"Al-Ma'rifah wa Al-Tarikh\" (3/162) and said: Al-Khalil told us similar to it. Al-Dulabi narrated it in \"Al-Dhurriyah Al-Tahirah\" No. (63, 74) via the path of Al-Khalil bin Amr with it, and mentioned in the first: I entered upon Ruqayyah. Al-Tabarani narrated it in \"Al-Kabir\" (1/32) No. (99) via the path of Al-Khalil, Muhammad bin Salamah told us, from Abu Abd al-Rahim from Zaid bin Abi Unaysah from Muhammad bin Abdullah bin Abd al-Muttalib bin Abdullah from Abu Hurairah. Ibn Abi Asim narrated it in \"Al-Ahad\" (5/376), and Al-Hakim in \"Al-Mustadrak\" (4/48) via the path of Muhammad bin Salamah from Abu Abd al-Rahim from Zaid bin Abi Unaysah from Muhammad bin Abdullah bin Amr bin Uthman from Al-Muttalib bin Abdullah from Abu Hurairah. Al-Hakim said: Authentic chain, weak text (Matn), for Ruqayyah died in the year three of the Hijra at the conquest of Badr, and Abu Hurairah only became Muslim after the conquest of Khaybar, and Allah knows best. We have written it with another chain. Al-Hakim narrated it in \"Al-Mustadrak\" (4/48) via the path of Wahb bin Munabbih from Abu Hurairah. Al-Hakim, may Allah have mercy on him, said: There is no doubt that Abu Hurairah narrated this Hadith from an earlier one of the = _________ (a) See \"Al-Mu'talif\" (3/1242) by the author, and \"Al-Ikmal\" (4/354) by Ibn Makula.",
    "book_id": "26"
  },
  {
    "serial_number": "6208405",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 34,
    "volume_number": 1,
    "text": "* The Brothers from the children of Abd al-Muttalib bin Hashim bin Abd Manaf:\n18 - Hamza. ... 19 - And Al-Abbas.\n20 - And Safiyyah. ... 21 - And Atikah, the children of Abd al-Muttalib (1).\nAs for Hamza: Abu Marthad Al-Ghanawi, his ally, narrated a Hadith from him. And his wife Khawlah bint Qays narrated another Hadith from him regarding the Hawd (Cistern) (2).",
    "foot_note": "1. = Companions, that he entered upon Ruqayyah, may Allah be pleased with her, but I sought it with my effort and did not find it at the time. The wording of the Hadith from Abu Hurairah: He said: I entered upon Ruqayyah, the daughter of the Messenger of Allah, peace and blessings be upon him, the wife of Uthman, and in her hand was a comb. She said: The Messenger of Allah, peace and blessings be upon him, left my presence just now; I combed his hair and he said to me: \"How do you find Abu Abdullah?\" I said: Good. He said: \"Honor him, for he is the most similar of my companions to me in character.\"\n18 -. The courageous hero, the Lion of Allah, Abu Umara, the paternal uncle of the Messenger of Allah, peace and blessings be upon him, and his brother through breastfeeding. He was martyred on the Day of Uhud. \"Al-Tabaqat Al-Kubra\" (3/8), \"Al-Jarh wa Al-Ta'dil\" (3/212), \"Al-Mu'jam Al-Kabir\" (3/149), \"Usd Al-Ghabah\" (2/51), \"Al-Siyar\" (1/171), \"Al-Isabah\" (2/121).\n19 -. The uncle of the Prophet, peace and blessings be upon him. He died in the year thirty-two or after it, and he was eighty-eight. \"Al-Tabaqat Al-Kubra\" (4/5), \"Al-Tarikh Al-Kabir\" (7/2), \"Al-Jarh wa Al-Ta'dil\" (6/210), \"Usd Al-Ghabah\" (3/164), \"Al-Ahad wa Al-Mathani\" (1/267), \"Al-Siyar\" (2/78), \"Al-Isabah\" (3/631).\n20 -. The full sister of Hamza and the mother of the Disciple of the Prophet, peace and blessings be upon him, Al-Zubair bin Al-Awwam. She is one of the first female emigrants. She died in the year twenty and was buried in Al-Baqi', being seventy-some years old.\n21 -. She has a biography in \"Al-Tabaqat Al-Kubra\" (8/43), \"Usd Al-Ghabah\" (7/185), \"Al-Siyar\" (2/272), \"Al-Isabah\" (8/13).\n1. They have sisters not mentioned by the author, such as: Arwa, Umm Hakim, Barrah, and Umaymah. See \"Al-Tabaqat Al-Kubra\" (8/45-46).\n2. Its extraction (Takhrij) will come.",
    "book_id": "26"
  },
  {
    "serial_number": "6208406",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 35,
    "volume_number": 1,
    "text": "As for the Hadith (1) of Abu Marthad from him; Uthman bin Ja'far bin Muhammad bin Hatim told us, Umar bin Shabba told us, Sulayman (2) bin Iyad bin Sulaym bin Ma'bad (3) Munqidh bin Malik bin Fatima bint Abu Marthad Kannaz bin Husayn told me, Sulaym (4) bin Munqidh told me, from the narration of his grandfather Malik, from the narration of his grandfather Abu Marthad, from the narration of his ally Hamza bin Abd al-Muttalib, a Hadith attributed to the Messenger of Allah, peace and blessings be upon him, who said: \"Stick to this supplication: O Allah, I ask You by Your Greatest Name and Your Greatest Pleasure, what no servant has ever despaired of with a young she-camel (5), and no boy has called his father [with it], and no one has stayed in his place [without being answered].\"\nAs for the Hadith of Khawlah, his wife, from him (6) ...",
    "foot_note": "1. Narrated by Al-Tabarani in \"Al-Kabir\" (3/166) (No. 3258) via the path of Umar bin Shabba similarly, with difference in some names of narrators as will come. Its chain is weak due to the large number of unknown narrators. Ibn Al-Athir narrated it in \"Usd Al-Ghabah\" (2/55) via the path of Umar bin Shabba, Sari bin Iyad bin Munqidh bin Salma bin Malik told us, and Malik bin Fatima bint Abu Marthad Kannaz bin Al-Husayn, Munqidh bin Salma told me from the narration of his grandfather Abu Marthad from the narration of his ally Hamza... the Hadith. He said in \"Al-Isabah\" (2/122): And in \"Al-Ghaylaniyat\" from the narration of Umar bin Shabba from Sari bin Iyad bin Munqidh, my grandfather Munqidh bin Salma bin Malik told me from his maternal grandfather Abu Marthad from his ally from Hamza... (Thus)!\n2. It came in \"Al-Mu'jam Al-Kabir\": Salma, and in \"Usd Al-Ghabah\" and \"Al-Isabah\": Sari.\n3. Thus in \"The Original\"! And I did not determine the correct form.\n4. It came in \"Al-Isabah\" and \"Usd Al-Ghabah\": Munqidh bin Salma.\n5. Al-Qalus: It is the young she-camel. \"Al-Nihayah\" (4/100).\n6. Written in the margin: Thus in \"The Original\". I say: And his Hadith from his wife was narrated by Al-Tabarani in \"Al-Kabir\" (3/166) No. (2959) and Baqi bin Makhlad in \"Ma Warada fi Al-Hawd\" (No. 42), and its wording: From Usamah bin Zaid that the Messenger of Allah, peace and blessings be upon him, came to =",
    "book_id": "26"
  },
  {
    "serial_number": "6208407",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 36,
    "volume_number": 1,
    "text": "As for Al-Abbas bin Abd al-Muttalib: He is nicknamed Abu Al-Fadl. His virtues are famous, and the narrations (1) from him are numerous. He attributed Hadiths, and his children (2) and others narrated from him.\nAs for Safiyyah bint Abd al-Muttalib, she became Muslim and witnessed Al-Khandaq (3) and killed a man from",
    "foot_note": "1. = Hamza bin Abd al-Muttalib one day and did not find him, so he asked his wife about him—and she was from Banu Al-Najjar—she said: He went out, may you be ransomed with my father, just now heading towards you, so I think he... until she said: Abu Umara informed me that you have been given a river in Paradise called Al-Kawthar! He said: \"Yes, and its banks are rubies, corals, chrysolites, and pearls...\" the Hadith. Al-Haythami said in \"Majma' Al-Zawa'id\" (10/363): It contains Haram bin Uthman, and he is abandoned. I say: Ahmad narrated it in \"Al-Musnad\" (6/410), Ibn Abi Asim in \"Al-Sunnah\" (2/324), and Al-Tabarani in \"Al-Kabir\" (24/231-232), all of them from Khawlah the wife of Hamza from the Messenger of Allah, peace and blessings be upon him, without mentioning Hamza. See \"Nihayat Al-Bidayah wa Al-Nihayah\" (12/14) by Ibn Kathir.\n1. He has seventeen Hadiths in the Six Books. See \"Tuhfat Al-Ashraf\" (4/264).\n2. Among them Abdullah bin Abbas, Ubaydullah, Kathir, and Umm Kulthum, as in \"Al-Tahdhib\".\n3. In \"Al-Siyar\" (2/270): On the Day of Al-Khandaq she was in the fortress of Hassan bin Thabit, then he mentioned the killing of the Jew. It came in \"Al-Tabaqat Al-Kubra\" (8/41): Hassan stayed behind on the Day of Uhud, and a Jew came... and he mentioned the story. I say: This is a delusion where he said: Day of Uhud, and the correct is: Day of Al-Khandaq. See \"Sirat Ibn Hisham\" (3/246).",
    "book_id": "26"
  },
  {
    "serial_number": "6208408",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 37,
    "volume_number": 1,
    "text": "the Jews (1), and the Prophet, peace and blessings be upon him, assigned a share for her (2). She narrated a Hadith (3) from the Prophet, peace and blessings be upon him, which her son Al-Zubair bin Al-Awwam narrated from her. She was the sister of Hamza through his father and mother; their mother was Hala bint Wuhayb bin Abd Manaf bin Zuhra bin Kilab.\nAs for Atikah, she heard from Abd al-Muttalib. She was the sister of Abdullah, the father of the Messenger of Allah, peace and blessings be upon him, through his father (4) and mother; their mother (5) was Fatima bint Amr bin A'idh bin Imran bin Makhzum. She became Muslim (6), and she is the one who had (7) the vision (dream).",
    "foot_note": "1. Narrated by Al-Hakim in \"Al-Mustadrak\" (4/51) and he authenticated it, and Al-Dhahabi critiqued him saying: Urwah did not meet Safiyyah. Al-Bazzar narrated it as in \"Kashf Al-Astar\" (2/333), and Abu Ya'la in his \"Musnad\" (2/43) (No. 683), via the path of Al-Zubair. Al-Tabarani narrated it in \"Al-Kabir\" (24/319) from Urwah and said: Day of Al-Ahzab (Khandaq), and he also narrated it (24/322) from Safiyyah and she said: Day of Uhud.\n2. Narrated by Abu Ya'la in his \"Musnad\" (2/43) (No. 683). Al-Haythami said in \"Majma' Al-Zawa'id\" (6/134): Both their chains are weak.\n3. I did not find her Hadith which her son Al-Zubair narrated from her.\n4. In \"Al-Isabah\": Al-Zubair bin Bakkar mentioned that she was the full sister of Abu Talib and Abdullah.\n5. As in \"Al-Tabaqat\".\n6. Ibn Sa'd said: She became Muslim in Mecca and migrated to Medina. In \"Al-Siyar\": She became Muslim and migrated. In \"Al-Isabah\" Abu Umar said: There was disagreement regarding her Islam, and the majority refuse that. As for Ibn Ishaq, he mentioned that none of the paternal aunts of the Prophet, peace and blessings be upon him, became Muslim except Safiyyah.\n7. Ibn Sa'd mentioned the story in \"Al-Tabaqat\" (8/43) and Ibn Hisham in \"Al-Sirah\" =",
    "book_id": "26"
  },
  {
    "serial_number": "6208409",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters (Al-Ikhwah wa Al-Akhawat)",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Raya for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 38,
    "volume_number": 1,
    "text": "She has poetry regarding the people of Badr (1) in which she mentions her vision and her truthfulness in it. Nothing has been attributed (as Isnad) from her (2).\n* * * * *",
    "foot_note": "1. = (2/244), and Al-Tabarani narrated it in \"Al-Kabir\" (24/344) from Atikah. Al-Haythami said in \"Majma' Al-Zawa'id\" (6/71): It contains Abd al-Aziz bin Marwan, and he is abandoned.\n1. See her poetry in \"Al-Mu'jam Al-Kabir\" (24/348).\n2. Al-Hafiz said in \"Al-Isabah\" (8/13): Al-Daraqutni said in the book \"Al-Ikhwah\": She has poetry in which she mentions her confirmation, but she has no narration.",
    "book_id": "26"
  },
  {
    "serial_number": "6208410",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 39,
    "volume_number": 1,
    "text": "* The Siblings from the children of Abu Talib bin Abd al-Muttalib bin Hashim: 22 - Ali. ... 23 - And Ja'far. ... 24 - And Aqeel. 25 - And Umm Hani. ... 26 - And Jumanah: The children of Abu Talib (1), their mother is",
    "foot_note": "1. 22 - The cousin of the Messenger of Allah, peace be upon him, and the husband of his daughter, one of the foremost early Muslims. A group preferred the view that he was the first to embrace Islam. He died in Ramadan in the year forty, and he was sixty-three years old according to the most correct view. \"Al-Tabaqat Al-Kubra\" (2/337), \"Al-Ahad wa Al-Mathani\" (1/135), \"Al-Mu'jam Al-Kabir\" (1/50), \"Usud Al-Ghabah\" (4/91), \"Al-Isabah\" (4/564), \"Al-Tahdhib\" (7/334).\n23 - Possessor of the Two Wings, the majestic Companion. He was martyred at Mu'tah in the year eight. \"Al-Tabaqat Al-Kubra\" (4/34), \"Al-Tarikh Al-Kabir\" (2/185), \"Al-Jarh wa Al-Ta'dil\" (2/482), \"Al-Ahad wa Al-Mathani\" (1/275), \"Al-Mu'jam Al-Kabir\" (2/103), \"Usud Al-Ghabah\" (1/341), \"Tahdhib Al-Kamal\" (5/50), \"Al-Siyar\" (1/206), \"Al-Isabah\" (1/485), \"Al-Tahdhib\" (2/98).\n24 - A Companion knowledgeable in genealogy. He died in the year sixty, and it is said: after that. \"Al-Tabaqat Al-Kubra\" (4/42), \"Al-Tarikh Al-Kabir\" (7/50), \"Al-Jarh wa Al-Ta'dil\" (6/218), \"Al-Ahad wa Al-Mathani\" (1/279), \"Al-Isti'ab\" (3/157), \"Usud Al-Ghabah\" (4/63), \"Al-Siyar\" (1/218), \"Al-Isabah\" (4/531), \"Al-Tahdhib\" (7/254).\n25 - Her name is Fakhitah, and it is said: Hind. She has companionship and hadiths. She died during the caliphate of Mu'awiyah. \"Tabaqat Ibn Sa'd\" (8/47), \"Al-Jarh wa Al-Ta'dil\" (9/467), \"Al-Isti'ab\" (4/386, 503), \"Al-Ahad wa Al-Mathani\" (5/458), \"Usud Al-Ghabah\" (7/213, 404), \"Al-Isabah\" (8/317), \"Al-Tahdhib\" (12/481).\n26 - Jumanah - with a Damma on the first letter and a light Mim -. The Prophet, peace be upon him, allotted her thirty Wasq from Khaybar. \"Al-Tabaqat Al-Kubra\" (8/48), \"Al-Isti'ab\" (4/266), \"Usud Al-Ghabah\" (7/49), \"Al-Isabah\" (7/553).\n1. They have a third sister, who is Rita or Umm Talib; she has a biography. \"Al-Tabaqat Al-Kubra\" =",
    "book_id": "26"
  },
  {
    "serial_number": "6208411",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 40,
    "volume_number": 1,
    "text": "Fatimah (1) bint Asad bin Hashim bin Abd Manaf. The oldest of them was Aqeel (2), then Ja'far, then Ali. Each one of them was older than his brother by ten years. Their brother Talib was older than Aqeel by ten years, and he did not embrace Islam (3). As for Ali, peace be upon him, his Kunya is Abu Al-Hasan, and his virtues are too many to count, and his narrations (4) from the Prophet, peace be upon him, are numerous. As for Ja'far, his Kunya is Abu Abdullah. He embraced Islam early (5) and migrated both migrations (6) to the land of Abyssinia, then to Medina. He narrated from the Prophet, peace be upon him. Abu Musa (7) Al-Ash'ari and his son narrated from him.",
    "foot_note": "1. = (8/48), \"Al-Isabah\" (8/245).\n1. She embraced Islam and died during the lifetime of the Prophet, peace be upon him. \"Al-Tabaqat Al-Kubra\" (8/222).\n2. In \"Al-Siyar\": He was the oldest of his brothers and the last of them to die.\n3. Ibn Sa'd said in \"Al-Tabaqat\" (4/42) in the biography of Aqeel: He was the oldest of Abu Talib's sons after Talib, and Talib had no offspring. He was older than Aqeel by ten years, and Aqeel was older than Ja'far by ten years, and Ja'far was older than Ali by ten years. Thus, Ali was the youngest of them and the first of them to embrace Islam.\n4. His hadiths in the Six Books number (332) hadiths as in \"Tuhfat Al-Ashraf\" (7/26), and in \"Musnad Abu Ya'la\" (1/225 - 462) they number (368) hadiths.\n5. In \"Sirat Ibn Ishaq\" (143) and \"Al-Tabaqat Al-Kubra\" (4/34): Ja'far embraced Islam before the Messenger of Allah entered the House of Al-Arqam and preached therein.\n6. See his story with the Negus and with the messengers of Quraysh in \"Sirat Ibn Ishaq\" (213-215, 226). And it came in \"Al-Tabaqat\": Ja'far migrated to Abyssinia in the second migration, and with him was his wife Asma bint Umays.\n7. I did not see anyone saying: Abu Musa Al-Ash'ari narrated from him; what is in \"Tahdhib Al-Kamal\" and \"Al-Tahdhib\" is: His son Abdullah bin Ja'far, Abdullah bin Masud, Amr bin Al-Aas, and Umm Salamah narrated from him =",
    "book_id": "26"
  },
  {
    "serial_number": "6208412",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 41,
    "volume_number": 1,
    "text": "Abdullah bin Ja'far. He arrived from the land of Abyssinia on the day of [the conquest of] Khaybar, so the Messenger of Allah - peace be upon him - met him and kissed him between his eyes and said: \"I do not know with which I am happier: with the conquest of Khaybar or with the arrival of Ja'far?\" (1). He was killed as a martyr (2) on the Day of Mu'tah. As for Aqeel, his Kunya was Abu Yazid (3). He narrated from the Prophet, peace be upon him. His sons Muhammad and Yahya, Masud bin Khirash, Al-Hasan Al-Basri, and Musa bin Talha narrated from him.",
    "foot_note": "1. = The wife of the Prophet, peace be upon him, and some of his family.\n1. Narrated by Ibn Abi Shaybah in \"Al-Musannaf\" (12/106), Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/276) (No. 363), Al-Tabarani in \"Al-Kabir\" (2/107) (No. 1469), Ibn Sa'd in \"Al-Tabaqat\" (4/34), and Al-Hakim in \"Al-Mustadrak\" (3/211), via Al-Ajlah from Al-Sha'bi who said: The Messenger of Allah, peace be upon him, came when Khaybar was conquered, and it was said to him: Ja'far has arrived... the hadith. Al-Hakim said: It only appeared with such a chain, and the authentic version is Mursal. Al-Dhahabi said: That is the correct view. As for Abu Dawood in his \"Sunan\" (4/356) (No. 522), he narrated the kissing between the eyes via Al-Ajlah from Al-Sha'bi, which is Mursal. Ibn Abi Asim narrated it in \"Al-Ahad wa Al-Mathani\" (1/277), and Al-Tabarani (2/107) via Abu Juhayfah.\n2. It came in \"Sahih Al-Bukhari\" regarding the Battle of Mu'tah (7/510) from Ibn Umar that he stood over Ja'far that day while he was slain: I counted fifty wounds on him between stabs and strikes, none of which were on his back - meaning his back [indicating he didn't flee].\n3. In \"Al-Tabaqat\" (4/42): Aqeel had children: Yazid - by whom he was given his Kunya -, Sa'id, Ja'far Al-Akbar, Abu Sa'id Al-Ahwal - which is his name -, Muslim, Abdullah, Abd al-Rahman, Abdullah Al-Asghar, Ali, Ja'far Al-Asghar, Hamza, Uthman, Muhammad, Ramlah, Umm Hani, Asma, Fatimah, Umm Al-Qasim, Zainab, and Umm Al-Nu'man.",
    "book_id": "26"
  },
  {
    "serial_number": "6208413",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 42,
    "volume_number": 1,
    "text": "As for Umm Hani, her name was Fakhitah (1). Hubayra (2) bin Abi Wahb bin Amr bin A'idh bin Imran bin Makhzum married her, and she bore him children (3). She embraced Islam (4) and narrated from the Prophet, peace be upon him. Her husband fled (5) to Najran and died as a polytheist (6). As for Jumanah bint Abu Talib, her cousin Abu Sufyan bin Al-Harith bin Abd al-Muttalib married her (7) and she bore him children, and nothing has been attributed [narrated] from her.",
    "foot_note": "1. Ibn Abd al-Barr said in \"Al-Isti'ab\": There is disagreement regarding her name; it was said: Hind, and it was said: Fakhitah. Al-Hafiz said in \"Al-Isabah\": It was said: Hind, but Fakhitah is more famous.\n2. As in \"Al-Tabaqat Al-Kubra\" (8/47).\n3. In \"Al-Tabaqat\": She bore him Ja'dah bin Hubayra. In \"Al-Isti'ab\": She had from him Amr - by whom he was given his Kunya -, Hubayra, and others. In \"Al-Siyar\": Amr, Ja'dah, Hani, and Yusuf.\n4. In \"Al-Isti'ab\": She embraced Islam on the Day of Conquest.\n5. In \"Al-Isti'ab\": Hubayra fled when Mecca was conquered to Najran, and he recited poetry apologizing for his flight. When he was informed that Umm Hani had embraced Islam, he recited poetry about her.\n6. Al-Dhahabi said in \"Al-Siyar\" (2/313): No one mentioned that Hubayra embraced Islam.\n7. In \"Al-Tabaqat\": Abu Sufyan bin Al-Harith married her, and she bore him Ja'far bin Abu Sufyan. In \"Al-Isabah\": Abu Ahmad Al-Askari said: She is the mother of Abdullah bin Abu Sufyan bin Al-Harith. Al-Daraqutni said the same in the book \"Al-Ikhwah\": Abu Sufyan bin Al-Harith married her, and she bore him Abdullah, and she did not narrate anything. It came in \"Usud Al-Ghabah\": The correct view is that Al-Mughira bin Nawfal bin Al-Harith married her. Al-Zubayr bin Bakkar said this.",
    "book_id": "26"
  },
  {
    "serial_number": "6208414",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 43,
    "volume_number": 1,
    "text": "* The Siblings from the children of Al-Harith bin Abd al-Muttalib; he was the eldest of his father's children and by him he was given his Kunya: 27 - Nawfal. ... 28 - And Rabi'ah. 29 - And Abu Sufyan. ... 30 - And Abdullah. 31 - And Umayyah. ... And their sister: 32 - Arwa; The children of Al-Harith bin Abd al-Muttalib.",
    "foot_note": "1. 27 - He embraced Islam on the Day of Badr. When he embraced Islam, the Prophet, peace be upon him, established brotherhood between him and Al-Abbas. \"Al-Tabaqat Al-Kubra\" (4/44), \"Al-Jarh wa Al-Ta'dil\" (8/487), \"Al-Isti'ab\" (3/537), \"Usud Al-Ghabah\" (5/369), \"Al-Siyar\" (1/199), \"Al-Isabah\" (6/479), \"Al-Tabyin fi Ansab Al-Qurashiyyin\" (80).\n28 - The cousin of the Prophet, peace be upon him, he has companionship. \"Al-Tabaqat Al-Kubra\" (4/74), \"Al-Tarikh Al-Kabir\" (3/283), \"Usud Al-Ghabah\" (2/209), \"Al-Siyar\" (1/257), \"Al-Isabah\" (2/461), \"Al-Tahdhib\" (3/253).\n29 - The cousin of the Prophet, peace be upon him, and his brother through breastfeeding; Halimah nursed both of them. \"Al-Tabaqat Al-Kubra\" (4/49), \"Al-Isti'ab\" (4/83), \"Usud Al-Ghabah\" (6/144), \"Al-Siyar\" (1/202), \"Al-Isabah\" (7/179).\n30 - The cousin of the Prophet, peace be upon him, he left Mecca as an emigrant before the Conquest and arrived in Medina. \"Al-Tabaqat Al-Kubra\" (4/48), \"Al-Isti'ab\" (2/279), \"Usud Al-Ghabah\" (3/207), \"Al-Isabah\" (4/47).\n31 - Ibn Hazm mentioned him in \"Jamharat Ansab Al-Arab\" (70) among the children of Al-Harith and said: He has no offspring. In \"Al-Tabyin fi Ansab Al-Qurashiyyin\" (79): Four of Al-Harith's children embraced Islam: Nawfal, Rabi'ah, Abu Sufyan, and Abdullah.\n32 - A female Companion, the cousin of the Prophet, peace be upon him. \"Al-Tabaqat Al-Kubra\" (8/50), \"Al-Isabah\" (7/479).",
    "book_id": "26"
  },
  {
    "serial_number": "6208415",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 44,
    "volume_number": 1,
    "text": "As for Nawfal, his Kunya is Abu Al-Harith (1), and he was older (2) than his uncles Hamza and Al-Abbas, and all his brothers. He was among those who remained steadfast (3) with the Prophet, peace be upon him, on the Day of Hunayn. He did not narrate anything (4), and he died two years (5) after the beginning of the caliphate of Umar bin Al-Khattab in Medina and was buried in Al-Baqi'. He is the grandfather of Babbah (6). As for Rabi'ah bin Al-Harith, his Kunya is Abu Arwa, and he was older (7) than his uncle Al-Abbas. He narrated",
    "foot_note": "1. Ibn Sa'd said: Nawfal had children: Al-Harith - by whom he was given his Kunya, and he was a man during the time of the Messenger of Allah -, Abdullah, Abd al-Rahman, Sa'id, and Al-Mughira... and Nawfal has many descendants in Medina, Basra, and Baghdad.\n2. In \"Al-Isabah\": Al-Zubayr bin Bakkar said: He was the oldest of Banu Hashim to embrace Islam, even older than his uncles Hamza and Al-Abbas.\n3. Ibn Sa'd said: Nawfal witnessed the Conquest of Mecca, Hunayn, and Ta'if with the Messenger of Allah, peace be upon him. He remained steadfast on the Day of Hunayn, being on his right side that day, and he aided the Messenger of Allah on the Day of Hunayn with three thousand spears.\n4. Al-Hafiz mentioned a hadith for him in \"Al-Isabah\" and said: Ibn Qani' and Ibn Al-Sakan narrated it, and there is weakness in its chain. This was mentioned in the biography of Al-Mughira bin Nawfal. Al-Daraqutni said in the book \"Al-Ikhwah\": Nawfal bin Al-Harith died in the caliphate of Umar, two years after it began, in Medina, and he did not narrate anything. In \"Al-Siyar\": I do not know of any narration for him.\n5. In \"Al-Tabaqat\": Nawfal died one year and three months after Umar became caliph. Umar prayed over him, followed him to Al-Baqi', and he was buried there.\n6. He is Abdullah bin Al-Harith bin Nawfal Abu Muhammad Al-Madani, nicknamed (Babbah), the governor of Basra. He saw the Prophet. Ibn Abd al-Barr said: They agreed on his reliability. He died in the year 79, and it is said: 84 / A. See \"Nuzhat Al-Albab\" (323).\n7. In \"Al-Tabaqat\" and \"Al-Siyar\" they said: Rabi'ah bin Al-Harith was older than his uncle Al-Abbas by two years.",
    "book_id": "26"
  },
  {
    "serial_number": "6208416",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 45,
    "volume_number": 1,
    "text": "from (1) the Prophet, peace be upon him. His son Abd al-Muttalib bin Rabi'ah and Abdullah bin Al-Harith bin Nawfal narrated from him. The Prophet, peace be upon him, gave him (2) one hundred Wasq from Khaybar every year. He died during the caliphate of Umar bin Al-Khattab (3). As for Abu Sufyan bin Al-Harith, his name was Al-Mughira (4). He embraced Islam and practiced it well (5). He remained steadfast (6) with the Prophet, peace be upon him, on the Day of Hunayn, and the Prophet, peace be upon him, said to him that day: \"Abu Sufyan is from the best of my family\" (7). He narrated a hadith from the Prophet, peace be upon him, which Shu'bah narrates from Simak bin Harb: Yahya bin Muhammad bin Sa'id told us, Ahmad bin Sayyar Al-Marwazi told us, (H) and told us",
    "foot_note": "1. In \"Tahdhib Al-Kamal\" and \"Al-Tahdhib\": He narrated from his cousin Al-Fadl bin Abbas.\n2. As in \"Al-Tabaqat\". In \"Al-Isabah\": Al-Daraqutni said in the book \"Al-Ikhwah\": The Prophet, peace be upon him, gave him one hundred Wasq from Khaybar every year, and Al-Zubayr said the same.\n3. In \"Al-Tabaqat\": He died in the caliphate of Umar in Medina after his brothers Nawfal and Abu Sufyan bin Al-Harith.\n4. In \"Al-Siyar\": Hisham Al-Kalbi and Al-Zubayr named him Mughira. A group said: His name is his Kunya, and Al-Mughira is actually their brother.\n5. In \"Al-Siyar\": He met the Prophet, peace be upon him, on the road before he entered Mecca as a Muslim. The Prophet, peace be upon him, was annoyed and turned away from him because of his past harm to the Prophet, peace be upon him. He humbled himself to the Prophet until he softened, then his Islam became good.\n6. In \"Sahih Muslim\" (3/1398): His hand did not leave the bridle of the Messenger of Allah's mule until the people turned to him.\n7. Narrated by Al-Tabarani in \"Al-Kabir\" (22/327) from Abu Habbah Al-Badri. Al-Haythami said in \"Majma' Al-Zawa'id\" (9/274): Al-Tabarani narrated it in \"Al-Kabir\" and \"Al-Awsat\" and its chain is Hasan. I say: Rather, its chain contains Ali bin Zaid bin Jud'an; Al-Hafiz said about him in \"Al-Taqrib\": Weak. But it has another path in \"Mustadrak Al-Hakim\" (3/255).",
    "book_id": "26"
  },
  {
    "serial_number": "6208417",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 46,
    "volume_number": 1,
    "text": "Ahmad bin Ali bin Al-Ala told us, Al-Qasim bin Muhammad Al-Marwazi told us, they said: Abdan told us, my father told us, from Shu'bah, from Simak bin Harb who said: I was with Mudrik bin Al-Muhallab in Sijistan in his canopy, and I heard an old man narrating from Abu Sufyan bin Al-Harith, saying: The Messenger of Allah, peace be upon him, said (1): \"Allah does not sanctify a nation where the weak does not take his right from the strong without hesitation.\" Abu Sufyan bin Al-Harith died in the year twenty (2), and Umar bin Al-Khattab prayed over him. As for Abdullah bin Al-Harith bin Abd al-Muttalib; he embraced Islam and his name was Abd Shams, so the Messenger of Allah, peace be upon him, named him (3) Abdullah! He died (4) during the time of the Messenger of Allah, peace be upon him, and he has no offspring and no narration (5).",
    "foot_note": "1. Al-Hafiz said in \"Al-Isabah\" (7/180): A hadith was attributed to him which Al-Daraqutni narrated in the book \"Al-Ikhwah\" and Ibn Qani'... then he mentioned it and said: Its chain is authentic were it not for this Sheikh who was not named. I say: Al-Hakim (3/256) and Al-Bayhaqi (10/93) narrated it from his hadith. It has several supporting evidences, including from Ja'far in Ibn Majah (4010), Ibn Hibban (5058), and Abu Ya'la (2003) with a Hasan chain in corroboration.\n2. In \"Al-Tabaqat\": Abu Sufyan died in Medina after his brother Nawfal bin Al-Harith by four months less thirteen nights. It is said: Rather, he died in the year twenty and Umar bin Al-Khattab prayed over him. Al-Hafiz said in \"Al-Isabah\": It is said: He died in the year fifteen in the caliphate of Umar and he prayed over him, and it is said: in the year twenty. Al-Daraqutni mentioned him in the book \"Al-Ikhwah\".\n3. As in \"Al-Tabaqat Al-Kubra\". In \"Al-Isabah\": His name was Abd Shams, so the Prophet, peace be upon him, changed it.\n4. It is narrated in \"Al-Tabaqat\": That he went out with the Messenger in some of his expeditions and died at Al-Safra, so the Prophet, peace be upon him, buried him in his shirt - meaning the Prophet's shirt - and the Prophet, peace be upon him, said: \"He is happy, happiness overtook him.\"\n5. In \"Al-Isabah\" after quoting Al-Daraqutni's statement: His sheikh Al-Baghawi said the same before him.",
    "book_id": "26"
  },
  {
    "serial_number": "6208418",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 47,
    "volume_number": 1,
    "text": "As for Umayyah bin Al-Harith, he has no offspring and no narration. As for Arwa bint Al-Harith bin Abd al-Muttalib, Abu Wada'ah (1) bin Dubayrah (2) Al-Sahmi married her, and she bore (3) sons: Al-Muttalib, Abu Sufyan, and Al-Rab'ah; the children of Abu Wada'ah. Her son Al-Muttalib (4) narrated from the Prophet (5), peace be upon him. * * * * *",
    "foot_note": "1. In \"Al-Isabah\": He and his son Al-Muttalib embraced Islam at the Conquest, and his name is Al-Harith. \"Al-Isabah\" (7/458).\n2. In \"Al-Tabaqat\" and \"Al-Isabah\" it says: Sabrah. But in \"Usud Al-Ghabah\" and \"Al-Isti'ab\" it says: Sabirah. The correct spelling is what I established. See \"Tabsir Al-Muntabih\" (3/831).\n3. In \"Al-Tabaqat\": She bore him Al-Muttalib, Abu Sufyan, Umm Jamil, Umm Hakim, and Al-Rab'ah, the children of Abu Wada'ah.\n4. Al-Hafiz said in \"Al-Isabah\" (6/132): Ibn Sa'd mentioned him among the Muslims of the Conquest. Al-Waqidi said: He settled in Medina, built a house there, and remained for a long time.\n5. His hadith was narrated by Al-Nasa'i (2/160), Ahmad (3/420), (4/215), Abd al-Razzaq in \"Al-Musannaf\" (3/339), and Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (2/110) with the wording from Al-Muttalib: He said: I saw the Messenger of Allah, peace be upon him, prostrate in [Surah] Al-Najm and the people prostrated with him... And another hadith: I saw the Messenger of Allah praying facing the Black Stone... Narrated by Abu Dawood (2/211) (No. 2016), Al-Nasa'i (3/67), (5/235), Ibn Majah (2/386), and Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (2/110) (No. 814).",
    "book_id": "26"
  },
  {
    "serial_number": "6208419",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 48,
    "volume_number": 1,
    "text": "* The Siblings from the children of Al-Abbas bin Abd al-Muttalib: 33 - Al-Fadl. ... 34 - And Abdullah. ... 35 - And Ubaydullah. 36 - And Qutham. ... 37 - And Ma'bad. ... 38 - And Abd al-Rahman.",
    "foot_note": "1. 33 - The cousin of the Prophet, peace be upon him, and the eldest son of Al-Abbas. He was martyred during the caliphate of Umar. \"Tabaqat Ibn Sa'd\" (4/54, 7/399), \"Al-Tarikh Al-Kabir\" (7/114), \"Al-Ahad wa Al-Mathani\" (1/281), \"Usud Al-Ghabah\" (4/366), \"Al-Siyar\" (3/444), \"Al-Isabah\" (5/375), \"Al-Tahdhib\" (8/270).\n34 - He was called the Sea (Al-Bahr) and the Scholar (Al-Hibr) due to the vastness of his knowledge. Ibn Umar said: If Ibn Abbas had reached our age, none of us would have been able to associate with him [due to his superior knowledge]. He is one of the prolific narrators among the Companions and one of the 'Abdullahs' (Abadilah) among the jurists of the Companions. \"Tabaqat Ibn Sa'd\" (2/365), \"Al-Tarikh Al-Kabir\" (5/3), \"Al-Jarh wa Al-Ta'dil\" (5/116), \"Al-Ahad wa Al-Mathani\" (1/284), \"Usud Al-Ghabah\" (3/290), \"Al-Siyar\" (3/331), \"Al-Isabah\" (4/141), \"Al-Tahdhib\" (5/276).\n35 - From the younger Companions, he was generous and giving. \"Al-Ma'rifah wa Al-Tarikh\" (3/322), \"Usud Al-Ghabah\" (3/524), \"Al-Ahad wa Al-Mathani\" (1/296), \"Al-Siyar\" (3/512), \"Tahdhib Al-Kamal\" (2/789), \"Al-Isabah\" (4/396), \"Al-Tahdhib\" (7/19).\n36 - Qutham - with a Damma on the Qaf and Fatha on the Tha - a young Companion who died in the year fifty-seven. \"Al-Tabaqat Al-Kubra\" (7/367), \"Al-Tarikh Al-Kabir\" (7/194), \"Al-Jarh wa Al-Ta'dil\" (7/145), \"Al-Ahad wa Al-Mathani\" (1/294), \"Usud Al-Ghabah\" (4/392), \"Al-Siyar\" (3/440), \"Al-Isabah\" (5/420), \"Al-Tahdhib\" (8/361).\n37 - From the younger children of Abbas. \"Usud Al-Ghabah\" (5/220), \"Al-Siyar\" (3/442), \"Al-Isabah\" (6/236).\n38 - In \"Al-Isabah\": One of the brothers. Mus'ab Al-Zubayri said: He was born during the time of the Prophet, peace be upon him, and was martyred in Ifriqiya. \"Usud Al-Ghabah\" (3/466), \"Al-Isabah\" (5/40).",
    "book_id": "26"
  },
  {
    "serial_number": "6208420",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 49,
    "volume_number": 1,
    "text": "39 - And Umm Habib (1); their mother (2) is Umm Al-Fadl (3) Lubabah bint Al-Harith bin Hazn Al-Hilaliyyah. 40 - And Tammam. ... 41 - And Kathir. The sons of Al-Abbas from a (4) mother of a child (Umm Walad).",
    "foot_note": "1. 39 - In \"Al-Isabah\": Umm Habib or Umm Habibah, the former is more famous. She saw the Prophet. \"Al-Tabaqat Al-Kubra\" (8/49), \"Usud Al-Ghabah\" (7/313), \"Al-Isabah\" (8/186).\n1. In \"Al-Isabah\": Abu Umar said: Her mother is Umm Al-Fadl, so she is the full sister of Al-Fadl and Abdullah.\n2. In \"Al-Siyar\" (2/314): The wife of Al-Abbas and the mother of his six noble male children.\n3. She is the sister of the Mother of the Believers Maymunah, the maternal aunt of Khalid bin Al-Walid, and the maternal sister of Asma bint Umays. She died after Al-Abbas during the caliphate of Uthman. \"Al-Tabaqat Al-Kubra\" (8/277), \"Usud Al-Ghabah\" (7/253), \"Al-Siyar\" (2/314), \"Al-Isabah\" (8/276), \"Al-Tahdhib\" (12/449).\n40 - Al-Hafiz said in \"Al-Isabah\" (1/375): Ibn Al-Sakan said: It is said: He was the youngest of his brothers and the most physically powerful of Quraysh. No narration from the Prophet, peace be upon him, is preserved for him via a confirmed route. \"Al-Tarikh Al-Kabir\" (2/157), \"Usud Al-Ghabah\" (1/253), \"Al-Siyar\" (3/443), \"Al-Isabah\" (1/375), \"Ta'jil Al-Manfa'ah\" (43).\n41 - Al-Dhahabi said in \"Al-Siyar\": He was a jurist, majestic, righteous, and trustworthy. He had no offspring. In \"Al-Isabah\": Al-Daraqutni said in the book \"Al-Ikhwah\": He narrated Mursal hadiths from the Prophet, peace be upon him. \"Al-Tarikh Al-Kabir\" (7/207), \"Al-Jarh wa Al-Ta'dil\" (7/153), \"Usud Al-Ghabah\" (4/460), \"Al-Siyar\" (3/443), \"Al-Isabah\" (5/634), \"Al-Tahdhib\" (8/420).\n4. Ibn Al-Athir said in \"Usud Al-Ghabah\" (1/253) in the biography of Tammam: His mother was a Roman Umm Walad, and Kathir is his full brother. Al-Hafiz said in \"Al-Isabah\" (1/375) in the biography of Tammam: His mother was an Umm Walad, and said in the biography of Kathir (5/634): His mother was Roman, and it is said: Himyari.",
    "book_id": "26"
  },
  {
    "serial_number": "6208421",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 50,
    "volume_number": 1,
    "text": "42 - And Al-Harith bin Al-Abbas, his mother was from Hudhayl (1). 43 - And Amina. 44 - And Safiyyah. 45 - And Umm Kulthum; daughters of Al-Abbas from mothers of children (Umm Walad). Hisham Ibn Al-Kalbi said: 46 - And Subayh. 47 - And Mushir, sons of Al-Abbas, but he was not followed in that.",
    "foot_note": "1. 42 - Al-Hafiz said in \"Al-Isabah\" (2/151): Abu Umar said: All of Al-Abbas's children saw the Prophet, but companionship is for Al-Fadl and Abdullah. It is said: His father got angry with him and expelled him, so he joined Al-Zubayr, who then came and interceded for him with his maternal uncle Al-Abbas. \"Usud Al-Ghabah\" (1/401).\n1. Ibn Al-Athir said in \"Usud Al-Ghabah\" (1/401): His mother was a woman from Hudhayl. In \"Al-Isabah\" (2/151): His mother was Hujayla bint Jundab bin Al-Rabi' Al-Hilaliyyah, and it is said: an Umm Walad.\n43 - Al-Hafiz said in \"Al-Isabah\" (7/533): Al-Daraqutni mentioned her in \"Al-Ikhwah\" and said: Al-Abbas bin Utbah bin Abi Lahab married her, and she bore him Al-Fadl bin Al-Abbas, the famous poet.\n44 - Ibn Al-Athir did not mention her in \"Usud Al-Ghabah\" nor Al-Hafiz in \"Al-Isabah\". She was mentioned in \"Al-Tabaqat Al-Kubra\" (4/6) in the biography of her father Al-Abbas, and also in \"Jamharat Ansab Al-Arab\" (265), stating she was the wife of Al-Harith bin Ya'mar.\n45 - In \"Usud Al-Ghabah\" (7/385): She lived during the time of the Prophet, peace be upon him, and her mother was Umm Salamah bint Mahmiyah bin Jaz' Al-Zubayri! This is what he said, but Al-Hafiz pointed out in \"Al-Isabah\" (8/295) that the one whose mother is Umm Salamah is Umm Kulthum bint Al-Fadl bin Al-Abbas.\n46 - Al-Hafiz said in \"Al-Isabah\" (1/376): The brothers are ten: Al-Fadl, Abdullah, Ubaydullah, Qutham, Ma'bad, Abd al-Rahman, Kathir, Subayh, Mushir, and Tammam. All are agreed upon except the eighth and ninth, as Hisham Al-Kalbi was unique in mentioning them. Al-Daraqutni said in \"Al-Ikhwah\": He is not followed in this.\n47 - Al-Hafiz said in \"Al-Isabah\" (6/260): Abu Bakr bin Durayd counted him among the children of Al-Abbas, and Ibn Fathun added him. Perhaps he was born after Tammam.",
    "book_id": "26"
  },
  {
    "serial_number": "6208422",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 51,
    "volume_number": 1,
    "text": "Ibrahim Al-Harbi said: 48 - And Lubabah. 49 - And Aminah. Ibn Makhlad narrated this to us from him. As for Al-Fadl; his Kunya is Abu Abdullah (1), and it is said: Abu Muhammad (2). He is the 'Rider' (Al-Ridif) (3). He narrated from the Prophet, peace be upon him. His father (4) Al-Abbas bin Abd al-Muttalib, his brother Abdullah, Abu Hurairah, Abu Al-Tufayl and others narrated from him. The time (5) of his death is disputed; it is said: he was killed during the caliphate of Abu Bakr on the Day of Yarmouk, and it is said: on the Day of Ajnadayn, and it is said: on the Day of Marj Al-Suffar. And it is said: during the caliphate (6) of Umar in",
    "foot_note": "1. 48 - I did not find her biography.\n49 - She was mentioned in \"Al-Tabaqat Al-Kubra\" (4/6) in the biography of her father Al-Abbas under the name Umaymah.\n1. Al-Hafiz said in \"Al-Isabah\": His Kunya was Abu Al-Abbas and Abu Abdullah, and it is said: his Kunya was Abu Muhammad, Ibn Al-Sakan asserted this.\n2. Ibn Sa'd used this Kunya for him in \"Al-Tabaqat\" and Ibn Abi Asim in \"Al-Ahad\".\n3. It came in the \"Two Sahihs\" and others: That the Prophet, peace be upon him, had him ride behind him during the Farewell Pilgrimage, and he was the one looking at the woman from Khath'am while the Messenger of Allah, peace be upon him, turned his face to the other side... \"Sahih Al-Bukhari\" Book of Hajj (3/378), \"Sahih Muslim\" (2/973).\n4. I did not find anyone who said: that his father narrated from him. See \"Tahdhib Al-Kamal\" (2/1099 - Manuscript section).\n5. Al-Hafiz said in \"Al-Isabah\" (5/376): Al-Waqidi said: He died in the Plague of Amwas, and Al-Zubayr and Ibn Abi Hatim followed him. Ibn Al-Sakan said: He was killed on the Day of Ajnadayn during the caliphate of Abu Bakr, and it is said: Yarmouk.\n6. Ibn Sa'd said (4/54): He died in the region of Jordan during the caliphate of Umar. Al-Hafiz said: The first view is the relied upon one, and Al-Bukhari asserted it, saying: He died during the caliphate of Umar bin Al-Khattab. Ibn Abi Asim said in \"Al-Ahad wa Al-Mathani\" (1/281): He died at the age of twenty-one =",
    "book_id": "26"
  },
  {
    "serial_number": "6208423",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 52,
    "volume_number": 1,
    "text": "the Plague of Amwas in the Levant in the year eighteen, and Allah knows best. He did not leave any children except Umm Kulthum (1), his daughter. Al-Hasan bin Ali bin Abi Talib married her, then separated from her (2). Then Abu Musa Al-Ash'ari married her, and she bore him Musa (3). He died leaving her a widow, so Imran bin Talha bin Ubaydullah married her. It is said: He left a son called Abdullah, but this is not proven. As for Abdullah bin Al-Abbas; his Kunya is Abu Al-Abbas. He was born in the She'b (4) before Banu Hashim left it, which was three years before the Hijra. The Prophet, peace be upon him, died when he was thirteen (5), and it is said: he was fifteen (6) at the death of the Prophet, peace be upon him. The Prophet, peace be upon him, prayed for him that",
    "foot_note": "1. = years old in the Plague of Amwas. And they say: He was killed at Ajnadayn in the year thirteen.\n1. Ibn Sa'd said in \"Al-Tabaqat\": Al-Fadl had Umm Kulthum born to him and no one else.\n2. In \"Usud Al-Ghabah\", this was attributed to Umm Kulthum bint Al-Abbas, but Al-Hafiz corrected that in \"Al-Isabah\" (8/295-296) saying: All of this refers to Umm Kulthum bint Al-Fadl bin Al-Abbas. The story of Al-Fadl marrying the daughter of Mahmiyah is established in \"Sahih Muslim\". The story of Abu Musa marrying Umm Kulthum bint Al-Fadl bin Al-Abbas is established in \"Tabaqat Ibn Sa'd\". See \"Al-Tabaqat\" (6/296).\n3. Al-Hafiz said in \"Tahdhib Al-Tahdhib\" (10/373) in the biography of Musa bin Abi Musa: Abu Nu'aym Al-Asbahani mentioned him in his \"Tarikh\" and said: His mother is Umm Kulthum bint Al-Fadl.\n4. Al-Dhahabi said in \"Al-Siyar\" (3/335): Al-Waqidi said: There is no disagreement that he was born in the She'b (ravine) while Banu Hashim were besieged before they came out of it.\n5. In \"Al-Siyar\": Al-Zubayr bin Bakkar said: The Messenger of Allah, peace be upon him, died when Ibn Abbas was thirteen years old.\n6. Al-Tayalisi narrated in his \"Musnad\" - as in \"Al-Minhah\" (2/148) -, Ahmad in \"Al-Musnad\" (1/373), Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/284) (No. 372, 373) =",
    "book_id": "26"
  },
  {
    "serial_number": "6208424",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 53,
    "volume_number": 1,
    "text": "Allah gives him understanding (1) in the religion and teaches him interpretation (Ta'wil). His virtues are many, as is his narration. He died in Ta'if in the year sixty-eight (2), and Muhammad bin Al-Hanafiyyah prayed over him (3). Ibn Umar, Jabir, Abu Sa'id, Anas bin Malik, Abu Al-Tufayl, and others narrated from him. As for Ubaydullah bin Al-Abbas, his Kunya is Abu Muhammad. He was younger (4) in age than his brother Abdullah by a year. He narrated from the Prophet, peace be upon him, and Sulayman bin Yasar narrated from him. Ali appointed him governor over Yemen,",
    "foot_note": "1. = Al-Hakim (3/533) and Al-Tabarani (10/289), all of them via Shu'bah from Abu Ishaq from Sa'id bin Jubayr from Ibn Abbas who said: The Messenger of Allah died when I was fifteen years old and I had been circumcised. All its narrators are trustworthy. Al-Hafiz said in \"Al-Fath\" (11/76): The preserved and correct view is: He was born in the She'b three years before the Hijra, so he would be thirteen years old at the Prophet's death. The biographers were certain of this, and Ibn Abd al-Barr authenticated it.\n1. Narrated by Ahmad in \"Al-Musnad\" (1/266, 314, 335), Al-Fasawi in his \"Tarikh\" (1/494), Ibn Abi Shaybah in \"Al-Musannaf\" (12/111), Ibn Sa'd in \"Al-Tabaqat\" (2/365), Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/287), Al-Hakim in \"Al-Mustadrak\" (3/534), and Al-Tabarani in \"Al-Kabir\" (10/293), all via Ibn Abbas who said: I spent the night in the house of my aunt Maymunah, and I placed water for the Prophet, peace be upon him, for ablution. He said: \"Who placed this?\" They said: Abdullah. He said: \"O Allah, teach him interpretation and give him understanding in the religion.\" The hadith also has other paths and wordings.\n2. Al-Dhahabi said in \"Al-Siyar\": Ali bin Al-Madini said: Ibn Abbas died in the year sixty-eight or sixty-seven. Al-Waqidi, Al-Haytham, and Abu Nu'aym said: Year sixty-eight. It is said: He lived seventy-one years. In \"Al-Isabah\" (4/152): They agreed that he died in Ta'if in the year sixty-eight.\n3. In \"Al-Isabah\": Al-Zubayr bin Bakkar said: He died in Ta'if, and Ibn Al-Hanafiyyah prayed over him.\n4. Al-Hafiz said in \"Al-Isabah\" (4/396): He was younger than Abdullah by a year. Mus'ab, Ibn Sa'd, Al-Zubayr, and Ya'qub bin Shaybah said this.",
    "book_id": "26"
  },
  {
    "serial_number": "6208425",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 54,
    "volume_number": 1,
    "text": "and he was generous and giving (1). He died in Medina (2). As for Qutham bin Al-Abbas, the Prophet, peace be upon him, had him ride behind him (3), and he resembled (4) the Prophet, peace be upon him. Ali bin Abi Talib appointed him governor over Medina (5). Ali, peace be upon him, said: The person with the most recent contact (6) with the Messenger of Allah, peace be upon him, is Qutham bin Al-Abbas. He narrated from the Prophet, peace be upon him. Abu (7) Ishaq Al-Sabi'i narrated from him, saying: I said to Qutham bin Al-Abbas: By what did Ali inherit from the",
    "foot_note": "1. In \"Al-Asl\": 'an old man' (Shaykhan), and the correct word is what is in \"Al-Isabah\": Al-Zubayr said: He was generous and giving (Sakhiyan Jawadan)... and Ali appointed him over Yemen, and he led the people in Hajj in the year thirty-six. See \"Tarikh Khalifah bin Khayyat\" (200).\n2. In \"Al-Isabah\": Khalifah said (225): He died in the year fifty-eight in Medina. Al-Waqidi said: He lived until the time of Yazid bin Mu'awiyah, and Abu Nu'aym asserted this. Abu Ubaydah and Ya'qub bin Shaybah said: He died in the year eighty-seven.\n3. Narrated by Ahmad in his \"Musnad\" (1/205), and Al-Bukhari in his \"Tarikh\" (7/197) from Abdullah bin Ja'far.\n4. In \"Al-Isabah\": Ibn Al-Sakan and others said: He used to resemble the Prophet, peace be upon him.\n5. Al-Dhahabi said in \"Al-Siyar\": Al-Zubayr bin Bakkar said: Ali appointed him over Medina. Khalifah said in his \"Tarikh\" (210): He governed Mecca for Ali and remained its governor until Ali was killed. Al-Hafiz said in \"Al-Tahdhib\": Ibn Abd al-Barr said: He governed Mecca for Ali. Al-Daraqutni asserted in the book \"Al-Ikhwah\" that Ali appointed him over Medina and appointed his brother Ma'bad over Mecca.\n6. Narrated by Ahmad in \"Al-Musnad\" (1/101), and Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/295) from Ali, may Allah be pleased with him, who said: The last of the people to have contact with the Messenger of Allah, peace be upon him, was Qutham bin Al-Abbas - meaning in his grave.\n7. In \"Al-Asl\": Abi (Genitive case), [Corrected to Abu (Nominative)].",
    "book_id": "26"
  },
  {
    "serial_number": "6208426",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 55,
    "volume_number": 1,
    "text": "Prophet, peace be upon him? He said (1): He was the first of us to join him and the closest of us to stick to him. Qays and Isra'il reported this from Abu Ishaq. Qutham was martyred (2) in Samarkand during the time of Mu'awiyah, and his grave is there. As for Ma'bad, Ali appointed him governor over Mecca (3), and he was killed as a martyr in Ifriqiya (4), and he has no narration. Among his descendants are Ibrahim and Abbas, the sons of Abdullah (5)... * * * * *",
    "foot_note": "1. Narrated by Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/294) (No. 399), Al-Tabarani (19/40) (No. 85, 86), and Al-Hakim in \"Al-Mustadrak\" (3/125) via Abu Ishaq Al-Sabi'i who said: We entered upon Qutham... wording of Ibn Abi Asim. Narrated by Al-Nasa'i in \"Khasa'is Ali\" (124) (No. 108) via Abu Ishaq who said: Abd al-Rahman bin Khalid asked Qutham bin Al-Abbas... See \"Khasa'is Ali\" with notes by Dr. Ahmad Mirin.\n2. Mus'ab Al-Zubayri said in \"Nasab Quraysh\" (27): He was martyred in Samarkand; he went out with Sa'id bin Uthman in the time of Mu'awiyah.\n3. Al-Hafiz said in \"Al-Isabah\": Al-Daraqutni mentioned in the book \"Al-Ikhwah\": That Ali appointed him governor of Mecca.\n4. In \"Al-Isabah\": He was martyred in Ifriqiya during the caliphate of Uthman in the year thirty-five. It is said: He was martyred there after that during the caliphate of Mu'awiyah.\n5. In \"Al-Siyar\": He had children: Abdullah, Abbas, and Maymunah. I say: He [the author] means, may Allah have mercy on him, the children of Abdullah bin Ma'bad bin Abbas.",
    "book_id": "26"
  },
  {
    "serial_number": "6208427",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 56,
    "volume_number": 1,
    "text": "* [The Siblings from the descendants of Abu Bakr Al-Siddiq]: . . . . . . Rahman (1), and Abu Atiq's name is Muhammad; he is the grandfather of Abd al-Rahman and Muhammad, the sons of Abdullah bin Muhammad bin Abd al-Rahman bin Abu Bakr, and Sulayman bin Bilal their freed slave. As for: 50 - Abdullah bin Abd al-Rahman bin Abu Bakr; his mother is Quraybah (2) Al-Sughra bint Abi Umayyah bin Al-Mughira. His maternal aunt is Umm Salamah, the wife of the Prophet, peace be upon him, and his paternal aunt is Aisha. He narrates from his aunt Umm Salamah. Zaid bin Abdullah bin Umar bin Al-Khattab and others narrated from him. As for: 51 - Ismail bin Abd al-Rahman bin Abu Bakr; he narrated from his aunt Aisha from the Prophet, peace be upon him: \"The Hijr is part of the House\" (3). Al-Qasim bin Muhammad narrated from him.",
    "foot_note": "1. There is an omission here in the original manuscript - and I pointed it out in the Introduction - which is regarding the children of Abu Bakr Al-Siddiq, may Allah be pleased with him. See the descendants of Abu Bakr in the book \"Nasab Quraysh\" by Mus'ab Al-Zubayri (275-280), in \"Jamharat Ansab Al-Arab\" (136-140), and \"Al-Tabyin fi Ansab Al-Qurashiyyin\" (269-281). The title in brackets is an addition from me for clarification.\n50 - Maqbul (Acceptable) from the third generation, died after the seventies / Kh, M, Khd, S, Q. \"Al-Tabaqat Al-Kubra\" (5/194), \"Al-Tahdhib\" (5/291).\n2. Ibn Sa'd said in \"Al-Tabaqat\" (8/262): She embraced Islam and pledged allegiance. Abd al-Rahman bin Abu Bakr married her, and she bore him Abdullah, Umm Hakim, and Hafsa. \"Usud Al-Ghabah\" (7/242), \"Al-Isabah\" (8/81).\n51 - I did not find the biography of Ismail.\n3. I did not find the hadith via Ismail. The hadith was narrated by Al-Bukhari, Book of Hajj (3/439), Muslim, Book of Hajj (2/973) (No. 134) and others via Al-Aswad bin Yazid. It has many paths from Aisha; see them in \"Irwa' Al-Ghalil\" (4/305) (No. 1106).",
    "book_id": "26"
  },
  {
    "serial_number": "6208428",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 57,
    "volume_number": 1,
    "text": "Ibn Lahi'ah said from Abu Al-Aswad from Al-Qasim bin Muhammad that his brother Abdullah bin Muhammad bin Abu Bakr and Ismail bin Abd al-Rahman bin Abu Bakr told him that from Aisha. As for: 52 - Hafsa bint Abd al-Rahman; she is the wife of Al-Mundhir (1) bin Al-Zubayr bin Al-Awwam (2). She narrated from her father, Umm Salamah, and Aisha. Yusuf bin Mahak, Irak bin Malik, and others narrated from her. As for: 53 - Asma bint Abd al-Rahman; she is the wife of Al-Qasim (3) bin Muhammad bin Abu Bakr. She narrated from Aisha and her brother Abdullah bin Abd al-Rahman. Her son Abd al-Rahman (4) bin Al-Qasim bin Muhammad and Abdullah bin Abi Mulaykah narrated from her. * * * * *",
    "foot_note": "1. 52 - Trustworthy from the third generation / M, D, T, Q. \"Al-Tabaqat Al-Kubra\" (8/468), \"Al-Tahdhib\" (12/410).\n1. In \"Al-Tabaqat\" (8/468): She bore him Abd al-Rahman, Ibrahim, and Quraynah. Then after Al-Mundhir, Husayn bin Ali bin Abi Talib married her.\n53 - Maqbulah (Acceptable) from the third generation / Khd. \"Al-Tabaqat Al-Kubra\" (8/469), \"Al-Tahdhib\" (12/398).\n2. Trustworthy, one of the jurists of Medina. \"Al-Tahdhib\" (8/333).\n3. In \"Al-Tabaqat\" (8/469): Al-Qasim married her and she bore him Abd al-Rahman bin Al-Qasim and Umm Farwah.",
    "book_id": "26"
  },
  {
    "serial_number": "6208429",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 58,
    "volume_number": 1,
    "text": "* The Siblings from the children of Al-Khattab bin Nufayl bin Abd al-Uzza bin Riyah (1) bin Abdullah bin Qurt (2) bin Rizah (3) bin Adi bin Ka'b: 54 - Umar. ... 55 - And Zaid. ... 56 - And Safiyyah. 57 - And Umaymah, who is Umm Jamil, and it is said: her name is Fatimah; the children of Al-Khattab. As for Umar; his Kunya is Abu Hafs. He witnessed all the battles with the Prophet, peace be upon him. His virtues and news are very numerous. His mother and the mother of his two sisters is Hantamah bint Hashim (4) - possessor",
    "foot_note": "1. With a double-dotted Ya (Riyah).\n2. With a Damma on the Qaf and Sukun on the Ra followed by a Ta (Qurt).\n3. With a Ra and a light Zay (Rizah).\n54 - Commander of the Faithful, martyred in Dhu al-Hijjah in the year twenty-three. He held the caliphate for ten and a half years. \"Al-Tabaqat Al-Kubra\" (3/265), \"Al-Tarikh Al-Kabir\" (6/138), \"Al-Jarh wa Al-Ta'dil\" (6/105), \"Al-Ahad wa Al-Mathani\" (1/95), \"Usud Al-Ghabah\" (4/145), \"Al-Isabah\" (4/588), \"Al-Tahdhib\" (7/438).\n55 - He was older than his brother Umar and embraced Islam before him. He was martyred at Yamama in the year twelve / Kht, M, D. \"Tabaqat Ibn Sa'd\" (3/37), \"Al-Jarh wa Al-Ta'dil\" (3/562), \"Al-Ahad wa Al-Mathani\" (1/233), \"Usud Al-Ghabah\" (2/285), \"Al-Siyar\" (1/297), \"Al-Isabah\" (2/604), \"Al-Tahdhib\" (3/411).\n56 - In \"Al-Isabah\" (7/742): Al-Daraqutni mentioned her in the book \"Al-Ikhwah\" and said: Sufyan bin Abd al-Asad married her and she bore him Al-Aswad. It was previously mentioned in [the bio of] Qudamah bin Maz'un that he married her. Abu Ali Al-Ghassani added her and said: Abu Umar mentioned her under Qudamah but did not give her a separate entry. End.\n57 - She has a biography in \"Usud Al-Ghabah\" (7/220), \"Al-Isabah\" (8/62).\n4. As in \"Al-Tabaqat Al-Kubra\" and \"Tabaqat Khalifah\" and other previous sources. =",
    "book_id": "26"
  },
  {
    "serial_number": "6208430",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 59,
    "volume_number": 1,
    "text": "of the two spears (1) - bin Al-Mughira bin Abdullah bin Amr bin Makhzum. He narrated from the Prophet, peace be upon him, and from Abu Bakr. Abu Bakr, Uthman, Ali, Talha, Al-Zubayr, Sa'd, Sa'id, Abd al-Rahman, Ibn Masud, and a large number of Muhajirin and Ansar and others from the Companions of the Prophet, peace be upon him, narrated from him. As for Zaid bin Al-Khattab, his mother is Asma bint Wahb from Banu Asad bin Khuzaymah. He witnessed (2) Badr and Uhud (3) with the Prophet, peace be upon him, and narrated from the Prophet, peace be upon him. His nephew Abdullah bin Umar narrated from him. Zaid was killed as a martyr on the Day of Yamama (4). Al-Husayn bin Ismail (5) told us, Sa'id Al-Umawi told us, my father told us, Ja'far bin Burqan told us, from Al-Zuhri, from Salim, from his father, from Zaid bin Al-Khattab that the Prophet, peace be upon him, forbade killing the household",
    "foot_note": "1. = It came in \"Al-Mu'jam Al-Kabir\" by Al-Tabarani (1/18) and \"Ma'rifat Al-Sahabah\" by Abu Nu'aym (1/191): From Abu Ishaq: That her name is Hantamah bint Hisham, and he said: Hantamah was the sister of Abu Jahl. Ibn Abd al-Barr criticized this in \"Al-Isti'ab\" (2/458), and Al-Hafiz pointed this out in \"Al-Fath\" (7/44) and in \"Al-Isabah\" and preferred that she is Hantamah bint Hashim.\n1. Ibn Al-Athir said (4/145): Hashim, Umar's grandfather, was called: Possessor of the Two Spears.\n2. Ibn Sa'd said in \"Al-Tabaqat\" (3/377): He witnessed Badr, Uhud, Al-Khandaq, and all the battles with the Messenger of Allah, peace be upon him.\n3. In \"Al-Asl\": Uhud (Nominative case), but the correct form is what I established (Accusative).\n4. In \"Al-Tabaqat\": Zaid bin Al-Khattab carried the banner of the Muslims on the Day of Yamama... and he began charging with the banner advancing towards the enemy, then fought with his sword until he was killed. The banner fell, so Salim, the freed slave of Abu Hudhayfah, took it.\n5. He is the Judge, Imam, Scholar, Trustworthy Muhaddith, Abu Abdullah Al-Husayn bin Ismail bin Muhammad Al-Baghdadi Al-Mahamili. \"Al-Siyar\" (4/258).",
    "book_id": "26"
  },
  {
    "serial_number": "6208431",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 60,
    "volume_number": 1,
    "text": "snakes (vermin) (1). As for Safiyyah bint Al-Khattab; she is the mother of Al-Aswad (2) bin Sufyan bin Abd al-Asad, and there is no narration (3) for him. As for Umm Jamil; there is a difference of opinion regarding her name. It was said: Umaymah (4), and it was said: Fatimah bint Al-Khattab. She is the wife of Sa'id bin Zaid bin Amr bin Nufayl. She bore him Abd al-Rahman (5)",
    "foot_note": "1. Narrated by Al-Bukhari in a suspended form (Mu'allaq), Book of Beginning of Creation (6/347) (No. 3299), and Muslim in Book of Greetings (4/1753) (No. 2233) via Ma'mar from Al-Zuhri with a similar wording containing a story. Narrated by Al-Bukhari suspended (6/347), Ibn Abi Asim in \"Al-Ahad\" (1/234) (No. 304), and Al-Tabarani (5/20, 5/81) via Ibrahim bin Ismail from Ibn Shihab with it. Narrated by Muslim (1/1753) via Al-Zubaydi from Al-Zuhri with it. Narrated by Ibn Abi Asim in \"Al-Ahad wa Al-Mathani\" (1/234) (No. 305) via Salih bin Yazid bin Kaysan from Al-Zuhri from Salim from Ibn Umar who said: Zaid bin Al-Khattab and Abu Lubabah saw me chasing a snake from the household snakes, so he said: Wait, O Abdullah, for the Prophet, peace be upon him, forbade killing the household snakes.\n2. He has a biography in \"Al-Isabah\" (1/75) where he said: He is the nephew of Salama bin Al-Aswad, the husband of Umm Salamah. Ibn Abd al-Barr mentioned him saying: His companionship is questionable. Al-Adawi mentioned him in \"Al-Nasab\" saying: He was a captive at Badr. He also mentioned that he married Umm Habib bint Al-Abbas bin Abd al-Muttalib and she bore him Al-Aswad. See \"Usud Al-Ghabah\" (1/104).\n3. In \"Usud Al-Ghabah\": Abdan said: No narration is known for him.\n4. In \"Al-Isabah\" (8/62): Al-Daraqutni narrated that her name is Umaymah, then Al-Hafiz said at the end of her biography: It seems her name was Fatimah, her nickname Umaymah, and her Kunya Umm Jamil.\n5. Ibn Sa'd said in \"Al-Tabaqat\" (3/381): Sa'id bin Zaid had children =",
    "book_id": "26"
  },
  {
    "serial_number": "6208432",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 61,
    "volume_number": 1,
    "text": "Al-Akbar bin Sa'id. She is the one whom (1) Umar bin Al-Khattab entered upon before he embraced Islam, while she was reading from a scroll (Mushaf) with Khabbab (2) bin Al-Aratt teaching her. She presented Islam to him, and it was the cause of his conversion. * * * * *",
    "foot_note": "1. = Abd al-Rahman Al-Akbar, who left no descendants. His mother was Ramlah, who is Umm Jamil bint Al-Khattab bin Nufayl.\n1. Abu Nu'aym Al-Asbahani narrated the story of Umar's conversion in \"Fada'il Al-Sahabah\". Al-Hafiz said in \"Al-Isabah\" (8/62): Muhammad bin Uthman bin Abi Shaybah narrated it in his \"Tarikh\", and Abu Nu'aym... Ibn Abd al-Barr said in \"Al-Isti'ab\" (4/383): The news of her regarding Umar's conversion is an amazing story.\n2. Khabbab - with two Ba's, the first one stressed - bin Al-Aratt Al-Tamimi Abu Abdullah, one of the earliest Muslims. He was tortured for the sake of Allah, witnessed Badr, then settled in Kufa and died there in the year thirty-seven.",
    "book_id": "26"
  },
  {
    "serial_number": "6208433",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 62,
    "volume_number": 1,
    "text": "* The Siblings from the children of Umar bin Al-Khattab: Most of them have no companionship. 58 - Abdullah. ... 59 - And Abd al-Rahman Al-Akbar. 60 - And Hafsa. Their mother is Zainab (1) bint Maz'un bin Khubayb bin Wahb bin Hudhafah bin Jumah. 61 - And Umm Al-Walid bint Umar - there is some question about her - Uthman Al-Tara'ifi narrated her hadith from Al-Wazi' bin Nafi' from Salim bin Abdullah bin Umar from Umm Al-Walid bint Umar who said: The Messenger of Allah, peace be upon him, looked out one evening and said: \"O people, do you not feel ashamed?\" They said: From what, O Messenger of Allah? He said: \"You gather what you do not eat, you build what you do not inhabit, and you hope for what you do not reach. Do you not feel ashamed of that?!\" (2).",
    "foot_note": "1. 58 - Born shortly after the Mission. He is one of the prolific narrators among the Companions and one of the 'Abdullahs'. \"Al-Tabaqat Al-Kubra\" (2/373), \"Al-Jarh wa Al-Ta'dil\" (5/107), \"Al-Ahad wa Al-Mathani\" (2/53), \"Usud Al-Ghabah\" (3/227), \"Al-Siyar\" (3/203), \"Al-Isabah\" (4/181).\n59 - His Kunya is Abu Isa. Al-Hafiz said in \"Al-Isabah\" (4/340): Abu Umar said: Umar had three sons named Abd al-Rahman; this one is the oldest of them, no narration is preserved for him. See \"Usud Al-Ghabah\" (3/477).\n60 - Mother of the Believers. The Prophet, peace be upon him, married her in the year three, and she died in the year forty-five. \"Tabaqat Ibn Sa'd\" (8/81), \"Al-Ahad wa Al-Mathani\" (5/407), \"Usud Al-Ghabah\" (7/65), \"Al-Siyar\" (2/227), \"Al-Isabah\" (7/581), \"Al-Tahdhib\" (12/410).\n1. The sister of Uthman bin Maz'un Al-Jumahi.\n61 - Al-Hafiz said in \"Al-Isabah\" (8/322): Al-Daraqutni mentioned her in \"Al-Ikhwah\" and said: Al-Tara'ifi narrated her hadith and there is some question about her.\n2. Narrated by Al-Tabarani in \"Al-Kabir\" (5/172) (No. 421) via Uthman with it. =",
    "book_id": "26"
  },
  {
    "serial_number": "6208434",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 63,
    "volume_number": 1,
    "text": "62 - And Zaid Al-Akbar. 63 - And Ruqayyah; the children of Umar, their mother is Umm Kulthum (1) bint Ali bin Abi Talib. 64 - And Zaid Al-Asghar. 65 - And Ubaydullah; sons of Umar; their mother (2) is Umm Kulthum (3) bint Jarwal Al-Khuza'iyyah. And their two brothers through their mother: 66 - Abdullah - the older - bin (4) Abi Jahm bin Hudhayfah Al-Adawi.",
    "foot_note": "1. = Al-Haythami said in \"Al-Majma'\" (10/284): It contains Al-Wazi' bin Nafi' and he is abandoned (Matruk). Ibn Abd al-Barr said in \"Al-Isti'ab\" (4/1965): \"Her hadith is from Al-Wazi' bin Nafi', and he narrates rejected hadiths...\". Al-Hafiz said in \"Al-Isabah\": Ibn Mandah said: Sa'id bin Abd al-Hamid bin Ja'far bin Ali bin Thabit narrated it from Al-Wazi' bin Nafi' with it.\n62 - His biography was previously mentioned (p. 28).\n63 - Her biography was previously mentioned (p. 28).\n1. Her biography was previously mentioned, No. (14).\n64 - I did not find a biography for him.\n65 - Born during the time of the Prophet, peace be upon him. It is established that he fought during his father's caliphate and was one of the brave men and knights of Quraysh. \"Al-Tabaqat Al-Kubra\" (5/15), \"Al-Ahad wa Al-Mathani\" (2/59).\n2. In \"Al-Asl\": \"Ummuha\" (Her mother).\n3. In \"Al-Isabah\" (2/628): Their mother is Umm Kulthum bint Jarwal. She was married to Umar, but Islam separated them when the verse {And do not hold to the ties of disbelieving women} was revealed, so Abu Al-Jahm bin Hudhayfah married her.\n66 - Abdullah bin Abi Al-Jahm. In \"Al-Isabah\" (4/44): Ibn Sa'd said: He embraced Islam in the Year of Conquest with his father, went out to the Levant as a warrior, and was martyred at Ajnadayn. \"Al-Isabah\" (4/44).\n4. It came in \"Al-Asl\": Min (from), and perhaps the correct form is what I established [Bin].",
    "book_id": "26"
  },
  {
    "serial_number": "6208435",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 64,
    "volume_number": 1,
    "text": "67 - (And Haritha) (1) bin Wahb Al-Khuza'i, and he has companionship. 68 - And Asim bin Umar, his mother is Umm Asim Jamila bint Thabit bin Abi Al-Aqlah Al-Ansari. Her name was Asiyah (2) so the Prophet, peace be upon him, named her Jamila. And the two brothers of Asim through his mother: 69 - Abd al-Rahman bin Yazid bin Jariyah Al-Ansari who narrates from Thawban (3). 70 - And Abd al-Rahman - Al-Awsat - bin Umar, who is Abu Shahma who was flogged for alcohol. His mother",
    "foot_note": "1. 67 - A Companion who settled in Kufa. \"Usud Al-Ghabah\" (1/430), \"Al-Isabah\" (1/619), \"Al-Tahdhib\" (2/167).\n1. What is between the parentheses was written in the margin and marked with a checkmark, and it was indicated in the original. It was misspelled as: Jariyah, and the correct spelling is what I established. In \"Mu'jam Al-Tabarani Al-Kabir\" (3253): His mother was married to Umar and bore Ubaydullah.\n68 - Born during the lifetime of the Prophet, peace be upon him, and died in the year seventy, or it is said after that. Kh, M, D, T, S. \"Al-Tabaqat Al-Kubra\" (5/15), \"Usud Al-Ghabah\" (3/76), \"Al-Siyar\" (4/97), \"Al-Isabah\" (5/3), \"Al-Tahdhib\" (5/52).\n2. Narrated by Muslim in his \"Sahih\" (2139) from Ibn Umar.\n69 - Abu Muhammad, it is said: he was born during the lifetime of the Prophet, peace be upon him. Ibn Hibban mentioned him in \"Thiqat Al-Tabi'in\". He died in the year ninety-three. \"Al-Tabaqat Al-Kubra\" (5/84), \"Al-Isabah\" (5/48), \"Usud Al-Ghabah\" (3/501), \"Al-Tahdhib\" (5/52).\n3. I did not find anyone saying: That he narrates from Thawban. The one who narrates from Thawban is Abd al-Rahman bin Yazid bin Mu'awiyah bin Abi Sufyan. See \"Tahdhib Al-Kamal\" (3/414 - 415).\n70 - Al-Hafiz mentioned him in \"Al-Isabah\" (5/44) in the second section and said: He lived long; he lived after =",
    "book_id": "26"
  },
  {
    "serial_number": "6208436",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 65,
    "volume_number": 1,
    "text": "is an Umm Walad called: Luhaytah (1). Al-Zuhri narrated his story (2) from Salim from his father who said: My brother Abd al-Rahman bin Umar drank while we were in Egypt, and (Abu) (3) Sarwa'a (4) Uqbah bin Al-Harith drank with him... the story. 71 - And Abd al-Rahman Al-Asghar bin Umar, who is Abu Al-Mujabbar. His sister from his mother: 72 - Zainab bint Umar, her mother is an Umm Walad called: Fukayhah.",
    "foot_note": "1. = The Prophet, peace be upon him, for thirteen years. Abd al-Rahman's death was some time before his father's death, and the punishment is only inflicted on one who has reached puberty. Likewise, one does not travel to Egypt unless he is a man or approached manhood, so his being from this section is very apparent.\n1. As in \"Al-Tabaqat Al-Kubra\" (3/266).\n2. Al-Hafiz said in \"Al-Isabah\": Abd al-Razzaq (9/231) narrated the story at length via Ma'mar from Al-Zuhri with the mentioned chain, and it is authentic. End.\n3. What is between the parentheses was written in the margin and marked with a checkmark, and it was indicated in \"Al-Asl\".\n4. See the biography of Abu Sarwa'a in \"Usud Al-Ghabah\" (4/50, 6/136), \"Al-Isabah\" (4/518, 7/169).\n71 - Ibn Abd al-Barr mentioned him in \"Al-Isti'ab\" (2/403) within the biography of Abd al-Rahman Al-Akbar and said: Abd al-Rahman bin Umar Al-Asghar is Abu Al-Mujabbar. His name is also Abd al-Rahman bin Umar bin Al-Khattab. He was called Al-Mujabbar (The Mended) because he fell as a boy and broke [bones], so he was brought to his aunt Hafsa, the Mother of the Believers, and it was said to her: Look at your broken nephew. She said: He is not broken, but he is mended (Mujabbar). Ibn Al-Athir mentioned him similarly in \"Usud Al-Ghabah\" (3/477), and Al-Hafiz in \"Al-Isabah\" (4/340) within the biography of Abd al-Rahman Al-Akbar.\n72 - Al-Hafiz mentioned her in \"Al-Isabah\" (7/684) and said: Al-Zubayr bin Bakkar said in the book \"Al-Nasab\": Her mother is Fukayhah, an Umm Walad, and she is the sister of Abd al-Rahman bin Umar Al-Asghar.",
    "book_id": "26"
  },
  {
    "serial_number": "6208437",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 66,
    "volume_number": 1,
    "text": "73 - And Iyad bin Umar, his mother is Atikah bint Zaid bin Amr bin Nufayl. 74 - And Fatimah bint Umar, her mother is Umm Hakim bint Al-Harith bin Hisham bin Al-Mughira. 75 - And Abdullah Al-Asghar bin Umar, his mother is Su'aydah bint Rafi' Al-Ansariyyah from Banu Amr bin Awf. As for Abdullah; his Kunya is (Abu) (1) Abd al-Rahman. He is from the Muhajirin; he migrated with his father and mother to Medina and pledged allegiance. He was considered too young on the Day of Uhud, but he witnessed (2) Al-Khandaq when he was fifteen (3) years old. He witnessed the battles after Al-Khandaq with the Prophet, peace be upon him. He narrated from the Prophet, peace be upon him, and from Abu Bakr, Umar, Uthman, Ali, Al-Zubayr, Abd al-Rahman bin Awf, Sa'd bin Abi Waqqas, Sa'id bin Zaid Al-Khattab, Zaid bin Thabit, Abu Lubabah Al-Ansari, Abu Ayyub Al-Ansari, Abu Dharr Al-Ghifari, Abu Sa'id Al-Khudri, Zaid bin Harithah, Usamah bin Zaid, Amir bin Rabi'ah, Bilal, Suhayb, Uthman bin Talha, Rafi' bin Khadij, Abdullah bin Masud, Ka'b bin Ujrah, Tamim Al-Dari, Abdullah bin Amr, Abdullah bin Abbas, and others from the Companions. He also narrated from Aisha, Hafsa, and his wife Safiyyah bint Abi",
    "foot_note": "1. 73 - Ibn Sa'd mentioned him in \"Al-Tabaqat\" (3/266) among the children of Umar bin Al-Khattab.\n74 - Ibn Sa'd mentioned her (5/50) within the biography of Abd al-Rahman bin Zaid bin Al-Khattab.\n75 - I did not find his biography.\n1. What is between the parentheses fell from the manuscript.\n2. Narrated by Al-Bukhari in his \"Sahih\", Book of Maghazi, Chapter on the Battle of Al-Khandaq (7/392), Muslim (3/1490) (No. 1868), Abu Dawood in his \"Sunan\" (3/137) (No. 2957), (40/141) (No. 3306), and Al-Nasa'i, Book of Divorce (6/155) via Abdullah bin Umar.\n3. In \"Al-Asl\": \"Khamsah\" (Five).",
    "book_id": "26"
  },
  {
    "serial_number": "6208438",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 67,
    "volume_number": 1,
    "text": "Ubayd. From the Companions, Abdullah bin Abbas narrated from him. He was a jurist, pious (1), and strict in following (2) the traces of the Prophet, peace be upon him, to imitate him in them (3). He died in the year seventy-three (4). As for Hafsa bint Umar, Khunais (5) bin Hudhafah Al-Sahmi married her. She became a widow, then the Messenger of Allah, peace be upon him, married her. She narrated from him. Her brother Abdullah, Umm Mubashir (6), Safiyyah bint Abi Ubayd, and others narrated from her. Umar bin Al-Khattab entrusted his will (7) to her (8), and she entrusted her will at her death to her brother",
    "foot_note": "1. Al-Dhahabi mentioned in \"Al-Siyar\" (3/112) from Tawus who said: I have not seen anyone more pious than Ibn Umar. Al-Dhahabi said: It is also narrated from Maymun bin Mihran.\n2. Al-Dhahabi mentioned in \"Al-Siyar\" (3/112) from Aisha who said: I have not seen anyone more adherent to the original affair than Ibn Umar.\n3. How excellent is the adherence!\n4. In \"Al-Isabah\" (4/188): Damrah bin Rabi'ah said in his \"Tarikh\": He died in the year seventy-two or seventy-three, and once asserted seventy-three. Abu Nu'aym, Yahya bin Bukayr, and the majority said the same. Some added: In Dhu al-Hijjah. Al-Fallas said once: Year seventy-four, and Khalifah, Sa'id bin Jubayr, and Ibn Zabr asserted this.\n5. Khunais - diminutive form - was among the foremost Muslims. He migrated to Abyssinia then returned and migrated to Medina. He witnessed Badr and was wounded on the Day of Uhud and died from it. \"Usud Al-Ghabah\" (2/147), \"Al-Isabah\" (2/345).\n6. She is the wife of Zaid bin Harithah. In \"Al-Tahdhib\" (12/479): She narrated from Hafsa bint Umar, though there is disagreement regarding that.\n7. It came in the manuscript: Her father, but the correct form is what I established.\n8. In \"Al-Isabah\" (7/583): Abu Umar said: Umar entrusted his will to Hafsa, and Hafsa entrusted to her brother Abdullah what Umar had entrusted to her regarding a charity she gave to the furthest extent. Ibn Sa'd narrated in \"Al-Tabaqat\" via Abdullah bin Umar from Nafi' from Ibn Umar: Umar entrusted his will to Hafsa. End.",
    "book_id": "26"
  },
  {
    "serial_number": "6208439",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 68,
    "volume_number": 1,
    "text": "Abdullah. Seven people from the family of Hafsa bint Umar witnessed Badr: Her father, her uncle Zaid, her husband Khunais bin Hudhafah Al-Sahmi, her maternal uncles (1) Uthman, Abdullah, and Qudamah the sons of Maz'un, and Al-Sa'ib bin Uthman bin Maz'un, the son of her maternal uncle (2). As for Abd al-Rahman Al-Akbar bin Umar, he has no narration. As for Umm Al-Walid bint Umar, a hadith was narrated from her whose chain is questionable; Al-Mahamili told us, Al-Ahmasi told us, Uthman bin Abd al-Rahman told us, Al-Wazi' bin Nafi' told us, from Salim, from Umm Al-Walid bint Umar... and her date of death is disputed. As for Asim bin Umar, he was born during the time (3) of the Prophet, peace be upon him. His father Umar married him (4) off during his caliphate and united him with his wife. He was virtuous. Abdullah bin Umar said: My brother Asim and I do not abuse (5) people. He narrated from his father Umar and from Sa'id bin Zaid. Urwah bin Al-Zubayr,",
    "foot_note": "1. It came in the manuscript: Her brothers, but the correct word is what I established.\n2. See \"Sirat Ibn Hisham\" (2/331).\n3. In \"Al-Isabah\" (5/3) Ibn Al-Barqi said: He was born during the lifetime of the Prophet, peace be upon him, but did not narrate anything from him! This is what he said, but a narration has come from him. Abu Ahmad Al-Askari said: He was born in the sixth year. Abu Umar said: The Prophet, peace be upon him, died when he was two years old.\n4. In \"Al-Isabah\" (5/4): Al-Zubayr bin Bakkar mentioned: That Umar married him off during his lifetime and spent on him for a month, then said: Enough... and he mentioned a story.\n5. In \"Al-Isabah\": (5/4): Al-Zubayr said: He had the best character among people. Abdullah bin Umar used to say: My brother Asim and I do not backbite people.",
    "book_id": "26"
  },
  {
    "serial_number": "6208440",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 69,
    "volume_number": 1,
    "text": "his two sons, Hafs, and his wife Aisha bint Muti' bin Al-Aswad narrated from him. He died (1) before his brother (2) Abdullah. As for Abd al-Rahman - Al-Awsat - bin Umar, he is (Abu) (3) Shahma. As for Abd al-Rahman Al-Asghar, he is the father of Al-Mujabbar, and Al-Mujabbar's name is Abd al-Rahman bin Abd al-Rahman bin Umar, and he has no narration. As for Zaid Al-Akbar bin Umar; he was generous and of good conduct. He went out to reconcile (4) between Banu Adi bin Ka'b in a war that occurred between (5) the two sons of Abu Al-Jahm bin Hudhayfah and Ibn Muti'. He was struck on his head by mistake and suffered a head wound, fell, lost his mind, was carried to his home, fell ill for days, then died. His death and the death of his mother Umm Kulthum bint Ali were at the same time (6); it was not known which of them died first, so neither inherited from the other. It is said: The one who wounded him was Khalid bin Aslam, and he did not know him because the fight was at night. Allah knows best.",
    "foot_note": "1. In \"Thiqat Ibn Hibban\" (5/234): He died in the year seventy at Al-Rabadhah before Abdullah bin Umar.\n2. In \"Al-Siyar\" (4/97) He died in the year seventy, so Ibn Umar his brother mourned him saying: Would that deaths had left Asim behind... So we could live together or go together.\n3. What is between parentheses was written in the margin and marked with a checkmark.\n4. In \"Al-Isabah\" (8/294): Zaid was struck in a war between Banu Adi; he went out to reconcile between them, and a man wounded him while not knowing him in the darkness. He lived for days. His mother was sick, so they died on the same day. In \"Al-Siyar\" (3/502): A commotion occurred at night, so Zaid rode into it and was hit by a stone and died from it. That was in the early part of Mu'awiyah's state, may Allah have mercy on him.\n5. Thus in \"Al-Asl\"!\n6. As in \"Al-Tabaqat Al-Kubra\" (8/464 - 465).",
    "book_id": "26"
  },
  {
    "serial_number": "6208441",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 70,
    "volume_number": 1,
    "text": "As for his sister Ruqayyah (bint Umar) (1); Ibrahim bin Nu'aym bin Abdullah Al-Nahham married her (2). She died while with him and did not bear him children (3), and she has no narration. As for Fatimah (4) bint Umar; her cousin Abd al-Rahman (5) bin Zaid bin Al-Khattab married her, and she bore him Abdullah. Safiyyah bint Abi Ubayd narrated from her. As for Zainab bint Umar; Abdullah bin Abdullah (6) bin Suraqa Al-Adawi married her, and she bore him Uthman (7), Humayd, and Uthaymah. She narrated from her sister Hafsa bint Umar. Her son Uthman bin Abdullah (8) bin Suraqa narrated from her. As for Ubaydullah bin Umar; he is the one who killed (9) Jufayna and Al-Hurmuzan; he accused them of being",
    "foot_note": "1. What is between parentheses was written in the margin, marked with a checkmark, and indicated in the margin.\n2. In \"Al-Isabah\" (1/178): Al-Zubayr said: Umar bin Al-Khattab married his daughter to this Ibrahim. Al-Hafiz said: According to Al-Baladhuri: He was married to Ruqayyah bint Umar from Umm Kulthum bint Ali.\n3. Ibn Sa'd mentioned in \"Al-Tabaqat\" (5/171) that she bore Ibrahim a daughter.\n4. Previously mentioned under No. (74).\n5. As in \"Al-Tabaqat Al-Kubra\" (5/50).\n6. In \"Al-Isabah\" (5/18): Al-Zubayr bin Bakkar said in mentioning the children of Umar bin Al-Khattab: As for Zainab bint Umar, she was with Abd al-Rahman bin Salul, then he died, so Abdullah bin Abdullah bin Suraqa succeeded him with her and she bore him children.\n7. He has a biography in \"Tahdhib Al-Tahdhib\" (7/129).\n8. There is a Tadbib mark (sign of omission/doubt) over Abdullah; it indicates the omission of the second name Abdullah because his name is Abdullah bin Abdullah bin Suraqa.\n9. See his story with them in \"Al-Tabaqat Al-Kubra\" (5/15-17) and in \"Al-Isabah\" (5/54).",
    "book_id": "26"
  },
  {
    "serial_number": "6208442",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 71,
    "volume_number": 1,
    "text": "partners in the blood of Umar. He was killed at Siffin (1) with Mu'awiyah bin Abi Sufyan. A number of reports were narrated from him. The rest of Umar's children have no narration. Judge Al-Mahamili (2) told us, Muhammad bin Khalaf Al-Muqri told us, Ishaq bin Mansur told us, Qays told us, from Wa'il bin Dawood, from Al-Bahi that Ubaydullah bin Umar insulted Al-Miqdad. Umar bin Al-Khattab said: Let me cut out his tongue. They spoke to him regarding him until he left him. He said: If you had left me, I would have cut out his tongue. So he never insulted anyone from the Companions of the Messenger of Allah, peace be upon him, ever again (3). * * * * *",
    "foot_note": "1. In \"Al-Isabah\": He fled to the Levant when Ali took the Caliphate and was with Mu'awiyah until he was killed with him at Siffin.\n2. He is Abu Abdullah Husayn bin Ismail, the author of \"Al-Sunan\". See his biography in \"Al-Siyar\" (15/259).\n3. Written in the margin: Comparison complete.",
    "book_id": "26"
  },
  {
    "serial_number": "6208443",
    "category_id": "27",
    "category": "Genealogy",
    "book_title": "Brothers and Sisters",
    "edition": "First, 1413 AH - 1993 AD",
    "publisher": "Dar Al-Rayah for Publishing and Distribution, Riyadh - Saudi Arabia",
    "page_number": 72,
    "volume_number": 1,
    "text": "It is followed in the next part (1): The Siblings from the children of Uthman bin Abi Al-Aas. Praise be to Allah as He deserves, and His blessings be upon our Master Muhammad and his family and abundant peace. I found (2) in the original what follows: I copied it from the original hearing of the jurist Sheikh Al-Uthmani Abu Muhammad Abdullah bin Abd al-Jabbar. I examined the hearing and found no one living in it except (3) the jurist, the Hafiz Abu Al-Hasan Ali bin Ali Al-Maqdisi and Al-Uthmani also, and Ahmad bin Harun Al-Shatibi, resident of Al-Andalus known as Ibn 'Ati (4). That was in Jumada Al-Akhirah of the year six hundred and five. * * * * *",
    "foot_note": "1. I did not find the second part of this valuable book, unfortunately.\n2. This is from the words of the scribe of the \"Original\" that is in our hands.\n3. Thus I read it!\n4. Thus it is clear in the \"Original\". In \"Al-Takmilah li Wafayat Al-Naqalah\" (No. 1232) by Al-Mundhiri: Ibn 'At.",
    "book_id": "26"
  }
]