[
  {
    "text": "The Impact of Sharia Knowledge in Confronting Violence and Aggression\nAuthor: عبد العزيز بن فوزان بن صالح الفوزان\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 1
  },
  {
    "text": "sn: 8366\nbook_title: أثر العلم الشرعي في مواجهة العنف والعدوان\nbook_link: https://shamela.ws/book/1145\nbook_id: 1145\nauthor_name: عبد العزيز بن فوزان بن صالح الفوزان\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1798\nauthor_ID: 1798\neditor: Null\npublisher: الكتاب منشور على موقع وزارة الأوقاف السعودية بدون بيانات\nedition: Null\npages: 56\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: كتب عامة\ncategory_id: 39",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "category_id": "39",
    "category": "General Books",
    "new_page_number": 2
  },
  {
    "serial_number": "7474566",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: General Books. Book: The Impact of Sharia Knowledge in Confronting Violence and Aggression. Author: Abdul Aziz bin Fawzan bin Saleh Al-Fawzan. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (paper book): 42 [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Impact of Sharia Knowledge in Confronting Violence and Aggression. Author: Abdul Aziz bin Fawzan bin Saleh Al-Fawzan. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (paper book): 42 [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Abdul Aziz bin Fawzan bin Saleh Al-Fawzan. Publisher: The book is published on the Saudi Ministry of Awqaf website without data. Number of pages (paper book): 42 [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages (paper book): 42 [The book is automatically numbered and does not correspond to the printed version]. Number of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered and does not correspond to the printed version]. Number of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 56. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 3
  },
  {
    "serial_number": "7474567",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 1,
    "volume_number": 1,
    "text": "The Impact of Sharia Knowledge in Confronting Violence and Aggression. Prepared by Dr. Abdul Aziz bin Fawzan bin Saleh Al-Fawzan, Faculty Member at the College of Sharia, Imam Muhammad bin Saud Islamic University. In the name of Allah, the Most Gracious, the Most Merciful. Introduction: Praise be to Allah who guided us to Islam, and we would not have been guided had Allah not guided us. I bear witness that there is no deity worthy of worship except Allah alone, having no partner; we have no Lord other than Him, and no true object of worship but Him. And I bear witness that Muhammad is His servant, His Messenger, His friend (Khalil), and His chosen one. May Allah send peace and blessings upon him, his family, his companions, and those who support him. To proceed: Security is an urgent human need and an innate requirement without which life cannot proceed correctly. No individual or society can do without it. Life without security is an arid, barren, harsh, and cruel life that cannot be accepted or endured. Security is one of the most important foundations of happiness and stability, and one of the most important causes of progress, civilization, and advancement. It is a demand upon whose importance all nations, peoples, individuals, and societies agree, in every time and place. If security is lost, souls become disturbed, fear and anxiety dominate them, people's interests are disrupted, they withdraw from striving and earning, and their concerns become limited to securing themselves and their dependents, and repelling injustice and aggression that is occurring or expected against them.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 4
  },
  {
    "serial_number": "7474568",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 2,
    "volume_number": 1,
    "text": "If security is an urgent human need that no individual or society can do without, this necessarily implies the obligation to confront violence that disrupts it, treat its effects, and cut off the causes leading to it. Islam has its unique approach to achieving security and combating violence. It focuses on the educational and preventive aspects that prevent the occurrence of violence in the first place, as well as the deterrent and punitive aspects that erase its effects and prevent its recurrence and repetition. This is contrary to what is found in pre-Islamic human methodologies and positive laws, which focus on treating violence after it occurs more than they focus on preventing its occurrence from the start.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 5
  },
  {
    "serial_number": "7474569",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 3,
    "volume_number": 1,
    "text": "Even if they were destined to focus on preventive and educational aspects, they would not possess the means for it, nor the commitment, response, and respect for it that are available to Divine legislation. This legislation is established by the Wise Creator who created man and knows what rectifies him and brings him happiness in his immediate and future affairs. It is a legislation free from human ignorance, human whims, human weakness, and human fluctuations. There is no favoritism in it for an individual, a class, or a race, because Allah is the Lord of the worlds, and all people are His servants. He revealed His law to them to achieve their security, preserve their interests, and guide them to what contains their happiness in this world and the Hereafter. In this research, I will focus on explaining the impact of Sharia knowledge in confronting violence. For indeed, Sharia knowledge founded on the Book and the Sunnah is what refines souls, purifies hearts, restricts its possessor from violence and crime, prevents him from injustice and aggression, compels him to honor the rights of people and preserve their interests, and restrains him from daring to violate sanctities and commit injustices and destructive sins. It prevents violence from the start, and it is also one of the greatest means assisting in the treatment of this dangerous phenomenon, and inducing those involved in it to repent, return to God, and not repeat or return to it.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 6
  },
  {
    "serial_number": "7474570",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 4,
    "volume_number": 1,
    "text": "This research is organized into an introduction, a preface, a conclusion, and two sections as follows: Section One: The prohibition of aggression against the soul. Section Two: The prohibition of forbidding evil if it necessitates something more evil than it. I ask Allah to grant us understanding in religion, steadfastness on the path of the Master of Messengers, and to protect us from misleading tribulations and the methodologies of the deluded. May He guide the straying Muslims, and protect our country and all Muslim countries from the treachery of enemies and those lying in wait, and from the recklessness of the ignorant and the rash.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 7
  },
  {
    "serial_number": "7474571",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 5,
    "volume_number": 1,
    "text": "Preface: The misguidance of creation, despite its many forms and types, and its multiple manifestations and shapes—whether in thoughts and perceptions, morals and behaviors, or actions and practices—returns in reality to two main causes: First: Ignorance or blindness. Second: Injustice or desire (hawā). Allah Almighty said: {Indeed, We offered the Trust to the heavens and the earth and the mountains, and they declined to bear it and feared it; but man [undertook to] bear it. Indeed, he was unjust and ignorant.} [Al-Ahzab: 72]. So He explained that the default state of man is injustice and ignorance, except for those whom Allah purifies with justice, which prevents them from injustice, and beneficial knowledge, which lifts ignorance from them. Sheikh al-Islam Ibn Taymiyyah said: 'Ignorance and injustice are the root of every evil, as He, the Glorified, said: {but man [undertook to] bear it. Indeed, he was unjust and ignorant.} [Al-Ahzab: 72]' (1).",
    "foot_note": "1. (1) Iqtidā' al-Sirāṭ al-Mustaqīm, p. 37.",
    "book_id": "1145",
    "new_page_number": 8
  },
  {
    "serial_number": "7474572",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 6,
    "volume_number": 1,
    "text": "This is also indicated by the fact that Allah Almighty commanded us to recite the Mother of the Quran (Al-Fatihah) in every rak'ah of prayer, whether obligatory or recommended. Among its verses is His saying, Glory be to Him: {Guide us to the straight path} {The path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.} [Al-Fatihah: 6-7]. Thus, He guided us to ask Him for guidance to the straight path, and that implies knowing the truth and being successful in acting upon it, both of which negate ignorance and desire. Then He explained that this is the path of those upon whom He bestowed favor among the Prophets and their followers in excellence, as He guided them to the truth and aided them in complying with it and acting upon it. This is unlike those who evoked anger and those who went astray, who deviated from the straight path. Consequently, they fell into polytheism and misguidance, innovations and superstitions, and committed major sins and evil deeds. This was either due to following desires despite their knowledge of the truth—and these are the ones who evoked anger, like the Jews, whom Allah led astray knowingly, so they abandoned the truth while knowing it—or due to their ignorance of the truth, so they worshipped Allah based on ignorance—and these are the straying ones, like the Christians, who draw near to Him with polytheistic acts and worship Him with innovations and misguidance.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 9
  },
  {
    "serial_number": "7474573",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 7,
    "volume_number": 1,
    "text": "If a Muslim is commanded to understand these great meanings and to pray with this comprehensive supplication in every rak'ah of prayer, then this is proof of the danger of ignorance and following desires, and the obligation of striving against oneself to seek knowledge and guidance, and to follow the truth and remain steadfast upon it. It shows that ignorance and desire are the causes of people's misguidance and their distance from guidance and the religion of truth. If you reflect on the conditions of the negligent sinners, the misguided innovators, and the harsh extremists, you would find that they only came from the direction of these two matters or one of them. Ignorance is the root of the two misguidances and the more dangerous of the two evils. No one follows desire and turns away from the truth and guidance except because of his ignorance of Allah and His power, and his negligence of the ominous nature of sin and its bad consequence. In my opinion, most of those mentioned only deviated from the straight path due to ignorance, lack of understanding, and weak insight into the religion.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 10
  },
  {
    "serial_number": "7474574",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 8,
    "volume_number": 1,
    "text": "Many of those who commit major sins, indulge excessively in disobedience against themselves, or are lenient in oppressing people and diminishing their rights, do not know that their action is among the prohibited major sins. And if they know its prohibition in general terms, they do not realize its heinousness and the severity of its prohibition, nor the sin and bad omens that result from it, and the evil consequences in this world and in the Hereafter. Thus, they become lenient in doing it and underestimate its gravity. If they knew the threat and severe punishment reported regarding this evil deed, they would not have committed it, or persisted in it and found it agreeable. For example, one who drinks alcohol, commits adultery, or engages in backbiting or gossip—if he knew the harms of these sins on the heart and body, religion and worldly life, and the painful punishment and exemplary penalty, and the immediate and delayed sanctions that result from them, that would be the greatest deterrent for him against committing them, or finding them agreeable and taking them lightly.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 11
  },
  {
    "serial_number": "7474575",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 9,
    "volume_number": 1,
    "text": "A person may also be approached from the side of his ignorance from another angle, where he thinks that his action is blessed and legitimate, and that its doer is rewarded and thanked, while the matter is not as he thinks and supposes in reality. Like one who oppresses a disbeliever or a sinner and intentionally harms him by word and deed, thinking that his action is an act of closeness by which Allah raises him in degrees. He is ignorant that injustice is forbidden regarding everyone, whether Muslim or disbeliever, righteous or wicked, and that his action is turning people away from the path of Allah and oppression of Allah's servants; both are forbidden by many texts in the Book and the Sunnah. From this, we know that enjoining good and forbidding evil become forbidden if they involve missing a greater benefit or bringing about a greater trial (fitnah) and corruption. From the foregoing, two important matters become clear to us: First: Our need, nay our necessity, to know the truth and seek Sharia knowledge. For this reason, Allah Almighty made seeking Sharia knowledge an obligation upon every Muslim male and female. On the authority of Anas, may Allah be pleased with him, he said: The Messenger of Allah, peace and blessings be upon him, said: 'Seeking knowledge is an obligation upon every Muslim' (1).",
    "foot_note": "1. (1) Reported by Ibn Majah: 224, and Abu Ya'la: 2837, and it has numerous supporting evidences. Al-Suyuti authenticated it in 'Al-Jami' al-Saghir': 5264, and Al-Albani in 'Sahih al-Targhib wa al-Tarhib': 70. He said in his commentary on 'Mishkat al-Masabih' 1/76: 'Know that Al-Suyuti collected these paths until they reached fifty, and ruled the hadith authentic because of them. Al-Iraqi narrated its authenticity from some Imams, and more than one scholar has classified it as Hasan (good). And Allah knows best. As for the addition \"and Muslim woman\" which is famous on tongues, it has absolutely no basis.'",
    "book_id": "1145",
    "new_page_number": 12
  },
  {
    "serial_number": "7474576",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 10,
    "volume_number": 1,
    "text": "This includes every knowledge upon which the performance of a duty or the abandonment of a prohibition depends; learning it is an individual obligation (Fard Ayn) upon every accountable Muslim. As for what exceeds that of Sharia or worldly sciences that the Ummah needs, learning these is a communal obligation (Fard Kifayah). If enough people from the rest of the Islamic Ummah undertake it and the need of the Ummah is met by them, the objective is achieved, the duty is performed, and the sin falls from the rest. But if the entire Ummah agrees to abandon it, or if those by whom sufficiency is not achieved undertake it, the entire Ummah sins—men and women, capable and incapable. As for the capable, he sins for not undertaking it and performing it despite his ability. As for the incapable, his duty is to urge the capable to perform what Allah Almighty has obligated. Although the sin of the capable is greater than the sin of others, they are all sinners. This is the case in all communal obligations. For this reason, Allah Almighty encouraged seeking beneficial knowledge and accumulating it, and He praised the scholars and explained the greatness of their merit and the loftiness of their status, and that those who know and those who do not know are not equal. Likewise, many Hadiths have been reported explaining the virtue of knowledge and scholars, and that they are the heirs of the Prophets in knowing the truth and acting upon it, and in carrying this religion and conveying it to the worlds. These are well-known verses and Hadiths, so we will not prolong by mentioning them.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 13
  },
  {
    "serial_number": "7474577",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 11,
    "volume_number": 1,
    "text": "Rather, the Prophet, peace and blessings be upon him, explained that engaging in knowledge—learning and teaching—is better than engaging in voluntary acts of worship whose benefit is limited to the doer. And that whoever goes out in search of knowledge is in the path of Allah until he returns. And whoever Allah wishes good for, He grants him understanding in religion. He also explained the vast difference and immense gap between the insightful scholar and the ignorant worshiper. He said: 'Whoever follows a path in pursuit of knowledge, Allah will facilitate for him a path to Paradise. Indeed, the angels lower their wings in approval of the seeker of knowledge. Indeed, everyone in the heavens and on earth, even the fish in the depths of the water, ask forgiveness for the scholar. The superiority of the scholar over the worshiper is like the superiority of the moon on the night of the full moon over all other stars. Indeed, the scholars are the heirs of the Prophets, and the Prophets did not leave behind dinars or dirhams, but rather they left behind knowledge. So whoever takes it has taken an abundant share' (1). There are reasons for this preference, including the following:",
    "foot_note": "1. (1) Reported by Abu Dawood: 3641, 3642, Ibn Majah: 223, and Al-Darimi: 342. Al-Albani classified its chain as Hasan in his commentary on 'Mishkat al-Masabih': 1/74, and in 'Sahih al-Targhib wa al-Tarhib': 68. It is supported by the hadith of Abu Umamah al-Bahili, may Allah be pleased with him, which contains: (The superiority of the scholar over the worshiper is like my superiority over the lowest of you. Then the Messenger of Allah, peace and blessings be upon him, said: Indeed Allah, His angels, and the inhabitants of the heavens and the earths, even the ant in its hole and even the fish, send blessings upon the teacher of people goodness). The hadith was reported by Al-Tirmidhi: 2685, and Al-Suyuti authenticated it in 'Al-Jami' al-Saghir': 5859. Al-Darimi reported it with this wording from the hadith of Makhul al-Dimashqi as Mursal: 289. Al-Albani said in his commentary on 'Mishkat al-Masabih' 1/75: It is a Hasan Mursal.",
    "book_id": "1145",
    "new_page_number": 14
  },
  {
    "serial_number": "7474578",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 12,
    "volume_number": 1,
    "text": "1- The scholar is more knowledgeable about Allah Almighty and His rights, has more love for Him, more reverence for His majesty, more hope for His reward, and more fear of His punishment. For whoever is more knowledgeable about Allah is more fearful of Him. For this reason, our Lord, Glory be to Him, said: {Only those fear Allah, from among His servants, who have knowledge.} [Fatir: 28]. Thus, He explained that they are the ones who fear Him with true fear, due to the perfection of their knowledge of Him, the filling of their hearts with reverence and love for Him, and hope and fear of Him. Also due to their reflection on His cosmic and legislative signs, and their realization of the objectives and goals of His law, and its wisdoms and secrets. Thus, they increase in certainty that this religion is the true religion that Allah was pleased with for His servants and revealed as a mercy to the worlds, and that the one who brought it is truly the Messenger of Allah. Even if he had not brought a sign indicating his truthfulness and the truth of what he brought except what this Sharia contains of wisdoms and interests, it would have been sufficient and healing.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 15
  },
  {
    "serial_number": "7474579",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 13,
    "volume_number": 1,
    "text": "2- Beneficial knowledge protects its possessor, by Allah's success, from deviation and misguidance. It protects him from falling into innovations (Bid'ah) and newly invented matters, polytheism and errors. It compels him to honor the rituals and sanctities, and to distance himself from evils and destructive sins. This is unlike the ignorant worshiper, for he may fall into some of these violations due to his ignorance. Perhaps he draws near to Allah with what Allah has not permitted, like the condition of Christian worshipers and those like them among the ignorant Muslim worshipers who worship with innovations and newly invented matters, or draw near to the inhabitants of graves with various types of offerings, and associate partners with Allah Almighty while thinking they are doing good. The ignorant worshiper might also be occupied with the less excellent over the excellent, the outweighed over the weighty, and what is loved by Allah over what is most loved by Him. So he worships with less excellent deeds and leaves the excellent deeds, and expands in voluntary and recommended acts at the expense of obligatory duties. You find him occupied with voluntary acts of worship away from what Allah has obligated of honoring parents, maintaining family ties, raising children, enjoining good and forbidding evil, advising Muslims, and so on.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 16
  },
  {
    "serial_number": "7474580",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 14,
    "volume_number": 1,
    "text": "The remedy for that is insight into religion, knowledge of the ranks of acts of worship, knowing their values, and distinguishing between the excellent and the less excellent. For among obediences, there is a master and a subordinate, a chief and a follower, a major and a minor, a peak and what is below it (1). Beneficial knowledge is what protects against the plots and whisperings of Satan, and exposes his doubts and deceptions. The more the sincere believer is knowledgeable about the Sharia and well-versed in it, the more he adheres to the Sunnah and is keen on it, and the further he is from innovation and averse to it, and the more cautious he is of Satan's traps and whispers.",
    "foot_note": "1. (1) See: Madārij al-Sālikīn 1/225.",
    "book_id": "1145",
    "new_page_number": 17
  },
  {
    "serial_number": "7474581",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Effect of Islamic Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the website of the Saudi Ministry of Awqaf without publication details",
    "page_number": 15,
    "volume_number": 1,
    "text": "3- Knowledge is a light that guides to the truth and illuminates the path for the seeker. Through it, one can distinguish between faith and disbelief, benefit and harm, good and evil. It even allows recognition of the best among the good and the worst among the evil. A person’s judgment on events, understanding of how to deal with them, perception of their consequences, and decisions on when to act, refrain, confront, or reconcile depend on the depth of his knowledge, insight, and understanding of reality. Therefore, Allah Almighty has commanded us to refer to learned scholars in matters that concern the community and affect its public interests. He says: {And when there comes to them information about [public] security or fear, they spread it around; but if they had referred it back to the Messenger or to those of authority among them, then the ones who can draw correct conclusions from it would have known about it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.} [An-Nisa: 83]",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 18
  },
  {
    "serial_number": "7474582",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 16,
    "volume_number": 1,
    "text": "This is a disapproval from Allah Almighty of those who rush to judge matters and hasten to spread news and broadcast it before verifying its authenticity, correctness, and the appropriateness of publishing it or not. It is incumbent upon them, if a matter of importance related to public interests comes to them, to verify and act with deliberation, and to refer the matter to those in authority among the firmly grounded scholars—people of opinion, sound judgment, intellect, composure, foresight, and broad horizons. These are the ones who know the conditions and distinguish between benefits and harms. They would then guide them, by Allah's permission, to the most correct path and the wisest approach. If they see a benefit, vitality for the believers, joy for them, strengthening of their resolve, or a precaution against their enemies and a motivation to confront them and guard against their evil and aggression in broadcasting it, they would do so. But if they see the benefit lies in concealing it, they would not broadcast it (1).\n4- The action of the worshiper, no matter how great, has a benefit limited to himself, unlike the scholar, whose benefit extends to others (2).\nSecond: The obligation of being cautious of misleading leaders, the ignorant who pretend to be learned, and those who put themselves forward for fatwa (religious rulings) while not being qualified for it. For this reason, Allah - the Exalted - commanded us to ask the people of the Reminder, saying: {So ask the people of the message if you do not know} [Al-Anbya: 7].",
    "foot_note": "1. (1) See: Tafsir Ibn Kathir 1 / 704-705, and Tafsir Al-Sa'di 1 / 377.\n2. See: Madarij al-Salikin 1 / 87, and Talbis Iblis, p. 172.",
    "book_id": "1145",
    "new_page_number": 19
  },
  {
    "serial_number": "7474583",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 17,
    "volume_number": 1,
    "text": "The 'People of the Message' (Ahl al-Dhikr) are the firmly grounded scholars whom the Ummah has testified to regarding their knowledge and leadership in religion. As for the pretenders of knowledge, the half-educated, and those who intrude upon the tables of scholars, they are not worthy of being asked for fatwas or for their opinions to be issued, especially in general matters that affect the interests of the Ummah. The Prophet, peace and blessings be upon him, warned us against the likes of these, saying: \"Verily, Allah does not take away knowledge by snatching it from the people, but He takes away knowledge by taking away the scholars, so that when He leaves no scholar, the people take ignorant heads [as leaders]. They are asked, and they give fatwas without knowledge; so they go astray and lead others astray\" (1). This includes a warning against taking the ignorant as leaders and leaving the field open to them due to the sitting back of firmly grounded scholars from what Allah has obligated them to do regarding notification and clarification. It also contains a warning against seeking fatwas from pretenders of knowledge and half-educated people, and those who put themselves forward for fatwa while they are in reality ignorant pretenders. It also contains a severe warning to these people against speaking about Allah without knowledge, inserting themselves into what they do not do well, and wading into a sea in which they cannot swim, thus going astray, leading others astray, and bearing their own burdens and the burdens of those they mislead without knowledge.",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 100, and Muslim: 2673.",
    "book_id": "1145",
    "new_page_number": 20
  },
  {
    "serial_number": "7474584",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 18,
    "volume_number": 1,
    "text": "This is confirmed by the fact that the Prophet, peace and blessings be upon him, when warning against the tribulation of the Khawarij and commanding that they be fought, explained that they were only overtaken due to their ignorance and lack of understanding. Thus, they committed crimes against themselves and their Ummah, and their good intentions, sound purpose, and abundance of worship did not intercede for them. On the authority of Ali bin Abi Talib, may Allah be pleased with him, who said: I heard the Messenger of Allah, peace and blessings be upon him, say: \"There will emerge at the end of time a people who are young in age and foolish in dreams [minds]. They will speak from the best words of creation. They recite the Quran, but it does not pass beyond their throats. They will pass through the religion just as an arrow passes through game. So if you meet them, kill them, for in killing them there is a reward for whoever kills them with Allah on the Day of Resurrection\" (1). He described them as \"foolish in dreams,\" which is evidence of the weakness of their intellects and the dominance of ignorance over them. He also described them as \"young in age,\" and youth is generally closer to ignorance, recklessness, haste, and lack of deliberation, as well as deviation of thought and extremism in opinion, compared to an elder whom life has toughened and experiences have seasoned, and who has realized the importance of looking at outcomes and consequences.",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 3415, 4770, 6531, and Muslim: 1066.",
    "book_id": "1145",
    "new_page_number": 21
  },
  {
    "serial_number": "7474585",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 19,
    "volume_number": 1,
    "text": "He also described them as \"They recite the Quran, but it does not pass beyond their throats,\" which is also evidence of their ignorance and weak insight. For despite their frequent recitation of the Quran, it does not pass their throats; they do not comprehend it with their minds, nor do they understand its exhortations and warnings, nor do they know its rulings and limits. Their excessive ignorance and lack of success reached such an extent that, as the Prophet, peace and blessings be upon him, described them in another Hadith: \"They kill the people of Islam and leave the people of idols\" (1). They deemed permissible the blood of Ali bin Abi Talib, may Allah be pleased with him, and those who were with him from the best of the Companions and the Successors. This is in addition to their disdain for the senior scholars among the Companions, their disregard for their knowledge, and their assumption that they—despite their meager goods and weak minds—were more knowledgeable than them and more insightful regarding matters. We seek refuge in Allah from the blindness of hearts, the obliteration of insights, and the confusing of truth with falsehood.",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 3166, and Muslim: 1064.",
    "book_id": "1145",
    "new_page_number": 22
  },
  {
    "serial_number": "7474586",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 20,
    "volume_number": 1,
    "text": "First Requirement: The Prohibition of Aggression Against the Self.\nThe human soul does not belong to the human; rather, it is the property of its Creator and Originator, the Almighty. It is a trust with its owner, and he will be asked about it on the Day of Resurrection: Did he preserve it and fulfill its rights, or did he waste it and wrong it, and fail to perform what is due to it? For this reason, it is not permissible for a person to kill himself, nor to expose it to danger without a legitimate interest, nor to dispose of any of its parts except in a way that brings benefit to it or wards off harm from it. He has no right to harm himself under the pretext that he is acting within what concerns him and that he has not assaulted anyone else, for his aggression against himself is like his aggression against another in the sight of Allah Almighty (1). Allah Almighty said: {And do not kill yourselves [or one another]. Indeed, Allah is to you ever Merciful.} {And whoever does that in aggression and injustice - We will drive him into a Fire. And that, for Allah, is [always] easy.} [An-Nisa: 29-30]. This is a prohibition for believers against killing one another (2), and a prohibition for a human against killing himself, whether by intentionally killing himself directly or by engaging in dangers leading to destruction and death. Then He threatened whoever kills himself or the soul of another without right that He will drive him into the fire of Hell, and what an evil destination (3).",
    "foot_note": "1. (1) See: Al-Islam wa Darurat al-Hayat, p. 63.\n2. Al-Qasimi said in his Tafsir 5 / 1203: \"For all believers are like a single soul, and the expression using 'yourselves' is to emphasize the rebuke against killing them, by portraying it in the image of something a sane person would hardly do.\"\n3. See: Tafsir Al-Sa'di 1 / 341, 342.",
    "book_id": "1145",
    "new_page_number": 23
  },
  {
    "serial_number": "7474587",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 21,
    "volume_number": 1,
    "text": "Al-Qurtubi said: \"The people of interpretation agreed that the meaning of this verse is the prohibition of people killing one another. Then, its wording encompasses a man killing himself with the intent of killing: out of greed for the world and seeking wealth, by driving himself into risks leading to destruction... or in a state of distress or anger; the prohibition covers all of this\" (1). Amr bin Al-Aas, may Allah be pleased with him, used this verse as evidence when he entered a state of major impurity (Janabah) and then performed dry ablution (Tayammum), fearing that if he washed with water he would perish from the extreme cold. The Prophet, peace and blessings be upon him, laughed and affirmed his reasoning (2). And Allah Almighty said: {And do not throw [yourselves] with your [own] hands into destruction} [Al-Baqarah: 195]. Throwing is casting a thing, and 'hands' refers to souls (selves), expressing the whole by the part, based on the fact that most actions of the soul are done by hands. 'Destruction' (Tahlukah) is a verbal noun from halaka (to perish)... meaning: do not cause yourselves to fall into destruction (3). Sheikh Abdul Rahman Al-Sa'di said: \"Throwing oneself by hand into destruction refers to two matters: Leaving what the servant has been commanded to do, if leaving it causes or approximates the destruction of the body or the soul (4).",
    "foot_note": "1. (1) Al-Jami' li Ahkam al-Quran 5 / 156-157, and see similar in Fath al-Qadir 1 / 457.\n2. See: Tafsir Al-Qasimi 5 / 1203-1204, Tafsir Ibn Kathir 2 / 235. The Hadith was narrated by Abu Dawood: 334, Ahmad in Al-Musnad 4 / 203-204, and Al-Hakim 1 / 177, who authenticated it, and Al-Dhahabi agreed. Al-Albani authenticated it in 'Irwa al-Ghalil' 1 / 181, stating: Al-Nawawi authenticated it, and Ibn Hajar strengthened it.\n3. See: Tafsir Al-Qasimi 3 / 195, and Fath al-Qadir 1 / 193.\n4. Such as leaving eating or drinking, or leaving the effort to obtain them while capable, until death overtakes him due to hunger or thirst. And such as abandoning Jihad in the path of Allah and spending for it, which causes enemies to overpower and kill Muslims. Abandoning Jihad and spending for it is the reason for the revelation of this verse. See its cause of revelation in: Tafsir Ibn Kathir 1 / 331, Al-Jami' li Ahkam al-Quran 2 / 361-363, and Fath al-Qadir 1 / 193. Al-Shawkani said: \"The truth is that consideration is given to the generality of the wording, not the specificity of the cause. So everything to which the term 'destruction' applies in religion or worldly life falls under this. Ibn Jarir al-Tabari held this view.\"",
    "book_id": "1145",
    "new_page_number": 24
  },
  {
    "serial_number": "7474588",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 22,
    "volume_number": 1,
    "text": "And doing what is a cause leading to the destruction of the self or the soul; many matters fall under this... Among them: a person exposing himself to danger in combat, or a fearful journey, or a place of predatory beasts or snakes, or climbing a dangerous tree or structure, or entering under something dangerous, and the like. This and similar actions are among those who throw themselves by hand into destruction\" (1). The Prophetic Sunnah came confirming what is in the Quran, and warning with severe threat and painful punishment for those who kill themselves. In the two Sahihs (Bukhari and Muslim) on the authority of Jundub bin Abdullah, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Among those who came before you was a man who had a wound. He panicked, so he took a knife and cut his hand with it. The blood did not stop flowing until he died. Allah Almighty said: My servant hastened his end; I have forbidden Paradise for him\" (2).",
    "foot_note": "1. (1) Tafsir Al-Sa'di 1 / 153.\n2. Narrated by Al-Bukhari: 3463, 1364, and Muslim: 113.",
    "book_id": "1145",
    "new_page_number": 25
  },
  {
    "serial_number": "7474589",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 23,
    "volume_number": 1,
    "text": "Also in the two Sahihs, on the authority of Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever kills himself with a piece of iron, his piece of iron will be in his hand, stabbing (1) himself with it in his belly in the fire of Hell, abiding eternally therein forever. And whoever drinks poison and kills himself, he will be sipping it (2) in the fire of Hell, abiding eternally therein forever. And whoever throws himself down from a mountain (3) and kills himself, he will be falling in the fire of Hell, abiding eternally therein forever\" (4). In a narration by Al-Bukhari: \"He who strangles himself strangles it in the Fire, and he who stabs himself stabs it (5) in the Fire\" (6). There are many Hadiths in this chapter in the two Sahihs and others. As for his saying, peace and blessings be upon him: \"in the fire of Hell, abiding eternally therein forever,\" scholars have answered it with several answers, including: That it is interpreted to refer to one who did that considering it lawful (Halal) without interpretation, despite knowing its prohibition. For by considering what Allah prohibited as lawful, he becomes a disbeliever, and the disbeliever abides eternally in the Fire without doubt. And among them: That it was stated as a deterrent and severity (Zajr), and its literal reality is not intended.",
    "foot_note": "1. (1) Ibn al-Athir said in Jami' al-Usul 10 / 217: \"Waja'tuhu bi al-sikkeen: If I struck him with it. 'Yatawajja'u biha' means: he strikes himself with it.\"\n2. Yatahassahu: Meaning he drinks it slowly and sips it. 'Samm' (Poison): with Damma, Fatha, or Kasra on the Sin; three dialects, Fatha being the most eloquent. See: Sharh al-Nawawi 'ala Muslim 2 / 121, and Fath al-Bari 10 / 248.\n3. Al-Taraddi: Falling from a high place. His saying: (Whoever throws himself down from a mountain and kills himself) means: he dropped himself from it intentionally. Otherwise, the mere phrase (Taradda) does not indicate intent. See: Jami' al-Usul 10 / 217, and Fath al-Bari 10 / 248.\n4. Narrated by Al-Bukhari: 5778, and Muslim: 109.\n5. Ibn Hajar said in Al-Fath 3 / 229: 'Yat'anuha': with Damma on the un-dotted 'Ain', this is how it is recorded in the original texts.\n6. Narrated by Al-Bukhari: 1365.",
    "book_id": "1145",
    "new_page_number": 26
  },
  {
    "serial_number": "7474590",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 24,
    "volume_number": 1,
    "text": "But this, as Abu Ubaid Al-Qasim bin Sallam says: \"Is among the most atrocious interpretations attributed to the Messenger of Allah, peace and blessings be upon him, and his companions, to make the report from Allah and His religion a threat that has no reality. This leads to the invalidation of punishment, because if that is possible in one instance, it is possible in all punishments\" (1). And among them: That he deserves this recompense due to the heinousness of his crime, and this is his recompense if Allah wished to recompense him with what equals his crime. However, He has been generous to His monotheistic servants, informing that they will exit the Fire by virtue of their Tawheed (Monotheism), and that no one who died as a monotheist will abide eternally in the Fire (2). Ibn Hajar preferred this last answer, saying: \"The most appropriate interpretation for this Hadith and similar Hadiths of threat is that the mentioned meaning is the recompense for whoever does that, unless Allah Almighty overlooks him\" (3).",
    "foot_note": "1. (1) Al-Iman by Abu Ubaid, edited by Al-Albani, p. 88.\n2. See: Sharh al-Nawawi 'ala Sahih Muslim 2 / 125, Al-Mughni 11 / 444, Al-Mubdi' 8 / 240, and Fath al-Bari 3 / 227.\n3. Fath al-Bari 10 / 248.",
    "book_id": "1145",
    "new_page_number": 27
  },
  {
    "serial_number": "7474591",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 25,
    "volume_number": 1,
    "text": "This is supported by His saying, the Exalted: {Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills} [An-Nisa: 48]. So He explained that major sins less than Shirk (polytheism), including killing without right, do not cause their perpetrator to abide eternally in the Fire; rather, he is under the will of Allah Almighty. If He wills, He forgives him, and if He wills, He punishes him, then his final destination is Paradise. This is supported by the Hadith of Ubada bin As-Samit, regarding the Prophet, peace and blessings be upon him, after he accepted their pledge to abandon killing, adultery, and other sins, saying: \"Whoever among you fulfills [the pledge], his reward is with Allah. And whoever commits any of that and is punished for it [in this world], it is an expiation for him. And whoever commits any of that and Allah conceals it for him, his matter is with Allah: if He wills, He pardons him, and if He wills, He punishes him\" (1). It is also supported by the story of the one who killed ninety-nine souls and then completed the hundred. When he migrated to the righteous village, death overtook him between the two villages, so the angels of mercy took his soul (2). The story is well-known and famous (3).",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 6416, and Muslim: 1709.\n2. Narrated by Al-Bukhari: 3283, and Muslim: 2766.\n3. See: Al-Mughni 11 / 444, Fath al-Bari 12 / 188. The scholar Al-Shawkani elaborated on this issue in 'Nayl al-Awtar' 7 / 208-212.",
    "book_id": "1145",
    "new_page_number": 28
  },
  {
    "serial_number": "7474592",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 26,
    "volume_number": 1,
    "text": "This is also what Ibn al-Qayyim preferred, as he cited the scholars' opinions on the issue and then said: \"A seventh group said: These texts and their likes mentioned contain the requirement for punishment. However, the existence of the requirement for a ruling does not necessitate its existence [execution], for a ruling is only complete by the existence of its requirement and the absence of its impediment. The purpose of these texts is to inform that such an act is a cause for punishment and requires it. Evidence has established the mention of impediments; some by consensus and some by text. Repentance is an impediment by consensus. Tawheed is an impediment by Mutawatir texts that cannot be repelled. Great good deeds that erase sins are impediments. Major expiatory calamities are impediments. Establishing legal punishments (Hudud) in this world is an impediment by text. There is no way to suspend these texts, so one must apply the texts from both sides\" (1).",
    "foot_note": "1. (1) Madarij al-Salikin 1 / 396-397. See similar in: Sharh al-Nawawi 'ala Sahih Muslim 17 / 83, 18 / 159.",
    "book_id": "1145",
    "new_page_number": 29
  },
  {
    "serial_number": "7474593",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 27,
    "volume_number": 1,
    "text": "Muslim narrated on the authority of Jabir, may Allah be pleased with him, who said: \"When the Prophet, peace and blessings be upon him, migrated to Medina, Tufail bin Amr migrated to him, and a man from his people migrated with him. The climate of Medina did not suit them (1). The man fell ill and panicked, so he took arrows (Mashaqis) belonging to him (2) and cut his finger joints (Barajim) with them (3). His hands bled profusely (4) until he died. Tufail bin Amr saw him in his sleep; he saw him in a good state, but he saw him covering his hands. He said to him: 'What did your Lord do with you?' He said: 'He forgave me because of my migration to His Prophet, peace and blessings be upon him.' Tufail asked: 'Why do I see you covering your hands?' He said: 'I was told: We will not fix from you what you corrupted.' Tufail related this to the Messenger of Allah, peace and blessings be upon him, so the Messenger of Allah, peace and blessings be upon him, said: 'O Allah, forgive his hands too'\" (5).",
    "foot_note": "1. (1) 'Ijtawau': To find the place unwholesome and unsuitable. Ibn al-Athir said in Jami' al-Usul 10 / 222. Al-Nawawi said in his explanation of Sahih Muslim 2 / 131: \"It means: They disliked staying there due to distress and a type of illness. Al-Khattabi said: It originates from 'al-jawa', which is a disease affecting the insides.\"\n2. Plural of 'Mashqas', which is an arrow with a broad head. It is said: long, or what is long and broad. Al-Nawawi said: This is apparent here, due to his saying (cut his finger joints), which can only be done with something broad. See: Sharh al-Nawawi 'ala Sahih Muslim 2 / 131, and Jami' al-Usul 10 / 222.\n3. 'Barajim' (singular: Barjamah): The finger joints (knuckles). See: Sharh al-Nawawi 'ala Sahih Muslim 2 / 131, and Jami' al-Usul 10 / 222.\n4. 'Shakhabat' with Fatha on Sheen and Kha: Meaning their blood flowed, or flowed forcefully. See: Sharh al-Nawawi 'ala Sahih Muslim 2 / 131.\n5. Narrated by Muslim: 116.",
    "book_id": "1145",
    "new_page_number": 30
  },
  {
    "serial_number": "7474594",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 28,
    "volume_number": 1,
    "text": "This Hadith indicates the prohibition of a human killing himself and the magnitude of his punishment in the Hereafter. It also indicates that whoever kills himself without considering it lawful is not considered a disbeliever (Kafir). Therefore, Al-Nawawi titled the chapter: \"Chapter: Evidence that the one who kills himself does not become a disbeliever.\" He then said in the explanation of the Hadith: \"It contains an argument for a great principle of Ahlus-Sunnah: that whoever kills himself, or commits any other sin, and dies without repentance, is not a disbeliever, nor is it definitively decided that he goes to the Fire; rather, he is subject to the Will [of Allah]... This Hadith is an explanation for the Hadiths before it whose apparent meaning suggests the eternal residence of the suicide and other committers of major sins in the Fire\" (1). Just as it is not permissible to destroy the self completely, it is not permissible to cause it pain or destroy a limb from it, except for an interest that outweighs the harm of pain and amputation. If one needs to amputate a limb of his body, cauterize a part of it, or insert a needle into it for a benefit he hopes for his body or to ward off a harm he fears for it, there is no sin in that. This is because his interest returns to protecting the self, and it falls under the principle of committing the lesser of two harms to ward off the greater, or obtaining the higher of two benefits by forfeiting the lower. And Allah knows best.",
    "foot_note": "1. (1) Sharh al-Nawawi 'ala Sahih Muslim 2 / 131-132.",
    "book_id": "1145",
    "new_page_number": 31
  },
  {
    "serial_number": "7474595",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 29,
    "volume_number": 1,
    "text": "Second Requirement: Prohibition of Human Aggression Against Others.\nIf a human's aggression against himself is of such severity in prohibition and intensity in punishment, then his aggression against others is even more severely prohibited, greater in sin, harsher in punishment, and worse in consequence. Many texts in the Book and the Sunnah have come warning against that with severe warning, explaining its evil consequence and the magnitude of the perpetrator's punishment. Allah Almighty said: {And do not kill the soul which Allah has forbidden, except by right} [Al-Isra: 33]. This verse is a prohibition against killing the forbidden soul, whether it is a believer or a covenanted person (Mu'ahid), except by the right that necessitates its killing (1). And Almighty said: {And never is it for a believer to kill a believer except by mistake} [An-Nisa: 92]. And Almighty said: {But whoever kills a believer intentionally - his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and prepared for him a great punishment} [An-Nisa: 93]. What threat is greater than this threat?! It is a threat from which the skins of believers shiver, and their hearts are torn from its horror. It creates in their souls a strong deterrent and an internal restraint preventing them from transgressing against others and taking their lives unjustly and aggressively.",
    "foot_note": "1. (1) See: Tafsir Al-Qurtubi 7 / 133.",
    "book_id": "1145",
    "new_page_number": 32
  },
  {
    "serial_number": "7474596",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 30,
    "volume_number": 1,
    "text": "The specification of the 'believer' in the two previous verses should not be understood as permitting the killing of inviolable persons (Ma'sum) among non-believers, such as Dhimmis, Mu'ahids (covenanted), and Musta'mins (protected). However, He specified the believer to show that killing him is greater and more heinous, because his right upon his believing brother is greater and larger. Indeed, Allah has coupled killing without right with associating partners with Allah (Shirk) in more than one verse in His Book, as in His saying: {And those who do not invoke with Allah another deity or kill the soul which Allah has forbidden [to be killed], except by right, and do not commit unlawful sexual intercourse. And whoever should do that will meet a penalty. Multiplied for him is the punishment on the Day of Resurrection, and he will abide therein humiliated} [Al-Furqan: 68-69]. And His saying: {Say, 'Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him...'} to His saying: {And do not kill the soul which Allah has forbidden, except by right} [Al-An'am: 151]. Ibn Hazm said: \"There is no sin with Allah Almighty after Shirk greater than two things: One of them is intentionally leaving a mandatory prayer until its time exits. The second is killing a believing man or woman intentionally without right\" (1). Al-Shafi'i said: \"And there is nothing greater than it [meaning killing without right] after Shirk\" (2).",
    "foot_note": "1. (1) Al-Muhalla 10 / 342-343.\n2. Mukhtasar Al-Muzani p. 310, and Al-Furu' 6 / 45.",
    "book_id": "1145",
    "new_page_number": 33
  },
  {
    "serial_number": "7474597",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 31,
    "volume_number": 1,
    "text": "Indeed, Allah made killing a single soul without right like killing all people, and saving it like saving all people. He Almighty said: {Because of that, We decreed upon the Children of Israel that whoever kills a soul unless for a soul or for corruption [done] in the land - it is as if he had slain mankind entirely} [Al-Ma'idah: 32]. In this verse: Aggravation of the matter of killing, extreme exaggeration in deterring from it, and emphasis on the right of human life, so that no one is harmed in it without right (1). And His saying (and whoever saves it) implies encouragement to pardon the one whose killing has become obligatory [i.e., due to retribution but forgiven by family], and rescuing those involved in deadly situations like drowning, burning, or an enemy (2). Interpreters differed regarding the meaning of this comparison. Among the best of what was said about it is what Ibn al-Qayyim, may Allah have mercy on him, mentioned, where he said: \"Understanding this has been difficult for many people. It is said: It is known that the sin of killing one hundred is greater with Allah than the sin of killing one soul, but they were confused by thinking that the comparison is in the magnitude of sin and punishment, and the wording suggests this. But it does not follow from comparing one thing to another that it takes all its rulings. If it is said: In what aspect did the comparison occur between the killer of one soul and the killer of all people? It is said: In several aspects:",
    "foot_note": "1. (1) See: Fath al-Bari 12 / 192, and Human Rights by Al-Ghazali p. 56.\n2. See: Tafsir Ibn Kathir 3 / 87, and Fath al-Qadir 2 / 34.",
    "book_id": "1145",
    "new_page_number": 34
  },
  {
    "serial_number": "7474598",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 32,
    "volume_number": 1,
    "text": "First: That each of them is disobedient to Allah and His Messenger, peace and blessings be upon him, violating His command, exposing himself to His punishment. Each of them has incurred Allah's wrath and curse, deserves eternal residence in the fire of Hell, and has a great punishment prepared for him. The difference is only in the depths/degrees of punishment. For the sin of one who kills a Prophet, a just Imam, or a scholar who commands people to justice is not like the sin of one who kills an ordinary person with no distinction.\nSecond: That they are equal regarding the deserving of the forfeiture of life [i.e., killing via retribution/Qisas].\nThird: That they are equal in the audacity to shed forbidden blood. For whoever kills a soul without entitlement—rather for mere corruption in the land or to take his wealth—has dared to kill everyone he overpowers and is able to kill; thus he is an enemy to the human species.\nAmong them: He is called a killer, a sinner (Fasiq), a wrongdoer, or disobedient by killing one, just as he is named so by killing all people.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 35
  },
  {
    "serial_number": "7474599",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 33,
    "volume_number": 1,
    "text": "Among them: Allah - Glory be to Him - made the believers in their mutual love, mercy, and connection like a single body; if one member complains, the rest of the body calls out to it with fever and sleeplessness. If the killer destroys a member of this body, it is as if he destroyed the rest of the body and pained all its members. So whoever harms one believer, it is as if he harmed all believers, and in harming all believers is the harm of all people, for Allah defends people by means of the believers among them. Thus, harming the guard is harming the guarded\" (1). As for the Hadiths regarding the prohibition of killing and the ugliness of the matter, they are very many. Among them are the following:\n1. The Hadith of Ibn Masud, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"The first thing that will be judged between people on the Day of Resurrection is regarding blood\" (2). In this Hadith is the aggravation of the matter of blood, and that it is the first thing judged among people on the Day of Resurrection due to the greatness of its matter and the severity of its danger (3). Ibn Hajar said: \"The Hadith shows the greatness of the matter of blood, for the beginning is only with the most important. A sin becomes great according to the greatness of the corruption and the missing of benefit, and the destruction of the human structure is the ultimate in that\" (4).\n2. The Hadith of Ibn Umar, may Allah be pleased with them both, who said: The Messenger of Allah, peace and blessings be upon him, said: \"A believer continues to be in scope [leeway] regarding his religion as long as he does not shed forbidden blood\" (5).",
    "foot_note": "1. (1) Al-Jawab al-Kafi, p. 174-175.\n2. Narrated by Al-Bukhari: 6533, 6864, and Muslim: 1678.\n3. See: Sharh al-Nawawi 'ala Sahih Muslim 11 / 167, and Nayl al-Awtar 7 / 197.\n4. Fath al-Bari 11 / 397.\n5. Narrated by Al-Bukhari: 6862.",
    "book_id": "1145",
    "new_page_number": 36
  },
  {
    "serial_number": "7474600",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 34,
    "volume_number": 1,
    "text": "Fushah (Scope/Leeway) means delay and capacity. The meaning is: his religion becomes constricted upon him due to the threat against one who kills a believer intentionally without right (1). Ibn Hajar quoted Ibn al-Arabi saying: \"Scope in religion: the capacity of good deeds, such that if killing occurs, they become constricted because they cannot suffice for its burden\" (2). Abdullah bin Umar, may Allah be pleased with them both, said: \"Among the predicaments of affairs from which there is no exit for the one who throws himself into them is the shedding of forbidden blood without its lawful right\" (3).\n3. The Hadith of Al-Bara bin Azib, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"The passing away of the world is lighter to Allah than the killing of a believer without right\" (4). In this Hadith is the aggravation of the matter of killing and the horror of its status.\n4. His saying, peace and blessings be upon him: \"Every sin might be forgiven by Allah, except for a man who kills a believer intentionally, or a man who dies as a disbeliever\" (5).",
    "foot_note": "1. (1) See: Fath al-Bari 12 / 188.\n2. Fath al-Bari 12 / 188.\n3. Narrated by Al-Bukhari: 6470.\n4. Narrated by Ibn Majah: 2619. The Hadith has supporting evidences from a group of Companions in Tirmidhi, Nasa'i, Bayhaqi and others. Al-Mundhiri mentioned them in Al-Targhib wa Al-Tarhib 3 / 293-294, and Ibn al-Athir in Jami' al-Usul 10 / 208-209. Al-Busiri said in 'Zawaid Ibn Majah' 2 / 334 about the Hadith of Al-Bara: \"This chain is authentic, its men are trustworthy. It has a witness from the Hadith of Abdullah bin Amr narrated by Tirmidhi as Marfu' and Mawquf, and he said: This is more correct than the Marfu' Hadith. Nasa'i narrated it in 'Al-Sughra' from the Hadith of Buraydah bin Al-Husaib, and from the Hadith of Abdullah bin Masud.\" Al-Mundhiri said in Al-Targhib wa Al-Tarhib 3 / 293: \"Narrated by Ibn Majah with a good (Hasan) chain, and narrated by Al-Bayhaqi and Al-Asbahani.\" Al-Suyuti authenticated it in 'Al-Jami' al-Saghir' 2 / 403, and Al-Albani in 'Sahih Sunan Ibn Majah' 2 / 92.\n5. Narrated by Abu Dawood via Abu Darda: 4270, and Nasa'i via Muawiyah bin Abi Sufyan: 3984. Al-Suyuti authenticated it in 'Al-Jami' al-Saghir' 2 / 280. Al-Arnaut said about the Hadith of Muawiyah: It is a Hasan Hadith, and about the Hadith of Abu Darda: Its chain is authentic. Jami' al-Usul edited by Al-Arnaut 10 / 206, 208.",
    "book_id": "1145",
    "new_page_number": 37
  },
  {
    "serial_number": "7474601",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 35,
    "volume_number": 1,
    "text": "5. The Hadith of Miqdad bin Amr Al-Kindi, may Allah be pleased with him, who was among those who witnessed Badr with the Prophet, peace and blessings be upon him, said: \"O Messenger of Allah, suppose I met a disbeliever and we fought, and he struck one of my hands with the sword and cut it off, then he took refuge from me by a tree and said: 'I have submitted (became Muslim) to Allah.' Should I kill him after he said it? The Messenger of Allah, peace and blessings be upon him, said: Do not kill him. He said: O Messenger of Allah, he cut off one of my hands and then said that after cutting it? He said: Do not kill him, for if you kill him, he is in your position before you killed him, and you are in his position before he said the word he said\" (1). The meaning of his saying: \"You are in his position before he said the word\" is that your blood becomes permissible by the right of retribution (Qisas), because you killed an inviolable Muslim unjustly and aggressively, just as his blood was permissible when he was a disbeliever waging war against Muslims. It does not mean equating him with him in disbelief, as the Khawarij say regarding declaring a Muslim a disbeliever due to a major sin. Other interpretations have also been given (2).",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 3794, and Muslim: 95.\n2. See: Nayl al-Awtar 7 / 202-203.",
    "book_id": "1145",
    "new_page_number": 38
  },
  {
    "serial_number": "7474602",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 36,
    "volume_number": 1,
    "text": "Among the famous stories that indicate the heinousness of killing and its evil consequence is the story of Usama bin Zaid, may Allah be pleased with them both. Let us listen to him as he says: \"The Messenger of Allah, peace and blessings be upon him, sent us to Al-Huraqa from Juhaynah. He said: We attacked the people in the morning and defeated them. I and a man from the Ansar caught up with a man from them. When we overcame him, he said: 'There is no god but Allah.' The Ansari held back from him, but I stabbed him with my spear until I killed him. When we returned, that reached the Prophet, peace and blessings be upon him, so he said to me: 'O Usama, did you kill him after he said La ilaha illa Allah?' I said: 'O Messenger of Allah, he was only seeking refuge/protection.' He said: 'Did you kill him after he said La ilaha illa Allah?' He kept repeating it to me until I wished I had not become Muslim before that day.\" This man was a disbeliever fighting Muslims, and when he was certain he would be killed, he accepted Islam outwardly in a manner containing clear doubt. Yet, the Prophet, peace and blessings be upon him, regarded his killing with severe gravity and rebuked Usama with this great rebuke, until Usama wished he had lost his previous good deeds and precedence in religion and that he had been safe from the consequence of his killing, the omen of this sin, and its evil outcome, and that he had only accepted Islam on that day.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 39
  },
  {
    "serial_number": "7474603",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 37,
    "volume_number": 1,
    "text": "The Prophet, peace and blessings be upon him, did not suffice with what was mentioned regarding the sanctity of blood and explaining its danger. Rather, he emphasized its prohibition and instilled reverence and magnification for it in souls by comparing it to what Muslims have agreed upon revering and magnifying: the Sacred City and the Sacred Month. This was on a witnessed day, in a blessed place, and a great gathering attended by more than one hundred thousand Muslims, when he addressed the people on the Day of Sacrifice at Mina during the Farewell Pilgrimage. In the two Sahihs, on the authority of Ibn Umar, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said during the Farewell Pilgrimage: \"'Behold, which month do you know to be most sacred?' They said: 'Behold, this month of ours.' He said: 'Behold, which land do you know to be most sacred?' They said: 'Behold, this land of ours.' He said: 'Behold, which day do you know to be most sacred?' They said: 'Behold, this day of ours.' He said: 'Verily, Allah the Blessed and Exalted has forbidden your blood, your wealth, and your honor upon you, except by its right, like the sanctity of this day of yours, in this land of yours, in this month of yours. Behold, have I conveyed?' Three times. They answered him each time: 'Behold, yes.' He said: 'Woe to you, or Wylakum! Do not return after me as disbelievers striking the necks of one another'\" (1). Indeed, the Prophetic Sunnah has indicated that aggression against an animal by taking its life unjustly and aggressively is a crime whose perpetrator deserves entering the Fire.",
    "foot_note": "1. (1) Narrated by Al-Bukhari: 6785, and Muslim: 66. The Hadith is narrated in the two Sahihs and others via a number of Companions with similar wordings.",
    "book_id": "1145",
    "new_page_number": 40
  },
  {
    "serial_number": "7474604",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 38,
    "volume_number": 1,
    "text": "In the two Sahihs, on the authority of Abdullah bin Umar, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, said: \"A woman entered the Fire because of a cat she tied up; she did not feed it, nor did she let it eat from the vermin of the earth\" (1). In a narration by them: \"A woman was tormented because of a cat she imprisoned until it died, so she entered the Fire because of it. She did not feed it or give it water when she confined it, nor did she leave it to eat from the vermin of the earth\" (2). If this is the punishment for killing an animal without right, then what about killing an inviolable human? And what about a Muslim? And what about a righteous pious person?!! (3). Whoever contemplates the previous texts finds that most of them came general and absolute, covering all inviolable persons among believers and disbelievers. What was specified therein regarding the believer was only due to the greatness of his right and sanctity; it does not in any way indicate the permissibility of killing an inviolable disbeliever without right. This is confirmed to you by many Hadiths indicating the prohibition of killing non-combatant disbelievers among Dhimmis, Mu'ahids (covenanted), and Musta'mins (protected). Among them are the following:\n1- On the authority of Abdullah bin Amr, may Allah be pleased with them both, from the Prophet, peace and blessings be upon him, who said: \"Whoever kills a Mu'ahid (person under covenant) will not smell the fragrance of Paradise, and indeed its fragrance can be found from a distance of forty years\" (4).",
    "foot_note": "1. (1) i.e., its insects and bugs.\n2. Narrated by Al-Bukhari: 3318, and Muslim: 2242.\n3. See: Fath al-Bari 12 / 189, and Al-Jawab al-Kafi, p. 177.\n4. Narrated by Al-Bukhari: 2995.",
    "book_id": "1145",
    "new_page_number": 41
  },
  {
    "serial_number": "7474605",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 39,
    "volume_number": 1,
    "text": "2- On the authority of Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"Behold, whoever kills a covenanted soul (Nafs Mu'ahidah) that has the pact of Allah and the pact of His Messenger, has betrayed Allah's pact. He will not smell the fragrance of Paradise, and indeed its fragrance is found from a distance of seventy autumns\" (1).\n3- On the authority of Abu Bakra, may Allah be pleased with him, who said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever kills a Mu'ahid outside his proper time [unjustly] (2), Allah forbids Paradise for him\" (3). In a narration by Al-Nasa'i: \"Whoever kills a covenanted soul without its lawful right, Allah forbids him Paradise, that he may smell its fragrance.\"\nThe scholar Al-Shawkani said: \"The Mu'ahid is the man from the abode of war who enters the abode of Islam with safety (Aman). It is forbidden for Muslims to kill him without dispute among the people of Islam until he returns to his place of safety. This is also indicated by His saying, the Almighty: {And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety.} [At-Tawbah: 6]. And his saying: 'Did not smell (yarah) the fragrance of Paradise', with Fatha on the first letter of 'yarah'; its root is 'raha ash-shay', meaning he found its scent. 'Lam yarahhu' means he did not find its scent. 'Fragrance of Paradise' means its good breeze. This is a metonymy for the non-entry of the one who kills a Mu'ahid into Paradise, because if he does not smell its breeze which is found from a distance of forty years, he will not enter it.",
    "foot_note": "1. (1) Narrated by Al-Tirmidhi: 1403, and Ibn Majah: 2687. Al-Tirmidhi said: Hasan Sahih Hadith.\n2. Meaning: Not in the time when it is permissible to kill him.\n3. Narrated by Abu Dawood: 2760, Al-Nasa'i: 4747, and in Al-Sunan Al-Kubra: 6949, Al-Darimi: 2504, Ahmad 5 / 36, 38, and Al-Bayhaqi in Al-Sunan Al-Kubra: 9 / 231.",
    "book_id": "1145",
    "new_page_number": 42
  },
  {
    "serial_number": "7474606",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Confronting Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Awqaf website without data",
    "page_number": 40,
    "volume_number": 1,
    "text": "His saying: 'Has betrayed (Akhfara) Allah's pact', with Kha, Fa, and Ra, means: he broke his covenant and acted treacherously. Both Hadiths contain an intensification of the threat against the killer of a Mu'ahid, indicating his eternal residence in the Fire and non-exit from it, and the prohibition of Paradise for him, even though a difference of opinion has occurred among scholars regarding the killer of a Muslim: does he abide eternally in it or exit from it?\" (1). Scholars have unanimously agreed on the prohibition of treachery. Many texts in the Book and the Sunnah have been reported prohibiting treachery and threatening its perpetrator with disgrace and painful punishment (2). If this is the severe threat regarding killing individual Mu'ahids, Dhimmis, and Musta'mins, then what about blowing up their houses and buildings, demolishing them on their heads, and killing the women and children inside them? Bearing in mind that killing these categories among combatant disbelievers is forbidden and not permissible by the consensus of scholars except in necessity (3). So how about the women and children of the inviolable Dhimmis, Mu'ahids, and Musta'mins? Is this anything but opposing Allah Almighty and His Messenger, peace and blessings be upon him, treachery in pacts, breaking of contracts, and committing one of the greatest crimes and one of the gravest injustices?! Along with what it contains of distorting the image of Islam and Muslims, blocking the straight path of Allah, and alienating people from entering His religion which He revealed as a mercy to the worlds.",
    "foot_note": "1. (1) Nayl al-Awtar 7 / 155-156.\n2. See: Al-Tamhid by Ibn Abd al-Barr 24 / 233-234.\n3. The Hadiths and reports from the Messenger of Allah, peace and blessings be upon him, and his successors, indicating the prohibition of killing women and children who do not participate in fighting are very many. Ibn Abd al-Barr mentioned a number of them in 'Al-Tamhid' 16 / 135-142, and narrated the consensus of scholars on that. Likewise, Ibn Kathir in his Tafsir: 1 / 227, and Al-Shawkani in Nayl al-Awtar: 8 / 71-73.",
    "book_id": "1145",
    "new_page_number": 43
  },
  {
    "serial_number": "7474607",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 41,
    "volume_number": 1,
    "text": "The Second Topic: The Prohibition of Forbidding Evil if it Necessitates What is More Evil. Enjoining good and forbidding evil were legislated solely to acquire interests (benefits) and repel corruptions (harms). Therefore, they fall under a magnificent, well-known rule upon which all rulings of the Sharia revolve: the rule of 'Interests and Corruptions (Masalih and Mafasid).' (1) Thus, if enjoining good and forbidding evil causes the loss of an interest greater than the interest of performing them, or brings about a corruption greater than the corruption of leaving them, then commanding and forbidding in this case is prohibited, because it contradicts the wisdom for which they were legislated. Sheikh al-Islam Ibn Taymiyyah said: 'If enjoining good and forbidding evil are among the greatest obligations or recommended acts, then the obligations and recommendations must act so that the benefit within them outweighs the harm. It is for this that the Messengers were sent and the Books revealed, and Allah does not love corruption. Rather, everything Allah commanded is reform (Salah), and Allah has praised reform and the reformers, and those who believe and do righteous deeds, and He condemned corruption and corrupters in many places. Thus, wherever the harm of commanding and forbidding is greater than its benefit, it is not part of what Allah commanded, even if a duty was abandoned and a prohibition committed; for the believer must fear Allah concerning Allah's servants, and he is not responsible for their guidance.' (2)",
    "foot_note": "1. (1) Sheikh Abd al-Rahman al-Sa'di said in his book 'Al-Qawa'id wal-Usul al-Jami'ah' (The Comprehensive Rules and Principles) within the complete collection of his works 4 / 22: 'The First Rule: The Lawgiver does not command anything unless its benefit is pure or predominant, and does not forbid anything unless its harm is pure or predominant.' Then he said: 'This principle encompasses the entire Sharia; nothing of its rulings deviates from it, whether related to fundamentals or branches, or related to the rights of Allah or the rights of His servants.' Then he detailed that. The magnanimous Imam Izz al-Din ibn Abd al-Salam authored a precious book on this, titling it: 'Qawa'id al-Ahkam fi Masalih al-Anam' (Rules of Rulings regarding the Interests of People). Among what came in it is his saying in 1 / 83-84: 'If interests and corruptions are combined, if it is possible to acquire the interests and repel the corruptions, we do so. If repelling and acquiring are impossible, then if the corruption is greater than the interest, we repel the corruption and do not mind the loss of the interest. If the interest is greater than the corruption, we acquire the interest while accepting the corruption. If the interests and corruptions are equal, one may choose between them, or pause regarding them, and there may be a difference of opinion regarding the variation of corruptions.' Then he began to give examples of that. Imam Ibn al-Qayyim has precious words regarding this rule in 'Miftah Dar al-Sa'adah' 2 / 14-24, and Ali ibn Ahmad al-Nadwi has good words about it in 'Al-Qawa'id al-Fiqhiyyah', pp. 276-280.\n2. Al-Istiqamah 2 / 211, and Al-Amr bi-l-Ma'ruf wa an-Nahy 'an al-Munkar, pp. 38-39.",
    "book_id": "1145",
    "new_page_number": 44
  },
  {
    "serial_number": "7474608",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 42,
    "volume_number": 1,
    "text": "Then he said: 'The summary of that falls under the general rule regarding when interests and corruptions, and good deeds and bad deeds, conflict or crowd one another. It is obligatory to prefer the preponderant one among them when interests and corruptions crowd, and interests and corruptions conflict. For indeed, the command and prohibition, even if they imply the acquisition of an interest and the repulsion of a corruption, one must look at what opposes it. If what is missed of interests or what occurs of corruptions is greater, then it is not commanded; rather, it becomes prohibited if its corruption is greater than its benefit. However, the consideration of the magnitudes of interests and corruptions is by the scale of the Sharia. Whenever a person is able to follow the texts, he does not deviate from them; otherwise, he exerts his opinion (Ijtihad) to know the similarities and analogues. It is rare that texts fail one who is expert in them and their indications of rulings. Based on this, if a person or a group combines good and evil such that they do not separate them—meaning they either do them both or leave them both—it is not permissible to command them to do the good nor forbid them from the evil. Rather, one looks: if the good is greater, it is commanded, even if it necessitates the lesser evil associated with it.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 45
  },
  {
    "serial_number": "7474609",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 43,
    "volume_number": 1,
    "text": "And he is not forbidden from an evil if it necessitates missing a good that is greater than it. Rather, the prohibition in that case would be from the category of blocking the path of Allah, and striving for the removal of His obedience and the obedience of His Messenger (peace be upon him), and the removal of doing good deeds. And if the evil is predominant, it is forbidden, even if it necessitates the loss of a lesser good associated with it. Commanding that good which necessitates the evil exceeding it would be a command to do evil, and a striving in disobedience to Allah and His Messenger. And if the good and evil that are inseparable are equal, they are neither commanded nor forbidden. Sometimes commanding is appropriate, sometimes forbidding is appropriate, and sometimes neither commanding nor forbidding is appropriate, where the evil and good are inseparable; this applies to specific occurrences. As for the generic type, good is commanded absolutely, and evil is forbidden absolutely. Regarding a single actor or a single group: its good is commanded and its evil is forbidden, its praiseworthy aspects are praised and its blameworthy aspects are blamed, such that the command to do good does not imply the loss of a greater good or the occurrence of an evil exceeding it, nor does the prohibition of evil imply the occurrence of what is more evil than it, or the loss of a good that is weightier than it.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 46
  },
  {
    "serial_number": "7474610",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 44,
    "volume_number": 1,
    "text": "If the matter is ambiguous, the believer pauses until the truth becomes clear to him. He does not proceed to obedience except with knowledge and intention. If he abandons it, he is disobedient; abandoning the obligatory command is disobedience, and doing what was forbidden regarding the command is disobedience. This is a vast chapter, and there is no power nor strength except through Allah. From this chapter is: The Prophet's (peace be upon him) acceptance of Abdullah bin Ubayy and his likes from among the leaders of hypocrisy and wickedness, because of the supporters they had. Removing his evil through a type of punishment would have necessitated removing a good greater than that due to the anger of his people and their tribalism, and the alienation of people if they heard that Muhammad kills his companions.' (1)",
    "foot_note": "1. (1) Al-Istiqamah 2 / 216-219, and Al-Amr bi-l-Ma'ruf wa an-Nahy 'an al-Munkar, pp. 40-42.",
    "book_id": "1145",
    "new_page_number": 47
  },
  {
    "serial_number": "7474611",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 45,
    "volume_number": 1,
    "text": "Ibn al-Qayyim said: 'The Prophet (peace be upon him) legislated for his nation the obligation of denying evil so that by its denial, a good that Allah and His Messenger love is achieved. If denying the evil necessitates what is more evil than it and more detested by Allah and His Messenger, then denying it is not permissible, even if Allah detests it and abhors its people. This is like denying [the actions of] kings and governors by rebelling against them, for that is the foundation of every evil and sedition (fitnah) until the end of time. The Companions asked the Messenger of Allah (peace be upon him) for permission to fight the leaders who delay the prayer beyond its time, saying: 'Shall we not fight them?' He said: (No, as long as they establish the prayer.) (1) And he said: (Whoever sees from his leader something he dislikes, let him be patient and not withdraw his hand from obedience.) (2) Whoever contemplates what has befallen Islam during the major and minor tribulations will see that they arose from neglecting this principle and a lack of patience with an evil, leading to an attempt to remove it, which then generated what was greater than it. The Messenger of Allah (peace be upon him) used to see the greatest evils in Mecca and was unable to change them. (3) Indeed, even when Allah opened Mecca and it became an abode of Islam, he resolved to change the House (Kaaba) and return it to the foundations of Abraham, but he was prevented from that—despite his ability to do so—by the fear of something greater occurring: the inability of Quraysh to tolerate that, due to their proximity to the era of Islam and their being new to leaving disbelief. (4)",
    "foot_note": "1. (1) The Hadith was narrated by Muslim: 8541, 1855.\n2. The Hadith is agreed upon (Bukhari and Muslim) with the wording: (Whoever sees from his leader something he dislikes, let him be patient, for whoever separates from the group by a handspan and dies, dies a death of Jahiliyyah). Narrated by Al-Bukhari: 7054, 7143, and Muslim: 1849.\n3. An example of this is that before the Hijrah, he used to see idols hanging on the wall of the Kaaba, worshipped instead of Allah, yet he did not proceed to break any of them, even though they were among the greatest and most explicit evils.\n4. He refers to the Hadith of Aisha, may Allah be pleased with her, who said: The Messenger of Allah (peace be upon him) said to me: (Were it not for your people's recent emergence from disbelief, I would have demolished the Kaaba and built it on the foundations of Abraham, for when Quraysh built the House, they shortened it.) Narrated by Al-Bukhari with similar wordings in many places, including: 1583, and Muslim: 1333.",
    "book_id": "1145",
    "new_page_number": 48
  },
  {
    "serial_number": "7474612",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 46,
    "volume_number": 1,
    "text": "For this reason, he did not permit denying rulers by hand (force), because of what results from it of the occurrence of what is greater than it. Denying evil has four degrees: First: That it disappears and is replaced by its opposite (good). Second: That it decreases, even if it does not disappear entirely. Third: That it is replaced by what is equal to it. Fourth: That it is replaced by what is worse than it. The first two degrees are legislated, the third is a matter of independent judgment (ijtihad), and the fourth is prohibited. If you see people of wickedness and immorality playing chess, denying them would be a lack of understanding and insight unless you transfer them from it to what is more beloved to Allah and His Messenger, such as archery (1) and horse racing and the like. And if you see sinners gathered over amusement and play, or listening to whistling and clapping (2), if you transfer them from it to the obedience of Allah, then that is the goal. Otherwise, leaving them to that is better than emptying them for what is greater than that, for what they are engaged in occupies them from that. Just as if a man is occupied with books of obscenity and the like, and you fear that transferring him from them will lead to his moving to books of innovation (bid'ah), misguidance, and sorcery, then leave him with his first books. This is a vast chapter. (3) By this, we know that enjoining good and forbidding evil become prohibited if they imply the loss of a greater interest or the bringing about of a greater sedition (fitnah) and corruption.",
    "foot_note": "1. (1) Meaning: Arrows. See: Al-Qamus, p. 176.\n2. He said in Al-Qamus p. 1721: 'Maka makwan wa muka'an: He whistled with his mouth, or interlaced his fingers and blew into them.' And he said in p. 1679: 'Al-Tasdiyah: Clapping.'\n3. I'lam al-Muwaqqi'in 3 / 4-5.",
    "book_id": "1145",
    "new_page_number": 49
  },
  {
    "serial_number": "7474613",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 47,
    "volume_number": 1,
    "text": "It is not permissible for enjoining good to lead to the negation of a known good greater than it, nor for forbidding evil to lead to the occurrence of an evil more severe than it. When interests crowd, we acquire the highest of them even by missing the lowest; and when corruptions crowd, we ward off the highest of them even by committing the lowest. We choose the better of the two goods and ward off the worse of the two evils. Among the examples that reveal this truth: one who targets a residential or commercial complex, a government department, or a private company, blowing it up with explosives and killing those inside, under the pretext that there are disbelievers in it, or that some evils are practiced therein. Or like one who targets a shop selling lewd songs or indecent films, burning or bombing it, while knowing that behind it is an authority guarding it and a law protecting it. Thus, from that act arise corruptions and evils manifold times the evil he undertook to change. Many of the seditions (fitnahs) and gross errors in the chapter of enjoining good and forbidding evil have only occurred due to the neglect of this great principle and the failure to look at the outcomes of matters, their consequences, and their ends.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 50
  },
  {
    "serial_number": "7474614",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 48,
    "volume_number": 1,
    "text": "This matter is a slippery slope and a place where understanding can go astray. No one masters it and succeeds in it except the acting scholars and the experienced people of reason, who have understood the Sharia, known its objectives, probed the depth of reality, and thought about the consequences of affairs. Thus, they combined knowledge of the Sharia with knowledge of reality and knowledge of the outcomes of matters and what they turn into. Among the major errors in this chapter is what we witness from some enthusiastic youth. When they see major evils, their abundance, their severe spread, their public declaration, and their support and consolidation by some officials and influential people, their anger for Allah intensifies, their religious zeal erupts, their blood boils in their veins, and pain squeezes their hearts. They cannot bear seeing it and are not satisfied with silence over it. So, they rush to change it by force, perhaps by drawing weapons and gathering supporters, without thinking about the consequences of their action and the proximate and remote harms and corruptions that result from it—which harm them and others, and indeed, harm their religion to which they belong, as their actions are attributed to it.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 51
  },
  {
    "serial_number": "7474615",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 49,
    "volume_number": 1,
    "text": "Yes, these people might succeed in changing a small evil, but they cause the loss of many types of good and bring about types of evil far greater than what they removed. They are like one who builds a palace but destroys a city (Misr). Therefore, it is not permissible to use force except in accordance with interest and wisdom, and where the interest in using it is apparent. As for changing by force turning into unstudied emotional outbursts, temporary uninsightful reactions, and reckless enthusiasm that entangles one in actions that harm and do not benefit—this is not of interest (Maslahah) in anything; rather, its corruption is preponderant and its harm is clearly evident. Indeed, what such action drags along of violating sanctities, multiplying evils, causing the humiliation of good people, restricting the Call to Allah (Da'wah), the recession of its tide, the alienation of its people, and perhaps their killing and the violation of their privacy, and the like, is far greater than the evil it removed.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 52
  },
  {
    "serial_number": "7474616",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 50,
    "volume_number": 1,
    "text": "Whoever causes that bears a burden and is not rewarded, and his good intent, safety of purpose, and desire for good do not avail him. For how many desire good but do not reach it. Along with safety of intention, there must be safety of action, and it must be in accordance with the Sharia. Work is not accepted by Allah Almighty, nor is its doer rewarded, until it is sincere and correct. Sincere means it is for Allah, and correct means it is upon the Sunnah, as Allah Almighty said: {So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.} [Al-Kahf: 110]. (1) The one who contemplates some of what these hasty ignorant ones do realizes the extent of the harms and dangers that arise from their actions, which inflict severe damage on them and others, and bring upon the nation colors of woes and calamities, destroying its security, weakening its status, damaging its economy, spreading chaos, and causing sedition and unrest to prevail. (2) And worse and more bitter than that is: that they draw weapons and unsheathe swords to deny evils and fight the people of falsehood. This is not permissible except for the Imam (Leader) or one he deputizes. Individual subjects cannot independently undertake it because it leads to inciting sedition, the raging of corruption, the destruction of security, and the abundance of killing and confusion (Harj and Marj). (3)",
    "foot_note": "1. (1) See: What Ibn Kathir mentioned regarding this verse.\n2. See: Min Wasa'il Daf' al-Ghurbah (From the Means of Repelling Alienation), pp. 144-145.\n3. See: Al-Ihya' with its explanation 8 / 98.",
    "book_id": "1145",
    "new_page_number": 53
  },
  {
    "serial_number": "7474617",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 51,
    "volume_number": 1,
    "text": "Imam al-Haramayn said: 'It is permissible for individual subjects: to stop the perpetrator of a major sin if he is not repelled from it by words, as long as the matter does not end up in setting up combat and drawing weapons. If the matter ends up in that, the matter is tied to the Sultan.' (1) He also said: 'Individual people are only forbidden from drawing weapons independently if there is in that time a ruler (Wazir) standing over the people of Islam. (2) Our forbidding the subjects from independence with their lives is of the sort of urging towards what is closer to rectification and nearer to success. For what the Sultan undertakes of matters of politics is more effective, more beneficial, more repelling of rivalry, and more gathering of the scattered. In giving subjects possession over matters of blood and drawing weapons, there are aspects of madness that people of intellect do not deny. If people do not find a caretaker of their affairs to seek refuge with, it is impossible that they be commanded to sit back from what they are capable of in repelling corruption; for if they retired from the possible, corruption would encompass the lands and the servants. But if they are commanded to retire while the Sultan is standing, the holder of authority suffices them the important matters and approaches them from the nearest directions.' (3) Qadi Iyad said: 'If he finds someone to seek help from for that [meaning: denying evil], he seeks help, as long as that does not lead to displaying weapons and war. Let him raise that to the one who holds authority.' (4)",
    "foot_note": "1. (1) Sharh al-Nawawi 'ala Sahih Muslim 2 / 25.\n2. Meaning: An Imam undertaking their interests.\n3. Ghiyath al-Umam fi Iltiyath al-Zulam, pp. 279-280.\n4. Sharh al-Nawawi 'ala Sahih Muslim 2 / 25.",
    "book_id": "1145",
    "new_page_number": 54
  },
  {
    "serial_number": "7474618",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 52,
    "volume_number": 1,
    "text": "And Ibn al-Arabi said: 'If he is unable except by fighting and weapons, let him leave it. That is only for the Sultan, because drawing weapons among people may be an exit into sedition (fitnah), leading to corruption greater than enjoining good and forbidding evil.' (1) What is happening in our reality today is the truest witness to this. How much blood has been shed, how many sanctities violated, how much injustice and aggression has occurred, how much fear and disturbance has spread, and how many interests have been disrupted because of drawing weapons, encroaching upon the rulers, and denying by force?!! And this denial might be regarding matters that are not evil in reality; rather, they are among what the Sharia establishes, sound minds call for, and the interest of the nation requires. How excellent is this Sharia! How wise it is! How numerous are its virtues! How preserving it is of people's interests! And how indicative it is that it is a revelation from a Wise, Praiseworthy One, who knows what He created, and He is the Subtle, the Acquainted!!",
    "foot_note": "1. (1) Ahkam al-Qur'an 1 / 293.",
    "book_id": "1145",
    "new_page_number": 55
  },
  {
    "serial_number": "7474619",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 53,
    "volume_number": 1,
    "text": "Conclusion. After this blessed tour into the aspects of this important subject, we conclude with the following results: 1- The importance of security, and that it is an urgent human need and an innate requirement without which life is not upright, and no individual or society can dispense with it. 2- That Islam has its unique method in achieving security and combating aggression and violence. 3- The misguidance of creation, despite the multiplicity of its forms and types, and the variety of its manifestations and shapes—whether in ideas and concepts, or morals and behaviors, or actions and practices—returns in its reality to two main causes: The first: Ignorance or Blindness. The second: Injustice or Desire (Hawa). 4- If you contemplate the conditions of the negligent sinners, the misguided innovators, and the harsh extremists, you would find that they only came from the direction of these two matters or one of them. Ignorance is the root of the two misguidances and the more dangerous of the two evils. 5- Every knowledge upon which the performance of a duty or the abandonment of a prohibition depends, learning it is an individual obligation (Fard Ayn) upon every responsible Muslim. As for what exceeds that of Sharia or worldly sciences that the nation needs, learning these is a collective obligation (Fard Kifayah). 6- Those who know and those who do not know are not equal. The difference is vast and the distance is great between the insightful scholar and the ignorant worshiper, and the reasons for that are many and apparent.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 56
  },
  {
    "serial_number": "7474620",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 54,
    "volume_number": 1,
    "text": "7- The obligation to beware of misleading Imams, ignorant pretenders to knowledge, and those who put themselves forward for Fatwa while not being qualified for it. 8- When the Prophet (peace be upon him) warned against the Fitnah of the Khawarij and commanded killing them, he clarified that they were afflicted only because of their ignorance and lack of understanding. So they committed crimes against themselves and their nation, and their good intention, safety of purpose, and abundance of worship did not intercede for them. 9- The human soul is not his property; rather, it is the property of its Creator and Originator, Mighty and Majestic is He. It is a trust with its owner. Therefore, it is not permissible for him to kill himself, nor to risk it in other than a Sharia-compliant interest, nor to dispose of any of its parts except in what returns benefit to it or wards off harm from it. 10- Casting oneself into destruction (Tahlikah) is either by abandoning what the servant was commanded to do, if leaving it causes or approaches the destruction of the body or soul, or it is by doing what leads to the ruin of the self or soul.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 57
  },
  {
    "serial_number": "7474621",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 55,
    "volume_number": 1,
    "text": "11- The texts that imply eternal abode for the one who kills himself, or kills another unjustly and aggressively, regarding them it is said: The ruling is only completed by the existence of its requisite and the absence of its impediment. The purpose of these texts is the notification that such an act is a cause for punishment and necessitates it. Evidence has been established regarding the mention of impediments: some by consensus (Ijma'), and some by text. Repentance is an impediment by consensus. Monotheism (Tawhid) is an impediment by mutawatir texts that cannot be repelled. Establishing the prescribed punishments (Hudud) in this world is an impediment by text. There is no way to nullify these texts, so they all must be applied. 12- Many texts have come in the Book and the Sunnah warning severely against killing without right, explaining its evil consequence and the greatness of the punishment of its doer, and they are general regarding the believer and the disbeliever. 13- It is not permissible to kill non-combatant disbelievers among the Covenanters (Mu'ahidin), the Protected People (Dhimmis), and Seekers of Protection (Musta'mininh), without right. Many texts have been reported forbidding their killing and threatening those who do so with severe exemplary punishment and painful torment. The scholars have agreed (Ijma') on that, just as they agreed on the prohibition of treachery and breaking covenants.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 58
  },
  {
    "serial_number": "7474622",
    "category_id": "39",
    "category": "General Books",
    "book_title": "The Impact of Sharia Knowledge in Countering Violence and Aggression",
    "edition": "None",
    "publisher": "The book is published on the Saudi Ministry of Endowments website without data",
    "page_number": 56,
    "volume_number": 1,
    "text": "14- If that severe threat is for killing individual Covenanters, Dhimmis, and Musta'mins, then how about blowing up their houses and buildings, demolishing them upon their heads, and killing those inside them of women and children? Given that killing these categories among combatant disbelievers is forbidden and not permissible by the consensus of scholars except for necessity, then how about the women and children of those whose blood is inviolable? 15- Enjoining good and forbidding evil become prohibited if they imply the loss of a greater interest or the bringing about of a greater sedition (fitnah) and corruption. 16- It is not permissible for individual subjects to draw weapons to deny evils and fight the people of falsehood, for this is among the exclusive rights of the Imam or whom he deputizes. Individual subjects cannot independently undertake it, because it leads to inciting sedition, the raging of corruption, the destruction of security, and the abundance of killing and confusion. And praise be to Allah by Whose grace good deeds are completed.",
    "foot_note": "None",
    "book_id": "1145",
    "new_page_number": 59
  }
]