[
  {
    "text": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)\nAuthor: ابن الكندي عمر بن محمد بن يوسف من علماء النصف الثاني من القرن الرابع الهجري\nYear: Null\n\nSection: Countries and Travels. Book: Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt). Author: Ibn al-Kindi, Umar bin Muhammad bin Yusuf, a scholar from the second half of the fourth century Hijri. Investigator: Dr. Ali Omar, Department of History and Islamic Civilization at Minia University and Imam Muhammad bin Saud University in Riyadh. Publisher: Al-Khanji Library - Cairo. Edition: First, 1417 AH - 1997 AD (The investigator first published it at Al-Istiqlal Press, Cairo 1391 AH - 1971 AD). Number of Pages: 52 [Book numbering matches the printed version]. Publication Date in Shamela: 8 Dhu al-Hijjah 1431.\nBook: Faḍā'il Miṣr al-Maḥrūsah. Author: Ibn al-Kindi... [Repeated Metadata] ... Publication Date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 1
  },
  {
    "text": "sn: 6873\nbook_title: فضائل مصر المحروسة\nbook_link: https://shamela.ws/book/405\nbook_id: 405\nauthor_name: ابن الكندي عمر بن محمد بن يوسف من علماء النصف الثاني من القرن الرابع الهجري\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/751\nauthor_ID: 751\neditor: د علي عمر، قسم التاريخ والحضارة الإسلامية بجامعتي المنيا والإمام محمد بن سعود بالرياض\npublisher: مكتبة الخانجي- القاهرة\nedition: الأولى، 1417 هـ - 1997 م (وقد نشره المحقق أول مرة في مطبعة الاستقلال، القاهرة 1391 هـ - 1971 م)\npages: 52\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "category_id": "28",
    "category": "Geography and Travels",
    "new_page_number": 2
  },
  {
    "serial_number": "6303851",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 7,
    "volume_number": 0,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction. The Subject of the Book. This is evident in Ibn al-Kindi's statement: \"This book was ordered to be collected and its composition urged by the Master Abu al-Misk Kafur. We mention in it the news of Egypt and the virtues, blessings, and bounties that Allah Almighty has exclusively bestowed upon it over most other lands...\" Ibn al-Kindi began his presentation of Egypt's news and virtues with verses from the Holy Quran mentioning Egypt, such as the Almighty's saying: {And We inspired to Moses and his brother, 'Settle your people in Egypt in houses and make your houses [facing the] Qiblah'} [Yunus: 87]. And His saying, quoting Pharaoh and his boasting about Egypt: {Is not the kingdom of Egypt mine, and these rivers flowing beneath me?} [Az-Zukhruf: 51]. Thus, Ibn al-Kindi cited a number of noble verses in which the name of Egypt is mentioned, arriving finally at highlighting the glory of his homeland. Therefore, we see him asking afterwards: \"Is it known that any country in all regions of the earth has been praised by the Book [Quran] with such praise, or described with such description, or testified to for generosity, other than Egypt?\" Ibn al-Kindi followed the same approach in narrating the Hadiths of the Noble Messenger in which Egypt was mentioned. We quote from them a Hadith narrated from the Noble Messenger, peace be upon him, advising his companions regarding the people of Egypt, which is narrated by Muslim in his Sahih: \"You will conquer Egypt after me, so treat its Copts well, for you have among them a lineage of marriage and a covenant of protection (Dhimma).\" Ibn al-Kindi also praised Egypt and its people regarding their connection to Messengers and Prophets, mentioning that when the Noble Messenger wrote to a group of kings, including Heraclius of Rome, none answered him, but he wrote to Al-Muqawqis, the ruler of Egypt, who answered his letter with a beautiful reply and sent the Noble Messenger a number of gifts which he accepted. From this perspective...",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 3
  },
  {
    "serial_number": "6303852",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 8,
    "volume_number": 0,
    "text": "...from this historical perspective, Ibn al-Kindi also addressed the stance of Egypt's ministers in ancient times. He showed that Allah praised them in His Holy Book because they offered advice to Pharaoh. The Almighty said, quoting Pharaoh: {He said to the eminent ones around him, 'Indeed, this is a learned magician (34) He wants to drive you out of your land by his magic, so what do you advise?' (35) They said, 'Postpone [the matter of] him and his brother and send among the cities gatherers (36) Who will bring you every learned, skilled magician' (37)} [Ash-Shu'ara: 34-37]. Here Ibn al-Kindi also asks: \"Are there in the world any king's sitters more sound in mind and better in presence than them?\" This is in contrast to the ministers of Nimrod who incited him to tyranny and killing when he consulted them regarding Abraham, peace be upon him. The Almighty said quoting them: {They said, 'Burn him and support your gods - if you are to act'} [Al-Anbiya: 68]. In light of this method, Ibn al-Kindi addressed the wise men Egypt produced, mentioning among them: Nayrouz Abu Bukhtanasar (Nebuchadnezzar), who was a man of knowledge; and Alexander the Two-Horned (Dhul-Qarnayn), to whom the building of several cities like Samarkand and Alexandria in the land of the Khazars and others is attributed. He then followed this by mentioning a number of Greek philosophers and scientists who were in Egypt and wrote works in astronomy, geometry, physics, medicine, and others. Ibn al-Kindi praised his country, Egypt, noting that these philosophers and scholars lived in Egypt in past ages, yet it did not alter their minds nor harm their intellects. Ibn al-Kindi proceeds in his book to reach the Islamic era, mentioning a number of Companions who came to Egypt with Amr ibn al-As during the conquest. He also mentions a number of them, reaching eighty men, who stood to establish the Congregational Mosque. He also praised the jurists and scholars Egypt produced, placing Yazid bin Abi Habib at the peak of Egypt's jurists and scholars of that time, and making Al-Layth bin Sa'd the second of two of Egypt's jurists and scholars in his era. As for Ibn Lahi'ah, he described him as having a high status in jurisprudence, Hadith, and history. Then he mentioned after them another group of Egyptian scholars such as...",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 4
  },
  {
    "serial_number": "6303853",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 9,
    "volume_number": 0,
    "text": "...Ashhab bin Abd al-Aziz, Asad bin Musa, and Al-Muzani, the companion of Al-Shafi'i. Then he said: \"Each one excelled in his school of thought and outshone the people of his era, and each one of them has authored books that the rest of the world is incapable of matching.\" As for Sa'id bin Ufayr, Yahya bin Uthman, Ibn Qudayd, and Abu Umar al-Kindi, Ibn al-Kindi placed them among the prominent historians of the third century Hijri, praising each of them and describing them as surpassing the people of their era in knowledge of news, the days of the people (history), and mastery of all sciences. Among those who excelled as Egyptian historians in the Ikhshidid era were Ibn Yunus and Al-Kindi; Ibn al-Kindi places them at the peak of Islamic Egypt's historians at that time. Ibn al-Kindi also mentions, among the virtues of Egypt he praised, the ascetics who lived there, such as Haywah bin Shurayh, Sulaym bin Itr, and others. He also clarified his pride and his fellow citizens' pride in their country, Egypt, by highlighting its status through mentioning the scholars, Caliphs, and poets who visited it. The center of the religious scientific movement in Egypt and its rising heart in that era was the Mosque of Amr ibn al-As; it was a meeting place for scholars, and students flocked to it to receive knowledge. Visitors to Egypt from various Islamic regions multiplied, seeking narration from Egypt's scholars. Ibn al-Kindi moved from praising Egypt's scholars to praising Egypt and what distinguished it from other lands. He mentioned what some Companions said about it, that it is the storehouse of the whole earth. Then he pointed to what distinguishes Egypt: its good air, pure atmosphere, and the safety and security enjoyed by its people, which is almost non-existent in other lands. He also praised Egypt by noting what people of knowledge said about it: that the people of the world are compelled to travel to Egypt seeking provision and other things, while its people are not so (compelled to go elsewhere). Ibn al-Kindi's vision of Egypt's virtues and splendor reached its height when he spoke about the administrative system in Egypt, where there were eighty Kuras (districts). He praised the novelties and wonders in every...",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 5
  },
  {
    "serial_number": "6303854",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 10,
    "volume_number": 0,
    "text": "...Kura (district), including types of drinks, food, and fruit, as well as the wondrous monuments and temples (Barabi) and other things in every city. As for the Nile, Ibn al-Kindi showed his pride and his citizens' pride in it by collecting narratives that praise this river and clarify its importance to the life of Egypt and its people. Regarding Egypt's economic virtues, Ibn al-Kindi clarified Egypt's superiority over others while mentioning its resources. He praised its abundant bounties resulting from agriculture, where flax, wheat, clover (Qurt), and all kinds of crops were grown. When he praised Egypt's products and industries, he mentioned what it was famous for, such as the Tinnisi brocade and the Dabiqi cloth, which are found nowhere else, as well as what it was famous for in the industry of woolen textiles and Mar'az (goat hair) garments which had no equal. His pride and the pride of his citizens in Egypt's distinct industry in this regard was evident in what he recounted from people of knowledge and expertise regarding the features of this industry: that Muawiyah bin Abi Sufyan, when he grew old, could not keep warm. They agreed that nothing would warm him except the garments made in Egypt from its Mar'az wool. A number of them were made for him, but he only needed one. Ibn al-Kindi also praised Egypt's superiority over others by what it was famous for in paper manufacturing and mining. Ibn al-Kindi concluded his vision of Egypt's virtues by praising its excellent location and the impact this had on Egypt's commercial activity (1). ***",
    "foot_note": "1. The author mentioned the sources he relied upon in the introduction of this book.",
    "book_id": "405",
    "new_page_number": 6
  },
  {
    "serial_number": "6303855",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 11,
    "volume_number": 0,
    "text": "The Author and the Attribution of the Book to Him. The sources available to us do not mention anything about the life of Umar bin Abi Umar al-Kindi; all of them remained silent regarding his life. All that can be known about him is that he was alive in the second half of the fourth century Hijri, and that he authored the book \"The Virtues of Protected Egypt\" for Prince Abu al-Misk Kafur based on the wish of this prince who became the independent ruler of Egypt in the year 355 AH. In addition, he learned from his father Abu Umar (died 350 AH), just as the Egyptian historian Ibn Zulaq (died 387 AH) learned from him (1). Many historians have continued until today to attribute the book \"The Virtues of Egypt\" to Abu Umar al-Kindi, the author of \"The Governors and Judges\" (Al-Wulah wa Al-Qudah). Al-Suyuti says in the introduction to his book \"Husn al-Muhadarah\": \"I have perused for this book various books, including 'The Virtues of Egypt' by Abu Umar al-Kindi\" (2). Most modern historians followed Al-Suyuti's path; Al-Baghdadi attributed the book of Virtues to Abu Umar al-Kindi (3), as did Al-Zirikli (4), and likewise Rida Kahhala (5). Al-Maqrizi is considered the only historian to explicitly mention the attribution of the book of Virtues to Umar bin Abi Umar al-Kindi. He quoted extensively from the book of Virtues, depositing them in his \"Khitat\" and attributing them to this Umar (6).",
    "foot_note": "1. Ibn Zulaq: Mukhtasar Tarikh Misr, Folio 25. \n2. Al-Suyuti: Husn al-Muhadarah, Vol 1, p. 3. \n3. Idah al-Maknun, Vol 7, p. 197, and Hadiyat al-Arifin, Vol 2, p. 46. \n4. Al-A'lam, Vol 8, p. 21. \n5. Mu'jam al-Mu'allifin, Vol 3, p. 791. \n6. Al-Maqrizi: Al-Mawa'iz wa al-I'tibar (The Khitat), Vol 1, pp. 124, 158, 176, 204, 211, 212, 249.",
    "book_id": "405",
    "new_page_number": 7
  },
  {
    "serial_number": "6303856",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 12,
    "volume_number": 0,
    "text": "Furthermore, the book \"The Virtues of Egypt\" was not listed among the works of Abu Umar al-Kindi in his biography in Al-Maqrizi's book \"Al-Muqaffa\", where Al-Maqrizi listed his works without referring to the book of Virtues (1). Whatever the case may be, Umar pointed out in the introduction of this book of Virtues to his father, Abu Umar, among the scholars of Egypt from whose books he collected what Kafur al-Ikhshidi ordered him to do. He also mentioned him again among the scholars of Egypt who surpassed the people of their era and excelled over them in knowledge, news, and history. Umar also spoke about himself while discussing the Pyramids and the Sabians in this book, saying: \"And I saw among the Sabians those who performed pilgrimage to them (the Pyramids).\" ***",
    "foot_note": "1. Al-Maqrizi: Al-Muqaffa, Vol 7, p. 489.",
    "book_id": "405",
    "new_page_number": 8
  },
  {
    "serial_number": "6303857",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 13,
    "volume_number": 0,
    "text": "Ibn al-Kindi's Status Among Historians. Ibn al-Kindi remained for long periods—transcending his own era—one of the most prominent intellectual figures of Egypt among Egypt's historians. This was evident when later works relied heavily on Ibn al-Kindi's book. Ibn Said al-Andalusi (died 685 AH) quoted him verbatim in several places in his book \"Al-Mughrib fi Hula al-Maghrib\". This was on the occasion of what Musa al-Hashimi, the governor of Egypt on behalf of Al-Rashid, saw in Egypt of scenes that captured his attention and admiration, such as palm trees, orchards, the Nile, horse pastures, fishermen, ship sailors, and so on (1). Ibn Said also quoted a full text from Ibn al-Kindi regarding the virtue of Egypt's cemetery (2). Ibn Said also quoted from the book \"The Virtues of Egypt\" on the occasion of discussing Alexandria and its wonders (3). It is noted that all quotes in Ibn Said are taken verbatim from Ibn al-Kindi. As for Al-Nuwayri (died 732 AH), he also utilized the book \"The Virtues of Egypt\" in his book \"Nihayat al-Arab\" (4), specifically in the chapter he dedicated to \"Egypt and the Virtues Specific...",
    "foot_note": "1. See Ibn Said al-Andalusi: Al-Mughrib fi Hula al-Maghrib, p. 3. \n2. Previous source, pp. 11, 12. \n3. See previous source, p. 16. \n4. See Vol 1, p. 344.",
    "book_id": "405",
    "new_page_number": 9
  },
  {
    "serial_number": "6303858",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 14,
    "volume_number": 0,
    "text": "...to It\". He transferred most of his material verbatim from what appeared in Ibn al-Kindi's book. Ibn al-Kindi's book \"The Virtues of Egypt\" was also one of the main sources for Al-Qalqashandi (1) (died 871 AH) in the chapter he dedicated to discussing Egypt and its virtues. As for Al-Maqrizi (died 845 AH), he transferred in his book \"Al-Mawa'iz wa al-I'tibar\" (The Khitat) most of the material found in the book of Virtues, utilizing it in multiple places in his book. He quoted from the Virtues regarding the conversation between Amr ibn al-As and Al-Muqawqis concerning Mount Muqattam (2). He also quoted from the Virtues regarding the Lighthouse of Alexandria (3). And likewise in his discussion of the city of Atrib (4). Al-Maqrizi also used Ibn al-Kindi in his description of the city of Farama and the monuments it contained (5), as well as in his description of the city of Fayoum (6). Ibn Taghribirdi (7) (died 874 AH) also relied on Ibn al-Kindi regarding the discussion of Egypt's virtues, its holy mountain, its blessed Nile, and its monuments. Most of the quotes regarding Egypt's virtues in Al-Suyuti (died 910 AH) are considered taken verbatim from Ibn al-Kindi's book \"The Virtues of Egypt\", despite the fact that he mistakenly attributed the book of Virtues to Abu Umar al-Kindi (8).",
    "foot_note": "1. See Subh al-A'sha, Vol 3, p. 287. \n2. See Al-Maqrizi: Al-Mawa'iz wa al-I'tibar, Vol 1, p. 124. \n3. See previous source, Vol 1, p. 158. \n4. See previous source, Vol 1, p. 176. \n5. See previous source, Vol 1, p. 211. \n6. See previous source, Vol 1, p. 249. \n7. See Al-Nujum al-Zahirah, Vol 1, p. 37. \n8. See Al-Suyuti: Husn al-Muhadarah, Vol 1, pp. 3, 553.",
    "book_id": "405",
    "new_page_number": 10
  },
  {
    "serial_number": "6303859",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 15,
    "volume_number": 0,
    "text": "Al-Suyuti referred to the book of Virtues when mentioning the prophets who entered Egypt (1). Also regarding the magicians who believed in Moses, peace be upon him (2), and what he mentioned about the wise men who were in Egypt in the first age (3). In the chapter Al-Suyuti dedicated to Al-Muqattam, he also relied heavily on the book of Virtues, quoting most of his statements from it verbatim (4). Likewise, the chapter Al-Suyuti dedicated to \"The Subtleties of Egypt\", he transferred most of its material also from the book of Virtues verbatim (5). The book of Virtues is also considered a primary source for Ibn Zahira in his book \"Al-Fada'il al-Bahirah fi Mahasin Misr wa al-Qahirah\" (The Dazzling Virtues regarding the Beauties of Egypt and Cairo), where this historian transferred most of what Ibn al-Kindi wrote about Egypt's virtues in many chapters of his book (6). Thus, the school of Egyptian historiography continued to rely on Ibn al-Kindi's book in all its stages whenever its historians intended to speak about the virtues of Egypt. ***",
    "foot_note": "1. See Al-Suyuti: Husn al-Muhadarah, Vol 1, p. 52. \n2. See previous source, Vol 1, p. 59. \n3. See previous source, Vol 1, p. 60. \n4. See previous source, Vol 1, pp. 137-139. \n5. See previous source, Vol 1, p. 324. \n6. See Ibn Zahira: Al-Fada'il al-Bahirah, pp. 62, 110, 150, 158, 159, 162, 186.",
    "book_id": "405",
    "new_page_number": 11
  },
  {
    "serial_number": "6303860",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 16,
    "volume_number": 0,
    "text": "Manuscripts of the Book. I based the verification of Ibn al-Kindi's text on the manuscripts mentioned below, comparing them with the most important sources related to the text's subject. 1 - A copy written in Naskh script, undated, bearing this statement: \"Transcribed from the original copy written for Kafur al-Ikhshidi, drawn for Qasim Effendi al-Sha'rani, the military judge in Egypt.\" It consists of 21 papers. It has 15 lines per page. It is preserved in the Egyptian National Library (Dar al-Kutub), under number 422 History. We have symbolized this copy with the letter (A). 2 - A copy written in Naskh script, undated, missing a leaf from the end. It consists of 19 papers, with 19 lines per page. It is preserved in the Egyptian National Library, under number 753 History. We have symbolized this copy with the letter (B). 3 - A fragment from a microfilm copy preserved at the Institute of Arabic Manuscripts, consisting of 8 papers, with 25 lines per page, under number 874 History. From its original preserved at the Palestine Archaeological Museum in Jerusalem, photographed from a copy at the Mosque of Ahmad Pasha al-Jazzar in Acre. It is in an old standard script from the 5th century Hijri, as mentioned in the catalog of the Institute of Arabic Manuscripts at the Arab League. We have symbolized this copy with the letter (C). I chose to rely on copy (C) until its content ends at the word \"Al-Qanatir\" (The Bridges) on page 41, line 6; because it is the oldest copy, having been copied in the 5th century Hijri. Especially when another copy agrees with it. I did not depart from the reading of (C) unless the other copies agreed on something else.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 12
  },
  {
    "serial_number": "6303861",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 17,
    "volume_number": 0,
    "text": "I also placed internal headings in the body of the book between brackets for clarification.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 13
  },
  {
    "serial_number": "6303862",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 18,
    "volume_number": 0,
    "text": "Title page of Copy \"A\" preserved at Dar al-Kutub, No. 422 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 14
  },
  {
    "serial_number": "6303863",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 19,
    "volume_number": 0,
    "text": "First page of Copy \"A\" preserved at Dar al-Kutub, No. 422 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 15
  },
  {
    "serial_number": "6303864",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 20,
    "volume_number": 0,
    "text": "Last page of Copy \"A\" preserved at Dar al-Kutub, No. 422 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 16
  },
  {
    "serial_number": "6303865",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 21,
    "volume_number": 0,
    "text": "First page of Copy \"B\" preserved at Dar al-Kutub, No. 753 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 17
  },
  {
    "serial_number": "6303866",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 22,
    "volume_number": 0,
    "text": "End of what exists from Copy \"B\" preserved at Dar al-Kutub, No. 753 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 18
  },
  {
    "serial_number": "6303867",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 23,
    "volume_number": 0,
    "text": "First plate of Copy \"C\" preserved at the Institute of Manuscripts, No. 874 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 19
  },
  {
    "serial_number": "6303868",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 24,
    "volume_number": 0,
    "text": "End of what exists from Copy \"C\" preserved at the Institute of Manuscripts, No. 874 History.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 20
  },
  {
    "serial_number": "6303869",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Countries and Travels. Book: Faḍā'il Miṣr al-Maḥrūsah... [Repeated Metadata] ... Publication Date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 21
  },
  {
    "serial_number": "6303870",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 1,
    "volume_number": 1,
    "text": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt) by Ibn al-Kindi, Umar bin Muhammad bin Yusuf, one of the scholars of the second half of the fourth century Hijri.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 22
  },
  {
    "serial_number": "6303871",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 2,
    "volume_number": 1,
    "text": "The Book of the Virtues of Protected Egypt. Transcribed from the original copy written for Kafur al-Ikhshidi, may Allah have mercy on him. Drawn for our master and lord, the pride of the judges of Islam, the perfection of the rulers of mankind, the mine of grace, virtues, and honor: Our Master Qasim Effendi al-Sha'rani, the current Military Judge in Egypt, may his happiness last through Muhammad and his family.",
    "foot_note": "None",
    "book_id": "405",
    "new_page_number": 23
  },
  {
    "serial_number": "6303872",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. And with Allah is success and assistance. Abu Muhammad Abd al-Rahman bin Umar bin Muhammad al-Mu'addil, known as Ibn al-Nahhas (1), told us: Umar bin Abi Umar Muhammad bin Yusuf bin Yaqub al-Kindi al-Misri, may Allah have mercy on him, told us, saying: This is a book ordered to be collected and its composition urged by Abu al-Misk Kafur (2). In it, he mentions Egypt and what Allah specifically bestowed upon it of virtues, blessings, and bounties over other lands. May Allah increase the Master's desire for knowledge, his love for its people, and his perseverance and passion for it. For someone like him desires things of this nature and encourages their collection. Since he is the Ardashir (wise ruler) of his time in politics and development, and the unique one of his age in his justice, compassion, and kindness to his subjects - may Allah never remove his shade from us, and may He grant us enjoyment of his survival and the permanence of his days, and make the favor He bestowed upon him in his worldly life connected to his afterlife. So, I collected what he ordered from the books of the Egyptian Sheikhs and others among the people of knowledge, expertise, research, intelligence, acumen, inspection, travel, and seeking.",
    "foot_note": "1. Born in 323 AH. He heard in Egypt from Abu al-Tahir Ahmad bin Muhammad bin Amr al-Madini, the Hafiz Abu Said bin Yunus al-Sadafi, and others. The Judge Muhammad bin Salamah al-Quda'i and others narrated from him. He died in 416 AH. (Al-Dhahabi: Siyar A'lam al-Nubala, 7/313). \n2. Al-Dhahabi mentioned him in his history in the obituaries of the year 357 AH, saying: Kafur, the black Ethiopian eunuch servant, the Master Abu al-Misk al-Ikhshidi the Sultan. Al-Ikhshidi bought him from some Egyptian chiefs. Then he advanced under Al-Ikhshid, the ruler of Egypt, due to his intellect and opinion until he became one of his senior commanders. Then he became independent in the command of Egypt in the year 355 AH. Kafur used to bring poets close and reward them, and every night biographies and news of the Umayyad and Abbasid dynasties were read in his presence. He died in 357 AH. (Al-Dhahabi: Tarikh al-Islam, obituaries of 357 AH).",
    "book_id": "405",
    "new_page_number": 24
  },
  {
    "serial_number": "6303873",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 4,
    "volume_number": 1,
    "text": "Among their famous ones: Yazid bin Abi Habib (1), and Ubayd Allah bin Abi Ja'far (2). After them: Al-Layth bin Sa'd (3), and Abdullah bin Lahi'ah (4). After them: Sa'id bin Kathir bin Ufayr (5), and Uthman bin Salih al-Sahmi (6).",
    "foot_note": "1. Yazid bin Abi Habib (d. 128 AH): The first to display the science of lawful and unlawful matters in Egypt; before that, they used to talk about encouragement (Targhib), epics, and tribulations. Ibn Abi Habib is considered one of the earliest to write on Islamic Egypt's history. Ibn Zulaq (4th century AH historian) placed him at the top of Islamic Egypt's historians. \n2. Ubayd Allah bin Abi Ja'far (d. 135 AH): One of the early historians in Islamic Egypt, considered like his contemporary Yazid bin Abi Habib in this regard. His book on Egypt's history is considered one of the sources for Ibn Abd al-Hakam and Abu Umar al-Kindi. \n3. Al-Layth bin Sa'd (d. 175 AH): His book on Egypt's history is considered the most important contribution he made to the school of Islamic Egypt. Ibn al-Nadim referred to it, and Abu Umar al-Kindi mentioned Layth's book on history in his works \"The Governors and Judges\" and benefited from it. \n4. Abdullah bin Lahi'ah (d. 174 AH): One of the famous scholars of Egypt in the 2nd century AH. Egyptian historians, up to Al-Suyuti, attributed many reports about Islamic Egypt's history in its early era to him. \n5. Sa'id bin Ufayr (d. 226 AH): Remained for long periods transcending his era one of the most prominent intellectual figures of Egypt among historians. The Egyptian historian Ibn Yunus (d. 347 AH) said of him: \"He was the most knowledgeable of people about genealogies, past news, days of the Arabs, and histories.\" Al-Suyuti placed him at the peak of Islamic Egypt's historians. The most important thing Ibn Ufayr presented to the school of Egypt was a book on Egypt's history, which was later a source for Ibn Abd al-Hakam. \n6. Uthman bin Salih (d. 219 AH): Was fond of knowing historical news and narrating them. His name appears as a source of information about ancient Egypt's history, as well as events of the Islamic conquest. He also contributed to providing the Egyptian school with African information.",
    "book_id": "405",
    "new_page_number": 25
  },
  {
    "serial_number": "6303874",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 5,
    "volume_number": 1,
    "text": "After them: Khalaf bin Rabi'ah (1), Abd al-Rahman bin Maysarah (2), Ahmad bin Yahya bin al-Wazir (3), and Abu Khaythama Ali bin Amr bin Khalid (4). After this generation: Yahya bin Uthman bin Salih (5), and Ubayd Allah bin Sa'id bin Kathir bin Ufayr (6). After them: Ali bin al-Hasan bin Khalaf bin Qudayd (7), and Muhammad bin al-Rabi'...",
    "foot_note": "1. Khalaf bin Rabi'ah (d. 262 AH): Was knowledgeable about Egypt's news. Ibn Zulaq places him among the famous historians of Islamic Egypt in the 3rd century AH. \n2. Abd al-Rahman bin Maysarah (d. 188 AH): One of the senior Egyptian scholars in the 3rd century AH. Historians and scholars of Egypt like Sa'id bin Ufayr and Yahya bin Bukayr studied under him. \n3. Ahmad bin Yahya (d. 250 AH): Was knowledgeable about news and the days of the people. Ibn Zulaq places him among the prominent Egyptian historians. \n4. Abu Khaythama Ali bin Amr (d. 229 AH): Al-Kindi benefited from his book on Egypt's history in his writings about the governors who ruled Egypt since the Islamic conquest until his era, as well as Egypt's judges during this period. \n5. Yahya bin Uthman (d. 282 AH): Was knowledgeable about Egypt's news and the deaths of scholars. Ibn Zulaq made him one of the prominent Sheikhs of the school of history in Egypt. His book on Egypt's history is considered one of the sources for Ibn Qudayd, who benefited from a copy of it in the author's handwriting. \n6. Ubayd Allah bin Sa'id (d. 273 AH): From the sons of scholarly houses in Egypt. Judge Iyad praised their knowledge when translating for his father, saying: \"Knowledge remained in his house for a long time.\" This was evident in the news that filled Al-Kindi's book \"The Governors and Judges\" narrated from Ubayd Allah bin Sa'id. \n7. Ibn Qudayd (d. 312 AH): Wrote a book about Egypt from which Al-Kindi benefited in his books \"The Governors and Judges\". Yaqut also quoted from it in \"Mu'jam al-Buldan\", Al-Dhahabi in \"Tadhkirat al-Huffaz\", and Ibn Hajar in \"Raf' al-Isr\".",
    "book_id": "405",
    "new_page_number": 26
  },
  {
    "serial_number": "6303875",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 6,
    "volume_number": 1,
    "text": "...Ibn Sulayman al-Jizi (1). After them: Abu Umar Muhammad bin Yusuf bin Yaqub al-Kindi (2), and Abu Sa'id Abd al-Rahman bin Ahmad bin Yunus bin Abd al-A'la (3). I informed myself of the news that reached me from those I mentioned and their narrations. I compiled it, abbreviated the texts, and omitted the chains of narration so that its news would be consistent, listening to it would be easy, and its benefit would be accessible, in the name of Allah and with His help, and blessings upon our Prophet Muhammad and his family. [Egypt's Superiority over Others] I say: Allah favored Egypt over other lands, just as He favored some people over others, and some days and nights over others. Favor is of two types: in religion or worldly matters, or in both together. Allah has favored Egypt and testified for it in His Book with generosity and great status. He mentioned it by its name, singled it out over others, repeated its mention, and clarified its virtue in verses of the Great Quran that tell about Egypt and its conditions, the conditions of the Prophets in it, the past nations, the past kings, and the clear signs. The Quran testifies to that for it, and it suffices as a witness. Furthermore, it is narrated from the Prophet, peace be upon him, regarding Egypt and its non-Arabs (Ajam) (4) specifically, his mention of his kinship (and mercy to them) (5), his blessing upon them and their land (6), and his urging to treat them well...",
    "foot_note": "1. Muhammad bin al-Rabi' (d. 324 AH): Al-Kindi benefited from his books on Egypt's history in his book \"The Judges\", as did Ibn Hajar in \"Raf' al-Isr\" and Al-Suyuti in \"Husn al-Muhadarah\". \n2. Muhammad bin Yusuf Abu Umar al-Kindi, father of the author (d. 350 AH): Was one of the most knowledgeable people about the country, its people, its works, and its frontiers. He has works on it and on other subjects of news and genealogies, and was among the illustrious scholars of Hadith and genealogy. \n3. Abu Sa'id bin Yunus (d. 347 AH): One of the old Egyptian historians, famous for being an expert in people's days and histories. Ibn Yunus wrote two historical authorships about Egypt: The first dedicated to figures who influenced the history of his country - Egypt. The second is smaller and revolves around strangers who were not born in Egypt but lived there for a period of time. \n4. In A: \"its wonders\", established from: B, C. \n5. Between brackets missing from: A, exists in: B, C. \n6. A: \"and his blessing upon them and their town\", B: \"and his blessing for them and for their country\", established from: C.",
    "book_id": "405",
    "new_page_number": 27
  },
  {
    "serial_number": "6303876",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 7,
    "volume_number": 1,
    "text": "...what was not narrated from him regarding any non-Arab people other than them. We will mention that, God willing, in its place, along with what Allah distinguished it with of fertility and virtue, and the blessings He sent down into it, and the Prophets, scholars, wise men, elite, kings, and wonders He brought forth from it, with what Allah has not distinguished any other country or land. If a blamer (1) blames us by mentioning the Two Holy Sanctuaries (Haramayn), or a detractor denounces, then the Two Holy Sanctuaries have their virtue which cannot be repelled, and what Allah distinguished them with which cannot be denied regarding the location of His Sacred House and the grave of His Prophet, peace be upon him. Yet, what Allah favored them with does not diminish the virtue of Egypt nor decrease its status. Indeed, its benefits to the Two Holy Sanctuaries are clear because it provisions them (2) with its food, fertility, clothing, and all other facilities. Thus, it has great merit. Furthermore, it feeds the people of the world who come to it as pilgrims throughout their stay; they eat and take provision from its food from the farthest south of the earth to its north, including those (Muslims) (3) in the lands of India, Andalusia, and what is between them. No denier denies this, nor does any refuter repel it. That suffices as virtue and blessing in religion and worldly matters. [Mention of what was narrated regarding the virtue of Egypt] As for what Allah Almighty mentioned in His Book regarding what we have abbreviated (4) of the mention of Egypt: The saying of Allah Almighty: {And We inspired to Moses and his brother, 'Settle your people in Egypt in houses and make your houses [facing the] Qiblah'} [Yunus: 87]. And what Allah Almighty mentioned quoting the words of Joseph: {Enter Egypt, if Allah wills, safely} [Yunus: 99]. And Almighty said: {Go down to a city (Misr), for you will have what you asked for} [Al-Baqarah: 61].",
    "foot_note": "1. 'Tharraba alayhi': Blamed him. 'Al-Mutharrib' with emphasis on R: The confuser/spoiler. \n2. C: \"Tamīruha\" (provisions/feeds it). Mīrah: bringing food. \n3. Missing from: B, exists in: A, C. \n4. In A: \"what we have chosen\". Established in: B, C.",
    "book_id": "405",
    "new_page_number": 28
  },
  {
    "serial_number": "6303877",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 8,
    "volume_number": 1,
    "text": "And the Almighty said: {And We made the son of Mary and his mother a sign and sheltered them within a high ground having level [areas] and flowing water} (1) [Al-Mu'minun: 50]. Some commentators said: It is Egypt. Some scholars of Egypt said: It is Al-Bahnasa. The Copts of Egypt agree that the Messiah Jesus, son of Mary, and his mother, peace be upon them, were in Al-Bahnasa and moved from there to Jerusalem. Some commentators said: The high ground (Rabwah) is Damascus, and Allah knows best. And the Almighty said: {And the one from Egypt who bought him said to his wife, 'Make his residence comfortable'} [Yusuf: 21]. And the Almighty said: {And women in the city said, 'The wife of Al-Aziz is seducing her slave boy'} [Yusuf: 30]. The city is Memphis (Manf), and Al-Aziz was the King of Egypt at that time. And the Almighty said: {And he entered the city at a time of inattention by its people} [Al-Qasas: 15]; it is Memphis, the city of Pharaoh. And the Almighty said: {And a man came from the farthest end of the city, running} [Al-Qasas: 20]; it is Memphis as well. And the Almighty said quoting the brothers of Joseph: {O Aziz} [Yusuf: 78]. And the Almighty said quoting Joseph, peace be upon him: {And He was certainly good to me when He took me out of prison and brought you from the bedouin life (Badow)} [Yusuf: 100]; so He made the Levant (Sham) a bedouin life. And the Almighty said quoting Pharaoh and his boasting about Egypt: {Is not the kingdom of Egypt mine, and these rivers flowing beneath me?} [Az-Zukhruf: 51].",
    "foot_note": "1. Rabwah: What is elevated from the ground.",
    "book_id": "405",
    "new_page_number": 29
  },
  {
    "serial_number": "6303878",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 9,
    "volume_number": 1,
    "text": "And the Almighty said when describing Egypt and the comfort and kingdom the people of Pharaoh were in, describing it in a way He did not describe an East nor a West, nor a plain nor a mountain, (nor land nor sea (1)): {How much they left of gardens and springs (25) And crops and noble sites (26) And comfort wherein they were amused (27)} [Ad-Dukhan: 25-27]. Is it known that any country in all regions of the earth has been praised by the Book with such praise, or described with such description, or testified to for generosity, other than Egypt? It was narrated from the Prophet, peace be upon him, that he said: \"You will conquer Egypt after me, so treat its Copts well, for you have among them a lineage of marriage and a covenant of protection\" (2). Abu Dharr narrated from the Prophet, peace be upon him, that he said: \"You will conquer a land where the Qirat is mentioned, so treat its people well, for they have a covenant of protection and kinship\" (3). As for the kinship (Rahim), Hagar, the mother of Ishmael son of Abraham the Friend of Allah, peace be upon them, was from the Copts, from a village near Al-Farama called: Umm al-Arab (4).",
    "foot_note": "1. Missing from A, C, exists in B. \n2. Muslim narrated it in his Sahih with an addition in the wording, Book of Virtues of the Companions, Chapter on the Prophet's advice regarding the people of Egypt (Sahih Muslim 4/1970). \n3. This city has disappeared, and its ruins are known today as Tell al-Farama, three kilometers from the coast of the Mediterranean Sea. \n4. This phrase was formulated in other sources in different ways... [Discussion of textual variants regarding 'Umm al-Arab' location and naming].",
    "book_id": "405",
    "new_page_number": 30
  },
  {
    "serial_number": "6303879",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 10,
    "volume_number": 1,
    "text": "As for the covenant of protection (Dhimma): The Prophet, peace be upon him, took as a concubine from the Copts Maria, the mother of Ibrahim, the son of the Messenger of Allah, peace be upon him. She is from a village towards Upper Egypt (Sa'id) called \"Hafn\" (1) from the district (Kura) (2) of \"Ansina\" (3). So the Arabs and Muslims entirely have a lineage in Egypt through their mother Maria, the mother of Ibrahim, the son of the Messenger of Allah, peace be upon him; because the wives of the Prophet, peace be upon him, are the Mothers of the Believers, and the Copts are their maternal uncles. And the Arabs entirely became of Egypt through their mother Hagar; because she is the mother of Ishmael, peace be upon him, who is the father of the Arabs. It was narrated from the Prophet, peace be upon him, that he said: \"You will be recruited troops, and the best of your troops will be the Western Troop. So fear Allah regarding the Copts: do not eat them as one eats green plants (Khudar)\" (4).",
    "foot_note": "1. Hafn: A village in the district of Ansina in Upper Egypt. \n2. Kura involves a number of villages, corresponding to 'Markaz' (Center) in the current Egyptian administrative system. \n3. Ansina: An ancient city in Upper Egypt east of the Nile... its place today is the ruins located east of the Nile at Mallawi Center, Minya Governorate. \n4. I did not find its extraction in the sources available to me... The Western Troop means: The army of Egypt. Khudar: Fresh plants. Sources differed regarding the word 'Khudar'; it appeared in Futuh Misr... as 'Hadar' (someone who waits for food). Dr. Hussein Nassar commented... favoring 'Khudar' meaning fresh plants/grazing, as found in one copy...",
    "book_id": "405",
    "new_page_number": 31
  },
  {
    "serial_number": "6303880",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 11,
    "volume_number": 1,
    "text": "It was narrated from Umar from the Prophet, peace be upon him, that he said: \"If Allah grants you victory over Egypt, then take a dense army in it; for that army is the best of the armies of the earth.\" Abu Bakr, may Allah be pleased with him, said: Why is that, O Messenger? He said: \"Because they are in a state of bond (Ribaat) until the Day of Resurrection\" (1). [Prophets' Supplication for Egypt and its People] The Messenger of Allah, peace be upon him, wrote to a group of kings, (among them (2)) Heraclius, but none of them answered him. He wrote to Al-Muqawqis, the ruler of Egypt, who answered his letter with a beautiful reply, and gifted him clothes, horses (Kura') (3), and two bondmaids from the Copts; Maria and her sister (and he gifted him honey, so he accepted his gift, and took Maria as a concubine, and she bore him a child, Ibrahim. And he gifted her sister to Hassan bin Thabit, and she bore him Abd al-Rahman bin Hassan) (4). Peace be upon him asked about the honey (that) (5) was gifted to him, saying: Where is this from (6)? It was said (to him) (7): From a village in Egypt called \"Banha\". He said: \"O Allah, bless Banha and its honey\" (8). So its honey to our day is the best honey of Egypt.",
    "foot_note": "1. Cited by the author of Al-Kanz under number 38262 from the narration of Umar bin al-Khattab. \n2. Missing from: B, exists in: A, C. \n3. Kura': A noun collecting horses. Also weapons. \n4. Between brackets missing from: B, exists in A, C. \n5. Missing from: B, exists in: A, C. \n6. Missing from: B, exists in: A. \n7. Missing from: B, C. Exists in A. \n8. I did not find its extraction... Al-Suyuti indicated in Husn al-Muhadarah 1/14: \"Mursal with a good chain\".",
    "book_id": "405",
    "new_page_number": 32
  },
  {
    "serial_number": "6303881",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 12,
    "volume_number": 1,
    "text": "It was narrated from Abdullah bin Abbas that he said: Noah, peace be upon him, prayed to his Lord for his son and his son's son: Misr bin Baysar bin Ham bin Noah - and Egypt was named after him, and he is the father of the Copts - saying: O Allah, bless him and his progeny, and settle him in the blessed land which is the mother of lands and the aid of servants; its river is the best of the rivers of the world. Place in it the best of blessings, and subjugate the land to him and his children, tame it for them, and strengthen them over it (1). The Kaaba: The Sacred House, which is the house of Hagar and her son Ishmael, peace be upon them, who used to inhabit it. It is narrated that the House was demolished in the pre-Islamic era (Jahiliyyah), so Quraysh assigned its building to a man from the Copts called: Baqum. Islam reached him while he was upon that building (work). [Prophets who Married into the Copts] The Prophets who married into the Copts are Abraham the Friend, peace be upon him, by taking Hagar, the mother of Ishmael, peace be upon them, as a concubine. And Joseph by marrying the daughter of the ruler of Ain Shams (Heliopolis) whom Allah mentioned in His Book, saying: {And she closed the doors and said, 'Come, you'} [Yusuf: 23]. And Muhammad, peace be upon him, by taking Maria as a concubine. [Those mentioned by Allah in His Book from the People of Egypt] Among those whom Allah mentioned in His Book from the people of Egypt is a believing man from the family of Pharaoh who concealed his faith. The Almighty said: {And a believing man from the family of Pharaoh who concealed his faith said, 'Do you kill a man [merely] because he says, \"My Lord is Allah\" while he has brought you clear proofs from your Lord?'} [Ghafir: 28]. And among them is Qarun (Korah), who was Moses' cousin: Allah Almighty said: {And We gave him of treasures whose keys would burden a band of strong men} [Al-Qasas: 76]. And the Almighty said: {So he came out before his people in his adornment} [Al-Qasas: 79].",
    "foot_note": "1. Mentioned by Al-Maqrizi in: Al-Khitat 1/27, Ibn Zahira in Mahasin Misr 78, Al-Qalqashandi in Subh al-A'sha 3/313, and Al-Nuwayri in Nihayat al-Arab 1/347.",
    "book_id": "405",
    "new_page_number": 33
  },
  {
    "serial_number": "6303882",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 13,
    "volume_number": 1,
    "text": "Qarun was the wealthiest person in the world. And among them: Haman, the Almighty said: {And Pharaoh said, 'O eminent ones, I have not known you to have a god other than me. Then ignite for me, O Haman, [a fire] upon the clay and make for me a tower'} [Al-Qasas: 38]. And among them, it is said: Al-Khidr, peace be upon him. Some scholars narrated that he was the son of the Pharaoh of Moses from his loins; he believed in Moses, crossed the sea with him, was prominent with him, and was a prophet. And among them: Pharaoh's ministers and sitters. Allah Almighty mentioned regarding them in His Book good presence and sound intellect. The Almighty said quoting Pharaoh: {He said to the eminent ones around him, 'Indeed, this is a learned magician (34) He wants to drive you out of your land by his magic, so what do you advise?' (35) They said, 'Postpone [the matter of] him and his brother and send among the cities gatherers (36) Who will bring you every learned, skilled magician'} [Ash-Shu'ara: 34-37]. Are there in the world (sitters) (1) of a king more sound in mind and better in (presence) (2) than them? Where they were fair, and ordered that he be tested with something similar to what happened to them that resembles what he brought. They were not in the status and ugliness of presence as the ministers of Nimrod, when he consulted them regarding Abraham, peace be upon him. The Almighty said quoting them: {They said, 'Burn him and support your gods - if you are to act'} [Al-Anbiya: 68]. Allah Almighty mentioned that about them in His Noble Book. And among them: The magicians who gathered for Moses. When they saw Moses' signs, they did not persist in disbelief, and they did not hesitate to believe and prostrate to Allah Almighty.",
    "foot_note": "1. Missing from: B, exists in: A, C. \n2. In A: \"view\" (Manzara). Established in: B, C.",
    "book_id": "405",
    "new_page_number": 34
  },
  {
    "serial_number": "6303883",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 14,
    "volume_number": 1,
    "text": "The Almighty said in His Book: {So the magicians fell down in prostration (46) They said, 'We have believed in the Lord of the worlds (47) The Lord of Moses and Aaron'} [Ash-Shu'ara: 46-48]. In many verses, He repeated their mention and praised them. {So decree whatever you are to decree. You can only decree for this worldly life} [Ta-Ha: 72]. Ibn Lahi'ah narrated from Abdullah bin Hubayra al-Saba'i, Bakr bin Amr al-Khawlani, and Yazid bin Abi Habib, they said: The number of magicians was twelve magicians. Under each magician were twenty corporals (Arif). Under each corporal were a thousand magicians. So all the magicians were two hundred and forty thousand, two hundred and fifty-two people, including the leaders and corporals (1). The narrators agreed that no group is known to have embraced Islam in a single hour more than the group of Copts. It is narrated that not a single man among them was tempted (away from faith) as the Children of Israel were tempted by worshiping the calf. It is narrated that Abdullah bin Umar said: The Copts are the noblest of non-Arabs in lineage, the most generous in hand, the best in element, and the closest in kinship to the Arabs entirely, and to Quraysh specifically. Abu Huraira narrated that the Messenger of Allah, peace be upon him, said: \"Egypt is the best of lands in soil, and its non-Arabs are the noblest of non-Arabs in lineage\" (2). (Some) (3) scholars said: No nation remains of the non-Arabs except that it has mixed with others, except the Copts of Egypt. It was narrated from the Prophet, peace be upon him, that he said when his son Ibrahim died: \"Had he lived, he would have been a truthful prophet (Siddiq Nabi). And indeed, he has two wet nurses in Paradise. And had he lived, the Copts would have been freed, and no one from them would ever be enslaved\" (4).",
    "foot_note": "1. The number implies a multitude. \n2. Fabricated Hadith. See: Tadhkirat al-Mawdu'at 119. \n3. Missing from: B, exists in: A, C. \n4. Abandoned (Matruk) Hadith... Al-Suyuti listed it in Al-Jami' al-Saghir 2/130 and marked it as weak.",
    "book_id": "405",
    "new_page_number": 35
  },
  {
    "serial_number": "6303884",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 15,
    "volume_number": 1,
    "text": "[Mention of Wise Men Egypt Produced] Among them: (Nayrouz) (1) Abu Bukhtanasar (Nebuchadnezzar), from a village called Sisru from the district of \"Armant\" (2). He was a man of knowledge. He looked into his knowledge and found that a man would issue from his loins who would destroy Egypt, so he gave Allah Almighty a solemn pledge (3) that he would never marry a woman. He went out to the Levant, then to Iraq, and settled in Persia in a village called Niffar (4). The king of that village (5) had a daughter who suffered from madness (6). The Egyptian prescribed a medicine for her cure. (When he saw her, he witnessed surpassing beauty and asked for her hand from her father) (7). He entered upon her, and causes took place between them until she became pregnant by him. She gave birth to Bukhtanasar, so the destruction of the world happened at his hands. And among them: Alexander the Two-Horned (Dhul-Qarnayn) (8), from a village towards Alexandria...",
    "foot_note": "1. In A: \"Tadnis\", in B: \"Badis\". Established in C and Maqrizi's Khitat. \n2. Armant: A district in Upper Egypt... \n3. Mawthiq: Covenant. \n4. Niffar: Name of an old village in Persia. \n5. B: \"The King in that village\", established from A, C. \n6. Lamam: Madness/Insanity. \n7. Between brackets missing from B, C. Exists in A. \n8. Al-Maqrizi said: The truth is that Dhul-Qarnayn - mentioned by Allah - is Arab... a King of Himyar. It was a mistake to think Alexander son of Philip... is Dhul-Qarnayn...",
    "book_id": "405",
    "new_page_number": 36
  },
  {
    "serial_number": "6303885",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 16,
    "volume_number": 1,
    "text": "...called Lubyah. He owned the earth entirely. Allah mentioned him in His Noble Book by his name, saying: {And they ask you about Dhul-Qarnayn. Say, 'I will recite to you about him a report' (83) Indeed We established him upon the earth, and We gave him to everything a way (84) So he followed a way (85) Until, when he reached the setting of the sun, he found it set in a spring of dark mud, and he found near it a people. We said, 'O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness'} [Al-Kahf: 84-86]. And he built the dam of Gog and Magog. Allah Blessed and Almighty said: {They said, 'O Dhul-Qarnayn, indeed Gog and Magog are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?' (94) He said, 'That in which my Lord has established me is better, but assist me with strength; I will make between you and them a dam' (95) Bring me sheets of iron} [Al-Kahf: 94-96]. And he built Alexandria, and it is narrated that it is: {Iram - with lofty pillars (7) The likes of which had never been created in the land} [Al-Fajr: 7-8]. He built Alexandria in the land of the Khazars (1), and built the city of Samarkand (2), and built towers and observation posts in the land of Baskis (3) on the Lake of Tabis (4) at the end of the inhabited world in the north. He performed wondrous deeds in Iraq, in anger for what Bukhtanasar did to Egypt. He killed Dara son of Dara and destroyed Iraq. He wrote to his teacher in Egypt, Aristotle, consulting him about killing those remaining of them. He wrote back to him: Do not do it, but appoint every leader among them over a region of his country; for they will compete for leadership, and a king will never unite them. He did so, and they remained like that for a long time...",
    "foot_note": "1. Khazar... land of Turks behind Bab al-Abwab... \n2. Samarkand... said to be of Dhul-Qarnayn's construction... \n3. Thus in \"C\". In \"A\": \"Al-Sakbas\". In B: \"Al-Taskin\". \n4. Thus in B, C. In A: \"Tas\".",
    "book_id": "405",
    "new_page_number": 37
  },
  {
    "serial_number": "6303886",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 17,
    "volume_number": 1,
    "text": "...until Ardashir rose and they united around him, after great fatigue, wars, and hardship. He said: Indeed, a word that separated us for four hundred years is an ominous word (1). And among them: Hermes, the Tripled in Grace (Trismegistus): A prophet, king, and sage. He is the one who turned lead into glittering gold (2). And among them Agathadaimun (3) and Pythagoras (4), the two students of Hermes from the Sabians. They possessed sciences of alchemy, astronomy, magic, spirituality, talismans, temples (Barabi), and secrets of nature (and the temples were entrusted with that) (5). And among them Ausila, Sizwaras, and Bandaqlis (6), masters of divination and augury. And among them Socrates (7), master of theology (speech on the Creator), wisdom, and rhetoric. And among them Plato, master of politics, laws, and discourse on cities and kings (8).",
    "foot_note": "1. Mentioned by Ibn Zahira... \n2. Hermes the Egyptian... \n3. Teacher of Idris before prophethood... \n4. Took wisdom from the companions of Solomon in Egypt... \n5. Missing from B, C. Exists in A. Barabi: Places of worship for ancient Egyptian kings. \n6. Al-Qifti did not mention them... \n7. Socrates was known as Socrates of the Jar... \n8. Plato shared with Socrates in learning from Pythagoras...",
    "book_id": "405",
    "new_page_number": 38
  },
  {
    "serial_number": "6303887",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 18,
    "volume_number": 1,
    "text": "And among them Aristotle (1), master of Logic, Meteorology, Sense and Sensibilia, Generation and Corruption, On the Heavens, Physics (Hearing of Nature) (2), Natural Auscultation, the Epistle on Growing Gold, and the Epistle of Al-Ghara' in Metaphysics. Even Yaqub bin Ishaq al-Kindi, the philosopher of the Arabs, has more than a thousand books in every meaning, all of them being chapters from the books of Aristotle. And among them Ptolemy al-Qaludhi, master of observation and calculation. He is the author of the Almagest on the structure of spheres, the movement of the sun, moon, moving and fixed stars, the image of the zodiac sphere, and the book of Geography on the area of the earth and its climates, mountains, seas, colors, rivers, springs, their beginnings and ends, the description of nations inhabiting the earth, the book of The Fruit (Centiloquium) in judicial astrology, and the book of Planisphaerium (Flattening the Sphere) (3). And among them Aratus, master of the Egg with forty-eight figures in shaping the image of the celestial sphere, the thousand stars, and twenty-two fixed stars, and the Upper Zij (Astronomical Table) (4). And among them Hipparchus, master of observation and the instrument known as the Armillary Sphere (5). And among them Theon, author of the Zij attributed to him (6).",
    "foot_note": "1. Aristotle: His father learned from Pythagoras... \n2. Possibly a misinterpretation of Physics lectures or a musical instrument context in other translations, but here refers to Aristotelian works. \n3. See Ibn al-Nadim: Al-Fihrist... \n4. Ibn Juljul... \n5. See Al-Qifti... \n6. See Ibn al-Nadim...",
    "book_id": "405",
    "new_page_number": 39
  },
  {
    "serial_number": "6303888",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 19,
    "volume_number": 1,
    "text": "And among them Damanius, Valens, and Stephanus, authors of books on judicial astrology. And among them Heron (1), who possesses geometry, magnitudes, the book of Dragging Weights, spiritual mechanical devices (automata), and the making of clocks and instruments for measuring hours. And among them Philo of Byzantium, associated with making water wheels, mills, and movements by subtle devices (2). And among them Archimedes (3), master of mechanics, geometry, mirrors, burning mirrors, making catapults and breaching fortresses, and stratagems against armies and troops on land and sea. And among them Maria and Cleopatra, associated with talismans and properties of natures (4). And among them Apollonius, author of the book of Conics and the book of Cutting Lines (5). And among them Tabushish, author of the book of Spheres. And among them Diophantus (6), author of the book of Arithmetic. And among them Eutocius (7), author of the book of The Sphere and Cylinder. And Galen (8) entered it, and Dioscorides (9) author of Materia Medica (Herbs) (10), and Diogenes, Archagathus, Oribasius (11), Phrygonus...",
    "foot_note": "1. See Ibn al-Nadim... \n2. Cited by Al-Nuwayri... \n3. Who established the bridges... in Egypt during the Nile... \n4. Cited by Al-Nuwayri... \n5. See Ibn al-Nadim... \n6. See Ibn al-Nadim... \n7. See Ibn al-Nadim... \n8. See Ibn al-Nadim... \n9. See Ibn al-Nadim... \n10. A copy exists at Dar al-Kutub... \n11. See Ibn al-Nadim...",
    "book_id": "405",
    "new_page_number": 40
  },
  {
    "serial_number": "6303889",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 20,
    "volume_number": 1,
    "text": "...and Rufus (1), associated with Greek medicine. All of these inhabited Egypt in past ages and bygone days, yet it did not alter the mind of any one of them nor harm his intellect. [Prophets who were in Egypt] As for the Prophets, peace be upon them, who were in it: Abraham the Friend, Ishmael, Jacob, and Joseph. And twelve prophets from the children of Jacob (the Tribes), Moses, Aaron, Joshua son of Nun, Jesus son of Mary, and Daniel, peace be upon them. This is what was mentioned regarding those who were there before Islam. [Companions who were in Egypt in Islam] As for the Companions, jurists, scholars, rabbis, ascetics who were there in Islam, and the Kings, Caliphs, people of knowledge, poetry, grammar, and oratory who entered it, and everyone who excelled over the people of his time or outshone the people of his era, that would be too vast for us, but we will abbreviate that to the famous ones. People of knowledge, recognition, and narration mentioned that over a hundred men who accompanied the Messenger of Allah, peace be upon him, entered Egypt during its conquest. Yazid bin Abi Habib (2) said: Eighty men from the Companions of the Messenger of Allah, peace be upon him, stood to establish the Qiblah of the Congregational Mosque. Among them: Al-Zubayr bin al-Awwam, Al-Miqdad bin al-Aswad (3), Ubadah bin...",
    "foot_note": "1. Note that Ibn al-Nadim, Ibn al-Kindi... names differ... \n2. Biography preceded. \n3. Al-Miqdad bin al-Aswad... died in 33 AH...",
    "book_id": "405",
    "new_page_number": 41
  },
  {
    "serial_number": "6303890",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 21,
    "volume_number": 1,
    "text": "...al-Samit (1), Abu al-Darda (2), Fadalah bin Ubayd (3), Uqbah bin Amir, Abu Dharr (4), (Mahmiyah bin Jaz' (5), Nubayh bin Su'ab (6)), Rafi' bin Malik, Rabi'ah bin Shurahbil bin Hasanah (7), Sa'd bin Abi Waqqas (8), Amr bin Alqamah, (Abdullah bin Amr bin al-As (9)), (Abdullah bin Umar bin al-Khattab (10)), Kharijah bin Hudhafah (11), Abdullah bin Sa'd bin...",
    "foot_note": "1. Ubadah bin al-Samit... died in Palestine 34 AH. \n2. Abu al-Darda... died 32 AH. \n3. Fadalah bin Ubayd... died 53 AH. \n4. Abu Dharr al-Ghifari... died 32 AH. \n5. Mahmiyah bin Jaz'... \n6. Between brackets missing from A... Nubayh bin Su'ab... \n7. Rabi'ah bin Shurahbil... \n8. Sa'd bin Abi Waqqas... died 55 AH. \n9. Missing from A... \n10. Missing from B... \n11. Kharijah bin Hudhafah... killed by the Kharijite...",
    "book_id": "405",
    "new_page_number": 42
  },
  {
    "serial_number": "6303891",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 22,
    "volume_number": 1,
    "text": "...Abi Sarh (1), Abu Rafi' the freed slave of the Messenger of Allah, peace be upon him (2), (Muhammad bin Maslamah (3)), Maslamah bin Mukhallad (4), Abu Ayyub (5), Ruwayfi' bin Thabit (6), Hubayb bin Mughfil (7), Ka'b bin Dinna (8), Muawiyah bin Hudayj (9), Ammar bin Yasir, Amr bin al-As, Abu Huraira, and others. [Jurists and Scholars who were in Egypt] As for the jurists and scholars who were there, among them: Yazid bin Abi Habib, and Al-Layth bin Sa'd, who has a school of thought (Madhhab) unique to him. He is the one who released Al-Rashid from his oath...",
    "foot_note": "1. Abdullah bin Sa'd... died 36 AH. \n2. Abu Rafi'... \n3. Missing from B... Muhammad bin Maslamah... died 43 AH. \n4. Maslamah bin Mukhallad... died 62 AH. \n5. Abu Ayyub al-Ansari... died 52 AH. \n6. Ruwayfi' bin Thabit... died 56 AH. \n7. Hubayb bin Mughfil... Wadi Natrun (Wadi Habib) attributed to him... \n8. Ka'b bin Dinna... \n9. Muawiyah bin Hudayj... died 52 AH.",
    "book_id": "405",
    "new_page_number": 43
  },
  {
    "serial_number": "6303892",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 23,
    "volume_number": 1,
    "text": "...which the jurists of the world failed to resolve. And among them (Abdullah bin Wahb (1)) who surpasses a group of authoring jurists with his authorship, having about a hundred parts in his authorship. And among them Abdullah bin Lahi'ah, who has a standing in jurisprudence, Hadith, and news. And among them Ashhab (2), Ibn al-Qasim (3), Abdullah bin Abd al-Hakam (4), Asad bin Musa (5), Muhammad bin Abd al-Hakam (6), Al-Muzani (7), Al-Rabi' the Muezzin (8), and Ahmad bin Salamah...",
    "foot_note": "1. Missing from B... Ibn Wahb... \n2. Ashhab bin Abd al-Aziz... died 204 AH. \n3. Abd al-Rahman bin al-Qasim... died 191 AH. \n4. Missing from B... Abdullah bin Abd al-Hakam... died 215 AH. \n5. Asad bin Musa... Asad al-Sunnah... \n6. Muhammad bin Abdullah bin Abd al-Hakam... died 268 AH. \n7. Al-Muzani... died 264 AH. \n8. Al-Rabi' bin Sulayman... died 207 AH.",
    "book_id": "405",
    "new_page_number": 44
  },
  {
    "serial_number": "6303893",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 24,
    "volume_number": 1,
    "text": "...Al-Tahawi (1). Each one of them excelled in his school of thought and outshone (2) the people of his era. Each of them has authored books that the rest of the world is incapable of matching. Among them Sa'id bin Ufayr, Yahya bin Uthman, Ibn Qudayd, Muhammad bin Yusuf al-Kindi (3), Al-Maysari (4), and Ibn Abi Khaythama. Every (5) one of them surpassed the people of his era and excelled over them in jurisprudence, knowledge, news, days of the people, and mastery of all sciences. [Ascetics who were in Egypt] There were ascetics there: Haywah bin Shurayh (6), Sulaym bin Itr (7), Sulayman bin al-Qasim (8), Abu al-Rabi' al-Zubdi (9), Sa'id al-Adam (10), Idris...",
    "foot_note": "1. Al-Tahawi... died 321 AH. \n2. C: \"in\". \n3. Abu Umar al-Kindi is mentioned here... proof book is not his. \n4. Al-Maysari... \n5. C: \"Every\". \n6. Haywah bin Shurayh... died 158 AH. \n7. Sulaym bin Itr... died 75 AH. \n8. Sulayman bin al-Qasim... \n9. Abu al-Rabi' al-Zubdi... \n10. Sa'id bin Zakariya al-Adam... died 207 AH.",
    "book_id": "405",
    "new_page_number": 45
  },
  {
    "serial_number": "6303894",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 25,
    "volume_number": 1,
    "text": "...Al-Khawlani (1), (Dhul-Nun al-Misri (2)), and others whom we mentioned. Among them grew Hani ibn al-Mundhir. Its poet: Habib bin Aws al-Ta'i (Abu Tammam). Its knight: Malik bin Na'imah (3), the Knight of the Blonds. Its theologian: Ghaylan Abu Marwan (4), head of the Ghaylaniyya. [Caliphs born in Egypt] Born in it of the Caliphs were Umar bin Abd al-Aziz and Ja'far al-Mutawakkil Ala Allah. [Jurists and others who entered Egypt] As for those who entered it among jurists and others: Al-Sha'bi (5), (Abu Salamah bin Abd al-Rahman (6)), Ikrimah, Muhammad bin Ismail bin Ulayyah, Al-Shafi'i, Hafs al-Fard (7), Ibrahim bin Adham, and Mansur bin Ammar the Theologian. [Caliphs who entered Egypt] Caliphs who entered it: Muawiyah (8), Marwan bin al-Hakam, Abdullah bin al-Zubayr, Abd al-Malik bin Marwan, Marwan bin Muhammad, Al-Saffah, Al-Mansur, Al-Ma'mun, Al-Mu'tasim, and Al-Wathiq.",
    "foot_note": "1. Idris bin Yahya... died 211 AH. \n2. Dhul-Nun al-Misri... died 245 AH. \n3. Malik bin Na'imah... \n4. Ghaylan bin Muslim... died after 105 AH. \n5. Al-Sha'bi... died 104 AH. \n6. Missing from B... \n7. Hafs al-Fard... \n8. Muawiyah... died 66 AH.",
    "book_id": "405",
    "new_page_number": 46
  },
  {
    "serial_number": "6303895",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 26,
    "volume_number": 1,
    "text": "[Poets who entered Egypt] Poets who entered it: Nusayb (1), Jamil Buthayna (2), Kuthayyir Azza (3), Ubayd Allah bin Qays al-Ruqayyat (4), Al-Ahwas (5), Abdullah bin al-Zubayr, Abu Dhu'ayb (6), Mu'alla al-Ta'i (7), Abu Nuwas, Di'bil bin Ali al-Khuza'i, Al-Ghaydaq, Zabdah (8), Abu Sa'sa'ah, Abu Hajlah, (Abu Nijad (9)), Ibn Hadhar (10), Al-Husayn al-Jamal (11), and others we have mentioned.",
    "foot_note": "1. Nusayb bin Rabah... \n2. Jamil bin Abdullah... \n3. Kuthayyir bin Abd al-Rahman... died 105 AH. \n4. Ubayd Allah bin Qays... \n5. Al-Ahwas... \n6. Abu Dhu'ayb al-Hudhali... \n7. Mu'alla al-Ta'i... \n8. In A, C: \"Yazid\"... Correct is Zabdah... \n9. Missing from A... \n10. Ja'far bin Muhammad bin Hadhar... \n11. Al-Husayn bin Abd al-Salam...",
    "book_id": "405",
    "new_page_number": 47
  },
  {
    "serial_number": "6303896",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 27,
    "volume_number": 1,
    "text": "[Mention of Egypt and its Superiority over other Cities] As for the mention of Egypt and its superiority over other cities, and what it was distinguished and preferred with over others: Abu Basrah al-Ghifari (1) narrated saying: Egypt is the storehouse of the whole earth, and its sultan is the sultan of the whole earth. Allah Almighty said through the tongue of Joseph peace be upon him: {He said, 'Appoint me over the storehouses of the land. Indeed, I will be a knowing guardian'} [Yusuf: 55]. Those storehouses were not outside Egypt, so Allah relieved (2) every dweller and bedouin of the whole earth through Egypt and its storehouses. Allah Almighty made it the middle of the world, located in the third and fourth climes (3). Thus, it was saved from the heat of the first and second climes, and from the cold of the fifth, sixth, and seventh climes. Its air became good, its atmosphere pure, its heat weakened, and its cold lightened. Its people were saved from the winter resorts of the mountains, the summer resorts of Oman, the thunderbolts of Tihamah, the boils (4) of Al-Jazirah, the scabies (5) of Yemen, the plagues of the Levant, the ghouls (6) of Iraq, the scorpions of Askar Mukram (7), the spleen disorders of Bahrain, and the fever of Khaybar. They were secure from the raids of the Turks, the armies of the Romans, the factions of the Arabs, the plots of the Daylam (8), the detachments of the Qarmatians...",
    "foot_note": "1. Companion... \n2. In A: \"aided\". \n3. See Yaqut... \n4. Dummal: Inflammation... \n5. In Nihayat al-Arab... \"Sweat of Yemen\". \n6. Ghoul: Demon... \n7. Town in Khuzestan. \n8. Daylam... mountains...",
    "book_id": "405",
    "new_page_number": 48
  },
  {
    "serial_number": "6303897",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 28,
    "volume_number": 1,
    "text": "...the bursts (1) of rivers, and the drought of rains. Sources of its provision have surrounded it; its management is close, so its fertility increased, its life became comfortable, and its prices cheap (2). Sa'id bin Abi Hilal (3) said: Egypt is the mother of lands and the aid of servants. It is mentioned that Egypt is depicted in the books of the ancients, and all other cities are stretching their hands to it asking for food (4). Amr bin al-As said: The governorship of Egypt is comprehensive; it equals the Caliphate (5). People of knowledge agreed: The people of the world are compelled to travel to Egypt and seek provision in it, while its people do not seek provision elsewhere, nor do they travel to any other country. Even if a barrier were struck between it and the [lands (6)] of the world, its people would be self-sufficient with what is in it, needing nothing from the rest of the [lands (7)] of the world. A Hadith was narrated from Haywah bin Shurayh, from Uqbah bin Muslim (8), attributing it to Allah Almighty saying on the Day of Resurrection to the inhabitants of Egypt, enumerating His favor upon them: \"Did I not settle you in Egypt, so you were satiated from its bread and quenched from its water? Hold your tongues\" (9). Yahya bin Sa'id said: I toured the lands and did not see piety in any country except in Medina and Egypt.",
    "foot_note": "1. Bathq: sudden gush... \n2. Al-Suyuti... \n3. Sa'id bin Abi Hilal... died 149 AH. \n4. Husn al-Muhadarah... \n5. Nihayat al-Arab... \n6. Supplement... \n7. Husn al-Muhadarah... \n8. Uqbah bin Muslim... \n9. Al-Suyuti...",
    "book_id": "405",
    "new_page_number": 49
  },
  {
    "serial_number": "6303898",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 29,
    "volume_number": 1,
    "text": "Khalid bin Yazid (1) said: Ka'b al-Ahbar used to say: Were it not for my desire for the Levant, I would have inhabited Egypt. It was said: Why is that, O Abu Ishaq? He said: I indeed love Egypt and its people; for it is a town exempted from tribulations, and its people are people of exemption (afiyah), so they are thereby exempted. Whoever intends evil against it, Allah throws him on his face. It is a blessed land for its people (2). It was narrated from Shufayy (3) bin Ubayd al-Asbahi that he said: Egypt is a town exempted from tribulations; no one intends evil against them except that Allah strikes him down, and no one intends their destruction except that Allah destroys him. People of knowledge mentioned that it is written in the Torah: The land of Egypt is Allah's storehouse; whoever intends evil against it, Allah shatters him. Abu al-Rabi' al-Sa'ih said: What an excellent land is Egypt! From it, one performs Hajj for two Dinars and goes on military expeditions for two Dirhams. He means Hajj via the Sea of Qulzum (Red Sea) (4), and expeditions to Alexandria and other coasts of Egypt (5). Yahya bin Uthman mentioned, from Ahmad bin Abd al-Karim, who said: I toured the world and saw its people. I saw the monuments of Prophets, Kings, and Wise Men. I saw the structures of Khosrow and Caesar and other kings of the earth. I saw the monuments of Solomon son of David, peace be upon them, in Jerusalem, Palmyra, and Jordan, and what the devils built by the direction of prophethood. Yet, I never saw anything like the temples (Barabi) of Egypt in their wisdom, nor like the monuments within it, and the buildings of its kings and wise men. [Districts of Egypt] In Egypt, there are eighty districts (Kura). There is no district among them except that it contains novelties and wonders...",
    "foot_note": "1. Khalid bin Yazid... died 139 AH. \n2. Mentioned by Ibn Taghribirdi... \n3. In A: \"Sa'd\"... \n4. Qulzum: City on the coast... \n5. Husn al-Muhadarah...",
    "book_id": "405",
    "new_page_number": 50
  },
  {
    "serial_number": "6303899",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 30,
    "volume_number": 1,
    "text": "...of types of wheat, buildings, animal production, drinks, food, fruit, and everything people benefit from and kings hoard. Every type is known by its district, and every color is attributed to its district. Its Upper Land (Sa'id) is Hijazi land; its heat is like the heat of Hijaz. It grows palm trees, Arak (1), Qurt (clover) (2), Doum palm (3), and Ushar (4). Its Lower Land is Shami (Levantine); it rains the rain of the Levant, and grows the vegetation of the Levant, such as vines, figs, bananas, walnuts, all fruits, legumes, and aromatic plants. Snow falls in it (5). Among them is the district of Lubyah and Maraqiyah (6): temples, mountains, thickets, olives, wild, marine, and mountainous vineyards, lands of camels and livestock, production, honey, and milk. In every district of Egypt, there is a city. The Almighty said: {And send among the cities gatherers} [Ash-Shu'ara: 36]. In every city of them, there are wondrous monuments of buildings, rocks, marble, and temples. All those cities are reached by ships (carrying food, goods, and tools to Fustat (7)); a single ship carries what five hundred camels carry.",
    "foot_note": "1. Arak: shrub... \n2. Qurt: clover... \n3. Doum: palm trees... \n4. Ushar: plant... \n5. Compare Husn al-Muhadarah... \n6. Yaqut said: Maraqiyah... \n7. Missing from B, C, exists in A.",
    "book_id": "405",
    "new_page_number": 51
  },
  {
    "serial_number": "6303900",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 31,
    "volume_number": 1,
    "text": "Among them: Alexandria, with its buildings, wonders, and monuments. People agreed that there is no city in the world on three layers except it. When Abd al-Aziz bin Marwan entered it, while he was then the Governor of Egypt, he said to its administrator (1) when he saw its monuments and wonders: Tell me, what was the number of its people in the days of the Romans? He said: By Allah, O Prince, no king ever grasped the knowledge of this. But I will tell you how many Jews were in it, for the King of the Romans ordered their census, and they were six hundred thousand. He said: Then what is this ruin in its outskirts? He said: I heard about one of the Kings of Persia when they conquered Egypt, that he ordered a Dinar to be imposed on every dreamer (adult) for the development of Alexandria. Its elders and scholars came to him and said: O King, do not weary yourself, for Alexander the Two-Horned spent three hundred years building it. Indeed, its people spent seventy years walking in it during the day only with black cloths in their hands, fearing for their eyesight from its intense whiteness (2). Among its virtues is what the commentators among the people of knowledge said: It is the city Allah described in His Noble Book, saying: {Iram - with lofty pillars (7) The likes of which had never been created in the land} [Al-Fajr: 7-8]. Ahmad bin Salih (3) said: Sufyan bin Uyaynah said to me: O Egyptian, where do you live? I said: I live in Fustat. He said: Do you go to Alexandria? I said: Yes. He said to me: That is Allah's quiver in which He carries the best of His arrows (4).",
    "foot_note": "1. In Khitat... \n2. Al-Khitat... \n3. Ahmad bin Salih... died 248 AH. \n4. Husn al-Muhadarah...",
    "book_id": "405",
    "new_page_number": 52
  },
  {
    "serial_number": "6303901",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 32,
    "volume_number": 1,
    "text": "Abdullah bin Marzuq (1) al-Sadafi said: When the death of my cousin Khalid bin Yazid (2) was announced to me - and he had died in Alexandria - I met Musa bin Ulayy (3) bin Rabah, Abdullah bin Lahi'ah, and Al-Layth bin Sa'd separately. They all said: Did he not die in Alexandria! I would say: Yes. They would say: He is alive with Allah, being provided for. The reward of his bond (Ribaat) continues for him as long as the world stands, and he has the reward of a martyr until he is resurrected upon that (4). Among its wonders is the Lighthouse (Pharos), and its height is two hundred and eighty cubits. It had a mirror in which one could see who was passing by Constantinople. And in it is the stadium/theater where they used to gather; none of them would see anything blocking his companion, nor would they wrong each other (5). Each of them would look at the face of his companion. If one of them did something, spoke, read a book, or played a game, the others would hear it, and the near and far would look at it equally. In it, they used to throw a ball; whoever's sleeve it entered would govern Egypt. Amr bin al-As had entered as a merchant in the pre-Islamic era (Jahiliyyah) with leather and cotton (6). He witnessed this stadium among the spectators. The ball entered his sleeve. They denied that and said: This ball has never lied to us! How can this Bedouin have the governorship of Egypt! They repeated it, and the ball returned to his sleeve multiple times. They were amazed at that, until Allah brought Islam, and his affair was what it was (7).",
    "foot_note": "1. In A: \"Ibn Marwan\"... \n2. In A: \"Zayd\"... \n3. Ulayy... \n4. Husn al-Muhadarah... \n5. Maqrizi: \"wrong each other regarding higher and lower seats\". \n6. B: \"Perfume\", established in A... \n7. Mentioned by Maqrizi...",
    "book_id": "405",
    "new_page_number": 53
  },
  {
    "serial_number": "6303902",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 33,
    "volume_number": 1,
    "text": "In it are the pillars (Sawari) and the two obelisks (Masallatan). Their wonders and monuments are more than can be counted, such that its canal is paved with marble from its beginning to its end, found as such to this day. Those who look into ages, atmospheres, and lands said: [The best air is] in Maryut of the district of Alexandria, and the Valley of Fergana (1). People of knowledge (2) mentioned that the Lighthouse was in the middle of Alexandria until the sea overcame it, so it ended up inside it (the sea). You can see the buildings and foundations in the sea clearly until the Day of Resurrection (3). Among them is the district of Fayoum (4): It consists of three hundred and sixty villages, arranged according to the number of days of the year. It never falls short of irrigation. If the Nile falls short in a year, every village in it provisions Egypt for one day. There is no city in the world built by Revelation (Wahi) (5) other than this district. Nor is there in the world a land more precious, more fertile, more abundant in good, or more plentiful in rivers. If we compared the rivers of Fayoum with the rivers of Basra and Damascus, the favor would be ours. A group of people of intellect and knowledge counted its facilities and goodness, and found them uncountable...",
    "foot_note": "1. Maqrizi... \n2. Maqrizi attributes this to... Ibn al-Kindi... \n3. Maqrizi: \"Do you not see...\" \n4. From here until \"seventy types\", Maqrizi attributes to Ibn al-Kindi... \n5. Thus in sources... In Khitat: \"Al-Raha\" (The Mill). Suyuti: It is a city arranged by Joseph by Revelation...",
    "book_id": "405",
    "new_page_number": 54
  },
  {
    "serial_number": "6303903",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 34,
    "volume_number": 1,
    "text": "...so they left that and counted what is permissible (Mubah) in it, over which no one has ownership, neither Muslim nor covenanter, which the strong and weak use for help; it exceeded seventy types. Among them is the city of Memphis (Manf) (1). Its buildings, wonders, idols, buried treasures, and hoards are more than can be counted - no refuter refutes that, nor denier denies it - from the monuments of kings, wise men, and prophets. Ibrahim bin Munqidh al-Khawlani said: We went out to Memphis, and found Uthman (2) bin Salih sitting at the door of the church (synagogue/temple). We greeted him, and he said: Do you know what is written on the door of the church? We said: What is it? He said: Written on it is, \"I am so-and-so son of so-and-so. Do not blame me for the smallness of this church, for I bought every cubit of it for a hundred Dinars.\" We said: Surely this has a story. He said: Here Moses, peace be upon him, struck (wakaza) (3) the man and killed him. Among them is the city of Ain Shams (Heliopolis), which is the Temple of the Sun. In it are the two Columns (Obelisks) the likes of which, nor their nature, has ever been seen. They are carried on the face of the earth without a foundation. Their height in the sky is about fifty cubits. On them is the image of a human on a beast. On their top is something like two minarets made of copper. When the Nile flows, water drips from their tops, and you can discern and see it springing from them clearly. Among them is Al-Farama (Pelusium) (4). It has more wonders and older monuments. The people of Egypt mention that there used to be a road from it to the island of Cyprus by land, but the sea overcame it.",
    "foot_note": "1. Memphis: Capital of Egypt after the flood... \n2. Biography preceded. \n3. Wakaza: Pushed/struck. \n4. From here... Maqrizi attributes to Ibn al-Kindi...",
    "book_id": "405",
    "new_page_number": 55
  },
  {
    "serial_number": "6303904",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 35,
    "volume_number": 1,
    "text": "They say: The sea overcame the quarry of pied marble, [and the quarry of (1)] white marble is in Lubyah. Yahya (2) bin Uthman said: I was stationed in Al-Farama, and between it and the sea was nearly a day's travel. People and soldiers would go out in huts on the coast. Then the sea rose over all that. Ibn Qudayd said: Ibn al-Mudabbir (3) (who was in Tinnis (4)) headed to Al-Farama to demolish gates of stone east of the fort, needing to make lime from them. When he pulled out a stone or two, the people of Al-Farama came out to him with weapons and prevented him from pulling them out. They said: These are the gates about which Allah Almighty said through the tongue of Jacob: {And he said, 'O my sons, do not enter from one gate but enter from different gates'} [Yusuf: 67]. In Al-Farama are its wondrous palm trees which bear fruit when unripened dates (Busr) (5) and fresh dates (Rutab) cease from the rest of the world. This fresh date begins when the palm trees produce in the Kanun months (December/January), and it does not cease for four months until the Balakh (unripe dates) comes in the spring. This is not found in any country, neither in Basra...",
    "foot_note": "1. Supplement from Al-Khitat. \n2. Preceded. \n3. Ahmad bin Muhammad bin al-Mudabbir... \n4. Missing from A... Tinnis: Island... \n5. Busr: Dates before becoming soft (Rutab).",
    "book_id": "405",
    "new_page_number": 56
  },
  {
    "serial_number": "6303905",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 36,
    "volume_number": 1,
    "text": "...nor in Hijaz, nor in Yemen, nor in other lands. The Busr date of this can weigh twenty Dirhams or more. And among it is that whose Busr date is nearly a span (Fitr) in length (1). Ibn al-Takhtakan (2) said: Four districts in Egypt have no superior on the face of the earth, nor equal under the sky: The district of Fayoum, the district of Atrib (3), the district of Samannud, and the district of Sa (4). [Taxes of Egypt] As for its tax (Kharaj), Amr bin al-As collected ten million Dinars in the first year he conquered it. Umar bin al-Khattab wrote to him finding his opinion incapable and saying: I collected twenty million Dinars for the Romans. So in the next year, he collected twelve million Dinars. When Uthman removed Amr from it and appointed Abdullah (5) bin Abi Sarh, he increased the taxes and burdens on the Copts, reaching fourteen million Dinars. Uthman said to Amr: The camel has yielded plenty of milk (Dirrat al-Laqhah) (6). Amr said: But you have harmed the young camel (Fasil). So it declined from that day, and it continues to decrease until today. It was not collected in the days of the Umayyads and Abbasids except less than three million...",
    "foot_note": "1. See Yaqut... \n2. Governor of Egypt... \n3. Was a district... \n4. Sa: A district... \n5. Preceded. \n6. Laqhah: Milking camel.",
    "book_id": "405",
    "new_page_number": 57
  },
  {
    "serial_number": "6303906",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 37,
    "volume_number": 1,
    "text": "...million Dinars, except for the reign of Commander of the Faithful Hisham, for Ibn al-Habhab collected four million for him. And in the reign of the Tulunids, they went to great lengths in its development, so Abu al-Jaysh (1) collected four million Dinars. Ibn al-Habhab (2) managed its taxes for Commander of the Faithful Hisham. He went out himself and surveyed all the land of Egypt, cultivated and uncultivated, that the Nile covers. He found thirty million Feddans (3). Al-Layth bin Sa'd said: Al-Walid bin Rifa'ah managed the taxes for Commander of the Faithful Hisham. He went out to count the skulls (people) and villages. He stayed six months in Upper Egypt and three months in the Lower Land. He counted over ten thousand villages; the smallest village among them had five hundred Coptic skulls. The total of that is five million (4). Usama bin Zaid managed the taxes for Commander of the Faithful Sulayman. He wrote to him: \"Milk the udder until it dries up, and milk the blood until it ceases.\" That was the first hardship that befell the people of Egypt. Sulayman said one day, pleased with what Usama did: [Usama (5)] ([does not accept a bribe of a Dinar nor a Dirham. Umar bin Abd al-Aziz said to him: I will show you someone worse than Usama]) (6) who does not accept a bribe of a Dinar nor a Dirham. He said: Who is he? He said: The enemy of Allah, Iblis (Satan). So Sulayman became angry...",
    "foot_note": "1. Khumarawayh... \n2. Ubayd Allah bin al-Habhab... \n3. Mentioned by Maqrizi... implies exaggeration. \n4. See Husn al-Muhadarah... \n5. Supplement from Ibn Said... \n6. Missing from A, B. Exists in C...",
    "book_id": "405",
    "new_page_number": 58
  },
  {
    "serial_number": "6303907",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 38,
    "volume_number": 1,
    "text": "...and stood up from his council. When Commander of the Faithful Sulayman bin Abd al-Malik died and Umar bin Abd al-Aziz took charge, he sent for the dismissal of Usama before Sulayman was buried. He appointed Hayyan bin Shurayh and ordered him to imprison Usama in every military district (Jund) for six months. Usama built the Old Nilometer (1). Al-Mansur wrote to Muhammad bin Sa'id - who was managing the taxes of Egypt - urging him regarding the tax. He wrote back complaining of its disarray and that it needed spending, for it returns multiples of what is spent. This coincided with the revolt of the descendants of Al-Hasan (2). (So he wrote to him) (3): \"Do not strike the she-camel that has little milk in her udder / For you do not know who the newborn is\" (Do not exhaust the source for short-term gain) (4). This increased its brokenness and disarray. It is mentioned that Amr bin al-As, may Allah be pleased with him, said to Al-Muqawqis: Woe to you, you have governed this city for thirty years, so by what means is its prosperity achieved? He said: By characteristics; among them is digging its canals, plugging its bridges (dikes) and observing them. Its tax should only be taken from its produce. The delay of its people (in payment) should not be accepted (indefinitely but managed), conditions should be fulfilled for them, and salaries should flow to the workers so that (their delay (5)) does not become a cause for bribery. Aid/levies (Ma'awin) and gifts should be lifted from its people so that [that becomes for them (6)] a strength. By this, it is developed and its tax is hoped for.",
    "foot_note": "1. Compare Ibn Said... \n2. Revolt of Banu al-Hasan... \n3. Missing from A... \n4. Verse in Lisan al-Arab... \n5. Missing from A, B... \n6. Supplement from Al-Fada'il al-Bahirah...",
    "book_id": "405",
    "new_page_number": 59
  },
  {
    "serial_number": "6303908",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 39,
    "volume_number": 1,
    "text": "[Egypt's Scenery and Beauty] As for what is admired of its scenic splendor, it was mentioned from Ka'b al-Ahbar that he said: Whoever wants to look at the likeness of Paradise, let him look at Egypt when it becomes autumn (fruit season), when it blooms, when its rivers flow, its fruits hang low, its bounty overflows, and its birds sing. From Abdullah bin Amr, he said: Whoever wants to look at Paradise, let him look at the land of Egypt when its crops turn green, its spring blooms, and its trees are clothed with blossoms (and its birds sing (1)). Al-Ma'mun said to Ibrahim bin Tamim: Describe Egypt to me when its crops turn green, its spring blooms, and its trees are clothed with blossoms, and be brief. He said: A mare's lip (Jahfalah) (2) in the spring, and its rump in the sand. He means it is land and sea; the horse grazes in the spring and cools off in its coolness. It was mentioned by the people of Egypt that Musa bin Isa al-Hashimi (3), who was the Governor of Egypt, said (4) to them one day while at the square at the edge of the cemeteries: Do you contemplate what I see? They said: What does the Prince see? He said: I see a racecourse, gardens of palms, an orchard of trees, residential homes, a mountain peak, a cemetery of the dead, a billowing river, land of crops, a pasture of livestock...",
    "foot_note": "1. Missing from A, C... \n2. Jahfalah: Like the lip of a human. \n3. Governor... 175 AH. \n4. Note in Al-Mughrib says this paragraph is missing...",
    "book_id": "405",
    "new_page_number": 60
  },
  {
    "serial_number": "6303909",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 40,
    "volume_number": 1,
    "text": "...a pasture for horses, a fisherman of the sea, a hunter of wild game, a sailor of a ship, a camel driver, a desert of sand, a plain, and a mountain, all in less than a mile by a mile (1). It is mentioned that the image of the world was depicted for Al-Rashid, and he did not find anything beautiful in it other than the town of Asyut. That is because its area is thirty thousand Feddans in a single level plain (Dast). If a drop were to drip, it would overflow to all its sides. Flax, wheat, clover (2), and all kinds of crops are grown in it. There is no carpet on the face of the earth more wondrous than it. A white mountain parallels it on its western side in the shape of a shawl (Taylasan) (3), as if it were two horns. The Nile borders it on its eastern side, like a stream of silver. Speech cannot be heard in it due to the intensity of the voices of birds. People agreed that there is no carpet of clover on the face of the earth containing standing horses, pitched tents, breeding, camels, grazing livestock, and stewards except in Egypt. [Mention of what was narrated regarding the Nile of Egypt] As for its Nile, Ibn Lahi'ah narrated: That Muawiyah bin Abi Sufyan said to Ka'b: I ask you by Allah the Great, O Ka'b, do you find anything good regarding the Nile of Egypt in the Book of Allah? He said: Yes, by the One who split the sea for Moses, peace be upon him! I find in the Book of Allah Almighty that Allah inspires it when it runs: Allah commands you to run such and such; so run in the name of Allah. Then He inspires it when it ends: Allah commands you to return; so return rightly guided (4). It was narrated from the Prophet, peace be upon him, that he said: \"Four rivers are from Paradise: Sayhan, Jayhan, the Nile, and the Euphrates\" (5).",
    "foot_note": "1. Ibn Said: Al-Mughrib... \n2. Qurt: Livestock feed. \n3. Taylasan: Type of shawl/mantle... \n4. Mentioned by Maqrizi... \n5. Al-Kanz 35335.",
    "book_id": "405",
    "new_page_number": 61
  },
  {
    "serial_number": "6303910",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 41,
    "volume_number": 1,
    "text": "It is narrated that Allah Almighty created the Nile of Egypt as an equivalent to the rivers of the world and their waters. When it begins to increase, they all decrease to supply it, and when it decreases, they all fill up. Abu Qabil (1) mentioned that the Nile of Egypt, in its increase, gushes forth entirely from its beginning to its end. Ibn Lahi'ah said: The Nile of Egypt had an imposition (Qati'ah) (2) upon the districts of Egypt: one hundred and twenty thousand men, with shovels (3) and tools - seventy thousand for Upper Egypt and fifty thousand for the Lower Land - to dig canals, erect bridges and arches (4), block irrigation channels, and cut down Qadb (5) and Halfa grass, and every plant harmful to the land. Mahfuz (6) bin Sulayman said: If the water reaches sixteen (7) cubits, the tax of Egypt is fulfilled. If it increases one cubit after that, the tax increases by one hundred thousand Dinars due to what is irrigated from the high grounds (8). If it increases another cubit after that, one hundred thousand is deducted from...",
    "foot_note": "1. Huyayy bin Hani... died 178 AH. \n2. Qati'ah: imposition/quota of workers. \n3. Masahi: shovels. \n4. Here ends copy \"C\". \n5. Qadb: tall trees... \n6. Mahfuz bin Sulayman... \n7. In A: \"Twenty cubits\"... \n8. In A: \"from the works\"...",
    "book_id": "405",
    "new_page_number": 62
  },
  {
    "serial_number": "6303911",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 42,
    "volume_number": 1,
    "text": "...from the tax, because of what is swept away (1) from the lowlands (Butun) (2). Ibn Ufayr mentioned that Umar bin al-Khattab wrote to Amr bin al-As: In the name of Allah, the Most Gracious, the Most Merciful. From the Servant of Allah Umar, Commander of the Faithful, to Amr bin al-As. Peace be upon you; I praise Allah to you, other than Whom there is no god. As for what follows, I thought about your country, and behold, your land is a wide, broad, and elevated land. Allah has given its people numbers, endurance, and strength on land and sea. The Pharaohs treated it and worked in it with precise work, despite their great arrogance. I marveled at that. So I would like you to write to me describing Egypt as if I were looking at it (3). So Amr bin al-As wrote to him: In the name of Allah, the Most Gracious, the Most Merciful. To the Servant of Allah... As for what follows, your letter reached me... As for what you mentioned regarding the description of Egypt... Egypt... is a black soil and green tree, between a dusty mountain and red sand. The source (mine) (5) of its utility and the station of its provision have surrounded it, between Aswan to the source of the sea, in the flow (6) of the river, a journey for a rider of a month. What is between its mountain and its sand is like a lean (7) belly and a cut back, in which a river draws a line, blessed in the mornings, auspicious in blessings. It flows with gold, and runs with increase and decrease like the courses of the sun and moon. It has days when the springs of the earth and its fountains flow to it, ordered to do so. Until when it rises and overflows (8)...",
    "foot_note": "1. Mustabhir: low land flooded... \n2. Maqrizi... \n3. Husn al-Muhadarah... \n4. In A: \"Cover\"... \n5. Mine of utility: place of work. \n6. Sahh: Flow/Gush. \n7. Aqabb: Lean/Hollow. Ajabb: Cut. \n8. Raba wa Tama: Increased and rose.",
    "book_id": "405",
    "new_page_number": 63
  },
  {
    "serial_number": "6303912",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 43,
    "volume_number": 1,
    "text": "...and its depths intensify (1) and its waves roll (2), the villages surrounded by it become like hills; one cannot reach (3) from one to another except in ships and boats. It stays only a little until it becomes like it was when it first started flowing and first rose to drink. Until its ways and surfaces (4) become clear. Then a despised (5) nation spreads in it, who have been gifted endurance and strength on their land. For others goes what they strove for (6) of their toil without praise reaching them for that. They irrigate its plain, its ruin, and its highlands. Then they cast into it varieties of grain, hoping for completion from the Lord. It stays only a little until it grows strong, then its stalks flow and turn yellow. It is watered from beneath by the soil moisture and from above by the dew, or by pouring clouds flowing with rain clouds. Then at this time of its season, its yield becomes great (7) and its harvest begins. So while it is a black clod of earth, suddenly it is a blue deep water, then a green garden, then a speckled brocade (8), then white silver. So blessed is Allah, the Best of Creators, the Doer of what He wills. And indeed, the best thing you relied upon in that is thanking Allah Almighty, O Commander of the Faithful, for (9) what He bestowed upon you from it. May Allah perpetuate for you the blessing and honor in all your affairs. Peace. People of knowledge agreed that there is no river in the world longer in extent than the Nile. It travels...",
    "foot_note": "1. Islahkham: Intensified. \n2. Ighlawlab: Entwined. \n3. In A: \"Not depart\"... \n4. Roads and backs. \n5. Mahqura: Humiliated (referring to Copts under Romans). \n6. In A: \"what they suffered\"... \n7. Dhubab: yield/crop. \n8. Raqsha: Speckled white and black. \n9. Mentioned by Ibn Zahira...",
    "book_id": "405",
    "new_page_number": 64
  },
  {
    "serial_number": "6303913",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 44,
    "volume_number": 1,
    "text": "...a journey of a month in the lands of Islam, two months in the lands of Nubia, and four months in the ruins where there is no habitation, until it exits from the Mountains of the Moon behind the Equator (1). There is no river in the world that pours from south to north except it. And there is no river that pours into the Sea of Rome (Mediterranean) and the Sea of China except the Nile of Egypt. There is no river in the world that increases and floods in the most intense heat when the rivers and springs of the world decrease, other than the Nile of Egypt. The more the heat increases, the stronger its increase becomes. There is no river in the world that increases by arrangement other than the Nile of Egypt (2). There is no river in the world upon which is cultivated what is cultivated upon the Nile of Egypt, nor is there collected from the tax of a river among the rivers of the world what is collected from the tax of the Nile (3). [Virtue of Egypt's Cemetery] As for the virtue (4) of its cemetery, people of knowledge mentioned that the Tur (Mount Sinai) is part of Al-Muqattam, and that it is included in what the Sanctity (Quds) fell upon in the Almighty's saying: {And We called him from the right side of the Mount (Tur) and brought him near, confiding [to him]} [Maryam: 52]. And the Almighty said: {Indeed, you are in the sacred valley of Tuwa} (5) [Ta-Ha: 12]. Ka'b said: Allah Almighty spoke to Moses from the Tur to the edges of Al-Muqattam of the Sanctity. Tubay' (6) said: The dwellings of Fustat are in the Sanctity (Quds). It is narrated that Moses, peace be upon him, prostrated, and every tree from Al-Muqattam to Tuwa prostrated with him. It is narrated that it is written in the Torah: A valley (7) of a new sacred conquest - meaning - the valley of...",
    "foot_note": "1. Ibn Zahira... \n2. Ibn Zahira... \n3. Ibn Zahira... \n4. Texts... narrated from Ibn al-Kindi... \n5. Tuwa: Name of the valley. \n6. Tubay' bin Amir... \n7. A: \"And when opened\"...",
    "book_id": "405",
    "new_page_number": 65
  },
  {
    "serial_number": "6303914",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 45,
    "volume_number": 1,
    "text": "...[the Mosque of] (1) Moses, peace be upon him, at Al-Muqattam near the stone quarry, and that Moses, peace be upon him, used to converse with his Lord in that valley. Asad bin Musa narrated: I attended a funeral with Ibn Lahi'ah. We sat around him, and he raised his head, looking at the mountain, and said: Jesus son of Mary, peace be upon him, passed by the foot of this mountain wearing a woolen cloak, having tied his waist with a strip, and his mother was by his side. He turned to her and said: O Mother, this is the cemetery of the nation of Muhammad, peace be upon him. While Amr bin al-As was walking at the foot of Al-Muqattam with Al-Muqawqis, Amr said to him: What is the matter (2) with this mountain of yours that it is bald with no vegetation on it like the mountains of the Levant? Should we not dig a canal from the Nile at its bottom and plant it with palm trees? Al-Muqawqis said: We found in the books that it used to be the most abundant of mountains in trees, plants, and fruit. Al-Muqattam son of Misr son of Baysar son of Ham son of Noah, peace be upon him, used to inhabit it. When it was the night in which Allah Almighty spoke to Moses, peace be upon him, He inspired the mountains: I am speaking to a Prophet of My Prophets upon a mountain among you. All the mountains heard and towered high, except the mountain of Jerusalem, for it lowered itself and became small. Allah Almighty inspired it: Why did you do that? - and He knows best. It said: Out of glorification and reverence for You, O Lord! He said: Allah ordered the mountains to gift it whatever vegetation they had. Al-Muqattam gave (3) it all the vegetation it had until it remained (4) as you see. So Allah Almighty inspired it: I will compensate you for your deed with the trees of Paradise or its seedlings. Amr bin al-As wrote about that to Umar bin al-Khattab, may Allah be pleased with them both. (He wrote back to him (5)): I do not know of the trees (6) of Paradise or its seedlings...",
    "foot_note": "1. Supplement from Ibn Said... \n2. A: \"Asked... about\"... \n3. In original \"came\", established as \"gave\" (Jada)... \n4. A: \"became\"... \n5. Missing from A... \n6. Original \"tree\"...",
    "book_id": "405",
    "new_page_number": 66
  },
  {
    "serial_number": "6303915",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 46,
    "volume_number": 1,
    "text": "...for anyone other than Muslims, so make it a cemetery for them. He did so. Al-Muqawqis became angry at that and said to Amr: This is not what you reconciled with me upon! So Umar cut off a piece for him towards the Pool of Habash to bury the Christians in (1). Abdullah bin Lahi'ah narrated from Ayyash (2) bin Abbas that Ka'b al-Ahbar asked a man who wanted [to travel (3)] to Egypt, saying to him: Gift me some soil from the foot of its Muqattam. He brought him a pouch of it. When death approached Ka'b, he ordered it to be spread in his grave under his side (4). There is consensus [that (5)] there is no cemetery in the world more wondrous, more splendid, greater, or cleaner (6) than it in its buildings, domes, and stones. Nor is there a more wondrous soil than it; it is like camphor (and saffron (7)), holy in all books. When you look over it, you see it as if it is a white city, with Al-Muqattam towering over it like a wall behind it (8). [Specific Properties and Wonders in Egypt] As for the properties, wonders, blessings, and wisdoms in it: Its Holy Mountain, its Blessed Nile. In it is the Tur where Allah Almighty spoke to Moses. In it is the Sacred Valley. In it Moses threw his staff (9). In it the sea was split for Moses. In it Moses, Aaron...",
    "foot_note": "1. Husn al-Muhadarah... \n2. Biography preceded... \n3. Supplement... \n4. A: \"under his corpse\"... \n5. Supplement... \n6. A: \"or higher\"... \n7. Missing from B... \n8. Khitat... \n9. B: \"where Moses threw his staff\"...",
    "book_id": "405",
    "new_page_number": 67
  },
  {
    "serial_number": "6303916",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 47,
    "volume_number": 1,
    "text": "...and Jesus (1), peace be upon them, were born. In it was the kingdom of Joseph. In it is the palm tree under which Mary gave birth to Jesus (in Sidmant (2)) of the district of Ahnas (3). In it is the Persea tree (Labkhah) at which Mary suckled Jesus in Ashmun; oil came out of this tree. In it is the Mosque of Abraham, and the Mosque of Maria the mother of Ibrahim, the (concubine (4)) of the Messenger of Allah, peace be upon him, in Hafn (5); she bequeathed that a mosque be built there, so it was built. Among the buildings and monuments of wisdom in it: The Temples (Barabi) and the Two Pyramids (6). There is no building on the face of the earth built by hand, stone upon stone, taller than them. News came that they are the tombs of Hermes and Agathadaimun, and the Sabians (7) make pilgrimage to them from Harran (8).",
    "foot_note": "1. This saying is a delusion; consensus is Jesus born in Bethlehem... \n2. Missing from A... Sidmant... \n3. Ahnas... \n4. Missing from B... \n5. Preceded. \n6. A: \"The Pyramids\"... \n7. Sabians: People who worship stars... \n8. Harran: Ancient city...",
    "book_id": "405",
    "new_page_number": 68
  },
  {
    "serial_number": "6303917",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 48,
    "volume_number": 1,
    "text": "Umar bin Abi Umar said: I met some Sabians who performed pilgrimage to them (1). In it is the Lighthouse of Alexandria. In it is the Column (Obelisk) of Ain Shams. [In it (2)] is the Crevice of Abu Qir to which the [Buwaqir birds flee on a day of the year that was known. Whenever a Buqir bird inserted its beak into the crevice, it went on its way. It keeps doing that until the crevice closes on a Buqir bird among them, catching it (3)]. It remains hanging until the winds blow it away. In it is the Wall of the Old Woman from Al-Arish to Aswan; it surrounds the land of Egypt entirely. In the Nile is the fish called the Ra'adah (Electric Catfish/Torpedo fish); if a man places a skin (or his hand) on it, he cannot help but have his whole body shake violently. In it is the Meeting of the Two Seas, which is the Barrier (Barzakh) mentioned by Allah Almighty, saying: {He released the two seas, meeting [side by side] (19) Between them is a barrier [so] neither of them transgresses} [Ar-Rahman: 19-20]. And the Almighty said: {And made between the two seas a barrier} [An-Naml: 61]. They are the Sea of China and the Sea of Rome. The barrier between them is a night's journey between Al-Qulzum and Al-Farama. They do not come close in any country as they do in this place; between them elsewhere is a journey of months. There is no country in the world where its people eat fresh seafood other than the people of Egypt. In it are embroidery (Tiraz), Tinnisi brocade, and Dabiqi (3) cloth which exist nowhere else. There is no embroidery in the world where a plain garment of it - without gold - reaches one hundred Dinars except the garment of Tinnis and Damietta. It is said there is no house in the world except that it contains a garment from Tinnis, even if a rag. In it are wool garments and Mar'az (goat hair) clothes (4), which exist nowhere in the world but in Egypt.",
    "foot_note": "1. Strong proof book belongs to Umar... \n2. Text corrupted... Supplement from Al-Khitat. \n3. Dabiq: Village... \n4. Mar'az: Like wool...",
    "book_id": "405",
    "new_page_number": 69
  },
  {
    "serial_number": "6303918",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 49,
    "volume_number": 1,
    "text": "Some people of Egypt (1) mentioned that Muawiyah, when he grew old, could not keep warm. They agreed that nothing would warm him except garments made in Egypt from its honey-colored Mar'az wool, undyed. A number were made for him, but he only needed one. They have the embroidery of (Al-Bahnasa (2)) of curtains and tents by which they distinguish the embroidery of the people of the world (3). They have wondrous animal production of horses, mules, and donkeys that surpasses the production of the people of the world. There is no horse in the world with the ultimate form (4) in the neck except the Egyptian horse. There is (5) no horse in the world that accepts a pillion rider better than the Egyptian, due to the shortness of its shanks, the capacity of its chest, and the shortness of its back. It is mentioned that Al-Walid decided to race horses and test the horses of different lands. He wrote to all cities to select the horses of every land for him and send them to him. When they gathered and were presented to him, the Egyptian ones passed by. When he saw them with fine nerves and flexible joints and sides, he said: These are horses that have no benefit (6). Umar bin Abd al-Aziz, who was sitting with him, said to him: And where is all the good except in these and with these! He said to him: You never leave your bias for Egypt, O Abu Hafs, in any case. When the horses were raced, the Egyptian ones all came first; no others mixed with them. They have the gold mine; (their mine (7)) surpasses every mine. They have the emerald mine; there is no emerald in the world except a mine in Egypt, and from it, it is carried to the rest of the world. They have papyrus (Qaratis); it exists nowhere in the world but in Egypt (and they have Yusufi wheat, which exists nowhere in the world but in Egypt (8)). They have radish oil, balsam oil...",
    "foot_note": "1. A: \"Science\"... \n2. Missing from B... \n3. Compare Maqrizi... \n4. B: \"form of the noble horse\"... \n5. Texts cited by Suyuti... \n6. Ta'il: Benefit/Power. \n7. Missing from B... \n8. Missing from B...",
    "book_id": "405",
    "new_page_number": 70
  },
  {
    "serial_number": "6303919",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 50,
    "volume_number": 1,
    "text": "...opium, Ibramis (1) (fish), honey syrup, red Barni dates (2), Persea fruit (Labakh), lettuce, sulfur, feathers, wax, honey, wine vinegar, lupine, vetch (Julban) (3), corn (Dhurra), Nida (4) (pastry), pied citron (Utrujj) (5), and Sarmaki (6) chickens. It is mentioned that Mary, peace be upon him, complained to her Lord about the lack of her milk, so He inspired her to make Nida, so she fed it to Jesus, peace be upon him. People of knowledge mentioned that the monks of the Levant are hardly seen except bleary-eyed from eating lentils, while the monks of Egypt are safe from that because they eat vetch (Julban). They have the Khaysi (7) cows, perpetuated for milking only; they are the most beautiful cows in form. As for Egypt's oxen, there are no oxen in the world greater than them, such that a young calf (8) of them is worth more than a young calf of an ox from elsewhere. They have Sunt (Acacia) firewood, ebony, and Qurt (clover) which beasts feed on. Some people of knowledge mentioned that one can burn Sunt (9) firewood for twenty years in a stove or oven and find no ash for it throughout this period. Some people of knowledge said: There is no tree in the world except that it is in Egypt; he who knows it knows it, and he who is ignorant of it is ignorant of it.",
    "foot_note": "1. Type of fish... \n2. Yellow round dates... \n3. Julban: Legume... \n4. Nida: Pastry... \n5. Utrujj: Citron... \n6. Suyuti: \"Zibliyya\"... \n7. Copy B ends here. Khaysi: from Khays... \n8. Afw: young of donkey/cow. \n9. Sunt: Acacia nilotica...",
    "book_id": "405",
    "new_page_number": 71
  },
  {
    "serial_number": "6303920",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 51,
    "volume_number": 1,
    "text": "There exists in Egypt at every time of the year foods, condiments, drinks, scents, and all legumes and vegetables. All of that is available in summer and winter; nothing of it ceases due to cold or heat. It is all found in the summer and the exact same is found in the winter, with not a single thing missing. It is mentioned that Bukhtanasar said to his son Balastan: I did not desire to inhabit Egypt except for these characteristics. Balastan is the one who built the Palace of Wax (Qasr al-Sham') (1). Some who lived in Egypt said: Were it not for the water of (the Coptic month) Tubah, the lamb of Amshir, the milk of Baramhat, the roses of Barmudah, the lote-fruit (Nabq) of Bashans, the figs of Ba'unah, the honey of Abib, the grapes of Misra, the fresh dates of Tut, and the fish of Kiyahk, I would not have lived in Egypt. Furthermore, Egypt is the port (2) of Mecca and Medina and their coast. It is the port of Sana'a, Aden, Oman (3), Al-Shihr (4), Sindh, India, China, the islands of China, Serendib (Sri Lanka) (5), and others. Perfume, jewels, novelties, and tools are brought in the sea until the ships arrive at Al-Qulzum. It is the port of the Sea of Rome (Mediterranean) for all of the Levant, and the land of the Romans from Antioch to beyond Constantinople and Rome, the land of the Franks, Pentapolis (Antabulus) (6), Tripoli, Kairouan...",
    "foot_note": "1. Qasr al-Sham' (Babylon Fortress)... \n2. Furdah: Port/Harbor. \n3. Oman: District... \n4. Al-Shihr: Coast... \n5. Serendib: Great island... \n6. Antabulus: City between Alexandria and Barqa.",
    "book_id": "405",
    "new_page_number": 72
  },
  {
    "serial_number": "6303921",
    "category_id": "28",
    "category": "Geography and Travels",
    "book_title": "Faḍā'il Miṣr al-Maḥrūsah (The Virtues of Protected Egypt)",
    "edition": "First, 1417 AH - 1997 AD",
    "publisher": "Al-Khanji Library - Cairo",
    "page_number": 52,
    "volume_number": 1,
    "text": "...Tahert (1), Sijilmasa (2), Sus (3), Tangier (4), Andalusia, and the islands of the sea: Sicily (5), Crete (6), Cyprus, and Rhodes. To it are brought the slaves of all these lands, bondmaids and boys, brocade, silk, mastic, styrax (May'ah) (7), coral, amber, saffron, and all kinds of trade goods. Similar things are carried from Egypt to them. They do not intend any country other than it, nor head for other than it. So its people get the best choice of all that, while the rest of the people get the dregs. May Allah bless Abu al-Misk in what He entrusted to him, congratulate him on what He gave him, inspire him to give thanks for that, inspire him with His fear, and reform his soldiers and subjects for him. The book is completed with the praise of Allah, His help, and His good success. And may Allah send blessings upon our Master Muhammad, his family, and his companions all together.",
    "foot_note": "1. Tahert: Two cities... \n2. Sijilmasa: City in south Morocco... \n3. Sus: Country in Maghreb... \n4. Tangier: City on the coast... \n5. Island... \n6. Island... \n7. May'ah: Fragrant resin...",
    "book_id": "405",
    "new_page_number": 73
  }
]