[
  {
    "text": "The Ornament of Knights and the Emblem of the Brave\nAuthor: علي بن عبد الرحمن بن هذيل الفزاري الأندلسي\nYear: 763",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 1
  },
  {
    "text": "sn: 7631\nbook_title: حلية الفرسان وشعار الشجعان\nbook_link: https://shamela.ws/book/788\nbook_id: 788\nauthor_name: علي بن عبد الرحمن بن هذيل الفزاري الأندلسي\nauthor_year: 763\nnickname: Null\nauthor_link: https://shamela.ws/author/880\nauthor_ID: 880\neditor: Null\npublisher: Null\nedition: Null\npages: 54\nvolumes: Null\npagination: [الكتاب مرقم آليا غير موافق للمطبوع]\ncategory: الأدب\ncategory_id: 32",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 2
  },
  {
    "serial_number": "6786003",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Literature. Book: The Ornament of Knights and the Emblem of the Brave. Author: Ali bin Abdul Rahman bin Hudhayl al-Fazari al-Andalusi (Died after 763 AH). [The book is automatically numbered and does not match the printed version]. Number of pages: 54. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nBook: The Ornament of Knights and the Emblem of the Brave. Author: Ali bin Abdul Rahman bin Hudhayl al-Fazari al-Andalusi (Died after 763 AH). [The book is automatically numbered and does not match the printed version]. Number of pages: 54. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nAuthor: Ali bin Abdul Rahman bin Hudhayl al-Fazari al-Andalusi (Died after 763 AH). [The book is automatically numbered and does not match the printed version]. Number of pages: 54. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\n[The book is automatically numbered and does not match the printed version]. Number of pages: 54. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nNumber of pages: 54. Date of publication in Shamela: 8 Dhu al-Hijjah 1431.\nDate of publication in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 3
  },
  {
    "serial_number": "6786004",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Introduction\nIn the name of Allah, the Most Gracious, the Most Merciful. May Allah bless our Master Muhammad, his family, and his companions and grant them peace.\nThe servant in need of his Lord's mercy, Ali bin Abdul Rahman bin Hudhayl, may Allah grant him success, said:\nPraise be to Allah, who bestowed faith upon us, made livestock subservient to us as stated in the decisive Quran, and created the horse as an 'Arab' to combat the worship of idols. Blessings and peace be upon our Master and Lord Muhammad and his family as long as day and night alternate, and may Allah be pleased with his successors Abu Bakr, Umar, Ali, and Uthman.\nTo proceed: Allah has decreed supported victory, eternal glory, and immortal praise for the Great, High, Majestic, and Exalted Station, the station of our Master, the protection of our religion and our world, the Supporter of the Faith, the Pillar of the Believers, the Vicegerent of the Lord of the Worlds, the Imam and Caliph, the Magnanimous King, whose command is high, whose rank is elevated among the ranks of Sultans, the Generous Provider, the Virtuous, the Righteous and Pious, Possessor of Firm Religion and Sound Intellect, the Most Effective Mujahid (Striver), the Most Pleasing Leader, the Happiest and Most Manifest, the Most Noble and Pure, the one by whom this age boasts over other ages, whose rank has been raised above all ranks, whose lineage is from the Noble Masters and Righteous Ansar (Helpers), of Famous Virtues and High Ranks, the Emir of the Muslims, Al-Musta'in Billah (He who seeks help from Allah), Abu Abdullah Muhammad, son of our Master the Unique and Magnanimous, the Most Noble and Glorious, the Grave and Famous Great One, of Noble Feats and High Pride, the Emir of the Muslims, Al-Musta'in Billah, the Mujahid in the path of Allah, the Sanctified and Late Abu al-Hajjaj Yusuf, son of our Master the Imam and Greatest Caliph, the Sanctuary, the extended Shadow of Allah over His servants, His drawn sword in the path of Jihad, and Allah's curtain draped over His lands, the Guardian of the Ummah (Nation), the Rain of Mercy, Possessor of Accepted Jihad and Famous Campaigns, of Good Conduct, of Pure Inner Self, nay, of Righteous Inner Self, the Great Sultan, the Glorified, the Emir of the Muslims, the Mujahid in the path of the Lord of the Worlds, Al-Ghani Billah (He who is rich by Allah), the Victorious by the aid of Allah, the Sanctified and Late Abu Abdullah Muhammad, son of our Master the Emir of the Muslims and Vicegerent of the Lord of the Worlds, the Great Mujahid Sultan, of Noble Virtues and Praiseworthy Deeds, the Suppressor of Infidels and Conqueror of Regions, the Great and Magnificent, the Late Sanctified and Blessed Abu al-Hajjaj Yusuf, son of our Master the Emir of the Muslims, the Mujahid in the path of the Lord of the Worlds, the Pride of Kings and Sultans, the Strengthener of Islam and its people, singled out for happiness in all his affairs, the Magnanimous and Great, the Brave and Long-suffering, the Enduring and Virtuous, the Sanctified and Late Blessed Abu al-Walid Ismail bin Nasr; may Allah connect their good fortunes, guard their existence, and facilitate their goals and purposes in every endeavor.\nAnd regarding our Master—may Allah grant him victory—the King of the World upon whom consensus and agreement have settled, and harmony has been achieved, and whose beautiful conduct is spoken of by companions, such that the Levant and Iraq yearn for him; Yemen is encompassed by his authority, victory smiles from his spearhead, success ties his banner, and praise weaves his cloak. Thus, Allah—Glory be to Him—made Jihad his emblem, and following the path of guidance his nature. Through him, the island of Andalusia returned to a sanctuary safe from the incitements of sedition and protected from the hardships of grudges. By the blessing of this Magnanimous Hero, the religion of Islam became clear in this Andalusian region, its corners populated, its blessings abundant, its growth guaranteed, its joys preserved, and its harms blocked. Praise be to Allah who honored his state above all states and made the kings of the earth his followers and servants.\nIndeed, one of the greatest benefits in value, most noble meanings in mention, and most successful endeavors in command, is to raise a noble art of knowledge to the station of a majestic king; that is what obligated this servant to compile this book, summarize it, refine it, and scrutinize it. It includes combat and fighting, horses and weapons, what qualities are chosen in them, and what marks are disliked and blamed, and everything related to the condition of the mount, including instruction on riding and achieving the objective.\nI gathered this book from a collection of works and selected it from various classifications, such as the book 'Yaqzat al-Na'is li-Tadrib al-Mujahid al-Faris' (The Awakening of the Sleepy for the Training of the Knightly Mujahid), the book 'Tahdhib al-Im'an fi al-Shaja'ah wa al-Shuj'an' (Refinement of Deep Thought regarding Bravery and the Brave), the book 'Rahat al-Qulub wa al-Arwah fi al-Khayl wa al-Silah' (Comfort of Hearts and Spirits regarding Horses and Weapons), the book of 'Al-Dimyati on Horses', the book 'Risalat al-Faras' (Epistle of the Horse), and the book 'Taba'i' al-Haywan' (Natures of Animals) by Aristotle; in addition to other works which were not written down here due to the scarcity of what was quoted from them, or parts that were not attributed due to their small size.\nIt came, by the praise of Allah Almighty, sufficient in its art, and healing in its style and meaning, a reminder for those concerned with Jihad, and an insight for the masters of jousting and combat. I named it 'Hilyat al-Fursan wa Shi'ar al-Shuj'an' (The Ornament of Knights and the Emblem of the Brave), and I divided it into twenty chapters:",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 4
  },
  {
    "serial_number": "6786005",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Chapter One: On the Creation of Horses, the First to Tame Them, and Their Spread in the Land.\nChapter Two: On the Virtues of Horses and What Has Been Said Regarding Keeping Them.\nChapter Three: On the Care and Protection of Horses, and What Has Been Said Regarding Recommendations for Them.\nChapter Four: On What the Arabs Name the Body Parts of the Horse, and the Number of Bird Names Included Therein.\nChapter Five: On the Desirable Qualities in the Body Parts of the Horse, and What Animal Attributes It Is Good for Them to Resemble.\nChapter Six: On the Colors of Horses, Mentioning Markings (Shiyat), Blazes (Ghurar), Leg White (Tahjil), and Whorls (Dawa'ir).\nChapter Seven: On What is Praised in Horses, the Description of the Excellent Ones, and the Names of the Noble and Generous Among Them.\nChapter Eight: On the Defects of Horses, Both Innate and Habitual.\nChapter Nine: On Selecting and Testing Horses, and Physiognomy (Firasa) Regarding Them.\nChapter Ten: On Teaching Horse Riding in Various Situations.\nChapter Eleven: On Horse Racing, the Racecourse, and Betting.\nChapter Twelve: On the Names of the Prophet's Horses and the Stallions and Famous Horses of the Arabs.\nChapter Thirteen: Mentioning Various Terms and Names of Things Specific to Horses.\nChapter Fourteen: Mentioning a Selection of Poetry: The Arabs' Preference for Horses Over Others, Their Honoring of Them, and Their Pride in That.\nChapter Fifteen: Mentioning Swords.\nChapter Sixteen: Mentioning Spears.\nChapter Seventeen: Mentioning Bows and Arrows.\nChapter Eightighteen: Mentioning Armor.\nChapter Nineteen: Mentioning Shields and Similar Items.\nChapter Twenty: Mentioning Weapons and Equipment in General; this is the last of the book's chapters. May Allah make this among the beneficial intentions, and record it with Him among the righteous interceding intentions, for He is the Guardian of success and the Guide to it; there is no Lord but Him.\n\nChapter One\nThe Creation of Horses, the First to Tame Them, and Their Spread in the Land\nAli bin Abi Talib, may Allah be pleased with him, said: The Messenger of Allah, may Allah bless him and grant him peace, said: 'When Allah Almighty intended to create the horse, He said to the South Wind: \"I am creating a creature from you, and I will make it a glory for My allies, a humiliation for My enemies, and a protection for the people of My obedience.\" The Wind said: \"Create.\" So He grasped a handful from it and created a horse. He said to it: \"I have named you a Horse (Faras), created you as an Arab, tied goodness to your forelock, and made spoils of war gathered upon your back. Glory is with you wherever you are. I have preferred you over other beasts, made you a master over them, inclined your owner affectionately toward you, and made you fly without wings; you are for pursuit and for escape. I will place upon your back men who glorify Me, magnify Me, and declare My Oneness; you glorify when they glorify, magnify when they magnify, and declare greatness when they declare greatness.\" He said: \"There is no glorification, magnification, or declaration of oneness that its owner utters and the horse hears, but that it responds with the like.\"\nThen he said: \"When the angels heard the description of the horse and saw its creation, they said: 'O Lord! We are Your angels; we glorify You, magnify You, and declare Your Oneness, so what is for us?' So Allah created piebald horses for the angels, having necks like the necks of Bactrian camels, with which He reinforces whomever He wills of His prophets and messengers. He sent the horse to the earth, and when its feet settled upon it, it neighed. He said: 'Blessed are you as a creature! By your neighing, I shall humiliate the polytheists, strike terror into their hearts, fill their ears, and humble their necks.' Then, when He presented to Adam all things He had created and he named them by their names, He said to him: 'Choose from My creation what you wish.' So he chose the horse. Allah said to him: 'You have chosen your glory and the glory of your children, lasting as long as they last, and remaining as long as they remain; My blessing is upon you and upon them, I have not created a creature more beloved to Me than them.' Then He marked it with a blaze (star) and white legs, and that has been so ever since.\"\nThe author of the book 'Al-Hayawan' said: \"It is in the nature of the horse to be vain in its walk; it loves its groom and admires its rider. It does not like children. It is jealous, and it recognizes calamity.\" Al-Asma'i mentioned that a demented man came to Abu Amr bin Al-Ala and said: \"O Abu Amr, why were horses (Khayl) named 'Khayl'?\" Abu Amr paused, having no answer, and said: \"I do not know!\" The man said: \"But I know!\" Abu Amr said: \"Teach us so we may know!\" He said: \"Because of their vanity (Ikhtiyal) in walking.\" Abu Amr said to his companions after the man turned away: \"Write down wisdom and narrate it even from a madman.\"\nSection",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 5
  },
  {
    "serial_number": "6786006",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "Ibn Abbas, may Allah be pleased with him, said: David, the Prophet of Allah and His vicegerent on His earth, loved horses intensely. He would not hear of a horse mentioned for its nobility, beauty, or speed but that he would send for it, until he gathered a thousand horses. At that time, there were no others on earth. When Allah took David's soul, Solomon inherited him and sat in his father's seat. He said: \"David did not leave me any wealth more beloved to me than these horses.\" So he trained and groomed them. One day he called for them and said: \"Display them to me so I may know them by their markings, names, and lineages.\" He began inspecting them until he prayed the Noon (Zuhr) prayer. The time for the Afternoon (Asr) prayer passed while he was displaying them—there was nothing among them but magnificent racers—and they distracted him from the prayer until the sun set and was hidden behind the veil. Then he realized and remembered the prayer. He sought forgiveness from Allah Almighty and said: \"There is no good in wealth that distracts from the remembrance of Allah and from prayer! Bring them back to me!\" Nine hundred had been displayed, and one hundred remained. They brought back the nine hundred, and he began striking their shanks and necks in sorrow for missing the Asr prayer time. One hundred horses remained which had not been displayed to him; he said: \"This hundred is more beloved to me than the nine hundred that tempted me away from my prayer.\" So he kept them. Allah Almighty said: {And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah]. When there were displayed before him in the afternoon the poised [standing] steeds. He said, 'Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].' 'Return them to me,' and set about stroking [their] legs and necks.} The hundred that did not distract him from the remembrance of Allah, he left them alone, and he remained admiring them until he passed away. Horses to this day are the descendants of that remaining hundred.\nIbn al-Kalbi said: It is said that Allah Almighty brought out for him one hundred horses from the sea that had wings, and those horses were called 'Al-Khayr' (The Good). Solomon, peace be upon him, used to bet on them and race them; nothing was more amazing to him than them.\nIt was narrated that Ibn Abbas, may Allah be pleased with him, said: The first of those horses to spread among the Arabs was when a group of the Azd tribe from the people of Oman came to Solomon son of David, peace be upon him, after his marriage to Bilqis, the Queen of Sheba. They asked him about what they needed regarding their religion and worldly affairs, until they accomplished what they wanted and intended to leave. They said: \"O Prophet of Allah! Our land is far, and we have run out of provisions, so order provisions for us that will reach us to our land.\" Solomon gave them a horse from David's horses and said: \"This is your provision! When you camp, mount a man on it and give him a spear, then gather firewood and kindle your fire, for you will not gather your firewood and kindle your fire before he comes to you with game.\" The group began not stopping at any campsite without mounting a man on their horse with a spear in hand, gathering firewood, and kindling their fire; they would wait only a little while until their companion came to them with game such as gazelles, wild donkeys, and wild goats, bringing them what sufficed them and more. The Azdites said: \"This horse of ours has no name but 'Zad al-Rakib' (The Rider's Provision).\" That was the first horse to spread among the Arabs from those horses. So the origin of the stallions of the Arabs is from its offspring.\nOthers claimed that when Solomon son of David, peace be upon him, wiped their necks and shanks, three horses flew away from him when he was killing their fathers. One horse landed in Rabi'ah, one horse in Khushayn, and one horse in Bahra'. They bred them with their horses, which were slower mixed-breeds (Hujun). When those horses produced offspring, they flew back to the sea, and the horses reproduced from one another.\nAl-Waqidi narrated that the first to ride horses was Ishmael son of Abraham, peace be upon them. He said: Horses were wild animals that could not be ridden until they were made subservient to Ishmael. He was the first to rope them, ride them, and breed them.\nFrom Ibn Abbas, may Allah be pleased with him, he said: Horses were wild beasts like other wild beasts. When Allah Almighty permitted Abraham and Ishmael, peace be upon them, to raise the foundations of the House (Kaaba), Allah Almighty said: \"I am giving you a treasure I have stored for you.\" Then Allah Almighty revealed to Ishmael to go out and call for that. Ishmael went out to Ajyad, which was a place near him, not knowing what the supplication or the treasure was. Allah Almighty inspired him with the supplication, and there remained no horse on the face of the earth in the land of the Arabs but that it answered him and allowed him to take it by its forelock, and Allah humbled it for him. Ibn Abbas said: \"So ride them and tie them, for they are blessed, and they are the inheritance of your father Ishmael.\"\nSection: On the Ways of Keeping Them",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 6
  },
  {
    "serial_number": "6786007",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "Abu Hurairah narrated that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Horses are of three types: for one man they are a reward, for another a covering (shelter), and for another a burden (sin). As for the one for whom they are a reward, he is a man who keeps them for the sake of Allah. If he comes across a river and waters them from it, for every drop that enters their bellies he has a reward. If he comes across a meadow and they graze in it, for everything that enters their bellies he has a reward, and for every step they take he has a reward.\" He even mentioned the reward for their dung and urine. \"As for the one for whom they are a covering, he is a man who keeps them for beauty and dignity, yet does not forget Allah's right regarding their backs or their necks. As for the one upon whom they are a burden, he is a man who keeps them out of arrogance, vanity, and showing off to people, and does not fulfill the right of their backs or bellies.\"\nKhabbab narrated that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Horses are three: a horse for the Most Merciful, a horse for Man, and a horse for Satan. As for the horse of the Most Merciful, it is what is kept for Allah in the path of Allah, and upon which the enemies of Allah are fought. As for the horse of Man, it is what is used for breeding and needs. As for the horse of Satan, it is what is wagered and gambled upon.\"\nAnas bin Malik said: \"When Al-Hajjaj bin Yusuf settled down and the war ended, we went out until we came to Wasit.\" He mentioned meeting Al-Hajjaj and Al-Hajjaj displaying his horses to him. He [Anas] said, may Allah be pleased with him: \"Horses are three steeds: A horse its owner keeps intending to strive upon it; so in his care for it, feeding it, and training it—I think he said: and sweeping its stall—there is a reward in his scale on the Day of Resurrection. And a horse whose owners benefit from its offspring, seeking the countenance of Allah; their care for it, feeding it, training it, and sweeping its dung is a reward in their scale on the Day of Resurrection, and its owners are aided regarding it. And a horse for Satan; its owners care for it—and he mentioned other things—it is a burden in their scale on the Day of Resurrection.\"\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Stick to female horses, for their backs are a fortress, and their bellies are a treasure.\"\nIt was said to a wise man: \"Which wealth is most abundant?\" He said: \"A mare, followed by a mare, with a mare in her belly.\"\nAdi bin al-Fadl said: A man asked the Prophet, may Allah bless him and grant him peace, \"Which wealth is best?\" He said: \"A pollinated row of palm trees, or a prolific filly.\" 'Sikkah Ma'burah' means a row of palm trees, and 'Mahrah Ma'murah' means one with many offspring.\nThey claimed that the house of the Commander of the Faithful Ali, which was in Kufa, belonged to Urwah bin al-Ja'd. He sold it for a female horse and gained much wealth from that horse. Mention of Urwah will come later.\nUmar bin Abi Anas said: Sa'd said: \"O Messenger of Allah! I have horses.\" The Messenger of Allah, may Allah bless him and grant him peace, said: \"Keep them, breed the stallions with them, and keep the females among them; you will attain the high degrees of Paradise.\" Sa'd used to do that.\nKhalid bin Safwan used to say regarding keeping animals: \"As for horses, they are for terror and awe; as for workhorses (Baradhin), they are for beauty and ease; as for mules, they are for distant travel; as for camels, they are for carrying loads; and as for donkeys, they are for creeping along and light provision.\"\n\nChapter Two\nVirtues of Horses and What Has Been Said Regarding Keeping Them\nAllah Almighty swore by horses in His Great Book due to their excellence in His sight. He, Glory be to Him, said: {By the racers, panting,} up to His saying {Indeed mankind, to his Lord, is ungrateful.} The commentators said: The 'racers' (Al-Aadiyat) are horses; 'panting' (Dhabha) is the sound of their breathing when they run. {Striking sparks of fire} (Al-Muriyat Qadha): meaning they strike fire with their hooves. {And scouring to the dust} (Fa-atharna bihi Naq'a): Naq' is dust, and it is said soil. {Arriving thereby in the center collectively} (Fa-wasatna bihi Jam'a): meaning they centered themselves in a gathering of people they raided. {Indeed mankind, to his Lord, is ungrateful} (La-kanud): meaning unthankful.\nHe also named them 'Good' (Khayr) in His Book through the tongue of His Prophet Solomon son of David: {Indeed, I gave preference to the love of the Good [horses] over the remembrance of my Lord.}\nThe Messenger of Allah, may Allah bless him and grant him peace, preferred them over men in the distribution of shares; he assigned two shares for the horse and one share for the man.\nMany hadiths have come from him, peace be upon him, regarding their virtue. From Abdullah bin Umar, the Messenger of Allah, may Allah bless him and grant him peace, said: \"Goodness is tied to the forelocks of horses until the Day of Resurrection.\" This hadith was narrated by Al-Bukhari, Muslim, and Al-Nasa'i.\nMuslim also narrated from Urwah that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Goodness is tied to the forelocks of horses until the Day of Resurrection.\" It was said: \"O Messenger of Allah! And what is that?\" He said: \"Reward and spoils of war.\" The mentioned Urwah is Ibn Abi al-Ja'd al-Bariqi. The Prophet, may Allah bless him and grant him peace, had given him a dinar to buy a sheep for him. He bought two sheep with it, sold one for a dinar, and came to him with a dinar and a sheep. The Prophet prayed for blessing for him, so even if he bought dust, he would make a profit from it. Shabib bin Gharqadah said: \"I saw ninety horses in the house of Urwah bin Abi al-Ja'd due to his desire for keeping horses.\"\nMuhammad bin al-Muntashir said: \"He had a horse he took for twenty thousand.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 7
  },
  {
    "serial_number": "6786008",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "From Jarir bin Abdullah, he said: I saw the Prophet, may Allah bless him and grant him peace, twisting the forelock of his horse with his two fingers and saying: \"Goodness is tied to the forelocks of horses until the Day of Resurrection.\" They said: In his twisting, peace be upon him, of his horse's forelock, there is merit in a man serving his beast prepared for Jihad, and it is evidence that Jihad remains established until the Day of Resurrection, and implied is the permanence of Islam and the Mujahideen defending it until the Day of Resurrection.\nFrom Abu Kabshah, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Horses, goodness is tied to their forelocks until the Day of Resurrection, and their owners are aided regarding them; the one who spends on them is like the one stretching out his hand with charity.\" In another wording: \"Horses, in their forelocks is goodness until the Day of Resurrection, and their owners are aided regarding them; so wipe their forelocks and pray to Allah for blessing for them.\"\nFrom Sawada bin al-Rabi' al-Jarmi, he said: I came to the Messenger of Allah, may Allah bless him and grant him peace, and he ordered a herd for me and said to me: \"Stick to horses, for indeed goodness is tied to the forelocks of horses until the Day of Resurrection.\"\nFrom Asma bint Yazid, the Messenger of Allah, may Allah bless him and grant him peace, said: \"Horses, goodness is tied to their forelocks forever until the Day of Resurrection. Whoever keeps them as preparation for the path of Allah, then their satiety and their hunger, their quenching and their thirst, and their dung and their urine are success in his scales on the Day of Resurrection. And whoever keeps them for showing off and reputation, and out of vanity and arrogance, then their satiety and hunger, their quenching and thirst, and their dung and urine are loss in his scales on the Day of Resurrection.\" The forelock is the hair flowing over the forehead, and it may be a metonym for the self (soul); it is said: So-and-so has a blessed forelock, meaning self.\nFrom Anas bin Malik, he said: There was nothing more beloved to the Messenger of Allah, may Allah bless him and grant him peace, after women, than horses.\nFrom Zaid bin Thabit, he said: I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: \"Whoever keeps a horse in the path of Allah, it will be his shield from the Fire.\"\nFrom Abu Hurairah, from the Messenger of Allah, may Allah bless him and grant him peace, he said: \"Whoever keeps a horse in the path of Allah out of faith in Allah and belief in Allah's promise, its satiety, its quenching, and its dung will be good deeds in his scale on the Day of Resurrection.\"\nIbn Sa'd narrated in 'Al-Tabaqat' saying: The Messenger of Allah, may Allah bless him and grant him peace, said: \"The one who spends on horses is like one stretching his hand with charity not withdrawing it; and their urine and dung are with Allah on the Day of Resurrection like pure musk.\"\nAbdul Rahman bin Ziyad recounted that when the Muslims settled in Egypt, they had a rolling area for horses. Hudayj bin Sawmi passed by Abu Dharr, may Allah be pleased with him, while he was letting his horse, Al-Ajdal, roll. He said: \"What is this horse, O Abu Dharr?\" He said: \"This is a horse of mine which I deem to be answered (in prayer).\" He said: \"Do horses pray and get answered?\" He said: \"Yes! There is no night but that the horse prays to its Lord in it, saying: 'O Allah, You have made me subservient to the son of Adam, and placed my provision in his hand, so make me more beloved to him than his family and his wealth. O Allah, provide for him through me and provide for me at his hands.'\"\nAbu al-Hasan al-Iskandar narrated that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Jesus, son of Mary, met Iblis (Satan), may Allah curse him, and said: 'O Iblis! I am asking you about something, will you be truthful to me regarding it?' He said: 'O Spirit of Allah! Ask me whatever appears to you.' He said: 'I ask you by the Living who does not die! What is it that wastes your body and breaks your back?' He said: 'The neighing of a horse in the path of Allah, and in a village of villages or a fortress of fortresses; and I do not enter a house in which there is a horse for the path of Allah.'\"\nFrom Ata' al-Khurasani, he said: Allah rewards the servant for his love of horses even if he does not keep them.\nThe Prophet, peace be upon him, said: \"Whoever intends to keep a horse in the path of Allah with a sincere intention is given the reward of a martyr.\"\nFrom Ubada bin al-Samit, he heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"Indeed, a horse may run in its tether while its owner is asleep in his bed, and no sin remains for him but that it falls away.\"\nFrom him, peace be upon him, that he said: \"Whoever keeps a horse in the path of Allah has the like of the reward of the fasting person who does not break fast, and the standing person (in prayer) who does not slacken; and the one stretching his hand with charity is likewise regarding what he spends on his horse.\"\nFrom him, peace be upon him, that he said: \"Whoever has many bad deeds and few good deeds, let him keep a horse in the path of Allah. Whoever keeps one in the path of Allah is like the one who aided Moses and Aaron, and fought Pharaoh and Haman.\"\nFrom Qais bin Babah, he said: I heard Salman, may Allah be pleased with him, say: I heard the Messenger of Allah, may Allah bless him and grant him peace, say: \"There is no Muslim but that it is a duty upon him to keep a horse in the path of Allah if he is able to do so.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 8
  },
  {
    "serial_number": "6786009",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "The Arabs in the Pre-Islamic period (Jahiliyyah) did not count wealth except as horses and camels, and horses had a merit over camels in their view. They did not equate anything else with them, nor did they see strength, glory, and protection in anything else, because with them they defended what else they owned, protected their sanctuaries, guarded their territory and heartland, raided their enemies, sought their revenge, and attained spoils. Thus, their love for them and their great standing among them was according to their need for them and their indispensability, and what they recognized of their blessing and good fortune; until Allah Almighty sent His Prophet Muhammad, may Allah bless him and grant him peace, and honored his nation with the religion He guided them to, and bestowed upon them through him. He chose for His Prophet, peace be upon him, the preparation and keeping of horses for striving against His enemy; so He, Glory be to Him, said: {And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy and others besides them whom you do not know [but] whom Allah knows.} regarding the Messenger of Allah, may Allah bless him and grant him peace, concerning this verse: {and others besides them whom you do not know [but] whom Allah knows}, he said: \"The Jinn; and Satan will not create illusions for a person in whose house is a noble horse.\"\nSo the Messenger of Allah, may Allah bless him and grant him peace, acquired horses, kept them, loved them, and encouraged the Muslims to keep them, informing them of the reward and recompense involved. They hastened to do so and increased their eagerness for them and in keeping them, desiring the reward and seeking blessing and goodness in this world and the Hereafter, in acquiring, breeding, and caring for them. They competed for them and paid high prices, due to the types of blessings and collections of goodness Allah placed in them.\nIt is said: Among the virtues of horses is that they are the most patient of animals and the most intense in strength, and the lightest of all beasts in provision regarding feed and drink when matters are tight in that regard, as a little suffices them in detachments, deserts, and travels. Then we compared them in strength: we found the strongest of beasts and most capable of heavy loads to be the camel. We found the strong, full-grown camel carries at most a thousand pounds (ratl); if it carries this amount, it does not rise except with effort and trickery, and we saw that it does not run with its load. Likewise, all other beasts described with strength do not run with their loads. We found that wild animals described with intense running, if they carried a heavy load, would not perform a tenth of their running. So we understood that the horse carries its rider, his gear, weapons, armor, provisions, fodder, and a flag if it is in its owner's hand on a windy day, approximately a thousand pounds, and runs with it for a whole day, hardly tiring, nor emptying due to hunger or thirst. Thus, we knew that no beast is stronger, more patient, better, more excellent, nobler, or more powerful than horses.\nAllah Almighty revealed two verses in the Great Quran regarding keeping them and spending on them: His saying Almighty: {Who is it that would loan Allah a goodly loan so He may multiply it for him many times over}, and His saying Glory be to Him: {Those who spend their wealth by night and by day, secretly and publicly - they will have their reward with their Lord. And no fear will there be concerning them, nor will they grieve.}\nAbu Umama, Abu Darda, Makhul, Al-Awza'i, and Rabah bin Yazid said: \"They are those who keep horses in the path of Allah.\" From Ibn Abbas: {Those who spend their wealth by night and by day, secretly and publicly}: he said: \"It was revealed regarding fodder for horses.\"\nIt was narrated that Abu Dharr pointed to some horses in the open ground and said: \"The owners of these are the ones who spend their wealth by night and by day, secretly and publicly.\" Abu Hurairah used to recite this verse if he passed by a fat horse, and if he passed by a lean horse, he would remain silent.\n\nChapter Three\nPreserving Horses, Protecting Them, and Recommendations Regarding Them\nKnow that past nations never ceased to increase their care for horses, honoring them, trusting in them, relying on them in their wars, and boasting of keeping them. Although the Arabs exceeded them in their merit and advantage, surpassing the nations, such that in the Pre-Islamic period nor in Islam did they protect any of their wealth like their protection of horses, nor honor it like their honoring of them, due to the boasting, pride, competition, multiplication, strength, defense, glory, and elevation they found in them.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 9
  },
  {
    "serial_number": "6786010",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Our Prophet, may Allah bless him and grant him peace, was among the most desirous of Arabs for horses and the most protective of them, and the most honoring and admiring of them, to the extent that he would find comfort in their neighing, prefer them over men in the shares he allotted to them and wagered on them, and forbade breeding their noble ones with a donkey or a mixed-breed whose origin did not resemble theirs, out of jealousy for them and fear of corrupting their lineage. The Prophet, peace be upon him, had recommended them and was admonished for being occupied at one time with inspecting them.\nIt came from Ismail bin Rafi': \"The Prophet, may Allah bless him and grant him peace, woke up one day and went to his horse, wiping its neck and face with the edge of his cloak or the sleeve of his shirt. It was said to him: 'O Messenger of Allah! We see you doing today what we have not seen you do before?' He said: 'I spent the night with Gabriel admonishing me regarding the management of horses.'\"\nFrom Aisha, may Allah be pleased with her: \"She went out one morning while the Prophet, may Allah bless him and grant him peace, was wiping his horse with his garment. She said: 'O Messenger of Allah! With your garment?' He said: 'How would you know? Perhaps Gabriel admonished me regarding it last night.' She said: 'Then assign me its fodder.' He said to her: 'You want to take all the reward! He informed me that my Lord writes a good deed for me for every grain.'\"\nIt was said: \"While the Messenger of Allah, may Allah bless him and grant him peace, was at the night of Tabuk, he stood by his horse, Al-Zarib, fed it barley, and began wiping its back with his cloak. It was said: 'O Messenger of Allah! You wipe its back with your cloak?' He said: 'Yes, and how would you know? Perhaps Gabriel ordered me to do that, especially since I spent the night with the angels admonishing me regarding grooming horses and wiping them. He said: My friend Gabriel informed me that he writes a good deed for me for every grain I give it, and that my Lord removes a bad deed from me because of it. No Muslim man keeps a horse in the path of Allah and gives it full fodder seeking strength for it, but that Allah writes a good deed for him for every grain and removes a bad deed from him because of it.'\"\nFrom Muhammad bin Uqbah from his father from his grandfather, he said: We came to Tamim al-Dari while he was handling his horse's fodder with his own hand. We said to him: \"O Abu Ruqayyah! Do you not have anyone to suffice you in this?\" He said: \"Yes, but I heard the Messenger of Allah, may Allah bless him and grant him peace, say: 'Whoever keeps a horse in the path of Allah and handles its fodder with his hand, will have a good deed for every grain.'\"\nFrom Umar bin Abdul Aziz, may Allah be pleased with him, he said: It is established from the Messenger of Allah, may Allah bless him and grant him peace, that he said: \"Whoever has an Arab horse and honors it, Allah honors him; and whoever humiliates it, Allah humiliates him.\"\nFrom Mujahid, he said: \"The Messenger of Allah, may Allah bless him and grant him peace, saw a person hit his horse and said: 'This (hand) with that (horse)? Let the Fire touch it.' He was spoken to about it, and he said: 'No, unless he is fighting in the path of Allah.' The man began to charge with it saying: 'Bear witness! Bear witness!'\"\nThe Arabs, due to the value of horses to them and their cherishing of them, would retaliate against anyone who slapped a horse and would shame them for it, seeking revenge for it as they would for themselves. They would not slap it like the slap of a camel. Hammad al-Rawiyah mentioned this from Simak bin Harb. Al-Jarrah al-Hamdani said regarding that:\n\"And a noble mare, the offender is slapped for slapping her... As if she were the shadow of a garment amidst spears.\"\nUmar bin Abdul Aziz, may Allah be pleased with him, forbade galloping horses except for a right cause.\nFrom Al-Wadin bin Ata, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Do not lead horses by their forelocks, for you will humiliate them.\" He, peace be upon him, also said: \"Keep horses, wipe their forelocks and rumps—or he said: their croups—and place garlands on them, but do not garland them with bowstrings.\"\nThey used to garland horses with bowstrings so that the evil eye would not afflict them, so he, peace be upon him, forbade them from that and informed them that strings do not avert anything of Allah's decree. It was also said he forbade them from that out of fear the horses might choke. It was also said strings refer to vengeances (Dhuhul), meaning blood: i.e., do not seek upon them the vengeances you sought in the Pre-Islamic period. The first opinion is more correct.\nFrom Anas bin Malik from the Messenger of Allah, may Allah bless him and grant him peace, he said: \"Do not cut the tails of horses, nor shear their manes and forelocks; their warmth is in their manes, and their tails are their fly-swatters.\" He, peace be upon him, said: \"Do not make the backs of your animals into pulpits, for Allah Almighty only made them subservient to you to carry you to a land you would not have reached except with great difficulty, and He made the earth for you, so fulfill your needs upon it.\"\nMakhul said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Honor horses and cover them (keep them warm).\" He, peace be upon him, forbade the castration of horses.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 10
  },
  {
    "serial_number": "6786011",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "From Thawr bin Zaid, he said: When the Prophet, may Allah bless him and grant him peace, raided Tabuk, he acquired a horse from Judham. He mounted a man from the Ansar on it and ordered him, when he dismounted, to dismount near him, out of longing for it and desire for its neighing. When the Prophet, may Allah bless him and grant him peace, arrived, he met the Ansari and said: \"What did the horse do?\" He said: \"We castrated it.\" He said: \"You have mutilated it, you have mutilated it, you have mutilated it! Their manes are their warmth, their tails are their fly-swatters; seek their offspring, and boast with their neighing against the polytheists.\"\nFrom Ali, may Allah be pleased with him: \"A mule was gifted to the Prophet, may Allah bless him and grant him peace, so he rode it. I said: 'If we were to breed donkeys with horses, we would have the likes of this!' He, peace be upon him, said: 'Only those who do not know do that.'\"\nFrom Abu Umama, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Admonish horses (train/discipline them), for they accept admonition.\" Meaning, discipline them and train them for war and riding, for they become disciplined and accept the admonition.\nIt is told of Luqman the Wise that he said to his son: \"O my son! If you travel, do not sleep on your beast, for sleeping on it hastens sores on its back. If you alight in land with vegetation, give it its share of the pasture; and begin with watering and feeding it before yourself.\"\nThus, honoring horses, protecting them, caring for them, competing for them, preserving them, inspecting their conditions, and attending to what improves their management is obligatory. It is upon the noble man to attempt the affairs of his horse with his own hand; no shame attaches to him by attending to its matter; rather, blame attaches to him for neglecting its affair, and he deserves censure for keeping away from it out of pride and relying on others for it. The knight should not neglect inspecting his horse, its place, its tether, its rolling area, and all its conditions regarding its management, feed, and water. Let his greatest care be looking at its legs in all conditions, feeling them with his hand. If he sees a spasm in a nerve, a sign of swelling or fullness, a mark of blood, or the slightest ailment, let him hasten to treat it and handle it gently at its onset. He should not tire it while it has it, nor run it that day, for ailments may appear slight and hardly visible, but if he rides it, they may become major, or a destructive cause may arise from them. Treating it at its beginning is closer (to success) and its matter is easier.\nLet him be extremely cautious of giving it water and feeding it barley immediately after exhaustion and fatigue. Let him wait until it calms down, its sweat dries, and it rests completely. Likewise, he should be cautious of feeding much barley with long rest, idleness, and lack of movement and activity. Also, he should be cautious of mixing wet grass with dry in its fodder as much as he can. Necessity has its own rules where one looks for the most suitable of what is available. Measure (analogy) and you will be correct by the power of Allah.\n\nChapter Four\nWhat the Arabs Name of the Horse's Body Parts and the Number of Bird Names Included Therein\nIts top is its *Sarat* (back/upper part). In its *Sarat* is its *Qarah* (spine/backbone), consisting of *Sanasin* (vertebral processes), singular *Sinsinah*, which is the head of the rib at the vertebrae. In its *Sarat* are its *Hajabatan* (points of the hips), which are its *Harqafatan*; the *Harqafah* is the upper head of the hip, which protrudes if the animal is emaciated. In its *Sarat* is its *Qatah* (croup/rump), and the *Qatah* is the seat of the *Ridif* (pillion rider); the *Ridif* is the rider behind the knight, also called *Radif*. In its *Sarat* are its *Mawqifan* (flanks/standings), and the *Mawqifan* are the top of its flanks between the *Hajabatan* and the rear rib. In its *Sarat* is its *Kathibah* (withers/base of neck), and the *Kathibah* is the place of the middle of the saddle at its front. In its *Sarat* is its *Mansij* (withers), and the *Mansij* is the place of the pommel (*Qarbus*), which is where the branches of the shoulders meet the front of the withers (*Kahil*), hence it is called *Mansij*. In the *Sarat* is the *Udhrah*, which is the hair of the *Kathibah*, and it is the end of the *Urf* (mane). In the *Sarat* is the *Urf* (mane), which is the hair of its neck between its *Udhrah* and its *Nasiyah* (forelock).\nFrom its *Sarat* is its *Nasiyah* (forelock) connected to the mane; the *Nasiyah* is the hair flowing over its eyes and face up to the tip of its mane from the front. The *Urf* is the name of the hair specifically; and the *Ma'rafah* is the place where the mane grows. Flanking the *Ma'rafah* are two veins called the *Ilbawan*, singular *Ilba*. In its *Sarat* is its *Ra's* (head) and *Hamah* (crown/skull). As for its *Hamah*, it is the 'Mother of the Brain' (*Umm al-Dimagh*) and what encircles its head by its ears. The *Hamah* is called Mother of the Brain because it encompasses it like a mother encompasses her child. In it is the *Qamahduwah* (occiput), which is the back of the neck, and it is the protruding bone from the back of the head. The *Qafa* (nape) of the horse is the seat of its headstall from the growth of its mane. The *Simam* of the horse are the reeds of its nose cartilage containing the cartilage (*Ghadarif* or *Gharadif* - inverted). Some Arabs say: they are its *Sumum*. It is also said they are two veins in its nose. In any case, *Simam* is a name for the honeycomb-like structures of the cartilage.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 11
  },
  {
    "serial_number": "6786012",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "As for the *Nawahiq* of the horse, they are two veins in its nose. Abu Zaid al-Ansari said: Its *Nawahiq* are the bridge of its nose. Ibn Qutaybah said: They are two protruding bones in its face lower than its eyes. Abu Ubaidah agreed with him on that, and it is the correct view. The *Lihyan* are the two jawbones under the cheeks; and their tapered end under the mouth are the *Sabiyan*. The *Madighan* (chewing muscles) are the upper parts of the jawbones where movement occurs during chewing, near the ears. The *Lahzimatan* are the gathering of flesh between the chewing muscles and the ears. The *Fakkan* (jaws) are the meeting point of the two jawbones with the temples. As for its lips, they are its *Jahfalatan*. As for its *Mankhiran*, they are the exit of breath (nostrils). As for its *Nukhirah*, it is what is above its nostril from the tapered part of its muzzle and the soft part of its nose. As for its cheeks (*Khaddah*), they are the sides of its face.\nIn its *Sarat* (back) is its *Sisa'*, and the *Sisa'* is the place of the middle of the saddle. The *Sahwah* is the middle of the back to the *Qatah* (croup). In its neck is its *Labbah* (throat/upper chest), *Salifah* (sides of the neck), and *Jiran* (throat/underside of neck). As for its *Labbah*, it is the place of the breastplate. As for its *Salifatan*, they are the sides of the neck. The hole in the skull where the neck is attached is called the *Fahqah*, which is the vertebra whose end is in the head. The *Fahqah* is the end attached to the skull, and it is somewhat round like the knob of a Kohl container. In it is a hole which is the exit of the spinal cord from the brain. The brain is called *Al-Salil*. As for its *Jiran*, it is the skin between the chin and the slaughter point (*Madhbah*). The combination of the windpipe (*Hulqum*), esophagus (*Mari'*), and jugular veins (*Awdaj*) is called the *Baldham*. The esophagus is the entrance for food and drink, and the windpipe is the exit for breath and sound. The *Urshan* are two muscles from the heads of the shoulders to the mane, and they are the pillars of the neck. In the neck is the *Dasi'*, which is where the camel regurgitates its cud; it is the insertion of the neck into the shoulders. In the neck is its *Qasarah*, which is what is close to the withers (*Kahil*). In the neck is the *Salifah*, which is the place of the necklace; the *Salifah* is one thing, encompassing the neck from every side near the slaughter point. The *Hadi* is the neck in its entirety, named so because it precedes the rest of the body. In the neck are the *Wadajan* (jugular veins), which are two veins flanking the neck right and left; the jugulars are also called *Shawarib*. The *Asalah* of the neck is the place of the necklace on it.\n\nSection\nIts *Bark* is its chest, and its *Ju'ju'* is its *Zawr*. The chest is what is wide from the meeting of the upper arms and the base of the neck. The *Zawr* is what is between the upper arms to the place of the girth. The *Jawz* of the horse is the seat of the rider on its back and what aligns with it of its body; the *Jawz* of anything is its middle. The entire seat of the rider is called the *Sahwah* (as mentioned before). The location of the saddle panels on the *Sahwah* is called the *Ma'addan*. What the girth encloses is the *Mahzim*. Below the *Mahzim* to the flanks are the *Markalan*, which are the place of the rider's heels, named *Markalan* (kicking places) for that reason. They are the *Jawanih*. The *Farisatan* are the return of the elbows from the *Daff*, and the *Daff* is the side. The return of the elbows is the contraction of the heart. Then the *Dulu'* (ribs), which are twenty-four ribs. In the ribs are the *Qusrayan*, which are the two ribs in the sides, the lowest and deepest of the ribs. One is the end of the right side, and the other is the end of the left side; they call them the ribs of the *Khalaf*. Next to them are the *Shakilatan* (flanks), which is what connects the thighs to the flanks. The *Qusrayan* are called the *Wahinat*. The two ribs next to the *Wahinat* are called the *Da'iatan*. The middle ribs, four on each side, are called the *Haraj*, which are the vaulted ones; they are the longest and most complete ribs, and towards them the cavity expands.\n\nSection\nThe areas of its belly are called *Rabad* (abdomen). In the *Rabad* of its belly are its *Manqab*, *Surrah* (navel), *Qunb* (sheath), *Rufghan*, *Shakilah*, *Taftafatan*, *Haliban*, and *Sifaq*. As for the *Rabad* of the belly, it is the soft parts of the belly. As for its *Manqab*, it is where the vet punctures near the navel. As for its *Qunb*, it is the sheath of its penis. As for its *Rufghan*, it is what is between the testicles and the thighs. As for its *Shakilah*, it is between its thighs and its belly (flank); it is the part that is judged for fatness in sheep and cows. As for its *Taftafatan*, it is what is between the side and the hip bone. As for the *Haliban*, they are two veins flanking the navel. As for the *Sifaq*, it is what is between the skin and the intestines (*A'faj*). The belly of the horse contains intestines and coils; it has no rumen (*Karish*). The *Haqwan* (loins) are what the *Qusrayan* enclose, and from which the *Hajabatan* (hip bones) recede. In the *Qunb* of the horse is a *Nadiyy*, a *Fayshalah*, and an *Ihlil*. As for the *Nadiyy*, it is the entire penis, also called *Ghurmul*. As for the *Fayshalah*, it is the glans (head) of the penis, as it is in humans.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 12
  },
  {
    "serial_number": "6786013",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "As for the *Ihlil* (urethra/canal), the horse has two: the opening between the testicles where the penis retracts is an *Ihlil*, and the opening at the head of the penis which is the exit for urine is an *Ihlil*. Every male animal shares this (second) *Ihlil*, while only four-legged males share the first one. The sound of the penis in its sheath during the horse's movement is called *Al-Khadi'ah*; it is also said *Khadi'ah* is the sound of the horse's belly. The skin of the testicle is called *Al-Safn* (scrotum). In the *Safn* are the *Baydatan* (testicles). In the body of the horse is the *Quhquh*, which is the meeting of the hips from the inside, and its interior is the *Khawran*, and its exterior is the *Dubur* (anus), which is what is between the *Quhquh* and the *Us'us*. The *Us'us* (coccyx) is the end of the spine and the root of the tail. The top of the *Us'us* is called the *Ajb*, and its bottom is the root of the tail. The thick part of the base of the tail is its *Ukwah*. Next to the *Ukwah* is the *Asib*, and they are the bone of the tail. The tapered part of the tail is called *Sha'ilah* (of the tail). The *Sabib* is the *Hulb* of the tail, which is its hair; this is what Abu Zaid al-Ansari said, but what is known among linguists is that *Sabib* is the hair of the forelock and mane, and the tail hair is *Hulb*.\n\nSection\nConnected to the front of the horse are its *Yadahu* (two hands/forelegs). In its forelegs are its *Katifahu* (shoulders). In its shoulders are their *Ayrahuma*, *Ghurdufahuma*, *Akhramahuma*, and *Sadqahuma*. As for the *Katif* (shoulder), it is known; it is the wide bone at the top of the shoulder joint (*Mankib*). As for their *Ayrahuma*, it is the ridge rising from the shoulder bone, protruding in the middle of the shoulder. As for their *Akhramahuma*, it is the end of their *Ayr* where they end at the *Sadqan*. As for the *Sadqan*, they are two depressions at the head of the shoulders. In the *Ghurdufan* of the shoulders at their tops are the *Naghdhan*, which are the *Ra'inatan*, consisting of much flesh at the bottom of the *Ghurdufan*. As for the two pieces of flesh at their tops, they are the *Farisatan*. The *Ghurduf* is what is at the edge of the shoulder connected to the shoulder but not of it; as if it is bone but not bone; it is also called *Ghudruf* (cartilage). In its forelegs are its *Mankibah* (shoulders joints), and its *Mankibah* are what joins the bottom of the withers (*Kahil*) from the front of the breastbone (*Qass*) at the top of the *Zawr*. The *Kahil* is what appears of the *Zawr*, and the *Zawr* is what is hidden of the *Kahil*. In its forelegs are its *Adudah* (upper arms). In its upper arms are the *Qabihan* and the *Wabilatan*. As for the *Qabihan*, they are the heads of the upper arms meeting the forearms. As for the *Wabilatan*, they are the heads of the upper arms near the shoulders; they are two large bones with *Mushash* (spongy bone/flesh). In its forelegs are its *Dhira'ahu* (forearms). In the forearms are the *Mirfaqan* (elbows), which are the *Ibratan* (needles). As for the *Radf* of its knees, it is what is between the cannon bone (*Kura'*) and the forearm, small gathered bones at the head of the forearm. The *Ibrah* (needle) of the forearm is the tapered end that rubs against the end of the *Farisah* of the shoulder and the middle of the chest bones just above the girth. The *Daghisah* (patella/knee cap) is a small bone, nearly round, above the knee; it moves (yadis) meaning it goes back and forth. Then the *Wazifan* (cannon bones). In its cannon bones are its *Qaynahu*. The *Wazif* is what is under the knees to the pasterns (*Arsagh*). As for the *Qaynan*, they are the ulna/shin of the cannon bones. In the *Wazif* is the *Ujayah*, which is a long sinew in the cannon bone ending at the *Rusgh* (pastern). As for the *Abjal*, it is a vein hidden in the forearm to the throat (*Nahr*); it is called *Nahir* in the throat and *Abjal* in the forearm. The *Rusgh* is the end of the *Ujayah*. In the foreleg are the *Raqmatan*, which are two rings in the bellies of the forearms appearing like cauterization marks. In it are the *Thunnatan*, which are the hair above the *Umm al-Qirdan*. In the foreleg is the *Ash'ar*, plural *Asha'ir*, which are the ends of the hair at the hoof. In the forelegs are the *Fusus*, which are the joints of its knees and pasterns. In them are the *Sulamiyat*, which are the bones of the pasterns. The *Shawa* refers to the limbs (legs). The top parts of the horse are called its *Sama'* (Sky), and its lower parts its *Ard* (Earth). Then the *Hafir* (hoof). In the hoof are its *Dakhis*, *Nusur*, *Hawami*, *Hawashir*, *Dawabir*, *Sunbuk*, and *Insiyyu*. As for the *Hafir*, it is a collective name, like the *Zilf* (cloven hoof) of a sheep. As for its *Dakhis*, it is a bone inside the hoof like its lining. As for its *Nusur*, they are what are in the bottom of the hoof like the lines of the palm. As for the *Dabirah* of the hoof, it is its rear, which wears down and touches the ground. As for the *Sunbuk*, it is the front of the hoof (toe). As for the *Hawami*, they are what flank the *Sunbuk* on its right and left. As for the *Hawshab*, it is the pastern bone entering the hoof like an arrowhead. As for its *Insiyyu*, it is the inner side of the hooves of its forelegs and hindlegs facing each other. As for its *Wahshi*, it is the outer side of the hooves of its forelegs and hindlegs.\n\nSection\nConnected to the rear of the horse are its legs (*Rijlahu*), and in them are its *Warikahu* (hips). In the hips are their *Harqafatahum*a, *Hariqatahuma*, *Nuqratahuma*, and *Qawwaratuhuma*.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 13
  },
  {
    "serial_number": "6786014",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "As for its hips (*Warikahu*), they are the two upper bones in the rump (*Ajuz*), and below them is the *Quhquh*, and between that is the *Khawran*, which is the *Dubur* (anus). As for their *Harqafatan*, they are the two protruding bones where the hips are suspended. The *Ja'iratan* are the ones flanking the tail on the right and left; they are the place of the *Raqmatan* in the donkey. In the thighs of the horse are the *Hamatan*, *Kadhatan*, and *Hadiban*. The *Hadiban* are below the tail, two lumps of flesh on the outside of the thighs. The *Kadhatan* align with them on the inside of the thigh next to the flank (*Shakilah*). The *Hamatan* are at the ends of the thighs next to the shanks (*Saqayn*), and above them are the *Rablatan*. The *Ghuraban* are two bones in the middle of the hips. The *Nuqratan* are two nerves at the head of the thigh. The *Nasa* (sciatic nerve) is a vein in the inside of the entire leg. The *Ra's al-Nasa* is at the top of the *Sala*, which is a depression called the *Qalt*. Then the thigh (*Fakhidh*) has *Khasa'il* (singular *Khasilah*), which is gathered flesh. For every *Khasilah* there is a *Gharr*; the *Gharr* is a groove between the two muscles as if it separates them. In the leg are the *Thafintan* (stifles), which are the joint of the thighs into the shanks; they are two nerves appearing like two bones. Then the *Saqan* (shanks). In the shanks are the *Naqwan*, which are the two bones containing the marrow; the name of the marrow is *Naqi*. In them are the *Hamatan*, which are two lumps of flesh on the outside of the shanks. In them are the *Urquban* (hocks), which are the two joints connecting to the cannon bones (*Wazifatan*). Between the shank and the cannon bone are the *Ka'ban* (ankles), which are two bones at the end of the shank and the end of the cannon bone (*Kura'*). Then the *Wazifan* (cannon bones), which are the place of the *Shikal* (hobble) on the animal's leg. In the *Wazif* is its *Ujayah*, which is a nerve supporting the entire leg, and the *Rusgh* (pastern), which is the joint between the shank and the cannon bone. There are two cannon bones, two pasterns, and two *Ujayas*.\n\nSection\nParts of the horse are named after birds: The *Hamah* (Owl/Head), *Nasr* (Vulture/Frog of hoof), *Na'amah* (Ostrich/Brain membrane), *Farkh* (Chick/Brain), *Surad* (Shrike/Vein under tongue), *Usfur* (Sparrow/Forelock base), *Dik* (Rooster/Bone behind ear), *Salsal* (Dove/White spot), *Dajajah* (Hen/Chest flesh), *Nahid* (Young Eagle/Shoulder flesh), *Ghurr* (Coot/Thigh muscle), *Sumana* (Quail), *Ghurab* (Crow/Hip bone), *Khuttaf* (Swallow), *Samamah* (Swift), *Saqr* (Falcon), *Qatah* (Sandgrouse/Rump), *Hurr* (Falcon/Ear spot), *Hida'ah* (Kite), and *Kharab* (Male Bustard).\nAl-Asma'i narrated that Harun al-Rashid had a black horse named *Al-Rabidh*, and he was delighted with it one day. He said: \"O Asma'i! Take the forelock of *Al-Rabidh* and describe it from its *Qawnas* (top of head) to its *Sunbuk* (hoof toe), for it is said it contains twenty bird names.\" I said: \"Yes, O Commander of the Faithful! And I will recite for you a poem gathering them by Abu Hazrah.\" He said: \"Recite it to us, may God bless your father!\" So I recited:\n'Lean like the wolf, perfect is he... Between his *Hamah* (head) and the *Nasr* (hoof frog)\nHis *Na'amah* (brain membrane) is wide and his *Farkh* (brain) abundant... And the two *Surads* (tongue veins) are established in the throat\nHe exceeds with the *Usfur* (forelock base) in a flowing forelock... A high *Ham* (head) with a firm root\nHis *Salsal* (white spot) is adorned by the two *Diks* (bones behind ears)... And his *Dajajah* (chest flesh) protrudes from the chest\nThe two *Nahids* (shoulder muscles) command his sturdy build... As if they were set upon a fracture\nWith sweeping sides, healed... Between his nature (*Shimah*) and the *Ghurr* (thigh muscle)\nHis *Sumana* (quail/part) and his hoof are described... And his skin and hair roots\nThe *Ghurab* (hip bone) rose to its two locations together... So I distinguished between them by measure\nAnd his *Khuttaf* (swallow) hid beneath his upper arm... And his *Samamah* (swift) distanced itself from the *Saqr* (falcon)\nAnd his *Qatah* (rump) advanced ahead... So it distanced its location from the *Hurr*\nAnd rising above its strength, below its *Hida'ah* (kite)... Are two *Kharabs* (bustards) with a span between them\nHe leaves the stony ground when he runs, split... By twins like brown branding irons\nMounted in pure limbs, lanky... Efficient in leaping, strongly bound.'",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 14
  },
  {
    "serial_number": "6786015",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "The *Hamah*: The top of the head, which is the mother of the brain; it is one of the names of birds, and has been mentioned previously. The *Nasr*: It is what rises from the bottom of the hoof and from its top, resembling date pits and pebbles; it is one of the names of birds (Vulture), and has been mentioned previously. The *Na'amah*: The skin of the horse's head that covers the brain; it is one of the names of birds (Ostrich). The *Farkh*: It is the brain; it is one of the names of birds (Chick). The *Suradan*: Two veins at the base of the tongue flanking the underside of the tongue, containing saliva and the breath of the lungs; they are one of the names of birds (Shrike). There is also a *Surad* in the back, which is whiteness in the place of the saddle resulting from a sore. The *Usfur*: The base where the forelock grows. The *Usfur* is also a protruding bone in each forehead side. The *Usfur* is also a type of blaze (*Ghurrah*), which is one that flows down and thins without crossing to the eyes and is not round like a *Qurhah* (star); it is one of the names of birds (Sparrow). The *Dik*: It is the protruding bone behind the ear, which is called the *Khushsha'*. The *Salsal*: Whiteness at the tip of the forelock, and it is said: rather it is the base of the forelock. The *Dajajah*: The flesh on its chest (*Zawr*) in front of it. The *Dik* (Rooster), *Salsal* (Dove), and *Dajajah* (Hen) are names of birds. The *Nahidan*: Singular *Nahid*, which is the flesh of the shoulders; it is said: it is the flesh next to the upper arms from their tops. The *Nahid* is the chick of the eagle; it is one of the names of birds. The *Ghurr*: In the horse, it is the muscle of the shank; and in birds, it is what is also called *Rakhama* (Vulture/Coot). It has been mentioned previously. The *Sumana* (Quail) is one of the names of birds; Ibn Abd Rabbih said: It is a place on the horse I do not recall. The *Ghurab*: The head of the hip; the *Salawan* are called the *Ghuraban*, which flank the root of the tail. It is said: They are the meeting point of the tops of the hips; it is one of the names of birds (Crow), and has been mentioned previously. The *Khuttaf*: One of the names of birds (Swallow); it is where the rider's heel reaches if he moves his legs. These two places are also called the *Markalan*. The *Samamah*: A whorl on the neck of the horse; it is one of the names of birds (Swift). The *Saqr*: I reckon it is a whorl on the head, but I am not certain of it; it is one of the names of birds (Falcon). The *Qatah*: The seat of the pillion rider; it is one of the names of birds (Sandgrouse), and has been mentioned previously. The *Hurr*: Of birds, it is said to be the male pigeon/falcon; in the horse: blackness on the outside of its ears. The *Hida'ah*: Of birds (Kite); its origin is with a Hamza, but it was lightened for necessity; it is the side of the horse's neck (*Salifah*). The *Kharab*: It is what you see like a depression in the hip of the horse; of birds, it is the male Bustard.\n\nChapter Five\nOn the Desirable Qualities in the Body Parts of the Horse and What Animal Attributes It Is Good for Them to Resemble",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 15
  },
  {
    "serial_number": "6786016",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Beauty in all parts of the horse is linked to quality and is an indication of nobility (*Itq*) and strength; the combination of these is generosity (*Karam*). Rarely do they all gather in a single horse, but its share of generosity is according to what it possesses of them.\nAmong the admired qualities of the parts is the length of the head profile (*Nasl*); its length is the distance between its forelock and its lip. Also, the width (*Harat*) of its jaw-splits (*Shidqan*); the *Shidqan* are the slit in the mouth to the ends of its jawbones, and *Harat* is the length of their slit, to enable it to expel breath. Also, the thinness of its lips (*Jahafil*) and their smoothness; the *Jahafil* are what it grasps fodder with, singular *Jahfalah*. Also, the length of its tongue for abundance of saliva; abundant saliva is desirable for comfort. Also, the thinness of its nose tip (*Arnabah*); the *Arnabah* is between its nostrils; this is for beauty and indicates nobility. Also, the width (*Ruhb*) of its nostrils, their thinness, the length of their slit, the length of their tops, and the width (*Harat*) of their bottoms; width is for quick relief (breathing), and thinness is for beauty. Also, the fineness of its muzzle (*Mustat'am*); the *Mustat'am* is between its noseband area (*Marsin*) to the tip of its lip; this is for beauty. Also, the closeness of the two jaw tips (*Sabiyyan*), which are the meeting of their ends from below; this is for beauty. Also, the fineness and delicacy of its noseband area (*Marsin*), which is the place of the halter on its nose; this is for beauty. Also, the straightness of its nose bridge, which is between its *Khulayqa* (where the forehead meets the nose bridge from the front); this is for beauty. Also, the thinness of the sides of its nose and their smoothness; the sides are what descend from the nose bridge on both sides; this is for beauty and evidence of nobility. Also, the thinness of its *Nawahiq* (veins/sides of nose) and that they do not spread across its face; their thinness means lack of flesh and adherence of skin to them; this is for beauty and indicates nobility. Also, the bareness of its *Sumum*; the *Sumum* is what is thin of hard flesh on the sides of the nose bridge from their tops to the *Nawahiq*, which are the tear ducts; this is for beauty and indicates nobility. Also, the elongation (*Isalah*) of its cheeks, their smoothness, and their width; *Isalah* means their length; this is for beauty and indicates nobility. Also, the width of its *Shajr* (space between jaws); the *Shajr* is what is between its jawbones from their bottoms; this is for the width of its airway. Also, the thinness of its eyelids, which cover the eyes from top and bottom; this is for beauty and indicates nobility. Also, the width (*Najal*) of its eyes, their clarity, and intense blackness; *Muqlatan* are the eyes, *Najal* is their width; this is for beauty. Also, the distance of its gaze and its sharpness; this is for true resolve. Also, the blackness of its eye sockets (*Waqbah*), and the distance of its eyes from its ears; the *Waqbah* are the depressions above its eyes. The thinness of its eyebrow indicates its nobility. Also, the width of its forehead, its bareness, and the adherence of its skin to it; the forehead is what is below its ears and above its eyes on its skull. Also, the length of its ears and their firmness (*Jalad*), meaning the fineness of their folding; this is for beauty. Also, the thinness of the ears, their softness, and their tapering (*Tatreeq*); *Tatreeq* is pointing, which is the thinness of their tips; this is for beauty and indicates nobility. Also, in the ears, their intensity (alertness); this is for truth and resolve. Also, the smoothness of its forelock, its length, intense blackness, and softness. Also, the softness of the *Shakir* (hair around the forelock) and its settling in its roots; *Shakir* is the short hair surrounding the forelock, which indicates nobility. Abu Ubaidah said: It is the clearest witness in the horse to its nobility; if roughness is found in it, it is not free from mixed breeding (*Hujnah*). Also, the length of its neck between its forelock and its *Udhrah* (withers hair); the *Udhrah* is the mane hair on its withers; this is for its beauty and strength, and the horse's aid by it in running. I mean the *Unuq* (neck), which is feminine (grammatically). Abu Ubaidah said: The male is more in need of neck length than the female. Abu Ubaidah only said that because the male's neck is thick, so its length completes its nobility and beauty, whereas the female's neck is thin, so its length weakens it and takes away its beauty. Ibn Qutaybah said: \"Length and softness are desirable in the neck, while shortness and stiffness are disliked.\" It is mentioned regarding the definition of desirable length that Sulayman bin Rabi'ah distinguished between thoroughbreds and mixed breeds by the necks; he called for a basin of water placed on the ground, then horses were brought to it one by one. Whichever bent its hoof (*Sunbuk*) then drank, he deemed a mixed breed, and whichever drank without bending its hoof, he deemed a thoroughbred. Also, the thinness of its throat (*Madhbah*), which is where the neck ends near the head; this is for beauty.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 16
  },
  {
    "serial_number": "6786017",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "Also, the fineness of its *Salifah* (sides of the neck); the *Salifah* is what thins from the top of its neck to its occiput (*Qadhal*) behind its *Khushashawayn*; the *Khushashawan* are the two protruding bones behind its ears; this is for beauty and indication of nobility. Also, the height of its *Ilbawan* (neck tendons) and the strength of their insertion into the withers; the *Ilbawan* are two nerves under the *Urshan* (manes base). This is stronger for connecting the neck to the withers. The elevation (*Ifra'*) of the *Ilbawan* is their height, which is more beautiful to look at in their slope. Also, the width of its neck at its base, and the loose movement of its *Jiran* (throat); this comes from the height of the *Ilbawan* and the descent of the *Jiran*; this is for the strength of the neck. The *Jiran* is what separates its esophagus and windpipe from the skin of the inside of its neck; this allows a wider exit for its breath. Also, the rising of its *Hadi* (neck/chest front), and its *Hadi* is its neck; this is for strength and beauty. Also, the height (*Ifra'*) of its shoulders at its withers and their concealment in it from their tops; their *Ifra'* is their elevation in its withers. Also, the bareness of its *Akhraman* (shoulder points) and their sharpness; the *Akhraman* are the heads of the shoulders from the side of the upper arms; their bareness is lack of flesh, and their sharpness is their pointedness. If they are like this, the distance between its shoulders widens, its breast becomes spacious, as well as between its ribs for the exit of breath, and the joint of the upper arms into the shoulders becomes strong. Also, the protrusion of its *Ma'addan* (flesh behind shoulders) and abundance of their flesh; the *Ma'addan* is the thick flesh gathered in its sides behind its shoulders, which is the place of the saddle panels. This is desirable for their strength and the expansion of the ribs beneath them for its breathing at the place of the *Rablatan*, because they are the limit of panting; if their place is narrow and they swell, they compress the heart and smother it, causing distress. Abu Ubaidah said all of this. Also, the shortness of its back; the limit of the back is from the end of its withers at the bottom to between the *Qusrayan* of its spine. Also, the straightness of its spine (*Sulb*); its straightness is its evenness and the width of its vertebrae (*Fiqar*); *Fiqar* is plural of *Faqrah*, which are the beads of the back, also called *Mahal*; this is desired for strength and beauty. Also, the smoothness (*Lahb*) of its back muscles (*Matnayn*); *Lahb* is the leanness of flesh; a horse is *Malhub*. Abu Ubaidah said: It may be *Akhta* (muscular), which is strong; *Khaza* is the elevation of the flesh of the back muscles over the spine and its firmness. Others said: The *Malhub* tolerates panting better than the *Akhta*. Also, that it be wide-bellied (*Rahib al-Jawf*). Also, the vaulting (*Ijfar*) of its sides; *Ijfar* is the curvature of their ribs from the top, their width and length; width and length (*Subugh*) of ribs are desirable. Also, the spaciousness of its hide (*Ihab*), meaning its skin. Also, the indentation of its *Mawqifan* (flanks); the *Mawqifan* are what enter from the middle of the flank to the end of the *Atrah* (hip edge); this is for strength. Also, the strength of its *Haqw* (loin); the *Haqw* is the joint of its spine into its rump, encompassing what appears and what is hidden. Its width, abundance of flesh, levelness of flesh with the back, and closeness to its *Atrah* are also desirable. Also, the elevation of its *Qatah* (croup) and abundance of its flesh; the *Qatah* is the seat of the pillion rider behind the horseman; this is for the strength of the connection of its rump to its spine. Also, the elevation of its *Hajabatan* (hip bones), their sharpness, and the distance between them; the *Hajabatan* are its *Harqafatan*. Also, the width of its hips (*Warikan*), abundance of their flesh, their length, and the adherence of skin to them. Abu Ubaidah said: Having a slight slope (*Safh*) in them is truer for running; *Safh* implies width in a slope, taken from the slope of a mountain. He said: Squaring is better for them in appearance. The width of the hips is better for them than length. Also, the strength of its *Ajuz* (rump) and its thickness without excessive height or depression; this is for strength. Abu Ubaidah said: Its best state is the medium between depression and protrusion. Also, the fullness (*Istifar*) of its *Barkah* (chest) in its throat area. The *Barkah* is from where the *Fahdatan* (breast muscles) join at their tops to what is below the upper arms, to the folds of the forearms on their inside. Also, the protrusion of its *Ju'ju'* (breastbone); the *Ju'ju'* is the meeting of its *Fahdatan* at their bottoms; the *Fahdatan* are the two protruding muscles in its chest. Also, the width of its *Baldah*; the *Baldah* is the end of the *Fahdatan* from their bottoms to its upper arms. Also, the flabbiness (*Rahal*) of its chest, *Barkah*, *Ju'ju'*, *Fahdatan*, and *Baldah* (meaning loose skin/capacity); this makes the chest stronger and shoulders more open. Also, the shortness of its upper arms (*Adudan*), so that its shoulders protrude and its elbows tuck in; for if they are short, they push the shoulder joint into them followed by the forearm, so they tuck in; if they are long, they raise the head of the forearm so its elbows stick out, which causes its forelegs to separate more. The upper arms are the two bones between its shoulder and forearms.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 17
  },
  {
    "serial_number": "6786018",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Also, the descent of its *Qass* (sternum); the *Qass* is what is between the *Ruhabah* (xiphoid cartilage) to the end of the bottom of the *Fahdatan* and the end of the *Falak* (curve) of the chest (*Zawr*), where the *Jawanih* end and the ribs separate; this provides longer ribs and more complete capacity. Also, the length of its forearms (*Dhira'an*) and their thickness (*Abalah*); the forearms are between the upper arms and knees. Also, the looseness of its *Mardaghah* and the greatness of its *Nahid*; the *Mardaghah* is the flesh at the base of the upper arms from behind, next to the *Farisah*; the *Nahid* is the muscle of the upper arm bulging above it; the larger, stronger, and thicker it is, the better. Also, the abundance of folds between the upper arms and *Fahdatan*, and the inside of the forearm and armpits from the skin; this allows more extension for its forelegs when running. Also, the fineness of its *Zawr* (chest) from the place of the elbows and its bareness (leanness). Also, the greatness of the bone of the forearms, the thickness of their cords (*Hibal*), and the visibility of their grooves (*Ghurur*); the cords are the visible nerves on them, and the grooves are between the cords, which are the paths separating the muscle bundles. Also, the fineness of its knees, the intensity of their *Sumum* (pores/hardness), the tightness (*Ikrab*) of their bind (*Asr*), and the closeness between them; this is for strength and less fatigue, because they are the joint between the forearm and cannon bone; if they are (tight), their fatigue is slower. Also, the shortness of the cannon bones (*Wazif*) of its forelegs, their width, the curvature of their *Qaynan* (shin bones), the adherence of their skin to them, lack of filling (edema/fat), and the spread of their nerves, their width and thickness. Also, the fineness of its *Jubbah* (fetlock joint) and its leanness (*Tamahhus*); the *Jubbah* is the meeting of the cannon bones and the top of the pastern bone (*Hawshab*). Also, the smallness of the *Ujayah* (ergot/ligament), lack of flesh, concealment of nerve in it, and smallness of its *Qama'ah*; the *Ujayah* is the rear of the fetlock where the nerves of the forelegs separate; in it is the growth of the *Thunnah* (fetlock hair), and the *Qama'ah* is the tip of the *Ujayah* inside the *Thunnah* which does not grow hair. Also, the tightness (*Ikrab*) of its pasterns (*Rusgh*), their thickness (*Abalah*), and having some thickness/curvature (*Ghalab*); the pastern is between the fetlock and the coronet (*Ash'ar*); its *Ikrab* is the strength of its bind; *Abalah* is thickness; *Ghalab* is convexity with thickness. Also, the width of the bottom of the *Hawshab* (pastern bone) from the place of *Umm al-Qirdan*; the *Hawshab* is the bone of the pastern, and *Umm al-Qirdan* is the depression inside it; this is for strength. Also, the largeness of its hoof, the wideness of its *Hawami* (walls), and sharpness of its toe (*Sunbuk*). Also, the distance of the heel (*Alyah*) of its hoof from the ground; the *Alyah* is the flesh at the top of the walls from the rear of the coronet; this is desirable for endurance against striking the ground and carrying the weight above, combining strength with beauty. Also, abundance of flesh on their *Kadhata* (thigh insides) and width of their *Fa'il* (femoral groove); the *Fa'ilan* are the whorls of the thighs below the *Kadhatan*. Also, the greatness of the *Rablatan* (thigh muscles); the *Rablatan* are the meeting of the inside of the thighs at the top consisting of flesh; this is desirable for the complete strength of the thighs, upon which it relies in running. Also, the insertion (*Tawlij*) of its stifles (*Thafinatan*), which is the joining of one to another and adherence of skin on their heads; the *Thafinatan* are the insertion of the thighs into the top of the shanks. Abu Ubaidah said: This is desirable because if they are inserted, it gathers its legs better in movement, strengthens them for the weight above, and makes it more enduring for long galloping; this is due to their gathering and entering under the weight of its body. Their inversion and protrusion are disliked due to weakness, for if the legs' stifles are inverted, their lifting widens and the area under the body becomes empty due to their opening, causing faster fatigue and weaker legs. Also, the shortness of its shanks (*Saqayn*) and their width; curvature (*Tahnib*) in them is desirable, as is the greatness of their *Hamatan* (muscle lumps) and their protrusion; the *Hamah* is the gathered flesh protruding in the middle of the outside of the shanks; and the bareness of their insides from flesh, which is the visibility of their *Nasa* (sciatic nerve); the *Nasa* is a vein inside the shank between the *Hamatan* and ankles. All of this is desirable for the intense contraction of the legs in running, strong kicking (*Dharh*) with them, and speed of leaping (*Dabr*). Also, the smallness of its ankles (*Ka'ban*), their firmness (*Sama'*), adherence of skin to them, and bareness of their *Manjiman*; the ankles are between the cannon bones and shanks; *Sama'* is their hardness and compactness; the *Manjiman* are two protruding bones inside the ankles. This is because the ankle is a joint needing strength due to the prolonged striking of the ground with the leg and intense gripping; if not so, it will not leap well. Also, the sharpness of its hocks (*Urquban*), their alignment with the nerve of the rear of its legs, and strong adherence of skin to them; this is desirable for strength and leg contraction.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 18
  },
  {
    "serial_number": "6786019",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Also, the length of its cannon bones (*Wazifayn*) and their width when viewed from the side, their sharpness and thinness when viewed from the front, and their straightness when viewed from behind. All of this is desirable for strength and endurance in running, allowing the hind legs to catch up with the forelegs. What is desirable in the forelegs regarding the description of pasterns and hooves is also desirable in the hind legs, except that the uprightness of the pasterns in the hind legs is forgivable, whereas it is not so in the forelegs.\n\nSection\nIt is desirable for the horse to resemble certain animals in some of its anatomy. These include the gazelle, the dog, the wild donkey, the bull, the ostrich, the camel, the hare, the wolf, and the fox. From the gazelle, it is desirable for the horse to have: length of the rear cannon bones, sharpness of the hocks, greatness of the thighs and abundance of their flesh, greatness of the hips, strength of the back muscles and spine, vaulted sides, shortness of upper arms, width of eyes, and tucked-up flanks. From the dog, it is desirable to have: wide jaw-split, long tongue, abundant saliva, descending sternum, long ribs, long forearms, and tucked-up belly. It is recounted that Muslim bin Amr sent a cousin of his to Syria and Egypt to buy horses for him. He said: \"I have no knowledge of horses,\" but he was a hunter. Muslim asked: \"Are you not an owner of dogs?\" He said: \"Yes!\" Muslim said: \"Then observe everything you admire in a patient dog and seek it in the horse.\" He said: So he returned with horses the likes of which were not found among the Arabs. From the wild donkey, it is desirable to have: thick flesh, dry joints, lean nerves, firm pasterns and their leanness, and wide back (*Sahwah*). From the bull, it is desirable to have: wide forehead with little flesh, loose throat skin, long forearms, and wide shoulders. From the ostrich, it is desirable to have: long cannon bones, short shanks, and bare *Aybas* (parts of legs). From the camel: long forearms and thick cannon bones. From the hare: small ankles. From the wolf: long/curved *Nasa* (sciatic nerve). From the fox: its *Taqrib* (a type of gait/canter). The first to compare horses to the gazelle, wolf, and ostrich was Imru' al-Qais bin Hujr, who said describing his horse:\n\"And I set out early while the birds are in their nests... On a short-haired steed, a shackle for wild beasts, huge.\nA charger, a fleer, an advancer, a retreater, all at once... Like a boulder of rock brought down by the torrent from on high.\nA dark bay, the saddle pad slips from the middle of his back... Just as the smooth stone lets the rain slide off.\nPouring (sweat/speed) when the swimming horses in fatigue... Stir up dust in the hard, kicked-up ground.\nBoiling on the heels, as if his murmuring... When his heat boils up, is the boiling of a cauldron.\nThe light boy flies from his back... And he throws off the clothes of the heavy, rough rider.\nSwift like the child's spinning top, spun... By the palms of his hands with a connected string.\nHe has the flanks of a gazelle, the legs of an ostrich... The gallop of a wolf, and the canter of a fox kit.\"\nHe repeated this comparison in another poem ending in 'Ba', saying:\n\"And I set out early while the birds are in their nests... And the dew water flows in every channel.\nOn a short-haired steed, a shackle for wild beasts, trimmed (lean)... By the chase of the valley, every distant limit.\nBoiling despite fatigue, as if his back... With leanness and galloping is a high observation post.\nCompeting with the *Khanuf* (hyena/wolf) whose resolve is independent... You see his figure as if it were a wooden rack.\nHe has the flanks of a gazelle and the legs of an ostrich... And the back of a wild donkey standing on a lookout.\"\nThe poets adopted this comparison from Imru' al-Qais and followed it.\n\nChapter Six\nColors of Horses and Mention of Markings (Shiyat), Blazes (Ghurar), Leg White (Tahjil), and Whorls (Dawa'ir)\nThe root colors are four: White, Black, Red, and Yellow. In reality, the roots are White and Black, because Redness and Yellowness return to them and originate from them.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 19
  },
  {
    "serial_number": "6786020",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Mention of White: Pure white is *Ashhab Qirtasi* (Paper White). If mixed with yellowness, it is *Ashhab Sawsani* (Lily White). If mixed with redness, it is *Sinabi*. If mixed with blackness, it is *Hadidi* (Iron Grey). If whiteness dominates, it is *Kafuri* (Camphor White), also called *Ashhab Wadih* (Clear Grey/White). If it is white with spots of a different color, it is *Muwall'a*. If the spots are small, it is *Abqa'*. If the speckles are more numerous, it is *Mufallas* (Scale-like). If they increase further, it is *Mudannar* (Coin-like). If the spots are scattered on it, it is *Sham*, and the horse is *Ashyam*. If the dots are small and numerous, it is *Arqat*. If they are even smaller and more numerous, it is *Anmar* (Leopard-like). If they are extremely small, it is *Anmash* and *Abrash* (Flea-bitten). If they resemble stripes, it is *Mujazza'*. If the stripes are small, it is *Mughrab*.\nBlack: Pure black is *Adham*. If it is pitch black, it is *Ghayhabi*. If its blackness is intense to the point of striking green, it is *Akhdar* (Green/Black); this is *Dayzaj* in Persian speech. If it is between black and green, it is *Ahwa*. If redness mixes with its blackness, it is *Adbas*. If slight redness or yellowness mixes with it, it is *Ahamm*. If its blackness strikes towards whiteness approaching the color of ash, it is *Awraq*, similar to *Akhab*. Less than that in blackness is *Arbad*.\nRedness: Pure red, if its mane and tail are black, is *Ward* (Bay), the female is *Wardah*, plural *Wirad*. If its redness is within blackness, it is *Kumait* (Dark Bay/Chestnut); the female uses the male form, and it is a diminutive form; one does not say *Kamt* or *Kumtah*. If its redness intensifies within blackness, it is *Kumait Mudamma* (Bloody Kumait). If the redness of the *Ward* yellows slightly without blackness, and its mane and tail are towards white, it is *Ashqar* (Chestnut/Sorrel). If its Kumait color is between black and white, it is *Ward Aghbas*, which is *Samand* in Persian. If its redness is coupled with blackness, it is *Asda'* (Rusty), taken from iron rust. If the blackness exceeds the redness slightly, it is *Ju'wah*, and the horse is *Aj'a*.\nYellowness: Pure yellow, if it is the color of gold, is *Asfar Faqi'* (Bright Yellow/Palomino/Dun). If its mane and tail are towards white, it is *Asfar Fadih*, which is mostly described as weak. If its mane and tail are black, it is *Asfar Mutarraf*. *Tatrif* (tipping) is blackness of the ears excluding the rest of the body of any color. If the yellow horse has black legs, it is *Armad* (Ashy). If it has a black stripe on its back, it is *Sahabi*, and that stripe is the *Sahabah* (cloud). If the legs of the yellow horse have black lines, it is *Muwasha*. If it has no marking or white (*Wadah*) of any color, it is *Musmat* (Solid) and *Bahim*. *Balaq* (Piebald/Skewbald) in horses is a weakness and a reduction in strength. Muhammad bin Salam said: No piebald male (*Ablaq*) or female (*Balqa'*) horse has ever won a race.\n\nSection: On Markings (Shiyat)\nThe root of *Shiyah* is a sign/mark, derived from *Washy* (embroidery/coloring). Then every color differing from the main color of the animal became a *Shiyah*. From this is the Almighty's saying: {La shiyata fiha} (No blemish/marking in it), meaning no color differing from the rest of it. Horse markings are from this. Most horse markings are white, resembling blazes (*Ghurar*). Just as a *Ghurrah* is only white, so is the *Shiyah*. If the horse's ears alone are white, or have white dots but not completely white, it is *Dhur'ah*, and the horse is *Adhra'*, provided the horse is not Grey (*Ashhab*). In a Grey horse, it does not have a specific name unless it is black, which is *Tatrif*, and the horse is *Mutarraf al-Udhunayn* (Black-tipped ears). If the horse's head is white, it is *Asqa'*. If its nape is white, it is *Aqnaf*. If white mixes with its forelock hair, it is *As'af*. If its entire forelock is white, it is *Asbagh*. If its entire head is white, it is *Aghsha* and *Arkham*. If the head and neck are white, it is *Adra'*. If the back is white by nature, it is *Arhal*. If the whiteness of its back is from scars of sores, it is *Musarrad*, and that whiteness is *Surad* (plural), singular *Suradah*. If the belly is white, it is *Anbat*. If the sides are white, it is *Akhasaf* (Right or Left). If the rump is white, it is *Azar*. If there is white in the width of its tail, it is *Ash'al* of the tail. If some of its tail hair is white and some another color, it is *Mukhassal* of the tail, and *Mukhassal* of the mane if that is in the mane.\n\nSection: On Blazes (Ghurar)",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 20
  },
  {
    "serial_number": "6786021",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "*Ghurrah* (Blaze): A general name for every whiteness on the face of a horse. Its limit in size is to be larger than a Dirham. If the whiteness on the face is the size of a Dirham or less, it is a *Qurhah* (Star), and the horse is *Aqrah*. The Arabs consider a *Qurhah* a bad omen if it is not accompanied by whiteness in another part of the limbs. If there is the slightest whiteness with the *Qurhah*, it exits the realm of dislike and becomes praiseworthy, as the poet said:\n'Smooth-cheeked, noble, with no defect... Dark bay like the color of pure wine, *Arjal* (white-footed) and *Aqrah* (star-faced).'\nHe praised him for the *Qurhah* because he was also *Arjal*. If the whiteness in the face exceeds the size of a Dirham, it is *Ghurrah*. Its name is *Najm* (Star), which is the first rank of *Ghurar*. If it spreads over the forehead and fills it, it is *Shadikhah*, and the horse is *Ashdakh*. If it is round in its place and has another color in the middle, it is *Halqah* (Ring), and the horse is *Muhallaq*. If the spot inside the whiteness touches one of the sides of the whiteness, it is *Hilal* (Crescent), and the horse is *Muhallal*. If the blaze flows down and thins without crossing to the eyes, it is *Usfur* (Sparrow), and the horse is *Mu'asfar*. If it descends to the nose bone but does not reach the lip (*Jahfalah*), it is *Shimrakh* (Strip), and the horse is *Agharr Shimrakhi*. If the blaze fills the forehead but does not reach the eyes, it is *Shadikhah*, as mentioned before. If it covers the entire face but looks through black (eyes), it is *Mubarqa'ah* (Veil), and the horse is *Agharr Mubarqa'*. If it reaches the eyes such that the eyelids become white, that is *Ighrab*, and the horse is *Mughrab*. If it flows into one cheek but not the other, it is *Latimah*, and the horse is *Latim* (of the Right or Left). If one eye is blue and the other black (*Kahla*), it is *Akhyaf*; this is mostly found in the *Latim* horse, which is thus *Latim Akhyaf*. If the blue eye has no whiteness around it, but the whiteness is around the black eye, that is *Khawas*, and the horse is *Latim, Akhyaf, Akhwas*. Whiteness on the upper lip is called *Ratham*, and the horse is *Artham*; if it has a blaze connected to it, it is *Agharr Artham*. Whiteness on the lower lip is called *Lamaz*, and the horse is *Almaz*. If both lips are white, they say: *Artham, Almaz*. If both lips are black with a contrasting color, that is *Dagham*, and the horse is *Adgham*.\n\nSection: On Leg Whiteness (Tahjil)",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 21
  },
  {
    "serial_number": "6786022",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "*Tahjil* is a marking (*Shiyah*) by derivation, as we mentioned previously. It was specifically given this name taken from *Hajl* (anklet), which is specific to the leg. So everything next to it or near it was named by it, by way of naming a thing by what neighbors it. If the whiteness of *Tahjil* reaches the knee of the foreleg and the hock of the hind leg, the horse is *Muhabbab*, and the name of that whiteness is *Jubbah*; the origin of *Jubbah* is the name for the joint of the cannon bone and the forearm. If the whiteness exceeds to the upper arms and thighs, it is *Ablaq Musarwal* (Piebald wearing trousers). If the whiteness is on a foreleg but not the hind legs, it is *A'sam*. If it is on one of them, it is *A'sam* of the Right or Left. If the whiteness is on the forelegs up to the elbows but not the hind legs, it is *Aqfaz*. If the whiteness is on the hind legs but not the forelegs, it is *Muhajjal*, and a horse is not called *Muhajjal* for any whiteness unless it includes the hind legs, due to the derivation mentioned. If there is whiteness on the forelegs along with that, it is called *Tahjil* due to association. If the whiteness is on the cannon bones of the forelegs excluding the limbs and pasterns, that is *Waqf*, and the horse is *Muwaqqaf*; this is specific to forelegs. If the like is on the hind legs or one hind leg, it is *Takhdim*, and the horse is *Mukhaddam*; this is also specific to the hind leg. If the whiteness is on the pasterns of the hind legs only, it is *Mukhalkhal*, also called *Mukhaddam*. If the whiteness is on the pasterns of the forelegs only, that is *Qayd* and the horse is *Muqayyad*. If the white pastern connects to the hoof, it is *Mukhaddab* (Dyed) of such-and-such foreleg or hind leg, or *Mukhaddab al-Arba'* (Dyed of the four) if on all legs. Any leg that is white is *Muhajjal*, and any leg without whiteness is *Mutlaq* (Free). One says *Muhajjal al-Ayamin* (White on right legs) and *Mutlaq al-Ayasir* (Free on left legs) or vice versa. If whiteness is on three legs and one is not white, it is *Muhajjal al-Thalath* (White of three), *Mutlaq* of such hand or leg. If whiteness is on a hand and leg of one side without the other side, it is *Mumsik al-Ayamin* (Holding the Rights) and *Mutlaq al-Ayasir*, or vice versa. The *Mumsikat* are those with white, and *Mutlaqat* are those without. If whiteness is on one hind leg, it is *Arjal*. Being *Arjal* alone is disliked by Arabs, but if accompanied by others, it is forgiven. If whiteness is on a hand and a leg diagonally, such as the right hand and left leg being white or vice versa, that is *Shikal*, and it is disliked. The horse is *Mushkal*. In the Hadith from Abu Hurairah: \"The Messenger of Allah, may Allah bless him and grant him peace, disliked *Shikal* in horses.\" Some people define *Shikal* as whiteness on one side without the other, like the right hand and right leg being white. This is what is called *Imsak*, as mentioned. Ibn Qutaybah said: \"Some define Shikal as whiteness in three legs,\" but the derivation does not support that. The best is what we presented. If the tips of the hoof alone are white, it is *Aksa'*. If that is on a hand or leg, or two hands or two legs, it is *Aksa'* of such hand, leg, two hands, or two legs. If the fetlock hairs (*Thunan*) are all white but do not connect to leg whiteness, its case is like *Kasa'* in singular, dual, and plural. If the rear of the pasterns of hind or forelegs are white, and the white connects to the heel (*Alyah*) of the hand or leg, that is *Ni'al* (Sandals), and the horse is *Mun'al*, or *Mun'al* of a hand or leg, etc. *Sha'al* in the tail is whiteness in its width; if entirely white, it is *Asbagh* of the tail. This was mentioned in Markings.\n\nSection: On Whorls (Dawa'ir)",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 22
  },
  {
    "serial_number": "6786023",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "These are the swirls of hair (*Nakhkhalah*) found on horses. Among them is the circle of *Al-Muhayya*, which is attached to the bottom of the forelock. Among them is the circle of *Al-Latah*, which is in the middle of the forehead. If there are two circles, they say *Faras Natih*. Among them is the circle of *Al-Lahiz*, which is on the jawbone (*Lahzimah*). Among them is the circle of *Al-Mu'awwidh*, which is at the beginning of the neck/necklace area. Among them is the circle of *Al-Samamah*, which is on the side of the neck (*Salifah*). Among them is the circle of *Al-Baniqayn*, which are the two circles on the horse's throat (*Nahr*). Among them is the circle of *Al-Nahir*, which is on the throat underside (*Jiran*). Among them is the circle of *Al-Qali'*, which is under the saddle pad; the name of that place is *Malbad al-Faras*. Among them is the circle of *Al-Haqa'ah*, which is on the width of its chest (*Zawr*); if the *Haqa'ah* is on both sides, it is *Al-Nafidhah* (Penetrating); the *Nafidhah* is the circle of the girth. Among them is the circle of *Al-Nakhis*, which is under the *Ja'iratan* (flanks near tail) towards the *Fa'ilan* (thigh grooves). They [Arabs] praise among the mentioned circles: *Al-Mu'awwidh* and *Al-Samamah*, and they dislike *Al-Natih*, *Al-Lahiz*, *Al-Qali'*, and *Al-Nakhis*. They used to praise the *Haqa'ah* because the most enduring horse is the *Mahqu'* (one with the Haqa'ah mark), until an Arab man wanted to buy a *Mahqu'* horse and its owner refused, but when he recited this verse, they disliked it. The verse says:\n'If the *Mahqu'* sweats with the man... His wife becomes aroused and her lust intensifies.'\n\nChapter Seven\nWhat is Praised in Horses, the Description of the Excellent Ones, and the Names of the Noble and Generous Among Them\nAbu Qatada narrated from the Prophet, may Allah bless him and grant him peace, that he said: \"The best of horses is the black (*Adham*), with a star (*Aqrah*), white on three legs (*Muhajjal Thalath*), free on the right foreleg (*Mutlaq al-Yamin*); if not black, then a dark bay (*Kumait*) with these markings.\"\nAbu Wahb al-Jushami said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Stick to every dark bay (*Kumait*) with a blaze and white legs, or black (*Adham*) with a blaze and white legs.\"\nFrom Ibn Abbas, may Allah be pleased with him, the Messenger of Allah, may Allah bless him and grant him peace, said: \"The blessing of horses is in their sorrels (*Shuqr*).\"\nFrom Nafi' bin Jubayr from the Messenger of Allah, may Allah bless him and grant him peace, he said: \"Blessing in horses is in every dark-greenish black (*Ahwa Ahamm*).\"\nFrom Amr bin al-Harith, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"If the horses of the Arabs were gathered in one plain and then released, the winner would be a chestnut/sorrel (*Ashqar*).\"\nUmar bin Al-Khattab, may Allah be pleased with him, asked the Abs tribe: \"Which horses did you find most patient (enduring) in your wars?\" They said: \"The *Kumait* (Dark Bay).\"\nSulayman bin Abdul Malik asked Musa bin Nusayr when he arrived from Andalusia: \"Which horses did you see in those lands to be most enduring?\" He said: \"The *Shuqr* (Sorrels/Chestnuts).\"\nFrom Uqbah bin Amir, he said: The Messenger of Allah, may Allah bless him and grant him peace, said: \"If you intend to raid, buy a horse with a blaze and white legs, free on the right foreleg; you will be safe and gain spoils.\"\n\nSection\nAny horse that possesses these qualities is absolutely noble. It becomes authentic in lineage if it is also productive (*Munjib*). That is, it should be: Far, Near, Wide, Long, Short, Sharp, Spacious, Bare, Huge, Thin, Thick, Delicate, Narrow, Inserted.\nFar between the lip and forelock. Far between the bases of the ears and their tips. Far between the ears and eyes. Far between the tops of the hip bones. Far between the forelock and the tail base (*Ukwah*). Far between the forelock and the withers hair (*Udhrah*). Far between the withers and the shoulder. Far between the upper arms and knees. Far between the armpits and groins. Far between the sides. Far between the hips and the flanks (*Ja'iratan*). Far between the hips and the stifles. Far between the hocks and the hips. Far between the false ribs.\nNear between the nostrils. Near between the tips of the jawbones. Near between the shoulders and the hips. Near between the fetlock joints (*Jubab*). Near between the withers and the croup. Near between the *Ma'addan* (flesh behind shoulders) and the *Qusrayan* (rear ribs). Near between the flanks (*Ja'iratan*) and the tail base. Near between the stifles and the ankles. Near between the flanks and the hock tendons (*Ma'abid*). Near between the rear ribs and the hips. Near between the shoulder cartilages.\nWide forehead. Wide cheek. Wide neck base (*Qasarah*). Wide chest (*Barkah*). Wide cannon bones (*Awzifah*). Wide back (*Sahwah*). Wide side. Wide flank skin (*Sifaq*). Wide croup (*Qatah*). Wide hips. Wide thighs. Wide femoral grooves. Wide shoulders.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 23
  },
  {
    "serial_number": "6786024",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Long head profile. Long neck. Long forearms. Long shoulders. Long belly. Long hips. Long thighs. Long cannon bones of the hind legs.\nShort upper arms. Short cannon bones of the forelegs. Short back. Short shanks. Short pasterns (all). Short flanks (*Janahayn*). Short joints (*Ma'aqim*). Short tail bone (*Asib*). Short hip edge (*Atrah*).\nSharp eyes. Sharp ears. Sharp shoulders. Sharp elbows. Sharp heart. Sharp hocks. Sharp ankle bones (*Manjiman*). Sharp withers. Sharp hip bones.\nSpacious jaws. Spacious nostrils. Spacious throat (*Shajr*). Spacious hide. Spacious cavity (belly). Spacious chest (*Labban*). Spacious groin (*Ijan*); *Ijan* is the separation between the thighs.\nBare *Nawahiq* (nose sides). Bare forehead. Bare nose bridge. Bare chest (*Zawr*) at the girth place. Bare inside of shanks. Bare *Ghurab* (hip bone). Bare heads of stifles. Bare heads of hip bones. Bare withers. Bare *Sumum* (nose sides). Bare backs of ears. Bare soles of hooves.\nHuge eyes. Huge thighs. Huge knees. Huge *Hamatan* (shank muscles). Huge hooves. Huge *Ma'addan* (sides). Huge *Nahidan* (upper arm muscles). Huge *Mardaghatan* (armpit flesh). Huge shoulders.\nThick (*Abl*) forearms. Thick cannon bones (all). Thick pasterns (all).\nThin nose tip (*Arnabah*). Thin nostril width. Thin eyelids. Thin eyebrows. Thin ears. Thin skin. Thin hair.\nThick flesh. Thick tail base (*Ukwah*). Thick milk veins (*Haliban*).\nDelicate muzzle (*Mustat'am*). Delicate chest (*Zawr*) at the elbow place. Delicate joints (*Fusus*). Delicate frogs (*Nusur*). Delicate lips.\nNarrow ear opening. Narrow between the jaw tips. Narrow armpits. Narrow heart. Narrow between the thigh muscles (*Rablatan*). Narrow groins (*Rafghayn*). Narrow frog placement.\nInserted stifles (*Muwallaj al-Thafinatan*), which are the insertion of the thighs into the top of the shanks, and the explanation of insertion has been given previously. With these qualities, generosity and nobility are found, and patience and winning usually follow.\n\nSection\nAl-Mahdi asked Matar bin Darraj: \"Which horse is best?\" He said: \"The one that if you face it you say it is fleeing (*Nafir* - due to high head), if you view it from behind you say it is swelling (*Zakhir* - wide rump), and if you view it from the side you say it is carrying a load (*Zafir* - sturdy).\" He said: \"Which of these is best?\" He said: \"The one whose gaze is ahead of it, and whose whip is its rein (responsive).\"\nSomeone asked: \"Which horse is best?\" He said: \"The one that if you face it, it sits (looks low/crouched), if you follow it, it arrives (looks wide/ready), and if you view it from the side, it is straight/level.\"\nAn Arab asked two of his sons about which horse is best. One said: \"The elegant steed, the noble stallion, the swift thoroughbred, the strong and reliable, that escapes if it flees and overtakes if it pursues.\" He said to the other: \"What do you say?\" He said: \"Excellent describes the horse, by Allah! But another is dearer to me.\" He asked: \"What is it?\" He said: \"The stallion racer, compliant to the lead, sharp-hearted, patient if restrained, a winner if it runs.\" *Hisan* is the male horse, *Kafit* is the swift.\nIbn al-Kalbi said: Five slave girls of the Arabs gathered and praised the horses of their fathers. One said: \"My father's horse is *Wardah* (Rose), and what is *Wardah*! Possessor of a smooth croup, a smooth back, a hollow (capacious) belly, spirited breath, a casting eye, a kicking leg, and a swimming hand; her surprise is speed, and her consequence is victory.\" The second said: \"My father's horse is *Al-La'ab* (The Player), and what is *Al-La'ab*! A pouring of a cloud, a burning of a forest, tightly jointed, high occiput, knit vertebrae, his rider is glorious, his game is ready; if he advances he is a swerving gazelle, if he retreats he is a waddling ostrich, and if he gallops he is a rushing wild ass.\" The third said: \"My father's horse is *Hudhamah* (Cutter/Swift), and what is *Hudhamah*! If she advances she is a straight spear, if she retreats she is a round tripod stone, if she turns she is a leaping wolf; her pasterns are firm, her joints are dry; her run is pouring, her canter is swooping.\" The fourth said: \"My father's horse is *Khayfaq* (Swift), and what is *Khayfaq*! Possessor of a lean cheekbone, a wide jaw, and smooth skin; she has a large build, a spacious neck base, and a sword-like neck; a leaping glider, a dusty shaker; her canter is rushing, her galloping is flashing.\" The fifth said: \"My father's horse is *Hudhlul* (Light/Fast), and what is *Hudhlul*! His prey is trapped, his pursuer is hobbled, thin-lipped, secure-jointed, thick-girthed, ground-cleaving stone-thrower; high-withered, high-toed, braided muscles, smooth thigh-whorls, flexible neck, ringing neigh; his skin is pure, his forelock full, and his pardon is sufficient.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 24
  },
  {
    "serial_number": "6786025",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Interpretation of that: *Muzahlaq*: Smooth. *Akhlaq*: Smooth. *Akhwaq*: Wide. *Maruh*: Very spirited. *Taruh*: Far-sighted. *Dharuh*: Kicking/Pushing. *Sabuh*: As if swimming in its run. *Budahtuha*: Its sudden start. *Ihdhab*: Speed. *Aqb*: Run after run. *Ghilab*: Source of overcoming. *Ghabya*: A downpour of rain. *Ghab*: Forest. *Mutras*: Firm/Tight. *Ashamm*: High. *Mulahak*: Knit together; *Mulahaka* is fitting things together. *Mahal*: Back vertebrae, singular *Mahalah*. *Mujid*: Owner of a noble horse. *Atid*: Present/Ready. *Ma'aj*: Active, from Arab saying *Ma'aja al-faras* when it leans on the rein sides; also *Ma'aja* and *Amajah* meaning sped up. *Haddaj*: Active in *Hadaj* (swift/short steps). *Harraj*: Runs a lot. *Ilj*: Huge donkey. *Hudhama*: From *Hadhm* (speed). *Uthfiyyah*: Tripod stone for cooking. *Mulamlama*: Rounded. *Mu'ajrama*: Leaping; *Ajrama* is leaping like gazelles. *Mumahhasa*: Little flesh and hair. *Inthirar*: Pouring out profusely. *Khayfaq*: Fast. *Nahiqan*: Protruding cheekbones. *Mu'raq*: Lean. *Ashdaq*: Wide-mouthed. *Mumallaq*: Smoothed. *Ashdaf*: Huge bodied. *Dasi'*: Neck insertion into withers. *Munafnaf*: Wide. *Talil*: Neck. *Zaluj*: Fast. *Khayfanah*: Fast. *Rahuj*: Stirring much dust (*Rahaj*). *Ihmaj*: Exaggeration in running. *Irti'aj*: Frequent lightning (flashing). *Mahbul*: In a trap. *Mashkul*: In hobbles. *Malaghim*: Area around mouth (referring to lips). *Ma'aqim*: Joints. *Abl*: Thick. *Mikhadd*: Furrows the earth. *Mirjam*: Stones the earth with hooves. *Munif*: High. *Majdul*: Twisted/Braided. *Sabib*: Forelock hair. *Dafin*: Full/Complete. *Falil*: Gathered complete hair; a piece is *Falilah*. The noun *Faras* (Horse) applies to both male and female; you say \"This is a Faras\" (masculine) for a male, and \"This is a Faras\" (feminine) for a female.\n\nSection\nThe Arabs established names for noble horses indicating their nobility and generosity in specific descriptions. Among them: *Al-Tarf* (The Noble/Rare), which is the beautiful, long horse, noble from both parents, which looks good to the eye. *Al-Lahmum*: Good, beautiful build, patient in running; nothing it chases outruns it, and nothing chasing it catches it. *Al-Unjuj*: Good build, beautiful form in length. *Al-Hudhlul*: Long, strong, large. *Al-Dhayyal*: Long-tailed. *Al-Haykal*: Huge build, beautiful appearance. *Al-Nahd*: Noble, huge, strong-limbed. *Al-Jurshu'*: Huge build, wide belly, wide ribs. *Al-Salhab*: Long body, long legs, split lower flesh. *Al-Ghawj*: Flexible sides. *Al-Khindhidh*: The large horse; it is a contranym, used for stallions and geldings. *Al-Khariji*: The noble racer from two mixed-breed parents. *Al-Muqrab*: Honored by its family, mixing with the household, kept close due to its value. *Al-Bahr* (The Sea): The one that runs a lot without tiring. The first to use this term was the Messenger of Allah, may Allah bless him and grant him peace; he rode a horse belonging to Abu Talha and said: \"We found it to be a sea.\" *Al-Musawwam*: Singled out with a mark distinguishing it from others. *Al-Ajrad*: Short-haired; female *Jarda'*, plural *Jurd*. *Al-Shatb*: Beautiful figure. *Al-Aqwd*: Long-necked. *Al-Dhabur*: The one that puts its forelegs together when running, which is one of the best horse gaits; this gait is called *Dhabr*. *Al-Darim*: The horse that does not care if it runs on rough or smooth ground, like a blazing fire.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 25
  },
  {
    "serial_number": "6786026",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "*Al-Sabih*: The one that extends its forelegs forward when running. *Al-Munaqil*: Quick in moving its legs in its run. *Al-Mutahham*: Complete, beautiful build. *Al-Tamuh*: High-looking, sharp-sighted. *Al-Shayzam*: Beautiful, long. *Al-Aqabb*: Tucked-up flanks, lean. *Al-Mujannab*: Far between legs without being bow-legged. *Al-Tamm*: Complete build, ready to run. *Al-Rajil*: The one that does not go barefoot (tough hooves). *Al-Sarhub*: The one that seems to scoop from the ground. *Al-Hidabb*: Much sweating. *Al-Qa'ud*: Compliant to its rider and groom. *Al-Aqdar*: The one whose hind hooves pass its fore hooves due to their length. *Al-Jamuh*: Energetic, fast; this is what Imru' al-Qais praised saying: \"Impulsive (*Jamuh*), spirited... its galloping is like the roaring of burning palm fronds.\" It also has another meaning opposite to the first, which is the one that rides its own head and nothing turns it, which is *Al-Sadud*. Mention of this will come later in its chapter, God willing. I think people called it *Jamuh* out of optimism, just as the bitten person is called *Salim* (Sound), and similar things.\n\nChapter Eight\nDefects of Horses: Innate and Habitual\nHorse defects are of two types: one type is innate (creation), and one type is habitual. Innate defects are all physical, and habitual defects are all behavioral. Among the defects of horses is *Al-Khadha*, which is a drooping of the ears from their base; the horse is *Akhdha*. If they incline towards its cheeks like donkey ears, that is *Al-Badad*, and the horse is *Abadd*. If the horse has little, short forelock hair, it is *Asfa*. If the top of the forelock is white, it is *As'af*. If the forelock hair is so abundant it covers its eyes, it is *Aghamm*. If it has a short neck, it is *Ahna'*. If the neck is low so that its chest almost nears the ground, it is *Adann*. If there is a gap between the shoulders, it is *Aktaf*. If the top ribs are sunken (*Hadim*), it is *Ahdam*. This is a defect that is harmful despite not being ugly to look at. Al-Asma'i said: No *Ahdam* horse ever won a race. If its spine dips and its croup rises, it is *Aq'as*. If both dip, it is *Abzakh*. If one hip is higher than the other, it is *Afraq*. If one chest muscle tucks in and the other protrudes, it is *Azwar*. If its flanks bulge out, it is *Athjal*. If its tail bone twists so the hairless underside is exposed, it is *A'sal*. If it increases, it is *Akshaf*. If it carries its tail to one side, it is *A'zal*. If the distance between its legs is excessively wide, it is *Afhaj*. If its knees and ankles knock together, it is *Asakk*. If its pastern is upright and it stands on the hoof, it is *Aqfad*. If its thighs are close and hooves far apart, it is *Asdaf*. If it has twisted pasterns, it is *Afda'*. If its legs are straight up without curve or tension, it is *Aqsat*. If its hind hooves fall short of its fore hooves (in tracking), it is *Sha'it*. If its hind hooves cover its fore hooves, it is *Ahaqq*. The poet denied this of his horse:\n\"And an *Aqdar* (over-tracker), high-backed, far-striding (*Sati*)... Dark bay, neither *Ahaqq* nor *Sha'it*.\"\n*Sati*: Far-stepping. *Ahaqq* has been explained. If it has one testicle, it is *Ashraj*, and the name is *Sharj*. *Sharj* is counted among defects although it does not impair quality or decrease speed, because it is a deficiency in creation. If its hoof peels, it is *Naqad al-Hafir*, and the name is *Naqad*. If the head of its hock is large and not sharp, it is *Aqma'*, the name is *Qama'*. If it knocks one fore-hoof against the other, it is *Murtahish*. If swelling and puffiness of the nerve occur in its hock, it is *Jaradh* (Spavin), and the horse is *Ajradh*. If a tumor occurs in the rim of its hoof, it is *Adkhas*, the name is *Dakhas*. If something protrudes in its cannon bones having volume but not the hardness of bone, that is *Mashash* (Splints), and the horse is *Amash*.\n\nSection",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 26
  },
  {
    "serial_number": "6786027",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "Among the disliked traits is *Al-Qazal*; the *Aqzal* is one whose one ear is longer than the other. Also *Al-Akhnas*, which is the recessed nose in the face; this is mostly found in Byzantine horses. Also *Al-Aftas*, which is the depressed nose bridge with a large tip. Also *Al-Muqantar*, which is the elevation of the middle of the neck excluding the rest. Also *Al-Khali*, which common people call empty-necked; Ibn Abi Hazim said: It is the worst defect. Also *Al-Tabarkun*, which is the sharp croup. Also *Al-Salud*, which is the one that does not sweat. Also *Al-Waqi'*, which is the one that goes footsore quickly. Also *Al-Arahh*, which is the flat-footed/splayed hoof, though width is okay unless it is cupped (*Muqa'ab*); if it is wide and cupped, it is praiseworthy. Also *Al-Mustarr*, which is the narrow hoof. Also *Al-Ikhtaf*, which is the tucking up of the belly behind the girth, so the girth always slides back towards the testicles. Also *Al-Ishgha'*, which is when the teeth differ and do not align, some long and some short; the name is *Shagha*. Also shortness of the tongue. Ibn Abi Hazim said: It is a defect in horses because it causes the horse's mouth to be dry and have no saliva. Also *Al-Akabb*, which is the one on which no saddle stays without sliding forward onto its shoulders and neck. Deep-set eyes are disliked in horses because they indicate cowardice/failure. Redness in eyes is disliked in black horses. Musa bin Nusayr said: If a black horse has red eyes, it is suspected of stubbornness (*Hiran*).\n\nSection\nAmong the disliked conditions of horses requiring proof to identify is *Kharas* (Muteness), which is innate. Musa bin Nusayr said: It is tested by presenting the horse to mares; if it neighs, know it is not mute. Also *Asha* (Night blindness); a horse is *A'sha*, meaning it does not see at night. Musa bin Nusayr said: It is tested by walking it over a black cloth; if it walks on it, it is *A'sha*; if it avoids it, it is sound. The *A'sha* is also called *Shabkur*. Also *Jahar* (Day blindness); a horse is *Ajhar*, meaning weak-sighted and does not see in the sun. This is indicated by seeing it walk lifting its feet and raising its knees until it almost hits its lip. Also *Samam* (Deafness). Ibn Abi Hazim said: It is *Tarash*, a horse is *Tarush*. Among the signs of deafness in a beast is grazing with ears pointed back, not pointing them to look, and not hearing if shouted at. He said: I saw it mostly in Piebalds. Also *Asar* (Left-handedness). Al-Asma'i said: If a man works with his left hand, he is *A'sar*, and likewise the horse if it leads with its left in walking. Musa bin Nusayr said: *Asar* is tested by jumping the horse over a small ditch seven times; if it lifts its right leg before the left every time, know it is not *A'sar*. They said: An *A'sar* horse hardly swims in water. Also *Balid* (Dull/Stupid), which is the opposite of the keen-hearted, proud-souled. Musa bin Nusayr said: Dullness is tested by standing ten cubits from the horse and throwing a rag at it or throwing a pebble at its rein; if it stands still, suspect it of dullness. Likewise, if you sneeze while riding it, or shake some of your clothes. Then mount it and throw a white cloth on the ground and walk over it; if it is wary of it, know it is keen-souled; otherwise, know it is dull.\n\nSection: On Habitual Defects\nIf the horse bites whoever approaches, it is *Adud*. If it does not stand for one wanting to approach, it is *Nafur*. If it drags the rope and does not obey its leader, it is *Jarur*. If the bit does not stop its running, it is *Jamuh*. If it refuses to walk and stops in one place, it is *Harun*. If it deviates from the direction its owner wants, it is *Hayus*. If it stumbles often, it is *Athur*. If it strikes with its hind legs, it is *Ramuh*. If it prevents its rider, it is *Shamus*. If it twists with its owner until he falls, it is *Qamus*. If it rears its forelegs and stands on hind legs, it is *Shabub*. If it walks a walk resembling a leap, it is *Qatuf*. Abu Mansur al-Tha'alibi put it well denying these defects in a horse gifted to him, saying:\n\"Not *Shamus*, nor *Qamus*... Nor *Qatuf*, nor *Shabub*.\"\nAn Arab asked two sons about which horse was most hateful to them. One said: \"The *Jamuh* (runaway), *Tamuh* (high-headed), *Takul* (reliant), *Anuh* (moaning); which if you race it, you beat it, and if you chase it, you catch it.\" He said to the other: \"What do you say?\" He said: \"A wretched description! But another is more hateful to me.\" He asked: \"What is it?\" He said: \"The slow, heavy, the blunt *Harun* (stubborn), which if you hit it, it bucks (*Qamas*), and if you approach it, it resists (*Shamas*); the pursuer catches it, and the fleeing outruns it.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 27
  },
  {
    "serial_number": "6786028",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "*Al-Takul*: The one that relies on its owner (rider) in running. *Al-Anuh*: The one that groans frequently, which is breathing out with a moan.\n\nSection\nAs for established *Hiran* (Stubbornness), it is when the animal stops and plants itself like a stake, not moving; if hit, it kicks with its hind legs. This is the utmost stubbornness for which there is no trick and it never improves. As for non-established stubbornness, it comes from non-knights riding it, frequent dismounting in stables and among animals, and riders at gates, and the like. As for Biting, it comes from the groom hitting it often, and playing with the animal in the rolling area; some of it is rabidity from blood and agitated bile. As for Swerving (*Rawghan*), it comes from non-knights riding and letting the animal take whatever path it wants in its run, and persisting in hitting it from one side without correcting its head with the rein. As for Refusing Saddling and Stirrups and *Shamas* (Resistance), it happens due to boils appearing on the animal's withers, or sores in the puncture site, navel, or back, where it is saddled before healing or ridden without treatment, so it refuses and resists due to pain, then it heals but becomes a habit. As for Kicking with hind legs, it is bad character in the horse and vice (*Rawshanah*), done when cornered. Likewise, Slapping with the foreleg. Perhaps flies hurt it so it slaps with its leg; from that, it guards its lip, and perhaps refuses the bit because of it. As for Refusing Shoeing, it is difficulty remaining in the horse and vice; perhaps it experienced pain, so it refused afterwards even after healing. As for *Nafar* (Shying), it is weakness of heart, panic, and remaining difficulty, and wildness from lack of passing through markets and cities and such. As for Stumbling (*Ithar*), it is from weakness of legs, slackness, and collapsed spirit. As for stumbling in a hole or on a stone or slipping, that is an error, not a defect.\n\nSection\nHannah the Indian claimed that no one should keep animals that have a whorl on the front of their forelegs. Or a whorl below the eyes, or two whorls at the base of the ears on both sides, or a whorl on the hock tendon (*Ma'bid*), or a whorl on the eye socket, or a whorl on the cheek or lower lip or the meeting of the jaws, or scattered hair on the belly, or a whorl on the navel, or teeth protruding over the lip, or two teeth growing like boar tusks, or black lines on the tongue. Or one that is *Adbas* (dark brown), white, yellow, or grey with redness, while the inside of its lips and palate and outside of jaws are black. Or one that is black (*Adham*) with white inside lips, or spots of black in its palate and inside cheeks, and the outside of its lip spotted like sesame seeds, or two whorls on its withers, or black fuzz on its testicles contrary to its color, or hairs in its forehead contrary to its color, or one whose testicles are visible when born.\nIn the narration of Abu Abdullah al-Tartushi: Among what is considered a bad omen: If a horse is born with teeth; likewise, the blue-eyed in one eye; the ash-colored; the *Aqrah* (star-faced) with no other white; this was mentioned before. The one with a white tuft in its tail; the *Arjal* which has no white except a patch on its leg not circling the coronet; the one that frequently paws with its foreleg without seeing anything at night to fear for itself or its owner. All these signs are disliked and avoided.\n\nChapter Nine\nSelecting and Testing Horses and Physiognomy (Firasa) Regarding Them\nWhoever wants to be good at selection and truthful in testing should look at the horse in all its states and conditions: in its stillness and movement, standing and lying down, walking and ambling, trotting and cantering, galloping and sprinting. If its qualities agree in beauty, and its movements and rests are proportionate in moderation, it is likely to be a noble steed. Physiognomy rarely holds true in one state without another. A non-expert might see a mixed-breed horse coming out of water, with its skin hair softened, its flanks raised, its joints enlarged, its face smoothed, its ears erect, looking beautiful in appearance but not in nature or substance, so physiognomy weakens regarding it. Likewise, the prancing horse (*Mustann*) cannot be judged accurately, as it looks around sharply, raising what was low, lifting its tail bone, exposing its groin, elevating its gaze, and pricking its ears; this is affectation. Also, a colt might look good but not run well as a *Jadha'* (young), but run well as a *Thaniy* or *Ruba'i* or *Qarih* (older ages) when its strength gathers and build solidifies, or perhaps it changed by being ridden before it could bear it due to weakness.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 28
  },
  {
    "serial_number": "6786029",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "The closest physiognomy in a colt is when it becomes sturdy (*Ja'than*) and thick, nursing flesh leaves it, and fodder flesh builds up. What is observed then is the quality of its taking to running; at that time, it takes on the characteristics it was printed upon and the nature it will revert to. If its 'taking' (start) is good then, and it does not change afterwards by being ridden by one who cannot carry it or carrying what it cannot bear, and its descriptions are good, it is mostly a noble steed. If it is weak in carrying, this is known by its twisting under the rider, its unsteadiness, sinking of its back; judgment is rarely accurate in this state, so one should not rush against it, for opinion might err. If it carries the rider well and takes to its owner's choice and straightens in its training, then one should search for its build and inspect its caliber.\n\nSection\nEvidence of a horse's quality in a state of stillness includes the descriptions mentioned in previous chapters. Some experts in horse physiognomy gathered in brief words what is admired of its qualities, saying: If the horse is compact in build, proportionate in limbs, small-headed, long-necked, thick in the upper chest (*Labbah*), thin in the throat (*Madhbah*), fine-eared, long and upright ears that are firm and finely folded like basil leaves or pen tips; long smooth thin cheeks; moderate forelock hair; narrow occiput (*Qadhal* - seat of the headstall); wide forehead; black-eyed (*Akhal*); protruding pupil; sharp-sighted; wide black nostrils; long mouth slit; round thin lips, with the upper lip slightly longer; fine aligned teeth; long tongue; red palate; wide chest; large breast; full neck base (*Qasarah*); soft long neck; high withers; short level back; large sides and cavity; tucked flank (*Kashh*); long ribs; full loins; spacious belly; vaulted belly; protruding croup (*Qatah*); round buttocks, short and level; short tail bone; full tail; black penis sheath; wide gut (*Marath*); thick round thighs; thick shank bone; level knees; fine cannon bone (*Wazif*); short, thick, dry pasterns; dry nerve; sharp hocks; black or dark green hooves; round cupped heels; toe sticking to the ground; high hard frogs; soft hair—because soft hair in all animals and beasts and birds of prey is praiseworthy and indicates strength. Additionally, soft *Shakir* (fuzz around forelock and mane) is preferred, such that you find it to the touch like carded silk; if rough, the horse is not free from mixed breeding. Along with all this, it should be high-headed, sharp-hearted, energetic when ridden and moving, coquettish when walking, looking at the ground with its eyes while its head is high. If these qualities or most of them gather in a horse, physiognomy will not fail regarding it when tested.\n\nSection\nEvidence of a horse's quality while ambling (*Mu'niq*) includes: flexibility of its sides, elevation of its neck, steadiness of its back, intensity of its propulsion, and quick contraction of its hind legs; this is due to the tension of its sciatic nerve (*Nasa*) and the strength and placement of its ankles. Flexibility of sides is known by all its joints, knuckles, and back vertebrae being flexible in its twisting, ambling, and turning, except the ankles specifically; flexibility in ankles is not good, lest they twist in walking and running. If its sides are as described, its propulsion is faster and its command firmer. Its placement is known by the parts of hooves touching the ground being the strongest in grip (fronts and backs), and the soles of its pasterns not being hard convex nor too close to the ground so they bleed in galloping. The tension of its sciatic nerve and strength of ankles are known by the intense tucking of its legs when walking, and the strong impact of its hooves on the ground and kicking off. If it stands, it stands with legs apart (*Mujannab*); it is said of it *Muwattar al-Ansa* (Tensed sciatic nerves).\n\nSection",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 29
  },
  {
    "serial_number": "6786030",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "Evidence of a horse's quality in sprinting (*Hahdr*) includes the elevation of its chest/neck (*Hadi*), steadiness of its head, not using them (head/neck) to assist in running, and the gathering of its legs so they do not scatter, as if its forelegs are in a rope and its hind legs likewise. It spreads its arms and extends its flank, such that it finds no more extension for forelegs nor contraction for hind legs. Contraction means not letting the hind legs settle on the ground but taking from them with the tips of the hooves, and due to the speed of contraction, it is as if its hooves are pushed into its groins. It pulls (*Yamlikh*) with forelegs and kicks (*Yadhrah*) with hind legs in unison, as if lifting one leg. It pants (*Yadhbah*) with its chest, and does not become disorganized or distracted from its sprinting. That is the superior steed. Jarir said about such:\n\"They were yoked when the betting became serious... With one rising to the furthest land.\nCutting the breaths of others with his run... With the bending of the rein, and he has not strived yet.\"\nYou look at the placement of its legs on the ground when it sprints; if the distance between its hoof prints is twelve feet, it is the *Dhari' Kamil* (Complete Strider). If more, it is unsurpassed. If seven feet, it is slow. Between these is proportional. Excessive movement with scattered legs, shaking head, assisting with the head, and intense passing in the viewer's eye is not considered (quality), deceiving that it is fast. A noble horse might be seen passing casually without effort, seeming slower to the viewer, but if joined (by another), it wins. This is due to the long stride of the noble horse, gathering of legs, stillness of head, elevation of neck; versus the short stride of the disorganized one with scattered legs, head assistance, and slow return of legs.\n\nSection\nHorses are: Striders (*Dhari'*) and Patient (Enduring); Patient with no Stride; Strider with no Patience; and neither Patient nor Strider.\nThe *Dhari' Sabur* (Enduring Strider) is of complete build, beautiful qualities, strong spirit, wide breath. The Patient with no stride is not long-armed or long-necked, has no weakness betraying it, thighs not huge, forearms not thick, but is gathered in legs when sprinting, tense sciatics, wide breath, not scattered legs. If its sides become flexible, legs long, neck and forearms placed and long, and thighs huge, it becomes a Strider. Whatever increases of these praised qualities increases its quality and stride proportionally. The most essential thing in horses is Patience, and the best is the Enduring Strider. It wins by stride and is not caught due to patience.\nAs for the Strider with no patience, it is one with long legs and neck, flexible sides, huge thighs, but its other build does not help, not strong-spirited, nor wide-breathed; it is likely to pant due to narrow breath when breath returns to its body, or be not tense-sciatic nor strong-ankled; if the run prolongs, its legs relax and do not contract fast or strike hard, so its legs fail it and patience betrays it.\nAs for the one with neither patience nor stride, it is the loose-built (*Munshal*), ugly-qualified, dropped-spirit, narrow-breathed, lax-sciatic. These qualities do not exist singly in a horse without betraying its stride and patience.\n\nSection\nIf the horse's breath is intense and its nostrils and cavity wide along with complete build, it is patient. If its build is strong, joints firm, and legs gathered in sprinting without scattering, this indicates strength. Amr bin Ma'd Yakrib tested his horse's strength on the day of Qadisiyah when he feared its weakness, by placing his hands on its tail base (*Ukwah*) and pressing down to the ground; it did not shake or collapse, so he knew its strength. If it is strong-bound, complete-built, wide-breathed, yet does not endure, that is due to a severance or ailment inside; known by the collapse of its breath, lethargy of movement, dullness of tooth, collapse of body, and disarray of legs in ambling and trotting. It might take to cantering (*Taqrib*) nicely, but if it sprints (*Ahdar*), it reverts to this run. If bad build dominates, it might canter nicely with gathered legs, spreading arms, high neck, and tucked hind legs, but if it wants to sprint, its bad build betrays it and hinders much speed. Sprinting (*Ihdhar*) is the testing ground for this type of horse. The Arabs say: \"Quality is in every form,\" or perhaps it takes to running well but is not well-built, except it is strong-spirited and wide-breathed.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 30
  },
  {
    "serial_number": "6786031",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "If it is loose-built (*Munshal*) and ugly, it takes badly to cantering and sprinting; if it ambles, its head extends and hind legs relax, due to the relaxation of its cords (*Hibal*) and sciatics and its bad build. A horse is only judged in Cantering (*Taqrib*) and Sprinting (*Hudr*). As for others, it confuses the observer and no quality is deduced from it.\n\nSection\nThe best horse is complete-built, strong-bound, sharp-spirited, wide-breathed, tense-sciatic (*Shanij al-Ansa*), long-necked, strongly inserted in withers, strong-loined (*Haqw*), wide-mouthed (*Harit al-Shidq*), huge-thighed, dry-jointed, firmly-hooved, hard, solid, and cupped. As for the strength of bind and sharpness of spirit, they are concomitant qualities, each aiding the other, just as a man's strength aids his courage and courage aids strength, completing him. A brave non-strong one is overpowered, and a strong non-brave one is defeated. As for the width of breath (nostrils and cavity), by their width, the return of breath is faster and relief for heart and lungs easier. If narrow, breath returns (badly), suppressing panting, distressing and stopping it. As for the width of jaw-splits, it eases breath exit and keeps the bit from the front teeth, so it finds comfort and reliance on it. Width of nostrils is likewise for quick relief and breath return. As for neck length, to elevate it, making breathing easier and relief greater. As for the strength of insertion in withers, because it leans on that in running, finding aid in its strength. As for huge thighs, to rely on them in movement, as they bear the burden of running. As for strong loins, because they suspend the hips and legs from the spine. As for tense sciatics, for faster leg contraction and stronger kicking and pushing. As for dry joints, because they are its ground that supports it and steeds that carry it. As for their hardness and solidity, because they are its hoes fixing it to the earth. As for their cupping, to protect the sole from stones and be firmer when striking hard ground (*Rahs*). These qualities cannot dispense with one another.\n\nSection\nIf it is not very long-necked without being short, it is forgiven if the neck is wide, high-tendoned, high-withered set back towards the back, wide long shoulders with concealed tops, strong chest, fine *Zawr* (brisket), strongly curved shanks, long forearms. Shortness of forearms is forgiven with strong nerves, firm pasterns, and good upper arms, shoulders, and withers. Thinness of forearms is forgiven with length and full upper arms. If not long-thighed, providing they don't reach deficiency from extreme shortness, it is forgiven for their straightness and fleshiness. Likewise, short shanks are forgiven if wide and tense-sciatic. Width of shanks is prioritized over shortness. Disconnection of the loin is not forgiven, unless the flesh is good and not excessive; then it is forgiven for a short back, wide vertebrae, close neck base, strong joints, high spine in rump, protruding croup, and strength of what is below it to the legs. Large joints are not forgiven with looseness, nor thin hooves without hardness, even if strongly built. Weak fallen spirit is not forgiven with loose cords and narrow breath. If the horse is perfect as mentioned regarding what is forgivable, with perfection of what substitutes it, it joins the excellent ones. If something forgivable is perfect, it is better accordingly.\n\nSection\nIf the horse is strongly built but not sharp-spirited (*Hadid al-Nafas*), it does not benefit. If sharp-spirited but not strongly built, it does not endure running. If build is perfect and spirit sharp, but not wide-breathed, it will not endure panting and breath will return (badly). If the cavity is wide but nostrils narrow, it suppresses panting and quiets breath. If it is wide-nostriled, good-cavity, neither wide nor extremely tucked-up (*Mahdum*), and is also *Hashsh* (sweats easily/fragile), it bears what the wide-cavity bears. For with quick sweating, breath exits to relieve it. If along with that it has wide skin (*Ihab*), it is stronger for comfort. But if with tucking-up it has tight dry skin, it is faster in exhaustion and weaker on breath.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 31
  },
  {
    "serial_number": "6786032",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "If, along with that, it has narrow nostrils and is pushed until its breath returns (reverses), it is likely to die quickly and be extinguished, unless it is *Hashsh* (quick to sweat), so it finds relief through the speed of its sweat. But if, along with strong build and complete body, it has delicate, thin, soft hooves, they will soon crack and go footsore, cutting it off from what is desired of it.\n\nSection\nKnow that everything desirable in a male for quality is desirable in a female, except long standing (*Siyam*), little lying down (*Rubud*), little flesh on the cheeks (*Lahzimatan*), and stiffness (*Jus'ah*) in the back. Closeness of ankles (*Qiran*) in movement and otherwise is desirable. In the male, boldness (*Shahamah*), sharpness, and *Shawas* (looking with one eye/boldness) are desirable. This is tolerable in the female. Horse boldness means its sharpness, high gaze, and far sight. *Ashwas* is one that seems startled due to intense looking around and sharp sight. The Arabs used to say: \"A startled sleeper male, and a fasting (standing) female.\" *Siyam* means long standing. There is no good in stiffness of legs for male or female, though the female tolerates it better in front, due to what is disliked in the front of a male horse. Neither can do without good legs, for they are their wings. Short thighs and closeness between ankles are desirable in the female. Separation between her legs is disliked, because if her groin (*Ijan*) widens and her birth canal (*Mahbil*)—which is her *Zabyah*—widens, her legs relax, wind enters her, her hips become weak, and she weakens in running; perhaps if mounted, she stumbles. *Afr* and *Nafz* (leaping/bounding) are desirable in her. That means gathering her legs and not separating them. Her sprinting should be an upward leap with elevation. Gathering of legs is evidence of strong build in male and female. It was narrated that they preferred female horses for raids and night attacks and covert war matters, and preferred male horses for ranks, fortresses, marching, camps, and overt war matters, and preferred geldings for ambushes and vanguards because they are more patient and enduring in exertion.\n\nChapter Ten\nTeaching Horse Riding in Various Situations\nAnyone wishing to handle animals should learn what is indispensable, such as riding well bareback and with a saddle, and holding the reins, and learning principles of horsemanship to aid in riding and controlling them. Know—may Allah guide you—that the root of horsemanship is stability (*Thabat*), and its beginning is riding horses bareback. Whoever does not train first on bareback will usually not have established stability, but will always be anxious in his saddle, especially when trotting and galloping, so his fall is not secure if his horse shakes or a mishap occurs. Whoever wants to learn bareback should wear light, well-known clothes, bridle his horse, and tie a wool or hair cloth (*Jull*) on it with a secure girth and breastplate, for the rider on a cloth is more stable than on a bare back. He should stand on the left of his horse at its shoulder, hold the rein of its bridle with his left hand. If he grabs the mane with the rein, there is no harm. He should leap with speed and lightness; when he settles on its back, he gathers his hands on the rein at the horse's withers, straightens his back, sticks his thighs to the place of the saddle panels on the horse's back, and advances slightly—advancing is better bareback than retreating. He extends his knees, shanks, and feet towards the horse's shoulders until he can look at his big toes. His reliance should be on gripping with his thighs; by that, he achieves stability. Anyone whose riding relies on other than that has neither riding nor stability.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 32
  },
  {
    "serial_number": "6786033",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Adjusting the rein is fundamental to proficiency and mastery. Then he moves his horse from standing to walking by squeezing lightly with his heels gently, then walks it at an amble (*Anaq*) gently, then expands the amble slightly. During this, he must check himself in sitting in the mentioned posture, and holding and adjusting the rein, until he knows he is stable and it becomes a habit and second nature. Then he moves his horse from the amble to the trot (*Khabb*) by increasing the squeeze with his heels slightly; it should trot gently. Let him catch himself, for the trot almost uproots the rider from his saddle, especially at its start and at the pull and end, so beware of that in both cases. Then increase gradually until approaching the canter (*Taqrib*). If stable on that, move to the canter with calmness and levelness, until moving like the walking of a pedestrian. Let him assist with his legs and stick to the horse, or put his feet under the horse's armpits or between its forelegs if he is one who reaches that in trotting and cantering. If stable on that and independent of leg assistance, and settled on the horse's back, and the horse settles under him completely, let him then run his horse between the two runs. If stable and the matter becomes light, let him run his horse at full speed (*Mil'a Furujihi*). Let him be cautious then for himself in both cases: when leaping and when pulling (stopping). Let his pulling be moderate, not prolonged in the run (*Talq*), for prolonging it spoils horses, especially those worked with the spear. If the horse is soft and he knows it stops with one pull, do not stop it except with three pulls, stopping it in the fourth with a halt. Each pull should be softer than the one before. Do not grab its head when pulling, but let it be a gentle, successive restraining. Do not release the rein between two pulls lest the horse returns to running. Let him level his hand with the rein then, and his restraining be balanced. Let him beware of length on one side and shortness on another, for the balance of the rein between rider and horse is like a scale. Good estimation in that is the title of reason and witness of nobility. Adjusting it by the horse's front and rear is the most confirmed thing to care for first and last. Beware of tilting from one side of balance. Many horses, if restrained by a non-expert, throw him from the saddle then. Let him also guard when pulling against making the horse's mouth bleed with the bit; rarely does it bleed except by one with no knowledge of holding it or estimation of his rein. Let the bit be *Naziki*, known now as *Lazmah* or similar, for it is of the bits of knights. Its weight and lightness should be according to the horse's tolerance. Test bits on it; whichever is lighter and better in its mouth and with which it behaves better is its bit. Upon looking at it, what suits it appears. That the horse chews its bit and finds it pleasant is better than fearing it and rearing or lowering its head. It should not be so light that the horse scorns it and the rider cannot control its head. Moderation between that is the goal. Let its cheekpiece (*Idhar*) be short, for length reduces the horse's run, especially the weak-jawed. Necessarily, if the bit hits its teeth, it hurts and distracts it from much running. If the rein is short, it takes the bit with its canine teeth, relies on it, and finds relief. Let the rein also be short, not exceeding the pommel except slightly, for length distracts the rider and confuses the horse. If he masters all this, gets used to riding bareback, and it becomes like nature, he has possessed the root of riding and acquired the bulk of it. Let him then transfer himself to the saddle, with the help of Allah Almighty.\n\nSection",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 33
  },
  {
    "serial_number": "6786034",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Whoever wishes to practice horsemanship on a saddle, it is recommended to choose a spacious saddle to move in as he pleases, especially for a learner; spacious is more suitable than tight. It should have sturdy wood, a wide seat, low pommel (*Qarbus*) and cantle (*Mu'akhkhara*), and its breastplate (*Labab*) should be sturdy of well-tanned leather circling the saddle, and a girth (*Hizam*) likewise sturdy. Ibn Hizam said: Two girths are better than one, and I prefer that. Also two stirrups (*Rikab*) of moderate weight, size, and ring, neither wide nor tight; heavy is better than light. Secure with stirrup leathers and buckles, and check their length and shortness to be equal; according to need in length and shortness. Being slightly long is better than being short, for if stirrups are short, the rider might be cut off from his saddle when the horse leaps or is pulled in a run, so he is not safe from falling, especially if the horse swerves or rears. Each leg has a limit in them to be measured, like clothes and boots; whoever exceeds his limit and departs from his size, his clothing becomes heavy, and standing and sitting difficult. What is correct is to rely on his seat in the saddle, with shanks extended, relying on stirrups so he is like one standing possessing his entire body, acting with moderation in every limb. He should use two round or square pads (*Bidad*), especially for long travel and much running, as protection for the horse's withers; if a saddle attachment breaks, the pad protects it, and guards the horse's back from pommel and cantle. Use a sweat cloth (*Mirshahah*) of two layers as protection under the pads. The sweat cloth also dries sweat from the pads. If he wants to ride, he tightens with his own hands and handles his affair himself; not relying on others. If another handles it, let him test it upon mounting as a precaution by moving and dismounting. If the girth is loose, the saddle waves with its rider, especially if holding weapons, which is not good. Also, if weapons are tight, they don't wave on the horse's back and hardly cause sores or galling. With looseness and slackness, sores and galling often occur. Let him hold his whip or rod when mounting in his left hand, tuck his clothes, and stand on the left of his horse opposite the left stirrup, slightly behind. Do not stand forward, for it is a defect, but his left side should face the horse's shoulder. He takes the rein in his left hand with the pommel arch from inside or with the mane, if he sees that more helpful. Let him shorten his rein in his hand so the horse's head is full. If the horse doesn't feel the bit then, it might move and it wouldn't be from his mounting. Do not curb it excessively so it spins, but moderately. Then twist the left stirrup forward one twist, place the ball of the left foot in it and extend it to the horse's shoulder, not under its belly. Then take with the right hand the pommel or the saddle cantle, whichever he wishes, both are correct. Taking the pommel with the right is preferred by knights. Then lift himself up gently with power and stillness to mount quickly. If someone holds the right stirrup for him, that is good. When settled sitting in the saddle, place the ball of the right foot in the right stirrup, rely on the stirrups slightly to straighten clothes. If he wants to straighten clothes with his right hand before sitting in the saddle and after lifting, let him do so, for knights have done it. I do not see that (as best), since the horse might move preventing settling. But hold the rein during all that, then straighten the rein with both hands, adjust the horse's head, then move the horse from standing to walking by squeezing lightly with heels, not moving the body, nor hitting the horse's belly with leg movement, for that is ugly and knights don't do it. Look for the most pleasant walk of his horse, the best to him, lightest on himself and the horse, and most still, and carry it on that. Check what suits the horse with care.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 34
  },
  {
    "serial_number": "6786035",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Good riding and horsemanship lie in good sitting in the saddle, stability, adjusting the rein, equal squeezing, and using it in its place by measure where needed and compelled. Let his sitting be level, back straight, shoulders even, not bent, reclining, chest out, or hunched, but moderate. If he perfects sitting thus, let him stick his thighs to the saddle panels, lengthen his thighs, fence his legs in the stirrups and stick the balls of feet to them, not opening or delaying them. Nothing is uglier for a knight than delaying his legs; let him advance them but not excessively. The amount admired is that the rider can almost see the tips of his toes when settled. The root of riding is positioning, spreading thighs and lengthening them, sticking with them and relaxing them on the saddle. Most knights view good riding as being on the thighs, and relying on stirrups; this is more stable, making the rider like one standing. Let him care for positioning the balls of feet in stirrups, relying on the right one slightly more when working with the spear. For the archer, rely on the left slightly more. Mention of adjusting the rein has passed; let him check it with sure, intense care, for it is the soul of horsemanship, its essence, root, and branches. Be guarded with it, for it is the scale bearing no imbalance, having a calculation only the skilled nature understands. Its weight lies in balancing the horse's head with it. Let the horse always feel the touch and taste of the bit, so he knows his rider is never absent or heedless of him. Even if only for fear of stumbling if a mishap occurs, he holds it by the bridle. Also, excessive loosening of the rein accustoms the horse to ride its own head and govern itself, so riding it doesn't straighten. One should not push the horse to run while holding and pulling the rein, for the horse won't know running is desired. Nor release excessively, confusing the matter and making it anxious. But between that, a moderate hold. For the rider to control his horse's head is more suitable and better. Gradation of movement from walking, to trotting, to cantering, to galloping has passed. Terms will be explained in their chapter in order, God willing. Whoever is forced to ride on a saddle without a girth, take the right stirrup with left hand, pull it across the breastplate path strongly, place left foot in left stirrup, take pommel with right hand along with rein, then mount. Whoever is forced to ride with a pillion rider, hold rein as mentioned, place left foot in left stirrup, take pommel arch with right hand, lift self and split the saddle with right leg to mount. If taking rein with right hand and pommel arch, there is no harm if needed; necessities have rules according to present conditions; let the man take the best possible and capable way, with Allah's help.\n\nChapter Eleven\nHorse Racing, the Racecourse, and Betting\nThe Arabs used to wager on their horse races, calling what they set for winners *Khasl* and *Rihan* (bets), placing it at the end of the goal line, on the top of a spear shaft. Hence their proverb: \"He won the cane of the race\" (*Haza Qasab al-Sabq*), meaning this. They called the goal *Al-Mada* and *Al-Amad*. They called the running place *Al-Midmar*. Then Islam came and kept of their actions what alerted the Ummah and aided high ambition. The Prophet, may Allah bless him and grant him peace, raced and ran horses that were slimmed down (*Dummirat*) from Al-Hafya' to Thaniyat al-Wada', six miles apart. And ran horses not slimmed down from Al-Thaniyah to the Mosque of Banu Zurayq, one mile apart. He, peace be upon him, said: \"Angels do not attend any of your amusements except betting (on races) and archery.\" From Abu Hurairah, he, peace be upon him, said: \"There is no prize (*Sabaq*) except in a hoof (camel), a hoof (horse), or a blade (arrow).\" It was said to Anas bin Malik: \"Did the Messenger of Allah, may Allah bless him and grant him peace, bet on horses?\" He said: \"Yes, by Allah! He bet on a horse of his called *Sabha*, and it won, so he was delighted and pleased.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 35
  },
  {
    "serial_number": "6786036",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "From Makhul: The Messenger of Allah, may Allah bless him and grant him peace, raced horses, and his black horse came in first. When he saw that, he knelt on his knees and said: \"It is indeed a sea (of speed).\" Umar, may Allah be pleased with him, said: \"Al-Hutay'ah lied! If anyone could escape this, the Messenger of Allah, may Allah bless him and grant him peace, would have escaped.\" Abu Ali said: Umar meant by this saying the verse: 'Indeed, swift horses do not provoke us... Nor those placing ivory upon wrists!'\nFrom Yaqub bin Zaid bin Talha from his father, he said: The Messenger of Allah, may Allah bless him and grant him peace, set a prize between horses of twelve ounces (of silver). A horse of Abu Bakr, may Allah be pleased with him, won, so he took four hundred and eighty dirhams.\nFrom Al-Sha'bi that Umar bin Al-Khattab, may Allah be pleased with him, wrote to Sa'd bin Abi Waqqas: \"Run horses and set prizes.\" He said: So I ran horses in Kufa. Two horses came rubbing against each other until they entered the enclosure (*Hujrah*). They disputed over them. So he wrote to Umar, and Umar wrote: \"If it wins by the head, it has won.\"\nFrom Harun bin Abi Ziyad, he said: Umar bin Al-Khattab, may Allah be pleased with him, said: \"Go early to this honor!\" meaning betting on horses. He said: People went early, and Salman went among those who went. Some people said: \"Let's beat him today!\" They met him and said: \"O Abu Abdullah! Who won today?\" He said: \"The winners won?\"\nThe origin of *Rihan* (betting) is from *Rahn* (pledge). A man would bet his companion on a race: this one puts a pledge, and that one puts a pledge; whichever horse wins takes his pledge and his companion's pledge. This was from the Pre-Islamic period, and it is the gambling prohibited. If the bet is from one of them named, such that if he wins he gets nothing (extra) but if his companion wins he takes the pledge, this is Halal. Because the pledge is from one, not the other. Likewise, if each puts a pledge and they enter a \"legalizer\" (*Muhallil*) between them, a third horse between the first two, also called *Dakhil*. The owner of the third puts nothing. Then they release the three horses. If one of the first two wins, he takes his pledge and his companion's pledge, and it is lawful for him. If the *Dakhil* wins, he takes both pledges. If he is beaten, he owes nothing. The *Dakhil* must be a winning racer whom they fear might beat them and take the pledges; this is permissible betting. If the *Muhallil* is not fast and they are sure they will beat him, this is gambling, because it is as if they didn't enter anything between them. The basis of this is the Hadith of Sa'id bin al-Musayyib: The Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever enters a horse between two horses and is not sure he will be beaten, there is no harm in it. Whoever enters a horse between two horses and is sure he will be beaten, it is gambling.\"\nAl-Waqidi narrated from Musa bin Muhammad from his father: \"The Messenger of Allah, may Allah bless him and grant him peace, used to give prizes to ten horses; whatever was more he gave nothing.\"\nThe Arabs in the Pre-Islamic period used to set only seven canes (prizes) in their time, and only eight horses entered the enclosure (*Hujrah*). They sent their horses ten by ten. They named the first *Al-Sabiq* (The Winner), *Al-Mubarriz* (The Outstanding), and *Al-Mujalli* (The Clearer). It was their custom to wipe the face of the winner, as Jarir said:\n\"If you wish to wipe the face of a winner... A steed, then lengthen the reins in betting.\"\nThey name the second *Al-Musalli* because it places its lip on the *Sala* of the winner, which is a vein on the outside of the thigh sides. The animal has two *Sala*, the sides of the tail base. The third is *Al-Musalli* (The Consoler), derived from *Suluww* (forgetting/consolation), as if it consoled its companion when it came third. The fourth is *Al-Tali* (The Follower) because it follows the *Musalli*. The fifth is *Al-Murtah* (The Relaxed/Joyful), from *Rawah*. Meaning it came at the end of the first group, for being fifth, it halved the number of winners; it is the first of the *Rawah* (late) and last of the *Ghuduw* (early). Thus, the fifth of winners is the last of the firsts and first of the lasts. The sixth is *Al-Atif* (The Turner), from *Atf* (bending), as if this horse turns the lasts onto the firsts, so a name was derived from its action. The seventh is *Al-Haziy* (The Fortunate); it was fortunate because it took the place in the lasts that the *Musalli* took in the firsts, gaining a share missed by those after it, as it missed being the *Atif*. The eighth is *Al-Mu'ammal* (The Hoped For), because it is awaited by the three differing ones, as one must win usually; when identified, it was named by what hope was attached to it.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 36
  },
  {
    "serial_number": "6786037",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "The ninth is *Al-Latim* (The Slapped); it was made slapped because the *Mu'ammal* won before it, so its face was slapped away from entering the enclosure. The tenth is *Al-Sukayt* (The Silent); called *Sukayt* because humiliation and silence overcome its owner. It must be so, because the one before it was *Latim*, so what can he say? Excuse benefits him. Kilab bin Hamzah said: We know of no one among the Arabs in Jahiliyyah or Islam who described race horses by their names and mentioned them in their ranks other than Muhammad bin Yazid bin Maslamah bin Abdul Malik bin Marwan. He was in Al-Jazirah, in the village known as Hisn Maslamah, in the district of Raqqa of Diyar Mudar. He recited a beautiful poem about it beginning:\n\"We attended the betting on the morning of betting... In a gathering brought together by the season.\nWe lead to it the leading of the multitude... And we are most upright in its craft.\"\nHe says regarding the racehorses:\n\"So the *Agharr* cleared (won) and the *Kumait* prayed (came second)... And the *Adham* consoled and was not blamed.\nThe fourth followed them trailing... And where is the Highland from the Lowland?\nIts *Murtah* was not blamed as fifth... Coming advancing what advances.\nIts sixth is the confused *Atif*... Almost deprived due to its confusion.\nIts *Haziy* came seventh... So its fortunate share gave it a share.\nThe *Mu'ammal* came in it failing... And the most ominous bird sang for it.\nIts *Latim* came ninth... Slapped from every side.\nThe *Sukayt* trots on its trace... And its *Dhifra* (behind ear) is larger than a dome.\"\nThe poem is long, fulfilling the purposes of its meaning. Abu al-Hasan al-Mas'udi mentioned it in his book 'Muruj al-Dhahab'. We only brought the verses containing the mention of racehorses. *Halbah* is the gathering of horses, and it is said the gathering of people for betting; from saying: Banu Fulan gathered (*Halabu*) against Banu Fulan, and *Ahlabu* meaning gathered.\n\nSection\nDescription of the horse that can attend the goal and race with the group without slimming down (*Tadmir*), bearing burden, or tucking up: To be wide-breathed (cavity and nostrils), wide-skinned, wide-backed, wide-crouped, away from its kidneys (long-flanked?), wide-jawed, abundant saliva, wide-chested, tucked-flank skin (*Sifaq*), and along with that *Hashsh* (sweats easily), its sweat heats the asthma of its body. If it has these qualities, it is better and safer for it not to be sent to the track after ease/rest, until it has been worked for days so its belly catches up (lightens) and it bows for the gallop (strengthens). Also, after rest, its belly is mostly full and flank skin stretched; perhaps it hits it with its stifles and cuts it or hinders and shortens it. The rested horse never leaps (*Yadbir*) like the leaping of horses treated with exercise and work. We see wild animals and dogs, which are not slimmed or manufactured, if tasked with running while resting, they pant, gasp, and stop what they could do when not resting. Every animal, if rested, relaxes. There is no good in storming the track except after work and slimming. Even if it has the praised description and abundant build. Desirable in slimming (*Tadmir*), rather indispensable, is: good management in policy, lack of boredom in observation and service, continuity of riding as needed, reducing fodder at times, entering it into a covered house and covering it to sweat and dry its sweat. Thus its flesh firms, lightens, and strengthens. Slimming is not emaciating the horse, humiliating it, or cheating its right; it is done to tighten its flesh, squeeze its body, remove excess, and keep it on its original nature. Ibn Banin mentioned that the Messenger of Allah, may Allah bless him and grant him peace, used to order slimming his horses with dry grass, bit by bit, phase by phase. He would say: \"Quench them with water, water them morning and evening, and keep covers on them, for they meet water with sweat under covers, so their colors clear and skins widen.\" He, peace be upon him, ordered leading them twice every day, taking a run or two from them, not galloping them until they become lean. Horses differ in conditions and vary in forms; each has its specific slimming and is treated according to its limit and measure. So take each according to its state and activity, and measure of its laziness or energy, with Allah's help.\n\nChapter Twelve\nNames of the Horses of the Messenger of Allah",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 37
  },
  {
    "serial_number": "6786038",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "May Allah bless him and grant him peace, and Names of the Stallions and Famous Horses of the Arabs\nThe Messenger of Allah, may Allah bless him and grant him peace, had a number of horses. Among them was *Al-Sakb* (The Pouring), which he rode on the day of Uhud; Ibn Qutaybah recounted this. Among them was *Al-Murtajiz* (The Thunderer), named so for the beauty of its neighing. He had a horse called *Lizaz* (Close/Adhering). And a horse called *Al-Zarib* (The Firm). And a horse called *Al-Lahif* (Covering with tail/mane). And a horse called *Al-Ward* (The Bay). Someone other than Ibn Qutaybah added a horse called *Mulawih* and a horse called *Al-Ya'sub* (The Bee Leader/Chief). *Al-Ward* is the one Tamim al-Dari gifted to him. These are the horses of the Messenger of Allah, may Allah bless him and grant him peace, as mentioned by Ibn Qutaybah and others.\nAs for the horses of the Arabs, the oldest of them is *Zad al-Rakib* (Provision of the Rider), which Solomon son of David, peace be upon them, gave to a group of Azd who were his in-laws; it was the first horse to spread among Arabs from his horses. It was said: When Taghlib heard of that, they came to them and bred from it, producing a horse better than Zad al-Rakib, which they named *Al-Hujays*. When Bakr bin Wa'il heard of that, they came to Banu Taghlib and bred from it, producing a horse better than Al-Hujays which they named *Al-Dinari*. Muhammad bin Al-Sa'ib and other scholars mentioned the names of famous horses in Arab poetry. Among them in Quraysh were the horses of the Messenger of Allah, may Allah bless him and grant him peace, mentioned before. Among them was the horse of Hamza bin Abdul Muttalib, *Al-Ward*, a daughter of *Dhu al-Uqqal* from the daughters of *Awaj*. Hamza, may Allah be pleased with him, said regarding that:\n\"I have nothing but a weapon and a Bay (*Ward*)... A full-grown from the daughters of Dhu al-Uqqal\nI shield it from death with my own soul... While it shields me, facing the chests of spears.\"\nAl-Kalbi narrated from Abu Salih from Ibn Abbas that *Awaj* was the master of David's famous horses, and it belonged to a king of Kinda. He raided Banu Sulaym on the day of 'Ilaf', they defeated him and took *Awaj*. It then went to Banu Hilal of Banu Amir and produced excellent offspring. Then noble horses spread among the Arabs. Among their named stallions and mares were:\n*Al-Ghurab*, *Al-Wajih*, *Lahiq*, *Al-Mudhhab*, and *Maktum*; these belonged to Ghani bin A'sur. *Dhu al-Uqqal* belonged to Banu Riyah bin Yarbu'. *Dahis* was the son of Dhu al-Uqqal. *Al-Hanfa*, sister of *Dahis*, belonged to Hudhayfah bin Badr al-Fazari. *Al-Ghabra* belonged to Hamal bin Badr al-Fazari. *Qasam* belonged to Banu Ja'dah. *Fayyad* and *Sabal* also belonged to Banu Ja'dah. *Al-Himalah* and *Al-Qurayz* belonged to Banu Sulaym.\nAs for *Dahis*, it belonged to Qais bin Zuhair bin Jadhimah al-Absi. Hudhayfah bin Badr al-Fazari bet against it, leading to the war of Ghatafan, which lasted between them, as they mentioned, for forty years. The Arabs considered it and its offspring an ill omen. Bashir bin Abi al-Absi said regarding that:\n\"Indeed, the wretched horses from the family of Dahis... Refused, so they never succeeded on a betting day\nThey brought, by Allah's leave, the killing of Malik... and cast Qais beyond Oman.\"\nAmong them in Kinanah was *Al-Latim*, the horse of Rabi'ah bin Mukaddam, and *Masad*, a horse of Ibn Ghadiyah al-Khuza'i. *Al-Ajdal* was the horse of Abu Dharr al-Ghifari, companion of the Prophet. *Al-Ya'sub* was the horse of Al-Zubayr bin Al-Awwam. *Dhu al-Limmah* was the horse of Ukasha bin Mihsan. *Rirrah* was the horse of Al-Jami' bin Munqidh al-Asadi. *Hazmah* was the horse of Hanzalah bin Fatik al-Asadi. *Zabyah* was the horse of Al-Harras al-Asadi. *Al-Himalah* was the horse of Tulayhah bin Khuwaylid al-Asadi, to whom he said:\n\"I set up for them the chest of *Al-Himalah*... She is accustomed to the warriors' saying: Dismount!\nOne day you see her protected in covers... And another day you see her without covers.\"\n*Ma'ruf* was the horse of Salamah bin Hind al-Ghadiri. *Al-Maniha* was the horse of Dithar bin Faq'as al-Asadi. *Nasih* was the horse of Fadalah bin Hind bin Sharik al-Asadi, to whom he said:\n\"O Nasih! Tuck up for the race for it is... A morning of defense gathered by the milkers\nDo you remember my clothing you every winter... My cloak, and feeding you while my belly was hungry?\"\n*Al-Latim* was also a horse of the mentioned Fadalah. Among Banu Tamim bin Murr was *Al-Shawha*, the horse of Hajib bin Zurarah al-Tamimi. *Al-Raqib* was the horse of Al-Zibriqan bin Badr al-Tamimi.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 38
  },
  {
    "serial_number": "6786039",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "From the offspring of *Awaj* belonging to Banu Asad was *Al-Asjadi*. *Athal* was the horse of Damrah bin Damrah bin Darim. *Al-Khadhwa'* was the horse of Shaytan bin al-Hakam bin Yarbu'. *Al-Shayyit* was the horse of Labid bin Jabalah al-Dabbi. *Al-Aradah* was the horse of Kalahbah al-Yarbu'i. *Al-Ahwa* was the horse of Uwayd bin Salma bin Rabi'ah al-Dabbi. *Al-Agharr* was the horse of Tarif bin Tamim. *Kamil* was the horse of Zaid al-Fawaris al-Dabbi. *Dhu al-Wushum* was the horse of Abdullah bin Adda'. *Wahfah* was the horse of Ulahthah bin al-Julas al-Tamimi. *Mabdu'* was the horse of Al-Harith bin Dirar al-Dabbi. *Al-Gharraf* was the horse of Al-Bara' bin Qais bin Attab. *Al-Shaqra'* was the horse of Al-Ruqad bin al-Mundhir al-Dabbi. *Al-Mukassar* was the horse of Utaybah bin al-Harith bin Shihab. *Shawlah* was the horse of Zaid al-Fawaris al-Dabbi. *Al-Nahham* was the horse of Sulayk, about which he says:\n'Bring forward Al-Nahham and hurry, O boy... And throw the saddle upon him and the bridle.'\n*Al-Ward* and *Al-Jumanah* were the two horses of Amir bin al-Tufayl. *Hadhfah* was the horse of Khalid bin Ja'far bin Kilab. *Jirwah* was the horse of Shaddad bin Muawiyah al-Absi. *Al-Abjar* was the horse of Antarah bin Shaddad bin Muawiyah al-Absi. About it he says:\n'Do not hurry; tighten the girth of Al-Abjar... For if death calls, I do not anguish\nNor do I promise my soul delay.'\n*Wajzah* was the horse of Yazid bin Abi Sinan al-Murri, the knight of Ghatafan. *Mihaj* was the horse of Malik bin Awf. About it he says on the day of Hunayn:\n'Advance, Mihaj! It is a grievous day... The likes of me protects and attacks upon the likes of you\nIf the rank is lost one day, and the rear.'\n*Al-Ubayd* was the horse of Al-Abbas bin Mirdas al-Sulami. He is the one who reproached the Prophet, may Allah bless him and grant him peace, when he gave (gifts) to Uyaynah bin Hisn al-Fazari and Al-Aqra' bin Habis al-Tamimi a hundred camels each, but gave him only a few camels. He said regarding that:\n'Do you make my spoil and the spoil of Al-Ubayd... between Uyaynah and Al-Aqra'?\nNeither Hisn nor Habis... were ever above Mirdas in an assembly.\nAnd I am not below either of them... And he whom you lower today will not be raised.'\nIbn Ishaq said: The Messenger of Allah, may Allah bless him and grant him peace, said: 'Go with him and cut off his tongue from me (silence him).' So they gave to him until he was satisfied; that was the 'cutting of his tongue' ordered by the Messenger of Allah, may Allah bless him and grant him peace. *Al-Bayda'* was the horse of Bujayr bin Abdullah bin Qushayr. *Al-Musabbih* was the horse of Awf bin al-Kahin al-Sulami. *Al-Sayud* was a famous mare attributed to the noble horses of the Arabs. *Al-Dakhm* was the horse of Rahdah bin Mu'ammil al-Sulami, about which he says:\n'Is not the one most deserving to witness the war... And kill heroes, a huge man upon a huge horse (*Dakhm*)?'\n*Qurzul* was the horse of Al-Tufayl bin Malik al-Amiri. *Al-Quways* was the horse of Salamah bin al-Harith al-Absi. *Sullam* was the horse of Zabban bin Sayyar al-Fazari. *Mayyas* was the horse of Shamir bin Rabi'ah al-Bahili. *Al-Na'amah* was a mare among Rabi'ah belonging to Al-Harith bin Ubad. *Ziyam* was the horse of Al-Akhnas bin Shihab al-Taghlibi, who was among the famous knights of the Arabs. About it he says:\n'This is the time for charging, so charge, O Ziyam... There is no life but thrusting on the day of obscure dangers.'\n*Khumayrah* was the horse of Shaytan bin Mudlij al-Jushami. *Al-Nubak* was the horse of Al-Sabah bin Khalid al-Taghlibi. *Al-Shamus* was the horse of Yazid bin Khadhaq. *Al-Anz* was the horse of Abu Afra' bin Sinan al-Muharibi. *Al-Jawn*: among them in Yemen was the horse of Imru' al-Qais bin Hujr al-Kindi. *Al-Attaf* was the horse of Amr bin Ma'd Yakrib al-Zubaydi. *Al-Hattal* was the horse of Zaid al-Khayl bin Muhalhil al-Ta'i, surnamed Abu Miknaf. About it he says:\n'I bring close the tether of Al-Hattal, for I... See a war being conceived from barrenness.\nI equate him with Miknaf when we winter... And I prefer him over most of the family.'\nHe was named *Zaid al-Khayl* (Zaid of the Horses) due to the abundance of his horses. Among his noble ones were: *Al-Hattal* (mentioned), *Al-Kamil*, *Al-Kumait*, *Al-Ward*, *Lahiq*, and *Dha'ul*. Ibn Ishaq said: He came to the Messenger of Allah, may Allah bless him and grant him peace, with the Tayy tribe, and Zaid al-Khayl was their leader. When they reached him and spoke to him, the Prophet, may Allah bless him and grant him peace, presented Islam to them, so they accepted Islam and their Islam was good. Then the Messenger of Allah, may Allah bless him and grant him peace, named him *Zaid al-Khayr* (Zaid of Goodness).",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 39
  },
  {
    "serial_number": "6786040",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "*Al-Attas* was the horse of Abdullah bin Abdul Madan. *Al-Asa* (The Staff) was the horse of Jadhimah bin Malik al-Azdi, the King of Al-Hirah in ancient times, ages before the Munthirids; he is Jadhimah the Leper (Al-Abrash) whom Al-Zabba' killed, and Qasir escaped on his horse *Al-Asa*, then took revenge later and killed Al-Zabba' in a long story. *Al-Dhubayb* was the horse of Hassan bin Hanzalah al-Kindi; he witnessed the Day of Nahrawan with Chosroes (Kisra), and the day Chosroes met Bahram and was defeated. Chosroes fled, and Hassan bin Hanzalah caught up with him while Chosroes's workhorse had stopped. Hassan dismounted from his horse *Al-Dhubayb*, and Chosroes rode it and escaped. Hassan said regarding that:\n'I rectified Chosroes lest he be harmed, and I was not... One to leave him stumbling on horses while on foot.\nI offered him the chest of Al-Dhubayb when there appeared... Branded horses from the cavalry of Turks and Kabul.'\nThen Chosroes prevailed and killed Bahram. When his kingdom was established, Hassan bin Hanzalah came to him but stayed at his door unable to reach him. When the matter dragged on, he came to the chamberlain and said: \"You have prolonged my exclusion, and I have the greatest hand (favor) upon Chosroes, so inform him of my place.\" He informed him, and he gave him permission. He said: \"Who are you? And what is this hand of yours?\" He said: \"I am the one who carried you on my horse on the Day of Nahrawan when your workhorse stopped.\" Chosroes said: \"Ugh to you! You have reminded me of the most malicious day that ever passed me! Take this dog out!\" So they took him out... Until the worries cleared from Chosroes, he regretted and felt ashamed, so he honored him, gave him a good reward, and granted him *Tassuj*, which is parasangs away from Kufa. *Al-Burayt* was the horse of Ibn Qabisah al-Ta'i. *Hawmal* was the horse of Harithah bin Anas bin al-Harith. *Al-Yahmoum* was the horse of Al-Nu'man bin al-Mundhir, King of the Arabs; *Al-Yahmoum* was from the breeding stock of Ghatafan. *Al-Qurayt*, *Nahlah*, and *Shahir* were horses belonging to Kinda. *Khisaf* was the horse of Malik bin Amr bin al-Mundhir bin al-Harith bin Mariya (possessor of the two earrings hung on the Kaaba). Malik bin Amr was a coward; if he tasted war, he would be a bowshot away from it. An arrow came to him one day and fell near his horse's leg. He said: \"This arrow almost hit me.\" The arrow shook, and he watched it shaking often. He dismounted and dug around it, and found the arrow had hit a jerboa in its burrow, not missing its skull, killing it. Malik bin Amr mounted and said: \"Man is nothing, nor is the jerboa.\" This became a proverb. Then he said: \"I see myself fleeing from my appointed time, yet the arrow entered upon the jerboa when its time was fulfilled, and its caution availed it nothing. I will not die nor be killed except by my appointed time.\" So he charged, piercing the rank back and forth, and was thereafter among the bravest of his people. A poet from Ghassan said about that:\n'If Time directs arrows at a man... It hits and does not miss, aiming purposefully.\nMany a *Khisaf* has missed its arrows... And which man remains eternally against Time?'\n*Al-Dhubayh* was the horse of Khawwat bin Jubayr al-Ansari. *Al-Warha'* was the horse of Qatadah al-Kindi. *Kanzah* was the horse of Al-Mundhir bin Shammas al-Judhami. *Al-Yasir* was the horse of Abu al-Nadir al-Sa'di. *Al-Haddaj* was the horse of Al-Rayb bin al-Shariq al-Sa'di. *Al-Jawn* was the horse of Al-Harith bin Abi Shamir al-Ghassani. Alqamah said about it when he (Al-Harith) captured his brother Sha's, in his poem beginning: \"Your heart is obsessed with beauties, enraptured...\" He says later in it:\n'I swear, were it not for the knight of Al-Jawn among them... They would have returned in disgrace, and the return is beloved.\nYou advance him until his white legs disappear... And you are a striker of the white forearms.'\n*Al-Arim* was the horse of Al-Mundhir bin al-A'lam al-Khawlani. *Al-Arin* was the horse of Umayr bin Jabal al-Bajali. *Nisab* was the horse of Al-Ahwas bin Tha'labah al-Kalbi. Its daughter *Wari'ah* was gifted by Al-Ahwas to Malik bin Nuwayrah. *Muwakil* and *Al-Qarra'* were the two horses of Rabi'ah bin Ghazalah al-Yashkuri. *Al-Ghazalah* was the horse of Muhallim bin al-Arqam. *Sa'dah* was the horse of Dhu'ayb bin Hilal al-Khuza'i. *Al-Na'amah* was the horse of Qurras al-Azdi. *Dhu al-Rish* was the horse of Al-Samh bin Hind al-Khawlani. *Al-Tayyar* was the horse of Abu Raysan al-Khawlani. *Al-Janah* was the horse of Muhammad bin Maslamah al-Ansari, companion of the Messenger of Allah, may Allah bless him and grant him peace. *Al-Mu'alla* was the horse of Al-As'ar bin Abi Humran al-Ju'fi. *Bahram* was the horse of Al-Nu'man bin Uqbah al-Ataki. *Suhbya* was the horse of Al-Namir bin Tawlab al-Ukli. About it he says:\n'Do the runs of Suhbya go in vain... And the galloping of horses trembling violently?\nAnd my charging in the battle every day... When voices mix with the dust?'",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 40
  },
  {
    "serial_number": "6786041",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "*Al-Hulayl* was the horse of Miqsam bin Kathir al-Asbahi. *Atlal* was the horse of Bukayr al-Kinani. *Al-Ghamamah*, *Al-Sarih*, *Qayd*, and *Madiq* belonged to the kings of Banu Ma' al-Sama'. *Al-Sha'ur* was the horse of the Habitat clan of Banu Tamim. *Afiq*, *Al-Khubas*, and *Na'iq* belonged to Banu Fuqaym. *Ra'shan* belonged to Murad. *Al-Sagha* was the horse of Mujashi' bin Mas'ud al-Sulami, and it was from the offspring of *Al-Ghabra* (horse of Hamal bin Badr al-Fazari); Umar bin Al-Khattab bought it for ten thousand dirhams. Then Mujashi' went to raid, so Umar, may Allah be pleased with him, said: \"Shall this be kept in Medina while its owner is in the throats of the enemy, and he is more in need of it?!\" So he returned it to him, and it produced offspring for his children until Al-Hajjaj bin Yusuf sent and took what remained of them. *Al-Qatadi* and *Al-Tiryaq* belonged to Al-Khazraj in Islam. *Al-Harun* was the horse of Muslim bin Amr, Abu Qutaybah bin Muslim al-Bahili; he bought it from a man—after it had been stubborn with him—for a thousand dirhams. Then he saw in his dream that sparrows were coming out of its penis. He sent to Muhammad bin Sirin, and Ibn Sirin said to him: \"If your vision is true, you will breed noble horses!\" From it come the noble horses today. *Munahib* belonged to Banu Taghlib bin Yarbu'. *Al-Daif* belonged to Banu Taghlib. *Humayl* belonged to Banu Ijl. *Al-Butin*, *Al-Bawwab*, and *Al-Dha'id* (from the mentioned *Al-Harun*) belonged to Muslim bin Amr al-Bahili. *Al-Sahib* belonged to Ghani al-Bahili. Among them was *Ghutayf* from the horses of the people of Sham (Levant). *Al-A'rabi* belonged to Abbad bin Ziyad from the horses of the people of Al-Aliyah. *Al-Qatarani* belonged to Al-Salami. *Al-Dha'id* belonged to Al-Abbas bin Al-Walid bin Abdul Malik bin Marwan. Most winners are attributed to *Al-Butin* and *Al-Dha'id*.\n\nChapter Thirteen\nMentioning Various Terms and Naming Things Specific to Horses\nFrom that is the age of the horse. When its mother gives birth to it, it is *Muhr*, then *Faluw*. If it completes a year, it is *Hawli*. Then in the second, *Jadha'*. Then in the third, *Thaniy*. Then in the fourth, *Ruba'i*. Then in the fifth, *Qarih*. Then after that, until its age is forgotten, *Mudhaki*.\n\nSection: On its sounds and types of striking attributed to it\n*Al-Sahil* (Neighing) is its voice in most conditions. *Al-Dhabh* (Panting) is the sound of its breath when it runs; the Quran has mentioned it. *Al-Qab'* is a sound it repeats from its throat to its nostrils if it shy away from something or dislikes it. *Al-Hamhamah* (Nickering) is its sound if it asks for fodder or sees its owner and seeks familiarity. *Al-Nathir* (Snorting) is like sneezing for a human. *Al-Khadi'ah* and *Al-Waqib* are the sounds of its belly. Likewise *Al-Baqbaqah* and *Al-Qabqabah*. *Al-Ra'iq* and *Al-Ru'aq* is a sound heard from its sheath, just as *Al-Wa'iq* is heard from the mare's vulva. As for types of striking, it is said: The animal *Nafahat* (struck) with its foreleg, *Ramahat* (kicked) with its hind leg, *Natahat* (butted) with its head, *Sadamat* (bumped) with its chest, and *Khatarat* (swished/struck) with its tail.\n\nSection: On descriptions of its walking and running in detail\n*Al-Dhayr*: When it stands firm with gathered legs. *Al-Anaq*: When it spaces its steps and expands in its walk. *Al-Hamlajah*: When it brings its steps close with speed; this is the pace/amble (*Sayr*) for people. *Al-Irtijal*: Mixing *Hamlajah* with *Anaq*. *Al-Khabb* and *Al-Khabab* (Trotting): When it straightens its neck in running, alternates its forelegs, and tucks its hind legs. *Al-Dhab'*: When it twists its fore-hooves towards its upper arms. *Al-Ujayla*: Between trot (*Khabb*) and canter (*Taqrib*). *Al-Taqrib* (Canter): When it lifts its forelegs together. *Al-Radayan*: When it stones the ground with its hooves. *Al-Dahw*: When it throws itself (extends) without lifting its toe much from the ground. *Al-Imjaj*: When it starts running before heating up. *Al-Ihdar* (Galloping): When it runs a continuous run. *Al-Ihdhab* and *Al-Ilhab*: When it blazes in its run. *Al-Irkha'*: More intense than *Ihdar*, likewise *Al-Ibtirak*. *Al-Ihmaj*: When it strives to give its utmost and exhausts its effort. Their order of running is: *Al-Khabb* first, then *Al-Taqrib*, then *Al-Imjaj*, then *Al-Ihdar*, then *Al-Irkha'*, then *Al-Ihdhab*, then *Al-Ihmaj*.\n\nSection: On urging and inciting it\nThe Arabs say: *Awshaytu* the horse, and *Alhabtu* (inflamed) it with the whip, and *Maraytu* (extracted speed from) it with the heel. The poet said:\n'They urge them (*Yushunahunna*) when they sense fear... Under the armor, with heels and crop handles.'\nMeaning they extract their running by kicking with feet (heels) and hitting with whips (*Jidham*). Imru' al-Qais said describing his horse in a state of running:",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 41
  },
  {
    "serial_number": "6786042",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "'For the whip there is a blazing speed (*Ulhub*), and for the leg a flow (*Dirrah*)... And for the scolding there is the reaction of a wild, long-necked one.'\nHe says: If I move him with my leg, he blazes in running, meaning he comes with a run like the burning of fire; and if I hit him with the whip, he flows with speed. And if scolded, that affects him like it affects a wild one with no reason. The *Min'ab* is the one that stretches its neck in running. *Hamz* (pricking) and *Ghamz* (pressing) with the heel are well known.\n\nSection\nAs for scolding (urging with voice), it uses words the horses are accustomed to and whose languages they are familiar with. Among what the Arabs used were: *Yahyuh* and *Hal*. The poet said:\n'So we thought he was overcoming him... So we urged him with Yahyuh and Hal.'\nAlso *Arhib*, *Arhi*, *Aqdim*, *Hab*, and *Habi*. Used for calming it and stopping its movement and playfulness was their saying *Hala*. The poet said:\n'If the grooms lead him, they do not control him... Even if those trying say to him \"Hala\".'\nTufayl al-Ghanawi gathered horse commands in one verse, saying:\n'It was said: *Aqdimi* (Advance f.), *Aqdim* (Advance m.), *Akh* (Whoa), *Akhkhiri* (Back up)... And *Ha* and *Hala* and *Isbir* (Patience) and checking her with *Habi*.'\nAmong them is *Al-Naqr* (Clicking/Clucking), which is making a sound with the mouth by placing the tip of the tongue on the front of the upper palate and pulling it after tightening, producing a sound upon release. Horses understood this as calming by habit, just as they understood whistling when drinking water. Until the poet said:\n'And do not drink without delight, for I... Have seen horses drink to whistling.'\nImru' al-Qais said about *Naqr*:\n'I lower him with the click (*Naqr*) when I mount him... And he raises a glance that is not dry or lowered.'\nEvery people has a custom, and in every time there is decrease and increase.\n\nSection: On descriptions specific to it\nA horse is called *Dali'* (Strong-ribbed) if its ribs are strong. *Mishyat*: Fast to fatten. *Salud*: Does not sweat. *Asim*: Its sweat when dried on it. *Khawwar al-Inan*: If it has a flexible neck/turning. *Qalahdham*: If generally short in build. *Kaham*: Dull/slow towards the goal. *Ajiz* in horses: Like impotent (*Innin*) in men. It is said regarding the mare's pregnancy: *Aquq*. Regarding birthing: *Natuj*.\n\nSection: On descriptions of its action and behavior\n*Al-Qadm*: Nibbling pasture with lips and front teeth. *Al-Khadm*: Taking with the whole mouth. *Al-Azm*: Clamping on the bit with the mouth. Among what is done to it: *Al-Taswim*: Sending it to pasture and leaving it alone. You say: *Sawwamtuhu* and *Ahmaltuhu*. *Al-Tandiyah*: Watering it until it drinks, then returning it to pasture to take a little, then returning it to water. You say: *Nadaytuhu Tandiyah*. The name of the place where this is done is *Al-Munadda*. *Al-Tamrigh*: Making a sound for it until it lies down and rolls in the dust. This is relief for it from exhaustion and a cure for fatigue and sweat; perhaps the horse does it itself and finds rest. The name of the place where it does this is *Al-Maraghah*.\n\nSection: On terms specific to groups of horses\n*Al-Tali'ah* (Vanguard): The first of the army. *Sar'an* of horses: Their leaders/first ones. *Al-Musabbaqat* of horses: The advancing ones, which are *Al-Bawadi*. *Saqah* of the army: Its rear. *Al-Kayyul*: The last ranks in war. *Andalafat* (Poured out) the horses: When they exit at the very beginning quickly. The first of their groups is: *Miqnab*, then *Minsar*, then *Ra'il* and *Ra'lah*, then *Kardus*, then *Qunbulah*.\n\nSection: On names of armies\nThe first is *Jaridah* (Detachment), which is stripped for a specific purpose. Then *Sariyah* (Company), from fifty to four hundred. Then *Katibah* (Battalion), from five hundred to a thousand. Then *Jaysh* (Army), from one thousand to four thousand. Likewise *Faylaq* and *Jahfal*. Then *Khamis*, from four thousand to twelve thousand. *Askar* collects them all.\n\nSection: On describing them by multitude and intensity of power (Thorns)\n*Katibah Rajrajah* (Shaking battalion). *Jaysh Lajib* (Clamorous army). *Askar Jarrar* (Dragging/Huge army). *Jahfal Luham* (Great army). *Khamis Aramram* (Numerous army). The battalion of the Messenger of Allah, may Allah bless him and grant him peace, was called *Al-Khadra'* (The Green), named so for the abundance of iron (armor/weapons) in it. Every battalion with much iron is *Khadra'*.\n\nSection: On places specific to horses, groups and individuals\n*Al-Mu'askar*: Place of the army (Camp). *Al-Ma'rakah*: Place of fighting. *Al-Malhamah*: Place of intense killing. *Al-Ma'ziq* and *Al-Ma'qit*: Narrow places of war. *Al-Istabl*: The house where they are kept (Stable). *Marbit*: Place of tying them therein. *Al-Ari*: Place of their feeding.\n\nSection: On names of things specific to horses and not others",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 42
  },
  {
    "serial_number": "6786043",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "*Al-Miqbas* and *Al-Miqwas*: A rope horses line up against during a race. *Al-Wahaq*: A rope thrown with a loop (lasso) to catch a beast if it bolts. *Al-Rasan*, *Al-Qiyad*, and *Al-Miqwad*: What is placed on its head to lead it. *Al-Shakimah*: The bar of the bit. *Al-Hakamah*: Less than the bit (curb chain area?). *Al-Withaq*: What ties the horse entirely. *Al-Tawal* and *Al-Til*: A rope with which the horse is tied and sent to pasture, its owner holding the end, or tied to the ground with a stake etc. *Al-Qayd*: For its forelegs (hobble). *Al-Shikal*: A rope with loops placed on a hand and a leg, sometimes diagonally. *Al-Akhiyah*: A rope with one loop placed on the horse's leg, its end secured to the ground. It is *Al-Ribqah*. *Al-Ribat*: A rope to confine the animal specifically. You say: I tied the horse with the *Ribat* (single rope), and secured it with the *Withaq* (general binding). You say: I bled (*Wadajtu*) the horse; *Widaj* is specific to animals, like *Fisad* (phlebotomy) for humans. And I shod it (*Samartuhu*) if I put iron shoes on it; this is also specific to animals.\n\nChapter Fourteen\nMention of a Selection of Poetry: The Arabs' Preference for Horses Over Others, Their Honoring of Them, and Their Pride in That\nThe Arabs never ceased preferring noble horses over children, and honoring them for adornment and hunting. To the extent that they would go hungry while the horses were full, go thirsty while they were quenched, and prefer them over themselves and their families when crises and hardships struck, and during drought years. Their reports indicate this and their poetry bears witness to it. We will mention a selection of that, God willing.\nFrom what was narrated of one of the Banu Amir bin Sa'sa'ah:\n'O Banu Amir! Why do I see the horses have become... Hungry? And some slimming is better for horses.\nO Banu Amir! Horses are a protection... For yourselves, and death is a deferred time.\nHumiliate yourselves for them, you will be honored, and undertake... Their maintenance, for maintaining horses is more beautiful.\nWhenever you honor them, a man honors himself... And every man is positioned where his people are.'\nFrom the speech of Al-As'ar bin Humran al-Ju'fi:\n'I have known, regarding avoiding death... That fortresses are horses, not the mud-bricks of villages.\nI found horses to be a manifest glory... Saving from distress and revealing blindness.\nThey spend the night as vanguards for the fearful frontier... And they spend the night as the wealth of the wealthy for the poor.'\nTufayl al-Ghanawi said:\n'Even if my wealth is little, I am not separated from... One like an ostrich, tall in his limbs.\nOr a grim-faced one whose veins are not cut... He is protected, yet on the day of terror, he is offered (in battle).'\nIsmail bin Ajlan said:\n'I have no wealth but horses I prepare... Even if I were wealthy with red dinars.\nI share my wealth with them and feed their surplus... To my family, hoping to be aided and rewarded.\nIf I did not have a steed, I would see myself... Even if I had the treasure of Korah, as destitute.'\nKa'b bin Malik said:\n'We prepare for the enemies every slimmed horse... Bay, white-legged, and piebald.\nThe King ordered tying them against His enemy... In war. Indeed, Allah is the best granter of success.\nSo they become a rage to the enemy and a wall... For the home if the horses of the renegades approach.'\nAlqamah bin Amr al-Mazini said:\n'I would not make my wealth the bucket of an irrigator... On top of a trunk pouring water into mud.\nHorses are of my equipment; God advised regarding them... And He did not advise planting in orchards.\nHow many a tyrant's city have they circled... Until they left the high parts like flat plains.'\nQais bin al-Harith said:\n'Do not place the tether of *Al-Shaqra'* far away... For the uncertainty of time is dreaded.\nHow many a poor person, by Allah's leave, has she revived... And a luxurious person she left drought-stricken.'\nAntarah al-Fawaris said about his father Shaddad's horse:\n'Whoever asks about me, then I... And *Jirwah* do not graze freely nor are lent out.\nKept close in winter, so you do not see her... Behind the tribe followed by foals.'\nDabi'ah al-Qaysi said:\n'May Allah reward *Al-Agharr* a truthful reward... When the fire of wars is kindled.\nHe protects me with the breast and shoulders... And I protect him with spear-joints.\nI keep him warm if a north wind blows... Damp, cold, after the south wind.\nI show him as family when the shepherds... Strive to gather the milking camels!'\nAl-A'raj al-Ma'ni said:",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 43
  },
  {
    "serial_number": "6786044",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "'I see the mother of Amr (his wife) ceaselessly complaining... Blaming, and I do not know for what she grieves.\nShe blames that I grant *Al-Ward* (the horse) a milk-camel... While she and Al-Ward are not equal in the hour of panic.\nIf she stands bare-headed, brisk... With a terrified heart, her head uncovered.\nAnd I stood by him with the bridle and his saddle... There he rewards me for what I used to do.'\nMakhul bin Abdullah al-Sa'di said:\n'You blame for tying steeds and confining them... While Allah advised the Prophet Muhammad regarding them.\nLeave me be, and count among your dependents a shapely mare... Dark bay, wind-swept in the flanks, long-necked.\nWhen it is said \"Hold him\" while his water (energy/sweat) overflows... He refuses, and throws the boy far away.'\nAl-Quhayf bin Humayr al-Uqayli said:\n'We allied with swords and standing horses... They and the family are equal among us.\nBarley is her provision, and a little dried clover... And from the water of iron she has shoes.'\nA man from Banu Tamim said, when the King asked him for a mare named *Sakab* and he refused him:\n'May you avoid the curse! Indeed *Sakab* is a precious object... Neither lent nor sold.\nRansomed and honored among us... The family goes hungry for her, and she does not starve.\nDaughter of two winners who produced her... If their lineage is traced, the cannon bone joins them.\nSo do not covet... May you avoid the curse, in her, for withholding her is a thing possible.'\nAl-Akhnas bin Shihab al-Taghlibi said:\n'You see the tethered horses around our tents... Like the goats of Hijaz surrendered to the pens.\nThey are given evening drinks of milk and morning drinks like it... While they are lean from running, tucked up.'\nJa'far bin Abi Kilab said:\n'Seek from me what you wish, for I... And *Hadhfah* are like the bone stuck in the jugular vein.\nI tend to her myself or with a portion... And I cover her with my cloak in the frost.\nI ordered the two shepherds to prefer her... With the milk of the free camel and the rising one.'\nMalik bin Nuwayrah said:\n'If scoundrels waste their horses in drought... And do not ride until the summer grazing grows.\nMy medicine for the hangover and my craft suffice me... At a time when a feeder cannot afford horses.\nI distract my family from their little belongings... And give her pure milk of camels while the tribe calls out.'\nAbu Duwad al-Iyadi said:\n'The love of horses attached to my heart while poor... And when abundance returned to me.\nMy ambition attached to them, so poverty... Does not prevent the reins from me.\nA shield for me in every day of betting... I gathered the nails/armor in its betting.\nAnd my stripping with them towards my enemy... And traveling the lands and journeying.'\nAl-Akhtal said, and it is attributed to Abdullah bin Abbas:\n'Love horses and be patient regarding them... For in them is glory and beauty.\nIf people waste horses... We gather them so they share with the children.\nWe share living with them every day... And we dress them in veils and covers.'\nAmong the single verses on this are what will be mentioned by Allah's power:\nAmr bin Malik said:\n'And a winner like the eagle of darkness, I place him... Before the family; he has preference and kindness.'\nAmir bin al-Tufayl said:\n'Horses have days, so whoever is patient for them... And knows their days, goodness will follow.'\nAl-Rab'i said:\n'I said to my people: Honor horses, for I... See horses have gathered the distant ones to us.'\nTarafa said:\n'We hold horses against what is disliked... When none holds them but the patient.'\nLabid said:\n'Our sanctuaries to which we seek refuge... Are the daughters of Awaj (horses) and swords.'\nSome said, which is a versification of a Hadith of the Prophet, may Allah bless him and grant him peace:\n'Goodness, as long as a sun rises and sets... Is suspended, tied to the forelocks of horses.'\nPoetry in this meaning is abundant. As for what is composed describing them, their traits, and similes, it is countless for Arabs and others. With the completion of this chapter, the discussion on horses is done. Let us speak on what we stipulated regarding weapons, by Allah's power.\n\nChapter Fifteen\nMentioning Swords\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever girds a sword in the path of Allah, Allah clothes him with the scarf of dignity.\" Ali bin Abi Talib, may Allah be pleased with him, said: \"I heard the Prophet, may Allah bless him and grant him peace, say: Indeed, Allah boasts to His angels of the girded one (with a sword). And they pray for him as long as he remains girded with his sword.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 44
  },
  {
    "serial_number": "6786045",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "Al-Ahnaf bin Qais said: \"The Arabs will remain Arabs as long as they wear turbans, gird swords, and do not consider forbearance a disgrace.\"\nThe Messenger of Allah, may Allah bless him and grant him peace, had a number of swords. Among them was *Dhu al-Faqar* (The Vertebrate/Cleaver), which he took as spoil on the day of Badr; it belonged to Munabbih bin al-Hajjaj. Among them was *Al-Adb* (The Sharp), which he had given to Sa'd bin Ubadah. Among them were *Al-Battar* (The Severing), *Al-Mikhdham* (The Cutting), *Al-Rasub* (The Sinking), and *Al-Hatf* (Death). He had a *Qala'i* sword he acquired from the weapons of Banu Qaynuqa'. He had another sword inherited from his father. These are a collection of his swords, peace be upon him, as mentioned.\nIt was narrated that Ukasha bin Mihsan fought with his sword on the day of Badr until it broke in his hand. He came to the Messenger of Allah, may Allah bless him and grant him peace, who gave him a tree stump/root and said to him: \"Fight with this, O Ukasha!\" When he took it from the Messenger of Allah, peace be upon him, he shook it, and it returned as a sword in his hand, long in stature, strong in blade, white in iron. He fought with it until Allah granted victory to the Muslims. That sword was called *Al-Awn* (The Aid). It remained with him witnessing battles with the Messenger of Allah, peace be upon him, until he was killed in the caliphate of Abu Bakr, may Allah be pleased with him.\nIt was narrated that Abdullah bin Jahsh's sword broke on the day of Uhud, so the Messenger of Allah, may Allah bless him and grant him peace, gave him a palm branch (*Urjun*); it became a sword in his hand with the hilt made of it. It was called *Al-Urjun*. It continued to be passed down until it was sold to Bugha the Turk.\nThe Arabs used to say: \"The sword is the shadow of death and the saliva of doom.\" They used to nickname it *Abu al-Wajal* (Father of Dread). Among their proverbs regarding it is their saying: \"The sword preceded the censure.\" And their saying: \"The sword erased all that Ibn Darah said.\"\nSome said: The sword is the protecting companion, the loyal friend, and the swift messenger. Abu Tammam al-Ta'i said:\n\"The sword is more truthful in tidings than books... In its edge is the boundary between seriousness and play.\nWhite pages (blades), not black pages (books)... In their texts is the clearing of doubt and suspicion.\"\nThe sword suffices for others, but others mostly do not suffice for it. It performs the work of all weapons. Jami' al-Muharibi said: \"If sword meets sword, choice is removed.\" Abu al-Tayyib (Al-Mutanabbi) said:\n\"I belittled the Rudayni (spears) until I abandoned them... Until it was as if the sword was reviling the spear.\"\nIt is said that the Arabs used to thrust with it like a spear, strike with it like a club, cut with it like a knife, make it a whip and a goad, take it as beauty in company, a lamp in darkness, comfort in loneliness, a companion in the void, a bedfellow for the sleeper, and a friend for the traveler. They name it a cloak (*Itaf*), a sash (*Wishah*), a staff, a robe, and a garment. It is the judge of combat and the decisive arbiter between men. With all that, poems were written, and proverbs and stories came to be.\nUtbah bin Abd al-Sulami said: The Messenger of Allah, may Allah bless him and grant him peace, gave me a short sword and said: \"If you cannot strike with it, then thrust with it.\"\nAn Bedouin asked two of his sons which swords were most beloved to them. One said: \"The polished *Husam* (sharp), the severing *Mikhdham* (cutter), the piercing *Sitam* (blade), the slender *Simsam* (unbending), which if you shake it does not dim, and if you strike with it does not bounce back.\" He said to the other: \"What do you say?\" He said: \"Excellent sword he described! But another is more beloved to me.\" He asked: \"What is it?\" He said: \"The sharp *Husam*, the shining *Rawnaq* (luster), the thirsty, hungry one! Which if you shake it tears, and if you strike with it kills!\" He said to them: \"Tell me about the most hated swords to you?\" One said: \"The blunt *Futar* (dull), the one bouncing off flesh and bone, which if struck with does not cut, and if slaughtered with does not avail.\" He said to the other: \"What do you say?\" He said: \"Wretched sword he described! But another is more hated to me.\" He asked: \"What is it?\" He said: \"The filthy *Dadan* (blunt), the despised wood-cutter (*Mi'dad*), which if struck with does not spill blood, even if you force it.\" *Al-Sitam*: The edge of the sword or other. *Al-Futar*: The one that does not cut.\nIt is narrated that Umar bin Al-Khattab, may Allah be pleased with him, said one day: \"Who is the most generous of the Arabs?\" It was said: Hatim al-Ta'i. He asked: \"Who is their poet?\" It was said: Imru' al-Qais. He asked: \"Which of their swords is sharpest?\" It was said: The *Samsamah* of Amr bin Ma'd Yakrib al-Zubaydi. He said: So Umar sent to Amr to send him his sword known as *Al-Samsamah*. He sent it to him. When he struck with it, he found it less than what was reported to him; so he wrote to him about that. He replied: \"I only sent the sword to the Commander of the Faithful; I did not send him the forearm that strikes with it.\"",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 45
  },
  {
    "serial_number": "6786046",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Al-Haytham bin Adi said: When the sword of Amr bin Ma'd Yakrib, called Al-Samsamah, came into the possession of Musa al-Hadi, he called for it. It was placed before him and unsheathed. Then he said to his chamberlain: \"Permit the poets to enter.\" When they entered, he ordered them to compose poetry about it. Anas began saying:\n\"The Samsamah of Al-Zubaydi was possessed... To the exclusion of all people, by Musa the Trustworthy.\nThe sword of Amr, and it was in what we heard... The best upon which scabbards were ever sheathed.\nGreen of blade, between its edges is light... From a wavy pattern (*Firind*) in which eyes extend.\nThunderbolts were kindled upon it as fire... Then sudden death was mixed with it.\nWhen you unsheathe it, it dazzles the sun... With light, so it can hardly be seen.\nAs if the pattern (*Firind*) and luster flowing... On its two flat sides is flowing water.\nAs if death is suspended from it... So it is death from all its sides.\nYes, the miracle of the angry one in war... When he assaults with it, and what an excellent companion.\nIt does not care who unsheathes it for a strike... Whether a left hand assaulted with it or a right.\"\nHe said: So he ordered a purse of gold for him. It was said: He gave him the sword, then bought it back later for fifty thousand dirhams.\nIt is narrated that Urwah bin Al-Zubayr asked Abdul Malik bin Marwan to return the sword of his brother Abdullah bin Al-Zubayr. He brought it out to him among a collection of unsheathed swords. Urwah took it from among them. Abdul Malik said to him: \"How did you recognize it among these swords?\" He said: \"By the saying of Al-Nabigha:\n'There is no fault in them other than that their swords... Have notches in them from clashing with battalions.\nThey were inherited from the times of the Day of Halimah... To this day, they have been tested with every trial.'\"\nThe King of the Romans sent three swords to Harun al-Rashid with great gifts. On each sword was an inscription. The first: \"O Fighter! Charge and you will gain spoils; do not think of the consequence or you will be defeated.\" On the second: \"If the blow of your sword does not reach, extend it by casting fear.\" On the third: \"Deliberation in what is feared to be missed is better than haste to achieve hope.\"\n\nSection\nThe sword has many names and descriptions in the Arabic language. From its names: *Al-Junthi*. Abu Ubaidah said: The *Junthi* is of the finest iron. It is said: The *Junthi* is the blacksmith who made them, so they were attributed to him. That which was forged in the land of India is attributed to it, so it is said: *Hindi*, *Muhannad*, and *Hunduwan*. Likewise, *Yamani* is attributed to Yemen. *Al-Qala'i* is attributed to Al-Qalah (a place), and it is said it means the white one, making it a descriptive name. *Al-Qasusi* is attributed to Qasus: a mountain containing an iron mine. *Al-Mashrafi* is attributed to Al-Masharif, which are villages in the land of the Arabs near the countryside. *Al-Surayji* is attributed to Surayj: a blacksmith who used to make them. From names of its qualities: If it is wide, it is *Safihah* (Plate). If it is slender and refined, it is *Qadib* (Rod). If it is polished, it is *Khashib*; it is said: the one that has not been polished; it is also said: the one whose making was not perfected despite hardness and effectiveness. If it is thin, it is *Mahw*. If it has grooves recessed in its blade, it is *Mushattab* and *Mufaqqar*. Its grooves are its *Shutab* and *Fiqar*. By that, the sword of the Prophet, peace be upon him, and the sword of Ali, may Allah be pleased with him, were named. It is said that *Dhu al-Faqar* is what has an edge on one side, and its other side is blunt, not cutting. By that, the sword of Amr bin Ma'd Yakrib, Al-Samsamah, was known. If its two edges are male iron (steel) and its core is female (soft iron), it is *Mudhakkir*; this is the description of the Frankish sword. The Arabs claim it is the work of the Jinn; it is more durable for striking at the start, whereas the Indian sword might break at the start, though it is better for the edge. If it has a sparkle, it is *Ibriq*. If, due to its hardness, clarity, and good polish, the blood of the struck does not stick to it, it is *Islit*. If time has been long on it and its edge is chipped, it is *Qadim*. If it is dull in cutting, it is *Kaham* and *Dadan*. If there is a mark in its blade, it is *Ma'thur*. If it is for menial tasks like cutting trees, it is *Mi'dad*. If it is for flesh and bones, it is *Mi'dad*. From names describing its edge: If it is a cutter, it is *Miqsal*, *Mikhdal*, *Mikhdham*, *Juraz*, *Batir*, *Adb*, *Husam*, *Qadib*, and *Hudham*. All these names are taken from the speed of cutting. If it penetrates bones, it is *Musammim*. If it is stern and nothing bends it, it is *Samsam*.\n\nSection: On names of its parts",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 46
  },
  {
    "serial_number": "6786047",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "*Jawharuhu* and *Athruhu*: Its pattern (*Firind*) that appears like water in it, imagined by the viewer to be flowing when shaken. *Dhubabuhu*: The tip of its blade. *Dhubatah*: Above the tip. *Ghirarahu*: Its two edges, which are its *Shafratan*. *Amuduhu*: Its middle. *Matnuhu*: Its entire blade. *Ri'asuhu*: What is other than its blade (hilt assembly). *Qabiduhu*: The handle for the striker's hand, which is its *Qa'im*. *Al-Sunbulah*: What enters from the blade into the hilt, also called *Al-Sinkh*. *Al-Saylan*: Flank the *Sinkh*. *Al-Qabi'ah*: The head of its hilt (pommel). *Al-Sha'irah*: What holds it. regarding names of scabbard parts: It is *Jafnuhu*, *Khillatuhu*, and *Khilaluhu*. It is said: *Khilal* are leathers inside the scabbard. *Hama'iluhu*: What it is suspended by, singular *Hamalah*, also called *Nijaduhu*. *Kalbuhu*: A ring containing its straps. The poet said in a riddle about this:\n'Many a walker (*Sayr* - strap) I saw in a dog's (*Kalb*) mouth... The dog was made a beauty for the Emir.'\n*Al-Siyah*: The ends of the *Hama'il* straps. *Sarabuhu*: Protection for the blade entry into the scabbard made of silver, iron, or otherwise. *Tha'latuhu*: Protection for its tip and edges (chape). *Al-Qirab*: A pouch (*Jirab*) like a sheath in which the sword with its scabbard is placed.\nFrom the poetry about the sword: Tarafa said:\n'I swore my flank would not cease to be a lining... For a sharp, polished, double-edged Indian sword.\nA trustworthy brother who does not turn away from a strike... If it is said: \"Gently,\" its restrainer says: \"Done!\"\nA sharp sword (*Husam*); if I stand victorious with it... The first blow suffices, no need to return; it is not a wood-cutter (*Mi'dad*).\nIf people rush for weapons, you find me... Protected, if my hand is wet with its hilt.'\nIbn al-Mu'tazz said:\n'I have a sharp sword in which deaths are hidden... Not unsheathed except to spill blood.\nYou see upon its flat sides the pattern (*Firind*) as if... It is the remnant of a cloud thinning below the sky.'\nAl-Alawi said:\n'As if on its pattern (*Firind*) are waves of a deep sea... Shortening at its edges and lengthening.\nAs if ants' eyes were broken around it... Eyes of locusts among them are vengeances.\nA sharp sword (*Husam*) on the morning of terror, until it is... A messenger from Allah seizing souls.\nIt does not care who unsheathes it for a strike... Whether a left hand assaulted with it or a right.'\nIbn Abd Rabbih said:\n'Possessor of grooves (*Shutab*), death decrees by its ruling... And there is no repelling what death decrees.\nA pattern (*Firind*); if it appears to the eye it is stagnant... And lightning if it shakes in the palm, shining.\nIts drawing pulls out the souls of warriors... Death is terrified of it, yet Death is terrifying.\nIf its likes meet in a battle... There, the soul's suspicion of the soul becomes reality.'\nIbn al-Zaqqaq said:\n'Thirsty, drinking the water of necks... Yet what it drinks does not quench it.\nYou imagine it unsheathed lightning... And a star or a torch blazing.\nHe sent in war a flame of it... The war-hardened hero burns in its blaze.\nA flat side vies with water... And a cutting edge kindles fire for it.\nCrowned with its pattern as jewels... Plundering souls and not plundered.\nIts scabbard smiles from its flat side... As moss clears from its water.'\nAnother said:\n'And an Indian sword, the pattern (*Firind*) roamed in its blade... So the fire of death ignited in its edge.\nIt almost drowns its bearers with its water... And almost burns its wielder with its fire.'\nAbu al-Ala al-Ma'arri said:\n'Were it not for the thinness in your sword... We would have said it feigned grief falsely.\nDescendant of fire, it thinned and refined until... As if its father bequeathed it tuberculosis (wasting).\nAdorned in cloak (scabbard), you think it wearing... The stars of the night and shod with the crescent moon.\nResiding in the blade are two contradictory extremes... Their contrast is a confusion.\nYou see upon it shallow water... And you see in it fire igniting.\nWhen the Emir sees it and has unsheathed it... In the high air, he thinks it a mirage.\nRed deaths crept upon it... But then were transformed into ants.\nThe terror of it melts every sharp sword... Were it not for the scabbard holding it, it would flow.\nWhoever has a friend other than a sword... Will find imbalance in his friendship.'\nAbu al-Abbas al-Tutayli said about swords:\n'Thirsty (*Him*), arriving to drink (*Wirad*); if water shook hands with them... It would slip or move away from them while it is thirsty.\nThe spilled blood almost creates them... So do not say they are idols and statues.\nDead! If they take off their eyelids (scabbards) you know... That armor on heroes are shrouds.'\nOne of the best things said describing a sword is the saying of Habib bin Aws (Abu Tammam):",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 47
  },
  {
    "serial_number": "6786048",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "'They (swords) were alert like the sword; if two hands did not unsheathe it... Its edges would have unsheathed it from the scabbard.'\nFrom exaggeration in describing it is the saying of Al-Nabigha:\n'It cuts through the double-woven Saluqi (armor)... And strikes sparks of fire from the stones.'\nThe sayings of poets about the sword are very numerous, and what we have mentioned is sufficient.\n\nSection\nA condition of the sword is that it should not be unsheathed except when striking with it; if unsheathed before that, it causes cowardice. No weapon requires caution when working with it like the sword. Many who worked with it without caution or training were found to hit their horse's ear or upper arm, or perhaps hit their own ear or leg, cutting it or injuring it. If the knight wants to work with it, he should tip his foot in his stirrup so nothing appears of it beyond the front of the stirrup, according to what allows him to rely on it. He strikes with the sword outwardly (*Nafhan*) and crosswise (*Shazran*). Except what is directly in front of his face; then he must be most cautious for himself and his horse. Let him raise his hand when striking as much as possible to the outside; thereby he is safe. Let him cast his opponent to his right always in every case, especially the lancer. Whoever wants to learn it and train in striking should take a wet reed or wet rod, fix its base in the ground, secure it, then move away from it, place it on his right, and run his horse at full speed. When he approaches it, he unsheathes his sword with speed, caution, and lightness, and strikes (*Nafh*) what aligns with his head of that rod or reed, or strikes it crosswise (*Shazr*) with finesse and lightness. He does this repeatedly, cutting in every run as much as he can, until about a cubit remains. He persists in the work until it becomes a habit for him and working with it becomes light, God willing. *Shazr* is striking with it right and left, and *Nafh* is to the outside right.\n\nChapter Sixteen\nMentioning Spears\nThe Messenger of Allah, may Allah bless him and grant him peace, said: \"Stick to spears (*Qana*) and bows, for with them your Prophet was aided and conquests were made for you in the lands.\" *Qana* means spears. The Messenger of Allah, may Allah bless him and grant him peace, had four spears: a spear called *Al-Muthanni*, and three he acquired from the weapons of Banu Qaynuqa'. The Arabs used to say: \"The spear is the rope of death.\" Among their proverbs regarding it: \"You reminded me of thrusting while I was forgetting.\" An Bedouin asked two of his sons which spears were most beloved to them. One said: \"The flexible straightened (*Muthaqqaf*), the straight lean (*Mukhattaf*), which if you shake it does not bend, and if you thrust with it does not break.\" He said to the other: \"What do you say?\" He said: \"Excellent spear he described! But another is more beloved to me.\" He asked: \"What is it?\" He said: \"The dried vibrating (*Assal*), the straight quiverer (*Nassal*), the penetrator if you shake it, the effective if you spur it.\" He said: \"Tell me about the most hated spears to you?\" One said: \"The crooked (*A'sal*) in thrusting, the notched at the spearhead, which if you shake it bends, and if you strike with it breaks.\" He said to the other: \"What do you say?\" He said: \"Wretched spear he described! But another is more hated to me.\" He asked: \"What is it?\" He said: \"The weak to shake, the dry rigid (*Kazz*), which if you force it shatters, and if you thrust with it snaps.\" *Al-A'sal*: The twisted/crooked one. Some said: Spears are the high ones (*Awali*), the brown ones (*Sumr*), the busy ones (*Hawali*), the horns of horses, the ropes of hearts and livers; by them souls are sought (*Tustamah*), and private parts and gaps are violated. They were created like vipers, for the gaps of throats; the one safe from them is excused, and the wounded by them is terrified. From their saying regarding that:\n'How many a virgin have our spears married to us... And how many a previously married woman have become lawful to us without being divorced.'\n\nSection\nFrom their names in order: *Al-Anazah*, which is a staff larger than a club (*Hirawah*) having a ferrule (*Zujj*); it is a weapon because one can thrust with it, and the ferrule in it resembles a spearhead even if it isn't one. Then *Al-Nayzak*, which is longer than the *Anazah* and has a thin spearhead; plural *Nayazik*; similar is *Al-Mitrad*. *Al-Mizraq* is likewise because it is thrown due to the fineness of its shaft; its head might be square and fine for piercing armor and the like. If its length increases and it has a wide head, it is *Harbah* and *Allah*; plural *Hirab* and *Ilal*. *Al-Khurs* is among the short spears, plural *Khursan*. If it is solid, it is *Mid'as* used for thrusting (*Da's*), plural *Mada'is*. The longest is *Al-Rumh* and *Al-Qanah*.\n\nSection: On names of their qualities and lineages",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 48
  },
  {
    "serial_number": "6786049",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "If the shaft grew straight and did not need straightening (*Tathqif*), it is *Sa'dah*. If it needed straightening, it is *Muthaqqaf*. If the spear is agitated, it is *Asil*. If intensely agitated, it is *Assal* and *Arras*. If it is soft/flexible, it is *Ladn*, *Dhabil* (dried/tough), and *Marin*. If it is strong, it is *Samhari*. If it is solid and does not bend, it is *Sadq*. If it is notched, it is *Thalib*. *Al-Khatti* is from Persian reeds, attributed to *Al-Khatt*: a land in Persia where they grow. *Al-Yazani* is attributed to Dhu Yazan: one of the kings of Yemen. *Al-Rudayni* is attributed to Rudaynah: a woman who used to make them, or it is said they were sold at her place. *Al-Asmar* (The Brown) is *Al-Azma* (The Thirsty), taken from thirst. *Al-Lahdham* is the penetrating spearhead. The wide spearhead is *Al-Minjal*, from *Najal*, which is widening; a *Najla* wound means wide. *Al-Washij* is the place where spears grow; it is said: they are the spears themselves. *Al-Murran* are spears, singular *Murranah*; it is said: *Murran* is where they grow.\n\nSection: On detailing the parts of the spear\n*Sinanuhu* (head), *Nasluhu* (blade), *Qurunuhu* (horns/edges). *Shafratuhu* (blade). Its tip is *Sa'ibatuhu*. *Dhubatahu* and *Shafratahu*: its two edges; likewise *Ghirarahu*. *Ayruhu*: The ridge in its middle. *Al-Jubbah*: The socket of the tang into the blade. *Al-Tha'lab* (The Fox/Tang): What enters from the shaft into the socket. *Al-Mihwar*: Its rivet/nail. *Zafiratuhu*: Its top. *Sadruhu* (Chest), *Aliyatuhu* (High part), *Amiluhu* (Working part): that is up to a third of it. Then *A'iduhu*, and *Amuduhu* (Pole): Its middle. Then *Saquhu* (Shank), *Safilatuhu* (Lower part), *Aqibuhu* (Heel), *Ka'buhu* (Ankle). Then *Zujjuhu* (Ferrule) and *Markazuhu* (Center/Base), which is the iron at its bottom if sharp; otherwise it is its *Halqah* (Ring). *Anabib* (Tubes) of Indian spears and their *Ku'ub* (Nodes): What is between their knots, which are their grooves (*Huruz*) and sections (*Fusul*). *Qisad* of spears: Their broken pieces and fragments, singular *Qisdah*.\n\nSection: On the manner of riding with a spear\nThat is for the man to take his spear in his right hand, his rein in his left with the pommel of his saddle, place the butt (*Zujj*) of his spear on the ground—let him distance it slightly—place the ball of his left foot in his left stirrup, then rely on the spear, lift himself onto his horse, rising while rotating the spear over the horse's croup to the right side until he is upright quickly; then place the spear in his left hand with the rein, straighten his clothes and equipment with his right, then move the spear to his right. If he is in a desert and no person is near whom he fears the spear might hit, nor a tree it might get stuck in, let him take, if he wishes, the middle of the spear with his left hand along with the rein and mane if he sees that, or the pommel if he took the mane with his left or there is no mane, and take the cantle with his right, or the pommel if he took the mane with his left, and mount. A man should not attempt to pick up his spear from the ground while riding, for the horse might step on it and break it, or hit it and push it away; rather, let him dismount, take his spear, and mount as I described. As for dismounting with the spear, it is to take it in his left hand, place its butt on the ground near his horse's left leg, take the pommel with his right hand, then dismount. When he reaches the ground, he takes his spear with his right hand quickly, lest the horse turns on him and smashes it, or hits the ground with its head, or wounds someone. Let him pay attention to all this.\n\nSection\nWhoever wants to learn working with the spear and training in that should set up a *Dari'ah* (quintain/target), which is a stick or similar standing in the ground the height of a rider, secured at the bottom, with a ring or twisted rope resembling a ring tied at its top. Then move away from it, run his horse at full speed. When near that *Dari'ah*, tuck the spear under the armpit, extending from the armpit as much as is light to carry and his strength allows, then catch that hanging object with his spearhead. Then twist the spear quickly to free the head from the ring. He might need to flip his spear behind him, or penetrate the ring and catch his spear (*Laqfan*) from behind it. Perhaps the ring rotates wherever he turns it. Persist in practicing this however possible, until the work becomes light. He will not miss the mark, God willing. As for how to hold it during an encounter, thrusting with it, and disengaging after that, that requires explanation, length, and visual observation too, due to its many conditions and differing modes and ways. The knight should lighten his spear as much as he can, for he is stronger, more controlling, and more precise with a light one, according to his strength and tolerance. The spears of knights were ten cubits; less than that is permissible.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 49
  },
  {
    "serial_number": "6786050",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "It should be between thin and thick, an amount the hand is not incapable of nor fingers meet over (too thin). Medium is praiseworthy, according to hand size and capability. Among the poetry about the spear is the saying of Al-Ma'arri:\n'Possessor of thirst though it has no life... Certain of its bearer's length, so it grew tall.\nIt imagined every coat of mail a pool... So it dipped seeking to enter the rings.\nYou filled chests of people with it... So they found distraction from their grudges.'\nAmong the most creative sayings about it is the saying of our Sheikh, the Judge and Sharif Abu al-Qasim al-Hasani, may Allah have mercy on him:\n'Deaf, extended in nodes, if it demands... The souls of warriors, its debt is not delayed.\nBurning, until I say: Is it withering... In my hands, or is it a lit wick?\nWere it not for the inflammation of the blade, its wood would ripen... From what it drinks of blood and sips.\nSo wonder at it, for the blood on its tip... Is ash (*Ramad*), yet a killing place is not hidden from it.'\nPoetry about it is abundant.\n\nChapter Seventeen\nMentioning Bows and Arrows\nAllah Almighty preferred the bow over all weapons, and made engaging in its matters a profitable trade and successful opinion. From the Messenger of Allah, may Allah bless him and grant him peace, that he said: \"People have not extended their hands to any weapon but that the bow has superiority over it.\" He, peace be upon him, said: \"Whoever keeps a bow in his house, Allah banishes poverty from him as long as it is in his house.\" He, peace be upon him, used to give sermons during war leaning on his bow. He, peace be upon him, said: \"The ultimate for the believer is the bow and arrow.\"\n\nSection\nEncouragement for archery is abundant. From Uqbah bin Amir, he said: I heard the Messenger of Allah, may Allah bless him and grant him peace, while on the pulpit saying: \"{And prepare against them whatever you are able of power}, Beware! Indeed, power is shooting (archery).\" He, peace be upon him, liked a man to be an archer, a knight, and a swimmer. He, peace be upon him, said: \"Teach your sons shooting, for it is damage to the enemy.\" He, peace be upon him, said to a group of Ansar he saw shooting: \"Shoot, O sons of Ishmael! For your father was an archer.\" He, peace be upon him, said: \"Whoever shoots an arrow in the path of Allah, missing or hitting, has a reward like freeing a slave from the children of Ishmael.\" He, peace be upon him, said: \"Allah enters three people into Paradise by one arrow: its maker seeking good in its making, the one shooting it, and the one handling it to him.\" From Ali bin Abi Talib, may Allah be pleased with him, he said: I never heard the Messenger of Allah, may Allah bless him and grant him peace, ransom anyone except Sa'd bin Abi Waqqas; he said to him on the day of Uhud: \"May my father and mother be your ransom.\" On that day, the Messenger of Allah, peace be upon him, said to Sa'd, Abu Talha, Qatadah and others of the archers: \"Stand firm! Victory will not cease to be with us as long as you stand firm.\" The number of archers that day was fifteen. Hadiths in this meaning are too many to count. How excellent is the poet when he says:\n'Whoever wishes to walk the paths of care... And obtain glory at the end\nAnd gain every abundant reward... Let him not bypass the path of archery\nFor in it is elevation in the worlds... And victory for the religion of the Prophet of Guidance.'\n\nSection\nThe Messenger of Allah, may Allah bless him and grant him peace, had a bow made of *Nab'* wood called *Al-Safra'* (The Yellow), a bow of *Shawhat* called *Al-Rawha'* (The Pleasant/Wide), another bow of *Shawhat* called *Al-Bayda'* (The White), and another bow called *Al-Katum* (The Silent). Bows are of two genera: Hand Bow, which is the Arab bow, divided into types; and Foot Bow, which is the Frankish bow (Crossbow), likewise divided into types. The Arab bow is more suitable for the knight, because it is faster and less burdensome; the Frankish bow is more suitable for the foot soldier, because it is more effective and offers more aid, especially in sieges, naval ships, and the like. It is specific to the people of Andalusia; with it they hunt, from it they shoot, in it they compete, and on it they rely, knights and men. It is the one we describe here, God Almighty willing.\n\nSection",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 50
  },
  {
    "serial_number": "6786051",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "This bow—meaning the Frankish one (Crossbow)—is composed of a Stock (*Amud*), a Lath/Prod (*Qadib*), a Nut (*Jawzah*), and a Trigger (*Miftah* - Key). The stock was previously called the Runner (*Majra*), named so because arrows run on it. Its trigger used to protrude from the nut side, shooting several arrows, inclusive. Then this wood (design) was extracted in the time of Nimrod, and named *Amud* (Column/Stock) because it was relied upon. It has six holes: the hole of the *Mashrab*, the hole of the *Halq* (Throat) which is for loosening and binding; loosening and binding are for seven things: rubbing, washing, sawing, twisting, injecting, lifting, and descending. The third hole is for six, which is the hole of trust and deposit. The fourth hole is for the *Jawzah* (Nut), which is the hole of the lock, drinking, and leadership. The fifth hole is for the nail, which is the hole of assignment, bearing, and equipment. The sixth hole is for the *Miftah* (Key/Trigger), which is the hole of movement, form, and secrets. From it the craft opens, and it is its spirit and meaning. The *Qadib* (Prod) was named *Qadib* because it joins/marries in five places: a place in its middle, and four places at its ends. It has two strings: war string, and practice string (*Uwayr*?). The *Jawzah* was named nut for the passage of the mover, speaker, and silent over it. The name of the Nut is: The Heart, because the head of the Key turns in it. In it is a secret and in the Nut another; if they gather, wisdom appears. The Key was named Key because it opens the secrets of all we mentioned.\n\nSection\nThe secrets of the bow are in seven things: an animal that reasons, which is the Archer; and disconnected from an animal that does not reason, which are the Fletching, Wax, Nut, Prod, and Arrow. These four attack when shooting, and one does not attack alone. It is said: The bow is taken from the circle, which is the perfection of craft; that is because when geometers looked at the sun, moon, and stars, they extracted it from them. The bow speaks with the tongue of condition, breathes like the breath of dawn, and is called a King because it possesses (dominates); when the archer puts it down, he fears it like the fear of a king when entering upon him, and others fear him likewise because of it.\n\nSection\nBows are selected from ten woods: five wild and five orchard. The wild: *Takhsh*, which is *Nab'* in Arabic, *Zanbuj* (Wild Olive), *Dardal* (Ash/Elm?), *Katam* (Privet/Boxwood), and *Shabar*. The orchard: Bitter Orange (*Naranj*), *Nisman* (?), Apple, Pomegranate, and Quince. Regarding that, some said:\n'Wonder at the noble bow, for it... Did not observe the right of the doves of the branches.\nIt became death for them having been a gathering place... And such is the ruling of the turning of times.'\nIbn al-Zaqqaq said:\n'My soul is ransom for a crooked *Nab'* bow... Enamored with the killing of enemies.\nIt was familiar with the pigeons of the thicket while fresh... And today it familiarizes them with the breaking of the \"Ha\" (death/Hammam?).'\nThese woods from which the bow is selected have sources in the North, South (Qibla), East, and West. For cutting them, there are two seasons: cut in the season of winter poisons (*Samum*), which is the chosen one, likened to a child whose breastfeeding is complete; and cut in the season of summer poisons out of necessity. The original is the best of rods, and what is cut in a season (other than winter?) is a deficiency in its right.\n\nSection\nKnow that the bow is strung/bound in two ways: by sight, which is the root, and by measurement, which is the branch. As for the people of knowledge in this, they are three: The *Arif* (Knower), the *Mu'allim* (Teacher), and the *Rami* (Archer). Each has a degree exceeding his companion. The Teacher exceeds the Archer in the flexibility of hands, and the Knower exceeds the Teacher in the light of the heart. They bind the bow by sight; if obscured, they measure with the *Dabit* (Caliper/Gauge). The description of measuring with it: Open the *Dabit*, open its tip into the lower edge of the Throat hole, then place the other tip at the edge of the end of the Breast (*Sadr*) of the Prod, then seek the other side with it. If the measurement is equal, it is the goal. If the tip of the *Dabit* exceeds the Breast edge, it is low, so raise it. If it falls short, it is raised, so lower it, until the measurement straightens for you. For binding it, two *Lazaz* (wedges/ties?) are necessary, of one measure of good young wood, with which the Prod is tightened after binding with a thong (*Samah*) of male deer skin, cut along the length of the skin, with an iron ring in which the left foot is placed when drawing (spanning), called for that reason a stirrup (*Rikab*).",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 51
  },
  {
    "serial_number": "6786052",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "If the Prod descends naturally into the Throat, turn your hand with it rising until it is at the beginning of the Rubbing (*Hakk*) and end of the Washing (*Ghasl*). Begin binding it and striking the two *Lazaz* (wedges): the rights before the lefts, lest there be a fault. Then string it and place the spanning belt (*Jabbad*) on your thin flank (waist), take the claw (*Mikhtaf*) with your left hand after saturating your right hand under the Trigger (*Miftah*), place it in the string, pull up with it, then drop it with the blessing of Allah. If the thumb exits from it, your exit is safe. Then turn the bow, transfer it to your left hand, mount the arrow, and shoot whatever you like.\n\nSection\nSome scholars of this affair said: Drop (the sear?) with forbearance, look with knowledge, and pinch (the trigger) with anger. It was said: Tighten the left, sharpen the gaze, and the effect of the matter has become valid for you. It was said: If the archer hits the target with his arrow, he kills a man in the enemy's land. If you shoot, accustom yourself to haste. It was recounted about a man of the Arabs that he stood over an advancing archer who was drawing his bow while looking! He said to him: \"What are you looking at?\" He said: \"Perhaps I will expose someone!\" He said to him: \"Shoot the arrow; it seeks its owner.\" The superior archer is the drawer (*Jarrar*), steady of gaze, quick in shooting. It was said: Height in archery is: Drawing, Shooting, and Boldness. These traits do not gather except in a few archers. Know that drawing the bow is dangerous in winter time, out of caution for the archer due to the stiffness of the bow, and caution for the Prod due to its brittleness. The Eastern Prod is suitable for winter, and the Western Prod is suitable for summer. If you are in winter time, place your bow in the sun until it becomes moist and flexible, then shoot with it. If it is a cold day, there is no way to do that except in war specifically. If you are in summer time, place it in a cool place until it cools, then shoot with it. The whole matter and blessing is in the pinching (*Qars*) of the Key (Trigger). Pinching has three modes: Some people's control is smooth, so their pinch is soft; some have a control in between, so their pinch is gradual. They are not equal in that. The conclusion is only the Pinch.\n\nSection\nKnow that the bow's ends do not equalize until the description is complete upon it. Beware of six qualities, for they are the head of error in this craft: The Rough String, for it decreases the shot and breaks the Prod. In the Prod: Emptiness, Fullness, Stopping, Wood under the Breast, and Thinning of the Tips. Among what is an obligatory duty for archers is the flax string for the bowstring. If you see a strong bow, do not draw it at all. If you walk in a raid, make the provisions heavy and weapons light, and increase the bow over all weapons. The light bow is the useful one in shooting. If you see people in the first clash, stand your ground until you see what happens; perhaps you will disperse those who reach the people with intensity. Let your arrows be of even workmanship, Gazelle-like assembly (*Ghazaliyah* - elegant?), thin feather housings, singular nocks. Beware of seven qualities. As for causes of the arrow returning to the archer, two are in the arrow: shortness of the nock, and warping forward. Two in the Nut: width of the groove, and height of the threshold. Three in the Prod: Emptiness, Fullness - mentioned before - and Washing (*Ghasl*).\n\nSection\nKnow that Archery is a craft, the Target is a fortune (*Sa'd*), so hitting the target is of fortunes. Know that the first of arrows is called *Dalil* (Guide), the second *Bani* (Builder), the third *Zahur* (Backer/Helper), the fourth *Talib* (Seeker), the fifth *Darib* (Striker), and the sixth *Sadd Dhari'ah* (Blocking the Means/Sealing). If you shoot the Guide and it comes above the mark, and you shoot the Builder and it comes below it, and you shoot the Helper and it comes right, and you shoot the Seeker and it comes left, then shoot the fifth, for it is the Striker as its name implies, as we mentioned. The sixth is the verified one, which is the Sealing of the Breach. Whoever shoots the six and does not hit with one of them, his shooting is premature/defective (*Khidaj*), so let him not undertake shooting ever. Whoever hits with two, his work is eased. Whoever hits with four has acquired much of the craft. Whoever hits the six has attained the degree of perfection, and entered into the invocation of the Messenger of Allah, may Allah bless him and grant him peace, for Sa'd bin Abi Waqqas, may Allah be pleased with him. The first arrow he shot in the raid of Badr al-Abwa'. These verses are from his saying regarding that:\n'Has it reached the Messenger of Allah that I... Protected my companions with the chests of my arrows?\nNo archer against an enemy counts... With an arrow, O Messenger of Allah, before me.\nI defend with them their first ones, a defense... In every rugged ground and every plain.\nThat is because your religion is a religion of truth... And Possessor of Right, you brought it with justice.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 52
  },
  {
    "serial_number": "6786053",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "'The believers are saved by it and disgraced... By it are the disbelievers at a place of respite.\nSo gently! You have erred, so do not blame me... O seducer of the tribe, woe to you, O Ibn Jahl!'\nIn the perfect arrow are praised qualities that adorn archery and strengthen the Rubbing, Washing, and Moving. The Sheikhs of this method said: The short is contemptible, the prominent is a knight, and everything has a beloved, and the beloved of the bow is the Just Arrow.\n\nSection\nKnow that the iron (arrowheads) are of seventeen types. Four are for hunting: *Zujj*, *Shilyat*, *Murjafli*, and *Mujannah*. Three for armor: *Sabt* (Smooth?), *Murabba' Tawil* (Long Square), and *Muthallath* (Triangular). Four for the shield (*Turs*): *Murabba' Qasir* (Short Square), *Qitral*, *Balluta* (Acorn), and *Shabri*. Four for the leather shield (*Daraq*): *Shilyat* (smaller than hunting), *Tamuh*, *Mijwaf*, and *Milhani*. Two for other meanings: *Bajuq* for cutting the rigging (*Bisht*?), and *Sahm al-Huma* (Arrow of Fever/Heat?) for piercing ships and wooden towers. Do not be without these mentioned types, and mark their nocks so they are known to you when you extend your hand to your quiver at the time of need to extract the one you want. It has been said: \"Before shooting, arrows are fletched.\" Speech in this chapter is long; if we followed the talk on bows, arrows, and shooting, we would exit the intended purpose of the authorship.\n\nSection\nFrom the poetry about the Bow:\n'I am the Bow, there is no doubt that I... Destroy lions in the pushing war.\nI decree upon heroes from of old... And in my liver (grip) are arrows of death.\nArrows nocked for me from an ambush... So woe to the warriors from the ambush.\nIf I nock my arrow, it is not met... By a shield, nor by a strong coat of mail.'\nAlso from that:\n'Ask the rings of the white armor (*Madhi*) about the edge of arrows... For they have notched the edge of spears and swords.\nThey inform you that when horses rush... I am the partner of deaths in the souls of battalions.\nIf the heroes hear my vibration in terror... You see them fall under the noble lean horses.\nAs if my vibration is the blowing of the Trumpet whenever... They listen to it, they fall prostrate on every side.\nIf the *Khatti* (spear) boasts that it resembles... The beauties bending in the figures of damsels,\nThen in the arrows of glances is a field for boasting... If you sought it, or in the bows of eyebrows!'\nAlso from that:\n'My arrows are penetrating into enemies... If the archer masters archery with me.\nI stand in his palm and my arrow goes... To a distance and reaches every limit.\nThe spear does not do like my deed... Nor the Indian sword in protection.\nI boasted over weapons with this. And my merit... If you think, has no end.'\nAlso from that:\n'Leave the *Khatti* (spear) bending its sides... For my arrows have a merit over it.\nIf high status is killing enemies... Is any better than the fastest of us to it?'\nPoetry about the bow is too abundant to mention. As for types of bows, they are different, their conditions varied, and working with them requires elaboration this summary cannot bear. Archery has well-known books and a famous craft; so let one look into them according to what suits him and is light for him. However, the pillar of the archer knight is: The well-trained horse, and the bow suitable for drawing on the horse. And success is by Allah.\n\nChapter Eighteen\nMentioning Armor\nAllah Almighty counted armor among the blessings He bestowed upon people. The commentators said regarding His saying Almighty {And garments to protect you from your violence}: They are coats of mail. Indeed, they repel dread as long as the appointed time is delayed. That is why Abbad bin al-Husayn said, when a man asked him: \"In which armor would you like to meet your enemy?\" He replied: \"In a delayed appointed time.\"\nThe Messenger of Allah, may Allah bless him and grant him peace, had armor called *Dhat al-Fudul* (Possessor of Excess/Length). He had another armor which, if hung by its rings (*Zarafin*), did not touch the ground, and if released, touched the ground. He, peace be upon him, did not witness war except with it. He had two coats of mail he acquired from Banu Qaynuqa'. One was called *Al-Sughdiyah*. It is said he had the armor of David, peace be upon him, which he wore on the day of killing Goliath. It is narrated that Luqman the Wise used to sit with David, peace be upon him, while David was making armor. Luqman did not know what it was and did not ask him about it. When he finished it, he wore it and said: \"It is indeed a fortress for a day of violence.\" Luqman then knew its purpose.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 53
  },
  {
    "serial_number": "6786054",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Section: On its names and descriptions\nAmong them are *Al-Junan* (Shields/Protections), and everything one protects oneself with is a *Junnah*. *Al-La'mah*: The complete armor that has excess length. If it is wide, it is *Za'fah*, then *Nathrah*, and *Nathlah*. Then *Fadfadah* if along with width it is long/full. If it is tight, it is *Sukk*. If it is soft, it is *Khadba'* and *Dilas*. If it is tightly woven and solid, it is *Qada'* and *Hasda'*. If it has a long tail, it is *Dha'il*. If it is white, it is *Madhiyah*; it is said *Madhiyah* means flowing like water, or easy and soft. Its nails are *Harabi*, singular *Hirba'*. The heads of its nails are *Qatir*, singular *Qatirah*, likened to the eyes of locusts. *Al-Muda'afah* (Doubled) is woven ring into ring two by two. Its rings are *Zarad*. If made of perforated plates, it is *Masrudah*. If woven/interlaced, it is *Jadla'*. If short, it is *Shalil* and *Badan*. If it is a breastplate without a back, it is *Jawshan*. *Al-Saluqiyah* is attributed to Saluq, a village in Yemen where it is made. *Al-Hutamiyah* is attributed to Hutamah; it is said he was a man from Abdul Qais bin Afsa. *Al-Fir'awniyah* is attributed to Pharaoh. *Al-Dawudiyah* is attributed to David, peace be upon him.\nFrom the poetry about armor, Al-Ma'arri said:\n'A pool (of mail) which the wind embroidered, an embroidery of a maker... It did not change when its stillness lasted.\nAs if young locusts drowned in it, without eyes... If a looker returns his gaze to distinguish it.\nNo land animal is safe in it... If its sword or ship does not aid him.\nIf a knight did not put it off for peace... Its folds would remain on him forever.\nIf the soul of the young man knew the day of his death... And met it in armor, its doom would not assassinate him.\nTrustworthy; if you entrust your body to it... And meet war, its trustee will not betray you.'\nAbdul Qais bin Khufaf said:\n'And a long coat of excellent armor... You hear a ringing from the sword on it.\nLike a pool the west wind drove... The heavily armed man drags its excess.'\nAbu Ishaq bin Khafajah said describing a man wearing armor:\n'Iron buttoned the pocket of a dove upon him... A grey one in the gloom of dark dust.\nAs if the skin of a snake was shed upon him... On the day of distress, over the sides of a speckled snake.'\n\nSection\nSome Arabs boast and praise wearing armor in war. Antarah al-Fawaris said:\n'Ubaylah wondered at a disheveled youth... Bare-knuckled, pale like a blade.\nDisheveled hair, his shirt worn out... He has not oiled himself for a year, nor dismounted.\nHe does not wear anything but iron... When he dresses; and such is every desperate warrior.\nHe has worn iron for so long that... The rust of iron on his skin is not washed off.'\nOthers praise the opposite, viewing armor as tiresome and distracting, and that storming war without armor is braver and faster in fighting. Al-A'sha said:\n'And when a gathered battalion comes... Silent, whose voracity the defenders fear.\nIts sides seek refuge in a praised (or dispraised?)... Hated (war) whose combat the heroes fear.\nYou were the leader, not wearing protection... Striking its heroes with the sword, making marks.\nAnd I knew that the soul meets its death... Whatever its Creator decreed for it.'\nMuhammad bin Muslim said praising a man:\n'He meets swords with his face and throat... And sets up his head in place of a helmet.\nAnd says to the side: Be patient for the points of spears... For I have wounded the corner of glory if you are not wounded!'\n\nSection\nFrom armor is *Al-Mighfar* (Coif), which is woven like the weaving of armor to cover the head and face. Ibn al-Mu'tazz said addressing a boy:\n'And when you stormed the war wearing armor... And masked your face with the Mighfar.\nWe considered your face the morning sun... Upon it a veil of amber.'\nWhat is made for the head from hollowed iron is *Baydah* (Egg/Helm). Its *Qawnas* is the protrusion of its front. Its *Da'irah* is its rear. Among names of the Helm are *Khudhah*, *Tarkah*, *Tarikah*, *Rabi'ah*, and *Khayda'ah*. Plural is *Khuwadh* and *Tara'ik*.\n\nChapter Nineteen\nMentioning Shields and Similar Items",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 54
  },
  {
    "serial_number": "6786055",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "*Al-Turs*: It is the round shield (*Mijann*), and upon it circles revolve. From Anas bin Malik, he said: Abu Talha used to shield himself with the Messenger of Allah, may Allah bless him and grant him peace, with one shield.\n\nSection\nAmong its names collectively: *Al-Tiras*, *Al-Jawb*, *Al-Fard*, *Al-Junan*, and *Al-Majann*. Singular: *Turs*, *Jawb*, *Fard*, *Mijann*, and *Mujna'*. If made of leather, they are *Daraq*, *Hajaf*, and *Yalab*. Singular: *Daraqah*, *Hajafah*, and *Yalabaha*. It is said *Yalab* are armor made of skin. It is said they are like the *Baydah* (helm) for the head specifically. It is said *Jahaf* are of wood. *Al-Daraq* are made of cowhide, wild animal hides, and *Lamt* hide; these are the best and most protective. *Al-Lamt* is an animal from the wonders of the Maghreb inhabiting deserts; shields are made from its skin. The property of the *Lamt* shield is that if hit by a sword or spear blow, the blow closes up and heals immediately and disappears, leaving no mark.\n\nSection\nThe shield bearer in combat must shield himself with the middle of his shield from sword, javelin, and stones, rotating it right and left outside his alignment, not sticking it to his body when he fears something hitting it. He defends himself and his horse by rotating it. Meeting a stone with the chest of the shield is better, and he should angle it so what hits it slides off. He shields from a spear with its entirety and bulk; if he feels the spearhead hit it, he angles it and deflects it from his body. Let him beware of relying on it with his body then lest it throws him down. Also beware when deflecting with it that the spearhead slips and catches his clothes. This amount is what should be maintained. Working with the *Daraqah* is exactly like working with the *Turs*. But the *Daraqah* catches the spear due to its humidity and level texture, so one must steal it (deflect quickly) and angle with it, lest it becomes heavy in the hand and impossible to work with. Riding with the shield has two cases regarding its length and shortness: If long, remove hand from its handle, take rein with left hand and ride; beware of it hitting the chin if it reaches it. If short, take it under the armpit and ride. Al-As'ad bin Balit said about a shield:\n'A shield whose makers imitated the sky... So that tall spears fall short of it.\nThey fashioned the likeness of Pleiades on it... Stars decreeing success for us.\nThey collared it with a collar of silver... Just as the light of morning clothed the horizon.'\n\nChapter Twenty\nWeapons and Equipment in General\nAcquiring weapons is an obligation of Jihad, due to the saying of Allah Almighty: {And prepare against them whatever you are able of power.} Ibn Abbas said: Power is weapons and equipment in the path of Allah. Acquiring that is for the capable according to his ambition and dignity of soul, in addition to the reward and recompense involved. Narrated from Abdullah bin Zajr that the Messenger of Allah, may Allah bless him and grant him peace, said: \"Whoever acquires equipment in the path of Allah, it is placed in his scale every morning.\" From Abdullah bin Shawdhab that the Messenger of Allah, may Allah bless him and grant him peace, said: \"The deeds of the son of Adam are displayed every Monday and Thursday; whoever increased in his weapons, increased in his good deeds, and whoever decreased his weapons, decreased in his good deeds.\" Equipment is among the causes of Decree (*Qadar*), and aids to Victory. As long as time permits... It was said to the Prophet, may Allah bless him and grant him peace: \"Do you see medicine we take and incantations we recite, do they repel anything of Allah's decree?\" He said: \"They are from the decree of Allah.\"\n\nSection\nThe Arabs used to say: The sword is the shadow of death, the spear is the rope of doom, arrows do not consult the one who sent them, armor is tiresome but a fortress, and the shield is a protection. Umar bin Al-Khattab, may Allah be pleased with him, asked Amr bin Ma'd Yakrib about weapons, saying: \"The Commander of the Faithful asks you about what appears to him!\" He said: \"What do you say about the spear?\" He said: \"Your brother, but perhaps he betrays you and breaks.\" He said: \"What do you say about arrows?\" He said: \"Deaths that miss and hit.\" He said: \"What do you say about the shield?\" He said: \"It is the circling protector, upon it circles revolve.\" He said: \"What do you say about armor?\" He said: \"Burden for the foot soldier, distraction for the knight, but it is a fortified fortress.\" He said: \"What do you say about the sword?\" He said: \"There your mother bereaves you! No mother for you!\" Umar hit him with the pearl (whip) and said: \"Nay, no mother for you!\" He said: \"The fever humbled me to you.\" Al-Alawi gathered the description of horses and weapons, doing well where he says:\n'Sufficient for me of wealth is a long-necked horse... Sound of shanks, bare of cheekbones, smooth-skinned.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 55
  },
  {
    "serial_number": "6786056",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "And a sword (*Muhannad*) whiter than iron water... And a brown spear (*Samhari*) vibrating, tall.\nAnd white armor like shallow water, loose, flowing... A striped baldric holds it to me.\nAnd a bow with bent tips, thick-handled, generous... Wide-sided, yellow *Shawhat* wood.\nO would that my wealth, other than what I gathered... Were on a deep sea whose waves crash.\nO would that I spend the night in time... With no commanding ruler over me.'\nAl-Ayyar al-Dabbi said in its meaning:\n'I prepared a white armor for wars and a polished... Double-edged sword that breaks rings.\nAnd a wide *Nab'* bow and a full quiver... Of arrowheads you would think were leaves.\nAnd a spirited sharp sword and a horse with a blaze... Smooth-backed, swimming (in speed), eager.\nFilling your eyes with space and pleasing... You as an eagle if you wish, or impulsive.'\n\nSection\nIf a knight is singled out with a specific weapon, he is described by it. With a sword: *Musif* and *Sayyaf*. Striking with it: *Sa'if*. With a spear: *Ramih*. With arrows: *Nabil* and *Nabbal*. With crossbow/arrows: *Nashib*. With armor: *Dari'*. With a helmet: *Muqanna'*. With a shield: *Tarras*. If he combines sword and arrows, he is *Qarin*. If he gathers weapons, he is *Salih*. *Al-Shakkah*: Complete weapons. You say: A knight *Shaki al-Silah* (fully armed), lightened form. It is said it is from *Shawkat al-Silah* (thorn/power of weapon); if so, it is inverted from *Sha'ik*. A knight *Mu'ammal*: Fully armed with tools. Likewise *Mudajjaj*. *Al-Sannawr*: Weapons with armor. *Al-Bazz* and *Al-Bizzah*: Weapons without armor. If the knight has no sword, he is *Amyal*. If without a spear, *Ajam*. If without armor, *Hasir*. If without a shield, *Akshaf*. If no weapons at all, *A'zal*. If he puts on armor, you say *Istala'ma*: meaning he wore the *La'mah*. *Sanna* the armor on him: poured it on him. *Nathalaha*: wore it also. *Taqanna'a*: wore the helmet (*Mighfar*). *Ijtanna*: wore the shield (*Junnah*). *Jallala* with the sword: if he attacks his opponent with it and urges against him. *Jallalahu* with it: covered him (struck him from above). *Safahu*: struck him with it and wounded him. *Tabbaqa*: if he hit the joint. *Bara*: if he cut flesh and bone and severed the limb. *Al-Misa'* and *Al-Mumas'ah*: Fighting with swords. *Al-Muta'anah* and *Al-Muda'asah*: Fighting with spears. You say: *Ramaha* and *Da'asa* and *Nadasa*: if he thrust with the spear. *Nabala* and *Rashaqa*: if he shot with arrows.\nI say: Mastery of working with weapons is not equal among people; rather, the disparity between them in that is severe, and the difference great. It is obligatory upon the intelligent person to witness the actions of the experts, attend with men, and take a share of training in it with whom he sees fit and chooses. Until he knows the method of thrusting, striking, and drilling with weapons in war, and the modes of action in attacking and retreating, defense, entering upon duelists, and exiting from them in lance-fighting and sword-fighting. And observing the fall of arrows, times of advance and retreat, stealing ground in dueling, hiding from the sun during the encounter, engagement and evasion, turning in fighting, the subtleties of that, and its consequences during combat. And watching for the enemy's inadvertence in movement and calm, and trickery in disabling the spear by striking it or controlling it against its owner, or returning it to him, or removing the horse's cheekpiece, or cutting its rein, so the knight becomes busy with his horse's affair, enabling him (the opponent) to overpower him instantly; physiognomy appears in this and becomes clear. Whoever does not train in that, let not his soul deceive him to walk these paths. In knowing all that and looking deeply into it, knights excel over one another, along with steadfastness, boldness of heart, intense caution when disputing with peers, and descending to the field. Allah, Majestic and Exalted, is the One sought for help in every condition. Abu al-Tayyib said:\n'Weapons are carried by all people... But not every possessor of a claw is a Lion.'",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 56
  },
  {
    "serial_number": "6786057",
    "category_id": "32",
    "category": "Literature",
    "book_title": "The Ornament of Knights and the Emblem of the Brave",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "Here, by the praise of Allah, I have reached what I intended, and finished summarizing what I presented, completed the purpose, and performed the imposed duty, when I brought... to his distinctiveness, and ran the steed in the field of his passage. He whose courtyard the armies of Islam have stepped into, and desired the overflow of dew (generosity) from his palm. The lands of the enemy have given him the hand of submission, to attain from him the request and obtain every desire. They have yearned for him like the yearning of the sick for doctors, and the scarred for consolation. It envies its likes that they took refuge with him in residence, and wishes if it could shake his hand in meeting, gaining from him the healing cure, sufficient support, and sincere beloved. Then he—may Allah Almighty support him—releases it from the shackle of obscurity, encompasses it with fertility after drought, saves it from the hand of humiliation with his protectors and delegations, and places it after the nadir in the station of Saturn with his heroes and soldiers. He possesses determinations that terrify the days, and wake the grave matter if it sleeps. Bravery and Generosity are allies to his nature, and companions to his character. Distresses are relieved by his spearhead, news of his praise is fragrant, voices rise calling variously, and hands extend pleading in unison, that Allah may humble the noses of idols by the truth of his seriousness, and execute the resolves of Islam by the sharpness of his edge. O Allah, establish him in Your land with the widest establishment, intensify his tread upon the aggressors, support through him the parties of the believers, scatter by his soldiers the mixed crowds of the disbelievers, and make them a harvested field, extinct, for his sharp swords. O Allah, protect him from his sides and directions, and revive the landmarks of faith by his life. Guard him in his wakefulness and sleep from... the high and his self, and spread the tassels of his banners and flags with the wind of victory. O Allah, show him hope in his family and children, his protectors and soldiers, land the saddles of joy with him, and spread his hands with good things. Indeed, You are capable of all things, and worthy of answering. Praise be to Allah, Lord of the Worlds, and blessings and peace upon our Master and Lord Muhammad, Seal of the Prophets and Imam of the Messengers, and upon his family, companions, and his righteous, most noble helpers. And grant abundant peace.",
    "foot_note": "None",
    "book_id": "788",
    "new_page_number": 57
  }
]