[
  {
    "text": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)\nAuthor: أبو محمد عبد الله بن وهب بن مسلم المصري القرشي\nYear: 197",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 1
  },
  {
    "text": "sn: 1713\nbook_title: القدر وما ورد في ذلك من الآثار\nbook_link: https://shamela.ws/book/153\nbook_id: 153\nauthor_name: أبو محمد عبد الله بن وهب بن مسلم المصري القرشي\nauthor_year: 197\nnickname: أبو محمد\nauthor_link: https://shamela.ws/author/295\nauthor_ID: 295\neditor: عمر بن سليمان الحَفيان\npublisher: دار العطاء للنشر والتوزيع، الرياض - المملكة العربية السعودية\nedition: الأولى، 1422 هـ - 2001 م\npages: 79\nvolumes: Null\npagination: [ترقيم الكتاب موافق المطبوع]\ncategory: كتب السنة\ncategory_id: 6",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "category_id": "6",
    "category": "Books of Sunnah",
    "new_page_number": 2
  },
  {
    "serial_number": "1280998",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Sunnah Books. Book: Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar. Author: Abdullah bin Wahb bin Muslim Al-Qurashi Al-Masri (125 - 197 AH). Verified and hadiths referenced by: Omar bin Suleiman Al-Hafyan. Publisher: Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia. Edition: First, 1422 AH - 2001 AD. Number of Pages: 79 [Book numbering matches the printed version]. Publication Date in Shamela: 24 Jumada Al-Awwal 1442.\nBook: Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar. Author: Abdullah bin Wahb bin Muslim Al-Qurashi Al-Masri (125 - 197 AH). Verified and hadiths referenced by: Omar bin Suleiman Al-Hafyan. Publisher: Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia. Edition: First, 1422 AH - 2001 AD. Number of Pages: 79 [Book numbering matches the printed version]. Publication Date in Shamela: 24 Jumada Al-Awwal 1442.\nAuthor: Abdullah bin Wahb bin Muslim Al-Qurashi Al-Masri (125 - 197 AH). Verified and hadiths referenced by: Omar bin Suleiman Al-Hafyan. Publisher: Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia. Edition: First, 1422 AH - 2001 AD. Number of Pages: 79 [Book numbering matches the printed version]. Publication Date in Shamela: 24 Jumada Al-Awwal 1442.\nVerified and hadiths referenced by: Omar bin Suleiman Al-Hafyan. Publisher: Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia. Edition: First, 1422 AH - 2001 AD. Number of Pages: 79 [Book numbering matches the printed version]. Publication Date in Shamela: 24 Jumada Al-Awwal 1442.\n[Book numbering matches the printed version]. Publication Date in Shamela: 24 Jumada Al-Awwal 1442.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 3
  },
  {
    "serial_number": "1280999",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. Verily, praise be to Allah, we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, no one can lead him astray, and whomever He leads astray, no one can guide him. I bear witness that there is no god but Allah alone, with no partner, and I bear witness that Muhammad is His servant and messenger. May Allah send blessings and abundant peace upon him. To proceed: We are pleased to place before the readers and students of knowledge the book \"Kitab Al-Qadar\" by the Imam, the Hafiz, the ascetic Abdullah bin Wahb Al-Qurashi Al-Masri, who died in the year (197 AH), may Allah Almighty have mercy on him. In this book, the author, may Allah have mercy on him, followed the method of the predecessors (Salaf) in their compilations at that time. He listed the Prophetic Hadiths and Salafi traditions affirming Divine Decree and Destiny without commentary or chapter headings. Yes, his arrangement of the hadiths and traditions might suggest they are ordered according to a general thematic sequence, but he did not assign chapter headings at all. Furthermore, the copyist Abu Bakr; Muhammad bin Ismail - who is the narrator of the book - added to the original book hadiths from his sheikhs, which are essentially extractions and corroborations for the book's hadiths (1).",
    "foot_note": "1. I distinguished these additions by placing the letter (z) after the hadith number, noting that I maintained the numbering of Sheikh Al-Uthaym.",
    "book_id": "153",
    "new_page_number": 4
  },
  {
    "serial_number": "1281000",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 6,
    "volume_number": 1,
    "text": "It should be noted that this book was printed with the verification of Dr. Abdul Aziz Abdul Rahman Muhammad Al-Uthaym, may Allah have mercy on him, in the year (1406) in Makkah Al-Mukarramah. What prompted me to re-verify and publish it, despite the prior work of Sheikh Al-Uthaym, may Allah have mercy on him, are several matters, including: 1 - The Sheikh, may Allah have mercy on him, intervened directly in the text of the book; by modification, substitution, addition, and deletion; sometimes indicating this action, and neglecting it at other times. It is no secret that this approach is dangerous with undesirable consequences. I will give some examples and models of his action: On page (152) of his printed version: The copyist commented on the hadith of Jarir bin Hazim, from Al-A'mash, from Zaid bin Wahb, from Ibn Masoud, saying: \"This is a strange chain from Jarir bin Hazim, from Al-A'mash.\" Sheikh Al-Uthaym, may Allah have mercy on him, modified it to: \"This is a chain [that is not strange] from Jarir bin Hazim, from Al-A'mash.\" His basis: The copyist's words - in his view - contradict the corroborations he cited for the hadith! It is no secret that the copyist meant relative strangeness, not absolute. Whatever the case may be; his statement should not be modified. On page (157): The copyist said: \"And the rest of the paths of this hadith from",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 5
  },
  {
    "serial_number": "1281001",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 7,
    "volume_number": 1,
    "text": "Al-A'mash, come in the hadith of Al-A'mash from Zaid bin Wahb.\" So the Sheikh, may Allah have mercy on him, replaced it with his saying: \"And the rest of the paths of the hadith of Zaid bin Wahb come in the hadith of [Salamah bin Kuhayl]\" because his phrase is more correct than the copyist's phrase, as he said. On page (137): Hadith of Ibn Umar: \"When Allah Almighty wants to create the soul, the angel of the wombs says with it...\". Thus it appeared \"with it\" in the three manuscripts of \"Kitab Al-Qadar\" by Ibn Wahb. And in the manuscript originals of \"Shifa Al-Alil\" by Ibn Al-Qayyim - where he transmitted this hadith with its chain and text - and in \"Tahdhib Al-Kamal\" by Al-Mizzi where he narrated the hadith with its chain via \"Kitab Al-Qadar\" by Ibn Wahb. And Al-Mizzi noted that it occurred like this in the narration \"with it\". So the Sheikh deleted it and put in its place \"turning away\" and did not indicate in the slightest this action (1). As for the additions, they are numerous, appended from other narrations of the hadith to complete the benefit. There is no doubt that Ibn Wahb was not concerned with them. What indicates that they did not appear in the original book: Those who quoted from \"Kitab Al-Qadar\" in the past like Ibn Al-Qayyim and others transmitted its hadiths and narrated them without those additions. As for his referencing (Takhrij); it is indicative of the Sheikh's wide reading, may Allah have mercy on him, of",
    "foot_note": "1. And this action of the Sheikh caused me to fall into the same error in \"Shifa Al-Alil\" p. (101), so I followed him due to my extreme trust in him, except that I noted in the footnote what was in the originals.",
    "book_id": "153",
    "new_page_number": 6
  },
  {
    "serial_number": "1281002",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 8,
    "volume_number": 1,
    "text": "Hadith books, his knowledge of its paths and narrators, and the strength of his presentation. However; everyone has their own method and way. 2 - That I was successful in obtaining three manuscript copies of the book, praise be to Allah (1). I symbolized them as: The Original, (Z), and (H), and their description will come later. Sheikh Al-Uthaym, may Allah have mercy on him, had mentioned in the introduction to his edition that he relied on two manuscripts: The Original and (Z), but upon comparison, it turned out that he relied on (Z) only and neglected The Original, which caused some defects in his work, and I have rectified it by comparing the three copies with Allah's success and grace. 3 - That his copies have been out of print in libraries for years, and obtaining them became difficult; due to lack of republishing and reprinting. This; and I do not miss in conclusion to extend sincere thanks to our brother Ayman Dhu Al-Ghina for the effort he exerted in reviewing the book, and his interest and care for it, may Allah place that in the balance of his good deeds; He is All-Hearing, Responsive. And our last call is that praise be to Allah, Lord of the Worlds. Written by Omar bin Suleiman Al-Hafyan, may Allah forgive him * * *",
    "foot_note": "1. Our generous brother Jazaa Al-Shehri provided them to me, may Allah reward him with good.",
    "book_id": "153",
    "new_page_number": 7
  },
  {
    "serial_number": "1281003",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 9,
    "volume_number": 1,
    "text": "Biography of Abdullah bin Wahb (1). His Name, Lineage, and Birth: He is Abdullah bin Wahb bin Muslim, Al-Qurashi, Al-Fihri, Al-Masri. Freed slave of Yazid bin Zamana; freed slave of Yazid bin Abi Unais Abu Abd al-Rahman Al-Fihri. He was born in the year one hundred and twenty-five. He sought knowledge when he was seventeen years old, as he reported about himself. His Sheikhs: He narrated from: Imam Malik bin Anas, Al-Layth bin Sa'd, Amr bin Al-Harith, Abdullah bin Lahi'ah, Sufyan Al-Thawri, Sufyan bin",
    "foot_note": "1. See his biography in: Al-Kamil fi Du'afa al-Rijal - by Ibn Adi (5/ 336) Ed./ Dar Al-Kutub Al-Ilmiyyah. Tartib Al-Madarik - by Qadi Iyad (3/ 228) Ed./ Ministry of Awqaf Morocco. Al-Dibaj Al-Mudhahhab - by Ibn Farhun Al-Maliki p. (214) Investigation/ Ma'mun Al-Jannan. Tahdhib Al-Kamal - by Al-Mizzi (16/ 277). Mizan Al-I'tidal - by Al-Dhahabi (4/ 223) Ed./ Al-Baz. Tahdhib Al-Tahdhib - by Ibn Hajar (6/ 71).",
    "book_id": "153",
    "new_page_number": 8
  },
  {
    "serial_number": "1281004",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 10,
    "volume_number": 1,
    "text": "Uyaynah, Abd al-Rahman bin Abi Al-Zinad, Abd al-Rahman bin Mahdi - who is younger than him -, Yunus bin Yazid Al-Ayli, Abd al-Malik bin Jurayj, Muhammad bin Abd al-Rahman bin Abi Dhi'b, Usama bin Zaid bin Aslam, Usama bin Zaid Al-Laythi, Jarir bin Hazim, and Harmalah bin Imran Al-Tujibi. And many others. His Students: Narrated from him: Ahmad bin Sa'id Al-Hamdani - who is the narrator of Kitab Al-Qadar from him -, Al-Layth bin Sa'd - who is one of his sheikhs -, Ahmad bin Salih Al-Masri, Abu Al-Tahir; Ahmad bin Amr bin Al-Sarh, Asbagh bin Al-Faraj, Al-Harith bin Miskin, Harmalah bin Yahya Al-Tujibi, Al-Rabi' bin Suleiman Al-Muradi, Sa'id bin Mansour, Abd al-Rahman bin Mahdi, Ali bin Al-Madini, Qutaibah bin Sa'id, and Yunus bin Abd al-A'la. And others besides them. Scholars' Statements on Him Regarding Jarh and Ta'dil (Discrediting and Validation): Abbas Al-Duri and Abu Bakr bin Abi Khaythama said, from Yahya bin Ma'in: Trustworthy (Thiqah). Ahmad bin Hanbal said: Abdullah bin Wahb was a scholar, righteous, a jurist, with abundant knowledge. Abu Zur'ah said: I looked into about thirty thousand hadiths of Ibn Wahb in Egypt and outside Egypt, I do not know that I saw a hadith of his that has no basis. And he is trustworthy.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 9
  },
  {
    "serial_number": "1281005",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 11,
    "volume_number": 1,
    "text": "Al-Nasa'i said: Trustworthy, I do not know him to have narrated a rejected hadith from trustworthy narrators. Al-Khalili said: Trustworthy, agreed upon. It was held against him that he was lenient in taking [hadith]. Al-Nasa'i said: He was lenient in taking; and there is no harm in him. Al-Saji said: Truthful, trustworthy, and was one of the worshippers, and was lenient in hearing; because the madhhab of the people of his country is that Ijaza (license) is permissible for them, and he says in it: So-and-so told me. Ibn Adi included him in \"Al-Kamil\" for this reason. Al-Dhahabi said: Ibn Adi was stubborn in including him in \"Al-Kamil\". From Yahya bin Ma'in: That he heard Ibn Wahb saying to Sufyan bin Uyaynah: O Abu Muhammad, the hadiths - meaning: what so-and-so presented to you yesterday - license them for me. He said: Yes. Al-Dhahabi commented: This is the madhhab of the group, and if there is blame on Abdullah for it, then Ibn Uyaynah is his partner in it. I say: And this mentioned leniency does not affect his hadith at all; because he did not include them in his compilations and narrations. Imam Ahmad said: It reached me that he did not include anything of those in his compilation. He also said: Abdullah bin Wahb is sound in hadith, he separates hearing from presentation, and hadith from hadith, how sound and firm his hadith is! It was said to him: Was he not bad in taking?",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 10
  },
  {
    "serial_number": "1281006",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 12,
    "volume_number": 1,
    "text": "He said: He might be bad in taking, but if you look at his hadith, what he narrated from his sheikhs you find it sound. It was also held against him: That in his narration from Ibn Jurayj there are solitary reports and errors. Yahya bin Ma'in said: He is not that [strong] regarding Ibn Jurayj, he used to consider him young. Ahmad said: In the hadith of Ibn Wahb from Ibn Jurayj there is something. Abu Awanah said: He [i.e., Ahmad bin Hanbal] spoke the truth; because he brings things from him that others do not bring. Whatever is said; the rejected reports and errors in the vast amount he narrated are rare and few, indeed the authors of the two Sahihs extracted his narration from Ibn Jurayj. Ibn Adi said: And Abdullah bin Wahb is among the majestic people, and their trustworthy ones, and the hadith of Hejaz and Egypt, and what is related to those lands, revolves around the narration of Ibn Wahb, and he collected for them their musnad (connected) and maqtu' (disconnected)... And I do not know of a rejected hadith for him if a trustworthy person narrates from him. Al-Dhahabi said: He included many disconnected and perplexing reports in his compilations, and narrated much from Ibn Sam'an and his ilk, and some Imams criticized Ibn Wahb in his taking of hadith, and that he was lenient in taking, and whether he was lenient and saw that permissible, or strict, whoever narrates a hundred thousand hadiths, and rejected reports are rare in the vastness of what he narrated, then he has reached the utmost in precision. Yunus bin Abd al-A'la said: The judiciary was offered to Ibn Wahb, so he feigned madness, and stayed in his house. It was said: That when he was asked to take over the judiciary of Egypt; he hid with Harmalah bin Yahya for a year and months.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 11
  },
  {
    "serial_number": "1281007",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 13,
    "volume_number": 1,
    "text": "Khalid bin Khidash said: The book \"Ahwal Al-Qiyamah\" (Conditions of the Resurrection) - meaning: from his compilation - was read to Abdullah bin Wahb, so he fell unconscious, and did not speak a word until he died days later. His death was on Sunday with four [days] remaining of Sha'ban in the year one hundred and ninety-seven. May Allah have wide mercy on him and forgive him. His Works: Ahmad bin Salih said: Ibn Wahb compiled one hundred and twenty thousand hadiths. Ibn Hibban said: He collected and compiled. Ibn Farhun said: He authored many works, good and of great benefit. Qadi Iyad said: He authored many works, of great value, and great benefit, among them: His hearing from Malik thirty hadiths. His Great Muwatta. His Great Jami'. Kitab Al-Ahwal - and some add it to Al-Jami'. Kitab Tafsir Al-Muwatta. Kitab Al-Bay'ah (The Pledge). Kitab La Hama Wa La Safar. Kitab Al-Manasik.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 12
  },
  {
    "serial_number": "1281008",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 14,
    "volume_number": 1,
    "text": "Kitab Al-Maghazi. Kitab Al-Riddah. End of his words. Among them is: \"Kitab Al-Qadar\" which is the subject of verification. In reality, I have not come across a mention or indication of it among those mentioned previously who wrote biographies of Ibn Wahb. They, may Allah have mercy on them, stated that he has many works, then mentioned samples of them; not committing to encompassing all. Or perhaps this book did not reach them, even though it was known and circulated among scholars, we mention among them: 1 - Imam Ibn Qayyim Al-Jawziyya: He quoted many of its hadiths with their chains and texts in his book \"Shifa Al-Alil\" and here are their locations: - p. (57) he said: \"And this which the Pen wrote is Al-Qadar; because of what Ibn Wahb narrated..\" then he mentioned hadith number (26). - p. (59) he said about the hadith of Abu Huraira: The Pen has dried with what you will encounter: \"Ibn Wahb narrated it in Kitab Al-Qadar..\" and mentioned hadith number (16). - p. (60) he said: \"And Ibn Wahb said...\" then mentioned hadith number (29). - p. (76 - 77) he said: \"Abdullah bin Wahb said in Kitab Al-Qadar...\" then he quoted three hadiths, which are numbers (12, 15, 24).",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 13
  },
  {
    "serial_number": "1281009",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 15,
    "volume_number": 1,
    "text": "- p. (101) he said: \"Ibn Wahb said...\" and quoted three hadiths as well, which are numbers (30, 36, 45). 2 - Al-Hafiz Al-Mizzi: He narrated in his great book \"Tahdhib Al-Kamal\" (17/ 472) a hadith from \"Kitab Al-Qadar\" by Ibn Wahb via the path of our copy here, so he said: \"Abu Al-Hasan bin Al-Bukhari, Ahmad bin Shaiban, and Zainab bint Makki told us, they said: Abu Hafs bin Tabarzad told us...\" then he mentioned hadith number (30). 3 - Al-Hafiz Ibn Hajar: Al-Hafiz Ibn Hajar narrates \"Kitab Al-Qadar\" from his sheikh Abu Al-Abbas; Ahmad bin Al-Hasan Al-Suwaydawi, by his hearing from Ahmad bin Abi Bakr bin Tay, and Badr Al-Din; Muhammad bin Ahmad bin Khalid Al-Fariqi, by hearing of Ibn Tay, and Ijaza of Al-Fariqi if it was not hearing; from Shamiyyah bint Abi Ali Al-Hasan bin Muhammad Al-Bakri, then the hearing of Badr appeared. She said: Omar bin Muhammad bin Tabarzad told us with it.... \"Al-Majma' Al-Mu'assas\" (1/ 302), \"Al-Mu'jam Al-Mufahras\" p. (57). And he quoted from it in \"Fath Al-Bari\" (11/ 511) explanation of hadith number (6614) saying: \"... And Ibn Wahb narrated in Kitab Al-Qadar from Malik, from Yahya bin Sa'id, that this was from Adam after he was repented upon...\" and I did not find this quote! Perhaps it is in another narration of the book. And Allah knows best.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 14
  },
  {
    "serial_number": "1281010",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 16,
    "volume_number": 1,
    "text": "4 - Al-Hafiz Al-Ayni: He said in \"Umdat Al-Qari\" (23/ 145) Ed./ Al-Muniriyyah: \"... And Ibn Masoud was not alone in this either, rather a group of Companions narrated it at length and briefly, among them: Anas bin Malik ... and Abdullah bin Umar in Al-Qadar by Ibn Wahb...\". 5 - Imam Abu Al-Tayyib Al-Taqi Al-Fasi: He said in \"Dhayl Al-Taqyid\" (1/ 306) Ed./ Umm Al-Qura: \"Al-Agharr bin Fada'il bin Karam bin Al-Ullaiq Al-Baghdadi, Abu Nasr Al-Babasarawi ... and he heard from Al-Mubarak bin Muhammad bin Yahya Al-Zabidi and Abd al-Rahman bin Ya'ish Al-Qawariri Kitab Al-Qadar by Ibn Wahb Al-Masri...\". 6 - Imam Ibn Batta: He narrated in his book \"Al-Ibanah\" a number of hadiths and traditions from Kitab Al-Qadar by Ibn Wahb via the path of Ahmad bin Sa'id Al-Hamdani, the narrator of the book from Ibn Wahb. * * *",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 15
  },
  {
    "serial_number": "1281011",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 17,
    "volume_number": 1,
    "text": "Study of the Chain of the Manuscript 1 - Narrating \"Kitab Al-Qadar\" from Ibn Wahb: Ahmad bin Sa'id bin Bishr Al-Hamdani Al-Masri. Al-Nasa'i said: Not strong. Zakariya Al-Saji said: Proven (Thabt). Ahmad bin Salih and Al-Ijli said: Trustworthy. Ibn Hajar said: Truthful. He died in the year two hundred and fifty-three. \"Tahdhib Al-Kamal\" (1/ 314), \"Tahdhib Al-Tahdhib\" (1/ 31). 2 - From him: Abu Bakr, Abdullah bin Abi Dawud Al-Sijistani, author of the Sunan. Al-Daraqutni said: Trustworthy. Al-Khalili said: The Hafiz; The Imam in Baghdad in his time. He died in the year three hundred and sixteen. \"Tarikh Baghdad\" (9/ 464), \"Al-Irshad\" by Al-Silafi's partioning (2/ 10), \"Al-Siyar\" (13/ 221), \"Al-Lisan\" (4/ 31). 3 - From him: Abu Bakr, Muhammad bin Ismail, The Copyist (Al-Warraq), Al-Baghdadi, The Dictation Writer (Al-Mustamli). Al-Barqani said: Trustworthy trustworthy. Ibn Abi Al-Fawaris said: There is leniency in him, his books were lost; and he created copies from people's books.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 16
  },
  {
    "serial_number": "1281012",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 18,
    "volume_number": 1,
    "text": "Al-Dhahabi commented: Narrating without an original has become widespread and overwhelming today, so we hope it will be capacious by joining it to Ijaza. He died in the year three hundred and seventy-eight. \"Tarikh Baghdad\" (2/ 53), \"Al-Siyar\" (16/ 388), \"Al-Lisan\" (5/ 721). 4 - From him: Abu Al-Hussein, Muhammad bin Ahmad bin Hasnoun. Al-Khatib said: He was truthful, trustworthy, from the people of Quran; of good belief. He died in the year four hundred and fifty-six. \"Tarikh Baghdad\" (1/ 356). 5 - From him: Abu Ghalib, Ahmad bin Al-Hasan bin Al-Banna, Al-Baghdadi, Al-Hanbali. Al-Dhahabi said: The Sheikh, the Righteous, the Trustworthy. He died in the year five hundred and twenty-seven. \"Al-Siyar\" (19/ 603). 6 - From him: Abu Hafs, Omar bin Muhammad bin Mu'ammar bin Tabarzad, Al-Daraqazzi. Ibn Nuqtah said: He is prolific, sound in hearing, trustworthy in Hadith. Ibn Al-Najjar said: He was negligent in religious matters, and we used to hear from him for a whole day; so we would pray, and he would not pray with us, nor stand for prayer, and he used to ask for payment for narrating hadith. Al-Dhahabi said: So despite what we showed of his weakness, students multiplied around him,",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 17
  },
  {
    "serial_number": "1281013",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 19,
    "volume_number": 1,
    "text": "and his hadith spread in the horizons, and the Huffaz rejoiced in his high chains, then in the second era they crowded his companions, and carried much from them, and thought well of him, and Allah is the Meeting Place, and Ibn Nuqtah declared him trustworthy. He died in the year six hundred and seven. Note: Tabarzad: is sugar. And Al-Daraqazzi: attributed to Dar Al-Qazz, a large quarter that was in Baghdad. \"Mukhtasar Tarikh Ibn Al-Dubaythi\" (5/ 286), \"Dhayl Tarikh Baghdad\" by Ibn Al-Najjar p. (118), \"Al-Siyar\" by Al-Dhahabi (21/ 507), \"Al-Lisan\" by Ibn Hajar (5/ 234). 7 - From him: Shihab Al-Din, Abu Al-Fadl, Abd al-Rahim bin Yusuf bin Yahya, Al-Mawsili, Ibn Khatib Al-Mizza, Al-Dimashqi, Al-Musnid. He was trustworthy, virtuous, religious. \"Al-Wafi bi Al-Wafayat\" (18/ 399), \"Shadharat Al-Dhahab\" (5/ 401). 8 - From him: Shams Al-Din, Abu Abdullah, Muhammad bin Ahmad bin Ibrahim, bin Haidara, known as Ibn Al-Qammah, the Imam, the Trustworthy, the Jurist, was a marvel in memorizing the Quran and in intelligence. He died in the year seven hundred and forty-one. \"Al-Wafi bi Al-Wafayat\" (2/ 150), \"Al-Durar Al-Kamina\" (3/ 303), \"Shadharat Al-Dhahab\" (6/ 131). * * *",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 18
  },
  {
    "serial_number": "1281014",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 20,
    "volume_number": 1,
    "text": "Description of the Manuscripts Relied Upon in the Verification 1 - Escorial Copy (The Original): It is an old precious copy, located within a collection comprising a number of books on Hadith and Rijal, preserved in the Escorial Monastery in Spain, and a paper copy of it is in the library of the Holy Mosque in Mecca. Number of folios: (6) plates, equivalent to (11) pages. The number of lines per page ranges between 27 - 28 lines. Its script is poor, and mostly unpointed. Compared, and corrected, and has a number of hearing certificates on it. Its copyist: Ahmad bin Uthman bin Muhammad bin Ibrahim bin Abdullah, Abu Al-Fath, originally from Kirman, Cairene, Hanafi, the Muhaddith, known as Al-Kalutati. His reading of large books was repeated, to the extent that he read Al-Bukhari more than sixty times, and his sheikhs in it are around that number, and he wrote in his hand a group of compilations of the Sheikhs, then compilations of peers like Al-Wali Al-Iraqi, then Ibn Hajar, and his handwriting is poor. He was religious, good, performed much worship, on his face was the brightness of Hadith. He died in the year eight hundred and thirty-five in Cairo. \"Al-Daw' Al-Lami'\" (1/ 378).",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 19
  },
  {
    "serial_number": "1281015",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 21,
    "volume_number": 1,
    "text": "2 - Al-Zahiriyah Copy: Number of folios: (6) plates, equivalent to (11) pages. Its script: Very proficient Persian and pointed. Its copyist compared it and corrected it and rectified the omissions and corrected errors in its margin. In its margin are several comments and benefits in the handwriting of its copyist \"Zain Al-Abidin\". It does not bear any hearing certificates or dates, or the like. It is not free from some errors. And it appears to be copied from the Escorial copy. 3 - The Indian Copy: Preserved in Nadwatul Ulama in Lucknow, India under number (56), and a copy of it is in the Islamic University in Madinah under number (27) Hadith. Its script: Ruq'ah approaching Naskh. Its copyist: Sayyid Kalim Ahmad, dated 10/ December/ 1930 AD. Compared with its original from which it was copied and corrected by: Izz Al-Din Al-Phulwarvi, professor of Arabic language at Nadwatul Ulama in Lucknow. The corrector said about the original from which it was copied: It was full of mix-ups",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 20
  },
  {
    "serial_number": "1281016",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 22,
    "volume_number": 1,
    "text": "and verbal omissions. So it has now come by Allah's grace in the best perfection man is capable of and its admirable elegant arrangement. I say: And yet it remained full of misspellings. It seems to me that it is copied from one of the branches of the Escorial copy. And Allah knows best. * * *",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 21
  },
  {
    "serial_number": "1281017",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 23,
    "volume_number": 1,
    "text": "Samples from the Manuscripts Relied Upon Sample from the Escorial copy (The Original)",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 22
  },
  {
    "serial_number": "1281018",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 24,
    "volume_number": 1,
    "text": "Sample from the Escorial copy (The Original)",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 23
  },
  {
    "serial_number": "1281019",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 25,
    "volume_number": 1,
    "text": "Sample from Al-Zahiriyah copy",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 24
  },
  {
    "serial_number": "1281020",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 26,
    "volume_number": 1,
    "text": "Sample from Al-Zahiriyah copy",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 25
  },
  {
    "serial_number": "1281021",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 27,
    "volume_number": 1,
    "text": "Sample from Lucknow copy (Indian) and the copyist wrongly attributed it to Abu Dawud Al-Sijistani",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 26
  },
  {
    "serial_number": "1281022",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 28,
    "volume_number": 1,
    "text": "Sample from Lucknow copy (Indian)",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 27
  },
  {
    "serial_number": "1281023",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 29,
    "volume_number": 1,
    "text": "Kitab Al-Qadar and What Has Been Narrated Regarding That of Traditions Authored by Imam Abdullah bin Wahb bin Muslim Al-Qurashi Al-Masri, may Allah Almighty cover him with His mercy. Narration of Abu Ja'far, Ahmad bin Sa'id Al-Masri from him. Narration of Abu Bakr, Abdullah bin Abi Dawud Al-Sijistani from him. Narration of Abu Bakr, Muhammad bin Ismail Al-Warraq from him. And in it are additions from his sheikhs. Narration of Abu Al-Hussein, Muhammad bin Ahmad bin Hasnoun from him. Narration of Abu Ghalib, Ahmad bin Al-Hasan bin Al-Banna from him. Narration of Abu Hafs, Omar bin Muhammad bin Mu'ammar bin Tabarzad Al-Daraqazzi from him. Narration of Abu Al-Fadl, Abd al-Rahim bin Yusuf bin Yahya Al-Qurashi, Ibn Khatib Al-Mizza from him. Narration of his scribe - meaning: scribe of the original from which it was copied (1) - Muhammad bin Ahmad bin Ibrahim bin Haidara Al-Qurashi from him by Ijaza.",
    "foot_note": "1. In (Z): from him.",
    "book_id": "153",
    "new_page_number": 28
  },
  {
    "serial_number": "1281024",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 31,
    "volume_number": 1,
    "text": "In the name of Allah, the Entirely Merciful, the Especially Merciful. May Allah send blessings upon our master Muhammad, his family, and his companions and grant them abundant peace. The Esteemed Musnid Sheikh, Shihab Al-Din, Abu Al-Fadl, Abd al-Rahim (1) bin Yusuf bin Yahya Al-Dimashqi informed us by permission, saying: Abu Hafs; Omar bin Muhammad bin Mu'ammar bin Tabarzad; Al-Daraqazzi informed us, by reading to him while we were listening, Abu Ghalib; Ahmad bin Al-Hasan bin Ahmad bin Al-Banna, the Jurist informed us, [Abu] (2) Al-Hussein; Muhammad bin Ahmad bin Muhammad bin Hasnoun, Al-Qurashi informed us, by reading to him in the year four hundred and fifty-five, saying: It was read to Abu Bakr; Muhammad bin Ismail bin Al-Abbas bin Muhammad, Al-Warraq, while I was listening in Jumada Al-Ula of the year three hundred and seventy-two. Part One (3) (1) - Abu Bakr; Abdullah bin Suleiman bin (4) Al-Ash'ath bin Ishaq Al-Sijistani told us; by reading from the original of his book, in the year three hundred and eleven (5), he said: Abu Ja'far, Ahmad bin Sa'id bin Bishr Al-Hamdani Al-Masri told us,",
    "foot_note": "1. In (Z): \"Abd al-Rahman bin Yusuf\", but in The Original it did not appear due to lack of clarity of the photocopy, while the chain of the copy fell entirely from (H), and what we established is the correct one, see p. (29) and study of the chain of the copy p. (19). \n2. Missing from the three manuscripts, and retrieved from p. (29) and (56) where his name appeared correctly as in the sources of his biography. \n3. Not in The Original, and established from (Z) and (H). \n4. \"bin\": Not in The Original, and established from (Z) and (H). \n5. In The Original and (Z): \"and twenty\" and this is definitely an error; because Abu Bakr bin Abi Dawud died in the year (316) as preceded in his biography p. (17). And the correction is from the beginning of Part Two of this book p. (56).",
    "book_id": "153",
    "new_page_number": 29
  },
  {
    "serial_number": "1281025",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 32,
    "volume_number": 1,
    "text": "Abdullah bin Wahb informed us, Anas bin Iyad informed us (1), from Al-Harith bin Abd al-Rahman bin Abi Dhubab, from Yazid bin Hurmuz, said: I heard Abu Huraira, may Allah be pleased with him, say: The Messenger of Allah, peace and blessings be upon him, said: \"Adam and Moses, peace be upon them, argued before their Lord, Mighty and Majestic, so Adam defeated* Moses in argument. Moses said: You are Adam whom Allah created with His hand, breathed into you from His spirit, made His angels prostrate to you, and dwelled you in His garden, then you brought people down by your sin to the earth? Adam said: You are Moses whom Allah chose with His message and His speech, gave you the Tablets, in which is an explanation of everything, and drew you near as a confidant, so by how much did you find Allah Mighty and Majestic wrote the Torah before He created me? Moses said: By forty years. Adam said: So did you find in it (2) {And Adam disobeyed his Lord and erred}? He said: Yes. He said: Do you blame me for doing a deed which Allah wrote upon me forty years before He created me? The Messenger of Allah, peace and blessings be upon him, said: So Adam defeated Moses in argument\" (3).",
    "foot_note": "1. In (Z) and (H): Informed us. * This asterisk is a sign that the word has been explained in the appendix \"Gharib Al-Alfaz\" (Strange Words) at the end of the book, and it has been placed on every word that has an explanation in the mentioned appendix. [[And we have transferred this appendix in the Shamela version to its places in the book and placed it between brackets [[like this]] to be distinguished]] [[* Hajja-hu: Overcame him with Hujjah; i.e., proof. \"Lisan Al-Arab\" (Hjj).]] \n2. \"in it\": Not in The Original, and established from (Z) and (H). \n3. Narrated by Ibn Abi Hatim in his \"Tafsir\" [see \"Tafsir Ibn Kathir\" (Taha: 115)], and Abu Awanah in his \"Mustakhraj\" [see \"Ithaf Al-Maharah\" (15/ 729)] from Yunus bin Abd al-A'la, from Ibn Wahb with it. And narrated by Muslim number [15 - (2652)], and Ibn Abi Asim in \"Al-Sunnah\" number (162) from Anas bin Iyad with it. And narrated by Ibn Khuzaymah in \"Al-Tawhid\" (1/ 123) from Al-Harith bin Abd al-Rahman bin Abi Dhubab with it. And narrated by Al-Bukhari number (3409, 4736, 4738, 6614, 7515) from the path of: Humaid bin Abd al-Rahman, Muhammad bin Sirin, Abu Salamah bin Abd al-Rahman, and Tawus. All of them from Abu Huraira with it. And see the answer of Sheikh Al-Islam Ibn Taymiyyah to this hadith in what his student Ibn Al-Qayyim transmitted from him in referencing narration number (7).",
    "book_id": "153",
    "new_page_number": 30
  },
  {
    "serial_number": "1281026",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 33,
    "volume_number": 1,
    "text": "(2) - Al-Harith said: And Abd al-Rahman bin Hurmuz told us, from Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, with that (1). (3) - And Abu Bakr; Abdullah bin Suleiman told us, said: And Ahmad bin Sa'id bin Bishr Al-Hamdani told us, Ibn Wahb informed us, said: Hisham bin Sa'd informed me, from Zaid bin Aslam, from his father, from Omar bin Al-Khattab, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, with that (2).",
    "foot_note": "1. Narrated by Abu Awanah in his \"Mustakhraj\" [see \"Ithaf Al-Maharah\" (15/ 32)] from Yunus bin Abd al-A'la, from Ibn Wahb, from Anas bin Iyad, from Al-Harith with it. And narrated by Muslim number [15 - (2652)], Ibn Abi Asim in \"Al-Sunnah\" number (162), and Al-Bayhaqi in \"Al-Asma' wa Al-Sifat\" number (493) from Anas bin Iyad, from Al-Harith with it. And narrated by Ibn Khuzaymah in \"Al-Tawhid\" (1/ 123) from Al-Harith bin Abd al-Rahman with it. \n2. Narrated by Abu Dawud number (4702), Ibn Abi Asim in \"Al-Sunnah\" number (143), Al-Firyabi in \"Al-Qadar\" number (117), Abu Ya'la number (243), Ibn Khuzaymah in \"Al-Tawhid\" number (205), Al-Ajurri in \"Al-Shari'ah\" number (352, 353), Ibn Mandah in \"Al-Radd 'ala Al-Jahmiyyah\" number (294), and in \"Al-Tawhid\" by him also number (476), Al-Lalaka'i number (551), Al-Bayhaqi in \"Al-Asma' wa Al-Sifat\" number (421), and in \"Al-Qadar\" by him also number (27), Al-Najjad in \"Al-Radd 'ala Man Yaqul bi Khalq Al-Qur'an\" number (30), and Ibn Batta in \"Al-Ibanah\" number (1378). All of them from the path of Ibn Wahb with it. Zaid bin Aslam and his father are trustworthy. Hisham bin Sa'd was weakened by the majority, and Abu Dawud said about him: The most established of people in Zaid bin Aslam. \"Tahdhib Al-Kamal\" (30/ 208). Sheikh Al-Islam Ibn Taymiyyah said: A good (Hasan) chain. \"Majmu' Al-Fatawa\" (8/ 304).",
    "book_id": "153",
    "new_page_number": 31
  },
  {
    "serial_number": "1281027",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 34,
    "volume_number": 1,
    "text": "(4) - Abdullah bin Suleiman told us, Al-Hamdani told us, said: Ibn Wahb informed us, said: Usama bin Zaid Al-Laythi informed me, from Omar bin Al-Hakam bin Thawban, that he heard Abu Huraira, may Allah be pleased with him, narrating from the Messenger of Allah, peace and blessings be upon him, similar to that (1). (5) - Abdullah bin Suleiman told us, said: And Al-Hamdani told us, said: Ibn Wahb informed us, said: Yunus informed me, from Ibn Shihab, from Humaid bin Abd al-Rahman; that he heard Abu Huraira narrating from the Messenger of Allah, peace and blessings be upon him, similar to that (2).",
    "foot_note": "1. Narrated by Ibn Abi Asim in \"Al-Sunnah\" number (166), Al-Hasan bin Ali told us, Ahmad bin Salih told us, Ibn Wahb told us, from Yunus, from Al-Zuhri, from Omar bin Al-Hakam with it. \n2. Narrated by Abu Awanah in his \"Mustakhraj\" [see \"Ithaf Al-Maharah\" (14/ 456)] from Yunus bin Abd al-A'la, said: Ibn Wahb informed us with it. And narrated by Al-Bukhari number (3409) from the path of Ibrahim bin Sa'd, from Ibn Shihab with it.",
    "book_id": "153",
    "new_page_number": 32
  },
  {
    "serial_number": "1281028",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 35,
    "volume_number": 1,
    "text": "(6) - Abdullah bin Suleiman told us, said: Al-Hamdani informed us, said: Ibn Wahb informed us, said: Malik bin Anas and Ibn Abi Al-Zinad informed us, from Al-A'raj (1), from (2) Abu Huraira, from the Prophet, peace and blessings be upon him, similar to that (3). (7) z- Abu Bakr; Muhammad bin Ismail said: And Al-Hussein bin [Ismail bin] (4) Muhammad bin Ismail Al-Dabbi the Judge; Abu Abdullah (5) told us, said: Ahmad bin Ismail Al-Madani told us, said: Malik told us, from Abu Al-Zinad, from Al-A'raj,",
    "foot_note": "1. Thus it appeared in the three manuscripts: \"Malik bin Anas and Ibn Abi Al-Zinad, from Al-A'raj\" and what is in \"Al-Mustakhraj\" by Abu Awanah: \"Ibn Wahb, from Malik and Ibn Abi Al-Zinad, from Abu Al-Zinad, from Al-A'raj...\". So either the phrase \"from Abu Al-Zinad\" fell from this narration, or fell from the copyist, which is closer in my view. And Allah knows best. \n2. In The Original: \"in\", and established from (Z) and (H). \n3. Narrated by Abu Awanah in his \"Mustakhraj\" [see \"Ithaf Al-Maharah\" (15/ 232)] from Yunus bin Abd al-A'la, from Ibn Wahb, from Malik and Ibn Abi Al-Zinad, from Abu Al-Zinad, from Al-A'raj with it. And narrated by Malik in \"Al-Muwatta\" number (2616) and via his path Muslim number [14 - (2652)], and narrated by Al-Bukhari number (6614) from Abu Al-Zinad, from Al-A'raj with it. \n4. Missing from the three manuscripts, and retrieved from hadith number (10), and number (47) where his name appeared correctly as in the sources of his biography. \n5. He is: Abu Abdullah; Al-Hussein bin Ismail bin Muhammad bin Ismail bin Sa'id bin Aban, Al-Dabbi Al-Baghdadi Al-Mahamili. Al-Dhahabi said: The Judge, the Imam, the Scholar, the Muhaddith, the Trustworthy, the Musnid of the time. See: \"Tarikh Baghdad\" (8/ 19), and \"Siyar A'lam Al-Nubala\" (15/ 258).",
    "book_id": "153",
    "new_page_number": 33
  },
  {
    "serial_number": "1281029",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 36,
    "volume_number": 1,
    "text": "from Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, with that (1). (8) - Abdullah bin Suleiman bin Al-Ash'ath told us, said: Ahmad bin Sa'id Al-Hamdani told us, said: Ibn Wahb informed us, said: Hisham bin Sa'd informed me, from Zaid bin Aslam, from Ata bin Yasar, from Abu Huraira, that the Messenger of Allah, peace and blessings be upon him, said: \"When Allah Mighty and Majestic created Adam, He wiped his back, so every soul (*) that will be (2) until the Day of Resurrection fell from his back. He showed them to Adam, so he saw (3) in the face of a man (4) among them a glimmer (5) of light, and he saw a man among them who had a glimmer*, so it pleased him. He said: Who is this, O Lord?",
    "foot_note": "1. Ibn Al-Qayyim said: \"So Moses - blessings of Allah and peace be upon him - is more knowledgeable of Allah and His names and attributes than to blame for a sin from which its doer has repented; and his Lord chose him after it, guided him and selected him. And Adam - blessings of Allah upon him and peace - is more knowledgeable of his Lord than to argue with His decree and destiny for his disobedience. Rather, Moses only blamed Adam for the calamity that befell the offspring by their exit from Paradise, and their descent to the abode of trial and tribulation, because of their father's sin. So he mentioned the sin to draw attention to the cause of the calamity and tribulation that befell the offspring, and for this reason he said to him: You expelled us and yourself from Paradise. And in a wording: You disappointed us. So Adam argued with Destiny regarding the calamity, and said: Indeed, this calamity that befell the offspring because of my sin; was written and decreed before my creation. And Destiny is used as an argument in calamities, not defects, meaning: Do you blame me for a calamity decreed upon me and upon you before my creation by such and such years? This is the answer of our Sheikh, may Allah have mercy on him.\" \"Shifa Al-Alil\" p. (94). [[* Al-Nasamah: The human being, the self, and the spirit. And every creature with a spirit inside it is a Nasamah. \"Lisan Al-Arab\" (Nsm).]] \n2. Thus in (Z) and (H), and unpointed in The Original. \n3. In The Original: \"Farat\" (missed/hastened), and established from (Z) and (H). \n4. Thus in the three manuscripts. And it came in \"Kitab Al-Qadar\" by Al-Firyabi and Musnad Abu Ya'la: \"In the face of every man\" and they narrated it via the path of Ibn Wahb as will come. \n5. In The Original: \"Wabis\", and established from (Z) and (H). [[* Al-Wabis: The glisten. Wabasa al-shay' yabisu wabsan wa wabisan wa bisatan: glistened and shone. \"Gharib Al-Hadith\" by Abu Ubaid 4/ 333, and \"Al-Lisan\" (Wbs).]]",
    "book_id": "153",
    "new_page_number": 34
  },
  {
    "serial_number": "1281030",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 37,
    "volume_number": 1,
    "text": "He said: This is from your offspring, his name is David. He said: How much is his lifespan, O Lord? He said: Sixty years. He said: Increase him from my lifespan forty years. He said: Then; it is written and sealed and will not be changed. He said: So when Adam's lifespan ran out; except the forty years which he gifted to David; the Angel of Death came to him. Adam said: Forty years remain of my lifespan. He said: Did you not give them to your son David? He said: So he denied; so his offspring denied, and he sinned; so his offspring sinned, and he forgot; so his offspring forgot. So he saw among them the strong and the weak, the rich and the poor, the healthy and the afflicted. He said: O Lord, will You not make them equal? He said: I wanted to be thanked\" (1).",
    "foot_note": "1. Narrated by Al-Firyabi in \"Al-Qadar\" number (20), and Abu Ya'la number (6377) from the path of Asbagh bin Al-Faraj; and Al-Walid bin Shuja', from Ibn Wahb with it. However, Ibn Wahb was contradicted in the chain of this hadith: Ibn Sa'd narrated it in \"Al-Tabaqat\" (1/ 27), Al-Tirmidhi number (3076), Al-Firyabi in \"Al-Qadar\" number (19), Abu Ya'la number (6654), Al-Tabari in \"Al-Tarikh\" (1/ 96), Al-Hakim (2/ 325, 585, 586), and Ibn Mandah in \"Al-Tawhid\" number (455) from Abu Nu'aym; Al-Fadl bin Dukain, Khallad bin Yahya, and Al-Qasim bin Al-Hakam Al-Urani (the three of them) from Hisham bin Sa'd, from Zaid bin Aslam, from Abu Salih; Dhakwan Al-Samman, from Abu Huraira with it. Abu Zur'ah Al-Razi said: The hadith of Abu Nu'aym is more correct, Ibn Wahb erred in his hadith \"Al-Ilal\" by Ibn Abi Hatim (2/ 88) number (1757). And narrated by Ibn Abi Hatim in his \"Tafsir\" (3/ f 207/ a) Al-Maktabah Al-Mahmoudiyah copy in Madinah, corresponding in the printed version (5/ 1614) and it should be noted that this printed version - verified by As'ad Muhammad Al-Tayyib - is full of misspellings, distortions, and omissions, so be aware. And Ibn Mandah in \"Al-Radd 'ala Al-Jahmiyyah\" p. (50) from Abd al-Rahman bin Zaid bin Aslam, from his father, from Ata bin Yasar, from Abu Huraira similar to it. This follow-up (Mutaba'ah) I do not think is beneficial; because Abd al-Rahman bin Zaid bin Aslam is agreed upon to be weak. And Allah knows best.",
    "book_id": "153",
    "new_page_number": 35
  },
  {
    "serial_number": "1281031",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 38,
    "volume_number": 1,
    "text": "(9) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Malik bin Anas informed me, from Zaid bin Abi Unaisah, from Abd al-Hamid bin Abd al-Rahman bin Zaid bin Al-Khattab, from a man from Juhaynah, that Omar bin Al-Khattab, may Allah be pleased with him, was asked about this verse: {And when your Lord took from the children of Adam} the whole verse. Omar said: I heard the Prophet, peace and blessings be upon him, saying: \"Indeed Allah Mighty and Majestic created Adam; and wiped his back with His right hand, so He extracted offspring from it, and said: I created these for Paradise; and with the deeds of the people of Paradise they will work. Then He wiped his back and extracted offspring from it, and said: I created these for the Fire; and with the deeds of the people of the Fire they will work.\" A man said: O (1) Messenger of Allah, then what is the point of deeds? The Messenger of Allah, peace and blessings be upon him, said: \"Indeed Allah Mighty and Majestic, when He creates a servant for Paradise (2), He uses him in the work of the people of Paradise, until he dies on a deed from the deeds of the people of Paradise, so he enters Paradise by it. And when He creates a servant for the Fire,",
    "foot_note": "1. \"O\": Not in The Original, and established from (Z) and (H). \n2. \"For Paradise\": Not in The Original, and established from (Z) and (H).",
    "book_id": "153",
    "new_page_number": 36
  },
  {
    "serial_number": "1281032",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 39,
    "volume_number": 1,
    "text": "He uses him in the work of the people of the Fire, until he dies on a deed from the deeds of the people of the Fire, so he enters the Fire by it\" (1).",
    "foot_note": "1. Narrated by Ibn Abi Hatim in his \"Tafsir\" (3/ f 206/ a) Al-Maktabah Al-Mahmoudiyah copy, corresponding in the printed (Verified!) version (5/ 1612), and Al-Tahawi in \"Bayan Mushkil Ahadith Rasul Allah SAWS\" number (3886) from Yunus bin Abd al-A'la, Abdullah bin Wahb informed us with it. And narrated by Malik in \"Al-Muwatta\" number (2617), and via his path Ahmad (1/ 44), Abu Dawud number (4703), Al-Nasa'i in \"Al-Sunan Al-Kubra\" number (11190), Al-Tirmidhi number (3075), Ibn Abi Hatim in his \"Tafsir\" previous reference, Ibn Jarir Al-Tabari in his \"Tafsir\" (9/ 113) Ed./ Al-Babi (Al-A'raf: 172), Al-Firyabi in \"Al-Qadar\" number (27, 28), Ibn Hibban number (6166), Al-Hakim (2/ 324, 544), Ibn Mandah in \"Al-Tawhid\" number (453), Al-Ajurri in \"Al-Shari'ah\" number (324), Al-Bayhaqi in \"Al-Asma' wa Al-Sifat\" number (710), and in \"Al-Qadar\" by him number (60, 61, 62) and others. From Ibn Abi Unaisah, from Abd al-Hamid bin Abd al-Rahman bin Zaid bin Al-Khattab, from Muslim bin Yasar Al-Juhani, from Omar bin Al-Khattab with it. This is a chain whose men are trustworthy; except Muslim bin Yasar Al-Juhani. Ibn Ma'in said: Not known. Ibn Abd al-Barr said: A Medinan man, unknown. \"Al-Tamhid\" (6/ 4). Al-Ijli said: Trustworthy. And Ibn Hibban mentioned him in \"Al-Thiqat\". \"Tahdhib Al-Kamal\" (27/ 557). Abu Zur'ah Al-Razi said: Muslim bin Yasar from Omar: Mursal (disconnected). \"Al-Marasil\" by Ibn Abi Hatim (165). And Malik bin Anas was contradicted in the chain of this hadith as well: Contradicted by each of: \n1 -. Khalid bin Abi Yazid - who is trustworthy - in Al-Tahawi in \"Bayan Al-Mushkil\" number (3888), Ibn Mandah in \"Al-Tawhid\" (454), and Ibn Abd al-Barr in \"Al-Tamhid\" (6/ 4 - 5). \n2 -. Yazid bin Sinan - who is weak - in Al-Bukhari in \"Al-Tarikh Al-Kabir\" (8/ 97), Ibn Abi Asim in \"Al-Sunnah\" (201), and Al-Tahawi in \"Bayan Al-Mushkil\" (3887). \n3 -. Omar bin Ju'tham - who is acceptable as in \"Al-Taqrib\" - in Abu Dawud number (4704), and Al-Tabari number (15369). The three of them (Khalid bin Abi Yazid, Yazid bin Sinan, and Omar bin Ju'tham) from Zaid bin Abi Unaisah, from Abd al-Hamid bin Abd al-Rahman bin Zaid, from Muslim bin Yasar, from Nu'aym bin Rabi'ah, from Omar bin Al-Khattab with it. This connected narration mentioning Nu'aym bin Rabi'ah was preferred over Malik's narration by: Al-Tahawi, Al-Daraqutni, and Al-Mizzi. And Ibn Kathir's claim, may Allah have mercy on him, that Imam Malik dropped Nu'aym bin Rabi'ah deliberately when he was ignorant of his condition. See: \"Al-Ilal\" by Al-Daraqutni (2/ 222), \"Al-Ahadith Allati Khulifa Fiha Malik\" by him also p. (156), \"Tahdhib Al-Kamal\" (27/ 556), \"Tafsir Ibn Kathir\" (Al-A'raf: 172). While Malik's disconnected narration was preferred by: Ibn Abd al-Barr, and Ibn Al-Qayyim. \"Shifa Al-Alil\" p. (69). Al-Tirmidhi said: This is a Hasan (good) hadith, and Muslim bin Yasar did not hear from Omar. Ibn Abd al-Barr said: This hadith - even if its chain has defects - its meaning from the Prophet, peace and blessings be upon him, has been narrated from many aspects.",
    "book_id": "153",
    "new_page_number": 37
  },
  {
    "serial_number": "1281033",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 40,
    "volume_number": 1,
    "text": "(10) (z) - Muhammad bin Ismail Al-Warraq said: And Abu Abdullah Al-Hussein bin Ismail bin Muhammad Al-Dabbi informed us of it, said: Ahmad bin Ismail Al-Madani told us, said: Malik bin Anas told us, from Zaid bin Abi Unaisah, that Abd al-Hamid bin Abd al-Rahman bin Zaid bin Al-Khattab informed him, from Muslim bin Yasar Al-Juhani informed him, that Omar bin Al-Khattab, may Allah be pleased with him, was asked about this verse, so he mentioned the hadith similarly.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 38
  },
  {
    "serial_number": "1281034",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 41,
    "volume_number": 1,
    "text": "(11) (z) - Abu Muhammad; Abd al-Rahman bin Muhammad bin Abd al-Rahman Al-Qurashi known as Abu Sakhrah told us; in the year three hundred and nine, said: Abu Musa; Ishaq bin Musa Al-Ansari told us H (1) said: And Ma'n bin Isa Al-Qazzaz told us, said: Malik bin Anas informed us, from Zaid bin Abi Unaisah, so he mentioned with his chain from Omar, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, similar to it. (12) - Abdullah bin Suleiman bin Al-Ash'ath told us, said (2): Ahmad bin Sa'id Al-Hamdani informed us, said: Ibn Wahb informed us, said: Jarir bin Hazim informed me, from Ayyub Al-Sakhtiyani, from Abu Qilabah, said: When Allah Mighty and Majestic created Adam (3) peace be upon him, He extracted his offspring, then scattered them in His hand, then poured them out, so He threw those in His right to His right, and those in His other hand to His left, then said: These for this and I do not care, and these for this and I do not care, and He wrote the people of the Fire and what they will do, and the people of Paradise and what they will do, and folded the book, and lifted the pen (4).",
    "foot_note": "1. In (Z): H with it. \n2. \"Said\": Dropped from (Z). \n3. In The Original: \"Allah created Adam\", and established from (Z) and (H) and \"Shifa Al-Alil\". \n4. Narrated by Ibn Batta in \"Al-Ibanah\" number (1344) from the path of Ahmad bin Sa'id Al-Hamdani, said: Ibn Wahb informed me with it. And Ibn Al-Qayyim transmitted it from \"Kitab Al-Qadar\" by Ibn Wahb with its chain and text identical. \"Shifa Al-Alil\" p. (76). And narrated by Musaddad bin Musarhad in his \"Musnad\" [see \"Al-Matalib Al-Aliyah\" number (2983)], and from him Abu Dawud in \"Al-Qadar\" [see \"Shifa Al-Alil\" p. (76)], and from his path Ibn Batta in \"Al-Ibanah\" number (1343) from Hammad bin Zaid, from Ayyub, from Abu Qilabah, from Abu Salih by narration. So he mentioned it. Al-Busiri said: Its men are trustworthy. \"Mukhtasar Al-Ithaf\" (1/ 120). And see: \"Ithaf Al-Khiyarah Al-Maharah\" (1/ f 35).",
    "book_id": "153",
    "new_page_number": 39
  },
  {
    "serial_number": "1281035",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 42,
    "volume_number": 1,
    "text": "(13) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Ibn Lahi'ah, Al-Layth bin Sa'd, and Amr bin Al-Harith informed us, from Abu Qabil Al-Ma'afiri, from Shufayy Al-Asbahi, from a man from the companions of the Prophet, peace and blessings be upon him, said: The Messenger of Allah, peace and blessings be upon him, came out to us and in his hand were two books, he said: \"Do you know what this is?\". He said: So we said: No; unless you inform us, O Messenger of Allah. He said: \"This is a book from the Lord of the Worlds, in it are the names of the people of Paradise, and the names of their fathers and tribes, and it was summed up* to the last of them, so none will be added to them, nor decreased from them ever, and this is the book of the people of the Fire with their names, and the names of their fathers and tribes, and it was summed up to the last of them, so none will be added to them nor decreased from them ever.\" The companions (1) of the Prophet, peace and blessings be upon him, said: Then what is the point of deeds; if the matter has been finished? The Messenger of Allah, peace and blessings be upon him, said: \"Be steadfast and come close, for the person of Paradise will be sealed (2) for him with the work of the people of Paradise, even if he did whatever work, and the person of the Fire will be sealed for the Fire (3), even if he did whatever work, your Lord Mighty and Majestic has finished with the Book (4)\".",
    "foot_note": "1. [[* Ibn Manzur said: i.e., they were counted and gathered so none will be added to them nor decreased. \"Al-Lisan\" (Jml).]] () In The Original \"Companion\", and established from (Z) and (H). \n2. \"Sealed\": Not in The Original, and established from (Z) and (H). \n3. \"For the Fire\" not clear in The Original due to photocopy, and established from (Z) and (H), and in \"Tafsir Al-Tabari\": \"Sealed for him with the work of the Fire\", and he narrated it from the path of Ibn Wahb as will come. \n4. In \"Tafsir Al-Tabari\": The Servants.",
    "book_id": "153",
    "new_page_number": 40
  },
  {
    "serial_number": "1281036",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 43,
    "volume_number": 1,
    "text": "Then the Messenger of Allah, peace and blessings be upon him, said: \"Your Lord has finished with the Creation {A group in Paradise and a group in the Blaze} [Al-Shura: 7]\" (1).",
    "foot_note": "1. In \"Tafsir Al-Tabari\": Then the Messenger of Allah, peace and blessings be upon him, gestured with his hands and cast them away: Finished... Narrated by Ibn Jarir Al-Tabari in his \"Tafsir\" (Al-Shura: 7) (25/ 7) Ed./ Bulaq, (25/ 9) Ed./ Al-Babi Al-Halabi. From Yunus bin Abd al-A'la, Abdullah bin Wahb informed us with it. And narrated by Ahmad (2/ 167), Al-Tirmidhi number (2141), Al-Nasa'i in \"Al-Sunan Al-Kubra\" number (11473), Al-Darimi in \"Al-Radd 'ala Al-Jahmiyyah\" number (263), Ibn Abi Hatim in his \"Tafsir\" [see \"Tafsir Ibn Kathir\" (Al-Shura: 7)], Al-Firyabi in \"Al-Qadar\" number (45), Al-Ajurri in \"Al-Shari'ah\" number (333, 334), Ibn Abi Asim in \"Al-Sunnah\" number (348), Ibn Batta in \"Al-Ibanah\" number (1327), Abu Nu'aym in \"Al-Hilyah\" (5/ 168), Al-Bayhaqi in \"Al-Qadar\" number (56, 57), Al-Baghawi in \"Al-Tafsir\" (7/ 185) with their chains from Abu Qabil Al-Ma'afiri, from Shufayy Al-Asbahi, from Abdullah bin Amr bin Al-Aas with it. Shufayy: is Ibn Mati' Al-Himyari: Trustworthy. And Abu Qabil Al-Ma'afiri's name is: Huyayy bin Hani, declared trustworthy by: Ahmad bin Hanbal, Yahya bin Ma'in, Abu Zur'ah Al-Razi, Al-Fasawi, Ahmad bin Salih Al-Masri, and Ibn Abd al-Barr and he said: I know of no disagreement concerning him. Al-Saji said: Ibn Ma'in weakened him. I say: This is rejected against Al-Saji for two reasons: \n1 -. Because it contradicts what Al-Darimi quoted from Ibn Ma'in that he declared him trustworthy. \n2 -. Because it contradicts the statements of all the Imams, and the validation aligns with their statements so it is more worthy, indeed Ibn Abd al-Barr denied knowing any criticism regarding him. And this Abu Qabil was followed up; in what Al-Bayhaqi narrated in \"Al-Qadar\" number (58), and Al-Baghawi in his \"Tafsir\" (7/ 185) from Bishr bin Zakariya, from Sa'id bin Sinan, from Abu Al-Zahiriyah, from Abdullah bin Amr with it. Bishr: Trustworthy. And Abu Al-Zahiriyah's name is: Hudayr bin Kuraib: Truthful. And Sa'id bin Sinan: Abandoned. And its chain was distorted in the printed \"Tafsir Al-Baghawi\" a repulsive objectionable distortion, so be aware. The hadith has many witnesses; from the hadith of Abdullah bin Umar, Al-Bara' bin Azib, Abdullah bin Abbas, Abdullah bin Busr, and Ali bin Abi Talib. See them in our referencing of the hadiths of \"Shifa Al-Alil\" p. (66). [[* Al-'Azl: A man withdrawing water (semen) from his slave girl when having intercourse with her so she does not conceive. \"Al-Lisan\" ('Azl). Al-Fayyumi said: The one having intercourse does 'Azl: When he approaches ejaculation, he withdraws and emits semen outside the vulva. \"Al-Misbah Al-Munir\" ('Azl).]]",
    "book_id": "153",
    "new_page_number": 41
  },
  {
    "serial_number": "1281037",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 44,
    "volume_number": 1,
    "text": "And the Messenger of Allah (peace be upon him) said: «Deeds are by their endings». Except that 'Amr said in the hadith: They said: 'Glory be to Allah! Then why do we work and toil?' And he said in the hadith: So the Messenger of Allah (peace be upon him) said: «Then the work is towards an ending». (14) - Abdullah bin Wahb told us, said: Hisham bin Sa'd informed me, from Yahya bin Hassan Al-Bakri, who said: I came to Medina as a pilgrim, so I met Ibn Al-Musayyib and said: 'O Abu Muhammad, what do you say regarding Al-'Azl (coitus interruptus)?' He said: 'If you wish, I will tell you a concise hadith. When Allah created Adam, He showed him a honor that He showed to no one else of His creation. He showed him every soul (Nasamah) He is the Creator of between His hands until the Day of Resurrection. So whoever tells you that He increases them or decreases them has lied. Even if I had seventy [children], I would not care.' (15) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Amr bin Al-Harith and Haywah bin Shurayh informed me, from Ibn Abi Usayd - thus he said -, from Abu Firas who told him (1),",
    "foot_note": "1. In 'Shifa Al-Alil' by Ibn Al-Qayyim p. (76): That he told him.",
    "book_id": "153",
    "new_page_number": 42
  },
  {
    "serial_number": "1281038",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 45,
    "volume_number": 1,
    "text": "that he heard Abdullah bin Amr say: Indeed, when Allah, Mighty and Majestic, created Adam, peace be upon him, He shook him like the shaking of a provision bag (Mizwad)*, and brought forth from his back his offspring like Naghaf (maggots/worms)*. He grasped them with two grasps, then cast them, then grasped them, and said: {A group in Paradise and a group in the Blaze} (1) [Al-Shura: 7]. (16) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Yunus bin Yazid informed me, from Ibn Shihab, from Abu Salamah bin Abd al-Rahman, from Abu Hurairah, may Allah be pleased with him, who said: I came to the Messenger of Allah (peace be upon him) and said: 'O Messenger of Allah, I am a young man, and I fear Al-'Anat (sin/hardship)* for myself, and I do not find the means to marry women, so permit me to castrate myself?' He said: He remained silent toward me. Then I said the like of that three times. So the Messenger of Allah (peace be upon him) said: «O Abu Hurairah, the Pen has dried regarding what (2) you will encounter, so castrate yourself on that basis or leave it» (3).",
    "foot_note": "1. [[* Al-Mizwad: A container in which provisions are put. 'Al-Lisan' (Zwd).]] [[* Al-Naghaf: Al-Asma'i said: It is the worm found in the noses of camels and sheep. He said: It is also the white worm found in date pits if soaked. Singular: Naghafah. He said: Other worms are not called Naghaf. 'Gharib Al-Hadith' 4/203.]] () Narrated by Ibn Jarir Al-Tabari in his 'Tafsir' (Al-Shura: 7) (25/7) from the path of Yunus bin Abd al-A'la, from Ibn Wahb with it. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (76) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text identical. Al-Bayhaqi narrated it in 'Al-Asma' wa Al-Sifat' from Yahya bin Abi Usayd Al-Masri with it. Abu Firas: He is Yazid bin Rabah Al-Sahmi; freedman of Ibn Amr: Trustworthy. And Yahya bin Abi Usayd; Al-Bukhari mentioned him in 'Al-Tarikh Al-Kabir' (8/161), and Ibn Abi Hatim in 'Al-Jarh wa Al-Ta'dil' (9/129) and remained silent about him. Ibn Hibban listed him in 'Al-Thiqat' (9/251). [[* Al-'Anat: Corruption, sin, immorality, and fornication. 'Al-Lisan' (Ant).]] \n2. In (Z) and (H): 'Fi-ma' (in what). \n3. Al-Bukhari narrated it # (5076) in a suspended form (Mu'allaq) with a decisive tone; he said: Asbagh bin Al-Faraj said: Ibn Wahb told me. Al-Firyabi narrated it in 'Al-Qadar' # (437), and from him Al-Ajurri in 'Al-Shari'ah' # (570), and Ibn Batta in 'Al-Ibanah' # (2010) from Asbagh bin Al-Faraj. Ibn Abi Asim narrated it in 'Al-Sunnah' # (114) from Ahmad bin Salih Al-Masri (abridged). Al-Bayhaqi narrated it in 'Al-Qadar' # (214) from Khalid bin Khidash. He also narrated it in 'Al-Sunan Al-Kubra' (7/97) from Harmalah. Al-Quda'i narrated it in 'Musnad Al-Shihab' # (604) from Yunus bin Abd al-A'la. All of them (Asbagh bin Al-Faraj, Ahmad bin Salih Al-Masri, Khalid bin Khidash, Harmalah, and Yunus bin Abd al-A'la) from Ibn Wahb with it.",
    "book_id": "153",
    "new_page_number": 43
  },
  {
    "serial_number": "1281039",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 46,
    "volume_number": 1,
    "text": "(17) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Abu Hani' Al-Khawlani informed me, from Abu Abd al-Rahman Al-Hubuli, from Abdullah bin Amr bin Al-Aas, may Allah be pleased with him, who said: I heard the Messenger of Allah (peace be upon him) say: «Allah, Mighty and Majestic, wrote the decrees of the creations before He created the heavens and the earth by fifty thousand years, he said: And His Throne was upon the water» (1).",
    "foot_note": "1. Ibn Wahb narrated it in his book 'Al-Jami'' # (580) with the wording: 'Allah created the decrees of creation...'. Muslim narrated it # (2653) from Ahmad bin Amr bin Abdullah bin Sarh. Al-Firyabi narrated it in 'Al-Qadar' # (85), and from him Al-Ajurri in 'Al-Shari'ah' # (341) from Abd al-Rahman bin Ibrahim Al-Dimashqi. Al-Ajurri narrated it in 'Al-Shari'ah' # (342), Ibn Batta in 'Al-Ibanah' # (1345), and Ibn Abi Zamanin in his 'Usul Al-Sunnah' # (120) from Yunus bin Abd al-A'la. All of them (Ahmad bin Amr, Abd al-Rahman bin Ibrahim Al-Dimashqi, and Yunus bin Abd al-A'la) from Ibn Wahb with it. Al-Lalaka'i narrated it # (1025, 1026) from Yunus bin Abd al-A'la, from Ibn Wahb, from Haywah bin Shurayh, from Abu Hani' Al-Khawlani with it.",
    "book_id": "153",
    "new_page_number": 44
  },
  {
    "serial_number": "1281040",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 47,
    "volume_number": 1,
    "text": "(18) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Amr bin Al-Harith informed me, from Abu Al-Zubayr, from Jabir bin Abdullah, that he said: 'O Messenger of Allah, do we work for a matter that has been finished, or a matter we start anew (Na'tanifuhu)*?' He said: «For a matter that has been finished». Suraqah - meaning Ibn Malik - said: 'Then what is the point of working?' The Messenger of Allah (peace be upon him) said: «Every worker is facilitated for his work» (1). (19) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Usamah bin Zaid informed me (2), from Amr bin Shu'ayb, from his father, from his grandfather,",
    "foot_note": "1. [[* Na'tanifuhu: We take its beginning and start it. 'Al-Lisan' (Anf).]] () Narrated by Ahmad (3/335) from Harun bin Ma'ruf. Muslim # (2648) from Abu Al-Tahir bin Al-Sarh. Al-Bukhari in 'Khalq Af'al Al-Ibad' # (214) from Asbagh bin Al-Faraj. Abu Ya'la in his 'Musnad' # (2054) from Abu Hammam (Al-Walid bin Shuja'). Abu Awanah in his 'Mustakhraj' [See 'Ithaf Al-Maharah' 3/493] from Yunus bin Abd al-A'la and Abu Thabit (Muhammad bin Ubaydullah). Ibn Hibban # (336) from Harmalah bin Yahya. All of them (Abu Al-Tahir, Harun bin Ma'ruf, Asbagh bin Al-Faraj, Abu Hammam, Yunus bin Abd al-A'la, Abu Thabit, and Harmalah bin Yahya) from Ibn Wahb with it. \n2. The scribe of the original manuscript repeated Hadith # (15) here, and indicated that this happened by mistake by placing 'La' (No) at its beginning and 'Ila' (To) at its end.",
    "book_id": "153",
    "new_page_number": 45
  },
  {
    "serial_number": "1281041",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 48,
    "volume_number": 1,
    "text": "that Umar bin Al-Khattab asked the Messenger of Allah (peace be upon him) upon his return from Badr about that; so he told him the like of that; except that he said: «Everyone is facilitated for what Allah, Mighty and Majestic, wrote for him» (1). (20) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Yunus informed me, from Ibn Shihab, from Ibn Al-Musayyib, that Umar bin Al-Khattab asked the Messenger of Allah (peace be upon him) (2): «Nay (3), it is not attained except by work». Umar said: 'Then we shall strive' (4).",
    "foot_note": "1. Ibn Batta narrated it in 'Al-Ibanah' # (1353) from Al-Rabi' bin Sulaiman, from Ibn Wahb completely. \n2. The phrase appeared abbreviated like this in the three manuscripts. See the complete hadith in the sources of referencing. \n3. In (Z) and (H): 'Kull' (All/Every). \n4. Al-Firyabi narrated it in 'Al-Qadar' # (30) from Asbagh bin Al-Faraj, from Yunus bin Yazid with it. Abdul-Razzaq Al-San'ani narrated it (11/111) and from his path Al-Lalaka'i # (1556) and Ibn Batta # (1323) from Ma'mar. Ibn Abi Asim narrated it in 'Al-Sunnah' # (167) and Al-Firyabi in 'Al-Qadar' # (29) from Al-Zubaidi. Ibn Abi Asim narrated it in 'Al-Sunnah' also # (162) from Baqiyyah, from Al-Awza'i. Al-Daraqutni suspended it in 'Al-Ilal' # (134) from Yahya Al-Qattan, from Al-Awza'i. All of them (Ma'mar, Al-Zubaidi, and Al-Awza'i) from Ibn Shihab Al-Zuhri, from Ibn Al-Musayyib, from Umar bin Al-Khattab with it. There is disagreement regarding Al-Awza'i in its chain: Al-Firyabi narrated it in 'Al-Qadar' # (31), Ibn Abi Asim in 'Al-Sunnah' # (165), Al-Bazzar ['Mukhtasar Zawa'idihi' by Ibn Hajar # (1601)], and Ibn Hibban in his 'Sahih' # (108) from Anas bin Iyad, from Al-Awza'i, from Ibn Shihab, from Sa'id bin Al-Musayyib, from Abu Hurairah, that Umar bin Al-Khattab... Al-Bazzar said: More than one person narrated it from Al-Zuhri, from Sa'id, that Umar said... And we do not know anyone who connects it to Abu Hurairah except Anas. Al-Daraqutni said: The Mursal (disconnected) version is more correct. 'Al-Ilal' # (134). I say: So the first aspect is the preserved one. It is the hadith of Ibn Al-Musayyib from Umar. See Hadith # (49) of this book.",
    "book_id": "153",
    "new_page_number": 46
  },
  {
    "serial_number": "1281042",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 49,
    "volume_number": 1,
    "text": "(21) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Jarir bin Hazim informed me, Al-Hasan bin Amarah (1) told us (2) and others the like of that. Then the Messenger of Allah (peace be upon him) recited: {As for he who gives and fears Allah * And believes in the best [reward] * We will ease him toward ease * But as for he who withholds and considers himself free of need * And denies the best [reward] * We will ease him toward difficulty} [Al-Layl: 5-10]. (22) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Yunus bin Yazid informed me, from Abd al-Rahman bin Amr Al-Awza'i, that Umar bin Al-Khattab, may Allah be pleased with him, came to Sham (the Levant) and addressed the people",
    "foot_note": "1. In (Z) and (H): 'wa' (and), and corrected in the margin of (Z) to 'an' (from). \n2. Al-Hasan bin Amarah, Abu Muhammad, the Judge of Baghdad: Abandoned (Matruk). See 'Tahdhib Al-Kamal' (6/268).",
    "book_id": "153",
    "new_page_number": 47
  },
  {
    "serial_number": "1281043",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 50,
    "volume_number": 1,
    "text": "at Al-Jabiyah (1). The Catholicos (2) was near him. Umar said in his sermon: 'Whomever Allah leads astray, there is no guide for him.' The Catholicos said: 'Allah does not lead anyone astray!' Umar said: 'What does he say?' They informed him. Umar said: 'You lied, O enemy of Allah. Rather, Allah created you, He leads you astray, He causes you to die, He resurrects you, and He enters you into the Fire if Allah (3) wills. By Allah, were it not for my pact [with you], I would have struck your neck. Indeed, when Allah created Adam, He took his offspring, and wrote the people of Paradise and what they will do, and wrote the people of the Fire and what they will do. So these separated; and two do not differ concerning Destiny (Al-Qadar)' (4). (23) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Amr (5) bin Muhammad informed me,",
    "foot_note": "1. A village located in northern Hawran, in the Levant, in the district of Golan, near Marj al-Suffar. If a person stands in 'Al-Sanamayn' facing north, it appears to him, and it also appears from 'Nawa'. 'Mu'jam Al-Buldan' (2/91). \n2. The head of the Christians in Islamic lands, subordinate to the Patriarch of Antioch, then the Metropolitan is under him, then the Bishop. 'Al-Qamus Al-Muhit' (Al-Jathaliq) (1125), 'Taj Al-Arus' (25/123). \n3. The word 'Allah' is not in (Z) and (H). \n4. The men of its chain are trustworthy; except that Al-Awza'i did not meet Umar. See its referencing in the commentary on the following tradition. \n5. Thus in the three manuscripts, perhaps the correct reading is: 'Umar' as in Hadith (25), who is Umar bin Muhammad bin Zaid bin Abdullah bin Umar bin Al-Khattab Al-Madani, trustworthy as in 'Al-Taqrib'.",
    "book_id": "153",
    "new_page_number": 48
  },
  {
    "serial_number": "1281044",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 51,
    "volume_number": 1,
    "text": "that Ibn Abbas, may Allah be pleased with them both, said: While (1) I was with Umar bin Al-Khattab in Sham, he said to me: 'O Abdullah bin Abbas, give permission for the people [to enter].' I said: 'O Commander of the Faithful, here are the Christians and the greatest of their leaders.' He said: 'Give permission for them.' So he sat in a corner, and I gave permission for him, so he sat. He mentioned similar to this hadith (2).",
    "foot_note": "1. Thus in the Original, and in (Z) and (H): 'Baynama'. \n2. The men of its chain are trustworthy as well; except that Al-Umari did not meet Ibn Abbas. This is if 'Amr' is a misspelling of 'Umar'. However, it was narrated connected from another path: Abu Dawud narrated it in 'Al-Qadar' [See 'Shifa Al-Alil' p. (275)], Al-Darimi in 'Al-Radd 'ala Al-Jahmiyyah' # (257), Abdullah bin Ahmad in 'Al-Sunnah' # (929), Ibn Abi Hatim in his 'Tafsir' (3/ L 212/ A) Mahmidiyah Library copy, corresponding to the printed (verified!) version (5/1625), Al-Firyabi in 'Al-Qadar' # (54, 55), and from him Al-Ajurri in 'Al-Shari'ah' # (417), Ibn Batta in 'Al-Ibanah' # (1560, 1561), Al-Lalaka'i in 'Sharh Usul I'tiqad Ahl Al-Sunnah' # (1197), Al-Asbahani in 'Al-Hujjah' (2/61), and Al-Bayhaqi in 'Al-Qadar' # (361). With their chains from Khalid Al-Hadhdha, from Abd al-A'la bin Abdullah bin Amir, from Abdullah bin Al-Harith, from Umar bin Al-Khattab with it. This is a chain whose men are trustworthy; except Abd al-A'la bin Abdullah. Al-Bukhari mentioned him in 'Al-Tarikh Al-Kabir' (6/71), and Ibn Abi Hatim in 'Al-Jarh wa Al-Ta'dil' (6/27) and remained silent about him. Ibn Hibban listed him in 'Al-Thiqat' and counted him among the Tabi'in of Basra. Ibn Hajar said: Acceptable. Al-Thawri narrated it from Khalid Al-Hadhdha, from Abdullah bin Al-Harith bin Nawfal, from Umar bin Al-Khattab with it, in what Al-Lalaka'i narrated # (1198). Meaning: He dropped Abd al-A'la. It appears: That Khalid Al-Hadhdha sometimes narrated it as Mursal (disconnected); as in Al-Lalaka'i's narration mentioned above, and connected it most of the time; as in Abu Dawud and Al-Darimi's narration; where Al-Thawri narrated it from Khalid Al-Hadhdha connected, agreeing with the group. Ubaydullah bin Abd al-A'la followed Khalid Al-Hadhdha, narrating from his father, in what Al-Lalaka'i narrated # (1199). So it revolves around Abd al-A'la bin Abdullah. Imam Abu Hanifa narrated it from Hammad, from Ibrahim, from Alqamah, from Ibn Masud, that Umar bin Al-Khattab... Ibn Kathir said: This has been narrated via many paths from Umar. 'Musnad Al-Faruq' (2/640). [[* Adhada hujjatahu: Invalidated it. 'Al-Lisan' (Dhd).]]",
    "book_id": "153",
    "new_page_number": 49
  },
  {
    "serial_number": "1281045",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 52,
    "volume_number": 1,
    "text": "(24) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Yunus bin Yazid informed me, from Al-Awza'i, from Abdullah bin Amr bin Al-Aas, may Allah be pleased with them both, who said: 'Whoever claims that with Allah there is another judge or provider, or possesses for himself harm or benefit, death or life or resurrection, meets Allah and He invalidates (Adhada)* his argument, burns (1) his tongue, makes his prayer and fasting scattered dust (2), cuts off the means for him, and throws him on his face in the Fire. And he said: Indeed, Allah created the creation, took the covenant from them, and His Throne was upon the water (3).'",
    "foot_note": "1. Thus in the three manuscripts and 'Shifa Al-Alil' with an unpointed Ha, and corrected in the margin of (Z) to: 'Akhraq' (pierced/tore) with a pointed Kha. In 'Al-Ibanah' and 'Sharh Usul Al-I'tiqad': 'Akhras' (muted). See - for references - the referencing of the hadith. \n2. In 'Shifa Al-Alil': Scattered dust (Haba'an Manthura). \n3. Ibn Batta narrated it in 'Al-Ibanah' # (1642) from Al-Hamdani, from Ibn Wahb with it. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (77) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text. The men of its chain are trustworthy; except that it is disconnected between Al-Awza'i and Ibn Amr.",
    "book_id": "153",
    "new_page_number": 50
  },
  {
    "serial_number": "1281046",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 53,
    "volume_number": 1,
    "text": "(25) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Umar bin Muhammad Al-Umari informed me, from Abdullah bin Amr similar to that. And he said in the hadith: Capable (Qadiran) (1). (26) - Abdullah told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Umar bin Muhammad informed me, that Sulayman bin Mihran told him, said: Ubadah bin Al-Samit said: 'Call my son for me - and he was dying - so I might inform him of what I heard from the Messenger of Allah (peace be upon him). I heard the Messenger of Allah (peace be upon him) say: «Indeed, the first thing Allah created of His creation was the Pen, so He said to it: Write. It said: O Lord, write what (2)?»'",
    "foot_note": "1. The men of its chain are trustworthy; except that it is disconnected between Umar bin Muhammad Al-Umari and Abdullah bin Amr. There is disagreement regarding Umar bin Muhammad Al-Umari: Ibn Wahb narrated it as preceded. Mu'ammal bin Ismail - who is truthful with poor memory as in 'Al-Taqrib' - narrated it from him, from Salim, from Abdullah bin Umar bin Al-Khattab. As narrated by Ibn Batta in 'Al-Ibanah' # (1643). Abd al-Majid bin Abd al-Aziz bin Abi Rawwad - who is truthful but makes mistakes as in 'Al-Taqrib' - narrated it from him, from Nafi', from Abdullah bin Umar bin Al-Khattab. As narrated by Al-Lalaka'i in 'Sharh Usul Al-I'tiqad' # (1292). And Allah knows best. \n2. In 'Shifa Al-Alil' p. (57): What shall I write? (Madha Aktub?)",
    "book_id": "153",
    "new_page_number": 51
  },
  {
    "serial_number": "1281047",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 54,
    "volume_number": 1,
    "text": "He said (1): The Destiny (Al-Qadar)». The Messenger of Allah (peace be upon him) said: «So whoever does not believe in Destiny, its good and its bad, Allah Mighty and Majestic burns him with the Fire» (2). (27) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Abdullah bin Wahb informed us, said: Ibn Lahi'ah informed me, from Yazid bin Abi Habib, from Ubadah bin Al-Samit similar to that. Except that he said: «Write. It said: So it wrote what was and what is to be» (3). End of Part One, and Allah is the Grantor of success by His generosity.",
    "foot_note": "1. Thus in the Original, and in (Z) and (H): So He said. \n2. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (57) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text. Its chain is disconnected; because Sulayman bin Mihran Al-A'mash did not meet Ubadah. \n3. Its chain is disconnected; because Yazid bin Abi Habib did not meet Ubadah. However, it was narrated connected - from this path - by mentioning the intermediary between Yazid and Ubadah: Ahmad narrated it (5/317), and Ibn Abi Asim in 'Al-Sunnah' # (107) from Ibn Lahi'ah, from Yazid bin Abi Habib, from Al-Walid bin Ubadah, from Ubadah with it. Abdullah bin Lahi'ah: Weak in hadith according to the general opinion of scholars; whether before mixing or after; regardless of the cause of his mixing, except that the hadith of Abdullah bin Wahb, Abdullah bin Al-Mubarak, and Abdullah bin Yazid (and some add others) is more just than others. And his hadith is valid for consideration (I'tibar) in general. Ata bin Abi Rabah followed him regarding Al-Walid; as narrated by Abu Dawud Al-Tayalisi (577), and from his path Al-Tirmidhi (2155), and Al-Lalaka'i (357) from Abd al-Wahid bin Sulaym, from Ata with it. =",
    "book_id": "153",
    "new_page_number": 52
  },
  {
    "serial_number": "1281048",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 55,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = Abd al-Wahid bin Sulaym: Weak; but he was followed. Al-Firyabi narrated it in 'Al-Qadar' (425), and Ibn Abi Asim in 'Al-Sunnah' # (108) from the path of Baqiyyah bin Al-Walid, Muawiyah bin Sa'id told me, Abdullah bin Al-Sa'ib told me, from Ata bin Abi Rabah, from Al-Walid bin Ubadah with it. Muawiyah bin Sa'id: Ibn Hibban mentioned him in 'Al-Thiqat' (9/166) and said: He narrates disconnected reports (Maqati'). Note: The hadith has many corroborations, but I limited myself to what appeared with the author's wording. See: 'Shifa Al-Alil' p. (55, 56, 57).",
    "book_id": "153",
    "new_page_number": 53
  },
  {
    "serial_number": "1281049",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 56,
    "volume_number": 1,
    "text": "Part Two (1) In the name of Allah, the Entirely Merciful, the Especially Merciful. Sheikh Abu Al-Hussein; Muhammad bin Hasnoun Al-Narsi informed us - reading to him -, he said: Abu Bakr; Muhammad bin Ismail Al-Warraq informed us - reading to him - in Muharram; year three hundred and seventy-five, he said: Abu Bakr (2); Abdullah bin Suleiman bin Al-Ash'ath Al-Sijistani - reading to us - year three hundred and eleven (3). (28) - He said: Abu Ja'far; Ahmad bin Sa'id Al-Hamdani informed us in Egypt, said: Abdullah bin Wahb informed us, said: Ibn Lahi'ah and Al-Layth bin Sa'd informed me, from Qays bin Al-Hajjaj, from Hanash bin Abdullah, from Ibn Abbas, that he said: I was riding behind* the Messenger of Allah (peace be upon him) one day, so he reached (4) with his hand behind his back (5) and said: «O boy, shall I not teach you",
    "foot_note": "1. Not in the Original, and established from (Z) and (H). \n2. Thus in the three manuscripts, perhaps the correct reading: 'He said: Abu Bakr told us' as in the beginning of Part One. \n3. Thus in the Original, and it is definitely correct, and in (Z): 'twenty' which is an error. See p. (31) comment (5). [[* It is said: Radiftu al-rajul: if you rode behind him. 'Al-Lisan' (Rdf).]] \n4. Not clear in the Original; and established from (Z) and (H) and 'Sharh Usul Al-I'tiqad' by Al-Lalaka'i. \n5. In 'Sharh Usul Al-I'tiqad': So he put his hand behind me.",
    "book_id": "153",
    "new_page_number": 54
  },
  {
    "serial_number": "1281050",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 57,
    "volume_number": 1,
    "text": "words (1)? Safeguard Allah, He will safeguard you. Safeguard Allah, you will find Him before you. If you seek help, seek help from Allah. And if you ask, ask Allah. The pens have dried and the pages have been lifted. By the One in Whose Hand is Muhammad's soul, if the nation strove* to benefit you; they would not benefit you except with something Allah has written for you, and if the nation strove to harm you; they would not harm you except with something written against you» (2).",
    "foot_note": "1. Added in 'Sharh Usul Al-I'tiqad' after words: Allah will benefit you with them. [[* Al-Fayyumi said: Jahada fi al-amr jahdan from chapter (Nafa'a): if he requested until he reached his limit in requesting. 'Al-Misbah Al-Munir' (Jhd). Meaning: He strove in the matter, and exaggerated in seeking it. See 'Al-Lisan' (Jhd).]] \n2. Al-Lalaka'i narrated it in 'Sharh Usul Al-I'tiqad' # (1095) from the path of Yunus bin Abd al-A'la, said: Ibn Wahb informed us with it. In it: 'The pens have been lifted and the pages have dried'. Ahmad narrated it (1/293, 303, 307), Al-Tirmidhi # (2516), Al-Firyabi in 'Al-Qadar' # (153, 156, 157), Ibn Abi Hatim in his 'Tafsir' [See 'Tafsir Ibn Kathir' (Al-Zumar: 36)], Abu Ya'la (2556), Ibn Al-Sunni (425), Al-Tabarani in 'Al-Kabir' # (12988), and in 'Al-Du'a' (42), Ibn Mandah in 'Al-Tawhid' # (251), Ibn Abi Asim in 'Al-Sunnah' # (325), Ibn Batta in 'Al-Ibanah' # (1505), Al-Lalaka'i (1094, 1095), Al-Bayhaqi in 'Al-Asma' wa Al-Sifat' # (126), and 'Shu'ab Al-Iman' (195), and 'Al-I'tiqad' p. (156) Ed./ Al-Fadilah, and Ibn Al-Naqqash in 'Fawa'id Al-Iraqiyyin' # (9) with their chains from Qays bin Al-Hajjaj with it. Qays bin Al-Hajjaj: Abu Hatim said: Salih (Righteous/Acceptable). 'Al-Jarh wa Al-Ta'dil' (7/ # 540). Ibn Hibban listed him in 'Al-Thiqat' (7/329). Ibn Hajar said: Truthful. The rest of the chain has trustworthy men. Hanash was followed up on this hadith. See: Our referencing of 'Shifa Al-Alil' p. (58). Al-Tirmidhi said: Good authentic (Hasan Sahih). Ibn Mandah said: This hadith has paths from Ibn Abbas; this is the most correct of them. Ibn Rajab said: In any case; the path of Hanash which Al-Tirmidhi extracted is good and strong. 'Jami' Al-Ulum wa Al-Hikam' explanation of the nineteenth hadith.",
    "book_id": "153",
    "new_page_number": 55
  },
  {
    "serial_number": "1281051",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 58,
    "volume_number": 1,
    "text": "(29) - Abdullah bin Suleiman told us, Ahmad bin Sa'id Al-Hamdani told us, Ibn Wahb informed us, said: Umar bin Muhammad informed me, that Sulayman bin Mihran told him, said: Abdullah bin Masoud, may Allah be pleased with him, said: The first thing [Allah] (1) Mighty and Majestic created of His creation was the Pen, so He said to it: Write. So it wrote everything that will be in the world until the Day of Resurrection. So the First Book and the deeds of the servants are brought together; and not an Alif nor a Waw nor a Mim (2) of it differs (3). (30) - Abu Bakr; Abdullah bin Suleiman told us, said: Al-Hamdani told us, Ibn Wahb informed us, said: Yunus informed me, from Ibn Shihab, that Abd al-Rahman bin Hunaidah told them, that Abdullah bin Umar said: The Messenger of Allah (peace be upon him) said: «When Allah - Mighty",
    "foot_note": "1. Addition from 'Shifa Al-Alil'. \n2. In 'Shifa Al-Alil': And does not differ by an Alif, nor a Waw, nor a Mim. \n3. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (60) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text. Its men are trustworthy; except that it is disconnected; because Sulayman bin Mihran Al-A'mash did not meet Ibn Masoud.",
    "book_id": "153",
    "new_page_number": 56
  },
  {
    "serial_number": "1281052",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 59,
    "volume_number": 1,
    "text": "and Majestic - wants to create the soul (Nasamah); the Angel of the Wombs says with it (1): O Lord, male or female? So Allah decrees His command to him. Then he says: O Lord, wretched or happy? So Allah decrees His command to him. Then he writes between his eyes what he will encounter, even the calamity* he will be afflicted with» (2).",
    "foot_note": "1. \"With it\" (Ma'aha): Thus in the three manuscripts, and in the manuscript originals of 'Shifa Al-Alil' see printed version p. (101), and in 'Tahdhib Al-Kamal' (17/473) where he narrated the hadith via Ibn Tabarzad, and noted that it occurred like this in the narration. In the rest of the narrations of this hadith from Ibn Wahb and others, it appeared as: 'Turning away' (Mu'ridan). And Allah knows best. \n2. [[* Al-Nakbah: Calamity from the calamities of time. 'Al-Lisan' (Nkb).]] () Al-Mizzi narrated it in 'Tahdhib Al-Kamal' (17/472) from the path of Ibn Tabarzad with the chain of our copy. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (101) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text. Abu Dawud narrated it in 'Al-Qadar' [See 'Tahdhib Al-Kamal' (17/472)], and from his path Ibn Batta in 'Al-Ibanah' # (1410) via Al-Hamdani with it. Al-Darimi narrated it in 'Al-Radd 'ala Al-Jahmiyyah' p. (80) Ed./ Al-Maktab Al-Islami from Ahmad bin Salih Al-Masri. Al-Firyabi narrated it in 'Al-Qadar' # (142) from Asbagh bin Al-Faraj. Ibn Hibban narrated it in his 'Sahih' (14/ # 6178) from Harmalah bin Yahya. Al-Tahawi narrated it in 'Bayan Mushkil Ahadith Rasul Allah SAWS' (9/ # 3873), and Al-Lalaka'i # (1050) from Yunus bin Abd al-A'la. All of them (Ahmad bin Salih Al-Masri, Asbagh bin Al-Faraj, Harmalah bin Yahya, and Yunus bin Abd al-A'la) from Ibn Wahb with it. Al-Firyabi narrated it in 'Al-Qadar' # (141), and from him Al-Ajurri in 'Al-Shari'ah' =",
    "book_id": "153",
    "new_page_number": 57
  },
  {
    "serial_number": "1281053",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 60,
    "volume_number": 1,
    "text": ". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .",
    "foot_note": "1. = # (363), and Al-Lalaka'i # (1051) from Al-Layth bin Sa'd. Abu Ya'la narrated it (10/ # 5775) from Jarir bin Hazim. Both of them (Al-Layth bin Sa'd and Jarir bin Hazim) from Yunus bin Yazid with it. Abd al-Rahman bin Hunaidah: Trustworthy as in 'Al-Taqrib'. Except that there is disagreement regarding Ibn Shihab Al-Zuhri in this hadith: Yunus bin Yazid narrated it from him Marfu' (elevated to Prophet) as preceded. Ma'mar narrated it from Al-Zuhri and there is disagreement regarding him whether it is Marfu' or Mawquf (stopped at companion): Ibn Abi Asim # (189) narrated it from the path of Ibn Kasib, from Ubaidullah bin Mu'adh, from Ma'mar, from Al-Zuhri, from Ibn Hunaidah with it Marfu'. Ibn Kasib: He is Yaqub bin Humaid bin Kasib. Al-Dhahabi said in 'Al-Mizan': He was among the scholars of Hadith; but he has denounced and strange reports. And Ubaidullah bin Mu'adh: Trustworthy Hafiz. Contradicted by: Abdul-Razzaq Al-San'ani; in what he narrated in 'Al-Musannaf' # (20066) and from his path Ibn Abi Asim in 'Al-Sunnah' (191), and Al-Firyabi (138) from Ma'mar, from Al-Zuhri, from Ibn Hunaidah with it Mawquf. Perhaps this is more likely; due to what Ibn Abi Asim narrated in 'Al-Sunnah' # (190): Ibn Abi Umar (Al-Adani author of Musnad) told us, Sufyan told us, from Amr bin Dinar and Ma'mar, both from Al-Zuhri, from Ibn Hunaidah with it Mawquf. Ibn Batta narrated it in 'Al-Ibanah' # (1605) from Sufyan, from Amr bin Dinar with it. Ma'mar and Amr bin Dinar were followed in the Mawquf narration by: \n1 -. Umar bin Sa'id - his hadith is approachable (Muqarib) as Imam Ahmad said - in what Ibn Abi Asim narrated (188): Abu Masud Al-Jahdari told us, Al-Fudayl bin Sulayman told us, from Umar bin Sa'id. Al-Fudayl bin Sulayman: Al-Hafiz said: Truthful, has many errors. \n2 -. Aqil; in what Al-Firyabi narrated # (139) from Muhammad bin Uzayr Al-Ayli, told us",
    "book_id": "153",
    "new_page_number": 58
  },
  {
    "serial_number": "1281054",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 61,
    "volume_number": 1,
    "text": "(31) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Amr bin Al-Harith informed us, from Abu Al-Zubayr Al-Makki, that Amir bin Wathilah - meaning Abu Al-Tufayl - informed him, that he heard Abdullah bin Masoud saying: The wretched one is he who was wretched in his mother's womb, and the happy one is he who takes heed from others. A man from the companions of the Messenger of Allah (peace be upon him) called Hudhayfah bin Asid Al-Ghifari came to him; and he told him that from the saying of Ibn Masoud. So I said (1): And how can a man be wretched without deeds?",
    "foot_note": "1. = Salamah, from Aqil. Muhammad bin Uzayr: Al-Hafiz said: He has weakness; and they discussed the validity of his hearing from his uncle Salamah. \n3 -. Al-Awza'i; in what Al-Firyabi narrated # (137) from the path of Al-Awza'i, Al-Zuhri told me, from one who heard Ibn Umar. Mawquf. And it was narrated from other aspects - other than this aspect - from Ibn Umar: a- Ibn Abi Asim narrated it in 'Al-Sunnah' (192), and Al-Bazzar in his 'Musnad' [See 'Mukhtasar Zawa'idihi' # (1598)] from Salih bin Abi Al-Akhdar, from Al-Zuhri, from Salim, from Ibn Umar, Marfu'. Al-Bazzar said: We do not know anyone who narrated it from Al-Zuhri, from Salim, from his father except Salih. I say: And this Salih is weak; so his solitariness is considered Munkar. b- And Ibn Adi narrated it in 'Al-Kamil' (5/473) biography: Abd al-Rahman bin Yahya Al-Madani, and Al-Daraqutni in 'Al-Afrad' (6/ L 91 - A) Al-Qastallani copy from Malik bin Anas, from Abdullah bin Dinar, from Ibn Umar with it. Ibn Adi said: This is Munkar from Malik with this chain. Al-Daraqutni said: This is a strange hadith from the hadith of Abdullah bin Dinar from Ibn Umar, and it is strange from the hadith of Malik bin Anas. () In (Z): He said.",
    "book_id": "153",
    "new_page_number": 59
  },
  {
    "serial_number": "1281055",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 62,
    "volume_number": 1,
    "text": "The man said to him: Are you amazed at that? For I heard the Messenger of Allah (peace be upon him) say: «When forty-two nights pass over the drop (Nutfah); Allah Mighty and Majestic sends an angel to it; so he shapes it; and creates its hearing, its sight, its skin, its flesh, and its bones (1). Then he says: O Lord, male or female? So Allah decrees in that what He wills (2), and the angel writes. Then he says: O Lord, its lifespan? So your Lord says what He wills, and the angel writes. Then he says: O Lord, his provision? So your Lord decrees what He wills, and the angel writes. Then the angel comes out with the scroll in his hand, so he does not add to his command nor decrease» (3).",
    "foot_note": "1. 'Its bones': Dropped from (Z) and (H). \n2. Added in the Original after 'Wills' the word 'Allah', which has no place. \n3. Muslim narrated it [3 - (2645)] from Abu Al-Tahir; Ahmad bin Sarh. Al-Tabarani narrated it in 'Al-Kabir' # (3044), and Ibn Batta in 'Al-Ibanah' # (1402) from Ahmad bin Salih Al-Masri. Abu Awanah narrated it in his 'Mustakhraj' [See 'Ithaf Al-Maharah' (4/214)], and Al-Tahawi in 'Bayan Mushkil Ahadith Rasul Allah SAWS' # (2664) from Yunus bin Abd al-A'la. Ibn Hibban narrated it in his 'Sahih' # (6177) from Ahmad bin Isa Al-Masri. Abu Awanah narrated it in his 'Mustakhraj' [See 'Ithaf Al-Maharah' (4/214)] from Isa bin Ahmad Al-Balkhi. All of them (Abu Al-Tahir, Ahmad bin Salih Al-Masri, Yunus bin Abd al-A'la, Ahmad bin Isa Al-Masri, and Isa bin Ahmad Al-Balkhi) from Ibn Wahb with it.",
    "book_id": "153",
    "new_page_number": 60
  },
  {
    "serial_number": "1281056",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 63,
    "volume_number": 1,
    "text": "Muhammad bin Ismail said: And it was narrated from Abd al-Malik bin Jurayj, from Abu Al-Zubayr, from Abu Al-Tufayl Amir bin Wathilah. (32) (z) - Abu Muhammad; Abd al-Rahman bin Muhammad bin Abd al-Rahman (1) Al-Qurashi; known as Abu Sakhrah, informed us, year three hundred and nine, said: Abu Al-Hasan; Ali bin Abdullah bin Ja'far Al-Madini informed us (2), year two hundred and thirty-four, said: Rawh bin Ubadah told us, said: Ibn Jurayj told us, said: Abu Al-Zubayr informed us, that Abu Al-Tufayl said: I heard Abdullah bin Masoud, may Allah be pleased with him, say: The wretched one is he who was wretched in his mother's womb, and the happy one is he who takes heed from others. He said: So I said: Shame on Satan, does a human become wretched or happy before he acts?! He said: So I met Hudhayfah bin Asid and he said: Shall I not inform you of what I heard from the Messenger of Allah (peace be upon him)? I heard him say: «When the drop settles in the womb for forty-two nights; the Angel of the Wombs descends and says: O Lord, wretched or happy? So your Lord decrees what He wills, and the angel writes. Then he says: O Lord, male or female? So your Lord decrees what He wills, and the angel writes.",
    "foot_note": "1. Thus appearing in (Z) and (H) while in the Original added to this amount: 'Bin Muhammad Abd al-Rahman' and this is a slip of the pen from the scribe. See hadiths (11, 33), and 'Al-Siyar' (14/457) where his name appeared correctly. \n2. In (Z) and (H): 'Abna' (Informed us).",
    "book_id": "153",
    "new_page_number": 61
  },
  {
    "serial_number": "1281057",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 64,
    "volume_number": 1,
    "text": "Then he says: O Lord, what is his deed? So your Lord decrees what He wills, and the angel writes. Then he says: O Lord, what is his lifespan? So your Lord decrees what He wills, and the angel writes. Then the angel ascends with the scroll with what he added in it of news and destiny» (1). And it was narrated from Amr bin Dinar, from Abu Al-Tufayl. (33) (z) - Abu Muhammad; Abd (2) al-Rahman bin Muhammad Al-Qurashi (3) informed us, said: Ali bin Al-Madini told us, said: Sufyan bin Uyaynah told us, said: Amr bin Dinar told us, he heard Abu Al-Tufayl narrating from Hudhayfah bin Asid Al-Ghifari, who said: The Messenger of Allah (peace be upon him) said: «The angel enters upon the drop after it settles in the womb by forty or forty-five nights. So he says: O Lord, male or female? He said: So Allah says, and the angel writes.",
    "foot_note": "1. Muslim narrated it # [3 - (2645)] from Abu Asim. Al-Firyabi narrated it in 'Al-Qadar' # (140), and from him Al-Ajurri in 'Al-Shari'ah' # (361) from Al-Walid bin Muslim. Al-Lalaka'i narrated it # (1047) from Ibn Abi Adi. The three of them (Abu Asim, Al-Walid bin Muslim, and Ibn Abi Adi) from Ibn Jurayj with it. \n2. In the Original: 'An' (From), and established from (Z) and (H). \n3. In the margin of (Z) in the handwriting of the copyist Zain Al-Abidin: 'Known as Abu Sakhrah'.",
    "book_id": "153",
    "new_page_number": 62
  },
  {
    "serial_number": "1281058",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 65,
    "volume_number": 1,
    "text": "He said: So he says: O Lord, wretched or happy? He said: So He tells him, and the angel writes. He said: Then he writes his deed, his provision, his lifespan, and his trace, then the scroll is folded, and nothing is added to what is in it nor decreased» (1). (34) (z) - My father, may Allah have mercy on him, told us (2), said: Ali bin Harb Al-Ta'i told us, said: Sufyan bin Uyaynah told us, so he mentioned with his chain from Hudhayfah bin Asid, from the Prophet (peace be upon him) similar to it (3). And Ubaidullah (4) bin Abi Talha Al-Makki narrated it from Abu Al-Tufayl.",
    "foot_note": "1. Al-Humaidi narrated it (826), and from his path Al-Tabarani in 'Al-Kabir' # (3039). Ahmad narrated it (4/6). Muslim narrated it # (2644) Muhammad bin Abdullah bin Numayr and Zuhair bin Harb told us. Abu Awanah narrated it in his 'Mustakhraj' [See 'Ithaf Al-Maharah' 4/214], Al-Tahawi in 'Bayan Mushkil Ahadith Rasul Allah SAWS' # (2663), and Al-Lalaka'i # (1045) from Yunus bin Abd al-A'la. Abu Awanah also narrated it from Ibrahim bin Yasar. Ibn Abi Asim narrated it in 'Al-Sunnah' # (186) Ibn Kasib told us. All of them (Al-Humaidi, Ahmad bin Hanbal, Muhammad bin Abdullah bin Numayr, Zuhair bin Harb, Yunus bin Abd al-A'la, Ibrahim bin Yasar, and Ibn Kasib) from Sufyan bin Uyaynah with it. \n2. In (Z) and (H): Told us. \n3. Ibn Batta narrated it in 'Al-Ibanah' # (1403) from Ali bin Harb Al-Ta'i with it. \n4. Thus in the three manuscripts 'Ubaidullah', and in the manuscript of 'Usul Al-Sunnah' by Ibn Abi Zamanin similarly; where he narrated it from the path of Ibn Wahb. And it appeared in 'Al-Jarh wa Al-Ta'dil' by Ibn Abi Hatim (5/ # 1895): 'Ubaid' without the addition, as well as in 'Al-Tahdhib' and its branches.",
    "book_id": "153",
    "new_page_number": 63
  },
  {
    "serial_number": "1281059",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 66,
    "volume_number": 1,
    "text": "(35) - Abu Bakr, Abdullah bin Suleiman bin Al-Ash'ath told us (1), said: Ahmad bin Sa'id Al-Hamdani told us, said: Abdullah bin Wahb informed us, said: Ibn Lahi'ah informed me, from Yazid bin Abi Habib, from Ubaidullah (2) bin Abi Talha Al-Makki, that Abu Al-Tufayl Al-Bakri informed him, that he heard Ibn Masoud say: Indeed, the wretched one is he who was wretched in his mother's womb, and the happy one is he who takes heed from others. So I said: How can one be wretched who has not acted? So I met Hudhayfah bin Asid Al-Ghifari, and informed him of what Ibn Masoud said, so he said: I heard the Messenger of Allah (peace be upon him) say: «Indeed, when Allah wants to create the servant; the Angel says: O Lord, male or female? So the Lord says what He wills, and the angel writes. Then the angel says: O Lord, wretched or happy? So the Lord says what He wills, and the angel writes. Then he says: O our Lord, what will he encounter? So the Lord says what He wills, and the angel writes. Then the angel says: O our Lord, what is his provision? So the Lord Mighty and Majestic says what He wills, and the angel writes. Then the angel says: O our Lord, what is his lifespan? So the Lord says what He wills, and the angel writes» (3).",
    "foot_note": "1. In (Z) and (H): Told us. \n2. See footnote (4) previous page. \n3. Ibn Abi Zamanin narrated it in 'Usul Al-Sunnah' # (122) from the path of Yunus bin Abd al-A'la, from Ibn Wahb with it. Al-Tabarani narrated it in 'Al-Kabir' # (3043) from Al-Nadr bin Abd al-Jabbar, from Ibn Lahi'ah with it. Abu Dawud narrated it in 'Al-Qadar' [See 'Tahdhib Al-Kamal' (19/218)] from Yazid bin Abi Habib with it. And Ubaid bin Abi Talha Al-Makki: Ibn Abi Hatim mentioned him in 'Al-Jarh wa Al-Ta'dil' (5/ # 1895), and remained silent about him. Ibn Hajar said in 'Al-Taqrib': Acceptable. And Ibn Lahi'ah, discussion on him preceded at Hadith # (27).",
    "book_id": "153",
    "new_page_number": 64
  },
  {
    "serial_number": "1281060",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 67,
    "volume_number": 1,
    "text": "(36) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Abdullah bin Lahi'ah informed me, from Bakr bin Sawadah Al-Judhami, from Abu Tamim Al-Jayshani, from Abu Dharr, that the Prophet (peace be upon him) said: «When it enters - meaning: the drop - the womb for forty nights; the Angel of the Soul comes, then ascends to the Lord, and says: O Lord, is Your servant male or female? So Allah decrees what He is decreeing (1). Wretched or happy? So He writes what is to be» and he mentioned the rest of the hadith (2).",
    "foot_note": "1. Thus in the three manuscripts, and in the manuscript originals of 'Shifa Al-Alil'. In the rest of the narrations of the hadith it occurred after 'decreeing': 'Then he says: O Lord'. And Allah knows best. \n2. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (101) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text identical. Al-Darimi narrated it in 'Al-Radd 'ala Al-Jahmiyyah' # (94) from Amr bin Khalid Al-Harrani, from Ibn Lahi'ah with it Marfu' (elevated) as well. Ibn Batta narrated it in 'Al-Ibanah' # (1417) from Al-Mattuthi, said: Abu Dawud told us, said: Ahmad bin Sa'id Al-Hamdani told us, said: Ibn Wahb informed us, from Ibn Lahi'ah with it. Mawquf (stopped) at Abu Dharr. Thus this narration appeared in the printed version of 'Al-Ibanah': stopped at Abu Dharr; contrary to the narration we have which is elevated. Allah knows best. Ibn Wahb was followed up in this stopped narration: Al-Firyabi narrated it # (123) from Qutaibah bin Sa'id. Ibn Jarir Al-Tabari narrated it in his 'Tafsir' # (34187) [Al-Taghabun: 2] from Hasan bin Musa Al-Ashyab. Both of them: (Qutaibah bin Sa'id, and Al-Hasan bin Musa Al-Ashyab) from Ibn Lahi'ah with it Mawquf. This inconsistency is due to the weakness of Ibn Lahi'ah himself. And Allah knows best. The Scholar Abd al-Rahman bin Yahya Al-Mu'allimi, may Allah have mercy on him, said: 'In its chain is Ibn Lahi'ah, and the denounced part of it is: So he ascends with it to the Compeller. And its meaning without it is established in the two Sahihs and others from the hadith of Ibn Masoud'. His comment on 'Al-Fawa'id Al-Majmu'ah' p. (451), and see Hadith # (45) of this book.",
    "book_id": "153",
    "new_page_number": 65
  },
  {
    "serial_number": "1281061",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 68,
    "volume_number": 1,
    "text": "(37) - Abdullah bin Suleiman told us, Ahmad bin Sa'id Al-Hamdani told us, said: Abdullah bin Wahb informed us, said: Jarir bin Hazim informed me, from Sulayman bin Mihran, from Zaid bin Wahb, from Abdullah bin Masoud, who said: The Messenger of Allah (peace be upon him) said: «The drop remains in the womb for forty nights as a drop, and forty nights as a clot, and forty nights as a morsel. Then an angel is sent to it, and he is commanded with four words: with his provision, his lifespan, his trace, and wretched or happy. By the One in Whose Hand is the soul of Ibn Masoud, a man performs the deeds of the people of Paradise; until there is nothing between him and it except an arm's length; then the Book overtakes him; so he performs the deeds of the people of the Fire and enters the Fire. And a man performs the deeds of the people of the Fire; until there is nothing between him and it except an arm's length, then the Book overtakes him, so he performs the deeds (1) of the people of Paradise and enters Paradise» (2).",
    "foot_note": "1. In (Z) and (H): With the deeds. \n2. Al-Tahawi narrated it in 'Bayan Mushkil Ahadith Rasul Allah SAWS' # (3870), and Abu Awanah in his 'Mustakhraj' [See 'Ithaf Al-Maharah' (10/208)] from Yunus bin Abd al-A'la, said: Ibn Wahb informed us with it. Note: In his saying: «Indeed, a man performs the deeds...» there is disagreement; it was narrated Mawquf (stopped) on Ibn Masoud as his saying. And it was narrated Marfu' (elevated) to the Prophet (peace be upon him). Ibn Rajab Al-Hanbali said: 'It has been said: That his saying at the end of the hadith: By the One besides Whom there is no god, one of you performs the deeds of the people of Paradise, until there is... to the end of the hadith, is inserted (Mudraj) from the speech of Ibn Masoud. Salamah bin Kuhayl narrated it likewise, from Zaid bin Wahb, from Ibn Masoud as his saying. And this meaning has been narrated from the Prophet (peace be upon him) from multiple aspects'. 'Jami' Al-Ulum wa Al-Hikam' explanation of the fourth hadith. Al-Tahawi said: 'Regardless of what meaning this speech truly takes, from the speech of the Messenger of Allah (peace be upon him) or from the speech of Ibn Masoud; it is truth; because Ibn Masoud is trusted regarding what he said of that if he said it, and because we know that he did not say that by opinion; because the like of it is not said by opinion, and that he only said it by reception (Tawqif), and reception is only from the Messenger of Allah (peace be upon him)'.",
    "book_id": "153",
    "new_page_number": 66
  },
  {
    "serial_number": "1281062",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 69,
    "volume_number": 1,
    "text": "This is a strange chain from Jarir bin Hazim, from Al-A'mash. A group has narrated this hadith from Al-A'mash including: Shu'bah, Al-Thawri, Al-Mas'udi, Zuhair bin Muawiyah, Khalid Al-Hadhdha, Abu Shihab Al-Hannat, Yahya bin Zakariya bin Abi Za'idah, Abu Muawiyah Al-Darir, Jarir bin Abd al-Hamid, Musa bin A'yan, Isa bin Yunus, Sufyan bin Uyaynah, Ammar bin Ruzayq, Amr bin Abi Qais, Waki' bin Al-Jarrah, Abdullah bin Dawud, Abd al-Wahid bin Ziyad, Muhammad bin Jabir Al-Suhaimi, Sa'd bin Al-Salt, and others from the Sheikhs. And we brought some of that; we mentioned it to be secondary to Jarir bin Hazim.",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 67
  },
  {
    "serial_number": "1281063",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 70,
    "volume_number": 1,
    "text": "(38) (z) - As for the hadith of Abu Shihab Al-Hannat; Abu Al-Qasim; Abdullah bin Muhammad bin Abd al-Aziz Al-Baghawi informed us - reading to him - Muhammad bin Ziyad bin Farwah Al-Baladi told us, said: Abu Shihab Al-Hannat told us, from Sulayman Al-A'mash, from Zaid bin Wahb, from Abdullah bin Masoud, said: The Messenger of Allah (peace be upon him) told us, and he is the Truthful and Believed One. (39) (z) - And Abu Muhammad; Abd al-Rahman bin Muhammad Al-Qurashi, known as Abu Sakhrah, informed us, said: Ali bin Al-Madini told us, said: Yahya bin Zakariya bin Abi Za'idah told us, said: Al-A'mash told us, from Zaid bin Wahb, from Ibn Masoud, said: The Messenger of Allah (peace be upon him) told us, and he is the Truthful and Believed One: «Indeed, the creation of one of you is gathered in his mother's womb for forty nights, then it is a clot like that, then it is a morsel like that, then the Angel is sent to it with four words, so he writes: his provision, his deed, his lifespan, and wretched or happy. So (1) one of you performs the deeds of the people of Paradise; until there is nothing between him and it except an arm's length, then the Book overtakes him; so he performs the deeds of the people of the Fire, so it is sealed for him; so he becomes of its people. And one of you performs the deeds of the people of the Fire; until there is nothing between him and it except an arm's length, then the Book overtakes him; so he performs the deeds of the people of Paradise; so it is sealed for him; so he becomes of its people» (2). Wording of Ali bin Al-Madini.",
    "foot_note": "1. In (Z): And indeed. \n2. Abu Awanah narrated it in his 'Mustakhraj' [See 'Ithaf Al-Maharah' (10/207)] from the path of Yahya bin Zakariya bin Abi Za'idah with it.",
    "book_id": "153",
    "new_page_number": 68
  },
  {
    "serial_number": "1281064",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 71,
    "volume_number": 1,
    "text": "(40) (z) - Abd al-Rahman bin Muhammad Al-Qurashi informed us, said: Ali bin Al-Madini informed us, said: Jarir bin Abd al-Hamid told us - so he mentioned a group - (1) from Al-A'mash, from Zaid bin Wahb, from Abdullah, from the Prophet (peace be upon him) similar to it (2). (41) (z) - Abd al-Rahman bin Muhammad Al-Qurashi informed us, said: Ali bin Al-Madini told us, said: Yazid bin Zurai' told us, said: Shu'bah told us, from Sulayman Al-A'mash, from Zaid bin Wahb, from Abdullah, from the Prophet (peace be upon him) similar to it (3). (42) (z) - My father, may Allah have mercy on him, told me, Abu Ubaydah; Al-Sari bin Yahya Al-Sari told us in Kufa, said: Qabisah bin Uqbah told us, said: Ammar bin Ruzayq told us, from Al-A'mash, from Zaid bin Wahb,",
    "foot_note": "1. In (Z): All of them. \n2. Muslim narrated it # (2643) Uthman bin Abi Shaybah and Ishaq bin Ibrahim told us, both from Jarir with it. \n3. Al-Bukhari narrated it # (6594) from Abu Al-Walid. And # (7454) from Adam. Muslim narrated it # (2643) from Ubaidullah bin Mu'adh, my father told us. Abu Dawud narrated it # (4708) from Hafs bin Umar. Al-Tahawi narrated it in 'Bayan Mushkil Ahadith Rasul Allah SAWS' # (3861) from Uthman bin Umar bin Faris, Muhammad bin Kathir Al-Abdi, and Abu Amir Al-Aqdi. And # (3862) from Wahb bin Jarir. And # (3863) from Adam bin Abi Iyas. All of them (Abu Al-Walid, Adam, Mu'adh, Hafs bin Umar, Uthman bin Umar, Muhammad bin Kathir, Abu Amir Al-Aqdi, and Wahb bin Jarir) from Shu'bah with it.",
    "book_id": "153",
    "new_page_number": 69
  },
  {
    "serial_number": "1281065",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 72,
    "volume_number": 1,
    "text": "from Abdullah bin Masoud, said: The Messenger of Allah (peace be upon him) said. So he mentioned the hadith similar to it. (43) (z) - The Judge Abu Umar; Muhammad bin Yusuf bin Yaqub Al-Azdi told us, said: Al-Hasan bin Muhammad bin Al-Sabah Al-Za'farani told us, said: Abd al-Wahhab Al-Thaqafi told us, said: Sufyan Al-Thawri told us, from Al-A'mash, from Zaid bin Wahb, from Abdullah bin Masoud, said: The Messenger of Allah (peace be upon him) told us, and he is the Truthful and Believed One, so he mentioned the hadith similar to it (1). And the rest of the paths of this hadith from Al-A'mash; come in the hadith of Al-A'mash from Zaid bin Wahb. (44) (z) - Abu Muhammad; Abd al-Rahman bin Muhammad Al-Qurashi informed us, said: Ali bin Al-Madini said: And we used to think this hadith was only narrated by Sulayman Al-A'mash. Then Muhammad bin Abdullah Al-Asadi told us, said: Fitr bin Khalifah told us, from Salamah bin Kuhayl, from Zaid bin Wahb, said: I heard Abdullah bin Masoud say: The Messenger of Allah (peace be upon him) told us, and he is the Truthful and Believed One. Ali said: So he mentioned similar to the hadith of Al-A'mash (2).",
    "foot_note": "1. Abdul-Razzaq narrated it # (20093), Abu Dawud # (4708), Al-Bazzar in his 'Musnad' # (1765), and Al-Tahawi in 'Bayan Al-Mushkil' # (3864) from Al-Thawri with it. \n2. Ahmad narrated it (1/414) from Hussein bin Muhammad. Al-Nasa'i narrated it in 'Al-Sunan Al-Kubra' Book of Tafsir: Chapter Then among them is wretched and happy, # (11246) from Ali bin Hajar, from Yazid bin Harun. Abu Awanah narrated it [See 'Ithaf Al-Maharah' (10/208)] from Abu Umayyah, from Hussein bin Muhammad. Al-Bazzar narrated it in his 'Musnad' # (1767) from Muhammad bin Al-Muthanna, from Abu Ahmad (Muhammad bin Abdullah bin Al-Zubayr). Al-Haytham bin Kulayb narrated it in his 'Musnad' (683) from Abu Nu'aym. Al-Tahawi narrated it in 'Bayan Al-Mushkil' # (3867) from Bakkar bin Qutaibah, from Abu Ahmad. And # (3868) from Abu Nu'aym. And # (3869) from Yazid bin Harun. All of them (Hussein bin Muhammad, Yazid bin Harun, Abu Ahmad, and Abu Nu'aym) from Fitr with it.",
    "book_id": "153",
    "new_page_number": 70
  },
  {
    "serial_number": "1281066",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 73,
    "volume_number": 1,
    "text": "(45) - Abdullah bin Suleiman told us, said: And Al-Hamdani told us, said: Ibn Wahb informed us, said: Ibn Lahi'ah informed me, from Ka'b bin Alqamah, from Sa'id (1) bin Hilal, from Abdullah bin Amr bin Al-Aas, that he said: If the drop stays in the woman's womb for forty nights, an angel comes to it and extracts it*, then ascends with it to Allah Mighty and Majestic and says: Create, O Best of Creators, so Allah decrees in it what He wills of His command, then it is given (2) to the angel, so the angel asks at that point, saying: O Lord, miscarriage* or complete? So it becomes clear (3) to him. Then he says:",
    "foot_note": "1. Thus in the three manuscripts: 'Sa'id'; and the correct reading is: 'Isa bin Hilal' as in 'Shifa Al-Alil' - where he quoted the hadith from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text - and sources of referencing, and books of Rijal. [[* Ikhtalajaha: Pulled it and extracted it. 'Al-Lisan' (Khlj).]] \n2. In 'Shifa Al-Alil' and sources of referencing: 'It is given back'. [[* Al-Siqt: The fetus that falls from its mother's womb before completion, male and female are alike in it. (Al-Siqt: with three vowels on Sin and Sukun on Qaf, and Kasra on its Sin is more common). 'Al-Lisan' (Sqt).]] \n3. Thus in (Z) and (H) while unpointed in the Original in the four places. In 'Shifa Al-Alil' and sources of referencing: 'So He clarifies'. And Allah knows best.",
    "book_id": "153",
    "new_page_number": 71
  },
  {
    "serial_number": "1281067",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 74,
    "volume_number": 1,
    "text": "O Lord, one or twins? So it becomes clear to him. Then he says: O Lord, male or female? So it becomes clear to him. Then he says: O Lord, incomplete lifespan or complete lifespan? So it becomes clear to him. Then he says: O Lord, cut off his provision with his creation (1), so He decrees them both. By the One in Whose Hand is Muhammad's soul (2), he does not attain except what was apportioned to him on that day, when he consumes his provision he is taken (3). (46) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed (4) us, said: Malik bin Anas informed me, from Ziyad bin Sa'd, from Amr bin Dinar, who said:",
    "foot_note": "1. Thus the phrase appeared abbreviated in the three manuscripts, 'Shifa Al-Alil', and 'Al-Ibanah' by Ibn Batta, where he narrated it from the path of Ibn Wahb. While in 'Al-Qadar' by Al-Firyabi, and 'Sharh Usul Al-I'tiqad' by Al-Lalaka'i it is more complete than here, and its text is: 'Then he says: O Lord, cut off his provision, so He cuts off his provision for him with his creation'. \n2. In the rest of narrations: 'By the One in Whose Hand is my soul'. \n3. Ibn Batta narrated it in 'Al-Ibanah' # (1418) from the path of Al-Hamdani, from Ibn Wahb with it. Ibn Al-Qayyim quoted it in 'Shifa Al-Alil' p. (101, 102) from 'Kitab Al-Qadar' by Ibn Wahb with its chain and text. Al-Firyabi narrated it in 'Al-Qadar' # (146), and Al-Lalaka'i in 'Sharh Usul Al-I'tiqad' # (1236) from Sa'id bin Abi Maryam, from Ibn Lahi'ah with it. Ibn Lahi'ah, discussion on him preceded in commentary on Hadith (27). Also he did not explicitly state hearing (Tahdith), and he was mentioned among the Mudallisin. Ibn Hajar mentioned in 'Al-Fath' (11/479) explanation of hadith # (6594) that Al-Tabarani extracted it in 'Al-Mu'jam Al-Kabir' with a good chain. And Allah knows best. \n4. In (Z) and (H): Informed us.",
    "book_id": "153",
    "new_page_number": 72
  },
  {
    "serial_number": "1281068",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 75,
    "volume_number": 1,
    "text": "I heard Abdullah bin Al-Zubayr say in his sermon: Indeed Allah Mighty and Majestic is the Guide and the Tempter (Al-Fatin) (1). (47) (z) - Al-Hussein bin Ismail bin Muhammad; Abu Abd (2) Allah Al-Dabbi told us, said: Ahmad bin Ismail Al-Madini told us, said: Malik bin Anas told us, from Ziyad bin Sa'd, from Amr bin Dinar, that he said: I heard Abdullah bin Al-Zubayr say in his sermon: Indeed Allah is the Guide and the Tempter. (48) - Abdullah bin Suleiman bin Al-Ash'ath told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Abdullah bin Amr (3) informed me, from (4) Khubaib bin Abd al-Rahman, from Hafs bin Asim, from Abu Hurairah who said: The Messenger of Allah (peace be upon him) said: «Indeed, a servant performs the deeds of the people of the Fire for seventy years, then Allah seals for him with the deeds of the people of Paradise, and indeed a servant performs the deeds of the people of (5) Paradise for seventy years, then Allah seals for him with the deeds of the people of the Fire» (6).",
    "foot_note": "1. Malik narrated it in 'Al-Muwatta' Book of Jami', Chapter Prohibition of Speaking about Destiny (2620), and from his path: Al-Bayhaqi in 'Al-Qadar' by him (496), Al-Lalaka'i (1201), and Ibn Batta in 'Al-Ibanah' (1659). \n2. In The Original: 'Ubayd', and established from (Z) and (H). \n3. Thus in the three manuscripts 'Amr'. And the correct is: 'Umar' and perhaps this misspelling is from the copyist. And Allah knows best. \n4. In the three manuscripts: 'Bin' which is an apparent misspelling. \n5. 'People': Not in The Original and (H), and established from (Z). \n6. Al-Bazzar narrated it in his 'Musnad' [See 'Kashf Al-Astar' # (2158), and 'Mukhtasar Zawa'id Al-Bazzar' # (1614)], and Al-Tabarani in 'Al-Mu'jam Al-Awsat' # (2448) from the path of Abdullah bin Umar, from Khubaib bin Abd al-Rahman with it. Al-Haythami said: Al-Tabarani narrated it in 'Al-Awsat' and its men are men of Sahih. 'Al-Majma'' (7/212). And Al-Hafiz Ibn Hajar quoted in 'Mukhtasar Al-Zawa'id' from him: Authentic! Al-Tabarani said: No one narrated this hadith from Khubaib except Abdullah. I say: And this Abdullah: is Ibn Umar bin Hafs bin Asim bin Umar bin Al-Khattab Al-Madani. Weak as in 'Al-Taqrib'. See: 'Tahdhib Al-Kamal' (15/327). Al-Iraqi said: Agreed upon from the hadith of Sahl bin Sa'd without the phrase: «seventy years». 'Al-Mughni 'an Haml Al-Asfar' # (3647). I say: Muslim narrated it # (2651) from the path of Abd al-Aziz bin Muhammad, from Al-Ala', from his father, from Abu Hurairah... so he mentioned it. Except that he said: «A long time» instead of «seventy years». And Allah knows best.",
    "book_id": "153",
    "new_page_number": 73
  },
  {
    "serial_number": "1281069",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 76,
    "volume_number": 1,
    "text": "(49) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Abdullah bin Umar informed me, from Asim bin Ubayd (1) Allah, and Salim Abu Al-Nadr, that Umar bin Al-Khattab, may Allah be pleased with him, said: O Messenger of Allah, do we work for what the pens have run with, and destinies have dried upon, or (2) for a matter we start anew? He said: «Rather for what the pens have run with, and destinies have dried upon». He said: Then what is the point of work? He said: «Everyone is facilitated for what he was created for». He said: Now is the striving (3).",
    "foot_note": "1. In (Z): 'Abd'. \n2. In The Original: 'Amr' (Matter), and established from (Z) and (H). \n3. Al-Daraqutni suspended it - from this path - in his 'Ilal' # (108) saying: Abdullah Al-Umari narrated it, from Asim bin Ubaydullah, and Salim Abu Al-Nadr, that Umar said: O Messenger of Allah... Mursal (disconnected). And Abu Dawud Al-Tayalisi narrated it (11), Ahmad (1/29), (2/52, 77), Al-Bukhari in 'Khalq Af'al Al-Ibad' (36), Al-Tirmidhi (2135), Ibn Abi Asim in 'Al-Sunnah' # (169, 170), Al-Bazzar in his 'Musnad' # (121), Abu Ya'la # (5463, 5571), Al-Ajurri in 'Al-Shari'ah' # (326), Al-Bayhaqi in his 'Al-Qadar' # (38), and Ibn Batta in 'Al-Ibanah' # (1325) from (Muhammad bin Ja'far, Abd al-Rahman bin Mahdi, Abdullah bin Al-Mubarak, Abu Dawud Al-Tayalisi, Adam, Hajjaj, Abu Jabir, Shababah bin Sawwar, and Hafs bin Umar) all of them from Shu'bah, from Asim bin Ubaydullah, from Salim bin Abdullah, from Abdullah bin Umar, from Umar bin Al-Khattab with it. It is very apparent to every observer that this aspect is more likely than the first aspect; because Abdullah Al-Umari is weak. Therefore Al-Daraqutni corrected this aspect in his 'Ilal' and not the first. 'Al-Ilal' # (108). Al-Tirmidhi said: This hadith is good authentic (Hasan Sahih). I say: Asim bin Ubaydullah: Weak according to the general opinion of scholars. Perhaps Al-Tirmidhi, may Allah have mercy on him, authenticated it due to its follow-ups and witnesses. See Hadiths (19, 20) of this book.",
    "book_id": "153",
    "new_page_number": 74
  },
  {
    "serial_number": "1281070",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 77,
    "volume_number": 1,
    "text": "(50) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: I heard Talha bin Amr, said: I heard Ata bin Abi Rabah mentioning that in the Torah it is written: I am Allah, there is no god but Me, I decreed good and evil, and blessed is he for whom I decreed good at his hands, and woe to him for whom I decreed evil at his hands (1).",
    "foot_note": "1. In its chain is Talha bin Amr Al-Hadrami Al-Makki: Ahmad bin Hanbal said: Nothing; abandoned in Hadith. Al-Nasa'i said: Abandoned in Hadith. 'Tahdhib Al-Kamal' (13/427). The tradition; Al-Firyabi narrated it in 'Al-Qadar' # (337), and Al-Bayhaqi in his 'Al-Qadar' # (155) from two paths from Wahb bin Munabbih that he found in the Torah similar to it. And Abdul-Razzaq Al-San'ani narrated in his 'Musannaf' (11/114) # (20071) and from his path Ibn Batta in 'Al-Ibanah' # (1905) from Ma'mar, from Al-Zuhri said: It reached me that they found in the Maqam of Ibrahim three sheets... And in the third sheet: I am Allah Lord of Bakkah; ... so he mentioned similar to it. Al-Firyabi narrated it in 'Al-Qadar' # (338), and from him Al-Ajurri in 'Al-Shari'ah', and Al-Bayhaqi in his 'Al-Qadar' # (156) from Aqil, from Al-Zuhri, from Musafi' bin Al-Hajib, so he mentioned similar to it. And it was narrated Marfu' (elevated) from a number of Companions: Al-Tabarani narrated in 'Al-Kabir' # (12797), and Al-Bayhaqi in 'Al-Qadar' # (152, 153) from the path of Amr bin Malik Al-Nukari, from Abu Al-Jawza', from Ibn Abbas with it Marfu'. Al-Bayhaqi said: Its chain is not strong. I say: And there is disagreement in its chain. And Ahmad bin Mani' narrated it in his 'Musnad' [See 'Ithaf Al-Khiyarah Al-Maharah' 1/ L 40/ A] from Muhammad bin Ali, from Jabir said: The Messenger of Allah (peace be upon him) said: «Indeed in some of what Allah revealed of Books: I am Allah; there is no god but Me, I decreed good and evil». Ibn Batta narrated it in 'Al-Ibanah' # (1909) from Ahmad bin Abi Al-Awwam, from his father, from Yahya bin Sabiq, from Abu Hazim, from Sahl bin Sa'd, said: The Messenger of Allah (peace be upon him) said: Allah Almighty said... so he mentioned it. Al-Bayhaqi narrated it in 'Al-I'tiqad' p. (164) - Ed./ Abi Al-Ainain - from Abu Farwah Al-Rahawi, from Abu Yahya Al-Kala'i, from Abu Umamah with it. And its chain is weak.",
    "book_id": "153",
    "new_page_number": 75
  },
  {
    "serial_number": "1281071",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 78,
    "volume_number": 1,
    "text": "(51) - Abdullah bin Suleiman told us, said: Al-Hamdani told us, said: Ibn Wahb informed us, said: Ibn Lahi'ah informed me, from Yazid bin Abi Habib,",
    "foot_note": "None",
    "book_id": "153",
    "new_page_number": 76
  },
  {
    "serial_number": "1281072",
    "category_id": "6",
    "category": "Books of Sunnah",
    "book_title": "Al-Qadar Wa Ma Warada Fi Dhalik Min Al-Athar (Destiny and What Has Been Narrated About It)",
    "edition": "First, 1422 AH - 2001 AD",
    "publisher": "Dar Al-Atta for Publishing and Distribution, Riyadh - Kingdom of Saudi Arabia",
    "page_number": 79,
    "volume_number": 1,
    "text": "that a man said: O (1) Messenger of Allah, does Allah (2) decree misery upon me and punish me for it?! He said: «Yes» (3). End of Part Two, and it is the completion of the Book, and praise be to Allah Lord of the Worlds. * * *",
    "foot_note": "1. \"O\": Not in The Original, and established from (Z) and (H). \n2. The word \"Allah\" is not in The Original and (H), and established from (Z). \n3. Ibn Batta narrated it in \"Al-Ibanah\" # (1435), (1896) from Abdullah bin Yazid Al-Muqri', from Sa'id bin Abi Ayyub, from Yunus bin Bilal, from Yazid bin Abi Habib with it.",
    "book_id": "153",
    "new_page_number": 77
  }
]