[
  {
    "text": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis\nAuthor: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nYear: 852",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "category_id": "26",
    "category": "Biographies and Generations",
    "new_page_number": 1
  },
  {
    "text": "sn: 6574\nbook_title: تعريف اهل التقديس بمراتب الموصوفين بالتدليس\nbook_link: https://shamela.ws/book/1186\nbook_id: 1186\nauthor_name: أبو الفضل أحمد بن علي بن محمد بن أحمد بن حجر العسقلاني\nauthor_year: 852\nnickname: أبو الفضل\nauthor_link: https://shamela.ws/author/202\nauthor_ID: 202\neditor: د. عاصم بن عبدالله القريوتي\npublisher: مكتبة المنار - عمان\nedition: الأولى، 1403 - 1983\npages: 71\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التراجم والطبقات\ncategory_id: 26",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "category_id": "26",
    "category": "Biographies and Generations",
    "new_page_number": 2
  },
  {
    "serial_number": "5600530",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Biographies and Classes (Tabaqat)\nBook: Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis (Defining the People of Sanctification by the Ranks of Those Described with Obfuscation)\nAuthor: Abu al-Fadl Ahmad bin Ali bin Muhammad bin Ahmad bin Hajar al-Asqalani (d. 852 AH)\nInvestigator: Dr. Asim bin Abdullah al-Qaryuti\nNote: In the commentary, the rank to which the narrator belongs has been inserted, distinguishing what the investigator has added to the original book in terms of biographies.\n[The book's numbering corresponds to the printed version]\nDate of publication in Al-Shamela: 8 Dhu al-Hijjah 1431\n\n[Repetitive metadata omitted for brevity as it repeats the above information multiple times]",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 3
  },
  {
    "serial_number": "5600531",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 4
  },
  {
    "serial_number": "5600532",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 5,
    "volume_number": 1,
    "text": "Investigator's Introduction\n\nIndeed, all praise is due to Allah; we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whomever Allah guides, none can lead astray, and whomever He leads astray, none can guide. I testify that there is no deity worthy of worship but Allah alone, without partner, and I testify that Muhammad is His servant and messenger.\n\nAs for what follows:\nThis is the book 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', known as 'Tabaqat al-Mudallisin' (The Classes of Obfuscators), by the miserable scholar, the Hafiz Ahmad bin Ali bin Muhammad bin Muhammad (1), famous as Ibn Hajar al-Asqalani (d. 852 AH). I present it to the noble readers who are concerned with the Sunnah of the Messenger of Allah (peace be upon him), in response to the wish of our virtuous Sheikh, the Muhaddith of Pakistan, Abu al-Tayyib Muhammad Ata Allah Hanif (3)—may Allah bless his life, knowledge, work, family, and wealth. His Eminence wished for me to comment on this book due to the absence of a verified edition in the markets and its scarcity in the lands of India specifically. After placing my reliance on Allah, I embarked on the objective, seeking aid from Allah alone, the Worshipped, asking Him to make this work of mine a service to knowledge and its people.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 5
  },
  {
    "serial_number": "5600533",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 6,
    "volume_number": 1,
    "text": "My Methodology in Investigation:\n1. I relied for the investigation on the copy printed at the Mahmudiya Commercial Press in Egypt, owned by Mahmoud Ali Subayh, which consists of some thirty pages. It appears to be the first edition of the book (3).\n2. I numbered the names of the Mudallisin (Obfuscators), totaling (152), with sequential numbers across all ranks.\n3. I corrected the typographical errors found in the previous edition from the author's own books or other books on narrators (Rijal), indicating this in some instances.\n4. If the narrator is among the men of 'Al-Taqrib' (Taqrib al-Tahdhib) and there is an additional benefit in Al-Taqrib not mentioned in this book, such as the ruling (4) on the narrator or clarification of his generation (Tabaqah) and the like, I established it in the commentary without indicating...",
    "foot_note": "1. (3) I was not able to access a manuscript copy during my investigation of the book. Then, when Allah favored me with residency in the City of the Messenger of Allah (peace and blessings be upon him and his family), our Sheikh, the Muhaddith Al-Hajjar, showed me an investigation of this book of ours published in the Journal of the College of Usul al-Din at Imam Muhammad bin Saud University by Dr. Ahmad Ali Sayr al-Mubaraki. It is investigated based on a manuscript and compared with three copies. The investigation is good and beneficial, except that it lacks the diacritical marking (dabt) of names, kunyas, and titles. Perhaps if the book were published separately and arranged, it would be beautiful, God willing. May Allah reward the Doctor with good. Also, 'Tabaqat al-Mudallisin' was printed in Egypt, published by Maktabat al-Kulliyat al-Azhariyyah, reviewed and introduced by Taha Abd al-Ra'uf Sa'd, but I did not find any investigation in it.\n4. I sufficed with the summary of what Ibn Hajar said because he is the reliance in most cases. Whoever desires detail should refer to the original sources.",
    "book_id": "1186",
    "new_page_number": 6
  },
  {
    "serial_number": "5600534",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 7,
    "volume_number": 1,
    "text": "...referring to 'Al-Taqrib'. Therefore, every commentary I have not attributed to anyone belongs to Al-Hafiz Ibn Hajar from 'Al-Taqrib', unless I explicitly state otherwise.\n5. I compared the symbols appearing in the printed version with those in 'Al-Taqrib' and others, indicating differences.\n6. If the narrator was not from the men of 'Al-Taqrib', I mentioned the statements of the Imams of criticism and modification (Jarh wa Ta'dil) regarding him, attributing the source of the transfer.\n7. I referenced some of the Hadiths mentioned in the book.\n8. At the end of the book, I appended (22) narrators described with Tadlis who were not mentioned in the book of Hafiz Ibn Hajar. Thus, the book actually contains (174) narrators, or rather (177) narrators (5).\n9. I appended two poems on Tadlis at the end of the book; one by Hafiz al-Dhahabi and the other by his student Abu Mahmud al-Maqdisi.\n10. I created an index for all the names of those described with Tadlis, arranging them alphabetically so the researcher knows the place of their mention in the book even if he does not know their rank.\n11. The symbols I used in the investigation are those of Hafiz Ibn Hajar al-Asqalani from the introduction of 'Al-Taqrib', which I list here for benefit:",
    "foot_note": "1. (5) This is considering that the name Sufyan bin Uyainah passed twice as mentioned by Al-Halabi (see biography number 52), and considering that Bukayr is a different narrator than Talid as Al-Iraqi erred (see biography number 132), and considering that Hassan bin Yazid is a different narrator than Jabir bin Yazid as some erred (see biography number 133). (*)",
    "book_id": "1186",
    "new_page_number": 7
  },
  {
    "serial_number": "5600535",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 8,
    "volume_number": 1,
    "text": "Al-Bukhari in his Sahih: (Kh). If his hadith is suspended (Mu'allaq) therein: (Khat). For Al-Bukhari in Al-Adab Al-Mufrad: (Bukh). In Khalq Af'al al-Ibad: (Akh). In Juz' al-Qira'ah: (Z). In Raf' al-Yadayn: (Y). For Muslim: (M). For Abu Dawood: (D). In his Al-Marasil: (Mad). In Fada'il al-Ansar: (Sad). In Al-Nasikh: (Khad). In Al-Qadar: (Qad). In Al-Tafarrud: (F). In Al-Masa'il: (L). In Musnad Malik: (Kad). For Al-Tirmidhi: (T). In Al-Shama'il: (Tam). For Al-Nasa'i: (S). In 'Amal al-Yawm wa al-Laylah: (Si). In Musnad Ali: ('As). In Musnad Malik: (Kan). For Ibn Majah: (Q). In Al-Tafsir: (Faq). If they all agree, the symbol is ('A). As for the symbol (4), it is for them [the four Sunan authors] excluding the two Sheikhs [Bukhari and Muslim]. Whoever has no narration with them is marked with (Tamyiz) [Distinction], indicating he is mentioned to be distinguished from others among those they narrated from.\nAs for the Generations (Tabaqat) according to Al-Hafiz, they are as follows:\nFirst: The Companions (Sahaba) with their varying ranks, distinguishing those who had no more than mere sighting of the Prophet from others.\nSecond: The generation of senior Successors (Tabi'in), like Ibn al-Musayyib. If he was a Mukhadram (lived in Jahiliyyah and Islam but met no Sahaba as a Muslim), I stated that.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 8
  },
  {
    "serial_number": "5600536",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 9,
    "volume_number": 1,
    "text": "Third: The middle generation of Successors, like Al-Hasan and Ibn Sirin.\nFourth: The generation following them, whose main narration is from the senior Successors, like Al-Zuhri and Qatadah.\nFifth: The junior generation among them, who saw one or two [Sahaba], and for some, hearing from Sahaba is not proven, like Al-A'mash.\nSixth: A generation who were contemporaries of the fifth but for whom meeting any Sahabi is not proven, like Ibn Jurayj.\nSeventh: The generation of senior Followers of the Successors (Atba' al-Tabi'in), like Malik and Al-Thawri.\nEighth: The middle generation among them, like Ibn Uyainah and Ibn Ulayyah.\nNinth: The junior generation of Followers of the Successors, like Yazid bin Harun, Al-Shafi'i, Abu Dawood al-Tayalisi, and Abd al-Razzaq.\nTenth: The senior scholars taking from the Followers of the Successors who did not meet the Successors, like Ahmad bin Hanbal.\nEleventh: The middle generation of that group, like Al-Dhuhli and Al-Bukhari.\nTwelfth: The junior scholars taking from the Followers of the Successors, like Al-Tirmidhi.\nThen Al-Hafiz said regarding the death dates of each generation: If he is from the first or second, they are before the [first] century. If from the third to the end of the eighth, they are after the [first] century. If from the ninth...",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 9
  },
  {
    "serial_number": "5600537",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 10,
    "volume_number": 1,
    "text": "...to the end of the generations, they are after two hundred [AH]. Whoever is rare exception to that, I have clarified it. End quote.\nIn conclusion, I ask Allah, the Glorified and Exalted, to make our deeds purely for His Noble Face and to grant us success in what He loves and is pleased with. Indeed, He is All-Hearing, Responsive.\nAnd our final call is that all praise is due to Allah, Lord of the Worlds.\nMedina, 3 Rabi' al-Thani 1404 AH.\nWritten by Abu Suhaib Asim bin Abdullah al-Qaryuti.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 10
  },
  {
    "serial_number": "5600538",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 11,
    "volume_number": 1,
    "text": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis\n(Defining the People of Sanctification by the Ranks of Those Described with Obfuscation)\nBy Al-Hafiz Ahmad bin Ali bin Hajar al-Asqalani",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 11
  },
  {
    "serial_number": "5600539",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 13,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nPraise be to Allah, who is purified from imperfections by glorification and sanctification. Blessings and peace be upon Muhammad, His servant and messenger, who is free from every flaw arising from ambiguity or obfuscation, and upon his family and companions whom his lights encompassed, so they had no need for obfuscation (Tadlis).\nAs for what follows:\nThis is knowledge of the ranks of those described with Tadlis in the chains of Prophetic Hadith. I summarized it in these papers to be memorized. It is derived from *Jami' al-Tahsil* by Imam Salah al-Din al-Ala'i, the Sheikh of our Sheikhs—may Allah cover him with His mercy—with many additions in names that will be recognized by contemplation. They are of five ranks (0):\nFirst (0): Those who were not described with it except rarely, like Yahya bin Sa'id al-Ansari.\nSecond (0): Those whose Tadlis the Imams tolerated and whose narrations they included in the Sahih due to their leadership (Imamah) and the rarity of their Tadlis compared to what they narrated, like Al-Thawri; or because they did not practice Tadlis except from a trustworthy person (Thiqah), like Ibn Uyainah.\nThird (0): Those who practiced Tadlis frequently, so the Imams did not use their hadiths as proof except what they explicitly stated hearing. Among them are those whose hadith was rejected absolutely, and those accepted, like Abu al-Zubayr al-Makki.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 12
  },
  {
    "serial_number": "5600540",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 14,
    "volume_number": 1,
    "text": "Fourth (0): Those whom it is agreed that none of their hadith is used as proof except what they explicitly stated hearing, due to the frequency of their Tadlis from weak and unknown narrators, like Baqiyyah bin al-Walid.\nFifth (0): Those who were deemed weak due to another matter beside Tadlis, so their hadith is rejected even if they explicitly stated hearing, unless the one whose weakness was slight is corroborated, like Ibn Lahi'ah.\nThis mentioned division was edited by the aforementioned Hafiz Salah al-Din in his aforementioned book. Whoever has the symbol (H) is mentioned in the chapter he dedicated to the names of the Mudallisin; otherwise, it is from the additions to it.\nThe names of the Mudallisin were compiled into books by the ancients: Al-Husayn bin Ali al-Karabisi, the companion of Imam al-Shafi'i, then Al-Nasa'i, then Al-Daraqutni. Then the Sheikh of our Sheikhs, Hafiz Shams al-Din al-Dhahabi, composed a poem (Urjuzah) on that, and he was followed by some of...",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 13
  },
  {
    "serial_number": "5600541",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 15,
    "volume_number": 1,
    "text": "...his students, namely Hafiz Abu Mahmud Ahmad bin al-Maqdisi, who added to it from the classification of Al-Ala'i much that Dhahabi had missed. Then our Sheikh, the Hafiz of the Era, Abu al-Fadl bin al-Husayn, appended names that he found as additions in the margins of Al-Ala'i's book. Then his son, the scholar, Chief Judge Wali al-Din Abu Zur'ah, joined what Hafiz bin al-Hafiz had added to what Al-Ala'i mentioned, making it an independent work, and he added a very small amount from his own research. What he added to Al-Ala'i is marked with (Z).\nThe Mudallisin were also compiled into a book by the later scholars, the great meticulous Muhaddith Burhan al-Din al-Halabi, the grandson of Ibn al-Ajami, not restricting himself to Al-Ala'i's book, so he added a few to them. The total number of names in Al-Ala'i's book is sixty-eight souls. Ibn al-Iraqi added thirteen souls to them. Al-Halabi added thirty-two souls to it. And I added thirty-nine souls to both of them. So, the total in this book of mine is one hundred and fifty-two souls. Whoever has the symbol of one of the Six [Books] on him, his hadith is extracted in it (0).",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 14
  },
  {
    "serial_number": "5600542",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 16,
    "volume_number": 1,
    "text": "Chapter (0)\nTadlis (Obfuscation) is sometimes in the Isnad (chain of transmission) and sometimes in the Shuyukh (teachers).\nThat which is in the Isnad is to narrate from someone he met something he did not hear from him using a term that bears possibility [like 'an - from]. Attached to this is one who saw him but did not sit with him.\nAttached to Tadlis al-Isnad is:\n*   **Tadlis al-Qat' (Cutting):** To delete the formula and limit oneself to saying, for example, \"Al-Zuhri from Anas.\"\n*   **Tadlis al-Atf (Conjunction):** To explicitly state hearing from a Sheikh of his and conjoin another Sheikh to him, while he did not hear that from the second.\n*   **Tadlis al-Taswiyah (Leveling):** To do this [omission] to his Sheikh; if he [the narrator] informs that he obfuscated it, it is judged by that. If he does not inform, probablity arises. Thus, what a trustworthy person explicitly states hearing is accepted, and one pauses regarding what is other than that.\nIf he narrates from someone he was contemporary with but his meeting with him is not proven, using a probable formula, it is **Irsaal Khafi** (Hidden Sending). Some have attached it to Tadlis, but differentiation is better to distinguish the types.\nAttached to Tadlis is what occurs from some Muhaddithin of expressing with \"Haddathana\" (He told us) or \"Akhbarana\" (He informed us) for Ijaza (License), implying hearing, while he did not hear anything from that Sheikh.\nWhoever is not described with Tadlis among the trustworthy narrators: if he narrates from someone he met with a probable formula, it is interpreted as hearing. If he narrates from someone he was contemporary with using a probable formula, it is not interpreted as hearing in the chosen correct view, in agreement with Al-Bukhari and his Sheikh Ibn al-Madini.\nWhoever narrates with a probable formula from someone he was not contemporary with, it is absolute Irsaal. If he is a Tabi'i, the Isnad is called Mursal. If he is below him, it is called Munqati' (Broken) or Mu'dal (Perplexing/Double breakage). I have elaborated on that in 'Ulum al-Hadith', and praise be to Allah.\nAmong those described with Tadlis are those who explicitly used \"Tahdith\" regarding...",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 15
  },
  {
    "serial_number": "5600543",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 17,
    "volume_number": 1,
    "text": "...Wijada (Found text), or explicitly used \"Tahdith\" but used a plural formula loosely, implying his inclusion [in the audience] when it was not so. The clarification of who did that will come, God Willing.\nAs for **Tadlis al-Shuyukh**, it is to describe his Sheikh by what he is not famous for—regarding name, title (Laqab), agnomen (Kunya), or attribution (Nisbah)—to create an illusion of having many teachers (Takthir) usually. He may also do that to hide the weakness of his Sheikh. This is treachery from one who does it intentionally, just as if that occurs in Tadlis al-Isnad. And Allah is the One whose help is sought (0).",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 16
  },
  {
    "serial_number": "5600544",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 18,
    "volume_number": 1,
    "text": "The First Rank (0)\nTheir number is thirty-three souls.\n(1) Ahmad bin Abdullah bin Ahmad bin Ishaq al-Asbahani, the Hafiz, Abu Nu'aym, author of many widespread works, including *Hilyat al-Awliya*, *Ma'rifat al-Sahaba*, and the two *Mustakhraj* on the two *Sahihs*. He had Ijaza (license) from people he caught up with but did not meet [in person], so he used to narrate from them with the formula \"Akhbarana\" (He informed us) without clarifying that it was Ijaza. However, when he narrated from someone he heard from, he would say \"Haddathana\" (He told us), whether it was by reading or hearing. This was a terminology of his followed by some, and it contains a type of Tadlis regarding one who does not know that. Al-Khatib said: I saw things from Abu Nu'aym in which he was lenient; among them is that he uses \"Akhbarana\" absolutely for Ijaza without clarification. Al-Dhahabi said: This is a doctrine Abu Nu'aym held, and it is a form of Tadlis, and others have done it.\n(2) Ahmad bin Muhammad bin Ibrahim bin Hazm al-Samarqandi, Abu Yahya al-Karabisi, a famous Muhaddith. He heard from Muhammad bin Nasr al-Marwazi and Muhammad bin Ishaq bin Khuzaymah. Al-Idrisi said: He narrated extensively from Muhammad bin Nasr, so he was accused regarding that, meaning he used Tadlis regarding the Ijaza from him...",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 17
  },
  {
    "serial_number": "5600545",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 19,
    "volume_number": 1,
    "text": "...for he had a valid Ijaza from him. Al-Idrisi said: I saw it in the handwriting of Muhammad bin Nasr.\n(3) Ahmad bin Muhammad bin Yahya bin Hamza al-Dimashqi, the Judge. He narrated extensively from his father from his grandfather. Abu Hatim al-Razi said: I heard him say, 'I did not hear anything from my father.' Abu Awanah al-Isfarayini said: His father gave him Ijaza, so he narrated from him using that [without clarification].\n(4) (Kh 4) Ishaq bin Rashid al-Jazari. He used to use 'Haddathana' loosely for Wijada (found text). He narrated from Al-Zuhri, and it was said to him: 'Where did you meet him?' He said: 'I passed by Jerusalem and found a book.' Al-Hakim recounted that in 'Ulum al-Hadith' from Al-Isma'ili.\n(5) (A) Ayyub bin Abi Tamimah al-Sakhtiyani, one of the Imams agreed upon for using as proof. He saw Anas but did not hear from him, yet he narrated several hadiths from him using 'An'anah' (saying 'from'). Al-Daraqutni and Al-Hakim extracted them in their books.\n(6) Ayyub bin al-Najjar al-Yamami. It is authentic that he said: 'I did not hear from Yahya bin Abi Kathir except one hadith,' yet he narrated more than one hadith from him.",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 18
  },
  {
    "serial_number": "5600546",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 20,
    "volume_number": 1,
    "text": "(7) (A) Jarir bin Hazim al-Azdi, one of the trustworthy narrators (Thiqat). Yahya al-Himmani described him with Tadlis in his hadith from Abu Hazim from Sahl bin Sa'd regarding the description of the Prophet's prayer (peace be upon him).\n(8) (M 4) Al-Husayn bin Waqid al-Marwazi, one of the trustworthy narrators from the Followers of the Successors. Al-Daraqutni and Abu Ya'la al-Khalili described him with Tadlis.\n(9) (A) Hafs bin Ghiyath al-Kufi, the Judge, one of the trustworthy narrators from the Followers of the Successors. Ahmad bin Hanbal and Al-Daraqutni described him with Tadlis.\n(10) (A) Khalid bin Mihran al-Hadhdha', one of the famous reliable narrators. He narrated a hadith from 'Arak bin Malik which he heard from Khalid bin Abi al-Salt from him regarding facing the Qibla while urinating.\n(11) (A) Zayd bin Aslam al-Umari, their freed slave. He narrated from Ibn Umar (may Allah be pleased with them both) regarding returning the greeting (Salam) by gesture. Ibn Ubayd said: I said to a person, 'Ask him, did he hear it from Ibn Umar?' So he asked him, and he said, 'As for me, he spoke to me and I spoke to him.' Al-Bayhaqi extracted it. In this answer, there is an indication that...",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 19
  },
  {
    "serial_number": "5600547",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 21,
    "volume_number": 1,
    "text": "...he did not hear this specifically from him, even though he narrated extensively from him; thus he would have obfuscated (did Tadlis on) it.\n(12) (S) Salamah bin Tammam al-Shaqari, from the Followers of the Successors. Ibn Hibban mentioned him in 'Thiqat al-Tabi'in', and Ibn Abi Hatim mentioned what indicates he used to do Tadlis. Therefore, Al-Ala'i said in 'Kitab al-Marasil': 'It is as if he is a Mudallis.'\n(13) (D S Q) Shibak al-Dabbi, the companion of Ibrahim al-Nakha'i, famous from the people of Kufa. Al-Daraqutni and Al-Hakim described him with Tadlis.\n(14) (A) Tawus bin Kaysan al-Yamani, the famous Successor. Al-Karabisi mentioned him among the Mudallisin and said: He took much knowledge from Ibn Abbas (may Allah be pleased with them both), then after that, he used to send (Mursal) reports from Ibn Abbas. He narrated from Aisha, and Ibn Ma'in said: 'I do not consider that he heard from her.' Abu Dawood said: 'I do not know that he heard from her.'\n(15) (A) Abdullah bin Zayd al-Jarmi, Abu Qilabah, the famous Successor, famous by his Kunya. Al-Dhahabi and Al-Ala'i described him with that [Tadlis].",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 20
  },
  {
    "serial_number": "5600548",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 22,
    "volume_number": 1,
    "text": "(16) (M 4) Abdullah bin Ata al-Ta'ifi, resident of Mecca, from the junior Successors. His case regarding Tadlis is famous; Shu'bah narrated it from Abu Ishaq al-Sabi'i.\n(17) (A) Abdullah bin Wahb al-Misri, the famous Jurist. Muhammad bin Sa'd described him with that in 'Al-Tabaqat'.\n(18) (Kh M D S Q) Abd Rabbih bin Nafi', Abu Shihab al-Hannat (with a Muhmalah [Ha] and Nun), resident of Al-Mada'in. Ibn Ma'in declared him trustworthy, Al-Nasa'i softened him, and Al-Khatib indicated in the introduction of his History that he obfuscated (did Tadlis on) a hadith.\n(19) Ali bin Umar bin Mahdi al-Daraqutni, the famous Hafiz. Abu al-Fadl bin Tahir said: He had a hidden method in Tadlis; he would say 'It was read to Abu al-Qasim al-Baghawi: So-and-so told you,' creating the illusion that he heard from him, but he would not say 'while I was listening.'\n(20) (A) Amr bin Dinar al-Makki, the famous trustworthy Successor. Al-Hakim indicated in 'Ulum al-Hadith' that he used to do Tadlis.",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 21
  },
  {
    "serial_number": "5600549",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 23,
    "volume_number": 1,
    "text": "(21) 'A Al-Fadl ibn Dukayn ibn Zuhayr, Abu Nu'aym al-Kufi. Famous, one of the senior sheikhs of Al-Bukhari. Ahmad ibn Salih al-Misri described him as such. (22) 'A Malik ibn Anas, the famous Imam. Whoever considers Taswiyah (a form of Tadlis) as Tadlis must include him, because he used to narrate from Thawr ibn Zayd the hadith of Ikrimah from Ibn Abbas, and he would delete Ikrimah. This occurred in more than one hadith in Al-Muwatta'. He says 'from Thawr from",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 22
  },
  {
    "serial_number": "5600550",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 24,
    "volume_number": 1,
    "text": "Ibn Abbas' and does not mention Ikrimah. Likewise, he used to drop Asim ibn Abdullah from another chain of narration mentioned by Al-Daraqutni. Ibn Abd al-Barr denied that this was Tadlis. (23) Q, S Muhammad ibn Isma'il ibn Ibrahim ibn al-Mughirah al-Bukhari, the Imam. Abu Abdullah ibn Mandah described him as such in a statement of his, saying: \"Al-Bukhari extracted 'So-and-so said' and 'So-and-so said to us', and this is Tadlis.\" Ibn Mandah was not agreed with on this. What appears is that he says 'He said to me' or 'He said to us' regarding what he did not hear, and what he heard but is not according to his condition (for inclusion in the Sahih), or is suspended (Mawquf). This is known by induction from his practice.",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 23
  },
  {
    "serial_number": "5600551",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 25,
    "volume_number": 1,
    "text": "(24) Muhammad ibn Imran ibn Musa al-Marzubani, the scribe and historian. He used to generalize 'Al-Tahdith' (he told us) and 'Al-Ikhbar' (he informed us) in Ijazah (license to transmit) without clarifying. Al-Khatib and others mentioned this. (25) T, Q Muhammad ibn Yazid ibn Khunays al-Abid. Ibn Hibban said: \"His hadith is considered if he clarifies hearing in his narration.\" (26) Muhammad ibn Yusuf ibn Masdi, the Hafiz of Andalusia, resident of Mecca in the seventh century. He used to practice Tadlis al-Ijazah (concealing that transmission was by license). He has a famous Mu'jam. He died in Mecca in the year 663. (27) M, D, S Makhramah ibn Bukayr ibn Abdullah ibn al-Ashajj. Ibn al-Madini said: \"He heard a little from his father.\" It was also said he heard nothing from him and narrated much from him. Abu Dawud said: \"He did not hear from him except the hadith of Witr.\" Zakariya al-Saji described him with Tadlis. Malik said: \"Makhramah swore to me that he heard from his father.\" Musa ibn Salamah said: \"I said to Makhramah ibn Bukayr, 'Did you hear from your father?' He said, 'I did not catch my father; these are his books.'\"",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 24
  },
  {
    "serial_number": "5600552",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 26,
    "volume_number": 1,
    "text": "(28) T Muslim ibn al-Hajjaj al-Qushayri al-Naysaburi, the famous Imam. Ibn Mandah said that he used to say regarding what he did not hear from his sheikhs: \"So-and-so said to us,\" and this is Tadlis. Our Sheikh Al-Hafiz Abu al-Fadl ibn al-Husayn rejected this, and it is as he said. (29) 'A Musa ibn Uqbah al-Madini. A trustworthy junior Tabi'i, agreed upon. Al-Daraqutni described him with Tadlis; Al-Isma'ili indicated this. (30) 'A Hisham ibn Urwah ibn al-Zubayr ibn al-Awwam. A famous junior Tabi'i. Abu al-Hasan al-Qattan mentioned him as such. Al-Dhahabi and Ibn al-Qattan denied it. The famous story about him is that he came to Iraq three times. In the first, he narrated from his father and explicitly stated his hearing. In the second, he narrated much but did not explicitly state the story, which implies he narrated from him what he did not hear from him. This is Tadlis.",
    "foot_note": "1. [Commentary] The First Rank",
    "book_id": "1186",
    "new_page_number": 25
  },
  {
    "serial_number": "5600553",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 27,
    "volume_number": 1,
    "text": "(31) 'A Lahiq ibn Humayd, Abu Mijlaz al-Basri. The famous Tabi'i, companion of Anas. Famous by his Kunya. Ibn Abi Khaythamah indicated from Ibn Ma'in that he used to practice Tadlis, and Al-Daraqutni affirmed this. (32) 'A Yahya ibn Sa'id ibn Qahd (with Qaf) ibn Qays al-Ansari al-Madini. A famous junior Tabi'i. Ali al-Madini described him as such, as mentioned by Abd al-Ghani ibn Sa'id al-Azdi. Al-Daraqutni also described him as such. (33) 'A Yazid ibn Harun al-Wasiti. One of the luminaries from the followers of the Tabi'in. He said: \"I never practiced Tadlis except in one hadith, and there was no blessing in it.\"\n\n(0) The Second Rank (0) Their number is thirty-three persons. (34) Ibrahim ibn Sulayman al-Aftas al-Dimashqi. [Narrated] from Makhul and others, and from Yahya ibn Hamzah and a group. Abu Hatim said: \"There is no harm in him.\" Al-Bukhari indicated that he used to practice Tadlis.",
    "foot_note": "1. [Commentary] The First Rank\n\n1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 26
  },
  {
    "serial_number": "5600555",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 28,
    "volume_number": 1,
    "text": "(35) 'A Ibrahim ibn Yazid al-Nakha'i. The famous Jurist among the Tabi'in from the people of Kufa. Al-Hakim mentioned that he used to practice Tadlis. Abu Hatim said: \"He did not meet any of the Companions except Aisha (may Allah be pleased with her), and he did not hear from her.\" He used to send Mursal reports frequently, especially from Ibn Mas'ud, and he narrated from Anas and others in Mursal form. (36) 'A Isma'il ibn Abi Khalid al-Mashhur al-Kufi. Trustworthy, from the junior Tabi'in. Al-Nasa'i described him with Tadlis. (37) 'A Ash'ath ibn Abd al-Malik al-Humrani al-Basri. Mu'adh said: \"I heard him say: Everything I narrated to you from Al-Hasan is from him [directly], except three hadiths: the hadith of the one who bows before reaching the row, the hadith of the waiting period of the menstruating woman, and the hadith of Ali regarding Khulas (deliverance/divorce payment).\" (38) M, 4 Bashir ibn al-Muhajir al-Ghanawi al-Kufi. From the junior Tabi'in. Ibn Hibban said in 'Al-Thiqat': \"He used to practice Tadlis.\" (39) M, 4 Jubayr ibn Nufayr al-Hadrami. From the trustworthy Tabi'in from the people of Sham. Al-Dhahabi said in 'Tabaqat al-Huffaz': \"He perhaps practiced Tadlis from the senior Companions.\"",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 27
  },
  {
    "serial_number": "5600556",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 29,
    "volume_number": 1,
    "text": "(40) 'A Al-Hasan ibn Abi al-Hasan al-Basri. The famous Imam, one of the masters of the Tabi'in. He saw Uthman and heard his sermon, and he saw Ali but his hearing from him is not proven. He was prolific in hadith and sent many Mursal reports from everyone. Al-Nasa'i and others described him with Tadlis of the Isnad. (41) Al-Hasan ibn Ali ibn Muhammad al-Tamimi, Abu Ali al-Mudhahhab. The narrator of Musnad Ahmad from Al-Qati'i. Al-Khatib said: \"He narrated from Al-Qati'i a hadith he did not hear from him.\" Al-Dhahabi said: \"Perhaps he considered it permissible to narrate it by Ijazah and Wijadah.\" Al-Khatib said: \"He narrated to me from Abu Umar ibn Mahdi a hadith, so I said, 'This was not with Ibn Mahdi,' so he struck it out.\" Al-Khatib said: \"His hearing was correct in the Musnad",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 28
  },
  {
    "serial_number": "5600557",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 30,
    "volume_number": 1,
    "text": "except in parts of it where he inserted his name.\" Ibn Nuqtah critiqued him saying that he did not narrate the Musnads of Fadalah ibn Ubayd and Awf ibn Malik, nor a portion of the Musnad of Jabir. If he were inserting his name, he would have inserted it in all of them. Perhaps what Al-Khatib mentioned about him inserting it was because he knew he heard it or narrated it by Ijazah. (42) Al-Hasan ibn Mas'ud, Abu Ali al-Dimashqi ibn al-Wazir. A prolific Muhaddith known for memory. Ibn Asakir described him with Tadlis and said he died in the year 543. (43) 'A Al-Hakam ibn Utaybah (with two dots above then one dot below, diminutive). A junior Tabi'i, one of the jurists of Kufa, famous. Al-Nasa'i described him with Tadlis, and Al-Sulami narrated this from Al-Daraqutni. (44) 'A Hammad ibn Usamah, Abu Usamah al-Kufi. One of the Huffaz from the followers of the Tabi'in. Famous by his Kunya. Agreed upon regarding using him as proof. He died in the year 200. Al-Qibti described him as such, saying: \"He practiced Tadlis frequently,\" then retracted it. Ibn Sa'd said: \"He had many hadiths, practiced Tadlis, and clarified his Tadlis.\" Ended. Ahmad said: \"He had a correct book and was precise in his hadith.\" He also said: \"He was firm (Thabt); what he established he hardly erred in.\" He died in the year 201. (45) M, 4 Hammad ibn Abi Sulayman al-Kufi. The famous Jurist. Al-Shafi'i mentioned that Shu'bah narrated a hadith from Hammad from Ibrahim.",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 29
  },
  {
    "serial_number": "5600558",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 31,
    "volume_number": 1,
    "text": "He said: I said to Hammad, \"Did you hear it from Ibrahim?\" He said, \"No, Mughirah ibn Miqsam informed me of it from him.\" (46) 'A Khalid ibn Ma'dan al-Shami. The famous trustworthy narrator. Al-Dhahabi said: \"He used to send Mursal reports and practice Tadlis.\" (47) 'A Zakariya ibn Abi Za'idah al-Kufi. From the followers of the Tabi'in. He narrated frequently from Al-Sha'bi and Ibn Jurayj. Al-Daraqutni described him with Tadlis. (48) 'A Salim ibn Abi al-Ja'd al-Kufi. A famous trustworthy narrator from the Tabi'in. Al-Dhahabi mentioned him as such in 'Al-Mizan'. (49) M, 4 Sa'id ibn Abd al-Aziz al-Dimashqi. Trustworthy, one of the senior scholars of Sham, from the layer of Al-Awza'i. He narrated from Ziyadah ibn Abi Sawdah. Abu al-Hasan ibn al-Qattan said: \"It is not known if he heard it from him or practiced Tadlis from him.\" (50) 'A Sa'id ibn Abi Arubah al-Basri. He saw Anas (may Allah be pleased with him) and narrated frequently from Qatadah. He is one of those who became confused (mixed up). Al-Nasa'i and others described him with Tadlis.",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 30
  },
  {
    "serial_number": "5600559",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 32,
    "volume_number": 1,
    "text": "(51) 'A Sufyan ibn Sa'id al-Thawri. The famous Imam, Jurist, Worshipper, Great Hafiz. Al-Nasa'i and others described him with Tadlis. Al-Bukhari said: \"How little is his Tadlis.\" (52) 'A Sufyan ibn Uyaynah al-Hilali al-Kufi then al-Makki. The famous Imam, the jurist of Hijaz in his time. He used to practice Tadlis, but he did not practice Tadlis except from a trustworthy narrator. Ibn Hibban claimed this was specific [to him]. Al-Nasa'i and others described him with Tadlis. Al-Burhan al-Halabi mentioned two biographies for Sufyan ibn Uyaynah: the first is this one, and the second is Sufyan ibn Uyaynah al-Hilali, Mawla of Mis'ar ibn Kidam from Asfal; 'he is nothing, he used to practice Tadlis.' Al-Burhan said: \"This is another one, other than the first.\" I say: It is not as he thought, for Ibn Uyaynah is a Mawla of Banu Hilal. Al-Dhahabi mentioned in the benefits of his journey that when he met Ibn Daqiq al-Eid, he asked him, \"Who is Abu Muhammad al-Hilali?\" He said, \"Sufyan ibn Uyaynah,\" and he was impressed by his recall. He was attributed to Mis'ar only because Mis'ar is from Banu Hilal by lineage (Salibah). Perhaps Al-Ijli only said 'he is nothing' for a matter other than",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 31
  },
  {
    "serial_number": "5600560",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 33,
    "volume_number": 1,
    "text": "Tadlis, perhaps confusion (Ikhtilat). Then I reviewed the original 'Al-Thiqat' by Al-Ijli and found him saying verbatim: \"Sufyan ibn Uyaynah...\" (53) Kh T, M, 4 Sulayman ibn Dawud al-Tayalisi, Abu Dawud. The Hafiz, famous by his Kunya. One of the prolific trustworthy narrators. Yazid ibn Zuray' said: \"I asked him about two hadiths of Shu'bah, and he said, 'I did not hear them from him.' He said: Then he narrated them from Shu'bah.\" Al-Dhahabi said: \"He practiced Tadlis regarding them from him, so what?\" I say: It is possible that he recalled them. If he did practice Tadlis regarding them, it is subject to consideration: if he mentioned a formula that bears possibility, it is Tadlis of Isnad, and if he mentioned an explicit formula, it is Tadlis of Ijazah. (54) 'A Sulayman ibn Tarkhan al-Taymi. A famous Tabi'i, from the junior Tabi'in of Basra. He was virtuous. Al-Nasa'i and others described him with Tadlis. (55) 'A Sulayman ibn Mihran al-A'mash. The Muhaddith of Kufa and its Reciter. He used to practice Tadlis. Al-Karabisi, Al-Nasa'i, Al-Daraqutni, and others described him as such. (56) T Sharik ibn Abdullah al-Nakha'i, the Judge. Famous. He was one of the firm narrators (Athbat). When he assumed the judiciary, his memory changed. He used to absolve himself of Tadlis. Abd al-Haqq attributed Tadlis to him in 'Al-Ahkam', and Al-Daraqutni preceded him in describing him with it.",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 32
  },
  {
    "serial_number": "5600561",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 34,
    "volume_number": 1,
    "text": "(57) 4 Shu'ayb ibn Muhammad ibn Abdullah ibn Amr ibn al-As. He narrates from his grandfather. His son Amr narrated from him. His sheikhs are well-known. Another son of his named Umayr (with Damma on 'Ayn'), Thabit al-Bunani, Ata al-Khurasani, and others also narrated from him. Most of what is narrated from him is via his son Amr. His biography will come. They differed regarding his hearing from his grandfather. Ibn al-Madini, Al-Bukhari, Al-Daraqutni, Ahmad ibn Sa'id al-Darimi, and Abu Bakr ibn Ziyad al-Naysaburi asserted that he heard from him. Ahmad ibn Hanbal said: \"I think he heard from him.\" Ibn Ma'in asserted that he did not hear from him, saying: \"He found the book of Abdullah ibn Amr and narrated from it.\" Ibn Hibban said: \"Whoever says he heard from his grandfather, that is not correct.\" I say: He has explicitly stated his hearing from his grandfather in hadiths. [Assuming] that he heard a little from his grandfather, if all are authentic [chains], the form of Tadlis is found. (58) 'A Abd al-Razzaq ibn Hammam al-San'ani. The famous Hafiz. Agreed upon regarding the extraction of his hadith. Some have attributed Tadlis to him. It has been reported from Abd al-Razzaq that he absolved himself of Tadlis. He said: \"I performed Hajj and stayed for three days with no People of Hadith coming to me. So I held onto the Kaaba and said: 'O Lord, what is wrong with me? Do I lie? Am I a Mudallis? Am I Baqiyyah ibn al-Walid?' Then I returned to the house and they came to me.\" It is possible that he was negating the abundance of Tadlis, given the context of mentioning Baqiyyah.",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 33
  },
  {
    "serial_number": "5600562",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 35,
    "volume_number": 1,
    "text": "(59) Kh, M, D, T, S Ikrimah ibn Khalid ibn Sa'id ibn al-As ibn Hisham al-Makhzumi. A famous Tabi'i. He was described as such [a Mudallis] by al-Dhahabi in his Urjuzah (poem) and by al-Ala'i in 'Al-Marasil'. (60) 4 Amr ibn Shu'ayb ibn Muhammad ibn Abdullah ibn Amr ibn al-As al-Sahmi. A famous junior Tabi'i. There is disagreement regarding him, but the majority hold that he is truthful (Saduq) in himself, and his hadith from other than his father from his grandfather is strong. Ibn Ma'in said: \"If he narrates from his father from his grandfather, it is a book [manuscript].\" From here came his weakness; if he narrates from Sa'id ibn al-Musayyib, Sulayman ibn Yasar, and Urwah, he is trustworthy (Thiqah). Abu Zur'ah said: \"Trustworthy people narrated from him, but they only rejected his frequent narration from his father from his grandfather. They said he only heard a few hadiths and took a scroll/manuscript (Sahifah) he had and narrated from it. Most of the rejected reports (Manakir) in his hadith come from the narration of weak narrators from him. He is trustworthy in himself; he was only criticized because of a book he possessed.\" Ibn Abi Khaythamah said: \"I heard Harun ibn Ma'ruf say: Amr did not hear anything from his father; he only found it in his father's book.\" Ibn Adi said: \"The Imams of the people and their trustworthy ones, as well as a group of weak ones, narrated from him. However, his hadiths from his father from his grandfather, despite their tolerance of him, they did not include in the Sahih collections they extracted.\" He said: \"It is a Sahifah.\" I [Ibn Hajar] say: According to the implication of their words, this would be Tadlis, because his hearing from his father is proven, yet he narrated from him a great deal of what he did not",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 34
  },
  {
    "serial_number": "5600563",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 36,
    "volume_number": 1,
    "text": "hear from him, from what he took from the Sahifah using the formula 'an' (from). This is one of the forms of Tadlis, and Allah knows best. (61) 'A Muhammad ibn Khazim al-Kufi, Abu Mu'awiyah al-Darir. Famous by his Kunya, known for his vast memory. The most reliable of Al-A'mash's companions regarding Al-A'mash. Al-Daraqutni described him with Tadlis. (62) Q Muhammad ibn Hammad al-Tehrani, the narrator from Abd al-Razzaq. Abu Muhammad ibn Hazm indicated that he engaged in Tadlis in a hadith. (63) 'A Yahya ibn Abi Kathir al-Yamani. From the junior Tabi'in. A famous Hafiz, frequently narrated Mursal reports. It is said that no hearing from a Companion is authenticated for him. Al-Nasa'i described him with Tadlis. (64) 'A Yunus ibn Ubayd al-Basri. One of the Huffaz of Basra, a famous trustworthy narrator. Al-Nasa'i described him with Tadlis, and Al-Sulami mentioned the same from Al-Daraqutni. (65) M, S, Q Yunus ibn Abd al-A'la al-Sadafi al-Misri. He narrated from Al-Shafi'i from Muhammad ibn Khalid al-Jundi the hadith of Anas which Ibn Majah extracted. Al-Dhahabi indicated that Yunus practiced Taswiyah (a form of Tadlis) in it.",
    "foot_note": "1. [Commentary] The Second Rank",
    "book_id": "1186",
    "new_page_number": 35
  },
  {
    "serial_number": "5600564",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 37,
    "volume_number": 1,
    "text": "(66) M, 4 Yunus ibn Abi Ishaq Amr ibn Abdullah al-Sabi'i. A famous Hafiz from Kufa. It is said that he narrated a hadith from Al-Sha'bi, which is his hadith from Al-Harith from Ali (may Allah be pleased with him): \"Abu Bakr and Umar are the masters of the mature people of Paradise,\" and he dropped Al-Harith [from the chain].\n\n(0) The Third Rank (0) Their number is fifty persons. (67) Ahmad ibn Abd al-Jabbar al-Utaridi al-Kufi. A famous Muhaddith regarding whom people have spoken. Ibn Adi said: \"I know of no denounced report (Munkar) from him; they only attributed to him that he did not hear from many of those he narrated from.\" (68) 4 Isma'il ibn Ayyash, Abu Utbah al-Ansi (with an unpointed 'ayn', then a static 'nun'). The scholar of the people of Sham in his era. There is disagreement regarding his reliability. His hadith from the people of Sham is accepted by the majority. Ibn Ma'in, and later Ibn Hibban in 'Al-Thiqat', indicated that he used to practice Tadlis. (69) 'A Habib ibn Abi Thabit al-Kufi. A famous Tabi'i who practiced Tadlis frequently. Ibn Khuzaymah, Al-Daraqutni, and others described him as such.",
    "foot_note": "1. [Commentary] The Second Rank\n\n1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 36
  },
  {
    "serial_number": "5600566",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 38,
    "volume_number": 1,
    "text": "Abu Bakr ibn Ayyash reported from Al-A'mash about him that he used to say: \"If a man narrated to me from you, I wouldn't mind narrating it from you,\" meaning dropping the intermediary from the middle. (70) Kh, D, T, Q Al-Hasan ibn Dhakwan. There is disagreement regarding using him as proof. He has one hadith in Sahih Al-Bukhari. Ibn Sa'id indicated that he was a Mudallis. (71) 'A Humayd al-Tawil. The companion of Anas. Famous for frequently practicing Tadlis from him, to the point it was said that most of his hadith from him is via Thabit and Qatadah. Al-Nasa'i and others described him with Tadlis. His explicit statement of hearing from Anas and using \"haddathana\" (he told us) occurs in many hadiths in Al-Bukhari and elsewhere. (72) D Shu'ayb ibn Ayyub al-Sayrafi. One of Abu Dawud's sheikhs. Ibn Hibban and Al-Daraqutni described him with Tadlis. (73) Shu'ayb ibn Abdullah. Ali ibn Abdullah al-Madini said: Husayn ibn al-Hasan al-Ashqar narrated to me from Shu'ayb ibn Abdullah from Abu Abdullah from Nawf from Ali (may Allah be pleased with him) mentioning a hadith. He said: So I said to Husayn, \"From whom did you hear it?\" He said, \"From Shu'ayb.\" So I said to Shu'ayb, \"Who told you?\" He said, \"Abu Abdullah al-Jassas from Hammad al-Qassab.\"",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 37
  },
  {
    "serial_number": "5600567",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 39,
    "volume_number": 1,
    "text": "So I said to Hammad al-Qassab, \"Who told you?\" He said, \"It reached me from Farqad from Nawf.\" So he had practiced Tadlis regarding three people, meaning he dropped them. (74) D, T, S Safwan ibn Salih ibn Dinar al-Dimashqi, Abu Abd al-Malik the Mu'adhin. Abu Dawud and others declared him trustworthy. He was attributed with Taswiyah (a form of Tadlis). His report regarding that will come in the biography of Muhammad ibn Musaffa al-Himsi. (75) 'A Talhah ibn Nafi' al-Wasiti, Abu Sufyan. The narrator from Jabir. Truthful (Saduq), famous by his Kunya, known for Tadlis. Al-Daraqutni and others described him as such. (76) Abdullah ibn Marwan, Abu Shaykh al-Harrani. He narrates from Zuhayr from Mu'awiyah and others. Husayn ibn Mansur and Ibrahim ibn al-Haytham narrated from him. Ibn Hibban said in 'Al-Thiqat': \"His hadith is considered if he clarifies hearing in his report.\" (77) Abdullah ibn Abi Najih al-Makki, the Exegete. He narrated frequently from Mujahid and used to practice Tadlis from him. Al-Nasa'i described him as such. (78) Bukh (Adab), D, S Abd al-Jalil ibn Atiyyah al-Qaysi, Abu Salih al-Basri. Ibn Ma'in declared him trustworthy. Al-Bukhari said: \"He errs in things.\" Ibn Hibban said: \"His hadith is considered if he clarifies hearing.\"",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 38
  },
  {
    "serial_number": "5600568",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 40,
    "volume_number": 1,
    "text": "(79) Kh T, 4 Abd al-Rahman ibn Abdullah ibn Mas'ud. Trustworthy. Ibn Ma'in said he did not hear from his father. Ibn al-Madini said he met his father and heard two hadiths from him: the hadith of the lizard (Dabb) and the hadith of delaying prayer. Al-Ijli said: It is said he did not hear from his father except one phrase: \"Muharram al-Haram\". Al-Bukhari mentioned in 'Al-Tarikh al-Awsat' via Ibn Khuthaym from Al-Qasim ibn Abd al-Rahman from his father who said: \"I was with my father...\" then he mentioned the hadith about delaying prayer. Al-Bukhari said: \"I heard him say he did not hear from his father, and the hadith of Ibn Khuthaym is doubtful to me.\" Ahmad said: \"He was six years old at the death of his father.\" Al-Thawri and Sharik say he heard, and Isra'il says in the hadith of the lizard from him: \"I heard.\" Al-Bukhari extracted in 'Al-Tarikh al-Saghir' via Al-Qasim ibn Abd al-Rahman from his father: \"When death approached Abdullah, I said to him, 'Advise me.' He said, 'Weep for your sin.'\" Its chain is passable. I say: Based on this, there are four instances where he explicitly stated hearing from his father, one of which is suspended (Mawquf). His hadiths from him are many; in the Sunan there are fifteen, and in the Musnad an additional seven hadiths, most of which are with 'an' (an'ana). This is Tadlis, and Allah knows best. (80) 'A Abd al-Rahman ibn Muhammad al-Muharibi. A famous Muhaddith from the layer of Abdullah ibn Numayr. Al-Uqayli described him with Tadlis. (81) Abd al-Aziz ibn Abdullah al-Qurashi al-Basri, Abu Wahb al-Jad'ani. He narrated from Sa'id ibn Abi Arubah, Khalid al-Hadhdha,",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 39
  },
  {
    "serial_number": "5600569",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 41,
    "volume_number": 1,
    "text": "and Bahz ibn Hakim. Al-Hasan ibn Mudrik and others narrated from him. Ibn Hibban said in 'Al-Thiqat': \"His hadith is considered if he clarifies hearing.\" Ibn Adi criticized him and said: \"Generally what he narrates is not corroborated.\" (82) M, 4 Abd al-Majid ibn Abd al-Aziz ibn Abi Dawud al-Makki. Truthful (Saduq), attributed to Irja', has something (weakness) in his memory, and was attributed to Tadlis. Among those who listed him among them is Al-Ala'i. (83) 'A Abd al-Malik ibn Abd al-Aziz ibn Jurayj al-Makki. The jurist of Hijaz, famous for knowledge and firmness, prolific in hadith. Al-Nasa'i and others described him with Tadlis. Al-Daraqutni said: \"The worst Tadlis is the Tadlis of Ibn Jurayj, for it is ugly Tadlis; he only practices Tadlis in what he heard from a wounded (weak) narrator.\" (84) 'A Abd al-Malik ibn Umayr al-Qibti al-Kufi. A famous Tabi'i, one of the trustworthy ones. Famous for Tadlis. Al-Daraqutni, Ibn Hibban, and others described him as such. (85) M, 4 Abd al-Wahhab ibn Ata al-Khaffaf al-Basri. Truthful, well-known, from the layer of Abu Usamah. Al-Bukhari said: \"He used to practice Tadlis from Thawr al-Himsi and others regarding rejected hadiths (Manakir).\"",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 40
  },
  {
    "serial_number": "5600570",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 42,
    "volume_number": 1,
    "text": "(86) Ubaydah ibn al-Aswad ibn Sa'id al-Hamdani. Ibn Hibban indicated in 'Al-Thiqat' that he used to practice Tadlis. (87) Uthman ibn Umar al-Hanafi. From Ibn Jurayj, and from him Muhammad ibn Harb al-Nasa'i. Ibn Hibban said in 'Al-Thiqat': \"His hadith is considered if he clarifies hearing.\" (88) Kh T, M, 4 Ikrimah ibn Ammar al-Yamani. From the junior Tabi'in. Ahmad and Al-Daraqutni described him with Tadlis. (89) S, Q Ali ibn Ghurab al-Kufi al-Qashi. There is disagreement about him. Ibn Ma'in declared him trustworthy. Al-Daraqutni and others described him with Tadlis. (90) Umar ibn Ali ibn Ahmad ibn al-Layth al-Bukhari al-Laythi, Abu Muslim. The famous Hafiz. He traveled extensively and had many writings. Among the later scholars. He died in the year 466, and it is said he died in the year 468. Yahya ibn Mandah described him with Tadlis, and Shirawayh said: \"He used to memorize and practice Tadlis.\" (91) 'A Amr ibn Abdullah al-Sabi'i al-Kufi. Famous for Tadlis. He is a trustworthy Tabi'i. Al-Nasa'i and others described him as such.",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 41
  },
  {
    "serial_number": "5600571",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 43,
    "volume_number": 1,
    "text": "(92) 'A Qatadah ibn Di'amah al-Sadusi al-Basri. The companion of Anas ibn Malik (may Allah be pleased with him). He was the Hafiz of his era. He is famous for Tadlis; Al-Nasa'i and others described him with it. (93) Kh T, D, T, Q Mubarak ibn Fadalah al-Basri. Famous for Tadlis; Al-Daraqutni and others described him with it. He narrated frequently from Al-Hasan al-Basri. (94) Muhammad ibn al-Husayn al-Bukhari. Narrates from Waki', and his two sons Umar and Ibrahim narrated from him. Ibn Hibban indicated that he used to practice Tadlis. (95) Muhammad ibn Sadaqah al-Fadaki. One of Malik's companions. Ibn Hibban described him with Tadlis in the book 'Al-Thiqat', and Al-Daraqutni also described him as such. (96) H, D, T, S Muhammad ibn Abd al-Rahman al-Tufawi. From the followers of the Tabi'in. Ahmad and Al-Daraqutni mentioned him with Tadlis.",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 42
  },
  {
    "serial_number": "5600572",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 44,
    "volume_number": 1,
    "text": "(97) Muhammad ibn Abd al-Malik al-Kabir, Abu Isma'il. He narrated from Isma'il ibn Abi Khalid and his layer. Wahb ibn Baqiyyah narrated from him. Ibn Hibban described him with Tadlis, and Al-Dhahabi also generalized this about him in 'Tadhhib al-Tahdhib'. (98) Kh T, M, 4 Muhammad ibn Ajlan al-Madani. A famous junior Tabi'i. One of Malik's sheikhs. Ibn Hibban described him with Tadlis. (99) Kh, N, D, S, Q Muhammad ibn Isa ibn Najih, Abu Ja'far ibn al-Tabba'. A famous trustworthy narrator. His companion Abu Dawud said: \"He was a Mudallis.\" Al-Daraqutni also described him as such. (100) Muhammad ibn Muhammad ibn Sulayman al-Baghandi. The Hafiz of Baghdad, Abu Bakr. Famous for Tadlis despite his truthfulness and honesty. He died after the year three hundred. Al-Isma'ili said: \"I do not accuse him, but he practices Tadlis.\" Ibn al-Muzaffar said: \"Nothing is disapproved from him except Tadlis.\" Al-Daraqutni said: \"He writes from some of his companions then drops three people between him and his sheikh.\"",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 43
  },
  {
    "serial_number": "5600573",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 45,
    "volume_number": 1,
    "text": "(101) 'A Muhammad ibn Muslim ibn Tadrus al-Makki, Abu al-Zubayr. From the Tabi'in. Famous for Tadlis. Al-Hakim erred in the book 'Ulum al-Hadith' when he said regarding a chain, \"and in it are men not known for Tadlis,\" while Al-Nasa'i and others described him with Tadlis. (102) 'A Muhammad ibn Muslim ibn Ubayd Allah ibn Shihab al-Zuhri. The Jurist of Medina who settled in Sham. Famous for leadership and majesty. From the Tabi'in. Al-Shafi'i, Al-Daraqutni, and more than one person described him with Tadlis. (103) Muhammad ibn al-Musaffa. Abu Hatim ibn Hibban said: I heard Abu al-Hasan ibn Jawdha say: I heard Abu Zur'ah al-Dimashqi say: \"Safwan ibn Salih and Muhammad ibn Musaffa used to practice Taswiyah (a form of Tadlis) in Hadith like Baqiyyah ibn al-Walid.\" He mentioned this at the end of the introduction to 'Al-Du'afa'. (104) Q Muhriz ibn Abdullah, Abu Raja al-Jazari. From the followers of the Tabi'in. Ibn Hibban described him as such in 'Al-Thiqat'. (105) 'A Marwan ibn Mu'awiyah al-Fazari. From the followers of the Tabi'in. He was famous for Tadlis and used to practice Tadlis of the Sheikhs (obscuring their identity) as well. Al-Daraqutni described him as such.",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 44
  },
  {
    "serial_number": "5600574",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 46,
    "volume_number": 1,
    "text": "(106) Mus'ab ibn Sa'id, Abu Khaythamah al-Massisi. His origin is from Khurasan. He narrated from Abu Khaythamah al-Ju'fi, Ibn al-Mubarak, and others. Al-Hasan ibn Sufyan, Abu Hatim al-Razi, and a group narrated from him. Ibn Adi said he used to misread/misspell (Yusah-hif). Ibn Hibban said in 'Al-Thiqat': \"He used to practice Tadlis but refrained in the end of his life.\" (107) 'A Al-Mughirah ibn Miqsam al-Dabbi al-Kufi. The companion of Ibrahim al-Nakha'i. A famous trustworthy narrator. Al-Nasa'i described him with Tadlis. Al-Ijli narrated this from Abu Fudayl. Abu Dawud said: \"He did not practice Tadlis,\" and perhaps he meant what Al-Ijli narrated that he used to send Mursal reports from Ibrahim, but if stopped (asked for clarification), he would inform them from whom he heard it. (108) M, 4 Makhul al-Shami. The famous Jurist. A Tabi'i. It is said he did not hear from the Companions except from a few individuals. Ibn Hibban described him as such, and Al-Dhahabi generalized that he used to practice Tadlis, though I did not see this from the earlier scholars except in the statement of Ibn Hibban.",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 45
  },
  {
    "serial_number": "5600575",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 47,
    "volume_number": 1,
    "text": "(109) T, Q Maymun ibn Musa al-Mar'i. Companion of Al-Hasan al-Basri. Al-Nasa'i and Al-Daraqutni said he used to practice Tadlis. Ibn Adi also narrated this from Ahmad ibn Hanbal. (110) 'A Hisham ibn Hassan al-Basri. Ali ibn al-Madini and Abu Hatim described him as such. Jarir ibn Hazim said: \"I sat with Al-Hasan for seven years and never saw Hisham with him.\" It was said to him: \"He has narrated things from Al-Hasan, so from whom do you think he took them?\" He said: \"From Hawshab, I reckon.\" Ibn al-Madini said: \"Our companions affirm his hadith, but Yahya ibn Sa'id weakens him and they hold that he sent the hadith of Al-Hasan via Hawshab (Mursal).\" (111) 'A Hushaym ibn Bashir al-Wasiti. From the followers of the Tabi'in. Famous for Tadlis despite his trustworthiness. Al-Nasa'i and others described him as such. Among his wonders in Tadlis is that his companions said to him, \"We want you not to practice Tadlis for us in anything,\" so he promised them. When morning came, he dictated a session to them saying at the beginning of every hadith in it: \"So-and-so and So-and-so told us from So-and-so.\" When he finished, he said: \"Did I practice Tadlis for you today in anything?\" They said: \"No.\" He said: \"Indeed, everything I narrated to you from the first [narrator], I heard it; and everything I narrated to you from the second, I did not hear it from him.\" I [Ibn Hajar] say: This should be called Tadlis al-Atf (Tadlis of Conjunction).",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 46
  },
  {
    "serial_number": "5600576",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 48,
    "volume_number": 1,
    "text": "(112) Yazid ibn Abi Ziyad al-Kufi. From the followers of the Tabi'in. He changed (mentally/memory) at the end of his life and became weak due to that. Al-Daraqutni, Al-Hakim, and others described him with Tadlis. (113) Yazid ibn Abd al-Rahman, Abu Khalid al-Dalani. Famous by his Kunya. He is from the followers of the Tabi'in. Ibn Ma'in and others declared him trustworthy. Husayn al-Karabisi described him with Tadlis. (114) Yazid ibn Abd al-Rahman ibn Abi Malik al-Hamdani al-Dimashqi. Abu Mushir described him with Tadlis. (115) Abu Hurrah al-Raqashi al-Basri. Companion of Al-Hasan, and from him [narrated] Yahya ibn Sa'id al-Qattan. Ahmad and Al-Daraqutni described him with Tadlis. (116) Abu Ubaydah ibn Abdullah ibn Mas'ud. A famous trustworthy narrator. His hadith from his father is in the Sunan, and from other than his father in the Sahih. There is disagreement regarding his hearing from his father; the majority hold that he did not hear from him. His meeting him and hearing his speech is proven, so his narration from him falls under Tadlis. He is more deserving of mention than his brother Abd al-Rahman, and Allah knows best.",
    "foot_note": "1. [Commentary] The Third Rank",
    "book_id": "1186",
    "new_page_number": 47
  },
  {
    "serial_number": "5600577",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 49,
    "volume_number": 1,
    "text": "The Fourth Rank (0) Their number is twelve persons. (0) (117) M, 4 Baqiyyah ibn al-Walid al-Himsi. The famous prolific Muhaddith. He has one hadith in Muslim. He practiced Tadlis frequently from weak and unknown narrators. The Imams described him as such. (118) M, 4 Hajjaj ibn Artah. The famous Jurist of Kufa. Muslim extracted from him in conjunction (Maqrunan). Al-Nasa'i and others described him with Tadlis from weak narrators. Among those who generalized Tadlis upon him are Ibn al-Mubarak, Yahya ibn al-Qattan, Yahya ibn Ma'in, and Ahmad. Abu Hatim said: \"If he says 'Haddathana' (he told us), he is righteous (Salih), but he is not strong.\" (119) Humayd ibn al-Rabi' al-Kufi al-Khazzaz (with dots) al-Lakhmi. There is disagreement about him. Uthman ibn Abi Shaybah, who is from his layer, described him with Tadlis from weak narrators. Muhammad ibn",
    "foot_note": "1. [Commentary] The Fourth Rank",
    "book_id": "1186",
    "new_page_number": 48
  },
  {
    "serial_number": "5600578",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 50,
    "volume_number": 1,
    "text": "Uthman ibn Abi Shaybah said: My father said: \"I am the most knowledgeable of people regarding Humayd ibn al-Rabi'. He was trustworthy, but he practiced Tadlis.\" Al-Khalili said: \"They criticized him regarding his hadiths known to be from the ancients, which he narrated from Hushaym.\" I say: This is Tadlis. (120) M, Q Suwayd ibn Sa'id al-Hadathani. Described with Tadlis; Al-Daraqutni, Al-Isma'ili, and others described him with it. He changed at the end of his life due to blindness and became weak due to that. Muslim's hearing from him was before that, during his soundness. (121) Kh T, 4 Abbad ibn Mansur al-Naji al-Basri. Ahmad, Al-Bukhari, Al-Nasa'i, Al-Saji, and others mentioned him with Tadlis from weak narrators. (122) Kh, D, T, Q Atiyyah ibn Sa'd al-Awfi al-Kufi. A known Tabi'i, weak in memory, famous for ugly Tadlis. (123) 'A Umar ibn Ali al-Muqaddami. From the followers of the Tabi'in. A famous trustworthy narrator. He was extreme in practicing Tadlis. He was described as such by",
    "foot_note": "1. [Commentary] The Fourth Rank",
    "book_id": "1186",
    "new_page_number": 49
  },
  {
    "serial_number": "5600579",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 51,
    "volume_number": 1,
    "text": "Ahmad, Ibn Ma'in, Al-Daraqutni, and more than one person. Ibn Sa'd said: \"Trustworthy, and he used to practice Tadlis severely; he would say 'Thana' (he told us) then be silent, then say 'Hisham ibn Urwah' or 'Al-A'mash' or others.\" I say: This should be called Tadlis al-Qat' (Tadlis of Severance). (124) Kh, T, Q Isa ibn Musa al-Bukhari. His nickname is Ghunjar. Truthful (Saduq), but famous for Tadlis from trustworthy narrators what he carried from weak and unknown narrators. (125) Kh T, M (in conjunction), 4 Muhammad ibn Ishaq ibn Yasar al-Muttalibi al-Madani. The author of Al-Maghazi. Truthful, famous for Tadlis from weak and unknown narrators, and from those worse than them. Ahmad, Al-Daraqutni, and others described him as such. (126) D, S, Q Muhammad ibn Isa ibn al-Qasim ibn Sami'. A Damascene, has weakness. Ibn Hibban described him with Tadlis. (127) 'A Al-Walid ibn Muslim al-Dimashqi. Well-known, described with severe Tadlis despite truthfulness. (128) S Ya'qub ibn Ata ibn Abi Rabah. In his biography in Ibn Hibban's 'Al-Thiqat' is what implies that.",
    "foot_note": "1. [Commentary] The Fourth Rank",
    "book_id": "1186",
    "new_page_number": 50
  },
  {
    "serial_number": "5600580",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 52,
    "volume_number": 1,
    "text": "(0) The Fifth Rank (0) Their number is twenty-four persons. (129) Ibrahim ibn Muhammad ibn Abi Yahya al-Aslami. Al-Shafi'i's sheikh. The majority declared him weak. Ahmad, Al-Daraqutni, and others described him with Tadlis. (130) Allah the Exalted. Isma'il ibn Abi Khalifah, Abu Isra'il al-Mula'i. They declared him weak. Al-Tirmidhi indicated that he used to practice Tadlis. (131) Bashir ibn Zadhan. He narrated from Rishdin ibn Sa'd and others. Al-Qasim ibn Abdullah al-Sarraj narrated from him. Al-Daraqutni declared him weak. Ibn al-Jawzi described him with Tadlis from weak narrators. (132) Talid ibn Sulayman al-Muharibi al-Kufi. Famous for weakness. Ahmad, Al-Ijli, and Al-Daraqutni said he practices Tadlis. I say: Its beginning is with a 'Ta' (two dots above) on the weight of 'Azim. Al-Ala'i erred, and Al-Iraqi followed him,",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 51
  },
  {
    "serial_number": "5600581",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 53,
    "volume_number": 1,
    "text": "and Al-Halabi, so they mentioned him as two biographies and attributed it to Al-Ijli; one of them like this, and the other 'Bakir' with a 'Ba' (one dot below) and was successful. I reviewed Al-Ijli's words and did not see him mentioned except in one place, and Abu al-Arab quoted it from him in the book 'Al-Du'afa' and he was mentioned with 'Ta'. (133) Jabir ibn Yazid al-Ju'fi. The majority declared him weak. Al-Thawri, Al-Ijli, and Ibn Sa'd described him with Tadlis. (134) Al-Hasan ibn Amarah al-Kufi, Abu Muhammad. The famous Jurist. The majority declared him weak. Ibn Hibban said: \"His affliction was Tadlis.\" (135) Al-Husayn ibn Ata ibn Yasar al-Madani. From his father. Abu Hatim said: \"Denounced in hadith (Munkar al-Hadith).\" Ibn al-Jarud said: Ibn Hibban said",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 52
  },
  {
    "serial_number": "5600582",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 54,
    "volume_number": 1,
    "text": "in 'Al-Thiqat': \"He used to err and practice Tadlis.\" He said in 'Al-Du'afa': \"It is not permissible to use him as proof.\" (136) Kharijah ibn Mus'ab al-Khurasani. The majority declared him weak. Ibn Ma'in said: \"Weak.\" Famous for Tadlis; Ahmad, Abu Hatim, Al-Daraqutni, and others described him with it. (137) Sa'id ibn al-Marzuban, Abu Sa'id al-Baqqal. From the followers of the Tabi'in. Weak, famous for Tadlis. Ahmad, Abu Hatim, Al-Daraqutni, and others described him with it. (138) Salih ibn Abi al-Akhdar. Rawh ibn Ubadah mentioned that he was asked about Hudhayfah from Al-Zuhri, so he said: \"I heard some and read some.\" Rawh ibn Ubadah mentioned: \"And I found some [in writing]. I do not prefer this over that.\" (139) Abdullah ibn Ziyad ibn Sam'an al-Madani. The majority declared him weak. Ibn Hibban described him with Tadlis. (140) Abdullah ibn Lahi'ah al-Hadrami. The Judge of Egypt. He became confused (mixed up) at the end of his life, and denounced reports became frequent in his narration. Ibn Hibban said: \"He was righteous, but he used to practice Tadlis from weak narrators.\"",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 53
  },
  {
    "serial_number": "5600583",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 55,
    "volume_number": 1,
    "text": "(141) Abdullah ibn Mu'awiyah ibn Asim ibn al-Mundhir ibn al-Zubayr ibn al-Awwam. He narrated from Hisham ibn Urwah, who is his grandfather's cousin. Amr ibn Ali al-Fallas and others narrated from him. Al-Bukhari and Al-Nasa'i declared him weak. Ibn Hibban indicated his Tadlis. (142) Abdullah ibn Waqid, Abu Qatadah al-Harrani. Agreed upon as weak. Ahmad described him with Tadlis. (143) Abd al-Rahman ibn Ziyad ibn An'um. Ibn Hibban mentioned in 'Al-Du'afa' that he was a Mudallis. Al-Daraqutni also described him as such. (144) Abd al-Aziz ibn Abdullah ibn Wahb al-Kala'i. Weak. Ibn Hibban said: \"His hadith is considered if he clarifies hearing.\" (145) Abd al-Wahhab ibn Mujahid ibn Jabr. Al-Hakim said: \"He used to practice Tadlis from sheikhs he never heard from.\" It was narrated from Al-Hasan ibn Muhammad ibn Abdullah ibn Abi Yazid that he heard nothing from his father; he only took the books.",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 54
  },
  {
    "serial_number": "5600584",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 56,
    "volume_number": 1,
    "text": "(146) Uthman ibn Abd al-Rahman al-Tara'ifi. Ibn Hibban said: \"He narrated from weak people things and practiced Tadlis [attributing them] from them.\" (147) Ali ibn Ghalib al-Basri. From Wahib ibn Abdullah, and from him Yahya ibn Ayyub. Ahmad and others declared him weak. Ibn Hibban said: \"He practiced much Tadlis.\" (148) Amr ibn Hukkam. Al-Hakim said: \"He used to practice Tadlis from those he did not hear from.\" Al-Madini said: \"He heard in his youth from Shu'bah, and when he [Shu'bah] died, he took his books.\"",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 55
  },
  {
    "serial_number": "5600585",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 57,
    "volume_number": 1,
    "text": "(149) Malik ibn Sulayman al-Harawi. Judge of Herat. Al-Nasa'i declared him weak. Ibn Hibban described him with Tadlis. (150) Muhammad ibn Kathir al-San'ani. Al-Uqayli said in the biography of Umar ibn al-Umawi, one of the weak narrators: Al-Thawri narrated from Abu Hizam from Sahl the hadith 'Renounce the world'. He said: \"This has no basis from Al-Thawri. Muhammad ibn Kathir al-San'ani followed him in it from Al-Thawri; perhaps he took it from him and practiced Tadlis, because Khalid is famous for it.\" (151) Al-Haytham ibn Adi al-Ta'i. Al-Bukhari accused him of lying. Al-Nasa'i and others abandoned him. Ahmad said: \"He was a man of news/history and Tadlis.\" (152) Yahya ibn Abi Hayyah al-Kalbi, Abu Janab. They declared him weak. Abu Zur'ah, Abu Nu'aym, Ibn Numayr, Ya'qub ibn Sufyan, Al-Daraqutni, and more than one person said he was a Mudallis. End of the Ranks.",
    "foot_note": "1. [Commentary] The Fifth Rank",
    "book_id": "1186",
    "new_page_number": 56
  },
  {
    "serial_number": "5600586",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 58,
    "volume_number": 1,
    "text": "(0) Chapter: And what is strange is what was mentioned about Shu'bah in that regard, of his hatred for it. That is what I read to Fatimah bint al-Munja from Isa ibn Abd al-Rahman al-Mut'im, read to Karimah bint Abd al-Wahhab while I was listening, from Muhammad ibn Ahmad ibn Amr al-Ba'nan, informed us Abu Amr ibn Abi Abdullah ibn Mandah, informed us Abu Amr Abdullah ibn Muhammad ibn Ahmad ibn Abd al-Wahhab by dictation, told us Abu Abdullah Ahmad ibn Yunus ibn Ishaq, told us Ahmad ibn Muhammad al-Asfar, told me Al-Thufayli, told us Miskin ibn Bukayr, told us Shu'bah, said: I asked Amr ibn Dinar about raising hands when seeing the House [Kaaba]. He said: Abu Qaza'ah said: Muhajir al-Makki told me that he asked Jabir ibn Abdullah (may Allah be pleased with them both): \"Did you used to raise your hands when seeing the House?\" He said: \"We were with the Messenger of Allah (peace and blessings be upon him), so did we do that?\" Al-Asfar said: I presented it to Ahmad ibn Hanbal, so he asked me to repeat it, so I repeated it to him. He said: \"I did not think that Shu'bah practiced Tadlis. Muhammad ibn Ja'far told us, Shu'bah told us from Abu Qaza'ah with four hadiths; this is one of them, he did not mention Amr ibn Dinar in it.\" I say: The name of Abu Qaza'ah is Suwayd ibn Hujr. This is something Imam Ahmad ibn Hanbal said by conjecture. What I hold is that Shu'bah did not practice Tadlis in it; rather, he was asking Amr ibn Dinar, so he told him this, then he met Abu Qaza'ah and asked him about it, so he told him. The proof for that is that he explicitly stated his hearing from him for this hadith in what Abu Dawud narrated in the Sunan from Yahya ibn Ma'in from Muhammad ibn Ja'far Ghundar from Shu'bah: \"I heard Abu Qaza'ah\" with it. How can Tadlis be thought of Shu'bah when he is the one who said: \"That I fall from the sky is dearer to me than that I say",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 57
  },
  {
    "serial_number": "5600587",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 59,
    "volume_number": 1,
    "text": "'from So-and-so' and I did not hear it from him,\" and he is the one who said: \"That I commit adultery is dearer to me than that I practice Tadlis.\" Al-Baghawi said: Ahmad ibn Ibrahim al-Abdi told us, Muhammad ibn Mu'adh told us, Mu'adh told us from Shu'bah, he said: \"I have not seen anyone from the people of Hadith except that he practices Tadlis, except Ibn Awn and Amr ibn Murrah.\" Al-Bayhaqi said in 'Al-Ma'rifah': We were told from Shu'bah that he said: \"I used to inspect the mouth of Qatadah. If he said 'Haddathana' (he told us) [I took it].\" He said: \"I have sufficed you the Tadlis of three: Al-A'mash, Abu Ishaq, and Qatadah.\" I say: This is a good rule regarding the hadiths of these three, that if they come via the path of Shu'bah, they indicate hearing, even if they are 'an'anah' (using 'from'). Similar to this is: Al-Layth told us from Abu al-Zubayr from Jabir; for he did not hear from him except what he [Abu al-Zubayr] heard from Jabir. Sa'id ibn Abi Maryam said: Al-Layth told us, he said: \"I came to Abu al-Zubayr and he handed me two books. I asked him, 'Did you hear all this from Jabir?' He said: 'No, in it is what I heard, and in it is what I did not hear.' He said: 'So mark for me what you heard from him.' So he marked for me this which I have.\" And Allah knows best. End of the book 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis' authored by the Imam, the Allama, the Great Hafiz, Sheikh al-Islam Shihab al-Din Abu al-Fadl Ahmad ibn Ali ibn Muhammad ibn Hajar al-Kinani al-Asqalani al-Misri. The author said: \"I annotated this tract in the months of the year eight hundred and fifteen, and some students annotated it from me in the year sixteen. Then I added to it after that brief names.\" Ended by the praise of Allah and His grace.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 58
  },
  {
    "serial_number": "5600588",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 60,
    "volume_number": 1,
    "text": "Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit. (153) 1 - Badham, Abu Salih, Mawla of Umm Hani / 4. Al-Hafiz ibn Hajar said in 'Al-Taqrib': Weak, Mudallis. (154) 2 - Thawr ibn Yazid ibn Ziyad al-Kala'i, Abu Khalid al-Himsi / Kh, 4. Abu Dawud said in his Sunan in the chapter 'How to Wipe' (1/64 of Awn al-Ma'bud, Indian edition): Musa ibn Marwan and Mahmud ibn Khalid al-Dimashqi told us - the meaning is the same - they said Al-Walid told us, Mahmud said Thawr ibn Yazid informed us from Raja ibn Haywah from the scribe of Al-Mughirah ibn Shu'bah who said: I performed ablution for the Prophet (peace and blessings be upon him) in the Battle of Tabuk, and he wiped over the Khuffs (leather socks) and their bottoms*. Abu Dawud said: It reached me that he did not hear this hadith from Raja.",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 59
  },
  {
    "serial_number": "5600589",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 61,
    "volume_number": 1,
    "text": "(155) 3 - Jamil ibn Ziyad al-Ta'i: Al-Baghawi said in his 'Mu'jam': He narrated from Ibn Umar, saying in it 'I asked Ibn Umar', [yet] he did not hear from Ibn Umar (may Allah be pleased with both). (156) 4 - Al-Hasan ibn Ali ibn Rashid al-Wasiti, resident of Basra / D, S. Al-Hafiz ibn Hajar said in 'Al-Taqrib': Truthful (Saduq), accused of something of Tadlis. (157) 5 - Sa'id ibn Suwayd al-Kalbi: Our Sheikh, the Allama, the Muhaddith of the era, Muhammad Nasir al-Din al-Albani mentioned him in his book: ('Zilal al-Jannah fi Tahqiq Kitab al-Sunnah li Ibn Abi Asim') (2/179) and described him with Tadlis. And Allah knows best.",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 60
  },
  {
    "serial_number": "5600590",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 62,
    "volume_number": 1,
    "text": "(158) 6 - Sulayman ibn Musa al-Umawi, their Mawla, al-Dimashqi, al-Ashdaq / M, 4: Ibn Hibban said in 'Mashahir Ulama al-Amsar' p. (176): It has been said that he heard from Jabir, but that is nothing; all those are reports practiced with Tadlis. (159) 7 - Asim ibn Amr ibn Qatadah ibn al-Nu'man al-Awsi al-Ansari, Abu Amr al-Madini / 'A. Al-Hakim said in 'Al-Mustadrak' (1/398): Abu Bakr Ahmad ibn Ishaq al-Faqih told us, Ahmad ibn Ibrahim ibn Malhan told us, Yahya ibn Bukayr told us, Al-Layth told us, Hisham ibn Sa'd told me from Abbas ibn Abdullah ibn Ma'bad ibn Abbas from Asim ibn Umar ibn Qatadah al-Ansari from Qays ibn Sa'd ibn Ubadah al-Ansari that the Messenger of Allah (peace and blessings be upon him) [gave] a covenant, so when he wanted to leave, he came to the Messenger of Allah (peace and blessings be upon him)... he sent him as a collector... so he said do not leave until you speak to the Messenger of Allah (peace and blessings be upon him) [for] a covenant. So when he wanted to leave, he came to the Messenger of Allah (peace and blessings be upon him), so the Messenger of Allah (peace and blessings be upon him) said to him: (O Qays, do not come on the Day of Resurrection carrying a groaning camel on your neck... the Hadith). Then Al-Hakim said: This is a Sahih hadith according to the condition of Muslim, though they did not extract it, and it has an abbreviated witness according to the condition of the two Sheikhs.",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 61
  },
  {
    "serial_number": "5600591",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 63,
    "volume_number": 1,
    "text": "Al-Dhahabi critiqued it in 'Al-Talkhis' saying: I say, rather it is disconnected (Munqati'); Asim did not reach Qays. (160) 8 - Abd al-Jabbar ibn Wa'il ibn Hujr / M, 4: Ibn Hibban said in 'Mashahir Ulama al-Amsar' p. (163): His father Wa'il died while his mother was pregnant with him. Everything he narrated from his father is Mudallas (contains Tadlis), even though he is not too young for the companionship of the Companions. (161) 9 - Abd al-Rahman ibn Yazid ibn Tamim al-Sulami al-Dimashqi / S, Q. Asim ibn Abdullah said: Ibn Hibban mentioned him in his book 'Al-Majruhin': (2/55) and said: (He is the one who practices Tadlis from Al-Walid ibn Muslim. He says 'Abu Amr said' and 'Abu Amr told us' from Al-Zuhri, giving the impression that it is Al-Awza'i, but it is Ibn Tamim). (162) 10 - Abd al-Aziz ibn Jurayj al-Makki, Mawla of Quraysh / 4. Ibn Hibban said in 'Mashahir Ulama al-Amsar' p. (145): He has no hearing from a Companion, and everything he narrated from Aisha is Mudallas; he heard nothing from her.",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 62
  },
  {
    "serial_number": "5600592",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 64,
    "volume_number": 1,
    "text": "(163) 11 - Uthman ibn Asim ibn Husayn al-Asadi al-Kufi, Abu Husayn / 'A. Ibn Hajar said in 'Al-Taqrib': Trustworthy, firm, Sunni, and perhaps practiced Tadlis. (164) 12 - Uthman ibn Umayr (diminutive), and it is said Ibn Qays, but the correct view is that Qays is his father's grandfather. He is also Uthman ibn Abi Humayd al-Bajali al-Kufi al-A'mash / D, T, Q. I say: Al-Hafiz ibn Hajar said in 'Al-Taqrib' (Weak, became confused, used to practice Tadlis, had extremism, and leaned towards Shi'ism). So it becomes clear from this that Ibn Hajar missed him in 'Ta'rif Ahl al-Taqdis' as he did not mention him in it. (165) 13 - Ata ibn Abi Muslim, Abu Uthman al-Khurasani / M, 4. Ibn Hajar said in 'Al-Taqrib': Truthful, errs often, sends Mursal reports, and practices Tadlis. (166) 14 - Ata ibn Ya'qub al-Kaykharani. Ibn Hibban said in 'Al-Mashahir' p. (192): (His narration from the Companions is entirely Mudallas).",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 63
  },
  {
    "serial_number": "5600593",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 65,
    "volume_number": 1,
    "text": "(167) 15 - Uqbah ibn Abdullah al-Asamm al-Rifa'i al-Basri / T. Ibn Hajar said in 'Al-Taqrib': (Weak, and perhaps practiced Tadlis). (168) 16 - Layth ibn Abi Sulaym ibn Zanim, with 'Zay' and 'Nun', diminutive / Kh T, M, 4: I say: Al-Hafiz al-Haythami described him with Tadlis in 'Majma' al-Zawa'id' (3/27 and 5/189) and said: Trustworthy but a Mudallis). Al-Hafiz ibn Hajar critiqued him in his additions to Al-Bazzar (folio 297 of the manuscript) and said: (I do not know of anyone who explicitly stated he is trustworthy nor described him with Tadlis). I say: Al-Busiri explicitly stated in 'Zawa'id Ibn Majah' (Vol 2 / p 738) that Layth is weak and a Mudallis. (169) 17 - Muhammad ibn al-Hasan ibn Muhammad ibn Ziyad al-Mawsili then al-Baghdadi, Abu Bakr al-Naqqash the Exegete. Al-Khatib al-Baghdadi cited a chain for him for a hadith in 'Tarikh Baghdad' (2/204) where he said Muhammad",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 64
  },
  {
    "serial_number": "5600594",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 66,
    "volume_number": 1,
    "text": "ibn Hasan al-Naqqash in that chain: Yahya ibn Muhammad ibn Abd al-Malik al-Khayyat informed us. Then Al-Khatib said: Al-Naqqash practiced Tadlis; Ibn Sa'id * said: Yahya ibn Abd al-Malik al-Khayyat. The least that is explained in these two hadiths drops the justice of the Muhaddith and warrants abandoning using him as proof. (170) 18 - Muhammad ibn Mahdi ibn Yazid al-Akhmimi: He narrated from Yazid al-Ayli from his father. Ibn Adi said: Ibn Wahb narrated from this Yazid. It is said that Muhammad ibn Mahdi did not see him nor catch him. Ibn Adi mentioned that in the biography of Al-Qasim ibn Abdullah ibn Mahdi. I say: Our Sheikh Abu Abd al-Rahman al-Albani said (And this means he is a Mudallis, but Ibn Adi mentioned that using the formula of uncertainty (Tamridh), so it is not correct to accuse him of this after the declaration of trustworthiness by the author (i.e., Ibn Abi Asim) and Abu Zur'ah). (171) 19 - Al-Muttalib ibn Abdullah ibn Abd al-Muttalib ibn Hantab ibn al-Harith al-Makhzumi / D, 4. I say: Al-Haythami described him with Tadlis in 'Majma' al-Zawa'id': (3/100). Al-Hafiz ibn Hajar also described him with frequent Tadlis and Irsal in 'Al-Taqrib'. This was also among what Ibn Hajar missed in",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 65
  },
  {
    "serial_number": "5600595",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 67,
    "volume_number": 1,
    "text": "(172) 20 - Muqatil ibn Hayyan al-Nabati (with Fatha on Nun and Ba) Abu Bastam al-Balkhi al-Khazzaz (with two dotted Zays) / M, 4: Ibn Hibban said in 'Mashahir Ulama al-Amsar' p. (195): (No report from a Companion he met is authentic for him; those are all Mudallas reports). (173) 21 - Maymun ibn Abi Shabib al-Raba'i, Abu Nasr al-Kufi / Bukh (Mu'allaq), 4: I say: Our Sheikh Al-Ansari mentioned him in 'Al-Tadlis wa al-Mudallisun' number (136) and attributed to Al-Burhan that he said: I have not seen any of the Huffaz describe him with Tadlis except that I saw in the handwriting of the virtuous Hanafis, the Jurists, a margin note in the beginning of Sahih Muslim saying: 'It was said Maymun ibn Abi Shabib practices Tadlis, and he narrated from Al-Mughirah with 'an'anah' (using 'from'), so his narration is not accepted.' We said: Muslim only narrated it as a supporting evidence after narrating it from the hadith of Ibn Abi Layla from Samurah. I do not know from where this was taken. Then I passed by a narration of that from two of the Huffaz, and I do not know where I passed by it).",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 66
  },
  {
    "serial_number": "5600596",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 68,
    "volume_number": 1,
    "text": "(174) - 22 - Abu Bakr ibn Mujahid, the Imam, the Reciter: I say: Ibn al-Salah (may Allah have mercy on him) mentioned in 'Ulum al-Hadith' p. (66 - 67) an example of Tadlis al-Shuyukh, saying: An example of what was narrated to us from Abu Bakr ibn Mujahid the Imam, the Reciter, is that he narrated from Abu Bakr Abdullah ibn Abi Dawud al-Sijistani saying: \"Abdullah ibn Abi Abdullah told us.\" And he narrated from Abu Bakr Muhammad ibn al-Hasan al-Naqqash the Exegete, the Reciter, saying: \"Muhammad ibn Sanad told us,\" attributing him to his mother's grandfather. And Allah knows best.",
    "foot_note": "1. [Commentary] Appendix of names of those described with Tadlis who were not mentioned in 'Ta'rif Ahl al-Taqdis bi Maratib al-Mawsufin bi al-Tadlis', added by the investigator to complete the benefit",
    "book_id": "1186",
    "new_page_number": 67
  },
  {
    "serial_number": "5600597",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 69,
    "volume_number": 1,
    "text": "The Poem of the Hafiz, the Allama, the Historian Abu Abdullah Muhammad ibn Ahmad ibn Uthman al-Dhahabi, who died in the year 748, regarding the names of the Mudallisin. Al-Taj Abu Nasr Abd al-Wahhab ibn Taqi al-Din al-Subki said in 'Tabaqat al-Shafi'iyyah al-Kubra' (5/218): And from Al-Dhahabi's poetry on the names of the Mudallisin: Take the Mudallisin, O thinker... Jabir al-Ju'fi then Al-Zuhri. And Al-Hasan al-Basri, say Makhul... Qatadah, Humayd al-Tawil. Then Ibn Abd al-Malik al-Qati'i... And Ibn Abi Najih al-Makki. And the Firm Yahya ibn Abi Kathir... And Al-A'mash the transmitter with liberation. And say Mughirah, Abu Ishaq... And Al-Mar'i Maymun by agreement. Then Yazid ibn Abi Ziyad... Habib [ibn] Thabit from the ancestors. Abu Janab and Abu al-Zubayr... And Al-Hakam the Jurist, people of goodness. Abbad [ibn] Mansur, say also Ibn Ajlan... And Ibn Ubayd Yunus of status. Then Abu Hurrah and Ibn Ishaq... Hajjaj [ibn] Artah for every yearner. Then Abu Sa'id al-Baqqal... Ikrimah the younger, O transmitter. Then Ibn Waqid, Husayn al-Marwazi... And Ibn Abi Arubah, listen and you will win. Walid [ibn] Muslim, likewise Baqiyyah... in omitting the weak [narrator] is a lowly trait.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 68
  },
  {
    "serial_number": "5600598",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 70,
    "volume_number": 1,
    "text": "The Poem of Abu Mahmud al-Maqdisi, student of Al-Hafiz al-Dhahabi. He said: Qatadah and Al-Hasan al-Basri... Humayd al-Tawil and Al-Taymi. Hushaym, Al-Thawri, Abu al-Zubayr... Mughirah and Ibn Abi Kathir. And the Reciter Al-A'mash and Al-Zuhri... And Ibn Jurayj, Jabir al-Ju'fi. Their Sufyan [is] Ibn Uyaynah, Al-Hakam... Sharik the Judge, Ibn Ishaq the Flag. Abu Ubayd, Yunus, Sa'id... Ibn Abi Arubah, Talid. And Ibn Abi Khalid, Al-Walid... He is Ibn Muslim, likewise Yazid. And Ibn Abi Yahya, likewise Maymun... With Ibn Waqid, he is Al-Husayn. And Ibn Umayr and Abu Ishaq... And Ibn Fadalah together in agreement. And Ibn Ghiyath and Ibn Ammar, Umar... He is Al-Muqaddami, involved in the trace. He is Al-Tufawi along with Al-Ansari... Ibn Sa'id is meant by the news. And Ibn Abi Habbah and Al-Baqqal... Along with Ibn Min from the possessors of transmission. And Ibn Abi Thabit and Ibn An'um... And Ibn Ghurab, then Marwan, understand. And Talhah ibn Nafi', Makhul... Then their Jarir, Abu Mu'awiyah. Then Ibn Mansur for the one who verified him... Then Muhammad, he is Ibn Sadaqah. And Ibn Abi Za'idah from Amir... And the restriction in it is apparent to the skilled.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 69
  },
  {
    "serial_number": "5600599",
    "category_id": "26",
    "category": "Biographies and Generations",
    "book_title": "Defining the People of Sanctification by the Ranks of Those Described with Tadlis",
    "edition": "First, 1403 - 1983",
    "publisher": "Al-Manar Library - Amman",
    "page_number": 71,
    "volume_number": 1,
    "text": "Then Baqiyyah from the unknown... Then the weak [narrator] came in the transmitted [text]. Then Abu Hurrah al-Raqashi... He says sometimes without hesitation \"Haddathana\" (he told us) and sometimes \"An\" (from) Al-Hasan... Then Ibn Ajlan from Al-A'raj. From his companion Abu Hurayrah... He narrated with \"An\" and [Bukhari] said in Al-Bukhari \"Sawa\" (equal?). And it was said he did not hear from him, so know... And praise be to Allah, with it let us conclude. Ghiyath and Ibn Ammar.",
    "foot_note": "None",
    "book_id": "1186",
    "new_page_number": 70
  }
]