[
  {
    "text": "Names of the Horses of the Arabs and Their Knights\nAuthor: أبو عبد الله محمد بن زياد الأعرابي\nYear: 231",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 1
  },
  {
    "text": "sn: 7397\nbook_title: أسماء خيل العرب وفرسانها\nbook_link: https://shamela.ws/book/770\nbook_id: 770\nauthor_name: أبو عبد الله محمد بن زياد الأعرابي\nauthor_year: 231\nnickname: أبو عبد الله\nauthor_link: https://shamela.ws/author/844\nauthor_ID: 844\neditor: الأستاذ الدكتور حاتم صالح الضّمان (تحقيق)\npublisher: دار البشائر، دمشق - سورية\nedition: الثانية، 1430 هـ - 2009 م\npages: 80\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: الأدب\ncategory_id: 32",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "category_id": "32",
    "category": "Literature",
    "new_page_number": 2
  },
  {
    "serial_number": "6679649",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Literature\nBook: Names of the Horses of the Arabs and Their Knights\nAuthor: Abu Abdullah Muhammad bin Ziyad al-Arabi (d. 231 AH)\nInvestigation: Professor Dr. Hatem Saleh Al-Dhamin\n[Book pagination corresponds to the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 3
  },
  {
    "serial_number": "6679650",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 25,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\nAbu al-Bakhtari reported, raising it [to the Prophet], that he said: The Prophet, peace and blessings be upon him, said: \"Keep these horses, for they are the legacy of your father Ishmael. They were wild animals, so he prayed to his Lord and He subjected them to him.\"\nIt is said: The origin of the Arab horses is from a horse that Solomon, peace be upon him, gave to people from the Amalekites called: Zad al-Rakib.\nIbn Habib said: Zad al-Rakib sired Al-Hajisi, which was better than it, and Al-Hajisi sired Al-Dinari, which was better than it.\nAnas bin Mudrik said:\n'Our father was the one before whom horses were not ridden... Nor did any tribe before him know how to ride.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 4
  },
  {
    "serial_number": "6679651",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 26,
    "volume_number": 1,
    "text": "Yaqub bin Muhammad al-Zuhri said: Abdul Aziz bin Imran told me from Ibrahim bin Ismail bin Abi Habiba al-Ashhali from Dawud bin al-Husayn from Ikrimah from Ibn Abbas who said: Horses were wild animals not ridden, and the first to ride them was Ishmael, so that is why they were called 'Arab' [horses].\n\n**Naming of the Horses of Banu Hashim**\nThe Messenger of Allah, peace and blessings be upon him, had five horses: Al-Zarib, Lizaz, Al-Sakb, and Al-Murtajiz. Al-Murtajiz was named so because of the beauty of its neighing.\nIbn Habib said: And he, peace be upon him, had: Al-Lahif.\nHe said: Al-Sakb was a kumayt (reddish-brown with black mane/tail) with a blaze (white mark on forehead) and white on three legs, except the right foreleg.\nYaqub bin Muhammad al-Zuhri said: Ibrahim bin Ja'far al-Ansari told me from...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 5
  },
  {
    "serial_number": "6679652",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 27,
    "volume_number": 1,
    "text": "...his father who said: The Messenger of Allah, peace and blessings be upon him, had a horse called: Dhu al-Limmah.\nJa'far bin Abi Talib had a female sorrel horse called: Sabhah. He was martyred on it, may Allah have mercy on him, on the Day of Mu'tah. He hamstrung it, so it was the first horse hamstrung in Islam. It is said: The Kharijites hamstring [horses] because of that.\nMuhammad said: Al-Mawtah: A stupor that takes a person when it overwhelms his mind. Al-Mawtah: That a person dies a single death.\nIt is said: Hamza bin Abd al-Muttalib had a horse called: Al-Ward. He said about it:\n'I have nothing but a weapon and Al-Ward... A full-grown horse from the daughters of Dhu al-Uqal.\nI protect it from wars with myself... And it faces the chests of spears before me.\nA large-bodied horse; what war strikes of it... when its heroes heat up, I do not care.\nAnd a sharp one as if it were a bull's horn... That, not other than that, is most of my wealth.\nAnd if I perish, it will be my legacy... and buckets praised among my buckets (deeds).'\n\n**Horses of Quraysh**\nHe said: Ibrahim bin Ja'far al-Ansari informed me from Sa'd bin Sa'id bin Qays...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 6
  },
  {
    "serial_number": "6679653",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 28,
    "volume_number": 1,
    "text": "...al-Ansari who said: The first to keep a horse for the sake of Allah was Sa'd bin Abi Waqqas.\nSufyan bin Uyayna from Al-Mas'udi from Al-Qasim bin Abd al-Rahman who said: The first whose horse ran with him in the sake of Allah was Al-Miqdad bin al-Aswad.\nAl-Zubayr bin al-Awwam had a horse called: Al-Ya'sub, and a horse he witnessed Khaybar on called: Ma'ruf. He also had a horse called: Dhu al-Khimar which he witnessed the Day of the Camel on.\nIbn Habib said: He had a mare called: Dhat al-Ni'al upon which he was killed on the day of Wadi al-Siba'.\nAl-Miqdad bin Amr, and Al-Aswad bin Abd Yaghuth al-Zuhri his step-son and ally—who is one of the mockers mentioned by Allah Almighty in His Book—had a horse...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 7
  },
  {
    "serial_number": "6679654",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 29,
    "volume_number": 1,
    "text": "...which he witnessed Badr on called: Dhu al-Unuq. And he had a horse he witnessed the Day of Al-Sarh on called: Ba'zajah.\nUkasha bin Mihsan al-Asadi, ally of Banu Umayya, had a horse called: Dhu al-Limmah. He also had a horse he witnessed the Day of Al-Sarh on called: Janah.\nAbu Dharr al-Ghifari had a horse called: Al-Ajdhal.\nBakir, one of Banu al-Shaddakh, had a horse called: Atlal. People say that on the day of Al-Mada'in he said to it: 'Jump, Atlal!' She turned to him and said: 'Yes, by the Surah of Al-Baqarah.' Then he witnessed Azerbaijan with Al-Shammakh and was martyred on it. Al-Shammakh said mourning him:\n'And Bakir of Banu al-Shaddakh, the knight of Atlal... was absent from horses in Muqan that were safe.'\nThe horse of Suraqa bin Malik bin Ju'shum al-Mudlaji, who followed the Prophet, peace and blessings be upon him, was called: Al-Awd.\nThe horse of Abu Jahl bin Hisham was called: Majah.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 8
  },
  {
    "serial_number": "6679655",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 30,
    "volume_number": 1,
    "text": "Ubayy bin Khalaf al-Jumahi's horse was called: Al-Awd.\nMusafi' bin Abd al-Uzza, one of Banu Amir bin Lu'ayy, his horse was called: Al-Na'amah. He said about it:\n'By Allah, I will not forget Al-Na'amah for a night... nor its day, until I rest my wrist [in death].'\nThe horse of Muhriz bin Nadlah, ally of Banu Abd Shams, was called: Al-Sarhan. He witnessed the Day of Al-Sarh on it.\nThe horse of Maslama bin Abd al-Malik was called: Al-Zill.\nMuhammad said: The Day of Al-Sarh is the day Uyayna bin Hisn al-Fazari raided with his people and followers the pasture camels of Medina and went off with them. The Ansar followed them, defeated them, disgraced him, and recovered what was in his hand.\n\n**Horses of the Ansar**\nThe horse of Sa'd bin Zayd al-Ashhali, its name was: Lahiq, and he witnessed the Day of Al-Sarh.\nAbbad bin Bishr, one of Banu Haritha, his horse was called: Lamma', he witnessed the Day of Al-Sarh on it.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 9
  },
  {
    "serial_number": "6679656",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 31,
    "volume_number": 1,
    "text": "Zuhayr bin Rafi' al-Harithi, his horse's name: Al-Masnun, he witnessed the Day of Al-Sarh on it.\nAbu Qatada bin Rab'i, one of Banu Salama, his horse's name: Jarwah, and he witnessed the Day of Al-Sarh on it.\nMu'adh bin Ma'is al-Zuraqi witnessed the Day of Al-Sarh on the horse of Abu Ayyash Ubayd bin Muawiyah al-Zuraqi, called: Hilwah.\nThe horse of Abu Talha Zayd bin Sahl al-Najari was called: Mandub. The Messenger of Allah, peace and blessings be upon him, rode it and said: 'We found it a sea [in speed].'\n\n**Horses of Banu Asad**\nSalama bin Hind al-Ghadiri, his horse was called: Ma'ruf. He said:\n'I turn Ma'ruf against them as if he... when he swerves from the impact of spears, is enraged.'\nDithar bin Faq'as, his horse's name: Al-Manihah. He said:\n'Bring the tether of Al-Manihah near me... War has kindled a blaze for roasting.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 10
  },
  {
    "serial_number": "6679657",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 32,
    "volume_number": 1,
    "text": "Fadalah bin Hind, his horse: Al-Zalim. He said about it:\n'I set up for them the chest of Al-Zalim and a spear... sail-like in the head of a raging angry one.'\nJurayba bin al-Ashyam al-Faq'asi, his horse: Kharaj. He said about her:\n'By Allah, they did not favor me, but... Kharaj favored me when she turned away.\nShe sweated and saved her throat as if she were... behind me and before me, a skin-bag of a water-carrier.'\nAl-Ajalah: The water skin. Al-Mukhlif: The one who brings fresh water to the people from another place while they are at their spring camp.\nDirar bin al-Azwar al-Asadi, the killer of Malik bin Nuwayra al-Yarbu'i. Mutammim said about him:\n'Excellent is the killed one, when the winds blow... under the shelter, your victim, O Ibn al-Azwar.\nDid you invite him by Allah then betray him... If he had invited you with the like, he would not have betrayed.'\nHe said: And Umar bin al-Khattab was angry when he heard of Malik's killing. His [Dirar's] horse: Al-Muhabbar. He said about it:\n'I made gambling arrows and the playing of singing girls... and wine, a prayer and supplication.'\n\"Sallaytu tasliyatan\" (I prayed a prayer), and tasliya here means prayer.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 11
  },
  {
    "serial_number": "6679658",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 33,
    "volume_number": 1,
    "text": "'And my charging on Al-Muhabbar in the thick of battle... and my striving in fighting the polytheists.\nO Lord, let not my deal be cheated... for I have sold my family and wealth in exchange.'\nHe said: It reached us that he recited this poetry to the Prophet, peace and blessings be upon him, and the Prophet, peace and blessings be upon him, said: 'Your deal is not cheated.'\nThe horse of Tulayha bin Khuwaylid al-Faq'asi was called: Al-Hammalah. He said about her:\n'I set up for them the chest of Al-Hammalah; indeed she is... accustomed to the saying of the armored heroes: Dismount.'\nJanah: The horse of Hadhlam bin Khalid bin Amr al-Faq'asi.\nThadiq: The horse of Hajib bin Habib bin Khalid al-Mudallal. He said about it:\n'She spent the night blaming me regarding Thadiq... to sell it, and her disobedience became serious.\nVerily, your whispering about Thadiq... is the same to me as declaring it.\nShe said: Aid us with it, for I... see that the price of horses has increased.\nI said: Did you not know that it is... beautiful of appearance, good?'\n\n**Horses of Banu Dabbah**\nThe horse of Qaraba bin Uwayya al-Dabbi: Al-Faynan. He says to it:\n'If Al-Faynan catches me up with a people... and I do not stab, then may my fingers be paralyzed.'\nThe horse of Al-Muthallam bin al-Mushakhkhar, one of Banu A'idha bin Taym Allah bin Bakr bin Sa'd bin...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 12
  },
  {
    "serial_number": "6679659",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 34,
    "volume_number": 1,
    "text": "...Dabbah, was called: Suhaym. He said about it:\n'She rose blaming me regarding Suhaym... to sell him, while the sleepers were asleep.\nShe says: I see your two sons have grown thin... they have disheveled heads, thirsty.\nAnd there is nothing in it against me, so blame me... even if you prolonged the blame, [it is just] blame.'\nAnd he says about it:\n'Indeed the Merciful turned away from Suhaym... and its rider, the spears of Banu Tamim.\nI made my horse and my throat a target... for the sharpness of their spears at Liwa al-Qasim.'\nZayd al-Fawaris, his horse: Shawlah. He said about her:\n'I restricted for them from the chest of Shawlah; indeed... only the helpful hero saves from distress.'\nHe also had a horse called: Urqub. Abdullah bin Anamah al-Sayyidi said about it:\n'You do not see the master Zayd in their souls... as Banu Kuz and Marhub see him.\nSo restrain your donkey, let it not graze in our meadow... when the shackled donkey comes to the water.\nAnd let not Urqub be for you like the running of Dahis... in Ghatafan on the morning of the ravine.'\nThe horse of Al-Raqqad bin al-Mundhir bin Dirar al-Dabbi was called: Al-Kamil. He said about it:\n'I continued driving Kamil and forcing him... against the people until they surrendered or scattered.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 13
  },
  {
    "serial_number": "6679660",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 35,
    "volume_number": 1,
    "text": "Abd al-Harith bin Dirar, his horse: Mabdu'. He said about it:\n'Mabdu' complained of raiding and became... like the remains of the bridle, scarred.'\nAl-Namir bin Tawlab al-Ukkli, his horse's name: Sahba. He said about her:\n'Do the runs of Sahba go in vain... trembling against the enemies a trembling?\nAnd my charging in the adversity every day... when voices mixed with dust?\nA reddish-brown color, raising her tail... you think the whiteness of her blaze a lamp.'\nUnayf bin Jabala al-Dabbi, ally of Banu Salit bin Yarbu', his horse: Al-Shit. He said about it:\n'The stabbing harmed the throat of Al-Shit so he bent... So I forced him into the quivers until he advanced.'\nSubay' bin al-Khatim al-Taymi, his horse: Nahla. He is called: Knight of Nahla. He proposed to his uncle's daughter, so he said to him: 'Yes, I will marry you my daughter on condition that you give me your mare Nahla.' He refused, and said about that:\n'I saw Abu Shayma eager... when I speak to him at the head of a path.\nHe says: Nahla, or leave me. So I said to him... Rely on me for virgin large camels.\nWhat would I say if I possessed [her] and they came early... with a long mare like a spear shaft, swift?\nAn oath persisted on me not to exchange her... for one with two earrings between the neck and the lava fields.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 14
  },
  {
    "serial_number": "6679661",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 36,
    "volume_number": 1,
    "text": "Al-Abkar: Those that have given birth once. And Al-Harajib: The tall fat ones. He said about her:\n'I and Nahla, as long as I remain for her... the flank will not be at ease with selling her.\nHe who offers a high price for her knows... that what I have is the profit.'\nAjlan bin Nakrah al-Taymi, his horse: Hudhlul. He said about it when Al-Fazari raced him on it:\n'I risked my colt in the bet for a need... and from stubbornness is what harms and benefits.\nWhat did you want, O daughter of Malik... when my wealth was being torn apart at Al-Liwa?'\nQabisa bin Dirar al-Dabbi, his horse: Al-Ahwa. He said about it:\n'Banu Sulaym say when they see me... on Al-Ahwa galloping with the rein:\nOn me is a coat of mail and with me is a spear... and its shaft, and it suffices you as a spearhead.'\nAnd from Banu Dabbah, from Banu al-Sayyid, the Knight of Minhab, who is Uwayya bin Salma, who captured Rabi'a bin Khuwaylid, the uncle of Yazid bin Amr bin Khuwaylid, who is Al-Sa'iq. Uwayya said about him:\n'My running and my exertion overtook Minhab... at Dhat al-Ghada, Rabi'a bin Khuwaylid.\nA blazing one like the evening shower in his gathering... galloping like the wolf of the desert, ferocious.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 15
  },
  {
    "serial_number": "6679662",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 37,
    "volume_number": 1,
    "text": "And from Banu al-Sayyid, Al-Mu'ajjab bin Sufyan, his horse: Al-Kumayt, and that is its name. He said about it:\n'As if I and Al-Kumayt drag my spear... at the dunes of Al-Sarif around a twisted path.\nAs if the splitting of skulls from us... and from them between us is the splitting of oyster shells.'\nAnd from Banu Tha'labah bin Sa'd bin Dabbah, the Knight of Al-Shaqra', who is Rabi'a bin Ubayy. He fought bravely on the day of Naqa al-Hasan—it is said: Al-Husayn—the day they killed Bistam bin Qays; Asim bin Khalifa al-Sabahi killed him. It is also called: The Day of al-Dahna. Bistam had gone out to raid Banu Dabbah. Sham'ala bin al-Akhdar bin Hubayra bin al-Mundhir bin Dirar bin Amr said:\n'And on the day of Shaqiqat al-Hasanayn, Banu Shayban... met short life spans.\nWe pierced with the spearhead while they were leaning... the ears of their ram until he spun around.\nHe remained on the oleander bush not cushioned... and blood was a veil for him.\nYou see Al-Shaqra' strutting in her afterbirth... and blood has become a wrap for her.\nAs the girl of the tribe struts in it amidst the virgins... in a borrowed cloak.\nWe give her the fresh milk when we winter... despite our needs, and we take the diluted milk.'\nAl-Samar from milk is that which is two-thirds water or three-quarters water, and the rest milk.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 16
  },
  {
    "serial_number": "6679663",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 38,
    "volume_number": 1,
    "text": "And the watered-down milk is less than it.\n'Hoping that she will return it to us... from the enemies by force and compulsion.'\nAnd from Banu Dabbah then from Banu Kuz, the Knight of Dhat al-Rimah. His mare, if frightened, Banu Dabbah would rejoice at booty. Regarding that, Al-Asamm, who is Qays bin As'as, one of Banu Abd Manat bin Bakr bin Sa'd bin Dabbah, says:\n'If Dhat al-Rimah is frightened, she drags to us... lucky ones with birds whose spoils are many.'\nAnd from Banu Abd Manat bin Bakr bin Sa'd bin Dabbah is Abu Sawaj, who is Abbad bin Khalaf, the Knight of Badhwah. He raced Surad bin Jamrah, the uncle of Malik bin Nuwayra, who was on his horse Al-Qatib, and Badhwah beat him. So Abu Sawaj said about that:\n'Did you not see that Badhwah when we ran... and the running became serious, left Al-Qatib behind?\nAs if their Qatib when we ran... was a breaking eagle diving seeking prey.'\n\n**Horses of Banu Sa'd bin Zayd Manat bin Tamim**\nAl-Zibriqan bin Badr, his horse's name: Al-Raqib. He said about it:\n'Indeed Al-Raqib, I treat him and tend to him... bare of cheek-straps, neither rude nor poor.'\nAlqama bin Sibah, one of Banu Haddan bin Qari', his horse's name: Habud. The wailing woman of Amr bin al-Ja'id al-Muradi, who was killed on the Day of al-Kulab, said...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 17
  },
  {
    "serial_number": "6679664",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 39,
    "volume_number": 1,
    "text": "...about it:\n'The killing of a master turned the blackness of the head gray... and the Knight of Habud turned the forelocks gray.'\nAl-Sulayk bin Sulaka al-Sa'di, his horse: Al-Nahham. He was called: The Knight of Al-Nahham. He said about it:\n'Bring out Al-Nahham and hurry, O boy... and throw the saddle on him and the bridle.\nAnd inform the youths that I am wading... the flood of death, so whoever wishes let him stay.'\n\n**Horses of Amr bin Tamim**\nAnd from Banu Amr bin Tamim: Ubayda bin Rabi'a bin Qahfan bin Nashira bin Sayyara bin Rizam bin Mazin. His horse is called: Sakab. He is the Knight of Sakab. He said about her:\n'I refuse the curse, indeed Sakab is not... a precious thing to be borrowed or sold.\nA descendant of two predecessors who produced her... a leg joins them when their lineage is traced.\nDo not covet, I refuse the curse, in her... preventing you from her is in a way that is possible.'\nTarif bin Tamim bin Namiya, from Banu Adi bin Jundab bin al-Anbar, and he was called Mulqi al-Qina' (He who throws the veil), because he was the first to throw the veil at Ukaz and say: \"Whoever wishes, let him seek me.\" The name of his horse was Al-Aghar. He said about it:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 18
  },
  {
    "serial_number": "6679665",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 40,
    "volume_number": 1,
    "text": "'Beneath me is Al-Aghar and above my skin is a coat of mail... loose rings that repel the sword while it is notched.'\n\n**Horses of Banu Hanzala**\nHawt bin Abi Jabir, from Banu Riyah bin Yarbu' bin Hanzala, his horse: Dhu al-Uqal. He is Abu Dahis. It was named Dhu al-Uqal because when ridden it would get tangled then extend. Jarir said:\n'Indeed the steeds spend the night around our domes... from the family of A'waj and Dhu al-Uqal.'\nJalwa belonged to Qirwash bin Awf bin Asim bin Ubayd bin Tha'labah bin Yarbu', and she is the mother of Dahis.\nAl-Kalhaba bin Hubayra al-Urayni, Urayn bin Tha'labah bin Yarbu', his horse's name: Al-Arada. He said about her:\n'Banu Jusham bin Bakr ask me... Is Al-Arada blazing or dark?\nShe is the mare on which the Sheikh charged against you... like the noble lion.'\nWathil bin Awf al-Riyahi, Abu Suhaym bin Wathil, his horse: Lazim. Suhaym said about it:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 19
  },
  {
    "serial_number": "6679666",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 41,
    "volume_number": 1,
    "text": "'And I said to the people of the ravine when they gambled with me... Did you not know that I am the son of the Knight of Lazim?'\nMalik bin Nuwayra, his horses: Dhu al-Khimar, Nisab, Al-Wari'a, Al-Annab, and Al-Jawn. Malik said:\n'My remedy and my art rewarded me with Dhu al-Khimar... when the folds of Banu al-Asaghir slept.'\nHe said: Banu Abs raided Banu Yarbu' and took the camels of Banu Hubba, so Malik bin Nuwayra rescued them. He said:\n'The galloping and running of Al-Annab caught up with... the milk-camels of Ibn Hubba while he was sad and grieving.'\nHis mare Nisab broke, so Al-Farafisah bin al-Ahwas al-Kalbi mounted him on a horse called: Al-Wari'a. He says about her:\n'I complained to them of my leg, so they said... to their master: We obey in the answer.\nSo he returned our friend with a gift of truth... and gave him Al-Wari'a after Nisab.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 20
  },
  {
    "serial_number": "6679667",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 42,
    "volume_number": 1,
    "text": "'So my friendship became stuffed in my saddle... with a long-bodied mare, wide-stepping in the sides.'\nHe said about Al-Jawn:\n'Bring the tether of Al-Jawn near me for it... the time of dismounting has neared and the crowds have occupied the sides.'\nDawud bin Mutammim bin Nuwayra, his horse: Al-Dhabih. He said about it:\n'I raised for them the chest of Al-Dhabih and missed me... litters from the belly of Iyad rising.'\nAbu Milail Abdullah bin al-Harith bin Asim bin Ubayd bin Tha'labah bin Yarbu', his horse: Al-Alhan. Jarir said about it:\n'Shabath I boasted of against you and Ma'qal... and Abu Milail the Knight of Al-Alhan.'\nJarir said:\n'Bring the like of Qa'nab and Al-Alhan... or like Abu Hazra, the poison of knights.'\nAbu Hazra is Utaybah bin al-Harith bin Shihab.\n'And Ibn Hana'ah is not slow or weak... nor weak in meeting peers.'\nAl-Bara' bin Qays bin Attab bin Harami bin Riyah bin Yarbu', his horse's name: Al-Gharraf. He said about it:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 21
  },
  {
    "serial_number": "6679668",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 43,
    "volume_number": 1,
    "text": "'If Al-Gharraf were to exchange a rider... other than me, I would have exchanged Al-Samayda' for him.'\nAl-Samayda': Name of a man he had captured.\nUtaybah bin al-Harith bin Shihab, his horse: Al-Mukassar. Malik bin Nuwayra said about him:\n'If the loins of it (camels) were fat, they would have crowded... Utaybah when the forehead of Al-Mukassar bled.'\nUsayd bin Hana'ah al-Saliti, the Knight of Al-Shaqra'.\nTariq bin Hasbah bin Aznam bin Ubayd bin Tha'labah bin Yarbu', the Knight of Hayfa'. It is said: Hayfa' is the full sister of Dahis.\nThe horse of Laqit bin Zurara, Al-Ashqar, and its name was Saddam. Jabalah said about it:\n'Advance, Saddam, they are Banu Abs... the majestic tribe among the strict people.'\nDamrah bin Jabir bin Qatan bin Nahshal, his horse: Wabal.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 22
  },
  {
    "serial_number": "6679669",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 44,
    "volume_number": 1,
    "text": "'Lo, who will convey from me to Dhubab... the fly of arms, what a youth sees her!\nIf you met me with Wabal among them... I would help the slave stabbing in her peaks.'\nUbayd bin Malik al-Nahshali, his horse: Al-Fahdah. He is called: The Knight of Al-Fahdah.\n\n**Horses of Bahilah**\nRabi'a bin Mudlij, one of Banu Sahb, the Knight of Haddaj. The poet said about him:\n'Shaqiq and Hurayy shed our blood... and the Knight of Haddaj turned the forelocks gray.'\nShaqiq bin Hurayy, the Knight of Mayyas. The poet said about him:\n'Noses from Abd bin Ghanm, their father... was noble, so he vied in nobility and produced noble offspring.\nThe knights of Sala on the day of Sala and Sajir... and the Knight of Mayyas when he prepared for battle.'\nSumayr bin Rabi'a bin Khalaf bin Murra bin Sahb, the Knight of Khasaf, which is the name of his horse. The poet said about him:\n'Or like the Lord of Khasaf when he charges him... against the armed heroes, he splits skulls and necks.'\nAmir bin Ma'bad, the Knight of Al-Raq'a, sister of Khasaf.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 23
  },
  {
    "serial_number": "6679670",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 45,
    "volume_number": 1,
    "text": "Uqba bin Mudlij al-Alimi, he had Al-Harun and Al-Mu'alla.\nSalim bin Arta'ah al-Alimi, he had Al-Sarhan.\nA'waj, belonging to Adi bin Ayyub bin Shabib al-Alimi.\nAbu Qurba, the horse of Ubayd bin Azhar, client of Amr bin Jabir al-Bahili.\nDaysam bin Rumi al-Bahili, his horse: Al-Kumayt. Daysam says about it to Umayr bin al-Hubab:\n'So Al-Kumayt overtook him with a brisk one... of the heroes, a noble raider.'\nAl-Shammari: Brisk. Al-Mighwar: From raiding. Al-Najib: Noble and strong.\nThe horse of Shabib bin Daysam is called: Al-Wazn.\nThe horse of Hatim bin al-Nu'man al-Bahili, its name: Al-Ward.\n\n**Horses of Ghani bin A'sur**\nShaytan bin al-Hakam bin Jahima bin Harraq, his horse: Al-Khadhwa'. He said about her...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 24
  },
  {
    "serial_number": "6679671",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 46,
    "volume_number": 1,
    "text": "...on the Day of Mahjar: 'Whoever takes a hair from the tail of Al-Khadhwa' is safe.'\nTufayl said:\n'Al-Khadhwa' bestowed a favor upon them... and Shaytan when he calls them and returns.'\nThe Knight of Al-Hammham from Banu Zabban bin Ka'b bin Jalan bin Ghanm bin Ghani.\nAl-Mushamma'l bin Hazlah, his horse: Kharqah.\nAnd belonging to Ghani: Al-Ghurab, Al-Wajih, Lahiq, and Al-Mudhhib.\n\n**Horses of Ghatafan bin Sa'd**\nAmir bin Qays bin Jundab al-Ashja'i, the Knight of Al-Farafar.\nAmir bin al-Harith bin Subay', the Knight of Al-Adud.\nJabir bin Abdullah said:\n'They shake linear spears, and their horses... are extending like the eagles of Talal, the breakers.\nOn every high-looking horse with abundant hair... and every lean mare like a stick, slim.\nSmooth of running, shook in its mothers... daughters of Al-Adud or daughters of Al-Farafar.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 25
  },
  {
    "serial_number": "6679672",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 47,
    "volume_number": 1,
    "text": "Qays bin Zuhayr bin Jadhimah, his two horses: Dahis and Al-Ghabra'.\nMuzarrad said to Banu Anmar and their ally:\n'With my hand I threw the stick and bought them... with a settled tribe who confine the prisoners.\nWith the tribe of Banu Sa'd bin Dhubyan when he saw... with me at Anmar Sarab and Dahis.'\nSarab: Is Al-Ghabra'. Abu Ja'far said: Sarab is the she-camel of Al-Basus over which the war between Bakr and Taghlib occurred.\n'I was like one who gave noble healthy camels... for a scabby one that infects whoever comes to it touching.'\nAntara bin Abd bin Muawiyah, his horses: Al-Aghar, Al-Adham, and Ibn al-Na'amah. He said about Al-Adham:\n'They call Antar while the spears are like... ropes of a well in the breast of Al-Adham.'\nHe said about Al-Aghar:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 26
  },
  {
    "serial_number": "6679673",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 48,
    "volume_number": 1,
    "text": "'May Allah reward Al-Aghar a truthful reward... when the fire of wars is kindled.\nHe protects me with his forehead and shoulders... and I help him with moderate heels.'\nIt is said: He had a horse called: Al-Abjar, or it belonged to someone else among them. He said:\n'Do not hurry, I tighten the belt of Al-Abjar... I, when death approaches, do not panic.\nAnd I did not promise the soul delay.'\nShaddad bin Muawiyah, Antara's uncle, the Knight of Jarwah. He said about her:\n'Whoever asks about me, then I... and Jarwah do not seek forage nor are we lent.'\nHudhayfah bin Badr, his two horses: Al-Khattar and Al-Hanfa'.\nHujr bin Muawiyah bin Hudhayfah, his horse: Al-Hanfa'.\nShabib bin Muawiyah bin Hudhayfah, the Knight of Al-Sakb. That is the name of his horse.\nYazid bin Sinan al-Murri, his horse: Wajzah. He said about her:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 27
  },
  {
    "serial_number": "6679674",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 49,
    "volume_number": 1,
    "text": "'I shot them with Wajzah when they advised each other... to shoot her throat from near and my throat.\nWhen she penetrated them, she returned against them... as if her foal was among them and my young camel.'\nSinan bin Abi Haritha, his horse: Barjah.\nMuzahim: The horse of Talha bin Abi Mihjan al-Adawi.\nAnd belonging to Ghatafan: Al-Asjadi, and Lahiq. Al-Nabigha said:\n'Among them are daughters of Al-Asjadi and Lahiq... ash-colored, their spur-places from the training ground.'\nHizam bin Wabisa, his horse: Al-Raqim. He said:\n'And horses like sandgrouse, the grazing livestock of the tribe pastured among them... Al-Raqim leads me.'\nDabi'a bin al-Harith al-Absi, his horse: Al-Aghar.\nZabban bin Sayyar al-Fazari, his horse: Silm. Zayd al-Khayl gave it to him, and he escaped on it while he was a captive among Banu Badr. Zabban said:\n'You bestowed favor, so do not deny my trial and favor... and let Silm pay you as he paid you.'\nAl-Rabi' bin Ziyad, his horse: Al-Ya'bub. He was called: The Knight of Ya'bub.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 28
  },
  {
    "serial_number": "6679675",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 50,
    "volume_number": 1,
    "text": "Marwan al-Qaraz said:\n'I returned Khuma'ah to Awf after... Dhu'ab unveiled her, not the unveiling of a suitor.\nIf she had been the spoil of anyone else's spear... he would have brought her tied by the forelocks.\nBut he cast his protection over her... hoping for reward or fearing consequences.\nSo I defended her with Nashib and his tribe... and the Knight of Ya'bub and Zayd bin Qarib.\nI struck Banu Shayban regarding her with a favor... spoken of by the people of Sala and Marib.'\nSala and Marib: Two lands.\nAl-Ghurab bin Salim al-Absi, his horse: Al-Mukh.\nAnd belonging to Abs also: Al-Bashir.\n\n**Horses of Banu Sulaym**\nThe horse of Umayr bin al-Hubab: Al-Za'faran. He said about it:\n'I have overlooked a land I love... If I wish, Al-Za'faran trots and gallops.'\nAl-Abbas bin Mirdas al-Sulami, his horse: Al-Ubayd. He said about it:\n'Do you make the spoil of Al-Ubayd... between Uyayna and Al-Aqra'?",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 29
  },
  {
    "serial_number": "6679676",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 51,
    "volume_number": 1,
    "text": "'Neither Hisn nor Habis was... superior to Mirdas in a gathering.\nNor was I below either of them... and whomever war lowers is not raised.'\nHe also had: Zirrah, which Sufyan bin Awf al-Nasri took, then it was rescued from him.\nHe also had: Sawbah. He said about her:\n'I prepared Sawbah and Al-Samut and my spear... and the extra armor gleams like white cloth.\nOutstripping the rein as if her bridle is... in the head of a tall palm tree.\nBetween Al-Hammalah and Al-Qurayt she has... produced noble offspring from a mother and a stallion.'\nAl-Qurayt and Al-Hammalah: Two horses.\nThe horse of Muawiyah bin Mirdas was called: Zamil. He said about it:\n'By my life, I have increased exposing Zamil... to a wound or to curb a wild ass.\nThere is no likeness in his days and trial... like a day he had at Al-Jarr, if you knew.\nThe upper parts of Samhari spears pierce his chest... and they shoot arrows at his vertebrae.'\nMeaning the vertebrae of his neck.\n'So will Abu Salama thank my favor?... My thought of him is that he will be found thankful.'\nAbu Salama: A man from Banu Sulaym.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 30
  },
  {
    "serial_number": "6679677",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 52,
    "volume_number": 1,
    "text": "And Muawiyah bin Mirdas also had a horse called: Al-Adham. He said about it:\n'If you take Al-Adham, you will not surpass me.\nStretching when urged after fatigue.'\nAl-Sati: Wide-stepping. Tutia bi-inanihi: Urged by hand after tiring, he springs.\n'Filling his two girths and filling the eye.\nPuffing two nostrils after panting.\nLike the puffing of two bellows in the hands of a blacksmith.'\nThe horse of Hazn bin Mirdas: Al-Has'sa'. He was called: The Knight of Al-Has'sa'. He said:\n'Were it not for Allah and Al-Has'sa', my family would have perished... while she shows her veins.\nI have not seen the like of a run I made her catch up... at Awtas to a rebellious caravan.\nWhen the spears fell towards her, she dangled... the dangling of an eagle from the top of a mountain peak.'\nQays bin Nashba al-Sulami, his horse: Saddam. He said about it:\n'O family of Bakr, be patient for it, for I... am Qays and Saddam is the Lion.'\nAl-Asad: The name of his armor.\nIbn Adiya al-Aslami, was an ally to Banu Usayyah, his horse's name: Al-Ward.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 31
  },
  {
    "serial_number": "6679678",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 53,
    "volume_number": 1,
    "text": "He said about it:\n'Al-Ward rewarded me with my limbs and my protection... and his praise was great to me and good.'\nKazaz, the horse of Husayn bin Alqama al-Dhakwani, who is Husayn al-Fawaris. He said about her:\n'I turned Kazaz towards the chest of Al-Latim... until they were like in a rope.\nAnd I was certain that I was a perishing man... so I risked myself for good praise.\nI left Fadalah in a battlefield... grappling with a red one like a rope.\nAnd they, with us drinking in the dust... run the running of energetic young camels.'\nAl-Ifal: Young camels. Al-Sanan: Activity/Energy.\nThe horse of Khufaf bin Umayr, who is Ibn Nudba: Alwa. He said about her on the day he killed Malik bin Himar al-Fazari:\n'If my horses have been hit in their core... then putting the sword back in the sheath, upon my eye, I aimed at Malik.\nI set up Alwa for him when my companionship recoiled... to prefer glory or avenge a dead one.\nI said to him while the spear bent his back... Look slowly, indeed I am that one.'\n\n**Horses of Hawazin**\nBanu Hilal have: A'waj. Then to Banu al-Muharibiyah from Banu Manaf bin Hilal,",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 32
  },
  {
    "serial_number": "6679679",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 54,
    "volume_number": 1,
    "text": "The poet said about them:\n'The daughters of A'waj came to you bridled... by the sons of the chaste women of Nizar.'\nAl-Hawasin, Abu Abdullah said: Those who have husbands, and similar to them are Al-Ghawani.\nAbdullah bin Shurahbil al-Hilali, the Knight of Al-Jaradah.\nAmr bin Amir bin Rabi'a bin Amir bin Sa'sa'ah, the Knight of Al-Dahya'. Khidash bin Zuhayr said:\n'My father is the Knight of Al-Dahya', Amr bin Amir... He refused blame and chose loyalty over treachery.'\nKhalid bin Ja'far bin Kilab, his horse: Hadhfah. He said about it:\n'Whoever asks about me, then I... and Hadhfah are like the obstruction under the jugular vein.\nA honored mare, I feed her a portion... and cover her with my cloak in the frost.\nAnd I instruct the two shepherds to give her the evening drink... the milk of the milk-camel and the premature mother.'\nAl-Khaliyah: The one who nurses another's young to produce milk, and her milk is for her family. Al-Sa'ud: The one who casts her young prematurely and nurses another's young.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 33
  },
  {
    "serial_number": "6679680",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 55,
    "volume_number": 1,
    "text": "Al-Ghabuq: The evening drink.\n'Perhaps Allah will enable me openly... against her from Zuhayr or Usayd.'\nZuhayr and Usayd: The two sons of Jadhimah.\nTufayl bin Malik bin Ja'far bin Kilab bin Rabi'a bin Amir bin Sa'sa'ah, the Knight of Qurzul. Salama bin al-Khurshub said about him:\n'Indeed you, O uncle of the Knight of Qurzul... are a repeater of foul speech and obscenities.'\nHe says: You repeat foul speech time after time.\nDabi'a bin al-Harith al-Absi said about him:\n'And you did the deed of your father, the Knight of Qurzul... Indeed the fleeing one is the son of every fleeing one.'\nAl-Nadud: The defeated one who flees when meeting war.\nAmir bin al-Tufayl bin Malik had: Hanwah, Al-Hammalah, Al-Maznuq, and Al-Kalb. He is called: The Knight of Al-Kalb. He said about Al-Maznuq:\n'Al-Maznuq knew that I attack... on the evening of Fayf al-Rih, the attack of the circumambulator.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 34
  },
  {
    "serial_number": "6679681",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 56,
    "volume_number": 1,
    "text": "He said: Al-Mudawwir: The one who circumambulates the idol worshipping it.\nSalama bin al-Khurshub said to Amir:\n'You escaped with the blade of a sword with no sheath over it... and a saddle on the back of Al-Hammalah, fitting.'\nAl-Qatir: That which fits the rider with no tightness or looseness.\n'If she were running then, we would have caught her... but they follow the image of a bird.'\nAmir also had: Al-Ward. Mayya bint Ahban al-Absiyya said mentioning Amir's horse:\n'Were it not for the speed of Al-Ward, its wing fluttering... and the command of God—there is no defeater of God—\nYou would have inhabited this year Nafa' and Man'ij... the lands of enemies, or loved ones would have wept for you.'\nMan'ij: A village on the road from Basra to Mecca. Nafa': A place near it.\nAbd Amr bin Shurayh bin al-Ahwas, the Knight of Da'laj. He said about it:\n'You are divorced if you do not ask which knight... your husband was when he met Sada' and Khath'am.\nAnd the day we met the gathering of Dhubyan and the spears... were thirsty, so we quenched their points with blood.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 35
  },
  {
    "serial_number": "6679682",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 57,
    "volume_number": 1,
    "text": "'I advance Da'laj among them and force him... If spears are forced into him, he neighs.\nMeeting the tips of spears that pierced him... like the piercing of a cracked vessel by a repairer.'\nDurayd bin al-Simma, his horse: Ajla. He said about her:\n'I say to Ajla: It is but an hour... May my soul be your ransom, catch me up with my pursuers.'\nTawba bin al-Humayyir, his horse: Al-Khawsa'. He said about her:\n'Tawba called Al-Khawsa' when deaths... assaulted him, and escape was barred.'\nHe gave Qabisa, his cousin, A'waj, his horse on which he escaped, and it was a bay (Ward).\nJaz' bin Shurayh bin al-Ahwas, his horse: Al-Harun. He said about it:\n'I set up for them the chest of Al-Harun as if they were... at his manure pile, until a promised time comes.\nIf they chase him, the spear is possible in them... and if they chase him, he intends the enemy.'\nAbu Abdullah Muhammad said: Rabi'a bin Amir bin Malik asked his brother Abu Hurayra bin Amir bin Malik to carry him, but he did not carry him. He obtained a horse called: Nathil, and said:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 36
  },
  {
    "serial_number": "6679683",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 58,
    "volume_number": 1,
    "text": "'If you were the owner of wealth, you would not be found on foot... and isolate the surplus of horses from you an isolation.\nI permitted you to buy with their surplus... and I prepared Nathil for enemies and war.\nI favored him over my family and softened his saddle cloth... and my weaning camels until they wintered as runts.'\nHasakil: Emaciated ones, which are young camels that did not drink enough milk.\nThe Knight of Khizam is a man from Banu Qushayr called: Hatim bin Hiyyash, one of Banu al-A'war bin Qushayr. His leg was cut off at Tustar, so he charged the polytheists saying:\n'Advance Khudham, they are the Chosroes.\nAdvance and do not let a flying leg deceive you.\nI am the Qushayri, brother of the emigrants.\nI strike with the sword the heads of the disbelievers.'\nShabib bin Jarad, one of Banu al-Wahid, his horse: Al-Shamus. He said:\n'I set up for them the chest of Al-Shamus, and I see... the place of flight if I wanted flight.\nIf they turn away, I shoot them from a Persian bow... I showed Haram a dirham and Suhar.'\nHe said: Banu Nufatha bin Abdullah bin Kilab bet Banu al-Ahwas bin Ja'far bin Kilab on a slave girl and thirty camels. Banu Nufatha won on a horse belonging to Rabi'a bin Amr bin Nufatha called: Ahlub. Rabi'a bin Amr is called: The Knight of Ahlub. They took the slave girl of Banu Ja'far, who was called: Jahira. She gave birth among Banu al-Samut. Among those she bore was Salam bin Hubaysh. When Salam and Al-A'war exchanged satire, Al-A'war said...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 37
  },
  {
    "serial_number": "6679684",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 59,
    "volume_number": 1,
    "text": "...Al-A'war taunting Salam about Jahira:\n'What is our fault if Ahlub ran... between Watir or Hazim al-Muntasa?\nWhile your mother was sitting at the goal.'\nYazid bin al-Tathriya, his horse: Al-Kumayt. He said:\n'By your lives, Al-Kumayt is entrusted... despite pain, to complete five [days] after five.'\nJa'da bin Mirdas al-Numayri, his horse: Junbar. Ma'qil bin Himar al-Bariqi said about it:\n'He presents Junbar with a notched sword... having an edge that whenever it attained, it cut.'\nAnd from Banu Nasr bin Muawiyah, the Knight of Mahaj, who is Malik bin Awf. He says to it on the Day of Hunayn:\n'Advance Mahaj, it is a day of denial.\nOne like me protects and attacks against one like you.'\nAbs bin Haddar, from Banu Wa'il bin Sa'sa'ah bin Muawiyah, the Knight of...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 38
  },
  {
    "serial_number": "6679685",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 60,
    "volume_number": 1,
    "text": "...Qadid. He said to his horse on the Day of al-Raqam:\n'Advance Qadid, do not be a shrinking one.\nI will surely stab a gushing stab.\nHaving a spray that scatters the army.\nHe who does not duel will not be a chief.'\nQalus: Gushing with blood. It is said: A gushing stab.\nAmir bin al-Tufayl says about him:\n'And Abu Ubayy, I have not heard of his like... Oh how excellent he is, evening and day.'\nAnd from Banu Nufayl bin Amr bin Kilab, the Knight of Saddam, who is Zufar bin al-Harith. He said to his horse:\n'Advance Saddam, he is the son of Bahdal.\nThe horses will not overtake while you walk wearily.\nExcept with a passing like the passing of the hawk.'\nAwf bin al-Ahwas, the Knight of Mijlaz. He also had Al-Asa.\nMuawiyah bin Julaymid bin Ubada bin al-Baka' bin Amir bin Rabi'a bin Amir bin...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 39
  },
  {
    "serial_number": "6679686",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 61,
    "volume_number": 1,
    "text": "...Sa'sa'ah, the Knight of Hajna'.\n\n**Horses of Rabi'a bin Nizar**\nAl-Lajjaj bin Abdullah said:\n'Mudar and Anmar gifted their brother... Abu Asad Rabi'a with the steeds.'\nYahya bin Mansur said:\n'Nizar was more knowing when he bequeathed... to which of his sons he bequeathed the donkey.\nAnd which of them is more deserving of every noble horse... twisting in the soft ground and the soft earth.'\nAl-Riqaq: The wide place.\n\n**Horses of Banu Dabi'a bin Nizar**\nHe said: Al-Safra' belonged to Al-Harith al-Adjam.\nAl-Ray' was the horse of Amr bin Asm, and he is the Knight of Al-Ray', and by it he is known.\nYazid al-Ghawani said, boasting and counting their men:\n'And the lord of Al-Ray' Al-Safra' is of us... and the rulers of the tribe all of them.'\nMukhayyil bin Shijna, the Knight of (Al-Matar). He said:\n'I wore Al-Sirat and Dhat Shakk... and I preferred Al-Matar over the family.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 40
  },
  {
    "serial_number": "6679687",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 62,
    "volume_number": 1,
    "text": "Al-Sirat: The cutting sword. Al-Shakk: The nails, and the nails are the armors (ghala'il), singular ghalalah. Heads of nails: Al-Harabi, singular hirba'. Also, the elevations of the ground and the chameleons of the ground, nothing else.\nAbu Abdullah said: Sa'd bin Mushammit swore not to see a prisoner but release him. His brother Al-Jalis bin al-Mushammit was captured by Jayfar bin al-Julanda. He said: 'I will not release you until you bring me such and such.' He began making conditions on him. Among what he stipulated was that he bring him the two horses of his brother Sa'd bin Mushammit: Al-Khayfaq and Al-Asa. Sa'd delayed him, so he recited poems about him. Among what he said was:\n'How many a Khayfaq and Asa I was reclaiming... and one like me throughout time is reclaimed.'\nHe did not release him until Al-Musayyab bin Alas said about him:\n'I am a man sending a greeting in absence... to Ibn Julanda, the Knight of horses, Jayfar.'\nAl-Akhnas bin Ghiyath al-Dabu'i said:\n'You continued calling Al-Ra'i'at, so your caller did not flag... until the calamities descended upon you.\nTawalah, Al-Shaqa', Al-Fayd, and Al-Shaqa... varied at times and at a time followed in succession.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 41
  },
  {
    "serial_number": "6679688",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 63,
    "volume_number": 1,
    "text": "**Horses of Anazah bin Asad**\nUqba bin Salim al-Hazzani, the Knight of Mayyah. He said about it:\n'I treated Mayyah for her and trained him... So I treated a filler of the eye in which there is no claim.'\nAnd it is narrated: 'So I emerged a filler of the eye in which there are claims.'\nHe says: No horse of the Arabs hopes to outstrip him.\n'As for when you are behind him, he is wide-bellied... As for when you face him, he is long-jawed.'\nAl-Hashur: Wide-bellied. Al-Saljam: Long-cheeked, long-necked.\n'And as for when you view him from the side, he is large-bodied... And he has a high back with long ribs and girth.'\nHabi: Full, long ribs.\n'He has the neck of a gazelle and the legs of an ostrich... and the sciatic nerves of a wolf whose flesh is chopped.'\nAbaya bin Shaks al-Hazzani, his horse: Al-Hammalah. He said about her:\n'I set up for them the chest of Al-Hammalah; indeed she... when the heroes recoil, I say to her: Advance.\nAs if the sail-like [ears] around her cheek-straps are... the secondary feathers of a black raven.'\n\n**Horses of Abd al-Qays bin Afsa**\nSuwayd bin Khadhaq al-Shanni, his horse: Al-Shamus. He said about it:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 42
  },
  {
    "serial_number": "6679689",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 64,
    "volume_number": 1,
    "text": "'Does she know that Hazim complained... to me and that I rode Al-Shamus?\nI treated her until she wintered Abyssinian (black)... as if upon her was sundus and sadus.'\nHabashiyyah: Black, meaning dark bay. Sundus: The yalanjaq. Sadus: A black thing.\nYazid bin Khadhaq, his horse: Sam'ar. He said about her:\n'I prepared Sam'ar after she shed her milk teeth... and wore the armor of a skin belt.\nYou will not combine my affection and my blame... until two swords are combined in one sheath.'\nAl-Rayyan bin Huways, from Banu Amir bin al-Harith, his horse: Al-Hirawah. He used to give it to the bachelors of his people; when a man became self-sufficient, he gave it to another.\nAnd belonging to Banu Amir bin al-Harith: Jalwa, mentioned by some of their poets.\nMazyada al-Muharibi, from Abd Qays, his horse Al-Mutatalli', and he was an owner of horses.\nTha'labah bin Umm Hazna, from Banu Amir bin al-Harith, his horse: Ajla. He said about her:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 43
  },
  {
    "serial_number": "6679690",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 65,
    "volume_number": 1,
    "text": "'And I prepared Ajla for the good medicine... a doctor feels her insides.'\nUrwa bin Sinan al-Abdi, his horse: Quddam. He said about her:\n'And upon Quddam I carried the armor of a decisive man... in fear, his heart is not burdened.'\n\n**Horses of Al-Namir bin Qasit**\nAbu Abdullah said: Al-Mundhir bin Ma' al-Sama' held a race, so the Arabs brought horses to him. A man from Kalb called Jariya bin Malik bin Jahl bin Awf bin Amr came to Al-A'lam bin Awf al-Namiri and asked for his mare. He gave it to him on condition that his son race it. He took it, a hairy mare with a wide belly, neighing and running fast. When the horses were released, the boy held its rein. The Kalbi said: \"Release her! The horses have gone.\" He did not answer him until the horses disappeared, then he released her. She appeared to Al-Mundhir winning. The boy feared for his mare, so he went on his mare. Al-Mundhir seized the Kalbi for the mare and sent cavalry with him. He came to Al-A'lam. Al-A'lam said: \"The mare belongs to my son, and he has gone out seeking grass that neither sheep nor camel can reach. If you find him sleeping and she has birthed a foal, then you are more likely to take him.\" They found him as he described. The boy heard the sound of horses, jumped up terrified, bridled her, and the horses followed him. The colt was by his knee in his saddlebag (kurz). The Kalbi said: \"Many a run is in the saddlebag,\" and it became a proverb. The mare was called: Al-Raha. He said about her:\n'O Amr, did you wonder at the colt of Al-Raha?'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 44
  },
  {
    "serial_number": "6679691",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 66,
    "volume_number": 1,
    "text": "'And the horses behind him complain of soreness.'\nRabi'a bin Jusham had a horse called: Waqi', from her offspring. He had a daughter called: Al-Sabuh. He said about her:\n'Umm Abdullah came to me blaming... and her desire is little achievable.\nAbout the daughter of Waqi' when she saw her... the water-camels and the houses being humiliated for her.\nShe attributed wealth to her and followed it... with the scarcity of what we have; indeed we are sated.'\nAl-Rawaya: Camels carrying water.\nQays bin Zuhayr al-Namiri, his horse on which Al-Mundhir bin Ma' al-Sama' escaped: Al-Jiryal. Qays bin Zuhayr al-Namiri was killed that day; Bakr bin Wa'il killed him on the Day of Kazim.\n\n**Horses of Banu Wa'il**\nThe horse of Jabir bin Hunayy al-Taghlibi: Zaym. He said:\n'This is the time of charging, so charge, Zaym... The night has wrapped her with a crashing driver.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 45
  },
  {
    "serial_number": "6679692",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 67,
    "volume_number": 1,
    "text": "'Neither a shepherd of camels or sheep... nor a butcher on a chopping block.\nSlim of flanks, quick of foot.'\nAbraha bin Umayr bin Kulthum, his horse: Al-Mudhhib. He said about it:\n'Al-Mudhhib adorned the horses of the Taghlibis... just as his rider adorned him on the day of adversity.'\nAbd Yaghuth bin Harb, his horse: Al-Sarih. Al-Akhtal said about it:\n'And the children of Al-Sarih are marked... lions with folded ears and leopards are upon them.'\nAmr bin Jabala al-Yashkuri, his horse: Al-Alah. He said about her:\n'Why did I repel the spear of Abu Shurayh... and polish Al-Uqaysar?'\nAl-Uqaysar: His sword.\n'And I treated Al-Alah with the treatment of a skin... and did not use her during the year of drought.'\nDawa' mask: Meaning as the skin is treated.\nWa lam azhar biha: Meaning I did not neglect her.\n'We persisted, may you have no father, so persist... And the other nights are not returned.'\nNafi' bin Abd al-Uzza bin Khawwas bin Malik bin Rabi'a bin Amir bin Juhayl bin Tha'labah bin Ghubbar bin Ghanm, his horse: Al-Zarqa'. He is called: The Knight of Al-Zarqa'.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 46
  },
  {
    "serial_number": "6679693",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 68,
    "volume_number": 1,
    "text": "Al-Munfajir, from Banu Amir bin Ghubbar, his horse Al-Na'amah. He caught up with Banu Yashkur when they divided Mulham from a distance of two days in one morning. Mulham: A water of Al-Yamama, a village with many wells.\nQart bin al-Taw'am al-Adawi, his horse: Mayyar. He said about it:\n'Ibn Shamma' used to give him evening and morning drink... from a herd like palm shoots, rotating.\nI continued stabbing them sideways and hitting them... until they feared, so they have Mayyar from me.'\nMuhalhil bin Rabi'a, his horse: Al-Mushahhar. He is the Knight of Al-Mushahhar. He said about it:\n'Bring the tether of Al-Mushahhar near me... Every peer he meets means fighting.'\nAl-Sarra' bin Qays bin Adi bin Qays bin al-Muftariq, his horse: Jalwa. Zuhayr bin Zabban bin Adi bin Qays bin al-Muftariq said about her:\n'And a sayer on the day of defense to her husband... Al-Sarra' is not equaled in events.\nA youth who turned back the horses, their throats bleeding... in defense, and the feet did not slip with him.\nAnd Jalwa knew that her master is not... a weak obscure man nor a dullard.'\nHe meant: Bi-abam, so he changed the mim to nun, meaning the heavy, inarticulate one.\n'And if Jalwa did not belong to the son of a free woman... the first of the vanguard would have perished with Jalwa.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 47
  },
  {
    "serial_number": "6679694",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 69,
    "volume_number": 1,
    "text": "**From Banu Shayban**\nAl-Hawfazan bin Sharik, and his name is Al-Harith, his horse: Al-Kamil. Al-Anbari said about him:\n'And Al-Hawfazan escaped us on Kamil.'\nQays bin Mas'ud, his horse: Al-Manih.\nBistam bin Qays, his two horses: Dhat al-Nusu' and Al-Za'faran.\n\n**From Banu Qays bin Tha'labah**\nAl-Harith bin Abbad, his horse: Al-Na'amah. He said about her:\n'Bring the tether of Al-Na'amah near me... The war of Wa'il has conceived after being barren.'\n\n**Horses of Banu Dhuhl bin Tha'labah**\nAbu Abdullah said: Banu Sadus bin Shayban bin Dhuhl and Abu Rabi'a bin Dhuhl bin Shayban were the most generous of Bakr bin Wa'il in keeping horses.\nTo Banu Sadus belonged: Sawbah, Al-Mutamattir, and Bal'a'.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 48
  },
  {
    "serial_number": "6679695",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 70,
    "volume_number": 1,
    "text": "And to Banu Abi Rabi'a: Al-Kharma'.\nAl-Mutamattir belonged to Hayyan bin Murra bin Jandala bin Jasr bin Amr bin Sadus. He says about it:\n'And the mean slave does not make his distress... And he does not make the workhorse like Al-Mutamattir.'\nAlso narrated: 'And the mean slave did not make his distress... And he did not make the workhorse like Al-Mutamattir.'\nHe also had Sawbah. Sawbah remained in the hands of Abdullah bin Hayyan. Al-Hasir bin al-Mutamattir and his mother Sawbah belonged to Abdullah bin Hayyan bin Murra. There was a dispute between Banu Awf bin Sadus and Amr bin Sadus. Qatan bin Abdullah bin Hayyan wounded a son of Khalifa bin Wathila. Banu Awf bin Sadus accepted Al-Hasir bin al-Mutamattir as compensation for their wounds. Abdullah bin Hayyan did that, then regretted it and enabled them over his son. Al-Aswad bin Rifa'a said:\n'Abu Qatan chooses the splitting of his head... over a filly from the family of Sawbah or a colt.\nThey sought him so they might rob the Sheikh of his colt... And Al-Hasir would have sufficed us for the vengeance.'\nHe said: Bal'a' was the mare of Al-Aswad bin Rifa'a. He sold a filly of hers for ten thousand to Khalifa bin Wathila and delivered it. Then he left Basra in the time of Umar bin al-Khattab and extracted her [another foal?] from her mother's belly. He traveled from Basra to...",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 49
  },
  {
    "serial_number": "6679696",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 71,
    "volume_number": 1,
    "text": "...La'la', which is a village between Kufa and Basra, in one night, and his mare died under him. His sons said: 'You have destroyed us; you bought a horse for ten thousand.' He said: 'O my sons, I bought lineage for you.'\nHe said: Hazana bin al-Sukhayr told me that Banu Amr bin Sadus had five horses on the Day of Dhi Qar. He named four and left one.\nHe said: Abu Fayd bin Harmal bin Alqama bin Sadus had: Al-Mutaghayyif and Nadwa.\nKulthum bin al-Harith bin Ka'b bin Amr bin Sadus had: Mudrik bin al-Jazi. Al-Jazi belonged to Al-Harith bin Ka'b bin Amr.\nHe said: Aswad bin Shayban told me that Al-Harith bin Ka'b was one of the knights of Banu Amr bin Sadus who caught up with Sawad al-Yashkuri and killed him. He had killed Shaqiq al-A'war bin Abdullah bin Amr bin Sadus, who was the keeper of their idols.\nMu'arrij had a horse called: Al-Zalim, which Al-Nu'man bin Zur'a chased on the Day of Dhi Qar. He says to it:\n'And Al-Nu'man escaped us by the distance of our spears... And at the rump of the colt was a brown sharp spear.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 50
  },
  {
    "serial_number": "6679697",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 72,
    "volume_number": 1,
    "text": "Fawt al-rimah: Slightly ahead of them. He says: He escaped it but did not get far. Al-Qatah of the beast: The place of the rider behind the saddle.\nThe horse of Abd Amr bin Rashid bin Jaz' bin Ka'b was called: Haydab. His wife Hadham bint Qays bin Saffarah bin Khuza'i bin al-A'war bin Sadus blamed him for preferring it. He said:\n'You blamed regarding Haydab in the evening, and were it not for... the charge of Haydab, Hadham would have been widowed.'\nThe horse of Khazaz bin Lawdhan bin Awf bin Sadus was called: Al-Gharraf. He says about it:\n'Do not mention my colt and what I fed her... for your color will become like the color of the scabby one.'\nIt is also narrated: Like the skin of the scabby one. He says in it:\n'And your mount will be the young camel and its litter... and the son of Al-Na'amah at that time will be my mount.'\nAbu Abdullah said: He is Al-Gharraf son of Al-Na'amah, and Al-Na'amah belonged to Khazaz bin Lawdhan.\nHassan bin Maslama bin al-Khazaz bin Lawdhan, his mare was called: Al-Ghashwa'. He says about her:\n'Why did you detain Al-Ghashwa' among you... shining as if she were Sirius the Crosser?'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 51
  },
  {
    "serial_number": "6679698",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 73,
    "volume_number": 1,
    "text": "'A favored group from you is with her... and another with her is locked, difficult.'\nThe horse of Ubayy bin Wathila bin Lu'ayy bin Awf: Ziyad, and his mother: Bal'a', and he is the one he bought for ten thousand.\nThe horse of Salama bin Nahar bin Abi al-Aswad bin Humran bin Amr bin al-Harith bin Sadus is named: Al-Jaradah.\nThe horse of Al-Khamkham bin Hamla bin Ubayy bin al-Aswad: Al-Maghra.\nAbu Abdullah said: Kalb raided Banu Dhuhl on the Day of Al-Rawdah, but Banu Dhuhl defeated them after they had driven away the cattle. Salama bin Nahar said:\n'Were it not for Al-Jaradah and Al-Ma'z, Jayda'... would not have seen her herd of long-humped camels.'\nJayda' bint Shabwah bin Abi al-Aswad.\nAlqama bin Shihab bin Awf bin al-Harith bin Sadus, the Knight of Al-Hawwa'. He is also called: Ma'rur. Mutabba' bin Alqama said to his guests:\n'My father is the Knight of Al-Hawwa', a night he did not find... for his guests anything but the bowl in the felt.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 52
  },
  {
    "serial_number": "6679699",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 74,
    "volume_number": 1,
    "text": "He said: And they recite this verse: My father is the Knight of Al-Ma'rur.\nSa'd bin Shuja' bin al-Harith bin Sadus, the Knight of Radwa. Nahar bin al-Aswad bin Humran bin Amr bin al-Harith said:\n'The charge of Sa'd and Ibn Humran achieved it... and the dashing of Radwa behind her and Al-Khafaydad.'\nAl-Khafaydad is the horse of Al-Aswad bin Humran bin Amr bin al-Harith.\nThe horse of Qatada bin Hariz bin Asaf bin Tha'labah bin Sadus: Al-Ta'ir.\nThe horse of Lahiq bin al-Najjar bin Humayri bin Tha'labah bin Sadus: Al-Nahhab. It was said about her:\n'Al-Nahhab did not miss the bird.'\nIt was named Al-Nahhab because it neighs (yanhib) in its voice, which is less than a full neigh (sahil).\nThe horse of Mirdas bin Ja'wana bin Sama bin Sakhr bin Tha'labah bin Sadus: Al-Uqab. She is the one on which he overtook Muja'a bin Murara al-Hanafi and killed him. Muja'a had stabbed him before that a stab that made him bleed.\nHabban bin Qatada, his horse is called: Al-Kafit. He said about it:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 53
  },
  {
    "serial_number": "6679700",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 75,
    "volume_number": 1,
    "text": "'And my preferring Al-Kafit provoked Sa'd... and Ada while the knights know me.'\nThe horse of Jabir bin Aqil: Hudhlul. He said about it:\n'Lo, who is for Hudhlul, a youth like Jabir... who returns Hudhlul as he used to do?'\nAl-Mahrus bin Amr, from Banu Abdullah bin Sadus, his horse was called: Al-Ma'luq. He said about it:\n'I praised that Ma'luq guarantees for us every craving... when our dry camels do not bring a milking vessel.'\nThe horse of Amr bin Shayban bin Dhuhl bin Tha'labah is named: Al-Tafi, and his she-camel Al-Ulkud. And his horse upon which Al-Azwar bin al-Harith bin Amr bin Shayban charged on the Day of Qidda; he is the one who captured Barra al-Qunfudh al-Taghlibi on it.\nThe horse of Malik bin Abda bin Rabi'a bin Amr bin Shayban bin Dhuhl is named: Raghwah. He said about her:\n'I released Raghwah while the knights were roaming... And her master was neither an intruder nor inexperienced.'\nHe said: Al-Waghl: The one who enters upon people while they are drinking and drinks with them.\nThe horse of Al-Qa'qa' bin Shawr was named: Al-Matamir, and it was famous.",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 54
  },
  {
    "serial_number": "6679701",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 76,
    "volume_number": 1,
    "text": "Abu Abdullah said: Al-Mundhir bin Ma' al-Sama' said on the day he fled from Bakr bin Wa'il on the Day of Kazim: \"I have tested the horses of Bakr bin Wa'il. They have four horses: As for the horse of Ruwaym bin Rabi'a, it is a sea (fast). As for the horse of Thumama bin al-Quraym, it is likely to lag.\" Ta'tham: fall short of the goal. \"As for Al-Sayyid, its stab on the Day of Uwara holds it back. As for Al-Jammaza, the horse of Umayya bin Hantam bin Adi bin al-Harith bin Tamim Allah, it is the first to catch up.\"\nAl-Sayyid: The horse of Mujalid bin Yathrabi bin al-Zabban.\nThe horse of Al-Harith bin Wa'la: Al-Mutafajjir. Yahya bin Mansur said:\n'From us is Ibn Kawma when he risked himself... and Al-Sha'thaman and the Knight of Al-Mutafajjir.'\nHuways bin Bujayr bin Murra, the Knight of Al-Nasib. A man from Banu Abd Shams said obliging his people:\n'I shook off a vengeance for you with a setting knight... and left people whose wounds are being treated.'\nThe Knight of Khasaf: Hamal bin Badr bin Awf bin Amir bin Dhuhl. The poet said:\n'By Allah, if I met Khasaf in the evening... I would be the most ominous knight against the kings.'\nThe horse of Al-Kalj: Al-Dakhil. He said on the Day of Kalb:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 55
  },
  {
    "serial_number": "6679702",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 77,
    "volume_number": 1,
    "text": "'I exchanged Al-Dakhil for you... limping, so occupy his ropes.'\nYakus: Walking on three legs. He had killed Fadalah, and they hamstrung his horse. Fadalah: Abu Dahya al-Kalbi.\nThe horse of Qays bin Siba': Shu'la. Halza bin Abbad said:\n'Were it not for the speed of Shu'la, you would not have returned... with the victory of a winner on the Day of Al-Anab.'\nThe horse of Wa'la bin Shurahil bin Zayd: Al-Amarrad. Al-Mudarib bin Nu'aym said:\n'Indeed Al-Amarrad on the Day of Al-Khaw' gave freely of... the sweat of the family of A'naq, unblemished.'\nA'naq: The horse of Amr bin Abi Rabi'a bin Dhuhl bin Shayban bin Tha'labah.\n\n**Horses of Ijl bin Lujaym**\nAl-Harith bin Dulaf, his horse is called: Al-Marikh, and he is the Knight of Al-Marikh.\nHanzala bin Sayyar al-Ijli, the Knight of Umayr, which is the name of his horse. He said on the Day of Dhi Qar, while he was on the left wing of Bakr bin Wa'il, encouraging them:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 56
  },
  {
    "serial_number": "6679703",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 78,
    "volume_number": 1,
    "text": "'Your sects have become serious, so become serious.\nWhat is my excuse while I am armed and tough?\nAnd the bow has a strong string in it.\nLike the arm of the young camel or stronger.\nThe news of my people has begun to appear.\nAnd deaths, there is no escape from them.\nThis is Umayr, above him is the fierce one.\nHe advances him, he has no return.\nUntil he returns like the reddish-brown Kumayt.\nLeave Banu Shayban and be unique.\nMy soul is your ransom, and my father the grandfather.'\nAnd he said:\n'Patience, Umayr, they are the Persian cavalries.\nPatience, and let not a flying leg frighten you.\nFor my soul is patient for deaths.'\n\n**Horses of Hanifa bin Lujaym**\nAbdullah bin Abd, the Knight of Marhab.\n\n**Horses of Iyad bin Nizar**\nAbu Dawud, his horse: Al-Arada. He said about her:",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 57
  },
  {
    "serial_number": "6679704",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 79,
    "volume_number": 1,
    "text": "'Bring the tether of Al-Arada near, for the... war has in it anxieties and rugged grounds.'\nAnd he said:\n'Indeed Al-Ghamamah, Al-Sarih, and Lahiq... and the daughters of A'waj produce every swift horse.'\nAnd it is narrated: In it are Al-Ghamamah, Al-Sabuh, and Lahiq.\n\n**Horses of Yemen**\nAl-As'ar bin Malik al-Ju'fi, his horse: Al-Mu'alla. He said about it:\n'I want the blood of Banu Mazin... and the whiteness of milk pleased Al-Mu'alla.'\nHe also had: Al-Dhabih. He said about it:\n'Indeed Al-Dhabih threw with his two sides... the stones and the Nassiy plant.'\nSalama bin Yazid al-Ju'fi said about a stallion of theirs called: Ra'shan:\n'And horses that witnessed Ra'shan... strong of joints, winning in the runs.'\nAl-A'raj al-Ta'i, who is Adi bin Amr, his horse: Al-Ward.\n'She blames me for giving Al-Ward a milk-camel... and she is not equal to Al-Ward in the hour we are frightened.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 58
  },
  {
    "serial_number": "6679705",
    "category_id": "32",
    "category": "Literature",
    "book_title": "Names of the Horses of the Arabs and Their Knights",
    "edition": "Second, 1430 AH - 2009 AD",
    "publisher": "Dar Al-Bashair, Damascus - Syria",
    "page_number": 80,
    "volume_number": 1,
    "text": "**Horses of Hamdan**\nAl-Ajda' bin Malik, his horse's name: Sakab. He said about it:\n'She scolds me when she sees my maintenance... of Sakab, and the best of horses is the one maintained.'",
    "foot_note": "None",
    "book_id": "770",
    "new_page_number": 59
  }
]