[
  {
    "text": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'\nAuthor: عبد الله بن يحيى العوبل\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 1
  },
  {
    "text": "sn: 3264\nbook_title: تخريج حديث لا يرث المسلم الكافر\nbook_link: https://shamela.ws/book/849\nbook_id: 849\nauthor_name: عبد الله بن يحيى العوبل\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/587\nauthor_ID: 587\neditor: Null\npublisher: بدون\nedition: Null\npages: 71\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: التخريج والأطراف\ncategory_id: 8",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "new_page_number": 2
  },
  {
    "serial_number": "3197154",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Takhrij and Atraf\nBook: Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'\nAuthor: Abdullah bin Yahya Al-Awbal\nNumber of pages: 71 [Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\n\nBook: Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'\nAuthor: Abdullah bin Yahya Al-Awbal\nNumber of pages: 71 [Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\n\nAuthor: Abdullah bin Yahya Al-Awbal\nNumber of pages: 71 [Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\n\nNumber of pages: 71 [Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\n\nNumber of pages: 71 [Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\n\n[Book numbering corresponds to the print]\nPublication date in Shamela: 4 Shawwal 1443\nPublication date in Shamela: 4 Shawwal 1443",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 3
  },
  {
    "serial_number": "3197155",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 3,
    "volume_number": 1,
    "text": "Introduction\nPraise be to Allah as He deserves to be praised, and peace and blessings be upon the most honorable of His prophets and messengers, and the best of His creation, Muhammad bin Abdullah, and upon his family and companions and those who support him.\nTo proceed...\nIndeed, one of the most famous upon whom chains of narration revolve, and from whom reports are narrated, and his Hadith spread in the cities and regions, and the determinations of the narrators of Hadith and its men called upon each other to take from him: The Great Imam Al-Hafiz Muhammad bin Muslim bin Shihab Al-Zuhri (d. 124 AH) may Allah have mercy on him. About whom Ibn Hibban (d. 354 AH) said: \"He was the best memorizer among the people of his time for the Sunnahs, and the best of them in context for them\" (1). He is among those upon whom the pivot of Hadith was in his time, such that the critic Imam Ali bin Al-Madini (d. 234 AH) began by mentioning him in the first letter of his book, saying: \"I looked and found...",
    "foot_note": "1. Mashahir Ulama al-Amsar by Ibn Hibban (444).",
    "book_id": "849",
    "new_page_number": 4
  },
  {
    "serial_number": "3197156",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 4,
    "volume_number": 1,
    "text": "...the chain of transmission revolves around six: For the people of Medina: Ibn Shihab; who is Muhammad bin Muslim bin Abdullah bin Shihab...) (1). He had the upper hand in the initial stages characterized by comprehensiveness for collecting reports and recording them, and their spreading and dispersal in the countries and regions, and the great ones followed in narration and taking from him. One of the most trustworthy narrators from him, the most established, and the most majestic: The Star of Sunnahs, the Repository of Sciences, and the Imam of the Abode of Migration; Imam Malik bin Anas (d. 179 AH) may Allah have mercy on him. He is in the first layer of his companions and those taking from him, and the masses of critics stated that he is the most established of those who narrate from Al-Zuhri (2).",
    "foot_note": "1. 'Ilal al-Hadith by Ali bin Al-Madini (86).\n2. The masses of critics prioritized him over the companions of Al-Zuhri: Yahya bin Ismail Al-Wasiti said: I heard Yahya bin Saeed Al-Qattan (d. 198 AH) mention the companions of Al-Zuhri one day, and he started with Malik among the first of them... And Abdullah bin Ahmad said: I said to him (meaning: his father): Which of the companions of Al-Zuhri is most established? He said: (Each one of them has a defect, except that Yunus and Uqayl convey the wordings, and Shu'aib bin Abi Hamza, and they are not like Ma'mar, Ma'mar approaches them in the chain). I said: What about Malik? He said: (Malik is most established in everything...) End quote. And according to Ibn Hani: It was said to him: Which of the companions of Al-Zuhri is most beloved to you? He said: (Malik is most beloved to me due to the scarcity of his narration, and after him Ma'mar...), and Abu Talib said: Abu Abdullah said: (And Malik is more established in the Hadith of Al-Zuhri than all who narrated from him). And Yahya bin Ma'in (d. 233 AH) said - following his listing of Al-Zuhri's companions -: (That is the highest of them), and he said: (Malik is the greatest of all people in Al-Zuhri and the most established among them in my view). And Amr Al-Fallas (d. 249 AH) said: (The most established who narrated from Al-Zuhri among those who do not differ from him: Malik bin Anas). And Ibrahim bin Yaqub Al-Juzajani (d. 259 AH) said: (Malik is among the most established people in him). And Abu Hatim Al-Razi (d. 277 AH) said: (He is the most established of Al-Zuhri's companions). And Al-Nasa'i (d. 303 AH) said: (The most established people in Ibn Shihab Al-Zuhri: Malik bin Anas, and Ziyad bin Sa'd Al-Khurasani). See: Al-'Ilal wa Ma'rifat al-Rijal by Imam Ahmad, narration of his son Abdullah (2543), Masa'il Ibn Hani (2128) and (2273), Al-Ma'rifah wa al-Tarikh by Al-Fasawi (2/201), Mashyakhat Al-Nasa'i (77), Su'alat Ibn Al-Junayd (156) and (545), Tarikh Ibn Ma'in by narration of Ibn Tahman (138) and (400), Ma'rifat al-Rijal by Ibn Muhriz (1/120), Al-Jarh wa al-Ta'dil by Ibn Abi Hatim (8/205), and Sharh 'Ilal Al-Tirmidhi by Ibn Rajab (2/671).",
    "book_id": "849",
    "new_page_number": 5
  },
  {
    "serial_number": "3197157",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 5,
    "volume_number": 1,
    "text": "Rather, high praise and lofty commendation for him from his sheikh Ibn Shihab was reported in a story that happened to him with him: where Al-Zuhri said to him after narrating to him some ten odd Hadiths: \"Does it benefit you that I narrate to you and you do not write?\", I said: If you wish, I will repeat them back to you. He said: \"Repeat them,\" so I repeated them back to him, and he said: \"Yes, what a repository of knowledge you are!\" (1).",
    "foot_note": "1. Ikmal Tahdhib al-Kamal by Ala al-Din Mughlatay (11/31).",
    "book_id": "849",
    "new_page_number": 6
  },
  {
    "serial_number": "3197158",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 6,
    "volume_number": 1,
    "text": "And among the most famous reports in which there was disagreement regarding Ibn Shihab Al-Zuhri: The Hadith of Usama bin Zaid, may Allah be pleased with him; that the Messenger of Allah, peace be upon him, said: \"A Muslim does not inherit from a disbeliever.\" The disagreement centers on naming his narrator from Usama bin Zaid; is he: \"Amr bin Uthman\", or \"Umar bin Uthman\"? Both are sons of Uthman bin Affan, may Allah be pleased with him: So the companions of Al-Zuhri narrated it naming his narrator \"Amr\", and Malik differed from them so he named him: \"Umar\", and he erred in it. And as Ibn Abd al-Barr (d. 463 AH) said: \"And Malik is among those whom hardly anyone else is compared to in memorization and precision, but no one is free from error\" (1). And the matter in collecting paths and narrations is clarifying the points of agreement and disagreement in them, with highlighting and utilizing the practice of the Imams and their behaviors and methods in narrating it, and looking into the implications of its contexts mentioned in it. And the Hadith of the chapter is among the most famous of what is used as evidence for the care of the critical Imams in clarifying the errors of trustworthy Muhaddiths and correcting them; where we see the succession of Imams and narrators in clarifying the error in naming its narrator, and their stipulation on the correct aspect in it (2).",
    "foot_note": "1. Al-Tamhid: (9/160).\n2. Abu Amr Ibn al-Salah (d. 643 AH) mentioned it in his Introduction (p. 88) as an example of the Munkar (denounced) Hadith in which the trustworthy contradicts the Hadith of the trustworthy ones, and I did not see in the speech of those who preceded a description of Malik's narration as Munkar, and what appears to me is that labeling it as contradiction or strangeness is more appropriate and worthy than describing it and including it in the chapters of Munkar, especially according to the terminology established for Munkar among the later scholars.",
    "book_id": "849",
    "new_page_number": 7
  },
  {
    "serial_number": "3197159",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 7,
    "volume_number": 1,
    "text": "And this is a brief part in collecting its paths and narrations and speaking about them (1), with a focus on investing its contexts mentioned in them, and alerting to what occurred in some sources of difference in transmitting it with an extraction of the correct view. And from Allah I seek help and correctness, and I ask Him for attaining the request and desire; He is the Guardian of that and Capable of it. (Mecca) 1441 AH",
    "foot_note": "1. It is extracted from my master's thesis: \"The Hadiths which Imam Al-Nasa'i declared defective in Al-Sunan Al-Kubra, an inductive study\", and the discussion on it was arranged in its origin according to the context in which it appeared with Al-Nasa'i, so I rearranged it here in the manner of ordered folding and spreading, with reference and benefit from the indications of its context in which it appeared.",
    "book_id": "849",
    "new_page_number": 8
  },
  {
    "serial_number": "3197160",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 8,
    "volume_number": 1,
    "text": "Text of the Hadith: From Usama bin Zaid, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"A Muslim does not inherit from a disbeliever, nor does a disbeliever inherit from a Muslim.\" \nTakhrij: \n* This Hadith was narrated by Ibn Shihab Al-Zuhri, and it was differed upon him in four ways: \nThe First Way: The majority of his companions narrated it: from him, from Ali bin Al-Hussein, from Amr bin Uthman (1), from Usama bin Zaid, who said:",
    "foot_note": "1. Amr bin Uthman bin Affan: One of the senior Tabi'in. Mus'ab Al-Zubayri - who is one of the narrators of the chapter's Hadith from Malik - said: (Amr bin Uthman was the eldest of Uthman's children who left offspring) End quote. Ibn Sa'd said: (Amr narrated from his father, and from Usama bin Zaid, and he was trustworthy and had Hadiths). Al-Ijli said: (Madinan Tabi'i trustworthy, one of the senior Tabi'in). Ibn Hibban mentioned him in his Thiqat and said: (He narrates from his father and Usama bin Zaid, Al-Zuhri narrated from Ali bin Hussein from him). He is the son-in-law of Muawiyah bin Abi Sufyan through his daughter Ramla, and the Six narrated from him. Note: The statement of Mus'ab Al-Zubayri appeared in Al-Mizzi and Al-Sakhawi, attributed to Al-Zubayr bin Bakkar, and the reason for that is that Al-Zubayr built his book on his uncle's book and added to it. See: Al-Tabaqat Al-Kubra by Ibn Sa'd: (7/149), Nasab Quraysh by Mus'ab Al-Zubayri (p. 105), Ma'rifat Al-Thiqat by Al-Ijli: 2/180 (1396), Al-Thiqat by Ibn Hibban (5/168), Tahdhib Al-Kamal (22/155), and Al-Tuhfa Al-Latifa (5/253).",
    "book_id": "849",
    "new_page_number": 9
  },
  {
    "serial_number": "3197161",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 9,
    "volume_number": 1,
    "text": "The Messenger of Allah, peace be upon him, said: \"A Muslim does not inherit from a disbeliever.\" It was narrated from him by [a group] of his companions: (Sufyan bin Uyaynah, Abdul Malik bin Jurayj, Yazid bin Al-Had, Ma'mar bin Rashid Al-Azdi, Uqayl bin Khalid, Yunus bin Yazid, Abdullah bin Budayl, Usama bin Zaid Al-Laythi, Yahya bin Saeed Al-Ansari, Muhammad bin Abi Hafsa, and Zam'a bin Salih).\nThe Second Way: Malik bin Anas narrated it: and it was differed upon him in three ways:\nThe First: A group of Malik's companions narrated it, from him, from Al-Zuhri, from Ali bin Al-Hussein, from Umar bin Uthman (1), from Usama bin Zaid, with it, raised (Marfu').",
    "foot_note": "1. Umar bin Uthman bin Affan: One of the Tabi'in, narrated from his father. Ibn Sa'd said: (Al-Zuhri narrated from him, and he had a house in Medina, and he had few Hadiths). Al-Bukhari said: (He heard Uthman, may Allah be pleased with him; Ibrahim bin Umar bin Aban said it, from his father, in his chain there is something). Ibn Abd al-Barr said: (As for the genealogists, they do not differ that Uthman bin Affan had a son named Umar, and he also had a son named Amr). Ibn Hibban mentioned him in Al-Thiqat. Al-Mizzi symbolized Al-Nasa'i's narration for him because it appeared in Malik's Hadith, and I did not find any narration for him other than it. See: Al-Tabaqat Al-Kubra by Ibn Sa'd (7/150), Al-Tarikh Al-Kabir by Al-Bukhari (6/178), Al-Jami' Al-Kabir by Al-Tirmidhi (2107), Al-Thiqat by Ibn Hibban (5/146), Al-Tamhid by Ibn Abd al-Barr (9/160), and Tahdhib Al-Kamal by Al-Mizzi (21/458).",
    "book_id": "849",
    "new_page_number": 10
  },
  {
    "serial_number": "3197162",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 10,
    "volume_number": 1,
    "text": "The Second: Others narrated it from him, from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, with it, raised, like the narration of the majority of Al-Zuhri's companions in the first way; by naming his narrator \"Amr\" (1).\nThe Third: Ibn Bukair narrated it from him, with doubt; so he said: \"Amr bin Uthman, or Umar bin Uthman\".\nThe Third Way from Al-Zuhri: Abdullah bin Isa narrated it: from Al-Zuhri, from Ali bin Al-Hussein, from Usama bin Zaid, with it, raised.\nThe Fourth Way from Al-Zuhri: Hushaym bin Bashir narrated it: with the wording: \"People of two different religions do not inherit from each other\". It was differed upon him in his chain in two ways:\nThe First: Mas'ud bin Juwayriyah narrated it, from him, from Al-Zuhri, from Ali bin Al-Hussein, and Aban bin Uthman, from Amr bin Uthman, from Usama bin Zaid, with it. So he added in his chain \"Aban bin Uthman\".",
    "foot_note": "1. The explanation of the contradiction of this way to the correct narration from Imam Malik will come through the reality of the narration; since what is preserved from him and what was transmitted by a group of his companions; and the Imams agreed upon specifying his narration and his error in it is the first way.",
    "book_id": "849",
    "new_page_number": 11
  },
  {
    "serial_number": "3197163",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 11,
    "volume_number": 1,
    "text": "And the Second: A group of his companions narrated it from him without mentioning \"Aban\" in his chain.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 12
  },
  {
    "serial_number": "3197164",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 12,
    "volume_number": 1,
    "text": "The First Way: From Al-Zuhri naming his narrator \"Amr bin Uthman\" and the masses of Ibn Shihab's companions narrated it, and they are:\n1 - Sufyan bin Uyaynah: Narrated by Ahmad in Al-Musnad: (21747), Al-Humaydi in his Musnad: (551), Al-Shafi'i in Al-Risalah: (p. 167) and Al-Umm (4/75), (4/87), (7/383) and (1/300), Ibn Abi Shaybah in Al-Musannaf (1): (32088) - and from him Ibn Abi Asim in Al-Ahad wa Al-Mathani: (454) - Muslim in his Sahih: (1614), Abu Dawood in Al-Sunan: (2909), Al-Tirmidhi in Al-Jami': (2107), Ibn Majah: (2729), Al-Nasa'i in Al-Sunan Al-Kubra: (6550), Al-Darimi in his Musnad: (3044), Al-Bazzar in his Musnad: (2581), Ibn Hibban in his Sahih: (6033), Ibn Al-Jarud in Al-Muntaqa min Al-Sunan Al-Musnadah: (954), Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414), and others =",
    "foot_note": "1. Ibn Abi Shaybah was alone in his Musannaf by narrating it from Ibn Uyaynah with the wording: \"Two different religions do not inherit from each other\", and perhaps he narrated it by its meaning as he titled it saying: \"Who said: A Muslim does not inherit from a disbeliever\", and the rest of Ibn Uyaynah's companions differed from him, numbering over twenty narrators. Ibn Abi Shaybah narrated it in his Musnad: (144) - and from his path Ibn Abi Asim in Al-Ahad wa Al-Mathani: (454) - and others from the path of Ibn Uyaynah with the wording of the group.",
    "book_id": "849",
    "new_page_number": 13
  },
  {
    "serial_number": "3197165",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 13,
    "volume_number": 1,
    "text": "2 - Abdul Malik bin Jurayj: Narrated by Abdul Razzaq in Al-Musannaf: (9852) - and from him Ahmad in his Musnad: (21808), and Ibn Al-Mundhir in Al-Awsat: (9669) - and Al-Bukhari in his Sahih: (6764), and Al-Bazzar in his Musnad: (2585) =\n3 - Yazid bin Al-Had: Narrated by Al-Nasa'i in Al-Kubra: (6551), Ibn Al-Mundhir in Al-Awsat: (9668), and Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\n4 - Ma'mar bin Rashid Al-Azdi (1): Narrated by Ahmad in Al-Musnad: (21808), Al-Darimi in his Musnad: (3041), Al-Nasa'i in Al-Kubra: (6553), and Ibn Al-Mundhir in Al-Awsat: (6860) =\n5 - Uqayl bin Khalid: Narrated by Al-Nasa'i in Al-Kubra: (6552), and Abu Awana in his Mustakhraj: (5594),",
    "foot_note": "1. Ma'mar's narration came here restricted to the wording of the group's Hadith: \"A Muslim does not inherit from a disbeliever\" narrated from him by (Abdul Razzaq, Abdul A'la bin Abdul A'la, and Yazid bin Zurai'), and he narrated it another way with an addition in its text as will be discussed in an appendix at the end of this aspect.",
    "book_id": "849",
    "new_page_number": 14
  },
  {
    "serial_number": "3197166",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 14,
    "volume_number": 1,
    "text": "and Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\n6 - Yunus bin Yazid: Narrated by Al-Nasa'i in Al-Sunan Al-Kubra: (6554), Ibn Majah in his Sunan: (2730), and Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\n7 - Abdullah bin Budayl: Narrated by Al-Tayalisi in his Musnad: (665), and Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\n8 - Usama bin Zaid Al-Laythi: Mentioned by Ibn Abi Asim in Al-Ahad wa Al-Mathani: (454), and he did not provide a chain for it =\n9 and 10 - Ma'mar and Ibn Jurayj - combined -: Narrated by Abdul Razzaq in Al-Musannaf: (19304) =\n11 - Yahya bin Saeed Al-Ansari: Narrated by Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414), and Abu Nu'aym in Al-Hilya: (3/144) =",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 15
  },
  {
    "serial_number": "3197167",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 15,
    "volume_number": 1,
    "text": "12 - Muhammad bin Abi Hafsa: Narrated by Al-Bukhari in his Sahih: (4282), Ahmad in Al-Musnad: (21752), and Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\n13 - Zam'a bin Salih: Narrated by Al-Tabarani in Al-Mu'jam Al-Kabir: 1/169 (414) =\nAll of them: (Sufyan bin Uyaynah, Ma'mar bin Rashid, Abdul Malik bin Jurayj, Yazid bin Al-Had, Uqayl bin Khalid, Yunus bin Yazid, Abdullah bin Budayl, Usama bin Zaid Al-Laythi, Yahya bin Saeed Al-Ansari, Muhammad bin Abi Hafsa, and Zam'a bin Salih) -: Narrated it from: Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, who said: The Messenger of Allah, peace be upon him, said: \"A Muslim does not inherit from a disbeliever.\"",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 16
  },
  {
    "serial_number": "3197168",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 16,
    "volume_number": 1,
    "text": "Appendix: (On the disagreement regarding Al-Awza'i and Ma'mar)\n* First: The Hadith of Al-Awza'i, and it was differed upon him in the chapter's Hadith on two ways:\nThe First Way: Narrated from him, from Al-Zuhri, from Abu Salama, from Abu Huraira, may Allah be pleased with him, with the wording: \"We are descending tomorrow at Khaif Bani Kinana...\".\nAnd the Second Way: Narrated from him, from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, may Allah be pleased with him, who said: I said: O Messenger of Allah, where will you stay tomorrow? And that was during the Hajj of the Prophet, peace be upon him. He said: \"And has Aqil bin Abi Talib left us any dwelling?\", then he said: \"A Muslim does not inherit from a disbeliever, nor a disbeliever from a Muslim\", then he said: \"We are descending tomorrow at Khaif Bani Kinana, where Quraish swore on disbelief.\" (1)\nAs for the first way, it was narrated by: Ahmad in Al-Musnad (7240), Al-Bukhari in his Sahih (1590) from Al-Humaydi, Muslim in his Sahih (1314) from Zuhair bin Harb, Ibn Khuzayma in his Sahih (2981) from Al-Hussein bin Huraith - and from his path Abu Nu'aym in his Mustakhraj (3028) - and Al-Sarraj in his Hadith with Takhrij of Al-Shahhami 2/361 (1495) from Muhammad bin Al-Sabbah, and Ibn Akhi Mimi Al-Daqqaq in",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 17
  },
  {
    "serial_number": "3197169",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 17,
    "volume_number": 1,
    "text": "Al-Fawa'id (351) from Abu Al-Qasim Al-Baghawi, from Dawud bin Rashid, and Abu Nu'aym in his Mustakhraj (3028) from Abu Ali Muhammad bin Ahmad, from Abu Shu'aib Al-Harrani, from Ali bin Al-Madini, H, and from Muhammad bin Ibrahim from Abdullah bin Muhammad bin Salam from Duhaym Abdul Rahman bin Ibrahim: All of them (Ahmad bin Hanbal, Al-Humaydi, Zuhair bin Harb, Ali bin Al-Madini, Muhammad bin Al-Sabbah, Dawud bin Rashid, Al-Hussein bin Huraith, and Duhaym) (1), narrated it from Al-Walid bin Muslim =\nAnd Ahmad in Al-Musnad (10969), Al-Fakihi in Akhbar Makkah (2405) from Al-Abbas Al-Duri, and Al-Mahamili in Al-Amali narration of Ibn Mahdi (32) - and from his path Al-Khatib in Al-Fasl (2/695), and Abu Nu'aym Al-Haddad in Jami' Al-Sahihayn (3686) - from Saeed bin Bahr; the three of them (Ahmad bin Hanbal, Abbas Al-Duri, and Saeed bin Bahr) narrated it from Muhammad bin Mus'ab =",
    "foot_note": "1. Ismail bin Hafs bin Umar bin Dinar differed from them in his chain and text as in Al-Bazzar in his Musnad (2582) where he narrated it from Al-Walid bin Muslim from Al-Awza'i from Al-Zuhri from Ali bin Al-Hussein from Amr bin Uthman from Usama raised with the wording: \"We are descending tomorrow at Khaif Bani Kinana\", and \"Has Aqil left us any dwelling\". The correct version in Al-Walid bin Muslim's narration is what the group narrated from him, among them the great Imams like Al-Humaydi, Ahmad, and Ibn Al-Madini. And Ismail bin Hafs: Al-Nasa'i and Ibn Majah narrated from him, and Ibn Abi Hatim quoted his father saying: (I wrote from him and his father, and his father used to lie, and he is unlike his father. I said: Is there any harm in him? He said: I cannot say: There is no harm in him), and Al-Nasa'i said (I hope there is no harm in him), and Ibn Hibban deemed him trustworthy, Al-Jarh wa Al-Ta'dil (2/166), Al-Thiqat (8/102), and Tahdhib Al-Tahdhib (1/146).",
    "book_id": "849",
    "new_page_number": 18
  },
  {
    "serial_number": "3197170",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 18,
    "volume_number": 1,
    "text": "And Abu Dawood in Al-Sunan (2011), Al-Nasa'i in Al-Sunan Al-Kubra (4396), from Mahmud bin Khalid, from Umar bin Abdul Wahid Al-Sulami, Ibn Khuzayma in his Sahih (2982) from Yunus bin Abdul A'la, and Bahr bin Nasr from Bishr bin Bakr, Al-Bayhaqi in Al-Sunan Al-Kubra (5/160) from Ishaq bin Muhammad, from Abu Al-Abbas Muhammad bin Yaqub, from Al-Abbas bin Al-Walid, from his father Al-Walid bin Mazid, and Abu Awana in his Mustakhraj - as in Ithaf Al-Mahara (20485) - from Abu Umayyah from Muhammad bin Mus'ab, and Yahya bin Al-Dahhak, and Ismail bin Abdullah bin Sama'a - Al-Khatib pointed to their narration in Al-Fasl (2/697) but did not provide the chain - all of them (Al-Walid bin Muslim, Muhammad bin Mus'ab, Umar bin Abdul Wahid, Bishr bin Bakr, Al-Walid bin Mazid, Yahya bin Al-Dahhak, and Ismail bin Sama'a) = narrated it from Al-Awza'i, from Al-Zuhri, from Abu Salama, from Abu Huraira, may Allah be pleased with him, who said: The Prophet, peace be upon him, said the next day on the Day of Sacrifice, while he was at Mina: \"We are descending tomorrow at Khaif Bani Kinana...\". The two Sheikhs agreed on narrating Al-Awza'i's Hadith in this manner, and the Imams and authors of compilations took care in narrating and transmitting it, and a group of Ibn Shihab's companions followed him in it (1).",
    "foot_note": "1. Among them: Ibrahim bin Sa'd: Narrated by Ahmad (7580), Al-Bukhari (3882), and (4285), Shu'aib bin Abi Hamza: Narrated by Al-Bukhari (1589), and (7479), Yunus bin Yazid: Narrated by Al-Bukhari (7479), and Muslim (3153), and Uqayl bin Khalid: Narrated by Ibn Khuzayma (2984).",
    "book_id": "849",
    "new_page_number": 19
  },
  {
    "serial_number": "3197171",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 19,
    "volume_number": 1,
    "text": "(2) As for the Second Way: It was narrated by: Abdul Razzaq in Al-Musannaf (9851) - and from his path Al-Nasa'i in Al-Kubra (4451) abbreviated, and Abu Awana in his Mustakhraj (5597) - from Ma'mar and Al-Awza'i - combined - from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, may Allah be pleased with him, with it. Al-Nasa'i declared it defective saying: \"Al-Awza'i's Hadith is not preserved\", meaning: from the Musnad of Usama, may Allah be pleased with him. Since Abdul Razzaq differed in his Hadith from the group's Hadith, and carried Al-Awza'i's Hadith on Ma'mar's Hadith which he narrated from the Musnad of Usama, may Allah be pleased with him. The correct version in his Hadith is that it is from the Musnad of Abu Huraira, may Allah be pleased with him, as the companions of the first way narrated it with the wording: \"We are descending tomorrow at Khaif Bani Kinana...\".",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 20
  },
  {
    "serial_number": "3197172",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 20,
    "volume_number": 1,
    "text": "* Second: Ma'mar's Hadith, and it was narrated from him briefly and at length:\nThe First: Restricting to the wording of the group's Hadith: \"A Muslim does not inherit from a disbeliever, nor a disbeliever from a Muslim\". It was narrated from him by: (Abdul Razzaq, Abdul A'la bin Abdul A'la, and Yazid bin Zurai'), and the reference to their narration has preceded.\nThe Second: (Abdul Razzaq) narrated it from Ma'mar with his chain to Usama bin Zaid, may Allah be pleased with him, who said: I said: O Messenger of Allah, where will we stay tomorrow? In his Hajj. He said: \"And has Aqil left us any dwelling?\", then he said: \"We are descending tomorrow, God willing, at Khaif Bani Kinana\", then he said at that: \"A disbeliever does not inherit from a Muslim, nor a Muslim from a disbeliever\".\n- It was narrated by: Ahmad in Al-Musnad (21766) - and from his path Abu Dawood in Al-Sunan (2010), and (2910), and Al-Mizzi in Tahdhib Al-Kamal (22/156) - and Al-Bukhari (3058) from Mahmoud bin Ghailan, and Muslim (1351) from Muhammad bin Mihran Al-Razi, Ibn Abi Umar, Abd bin Humaid, Abu Awana in his Mustakhraj (5596) from Muhammad bin Ishaq bin Al-Sabbah, and Hamdan Al-Sulami, Ibn Khuzayma in his Sahih (2985), Al-Baghawi in Sharh Al-Sunnah (2747), and Al-Ala'i in Bughyat Al-Multamis (187), with their chains to Ibn Ma'qil Al-Midani; both (Ibn Khuzayma and Ibn Ma'qil) narrated it from Muhammad bin Yahya Al-Dhuhli = and Al-Tabarani in Al-Mu'jam Al-Kabir 1/168 (413) from Ibrahim bin Suwayd, and Al-Bayhaqi",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 21
  },
  {
    "serial_number": "3197173",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 21,
    "volume_number": 1,
    "text": "in Al-Kubra (5/160) from Abu Al-Hasan Al-Mahrjani, from Bishr bin Ahmad, from Ahmad bin Al-Hussein bin Al-Hadhdha', from Ali bin Al-Madini, and others; all of them: (Ahmad bin Hanbal, Mahmoud bin Ghailan, Muhammad bin Mihran, Ibn Abi Umar, Abd bin Humaid, Muhammad bin Al-Sabbah, Hamdan Al-Sulami, Muhammad bin Yahya, Ibrahim bin Suwayd, and Ali bin Al-Madini): narrated it from Abdul Razzaq, from Ma'mar, with it (1).",
    "foot_note": "1. And in the narration of the two Sheikhs, Abu Dawood, Al-Tabarani and Al-Bayhaqi, his saying: \"A Muslim does not inherit from a disbeliever\" is not present.",
    "book_id": "849",
    "new_page_number": 22
  },
  {
    "serial_number": "3197174",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 22,
    "volume_number": 1,
    "text": "Mention of the disagreement reported in its text:\n* Ma'mar's Hadith is among what the observers and critics differed upon:\n1 - Where Ali bin Al-Madini stated that his saying: \"We are descending tomorrow, God willing, at Khaif Bani Kinana\", is inserted (Mudraj) by Ma'mar into the Hadith of Usama bin Zaid, may Allah be pleased with him, and the correct version is that it is from the Musnad of Abu Huraira, may Allah be pleased with him. Ibn Khuzayma and Al-Khatib Al-Baghdadi followed him in this. Ali bin Al-Madini said: \"The Hadith of Abu Huraira, from the Prophet, peace be upon him: 'Our dwelling tomorrow, God willing, is at Al-Khaif in the forenoon' was narrated by Al-Zuhri, and Al-Zuhri's chain was differed upon: It was narrated by Al-Awza'i, Ibrahim bin Sa'd, Al-Nu'man bin Rashid, and Ibrahim bin Ismail bin Mujammi'; all of them from Al-Zuhri, from Abu Salama, from Abu Huraira (1). Except that Ma'mar inserted it into the Hadith of Ali bin Hussein, from Amr bin Uthman, from Usama bin Zaid: 'Has Aqil left me any dwelling', so he inserted the speech in it: 'Our dwelling tomorrow'. Muhammad bin Abi Hafsa narrated it from Al-Zuhri, from Ali bin Hussein, from Amr bin Uthman, from Usama, and did not mention in it: 'And our dwelling is at Al-Khaif'\" (2).",
    "foot_note": "1. This is the first way of Al-Awza'i's Hadith, and it has preceded.\n2. 'Ilal Al-Hadith by Ibn Al-Madini (122), Sahih Ibn Khuzayma (2984), and Al-Fasl lil-Wasl Al-Mudraj fi Al-Matn (75).",
    "book_id": "849",
    "new_page_number": 23
  },
  {
    "serial_number": "3197175",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 23,
    "volume_number": 1,
    "text": "2 - The two Sheikhs agreed on narrating Ma'mar's path from the Musnad of Usama bin Zaid, may Allah be pleased with him, with the mentioned wording, as previously indicated. Abdul Razzaq's companions took care in narrating it, and among them are the great ones of his companions. Al-Daraqutni stated that the mentioned wording is preserved from both Hadiths (1).",
    "foot_note": "1. Al-'Ilal (1738).",
    "book_id": "849",
    "new_page_number": 24
  },
  {
    "serial_number": "3197176",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 24,
    "volume_number": 1,
    "text": "The Second Way (From Al-Zuhri): The narration of Malik bin Anas\n* Malik bin Anas narrated it, and his companions differed from him in three ways:\nThe First Way: A group narrated it from him naming his narrator: \"Umar bin Uthman\", and they are: (Muhammad bin Idris Al-Shafi'i, Khalid bin Mukhlid Al-Qatwani, Abdullah bin Wahb, Mus'ab bin Abdullah Al-Zubayri, Muhammad bin Al-Hasan Al-Shaybani, Abdul Rahman bin Mahdi, Abdullah bin Maslama Al-Qa'nabi, and Ahmad bin Ismail Al-Madani Al-Sahmi).\nThe Second Way: A group narrated it from him naming his narrator \"Amr bin Uthman\", and they are: (Abdullah bin Al-Mubarak, Abu Mus'ab Al-Zuhri, Zaid bin Al-Hubab, Muawiyah bin Hisham Al-Qassar, Yahya bin Yahya Al-Laythi, Ibrahim bin Tahman, and Abdul Rahman bin Al-Qasim).\nThe Third Way: Yahya bin Bukair narrated it from Malik, with doubt, so he said in it: \"From Amr or Umar bin Uthman\".",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 25
  },
  {
    "serial_number": "3197177",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 25,
    "volume_number": 1,
    "text": "The First Way (From Malik)\n* A group of his companions narrated it from him naming his narrator: \"Umar\":\nIt was narrated by: Al-Shafi'i in Al-Umm: (4/75), Ahmad in Al-Musnad: (21813) from Ibn Mahdi - and from his path Al-Ala'i in Bughyat Al-Multamis: (p. 180) - and Muhammad bin Al-Hasan Al-Shaybani in his Muwatta: (728), Abdullah bin Maslama Al-Qa'nabi in his Muwatta (manuscript in Al-Jarahi's handwriting: (A/91)) - and from his path Al-Jawhari in Musnad Al-Muwatta (210), and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: (36) - and Ibn Abi Khaythama in Al-Tarikh (Second Volume): 2/905 (3840) - and from his path Ibn Abd al-Barr in Al-Tamhid (9/162) - from Mus'ab bin Abdullah, and Abu Tahir Al-Mukhallis in Al-Fawa'id Al-Ghara'ib Al-Muntaqah min Al-Mukhallisiyyat: 2/33 (958) - and from his path Ibn Asakir in Al-Tarikh: (46/290) - from Ahmad bin Bujayr, from Ali bin Nufayl, he said: Khalid bin Mukhlid Al-Qatwani told us, and Al-Mahamili in Al-Amali (narration of Ibn Mahdi): (336) - and from his path Salim Al-Razi in Awali Malik: 1/278 (181) - from Ahmad bin Ismail Al-Madani, and Al-Tahawi in Sharh Ma'ani Al-Athar: (3/265) from Yunus - and from his path Al-Jawhari in Musnad Al-Muwatta (210) - from Abdullah bin Wahb -: all of them: (Muhammad bin Idris Al-Shafi'i (1),",
    "foot_note": "1. It appeared in the printed versions of Al-Umm by Al-Shafi'i: \"Amr\". See: Bulaq 1st edition 1322 AH (4/2), Al-Najjar edition (4/72), and Dar Al-Wafa edition (5/148). - What I deduce is that there is a distortion in the chain followed by the book's editions, and that the correct version in Al-Shafi'i's narration is: \"Umar\"; for three reasons: First: Al-Shafi'i stated that what is in Malik's narration is: \"Umar\", and faulted him in it, in what Ibn Abi Hatim and Ibn Khuzayma narrated from Al-Muzani, that he said: I heard Al-Shafi'i say: (Malik misspelled Umar bin Uthman, and it is only: Amr bin Uthman). See: Adab Al-Shafi'i by Ibn Abi Hatim (p. 172), Bayan Khata' Man Akhta' 'ala Al-Shafi'i by Al-Bayhaqi: (p. 202), and Manaqib Al-Shafi'i by Al-Bayhaqi: (1/491). So it is unlikely that he stipulates it, then narrates it from him like the majority's narration on the correct version, while the Imams are in quasi-consensus that what is in Malik's narration is: \"Umar\". Second: Al-Shafi'i narrated the Hadith about two lines before narrating Malik's Hadith, from the path of Ibn Uyaynah from Al-Zuhri with it, and in it: \"Amr\", like the rest of the narrations of Al-Zuhri's companions, then he cited Malik's Hadith after it, so perhaps the printer thought they were with one chain so he drew it: \"Amr\" like its predecessor. Third: That the apparent in Al-Shafi'i's context for Malik's Hadith is only to explain the defect; evidenced by his narrating the Hadith from the path of Ibn Uyaynah and repeating it in Al-Umm in more than four places; unlike Malik's Hadith, he cited it once after Ibn Uyaynah's Hadith in the Book of Inheritance. And Allah knows best.",
    "book_id": "849",
    "new_page_number": 26
  },
  {
    "serial_number": "3197178",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 26,
    "volume_number": 1,
    "text": "and Khalid bin Mukhlid Al-Qatwani (1), and Abdullah bin Wahb (2), and Mus'ab bin Abdullah",
    "foot_note": "1. Khalid detailed his narration, saying in it: (from Umar bin Uthman and he did not say: Amr bin Uthman, he said: He is known in Medina and his house is there) End quote.\n2. Sources differed in naming the narrator in the chain in Ibn Wahb's narration on two types: First: That it is (Amr): Narrated by Al-Tahawi in Sharh Ma'ani Al-Athar: (3/265), and it is established in its explanation by Al-Ayni: (12/424). Second: That it is (Umar): Narrated by Al-Jawhari from the path of Yunus from Ibn Wahb, then he said: (H), then he cited the Hadith from the path of Al-Qa'nabi; both of them (Ibn Wahb, and Al-Qa'nabi) from Malik... and in it: (Umar), and what is known in Al-Qa'nabi's narration: (Umar). Ibn Abd al-Barr stated that what is in Ibn Wahb's narration: (Umar), where he narrated it once from Malik, from Al-Zuhri, and in it: (Umar), and once from Yunus, from Al-Zuhri, and in it: (Amr). Ibn Abd al-Barr said: (And Ibn Wahb did well in this Hadith; he narrated it from Yunus and Malik both, and said: Malik said: Umar, and Yunus said: Amr) End quote from Al-Tamhid: Morocco edition (9/162), and Markaz Hajar edition (13/472). And it is the correct one, and Allah knows best.",
    "book_id": "849",
    "new_page_number": 27
  },
  {
    "serial_number": "3197179",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 27,
    "volume_number": 1,
    "text": "Al-Zubayri, Muhammad bin Al-Hasan Al-Shaybani, Abdul Rahman bin Mahdi (1), Abdullah bin",
    "foot_note": "1. What is in Al-Musnad from the path of Ibn Mahdi is: (Umar), and this is what is established in the Al-Risala publication (21813), Al-Maknaz: (22228), and Alam Al-Kutub: (22157). Narrated from the path of Ibn Mahdi also: Ibn Al-Muzaffar Al-Bazzaz in Ghara'ib Malik: (62), and Al-Ala'i in Bughyat Al-Multamis: (p. 180), and in it: (Umar). What confirms it is what Ibn Al-Muzaffar Al-Bazzaz narrated in Ghara'ib Malik: (63) with his chain, from Yahya bin Ma'in, that he said: Abdul Rahman bin Mahdi said to me: Malik bin Anas said to me: (Do you think I don't know Umar from Amr? This is Umar's house, and this is Amr's house), I said to him: So how did he narrate to you? He said: He used to say: Umar End quote. This text is decisive in Ibn Mahdi's narration. Caution: Al-Jawhari narrated Ibn Ma'in's words in Musnad Al-Muwatta (200) - with the same chain as Ibn Al-Muzaffar - and in it: (I said: So how did Ma'n narrate to you? He said: He used to say: Umar) End quote. The editor of Atraf Al-Muwatta by Al-Dani (2/18) Dr. Rida Bu Shama concluded that the mention of Ma'n in Al-Jawhari is an addition and an error, and the correct version of the story is what is mentioned in Ibn Al-Muzaffar in Ghara'ib Malik. Ma'n is Ibn Isa Al-Qazzaz, one of the famous companions of Malik, and even if Ibn Mahdi did not have a direct narration from Malik naming his narrator: (Umar), as reported by Ahmad, Ibn Al-Muzaffar and Al-Ala'i; the possibility would remain that Ibn Mahdi descended in his narration and narrated it from Ma'n - who is one of his peers - correctly, so the result in this difference would be the correctness of what the editor of Al-Atraf went to. And Allah knows best. And it appeared in Atraf Al-Musnad by Ibn Hajar: (111) drawing it in the chain: (Amr), and he cited it in the Hadith of Amr bin Uthman from Usama, and it is an error.",
    "book_id": "849",
    "new_page_number": 28
  },
  {
    "serial_number": "3197180",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 28,
    "volume_number": 1,
    "text": "Maslama Al-Qa'nabi (1), and Ahmad bin Ismail Al-Madani Al-Sahmi (2) =",
    "foot_note": "1. This is what is established in the manuscript of Al-Muwatta narrated by Al-Qa'nabi and in the handwriting of Al-Jarahi (d. 828 AH) (A/91): (Umar), and from his path Al-Jawhari in Musnad Al-Muwatta: (210), and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: (36), and from the path of Abu Bakr Al-Shafi'i, Al-Mizzi narrated it in Tahdhib Al-Kamal: 4412 (22/154). Ibn Abd al-Barr stipulated it, saying: (And what is established from Malik is Umar bin Uthman, as Yahya narrated and Al-Qa'nabi followed him) End quote from Al-Tamhid: Morocco edition (9/160), and Markaz Hajar edition (13/471). It appeared in Tarikh Dimashq by Ibn Asakir: (46/286): that it is (Amr), perhaps it is a misspelling. And the correct in Al-Qa'nabi's narration: is that it is (Umar) due to what was previously mentioned. - And the Book of Inheritance is missing from the Dar Al-Gharb publication for Al-Qa'nabi's narration. * As for Al-Jarahi, he is: Abdul Rahim bin Abdul Karim bin Nasr Allah Al-Jarahi Al-Madani, studied under Al-Shihab Al-Nuwayri, Al-Zain Al-Iraqi and Al-Firuzabadi, and Al-Taqi bin Fahd and his sons studied under him, and he was mentioned for worship and righteousness, died in (828 AH). See: Al-Tuhfa Al-Latifa by Al-Sakhawi: 4/337 (2419).\n2. Sources differed in naming the narrator in the chain in Al-Sahmi's narration on two types: First: That it is (Umar), as narrated by Abdul Wahid bin Mahdi from Al-Mahamili in Al-Amali: (336), and narrated from the path of Ibn Mahdi by a group, namely:\n1.. Salim Al-Razi (d. 447 AH), in Awali Malik: 1/278 (308).\n2.. Abdul Khaliq bin Asad Al-Hanafi (d. 564 AH), in his Mu'jam: (181).\n3.. Shuhdah Al-Dinawariyyah (d. 574 AH), in her Mashyakha: (23) - Caution: It appeared in the print: (Amr), and the editor indicated it is established in the manuscript, and that Badr al-Din Ibn Jama'ah narrated it from the path of Shuhdah from her book in her handwriting and in it: (Umar). See Mashyakhat Qadi al-Qudah (1/181).\n4.. Al-Dhahabi (d. 748 AH), in Siyar A'lam Al-Nubala': (4/400); narrated from the path of Shuhdah Al-Dinawariyyah.\n5.. Al-Ala'i (d. 761 AH), in Bughyat Al-Multamis fi Suba'iyyat Hadith Al-Imam Malik bin Anas: (p. 180).\n6.. Ibn Tulun (d. 953 AH), in Al-Ahadith Al-Mi'ah: (87). Second: That it is (Amr), as narrated by Al-Khatib Al-Baghdadi in Awali Malik: 1/318 (341), Ibn Asakir in Tarikh Dimashq (46/290), and Ibn Al-Najjar in his appendix on Tarikh Baghdad: (2/157); all three from the path of Ibn Mahdi naming him: (Amr). The closer to correct in Al-Sahmi's narration is the first, as the printed Al-Amali and a number of sources that narrated the Hadith from the path of Ibn Mahdi agreed on naming him: (Umar), and Allah knows best.",
    "book_id": "849",
    "new_page_number": 29
  },
  {
    "serial_number": "3197181",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 29,
    "volume_number": 1,
    "text": "They narrated it from Malik, from Al-Zuhri, from Ali bin Al-Hussein, from Umar bin Uthman, from Usama bin Zaid, with it, raised. This is the correct version of what is narrated from Malik, and his companions mentioned earlier in the way narrated it from him, and agreeing with the stipulation of the Imams that Malik narrated it in this manner, and that he differed in it from the rest of Al-Zuhri's companions.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 30
  },
  {
    "serial_number": "3197182",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 30,
    "volume_number": 1,
    "text": "• And Malik was followed in it by: Abu Uwais Al-Madani (1): Yahya bin Muhammad bin Yahya Al-Dhuhli said: It was said (to Abu Uwais) (2): They say: Amr bin Uthman? He said: «No, he is Umar bin Uthman, we know better; this is his house», and he mentioned this following the Hadith: «A Muslim does not inherit from a disbeliever» End quote. I did not find his Hadith with a chain, and Ali bin Al-Madini and Al-Bazzar declared it defective, and stated that the hearing of Abu Uwais and Malik is one from Al-Zuhri (3).",
    "foot_note": "1. He is Abdullah bin Abdullah bin Uwais, Abu Uwais Al-Madani Al-Asbahi, father of Ismail bin Abi Uwais, and son-in-law of Imam Malik through his sister. Ahmad said: (There is no harm in him), or said: (Trustworthy), and said: (Salih), and Ibn Ma'in said: (Weak in Hadith), and Al-Fallas said: (There is weakness in him, and he is among them from the people of truthfulness), and Abu Dawood said: (Salih al-Hadith), and Yaqub bin Shaybah said: (Saduq, and Salih al-Hadith, and to weakness is what he is), and Al-Nasa'i said: (Abu Uwais is weak, and his son Ismail is weaker than him), and said: (Not strong), Muslim and the Four narrated from him. See: Su'alat Abi Dawood: (203), Al-Sunan Al-Kubra by Al-Nasa'i: (7044), Al-Du'afa wa Al-Matrukin by Al-Nasa'i: (674), and Tarikh Madinat Al-Salam: (11/173).\n2. Ibn Asakir narrated the story in Tarikh Dimashq: (46/290), and Al-Mizzi in Tahdhib Al-Kamal (22/155). In both sources his naming appeared: (Ibn Abi Uwais!), and the correct is what is established, for he is the one who agreed with Malik, and Ali bin Al-Madini and Al-Bazzar stated his following of Malik, and the Imams' declaration that his hearing from Al-Zuhri is like Malik's hearing appeared, unlike Ibn Abi Uwais, for Abu Hatim Al-Razi reported from him his defecting of his maternal uncle Imam Malik's Hadith, and it has preceded.\n3. Ahmad bin Hanbal said: (They claimed that the hearing of Abu Uwais, and the hearing of Malik, were one thing) End quote from Su'alat Abi Dawood to Imam Ahmad: (203), and Al-Barqani reported from Al-Daraqutni that he said: (His hearing with Malik from Al-Zuhri, I said: How is his Hadith from Al-Zuhri? He said: In some of it there is something) End quote from Tarikh Madinat Al-Salam: (11/173), and among those who stated it are Ali bin Al-Madini and Al-Bazzar, and their statement will come in the context of their defecting of Malik's narration, and their stipulation that their hearing from Al-Zuhri is one, does not mean that the error is from Ibn Shihab, rather the correct view - and Allah knows best - is that Abu Uwais followed Malik in the illusion in his chain.",
    "book_id": "849",
    "new_page_number": 31
  },
  {
    "serial_number": "3197183",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 31,
    "volume_number": 1,
    "text": "The Imams' statements regarding Malik's error in the chain of this Hadith:\nA large group of critical Imams stated Malik's error in naming his narrator, and some of them are his peers and companions; yet he remained firm on his saying and said: «This is his house», and did not retract it (1). And following",
    "foot_note": "1. Abu Al-Abbas Al-Dani (d. 532 AH) went far and attributed to Malik a retraction to the correct view in naming his narrator and agreeing with the majority, saying: (Then he retracted later and said: (Amr); he followed the group, thus it was established in Al-Muwatta in the narration of Yahya bin Yahya our companion, and Ibn Al-Qasim, and their hearing is late) End quote from Al-Ima': (2/19). Since Malik's retraction in naming his narrator was not transmitted, and it contradicts the statement of his contemporary Imams emphasizing that in his narration is: (Umar), among them Al-Shafi'i and Ibn Mahdi and others, and if his retraction were established, it would have been transmitted, due to the availability of motives usually in such an issue. What appears from Al-Dani's speech is that it is a deduction from the narrations of Ibn Al-Qasim and Yahya, being late in taking. The succession of Imams in clarifying Malik's error with their lack of transmitting his retraction indicates its negation. And the closer view is that it is an error from Ibn Al-Qasim and Yahya, evidenced by the stipulation of Imams - like Ibn Abi Asim, Al-Tirmidhi, Al-Nasa'i, Al-Daraqutni, Al-Jawhari, Ibn Abd al-Barr and others - that the correct in Malik's narration is: (Umar). I say: Al-Laythi's narration in this manner is from the omissions of the book (Al-Tatabbu' li-Awham Yahya bin Yahya Al-Laythi fi Riwayatihi lil-Muwatta) issued recently, which was written and edited by the virtuous Sheikh/ Abdul Salam Al-Shuway'ir, may Allah reward him well, and it is among the serious distinguished researches rare in our time.",
    "book_id": "849",
    "new_page_number": 32
  },
  {
    "serial_number": "3197184",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 32,
    "volume_number": 1,
    "text": "is a presentation of their sayings:\n1. Yahya bin Saeed Al-Qattan (d. 198 AH): Ibn Abi Khaythama said: «And it was in the book of Ali bin Al-Madini: I heard Yahya bin Saeed say: Malik said in the Hadith: 'A disbeliever does not inherit from a Muslim' -: 'Ibn Shihab from Ali bin Hussein, from Umar bin Uthman', and Yahya said: So I said to him: Amr bin Uthman? But he refused to retract, and said: Uthman had a son called: Umar, and this is his house» (1).\n2. Sufyan bin Uyaynah (d. 198 AH): Ibn Abd al-Barr said: «And Ali bin Al-Madini said, from Sufyan bin Uyaynah: That it was said to him: Malik says in the Hadith: 'A Muslim does not inherit from a disbeliever' -: 'Umar bin Uthman', so Sufyan said: I heard it from Al-Zuhri such and such times, and checked it from him, and he did not say except: Amr bin Uthman» (2).\n3. Muhammad bin Idris Al-Shafi'i (d. 204 AH): Al-Muzani said: «I heard Al-Shafi'i say: Malik misspelt in 'Umar bin Uthman', and it is only:",
    "foot_note": "1. Al-Tarikh Al-Kabir by Ibn Abi Khaythama (Third Volume): 2/346 (3290), and Ibn Asakir in Tarikh Dimashq: (46/291).\n2. Al-Tamhid: (9/160).",
    "book_id": "849",
    "new_page_number": 33
  },
  {
    "serial_number": "3197185",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 33,
    "volume_number": 1,
    "text": "'Amr bin Uthman'». Ibn Abi Hatim said: «So I mentioned that to my father and he said: Al-Shafi'i told the truth, and it is as he said» (1).\n4. Ismail Ibn Abi Uwais (d. 226 AH): He said: «Malik bin Anas erred in the name of 'Amr bin Uthman', so he said: 'Umar bin Uthman', and it is only: 'Amr bin Uthman', and he pointed with his hand to a house, and said: 'This is the house of Umar bin Uthman from whom Ali bin Hussein narrated'» (2).\n5. Ali bin Al-Madini (d. 234 AH): He said: «The Hadith of Usama from the Prophet, peace be upon him: 'A Muslim does not inherit from a disbeliever', Al-Zuhri narrated it, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama. It was narrated from Al-Zuhri by: Ibn Uyaynah, Malik, Hushaym, Ibn Al-Had, Yunus bin Yazid, and Ma'mar. Malik differed from them and said: 'From Umar bin Uthman'. The hearing of Malik and Abu Uwais is one, they are not used as proof against these, and those who",
    "foot_note": "1. Narrated from Al-Muzani by Ibn Abi Hatim in Adab Al-Shafi'i: (p. 172), and Ibn Khuzayma narrated it from him similarly, as in Al-Bayhaqi in Bayan Khata' Man Akhta' 'ala Al-Shafi'i: (p. 202), and Manaqib Al-Shafi'i: (1/491).\n2. Narrated by Ibn Abi Hatim in Al-Jarh wa Al-Ta'dil: (6/248) from his father who said: I heard Ismail bin Abi Uwais say...\nand he cited it. I say: Ismail is the nephew of Imam Malik and his son-in-law. See: Al-Ta'dil wa Al-Tajrih by Abu Al-Walid Al-Baji (1/370)",
    "book_id": "849",
    "new_page_number": 34
  },
  {
    "serial_number": "3197186",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 34,
    "volume_number": 1,
    "text": "said: 'From Amr bin Uthman' are more established, although Malik was established, and he used to say: 'This is the house of Umar bin Uthman'» (1).\n6. Al-Bukhari (d. 256 AH): He said: «And Malik said: 'Umar', and it is an illusion (Wahm)» (2).\n7. Muslim (d. 261 AH): Abu Al-Abbas Al-Dani transmitted from Muslim that he said: «They were both sons of Uthman, Umar and Amr, except that this Hadith is from Amr, not Umar» (3). Ibn Al-Salah said: «Muslim - the author of Al-Sahih - mentioned in the book 'Al-Tamyiz' that everyone who narrated it from the companions of Al-Zuhri said in it: 'Amr bin Uthman'; meaning: with Fatha on the Ayn. And he mentioned that Malik used to point with his hand to the house of Umar bin Uthman, as if he knew they differed from him, and Amr and Umar are both sons of Uthman, except that this Hadith is only from Amr - with Fatha on the Ayn - and Muslim and others judged Malik with illusion in it, and Allah knows best» (4).",
    "foot_note": "1. Tarikh Dimashq by Ibn Asakir: (46/292), and in the print (Uyaynah) was misspelled to: (Anbasa).\n2. Al-Tarikh Al-Kabir by Al-Bukhari: (6/354).\n3. Al-Ima' ila Atraf Ahadith Kitab Al-Muwatta by Abu Al-Abbas Al-Dani: (2/19).\n4. Ulum Al-Hadith by Ibn Al-Salah: (p. 82), and from him Al-Sakhawi in Fath Al-Mughith: (2/15), and it is not in the printed Al-Tamyiz.",
    "book_id": "849",
    "new_page_number": 35
  },
  {
    "serial_number": "3197187",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 35,
    "volume_number": 1,
    "text": "8. Abu Zur'ah Al-Razi (d. 264 AH): Ibn Abi Hatim said: «Abu Zur'ah was asked about Malik's Hadith, from Al-Zuhri... the Hadith? Abu Zur'ah said: The narrators say: Amr, and Malik says: Umar bin Uthman» (1).\n9. Abu Hatim Al-Razi (d. 277 AH): His agreement with Al-Shafi'i preceded.\n10. Al-Tirmidhi (d. 279 AH): He said: «And Malik's Hadith is an illusion, Malik had an illusion in it... And Amr bin Uthman bin Affan is famous among Uthman's children, and Umar bin Uthman is not known» (2).\n11. Ibn Abi Khaythama Ahmad bin Zuhair bin Harb (d. 279 AH): He said: «Malik bin Anas differed from people in this; he said: From Umar bin Uthman» (3).\n12. Abu Bakr Al-Bazzar (d. 292 AH): He said: «This Hadith was narrated by Ibn Uyaynah, Ma'mar, and a group, from Al-Zuhri, from Ali bin",
    "foot_note": "1. 'Ilal Al-Hadith: (1635), and Ibn Abi Hatim commented on it saying: (As for the narrators who said: Amr bin Uthman, they are Sufyan bin Uyaynah, and Yunus bin Yazid, from Al-Zuhri) End quote.\n2. Al-Jami' Al-Kabir: (2107).\n3. Al-Tarikh Al-Kabir by him (Second Volume): 2/906 (3843).",
    "book_id": "849",
    "new_page_number": 36
  },
  {
    "serial_number": "3197188",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 36,
    "volume_number": 1,
    "text": "Hussein, from Amr bin Uthman, from Usama, so they agreed on the name Amr bin Uthman; except Malik bin Anas, he narrated it from Al-Zuhri, from Ali bin Hussein, from Umar bin Uthman, from Usama, so they see that he erred in that, although he - meaning: Malik - stopped and said: 'This is Amr's house, and this is Umar's house', and pointed to them both. As for narration, we do not know anyone who followed him on his narration; except if it were Abu Uwais, for his hearing from Al-Zuhri is similar to Malik's hearing» (1).\n13. Al-Nasa'i (d. 303 AH): He said: «The correct from Malik's Hadith: Umar bin Uthman, and we do not know that any of Al-Zuhri's companions followed him on that, and it was said to him so he remained firm on it, and said: This is his house» End quote (2). And he cited the Hadith from the path of five of Al-Zuhri's companions; all of them narrated it from him naming his narrator \"Amr\".\n14. Ibn Al-Hadhdha' (d. 416 AH) - Sheikh of Ibn Abd al-Barr -: He said in the biography of Amr bin Uthman: «It was differed upon from Malik, so the correct from him is: 'Umar bin Uthman', and most people say: 'Amr', and it is the correct, and it is more famous in narration. As for 'Umar bin Uthman', the Hadith is rarely narrated from him» (3).",
    "foot_note": "1. Al-Bahr Al-Zakkhar: (2581).\n2. Al-Sunan Al-Kubra (6549).\n3. Al-Ta'rif bi-man dhukira fi Al-Muwatta min Al-Nisa' wa Al-Rijal by Ibn Al-Hadhdha': 3/464 (434).",
    "book_id": "849",
    "new_page_number": 37
  },
  {
    "serial_number": "3197189",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 37,
    "volume_number": 1,
    "text": "15. Ibn Abd al-Barr (d. 463 AH): He said: «So the companions of Ibn Shihab, other than Malik, say in this Hadith: From Ali bin Hussein, from Amr bin Uthman, from Usama bin Zaid. And Malik says in it: From Ibn Shihab, from Ali bin Hussein, from Umar bin Uthman, from Usama. Al-Shafi'i and Yahya bin Saeed Al-Qattan stopped him on that, so he said: 'It is Umar', and refused to retract, and said: 'Uthman had a son called: Umar and this is his house'. Malik is hardly compared to anyone else in memorization and precision, but error no one is free from, and the people of Hadith refuse that there be in this chain anything but 'Amr' with Waw. Ali bin Al-Madini said, from Sufyan bin Uyaynah: That it was said to him: Malik says in the Hadith: 'A Muslim does not inherit from a disbeliever' -: 'Umar bin Uthman', so Sufyan said: I heard it from Al-Zuhri such and such times, and checked it from him, and he did not say except: 'Amr bin Uthman'». Ibn Abd al-Barr said: «Among those who followed Ibn Uyaynah on his saying: 'Amr bin Uthman' -: Ma'mar, Ibn Jurayj, Uqayl, Yunus bin Yazid, Shu'aib bin Abi Hamza, and Al-Awza'i, and the group is more worthy to be submitted to» (1). And he said: «Thus Malik says: 'Umar', and the rest of Ibn Shihab's narrators say: 'Amr bin Uthman'» (2).",
    "foot_note": "1. Al-Tamhid: Morocco ed. (9/160), and Dar Hajar ed. (13/471).\n2. Al-Taqassi lima fi Al-Muwatta min Hadith Al-Nabi sallallahu alayhi wa sallam by Ibn Abd al-Barr: (p. 156) Al-Wa'y Al-Islami ed., previously printed under the name (Tajrid Al-Muwatta).",
    "book_id": "849",
    "new_page_number": 38
  },
  {
    "serial_number": "3197190",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 38,
    "volume_number": 1,
    "text": "16. Abu Al-Abbas Al-Dani (d. 532 AH): He said: «Malik used to say in the chain of this Hadith: 'Umar bin Uthman', and it is the preserved from him. The rest of Al-Zuhri's narrators said: 'Amr' lightened (without Waw in pronunciation but distinct). Malik was reviewed on it so he said: 'We know him better and this is his house'» End quote (1).",
    "foot_note": "1. Al-Ima' ila Atraf Ahadith Kitab Al-Muwatta: (2/18).",
    "book_id": "849",
    "new_page_number": 39
  },
  {
    "serial_number": "3197191",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 39,
    "volume_number": 1,
    "text": "The Second Way (From Malik)\n* A group of his companions narrated it from him naming his narrator: \"Amr\", like the narration of the majority of Al-Zuhri's companions. It was narrated by: Abdullah bin Al-Mubarak in his Musnad: (163) - and from his path Al-Nasa'i in Al-Sunan Al-Kubra (6547), and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: (39) - and Abu Mus'ab Al-Zuhri in his Muwatta: (3061) - and from his path Al-Ala'i in Bughyat Al-Multamis: (p. 181) - and Al-Nasa'i in Al-Sunan Al-Kubra: (6548); from Ahmad bin Sulaiman Al-Ruhawi, from Zaid bin Al-Hubab, H, and in: (6549) from Ahmad bin Sulaiman Al-Ruhawi, from Muawiyah bin Hisham, and Yahya bin Yahya Al-Laythi in his Muwatta: (2/159), and Al-Bukhari in Al-Tarikh Al-Kabir: (6/353) - suspended - from Ibrahim bin Tahman, and Al-Nasa'i in Al-Kubra: (6546) from Muhammad bin Salamah Al-Masri, from Abdul Rahman bin Al-Qasim; and it is in his Muwatta printed with the summary of Abu Al-Hasan Al-Qabisi: (65) = all of them: (Abdullah bin Al-Mubarak, Abu Mus'ab Al-Zuhri, Zaid bin Al-Hubab, Muawiyah bin Hisham, Yahya bin Yahya Al-Laythi (1), Ibrahim bin Tahman, and Abdul Rahman bin",
    "foot_note": "1. Sources differed in naming the narrator in Al-Laythi's narration on two types: First: That it is (Amr): Stated by Al-Jawhari and Abu Umar Al-Qurtubi known as (Ibn Al-Jabbab) author of Musnad Malik and Abu Ali Al-Jayyani. Al-Jayyani said: (And the known in the narration of Yahya bin Yahya our companion: Amr... And likewise Ahmad bin Khalid transmitted it in his Musnad, and his transmission is sufficient) End quote from Atraf Al-Muwatta by Al-Dani: (2/21), and it is the established in the manuscript of Al-Muwatta (A/77) 130 - by Yahya's narration copied in the year (667 AH) from a branch of Qadi Iyad's original, and preserved in Allal Al-Fasi library, and likewise in the edition of Al-Muwatta edited by Dr. Muhammad Mustafa Al-A'zami: 1891 (3/741), and the edition of the Supreme Scientific Council in Casablanca, Morocco (1/541). Second: That it is (Umar): Stated by Ibn Abd al-Barr saying: (And the established from Malik: Umar bin Uthman, as Yahya narrated and Al-Qa'nabi followed him) End quote from Al-Tamhid: Morocco ed. (9/160), and Markaz Hajar ed. (13/471), and it is the established in Al-Muwatta Al-Babi Al-Halabi ed.: (2/159), and Dar Al-Gharb ed. (1475). The first is more likely to be correct, and Abu Al-Abbas Al-Dani (2/21) tracked Ibn Abd al-Barr on it and considered him mistaken. And Allah knows best.",
    "book_id": "849",
    "new_page_number": 40
  },
  {
    "serial_number": "3197192",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 40,
    "volume_number": 1,
    "text": "Al-Qasim (1) =",
    "foot_note": "1. Sources differed in naming the narrator in Ibn Al-Qasim's narration from Malik on two types: First: That it is (Amr): Stated by Al-Jawhari, Ibn Abd al-Barr and Al-Dani, and it is the established in the two prints of Al-Qabisi's summary of Ibn Al-Qasim's Muwatta. Al-Jawhari said: (And in the narration of Ibn Al-Qasim, and Yahya bin Yahya Al-Andalusi: Amr bin Uthman) End quote from Musnad Al-Muwatta: (200). Ibn Abd al-Barr said: (And the established from Malik: Umar bin Uthman, as Yahya narrated, and Al-Qa'nabi followed him and most narrators, and Ibn Al-Qasim said in it: From Amr bin Uthman) End quote from Al-Tamhid: Morocco ed. (9/160), and Markaz Hajar ed. (13/471), see: Al-Ima' ila Atraf Ahadith Al-Muwatta by Abu Al-Abbas Al-Dani: (2/19). It is the established in the print of Abu Al-Hasan Al-Qabisi's summary of Ibn Al-Qasim's Muwatta: (65) Dar Al-Shorouk ed. and Al-Ilmiyyah ed., and likewise in the Khalidiyyah Library copy of Al-Kubra by Al-Nasa'i: (Amr). Second: That it is (Umar): Stated by Al-Mizzi, where he said in Al-Tuhfa: (And in Ibn Al-Qasim's Hadith alone: From Umar bin Uthman, and in the Hadith of the rest: From Amr bin Uthman) End quote from Al-Dar Al-Salafiyyah ed.: 1/55 (113), and Dar Al-Gharb ed.: 1/175 (113), and likewise it came in (Murad Molla) copy of Al-Sunan Al-Kubra. Perhaps the correct in Ibn Al-Qasim's Hadith is the first.",
    "book_id": "849",
    "new_page_number": 41
  },
  {
    "serial_number": "3197193",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 41,
    "volume_number": 1,
    "text": "Narrated it from: Malik, from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, with it, raised (1).",
    "foot_note": "1. Amr bin Marzuq differed from them in its text, as Ibn Abd al-Barr narrated in Al-Tamhid: (9/172) from Khalaf bin Qasim, from Ahmad bin Ubaidullah, from Muhammad bin Bakr bin Ziyad bin Al-Ala Al-Mahrani, he said: Amr bin Marzuq told us, Malik informed us, from Al-Zuhri, from Ali bin Hussein, from Amr bin Uthman, from Usama bin Zaid, that the Prophet, peace be upon him, said: (People of two different religions do not inherit from each other) End quote. It is a Shadh (irregular) narration, Ibn Marzuq was unique in its text from Malik, and is not followed, and the rest of Malik's companions are contrary to him. The Imams turning away from it and lack of care for it indicates defectiveness. Ibn Abd al-Barr said: (That is not correct from Malik). As for Amr bin Marzuq, he is Al-Bahili: Ahmad, Abu Hatim, Ibn Sa'd and Ibn Hibban declared him trustworthy. Ahmad said: (Trustworthy, trusted, we searched for what was said about him, and found no basis for it). Ali bin Al-Madini said: (Leave the Hadith of the two Fahds and the two Amrs... and mentioned among them Amr bin Marzuq). Imam Ahmad commented on Ibn Al-Madini's statement saying: (Amr bin Marzuq, a righteous man, I don't know what Ali says). Al-Qawariri transmitted from Al-Qattan that he does not approve of him in Hadith. Ibn Hibban said: (Perhaps he erred). Al-Daraqutni said: (Truthful, many illusions). Al-Bukhari narrated two Hadiths for him: one coupled with another, and the other he cited him as a follower. See: Al-Tabaqat Al-Kubra: (9/306), Al-Jarh wa Al-Ta'dil by Ibn Abi Hatim: (6/264), Al-Thiqat by Ibn Hibban: (8/484), Al-Du'afa by Al-Uqayli: (4/342), Su'alat Al-Hakim to Al-Daraqutni: (423), and Huda Al-Sari by Ibn Hajar: (p. 432).",
    "book_id": "849",
    "new_page_number": 42
  },
  {
    "serial_number": "3197194",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 42,
    "volume_number": 1,
    "text": "The companions of this way narrated it from Malik naming him: \"Amr\" agreeing with the known path narrated by the majority of Al-Zuhri's companions. The correct in Malik's narration is: That it is \"Umar bin Uthman\", and not \"Amr\". The companions of this way erred by narrating it from Malik in this manner; for the great ones of his companions narrated it from him correctly by naming his narrator \"Umar\" - as previously mentioned in the first way - and it is the famous in narration from Malik.\n• And the Imams are in quasi-agreement that the correct narration from Malik is: \"Umar\", and among those who stipulated it:\n1/ Al-Tirmidhi, he said in Al-Sunan: «Some of them narrated it from Malik and said: 'From Amr bin Uthman', and most of Malik's companions said: From Malik, from Umar bin Uthman».\n2/ And Al-Nasa'i, he said following it: «And the correct from Malik's Hadith: Umar bin Uthman».\n3/ And Al-Daraqutni, he said: «The correct from Malik: Umar, like this» (1), and he said in Ahadith",
    "foot_note": "1. I did not find Al-Daraqutni's saying in the printed of his works, and it appeared in the margin of one of the copies of Al-Muwatta as follows: (Al-Daraqutni: Abu Bakr Al-Naysaburi told us, Yusuf bin Saeed bin Muslim told us, Ishaq bin Isa Al-Tabba' told us, Malik told us: I know him better, he was Umar bin Uthman... And he who named him Amr erred. Al-Daraqutni said: The correct from Malik: Umar, like this) End quote transferred by the editor of Al-Muwatta Dr. Muhammad Mustafa Al-A'zami from the margin of the Muwatta manuscript preserved in the General Treasury of Rabat, and expressed as the original (3/741).",
    "book_id": "849",
    "new_page_number": 43
  },
  {
    "serial_number": "3197195",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 43,
    "volume_number": 1,
    "text": "Al-Muwatta: «Ali bin Al-Hussein is one, from Umar bin Uthman from Usama: 'A Muslim does not inherit from a disbeliever'» (1).\n4/ And Ibn Abd al-Barr, he said: «And the established from Malik: Umar bin Uthman». And others (2).\n* Malik was reviewed on it but refused to retract, and among those who reviewed him:\n1/ Yahya bin Saeed Al-Qattan (d. 198 AH), he said: «I said to Malik: It is only Amr bin Uthman, but he refused to retract, and said: Uthman had a son called: Umar, this is his house» (3).\n2/ And Abdul Rahman bin Mahdi (d. 198 AH), reviewed Malik on it so Malik said to him: «Do you think I don't know Umar from Amr? This is Umar's house and this is Amr's house» (4).\n3/ Al-Shafi'i (d. 204 AH): Ibn Abd al-Barr related it from him (5).",
    "foot_note": "1. Ahadith Al-Muwatta wa Dhikr Ittifaq Al-Ruwat 'an Malik by Al-Daraqutni (p. 21).\n2. Al-Tamhid: Morocco ed. (9/160), and Dar Hajar ed. (13/471).\n3. Al-Jarh wa Al-Ta'dil by Ibn Abi Hatim: (6/248).\n4. Al-Tamhid: Morocco ed. (9/160), and Dar Hajar ed. (13/471).\n5. Previous reference.",
    "book_id": "849",
    "new_page_number": 44
  },
  {
    "serial_number": "3197196",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 44,
    "volume_number": 1,
    "text": "And it was transmitted from Malik that he said: «I know him, Umar bin Uthman was my neighbor, and he who named him Amr has erred» (1).",
    "foot_note": "1. Narrated by Al-Daraqutni with his chain to Ishaq bin Isa Al-Tabba' (d. 215 AH); as appeared in the margin of the Muwatta manuscript which Dr. Al-A'zami pointed to previously, and cited in the biography of (Umar bin Uthman) by Mughlatay in Al-Ikmal: (10/99) quoting from the book Ahadith Al-Muwatta by Al-Daraqutni, and I did not find it in the printed.",
    "book_id": "849",
    "new_page_number": 45
  },
  {
    "serial_number": "3197197",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 45,
    "volume_number": 1,
    "text": "The Third Way (From Malik)\n* Yahya bin Bukair narrated it with doubt: where he narrated it in his Muwatta: Istanbul University copy (A/216) and Sulaymaniyah copy (A/94) - and Ala al-Din Mughlatay pointed to his narration in Ikmal Tahdhib Al-Kamal (10/99) - with the wording: Malik told me, from Ibn Shihab, from Ali bin Al-Hussein, from Amr or Umar bin Uthman bin Affan - Ibn Bukair doubted - from Usama bin Zaid, that the Messenger of Allah, peace be upon him, said: «A Muslim does not inherit from a disbeliever».\n- It was stated that the doubt in it is from its narrator; who is Yahya bin Bukair.\nWith the completion of this way ends the listing of differences upon Malik bin Anas. It has become clear: That the correct in his Hadith is by naming his narrator: \"Umar\". This is the famous in his narration, and that whoever narrated it from him naming his narrator: \"Amr\" - agreeing with the narration of Al-Zuhri's companions - has differed in it from the correct narrated from Malik through the correct reality of narration.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 46
  },
  {
    "serial_number": "3197198",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Third Way (From Al-Zuhri)\n* Abdullah bin Isa (1) narrated it from him, he did not mention \"Umar\" nor \"Amr\" in his chain:\nIt was narrated by: Al-Darimi in his Musnad: (3043) from Muhammad bin Yusuf, Al-Nasa'i in Al-Kubra: (6545) from Ahmad bin Harb, from Qasim bin Yazid, Ibn Al-A'rabi in his Mu'jam: (1383) from Ibn Affan, from Muawiyah bin Hisham, and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: 1/90 (40), and Al-Tabarani in Al-Awsat: (5013); both narrated it from Muhammad bin Al-Nadr Al-Azdi, from Muawiyah bin Amr, from Za'idah; the four of them (Muhammad bin Yusuf, Qasim bin Yazid, Muawiyah bin Hisham, and Za'idah) narrated it from Sufyan Al-Thawri, and Al-Nasa'i in Al-Kubra: (6544) from Muhammad bin Bashar, from Muhammad bin Ja'far, and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: 1/90 (41) from Abdullah bin Muhammad bin Yasin, from Nasr bin",
    "foot_note": "1. Abdullah bin Isa bin Abdul Rahman bin Abi Layla: Ahmad bin Hanbal, Yahya bin Ma'in, Ibn Hibban and Al-Ijli declared him trustworthy. Ali bin Al-Madini said: (He is Munkar to me). Abu Hatim said: (Salih). Al-Nasa'i said: (Thiqah Thabt - Trustworthy Firm). Al-Hakim said: (Among the most trustworthy of Al Abi Layla). The Six narrated from him. See: Su'alat Abi Dawood li Al-Imam Ahmad: (357), Al-Jarh wa Al-Ta'dil by Ibn Abi Hatim: (5/126), Al-Thiqat by Ibn Hibban: (7/32), Tarikh Al-Darimi: (565), Ma'rifat Al-Thiqat by Al-Ijli: 2/50 (945), Su'alat Al-Sijzi li Al-Hakim: (114), Tahdhib Al-Kamal: (2/401), and Al-Mughni fi Al-Du'afa by Al-Dhahabi: 1/350 (3293).",
    "book_id": "849",
    "new_page_number": 47
  },
  {
    "serial_number": "3197199",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 47,
    "volume_number": 1,
    "text": "Ali from his father; both (Muhammad bin Ja'far, and Ali bin Nasr Al-Jahdami) narrated it from Shu'ba bin Al-Hajjaj =\nBoth: (Sufyan Al-Thawri, and Shu'ba bin Al-Hajjaj) = narrated it from Abdullah bin Isa, from Al-Zuhri, from Ali bin Al-Hussein, from Usama bin Zaid, with it, raised. Ibn Isa differed in it from the rest of Al-Zuhri's senior companions, as he fell short in his chain and did not mention \"Amr bin Uthman\" in it.\n* Explanation of Al-Nasa'i's behavior in his context for this narration:\nAmong those who narrated Abdullah bin Isa's Hadith: Imam Al-Nasa'i in his Sunan Al-Kubra, and he declared it defective by way of hinting, where he cited his narration at the beginning of the chapter - before the narration of Malik, and the rest of Al-Zuhri's senior companions; with their mentioning of the intermediary in its chain - and he cited his Hadith from the path of two majestic Imams from him, who are (Shu'ba, and Sufyan Al-Thawri) to show through this behavior the following:\n1. That the Hadith with this context is his Hadith; and that the responsibility in it is on him, not on those below him (1).",
    "foot_note": "1. This behavior indicates the error of the occurrence of the chain of Abdullah bin Isa's Hadith with mentioning (Amr) in it like the group's narration: As this came in the printed Ithaf Al-Mahara: (177) where Al-Darimi's chain was cited making Ibn Isa's narration like the narration of Ma'mar and Ibn Uyaynah and the editor did not comment on it. And what is established in the manuscript of Musnad Al-Darimi: Murad Molla copy (A/238), and likewise in its publications: Sayyid Abdullah Hashim Yamani ed.: 2/268 (3004), Dar Al-Mughni ed.: (3043), Al-Bashair ed. (3259), and Al-Ta'sil ed.: (3029) by omitting the intermediary in its chain and it is the correct. Abu Bakr Al-Shafi'i said: (And he did not mention in the chain Amr bin Uthman) End quote from his Al-Ghilaniyyat: (40). And Ibn Asakir said: (Abdullah bin Isa bin Abdul Rahman bin Abi Layla narrated it from Al-Zuhri and dropped from it the mention of Amr bin Uthman) End quote from Tarikh Dimashq: (46/287).",
    "book_id": "849",
    "new_page_number": 48
  },
  {
    "serial_number": "3197200",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 48,
    "volume_number": 1,
    "text": "2. That he presented its mention before the two faces of difference on Al-Zuhri - which are Malik's Hadith and the Hadith of the rest of Al-Zuhri's companions - to show its anomaly (Shudhudh), and that the rest of Al-Zuhri's companions did not differ in its chain in this manner.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 49
  },
  {
    "serial_number": "3197201",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 49,
    "volume_number": 1,
    "text": "The Fourth Way (From Al-Zuhri)\n* Hushaym bin Bashir narrated it with the wording: \"People of two different religions do not inherit from each other\", and his text contradicted the group's Hadith:\nIt was differed in Hushaym's Hadith on two ways:\nThe First Way: Mas'ud bin Juwayriyah narrated it, from Hushaym, from Al-Zuhri, from Ali bin Hussein and Aban bin Uthman, from Usama bin Zaid, who said: The Messenger of Allah, peace be upon him, said: \"People of two different religions do not inherit from each other\". Al-Nasa'i narrated it in Al-Sunan Al-Kubra (6555), and said in it following the mention of Aban: \"Thus he said\", and Al-Mizzi quoted him in Al-Tuhfa saying: \"This is an error\".\nThe Second Way: The rest of Hushaym's companions narrated it without mentioning Aban in its chain, with the wording: \"People of two religions do not inherit from each other\". Their Hadith was narrated by: Al-Tirmidhi (1) in his Jami': (2107), and Al-Nasa'i in Al-Kubra:",
    "foot_note": "1. Al-Tirmidhi narrated it and cited it with the chain of Ibn Uyaynah's Hadith with the wording: (A Muslim does not inherit from a disbeliever). Al-Mizzi said: (Thus Al-Tirmidhi narrated it from Ali bin Hujr, from Hushaym, with the wording of Sufyan bin Uyaynah - he carried the Hadith of one of them on the Hadith of the other - and the preserved from Ali bin Hujr is Al-Nasa'i's wording from him as previously noted) End quote from Tuhfat Al-Ashraf: (113).",
    "book_id": "849",
    "new_page_number": 50
  },
  {
    "serial_number": "3197202",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 50,
    "volume_number": 1,
    "text": "(6556); both from Ali bin Hujr, Ahmad bin Hanbal in Al-Ilal - narration of his son Abdullah -: (2202), Saeed bin Mansur in his Sunan: (136), Al-Tahawi in Sharh Ma'ani Al-Athar: (3/266) from Rabi' the Mu'adhin, from Asad bin Musa, Al-Tabarani in Al-Mu'jam Al-Kabir: 1/163 (391) from Abu Husayn Al-Qadi, from Yahya Al-Himmani, Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: 1/88 (38), and Ibn Abd al-Barr in Al-Tamhid: (9/171) from Abdul Warith bin Sufyan, from Qasim bin Asbagh; both (Abu Bakr Al-Shafi'i, and Qasim bin Asbagh) narrated it from Muhammad bin Ismail Al-Tirmidhi, from Al-Hasan bin Sawwar, H, and Abu Bakr Al-Shafi'i in Al-Ghilaniyyat: 1/88 (38) from Abu Qabisa bin Al-Qa'qa', from Ibrahim bin Abdullah = all of them: (Ali bin Hujr, Saeed bin Mansur, Asad bin Musa, Yahya Al-Himmani, Ahmad bin Hanbal, Al-Hasan bin Sawwar, and Ibrahim bin Abdullah) = narrated it from: Hushaym bin Bashir, from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, who said: The Messenger of Allah, peace be upon him, said: \"People of two religions do not inherit from each other\".\nIt is a Munkar (denounced) Hadith, Hushaym bin Bashir was alone in it, and he contradicted the rest of Al-Zuhri's companions in its text and was not followed in it. He is famous for Tadlis (concealing defects in the chain) (1), and he did not explicitly state hearing in it, and he concealed it from",
    "foot_note": "1. Ahmad bin Hanbal said: (He used to practice Tadlis wildly, and perhaps he would bring the letter he did not hear, so he mentions it in another Hadith, if the speech is cut off he connects it), and Muhanna said: I asked Abu Abdullah about Hushaym so he said: (Trustworthy if he does not practice Tadlis), I said to him: Is Tadlis a defect? He said: (Yes) End quote. Ibn Sa'd said: (Whatever he said in his Hadith: 'Akhbarana' is a proof, and whatever he did not say in it: 'Akhbarana' is nothing). Rather the stipulation came from Hushaym himself, so Abdullah bin Ahmad said: Some of our companions told me, saying: Hushaym said: (If I say to you: 'Haddathana', and 'Akhbarana', then hold on to it with your hands). Those who stated he is among the Mudallisin - other than Imam Ahmad and Ibn Sa'd - include: Ibn Hibban, Al-Ijli, Al-Nasa'i, Al-Daraqutni, Ibn Adi and Al-Khalili. See: Al-Tabaqat Al-Kubra: (9/315), Al-Ilal by narration of Abdullah bin Ahmad (2134) and Al-Marrudhi's narration: (31), Al-Thiqat by Ibn Hibban: (7/587) - and it appeared in the printed: Hushaym bin Bishr - and Ma'rifat Al-Thiqat by Al-Ijli: 3/334 (1912), and Su'alat Al-Sulami li Al-Daraqutni: (442) - and at its end is the mention of Mudallisin from Al-Nasa'i - and Al-Ma'rifah wa Al-Tarikh by Al-Fasawi: (2/633), and Al-Kamil by Ibn Adi: (8/451), and Al-Irshad by Al-Khalili: (1/196), and Bahr Al-Dam by Ibn Abd Al-Hadi: (1100).",
    "book_id": "849",
    "new_page_number": 51
  },
  {
    "serial_number": "3197203",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 51,
    "volume_number": 1,
    "text": "Al-Zuhri and did not hear it from him (1). Ahmad bin Hanbal said: «Hushaym did not hear from Al-Zuhri the Hadith of Ali bin Hussein, from Amr bin Uthman, from Usama bin Zaid, from the Prophet, peace be upon him: 'People of two different religions do not inherit from each other', and Hushaym has narrated it to us». And Ali bin Al-Madini said: «Hushaym did not hear the Hadith from Al-Zuhri» (2).",
    "foot_note": "1. Imam Ahmad stated that nothing was authentic for him from Al-Zuhri except four Hadiths, he said: (Nothing is authentic for Hushaym from Al-Zuhri except four Hadiths), and Abu Talib said: Abu Abdullah said: (What is authentic of Hushaym's hearing from Al-Zuhri is four Hadiths he says: Al-Zuhri told us... The Hadith of the womb, the Hadith of Safiyyah, the Hadith of the disputing woman, and the Hadith of Ibn Umar: 'Whatever is easy of the sacrificial animal', and whatever was other than that he says: I don't know whether I heard it from Sufyan bin Hussein or Al-Zuhri), Al-Ilal by narration of Abdullah bin Ahmad: (499), and Al-Ma'rifah wa Al-Tarikh by Al-Fasawi: (2/201).\n2. Al-Ilal by narration of Abdullah: (2202), and Masa'il Ibn Hani: (2140), and Ibn Al-Madini's saying was transmitted by Al-Bayhaqi in Al-Ma'rifah: (12651) following his context of Ibn Al-Madini's narration from Hushaym with it, except that the mention of Ali bin Al-Hussein did not appear in his chain.",
    "book_id": "849",
    "new_page_number": 52
  },
  {
    "serial_number": "3197204",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 52,
    "volume_number": 1,
    "text": "And Al-Nasa'i said: «He was not followed on his saying: People of two religions do not inherit from each other» (1). And Al-Daraqutni said: «Gharib (strange) from the Hadith of Hushaym from Al-Zuhri» (2). And he said: «This wording in Usama's Hadith is not preserved» (3). And Ibn Abd al-Barr said following it: «Hushaym is not a proof in Ibn Shihab» (4). He doubted his hearing of this Hadith from Al-Zuhri, where Saeed bin Mansur said: «Hushaym said: I heard it, or I was told it from Al-Zuhri» (5).\n* He was also confused in its chain:\n• He narrated it once and dropped Ali bin Al-Hussein from its chain: As Al-Bayhaqi narrated in Ma'rifat Al-Sunan wa Al-Athar: (12651) from Umar bin Abdul Aziz, from Ali bin Al-Fadl, from Abu",
    "foot_note": "1. Al-Mizzi transmitted it from him in Tuhfat Al-Ashraf: (113).\n2. Atraf Al-Ghara'ib wa Al-Afrad by Ibn Tahir: (571).\n3. Ibn Hajar transmitted it in Al-Talkhis Al-Habir: (4/2038).\n4. Al-Tamhid: (9/171).\n5. His doubt here falls under the defects of stating hearing.",
    "book_id": "849",
    "new_page_number": 53
  },
  {
    "serial_number": "3197205",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 53,
    "volume_number": 1,
    "text": "Shu'aib Al-Harrani, from Ali bin Al-Madini, from him, with it. Al-Bayhaqi said: «Ali bin Al-Madini said: So I mentioned that to Sufyan bin Uyaynah, and he said: He did not memorize». Ali said: «So we looked, and behold Hushaym did not hear the Hadith from Al-Zuhri».\n• And once he narrates it combining between the text of the group's Hadith: «A Muslim does not inherit from a disbeliever», and between the Hadith: «People of two religions do not inherit from each other», and their meaning is one; this came in the narration of Asad bin Musa and Al-Hasan bin Sawwar from him.\n• And another time he narrates it with the second text: «People of two religions do not inherit from each other», as the rest of his companions narrated it from him. Al-Bukhari and Muslim avoided extracting his Hadith from Al-Zuhri; due to his weakness in him (1).",
    "foot_note": "1. Hushaym said: (I heard from Al-Zuhri about a hundred Hadiths and I did not write them) End quote from Tarikh Madinat Al-Salam: (16/130), and Imam Ahmad's saying preceded that nothing is authentic in his Hadith from Al-Zuhri except four Hadiths.",
    "book_id": "849",
    "new_page_number": 54
  },
  {
    "serial_number": "3197206",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 54,
    "volume_number": 1,
    "text": "Explanation of Al-Nasa'i's behavior in his context for Hushaym's Hadith (1)\nAl-Nasa'i narrated in Al-Kubra both ways reported from Hushaym bin Bashir, and first clarified the investigation of the correct from the reality of narration from Hushaym, and declared Mas'ud bin Juwayriyah's narration from Hushaym mentioning Aban in his chain as defective, saying: «This is an error». Then he narrated the correct way from Hushaym in this Hadith, so he narrated it from the path of Ali bin Hujr - which a group of Hushaym's companions agreed with him on - he said: Hushaym informed us, from Al-Zuhri, from Ali bin Al-Hussein, from Amr bin Uthman, from Usama bin Zaid, with it. Then he clarified his uniqueness in its text, and his contradiction to the rest of Al-Zuhri's companions.\nWith Hushaym's Hadith ends the speech on the faces of difference on Ibn Shihab Al-Zuhri in the chapter's Hadith. It has become clear from what preceded; that the correct of them is the first way, which the majority of his companions narrated from him correctly in its text and chain. And Allah knows best, and may Allah send blessings and peace and blessings upon our Prophet Muhammad and upon his family and companions all.",
    "foot_note": "1. Of the precision of Al-Nasa'i's work in his Sunan Al-Kubra is that he investigates the narrator's error how it was narrated from him! Then he speaks about his narration afterwards and explains its contradiction to the Hadith of the trustworthy established ones as you see clearly in the faces of difference from Malik, and in the difference on Hushaym in this way.",
    "book_id": "849",
    "new_page_number": 55
  },
  {
    "serial_number": "3197207",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 56,
    "volume_number": 1,
    "text": "Index of References and Sources\nFirst: Index of Manuscripts:\n(1) Muwatta Imam Malik bin Anas:\nA- Narration of Yahya bin Bukair (d. 231 AH):\n- Istanbul University Library copy, copied in the year (548 AH).\n- Fatih Library copy in Sulaymaniyah, Turkey, number (1209), date of copying (785 AH).\nB- Narration of Yahya bin Yahya Al-Laythi (d. 234 AH):\n- A copy preserved in Allal Al-Fasi Library in Morocco, studied, introduced and photographed by/ Nizam Muhammad Salih Yaqubi, and Dar Al-Hadith Al-Kattaniyah published it in 1438 AH.\nC- Narration of Abdullah bin Maslama Al-Qa'nabi (d. 221 AH):\n- A copy whose original is preserved in Wali al-Din Jar Allah Library in Turkey under number (428), in the handwriting of the scholar/ Abdul Rahim bin Abdul Karim bin Nasr Allah Al-Jarahi Al-Madani (d. 828 AH).\n(2) Musnad Al-Darimi: A copy whose original is preserved in Murad Molla Library in Turkey under number (579), copied in the year (879 AH), and its scribe is Muhammad bin Mahmud Al-Harawi as indicated at its end, and heard by a group of scholars.\n(3) Al-Sunan Al-Kubra by Al-Nasa'i:\n- Copy of Al-Khalidiyyah Library in Jerusalem, may Allah cherish it, its number (66), and on it are hearing certificates",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 56
  },
  {
    "serial_number": "3197208",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 57,
    "volume_number": 1,
    "text": "for a group of Hafizs: like Al-Shihab Ibn Hajar, Al-Sakhawi, and Al-Qalqashandi on a group of scholars led by: Badr al-Din Al-Sharif Al-Nassabah (d. 866 AH), about whom Al-Sakhawi said: (And his narrating of this book specifically was frequent, until he and others of the public thought he was unique in it) End quote from Al-Daw' Al-Lami' (3/122).\n- A copy whose original is in Murad Molla Library in Turkey, its number (72), date of copying (1107 AH), and its scribe is Ahmad bin Muhammad Al-Biqa'i as indicated at its end.\nSecond: Index of Printed Books:\n(1) Ithaf Al-Mahara bi Al-Fawa'id Al-Mubtakara min Atraf Al-Ashara: by Abu Al-Fadl Ahmad bin Ali bin Hajar Al-Asqalani (d. 852 AH), investigation: Center for Service of Sunnah and Sirah in Medina under supervision of Dr. Zuhair bin Nasir Al-Nasir, King Fahd Complex for the Printing of the Holy Quran in Medina, and Center for Service of Sunnah and Sirah, 1st ed., 1415 AH.\n(2) Al-Ahad wa Al-Mathani: by Ahmad bin Amr bin Al-Dahhak bin Mukhlid Al-Shaybani, Abu Bakr bin Abi Asim (d. 287 AH), investigation: Dr. Basim Faisal Al-Jawabra, Dar Al-Rayah, Riyadh, 1st ed., 1411 AH.\n(3) Al-Ahadith Al-Mi'ah Al-Mushtamila ala Mi'ah Nisba ila Al-Sana'i by Shams al-Din Muhammad bin Ali bin Tulun Al-Dimashqi (d. 953 AH), investigation: Mus'ad Abdul Hamid Al-Sa'dani, Publisher: Dar Al-Tala'i'.\n(4) Ahadith Al-Muwatta wa Dhikr Ittifaq Al-Ruwat 'an Malik wa Ikhtilafihim fihi wa Ziyadatihim wa Nuqsanihim by Abu Al-Hasan Ali bin Umar Al-Daraqutni (d. 385 AH) narration of Abu Muhammad Al-Hasan bin Muhammad Al-Jawhari (d. 454 AH) investigation Dr/ Adil bin Abdul Shakur Al-Zurqi Publisher: Dar Tuwaiq First Edition 1424 AH.\n(5) Al-Irshad fi Ma'rifat Ulama al-Hadith: by Abu Ya'la Al-Khalili Al-Qazwini (d. 446 AH), investigation:",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 57
  },
  {
    "serial_number": "3197209",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 58,
    "volume_number": 1,
    "text": "Dr. Muhammad Saeed Umar Idris, Maktabat Al-Rushd, Riyadh, 1st ed., 1409 AH.\n(6) Atraf Al-Ghara'ib wa Al-Afrad min Hadith Rasul Allah sallallahu alayhi wa sallam lil Imam Al-Daraqutni: Abu Al-Fadl Muhammad bin Tahir Al-Maqdisi, known as Ibn Al-Qaysarani (d. 507 AH), investigation: Jabir bin Abdullah Al-Sari', Publisher: Dar Al-Tadmuriyyah in Riyadh, 1st ed., 1428 AH.\n(7) Al-Ikmal fi Raf' Al-Irtiyab 'an Al-Mu'talif wa Al-Mukhtalif fi Al-Asma' wa Al-Kuna wa Al-Ansab: by Abu Nasr Ali bin Hibatullah bin Ja'far bin Makula (d. 475 AH), Publisher: Dar Al-Kutub Al-Ilmiyyah, 1st ed., 1411 AH.\n(8) Al-Umm: by Imam Al-Shafi'i, Abu Abdullah Muhammad bin Idris Al-Shafi'i (d. 204 AH):\n- Ed. Al-Matba'ah Al-Amiriyyah in Bulaq, 1st 1322 AH.\n- Ed. Dar Al-Ma'rifah, Beirut, 1410 AH, which is a photocopy of the edition of Al-Sharika Al-Tiba'iyyah Al-Fanniyyah Al-Muttahidah in Egypt year 1381 AH cared for by: Muhammad Zuhri Al-Najjar, and it is the relied upon in attribution, and others are indicated upon difference.\n- Ed. Dar Al-Wafa Al-Mansurah, 1st ed., 2001 CE, investigation Dr/ Rif'at Fawzi Abdul Muttalib.\n(9) Al-Awsat min Al-Sunan wa Al-Ijma' wa Al-Ikhtilaf: by Abu Bakr Muhammad bin Ibrahim bin Al-Mundhir Al-Naysaburi (d. 319 AH), reviewed and commented on by: Ahmad bin Sulaiman bin Ayyub, investigation: Group of researchers, Publisher: Dar Al-Falah, 1st ed., 1430 AH.\n(10) Bahr Al-Dam fiman Takallama fihi Al-Imam Ahmad bi Madh aw Dham: investigation: Dr. Ruhiyah Abdul Rahman Al-Suwayfi, Publisher: Dar Al-Kutub Al-Ilmiyyah, 1st ed., 1413 AH.\n(11) Bughyat Al-Multamis fi Suba'iyyat Hadith Al-Imam Malik bin Anas, by Salah al-Din Khalil bin Kaykildi Al-Ala'i (d. 761 AH), investigation: Hamdi Al-Salafi, Publisher: Alam Al-Kutub in Beirut 1405 AH.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 58
  },
  {
    "serial_number": "3197210",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 59,
    "volume_number": 1,
    "text": "(12) Tarikh Ibn Ma'in (d. 278 AH) - Narration of Uthman Al-Darimi, investigation: Dr. Ahmad Muhammad Nur Saif, Dar Al-Ma'mun lil-Turath, Damascus, 1400 AH.\n(13) Al-Tarikh Al-Kabir: by Abu Bakr Ahmad bin Abi Khaythama (d. 279 AH), Third Volume, investigation: Salah bin Fathi Hilal, Publisher: Al-Faruq Al-Haditha for Printing and Publishing, Cairo, 1st ed., 1427 AH.\n(14) ... Al-Tarikh Al-Kabir: by Abu Bakr Ahmad bin Abi Khaythama (d. 279 AH), Second Volume, investigation: Salah bin Fathi Hilal, Publisher: Al-Faruq Al-Haditha for Printing and Publishing, Cairo, 1st ed., 1427 AH.\n(15) Al-Tarikh Al-Kabir: by Abu Abdullah Muhammad bin Ismail Al-Bukhari (d. 256 AH), Publisher: Da'irat Al-Ma'arif Al-Uthmaniyyah, Hyderabad, Deccan, printed under supervision of: Muhammad Abdul Mu'id Khan.\n(16) Tarikh Baghdad, named Tarikh Madinat Al-Salam, by Abu Bakr Ahmad bin Ali bin Thabit Al-Khatib Al-Baghdadi (d. 463 AH), investigation: Dr. Bashar Awwad Ma'ruf, Publisher: Dar Al-Gharb Al-Islami, 1st ed., 1422 AH.\n(17) Tarikh Dimashq: by Abu Al-Qasim Ali bin Al-Hasan bin Hibatullah, known as Ibn Asakir (d. 571 AH), investigation: Amr Al-Amrawi, Publisher: Dar Al-Fikr for Printing and Publishing, 1415 AH.\n(18) Tuhfat Al-Ashraf bi Ma'rifat Al-Atraf: by Jamal al-Din Abu Al-Hajjaj Yusuf bin Abdul Rahman Al-Mizzi (d. 742 AH):\n- Investigation: Abdul Samad Sharaf al-Din, Publisher: Al-Maktab Al-Islami and Al-Dar Al-Qayyimah in India, 2nd ed., 1403 AH.\n- Investigation Dr. Bashar Awwad Ma'ruf, Publisher Dar Al-Gharb Al-Islami year 1420 AH",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 59
  },
  {
    "serial_number": "3197211",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 60,
    "volume_number": 1,
    "text": "(19) Al-Tuhfa Al-Latifa fi Tarikh Al-Madina Al-Sharifa: by Shams al-Din Muhammad bin Abdul Rahman Al-Sakhawi (d. 902 AH), Edition of Center for Research and Studies in Medina, 1st ed., 1429 AH.\n(20) Al-Tamhid lima fi Al-Muwatta min Al-Ma'ani wa Al-Asanid: by Abu Umar Yusuf bin Abdullah bin Muhammad bin Abd al-Barr Al-Namari Al-Qurtubi (d. 463 AH):\n- Ed. Ministry of Awqaf and Islamic Affairs Morocco, 1387 AH, with investigation: Abdullah bin Al-Siddiq Al-Ghumari, Mustafa bin Ahmad Al-Alawi, Muhammad bin Abdul Karim Al-Bakri, and Saeed A'rab, and it is the relied upon in attribution.\n- Ed. within Encyclopedia of Commentaries on Al-Muwatta, with investigation: Dr/ Abdullah bin Abdul Muhsin Al-Turki in cooperation with Markaz Hajar for Arab and Islamic Studies and Research, First Edition 1426 AH.\n(21) Al-Tamyiz fi Talkhis Takhrij Ahadith Sharh Al-Wajiz, famous as Al-Talkhis Al-Habir: by Abu Al-Fadl Ahmad bin Ali bin Muhammad bin Hajar Al-Asqalani (d. 852 AH), investigation: Dr. Muhammad Al-Thani bin Umar bin Musa, Publisher: Dar Adwa' Al-Salaf, 1st ed., 1428 AH.\n(22) Tahdhib Al-Kamal fi Asma' Al-Rijal: by Abu Al-Hajjaj Yusuf Al-Mizzi (d. 742 AH), investigation: Dr. Bashar Awwad Ma'ruf, Publisher: Mu'assasat Al-Risalah, 1st ed., 1418 AH, Parts: 8 parts.\n(23) Al-Thiqat: by Abu Hatim Muhammad bin Hibban Al-Busti (d. 354 AH), investigation: Dr. Muhammad Abdul Mu'id Khan Director of Da'irat Al-Ma'arif Al-Uthmaniyyah, Publisher: Dar Al-Ma'arif Al-Uthmaniyyah, Hyderabad, Deccan, India, 1st ed., 1393 AH.\n(24) Jami' Al-Sahihayn bi Hadhf Al-Ma'ad wa Al-Turuq by Abu Nu'aym Ubaidullah bin Al-Hasan bin Ahmad Al-Haddad Al-Asbahani (d. 517 AH), investigation: Specialized committee of investigators under supervision of Nur",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 60
  },
  {
    "serial_number": "3197212",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 61,
    "volume_number": 1,
    "text": "Al-Din Talib, Publisher: Dar Al-Nawadir, First Edition 1431 AH.\n(25) Al-Jami' Al-Musnad Al-Sahih Al-Mukhtasar min Umur Rasul Allah sallallahu alayhi wa sallam wa Sunanihi wa Ayyamihi (Sahih Al-Bukhari): by Abu Abdullah Muhammad bin Ismail Al-Bukhari (d. 256 AH), care of: Dr. Muhammad Zuhair bin Nasir Al-Nasir, Publisher: Dar Tawq Al-Najat (Photocopy of the Sultaniyyah Edition with addition of Muhammad Fuad Abdul Baqi's numbering), 1st ed., 1422 AH.\n(26) Al-Jami': by Abu Isa Muhammad bin Isa bin Sawra Al-Tirmidhi (d. 279 AH), with investigation and explanation: Ahmad Muhammad Shakir, Publisher: Sharikat Maktabat wa Matba'at Mustafa Al-Babi Al-Halabi wa Awladihi, Egypt, 2nd ed., 1395 AH.\n(27) Al-Jarh wa Al-Ta'dil: by Abu Muhammad Abdul Rahman bin Muhammad bin Idris Al-Tamimi Al-Hanzali Al-Razi known as Ibn Abi Hatim (d. 327 AH), Publisher: Majlis Da'irat Al-Ma'arif Al-Uthmaniyyah, Hyderabad Deccan, India, Photocopy: Dar Ihya' Al-Turath Al-Arabi, 1st ed.\n(28) Hadith Al-Sarraj by Abu Al-Abbas Muhammad bin Ishaq bin Ibrahim known as Al-Sarraj (d. 313 AH) with extraction: Zahir bin Tahir Al-Shahhami (d. 533 AH), Publisher: Al-Faruq Al-Haditha for Printing and Publishing, First Edition 1425 AH.\n(29) Hilyat Al-Awliya wa Tabaqat Al-Asfiya: by Abu Nu'aym Ahmad bin Abdullah bin Ahmad bin Ishaq Al-Asbahani (d. 430 AH), Publisher: Maktabat Al-Sa'adah, Egypt, 1394 AH.\n(30) Dhikr Al-Mudallisin wa Ghayr dhalika min Al-Fawa'id: by Abu Abdul Rahman Ahmad bin Shu'aib bin Ali Al-Nasa'i, within Mashyakhat Al-Nasa'i, investigation: Hatim bin Arif Al-Awni, Publisher: Dar Alam Al-Fawa'id, Mecca, 1st ed., 1423 AH.\n(31) ... Al-Sunnah: by Abu Abdullah Muhammad bin Nasr Al-Marwazi (d. 294 AH), investigated and extracted its hadiths and commented on it: Dr. Abdullah bin Muhammad Al-Busayri, Publisher: Dar Al-Asima, 1st ed., 1422 AH.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 61
  },
  {
    "serial_number": "3197213",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 62,
    "volume_number": 1,
    "text": "(32) Sunan Ibn Majah: by Abu Abdullah Muhammad bin Yazid Ibn Majah Al-Qazwini (d. 273 AH), investigation: Shu'aib Al-Arna'ut, Adil Murshid, Muhammad Kamil Qurrah Balli, Abdul Latif Hirz Allah, Publisher: Dar Al-Risalah Al-Alamiyyah, 1st ed., 1430 AH.\n(33) Sunan Abi Dawood: by Sulaiman bin Al-Ash'ath bin Ishaq bin Bashir bin Shaddad Al-Sijistani (d. 275 AH), four editions were utilized:\n- Ed. with investigation: Shu'aib Al-Arna'ut, and Muhammad Kamil Qurrah Balli, Publisher: Dar Al-Risalah Al-Alamiyyah, 1st ed., 1430 AH, which is the relied upon in attribution.\n- Ed. with investigation: Izzat Ubaid Al-Da'as, and in its margin: Ma'alim Al-Sunan by Al-Khattabi, supervised printing: Muhammad Rafiq Al-Sayyid, First Edition 1388 AH in Sham.\n- Ed. with investigation: Muhammad Awwamah, Publisher: Dar Al-Qiblah for Islamic Culture in Jeddah, and Mu'assasat Al-Rayyan in Beirut, Second Edition 1425 AH.\n- Ed. with investigation and study: Abu Turab Adil bin Muhammad and Abu Amr Imad al-Din bin Abbas, Publisher: Dar Al-Ta'sil, Cairo, 1436 AH.\n(34) Al-Sunan Al-Kubra: by Abu Abdul Rahman Ahmad bin Shu'aib Al-Nasa'i, Publisher: Markaz Al-Buhuth at Dar Al-Ta'sil, Cairo, 1433 AH.\n(35) Sunan Saeed bin Mansur: by Abu Uthman Saeed bin Mansur bin Shu'ba Al-Khurasani (d. 227 AH), investigation: Habib ur-Rahman Al-A'zami, Publisher: Al-Dar Al-Salafiyyah, India, 1st ed., 1403 AH.\n(36) Su'alat Abi Dawood Sulaiman bin Al-Ash'ath Al-Sijistani author of Al-Sunan: to Imam Ahmad bin Hanbal in Discrediting Narrators and Declaring them Trustworthy, investigation: Dr. Ziyad bin Muhammad Mansur, Publisher Maktabat Al-Ulum wa Al-Hikam, in Medina 2nd ed., 1414 AH.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 62
  },
  {
    "serial_number": "3197214",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 63,
    "volume_number": 1,
    "text": "(37) Su'alat Abi Abdul Rahman Al-Sulami li Al-Daraqutni: by Muhammad bin Al-Hussein bin Muhammad bin Musa Abu Abdul Rahman Al-Sulami (d. 412 AH), investigation: Team of researchers under supervision and care of Dr. Saad bin Abdullah Al-Humayyid, and Dr. Khalid bin Abdul Rahman Al-Jeraisy, Publisher: Mu'assasat Al-Jeraisy for Publishing and Distribution, 1st ed., 1427 AH.\n(38) Su'alat Mas'ud bin Ali Al-Sijzi ma'a As'ilat Al-Baghdadiyyin 'an Ahwal Al-Ruwat: by Imam Al-Hafiz Abu Abdullah Muhammad bin Abdullah Al-Hakim Al-Naysaburi, investigation: Prof. Dr. Muwaffaq bin Abdullah bin Abdul Qadir, Dar Al-Gharb Al-Islami, 1st ed., 1408 AH.\n(39) Siyar A'lam Al-Nubala': by Abu Abdullah Muhammad bin Ahmad bin Uthman Al-Dhahabi (d. 748 AH), investigated its texts and extracted its hadiths and commented on it: Shu'aib Al-Arna'ut and a group of researchers, Publisher: Mu'assasat Al-Risalah, 7th ed., 1410 AH.\n(40) Sharh Ma'ani Al-Athar: by Abu Ja'far Ahmad bin Muhammad bin Salamah Al-Tahawi (d. 321 AH), investigation: Muhammad Zuhri Al-Najjar, and Muhammad Sayyid Jad Al-Haqq, reviewed and numbered its books and chapters and hadiths: Dr. Yusuf Abdul Rahman Al-Mar'ashli researcher at Center for Service of Sunnah in Medina, Publisher: Dar Alam Al-Kutub, 1st ed., 1414 AH.\n(41) Sahih Ibn Hibban, and known by name: Al-Musnad Al-Sahih 'ala Al-Taqasim wa Al-Anwa' min ghayr wujud qat' fi sanadiha wa la thubut jarh fi naqiliha.\n- As for the Sahih, attribution in it is to the edition of Dar Ibn Hazm in Beirut, First Edition 1433 AH with investigation: Dr/ Muhammad Ali Sonmez, and Dr/ Khalis Ay Demir.\n* As for the arrangement of the Sahih by Ibn Balban, named (Al-Ihsan fi Taqrib Sahih Ibn Hibban) by arrangement of Prince Ala al-Din Ali bin Balban Al-Farisi (d. 739 AH), it was",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 63
  },
  {
    "serial_number": "3197215",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 64,
    "volume_number": 1,
    "text": "utilized in two editions:\n- Ed. investigated and extracted its hadiths and commented on it: Shu'aib Al-Arna'ut and a group of researchers, Publisher: Mu'assasat Al-Risalah, 1st ed., 1408 AH, and it is the relied upon in attribution to the Sahih generally for the entire treatise.\n- Ed. Markaz Dar Al-Ta'sil in Egypt, investigation Center for Research and Information Technology at Dar Al-Ta'sil in Egypt, First Edition 1435 AH.\n(42) Sahih Ibn Khuzayma: by Abu Bakr Muhammad bin Ishaq bin Khuzayma Al-Naysaburi (d. 311 AH), investigation: Dr. Muhammad Mustafa Al-A'zami, Publisher: Al-Maktab Al-Islami.\n(43) Al-Du'afa: by Abu Ja'far Muhammad bin Amr bin Musa Al-Uqayli (d. 322 AH), investigation: Dr. Mazin Al-Sarsawi, Publisher: Dar Ibn Abbas, Egypt, 2nd ed., 2008 CE.\n(44) Al-Tabaqat Al-Kabir: by Abu Abdullah Muhammad bin Sa'd bin Mani' (d. 230 AH), investigation: Ali Muhammad Umar, Publisher: Maktabat Al-Khanji, Cairo, 1st ed., 2001 CE.\n(45) 'Ilal Al-Hadith: by Abu Muhammad Abdul Rahman bin Muhammad bin Idris known as Ibn Abi Hatim Al-Razi (d. 327 AH), investigation: Team of researchers under supervision and care of Dr. Saad bin Abdullah Al-Humayyid, and Dr. Khalid bin Abdul Rahman Al-Jeraisy, Publisher: Matabi' Al-Humaydi, 1st ed., 1327 AH.\n(46) Al-Ilal wa Ma'rifat Al-Rijal: by Ahmad bin Muhammad bin Hanbal (d. 241 AH), in its two following narrations:\n- Narration of his son Abdullah, with investigation: Prof. Dr. Wasiyullah bin Muhammad Abbas, Publisher: Dar Al-Khani, Riyadh, 2nd ed., 1422 AH.\n- Narration of Al-Marrudhi and others, investigation: Prof. Dr. Wasiyullah bin Muhammad Abbas, Publisher: Al-Dar Al-Salafiyyah, Bombay, India, 1st ed., 1408 AH.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 64
  },
  {
    "serial_number": "3197216",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 65,
    "volume_number": 1,
    "text": "(47) Awali Malik bin Anas li Abi Ahmad Al-Hakim, Awali Malik bin Anas narration of Abu Ahmad Al-Hakim (Died: 378 AH), investigation: Muhammad Al-Hajj Al-Nasir, Publisher: Dar Al-Gharb Al-Islami, Second Edition 1998 CE (printed with a collection of Awali Imam Malik).\n(48) Gharib Al-Hadith: by Ibrahim bin Ishaq Al-Harbi (d. 285 AH), investigation: Dr. Sulaiman Ibrahim Muhammad Al-Ayed, Umm Al-Qura University, Mecca, 1st ed., 1405 AH.\n(49) Gharib Al-Hadith: by Abu Sulaiman Hamd bin Muhammad bin Ibrahim Al-Khattabi, investigation: Dr. Abdul Karim bin Ibrahim Al-Azbawi, Publisher: Umm Al-Qura University, Mecca, 1402 AH.\n(50) Fath Al-Mughith bi Sharh Alfiyyat Al-Hadith: by Abu Al-Khayr Muhammad bin Abdul Rahman Al-Sakhawi Al-Shafi'i (d. 902 AH), study and investigation by our Sheikh: Dr. Abdul Karim bin Abdullah Al-Khudair, and Dr. Muhammad bin Abdullah Al-Fuhayd, Publisher: Maktabat Dar Al-Minhaj in Riyadh, 1st ed., 1426 AH.\n(51) Al-Fasl lil-Wasl Al-Mudraj fi Al-Naql: by Abu Bakr Ahmad bin Ali bin Thabit Al-Khatib Al-Baghdadi (d. 463 AH), investigation: Dr. Muhammad Matar Al-Zahrani, Publisher: Dar Al-Hijrah, 1418 AH.\n(52) Fawa'id Ibn Akhi Mimi Al-Daqqaq: by Abu Al-Hussein Muhammad bin Abdullah bin Al-Hussein bin Abdullah bin Harun Al-Baghdadi Al-Daqqaq, known as Ibn Akhi Mimi (d. 390 AH), investigation: Nabil Saad al-Din Jarrar, Publisher: Dar Adwa' Al-Salaf, Riyadh, 1st ed., 1426 AH.\n(53) Al-Kamil fi Du'afa Al-Rijal: by Abu Ahmad bin Adi Al-Jurjani (d. 365 AH), and three editions were utilized:\n- Ed. with investigation: Adil Ahmad Abdul Mawjud, and Ali Muhammad Mu'awwad, participated in its investigation: Dr. Abdul Fattah Abu Sunnah, Publisher: Dar Al-Kutub Al-Ilmiyyah, 1st ed., 1418 AH, and it is the relied upon in attribution.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 65
  },
  {
    "serial_number": "3197217",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 66,
    "volume_number": 1,
    "text": "- Ed. with investigation Dr/ Mazin bin Muhammad Al-Sarsawi, Publisher: Maktabat Al-Rushd in Riyadh, First Edition 1434 AH.\n- Ed. Mukhtasar Al-Kamil fi Al-Du'afa by Ahmad bin Ali Al-Maqrizi (d. 845 AH), with investigation: Ayman Arif Al-Dimashqi, Publisher/ Maktabat Al-Sunnah in Egypt, First Edition 1415 AH.\n(54) Mustakhraj Abi Awana: by Abu Awana Yaqub bin Ishaq Al-Naysaburi, and two editions were utilized:\n- Ed. with investigation: Ayman bin Arif Al-Dimashqi, Dar Al-Ma'rifah, Beirut, 1st ed., 1419 AH, and it is the relied upon in attribution.\n- Ed. with investigation: Team of researchers at Faculty of Noble Hadith and Islamic Studies, Islamic University, Medina, 1st ed., 1435 AH.\n(55) Al-Mustafad min Dhayl Tarikh Baghdad li Muhibb al-Din Ibn Al-Najjar, authored by Abu Al-Hussein Ahmad bin Aybak bin Abdullah Al-Husami known as Ibn Al-Dumyati (d. 749 AH) Publisher: Mu'assasat Al-Risalah First Edition 1406 AH investigation Muhammad Mawlud Khalaf and supervision Dr. Bashar Awwad Ma'ruf.\n(56) Musnad Imam Ahmad bin Hanbal (d. 241 AH), and three publications of the book were utilized:\n- Ed. with investigation: Sheikh: Shu'aib Al-Arna'ut and Dr. Abdullah bin Abdul Muhsin Al-Turki in cooperation with a group of researchers, Publisher: Mu'assasat Al-Risalah 1st ed., 1421 AH, and it is the relied upon in attribution.\n- Ed. with investigation: Al-Sayyid Abu Al-Ma'ati Al-Nuri and a group of researchers, and issued by Dar Alam Al-Kutub in Beirut, 1419 AH First Edition.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 66
  },
  {
    "serial_number": "3197218",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 67,
    "volume_number": 1,
    "text": "- Ed. with investigation by a group of researchers under supervision of Dr/ Ahmad Ma'bad Abdul Karim, and Publisher: Jam'iyyat Al-Maknaz Al-Islami in Egypt, and Dar Al-Minhaj for Publishing and Distribution in Jeddah, Second Edition 1433 AH, printed with funding from Ministry of Awqaf and Islamic Affairs in Qatar.\n(57) Musnad Al-Bazzar, published under the name Al-Bahr Al-Zakkhar: by Abu Bakr Ahmad bin Amr bin Abdul Khaliq known as Al-Bazzar (d. 292 AH), investigation: Dr/ Mahfuzur Rahman Zainullah, and Adil bin Saad, and Sabri Abdul Khaliq Al-Shafi'i, Publisher: Maktabat Al-Ulum wa Al-Hikam, Medina, 1st ed., started 1988 and ended 2009 CE.\n(58) Musnad Al-Humaydi: by Abu Bakr Abdullah bin Al-Zubayr bin Isa Al-Humaydi (d. 219 AH), investigation: Hussein Salim Asad Al-Darani, Publisher: Dar Al-Saqqa, Damascus, Syria, 1st ed., 1996 CE.\n(59) Musnad Al-Darimi: by Abu Muhammad Abdullah bin Abdul Rahman bin Al-Fadl Al-Darimi Al-Samarqandi (d. 255 AH), and four editions were utilized:\n(60) Musnad Abi Dawood Al-Tayalisi: by Abu Dawood Sulaiman bin Dawood bin Al-Jarud Al-Tayalisi (d. 204 AH), investigation: Dr. Muhammad bin Abdul Muhsin Al-Turki, Dar Hajar, Egypt, 1st ed., 1419 AH.\n(61) Musnad Ibn Abi Shaybah: by Abu Bakr Abdullah bin Muhammad bin Abi Shaybah Al-Absi (d. 235 AH), investigation: Adil bin Yusuf Al-Azazi, and Ahmad bin Farid Al-Mazidi, Dar Al-Watan, Riyadh, 1st ed., 1997 CE.\n- Ed. with investigation: Hussein Salim Asad Al-Darani, Publisher: Dar Al-Mughni, 1st ed., 1412 AH, and it is the relied upon in attribution.\n- Ed. with investigation Sayyid Abdullah Hashim Yamani Al-Madani, Publisher: Dar Al-Mahasin for Printing in Cairo, 1386 AH",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 67
  },
  {
    "serial_number": "3197219",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 68,
    "volume_number": 1,
    "text": "- Ed. with investigation: Nabil Hashim Al-Ghamri, Publisher: Dar Al-Basha'ir, Beirut, 1st ed., 1434 AH.\n- Ed. Dar Al-Ta'sil, with investigation: Center for Research and Information Technology at Dar Al-Ta'sil, First Edition, 1436 AH.\n(62) Al-Musnad Al-Sahih Al-Mukhtasar bi Naql Al-Adl 'an Al-Adl ila Rasul Allah sallallahu alayhi wa sallam (Sahih Muslim): Muslim bin Al-Hajjaj Al-Naysaburi (d. 261 AH), and three publications were utilized:\n- Ed. investigation: Muhammad Fuad Abdul Baqi, Dar Ihya' Al-Kutub Al-Arabiyyah Isa Al-Babi Al-Halabi and Partners 1374 AH, and it is the relied upon in attribution.\n- Ed. Al-Matba'ah Al-Amirah in Istanbul year 1329 AH.\n- Ed. Dar Al-Ta'sil, with investigation: Center for Research and Information Technology at Dar Al-Ta'sil, First Edition, 1435 AH.\n(63) Al-Musnad Al-Mustakhraj 'ala Sahih Al-Imam Muslim: by Abu Nu'aym Ahmad bin Abdullah bin Ahmad Al-Asbahani (d. 430 AH), investigation: Muhammad Hasan Ismail Al-Shafi'i, Dar Al-Kutub Al-Ilmiyyah, Beirut, Lebanon, 1st ed., 1417 AH.\n(64) Musnad Al-Muwatta: by Abu Al-Qasim Abdul Rahman bin Abdullah bin Muhammad Al-Ghafiqi Al-Jawhari (d. 381 AH), investigation: Dr. Lutfi Muhammad Al-Saghir, and Dr. Taha bin Ali Bu Sarrih, Publisher: Dar Al-Gharb Al-Islami, Beirut, 1st ed., 1997 CE.\n(65) Al-Musannaf: by Abu Bakr Abdul Razzaq bin Hammam Al-San'ani (d. 211 AH), and two editions were utilized:\n- Ed. with investigation: Habib ur-Rahman Al-A'zami, Al-Majlis Al-Ilmi, India, and Al-Maktab Al-Islami in Beirut, 2nd ed., 1403 AH, and it is the relied upon in attribution.\n- Ed. Dar Al-Ta'sil, with investigation: Center for Research and Information Technology at Dar Al-Ta'sil, First Edition, 1436 AH.",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 68
  },
  {
    "serial_number": "3197220",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 69,
    "volume_number": 1,
    "text": "(66) Al-Musannaf: by Abu Bakr Abdullah bin Muhammad bin Abi Shaybah (d. 235 AH), and two editions were utilized:\n- Ed. Dar Al-Qiblah, with investigation: Muhammad Awwamah, 1st ed., 1427 AH, and it is the relied upon in attribution.\n- Ed. Dar Kunuz Ishbiliya, with investigation Prof. Dr/ Saad bin Nasir bin Abdul Aziz Al-Shathri with a group of researchers, First Edition 1436 AH.\n(67) Al-Mu'jam Al-Awsat: by Sulaiman bin Ahmad bin Ayyub Al-Tabarani Abu Al-Qasim (d. 360 AH), investigation: Tariq bin Awad Allah bin Muhammad, and Abdul Muhsin bin Ibrahim Al-Husseini, Publisher: Dar Al-Haramain, Cairo.\n(68) Al-Mu'jam Al-Kabir: by Abu Al-Qasim Sulaiman bin Ahmad Al-Tabarani (d. 360 AH), investigation: Hamdi bin Abdul Majid Al-Salafi, Dar Ihya' Al-Turath Al-Arabi, 2nd ed.\n(69) Al-Mu'jam: by Abu Saeed Ahmad bin Muhammad bin Ziyad Ibn Al-A'rabi, investigation: Abdul Muhsin bin Ibrahim bin Ahmad Al-Husseini, Publisher: Dar Ibn Al-Jawzi, 1st ed., 1418 AH.\n(70) Ma'rifat Al-Thiqat min Rijal Ahl Al-Ilm wa Al-Hadith wa min Al-Du'afa, wa Dhikr Madhahibihim wa Akhbarihim: by Abu Al-Hasan Ahmad bin Abdullah bin Salih Al-Ijli (d. 261 AH), investigation: Dr. Abdul Alim bin Abdul Azim Al-Bastawi, Publisher: Maktabat Al-Dar, Medina, 1st ed., 1405 AH.\n(71) Ma'rifat Al-Sunan wa Al-Athar: by Abu Bakr Ahmad bin Al-Hussein bin Ali Al-Bayhaqi (d. 458 AH), investigation: Abdul Mu'ti Amin Qal'aji, Jamia Al-Dirasat Al-Islamiyyah, Karachi, Pakistan, 1st ed., 1412 AH.\n(72) Ma'rifat Anwa' Ulum Al-Hadith wa Yu'raf bi Muqaddimat Ibn Al-Salah: Uthman bin Abdul Rahman Abu Amr Taqi al-Din known as Ibn Al-Salah (d. 643 AH), investigation: Nur al-Din Itr, Dar",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 69
  },
  {
    "serial_number": "3197221",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 70,
    "volume_number": 1,
    "text": "Al-Fikr, Syria, 1406 AH.\n(73) Al-Ma'rifah wa Al-Tarikh: by Abu Yusuf Yaqub bin Sufyan Al-Fasawi (d. 277 AH), investigation: Dr. Akram Diya' Al-Umari, Mu'assasat Al-Risalah, Beirut, 2nd ed., 1401 AH.\n(74) Al-Mughni fi Al-Du'afa by Abu Abdullah Muhammad bin Ahmad Al-Dhahabi (d. 748 AH), with investigation Dr/ Nur al-Din Itr, printed and published by care of: Abdullah bin Ibrahim Al-Ansari, printed at the expense of Administration of Reviving Islamic Heritage, 1407 AH.\n(75) Muqaddimat Fath Al-Bari known as (Huda Al-Sari): by Ahmad bin Ali bin Hajar Al-Asqalani (d. 852 AH), Publisher: Dar Al-Ma'rifah (Photocopy of the first Salafiyyah Edition), 1379 AH.\n(76) Al-Muntaqa min Al-Sunan Al-Musnadah 'an Rasul Allah sallallahu alayhi wa sallam: by Abu Muhammad Ibn Al-Jarud (d. 307 AH), and two editions were utilized:\n- Ed. with investigation: Sayyid Abdullah Hashim Al-Yamani Al-Madani, and issued by Al-Fajjalah Al-Jadidah Press, year 1382 AH, and it is the relied upon in attribution.\n- Ed. Center for Research at Dar Al-Ta'sil, Cairo, with investigation Center for Research and Information Technology at the House 1st ed., 1435 AH.\n(77) Muwatta Imam Malik bin Anas (d. 179 AH), narration of Yahya bin Yahya Al-Laythi, and three editions were utilized:\n- Ed. with correction and numbering: Muhammad Fuad Abdul Baqi, Publisher: Dar Ihya' Al-Turath Al-Arabi, Beirut, Lebanon, 1406 AH, and it is the relied upon in attribution.\n- Ed. with investigation: Dr. Muhammad Mustafa Al-A'zami, Publisher: Zayed bin Sultan Al Nahyan Foundation for Charitable and Humanitarian Works in UAE, 1st ed., 1425 AH.\n- Ed. with investigation by a group of researchers, and issued by The Supreme Scientific Council in",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 70
  },
  {
    "serial_number": "3197222",
    "category_id": "8",
    "category": "Hadith Verification and Narration Chains",
    "book_title": "Takhrij of the Hadith 'A Muslim does not inherit from a Disbeliever'",
    "edition": "None",
    "publisher": "Without",
    "page_number": 71,
    "volume_number": 1,
    "text": "Casablanca, Morocco, First Edition 1434 AH.\n(78) Muwatta Imam Malik bin Anas (d. 179 AH), narration of Abu Mus'ab Al-Zuhri, investigation: Dr. Bashar Awwad Ma'ruf, and Mahmud Khalil, Mu'assasat Al-Risalah, 1412 AH.\n(79) Muwatta Imam Malik bin Anas (d. 179 AH), narration of Muhammad bin Al-Hasan Al-Shaybani, commentary and investigation: Abdul Wahhab Abdul Latif, Al-Maktabah Al-Ilmiyyah.\n(80) Nukhab Al-Afkar fi Tanqih Mabani Al-Akhbar fi Sharh Ma'ani Al-Athar by Badr al-Din Al-Ayni Al-Hanafi (d. 855 AH), investigation: Abu Tamim Yasir bin Ibrahim, Publisher: Ministry of Awqaf and Islamic Affairs - Qatar, First Edition 1429 AH.\n(81) Nasab Quraysh by Mus'ab bin Abdullah Al-Zubayri, published and corrected by: E. Levi-Provençal, Publisher Dar Al-Ma'arif in Egypt Third Edition (undated).",
    "foot_note": "None",
    "book_id": "849",
    "new_page_number": 71
  }
]