[
  {
    "text": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']\nAuthor: محمد بن أبي بكر بن أيوب بن سعد شمس الدين ابن قيم الجوزية\nYear: 751",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 1
  },
  {
    "text": "sn: 1304\nbook_title: الأمثال في القرآن [من «اعلام الموقعين»]\nbook_link: https://shamela.ws/book/928\nbook_id: 928\nauthor_name: محمد بن أبي بكر بن أيوب بن سعد شمس الدين ابن قيم الجوزية\nauthor_year: 751\nnickname: Null\nauthor_link: https://shamela.ws/author/14\nauthor_ID: 14\neditor: أبو حذيفة إبراهيم بن محمد\npublisher: مكتبة الصحابة - مصر، طنطا\nedition: الأولى 1406 هـ - 1986 م\npages: 60\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: علوم القرآن وأصول التفسير\ncategory_id: 4",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "new_page_number": 2
  },
  {
    "serial_number": "1015809",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Quranic Sciences and Principles of Exegesis\nBook: Parables in the Quran [From 'I'lam al-Muwaqqi'in']\nAuthor: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died 751 AH)\nInvestigator: Abu Hudhayfah Ibrahim bin Muhammad\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nBook: Parables in the Quran [From 'I'lam al-Muwaqqi'in']\nAuthor: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died 751 AH)\nInvestigator: Abu Hudhayfah Ibrahim bin Muhammad\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nAuthor: Muhammad bin Abi Bakr bin Ayyub bin Sa'd Shams al-Din Ibn Qayyim al-Jawziyya (Died 751 AH)\nInvestigator: Abu Hudhayfah Ibrahim bin Muhammad\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nInvestigator: Abu Hudhayfah Ibrahim bin Muhammad\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nInvestigator: Abu Hudhayfah Ibrahim bin Muhammad\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\nNote: This entire book is part of the author's book 'I'lam al-Muwaqqi'in' (1 / 309 - 377, Atta'at al-Ilm edition)\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\n\n[Book numbering matches the printed version]\nPublication date in Shamela: 8 Dhu al-Hijjah 1431\nPublication date in Shamela: 8 Dhu al-Hijjah 1431",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 3
  },
  {
    "serial_number": "1015810",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 2,
    "volume_number": 1,
    "text": "A book that has contained pearls ... Observed with the eye of beauty\nFor this I said as a note ... Copyrights are reserved (for the publisher)\nSahaba Library in Tanta\nNext to the train station - Behind Al-Azhar Institute\nWestern Janbiyya Street",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 4
  },
  {
    "serial_number": "1015811",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\nIntroduction:\nIndeed, praise is due to Allah, we praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and from the bad consequences of our deeds. He whom Allah guides, no one can misguide, and he whom He misguides, no one can guide. I bear witness that there is no god but Allah alone, without partner, and I bear witness that Muhammad is His servant and messenger, may Allah bless him and grant him peace.\nOur author is Imam Ibn Qayyim al-Jawziyya. He was born in an era where sciences flourished and grew up in a house of knowledge and virtue. He took knowledge from the great scholars of his time. He took from his father the science of (Inheritance), and heard (Hadith) from the meteor of his age Al-Nabulsi, Judge Taqi al-Din, Ismail bin Maktum, and Fatima bint Jawhar. He took (Arabic) from Abu al-Fath al-Ba'li and Majd al-Din al-Tunisi. He received Usul and Fiqh from Sheikh Safi al-Din al-Hindi and Sheikh al-Islam Ibn Taymiyyah. Ibn Taymiyyah is considered the first guide for Ibn al-Qayyim and his role model; he was greatly influenced by him and was persecuted for his sake. And Sheikh Ismail al-Harrani.\nImam Ibn al-Qayyim is well-known, and whoever wants to refer to his biography, his works, and what our scholars wrote about him, should refer to these references:\n1 - Al-Bidaya wa al-Nihaya by Hafiz Ibn Kathir Vol 13 / 216, Vol 14 / 234, 235.\n2 - Al-Durar al-Kamina fi A'yan al-Mi'a al-Thamina Vol 3 / 400, Vol 4 / 21, 23 by Ibn Hajar al-Asqalani, Hyderabad edition.\n3 - Ibn al-Qayyim fi Atharihi al-Ilmiyya - Ahmad Maher al-Baqri. University Book Institution edition, Alexandria.",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 5
  },
  {
    "serial_number": "1015812",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 4,
    "volume_number": 1,
    "text": "4 - Al-Wafi bi al-Wafayat 2, 270 / 272 Al-Safadi.\n5 - Ibn al-Qayyim wa Mawqifuhu min al-Tafkir al-Islami Awfi Hijazi, Egyptian Printing Company.\n6 - Al-Radd al-Wafir 68, 69.\n7 - Al-Nujum al-Zahira 10 / 249 by Ibn Taghri Bardi - Cairo.\n8 - Al-Badr al-Tali 2 / 143, 146 - Al-Shawkani Cairo edition.\n9 - Al-Daris fi Tarikh al-Madaris 2 / 90 Al-Nuaimi. Investigation by Ja'far al-Husseini - Damascus.\n10 - Al-A'lam by Al-Zirikli 6 / 56 Beirut.\n11 - Ibn Qayyim al-Jawziyya by Muhammad Salim al-Ghunaymi, Islamic Office edition.\n12 - Ibn Qayyim al-Jawziyya Asruhu wa Manhajuhu Dr. Abdul Azim Abdul Salam Al-Kulliyyat Al-Azhariyya.\n13 - Hadiyat al-Arifin Asma' al-Mu'allifin wa Athar al-Musannifin 6 / 108 Ismail Pasha al-Baghdadi Istanbul.\n14 - Mu'jam al-Buldan Vol 4, Vol 2 / 38 edition.\n15 - Encyclopedia of Islam 1 / 268.\n16 - Shadharat al-Dhahab fi Akhbar Man Dhahab 6 / 168 by Ibn al-Imad al-Hanbali.\n17 - Tabaqat al-Hanabila Vol 3, Vol 2 / 593. And Dhail Tabaqat al-Hanabila 2 / 447, 452.\n18 - Mukhtasar Tabaqat al-Hanabila by Al-Shatti p. 61.\n19 - Jala' al-Aynayn fi Muhakamat al-Ahmadayn by Al-Alusi p. 20, 30, 32.\n20 - Manhaj Ibn Qayyim al-Jawziyya fi al-Tafsir - Islamic Research Academy edition.\n21 - Bughyat al-Wu'ah 1 / 62, 63.\n22 - Tabaqat al-Mufassirin 2 / 90, 93 Al-Dawudi - Investigation by Ali Muhammad Umar Cairo.\n23 - As well as the introductions with which his books were presented by the pens of investigators, reaching sixty-five books and researches.\nHe was a virtuous scholar, may Allah forgive him and all His working scholars. Amen.",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 6
  },
  {
    "serial_number": "1015813",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 5,
    "volume_number": 1,
    "text": "* Book References relied upon in printing\n* The book was printed under the name (Amthal al-Quran) investigation by Dr. Nasser bin Saad al-Rashidi, Dar Makkah edition in Saudi Arabia. The book reached about sixty-two pages. Its investigator made a commendable effort as he extracted most of its traces with careful comparison of the Book of Parables with its different manuscripts. We took it as a source to rely on in printing after correcting what is in it and vowelizing its verses with the help of the investigation of Professor Saeed Muhammad Nimr al-Khatib, may Allah reward them both with the best reward.\n* It was also printed under the name (Al-Amthal fi al-Quran al-Karim) investigation by Professor Saeed Muhammad Nimr al-Khatib, Dar al-Ma'rifa edition Beirut. Its investigator exerted commendable effort and produced several researches about (Parables) considered an encyclopedia in that, as the book reached about two hundred eighty-eight pages.\n* Dr. Nasser bin Saad al-Rashidi and Professor Saeed Muhammad Nimr al-Khatib referred to the following manuscripts:\n- * Manuscript of the Awqaf Library in Baghdad bearing number 6685 and photocopied at the Scientific Center and Heritage Revival under number (Tafsir 29).\n- * Manuscript at the Great Mosque in Unaizah, symbolized by the symbol (A).\n- * I'lam al-Muwaqqi'in by Ibn al-Qayyim, which is from page (150: 190), symbolized by the symbol (M).\n- * Photocopied manuscript in the library of the father of Professor Muhammad Nimr al-Khatib under number 1457 / M.\n- * Risalat al-Islam magazine issue 67 for the year 1973 and an article by Abdul Rahman al-Tikriti.\n- * And the manuscript of Balıkesir Bagislar library in Turkey, see Turkey Manuscripts 1 / 159.",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 7
  },
  {
    "serial_number": "1015814",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 7,
    "volume_number": 1,
    "text": "Photocopied sample of the first page of manuscript (A)",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 8
  },
  {
    "serial_number": "1015815",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 8,
    "volume_number": 1,
    "text": "Photocopied sample of the second page of manuscript (A)",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 9
  },
  {
    "serial_number": "1015816",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 9,
    "volume_number": 1,
    "text": "Book of Parables by the Scholar Ibn al-Qayyim\nIn the name of Allah, the Most Gracious, the Most Merciful. Praise be to Allah, Lord of the Worlds, and peace and blessings be upon the best of creation, Muhammad, and his family and companions all.\nOur Sheikh, may Allah have mercy on him, said: There are parables in the Quran, and the parables (1) of the Quran are understood only by the knowledgeable. They are the likeness (2) of something to something in its ruling, bringing the reasonable closer to the sensible, or one of the two sensibles to the other, and considering one by the other. Like His saying, Exalted is He, regarding the hypocrites: (Their example is that of one who kindled a fire, but when it illuminated what was around him, Allah took away their light and left them in darkness [so] they could not see. Deaf, dumb and blind - so they will not return [to the right path]. Or [it is] like a rainstorm from the sky within which is darkness, thunder and lightning. They put their fingers in their ears against the thunderclaps in dread of death. But Allah is encompassing of the disbelievers) [to His saying] (Indeed, Allah is over all things competent) (3). So He struck two parables for the hypocrites according to their condition: a fire parable (4) and a water parable, because of what water and fire (5) contain of illumination, brightness, and life. For fire is the substance of light and water is the substance of life. Allah, Glory be to Him, made the revelation sent down from the sky contain the life of hearts and their illumination. Therefore, He called it Spirit and Light (6), and made its acceptors alive in the light, and those who did not raise a head to it dead in darkness.\nHe informed about the condition of the hypocrites regarding their share of the revelation, that they are like one who kindled a fire to light up for him and to benefit from it. This is because they entered into Islam, so they sought light by it and benefited from it.",
    "foot_note": "1. (1) Our Sheikh is Imam Ibn al-Qayyim, and this phrase is from the words of one of Ibn al-Qayyim's students. [And 'Mathal' (Parable) is with Kasra and movement, and from it (The example of Paradise which...)] See Tartib al-Qamus al-Muhit Vol 4 / 203.\n2. In M, A (It is only likening).\n3. Surah Al-Baqarah: 17 - 20.\n4. Addition from M, A.\n5. Referring to the verse (And thus We have revealed to you an inspiration of Our command...) Al-Shura 52 / 53.\n6. The Spirit refers to the Quran and the Light is the Quranic revelation. See Al-Shura: 52. (*)",
    "book_id": "928",
    "new_page_number": 10
  },
  {
    "serial_number": "1015817",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 10,
    "volume_number": 1,
    "text": "Likening the disbelievers to rain accompanied by darkness, thunder, and lightning. They believed in it and mixed with the Muslims. But because their companionship (7) did not have a substance from their hearts of the light of Islam, it disappeared from them and Allah took away their light. He did not say their fire, for fire contains illumination and burning; so Allah took away the illumination in it and left upon them the burning in it, and left them in darknesses not seeing. This is the condition of one who saw then became blind, knew then denied, and entered Islam then separated from it with his heart, not returning to it. That is why He said (8): (So they will not return).\nThen He mentioned their condition regarding the water parable, so He likened them to people in a rainstorm, which is the rain pouring down, meaning descending from the sky (9), in which are darknesses, thunder, and lightning. Because of the weakness of their insights and minds, the deterrents of the Quran, its threats, intimidations, commands, prohibitions, and discourse which resembles thunderbolts became severe upon them. So their condition is like the condition of one struck by rain in which is darkness, thunder, and lightning. Due to his weakness and fear (10), he put his two fingers in his ears fearing a thunderbolt striking him.\nWe and others have witnessed many of the effeminate disciples of the Jahmiyyah (11) and innovators. When they hear something of the verses of Attributes and Hadiths of Attributes contrary to their innovation, you see them turning away from them as if they were frightened donkeys fleeing from a lion. Their effeminate one says: Close this door for us, and read something other than this. You see their hearts turning away while they bolt, due to the heaviness of knowing the Lord, Glory be to Him and Exalted, and His names and attributes on their minds and hearts. Likewise, the polytheists, despite their varying polytheism, if Tawhid (monotheism) is isolated for them and its texts (12) invalidating...",
    "foot_note": "1. (7) In A (But it will accompany them).\n8. In A (He said about them).\n9. (Indeed, We poured water in torrents) See Tafsir Al-Nasafi 1 / 26, and Mufradat Al-Raghib 228.\n10. The pronoun refers to the hypocrites (and his weakness) from A.\n11. Ibn al-Qayyim has his valuable book Al-Sawa'iq al-Mursala 'ala al-Jahmiyyah wa al-Mu'attila. See Maqalat al-Islamiyyin by Al-Ash'ari...\n(12) From M (The texts). (*)",
    "book_id": "928",
    "new_page_number": 11
  },
  {
    "serial_number": "1015818",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 11,
    "volume_number": 1,
    "text": "...their polytheism, which is the water by which life exists, are recited to them, their hearts shrink and it becomes heavy (13) on them. If they found a way to plug their ears, they would do so. Likewise (14), we find the enemies of the Companions of the Messenger of Allah, peace be upon him, finding that very heavy on them, so their hearts denied it. All this is apparent resemblance and verified likeness from their brothers among the hypocrites in the parable Allah struck for them with water. For when their hearts were similar, their deeds were similar (15).\n\nChapter: He, Glory be to Him, mentioned the two parables, water and fire, in Surah Al-Ra'd, but regarding the believers. He said, Exalted is He: (He sends down from the sky, rain, and valleys flow according to their capacity, and the torrent carries a rising foam. And from that [ore] which they heat in the fire, desiring ornaments or utensils, is a foam like it. Thus Allah presents [the example of]...) (16). He likened the revelation He sent down for the life of hearts, hearing, and sight to the water He sent down for the life of the earth with vegetation. He likened hearts to valleys (17). So a big heart holds great knowledge like a big valley holds much water, and a small heart holds according to its size like the small valley. So valleys flowed according to their capacity, and hearts carried guidance and knowledge according to their capacity. Just as the torrent, when it mixes with the earth and passes over it, carries (18) scum and foam, so does guidance and knowledge when it mixes with hearts, it stirs up what is in them of desires and doubts to uproot and remove them. Just as medicine, at the time of drinking it, stirs up the mixtures from the body, so the drinker is distressed (19) by it. It is from the completeness of the medicine's benefit that it stirred them up to remove them, for it does not coexist or dwell with them. Thus (Allah presents Truth and Falsehood). Then He mentioned the fire parable...",
    "foot_note": "1. (13) From M (and became heavy).\n14. From M (And for that).\n15. He means by that the Rafidah, who are the extremist Shia who harm the Messenger of Allah by hating his Companions and insulting them.\n16. Al-Ra'd: 17.\n17. Al-Amthal fi Al-Kitab wa Al-Sunnah: 19.\n18. From M (carried).\n19. From M (so it repeats/distresses). And 'Karabat al-Ard' means turned it over for planting. Mukhtar al-Sihah p. 566. (*)",
    "book_id": "928",
    "new_page_number": 12
  },
  {
    "serial_number": "1015819",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 12,
    "volume_number": 1,
    "text": "...so He said: (And from that [ore] which they heat in the fire, desiring ornaments or utensils, is a foam like it) (20). It is the impurity that comes out when casting gold, silver, copper, and iron (21). The fire brings it out, distinguishes it, and separates it from the substance that is benefited from, so it is thrown away, cast off, and goes as scum. Similarly, desires and doubts are thrown away by the believer's heart, cast off, and expelled, just as the torrent and fire cast off that foam, scum, and impurity. And the clear water settles in the bottom of the valley, from which people drink (22), irrigate, and water their livestock. Likewise, the pure, sincere faith settles in the bottom of the heart and its root, which benefits its owner and by which others benefit (23). And whoever does not understand these two parables and does not ponder them and know what is intended by them is not of their people, and Allah is the Grantor of success.\n\nChapter: And among them is His saying, Exalted is He: (The example of [this] worldly life is but like rain which We have sent down from the sky that the plants of the earth absorb - those from which men and livestock eat - until, when the earth has taken on its adornment and is beautified and its people assume that they have capability over it, there comes to it Our command by night or by day, and We make it as a harvest, as if it had not flourished yesterday. Thus do We explain in detail the signs for a people who give thought) (24). He, Glory be to Him, likened the worldly life in that it beautifies itself in the eye of the beholder, so it pleases him with its adornment and amazes him (25), so he inclines towards it and desires it, being deceived by it. Until, when he thinks he is its owner, capable over it, it is snatched away suddenly (26) when he is most in need of it, and a barrier is placed between him and it. So He likened it...",
    "foot_note": "1. (20) Al-Ra'd: 17.\n21. Tafsir Al-Nasafi 2 / 247, Al-Tabari: 14 / 136.\n22. From M, A (is drunk from).\n23. See Tafsir Al-Tabari 14 / 134, Al-Nasafi 2 / 247 and Ibn Kathir 2 / 508. See Mukhtar al-Sihah p. 509.\n24. Yunus: 24.\n25. In A (so its adornment pleases him and amazes him).\n26. Either by death, which is obvious, or by an illness befalling the person so he does not benefit from it, or by a calamity that sweeps it and removes it. (*)",
    "book_id": "928",
    "new_page_number": 13
  },
  {
    "serial_number": "1015820",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 13,
    "volume_number": 1,
    "text": "...to the land upon which rain descends, so it becomes grassy, its vegetation improves, and its view pleases the beholder, so he is deceived by it and thinks he is capable over it, owning it. Then the command of Allah comes to it, and calamity overtakes its vegetation suddenly, so it becomes as if it did not exist before. Thus his hope is dashed and his hands become empty of it. Such (27) is the condition of the world and the one trusting in it, equally. This is the most eloquent simile and analogy. Since the world is prone to these calamities and Paradise is safe from them, Allah Exalted said: (And Allah invites to the Home of Peace) (28). He named it here the Home of Peace because of its safety from these calamities He mentioned in the world. So He generalized the invitation to it and specified guidance for whom He willed; that is His justice and this is His grace (29).\n\nChapter: And among them is His saying, Exalted is He: (The example of the two parties is like the blind and deaf, and the seeing and hearing. Are they equal in comparison? Then, will you not remember?) (30). He, Glory be to Him and Exalted, mentioned the disbelievers and described them as not being able to hear and not seeing. Then He mentioned the believers and described them with faith, righteous deeds, and submission to their Lord. So He described them with servitude of the apparent and the hidden. He made one of the two parties like the blind and deaf, since his heart was blind to seeing the truth, deaf to hearing it. So he was likened (31) to one whose sight is blind to seeing the truest of things (32) and whose hearing is deaf to hearing sounds. And the other party is seeing of heart, hearing, like the seeing of eye and hearing of ear. The verse contained two analogies and two representations for the two parties. Then He denied equality between the two parties by His saying (Are they equal in comparison) (33).\n\nChapter: And among them is His saying, Exalted is He: (The example of those who take allies other than Allah is like that of the spider) (34). So He mentioned, Glory be to Him, that they are weak and that those they took as allies...",
    "foot_note": "1. (27) In M (So is).\n28. Yunus: 25\n29. Mu'tarak al-Aqran 1 / 467 and Ibn Kathir 2 / 413, Al-Nasafi 2 / 159 and Al-Tabari 11 / 102.\n30. Hud: 24.\n31. In M (So He likened him).\n32. In M, A (seeing things).\n33. Hud: 24 See Tafsir Al-Tabari 12 / 25 and Ghara'ib al-Quran 11 / 17.\n34. Al-Ankabut: 41. (*)",
    "book_id": "928",
    "new_page_number": 14
  },
  {
    "serial_number": "1015821",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 14,
    "volume_number": 1,
    "text": "...are weaker than them. So they, in their weakness and what they intended by taking allies, are like the spider that took a house, which is the frailest of houses and the weakest (35). Under this parable is that these polytheists are at their weakest when they took allies other than Allah. They did not gain from those they took as allies except weakness, as the Almighty said: (And they have taken gods besides Allah that they might be for them a source of honor. No! Those \"gods\" will deny their worship of them and will be against them opponents) (36). And the Almighty said: (And they have taken gods besides Allah that perhaps they would be helped. They are not able to help them, and they [themselves] are for them soldiers in attendance) (37). And He said after mentioning the destruction of the polytheist nations: (And We did not wrong them, but they wronged themselves. And they were not availed at all by their gods which they invoked other than Allah when there came the command of your Lord. And they did not increase them in anything but ruin) (38). These are four places in the Quran indicating that whoever takes an ally other than Allah to be strengthened by, to increase by, and to be helped by, will not obtain by it except the opposite of his intention. And in the Quran there is more than that. This is one of the best parables and most indicative of the futility of polytheism, the loss of its owner, and his obtaining the opposite of his intention.\nIf it is said: They (39) know that the frailest of houses is the spider's house, so how did He negate their knowledge of that by His saying: (if they only knew). The answer is that He, Glory be to Him, did not negate (40) from them their knowledge of the frailty of the spider's house, but He negated their knowledge that their taking allies other than Him is like the spider taking a house. If they knew that, they would not have done it. But they thought that their taking allies other than Him would benefit them with honor and strength, so the matter was contrary to what they thought (41).",
    "foot_note": "1. (35) In A (For they).\n36. Maryam: 81: 82.\n37. Ya-Sin: 74, 75.\n38. Hud: 101.\n39. In A (For they).\n40. In the original (Yanfa - negates [present tense]), and it should be deleted/changed (Nafa - negated [past tense]).\n41. See Al-Juman 186 - Al-Amthal 27 - 28 and Tafsir Ibn Kathir 3 / 314 and Al-Tabari 20 / 152, 153.",
    "book_id": "928",
    "new_page_number": 15
  },
  {
    "serial_number": "1015822",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 15,
    "volume_number": 1,
    "text": "Chapter: And among them is His saying, Exalted is He: (But those who disbelieved - their deeds are like a mirage in a lowland which a thirsty one thinks is water until, when he comes to it, he finds it is nothing but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account. Or [they are] like darknesses within an unfathomable sea which is covered by waves, upon which are waves, over which are clouds - darknesses, some of them upon others. When one puts out his hand [therein], he can hardly see it. And he to whom Allah has not granted light - for him there is no light) (42).\nHe, Glory be to Him, mentioned two parables for the disbelievers: a parable of a mirage and a parable of accumulated darknesses. That is because those turning away from guidance and truth are of two types. One of them thinks he is on something (right), then it becomes clear to him upon the uncovering of realities the opposite of what he thought. This is the condition of the people of ignorance and people of innovations and desires who think they are on guidance and knowledge. When realities are uncovered, it becomes clear to them that they were not on anything, and that their beliefs (43) and deeds (44) which were based on them were like a mirage seen in the eyes (45) of beholders as water, yet has no reality. Likewise are the deeds (46) that are for other than Allah Almighty and not on His command; the doer thinks them beneficial to him (47) while they are not so. These are the deeds about which Allah Almighty said: (And We will regard what they have done of deeds and make them as scattered dust (48)). Ponder how Allah, Glory be to Him, placed the mirage in a 'Qi'ah' (lowland), which is the empty land devoid of buildings, trees...",
    "foot_note": "1. (42) Al-Nur: 39 / 40.\n43. He means the Jahmiyyah.\n44. His saying (were based on them...) 'them' pronoun refers to the people of ignorance and innovations who think they are on guidance and light.\n45. In M (like a mirage in a lowland seen in the eye...).\n46. Deeds that are not conforming to Allah's commands and their doer thinks they are beneficial, like the deeds of people of innovations and desires; due to their ignorance they think they are beneficial while in reality there is no good in them.\n47. Addition from M.\n48. Al-Furqan: 24. (*)",
    "book_id": "928",
    "new_page_number": 16
  },
  {
    "serial_number": "1015823",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 16,
    "volume_number": 1,
    "text": "...and plants (49) and people. So the place of the mirage is a desolate land with nothing (50) in it. The mirage has no reality, and that corresponds to their deeds and hearts which became devoid of faith and guidance. Ponder what is under His saying (Which a thirsty one thinks is water). The thirsty one (51) is he whose thirst has become intense, so he saw the mirage and thought it was water, so he followed it but found it nothing; rather it betrayed him when he was most in need of it. Likewise, these people, because their deeds were not in obedience to the Messengers (52), peace be upon them, and were for other than Allah, they were made like a mirage. It was raised for them when they were most thirsty for it (53), but they found nothing and found Allah, Glory be to Him (54), then. So He recompensed them for their deeds and paid them their account in full.\nIn the Sahih from the Hadith of Abu Saeed Al-Khudri (55), may Allah be pleased with him, from the Prophet, peace be upon him, in the Hadith of the Manifestation on the Day of Resurrection: (Then Hell will be brought, displayed as if it were a mirage. It will be said to the Jews: What did you use to worship? They will say: We used to worship Ezra, the son of Allah. It will be said: You lied, Allah has no wife or son. So what do you want? They will say: We want You to give us drink. It will be said: Drink, and they will fall into Hell. Then it will be said to the Christians: What did you use to worship? They will say: We used to worship the Messiah, the son of Allah. It will be said: You lied, Allah had no wife or son. So what do you want? They will say: That You give us drink. It will be said to them: Drink, and they will fall. And he mentioned the Hadith (56)).\nThis is the condition of every owner of falsehood; his falsehood betrays him when he is most in need of it. For falsehood has no reality, and it is like its name, false (Batil). If the belief is not conforming nor true, its object is false. Likewise, if the goal of the deed is false (57), like working for other than Allah Almighty or not on His command, the deed becomes invalid...",
    "foot_note": "1. (49) 'Al-Alam' (People/World) in this sentence is extra, the correct is (and plants, so the place of the mirage is desolate land).\n50. In A (in it).\n51. Al-Nur: 39.\n52. In M (The Messengers).\n53. In M, A (thirstiest they were and most in need they were for it).\n54. Adapted from His saying (but finds Allah before Him, and He will pay him in full his due) Al-Nur: 39.\n55. He is Sa'd bin Malik bin Sinan Al-Khudri, pledged allegiance under the tree. He witnessed what was after Uhud. See Al-Isaba by Ibn Hajar 3 / 414.\n56. Bukhari Book of Tawhid 4 / 201 and Musnad Ahmad 3 / 16 / 17.\n57. He means the deeds. (*)",
    "book_id": "928",
    "new_page_number": 17
  },
  {
    "serial_number": "1015824",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 17,
    "volume_number": 1,
    "text": "...due to the invalidity of its goal, and its doer is harmed by its invalidity and by obtaining the opposite of what he hoped. His deed and belief did not go to waste neither for him nor against him, but he became tormented by the loss of its benefit and by obtaining the opposite of benefit. Therefore, the Almighty said: (but finds Allah before Him, and He will pay him in full his due; and Allah is swift in account) (58). This is the likeness of the misguided who thinks (59) he is on guidance.\n\nChapter: The second type is the owners of the parable of accumulated darknesses. They are those who knew the truth and guidance but preferred the darknesses of falsehood and misguidance over it. So the darkness of nature, the darkness of souls, the darkness of ignorance - since they did not act according to their knowledge so they became ignorant - and the darkness of following error and desire accumulated upon it. So their condition is like the condition of one in a deep sea with no shore, covered by a wave, and above that wave (60) is a wave, and above it is a dark cloud. So he is in the darkness of the sea, the darkness of the wave, and the darkness of the cloud. This corresponds to the darknesses he is in, from which Allah did not bring him out to the light of faith.\nThese two parables, by the mirage which he thought was the substance of life, i.e., water, and the darknesses opposite to light, correspond to the two parables He struck for the hypocrites and believers, which are the water parable and the fire parable (61). He made the share of believers from them life and illumination, and the share of hypocrites from them darkness opposite to light and death opposite to life. Likewise, the disbelievers in these two parables: their share of water is the mirage which deceives the looker at it (62) and has no reality, and their share is accumulated darknesses. This could mean the condition of every sect of the disbelievers, and that they lacked the substance of life and illumination by turning away from revelation, so the two parables would be two descriptions for one described. It could also mean the categorization (63) of the conditions of disbelievers, and that the owners of the first parable are those who acted...",
    "foot_note": "1. (58) Al-Nur: 39.\n59. In A (thinks: thinks his deed).\n60. We repeated (wave) it was not in the original.\n61. Tafsir Ibn Kathir 3 / 296.\n62. In M, A (deceives the looker).\n63. In A (diversified). (*)",
    "book_id": "928",
    "new_page_number": 18
  },
  {
    "serial_number": "1015825",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 18,
    "volume_number": 1,
    "text": "...without knowledge or insight, but on ignorance and good opinion of ancestors, so they thought they were doing good work. And the owners of the second parable are those who preferred misguidance over guidance and preferred falsehood over truth, and became blind to it after seeing it and denied it after knowing it. This is the condition of those who earned anger, and the first is the condition of the misguided. The condition of both groups is contrary to the condition of those upon whom grace has been bestowed, mentioned in His saying, Exalted is He: (Allah is the Light of the heavens and the earth. The example of His light is like a niche within which is a lamp, the lamp is within glass... to His saying... That Allah may reward them [according to] the best of what they did and increase them from His bounty. And Allah gives provision to whom He wills without account) (64). The verses contained the descriptions of the three groups: those upon whom grace has been bestowed, who are the people of light; the misguided, who are the owners of the mirage; and those who earned anger, who are the people of accumulated darknesses. And Allah knows best.\nThe first parable of the two parables is for the owners of invalid deed that does not benefit (65). So those are the owners of invalid deed, and these are the owners of deed that does not benefit and false beliefs. Both are contrary to guidance and the religion of truth. Therefore, He likened the condition of the second group in the crashing of waves of doubts, suspicions, and corrupt sciences in their hearts to the crashing of sea waves in it, and that they are accumulated waves topped by a dark cloud. Thus are the waves of doubts and suspicions in their dark hearts upon which clouds of error, desire, and falsehood have accumulated. Let the intelligent person ponder the conditions of the two groups and match between them and the two parables, he will know the greatness of the Quran and its majesty, and that it is a revelation from a Wise, Praiseworthy One.\nHe, Glory be to Him, informed that the cause of that is that He did not make a light for them (66), but left them in the darkness in which they were created, so He did not bring them out of it to the light. For He, Glory be to Him, is the Ally of those who believe; He brings them out from darknesses into the light. In Al-Musnad from the Hadith of Abdullah bin Umar (67), may Allah be pleased with them both, that the Prophet, peace be upon him...",
    "foot_note": "1. (64) Al-Nur: 38. See Tafsir Al-Kashshaf p. 67.\n65. Dropped from the print (And the second parable is for the owners of sciences, speculation and researches which do not benefit).\n66. See Tafsir Al-Kashshaf 3 / 67.\n67. He is Abdullah bin Umar bin Al-Khattab Al-Adawi Abu Abdul Rahman. See Tajrid Asma' al-Sahaba by Al-Dhahabi Vol 1 / 325.",
    "book_id": "928",
    "new_page_number": 19
  },
  {
    "serial_number": "1015826",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 19,
    "volume_number": 1,
    "text": "...said: (Indeed Allah created His creation in darkness and cast upon them from His Light. Whoever was touched by that Light was guided, and whoever missed it went astray) (68). Therefore I say: The Pen has dried upon the knowledge of Allah. Allah, Glory be to Him, created the creation in darkness. Whoever He wanted to guide, He made for him an existential light by which his heart and soul live, just as his body lives by the spirit He breathes into it. So they are (69) two lives: the life of the body by the spirit, and the life of the spirit and heart by the light. That is why Allah named the revelation Spirit, because real life depends on it, as the Almighty said: (He sends down the angels, with the Spirit of His command, upon whom He wills of His servants) (70). And He said: (He casts the Spirit of His command upon whom He wills of His servants) (71). And He said: (And thus We have revealed to you an inspiration [Spirit] of Our command. You did not know what is the Book or [what is] faith, but We have made it a light by which We guide whom We will of Our servants) (72). So He made His revelation Spirit and Light. Whoever He does not enliven with this Spirit is dead, and whoever He does not make a light for from it is in darknesses; he has no light (73).\n\nChapter: And among them is His saying, Exalted is He: (Or do you think that most of them hear or understand? They are only like cattle; nay, they are even more astray in [their] way) (74). He likened most people to cattle. The common factor between the two types is the equality in not accepting guidance and submitting to it. He made the majority more astray in way than cattle because the beast is guided by its driver, so it is guided and follows the path (75) and does not deviate from it right or left. But the majority, the Messengers call them and guide them to the path, but they do not...",
    "foot_note": "1. (68) Al-Musnad 2 / 176, Sunan Al-Tirmidhi 38 Chapter 18, and Mustadrak Al-Hakim, and Al-Suyuti weakened it.\n69. In M, A (they are both).\n70. Al-Nahl: 2.\n71. Ghafir: 15.\n72. Al-Shura: 52.\n73. See Al-Amthal 26: 27, Al-Juman 177 - 180, Tafsir Al-Tabari 18 / 148 and Ibn Kathir 2 / 296.\n74. Al-Furqan: 44.\n75. See Tafsir Al-Kashshaf Vol 3 / 94.",
    "book_id": "928",
    "new_page_number": 20
  },
  {
    "serial_number": "1015827",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 20,
    "volume_number": 1,
    "text": "...respond and are not guided, and do not distinguish between what harms them and what benefits them. The cattle distinguish between what harms them of plants and path, so they avoid it, and what benefits them, so they prefer it. Allah Almighty did not create for cattle hearts to reason with nor tongues to speak with (76), but He gave that to these, yet they did not benefit from what was made for them of minds, hearts, tongues, hearing, and sight. So they are more astray than beasts, for he who is not guided to rectitude and to the path despite the guide for him (77) is more astray and in a worse condition than he who is not guided where there is no guide with him.\n\nChapter: And among them is His saying, Exalted is He: (He presents to you an example from yourselves. Do you have among those whom your right hands possess any partners in what We have provided for you so that you are equal therein [and] would fear them as your fear of one another? Thus We detail the verses for a people who reason) (78). This is an analogical proof by which Allah, Glory be to Him, argued against the polytheists when they made partners for Him from His servants and property. He established against them an argument whose validity (79) they know from themselves and do not need others for it. One of the most effective arguments is for a person to take from himself and argue against himself with what is established in himself (80) and known to it. So He said (Do you have among those whom your right hands possess of) (81) your slaves and bondmaids partners in wealth and family? meaning, do your slaves share with you in your wealth and families so that you and they are equal in that? Do you fear (82) that they might divide your wealth with you and split it, and appropriate some of it over you as a partner fears his partner? Ibn Abbas said (83): (Do you fear that they inherit from you as you inherit from each other). The meaning is: Do...",
    "foot_note": "1. (76) In A (talk with).\n77. In A, M (to him).\n78. Al-Rum: 28.\n79. See Al-Kashshaf 3 / 221.\n80. In M (with her).\n81. Al-Rum: 28. In the original it appeared distorted (of partners in what We provided you so you are equal therein).\n82. In M (You fear). See Al-Tabari 21 / 39 and Al-Baghawi 5 / 207.\n83. See Al-Tabari 21 / 39 and Al-Khazin and Al-Baghawi 5 / 207. (*)",
    "book_id": "928",
    "new_page_number": 21
  },
  {
    "serial_number": "1015828",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 21,
    "volume_number": 1,
    "text": "...does any of you agree that his slave be his partner in his wealth and family until he equals him in disposing of that, so he fears he might act independently in his wealth with a matter he disposes of, just as he fears others from partners and free men? If you do not accept that for yourselves, why did you equate with Me from My creation one who is owned by Me? If this judgment is false in your natures (84) and minds, even though it is possible upon you, possible in your right, since your slaves are not truly your property but are your brothers whom Allah placed under your hands and you and they are My servants (85); (then how) (86) do you permit the like of this judgment in My right, while those you made partners to Me are My servants, My property, and My creation? Thus is the detailing of verses for those of understanding (87).\n\nChapter: And among them is His saying, Exalted is He: (Allah presents an example: a slave [who is] owned and unable to do a thing and he to whom We have provided from Us good provision, so he spends from it secretly and publicly. Can they be equal? Praise to Allah! But most of them do not know. And Allah presents an example of two men, one of them dumb and unable to do a thing, while he is a burden to his guardian. Wherever he directs him, he brings no good. Is he equal to one who commands justice, while he is on a straight path?) (88). These are two parables containing two analogies of the reverse analogy, which is negating the ruling due to negating its cause and reason. For analogy is of two types: direct analogy (Tard) necessitating affirmation of the ruling in the branch due to the affirmation of the original cause in it, and reverse analogy (Aks) necessitating negating the ruling from the branch due to negating the cause of the ruling in it.\nThe first parable is what Allah, Glory be to Him, struck for Himself and for idols. For Allah, Glory be to Him, is the Owner of everything, He spends how He wills on His servants secretly and publicly, night and day. His right hand is full, nothing decreases it but a spending pouring night and day. And idols are owned, helpless, unable to do anything. So how do you make them partners to Me and worship them besides Me despite this great disparity and clear difference? This is the saying of Mujahid and others (89). And Ibn...",
    "foot_note": "1. (84) Your minds/thoughts.\n85. In M (slaves to Me).\n86. Addition from M.\n87. See Tafsir Ibn Kathir, 21 / 38 and Al-Tabari 38 and Al-Amthal: 28.\n88. Al-Nahl: 75, 76 See Al-Zamakhshari 2 / 420 - 421.\n89. See Tafsir Al-Tabari 14 / 149 - 150 and Ibn Kathir 2 / 578. (*)",
    "book_id": "928",
    "new_page_number": 22
  },
  {
    "serial_number": "1015829",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 22,
    "volume_number": 1,
    "text": "...Abbas said (90): It is a parable Allah Almighty struck for the believer and the disbeliever. He likened the believer in the good he has, then He provided him from it good provision, so he spends from it on himself and on others secretly and publicly. And the disbeliever is in the position of an owned (helpless) (91) slave who is unable to do anything because he has no good. So do the two men equal in the view of any rational person? The first saying is more similar to the intent, for it is more apparent in the invalidity of polytheism, clearer to the addressee, greater in establishing the argument, and closer in relation (92) to His saying: (And they worship besides Allah that which does not possess for them [the power of] provision from the heavens and the earth at all, and [in fact], they are unable. So do not assert similarities to Allah. Indeed, Allah knows and you do not know) (93). Then He said: (Allah presents an example: a slave [who is] owned and unable). And from the implications of this parable and its rulings is that the monotheist believer is like the one He provided from it good provision, and the polytheist disbeliever is like the owned slave who is unable to do anything. This is of what the parable alerted to and guided to, so Ibn Abbas mentioned it alerting to its intention because (94) the verse specified it. Ponder it, for you will find it often in the speech of Ibn Abbas (95) and others of the predecessors in understanding the Quran; the thinker thinks that is the meaning of the verse which has no other meaning, so he narrates his saying (96).\n\nChapter: As for the second parable, it is a parable Allah, Glory be to Him, struck for Himself and for what they worship (97) besides Him also. For the idol they worship besides Him (98) is in the position of a dumb man who does not reason or speak; rather he is dumb of heart and tongue, lacking speech of heart...",
    "foot_note": "1. (90) See Zad al-Masir 4 / 474 and Ibn Kathir 2 / 578 and Al-Tabari 14 / 149.\n91. Addition from M, A.\n92. From M (from it).\n93. Al-Nahl: 73, 74.\n94. In M, A (Not that the verse).\n95. Nicknamed the Ink (Hibr) and the Sea (Bahr), cousin of the Messenger of Allah, and the Messenger of Allah, peace be upon him, prayed for him (O Allah, grant him understanding in religion and teach him interpretation) and it was so.\n96. Al-Tabari 14 / 148 - 151.\n97. In M (He is worshipped).\n98. In M (Besides Allah) and in A (From besides Allah). (*)",
    "book_id": "928",
    "new_page_number": 23
  },
  {
    "serial_number": "1015830",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 23,
    "volume_number": 1,
    "text": "...and tongue. With this, he is helpless, unable to do anything at all. And with this, wherever you send him, he brings you no good nor fulfills a need for you. And Allah, Glory be to Him, is Living, Capable, Speaking, commanding justice, and He is on a straight path. This is a description of Him with the utmost perfection and praise. For His commanding justice, which is the truth, implies that He, Glory be to Him, is knowing of it, teaching it, pleased with it, commanding His servants with it, loving its people, not commanding other than it; rather He is exalted above its opposite which is injustice, oppression, foolishness, and falsehood. Indeed, His command and law are all justice. The people of justice are His allies and loved ones, and they are the ones neighboring Him (99) in it on His right on pulpits of light.\nHis commanding justice includes the legislative religious command and the predestined universal command; both are justice with no injustice in them whatsoever, as in the Sahih Hadith: (O Allah, I am Your servant, son of Your servant, son of Your maidservant, my forelock is in Your hand, Your command over me is forever executed and Your decree over me is just) (100). His decree is His universal command, for His command when He wills a thing is only to say to it, \"Be,\" and it is. So He does not command with truth and justice (101). And His decree and destiny established by Him are truth and justice, even if in the decreed and destined there is what is injustice and oppression. For the decree (102) is other than the decreed, and the destiny is other than the destined.\nThen He informed, Glory be to Him, (that He is on a straight path). This corresponds to the saying of Shu'aib (103), peace be upon him: (Indeed, I have relied upon Allah, my Lord and your Lord. There is no creature but that He holds its forelock. Indeed, my Lord is on a path [that is] straight) (104). His saying: (There is no creature but that He holds its forelock) corresponds to his saying: (my forelock is in Your hand). And His saying: (Indeed, my Lord is on a path [that is] straight) corresponds to his saying (Your decree over me is just). The first is His sovereignty and the second is His praise. And He, Glory be to Him, to Him belongs sovereignty and to Him belongs praise. His being, Glory be to Him, on a straight path implies that He does not say except the truth, and does not command except with justice, and does not do except what is interest, wisdom, and justice...",
    "foot_note": "1. (99) In A (Neighboring Him).\n100. Musnad Ahmad 1 / 391 / 452 and see Al-Kashshaf 2 / 276, 277.\n101. In A (with truth and justice).\n102. In M (So the decree).\n103. The correct is that it is Hud as in M, A, not Shu'aib.\n104. Hud: 56. (*)",
    "book_id": "928",
    "new_page_number": 24
  },
  {
    "serial_number": "1015831",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 24,
    "volume_number": 1,
    "text": "...so He is upon truth in His sayings and actions. He does not decree upon the servant what would be unjust to him by it, nor does He take him without his sin, nor decrease anything of his good deeds, nor burden him with evil deeds other than those he did not do and did not cause (105) anything, nor does He hold anyone accountable for the sin of another. He never does what He is not praised for and commended for, and in which there are praiseworthy consequences and sought ends. For His being on a straight path refuses all that.\nMuhammad bin Jarir Al-Tabari (106) said: And His saying: (Indeed, my Lord is on a path [that is] straight) says: Indeed my Lord is on the path of truth, recompensing the doer of good among His creation with His goodness and the evildoer with His evil. He does not wrong any of them a thing, and accepts nothing from them except Islam and faith (Then he narrated from Mujahid (107) via Shibl from Ibn Abi Najih from him: (Indeed, my Lord is on a path [that is] straight) He said: The truth. Likewise, Ibn Jurayj narrated it from him (108).\nA group said: It is like His saying (Indeed, your Lord is in observation) (109). This is a difference of expression, for His being in observation is recompensing the doer of good with His goodness and the evildoer with His evil.\nA group said: In the speech is an omission whose estimation is: Indeed my Lord urges you to a straight path and incites you to it (110). These, if they meant that this is the meaning of the verse intended by it, it is not as they claimed, and there is no evidence for this estimated (omission). Glory be to Him, He differentiated between His being commanding justice and His being on a straight path. If they meant that His urging to the straight path is part of being on a straight path, they are correct.\nAnother group said: The meaning of His being on a straight path is that the return of servants and all matters...",
    "foot_note": "1. (105) In A (He causes with it).\n106. Tafsir: 12 / 60 He is the majestic Imam author of many classifications died in 310 AH.\n107. One of the prominent Imams of the Tabi'in.\n108. He is Imam Abdul Malik bin Abdul Aziz bin Jurayj Al-Dawsi Al-Umawi author of classifications died in 150 AH See Zad al-Masir 4 / 118.\n109. They are the Ash'aris See Ghara'ib al-Quran 12 / 39, Zad al-Masir 4 / 401 and Al-Razi 17 / 13.\n110. Al-Khazin and Al-Baghawi 3 / 238. (*)",
    "book_id": "928",
    "new_page_number": 25
  },
  {
    "serial_number": "1015832",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 25,
    "volume_number": 1,
    "text": "...is to Allah, nothing (111) of them escapes Him. These, if they meant that this is the meaning of the verse, it is not so. If they meant that this is of the implications of His being on a straight path and of its requirements and mandates, then it is true.\nAnother group said: Its meaning is everything is under His power and compulsion and in His sovereignty and grasp (112). This, although true, is not the meaning of the verse. Shu'aib (113), peace be upon him, differentiated between his saying: (There is no creature but that He holds its forelock) and his saying: (Indeed, my Lord is on a path [that is] straight). They are two independent meanings. The saying is the saying of Mujahid (114), and it is the saying of the Imams of Exegesis. Arabic language does not bear other than it except with repugnance. Jarir said praising Umar bin Abdul Aziz: (115)\nCommander of the Faithful, on a path * If resources become crooked, straight\nAnd the Almighty said: (Whoever Allah wills - He leaves astray; and whoever He wills - He puts him on a straight path) (116). Since Allah Almighty is the one who put His Messengers, peace be upon them, and their followers on the straight path in their sayings and actions, He, Glory be to Him, is more worthy to be on a straight path in His saying and action. Even if the path of Messengers and their followers is agreeing with His command, His path which He, Glory be to Him, is upon is what His praise, perfection, and glory require of saying truth and doing it. And with Allah is success.\n\nChapter: And in the verse is a second saying like the first verse equally (117), that it is a parable Allah struck for the believer and the disbeliever. What is in the meaning (118) of this saying has preceded. And Allah is the Grantor of success.",
    "foot_note": "1. (111) In the original (a thing).\n112. Ibn Kathir 2 / 450.\n113. Hud, not Shu'aib as in A.\n114. Al-Tabari 12 / 61.\n115. Diwan Jarir 1 / 218 praising Hisham bin Abdul Malik.\n116. Al-An'am: 39.\n117. In A (other than).\n118. The word (meaning) is missing from M, A. (*)",
    "book_id": "928",
    "new_page_number": 26
  },
  {
    "serial_number": "1015833",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 26,
    "volume_number": 1,
    "text": "Chapter: And among them is His saying, Exalted is He, in likening those who turned away from His speech and pondering it: (Then what is [the matter] with them that they are turning away from the reminder? As if they were frightened donkeys. Fleeing from a lion?) (119). He likened them in their turning away and aversion from the Quran to donkeys that saw the lion and archers so they fled from it. This is of the wondrous representation (120). For the people, out of their ignorance of what Allah, Glory be to Him, sent His Messenger, peace be upon him, with, are like donkeys; they do not understand anything. When they hear the voice of the lion or the archer, they flee from it with intense aversion. This is the utmost blame for these, for they fled from the guidance in which is their happiness and life like the fleeing of donkeys from what destroys and hamstrings them.\nUnder 'Mustanfira' (frightened/alerted) is a meaning more eloquent than 'Nafira' (fleeing). For due to the intensity of their aversion, some of them alerted others and incited them to flee. For in the 'Istif'al' (verb form) of seeking there is an amount added to the bare verb. As if they advised each other to flee and colluded on it. Whoever read it with Fatha on the Fa' (Mustanfara) (122), the meaning is: That the lion alerted them and drove them to flee by his might and intensity (123).\n\nChapter: And among them is His saying, Exalted is He: (The example of those who were entrusted with the Torah and then did not take it on is like that of a donkey who carries volumes [of books]. Wretched is the example of the people who deny the signs of Allah. And Allah does not guide the wrongdoing people) (124). He, Glory be to Him, analogized whoever He entrusted with His Book to believe in it, ponder it, work by it, and call to it, then opposed that and did not carry it except on memory (by heart), so he read it (125) without pondering, nor understanding, nor following it, (nor) (126) judging by it and working according to its requirement, to a donkey on whose back is a load of books; he does not know what is in them, and his share of them is carrying them on his back, nothing else. So his share...",
    "foot_note": "1. (119) Al-Muddaththir: 49 - 51.\n120. In M (Analogy and Representation).\n121. A (Seeking forgiveness).\n122. See Ma'ani al-Quran 3 / 206 and Imla' Ma Manna Bihi Al-Rahman 2 / 273 and Al-Kafi 186.\n123. Tafsir Al-Nasafi 4 / 312.\n124. Al-Jumu'ah: 5.\n125. M, A (so his reading).\n126. Added from M. (*)",
    "book_id": "928",
    "new_page_number": 27
  },
  {
    "serial_number": "1015834",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 27,
    "volume_number": 1,
    "text": "...from the Book of Allah is like the share of this donkey from the books that are on his back. This parable, although struck for the Jews, is inclusive in terms of meaning of anyone who carried the Quran but abandoned working by it, did not fulfill its right, and did not observe it with true observance (127).\n\nChapter: And among them is His saying, Exalted is He: (And recite to them the news of him to whom We gave [knowledge of] Our signs, but he detached himself from them; so Satan pursued him, and he became of the deviators. And if We had willed, we could have elevated him thereby, but he adhered [instead] to the earth and followed his own desire. So his example is like that of the dog: if you chase him, he pants, or if you leave him, he [still] pants. That is the example of the people who denied Our signs. So relate the stories that perhaps they will give thought) (128). He, Glory be to Him, likened he whom He gave His Book and taught the knowledge which He withheld from others, so he abandoned working by it, followed his desire, preferred Allah's wrath over His pleasure, his world over his Hereafter, and the created over the Creator, to the dog, which is one of the vilest animals, lowest in rank, most malicious (129) in soul, its concern does not go beyond its belly, and the most greedy and covetous. From its greed is that it does not walk except with its snout on the ground sniffing and smelling out of greed and covetousness. It constantly smells its anus unlike other parts. If you throw a stone at it, it returns to it to bite it out of excessive gluttony. It is one of the most humiliated animals, most bearing of insult, most pleased with filth; rotting carcasses are more beloved to it than fresh meat, and filth is more beloved to it than sweets. If it gets hold of a carcass sufficient for a hundred dogs, it does not leave a dog (130) to partake with it of it anything except it growls at it and overpowers it (131) due to its greed, stinginess, and evil. Of the wonder of its affair and greed is that if it sees someone of shabby appearance, wretched clothes, and miserable state, it barks at him and attacks him as if imagining his sharing with him and disputing with him in his food. And if it sees someone of good appearance, beautiful clothes, and leadership, it puts its snout (132) on the ground and humbles itself to him and does not raise its head to him. And in likening one who preferred the world and its immediate gain over...",
    "foot_note": "1. (127) Al-Juman 312 / 313.\n128. Al-A'raf: 176.\n129. In M, A (most mean).\n130. In M (one dog).\n131. In M (except by overcoming and overpowering).\n132. Its nose. (*)",
    "book_id": "928",
    "new_page_number": 28
  },
  {
    "serial_number": "1015835",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 28,
    "volume_number": 1,
    "text": "...Allah and the Hereafter despite his abundant knowledge, to the dog in its panting (133) is a wondrous secret. It is that he whose condition is what Allah mentioned of his detachment from His signs and following his desire, was only due to the intensity of his panting (grief/anxiety) for the world because of the severance of his heart from Allah and the Hereafter; so he is intensely panting for it. His panting corresponds to the constant panting of the dog in the state of its disturbance and leaving. 'Lahf' (grief/anxiety) and 'Lahth' (panting) are siblings and brothers in word and meaning. Ibn Jurayj said: (134) (The dog has a severed heart, it has no heart. If you chase him he pants or if you leave him he pants. So he is like the one who leaves guidance, he has no heart, his heart is only severed). I said: His intent by the severance of his heart is that he has no heart to carry him to patience and leaving panting. Likewise, he who detached from Allah's signs, there remained with him no heart to carry him to patience from the world and leaving panting for it. This one pants for the world due to lack of patience for it, and that one pants due to lack of patience for water. For the dog is one of the animals with least patience for water. If it gets thirsty, it eats the damp earth from thirst, even if it had patience for hunger (135). In any case, it is one of the animals most panting; it pants standing, sitting, walking, and stopping. That is due to the intensity of its greed; the heat of greed in its liver necessitates for it constant panting. Thus is the likened one; the intensity (136) of the heat of desire in his heart necessitates for him constant panting (137). If you load upon him with admonition and advice, he pants, and if you leave him and do not admonish him, he pants. Mujahid said (138): And that is the example of the one who was given the Book and did not work by it. Ibn Abbas said (139): If you load the word upon him he does not carry it, and if you leave him he is not guided to good...",
    "foot_note": "1. (133) In M (his grief).\n134. In M (Even if he has patience for hunger). Previously defined, see Al-Tabari 9 / 129.\n135. In M (Even if he has for hunger).\n136. In M (intensity of greed and heat of desire).\n137. In M (Grief).\n138. Tafsir Mujahid 1 / 251, Al-Tabari 9 / Al-Baghawi 2 / 315.\n139. Al-Tabari 9 / 129. (*)",
    "book_id": "928",
    "new_page_number": 29
  },
  {
    "serial_number": "1015836",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 29,
    "volume_number": 1,
    "text": "...like the dog; if it is crouching it pants, and if driven away it pants. Al-Hasan said: (140) (He is the hypocrite, he does not stand firm on truth, whether called or not called, admonished or not admonished, like the dog pants whether driven away or left). Ata said (141): It barks whether you load on it or do not load on it. Muhammad bin Qutaybah said (142): (Everything that pants only pants from fatigue or thirst except the dog, for it pants in the state of fatigue or the state of rest, the state of health and the state of sickness and thirst. So Allah struck it as a parable for one who denied His signs). Ibn Atiyyah said: (If you admonish him he is astray, and if you leave him he is astray. Like the dog, if you drive it away it pants, and if you leave it as is it pants. Corresponding to it is His saying, Exalted is He: (And if you invite them to guidance, they will not follow you. It is all the same for you whether you invite them or you are silent) (143). Ponder what is in this parable of wisdom and meaning. Among them is His saying: (And We gave him Our signs). So He informed, Glory be to Him, that He is the One who gave him His signs, for they are a blessing, and Allah is the One who bestowed them upon him, so He attributed them to Himself. Then He said: (but he detached himself from them) i.e., exited from them as the snake detaches from its skin, and separated from it the separation of the skin detaching from the flesh. He did not say 'So We detached him from them' because he is the one who caused his detachment from them by following his desire. And among them is His saying, Glory be to Him: (so Satan pursued him) i.e., caught up with him and overtook him as the Almighty said regarding Pharaoh's people: (So they pursued them at sunrise (144)). He was preserved, guarded by Allah's signs, protected in side by them from Satan; he (Satan) would not attain anything from him except by surprise and snatching. When he detached from Allah's signs, Satan seized him the seizure of the lion of its prey. So he became of the deviators working contrary to their knowledge, those who know the truth and work...",
    "foot_note": "1. (140) Al-Tabari 9 / 129 and Ibn Kathir 2 / 267.\n141. Al-Kashf wa Al-Bayan: 131.\n142. See Tarikh Baghdad Vol 2 died in 389 AH. See Ta'wil Mushkil al-Quran 365 and Al-Qurtubi / 322, Al-Baghawi 2 / 316.\n143. Tafsir Al-Baghawi 2 / 316.\n144. Al-Shu'ara: 60. (*)",
    "book_id": "928",
    "new_page_number": 30
  },
  {
    "serial_number": "1015837",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 30,
    "volume_number": 1,
    "text": "...contrary to it, like the scholars of evil. And among them is that He, Glory be to Him, said: (And if We had willed, we could have elevated him thereby) (145). So He informed, Glory be to Him, that elevation with Him is not by mere knowledge (for this one was among the scholars) (146), but it is by following the truth, preferring it, and intending the pleasure of Allah Almighty. For this one was among the most knowledgeable people of his time, yet Allah did not elevate him by his knowledge nor benefit him by it. So seek refuge in Allah from knowledge that does not benefit. He informed, Glory be to Him, that He is the One who elevates His servant if He wills by what Allah gave him of knowledge. If Allah does not elevate him, he is put down, no one raises a head to him, for the Lowerer, the Raiser, Allah Glory be to Him, lowered him and did not elevate him. The meaning: If We had willed, We would have favored him, honored him, and raised his rank and status by the signs We gave him. Ibn Abbas, may Allah be pleased with them both, said (147): (If We had willed, We would have elevated him by his knowledge of them). A group said (148): The pronoun in His saying (Larafa'nahu - We could have elevated him) refers to disbelief (Kufr - implied), and the meaning: If We had willed, We would have elevated (removed) disbelief from him by what he has of Our signs. Mujahid and Ata said (149): (We would have raised (removed) disbelief from him by faith and protected him). This meaning is true, and the first is the intended meaning of the verse, and this is of the implications of the intended meaning. It has preceded that the predecessors often alert to the implication of the verse's meaning, so the thinker thinks that is the intended meaning from it. And His saying: (but he adhered [instead] to the earth). Said bin Jubayr said (150): He leaned towards the earth. Mujahid said (151): He settled. Muqatil said (152): He was pleased with the world. And said...",
    "foot_note": "1. (145) Al-A'raf: 176 and see Al-Kashshaf 3 / 115.\n146. Addition in M, A.\n147. See Tafsir Al-Tabari 9 / 127 and Al-Baghawi 2 / 315.\n138. See Zad al-Masir 3 / 190 and Fakhr Al-Razi 15 / 55 and Ruh al-Ma'ani 3 / 163.\n149. Mujahid bin Jubayr Al-Makki 21 - 103 AH, one of the prominent Tabi'in. Imam Al-Thawri said about him (If the interpretation comes to you from Mujahid, it is sufficient). See Al-Baghawi and Al-Khazin 2 / 315 (Mujahid and Ata said).\n150. Said bin Jubayr bin Hisham Al-Asadi Al-Wali died in 95 AH See Al-Qurtubi 7 / 321 and Al-Tabari 9 / 127.\n151. Al-Qurtubi 7 / 322 and Al-Tabari 9 / 127.\n152. He is Ibn Sulaiman Al-Balkhi See Al-Burhan by Al-Zarkashi 2 / 158 and Ghara'ib al-Quran 9 / 85. (*)",
    "book_id": "928",
    "new_page_number": 31
  },
  {
    "serial_number": "1015838",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 31,
    "volume_number": 1,
    "text": "Abu Ubaidah (153): (He stuck to it and slowed down. The 'Mukhlid' among men is the one whose walk slows down, and among beasts the one whose central incisors remain until his lateral incisors come out). Al-Zajjaj said (154): Khalada and Akhlada are (one) (155), and its origin is from Khulud which is permanence and remaining. It is said: So-and-so 'Akhlada' and sought refuge in the place if he stayed in it. Malik bin Nuwayrah said:\nWith the sons of a tribe from the tribes of Malik / And Amr bin Yarbu' they stayed and remained (Akhladu).\nI said: And from it is His saying, Exalted is He: (There will circulate among them young boys made eternal (Mukhalladun)) (156) i.e., they were created for remaining, therefore they do not change nor grow old, and they are at one age (157) forever (158). It was said (159) those with earrings in their ears and bracelets on their hands (160). The owners of this opinion interpreted the word by some of its implications, and that is an indication (161) to making eternal at that age, so it does not contradict the two sayings (162). And His saying: (and followed his own desire). Al-Kalbi said (163): (He followed the lowly matters and left their high ones). Abu Ruq said (164) (He chose the world over the Hereafter). Ata said: (165)",
    "foot_note": "1. (153) See Al-Tabari 9 / 128 and Majaz al-Quran 9 / 85.\n154. The Grammarian and his interpretation Ma'ani al-Quran Al-Baghawi 2 / 315 and Al-Razi 15 / 56 and Zad al-Masir 3 / 290.\n155. Addition from Al-Baghawi.\n156. Al-Waqi'a: 17.\n157. In M (on that).\n158. Zad al-Masir 8 / 136.\n159. In M (they are the ones with earrings).\n160. Gharib al-Quran 153, and Zad al-Masir 8 / 136.\n161. In M, A (sign of making eternal).\n162. In M, A (so no contradiction between the two sayings).\n163. Al-Kalbi is Abu al-Nadr Muhammad bin al-Sa'ib bin Bishr al-Kalbi al-Kufi See Mizan al-I'tidal 3 / 61. And Al-Kashf wa Al-Bayan 131.\n164. Al-Kashf wa Al-Bayan 131. He is Atiyyah bin al-Harith al-Kufi mentioned by Sa'd in the fifth layer of Kufans. See Al-Tabaqat 6 / 369.\n165. Al-Baghawi 2 / 315. (*)",
    "book_id": "928",
    "new_page_number": 32
  },
  {
    "serial_number": "1015839",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 32,
    "volume_number": 1,
    "text": "He wanted the world and obeyed... his devil). Ibn Zaid said (166): (His desire was with the people), meaning those who fought Moses, peace be upon him, and his people. Yaman said: (He followed his wife because she was the one who induced him to do what he did (167). If it is said: Rectification (Istidrak) with 'Lakin' (But) implies establishing after it the negation (168) of what is before it or negating what was established, as you say: If I willed I would have given him but I did not give him, and if I willed I would not have done such but I did it. So rectification implies (And if We had willed, we could have elevated him thereby) but We did not will, or so We did not elevate but he adhered (169). So how did He rectify with His saying: (but he adhered [instead] to the earth) after His saying: (And if We had willed, we could have elevated him (170) thereby)? It is said: This is of speech in which the meaning is observed (171), turning away from observing words to meanings. That is that the implication of His saying: (And if We had willed, we could have elevated him thereby) is that he did not undertake the causes that necessitate his elevation by signs, of preferring Allah and His pleasure over his desire, but he preferred the world and adhered to the earth and followed his desire. Al-Zamakhshari said (172) (The meaning: And if he stuck to Our signs We would have elevated him by them. So He mentioned Will (Mashi'a) while intending what follows it and is caused by it. He said: Do you not see His saying: (but he adhered), so He rectified the Will by his adherence which is his action. So (And if We had willed) must be in the meaning of what is his action. If the speech were on its apparent meaning, it would have been necessary to say: And if We had willed, We would have elevated him but We did not will). This (173) from him is a trait we know from a Qadari (denier of destiny) negating the general Will, going far afield in making the speech of Allah Mu'tazili...",
    "foot_note": "1. (166) See Zad al-Masir 3 / 290 and Al-Baghawi 2 / 315 and Al-Qurtubi 7 / 322.\n167. Al-Kashf wa Al-Bayan 131 and Zad al-Masir 3 / 290 and Fath al-Qadir 2 / 265.\n168. In M, A (establishing after it what negates before it).\n169. Not in M.\n170. Al-A'raf: 176.\n171. In M, A (the side of meaning).\n172. He is Abu al-Qasim Jar Allah Muhammad al-Zamakhshari died in 538 AH. He was a scholar and Imam in language, grammar, and exegesis. See his exegesis Al-Kashshaf 1 / 587. It is preferred to read the investigated copy of Al-Kashshaf to clarify what is in it of Mu'tazilism and commenting on it.\n173. See Al-Kashshaf 2 / 131 with the same text. (*)",
    "book_id": "928",
    "new_page_number": 33
  },
  {
    "serial_number": "1015840",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 33,
    "volume_number": 1,
    "text": "...Qadari. Where is His saying: (And if We had willed) from his saying: And if he stuck to them? Then if sticking to them is dependent on the will of Allah - and that is the truth - his principle is invalid. And his saying: (That the will of Allah follows his sticking to His signs follows the will of Allah Almighty), so the will of Allah, Glory be to Him, is followed not follower. He said: And a cause not an effect, and a necessitating cause not a necessitated one (174). So what Allah willed, its existence was necessary, and what He did not will, its existence was impossible.\n\nChapter: And among them is His saying, Exalted is He: (O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful) (175). This is of the best representative analogy. For He likened tearing the honor of (the brother to tearing his flesh. And since the backbiter tears the honor) of his brother in his absence, he was like one cutting his flesh in the state of the absence of his spirit from him by death. Since the backbited is unable to defend himself by being absent from his blame, he was like the dead whose flesh is cut and cannot defend himself. Since the requirement of brotherhood is mercy, connection, and support, and the backbiter attached to it the opposite of its requirement, of blame, faulting, and defamation, that was like (176) his cutting the flesh of his brother. Brotherhood requires preserving him, protecting him, and defending him. Since the backbiter enjoys (177) his backbiting and blame, finding it sweet, he was likened to eating his brother's flesh after cutting it. Since the backbiter loves that, admiring it, he was likened to one who loves eating his brother's flesh dead. His love for that is an amount added to merely eating it, just as eating it is an amount added to tearing it. Ponder this simile and representation, the goodness of its location, and the correspondence of the reasonable in it to the sensible. Ponder His informing about them hating eating the flesh of the brother dead, and describing them with that at the end of the verse, and denying upon them at its beginning that...",
    "foot_note": "1. (174) In A (necessitating not necessitated).\n175. Al-Hujurat: 12 See Al-Kashshaf 3 / 567.\n176. In A (in the position of).\n177. In M (enjoying the honor of my brother, amusing himself) and in A (enjoying). (*)",
    "book_id": "928",
    "new_page_number": 34
  },
  {
    "serial_number": "1015841",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 34,
    "volume_number": 1,
    "text": "...one of them loves that. So just as this is hated in their natures, how do they love what is like it and similar to it? He argued against them with what they hated against what they loved, and likened for them what they love to what is most hateful to them and what they are most averse to. For this reason, reason, instinct, and wisdom necessitate that they be most averse to what is its analogue and similar (178). And with Allah is success.\n\nChapter: And among them is His saying, Exalted is He: (The example of those who disbelieve in their Lord is [that] their deeds are like ashes which the wind blows forcefully on a stormy day; they are unable [to keep] from what they have earned a [single] thing. That is what is extreme error) (179). He, Exalted is He, likened the deeds of the disbelievers in their invalidity and lack of benefit to ashes over which a strong wind passed on a stormy day. He, Glory be to Him, likened their deeds in their futility and going to waste like scattered dust - because they are on other than a foundation of faith and beneficence, and being for other than Allah Almighty and not on His command - to ashes blown by the stormy wind. Its owner is unable to [keep] anything of it at the time of his intense need for it. Therefore, they are unable to keep from what they have earned a thing; they are unable on the Day of Resurrection to keep anything of what they earned of their deeds. They do not see for them (180) a trace of reward or beneficial utility. For Allah does not accept of deeds except what was purely for His Face, conforming to His law. Deeds are four: one accepted and three rejected. The accepted: The pure and correct. The pure is to be for Allah not other than Him, and the correct is to be of what He legislated on the tongue of His Messenger, peace be upon him. The three rejected: What opposed that.\nIn likening them to ashes is a wondrous secret. That is due to the resemblance between their deeds and ashes in fire burning and removing the origin of this and that. So the deeds that were for other than Allah Almighty and not on His wish were food for the Fire, and by them the Fire is kindled upon their owners. Allah creates for them from their false deeds fire and torment, just as He creates for the people of deeds conforming to His command (181)...",
    "foot_note": "1. (178) In A (its similar).\n179. Ibrahim: 18 Al-Zamakhshari 2 / 372.\n180. In M, A (for it).\n181. In M (to His command and prohibition). (*)",
    "book_id": "928",
    "new_page_number": 35
  },
  {
    "serial_number": "1015842",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 35,
    "volume_number": 1,
    "text": "...which are purely for His Face, from their deeds bliss and mercy. So the Fire affected those deeds until it made them ashes. So they and what they worship besides Allah are fuel for the Fire (182).\n\nChapter: And among them is His saying, Exalted is He: (Have you not considered how Allah presents an example, [making] a good word like a good tree, whose root is firmly fixed and its branches [high] in the sky? It produces its fruit all the time by permission of its Lord. And Allah presents examples for the people that perhaps they will be reminded) (183). He, Glory be to Him, likened the good word to the good tree, because the good word bears righteous deed and the good tree bears beneficial fruit. This is apparent according to the saying of the majority of exegetes who say: (The good word is the testimony that there is no god but Allah (184)). For it bears all outward and inward righteous deeds. Every righteous deed pleasing to Allah Almighty is the fruit of this word. In the exegesis of Ali bin Abi Talha from Ibn Abbas, may Allah be pleased with them both, he said (185): Its root is firmly fixed, the saying (186) of 'There is no god but Allah' in the heart of the believer. And its branches in the sky, he says: The deed of the believer is raised by it to the sky). Al-Rabi' bin Anas said (187): [A good word, this is the parable of faith, and faith is the good tree, and its firmly fixed root which does not move is sincerity in it, and its branch in the sky is the fear of Allah. The simile according to this saying is more correct, more apparent, and better]. For He, Glory be to Him, likened the tree of Tawhid in the heart to the good tree, fixed of root, high of branch in the sky in altitude, which ceases not to give its fruit every...",
    "foot_note": "1. (182) See Al-Tabari 13 - 196 / 197 and Al-Durr Al-Manthur 4 / 75 and Al-Baghawi 4 / 37.\n183. Ibrahim: 24 and Al-Kashshaf 2 / 376.\n184. See Al-Tabari 13 / 203 and Ibn Kathir 2 / 530 and Al-Durr Al-Manthur 4 / 75 Al-Baghawi.\n185. See Ibn Kathir 2 / 530 and Al-Tabari 13 / 203.\n186. In Al-Tabari and Ibn Kathir (he says).\n187. Ibn Jarir 13 / 203, 104. (*)",
    "book_id": "928",
    "new_page_number": 36
  },
  {
    "serial_number": "1015843",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 36,
    "volume_number": 1,
    "text": "...time. If you contemplate this simile, you see it corresponding to the tree of Tawhid fixed, rooted in the heart, whose branches of righteous deeds are ascending to the sky. This tree ceases not to bear righteous deeds at every time according to its firmness in the heart, the heart's love for it, its sincerity in it, its knowledge of its reality, its fulfilling its right (188), and its observing it with true observance. Whoever this word is rooted in his heart with its reality which is its reality, and his heart is characterized by it and dyed by it with the dye of Allah - and who is better in dye than Him - knows the reality of the Form (189) which his heart affirms for Allah, and his tongue testifies to, and his limbs verify. And he negated that reality and its implications from everything other than Allah Almighty. And his heart agreed (190) with his tongue in this negation and affirmation. And his limbs submitted to the One he testified Oneness for, obedient, walking the paths of his Lord submissively, not deviating from them nor seeking a substitute for them, just as the heart does not seek a substitute for its True Worshipped One. There is no doubt that this word from this heart on this tongue ceases not to bear its fruit of righteous deed ascending to the Lord Almighty. This good word bears much good whenever a righteous deed accompanies it (191). So the righteous deed raises the good words as the Almighty said: (To Him ascends good speech, and righteous work raises it) (192). So He informed, Glory be to Him, that righteous work raises good speech, and informed that the good word (193) bears for its sayer at every time a righteous deed at every time. The intended meaning is that the word of Tawhid, if the believer testifies to it knowing its meaning and reality in negation and affirmation, characterized by its requirement, his heart, tongue, and limbs fulfilling his testimony, then this word (194) from this witness, its root is fixed firmness in his heart and its branches are connected...",
    "foot_note": "1. (188) In M (its rights).\n189. In M (The Divine).\n190. In M, A (agreed).\n191. In M, A (bears many good words).\n192. Fatir: 10.\n193. In the original 'Al-Kalim Al-Tayyiba' (Good Words - plural), so we established the Ta' at its end (singular). See Al-Kashshaf 2 / 302.\n194. In M (So this good word is what raised this deed from this witness). (*)",
    "book_id": "928",
    "new_page_number": 37
  },
  {
    "serial_number": "1015844",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 37,
    "volume_number": 1,
    "text": "...to the sky, and it produces its fruit at every time. Among the predecessors are those who said [The good tree is the date palm] (195), and the authentic Hadith of Ibn Umar indicates it (196). And among them are those who said: It is the believer himself, as Muhammad bin Sa'd said: My father told me, my uncle told me, my father told me from his father from Ibn Abbas his saying: (Have you not considered how Allah presents an example, [making] a good word like a good tree) He means by the good tree the believer, and means by the fixed root in the earth and the branch in the sky that the believer works in the earth and speaks, so his saying and deed reach the sky while he is in the earth (197). Atiyyah Al-Awfi said regarding (Allah presents an example, [making] a good word like a good tree) He said (198): (That is the parable of the believer; good speech and righteous deed cease not to come out from him ascending to Allah). Al-Rabi' bin Anas said (199): (whose root is firmly fixed and its branches [high] in the sky) He said: That is the believer, his parable was struck in sincerity to Allah alone and His worship alone without partner. (He said: whose root is firmly fixed) He said: The root of his deed is fixed in the earth (and its branches [high] in the sky) He said: His mention in the sky. There is no difference between the two sayings. The intended by the parable is the believer, and the date palm is likened to him and he is likened to it. If the date palm is a good tree, then the believer likened to it is more worthy to be so. Whoever of the predecessors said: It is a tree in Paradise (200), then the date palm is among the most noble trees of Paradise.",
    "foot_note": "1. (195) See Al-Tabari 13 / 204 and Ibn Kathir 2 / 530 and Al-Baghawi 4 / 40 and Tafsir Mujahid 1 / 337.\n196. Sahih Al-Bukhari 1 / 130 and Muslim 4 / 2165 and its text is (Indeed among trees is a tree whose leaves do not fall and it is like the Muslim, so tell me what is it? People fell into naming desert trees. Abdullah said: It fell into my soul that it is the date palm but I was shy. Then they said: Tell us what is it, O Messenger of Allah? He said (It is the date palm).\n197. Ibn Jarir 13 / 204.\n198. Same previous source.\n199. Previously defined.\n200. See Al-Khazin and Al-Baghawi 4 / 40 and Ibn Kathir 2 / 530 and Zad al-Masir 4 / 358. (*)",
    "book_id": "928",
    "new_page_number": 38
  },
  {
    "serial_number": "1015845",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 38,
    "volume_number": 1,
    "text": "In this parable there are secrets, sciences, and knowledge that benefit (201) and are necessitated by the knowledge of Him who spoke it, Glory be to Him, and His wisdom. From that is that a tree must have roots, (a trunk, branches) (202), leaves, and fruit. Likewise is the tree of faith and Islam, to match the likened with the likened to. Its roots are knowledge, gnosis, and certainty. Its trunk is sincerity. Its branches are deeds. Its fruit is what righteous deeds necessitate of praiseworthy effects, commendable attributes, pure morals, righteous conduct, and pleasing guidance and bearing (203). The planting of this tree in the heart and its firmness in it are inferred by these matters. If knowledge is correct, corresponding to its known object which Allah sent down His Book with; and belief corresponds to what He informed about Himself and His messengers informed about Him, prayers of Allah and His peace be upon them; and sincerity is established in the heart; and deeds are conforming to the command; and guidance, bearing, and conduct are similar to these fundamentals, suitable for them; it is known that the tree of faith in the heart, its root is fixed and its branch is in the sky. If the matter is the opposite, it is known that what is established in the heart is only the bad tree which was uprooted from upon the earth, having no stability.\nAnd among them: That the tree does not remain alive except with a substance that waters it and makes it grow. If watering is cut off from it, it is about to dry up. Thus is the tree of Islam (204) in the heart; if its owner does not tend to it by watering it every time with beneficial knowledge and righteous deed, and returning with remembrance to reflection and reflection to remembrance, otherwise it is about to dry up. In the Musnad of Imam Ahmad (205) from the Hadith of Abu Huraira (206), may Allah be pleased with him, he said: The Messenger of Allah, peace be upon him, said: (Indeed faith wears out in the heart as the garment wears out...",
    "foot_note": "1. (201) In M, A (befit it).\n202. Addition from M, A.\n203. Addition from M, A.\n204. In A (tree of faith).\n205. He is the Imam, Muhaddith, Jurist.\n206. He is Abdul Rahman bin Sakhr Al-Dawsi, and he was among the Companions who memorized and narrated Hadith the most. Died in 59 AH. (*)",
    "book_id": "928",
    "new_page_number": 39
  },
  {
    "serial_number": "1015846",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 39,
    "volume_number": 1,
    "text": "...so renew your faith) (207). In summary, if the planting is not tended to by its owner, it is about to perish. From here the intensity of the servants' need for what Allah commanded of acts of worship over the succession of times, and the greatness of His mercy and the completeness of His blessing and kindness to His servants by prescribing them upon them and making them a substance for watering the plants of Tawhid which He planted in their hearts is known.\nAnd among them: That beneficial planting and sowing, Allah Glory be to Him has made it a habit (that) (208) it must be mixed with weeds and foreign plants not of its kind. If its owner tends to it, purifies it, and prunes it, the planting and sowing completes, straightens, its growth perfects, and it becomes more abundant in its fruit, better, and purer. If he leaves it, the weeds are about to overcome the planting and sowing and the rule becomes theirs, or weaken the root and make the fruit blameworthy and deficient according to their abundance or scarcity. Whoever does not have understanding to measure (209) in this and knowledge of it, misses much profit (210) while he does not perceive. So the believer is constantly striving in two things (211): watering this tree and purifying what is around it. By watering it (212), it remains and lasts, and by purifying what is around it, it completes and perfects. And Allah is the One sought for help and upon Him is reliance.\nThis is some of what this great majestic parable contained of secrets and wisdoms. Perhaps it is a drop from a sea according to our falling minds, our confused (213) hearts, our limited knowledge, and our deeds that necessitate repentance and seeking forgiveness. Otherwise, if hearts were purified from us, minds cleared, souls purified, deeds sincere, and determinations stripped for piety from Allah Almighty...",
    "foot_note": "1. (207) Also in Mu'jam Al-Tabarani and Al-Mustadrak and Al-Mulakhkhas 1 / 4 from Abdullah bin Amr and it is a Hasan Hadith.\n208. Addition in M.\n209. In M (precious understanding) and in A (understanding in the self of this).\n210. Addition in M and in A (he missed much profit).\n211. In A (matter of watering).\n212. The Fa' is extra, was not in the original.\n213. In M (Wrong), which is more correct. (*)",
    "book_id": "928",
    "new_page_number": 40
  },
  {
    "serial_number": "1015847",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 40,
    "volume_number": 1,
    "text": "...and His Messenger, peace be upon him, we would have witnessed from the meanings of Allah's speech, Glory be to Him, and His secrets and wisdoms what sciences dwindle before and knowledge of truth vanishes before. By this the worth of the knowledge of the Companions and their understandings, may Allah be pleased with them, is known, and that the disparity between their knowledge and the knowledge of those after them is like the disparity between them in virtue. And Allah knows best where He places the sites of His favor and whom He singles out for His mercy.\n\nChapter: Then He, Glory be to Him, mentioned the parable of the bad word, so He likened it to the bad tree which was uprooted from upon the earth, having no stability (214). No fixed root, no high branch, no pure fruit, no shade, no harvest, no standing trunk, no root fixed in the earth fed by water, nor is its top pleasing, nor has it harvest, nor does it rise; rather it is risen upon. If the intelligent person contemplates most of the speech of this creation in their discourse and books (215), he finds it so. So the loss, all loss (216), is stopping with it and engaging in it away from the best speech and most beneficial.\nAl-Dahhak said: (217) (Allah struck a parable for the disbeliever with a tree uprooted from upon the earth having no stability). He says: It has no root nor branch, and has no fruit nor benefit in it. Likewise the disbeliever does not do good nor say it, and Allah does not place blessing nor benefit in him. Ibn Abbas said (218): (And the example of a bad word, which is polytheism, is like a bad tree, meaning the disbeliever, uprooted from upon the earth having no stability. He says: Polytheism has no root for the disbeliever to take hold of, nor proof, and Allah does not accept the deed of the polytheist nor does it ascend to Allah. So it has no fixed root in the earth nor branch in the sky. He says: He has no righteous deed in the sky nor in the Hereafter). Al-Rabi' bin Anas said (219): (The parable of the bad tree is the parable...",
    "foot_note": "1. (214) Addition in M.\n115. In M (and their earning).\n216. (Loss) the second is missing from M.\n217. He is Ibn Muzahim Al-Hilali, their client Al-Khurasani, narrated from some Companions and took knowledge from them, died in 105 AH See Al-Tabari 13 / 213.\n219. Tafsir Al-Tabari 13 / 213. (*)",
    "book_id": "928",
    "new_page_number": 41
  },
  {
    "serial_number": "1015848",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 41,
    "volume_number": 1,
    "text": "...of the disbeliever; his saying and deed have no root nor branch, and his saying and deed do not settle on the earth nor ascend to the sky). Said narrated from Qatada regarding this verse: (A man met a man from the people of knowledge and said to him: What do you say about the bad word? He said: I do not know for it a settlement in the earth nor an ascent in the sky, except that it sticks to the neck of its owner until he meets with it on the Day of Resurrection) (220). His saying 'ujtuthat' means uprooted from upon the earth.\nThen He, Glory be to Him, informed about His judgment and justice regarding the two parties, the owners of good words and bad words. He informed that He keeps firm those who believe, with the firm word, when they are most in need of it in the world and the Hereafter, and that He sends astray the wrongdoers, who are the polytheists, from the firm word. So He sent these astray by His justice for their wrongdoing, and kept the believers firm by His grace for their faith.\nUnder His saying: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter) is a great treasure. Whoever finds it, suspects it (221) [values it], improves its extraction and acquisition (222), and spends from it has gained, and whoever is deprived of it has been deprived. That is because the servant is not independent of Allah's keeping firm for the blink of an eye. If He does not keep him firm, the sky of his faith and its earth will vanish from their places. The Almighty said to the most honored of His creation to Him, His servant and Messenger, peace be upon him: (And if We had not strengthened you, you would have almost inclined to them a little) (223). And the Almighty said: ([Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed) (224). In the two Sahihs from the Hadith of Al-Bajali he said: (And he asks for them and strengthens them) (225). And the Almighty said to His Messenger, peace be upon him: (And each [story] We relate to you from the news of the messengers is that by which We make firm your heart) (226).",
    "foot_note": "1. (220) Al-Tabari 13 / 212.\n221. In A, M whoever succeeded to its suspecting place.\n222. In A (and its acquisition).\n223. Al-Isra: 74.\n224. Al-Anfal: 12 See Al-Kashshaf 2 / 460.\n225. Narrated by Al-Tirmidhi 4 / 689 - 690 and Musnad Ahmad 2, 368 / 369 (And he commands them and strengthens them) (226) Hud: 120. (*)",
    "book_id": "928",
    "new_page_number": 42
  },
  {
    "serial_number": "1015849",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 42,
    "volume_number": 1,
    "text": "So all creation are two types: successful by strengthening, and forsaken by leaving strengthening. The substance of strengthening, its origin and source, is from the firm word and doing what the servant is commanded. In both, Allah strengthens His servant. So whatever is firmer in saying and better in deed is greater in strengthening. The Almighty said: (But if they had done what they were instructed, it would have been better for them and a firmer position [for them] in faith) (227). So the firmest people in heart are the firmest in saying. The firm saying is the saying of truth and honesty, and it is the opposite of the false saying, lying. So saying is of two types: firm having reality, and false having no reality. The firmest saying is the word of Tawhid and its implications; it is the greatest thing by which Allah strengthens His servants in the world and the Hereafter. Therefore, you see the truthful as the firmest of people and bravest in heart, and the liar as the most humiliated of people, most malicious, most twisting, and least firm (228). People of insight know the truthfulness of the truthful from the firmness of his heart at the time of testing, his courage and dignity, and know (229) the lie of the liar by the opposite of that. This is not hidden except to one of weak insight. Some were asked about speech he heard from a speaker, so he said: By Allah, I understood nothing from it except that I heard for his speech an assault that is not the assault of a falsifier. So the servant is not granted a gift better than the gift of the firm word). The people of the firm word find its fruit when they are most in need of it in their graves and on the day of their return. As in Sahih Muslim (230) from the Hadith of Al-Bara' (231) bin Azib from the Prophet, peace be upon him: That this verse was revealed regarding the torment of the grave (232). This (233) came clarified in authentic Hadiths. Among them is what is in Al-Musnad from the Hadith of Dawud bin Abi Hind from Abu Nadrah from Abu Saeed who said: We were with the Prophet, peace be upon him, in a funeral, so he said: (O people, indeed this nation is tested in its graves. When a human is buried and his companions disperse from him...",
    "foot_note": "1. (227) Al-Nisa: 66 See Tafsir Al-Kashshaf 1 / 539.\n228. In A (and most cowardly in hesitation) and in M (most cowardly and most twisting).\n229. Addition in M, A (230) He is Hafiz Al-Hussein bin Al-Hajjaj bin Muslim Al-Qushayri Al-Naysaburi born year 304 AH.\n231. Al-Bara' bin Azib bin Al-Harith bin Adi Al-Ansari See Tajrid Al-Asma by Al-Dhahabi 1 / 46.\n232. Muslim 4 / 2201, 2202 Sahih Al-Bukhari 3, 104 / 105 and Al-Nasa'i 4 / 84.\n233. Addition from M, A. (*)",
    "book_id": "928",
    "new_page_number": 43
  },
  {
    "serial_number": "1015850",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 43,
    "volume_number": 1,
    "text": "...an angel comes to him with a hammer in his hand and sits him up and says: What do you say about this man? If he was a believer, he says: I bear witness that there is no god but Allah alone without partner and I bear witness that Muhammad is His servant and messenger. So he says to him: You spoke the truth. Then a door to the Fire is opened for him and it is said to him: This was your place if you had disbelieved in your Lord. But since you believed, Allah has exchanged this for you. Then a door to Paradise is opened for him, so he wants to get up to it. [He says:] Dwell. Then his grave is widened for him. As for the disbeliever and hypocrite, it is said to him: What do you say about this man? He says: I do not know. It is said: You did not know nor were you guided. Then a door to Paradise is opened for him and it is said to him: This was your place if you had believed in your Lord. But since you disbelieved, Allah has exchanged this for you. Then a door to the Fire is opened for him, then the angel strikes him with the hammer a strike heard by all of Allah's creation except the two heavy ones (Jinn and Mankind) (234). Some of his companions said: O Messenger of Allah: There is no one among us whom an angel stands over his head with a hammer except he is terrified at that. The Messenger of Allah, peace be upon him, said: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter. And Allah sends astray the wrongdoers. And Allah does what He wills) (235). And in Al-Musnad (236) from the Hadith of Al-Bara' bin Azib, and Al-Minhal narrated from Amr and from Zadhan from Al-Bara' who said: The Messenger of Allah, peace be upon him, said, and mentioned the seizing of the believer's soul, so he said: A comer comes to him - meaning in his grave - and says: Who is your Lord, what is your religion, and who is your prophet? He says: My Lord is Allah, my religion is Islam, and my prophet is Muhammad, peace be upon him. He said: So he says to him: Who is your Lord and what is your religion? And that is the last trial presented to the believer. So that is when Allah says: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter). So he says: My Lord is Allah, my religion is Islam, and my prophet is Muhammad, peace be upon him. It is said to him: You spoke the truth) (237). This is a Sahih Hadith.",
    "foot_note": "1. (234) Muslim Paradise 67 and Musnad Ahmad 3 / 423 Al-Tabari 13 / 214.\n235. Ibrahim: 27 and see Tafsir Al-Kashshaf 2 / 377.\n236. Musnad Ahmad 4 / 274.\n237. Sunan Abi Dawood and Al-Musnad 2 / 296. We are in the process of printing the book (Sakarat al-Mawt), may Allah grant us success to complete it. (*)",
    "book_id": "928",
    "new_page_number": 44
  },
  {
    "serial_number": "1015851",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 44,
    "volume_number": 1,
    "text": "And Hammad bin Salamah said from Muhammad bin Amr and from Abu Salama from Abu Huraira (238) said: The Messenger of Allah, peace be upon him, said: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter). He said: If it is said to him in the grave: Who is your Lord and what is your religion? He says: My Lord is Allah, my religion is Islam, and my prophet is Muhammad, he came with clear signs from Allah so I believed and verified. It is said to him: You spoke the truth, upon this you lived and upon it you died and upon it you will be resurrected) (239). And Al-A'mash (240) said from Al-Minhal bin Amr from Zadhan from Al-Bara' bin Azib who said: The Messenger of Allah, peace be upon him, said, and mentioned the seizing of the believer's soul, he said: So his soul returns to his body and two stern angels are sent to him. They sit him up and scold him and say: Who is your Lord? He says: Allah. And what is your religion? He says: Islam. They say: Who is this man who was sent among you? He says: Muhammad, the Messenger of Allah. He said: So they say to him: And how do you know? He said: He says: I read the Book of Allah and believed in it and verified. That is the saying of Allah Blessed and Exalted: (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter). Ibn Hibban (241) narrated it in his Sahih and Ahmad (242). In his Sahih also from the Hadith of Abu Huraira raising it (to the Prophet), he said: (Indeed the dead hears the sound of their sandals as they turn away leaving. If he was a believer, prayer was at his head, Zakat on his right, fasting on his left, and doing good deeds of charity, connection, kindness, and benevolence to people at his feet. He is approached from his head, so prayer says: There is no entrance from my side. He is approached from his right, so Zakat says: There is no entrance from my side. He is approached from his left, so fasting says: There is no entrance from my side. He is approached from...",
    "foot_note": "1. (238) See Al-Isaba by Ibn Hajar 4 / 202 - 212.\n239. Sunan Al-Nasa'i - Book of Funerals 114, Musnad Ahmad 3 / 4 and Al-Tabari 13 / 215.\n240. He is Sulaiman bin Mihran Al-Asadi by loyalty Abu Muhammad nicknamed Al-A'mash, the Tabi'i. See Wafayat al-A'yan 1 / 213.\n241. He is Ibn Hatim Muhammad bin Hibban Al-Busti died in 354 AH. See Kashf al-Zunun by Haji Khalifa 2 / 1075.\n242. Al-Tabari 13 / 215 biography of Ahmad. See Kashf al-Zunun 2 / 1680 AH. (*)",
    "book_id": "928",
    "new_page_number": 45
  },
  {
    "serial_number": "1015852",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 45,
    "volume_number": 1,
    "text": "...his feet, so doing good deeds of charity, connection, kindness, and benevolence to people says: There is no entrance from my side. It is said to him: Sit. So he sits. The sun is represented to him as setting. It is said to him: Inform us about what we ask you. He says: And what do you ask me about? He says: Let me pray. It is said: You will do so. But inform us about what we ask you. He says: And what do you ask? It is said to him: Have you seen this man who was sent among you? What do you say about him and what do you testify regarding him? He says: Muhammad, peace be upon him. They say: Yes. He says: I testify that he is the Messenger of Allah and that he brought us clear signs from Allah so we believed him. It is said to him: Upon that you lived and upon that you died and upon that you will be resurrected, Allah willing. Then his grave is widened for him seventy cubits and illuminated for him. Then a door to Paradise is opened for him and it is said: Look at what Allah prepared for you in it. So he increases in joy and happiness. Then his soul is placed among the good souls which are green birds hanging on the trees of Paradise. Then the body is returned to what it started from of dust. That is the saying of Allah (Allah keeps firm those who believe, with the firm word, in worldly life and in the Hereafter) (243). Do not find this intervening chapter too long, for the Mufti, the witness, the judge, rather every Muslim is in more dire need of it than food, drink, and breath. And with Allah is success.\n\nChapter: And among them is His saying, Exalted is He: (So avoid the uncleanliness of idols and avoid false statement. Being true to Allah, not associating anything with Him. And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place) (244). Ponder this parable and its correspondence to the condition of one who associated partners with Allah and attached himself to other than Him. You may have two approaches in this simile: One is to make it a compound simile, so He likened one who associated with Allah and worshipped other than Him...",
    "foot_note": "1. (243) Muslim Paradise 71, Bukhari Funerals 67 and Sunan Abi Dawood and Musnad Ahmad 3 / 233, 347, 445, 4 / 296 and Al-Targhib wa Al-Tarhib 4, 125 / 126 and Al-Tabari 13 / 215 / 216.\n244. Al-Hajj: 30, 31 See Tafsir Al-Kashshaf 3 / 12. (*)",
    "book_id": "928",
    "new_page_number": 46
  },
  {
    "serial_number": "1015853",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 46,
    "volume_number": 1,
    "text": "...to a man who caused the destruction of himself, a destruction with which no salvation is hoped. So He pictured his condition with the image of one who fell from the sky, and birds snatched him in the air, so he was torn into pieces (245) in their crops, or the wind blew him until it threw him in some distant places. Upon this, one does not look at every individual part of the likeness and its counterpart in the likened to.\nThe second is that it be of the separated simile, so every one of the parts of the represented corresponds to the represented by. Upon this, He would have likened Faith (246) and Tawhid in its loftiness, vastness, and honor to the sky, which is its place of ascent and descent; from it it descends to earth and to it it ascends from it. And He likened the leaver of Faith and Tawhid to the one falling from the sky to the lowest of the low in terms of severe constriction and accumulated pains. And the birds that snatch (247) his limbs and tear him, He said every torn part by the devils which Allah Almighty sends upon him, inciting him incitement and disturbing him and worrying him to the places of his destruction. So every devil has a piece of his religion and heart just as every bird has a piece of his flesh and limbs. And the wind that throws him into a remote (248) place is his desire which carries him to throw himself into the lowest place and furthest from the sky.\n\nChapter: And among them is His saying, Exalted is He: (O people, an example is presented, so listen to it. Indeed, those you invoke besides Allah will never create [as much as] a fly, even if they gathered together for that purpose. And if the fly should steal from them a [tiny] thing, they could not recover it from him. Weak are the pursuer and pursued. They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might) (249). It is worthy for every servant to listen (250) to this...",
    "foot_note": "1. (245) In A (so he was torn to pieces) in M (so he was torn pieces).\n246. See Ma'arij al-Qabul by Sheikh Al-Hakami and Al-Aqidah Al-Tahawiyyah by Imam Al-Tahawi and Da'wat al-Tawhid and the Roles it passed through by Dr. Khalil Harras our edition.\n247. In A (and the birds that snatch).\n248. Sahiq (far deep) Tartib Qamus al-Muhit 2 / 530.\n249. Al-Hajj, 73: 74 See Tafsir Al-Zamakhshari 2 / 530.\n250. In M, A (his heart listens). (*)",
    "book_id": "928",
    "new_page_number": 47
  },
  {
    "serial_number": "1015854",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 47,
    "volume_number": 1,
    "text": "...parable and ponder it with true pondering, for it cuts off the resources (251) of Shirk from his heart. That is because the worshipped, its lowest degree is to be able to create what benefits its worshipper and execute what harms him. And the gods which the polytheists worship besides Allah will never (252) be able to create a fly (253), even if they all gathered to create it, let alone what is bigger than it. Nor are they able to avenge against the fly if it steals from them something of what is on them of perfume and the like, to recover it from it. They are neither capable of creating the fly, which is one of the weakest animals, nor of avenging against it and recovering what it stole from them. There is nothing more incapable than these gods nor weaker than them. So how can a rational person approve of worshipping them besides Allah Almighty? This parable is of the most eloquent of what Allah Glory be to Him sent down regarding the invalidity of Shirk and attributing ignorance to its people and ugliness to their minds, and testifying that the devils tamper (254) with them greater than the tampering of boys with a ball. Where they gave divinity, of whose necessary implications are capability over all possibilities, encompassing all information, independence from all creatures, and that one resorts (255) to the Lord in all needs, relieving distresses, aiding the grieving, and answering prayers; so they gave it to images and statues for whom capability over the creatures of the True God (256), and the lowest, smallest, and most despicable of them, is impossible, even if they gathered for that and cooperated on it. More indicative than that of their inability and the negation of their divinity is that this least, lowest, helpless, weak creature, if it snatched something from them and stole it, and they gathered to recover it from it, they would be unable to do that and not capable of it. Then He equated between the worshipper and the worshipped in weakness and inability by His saying: (Weak are the pursuer...",
    "foot_note": "1. (251) In M, A (materials) and Shirk is misguidance and error and persisting in it Tartib al-Qamus al-Muhit 2 / 704.\n252. In A (cannot).\n253. In A (The fly).\n254. In A, M (that Satan has tampered with them) and Satan is every rebellious tyrant from Jinn and Mankind or beast 2 / 304 Tartib al-Qamus al-Muhit.\n255. In M, A (and to intend).\n256. In A (capability over the least creatures of the True God is impossible for them) and in M (least creatures of the God). (*)",
    "book_id": "928",
    "new_page_number": 48
  },
  {
    "serial_number": "1015855",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 48,
    "volume_number": 1,
    "text": "...and pursued). It was said: The pursuer is the worshipper and the pursued is the worshipped (257), so he is a helpless attached to a helpless. And it was said: It is an equation between the snatcher and the snatched, which is an equation between the god and the fly in weakness and inability. Upon this (258), the pursuer is the false god and the pursued is the fly, seeking from it what it recovered (259) from him. And it was said: The pursuer is the fly and the pursued is the gods (260), for the fly seeks from him what he takes of what is on him. The correct view is that the wording covers all, so weak are the worshipper, the worshipped, the snatcher, and the snatched (261). So whoever places these gods with the Strong, the Exalted in Might, has not appraised Him with true appraisal, nor known Him with true knowledge, nor magnified Him with true magnification (262).\n\nChapter: And among them is His saying, Exalted is He: (The example of those who disbelieve is like that of one who shouts at what hears nothing but calls and cries cattle or sheep - deaf, dumb and blind, so they do not understand) (263). This parable includes a shouter, i.e., making sound to sheep and others, and a shouted at (264), which is the animals. It was said: The shouter is the worshipper, who is the caller to the idol, and the idol is the shouted at, the called. Indeed, the condition of the disbeliever in his calling is like the condition of one who shouts at what does not hear him. This is the saying of a group, among them Abdul Rahman bin Zaid and others (265). The author of Al-Kashshaf (266) and a group with him found this saying problematic and said: (His saying 'except calls and cries') does not support it because idols do not hear calls or cries (267). This problem (268) has been answered with three...",
    "foot_note": "1. (257) Zad al-Masir 5 / 452 and Al-Baghawi and Al-Khazin 5 / 38.\n258. In M, A (So it was said the pursuer).\n259. In M (what it snatched from him).\n260. Tafsir Al-Tabari 17 / 203.\n261. Mentioned in M, A.\n262. In A, M (His magnification).\n263. Surah Al-Baqarah: 171 See Al-Zamakhshari 3 / 328.\n264. In A (and shouted at).\n265. He is Abdul Rahman bin Zaid bin Al-Khattab Al-Adawi Al-Qurashi See Tahdhib al-Tahdhib 6 / 179.\n266. See Kashf al-Zunun 2 / 1475.\n267. Tafsir Al-Kashshaf 1 / 250.\n268. In A (The problem). (*)",
    "book_id": "928",
    "new_page_number": 49
  },
  {
    "serial_number": "1015856",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 49,
    "volume_number": 1,
    "text": "...answers: One of them is that 'except' (illa) is extra, and the meaning is 'at what hears not calls and cries'. They said: Al-Asma'i mentioned in the saying of the poet: (269) (Big camels, with it nothing benefits you except making them kneel). i.e., nothing benefits you [but] making them kneel. This is a corrupt answer, for 'except' is not added in speech.\nThe second answer: That the simile occurred in the absolute calling not in the specifics of the called.\nThe third answer: That the meaning is that the likeness of these in their calling their gods who do not understand their call is like the shouter at his sheep; he does not benefit from his shouting (270) then anything except that he is in (271) calling and crying. Likewise (272) the polytheist has nothing from his calling and worship except fatigue.\nAnd it was said: The meaning is: And the example of those who disbelieve is like the animals that do not understand from what the shepherd says more than the sound. So the shepherd is the caller of the disbelievers and the disbelievers are the animals shouted at (273). Sibawayh said (274): The meaning: And your example, O Muhammad, and the example of those who disbelieve is like the example of the shouter and the shouted at). According to his saying, the meaning would be: And the example of those who disbelieve and their caller (275) is like the example of the sheep and the one shouting at them. That is to make this of the compound simile or make it of the separated simile. If you make it of the compound, it is a likening of the disbelievers in their lack of understanding (276) and benefitting to the sheep which the shepherd shouts at, so they do not understand from his saying anything other than the mere sound which is the call and cry. If you make it of the separated simile, then those...",
    "foot_note": "1. (269) Diwan Dhi al-Rumma 3 / 1419 and see Al-Muwashshah: 182 and the complete verse (On subsidence or we throw them in a desolate land).\n270. In M (from his shouting anything) and in A (from his shouting at his sheep).\n271. In M (that he is in).\n272. In M (And likewise).\n273. See Amali Al-Murtada: 1 / 215 - 218.\n274. Author of the famous book of Language 1 / 108, 109 (and the text is: The meaning is your example).\n275. In A (and their call).\n276. In A (understanding). (*)",
    "book_id": "928",
    "new_page_number": 50
  },
  {
    "serial_number": "1015857",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 50,
    "volume_number": 1,
    "text": "...who disbelieve are in the position of animals, and calling them to the path (277) and guidance is in the position of shouting, and their perception of mere call and cry is like the animals' perception of the mere voice of the shouter. And Allah knows best.\n\nChapter: And among them is His saying, Exalted is He: (The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven ears; in every ear is a hundred grains. And Allah multiplies [His reward] for whom He wills. And Allah is all-Encompassing and Knowing) (278). He, Glory be to Him, likened the spending of the spender in His way - whether the intended is Jihad or all ways of good of every righteousness - to one who sowed a seed, and every seed grew seven ears, and every ear contained a hundred grains. And Allah multiplies (279) according to the condition of the spender, his faith, sincerity, beneficence, benefit of his spending, its amount, and its falling in its place. For the reward of spending varies according to what is established in the heart of faith, sincerity, (and steadiness) (280) at the time of spending. It is bringing out wealth with a steady heart, his chest expanded by bringing it out, his soul generous with it, and it exited his heart before exiting his hand. So he is steady of heart at bringing it out, not anxious nor panicking nor his soul following it, his hand and heart trembling. And it varies according to the benefit of spending and its channels in its locations and according to the goodness of the spender and his intelligence (281). Under this parable is of understanding: That He, Glory be to Him, likened spending to sowing. So the spender of his good wealth for Allah, not for other than Him, is a sower of his wealth in pure land. So its yield is according to his seed, the goodness of his land, tending to the seed by watering, and removing weeds (282) and foreign plants from it. If these matters gather, and no fire burns the crop nor a calamity (283) befalls it, it comes like mountains. His likeness was like a seed on a hill, which is the place where sunlight (284)...",
    "foot_note": "1. (277) The word (path) is not present in M.\n278. Surah Al-Baqarah: 261 and see Tafsir Al-Kashshaf 1 / 393.\n279. In M (multiplies for whom He wills above that according to) and in A (for whom He wills according to).\n280. Addition from M, A.\n281. In M (his purity) and in A (and his purity).\n282. Daghal: Moved: Entrance into a corrupt matter and much tangled trees and its abundance 2 / 190 from Tartib al-Qamus al-Muhit.\n283. From it Al-Ja'ihah for severe need of condition Tartib al-Qamus 1 / 552.\n284. (is in the exposure to the sun) and in M (the garden is exposed). (*)",
    "book_id": "928",
    "new_page_number": 51
  },
  {
    "serial_number": "1015858",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 51,
    "volume_number": 1,
    "text": "...and winds hit, so trees grow (285) there the most complete growth. Then a heavy rain of large drops fell on it continuously, so it quenched it and grew it, so it gave its fruit double what others give because of that heavy rain (Wabil) (286). And if heavy rain does not hit it, then drizzle (Tall), a rain of small drops (287), suffices it due to the nobility of its growing place; it thrives on drizzle and grows on it. Along with the mention of the two types, heavy rain and drizzle, is an indication to the two types of spending: much and little. For among people is one whose spending is heavy rain, and among them is one whose spending is drizzle. And Allah does not waste the weight of an atom. If there occurs to this (288) worker what disperses his deeds and invalidates (289) his good deeds with it, he is in the position of a man who has a garden of date palms and grapes beneath which rivers flow, and he has in it of all fruits, and old age struck him, and he has weak offspring, then a whirlwind containing fire struck it and it burned. So when it is the day of fulfilling deeds and obtaining rewards, the worker finds (290) his work has been struck by what struck the owner of this garden. His regret then is more severe than the regret of this one over his garden. This is a parable Allah, Glory be to Him, struck for regret over the loss of blessing at the time of intense need for it, with the greatness of its value and benefit. He from whom it went away has been struck by old age and weakness, so he is most in need of his blessing. With this, he has weak offspring who are unable to benefit him and manage his interests; rather they are his dependents. So his need for his blessing then is most intense due to his weakness and the weakness of his offspring. How would be the condition of this one if he had a great garden containing all fruits and produce, and the master of its fruit is the most majestic and beneficial of fruits, which is the fruit of date palms and grapes. So his palms (291) undertake his sufficiency and the sufficiency of his offspring. Then he woke up one day and found it all burned like a harvested field. So what regret is greater...",
    "foot_note": "1. (285) In A (so they adorn).\n(286) Al-Wabil (Severe, harsh, violent rain).\n(287) In the original, Al-Qadr (Value/Amount).\n(288) In A (this).\n(289) In A, M (invalidates his good deeds).\n(290) In A, M (this).\n(291) In A, M (so its yield). (*)",
    "book_id": "928",
    "new_page_number": 52
  },
  {
    "serial_number": "1015859",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 52,
    "volume_number": 1,
    "text": "...than his regret. Ibn Abbas said: (292) This is the parable of one whose end is sealed with corruption at the end of his life. Mujahid said (293): This is the parable of the negligent in obeying Allah until he dies. Al-Sari said (294): This is a parable for the hypocrite in his spending, who spends for other than Allah; its benefit is cut off from him when he is most in need of it. Umar bin Al-Khattab asked the Companions, may Allah be pleased with them, one day about this verse. They said: Allah knows best. Umar got angry and said: Say we know or we do not know. Ibn Abbas said: I have something in my self about it, O Commander of the Faithful. He said: Say it, O son of my brother, and do not belittle yourself. He said: (A parable struck for a deed). He said: For which deed? He said (For a rich man who works with good deeds, then Allah sent Satan to him so he worked with sins until he burned all his deeds (295). Al-Hasan said (296): This is a parable - few by Allah knows best who understands it among people - of an old man whose body weakened and his children increased, most in need of his garden. And indeed one of you, by Allah, is most in need of his deed when the world is cut off from him.\n\nChapter: If there occurs to these deeds of charities what invalidates them of reminding (297) (of favors), harm, and showing off (Riya'); showing off prevents their establishment as a cause for reward, and reminding and harm invalidate the reward that was a cause for it. So the likeness of their owner and the invalidity of his deed is like (Safwan), which is the smooth stone upon which is dust, then heavy rain (Wabil) struck it and left it bare (Saldan), nothing on it. Ponder the parts of this eloquent parable and their application to the parts of the represented by; you will know the greatness of the Quran and its majesty. For the stone corresponds to the heart of this show-off, reminder, and harmer. His heart in...",
    "foot_note": "1. (292) See Al-Durr Al-Manthur 10 / 340 and Al-Tabari 3 / 76.\n293. See Al-Tabari 3 / 75 and Al-Durr Al-Manthur 1 / 340 and Zad al-Masir 1 / 321.\n294. Al-Suddi said he is Ismail bin Abdul Rahman died in 128 AH See Al-Nujum Al-Zahira 1 / 308 and Al-Lubab 1 / 537.\n295. Bukhari 3 / 78 and Al-Tabari 3 / 76.\n296. See Tafsir Al-Tabari 3 / 77.\n297. Al-Mann: Manna alayhi mannan: i.e. bestowed favor and did a good deed for him and gave him the gift. (*)",
    "book_id": "928",
    "new_page_number": 53
  },
  {
    "serial_number": "1015860",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 53,
    "volume_number": 1,
    "text": "...its hardness from faith, sincerity, (and beneficence) (298) is in the position of the stone. And the deed which (299) is for other than Allah is in the position of dust that is on that stone. The strength of what is under it and its solidity prevent it from firmness and growth (300) when the heavy rain falls. So it has no substance connected to what accepts water and grows herbage. Likewise, the heart of the show-off has no firmness at the heavy rain of command, prohibition, decree, and destiny. If the heavy rain of revelation descends upon it, that little dust which was on it is uncovered, and what is under it appears as a bare stone with no plant in it. This is a parable Allah, Glory be to Him, struck for the deed of the show-off and his spending; he is unable on the Day of Resurrection to [obtain] reward for any of it when he is most in need of it. And with Allah is success (301).\n\nChapter: And among them is His saying, Exalted is He: (Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all. And those are the companions of the Fire - they will abide therein eternally. The example of what they spend in this worldly life is like that of a wind containing frost which strikes the harvest of a people who have wronged themselves and destroys it. And Allah has not wronged them, but they wrong themselves (302)). This is a parable Allah Almighty struck for whoever spent his wealth in other than His obedience and pleasure. He, Glory be to Him, likened what these spend of their wealth in generosities, prides, gaining praise and good mention, not seeking (303) by it the Face of Allah, and what they spend to hinder from the way of Allah and following His messengers, peace be upon them, to the crop which its owner planted hoping for its benefit and good, then a wind of very intense cold struck it, its cold burning what it passes over of crops and fruits, so it destroyed that crop and dried it up.",
    "foot_note": "1. (298) Addition in M, A.\n299. In M, A (which he did for other than Allah).\n300. In M, A (from plants and firmness).\n301. It is noted that if the following verse is added to the previous explanation, the meaning and intent are completed.\n302. Surah Al Imran: 116, 117.\n303. In M, A (seeking). (*)",
    "book_id": "928",
    "new_page_number": 54
  },
  {
    "serial_number": "1015861",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 54,
    "volume_number": 1,
    "text": "They differed regarding 'Al-Sirr'. It was said: Intense cold (304). And it was said: Fire (305), said by Ibn Abbas. Al-Anbari said (306): Fire was described as Sirr only because of its crackling sound (Tasriya) when flaming. And it was said: Al-Sirr (307) is the sound that accompanies the wind from the intensity of its blowing (308). The three opinions are correlative; it is intense cold burning with its dryness for the harvest as fire burns, and in it is intense sound. In His saying: (which strikes the harvest of a people who have wronged themselves) is an alert that the cause of its striking their harvest is their wrong; it is what empowered the mentioned wind against them until it destroyed their crop and dried it up. So their wrong is the wind that destroyed their deeds and expenses and ruined them.\n\nChapter: And among them is His saying, Exalted is He: (Allah presents an example: a man in whom are partners differing with each other and a man handed over to a man - are they equal in comparison? Praise be to Allah! But most of them do not know) (309). This is a parable Allah, Glory be to Him, struck for the polytheist and the monotheist. The polytheist is in the position of a slave owned by a group (310) sharing in his service; he cannot please them all. The monotheist, since he worships Allah alone, his example is like the example of a slave of one man, who has submitted to him, knew his purposes (and knew the way) (311) to his pleasure. So he is at rest from the quarreling of partners over him; rather he is safe for his owner without dispute over him, with his owner's kindness to him, his mercy for him, his compassion for him, his beneficence to him, and his taking care of his interests (312). So do these two slaves equal? This...",
    "foot_note": "1. (304) Majaz al-Quran 102 and Al-Tabari 4 / 59 and Al-Baghawi 1 / 408.\n305. See Lisan al-Arab entry (Sarr) and Ibn Kathir 1 / 397.\n306. He is Al-Qasim bin Muhammad bin Bashar Al-Anbari Abu Muhammad has interest in literature and news see Miftah al-Sa'ada 1 / 146 and Zad al-Masir 1 / 445.\n307. See Tafsir Al-Kashshaf 1 / 456, 457.\n308. See Tafsir Al-Qurtubi 34 / 178 and Fath al-Qadir 1 / 374.\n309. Surah Al-Zumar: 29 See Ibn Kathir 2 / 158 and Al-Kashshaf 3 / 397.\n310. In M (a group disputing differing quarreling and the man Mutashakis: Bad tempered).\n311. Addition from M, A.\n312. In A, M (generating his interests). (*)",
    "book_id": "928",
    "new_page_number": 55
  },
  {
    "serial_number": "1015862",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 55,
    "volume_number": 1,
    "text": "...is of the most eloquent parables. For the one sincere to one owner deserves (313) from his aid, beneficence, attention to him, and undertaking his interests what the companion of quarreling partners does not deserve. (Praise be to Allah! But most of them do not know).\n\nChapter: And among them is His saying, Exalted is He: (Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\" And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\" And [the example of] Mary, the daughter of Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient) (314). These verses included three parables: A parable for the disbeliever (315) and two parables for the believers.\nThe parable of disbelievers implies that the disbeliever is blamed for his disbelief and enmity to Allah Almighty, His Messenger peace be upon him, and His allies. And that what was between him and the believers of bond of lineage or link of in-law relationship or cause of the causes of connection (316) does not benefit him with his disbelief. For relationships (all) (317) are cut off on the Day of Resurrection except what was of them connected to Allah alone at the hands (318) of His messengers, peace be upon them. If the link of kinship, in-law relationship, and marriage benefited with lack of faith, the link (319) which was between Noah and Lot (320), peace be upon them, and their two wives would have benefited. Since they did not avail them from Allah at all...",
    "foot_note": "1. (313) In A, M (deserves - she/it).\n314. Surah Al-Tahrim: 10, 11, 12 See Tafsir Ibn Kathir 2 / 525 and Al-Kashshaf 4 / 130, 131 and Kitab fi al-Quran by Munir al-Qadi p. 27.\n315. In M (The disbelievers) and in A (for the disbelievers).\n316. In M, A (causes).\n137. Addition from M, A.\n318. In A (at the hand of a messenger).\n139. Al-Wusla and Al-Silah are kinship and similarity Tartib al-Qamus 2 / 210.\n320. In M (Lot and Noah) and Al-Kamil fi al-Tarikh 1 / 7. (*)",
    "book_id": "928",
    "new_page_number": 56
  },
  {
    "serial_number": "1015863",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 56,
    "volume_number": 1,
    "text": "...and it was said to them: Enter the Fire with those who enter, the verse then cut off the hope of one who committed disobedience to Allah Almighty and opposed His command, and hoped that the righteousness of another from a relative or stranger would benefit him, even if there was the strongest connection between them in the world. For there is no connection above the connection of prophethood, fatherhood, and marriage. Noah, peace be upon him, did not avail his son, nor Abraham, peace be upon him, his father, nor Noah and Lot, peace be upon them, their wives from Allah at all. Allah Almighty said: (Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you) (321). And the Almighty said: ([It will be] a Day when no soul shall possess for [another] soul any power, and the command, that Day, is [entirely] with Allah) (322). And the Almighty said: (And fear a Day when no soul will suffice for another soul at all) (323). And the Almighty said: (And fear a Day when no father will avail his son, nor will a child avail his father at all) (324). All this is a denial of the false hopes of the polytheists that those they attached themselves to besides Allah of kinship, in-law relationship, marriage, or companionship would benefit them on the Day of Resurrection or protect them from the punishment of Allah Almighty or intercede for them with Allah Almighty. This is the origin of the misguidance of the children of Adam and their polytheism, and it is the Shirk which Allah does not forgive. It is what Allah Almighty sent all His messengers, peace be upon them, and revealed all His books to invalidate and to fight its people and oppose them.\n\nChapter: As for the two parables which are for the believers, one of them is the wife of Pharaoh (325). The face of the parable: That the connection of the believer with the disbeliever does not harm him at all if he separates from him in his disbelief and deed. The disobedience of the sinner does not harm the obedient at all in the Hereafter, even if he is harmed by it in the world due to the punishment that befalls the people of earth if they waste the command of Allah Almighty, so it comes generally. So it did not harm...",
    "foot_note": "1. (321) Surah Al-Mumtahina: 3.\n322. Surah Al-Infitar: 19.\n323. Surah Al-Baqarah: 123.\n324. Surah Luqman: 33.\n325. See Tafsir Ibn Kathir 3 / 124 and Al-Kashshaf 4 / 131 and Al-Amthal by Munir p. 27. (*)",
    "book_id": "928",
    "new_page_number": 57
  },
  {
    "serial_number": "1015864",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 57,
    "volume_number": 1,
    "text": "...Pharaoh's wife her connection to him while he is one of the most disbelieving of disbelievers. And their connection to them did not benefit the wife of Noah and Lot, while they were messengers of the Lord of the Worlds.\nThe second parable for believers: Mary who has no husband, neither believer nor disbeliever. So He mentioned three categories of women: The disbelieving woman who has a link to the righteous man, the righteous woman who has a link to the disbelieving man, and the single woman who has no link between her and anyone. The first, her link and cause do not benefit her; the second, her link and cause do not harm her; and the third, the lack of link does not harm her at all (326).\nThen in these parables there are wondrous secrets that suit the context of the Surah. For it was driven in mentioning the wives of the Prophet, peace be upon him, and warning them against backing each other against him, and that if they do not obey Allah and His Messenger, peace be upon him, and desire the Hereafter, their connection to the Messenger of Allah, peace be upon him, will not benefit them as their connection to them did not benefit the wife of Noah and Lot. For this reason (327) He struck for them in this Surah the example of the connection of marriage, not kinship. Yahya bin Salam (328) said: (Allah struck the first parable warning Aisha (329) and Hafsa (330), then He struck for them the second parable inciting them to hold fast to obedience. And in striking the parable for the believers (with Mary) (331) there is also another consideration, which is that it did not harm her with Allah at all the slander of the enemies of Allah Almighty, the Jews, (of her) (332) and their attributing her and her son to what Allah absolved them from, despite her being the Great Siddiqa chosen over the women of the worlds. So it does not harm...",
    "foot_note": "1. (326) Al-Khazin 7 / 123.\n327. In M, A (For this reason He only struck in this Surah).\n328. Yahya bin Salam bin Abi Tha'labah Al-Tamimi, Exegete, Jurist, Scholar of Hadith and Language - he has the Tafsir and other works, died in 200 AH. See Zad al-Masir 8 / 315.\n329. See Al-Isaba fi Tamyiz al-Sahaba 4 / 459.\n330. See Al-Isaba fi Tamyiz al-Sahaba 373 / 374.\n331. Added from I'lam al-Muwaqqi'in, A.\n332. Addition from M, A. (*)",
    "book_id": "928",
    "new_page_number": 58
  },
  {
    "serial_number": "1015865",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 58,
    "volume_number": 1,
    "text": "...the righteous man, the slander (333) of the wicked and dissolute against him. In this is a consolation for Aisha (334), Mother of the Believers, if the Surah was revealed after the incident of Al-Ifk, and settling herself on what the liars said about her if it was before it, as in the representation (335) by the wife of Noah and Lot is a warning to her and Hafsa regarding what they relied upon in the right of the Prophet, peace be upon him. So these parables contained warning to them, frightening, inciting them to obedience and Tawhid, consolation, and settling the self for whoever was harmed among them and lied against. The secrets of revelation are above this and more majestic, especially the secrets of parables which are understood only by the knowledgeable.\nCompleted with the praise of Allah and His good success, and may Allah bless Muhammad and his family and companions and grant them peace abundantly. O Allah, forgive its scribe, its reader, its ponderer with true pondering, its author, and all Muslim men and women and believing men and women. Amen. And praise be to Allah Lord of the Worlds.\nWritten by the poor to his Lord Almighty Ali bin Zaid Al (336) may Allah forgive him and his parents and all Muslims.\n(And praise be to Allah by whose grace good deeds are completed)\nThe completion of its printing and correction was on / /\n* * *",
    "foot_note": "1. (333) In M, A (defamation).\n334. See Tafsir Abu Al-Saud on the margin of Fakhr Al-Razi 7 / 433.\n335. In M (in mentioning the representation) and in A (in mentioning the representation).\n336. Not clear, perhaps Bis. (*)",
    "book_id": "928",
    "new_page_number": 59
  },
  {
    "serial_number": "1015866",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 59,
    "volume_number": 1,
    "text": "* References referred to by Dr. Nasser bin Saad, Saeed Muhammad Nimr, and we referred to some of them also\n1 - I'lam al-Muwaqqi'in: Ibn Qayyim al-Jawziyya. Investigation by Abdul Rahman al-Wakil. Cairo.\n2 - Al-Bayan fi I'rab al-Quran: Ibn al-Anbari. Investigation by Dr. Taha Abdul Hamid and Mustafa al-Saqqa Cairo 1389 AH.\n2 - Al-Targhib wa al-Tarhib by Imam Al-Mundhiri Al-Halabi edition Egypt.\n3 - Tafsir Ibn Kathir Al-Halabi edition Egypt.\n4 - Tafsir Al-Fakhr Al-Razi Tehran edition.\n5 - Al-Juman fi Tashbihat al-Quran: Ibn Naqiya al-Baghdadi. Investigation by Dr. Mustafa al-Juwayni.\n6 - Al-Durr Al-Manthur: by Imam Al-Suyuti: Dar al-Ma'rifa edition Beirut.\n7 - Zad al-Masir: Ibn al-Jawzi: Islamic Office edition.\n8 - Sunan Al-Nasa'i, Sahih Imam Al-Bukhari Al-Halabi edition Egypt.\n9 - Sahih Muslim. Investigation by Fuad Abdul Baqi Al-Halabi edition Egypt.\n10 - Al-Tabaqat Al-Kubra by Ibn Sa'd Dar Sadir Beirut.\n4 - Tafsir Al-Fakhr Al-Razi Tehran edition. [Repeated]\n5 - Al-Juman fi Tashbihat al-Quran: Ibn Naqiya al-Baghdadi. Investigation by Dr. Mustafa al-Juwayni. [Repeated]\n6 - Al-Durr Al-Manthur: by Imam Al-Suyuti: Dar al-Ma'rifa edition Beirut. [Repeated]\n7 - Zad al-Masir: Ibn al-Jawzi: Islamic Office edition. [Repeated]\n8 - Sunan Al-Nasa'i, Sahih Imam Al-Bukhari Al-Halabi edition Egypt. [Repeated]\n9 - Sahih Muslim. Investigation by Fuad Abdul Baqi Al-Halabi edition Egypt. [Repeated]\n10 - Al-Tabaqat Al-Kubra by Ibn Sa'd Dar Sadir Beirut. [Repeated]\n11 - Ghara'ib al-Quran: by Al-Qummi Al-Naysaburi Al-Halabi. Egypt.\n12 - Al-Kitab Sibawayh. Bulaq. Egypt.\n13 - Al-Kashshaf: Al-Zamakhshari. Al-Halabi edition Egypt.\n14 - Al-Kashf wa Al-Bayan. Al-Tha'labi photocopied at the Scientific Research and Islamic Heritage Revival Center number 307.",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 60
  },
  {
    "serial_number": "1015867",
    "category_id": "4",
    "category": "Quran Sciences and Tafsir Principles",
    "book_title": "Parables in the Quran [From 'I'lam al-Muwaqqi'in']",
    "edition": "First Edition 1406 AH - 1986 AD",
    "publisher": "Sahaba Library - Egypt, Tanta",
    "page_number": 60,
    "volume_number": 1,
    "text": "15 - Kashf al-Zunun. Haji Khalifa: Al-Muthanna Baghdad.\n16 - Lubab al-Ta'wil: Al-Khazin. Al-Halabi. Cairo.\n17 - Musnad Ahmad. Islamic Office edition Beirut.\n18 - Ma'alim al-Tanzil Al-Baghawi on the margin of Al-Khazin Halabi Cairo.\n19 - Miftah al-Sa'ada. Tashkubri Zada Cairo.\n20 - Al-Nujum Al-Zahira. Ibn Taghri Bardi. Cairo.\n21 - Imla' Ma Manna Bihi Al-Rahman: Al-Ukbari Halabi Egypt.\n22 - Ma'ani al-Quran Al-Zajjaj Al-Hay'a Egypt.\n*",
    "foot_note": "None",
    "book_id": "928",
    "new_page_number": 61
  }
]