[
  {
    "serial_number": "4962081",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Heart Softeners, Etiquettes, and Remembrances\nBook: The Shining Stars regarding the Virtues of the Enduring Good Deeds (Al-Nujum Al-Zahirat fi Fada'il Al-Baqiyat Al-Salihat)\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 72\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nBook: The Shining Stars regarding the Virtues of the Enduring Good Deeds\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 72\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nAuthor: Abdul Mannan Al-Talibi\nNumber of Pages: 72\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nNumber of Pages: 72\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\n[The research is not printed]\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442\n\nPublication date in Al-Shamela: 1 Rabi' al-Awwal 1442",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 1
  },
  {
    "serial_number": "4962082",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Topic One: The Enduring Good Deeds in the Book, the Sunnah, and the Athar (Narrations)\n- The Enduring Good Deeds are those blessed words whose mention appeared in the texts of the Holy Book, and whose virtue and status were extensively mentioned in the texts of the pure Prophetic Sunnah. Many narrations about them were transmitted from the Imams of the Salaf (Predecessors) and the people of interpretation. Therefore, the discussion of this topic is in five sections:\n- Section One: The Noble Verses and Honorable Hadiths mentioned regarding the Enduring Good Deeds.\n- Section Two: The reason for the revelation of the verse of the Enduring Good Deeds.\n- Section Three: The verses of the Enduring Good Deeds: explanation and clarification.\n- Section Four: The meanings of the Enduring Good Deeds.\n- Section Five: Adding the Hawqalah to the Enduring Good Deeds.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 2
  },
  {
    "serial_number": "4962083",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "Section One: The Noble Verses and Honorable Hadiths mentioned regarding the Enduring Good Deeds\nMany texts from the Book and the Sunnah mentioned the Enduring Good Deeds, and I will mention them through three branches:\nBranch One: The Noble Verses mentioned regarding the Enduring Good Deeds:\nThe mention of the Enduring Good Deeds appeared in the Holy Quran in two places:\nPlace One: In Surah Al-Kahf: The Almighty said: [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (1).\nPlace Two: In Surah Maryam: The Almighty said: [And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for return (76)] (2).\nBranch Two: The Honorable Prophetic Hadiths mentioned regarding the Enduring Good Deeds:\nMany honorable Prophetic Hadiths appeared in the collections of the pure Sunnah mentioning the Enduring Good Deeds. I have chosen to rely on what is authentic among them, as the authentic suffices over the weak of these Hadiths:\na) The Hadith of Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: (Take your protection (Junnah). They said! O Messenger of Allah, is an enemy present? He said: \"No, but your protection from the Fire. Say: 'Subhan Allah (Glory be to Allah), Al-Hamdu Lillah (Praise be to Allah), La ilaha illa Allah (There is no god but Allah), and Allahu Akbar (Allah is the Greatest)', for they come on the Day of Resurrection as saviors/leaders (Mujannibat) and followers (Mu'aqqibat), and they are the Enduring Good Deeds) (3).\nJunnatukum: With Damma on Jim and Shadda on Nun: Meaning: What covers you and protects you.\nMujannibat: With Fatha on Nun, Meaning: Preceding in front of you.\nMu'aqqibat: With Kasra on the Qaf with Shadda, Meaning: Following you and coming from behind you (4).\nAl-Hafiz Al-Manawi, may Allah have mercy on him, said: \"They were called Mu'aqqibat because they returned time after time, and whoever did a deed and then returned to it has followed up ('Aqqaba)\" (5).",
    "foot_note": "1. Al-Kahf (46). \n2. Maryam (76). \n3. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra (6/ 212) and the wording is his, and Al-Hakim in Al-Mustadrak (1/ 725) and said this Hadith is authentic according to the condition of Muslim but they did not narrate it. And Al-Albani classed it as Hasan in Sahih Al-Targhib wa Al-Tarhib (2/ 112) number (1567). \n4. Al-Targhib wa Al-Tarhib by Al-Mundhiri (2/ 281). \n5. Al-Taysir bi Sharh Al-Jami' Al-Saghir (1/ 1041)",
    "book_id": "72",
    "new_page_number": 3
  },
  {
    "serial_number": "4962084",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "b) The Hadith of Abu Huraira, may Allah be pleased with him, also said: The Messenger of Allah, peace and blessings be upon him, said: \"Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar are from the Enduring Good Deeds\" (1).\nc) The Hadith of Al-Harith the freed slave of Uthman, may Allah be pleased with him, said: \"Uthman sat one day and we sat with him, then the Muazzin came to him, so he called for water in a vessel I think it would contain a Mudd. He performed ablution then said: I saw the Messenger of Allah, peace and blessings be upon him, performing ablution like this ablution of mine, then he said: \"Whoever performs ablution like this ablution of mine then said: And prayed the Zuhr prayer, what was between it and Fajr is forgiven for him. Then prayed Asr, what was between it and the Zuhr prayer is forgiven for him. Then prayed Maghrib, what was between it and the Asr prayer is forgiven for him. Then prayed Isha, what was between it and the Maghrib prayer is forgiven for him. Then perhaps he spends the night turning over, then if he gets up and performs ablution and prays Fajr, what was between it and the Isha prayer is forgiven for him. And these are the good deeds (Hasanat) that remove the evil deeds.\" They said these are the good deeds, so what are the Enduring (Baqiyat), O Uthman? He said: \"They are: La ilaha illa Allah, Subhan Allah, Al-Hamdu Lillah, Allahu Akbar, and La Hawla wa La Quwwata illa Billah (There is no power and no strength except by Allah)\" (2).\nd) The Hadith of Abu Sa'id Al-Khudri -- may Allah be pleased with him -- from the Messenger of Allah, peace and blessings be upon him, said: \"Increase in the Enduring Good Deeds. It was said: And what are they, O Messenger of Allah? He said: The Millah (Religion). It was said: And what are they, O Messenger of Allah? He said: The Millah. It was said: And what are they, O Messenger of Allah? He said: \"Takbir (saying Allahu Akbar), Tahlil (saying La ilaha illa Allah), Tasbih (saying Subhan Allah), Tahmid (saying Al-Hamdu Lillah), and La Hawla wa La Quwwata illa Billah\" (3).\ne) The Hadith of Al-Nu'man bin Bashir -- may Allah be pleased with him -- said: The Messenger of Allah, peace and blessings be upon him, came out to us while we were in the mosque after the Isha prayer. He raised his sight to the sky then lowered it until we thought something had happened in the sky. Then he said: \"Indeed, there will be after me leaders who lie and oppress. So whoever believes them in their lies, and assists them in their oppression, is not of me and I am not of him. And whoever does not believe them in their lies, and does not assist them in their oppression, he is of me and I am of him. Indeed, the blood of a Muslim is his expiation. Indeed, Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar, are the Enduring Good Deeds\" (4).",
    "foot_note": "1. Narrated by Ibn Jarir in Al-Tafsir (15/ 166), and Al-Albani classed it as Hasan in Al-Silsilah Al-Sahihah (13/ 67) number (3264). \n2. Narrated by Ahmad in Al-Musnad (1/ 537) number (513), and Shu'aib Al-Arna'ut classed it as Hasan in his verification of Al-Musnad. \n3. Narrated by Ahmad in Al-Musnad (18/ 241) number (11713). Al-Arna'ut said: Hasan due to others, and this chain is weak. Abu Muhammad Abdul Haq, may Allah have mercy on him, authenticated it, stated by Al-Qurtubi in his Tafsir (10/ 415). \n4. Narrated by Ahmad in Al-Musnad (30/ 299) number (18353). Al-Arna'ut said: Authentic due to others, and this chain is weak due to the ambiguity of the man narrating from Al-Nu'man bin Bashir, and the rest of its men are trustworthy.",
    "book_id": "72",
    "new_page_number": 4
  },
  {
    "serial_number": "4962085",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "f) The Hadith of Abdullah bin Masoud, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, Allah has distributed your characters among you, just as He distributed your provisions among you. Indeed, Allah gives the world to whom He loves and whom He does not love, but He does not give Faith except to whom He loves. So whoever is stingy (Danna) with wealth to spend it, and fears the enemy to fight him, and dreads the night to endure it, let him increase in saying 'Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar'\" (1).\nDanna: With the dotted Dad. Al-Hafiz Al-Manawi, may Allah have mercy on him, said: (With Shadda on the Nun, meaning was miserly) (2).\nBranch Three: The Narrations (Athar) mentioned regarding the Enduring Good Deeds\nAmong them:\na- The narration of Amara bin Sayyad, from Saeed bin Al-Musayyib, that he heard him say: regarding the Enduring Good Deeds: \"It is the servant's saying: Allahu Akbar, Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and La Hawla wa La Quwwata illa Billah\" (3).\nb- What Abdul Razzaq narrated with his authentic chain from Qatada, regarding the Almighty's saying: (And the Enduring Good Deeds): He said: \"La ilaha illa Allah, Allahu Akbar, Al-Hamdu Lillah, and Subhan Allah, are the Enduring Good Deeds\" (4).",
    "foot_note": "1. Al-Adab Al-Mufrad by Al-Bukhari (1/ 104) number (275), Al-Albani authenticated it in Al-Silsilah Al-Sahihah (6/ 213) number (2714). In a narration by Al-Bayhaqi in Shu'ab Al-Iman (12/ 119) number (599) with the addition (For they are preceding saviors/leaders (Mujannibat) and followers (Mu'aqqibat), and they are the Enduring Good Deeds). \n2. Al-Taysir bi Sharh Al-Jami' Al-Saghir (1/ 225). \n3. Muwatta Malik (2/ 295) number (716). \n4. Mawsu'at Al-Sahih Al-Masbur min Al-Tafsir bi Al-Ma'thur Prof. Dr. Hikmat bin Bashir Yasin (3/ 350).",
    "book_id": "72",
    "new_page_number": 5
  },
  {
    "serial_number": "4962086",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "Section Two: The reason for the revelation of the verse of the Enduring Good Deeds\nIbn Jarir Al-Tabari said: \"And these verses from the Almighty's saying: [And recite, [O Muhammad], what has been revealed to you of the Book of your Lord...] to this place [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (1), it was mentioned that they were revealed regarding (Uyaynah bin Hisn and Al-Aqra' bin Habis)\" (2). Then Ibn Jarir mentioned with his chain those who said that. He said: From Khabbab regarding the saying of Allah Almighty: [And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would be of the wrongdoers] (3). He said: \"Al-Aqra' bin Habis Al-Tamimi and Uyaynah bin Hisn Al-Fazari came and found the Prophet, peace and blessings be upon him, sitting with Bilal, Suhayb, Ammar, and Khabbab among people from the weak believers. When they saw them around him, they looked down upon them. They came to him and said: We would like you to make for us a session with you by which the Arabs would know our superiority. For the delegations of Arabs come to you, and we are ashamed that the Arabs see us with these slaves. So if we come to you, make them leave us. If we finish, then sit with them if you wish. He said: Yes. They said: Write a document for us against you regarding that. He said: So he called for the scroll and called Ali to write. He said: While we were sitting in a corner, Gabriel came down with this verse [And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would be of the wrongdoers] (4) then He said: [And thus We have tried some of them through others that they [the disbelievers] might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?] (5)",
    "foot_note": "1. Al-Kahf (46). \n2. Jami' Al-Bayan fi Ta'wil Al-Quran (18/ 31). \n3. Al-An'am (52). \n4. Al-An'am (52). \n5. Al-An'am (53).",
    "book_id": "72",
    "new_page_number": 6
  },
  {
    "serial_number": "4962087",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "Then He said [And when those come to you who believe in Our verses, say, \"Peace be upon you.\" ... Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful] (1). So the Messenger of Allah, peace and blessings be upon him, threw the scroll from his hand, then called us, so we came to him while he was saying: [Peace be upon you... Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful]. So we used to sit with him, and if he wanted to stand up, he stood and left us. So Allah Almighty revealed: [And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His countenance. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect]. He said: \"So the Messenger of Allah, peace and blessings be upon him, used to sit with us afterwards. If he reached the hour in which he stands up, we stood up and left him until he stands\" (2).\nAl-Hafiz Ibn Kathir said: \"This is a Gharib (strange) Hadith, for this verse is Makki and Al-Aqra' bin Habis and Uyaynah only embraced Islam a long time after the Hijra\" (3).\nSheikh Ahmad Shakir said after citing the aforementioned statement of Al-Hafiz Ibn Kathir: This is the truth, Allah willing (4).\nAbu Sa'id Al-Mula'i said: \".. But scholars agreed that this Surah is Makki, and the coming of Uyaynah bin Hisn and Al-Aqra' bin Habis and those whose hearts are to be reconciled to the Prophet of Allah, peace and blessings be upon him, and their addressing him was in Medina, this is in which there is no doubt. So the apparent meaning, and Allah knows best, is that these verses were revealed concerning the great ones of the polytheists from the people of Mecca who criticized the Prophet, peace and blessings be upon him, for the poor believers sticking to him like Suhayb and Bilal, may Allah be pleased with them, and they said to him: Drive these away from you until we come to you. Not concerning Uyaynah and Al-Aqra'. Or these verses are Madani. The first is closer and more correct due to their agreement on the Surah being Makki..\" (5).",
    "foot_note": "1. Al-An'am (54). \n2. Tafsir Al-Tabari (11/ 376, 377). \n3. Tafsir Al-Hafiz Ibn Kathir (3/ 260). \n4. Tafsir Al-Tabari (11/ 377). \n5. Juz' fi Tafsir Al-Baqiyat Al-Salihat (1/ 17).",
    "book_id": "72",
    "new_page_number": 7
  },
  {
    "serial_number": "4962088",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Section Three: The two verses of the Enduring Good Deeds: explanation and clarification\nThe Holy Quran is a sea with no shore and no bottom. Through these two noble verses, we try to review the sayings of the commentators and what the two verses of the Enduring Good Deeds contained of subtleties and meanings that indicate most greatly the greatness of this Quran, its miraculous nature, and its conciseness through three branches:\nBranch One: On the interpretation of the Almighty's saying: [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (1).\na- Interpretation:\n- The Quranic scholar Muhammad Al-Amin Al-Shanqiti - may Allah Almighty have mercy on him - said: \"The intent of the noble verse is to alert people to righteous deeds so they are not distracted by the adornment of the worldly life of wealth and children from what benefits them in the Hereafter with Allah of the enduring righteous deeds\" (2).\n- Ibn Ashur - may Allah Almighty have mercy on him - said regarding the Almighty's saying: [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (3). He said: \"An interjection intended for admonition and lesson for the believers that the blessing the polytheists are in of wealth and children is only the adornment of the worldly life which you knew is transient...\" (4).\n- Al-Shawkani, may Allah have mercy on him, said regarding the Almighty's saying: [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (5): \"This is a refutation of the leaders who used to boast of wealth, riches, and sons. So He, Glory be to Him, informed them that this is what one adorns himself with in the world, not what benefits in the Hereafter...\" (6).",
    "foot_note": "1. Al-Kahf (46). \n2. Adwa' Al-Bayan (3/ 281). \n3. Al-Kahf (46). \n4. Al-Tahrir wa Al-Tanwir (15/ 332). \n5. Al-Kahf (46). \n6. Fath Al-Qadir (3/ 414).",
    "book_id": "72",
    "new_page_number": 8
  },
  {
    "serial_number": "4962089",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "- Ibn Ashur, may Allah have mercy on him, said regarding His saying: [Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope (46)] (1): \"Two adjectives modifying an omitted noun, meaning the enduring righteous deeds which have no cessation, meaning there is no cessation to their good which is their eternal reward. So they are better than the adornment of the worldly life which is not enduring..\" (2).\nAl-Shawkani, may Allah have mercy on him, said regarding the Almighty's saying: [better to your Lord for reward and better for [one's] hope]: \"Meaning better than this adornment of wealth and children in reward and more in return and benefit for their people.\" And better for hope \"meaning better in hope: meaning that these righteous deeds, for their people, regarding hope are better than what the people of wealth and children hope for, because they attain by them in the Hereafter better than what these rich people hoped for in the world...\" (3).\nIbn Ashur, may Allah have mercy on him, said: \"And the meaning of (and better for hope) is that the hope of the one hoping in wealth and children is only hoping for the occurrence of a matter doubtful in its occurrence and limited to its duration. As for the one hoping for the reward of righteous deeds, he is hoping for the occurrence of a matter promised by the Truthful Promiser..\" (4).\nb- Quranic Subtleties in the Verse:\nSubtlety One: Ibn Ashur said: \"The requirement of the apparent in the order of the two descriptions was to present the Righteous over the Enduring, because even though they are two descriptions for an omitted noun, the more known of them in describing that omitted [noun] is the Righteous, because it has become common to say the Righteous Deeds and not say the Enduring Deeds.. But the requirement of the apparent was opposed here, so the Enduring was presented to alert that what was mentioned before it was only separated because it is not enduring, which is wealth and children, as in His saying Almighty: [and the worldly life is not, compared to the Hereafter, except [brief] enjoyment] (5). So this presentation was fulfilling the right of conciseness by dispensing with an omitted speech whose estimation is that that is transient or what is not enduring, and the Enduring of the Righteous [deeds] are better than it..\" (6).",
    "foot_note": "1. Al-Kahf (46). \n2. Al-Tahrir wa Al-Tanwir (15/ 332). \n3. Fath Al-Qadir (3/ 414) \n4. Al-Tahrir wa Al-Tanwir (15/ 334). \n5. Al-Ra'd (26). \n6. Al-Tahrir wa Al-Tanwir (15/ 333).",
    "book_id": "72",
    "new_page_number": 9
  },
  {
    "serial_number": "4962090",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Subtlety Two: Abu Hayyan Al-Andalusi, may Allah have mercy on him, said: \".. When He mentioned the destination of what is in the worldly life to annihilation, this particular [case] of wealth and children being adornment was included in it... And everything that is adornment of the worldly life is quick to expire, so wealth and children are quick to expire. And by the axiom of reason, what is like that, it is ugly for the rational person to boast of it or rejoice because of it\" (1).\nSubtlety Three: Imam Al-Qurtubi, may Allah have mercy on him, said: \"Wealth and children are but adornment of the worldly life because in wealth is beauty and benefit, and in children is strength and defense, so they became the adornment of the world..\" (2).\nIbn Ashur, may Allah have mercy on him, said: \"And presenting wealth over children in the mention is because it is quicker to come to people's minds, because the young and old, the youth and the sheikh desire it, and whoever has children, what has sufficed him...\" (3).\nAl-Qasimi, may Allah have mercy on him, said: \"Presenting wealth over children due to its deep rootedness in what is linked to it of adornment and supply, and because the need for it is more touching, and because it is adornment without them unlike the reverse\" (4).\nSubtlety Four: Al-Qasimi said in Mahasin Al-Ta'wil: \"Singularizing adornment (Zinah) even though it is attributed to two things, because it is originally a verbal noun (Masdar). It was applied to the object hyperbolically. As if it is the adornment itself. And adding it to life is for specification; because its adornment is specific to it\" (5).\nAl-Qurtubi said: \"(Wealth and children are [but] adornment of the worldly life) And it is permissible [to say] 'Zinata' (two adornments) and it is the predicate of the subject in dual and singular form.\" (6)",
    "foot_note": "1. Al-Bahr Al-Muhit (6/ 127). \n2. Al-Jami' li Ahkam Al-Quran (10/ 413). \n3. Al-Tahrir wa Al-Tanwir (15/ 333). \n4. Mahasin Al-Ta'wil (7/ 42 ...). \n5. Mahasin Al-Ta'wil (7/ 42 ...), Tafsir Abi Al-Saud (5/ 226). \n6. Al-Jami' li Ahkam Al-Quran (10/ 413).",
    "book_id": "72",
    "new_page_number": 10
  },
  {
    "serial_number": "4962091",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "Subtlety Five: Al-Qasimi said: \"Bringing out the endurance of deeds and their righteousness in the manner of attributes that are taken for granted, even though their right is to be intended for benefit, especially in countering the affirmation of annihilation for what opposes them of wealth and children in the manner of [Whatever you have will end, but what Allah has is lasting] (1) to signal that their endurance is an established matter with no need for its explanation. Rather, the term 'Enduring' (Al-Baqiyat) is a name for it not a description, and for that reason the described noun was not mentioned. What needed to be addressed was its goodness\" (2).\nSubtlety Six: Al-Qasimi said: \"Repeating (Better - Khayr) to signal the difference in the two aspects of goodness and exaggeration\" (3).\nBranch Two: On the interpretation of the Almighty's saying: [And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for return] (4).\na- Interpretation:\nAl-Hafiz Ibn Kathir, may Allah have mercy on him, said: When Allah Almighty mentioned providing the one who is in error in what he is in and increasing him in what he is upon, He informed of increasing the guided ones in guidance as the Almighty said: [And whenever a surah is revealed, there are among them those who say, \"Which of you has this increased in faith?\" As for those who believed, it has increased them in faith, while they are rejoicing (124) But as for those in whose hearts is disease, it has [only] increased them in abomination upon their abomination, and they died while they were disbelievers (125)] (5) (6).",
    "foot_note": "1. Al-Nahl (96). \n2. Mahasin Al-Ta'wil (7/ 42). \n3. Mahasin Al-Ta'wil (7/ 42) \n4. Maryam (76). \n5. Al-Tawbah (124, 125). \n6. Tafsir Al-Quran Al-Azim (5/ 285).",
    "book_id": "72",
    "new_page_number": 11
  },
  {
    "serial_number": "4962092",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Ibn Ashur, may Allah have mercy on him, said: \"And the Enduring Good Deeds are two adjectives for an omitted noun known from the context, meaning deeds enduring in their bliss and good. And the righteous deeds for their owners are better with Allah than the blessing of escaping punishment..\" (1).\nIbn Kathir said: \"Better to your Lord for reward: meaning recompense\". \"And better for return (Maradda): meaning outcome and return for its owner\" (2).\nb- Subtleties:\nAl-Qasimi said: \"Repeating the predicate is for more care in explaining it\" (3).\nBranch Three: On the disagreement of the commentators regarding the Enduring Good Deeds:\nThe people of interpretation differed in explaining the Enduring Good Deeds into four schools:\nFirst School: That they are the blessed words \"Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, Allahu Akbar, and La Hawla wa La Quwwata illa Billah..\".\nThis was narrated from the Messenger of Allah, peace and blessings be upon him, via a group of Companions like Abu Huraira, Abu Sa'id Al-Khudri, Uthman bin Affan, Ibn Abbas, and Ibn Umar, may Allah be pleased with them all.\nAnd it was narrated from a group of the Followers like Saeed bin Jubayr, Ata bin Abi Rabah, and Saeed bin Al-Musayyib. And to this went Ikrimah, Mujahid, Al-Hasan, and Qatada from the Imams of Tafsir. It is the school of the masses of scholars of Tafsir (4).\nThe proponents of this view used as evidence the honorable Prophetic Hadiths which we cited in the first requirement.\nSecond School: That they are the five prayers.\nThis school was narrated from Ibn Abbas in a narration, Amr bin Sharhabil, Abu Maysarah, Saeed bin Jubayr in a narration from him, Masruq, and Ibrahim (5).",
    "foot_note": "1. Tafsir Al-Quran Al-Azim (5/ 285). \n2. Al-Tahrir wa Al-Tanwir (16/ 158). \n3. Mahasin Al-Ta'wil (7/ 42). \n4. Tafsir Al-Baghawi (3/ 194, 195), Tafsir Al-Tabari (18/ 32, 33), Ibn Kathir (5/ 161), Tafsir Al-Qurtubi (10/ 414), Al-Muharrar Al-Wajiz (3/ 446), Adwa' Al-Bayan (3/ 281) \n5. Tafsir Ibn Kathir (5/ 161), Al-Baghawi (3/ 194, 195), Al-Tabari (18/ 32, 33), Al-Qurtubi (10/ 4141).",
    "book_id": "72",
    "new_page_number": 12
  },
  {
    "serial_number": "4962093",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "Third School: That they are righteous deeds absolutely.\nThis was narrated from Ibn Abbas as well, Abdul Rahman bin Zaid bin Aslam, and Ali bin Abi Talha. Qatada went to this, and a group of commentators preferred it, taking the generality of the wording (1).\nFourth School: That they are good speech:\nThis school was also reported from Ibn Abbas (2):\n- Ibn Atiyyah Al-Andalusi said: \"And Ibn Abbas saying all the opinions is evidence of him speaking of generality\" (3).\nDiscussion and Preference:\nFrom the previous sayings of the Imams of Tafsir and people of interpretation, the first opinion seems most correct to us for the following considerations:\n1 - That it has been reported from the Prophet, peace and blessings be upon him, interpreting the Enduring Good Deeds as Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar, as in the previous Hadiths from Abu Huraira, Abu Sa'id Al-Khudri, Al-Nu'man bin Bashir, and Abdullah bin Masoud, may Allah Almighty be pleased with them all. These Hadiths are authentic so they were the first reference in interpreting the Enduring Good Deeds.\n2 - What is established from the Companions, may Allah be pleased with them, of interpreting the Enduring Good Deeds as Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, Allahu Akbar, and La Hawla wa La Quwwata illa Billah. This is authentic from Uthman, Ibn Umar, and Ibn Abbas in the most authentic paths narrated from him.\n3 - What was reported of narrations from a group of Followers like Saeed bin Al-Musayyib, Saeed bin Jubayr, and Ata bin Abi Rabah.\n4 - That this opinion is the school of the majority of commentators.",
    "foot_note": "1. Tafsir Al-Baghawi (3/ 195), Tafsir Al-Tabari (18/ 35), Ibn Kathir (5/ 164), Al-Qurtubi (10/ 414), Fath Al-Qadir Al-Shawkani (3/ 414), Adwa' Al-Bayan (3/ 281). \n2. Tafsir Al-Tabari (18/ 34), Ibn Kathir (5/ 164). \n3. Al-Muharrar Al-Wajiz (3/ 546).",
    "book_id": "72",
    "new_page_number": 13
  },
  {
    "serial_number": "4962094",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Section Four: The meanings of the Enduring Good Deeds\nThe Enduring Good Deeds have great meanings mentioned by scholars in books of creeds and Tafsir, and mentioned by linguists in their dictionaries. They are also in books of strange narrations. So we restrict ourselves to mentioning a part of them in the following five branches:\nBranch One: On the meaning of Tasbih:\nTasbih in language is: Tanzih (Exaltation/Purification) (1). The root of Nazh is: Distance. And Tanzih of Allah: Distancing Him from what is not permissible upon Him of imperfections (2).\nAnd Subhan Allah: A proper noun for the meaning of innocence and exaltation (3).\nAnd the meaning: Exalting Allah from [having] a female companion and child... And it is accusative as a verbal noun (Masdar), meaning I declare Allah innocent of evil an innocence (4). And Sabbaha Allah means Exalted Him and Sanctified Him (5).\n- Ibn Al-Jazari said: \"And the origin of Tasbih: Exaltation, Sanctification, and Clearing from imperfections... And it was said its meaning: Hastening to Him and agility in His obedience. And it was said its meaning: Speed to this word. Tasbih may be applied to other types of Dhikr metaphorically, like Tahmid and Tamjid and others. And it may be applied to voluntary prayer and Supererogatory (Nafila)\" (6).\nBranch Two: On the meaning of Tahmid:",
    "foot_note": "1. Al-Sahah by Al-Jawhari (2/ 395). \n2. Al-Fa'iq fi Gharib Al-Hadith (3/ 420). \n3. Taj Al-Arus min Jawahir Al-Qamus (6/ 447). \n4. Al-Qamus Al-Muhit (1/ 284). \n5. Al-Qamus Al-Fiqhi (163). \n6. Al-Nihayah fi Gharib Al-Athar (2/ 833).",
    "book_id": "72",
    "new_page_number": 14
  },
  {
    "serial_number": "4962095",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "- \"Hamd (Praise): Opposite of blame (Dhamm) (1). \"And Tahmid is more emphatic than Hamd, and its meaning is abundance of praising Allah Glory be to Him with good praises. It was said Hamdaka Allah (He praised You Allah) time after time\" (2).\n- And Hamd is more general than Shukr (Thanksgiving) and its meaning: Beautiful praise upon Allah. And it serves as thanks for the blessing that encompassed all. And Hamd is satisfaction, reward, and fulfilling the right.\n- And Al-Hamid is one of Allah Almighty's attributes meaning the Praised One in every condition, and it is one of the Beautiful Names (3).\nBranch Three: On the meaning of Tahlil:\n- Tahlil is saying: \"La ilaha illa Allah\" (4). And the general meaning of the word of Tawhid: No deity [worthy of worship] in truth except Allah.\n- The scholar Al-Shanqiti - may Allah have mercy on him - said: regarding the interpretation of His saying Almighty: \"It is You we worship and You we ask for help\". He said: \"He indicated in this noble verse the realization of the meaning of La ilaha illa Allah. Its meaning is composed of two matters: Negation and Affirmation. The negated: Casting off all deities other than Allah Almighty in all types of worship. And the affirmation: Singling out the Lord of the heavens and earth alone with all types of worship in the prescribed manner\" (5).\nBranch Four: On the meaning of Takbir:",
    "foot_note": "1. Al-Sahah by Al-Jawhari (3/ 28). \n2. Lisan Al-Arab by Ibn Manzur (3/ 155). \n3. Taj Al-Arus by Al-Zabidi (8/ 38 - 39), Al-Mu'jam Al-Wasit (1/ 196). \n4. Al-Sahah by Al-Jawhari (6/ 130). \n5. Adwa' Al-Bayan (1/ 7).",
    "book_id": "72",
    "new_page_number": 15
  },
  {
    "serial_number": "4962096",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "- Takbir is Magnification (Ta'zim) (1). And among Allah's Beautiful Names are \"Al-Mutakabbir and Al-Kabir\" (2).\n- Allahu Akbar:\n- Al-Azhari said: There are two opinions in it: One of them: That its meaning is Allah is Great (Kabir)... And the other opinion: That there is a pronoun in it, the meaning: Allah is Greater (Akbar) Great... And it was said its meaning: Allah is Greater than everything, meaning mightier, so it was omitted due to clarity of meaning.. It was said its meaning: Allah is Greater than that the essence of His greatness and majesty be known..\" (3)\nBranch Five: On the meaning of Hawqalah:\n- Hawqalah: Is a word constructed from \"La Hawla wa La Quwwata illa Billah\" (4), and it is from the sculpted words.\n- And Al-Hawl: Here is movement. It is said: A person Halah Yahulu if he moved. And the meaning: No movement and no power except by the will of Allah Almighty.\n- And Al-Quwwah is strength and opposite of weakness (5).\n- And the meaning: And no movement for us upon working with obedience except by Allah, and no power for us upon leaving disobedience except by Allah. Ibn Abbas, may Allah be pleased with them both, said it.\n- \"No turning away from disobedience of Allah except by the strength of Allah, and no power upon obedience to Allah except by the help of Allah\" Ibn Masoud, may Allah be pleased with him, said it.\n- \"You do not take what you love except by Allah, and you do not abstain from what you hate except by the help of Allah\". Zuhair bin Muhammad said it (6).",
    "foot_note": "1. Lisan Al-Arab by Ibn Manzur (5/ 125). \n2. Al-Nihayah fi Gharib Al-Athar by Ibn Al-Jawzi (4/ 244). \n3. Taj Al-Arus wa Jawahir Al-Qamus by Al-Zabidi (14/ 5). \n4. Lisan Al-Arab by Ibn Manzur (11/ 184), Al-Nihayah fi Gharib Al-Athar (1/ 1088), Mu'jam Maqayis Al-Lughah by Ibn Faris (5/ 36). \n5. Previous Source. \n6. Al-Durr Al-Manthur by Al-Suyuti (9/ 549, 550).",
    "book_id": "72",
    "new_page_number": 16
  },
  {
    "serial_number": "4962097",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "Section Five: Adding the Hawqalah to the Enduring Good Deeds\nHawqalah is \"La Hawla wa La Quwwata illa Billah\". Its addition to the Enduring Good Deeds appeared in several Hadiths raised to the Prophet, peace and blessings be upon him, narrated via Uthman, Abu Sa'id Al-Khudri, and Ibn Masoud, may Allah be pleased with them all.\n- From the Companions, Uthman bin Affan, Ibn Umar, and Ibn Abbas - may Allah be pleased with them - went to adding Hawqalah to the Enduring Good Deeds.\n- And from the Followers, Saeed bin Al-Musayyib and Ata bin Abi Rabah, and Ibn Wahb said it (1).\nHere are some Hadiths and narrations mentioned in the following two branches:\nBranch One: The Hadiths narrated regarding adding Hawqalah to the Enduring Good Deeds:\na) The Hadith of Abu Sa'id Al-Khudri, may Allah be pleased with him, from the Messenger of Allah, peace and blessings be upon him, said: \"Increase in the Enduring Good Deeds. It was said: And what are they, O Messenger of Allah? He said: Takbir, Tahlil, Tasbih, Tahmid, and La Hawla wa La Quwwata illa Billah\" (2).\nb) The Hadith of Uthman, may Allah be pleased with him, for he was asked about the Enduring [deeds]? He said: They are \"La ilaha illa Allah, Subhan Allah, Al-Hamdu Lillah, Allahu Akbar, and La Hawla wa La Quwwata illa Billah\" (3).\nc) The Hadith of Abu Masoud, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"I met Abraham on the night I was taken on the Night Journey, so he said: O Muhammad, convey my Salam to your Ummah and inform them that Paradise has good soil, sweet water, and that it is flat plains (Qi'an), and that its plants are Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar\" (4). And Al-Tabarani added in Al-Saghir and Al-Awsat \"La Hawla wa La Quwwata illa Billah\" (5).",
    "foot_note": "1. Tafsir Al-Quran Al-Azim by Al-Hafiz Ibn Kathir (5/ 162 - 164). \n2. Previously extracted. \n3. Previously extracted. \n4. Narrated by Al-Tirmidhi (5/ 510) number (3462) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 231 - 232) number (1550). \n5. Narrated by Al-Tabarani in Al-Saghir (1/ 326) number (539) and Al-Awsat (4/ 271) number (4170) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 231 - 232) number (1550)",
    "book_id": "72",
    "new_page_number": 17
  },
  {
    "serial_number": "4962098",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "Branch Two: The Narrations narrated regarding adding Hawqalah to the Enduring Good Deeds:\na) The narration of Amara bin Sayyad from Saeed bin Al-Musayyib that he heard him say: regarding the Enduring Good Deeds \"It is the servant's saying Allahu Akbar, Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and La Hawla wa La Quwwata illa Billah\" (1).\nb) What was narrated from Ibn Umar that he was asked about the Enduring Good Deeds? So he said: La ilaha illa Allah, Allahu Akbar, Subhan Allah, and La Hawla wa La Quwwata illa Billah (2).\nc) Ibn Juraij said and Ata bin Abi Rabah said similarly (3).\nd) And Ibn Wahb said it (4).\ne) And it was also narrated from Ibn Abbas, may Allah be pleased with them both (5).",
    "foot_note": "1. Previously extracted p: \n2. Tafsir Al-Tabari (18/ 33), Tafsir Al-Quran Al-Azim - Ibn Kathir (5/ 162 - 164). \n3. Previous Source. \n4. Previous Source. \n5. Previous Source.",
    "book_id": "72",
    "new_page_number": 18
  },
  {
    "serial_number": "4962099",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Section Two: The Enduring Good Deeds, their secrets and status\nThe Enduring Good Deeds have a great status among other remembrances (Adhkar), and they have wondrous secrets that indicate their noble station and the secret of their great virtue. Despite their brevity, they have contained many meanings. I will write about their status and secrets in two requirements:\nRequirement One: On explaining the secrets of the Enduring Good Deeds.\nRequirement Two: On the status of the Enduring Good Deeds.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 19
  },
  {
    "serial_number": "4962100",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "Requirement One: On explaining the secret of the virtue of the Enduring Good Deeds\nSheikh Izz al-Din bin Abd al-Salam - may Allah Almighty have mercy on him - mentioned in a famous treatise of his on Creed in which he answered some people of his time, written to him as a test, mentioned by Imam Taj al-Din al-Subki in full in Tabaqat al-Shafi'iyyah al-Kubra. He mentioned that Allah's ninety-nine Beautiful Names with which He named Himself in His Book and the Sunnah of His Messenger, peace and blessings be upon him, are included in four words, which are the Enduring Good Deeds.\n- The First Word: Saying Subhan Allah. Its meaning in the speech of the Arabs is exaltation and negation. It includes negating imperfection and defect from the Essence of Allah and His Attributes. So whatever of His names is a negation falls under this word, like Al-Quddus (The Holy) who is Pure from every defect, and Al-Salam (The Peace) who is safe from every bane.\n- The Second Word: Saying Al-Hamdu Lillah. It includes affirming the types of perfection for His Essence and Attributes. So whatever of His names implies affirmation like Al-Alim (The Knowing), Al-Qadir (The Capable), Al-Sami' (The Hearing), and Al-Basir (The Seeing) falls under the second word. So we negated by our saying Subhan Allah every defect we reasoned and every imperfection we understood, and we affirmed by Hamd every perfection we knew and every majesty we perceived. And beyond what we negated and affirmed is a great matter that was absent from us and we were ignorant of, so we realized it from the aspect of generality by our saying Allahu Akbar, and it is:\n- The Third Word: Meaning that He is more majestic than what we negated and affirmed, and that is the meaning of his saying, peace and blessings be upon him: \"I cannot enumerate praise upon You, You are as You praised Yourself\". So whatever of His names implies praise above what we knew and realized like Al-A'la (The Most High) and Al-Muta'ali (The Exalted) falls under our saying Allahu Akbar. If there existed of this nature, we negated that there be in existence one who resembles Him or equals Him, so we realized that by our saying \"La ilaha illa Allah\", and it is:\n- The Fourth Word: For Divinity returns to entitlement to servitude, and no one deserves servitude except one who is described with all that we mentioned. So whatever of His names implies the whole in general like Al-Wahid (The One), Al-Ahad (The Unique), and Dhu Al-Jalal wa Al-Ikram (Possessor of Majesty and Honor) falls under our saying La ilaha illa Allah. He only deserved servitude because the descriptions of Majesty and attributes of Perfection became obligatory for Him, which describers cannot describe nor counters count..\" (1).\nFrom the previous, the secret of the distinction of these words over others, and the noble station they occupied over other types of Dhikr becomes clear to us. Imam Al-Hafiz Al-Manawi, may Allah have mercy on him, said: \"These four words are the best speech because they imply exalting Him Almighty from all that is impossible for Him, and describing Him with all descriptions of perfection obligatory for Him, and His uniqueness due to His Oneness, and His specificity with His Greatness and Pre-eternity understood from His being Greater (Akbariyyah)\" (2).",
    "foot_note": "1. Tabaqat Al-Shafi'iyyah Al-Kubra (8/ 220), Juz' fi Al-Baqiyat Al-Salihat (1/ 44), Mishkat Al-Masabih by Al-Tabrizi with its explanation by Al-Mubarakfuri (7/ 893). \n2. Mishkat Al-Masabih by Al-Tabrizi with its explanation Mir'at Al-Mafatih by Abu Al-Hasan Al-Mubarakfuri (7/ 893).",
    "book_id": "72",
    "new_page_number": 20
  },
  {
    "serial_number": "4962101",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "Requirement Two: On the status of the Enduring Good Deeds\nDue to the greatness of the status of the Enduring Good Deeds, what indicates this great position and high rank has been reported in the purified Prophetic Sunnah through the following:\n1 - The Prophet, peace and blessings be upon him, made it suffice for the Holy Quran for the one who does not know it well.\nDue to the Hadith of Abdullah bin Abi Awfa who said: A Bedouin said: O Messenger of Allah, I have tried the Quran but I could not [learn] it, so teach me something that suffices for the Quran. He said: Say: \"Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar\". He said it and held it with his finger. Then he said: O Messenger of Allah, this is for my Lord, so what is for me? He said: Say: Allahumma Ighfir li Warhamni Wa 'Afini Warzuqni (O Allah forgive me, have mercy on me, grant me well-being, and provide for me), and I think he said: Wahdini (and guide me). The Bedouin went away. The Messenger of Allah, peace and blessings be upon him, said: \"The Bedouin went having filled his hands with good\" (1). Al-Bayhaqi added: Wa La Hawla wa La Quwwata illa Billah (2).\n2 - That they stand in place of the great mother acts of worship like Jihad in the path of Allah, spending, and night prayer - whatever of it was voluntary.\nDue to the Hadith of Abdullah bin Masoud, may Allah be pleased with him, said: \"Indeed, Allah has distributed your characters among you just as He distributed your provisions among you. And indeed, Allah gives wealth to whom He loves and whom He does not love, but He does not give Faith except to whom He loves. So if Allah loves a servant, He gives him Faith. So whoever is stingy with wealth to spend it, and fears the enemy to fight him, and the night to endure it, let him increase in saying La ilaha illa Allah, Allahu Akbar, Al-Hamdu Lillah, and Subhan Allah\" (3).\n3 - That their place is around the Throne, reminding of their owner:\nIn the Hadith of Al-Nu'man bin Bashir, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"Indeed, among what you mention of the Majesty of Allah, Tasbih, Tahlil, and Tahmid, curve around the Throne, having a buzzing sound like the buzzing of bees, reminding of their owner. Does not one of you love to have - or continue to have - someone who reminds of him\" (4).",
    "foot_note": "1. Narrated by Abu Dawood (1/ 308) number (132), Ibn Hibban authenticated it (5/ 116) and Al-Arna'ut classed it as Hasan in Sahih Ibn Hibban number (1810), and Al-Albani classed it as Hasan in Sahih Al-Targhib number (1561) (2/ 236). \n2. Narrated by Al-Bayhaqi (2/ 381) and Al-Mundhiri said: Its chain is Jayyid (good) and Al-Albani authenticated it in Sahih Al-Targhib (2/ 237). \n3. Narrated by Al-Bukhari in Al-Adab Al-Mufrad (1/ 104) number (275) and Al-Albani authenticated it in Sahih Al-Targhib number (1571) (2/ 242). \n4. Narrated by Ibn Majah and the wording is his (2/ 1252), and Al-Hakim and said: Authentic chain and they did not narrate it (1/ 678), and Al-Albani authenticated it in Sahih Al-Targhib number (1568) (2/ 240).",
    "book_id": "72",
    "new_page_number": 21
  },
  {
    "serial_number": "4962102",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "4 - That it is the gatherer of Good: Since it gathers for its owner goodness in his world and Hereafter.\n- It was reported in the Hadith of Sa'd bin Abi Waqqas, may Allah be pleased with him, said: A Bedouin came to the Prophet, peace and blessings be upon him, and said: Teach me words I can say. He said: \"Say: La ilaha illa Allah wahdahu la sharika lah, Allahu Akbar kabira, wa Al-Hamdu Lillahi kathira, wa Subhan Allahi Rabbi Al-Alamin, wa La Hawla wa La Quwwata illa Billah Al-Aziz Al-Hakim\" He said: These are for my Lord, so what is for me? He said: \"Say: Allahumma Ighfir li Warhamni Wahdini Warzuqni\", and in a narration \"Wa 'Afini\" (1). And in a narration he said: \"For these gather for you your world and your Hereafter\" (2).\n- And in the Hadith of Anas bin Malik, may Allah be pleased with him, said: A Bedouin man came to the Messenger of Allah, peace and blessings be upon him, and said: O Messenger of Allah: Teach me good. He said: \"Say: Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar\", then he returned. When the Messenger of Allah, peace and blessings be upon him, saw him, he smiled and said: \"The miserable one thought.\" He said: O Messenger of Allah (Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar) this is all for Allah, so what is for me? The Messenger of Allah, peace and blessings be upon him, said: If you say \"Subhan Allah\", Allah says: You have spoken the truth. If you say: \"Al-Hamdu Lillah\", Allah says: You have spoken the truth. If you say: \"La ilaha illa Allah\", Allah says: You have spoken the truth. If you say: \"Allahu Akbar\", Allah says: You have spoken the truth. So you say: Allahumma Ighfir li (O Allah forgive me), Allah says: I have done. So you say: Allahumma Irhamni (O Allah have mercy on me), Allah says: I have done. And you say: Allahumma Urzuqni (O Allah provide for me), Allah says: I have done. He said: So the Bedouin tied seven on his hands (3).\n5 - That Allah Mighty and Majestic chose them from among all speech for their status and great virtue:\nThat was authenticated from the Hadith of Abu Huraira and Abu Sa'id, may Allah be pleased with them, from the Prophet, peace and blessings be upon him, said: \"Indeed, Allah chose four from speech: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar. So whoever says: Subhan Allah; twenty good deeds are written for him, and twenty bad deeds are removed from him. And whoever says: Allahu Akbar, the like of that. And whoever says: La ilaha illa Allah, the like of that. And whoever says: Al-Hamdu Lillahi Rabbi Al-Alamin, from his own self, thirty good deeds are written for him, and thirty bad deeds are removed from him\" (4).",
    "foot_note": "1. Narrated by Muslim (4/ 2072) number (2696). \n2. Narrated by Muslim (8/ 71) number (7026). \n3. Narrated by Al-Bayhaqi in Shu'ab Al-Iman (2/ 133), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah number (3336) (13/ 139). \n4. Narrated by Ahmad (13/ 387), and Al-Hakim (1/ 512), and Al-Albani authenticated it in Sahih Al-Jami' number (1718).",
    "book_id": "72",
    "new_page_number": 22
  },
  {
    "serial_number": "4962103",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "Section Three: On explaining the virtue of the Enduring Good Deeds generally\nThe one contemplating the texts of the purified Sunnah finds that many Hadiths were narrated explaining the virtue of the Enduring Good Deeds. Some mentioned generally the virtue of these words combined, and some mentioned the virtue of each word of them in detail. Through this section, we will present the Hadiths mentioned regarding the virtue of the Enduring Good Deeds and the places they are said generally in two requirements:\nRequirement One: On the virtue of the Enduring Good Deeds generally.\nRequirement Two: On the places they are said generally.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 23
  },
  {
    "serial_number": "4962104",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "Requirement One: On explaining the virtue of the Enduring Good Deeds generally\nMany Hadiths were narrated regarding the virtue of the Enduring Good Deeds generally explaining their merit. I mention a part of what is authentic regarding them as follows:\n1 - That they are the most beloved speech to Allah Almighty:\nDue to the Hadith of Samurah bin Jundub, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"The most beloved speech to Allah is four: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar; it does not harm you with which of them you started\" (1).\n2 - That they are the best (Atyab) of speech:\nAs in the Hadith of Samurah, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"... Four are from the best of speech and they are from the Quran, it does not harm you with which of them you started: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar..\" (2).\n3 - That they are the most excellent (Afdal) speech:\nDue to his saying, peace and blessings be upon him: \"The most excellent speech is four: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar\" (3).\n4 - That they are more beloved than what the sun rose upon:\nIn the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"That I say: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar; is more beloved to me than what the sun rose upon\" (4).\n5 - That they are the best (Khayr) of speech:\nDue to his saying, peace and blessings be upon him: \"The best of speech is four, it does not harm you with which of them you started: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar\" (5).",
    "foot_note": "1. Narrated by Muslim number (1685). \n2. Narrated by Ahmad (33/ 311), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah (1/ 613) number (346). \n3. Narrated by Al-Bukhari (8/ 173). \n4. Narrated by Muslim (4/ 2072) number (2695). \n5. Sahih Ibn Hibban (3/ 117), and Al-Albani authenticated it in Sahih Al-Jami' number (3284), and Al-Arna'ut in Sahih Ibn Hibban number (836).",
    "book_id": "72",
    "new_page_number": 24
  },
  {
    "serial_number": "4962105",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "6 - That they are the plants of Paradise:\nSeveral confirmed Hadiths from the Messenger of Allah, peace and blessings be upon him, were reported regarding that as follows:\na. The Hadith of Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, passed by him while he was planting a plant, so he said: \"O Abu Huraira, what are you planting? I said: A plant. He said: \"Shall I not guide you to a plant better than this? Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar. For each one, a tree will be planted for you in Paradise\" (1).\nb. The Hadith of Ibn Masoud, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"I met Abraham on the night I was taken on the Night Journey, so he said: O Muhammad, convey my Salam to your Ummah, and inform them that Paradise has good soil, sweet water, and that it is flat plains, and that its plants are Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar\" (2). And in a narration \"And La Hawla wa La Quwwata illa Billah\" (3).\nc. The Hadith of Salman, may Allah be pleased with him, said: I heard the Messenger of Allah, peace and blessings be upon him, saying: \"Indeed, in Paradise are flat plains, so increase in its plants. They said: O Messenger of Allah, and what are its plants? He said: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar\" (4).\nd. The Hadith of Ibn Abbas, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever says: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar, a tree will be planted for him in Paradise for each one of them\" (5).",
    "foot_note": "1. Narrated by Ibn Majah (2/ 1251) number (3807) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 231) number (1549). \n2. Narrated by Al-Tirmidhi (5/ 387), and Al-Albani classed it as Hasan in Sahih Al-Jami' number (5152). \n3. Narrated by Al-Tabarani in Al-Saghir (1/ 326), Al-Awsat (4/ 271), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 230). \n4. Narrated by Al-Tabarani in Al-Kabir (6/ 48), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 232) number (1551). \n5. Narrated by Al-Tabarani and its chain is Hasan said Al-Mundhiri and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 232) number (1552).",
    "book_id": "72",
    "new_page_number": 25
  },
  {
    "serial_number": "4962106",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "7 - The greatness of its reward especially for one unable to perform worship:\nIt was confirmed in the Hadith of Umm Hani, may Allah be pleased with her, said: The Messenger of Allah, peace and blessings be upon him, passed by me one day, so I said: O Messenger, I have become old and weak - or as she said - so command me with a deed I can do while sitting. He said: \"Glorify Allah (Sabbihi) a hundred times; for it equates for you freeing a hundred slaves from the offspring of Ishmael. And praise Allah (Ahmudi) a hundred times; for it equates for you a hundred saddled and bridled horses you carry upon in the path of Allah. And magnify Allah (Kabbiri) a hundred times; for it equates for you a hundred garlanded and accepted camels. And declare Allah's Oneness (Hallili) a hundred times. Ibn Khalaf said: I think he said: It fills what is between the heaven and the earth, and no deed is raised for anyone on that day unless he brings the like of what you brought\" (1). And in a narration: \"And declare Allah's Oneness a hundred times, it leaves no sin and no deed precedes it\" (2).\n8 - That they weigh heavy in the Balance on the Day of Resurrection and fill what is between the heaven and the earth:\n- Due to the Hadith of Abu Salma - the shepherd of the Messenger of Allah, peace and blessings be upon him, said: I heard the Messenger of Allah, peace and blessings be upon him, saying: \"Bakhin Bakhin (Excellent! Excellent!) for five, how heavy they are in the Balance: La ilaha illa Allah, Subhan Allah, Al-Hamdu Lillah, Allahu Akbar, and the righteous child who dies for a Muslim man and he seeks reward for him\" (3).\n- And it was confirmed in the Hadith of Abu Malik Al-Ash'ari that the Prophet, peace and blessings be upon him, said: \"Purity is half of Faith, and Al-Hamdu Lillah fills the Balance, and Subhan Allah and Al-Hamdu Lillah fill what is between the heaven and the earth, and Prayer is light, and Charity is proof, and Patience is illumination, and the Quran is an argument for you or against you. Every person goes out morning, so he sells himself, either freeing it or destroying it\" (4).",
    "foot_note": "1. Narrated by Ahmad (44/ 479) and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 223) number (1553). \n2. Narrated by Al-Tabarani in Al-Kabir (18/ 150), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 223) number (1553). \n3. Narrated by Ahmad in Al-Musnad (36/ 514), Mustadrak Al-Hakim (1/ 511), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah (2/ 202) number (1204). \n4. Sahih Muslim with Al-Nawawi's explanation (1/ 203) number (223).",
    "book_id": "72",
    "new_page_number": 26
  },
  {
    "serial_number": "4962107",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "9 - That they are a protection (Junnah) on the Day of Resurrection coming from in front of their owner and from behind him as protection from the Fire.\nDue to what is in the Hadith of Abu Huraira, may Allah be pleased with him, that the Messenger of Allah, peace and blessings be upon him, said: \"Take your protection\" They said: O Messenger of Allah: Is an enemy present? He said: \"No, but your protection from the Fire. Say: Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar; for they come on the Day of Resurrection as saviors/leaders (Mujannibat) and followers (Mu'aqqibat), and they are the Enduring Good Deeds\" (1).\n10 - That they are expiation for sins: They remove them completely and shake them off as a tree shakes off its leaves, as was confirmed from the Messenger of Allah, peace and blessings be upon him, in the Hadith of Anas, may Allah be pleased with him, that he took a branch and shook it but it did not shake [leaves] off, then shook it and it did not shake [leaves] off [then shook it and it shook leaves off], so the Messenger of Allah, peace and blessings be upon him, said: \"Indeed Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Allahu Akbar shake off sins as a tree shakes off its leaves\" (2).\nAnd in the Hadith of Abdullah bin Amr, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"There is no one on earth who says: La ilaha illa Allah, Allahu Akbar, and La Hawla wa La Quwwata illa Billah except that his sins are expiated from him, even if they were like the foam of the sea\" (3). Ibn Abi Al-Dunya and Al-Hakim added \"Subhan Allah and Al-Hamdu Lillah\" (4).\n11 - That they move their sayer away from the Fire.\nThis was authentic in the Hadith of Aisha, may Allah be pleased with her; that the Messenger of Allah, peace and blessings be upon him, said: \"Every human from the children of Adam was created with three hundred and sixty joints. So whoever magnifies Allah (Takbir), praises Allah (Tahmid), declares Allah's Oneness (Tahlil), glorifies Allah (Tasbih), asks forgiveness from Allah (Istighfar), removes a stone from the path of Muslims, or a thorn or a bone from the path of Muslims, and enjoins good or forbids evil, according to the number of those three hundred and sixty (Sulama/joints); he indeed walks on that day having moved himself away from the Fire\" (5).",
    "foot_note": "1. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra (6/ 212), and Al-Albani authenticated it in Sahih Al-Jami' number (3214). \n2. Narrated by Al-Bukhari in Al-Adab Al-Mufrad (1/ 221), and Ahmad in Al-Musnad (3/ 152), and Al-Albani classed it as Hasan in Al-Silsilah Al-Sahihah number (3168) (12/ 1). \n3. Sunan Al-Tirmidhi (5/ 509) number (3460), and Al-Albani classed it as Hasan in Sahih Al-Targhib (2/ 241) number (1569). \n4. Mustadrak Al-Hakim (1/ 682), and Al-Albani classed it as Hasan number (1569). \n5. Sahih Muslim with Al-Nawawi's explanation (2/ 698) number (1007).",
    "book_id": "72",
    "new_page_number": 27
  },
  {
    "serial_number": "4962108",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "12 - That they are charity for the one who does not find charity.\nThis was confirmed in the Hadith of Abu Dharr, may Allah be pleased with him: That some people from the Companions of the Prophet, peace and blessings be upon him, said to the Prophet, peace and blessings be upon him: O Messenger of Allah, the wealthy people (Ahl al-Duthur) have gone with the rewards; they pray as we pray, they fast as we fast, and they give charity from the surplus of their wealth. He said: \"Has not Allah made for you what you can give in charity? Indeed, in every Tasbihah is a charity, every Takbirah is a charity, every Tahmidah is a charity, every enjoining of good is a charity, every forbidding of evil is a charity, and in the sexual act (Bud') of one of you is a charity.\" They said: O Messenger of Allah, does one of us fulfill his desire and have a reward in it? He said: \"Do you see if he placed it in the forbidden, would there be a burden upon him? Likewise, if he places it in the lawful, he has a reward\" (1).\nHis saying: Al-Duthur - with Damma on Dal - plural of Dathr with Fatha: which is abundant wealth. And Al-Bud' - with Damma on Ba - is intercourse, and it was said: the private part itself.\n- It was also confirmed from the Prophet, peace and blessings be upon him, that the Enduring Good Deeds are among the doors of charity. In the Hadith of Abu Dharr, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: \"Upon every soul every day the sun rises is a charity from him upon himself from the doors of charity: Takbir, Subhan Allah, Al-Hamdu Lillah, La ilaha illa Allah, and Astaghfirullah, and he enjoins good and forbids evil, and removes the thorn from the path of people and the bone and the stone, and you guide the blind, and make the deaf and dumb hear until he understands, and guide the seeker to his need whose place you know, and run with the strength of your legs to the sorrowful seeking help, and lift with the strength of your arms with the weak. All that is from the doors of charity from you upon yourself..\" (2).\n13 - The gates of Heaven open for them.\nAs in the Hadith of Ibn Umar, may Allah be pleased with them both, said: While we were praying with the Messenger of Allah, peace and blessings be upon him, a man from the people said: Allahu Akbar Kabira, wa Al-Hamdu Lillahi Kathira, wa Subhan Allahi Bukratan wa Asila. The Messenger of Allah, peace and blessings be upon him, said: Who is the sayer of such and such? A man from the people said: I am, O Messenger of Allah. He said: \"I wondered at it, the gates of Heaven were opened for it.\" Ibn Umar, may Allah be pleased with them both, said: \"I have not left them since I heard them from the Messenger of Allah, peace and blessings be upon him\" (3).",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad (35/ 382), and Al-Arna'ut authenticated it in Al-Musnad number (21482). \n2. Narrated by Ahmad (35/ 383), Al-Sunan Al-Kubra by Al-Nasa'i (5/ 325) and Al-Albani authenticated it in Sahih Al-Jami' number (4038). \n3. Sunan Al-Tirmidhi (5/ 575), and Al-Albani authenticated it in Sahih Sifat Al-Salah number (74).",
    "book_id": "72",
    "new_page_number": 28
  },
  {
    "serial_number": "4962109",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "Requirement Two: On the places where the Enduring Good Deeds are said\nThere are places for the Enduring Good Deeds to be said which are established in the noble Prophetic Sunnah. Among these places:\n1 - If he wakes up at night.\nIt was confirmed that the Prophet, peace and blessings be upon him, used to start with the Enduring Good Deeds or some of them when he woke up at night. Among that: He used to say Takbir ten times, Tahmid ten times, Tasbih ten times, Istighfar, and Tahlil ten times. From Shuraiq Al-Hawzani said: I entered upon Aisha, may Allah be pleased with her, and asked her with what did the Messenger of Allah, peace and blessings be upon him, start if he woke up at night. She said: \"You asked me about something no one asked me about before you. When he woke up at night, he would say Allahu Akbar ten times, Al-Hamdu Lillah ten times, and say Subhan Allah wa Bi-Hamdihi ten times, and say Subhan Al-Malik Al-Quddus ten times, and ask forgiveness ten times, and say La ilaha illa Allah ten times, then say: Allahumma inni a'udhu bika min diq al-dunya wa diq yawm al-qiyamah (O Allah I seek refuge in You from the distress of the world and the distress of the Day of Resurrection) ten times, then he would start the prayer\" (1).\n2 - If he started the Prayer.\nIt was authenticated from the Prophet, peace and blessings be upon him, that he used to say at the start of prayer: Allahu Akbar Kabira, wa Al-Hamdu Lillahi Kathira, wa Subhan Allahi Bukratan wa Asila and repeat it. As in the Hadith of Jubayr bin Mut'im who said: I saw the Messenger of Allah, peace and blessings be upon him, when he entered into prayer say: \"Allahu Akbar Kabira, Allahu Akbar Kabira, wa Al-Hamdu Lillahi Kathira, Al-Hamdu Lillahi Kathira, Subhan Allahi Bukratan wa Asila, three times, I seek refuge in You from the accursed Satan from his spurring, blowing, and spitting\" (2).",
    "foot_note": "1. Narrated by Abu Dawood (1/ 279), and Al-Albani classed it as Hasan in Sahih Sunan Ibn Majah number (1356). \n2. Narrated by Abu Dawood (1/ 122), Ibn Majah (1/ 269), and Ahmad (4/ 85). Al-Albani authenticated it in Sahih Al-Kalim Al-Tayyib (1/ 98) number (80) and said: In the origin of the description of the Prophet's prayer, peace be upon him, its like in supporting evidences is acceptable Allah willing.",
    "book_id": "72",
    "new_page_number": 29
  },
  {
    "serial_number": "4962110",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "3 - In Salat Al-Tasabih (Prayer of Glorifications):\nFrom Ibn Abbas, may Allah be pleased with them both, that the Messenger of Allah, peace and blessings be upon him, said to Al-Abbas bin Abd al-Muttalib: \"O Abbas, O my uncle, shall I not give you? Shall I not grant you? Shall I not inform you? Shall I not do for you ten traits? If you do that, Allah will forgive you your sin, the first and the last of it, the old and the new of it, the mistake and the deliberate of it, the small and the big of it, the secret and the open of it? Ten traits: You pray four Rak'ahs reading in every Rak'ah Fatihat al-Kitab and a Surah. When you finish the reading in the first Rak'ah while you are standing, you say Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar fifteen times. Then you bow and say it while you are bowing ten times. Then you raise your head from bowing and say it ten times. Then you go down prostrating and say it while you are prostrating ten times. Then you raise your head from prostration and say it ten times. Then you prostrate and say it ten times. Then you raise your head and say it ten times. That is seventy-five in every Rak'ah. You do that in four Rak'ahs. If you can pray it once every day, then do so. If you do not do so, then once every Friday. If you do not do so, then once every month. If you do not do so, then once every year. If you do not do so, then once in your lifetime\" (1).\n4 - At the ends of the prescribed Prayers:\nIt was reported in several descriptions and manners, including:\na) First Description: You glorify (Tasbih) after every prayer thirty-three times, praise (Tahmid) thirty-three times, and magnify (Takbir) thirty-three times, and say to complete the hundred: La ilaha illa Allah wahdahu la sharika lah lahu al-mulk wa lahu al-hamd wa huwa 'ala kulli shay'in qadir. Due to the Hadith of Abu Huraira, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever glorifies Allah after every prayer thirty-three times, and praises Allah thirty-three times, and magnifies Allah thirty-three times, and says to complete the hundred La ilaha illa Allah wahdahu la sharika lah lahu al-mulk wa lahu al-hamd wa huwa 'ala kulli shay'in qadir, his sins are forgiven even if they were like the foam of the sea\" (2).\nb) Second Description: He glorifies thirty-three times, praises thirty-three times, and magnifies thirty-four times. Due to what was authenticated from Ka'b bin Ujrah, may Allah be pleased with him, raised [to the Prophet]: \"Followers (Mu'aqqibat), the one who says them or does them after every prescribed prayer will not be disappointed: thirty-three Tasbihah, thirty-three Tahmidah, and thirty-four Takbirah\" (3).\nc) Third Description: Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar one hundred times.",
    "foot_note": "1. Narrated by Al-Tirmidhi (2/ 347), Abu Dawood (1/ 499), and Al-Albani authenticated it in Sahih Sunan Abi Dawood (5/ 40) and said: It has been strengthened by a group of Imams including Al-Ajurri, Ibn Mandah, Abu Muhammad Abdul Rahim Al-Misri, Abu Al-Hasan Al-Maqdisi, Al-Mundhiri, and Ibn Al-Salah. \n2. Sahih Muslim with Al-Nawawi's explanation (1/ 418) number (597). \n3. Sahih Muslim with Al-Nawawi's explanation (1/ 418) number (596).",
    "book_id": "72",
    "new_page_number": 30
  },
  {
    "serial_number": "4962111",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "Due to the Hadith of Ka'b bin Ujrah also raised [to the Prophet], and in it he said, peace and blessings be upon him: \"Followers (Mu'aqqibat), the one who says them will not be disappointed: Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar one hundred times\" (1).\n5 - If he approaches Arafat and his sight falls on the Mount of Mercy (Jabal Al-Rahmah):\nIt is prescribed for him to say: Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar (2).\n6 - At the knot of Distress:\nDue to what was confirmed from Ibn Abbas, may Allah be pleased with them both, that the Prophet, peace and blessings be upon him, used to say at distress: \"La ilaha illa Allah Al-Halim Al-Karim, wa Subhan Allah Rabb Al-Arsh Al-Azim, wa Subhan Allah Rabb Al-Samawat Al-Sab' wa Rabb Al-Arsh Al-Azim\" (3).\n7 - When he retires to his bed:\nDue to the Hadith of Abu Huraira, may Allah be pleased with him, from the Prophet, peace and blessings be upon him, said: Whoever says when he retires to his bed: \"La ilaha illa Allah wahdahu la sharika lah lahu al-mulk wa lahu al-hamd wa huwa 'ala kulli shay'in qadir wa La Hawla wa La Quwwata illa Billah, wa Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar; his sins - or he said his errors - are untied [forgiven] even if they were like the foam of the sea\" (4).\n8 - When taking to beds and preparing for sleep:\nThe Prophet, peace and blessings be upon him, advised Ali and Fatima with that and said: \"Shall I not guide you to something better than what you asked for? When you take to your beds, magnify Allah thirty-four times, praise thirty-three times, and glorify thirty-three times, for that is better for you than a servant\" (5).\n9 - Whoever wakes up at night (Ta'arra):\nAs in the Hadith of Ubada bin Al-Samit said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever wakes up at night and says when he wakes up La ilaha illa Allah wahdahu la sharika lah, lahu al-mulk wa lahu al-hamd wa huwa 'ala kulli shay'in qadir, Subhan Allah wa Al-Hamdu Lillah wa La ilaha illa Allah wa Allahu Akbar wa La Hawla wa La Quwwata illa Billah, then supplicated Rabb Ighfir li (Lord forgive me) - or he said supplicated - it will be answered for him. If he got up and performed ablution then prayed, his prayer will be accepted\" (6).",
    "foot_note": "1. Al-Adab Al-Mufrad by Al-Bukhari (1/ 218), and Al-Albani authenticated it in Sahih Al-Adab Al-Mufrad (1/ 241) number (622). \n2. Sifat Hajj Al-Nabi peace be upon him by Al-Albani (1/ 54) number (79). \n3. Sunan Ibn Majah (2/ 1278), and Al-Albani authenticated it in Sahih Sunan Ibn Majah number (3883). \n4. Narrated by Ibn Hibban in his Sahih (12/ 338), and Al-Nasa'i (6/ 202), and Al-Albani authenticated it in Al-Sahih number (3414). \n5. Narrated by Ahmad (2/ 141) and Al-Tirmidhi (5/ 477), and Al-Albani authenticated it in Sahih Al-Jami' number (2619). \n6. Narrated by Abu Dawood (4/ 474), and Ibn Majah (2/ 1276), and Al-Albani authenticated it in Sahih Sunan Ibn Majah (3/ 378) number (3878).",
    "book_id": "72",
    "new_page_number": 31
  },
  {
    "serial_number": "4962112",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Section Four: On explaining the virtue of the Enduring Good Deeds in detail\nJust as summary Hadiths were reported regarding the virtue of the Enduring Good Deeds; detailed Hadiths were also reported explaining their virtue, places of saying them, descriptions, and manners. Through this section, we attempt to collect the Hadiths reported regarding the virtue of each word of the Enduring Good Deeds along with explaining its virtue through five requirements:\nRequirement One: On explaining the virtue of Tasbih.\nRequirement Two: On explaining the virtue of Tahmid.\nRequirement Three: On explaining the virtue of the word of Tawhid.\nRequirement Four: On explaining the virtue of Takbir.\nRequirement Five: On explaining the virtue of Hawqalah.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 32
  },
  {
    "serial_number": "4962113",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "Requirement One: On explaining the virtue of Tasbih\nIn this requirement, we talk about Tasbih through the following two branches:\n- Branch One: On the virtue of Tasbih:\nThe Hadiths reported regarding the virtue of Tasbih are either absolute (general), or restricted by a Name of Allah or an attribute or a number. We will begin by mentioning what was reported of absolute virtue for Tasbih, followed by what was reported restricted through the following:\na) What was reported regarding the virtue of Absolute Tasbih:\n1 - The greatness of the reward of its sayer:\n- In the Hadith of Mus'ab bin Sa'd said: My father told me, he said: We were with the Messenger of Allah, peace and blessings be upon him, and he said: \"Is one of you unable to earn a thousand good deeds every day?\" A questioner from those sitting with him asked: How can one of us earn a thousand good deeds? He said: \"He glorifies (Yusabbihu) a hundred times, so a thousand good deeds are written for him, or a thousand sins are removed from him\" (1).\n- And in the Hadith of Umm Hani - previous - that the Prophet, peace and blessings be upon him, said to her: \"Glorify Allah a hundred times, for it equates for you a hundred slaves you free from the offspring of Ishmael...\" (2).\n2 - That it is a charity among charities:\nDue to the Hadith of Abu Dharr - previous - and in it: \"Indeed, in every Tasbihah is a charity...\" (3).\n3 - That it fills what is between the heaven and the earth:\nDue to what was authenticated in the Hadith of Abu Malik Al-Ash'ari, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"... And Subhan Allah and Al-Hamdu Lillah fill - or fills - what is between the heaven and the earth...\" (4).\nb) What was reported regarding the virtue of Restricted Tasbih (by a Name or Attribute of Allah or a number):\n1 - That it is heavy in the Balance, beloved to the Most Merciful:\nAs in the Sahih from the Hadith of Abu Huraira, may Allah be pleased with him, said: The Prophet, peace and blessings be upon him, said: \"Two words, light on the tongue, heavy in the Balance, beloved to the Most Merciful: Subhan Allah wa Bi-Hamdihi, Subhan Allah Al-Azim\" (5).\n2 - That it is the most beloved speech to Allah:\nDue to what is in Sahih Muslim from the Hadith of Abu Dharr, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Shall I not inform you of the most beloved speech to Allah?\" I said: O Messenger of Allah: Inform me of the most beloved speech to Allah? He said: \"Indeed, the most beloved speech to Allah is; Subhan Allah wa Bi-Hamdihi\" (6).\n3 - That it is the best speech and thus Allah chose it for His servants:\nIn Sahih Muslim that the Messenger of Allah, peace and blessings be upon him, was asked: Which speech is best? He said: \"What Allah chose for His angels or His servants, Subhan Allah wa Bi-Hamdihi\" (7).\n4 - That it is the plants of Paradise:\nAs in the Hadith of Abdullah bin Amr, may Allah be pleased with them both, said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever says: Subhan Allah wa Bi-Hamdihi; a palm tree is planted for him in Paradise\" (8). And in a narration from him said: \"Subhan Allah Al-Azim wa Bi-Hamdihi; a tree is planted for him in Paradise\" (9).",
    "foot_note": "1. Narrated by Muslim (4/ 2073) number (2698). \n2. Previously extracted. \n3. Previously extracted. \n4. Previously extracted. \n5. Narrated by Al-Bukhari (8/ 107), and Muslim (4/ 2072). \n6. Narrated by Muslim (4/ 2093) number (2731). \n7. Narrated by Muslim (4/ 2093) number (2731). \n8. Previously extracted. \n9. Sahih Ibn Hibban (3/ 109) number (827) and Al-Albani authenticated it in Al-Sahih number (64). And Al-Albani authenticated it in Sahih Al-Targhib number (1543).",
    "book_id": "72",
    "new_page_number": 33
  },
  {
    "serial_number": "4962114",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "5 - That Tasbih is a cause of provision:\nAs in the Hadith of Sulayman bin Yasar from a man of the Ansar that the Prophet, peace and blessings be upon him, said: \"Noah said to his son: I command you with a commandment and I shorten it so you do not forget it; I command you with two things and forbid you from two things: As for the two I command you with, Allah and His righteous creation rejoice in them, and they increase access to Allah - and he mentioned one of them - and I command you with Subhan Allah wa Bi-Hamdihi; for they are the prayer of creation, and by them creation is provided for, [And there is not a thing except that it exalts [Allah] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing and Forgiving] (1) (2).\n6 - That it stands in place of mother acts of worship like Night Prayer, Spending, and Jihad in the case of voluntary action:\nDue to the Hadith of Abu Umama, may Allah be pleased with him, said: The Messenger of Allah, peace and blessings be upon him, said: \"Whoever is terrified of the night to endure it, or stingy with wealth to spend it, or cowardly of the enemy to fight him, let him increase in Subhan Allah wa Bi-Hamdihi; for it is more beloved to Allah than a mountain of gold spent in the path of Allah Almighty\" (3).\n7 - That it is a cause for forgiveness of sins and errors:\nAs in the Hadith of Abu Huraira, may Allah be pleased with him, that the Prophet, peace and blessings be upon him, said: \"And whoever says Subhan Allah wa Bi-Hamdihi in a day a hundred times, his sins are forgiven even if they were like the foam of the sea\" (4). And in a narration: \"Whoever says Subhan Allah wa Bi-Hamdihi, Allah removes his sins from him even if they were more than the foam of the sea\" (5).",
    "foot_note": "1. Al-Isra (44). \n2. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra (6/ 208) number (106608), and Al-Albani authenticated it in Sahih Al-Targhib number (1543). \n3. Narrated by Al-Tabarani (7/ 216), and Al-Albani authenticated it in Sahih Al-Targhib number (1541). \n4. Sunan Al-Tirmidhi (5/ 511), and Al-Albani authenticated it number (3466). \n5. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra (6/ 207), and Al-Albani authenticated it in Sahih Al-Targhib number (1542).",
    "book_id": "72",
    "new_page_number": 34
  },
  {
    "serial_number": "4962115",
    "category_id": "23",
    "category": "Heart Softeners, Etiquettes, and Remembrances",
    "book_title": "The Shining Stars regarding the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "8 - Doubling the reward for its sayer:\nThat was confirmed in the Hadith of Juwayriyah, may Allah be pleased with her, that the Prophet, peace and blessings be upon him, left from her presence then returned after the sun had risen high while she was sitting. He said: \"Are you still in the state I left you upon?\" She said: Yes. The Prophet, peace and blessings be upon him, said: \"I have said after you four words three times, if they were weighed against what you said since today they would outweigh them: Subhan Allah wa Bi-Hamdihi number of His creation, satisfaction of Himself, weight of His Throne, and ink of His words (1)\".\n9 - That it is the gatherer of Dhikr.\nDue to the Hadith of Abu Umama, may Allah be pleased with him, said: The Prophet, peace and blessings be upon him, saw me moving my lips, so he said to me: With what are you moving your lips, O Abu Umama? I said: I remember Allah, O Messenger of Allah? He said: \"Shall I not inform you of what is more and better than your remembrance by night and day?\" I said: Yes, O Messenger of Allah. He said: \"You say: Subhan Allah the number of what He created, Subhan Allah the fill of what He created, Subhan Allah the number of what is in the earth, Subhan Allah the number of what His Book enumerated, Subhan Allah the fill of what His Book enumerated, Subhan Allah the number of everything, Subhan Allah the fill of everything...\" (2).\nBranch Two: On the places of Tasbih:\nTasbih was reported in the purified Sunnah in several places, including:\n1 - At rejoicing for the victory of Religion:\nDue to what was confirmed from the Mother of Believers Aisha, may Allah be pleased with her, said: \"He used to increase in saying at the end of his affair: Subhan Allah wa Bi-Hamdihi, Astaghfirullah wa Atubu Ilayh. [Aisha said]: So I said: O Messenger of Allah, why do I see you increasing in saying Subhan Allah wa Bi-Hamdihi Astaghfirullah wa Atubu Ilayh. He said: My Lord informed me that I will see a sign in my Ummah, and commanded me - when I see that sign - to glorify His praise and ask His forgiveness, and I have seen it [When the victory of Allah has come and the conquest (1) And you see the people entering into the religion of Allah in multitudes (2) Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance (3)]\" (3).",
    "foot_note": "1. Narrated by Muslim (4/ 2090) number (2726). \n2. Sahih Ibn Hibban (3/ 111) number (830), and Ibn Khuzaymah (1/ 371) number (754) and Al-Albani authenticated it in Sahih Al-Targhib number (1575) and Al-Arna'ut classed it as Hasan in Sahih Ibn Hibban (3/ 111) number (830). \n3. Narrated by Muslim (2/ 50) number (1116).",
    "book_id": "72",
    "new_page_number": 35
  },
  {
    "serial_number": "4962116",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "2 - Upon concluding a gathering of idle talk: Several Hadiths have been reported regarding this, the most complete being the Hadith of Jubayr bin Mut'im from his father in marfu' form: \"Whoever says 'Subhanallahi wa bihamdihi, subhanaka Allahumma wa bihamdika ashhadu an la ilaha illa anta astaghfiruka wa atubu ilayka' (Glory be to Allah and His is the praise, Glory be to You O Allah and Your is the praise, I bear witness that there is no god but You, I seek Your forgiveness and repent to You); if he says it in a gathering of Dhikr (remembrance of Allah), it will be like a seal stamped upon it, and whoever says it in a gathering of idle talk, it will be an expiation for him\" (1). Also among what has been reported upon concluding a gathering:\n- The Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Whoever sits in a gathering and indulges in much idle talk in it and says before he rises from that gathering of his: 'Subhanaka Allahumma wa bihamdika ashhadu an la ilaha illa anta astaghfiruka wa atubu ilayk' (Glory be to You O Allah and Your is the praise, I bear witness that there is no god but You, I seek Your forgiveness and repent to You), except that Allah forgives him for what occurred in that gathering of his\" (2).\n\n3 - Upon astonishment at something: Due to the Hadith of Dhakwan from a man from the Ansar who said: The Messenger of Allah (peace be upon him) visited a man who had a wound. The Messenger of Allah (peace be upon him) said: \"Call for him the physician of such and such tribe.\" He said: So they called him and he came and said: O Messenger of Allah, does medicine avail anything? He said: \"Subhanallah (Glory be to Allah), has Allah sent down any disease on earth except that He has made a cure for it\" (3).\n- And for the Hadith of Abu Hurairah (may Allah be pleased with him) who said: I saw the Messenger of Allah (peace be upon him) on one of the paths of Medina while I was Junub (in a state of major ritual impurity), so I slipped away and went and bathed then came back. He said: \"Where were you, O Abu Hurairah?\" He said: I said: I was Junub and I disliked sitting with you without purification. He said: \"Subhanallah (Glory be to Allah), indeed the believer does not become impure\" (4).\n\n4 - Before sunrise and before sunset:\n- As in the Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Whoever says in the morning and in the evening 'Subhanallahil-Azim wa bihamdihi' (Glory be to Allah the Great and His is the praise) one hundred times, no one will come on the Day of Resurrection with anything better than what he brought, except one who said the like of what he said or increased upon it\" (5).\n- And the Hadith of Amr bin Shu'aib from his father from his grandfather who said: The Messenger of Allah (peace be upon him) said: \"Whoever says: 'Subhanallah' (Glory be to Allah) one hundred times before sunrise and before sunset, it is better than one hundred camels...\" (6).",
    "foot_note": "1. Narrated by Al-Tabarani (2/139), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah under number (81).\n2. Al-Tirmidhi (5/371), Ahmad in Al-Musnad (16/261), and it is in Sahih Al-Kalim Al-Tayyib under number (178).\n3. Narrated by Ahmad (38/227), and Al-Albani authenticated it in Al-Sahih under number (517).\n4. Al-Bukhari (1/79) under number (283), Sahih Muslim with Nawawi's explanation (1/282) under number (371).\n5. Muslim (4/2071).\n6. Sunan Al-Nasa'i Al-Kubra (6/205) and Al-Albani graded it Hasan in Sahih Al-Targhib under number (658).",
    "book_id": "72",
    "new_page_number": 36
  },
  {
    "serial_number": "4962117",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "And due to what is established from Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Whoever says in the morning 'Subhanallahi wa bihamdihi' (Glory be to Allah and His is the praise) one hundred times and in the evening one hundred times, his sins will be forgiven even if they were more than the foam of the sea\" (1).\n\n5 - In bowing (Ruku') and prostration (Sujud): As in Sahih Muslim from the Hadith of the Mother of the Believers Aisha (may Allah be pleased with her) who said: \"The Messenger of Allah (peace be upon him) used to frequently say in his bowing and prostration: 'Subhanaka Allahumma Rabbana wa bihamdika Allahumma aghfir li' (Glory be to You O Allah our Lord and Your is the praise, O Allah forgive me), interpreting the Quran\" (2). The meaning as Al-Nawawi said: \"Meaning he does what he was commanded to do in it, i.e., from the saying of Allah Almighty {Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance}\" (3). As in the long Hadith of Hudhayfah describing the night prayer of the Prophet (peace be upon him), he said: \"Then he bowed saying: 'Subhana Rabbiyal-Azim' (Glory be to my Lord the Great) then he prostrated and said: 'Subhana Rabbiyal-A'la' (Glory be to my Lord the Most High)...\" (4). And it is authentically reported from the Prophet (peace be upon him): \"Subhana Rabbiyal-Azim wa bihamdihi\" (5). And it is also authentically reported from him: \"Subbuhun Quddusun Rabbul-Mala'ikati war-Ruh\" (Glorified, Holy, Lord of the Angels and the Spirit) (6). The Muhaddith Al-Albani - may Allah have mercy on him - has cited the evidences for these Adhkar in 'The Description of the Prophet's Prayer', so refer to it.\n\n6 - For one who notices something in his prayer: Due to what is in the Musnad from the Hadith of Al-Mughirah bin Shu'bah who said: The Messenger of Allah (peace be upon him) led us in the Zuhr or Asr prayer, so he stood up (after two rak'ahs instead of sitting) and we said: Subhanallah, and he gestured with his hand meaning stand up. So we stood up, and when he finished his prayer he prostrated two prostrations then said: \"If one of you remembers before he stands up fully straight, let him sit, and if he stands up fully straight, let him not sit\" (7). And due to what is in it also from the Hadith of Sahl from Sa'd from the Prophet (peace be upon him) who said: \"Whoever notices something in his prayer, let him say: Subhanallah; for clapping is for women and Tasbih is for men\" (8).",
    "foot_note": "1. Sahih Ibn Hibban (3/141) under number (859) and Al-Arna'ut authenticated it.\n2. Narrated by Muslim (1/350) under number (484).\n3. Sahih Muslim with Nawawi's explanation (1/350).\n4. Narrated by Al-Nasa'i (1/246), and Al-Hakim (1/321), and Al-Hakim authenticated it as did Al-Albani in Sifat Salat An-Nabi (2/650).\n5. Sifat Salat An-Nabi by Al-Albani (2/658).\n6. Sifat Salat An-Nabi by Al-Albani (2/659).\n7. Musnad Ahmad (30/161) under number (18222), Al-Arna'ut said: Authentic with its various chains.\n8. Musnad Imam Ahmad (37/461) under number (22801), Al-Arna'ut said: Its chain is authentic according to the conditions of the two Sheikhs (Bukhari and Muslim).",
    "book_id": "72",
    "new_page_number": 37
  },
  {
    "serial_number": "4962118",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "The Second Requirement: Clarifying the Virtue of Tahmid (Praising Allah)\nWe will talk, with the help of Allah Almighty, about Tahmid through the following two branches:\n\nBranch One: On the Virtue of Tahmid:\nHadiths have been reported regarding the virtue of Tahmid, some of which are absolute and some are restricted by a description or number. We will begin by mentioning what has been reported regarding absolute Tahmid followed by what is restricted, through the following:\n\nA) What has been reported regarding the virtue of absolute Tahmid:\n\n1 - That it is the best type of gratitude: As in the Hadith of Jabir (may Allah be pleased with him) who said: I heard the Messenger of Allah (peace be upon him) say: \"The best Dhikr is La ilaha illa Allah (There is no god but Allah) and the best gratitude is Alhamdu lillah (Praise be to Allah)\" (1).\n\n2 - Tahmid was the first thing Adam (peace be upon him) uttered after the soul was breathed into him: Due to what is established in the Hadith of Anas (may Allah be pleased with him) in marfu' form: \"When the soul was breathed into Adam, and the soul reached his head, he sneezed and said: Alhamdu lillahi Rabbil-Alamin (Praise be to Allah, Lord of the worlds). So He, Blessed and Exalted, said to him: Yarhamukallah (May Allah have mercy on you)\" (2).\n\n3 - That it is the best supplication (Du'a): As in the Hadith of Jabir bin Abdullah (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"The best Dhikr is La ilaha illa Allah, and the best Du'a is Alhamdu lillah\" (3).",
    "foot_note": "1. Al-Silsilah Al-Sahihah by Al-Albani (3/484) under number (1497).\n2. Narrated by Al-Hakim (4/292) and Al-Albani authenticated it in Al-Sahih (5/158) under number (2159).\n3. Narrated by Ibn Majah (2/1249) and Ibn Hibban, and Al-Arna'ut graded it Hasan in Sahih Ibn Hibban (3/126) under number (846).",
    "book_id": "72",
    "new_page_number": 38
  },
  {
    "serial_number": "4962119",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "4 - That it is the most beloved thing to Allah: As in the Hadith of Anas bin Malik (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"Deliberation is from Allah, and haste is from Satan. And no one accepts excuses more than Allah, and nothing is more beloved to Allah than praise (Al-Hamd)\" (1).\n\nB) What has been reported regarding the virtue of Tahmid restricted by a description or number:\n\n1 - That it is a cause for attaining Allah's mercy: This is established from the Hadith of Abu Sa'id in marfu' form: \"If the servant says 'Alhamdu lillah' often, Allah Almighty says: Write for My servant My mercy often\" (2).\n\n2 - That it fills the servant's scale on the Day of Resurrection: As in the Hadith of Abu Malik Al-Ash'ari (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"...and Alhamdu lillah fills the Scale...\" (3).\n\n3 - Greatness of the reward: Many Hadiths have been reported regarding the reward of Hamd which clarify the greatness of the reward for its sayer. These Hadiths are:\na) The Hadith of Mus'ab bin Sa'd from his father (may Allah be pleased with him), that a Bedouin said to the Prophet (peace be upon him): Teach me a supplication perhaps Allah will benefit me with it. \"He said: Say: Allahumma laka al-hamdu kulluhu wa ilayka yarji'u al-amru kulluhu (O Allah, to You belongs all praise and to You returns all matters)\" (4).",
    "foot_note": "1. Narrated by Abu Ya'la (7/247) and its men are men of Sahih, and Al-Albani graded it Hasan in Sahih Al-Targhib (2/242) under number (1572).\n2. Musannaf Ibn Abi Shaybah (6/56), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/115) under number (1578).\n3. Previously referenced.\n4. Narrated by Al-Bayhaqi (6/231) and Al-Albani graded it Hasan in Sahih Al-Targhib (2/114) number (1576).",
    "book_id": "72",
    "new_page_number": 39
  },
  {
    "serial_number": "4962120",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "b) The Hadith of Abu Umamah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Shall I not inform you of something, if you say it, then you strive night and day you will not reach it? I said: Yes. He said: Say: Alhamdu lillahi 'adada ma ahsa kitabuh, wal-hamdu lillahi 'adada ma fi kitabih, wal-hamdu lillahi 'adada ma ahsa khalquh, wal-hamdu lillahi mil'a ma fi khalqih, wal-hamdu lillahi mil'a samawatihi wa ardih, wal-hamdu lillahi 'adada kulli shay', wal-hamdu lillahi 'ala kulli shay'... (Praise be to Allah the number of what His Book has counted, and praise be to Allah the number of what is in His Book, and praise be to Allah the number of what His creation has counted, and praise be to Allah filling what is in His creation, and praise be to Allah filling His heavens and His earth, and praise be to Allah the number of everything, and praise be to Allah upon everything...)\" (1).\n- And in a narration: \"Shall I not guide you to what is more than your remembrance of Allah night and day? Say: 'Alhamdu lillahi 'adada ma khalaq, wal-hamdu lillahi mil'a ma khalaq, wal-hamdu lillahi 'adada ma fi as-samawati wa ma fi al-ard, wal-hamdu lillahi 'adada ma ahsa kitabuh, wal-hamdu lillahi 'ala ma ahsa kitabuh, wal-hamdu lillahi 'adada kulli shay', wal-hamdu lillahi mil'a kulli shay'... (Praise be to Allah the number of what He created, and praise be to Allah filling what He created, and praise be to Allah the number of what is in the heavens and what is in the earth, and praise be to Allah the number of what His Book has counted, and praise be to Allah upon what His Book has counted, and praise be to Allah the number of everything, and praise be to Allah filling everything...)\" (2).\nd) The Hadith of Umm Hani (may Allah be pleased with her) and in it that the Prophet (peace be upon him) said to her: \"...and praise Allah one hundred times; for it is equivalent for you to one hundred saddled and bridled horses that you carry [fighters] on in the way of Allah...\" (3).\n\nBranch Two: On the Places of Tahmid:\nMany Hadiths have been reported regarding Tahmid in several places, including:\n\n1 - When something pleasing appears: Due to what is in Al-Bukhari from the Hadith of Anas (may Allah be pleased with him) who said: \"A Jewish boy used to serve the Prophet (peace be upon him) and he fell ill, so the Prophet (peace be upon him) came to visit him. He sat by his head and said to him: Embrace Islam. He looked at his father who was with him, so he said to him: Obey Abu Al-Qasim (peace be upon him). So he embraced Islam. The Prophet (peace be upon him) went out saying: Praise be to Allah who saved him from the Fire\" (4).",
    "foot_note": "1. Narrated by Al-Tabarani (7/273) and Al-Albani authenticated it in Sahih Al-Targhib (2/246) under number (1575).\n2. Narrated by Al-Tabarani (7/341) and Al-Albani authenticated it in Sahih Al-Jami' (10/327) under number (4380).\n3. Hasan Hadith, previously referenced.\n4. Al-Bukhari (2/18) under number (1356).",
    "book_id": "72",
    "new_page_number": 40
  },
  {
    "serial_number": "4962121",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "2 - Upon sneezing: As in the Hadith of Abu Hurairah (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"If one of you sneezes, let him say 'Alhamdu lillah' (Praise be to Allah), and let his brother or companion say to him 'Yarhamukallah' (May Allah have mercy on you). If he says to him 'Yarhamukallah', let him say 'Yahdikumullahu wa yuslihu balakum' (May Allah guide you and set your affairs right)\" (1). And in a wording by Al-Tabarani: \"Yaghfirullahu lana wa lakum\" (May Allah forgive us and you) (2).\n\n3 - Upon waking up from sleep: Due to the Hadith of Hudhayfah (may Allah be pleased with him) who said: \"When the Prophet (peace be upon him) went to his bed at night, he would place his hand under his cheek and then say: 'Allahumma bismika amutu wa ahya' (O Allah, in Your name I die and live), and when he woke up he said: 'Alhamdu lillahilladhi ahyana ba'da ma amatana wa ilayhin-nashur' (Praise be to Allah who gave us life after He caused us to die and to Him is the resurrection)\" (3). And in a narration: \"If one of you wakes up, let him say: 'Alhamdu lillahilladhi 'afani fi jasadi wa radda 'alayya ruhi wa adhina li bidhikrih' (Praise be to Allah who healed me in my body, returned my soul to me, and permitted me to remember Him)\" (4).\n\n4 - When starting the prayer: Starting the prayer with Hamd has been established in several manners:\na) The first manner: From Anas that a man came and entered the row while out of breath, so he said: \"Alhamdu lillahi hamdan kathiran tayyiban mubarakan fih\" (Praise be to Allah, much good and blessed praise). When the Messenger of Allah (peace be upon him) finished his prayer, he said: \"Which of you is the speaker of the words?\" The people remained silent. He said: \"Which of you is the speaker of them? For he did not say anything wrong.\" A man said: I came and was out of breath so I said them. He said: \"I saw twelve angels rushing to see which of them would lift it\" (5). The meaning as Al-Nawawi said regarding \"hafazahun-nafas\" (out of breath): \"Meaning his breath pressed him due to his speed to catch the prayer. And 'fa-arramal-qawm' means they were silent\" (6).",
    "foot_note": "1. Al-Bukhari (8/61) under number (6244).\n2. Mu'jam Al-Tabarani and Al-Albani authenticated it in Sahih Al-Jami' under number (688).\n3. Al-Bukhari (8/15) under number (6314), Sahih Muslim with Nawawi's explanation (4/2083) under number (2711).\n4. Sahih Al-Kalim Al-Tayyib by Al-Albani (1/77) under number (34).\n5. Sahih Muslim with Nawawi's explanation (1/419) under number (600).\n6. Sahih Muslim with Nawawi's explanation (1/419).",
    "book_id": "72",
    "new_page_number": 41
  },
  {
    "serial_number": "4962122",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "The second manner: From Ibn Abbas (may Allah be pleased with them) who said: When the Prophet (peace be upon him) rose at night to perform Tahajjud he would say: \"Allahumma lakal-hamd, anta nurus-samawati wal-ardi wa man fihinn, wa lakal-hamd anta qayyimus-samawati wal-ardi wa man fihinn, wa lakal-hamd anta malikus-samawati wal-ardi wa man fihinn, wa lakal-hamd antal-haqq, wa wa'duka haqq, wa qawluka haqq, wa liqa'uka haqq, wal-jannatu haqq, wan-naru haqq, was-sa'atu haqq, wan-nabiyyuna haqq, wa Muhammadun haqq...\" (O Allah, to You belongs praise, You are the Light of the heavens and the earth and whoever is in them. And to You belongs praise, You are the Sustainer of the heavens and the earth and whoever is in them. And to You belongs praise, You are the King of the heavens and the earth and whoever is in them. And to You belongs praise, You are the Truth, Your promise is true, Your word is true, the meeting with You is true, Paradise is true, the Fire is true, the Hour is true, the Prophets are true, and Muhammad is true...) (1).\n\n5 - Upon starting recitation: Due to what is authentic from Anas (may Allah be pleased with him) \"that the Prophet (peace be upon him), Abu Bakr, and Umar (may Allah be pleased with them) used to start the prayer with Alhamdu lillahi Rabbil-Alamin\" (2).\n\n6 - Upon mounting a riding beast: Due to what is established from the Hadith of Ali bin Rabi'ah \"that he was riding behind Ali (may Allah be pleased with him). When he placed his foot in the stirrup he said: Bismillah. When he settled on the back of the beast he said: Alhamdu lillah (three times), Allahu Akbar (three times), Subhanalladhi sakhkhara lana hadha wa ma kunna lahu muqrinin (Glory be to Him who has subjected this to us, and we could not have otherwise subdued it). Then he said: La ilaha illa anta subhanaka inni qad zalamtu nafsi faghfir li dhunubi; innahu la yaghfirudh-dhunuba illa ant (There is no god but You, Glory be to You, I have wronged myself so forgive me my sins; for indeed no one forgives sins except You). Then he leaned to one side and laughed. I said: O Commander of the Faithful, what makes you laugh? He said: I was riding behind the Prophet (peace be upon him), and the Messenger of Allah (peace be upon him) did as I did, then I asked him as you asked me. The Messenger of Allah (peace be upon him) said: Indeed Allah wonders at the servant when he says: La ilaha illa anta inni qad zalamtu nafsi, faghfir li dhunubi innahu la yaghfirudh-dhunuba illa ant. He said: My servant knew that he has a Lord who forgives and punishes\" (3).",
    "foot_note": "1. Narrated by Al-Bukhari (2/61), and Muslim with Nawawi's explanation (1/532).\n2. Narrated by Al-Bukhari (8/189) under number (743).\n3. Narrated by Al-Hakim (2/108) and Al-Albani authenticated it in Al-Sahih (4/211) under number (1653).",
    "book_id": "72",
    "new_page_number": 42
  },
  {
    "serial_number": "4962123",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "7 - Upon astonishment at something: Due to what is established in Al-Bukhari from the Hadith of the Mother of the Believers Aisha (may Allah be pleased with her) who said: \"Praise be to Allah whose hearing encompasses all voices. Allah Almighty revealed to the Prophet (peace be upon him) [Certainly has Allah heard the speech of the one who argues with you concerning her husband]\" (1).\n\n8 - Upon sleeping and going to bed: Due to the Hadith of Anas (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) used to say when he went to his bed: \"Alhamdu lillahilladhi at'amana wa saqana wa kafana wa awana fakam mimman la kafiya lahu wa la mu'wi\" (Praise be to Allah who fed us, gave us drink, sufficed us and sheltered us, for how many are there who have no one to suffice them nor shelter them) (2). And in a narration: \"Whoever says when he goes to his bed 'Alhamdu lillahilladhi kafani wa awani, alhamdu lillahilladhi at'amani wa saqani, alhamdu lillahilladhi manna 'alayya wa afdal, inni as'aluka bi'izzatika an tunjiyani minan-nar' (Praise be to Allah who sufficed me and sheltered me, praise be to Allah who fed me and gave me drink, praise be to Allah who favored me and bestowed grace, I ask You by Your Might to save me from the Fire), he has indeed praised Allah with all the praises of all creation\" (3).\n\n9 - Upon starting a speech: This is established in the Hadith of Abdullah bin Masud (may Allah be pleased with him) who said: \"The Messenger of Allah (peace be upon him) taught us the Tashahhud in prayer, and the Tashahhud in need: Innal-hamda lillah [nahmaduhu] wa nasta'inuhu wa nastaghfiruhu wa na'udhu billahi min shururi anfusina wa sayyi'ati a'malina, man yahdihillahu fala mudilla lah, wa man yudlil fala hadiya lah... (Indeed, all praise is due to Allah, [we praise Him] and seek His help and forgiveness, and we seek refuge in Allah from the evils of our souls and our bad deeds. Whomever Allah guides, no one can misguide, and whomever He misguides, no one can guide...)\" (4).\n\n10 - When seeing what one loves or dislikes: Due to what is established from the Mother of the Believers Aisha (may Allah be pleased with her) who said: \"When the Prophet (peace be upon him) saw what he liked, he would say: 'Alhamdu lillahi alladhi bini'matihi tatimmus-salihat' (Praise be to Allah by Whose grace good deeds are completed). And when he saw what he disliked, he would say: 'Alhamdu lillahi 'ala kulli hal' (Praise be to Allah in every condition)\" (5).",
    "foot_note": "1. Sahih Al-Bukhari (9/143) under number (7385).\n2. Sahih Muslim with Nawawi's explanation (4/2085) under number (2715).\n3. Narrated by Al-Hakim (1/730), and Al-Albani authenticated it in Al-Silsilah Al-Sahihah (15/20) under number (3444).\n4. Al-Albani authenticated it in Sahih Al-Kalim Al-Tayyib (1/159) under number (206), Khutbat Al-Hajah by Al-Albani (8).\n5. Narrated by Ibn Majah (2/422) and Al-Hakim (1/677) and Al-Albani authenticated it in Al-Silsilah Al-Sahihah under number (265).",
    "book_id": "72",
    "new_page_number": 43
  },
  {
    "serial_number": "4962124",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "11 - When seeing an afflicted person: As in the Hadith of Ibn Umar: \"Whoever sees an afflicted person and says: 'Alhamdu lillahilladhi 'afani mimma ibtalaka bihi wa faddalani 'ala kathirin mimman khalaqa tafdila' (Praise be to Allah who has spared me from what He has afflicted you with and preferred me greatly over many of those whom He has created), that affliction will not befall him\" (1). And in a narration: \"That was the gratitude for that blessing\" (2).\n\n12 - When eating or drinking or clearing the table, it is recommended to praise Allah: As in the Hadith of Anas who said: The Messenger of Allah (peace be upon him) said: \"Indeed Allah is pleased with the servant who eats a meal and praises Him for it, or drinks a drink and praises Him for it\" (3). And due to what is established in the Hadith of Abu Ayyub Al-Ansari who said: \"The Messenger of Allah (peace be upon him) used to say when he ate or drank: 'Alhamdu lillahilladhi at'ama wa saqa wa sawwaghahu, wa ja'ala lahu makhraja' (Praise be to Allah who fed and gave drink and made it easy to swallow, and made a way out for it)\" (4). And in the Hadith of Abu Umamah (may Allah be pleased with him) that when the Prophet (peace be upon him) cleared his table he said: \"Alhamdu lillahi kathiran tayyiban mubarakan fihi ghayra makfiyyin wa la muwadda'in wa la mustaghnan 'anhu Rabbuna\" (Praise be to Allah, abundant, good, blessed praise. He is not insufficient, nor is He abandoned, nor is He dispensable, our Lord) (5). And due to what is in the Hadith of Mu'adh bin Anas (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Whoever eats food and says: 'Alhamdu lillahilladhi at'amani hadha wa razaqanihi min ghayri hawlin minni wa la quwwah' (Praise be to Allah who fed me this and provided me with it without any power or might from me), his past sins will be forgiven\" (6). And in the Hadith of Abu Umamah also, he said: When he cleared his table he would say: \"Alhamdu lillahi hamdan kathiran tayyiban mubarakan fih, alhamdu lillahilladhi kafana wa awana ghayra makfiyyin wa la makfurin wa la mustaghnan 'anhu Rabbuna\" (Praise be to Allah, abundant, good, blessed praise. Praise be to Allah who sufficed us and sheltered us, He is not insufficient, nor is He denied, nor is He dispensable, our Lord) (7).",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Awsat under number (5457) and Al-Albani authenticated it in Al-Silsilah Al-Sahihah under number (2737).\n2. Sahih Al-Jami' by Al-Albani (2/56) under number (556).\n3. Sahih Muslim with Nawawi's explanation (4/2095) under number (2734).\n4. Narrated by Abu Dawood (3/432), and Ibn Hibban in his Sahih (12/23) and Al-Albani authenticated it in Al-Sahih (5/93) under number (2061).\n5. Sahih Al-Bukhari (1/2813) under number (5458).\n6. Al-Albani graded it Hasan in Sahih Al-Kalim Al-Tayyib (1/151) under number (188).\n7. Narrated by Ahmad (29/613), Abu Dawood (38/43), and Al-Albani authenticated it in Sahih Al-Jami' under number (8862).",
    "book_id": "72",
    "new_page_number": 44
  },
  {
    "serial_number": "4962125",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "13 - Praising Allah upon birth: Due to the Hadith of Kathir bin Ubayd who said: \"When a child was born in their family - meaning her family - Aisha (may Allah be pleased with her) would not ask if it was a boy or a girl, she would say: Is it created soundly? If it was said: Yes, she would say: Alhamdu lillahi Rabbil-Alamin (Praise be to Allah, Lord of the worlds)\" (1).\n\n14 - Praise during supplication: As in the Hadith of Fadalah bin Ubayd (may Allah be pleased with him) who said: While the Messenger of Allah (peace be upon him) was sitting, a man entered and prayed and said: \"O Allah forgive me and have mercy on me.\" The Messenger of Allah (peace be upon him) said: \"You have been hasty, O worshiper! When you pray and sit, praise Allah as He deserves, and send blessings upon me, then call upon Him.\" He said: Then another man prayed after that, so he praised Allah and sent blessings upon the Prophet (peace be upon him). The Prophet (peace be upon him) said to him: \"O worshiper, supplicate and you will be answered\" (2).\n\n15 - Praising Allah upon the renewal of blessings: Due to the Hadith of Abu Umamah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Allah Almighty has not bestowed a blessing upon a servant and he praised Allah Almighty for it, except that that [praise] was better than that blessing...\" (3).",
    "foot_note": "1. Sahih Al-Adab Al-Mufrad with Al-Albani's checking (2/13) and he said: \"Good (Hasan) chain as a mawquf narration\".\n2. Al-Tirmidhi and the wording is his (5/516), Al-Albani authenticated it in Sahih Al-Targhib (2/281) under number (1643).\n3. Narrated by Al-Tabarani (7/214), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/243) under number (1573).",
    "book_id": "72",
    "new_page_number": 45
  },
  {
    "serial_number": "4962126",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Third Requirement: Clarifying the Virtue of the Statement of Tawhid\nThe discussion about the Statement of Tawhid will be through the following two branches:\n\nBranch One: On the Virtue of the Statement of Tawhid:\nThe Statement of Tawhid is: \"La ilaha illa Allah\" (There is no god but Allah). Many Hadiths have been reported regarding its virtues from the best of creation (peace be upon him), including:\n\n1 - That it is the greatest pillar of Islam: Due to the Hadith of Ibn Umar (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) said: \"Islam is built on five [pillars]: Testifying that there is no god but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving Zakat, Hajj, and fasting Ramadan\" (1).\n\n2 - The Protector and Preventer: As in the Hadith of Ibn Umar (may Allah be pleased with them) that the Messenger of Allah (peace be upon him) said: \"I have been commanded to fight the people until they testify that there is no god but Allah and that Muhammad is the Messenger of Allah, establish prayer, and give Zakat. If they do that, their blood and wealth are protected from me except by the right of Islam, and their reckoning is with Allah\" (2).\n\n3 - The Savior from the Fire: As established in the Hadith of Anas (may Allah be pleased with him), from the Prophet (peace be upon him) who said: \"He will come out of the Fire who said: La ilaha illa Allah and in his heart is the weight of a barley grain of good. And he will come out of the Fire who said: La ilaha illa Allah and in his heart is the weight of a wheat grain of good. And he will come out of the Fire who said: La ilaha illa Allah and in his heart is the weight of an atom of good\" (3).",
    "foot_note": "1. Sahih Al-Bukhari (1/9) under number (8), Sahih Muslim with Nawawi's explanation (1/45) under number (16).\n2. Sahih Al-Bukhari (1/13) under number (25), Sahih Muslim with Nawawi's explanation (1/53) under number (22).\n3. Sahih Al-Bukhari (1/17) under number (44), Sahih Muslim with Nawawi's explanation (1/180) under number (325).",
    "book_id": "72",
    "new_page_number": 46
  },
  {
    "serial_number": "4962127",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "4 - The Key to Entering Islam: Due to what is in the Hadith of Ibn Abbas (may Allah be pleased with them) who said: When the delegation of Abdul Qays came to the Prophet (peace be upon him), he said to them: \"Do you know what faith in Allah alone is? They said: Allah and His Messenger know best. He said: Testifying that there is no god but Allah and that Muhammad is the Messenger of Allah, establishing prayer, giving Zakat, fasting Ramadan...\" (1).\n- And in the Hadith of Mu'adh when the Messenger of Allah (peace be upon him) sent him to Yemen, he said: \"When you come to them, invite them to testify that there is no god but Allah and that Muhammad is the Messenger of Allah...\" (2).\n\n5 - Whoever says it will be the happiest of people with the intercession of the Prophet (peace be upon him): Due to the Hadith of Abu Hurairah (may Allah be pleased with him) that he said: It was said, O Messenger of Allah, who will be the happiest of people with your intercession on the Day of Resurrection? The Messenger of Allah (peace be upon him) said: \"I thought, O Abu Hurairah, that no one would ask me about this Hadith before you because of what I saw of your eagerness for Hadith. The happiest of people with my intercession on the Day of Resurrection is the one who says: La ilaha illa Allah purely from his heart...\" (3).\n\n6 - It inherits Paradise and forbids entry into Hellfire: As in the Hadith of Anas (may Allah be pleased with him) that the Prophet (peace be upon him) had Mu'adh riding behind him on the saddle. He said: O Mu'adh bin Jabal. He said: At your service, O Messenger of Allah, and at your pleasure. He said: O Mu'adh. He said: At your service, O Messenger of Allah, and at your pleasure (three times). He said: \"There is no one who testifies that there is no god but Allah and that Muhammad is the Messenger of Allah truthfully from his heart except that Allah prohibits him from the Fire. He said: O Messenger of Allah, shall I not inform the people so they rejoice? He said: Then they would rely on it. And Mu'adh informed of it at his death to avoid sin\" (4).\n- And in the Hadith of Itban bin Malik (may Allah be pleased with him), the Prophet (peace be upon him) said: \"...For Allah has forbidden from the Fire the one who says La ilaha illa Allah seeking thereby the Face of Allah\" (5).",
    "foot_note": "1. Sahih Al-Bukhari (1/21) under number (53).\n2. Sahih Al-Bukhari (5/158) under number (1496).\n3. Sahih Al-Bukhari (1/36) under number (99).\n4. Sahih Al-Bukhari (1/44) under number (128), Sahih Muslim with Nawawi's explanation (1/61) under number (32).\n5. Sahih Al-Bukhari (1/116) under number (425).",
    "book_id": "72",
    "new_page_number": 47
  },
  {
    "serial_number": "4962128",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "- And he (peace be upon him) said: \"Rejoice and give glad tidings to the people that whoever says La ilaha illa Allah truthfully with it enters Paradise\" (1).\n- And in the Hadith of Ubadah bin As-Samit (may Allah be pleased with him), from the Prophet (peace be upon him): \"He said: Whoever testifies that there is no god but Allah alone with no partner and that Muhammad is His servant and Messenger, and that Jesus is the servant of Allah and His messenger and His word which He bestowed on Mary and a spirit from Him, and that Paradise is true and Hell is true, Allah will admit him into Paradise according to what he has done of deeds\" (2).\n\n7 - The doors of heaven are opened for it until it reaches the Throne: Due to the Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"No servant has ever said La ilaha illa Allah sincerely except that the doors of heaven are opened for it until it reaches the Throne, as long as he avoids major sins\" (3).\n\n8 - That it is the best Dhikr: As in the Hadith of Jabir (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"The best Dhikr is La ilaha illa Allah and the best Du'a is Alhamdu lillah\" (4).\n\n9 - The Beneficial Gatherer: Due to what is established in the Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Whoever says La ilaha illa Allah, it will benefit him one day of his time, afflicted before that by whatever afflicts him\" (5).\n\n10 - The Erasing Good Deed: As in the Hadith of Abdullah bin Masud (may Allah be pleased with him): \"Whoever comes with the good deed\" he said: Whoever comes with La ilaha illa Allah, \"and whoever comes with the evil deed\" he said: Whoever comes with Shirk (6).",
    "foot_note": "1. Narrated by Ahmad, Al-Silsilah Al-Sahihah (388) under number (1314).\n2. Sahih Al-Bukhari (4/201) under number (3435), and the wording is Al-Bukhari's, Sahih Muslim with Nawawi's explanation (1/57) under number (28).\n3. Narrated by Al-Tirmidhi (5/575), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/220) under number (1524).\n4. Narrated by Ibn Majah (2/1249), and Al-Nasa'i (6/208), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/221) under number (1526).\n5. Narrated by Al-Bazzar (15/66), and Al-Tabarani (4/12), and Al-Albani authenticated it in Sahih Al-Targhib (2/221) under number (1525).\n6. Narrated by Al-Hakim (2/406), and Al-Albani authenticated it as mawquf (2/221) under number (1527).",
    "book_id": "72",
    "new_page_number": 48
  },
  {
    "serial_number": "4962129",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "- And in the Hadith of Umm Hani, he (peace be upon him) said: \"And say La ilaha illa Allah one hundred times, it leaves no sin and no deed surpasses it\" (1).\n\n11 - Outweighing the Heavens and the Earth: This is established from the Hadith of Abdullah bin Umar who said: The Messenger of Allah (peace be upon him) said: \"Shall I not tell you of Noah's advice to his son? They said: Yes. He said: Noah advised his son and said to his son: O my son, I advise you with two things and forbid you from two things. I advise you with the statement: La ilaha illa Allah; for if it were placed in one scale pan, and the heavens and the earth were placed in a scale pan, it would outweigh them. And if they were a ring, it would break them until it reached Allah...\" (2).\n- And from the Hadith of Abdullah bin Amr bin Al-Aas (may Allah be pleased with them) that the Messenger of Allah (peace be upon him) said: \"Indeed Allah will distinguish a man from my community before all of creation on the Day of Resurrection. Ninety-nine scrolls will be laid out for him, each scroll being as far as the eye can see, then He will say: 'Do you deny any of this? Have those who wrote it, My guardians, oppressed you?' He will say: 'No, my Lord.' He will say: 'Do you have an excuse?' He will say: 'No, my Lord.' Allah Almighty will say: 'Yes, you have a good deed with Us, for there is no oppression upon you today.' Then a card will be brought out containing: Ashhadu an la ilaha illa Allah, wa ashhadu anna Muhammadan abduhu wa rasulug. He will say: 'Bring your weight.' He will say: 'O Lord, what is this card compared to these scrolls?' It will be said: 'Indeed you will not be oppressed.' The scrolls will be put in one pan and the card in the other. The scrolls will be light, and the card will be heavy, for nothing is heavy with the Name of Allah\" (3).\n\n12 - Freer of Necks (Slaves): As in the Hadith of Abu Ayyub Al-Ansari (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"Whoever says La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir (There is no god but Allah alone with no partner, His is the dominion and His is the praise and He is over all things competent) ten times, it is as if he freed four souls from the children of Ishmael\" (4).",
    "foot_note": "1. Musnad Ahmad (6/425), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/233) under number (1553).\n2. Previously referenced.\n3. Narrated by Al-Tirmidhi (5/24), Ibn Majah (2/1437), and Al-Hakim authenticated it (1/6), and Al-Albani authenticated it in Sahih Al-Targhib (2/223, 224) under number (1533).\n4. Sahih Muslim with Nawawi's explanation (4/2071) under number (2693).",
    "book_id": "72",
    "new_page_number": 49
  },
  {
    "serial_number": "4962130",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "- And the Hadith of Abu Hurairah (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said: \"Whoever says La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir in a day one hundred times, it will be equivalent for him to freeing ten slaves, one hundred good deeds will be written for him, one hundred bad deeds will be erased from him, and it will be a protection for him from Satan on that day of his until evening. And no one brings anything better than what he brought except one who did more than that\" (1).\n\n13 - The best of what the Prophets said: This is established from the Hadith of Amr bin Shu'aib from his father from his grandfather; that the Prophet (peace be upon him) said: \"The best supplication is the supplication on the Day of Arafah, and the best of what I and the prophets before me have said is: La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir\" (2).\n\n14 - Filling what is between heaven and earth: This is authentic in the Hadith of Umm Hani (may Allah be pleased with her), the Prophet (peace be upon him) said: \"...and say La ilaha illa Allah one hundred times - Ibn Khalaf said: I think he said: it fills what is between heaven and earth\" (3).\n\n15 - Great reward: For the Hadith of Abdullah bin Amr (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) said: \"Whoever says La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir two hundred times in a day, no one before him will surpass him, and no one after him will reach him except one who did better than his deed\" (4).\n\n16 - The best and highest branch of Faith: This is established in the Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Faith has sixty-odd branches, the best of them is the saying La ilaha illa Allah, and the lowest of them is removing a harmful object from the road, and modesty is a branch of faith\" (5).",
    "foot_note": "1. Narrated by Al-Bukhari (8/106) under number (6404), and Muslim (4/2071) under number (2691).\n2. Narrated by Al-Tirmidhi (5/572), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/226) under number (1536).\n3. Previously referenced.\n4. Narrated by Ahmad (11/353), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/254) under number (1591), and Al-Arna'ut graded it Hasan in Al-Musnad (11/353).\n5. Sahih Muslim with Nawawi's explanation (1/63) under number (35).",
    "book_id": "72",
    "new_page_number": 50
  },
  {
    "serial_number": "4962131",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "Branch Two: On the Places where the Statement of Tawhid is Said:\nThere are many places where the Statement of Tawhid is said, as established in the purified Sunnah. Among these places:\n\n1 - Following the obligatory prayers:\n- The Prophet (peace be upon him) used to say following every obligatory prayer: \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir, Allahumma la mani'a lima a'tayt wa la mu'tiya lima mana't wa la yanfa'u dhal-jaddi minkal-jadd\" (There is no god but Allah alone with no partner, His is the dominion and His is the praise and He is over all things competent. O Allah, there is no preventer of what You have given, and no giver of what You have prevented, and richness does not benefit the rich against You) (1). And in a narration: He used to say following every obligatory prayer and when he said Salam: \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd yuhyi wa yumit wa huwa hayyun la yamut biyadihil-khayr wa huwa 'ala kulli shay'in qadir - three times - Allahumma la mani'a lima a'tayt wa la mu'tiya lima mana't wa la yanfa'u dhal-jaddi minkal-jadd\".\n- And in the Hadith of Abdullah bin Al-Zubayr (may Allah be pleased with them); that he used to say following every prayer when he said Salam: \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir, la hawla wa la quwwata illa billah, la ilaha illa Allah, wa la na'budu illa iyyah, lahun-ni'matu wa lahul-fadlu wa lahuth-thana'ul-hasan, la ilaha illa Allah mukhlisina lahud-dina wa law karihal-kafirun\" (2).\n- And in the Hadith of Abu Hurairah (may Allah be pleased with him) from the Messenger of Allah (peace be upon him) who said: \"Whoever glorifies Allah following every prayer thirty-three times, and praises Allah thirty-three times, and magnifies Allah thirty-three times, and says to complete the hundred: La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir, his sins will be forgiven even if they were like the foam of the sea\" (3).\n- And in the Hadith of Abu Hurairah (may Allah be pleased with him) in marfu' form, he said: \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir, after he prays Fajr ten times, Allah Almighty will write for him",
    "foot_note": "1. Sahih Al-Bukhari (1/214) under number (844), and Sahih Muslim with Nawawi's explanation (1/414) under number (593).\n2. Sahih Muslim with Nawawi's explanation (1/415) under number (594).\n3. Sahih Muslim with Nawawi's explanation (1/418) under number (597).",
    "book_id": "72",
    "new_page_number": 51
  },
  {
    "serial_number": "4962132",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "ten good deeds, erase from him ten bad deeds, raise him ten degrees, and they will be equivalent for him to freeing two slaves from the children of Ishmael. If he says them in the evening, he will have the like of that, and they will be a shield for him from Satan until morning\" (1).\n\n2 - Upon hearing the Adhan: As in the Hadith of Sa'd bin Abi Waqqas (may Allah be pleased with him), from the Messenger of Allah (peace be upon him); that he said: \"Whoever says upon hearing the Mu'adhin: 'Ashhadu an la ilaha illa Allah wahdahu la sharika lah; wa anna Muhammadan abduhu wa rasuluh, raditu billahi rabban wa bi Muhammadin rasulan wa bil-islami dinan' (I bear witness that there is no god but Allah alone with no partner; and that Muhammad is His servant and Messenger, I am pleased with Allah as Lord, and with Muhammad as Messenger, and with Islam as religion), his sin will be forgiven\" (2).\n\n3 - After the Tashahhud: It is authentic that the Prophet (peace be upon him) heard a man saying in his Tashahhud: \"Allahumma inni as'aluka bi-anna lakal-hamd, la ilaha illa ant, wahdaka la sharika lak, al-mannan ya badi'as-samawati wal-ard, ya dhal-jalali wal-ikram, ya hayyu ya qayyum; inni as'alukal-jannata wa a'udhu bika minan-nar\" (O Allah, I ask You by virtue of the fact that praise is due to You, there is no god but You, alone with no partner, the Bestower, O Originator of the heavens and the earth, O Possessor of Majesty and Honor, O Ever-Living, O Sustainer; I ask You for Paradise and seek refuge in You from the Fire). The Prophet (peace be upon him) said: \"Do you know what he has supplicated Allah with?\" They said: Allah and His Messenger know best. He said: \"By the One in Whose Hand is my soul, he has supplicated Allah by His Greatest Name, which if He is called by it, He answers, and if He is asked by it, He gives\" (3).\n\n4 - In Istisqa' (Prayer for Rain): As in the Hadith of Aisha (may Allah be pleased with her) who said: The people complained to the Messenger of Allah (peace be upon him) about the lack of rain, so he ordered a pulpit and it was placed for him in the prayer place, and he promised the people a day they should go out. The Messenger of Allah (peace be upon him) went out when the rim of the sun appeared, sat on the pulpit, magnified Allah and praised Allah Almighty. Among what he said in his sermon was: \"La ilaha illa Allah yaf'alu ma yurid, Allahumma anta Allahu la ilaha illa ant, antal-ghaniyyu wa nahnul-fuqara'u anzil 'alaynal-ghaytha, waj'al ma anzalta lana quwwatan wa balaghan ila hin...\" (There is no god but Allah, He does what He wills. O Allah, You are Allah, there is no god but You, You are the Rich and we are the poor, send down rain upon us, and make what You send down strength and sufficiency for us for a time...) (4).\n\n5 - Upon entering the market: As established in the Hadith of Umar bin Al-Khattab (may Allah be pleased with him); that the Messenger of Allah (peace be upon him) said: \"Whoever enters the market and says: La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd,",
    "foot_note": "1. Narrated by Al-Hasan bin Arafa in his Juz' (1/5) and Al-Albani authenticated it in Al-Silsilah Al-Sahihah (1/112) under number (113).\n2. Sahih Muslim with Nawawi's explanation (1/290) under number (386).\n3. Narrated by Ahmad (21/192) under number (13570), and Al-Albani authenticated it in Al-Sahihah under number (3411).\n4. Narrated by Abu Dawood (1/455), and Al-Albani graded it Hasan in Sahih Sunan Abu Dawood (4/336) under number (1064).",
    "book_id": "72",
    "new_page_number": 52
  },
  {
    "serial_number": "4962133",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "yuhyi wa yumit wa huwa hayyun la yamut biyadihil-khayr wa huwa 'ala kulli shay'in qadir (He gives life and causes death, and He is Living and does not die, in His Hand is good and He is over all things competent), Allah will write for him a million good deeds, erase from him a million bad deeds, and raise him a million degrees\" (1).\n\n6 - After Wudu (ablution): As in the Hadith of Umar bin Al-Khattab (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"No one among you performs Wudu and perfects Wudu then says: Ashhadu an la ilaha illa Allah wahdahu la sharika lah, wa ashhadu anna Muhammadan abduhu wa rasuluh (I bear witness that there is no god but Allah alone with no partner, and I bear witness that Muhammad is His servant and Messenger); except that the eight gates of Paradise are opened for him to enter from whichever he wills\" (2).\n\n7 - Whoever wakes up at night: As in the Hadith of Ubadah bin As-Samit from the Prophet (peace be upon him) who said: \"Whoever wakes up at night and says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir, alhamdu lillah wa subhanallah wa la ilaha illa Allah wallahu akbar wa la hawla wa la quwwata illa billah', then says: 'Allahumma aghfir li' (O Allah forgive me), or supplicates, he will be answered; if he performs Wudu and prays, his prayer will be accepted\" (3).\n\n8 - Upon returning from Hajj, Umrah, or invasion: Ibn Umar (may Allah be pleased with them) narrated that the Messenger of Allah (peace be upon him) used to say, when returning from an invasion, Hajj, or Umrah, on every high ground of the earth, three Takbirs, then say: \"La ilaha illa Allah\" (4). And in a narration: \"La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir...\" (5).",
    "foot_note": "1. Narrated by Al-Tirmidhi (5/491), and Al-Hakim (1/721), and Al-Albani graded it Hasan in Sahih Sunan Ibn Majah under number (2235).\n2. Sahih Muslim with Nawawi's explanation (1/209) under number (234).\n3. Sahih Al-Bukhari (2/68) under number (1154).\n4. Sahih Al-Bukhari (2/8) under number (1797).\n5. Sahih Al-Bukhari (4/69) under number (2995), Sahih Muslim with Nawawi's explanation (2/980) under number (13444).",
    "book_id": "72",
    "new_page_number": 53
  },
  {
    "serial_number": "4962134",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "9 - During panic: This is established in the Hadith of Zainab bint Jahsh (may Allah be pleased with her), that the Prophet (peace be upon him) entered upon her in a state of panic saying: \"La ilaha illa Allah, woe to the Arabs from an evil that has approached. Today a hole has been opened in the barrier of Gog and Magog like this,\" and he made a circle with his thumb and the finger next to it. Zainab bint Jahsh said: I said: O Messenger of Allah, will we be destroyed while the righteous are among us? He said: \"Yes, when wickedness prevails\" (1).\n\n10 - In Supplication: Due to the Hadith of Abu Hurairah (may Allah be pleased with him); that the Messenger of Allah (peace be upon him) used to say: \"La ilaha illa Allah wahdahu a'azza jundahu wa nasara 'abdahu wa ghalabal-ahzaba wahdahu, fala shay'a ba'dah\" (There is no god but Allah alone, He honored His army, helped His servant, and defeated the confederates alone, so there is nothing after Him) (2).\n\n11 - On the Day of Arafah: Due to what is established in the Hadith of Amr bin Shu'aib from his father from his grandfather, that the Prophet (peace be upon him) said: \"The best supplication is the supplication on the Day of Arafah, and the best of what I and the prophets before me have said is: La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir\" (3).\n\n12 - In the Morning and Evening Adhkar: As established in the Hadith of Abu Hurairah (may Allah be pleased with him); that the Messenger of Allah (peace be upon him) said: \"Whoever says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk, wa lahul-hamd wa huwa 'ala kulli shay'in qadir' in a day one hundred times, it will be equivalent for him to freeing ten slaves, one hundred good deeds will be written for him, one hundred bad deeds will be erased from him, and it will be a protection for him from Satan on that day of his until evening. And no one brings anything better than what he brought except one who did more than that\" (4).\n- And the Hadith of Abdullah bin Amr (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) said: \"Whoever says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala...",
    "foot_note": "1. Sahih Al-Bukhari (4/186) under number (3346), Sahih Muslim with Nawawi's explanation (4/2207) under number (2880).\n2. Sahih Al-Bukhari (5/142) under number (4114).\n3. Previously referenced.\n4. Previously referenced.",
    "book_id": "72",
    "new_page_number": 54
  },
  {
    "serial_number": "4962135",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "...kulli shay'in qadir' two hundred times in a day, no one before him will surpass him, and no one after him will reach him except one who did better than his deed\" (1).\n- And the Hadith of Abu Ayyub (may Allah be pleased with him); that the Messenger of Allah (peace be upon him) said: \"Whoever says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir' ten times, it is as if he freed four souls from the children of Ishmael\" (2).\n- And the Hadith of Al-Bara' bin Azib (may Allah be pleased with him); that the Messenger of Allah (peace be upon him) said: \"...And whoever says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir', it is like freeing a soul\" (3).\n- And the Hadith of Abdullah bin Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) used to say when evening came: \"Amsayna wa amsal-mulku lillah, wal-hamdu lillah, la ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd wa huwa 'ala kulli shay'in qadir...\" (We have reached the evening and the dominion belongs to Allah, and praise be to Allah, there is no god but Allah alone with no partner, His is the dominion and His is the praise and He is over all things competent...) (4).\n- And due to what is authentic from the Messenger of Allah (peace be upon him): \"Whoever says in the morning: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd yuhyi wa yumit wa huwa 'ala kulli shay'in qadir' ten times, Allah writes for him with each one he says ten good deeds, erases from him ten bad deeds, raises him by it ten degrees, they are for him like ten slaves, and they are for him a guard from the beginning of the day until its end, and no deed he does that day will overcome them; and if he says it in the evening it is the same\" (5).\n\n13 - During the agonies of death: Due to the Hadith of Aisha (may Allah be pleased with her) who said: \"Among Allah's favors upon me is that the Messenger of Allah (peace be upon him) died in my house, on my day, between my chest and neck; and that Allah united my saliva and his saliva at his death. Abd al-Rahman entered upon me with a Siwak in his hand and I was supporting the Messenger of Allah (peace be upon him). I saw him looking at it...",
    "foot_note": "1. Previously referenced.\n2. Previously referenced.\n3. Narrated by Ahmad, and Al-Albani authenticated it in Sahih Al-Targhib (2/225) under number (1535).\n4. Sahih Muslim with Nawawi's explanation (4/2088) under number (2723).\n5. Narrated by Ahmad (38/545), and Al-Tabarani in Al-Kabir (4/174), and it is in Al-Silsilah Al-Sahihah (1/113) under number (114).",
    "book_id": "72",
    "new_page_number": 55
  },
  {
    "serial_number": "4962136",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "...and I knew he loved the Siwak. I said: Shall I take it for you? He signaled with his head yes. So I took it and it was hard for him, so I said: Shall I soften it for you? He signaled with his head yes. So I softened it. There was a leather vessel - or a wooden vessel, Umar doubts - with water in front of him. He started dipping his hands into the water and wiping his face with them, saying: 'La ilaha illa Allah, indeed death has agonies'. Then he raised his hand and started saying: 'In the Highest Companionship' until he was taken and his hand leaned over\" (1).\n\n14 - State of Dying: As in the Hadith of Abu Sa'id Al-Khudri (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"Prompt your dying ones to say La ilaha illa Allah\" (2). And in a narration: \"He whose last words are La ilaha illa Allah enters Paradise\" (3). And in a narration: \"Increase in the testimony that there is no god but Allah, before a barrier is put between you and it, and prompt it to your dying ones\" (4).\n\n15 - During Distress: Due to what is established in the Hadith of Ibn Abbas (may Allah be pleased with them) that the Messenger of Allah (peace be upon him) used to say during distress: \"La ilaha illa Allahul-Azimul-Halim, la ilaha illa Allahu Rabbul-Arshil-Azim, la ilaha illa Allahu Rabbus-samawati wa Rabbul-ardi wa Rabbul-Arshil-Karim\" (There is no god but Allah, the Great, the Forbearing. There is no god but Allah, Lord of the Mighty Throne. There is no god but Allah, Lord of the heavens and Lord of the earth and Lord of the Noble Throne) (5).\n\n16 - Upon swearing by other than the religion of Islam: This is authentic from Abu Hurairah (may Allah be pleased with him), from the Prophet (peace be upon him) who said: \"Whoever swears and says in his oath 'By Al-Lat and Al-Uzza', let him say: 'La ilaha illa Allah'. And whoever says to his companion 'Come let me gamble with you', let him give charity\" (6).",
    "foot_note": "1. Sahih Al-Bukhari (6/15, 16) under number (4449).\n2. Sahih Muslim with Nawawi's explanation (2/631) under number (916).\n3. Narrated by Abu Dawood.\n4. Narrated by Abu Ya'la in his Musnad (4/1460) and it is in Al-Silsilah Al-Sahihah (1/466) under number (467).\n5. Sahih Al-Bukhari (8/93) under number (6346), Sahih Muslim with Nawawi's explanation (4/2092) under number (2730).\n6. Sahih Al-Bukhari (8/165) under number (6650), Sahih Muslim with Nawawi's explanation (3/1267) under number (1647).",
    "book_id": "72",
    "new_page_number": 56
  },
  {
    "serial_number": "4962137",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "The Fourth Requirement: Clarifying the Virtue of Takbir\nThe discussion about Takbir will be through the following two branches:\n\nBranch One: On the Virtue of Takbir:\nMany Hadiths have been reported regarding the virtue of Takbir. We mentioned some of them when discussing the virtue of the enduring good deeds generally. These are some virtues reported mentioning Takbir specifically.\n\n1 - The word of Fitrah (natural disposition): Due to the Hadith of Anas (may Allah be pleased with him) who said: \"The Prophet (peace be upon him) would not raid except at dawn prayer. If he heard Adhan he would hold back, otherwise he would raid. He listened one day and heard a man saying: Allahu Akbar, Allahu Akbar. He said: Upon the Fitrah...\" (1).\n\n2 - Great reward: As in the Hadith of Umm Hani (may Allah be pleased with her) who said: The Messenger of Allah (peace be upon him) said: \"...and say Allahu Akbar one hundred times; for it is equivalent for you to one hundred garlanded accepted camels...\" (2).\n\nBranch Two: On the Places where Takbir is Said\nThere are multiple places for Takbir established in the purified Prophetic Sunnah, including:\n\n1 - Upon starting prayer: As in the Hadith of Aisha (may Allah be pleased with her) who said: \"The Messenger of Allah (peace be upon him) used to start prayer with Takbir...\" (3). And the Hadith of Ali (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said: \"The key to prayer is purification, its prohibition (entering its sanctity) is the Takbir, and its permission (exiting it) is the Taslim\" (4).\n\n2 - Upon night prayer: Due to the Hadith of Hudhayfah bin Al-Yaman (may Allah be pleased with him): \"That he prayed with the Prophet (peace be upon him) [night prayer] and when he said Takbir, he said: Allahu Akbar [three times] Dhul-Malakuti wal-Jabaruti wal-Kibriya'i wal-Azamah (Possessor of Kingdom, Power, Greatness and Grandeur)...\" (5).\n- And the Hadith of Abu Sa'id Al-Khudri (may Allah be pleased with him) who said: When the Messenger of Allah (peace be upon him) rose at night he would say Takbir, then say: \"Subhanaka Allahumma wa bihamdika wa tabaraka ismuka wa ta'ala jadduka wa la ilaha ghayruk, then he says: La ilaha illa Allah; three times, then he says: Allahu Akbar kabira; three times A'udhu billahis-Sami'il-Alim minash-shaytanir-rajim min hamzihi wa nafkhihi wa nafthih...\" (6).",
    "foot_note": "1. Sahih Muslim with Nawawi's explanation (1/288) under number (382).\n2. Previously referenced.\n3. Narrated by Ahmad (40/32), Sunan Abu Dawood (1/285), and Al-Albani authenticated it in Sahih Sunan Abu Dawood under number (752).\n4. Sunan Abu Dawood (1/22), Sunan Al-Tirmidhi (1/54), and Al-Albani graded it Hasan in Sahih Sunan Abu Dawood under number (55).\n5. Sunan Al-Nasa'i (2/231), Sunan Abu Dawood (1/325) under number (874), and Al-Albani authenticated it in Sahih Sunan Abu Dawood under number (818).\n6. Narrated by Abu Dawood (1/281) under number (775), and Al-Albani authenticated it in Sahih Sunan Abu Dawood (3/361) under number (748).",
    "book_id": "72",
    "new_page_number": 57
  },
  {
    "serial_number": "4962138",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "3 - Upon rejoicing in victory: As in the Hadith of Anas bin Malik (may Allah be pleased with him): \"That the Messenger of Allah (peace be upon him) invaded Khaybar. We prayed the morning prayer there at dawn darkness. Then the Prophet (peace be upon him) mounted, and Abu Talha mounted and I was riding behind Abu Talha. The Messenger of Allah (peace be upon him) rode quickly in the lane of Khaybar and my knee was touching the thigh of the Messenger of Allah (peace be upon him). Then he uncovered the Izar from his thigh until I was looking at the whiteness of the thigh of the Prophet (peace be upon him). When he entered the town he said: Allahu Akbar, Khaybar is destroyed. Indeed, when we descend in the open space of a people, evil is the morning of those who were warned...\" (1).\n\n4 - If one fears a formidable ruler: This is established in the Hadith of Ibn Abbas (may Allah be pleased with them) who said: \"If you come to a formidable ruler, fearing that he might attack you, say: Allahu Akbar, Allah is mightier than all His creation, Allah is mightier than what I fear and guard against. I seek refuge in Allah, there is no god but Him, who holds the seven heavens lest they fall upon the earth except by His permission, from the evil of your servant so-and-so, and his soldiers, followers, and partisans from among Jinn and men. O Allah be my protector from their evil. Exalted is Your praise, and mighty is Your protection, and blessed is Your name, and there is no god other than You; three times\" (2).\nAnd it is established in the Hadith of Abdullah bin Masud (may Allah be pleased with him): If any of you has a leader whose arrogance or injustice he fears, let him say: \"Allahumma Rabbas-samawatis-sab'i wa Rabbal-arshil-azim, kun li jaran min fulan bin fulan wa ahzabihi min khala'iqika, an yafruta 'alayya ahadun minhum, aw yatgha, 'azza jaruka wa jalla thana'uka, wa la ilaha illa ant\" (O Allah, Lord of the seven heavens and Lord of the Mighty Throne, be a protector for me from so-and-so son of so-and-so and his parties from Your creation, lest any of them exceeds bounds against me or transgresses. Mighty is Your protection and exalted is Your praise, and there is no god but You) (3).",
    "foot_note": "1. Narrated by Al-Bukhari (1/104) under number (371), and Muslim with Nawawi's explanation (2/1042) under number (1365).\n2. Sahih Al-Adab Al-Mufrad (1/257) under number (264), and Al-Albani authenticated it as mawquf on Ibn Abbas (may Allah be pleased with them).\n3. Sahih Al-Adab Al-Mufrad (1/257) under number (264), and Al-Albani authenticated it as mawquf on Ibn Masud (may Allah be pleased with him).",
    "book_id": "72",
    "new_page_number": 58
  },
  {
    "serial_number": "4962139",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "5 - Upon martyrdom: Due to the Hadith of Anas (may Allah be pleased with him) who said: \"The Prophet (peace be upon him) sent some people from Banu Sulaym to Banu Amir, seventy in number. When they arrived, my maternal uncle said to them: I will go ahead of you, if they grant me safety until I convey to them from the Messenger of Allah (peace be upon him), otherwise you will be close to me. So he went ahead and they granted him safety. While he was speaking to them about the Prophet (peace be upon him), they signaled to a man among them who stabbed him and pierced him through. He said: Allahu Akbar, I have won, by the Lord of the Kaaba. Then they turned upon the rest of his companions and killed them...\" (1).\n\n6 - Upon ascending and looking down upon a place: It is authentic in the Hadith of Abu Musa Al-Ash'ari (may Allah be pleased with him) who said: \"When the Messenger of Allah (peace be upon him) invaded Khaybar, or he said when the Messenger of Allah (peace be upon him) headed out, the people looked down upon a valley and raised their voices with Takbir: Allahu Akbar Allahu Akbar, La ilaha illa Allah. The Messenger of Allah (peace be upon him) said: Be gentle with yourselves, for you are not calling upon one who is deaf or absent; indeed you are calling upon One who is Hearing, Near...\" (2).\n\n7 - Before sunrise and before sunset: As in the Hadith of Amr bin Shu'aib from his father from his grandfather who said: The Messenger of Allah (peace be upon him) said: \"...and whoever says Allahu Akbar one hundred times before sunrise and before sunset, it is better than freeing one hundred slaves...\" (3).\n\n8 - At Al-Safa: Due to the Hadith of Jabir (may Allah be pleased with him) who said: \"Then the Prophet (peace be upon him) went out to Al-Safa. When he came near Al-Safa he recited: [Indeed, as-Safa and al-Marwah are among the symbols of Allah. So whoever makes Hajj to the House or performs 'umrah - there is no blame upon him for walking between them...]. We begin with what Allah began with. So he began with Al-Safa and climbed upon it until he saw the House [Kaaba]. He faced the Qiblah, unified Allah, and magnified Him three times [Allahu Akbar, Allahu Akbar, Allahu Akbar]...\" (4).",
    "foot_note": "1. Sahih Al-Bukhari (4/22) under number (2801).\n2. Sahih Al-Bukhari (5/169, 170) under number (4205).\n3. Narrated by Al-Nasa'i in Al-Sunan Al-Kubra (6/205), and Al-Albani authenticated it in Sahih Al-Targhib under number (658).\n4. Hajjat An-Nabi by Al-Albani (1/118) under number (64).",
    "book_id": "72",
    "new_page_number": 59
  },
  {
    "serial_number": "4962140",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "9 - In the two Eids and the days of Tashriq: Takbir is established in the two Eids, and it is prescribed by consensus of the scholars. Among what has been reported regarding it:\n- The Hadith of Ibn Abbas (may Allah be pleased with them) that he used to say Takbir: \"Allahu Akbar, Allahu Akbar, Allahu Akbar, La ilaha illa Allah, wallahu Akbar, Allahu Akbar, wa lillahil-hamd\" (1).\n- And the Hadith of Ibn Masud (may Allah be pleased with them) that he used to say Takbir during the days of Tashriq: \"Allahu Akbar, Allahu Akbar, La ilaha illa Allah, wallahu Akbar, Allahu Akbar, wa lillahil-hamd\" (2).\n\n10 - During Sa'y between Safa and Marwah: He (peace be upon him) used to say during Sa'y: \"Rabbi ighfir warham wa tajawaz 'amma ta'lam... Allahu Akbar (three times) wa lillahil-hamd, Allahu Akbar 'ala ma hadana, wal-hamdu lillahi 'ala ma awlana...\" (3).\n\n11 - Upon mounting the back of a riding beast or vehicle: Due to what was reported in the Hadith of Ali bin Rabi'ah that he was riding behind Ali (may Allah be pleased with him), so when he placed his saddle in the stirrup he said: \"Bismillah. When he settled on the back of the beast he said: Alhamdu lillah (three times) and Allahu Akbar (three times)...\" (4).\n\n12 - Upon receiving glad tidings of victory: As in the Hadith of Ibn Abbas (may Allah be pleased with them) who said: \"While the Prophet (peace be upon him) was in Medina, he suddenly said: Allahu Akbar, Allahu Akbar, the victory of Allah has come, and the opening has come, and the people of Yemen have come, a people with pure hearts and gentle obedience. Faith is Yemeni and Fiqh is Yemeni and Wisdom is Yemeni\" (5).",
    "foot_note": "1. Irwa' Al-Ghalil fi Takhrij Ahadith Manar Al-Sabil (125) under number (617, 618).\n2. Same previous reference.\n3. Hajjat An-Nabi by Al-Albani (1/118) under number (64).\n4. Previously referenced.\n5. Sahih Ibn Hibban (16/287) under number (7298) and Al-Arna'ut said: Hasan Hadith li ghayrihi (due to supporting evidence), its chain is weak.",
    "book_id": "72",
    "new_page_number": 60
  },
  {
    "serial_number": "4962141",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "13 - Upon sighting the crescent moon: This is established in the Hadith of Abdullah bin Umar (may Allah be pleased with them) who said: \"When the Messenger of Allah (peace be upon him) saw the crescent moon he would say: Allahu Akbar, Allahumma ahillahu 'alayna bil-amni wal-iman was-salamati wal-islam wat-tawfiqi lima tuhibbu wa tarda, Rabbuna wa Rabbukallah\" (Allah is the Greatest, O Allah bring it over us with security and faith, safety and Islam, and success for what You love and are pleased with, our Lord and your Lord is Allah) (1).\n\n14 - Upon seeing a sign: Due to the Hadith of Buraydah bin Al-Husayb (may Allah be pleased with him): That he was in Khurasan and visited a brother of his who was sick. He found him dying and saw sweat on his forehead. He said: Allahu Akbar, I heard the Messenger of Allah (peace be upon him) say: \"The believer dies with sweat on the brow\" (2).\n\n15 - Upon receiving glad tidings of a newborn: As in the Hadith of Anas bin Malik (may Allah be pleased with him) who said: \"Abu Talha married Umm Sulaym - and he mentioned the Hadith at length - and in it Abu Talha said: O Messenger of Allah, Umm Sulaym has given birth. He said: Allahu Akbar, what did she give birth to? I said: A boy. He said: Alhamdu lillah...\" (3).\n\n16 - Upon seeing what one loves: This is established in the Hadith of Uqbah bin Suwayd Al-Ansari; that he heard his father, who was one of the Companions of the Prophet (peace be upon him), say: \"We returned with the Prophet of Allah (peace be upon him) from the invasion of Khaybar. When Uhud appeared to him, the Prophet (peace be upon him) said: Allahu Akbar, a mountain that loves us and we love it\" (4).\n\n17 - Upon slaughtering: As in the Hadith of Anas bin Malik (may Allah be pleased with him) who said: The Prophet (peace be upon him) sacrificed two horned rams of white and black color, he slaughtered them with his hand, mentioned Allah's name, said Takbir, and placed his foot on their sides\" (5).",
    "foot_note": "1. Al-Kalim Al-Tayyib by Ibn Taymiyyah (1/138) under number (162), Al-Albani authenticated it with its supporting evidences in his checking of Al-Kalim Al-Tayyib.\n2. Ahkam Al-Jana'iz by Al-Albani (1/35).\n3. Musnad Ahmad (20/229) under number (12865), and Al-Arna'ut authenticated it (5/230).\n4. Musnad Ahmad (24/427) under number (15659), and Al-Arna'ut authenticated it (24/427).\n5. Al-Bukhari with Al-Fath (10/39) under number (5565), Sahih Muslim with Nawawi's explanation under number (1966).",
    "book_id": "72",
    "new_page_number": 61
  },
  {
    "serial_number": "4962142",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "The Fifth Requirement: Clarifying the Virtue of Hawqala\nHawqala is: \"La hawla wa la quwwata illa billah\" (There is no change nor power except by Allah). We will talk about it through the following two branches:\n\nBranch One: On the Virtue of Hawqala:\nA number of Hadiths have been reported regarding the virtue of Hawqala from the Messenger of Allah (peace be upon him), including:\n\n1 - That it is a treasure from the treasures of Paradise:\n- As in the Hadith of Abu Musa Al-Ash'ari (may Allah be pleased with him) who said: \"The Prophet (peace be upon him) heard me while I was saying 'La hawla wa la quwwata illa billah'. He said: O Abdullah bin Qays, shall I not guide you to a word from the treasures of Paradise? I said: Yes, O Messenger of Allah. He said: La hawla wa la quwwata illa billah\" (1).\n- And in the Hadith of Abu Dharr (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said to me: \"Shall I not guide you to a treasure from the treasures of Paradise? I said: Yes, O Messenger of Allah. He said: La hawla wa la quwwata illa billah\" (2).\n- And the Hadith of Abu Hurairah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said to me: \"Increase in saying 'La hawla wa la quwwata illa billah'; for it is [a treasure] from the treasures of Paradise\" (3).",
    "foot_note": "1. Sahih Al-Bukhari (5/170) under number (4205).\n2. Sunan Ibn Majah (2/1256) under number (3825), and Al-Albani authenticated it in Sahih Al-Jami' under number (7820).\n3. Narrated by Al-Tirmidhi (5/580), and Al-Albani authenticated it in Sahih Al-Targhib (2/248) under number (1580).",
    "book_id": "72",
    "new_page_number": 62
  },
  {
    "serial_number": "4962143",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "2 - That it is a word from under the Throne: Due to the Hadith of Abu Hurairah (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: \"Shall I not teach you, or shall I not guide you to a word from under the Throne from the treasures of Paradise? You say: La hawla wa la quwwata illa billah, and Allah says: My servant has submitted and surrendered\" (1).\n\n3 - That it is a gate from the gates of Paradise: This was reported in the Hadith of Mu'adh bin Jabal (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: \"Shall I not guide you to a gate from the gates of Paradise? He said: And what is it? He said: La hawla wa la quwwata illa billah\" (2).\n- And in the Hadith of Qays bin Sa'd bin Ubadah that his father handed him over to the Prophet (peace be upon him) to serve him. He said: The Prophet of Allah (peace be upon him) came to me while I had prayed two rak'ahs, so he nudged me with his foot and said: \"Shall I not guide you to a gate from the gates of Paradise? I said: Yes. He said: La hawla wa la quwwata illa billah\" (3).\n\n4 - That it is the planting of Paradise: As in the Hadith of Abu Ayyub Al-Ansari (may Allah be pleased with him) \"that the Messenger of Allah (peace be upon him), on the night he was taken on the Night Journey, passed by Abraham (peace be upon him). He said: Who is with you O Gabriel? He said: This is Muhammad. Abraham (peace be upon him) said to him: O Muhammad, command your nation to increase in the planting of Paradise; for its soil is good and its land is vast. He said: What is the planting of Paradise? He said: La hawla wa la quwwata illa billah\" (4).",
    "foot_note": "1. Narrated by Al-Hakim (1/17), and Al-Albani authenticated it in Sahih Al-Targhib under number (1580) as well.\n2. Narrated by Ahmad (36/321), and Al-Albani authenticated it in Sahih Al-Targhib (2/249) under number (1581).\n3. Narrated by Al-Hakim and he authenticated it (4/323), Ahmad (24/228), and Al-Albani authenticated it in Sahih Al-Targhib (2/250) under number (1582).\n4. Narrated by Ahmad (38/533), and Ibn Hibban in his Sahih (3/103), and Al-Albani authenticated it in Al-Targhib (2/250) under number (1583).",
    "book_id": "72",
    "new_page_number": 63
  },
  {
    "serial_number": "4962144",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "And the Hadith of Ibn Umar (may Allah be pleased with them) who said: The Messenger of Allah (peace be upon him) said: \"Increase in the planting of Paradise; for its water is sweet and its soil is good, so increase in its planting. They said: O Messenger of Allah, what is its planting? He said: Ma sha'a Allah, la hawla wa la quwwata illa billah\" (1).\n\n5 - That it is one of the expiations for sins: Due to the Hadith of Abdullah bin Amr who said: The Messenger of Allah (peace be upon him) said: \"There is no one on earth who says 'La ilaha illa Allah, wallahu akbar, wa la hawla wa la quwwata illa billah' except that his sins are expiated from him, even if they were like the foam of the sea\" (2).\n\n6 - That it is one of the saviors from the Fire: This is established in the Hadith of Al-Agharr Abu Muslim who said: \"I testify about Abu Sa'id and Abu Hurairah that they testified about the Prophet (peace be upon him); that he said: Whoever says 'La ilaha illa Allah, wallahu akbar', his Lord affirms him and says: 'There is no god but Me and I am Greatest'. And when he says: 'La ilaha illa Allah wahdahu', He says: Allah says: 'There is no god but Me alone'. And when he says: 'La ilaha illa Allah wahdahu la sharika lah', Allah says: 'There is no god but Me alone, I have no partner'. And when he says: 'La ilaha illa Allah lahul-mulku wa lahul-hamd', Allah says: 'There is no god but Me, Mine is the dominion and Mine is the praise'. And when he says: 'La ilaha illa Allah wa la hawla wa la quwwata illa billah', He says: 'There is no god but Me and there is no change nor power except by Me'. And he used to say: Whoever says it in his illness then dies, the Fire will not taste him\" (3).",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Kabir (10/498), and Al-Albani graded it Hasan in Sahih Al-Targhib (2/250) under number (1584).\n2. Narrated by Al-Tirmidhi (5/509), and Al-Albani graded it Hasan in Al-Ta'liq Al-Raghib (2/249).\n3. Sunan Al-Tirmidhi (5/492), Ibn Majah (2/1246), and Al-Albani authenticated it in Sahih Ibn Majah under number (3794).",
    "book_id": "72",
    "new_page_number": 64
  },
  {
    "serial_number": "4962145",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "7 - That it is one of the causes of forgiveness of sins: As in the Hadith of Abu Hurairah who said: The Messenger of Allah (peace be upon him) said: \"Whoever says 'La ilaha illa Allah wallahu akbar, la ilaha illa Allah wahdahu, la ilaha illa Allah wa la sharika lah, la ilaha illa Allah lahul-mulku wa lahul-hamd, la ilaha illa Allah wa la hawla wa la quwwata illa billah', counting them five with his fingers, then said whoever says them in a day or a night or in a month, then dies in that day or in that night, or in that month, his sin will be forgiven\" (1).\n\nBranch Two: On the Places where Hawqala is Said:\nThe mention of Hawqala has been reported in several places derived from what is authentic from the Prophet (peace be upon him), including:\n\n1 - Following prayers: \"He (peace be upon him) used to say following the prayer when he said Salam before he stood up, raising his voice with it: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd, wa huwa 'ala kulli shay'in qadir, wa la hawla wa la quwwata illa billah, la ilaha illa Allah, wa la na'budu illa iyyah, lahun-ni'matu wa lahul-fadlu, wa lahuth-thana'ul-hasan, la ilaha illa Allah mukhlisina lahud-dina, wa law karihal-kafirun'\" (2).\n\n2 - Upon rising for night prayer: This is established in the Hadith of Ibn Abbas (may Allah be pleased with them) that the Messenger of Allah (peace be upon him) when he rose for prayer in the middle of the night would say: \"Allahumma lakal-hamd anta qayyimus-samawati wal-ardi wa man fihinn, wa lakal-hamd lakal-mulkus-samawati wal-ardi wa man fihinn, wa lakal-hamd anta nurus-samawati wal-ardi wa man fihinn, wa lakal-hamd anta malikus-samawati wal-ard, wa lakal-hamd antal-haqq, wa wa'duka haqq, wa liqa'uka haqq, wal-jannatu haqq, wan-naru haqq, wan-nabiyyuna haqq, wa Muhammadun sallallahu 'alayhi wa sallama haqq, was-sa'atu haqq, Allahumma laka aslamt, wa bika amant, wa 'alayka tawakkalt, wa ilayka anabt, wa bika khasamt, wa ilayka hakamta, faghfir li ma qaddamtu wa ma akhkhart, wa ma asrartu wa ma a'lant, wa ma anta a'lamu bihi minni, antal-muqaddimu wa antal-mu'akhkhir, anta ilahi, la ilaha illa anta wa la hawla wa la quwwata illa billah\" (3).",
    "foot_note": "1. Sunan Al-Nasa'i Al-Kubra (6/12), Al-Albani said in Sahih Al-Targhib it is authentic due to supporting evidence (Sahih li ghayrihi) under number (3481).\n2. Narrated by Al-Tabarani in Al-Kabir (18/392), and Al-Albani authenticated it in Al-Sahih (11/18) under number (3160).\n3. Sahih Al-Bukhari (2/61) under number (1120).",
    "book_id": "72",
    "new_page_number": 65
  },
  {
    "serial_number": "4962146",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "3 - Upon leaving the house: As in the Hadith of Anas (may Allah be pleased with him) that the Messenger of Allah (peace be upon him) said: \"If a man leaves his house and says: 'Bismillah tawakkaltu 'alallah, wa la hawla wa la quwwata illa billah' (In the name of Allah, I rely on Allah, and there is no change nor power except by Allah), it is said to him: You are sufficed, guided, and protected, and Satan moves away from him\" (1).\n\n4 - Whoever wakes up at night: As in the Hadith of Ubadah bin As-Samit (may Allah be pleased with him) from the Prophet (peace be upon him) who said: \"Whoever wakes up at night and says: 'La ilaha illa Allah wahdahu la sharika lah, lahul-mulk wa lahul-hamd, wa huwa 'ala kulli shay'in qadir, alhamdu lillah wa subhanallah wa la ilaha illa Allah wallahu akbar wa la hawla wa la quwwata illa billah', then says: 'Allahumma aghfir li' (O Allah forgive me), or supplicates, he will be answered; if he performs Wudu and prays, his prayer will be accepted\" (2).",
    "foot_note": "1. Narrated by Al-Tirmidhi and he graded it Hasan (5/490), and Al-Nasa'i in Al-Kubra (6/26), and Al-Albani authenticated it in Sahih Al-Targhib (2/121) under number (1605).\n2. Sahih Al-Bukhari (2/68) under number (1154).",
    "book_id": "72",
    "new_page_number": 66
  },
  {
    "serial_number": "4962147",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "Scientific References\n\nFirst: Books of Tafsir (Exegesis):\n1 - Jami' al-Bayan fi Ta'wil al-Quran: Author: Imam Ja'far al-Tabari - Investigated by Ahmad Shakir - Pub. Mu'assasat al-Risalah.\n2 - Al-Tahrir wa al-Tanwir: Author: Muhammad al-Tahir ibn Ashur - Pub. Al-Dar al-Tunisiyyah lil-Nashr - Tunis.\n3 - Al-Jami' li-Ahkam al-Quran al-Karim: Author: Imam al-Qurtubi - Investigated by: Ahmad al-Barduni and Ibrahim Atfayish - Dar al-Kutub al-Misriyyah - Cairo.\n4 - Ma'alim al-Tanzil fi Tafsir al-Quran: Author: Imam al-Baghawi - Investigated by: Abd al-Razzaq al-Mahdi - Dar Ihya' al-Turath al-Arabi - Beirut.\n5 - Tafsir al-Bahr al-Muhit - by Abu Hayyan al-Andalusi - Investigated by: Adil Ahmad Abd al-Mawjud and Ali Muhammad Mu'awwad - Dar al-Kutub al-Ilmiyyah.\n6 - Tafsir al-Quran al-Azim, by Abu al-Fida: Ismail bin Kathir - Investigated by: Sami bin Muhammad Salamah - Dar Taiba for Publishing and Distribution.\n7 - Al-Muharrar al-Wajiz fi Tafsir al-Kitab al-Aziz: Author: Abu Muhammad Abd al-Haqq bin Ghalib bin Atiyyah al-Andalusi - Dar al-Kutub al-Ilmiyyah - Lebanon.\n8 - Mahasin al-Ta'wil - by Muhammad Jamal al-Din al-Qasimi - Investigated by: Ahmad bin Ali and Hamdi Subh - Dar al-Hadith Cairo.\n9 - Irshad al-Aql al-Salim ila Mazaya al-Quran al-Karim, by Muhammad bin Muhammad al-Imadi Abu al-Su'ud - Dar Ihya' al-Turath al-Arabi - Beirut.\n10 - Al-Durr al-Manthur fi al-Tafsir bi-l-Ma'thur - by Imam: Jalal al-Din al-Suyuti - Dar al-Fikr - Beirut.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 67
  },
  {
    "serial_number": "4962148",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "11 - Juz' fi Tafsir al-Baqiyat al-Salihat, by Salah al-Din Khalil bin Kaykaldy bin Abdullah al-Ala'i - Investigated by: Badr al-Zaman Muhammad Shafi' al-Nibali - Dar al-Basha'ir al-Islamiyyah - Beirut.\n12 - Fath al-Qadir by Imam Muhammad bin Ali al-Shawkani - Dar Ibn Kathir - Damascus - Beirut.\n13 - Adwa' al-Bayan fi Idah al-Quran bil-Quran by Muhammad al-Amin al-Shanqiti - Dar al-Fikr.\n14 - Mawsu'at al-Sahih al-Masbur min al-Tafsir bil-Ma'thur: Author: Prof. Dr. Hikmat bin Bashir ibn Yasin - Dar al-Ma'athir for Publishing and Distribution - Medina.\n\nSecond: Dictionaries and Books of Gharib (Rare words):\n1 - Lisan al-Arab: by Ibn Manzur - Dar Sadir - Beirut.\n2 - Al-Qamus al-Muhit: by Al-Firuzabadi.\n3 - Al-Sihah by Al-Jawhari - Dar al-Malayin - Beirut.\n4 - Taj al-Arus min Jawahir al-Qamus: by Al-Murtada al-Zabidi - Dar al-Hidayah.\n5 - Mu'jam Maqayis al-Lughah: Abu al-Husayn Ahmad bin Faris bin Zakariya - Investigated by Abd al-Salam Muhammad Harun - Dar al-Fikr.\n6 - Al-Nihayah fi Gharib al-Athar: by Ibn al-Jawzi - Investigated by: Tahir Ahmad al-Zawi and Mahmud Muhammad al-Tanahi - Al-Maktabah al-Ilmiyyah - Beirut.\n7 - Al-Fa'iq fi Gharib al-Hadith: by Mahmud bin Umar al-Zamakhshari - Investigated by: Ali Muhammad al-Bajawi and Muhammad Abu al-Fadl Ibrahim - Dar al-Ma'rifah - Lebanon.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 68
  },
  {
    "serial_number": "4962149",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "Third: Books of Hadith:\n1 - Al-Jami' al-Sahih: by Imam al-Bukhari - Dar al-Sha'b - Cairo.\n2 - Sahih Muslim with Nawawi's explanation - Dar Ihya' al-Turath al-Arabi - Beirut.\n3 - Sunan Abi Dawood: by Abu Dawood Sulayman bin al-Ash'ath al-Sijistani - Dar al-Kitab al-Arabi - Beirut.\n4 - Sunan al-Tirmidhi: by Imam: Muhammad bin Isa al-Tirmidhi - Investigated by: Ahmad Muhammad Shakir - Dar Ihya' al-Turath al-Arabi - Beirut.\n5 - Sunan Ibn Majah - by Muhammad bin Yazid al-Qazwini - Investigated by: Muhammad Fuad Abd al-Baqi - Dar al-Fikr - Beirut.\n6 - Sunan al-Nasa'i al-Kubra: by Imam Abu Abd al-Rahman Ahmad bin Shu'ayb al-Nasa'i - Dar al-Kutub al-Ilmiyyah - Beirut.\n7 - Sunan al-Nasa'i al-Sughra: by Imam Ahmad bin Shu'ayb al-Nasa'i - Investigated by: Abd al-Fattah Abu Ghuddah - Maktab al-Matbu'at al-Islamiyyah - Aleppo.\n8 - Muwatta' Malik bin Anas: Investigated by: Muhammad Mustafa al-A'zami - Zayed bin Sultan Foundation.\n9 - Al-Mustadrak ala al-Sahihayn: by Abu Abdullah al-Hakim al-Naysaburi - Investigated by: Mustafa Abd al-Qadir Ata - Dar al-Kutub al-Ilmiyyah - Beirut.\n10 - Musnad Imam Ahmad bin Hanbal: Investigated by: Shu'ayb al-Arna'ut, Adil Murshid, supervised by Dr. Abdullah ibn Abd al-Muhsin al-Turki - Mu'assasat al-Risalah.\n11 - Sahih Ibn Hibban arranged by Ibn Balban: by Muhammad bin Hibban al-Sabti - Investigated by: Shu'ayb al-Arna'ut - Mu'assasat al-Risalah - Beirut.\n12 - Shu'ab al-Iman: by Abu Bakr Ahmad bin al-Husayn al-Bayhaqi - Investigated by: Muhammad al-Sa'id Basyuni Zaghlul - Dar al-Kutub al-Ilmiyyah - Beirut.\n13 - Mu'jam al-Tabarani al-Kabir.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 69
  },
  {
    "serial_number": "4962150",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "14 - Mu'jam al-Tabarani al-Awsat: Investigated by: Tariq bin Awad Allah and Abd al-Muhsin bin Ibrahim - Dar al-Haramayn - Cairo.\n15 - Mu'jam al-Tabarani al-Saghir: Investigated by: Muhammad Shakur Mahmud - Al-Maktab al-Islami - Beirut.\n16 - Mishkat al-Masabih: by Allamah: Wali Allah al-Tabrizi with its explanation Mir'at al-Mafatih, by Sheikh: Abu al-Hasan al-Mubarakpuri.\n17 - Musnad al-Bazzar: by Abu Bakr Ahmad bin Amr al-Bazzar - Investigated by: Mahfuz al-Rahman Zayn Allah - Maktabat al-Ulum wa al-Hikam - Medina.\n18 - Musnad Abu Ya'la - Dar al-Ma'mun lil-Turath - Damascus - Investigated by: Husayn Salim Asad.\n19 - Musannaf Ibn Abi Shaybah: Investigated by: Kamal Yusuf al-Hut - Maktabat al-Rushd - Riyadh.\n20 - Al-Adab al-Mufrad by Imam al-Bukhari - Investigated by: Muhammad Fuad Abd al-Baqi - Dar al-Basha'ir - Beirut.\n21 - Al-Taysir bi-Sharh al-Jami' al-Saghir: by Hafiz Zayn al-Din Abd al-Ra'uf al-Munawi - Maktabat al-Imam al-Shafi'i - Riyadh.\n22 - Tabaqat al-Shafi'iyyah al-Kubra: by Imam Taj al-Din al-Subki - Investigated by: Dr. Muhammad Muhammad al-Tanahi - Dr. Abd al-Fattah Muhammad al-Hilu - Hajar for Printing, Publishing and Distribution.\n23 - Al-Silsilah al-Sahihah by Al-Albani.\n24 - Sahih al-Targhib wa al-Tarhib by Al-Albani - Maktabat al-Ma'arif - Riyadh.\n25 - Sahih al-Jami' al-Saghir wa Ziyadatuhu by Al-Albani - Al-Maktab al-Islami - Beirut.\n26 - Mishkat al-Masabih by Al-Tabrizi: Investigated by: Al-Albani - Al-Maktab al-Islami - Beirut.\n27 - Ahkam al-Jana'iz by Al-Albani.\n28 - Mukhtasar al-Shama'il al-Muhammadiyyah by Al-Tirmidhi: Investigation and Abridgment: Al-Albani - Al-Maktabah al-Islamiyyah - Amman.\n29 - Sahih al-Adab al-Mufrad by Imam al-Bukhari: Investigated by: Al-Albani - Dar al-Siddiq.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 70
  },
  {
    "serial_number": "4962151",
    "category_id": "23",
    "category": "Raqa'iq, Adab, and Adhkar (Heart Softeners, Etiquette, and Remembrances)",
    "book_title": "The Shining Stars in the Virtues of the Enduring Good Deeds",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "30 - Sahih al-Kalim al-Tayyib by Al-Albani - Al-Maktab al-Islami - Beirut.\n31 - Sifat Hajj al-Nabi (peace be upon him) by Al-Albani - Al-Maktab al-Islami - Beirut.\n32 - Sifat Salat al-Nabi (peace be upon him) by Al-Albani - Maktabat al-Ma'arif - Riyadh.\n33 - Al-Sunnah by Ibn Abi Asim: Investigated by: Al-Albani - Al-Maktab al-Islami - Beirut.\n34 - Khutbat al-Hajah: by Al-Albani: Al-Maktab al-Islami - Beirut.\n35 - Sahih Sunan Abi Dawood: by Al-Albani.\n36 - Sahih Sunan al-Tirmidhi: by Al-Albani.\n37 - Sahih Sunan al-Nasa'i: by Al-Albani.\n38 - Sahih Sunan Ibn Majah: by Al-Albani.",
    "foot_note": "None",
    "book_id": "72",
    "new_page_number": 71
  }
]