[
  {
    "text": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه\nالمؤلف: عرام بن الأصبغ السلمى (عاش في القرن الثالث الهجري)\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 1
  },
  {
    "text": "sn: 6862\nbook_title: أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه [مطبوع ضمن كتاب «نوادر المخطوطات»]\nbook_link: https://shamela.ws/book/992\nbook_id: 992\nauthor_name: عرام بن الأصبغ السلمى (عاش في القرن الثالث الهجري)\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/1133\nauthor_ID: 1133\neditor: عبد السلام هارون (تحقيق)\npublisher: شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر\nedition: الثانية، 1393 هـ‍ - 1972 م\npages: 65\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: البلدان والرحلات\ncategory_id: 28",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "new_page_number": 2
  },
  {
    "serial_number": "6266294",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: البلدان والرحلات الكتاب : أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : عرام بن الأصبغ السلمى ( عاش في القرن الثالث الهجري ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالكتاب : أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه [ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : عرام بن الأصبغ السلمى ( عاش في القرن الثالث الهجري ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ مطبوع ضمن كتاب « نوادر المخطوطات »] المؤلف : عرام بن الأصبغ السلمى ( عاش في القرن الثالث الهجري ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالمؤلف : عرام بن الأصبغ السلمى ( عاش في القرن الثالث الهجري ) تحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتحقيق : عبد السلام هارون الناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالناشر : شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر الطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nالطبعة : الثانية ، 1393 هـ - 1972 م عدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nعدد الصفحات : 65 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 5 محرم 1444\nتاريخ النشر بالشاملة : 5 محرم 1444",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 3
  },
  {
    "serial_number": "6266295",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 373,
    "volume_number": 1,
    "text": "بسم اللّه الرّحمن الرّحيم  تقديم هذه هي المجموعة الثامنة من (نوادر المخطوطات)، وقد تضمنت كتاب عرام بن الأصبغ السلمى في (أسماء جبال تهامة وسكانها، وما فيها من القرى، وما ينبت عليها من الأشجار وما فيها من المياه)، كما تضمنت (الفهارس العامة) للمجلد الثاني من نوادر المخطوطات، طبقا للنظام الذي اتبع في المجلد الأول. وكنت قد وعدت بنشر هذا الكتاب في المجموعة الأولى من (نوادر المخطوطات) ولم تهيأ لي فرصة نشره إذ ذاك، واتفقت أحوال دعتني إلى إفراده بالنشر خارج نطاق نوادر المخطوطات، ثم رأيت أن أنجز الوعد الذي وعدت فأعيد نشره في نطاق النوادر نشرة أوفى وأضوأ من تلك النشرة الأولى. وتمتاز هذه النشرة الثانية بإضافة عدة تصحيحات وتعليقات وقعت إلينا بعد أداء النشرة الأولى، وكذلك بضع تصحيحات وتعليقات للأستاذ الشيخ حمد الجاسر. ومما تمتاز به عقد مقارنة تحقيقية بين نشرتى الأولى والثانية للكتاب وبين نشرة الصديق العلامة عبد العزيز الميمنى الراجكوتى الأستاذ بجامعة عليكرة بالهند. وكذلك إضافة أرقام صفحات نسخة الأصل. وقد استدعى نظام نوادر المخطوطات أن ألغى الفهارس الخاصة بهذه الرسالة لأدمجها في الفهرس العام لهذا المجلد الثاني من النوادر، وهو ملحق بهذه المجموعة، ولم أحتفظ من تلك الفهارس الخاصة إلا بفهرس النبات والحيوان، لأنهما لا نظير لهما في الفهارس العامة.",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 4
  },
  {
    "serial_number": "6266296",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 374,
    "volume_number": 1,
    "text": "مقدمة التحقيق للنشرة الأولى (1)  تهامة: «تهامة» كلمة يختلف مدلولها اختلافا شديدا، فهي تمتد طولا ما بين عدن إلى تخوم الشام مسايرة شاطئ البحر، وهي تنكمش أحيانا من الشمال أو من الجنوب، ويختلف علماء البلدان الأقدمون في ذلك. ولعل أصدق دليل على هذا ما ذكره عرام في صدر كتابه هذا، أن أول جبال تهامة هو «رضوى»، وهو من ينبع على يوم. ويبدو أن ذلك الانبساط والانكماش جاء في مختلف العصور نتيجة للسلطان السياسي أو القبلي الذي كان يسود تلك المنطقة أو يتقلص عنها. على أن اللغة تعيننا عونا تاما في هذه القضية، إذ أن اشتقاق تهامة من «التهم»، وهو تغير الريح وركودها وشدة الحر. فالامتداد الساحلى من جنوب اليمن إلى تخوم الشام هو الذي تصدق عليه هذه التسمية. وإن الراجع إلى أقوال العلماء القدماء ليفهم أن تقسيم الجزيرة العربية يخضع إلى حدّ ما للحجاز، وهو الجبل الممتد الذي حجز بين شطرين جغرافيين متباينين من الجزيرة، أحدهما مرتفع وهو نجد، والآخر منخفض عنه غائر وهو غور تهامة. وسراة هذا الجبل، أي أعاليه، هي ما يسمى بالسراة، ممتدة ما بين أقصى اليمن وأدنى الشام. فبالطبيعة الجغرافية تكون تهامة هي الغور الضيق الذي يساير بحر القلزم،",
    "foot_note": "1. أظهرت هذه النشرة في كتاب مستقل في تاريخ غرة جمادى الثانية سنة 1372.",
    "book_id": "992",
    "new_page_number": 5
  },
  {
    "serial_number": "6266297",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 375,
    "volume_number": 1,
    "text": "ضاربا من الجانب العربي لشبه جزيرة طور سينا إلى أقصى الجنوب من بلاد اليمن. ويختلف عرضها اختلافا كبيرا، فهي بين الطور والسويس جزء ضيق من الساحل (1) . وأوسع موضع في تهامة هو ساحل جدة. وهناك تهامة اليمن، وتهامة  الحجاز. وكانت تهامة اليمن في بعض العهود ولاية قائمة بذاتها، ولا سيما في عهد الفتح الفارسي لليمن في نهاية القرن السادس الميلادي، ثم ولى تهامة هذه من بعد بنو زياد، وكانت حاضرتها «زبيد»، ثم أصبحت ولاية خاضعة لأئمة صنعاء. وهناك تهامة أخرى في غير الجزيرة العربية، وهي على الشاطئ الغربى للبحر، وهي (تهامة الحبشة)، ذكرها ابن خرداذبه (2) ، وهو يعنى بذلك ما يعرف اليوم بساحل «إرتيريا». أما تهامة الذي يعنيها عرام في كتابه هذا فهي (تهامة الحجاز) لا ريب، يجعل أول جبالها الشمالية «رضوى» وهي من ينبع على يوم، ومن المدينة على سبع مراحل، وحدها الجنوبي الطائف وقراها. ومع أن ظاهر هذا الكتاب أنه خاص بجبال تهامة وسكانها وما يتعلق بها، الواقع أنه يشمل الكلام على تهامة والحجاز. فنحن نجد أن ما يخص تهامة ينتهى عندما يقرب من ثلاثة أخماس الكتاب، أي في ص 49. ثم نجد فصلا معقودا لحد الحجاز، يتناول كثيرا من البلدان والقرى والجبال والمواقع الحجازية المجاورة للمدينة. وهي وإن يكن ذكرها جاء تبعا لذكر تهامة لملاصقتها لها ومصاقبتها، فإنها ظفرت بنصيب وافر من عناية عرام، واحتلت مكانا أصيلا من الكتاب. وأنت حينما تنتهى إلى خاتمة الكتاب تلفى هذا النص، «تم كتاب أسماء جبال مكة والمدينة وما يتصل بها». وقد يوحى هذا النص بأنهما كتابان أحدهما لتهامة والآخر لمكة والمدينة. وليس الأمر إلا ما ذكرت من استطراد عرام، وأن كلمة «كتاب» لا تعنى إلا ما كتبه",
    "foot_note": "1. انظر دائرة المعارف الإسلامية (تهامة). \n2. المكتبة الجغرافية (6: 155).",
    "book_id": "992",
    "new_page_number": 6
  },
  {
    "serial_number": "6266298",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 376,
    "volume_number": 1,
    "text": "في هذه الناحية، فإن الأقدمين لم يذكروا لعرام إلا هذا الكتاب «كتاب أسماء جبال تهامة»، وعنه ينقل الناقلون والمؤلفون.  نسبة هذا الكتاب: ينسب هذا الكتاب إلى «أبى الأشعث الكندي (1) »، وهو عبد الرحمن بن محمد بن عبد الملك، وهو الذي روى الكتاب مباشرة عن «عرام». ولم أجد لأبى الأشعث ترجمة، ولكن من المرجح أنه من رجال القرن الثالث، إذ أن شيخه «ابن أبي سعد» كانت وفاته سنة 174. ومن عجب أن ياقوتا لم ينسب الكتاب إلى عرام في مقدمته، ولكن نسبه إليه في مواضع مختلفة من صلب الكتاب. وينسب هذا الكتاب أيضا إلى «السكوني»، قال البكري: «وجميع ما أورده في هذا الكتاب عن السكوني فهو من كتاب أبى عبيد اللّه بن بشر السكوني (2) في جبال تهامة ومحالها، يحمل جميع ذلك عن أبي الأشعث عبد الرحمن بن محمد بن عبد الملك الكندي، عن عرام بن الأصبغ السلمى الأعرابي». وقد رجعت إلى النصوص التي عزاها البكري في معجمه إلى السكوني فوجدت كثيرا منها زائدا على كتابنا هذا، مما يدل على أن «السكوني» جعل الكتاب أساسه في الرواية، ولكنه زاد عليه كثيرا من التعليقات والإضافات، شأن كثير من رواة الكتب الأقدمين. ومن أمثلة ذلك ما ورد في ص 659 من معجم البكري: «وقال السكوني بإسناده عن موسى بن إسحاق بن عمارة قال: مررنا بالبغيبغة مع محمد بن عبد اللّه بن حسن وهي عامرة، فقال: أتعجبون لها، واللّه لتموتن حتى لا يبقى فيها خضراء ثم لتعيشن ثم لتموتن. وقال السكوني في ذكر مياه ضمرة: كانت البغيبغة وغيقة وأذناب الصفراء",
    "foot_note": "1. مقدمة معجم البلدان لياقوت ص 8. \n2. السكوني هذا كندى أيضا مثل أبى الأشعث، فإن السكون، بفتح السين، بطن من كندة.",
    "book_id": "992",
    "new_page_number": 7
  },
  {
    "serial_number": "6266299",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 377,
    "volume_number": 1,
    "text": "مياها لبنى غفار من ضمرة. قال السكوني: كان العباس بن الحسن يكثر صفة ينبع للرشيد فقال له يوما: قرب لي صفتها. فقال: يا وادى القصر نعم القصر والوادي … من منزل حاضر إن شئت أو بادي تلقى قراقيره بالعقر واقفة … والضب والنون والملاح والجادى» فهذا نص واضح أنه ليس من كتاب عرام، وليس مما رواه السكوني عن عرام. وفي ص 811: «وروى السكوني عن رجاله عن طارق بن عبد الرحمن، قال لسعيد بن المسيب: مررنا على مسجد الشجرة فصلينا فيه. فقال: ومن أين يعلم ذلك؟ قال: سمعت الناس يقولونه .. » إلخ. فهذا تعليق على «الحديبية» ومسجدها. وهو مسجد الشجرة، وليس هذا من كتاب عرام في شيء. وهذا نص ثالث ليس من كتاب عرام ولا من منهجه في كتابه، قال السكوني (1) : إذا أردت أن تصدق الأعراب إلى العجز - يريد عجز هوازن - ترتحل من المدينة فتنزل ذا الغصة وهي للسلطان، فتصدق بنى عوال من بنى ثعلبة بن سعد. ثم تنزل الأبرق أبرق الحمى وهي لبنى أبى طالب. ثم تنزل الربذة ثم عريج وهي لحرام بن عدي بن جشم بن معاوية. ثم تنزل الماعزة - ويقال الماعزية - وهي لبنى عامر، من بنى البكاء، ثم تنزل بطن تربة فتصدق هلال بن عامر والضباب. ثم تنزل تريم وهي لبنى جشم. ثم تنزل السى فتصدق بنى هلال، ثم ناصفة وهي لبنى زمان بن عدي بن جشم، ثم الشيسة وهي لبنى زمان أيضا، ثم ترعى وهي لبنى جداعة، ثم تأتى بوانة. فهذا دليل دامغ أن كتاب السكوني في جبال تهامة هو رواية حرة لكتاب عرام اعتمدت على التعليقات الكثيرة والإضافات الاستطرادية، ويكون البكري فضفاض العبارة في كلمته التي سقتها له. ومهما يكن فإن نسختنا هذه كريمة الإسناد، يرويها السيرافى، الذي قيل إنه وضع كتابا في جزيرة العرب، عن أبي محمد السكرى، عن أبي سعد، عن عبد الرحمن بن محمد بن عبد الملك المعروف بأبى الأشعث الكندي، عن عرام.",
    "foot_note": "1. معجم ما استعجم 1236.",
    "book_id": "992",
    "new_page_number": 8
  },
  {
    "serial_number": "6266300",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 378,
    "volume_number": 1,
    "text": "عرام بن الأصبغ السلمى: ولم نعثر لعرام على ترجمة، إلا ما ذكره ابن النديم (1) عرضا عند سرده لأسماء الأعراب الذين دخلوا الحاضرة، فذكره قرينا لأبى الهيثم الأعرابي، وأبى المجيب الربعي، وأبى الجراح العقيلي، وقد ذكره باسمه كاملا، «عرام بن الأصبغ السلمى». ويبدو أنه كان أحد أعراب بنى سليم ممن كانوا يطوفون بالبلدان ويتعرفون مسالكها فيكتسبون بذلك خبرة صادقة. واشتقاق «عرام» من العرامة بمعنى الشدة والقوة والشراسة. ويقال: عرمنا الصبى وعرم علينا، أي أشر، وقيل فرح وبطر، وقيل فسد. و «الأصبغ» اسم أبيه مأخوذ من الأصبغ، وهو من الخيل ما ابيضت ناصيته كلها، ومن الطير ما ابيض ذنبه.  عرام النحوي: وأما عرام الذي ذكره ابن النديم في الفهرست (1) ، والقفطي (2) في إنباه الرواة، فهو لقب لأحد النحويين. وعرام ليس اسما لذلك النحوي بل هو لقب له، واسمه أبو الفضل العباس بن محمد، أو المفضل بن عباس بن محمد. وكان هذا النحوي فيما ذكروا ماجنا رقيعا خفيف العقل، وهو بلا ريب غير عرام بن الأصبغ الذي يعد كتابه هذا وثيقة من أهم الوثائق البلدانية، وأما من أمهات المراجع الأصيلة.  نسخة الأصل: أصل هذه النسخة فريدة في مكتبات العالم، وهو محفوظ في دار الكتب السعيدية بحيدر أباد في مجموعة برقم (365 حديث) وتاريخها يرجع إلى سنة 876. والنسخة في ست ورقات، أي اثنتي عشرة صفحة، بكل صفحة منها 25 سطرا. ومقياس الصفحة 18 … 20. وهي عسرة القراءة مكتوبة بخط نسخى غامض رديء فيه كثير من إهمال النقط، كما أنها كثيرة التحريف والتصحيف. وقد تغلبت على ما",
    "foot_note": "1. ابن النديم 127 مصر 86 ليبسك. \n2. إنباه الرواة القسم الرابع من المجلد الثاني ص 399 مصورة دار الكتب المصرية.",
    "book_id": "992",
    "new_page_number": 9
  },
  {
    "serial_number": "6266301",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 379,
    "volume_number": 1,
    "text": "بها من عسر بالرجوع إلى كتب البلدان، وفي مقدمتها معجم ياقوت ومعجم البكري، وهما قد استوعبا معظم نصوص هذا الكتاب على ما بهما كذلك من تصحيف وتحريف. وكذلك استفتيت معاجم اللغة وغيرها من الكتب في جميع الفنون التي يتطلبها التحقيق، غير آل جهدا أن يظهر هذا الكتاب على أقرب ما يكون من السلامة.  تحقيق هذا الكتاب: لم أكن أعرف شيئا عن وجود هذا الكتاب إلا ما كان يقع تحت نظري كثيرا عند مراجعتى لمعاجم البلدان من ذكر (عرام بن الأصبغ السلمى) حتى كان يوم لقيت فيه الصديق الكريم (الشيخ سليمان الصنيع)، وكنت قد شرعت في عمل علمي يرمى إلى نشر المخطوطات النادرة الصغيرة، وهو الذي أخرجت منه مجموعتين مشتملتين على تسعة كتب نادرة باسم «نوادر المخطوطات» فأخبرني حضرة الأخ أن لديه مخطوطة جديرة بالنشر، هي كتاب عرام هذا، ووعدني أن يرسله إلىّ من الحجاز لأقوم بتحقيقه ونشره، وكان أن برّ بما وعد به، وأرسل النسخة إلىّ فوجدتها مخطوطة سنة 1368 عن نسخة نقلها الشيخ إبراهيم حمدى مدير مكتبة شيخ الإسلام عارف حكمت بالمدينة عن نسخة الهند. ونسخة الأخ الشيخ سليمان هذه قد عنى بمراجعتها وتحقيق بعض مواضع منها. ثم تفضل الشيخ الجليل (السيد محمد نصيف) فكتب إلىّ يشفع رغبة الشيخ سليمان برغبته الكريمة، وأرسل إلى نسخة أخرى نقلها الشيخ عبد الرحمن بن يحيى اليماني عن الأصل الهندي في دقة وإتقان ومطابقة للأصل. ولكن ذلك كله لم يقنع ضميري العلمي، إذ أن أصل الكتاب موجود، وأن من الممكن الحصول عليه، فانتهزت فرصة رحلة الأخ البار (الأستاذ رشاد عبد المطلب) إلى الهند في بعثة جامعة الدول العربية لجلب صور مخطوطاتها النفيسة، فأوصيته أن يحضر معه صورة كتاب عرام. فكان له الفضل الطائل في أن تمكن من اجتلابها، فكانت هي الأصل الذي اعتمدت عليه في نشر هذا الكتاب. فالشكر لحضرة الأخ (الشيخ سليمان الصنيع) على ما بذل من فضل بتعريفى بهذا",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 10
  },
  {
    "serial_number": "6266302",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 380,
    "volume_number": 1,
    "text": "الكتاب وما قدم من خير، ولحضرة الأخ (الأستاذ رشاد عبد المطلب) الذي كان له فضل اجتلاب نسخة الأصل من الهند. وليس يفوتني أن أجعل خاتمة كلمتي هذه شكر السيدين النبيلين (السيد محمد نصيف) و (السيد يوسف زينل)، لما أظهرا من اهتمام كريم بنشر هذا الكتاب، وما قاما به من الإنفاق على طبعه، إسهاما في نشر العلم وأداء الأمانة القاهرة في غرة جمادى الثانية سنة 1372 (1) عبد السلام هارون",
    "foot_note": "1. هذا هو تاريخ النشرة الأولى، وقد ظهر محرفا تحريفا مطبعيا فيما قبل فقرئ سنة 1373.",
    "book_id": "992",
    "new_page_number": 11
  },
  {
    "serial_number": "6266303",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 381,
    "volume_number": 1,
    "text": "نقد النشرة الأولى ذاك ما كتبته في صدر نشرتى الأولى لكتاب عرام. وقد سرني عظيم السرور أن يظهر بعد نحو ثلاثة أشهر من ظهور هذه النشرة نقد علمي لها بقلم الأخ العالم الشيخ حمد الجاسر عضو المجمع العلمي العربي بدمشق، في مجلة المجمع 28: العدد الثالث ص 396 - 402 بتاريخ شوال سنة 1372، والعدد الرابع ص 592 - 599 بتاريخ المحرم سنة 1373. وأنا ممن يعجبه النقد إعجابا، ويرى فيه إتماما لأداء الأمانة العلمية التي يحملها العلماء جميعا لا ينفرد أحد منهم بحملها وحده، ويرى كذلك أن من كتم الأمانة آثم في حقها وفي حق العلم. فكان من الطبيعي عندي أن ألقى ذلك النقد في غبطة، وكان من الطبيعي أيضا أن أغض الطرف عما يندفع فيه الناقد أحيانا من لغة هي أشبه بنزوات الظافر في حومة القتال، فهي نزوات قل من عصم نفسه البشرية من أمثالها. وقد كنت دعوت من قبل إلى أن يكون النقد بين الأدباء جاريا على سنن رفيع من أساليب التعبير، وأن يكون مبرأ من العوامل الشخصية، وكتبت قديما فيما كتبت في مجلة الثقافة العدد 647 مايو سنة 1951: «لم يعد النقد الأدبي كما كان بالأمس تجريحا وتشهيرا بالمنقود، بل آن أن نصطنع الجد فيما يمس أقدار الأدباء وكرامتهم العلمية، فإن العثار أمر يعرض للأدباء جميعا، لا يرتاب في ذلك إلا مغتر، أو ذاهب العقل، أو متهافت النفس. وأمر النقد لا يعدو أن يكون معاونة ومجادلة في الرأي، أو مشاركة في التهدى إلى الصواب. والنقد أبدا خادم للعلم، وليس ضربا هينا من فنون الهجاء، وإنما هو فن رفيع يتأتى إليه الأديب في خلق سمح وخطاب كريم». وبهذه الروح التي أعتز بها وأومن بوحيها إيمانا صادقا، أنشر صدر كلمة الأستاذ الجاسر، وهي كلمة كريمة كنت أرجو أن تكون مبرأة من بعض الهنات التي",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 12
  },
  {
    "serial_number": "6266304",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 382,
    "volume_number": 1,
    "text": "شوهت شيئا من قسماتها. ولكن الكمال للّه وحده. وأعود هنا فأقول: إن النسخة التي تأدت إلينا من كتاب عرام عريقة في التصحيف والتعريف عسرة القراءة، بحيث تجعل المحقق في صراع مع كل لفظ من ألفاظها، وأحيانا بين كل حرف من حروف ألفاظها. ومهما بذل محقق جهده ووكده فليس بمستطيع أن يحررها تحريرا كاملا. لذلك أيضا أعلن غبطتى بما ظفرت به هذه الرسالة من تحقيقات وتصحيحات وتعليقات للأستاذ الناقد الكريم، بلغت جميعها نيفا وعشرين، وسيرى القارئ أثر ما صحّ عندي من هذه النقدات والتعليقات في مواضعها إن شاء اللّه. وقد ظنّ بنا الأستاذ الحاسر أنا قد اطلعنا على نشرة الأستاذ الميمنى عند تحقيق النشرة الأولى، وأنا كتمنا ذلك على القراء!! وهي تهمة ساذجة نرجو له من أجلها غفرانا واسعا من اللّه، فإني لم أر هذه النسخة للمرة الأولى إلا ظهر يوم الخميس 11 شوال سنة 1374 في دار صديقه وصديقنا الأستاذ رشاد عبد المطلب. وإليك ما كتب الشيخ الناقد في صدر كلامه مقرونا بشكرى الصادق وعتبى الصادق أيضا:",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 13
  },
  {
    "serial_number": "6266305",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 383,
    "volume_number": 1,
    "text": "أسماء جبال تهامة تأليف: عرام بن الأصبغ السلمى تحقيق: عبد السلام هارون الأستاذ المساعد بجامعة القاهرة لنشر هذه الرسالة قصة نجملها بأن الشيخ إبراهيم الخربوطلى مدير مكتبة (شيخ الإسلام) في المدينة (المتوفى سنة 1371) زار الهند في عام 1357 فرأى العلامة المحقق الشيخ عبد العزيز الميمنى عضو المجمع العلمي العربي يقوم بنسخها، فساعده في مقابلة ما نسخه على الأصل، ونسخ هو نسخة أتى بها إلى الحجاز. ولما مر بجدة نزل في ضيافة السرى المفضال السيد محمد حسين نصيف وأطلعه على هذه النسخة، فاستنسخها الشيخ نصيف وأطلع عليها كثيرا من المعنيين بالعلم من علماء وغيرهم، فمنهم من نسخها ومنهم من استفاد منها، وكان ممن نسخها على نسخة الشيخ نصيف الشيخ سليمان الصنيع. وقد بذل جهدا مشكورا في تصحيحها بمقابلة ما جاء فيها على معجم البلدان ومعجم ما استعجم وغيرهما من الكتب، إذ نسخة الشيخ الخربوطلى كثيرة التحريف والغلط، زيادة على ما في الأصل من ذلك. ولما زار مصر أطلع الأستاذ عبد السلام محمد هارون على أمر هذه الرسالة لكي ينشرها في مجموعة من الرسائل النادرة (1) ، وبعث إليه بعد أن عاد من مصر بنسخة، ولكنه لم ينشرها بل قال في مقدمة المجموعة الثانية من (نوادر المخطوطات) ص 116: «كنت قد اعتزمت أن أنشر في هذه المجموعة كتاب عرام بن الأصبغ السلمى في أسماء جبال تهامة .. ولكن علمت أن العلامة عبد العزيز الميمنى الراجكوتى قد قام بنشر هذا الكتاب، فآثرت أن أؤجل صنعه إلى أن أطلع على نسخته». أما الشيخ الميمنى فقد نشر الرسالة - كما ذكر الأستاذ عبد السلام - نشرها في مجلة الكلية الشرقية التي تصدر في مدينة لاهور في الباكستان:  Oriental)",
    "foot_note": "1. يعنى نوادر المخطوطات.",
    "book_id": "992",
    "new_page_number": 14
  },
  {
    "serial_number": "6266306",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 384,
    "volume_number": 1,
    "text": "(College Magazine  بعد أن وضع لها مقدمة وصف فيها الأصل، وتحدث عن مؤلف الرسالة. وأشار إلى شيء من خبر المكتبة السعيدية التي وجدت فيها. وقد أراد الشيخ محمد نصيف نشر هذه الرسالة - لأنه لم يطلع على ما نشره الشيخ الميمنى فبعث بها إلى (المجمع العلمي العربي) فأرجعت إليه وقيل له: ينبغي أن يقوم بتصحيحها فلان - كاتب هذا المقال - فبعث بها إلىّ، ولكنني رأيت تحقيقها تحقيقا مفيدا يتطلب الحصول على صورة عكسية من الأصل (فتوغرافية) وأبديت للشيخ نصيف عدم صلاحية نسخته للنشر قبل مقابلتها على الأصل مقابلة دقيقة، فبعث بها إلى الشيخ عبد الرحمن المعلمى اليماني - وكان إذ ذاك في الهند من القائمين على نشر الكتب التي تطبعها دائرة المعارف العثمانية في (حيدر أباد) فقابلها على الأصل مقابلة دقيقة، ونسخ نسخة أخرى عن الأصل بعث بها إلى الشيخ نصيف. وبمقابلة تلك النسخة ظهر أن نسخة الشيخ الخربوطلى كثيرة التحريف والغلط. ثم رأى الشيخ محمد نصيف أن يقوم بنشر الرسالة، وأن يتولى نشرها الأستاذ عبد السلام هارون. وكانت الإدارة الثقافية بجامعة الدول العربية قد بعثت إلى الهند السيد محمد رشاد عبد المطلب ليصور بعض المخطوطات العربية النادرة. فكان مما صور أصل هذه الرسالة. وقد حرصت حينما كنت في القاهرة على الاطلاع على النسخة التي صورتها الإدارة الثقافية، ولكنني لم أتمكن من ذلك مع ما بيني وبين السيد محمد رشاد من الصلة - التي أعتبرها أنا قوية - وقد تكرم فأعارنى نسخة من النسخ التي طبعها الأستاذ الميمنى. وقد اتصلت بالأستاذ الجليل الشيخ محب الدين الخطيب، وتحدثت معه في موضوع نشرها ولكنه قال: إن الأمر يتطلب وجود نسخة من الأصل. ولعل اللّه أراد لهذه الرسالة خيرا - بإحيائها وتحقيقها من علامة محقق، ذي خبرة ودراية وطول معاناة، هو الأستاذ عبد السلام هارون. وليس لنا من عتب نوجهه إلى إخواننا في مصر الذين قد تحول ظروفهم الخاصة دون اطلاعنا على ما نرغب الاطلاع عليه من الكتب التي لنا حق الاطلاع عليها -",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 15
  },
  {
    "serial_number": "6266307",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 385,
    "volume_number": 1,
    "text": "وخاصة مخطوطات الإدارة الثقافية - نعم ليس من حق في عتبهم، فلعل لهم من العذر ما نجهله. غير أننا نعلم - كما يعلمون - أن التعاضد والتساند والتآزر في سبيل العلم أمور يجب أن تقدم على كل اعتبار. وأما كلمتنا عن الأستاذ عبد السلام - في تحقيقه لهذه الرسالة - فهي تحوى شيئا من الاختلاف معه في شأن التحقيق، وهو اختلاف ما كنت أوده، إذ الاختلاف شر في جميع وجوهه، غير أن واجب العلم يقضى به. لقد قلت في كلمات نشرت في (الرسالة، ومجلة المجمع العلمي، ومجلة الفتح، ومجلة الحج) إن بعض إخواننا الجامعيين كالأستاذ مصطفى .. والأستاذ الدكتور زكى .. قاموا بتحقيق بعض المؤلفات أو ترجمتها قياما لا يناسب مع ما لهم من منزلة علمية رفيعة، وخشيت أن يكون ما قيل من أن بعض العلماء المشهورين يكتفى بوضع اسمه على المؤلف الذي يراد منه تحقيقه، ويكل الأمر إلى بعض إخوانه ممن لا يبلغون منزلته - خشيت أن يكون هذا حقا. أما الأستاذ عبد السلام فأنا أبرئه من هذه الوصمة، لأنى شاهدت من آثار عمله في تحقيق بعض المؤلفات القديمة ما لم أشاهده من كثير ممن يعنون بذلك. وكنت أود أن أجد في هذه الرسالة ما وجدته في غيرها من الكتب التي حققها أو أكثر مما وجدته، غير أنني - وإن رأيت فيها ما يسر ويفيد ويمتع - رأيت كل هذا قليلا بالنسبة لما كنت أتوقعه من الأستاذ، ولكي أدلك على قولي يحسن بي أن أذكر بعض ما رأيته في حاجة إلى مزيد من العناية. لم يشر الأستاذ عبد السلام إلى أن العلامة الميمنى نشر هذه الرسالة (1) ، والأمانة العلمية والاعتراف لكل ذي حق بحقه يقضيان بعدم إخفاء مجهود هذا المحقق (2)",
    "foot_note": "1. كيف يتفق هذا مع ما نقله الأستاذ من قولي، في مقدمة هذا المقال ص 373 ص 19 - 20. \n2. كذا طوع للأستاذ الجاسر قلمه ولسانه أن يزل هذه الزلة التي لا تليق برجل يعلمني حق العلم، ويعلم حرصي على التنويه بفضل كل ذي فضل، ولا سيما العلامة الميمنى الذي لا يكاد يخلو كتاب من كتبي من التنويه بفضله، وقد كنت شريكا له في نشر خزانة الأدب مع المغفور له أحمد تيمور باشا. والصلة بيني وبينه وثيقة لا يضيرها مثل هذا الادعاء. -",
    "book_id": "992",
    "new_page_number": 16
  },
  {
    "serial_number": "6266308",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 386,
    "volume_number": 1,
    "text": "الذي لا يجهل باحث في الأدب العربي ما له من أياد في سبيل تحقيق كثير من الكتب الأدبية، ولا ينكر ما له من فضل وعلم. ولا أكون مبالغا حينما أقول بأن جهده في تحقيق هذه الرسالة لا يقل عن جهد الأستاذ عبد السلام إن لم يفقه؛ فالميمنى مثلا أوضح من حالة عرام وبين عصره فذكر أنه من أهل القرن الثاني وأول الثالث (1) وأنه ممن دخل خراسان مع عبد اللّه بن طاهر سنة 217 وهذه من الأمور التي فاتت الأستاذ هارون، وهي أمور لا بدّ منها، إذ معرفة المؤلف أهم ما يعتنى به محقق الكتاب. قد يقال بأن الأستاذ يجهل كون الميمنى قام بتحقيق هذه الرسالة. ولكن هذا يردّه أمور: 1 - أنه صرح بعلم بذلك قبل شروعه في تحقيق الرسالة. 2 - أن السيد محمد رشاد عبد المطلب الذي قال الأستاذ هارون بأنه أوصاه بإحضار نسخة مصورة من أصل الرسالة فأحضرها، قد أحضر في الوقت نفسه نسخة من تحقيق الميمنى (2) . 3 - أنني نشرت في الرسالة في العام الماضي نبأ نشر الأستاذ الميمنى، أثناء نقدي لطبعة السقا لكتاب (معجم ما استعجم). وليس عبد السلام ممن يوصف بأنه لا يقرأ مجلة (الرسالة) وهو ممن يكتبون فيها (3) .",
    "foot_note": "1. - أما السر في إخفائى مجهود هذا المحقق كما زعم الشيخ فهو أنى لم أكن رأيت هذا المجهود بعد، فكيف أظهر شيئا لا يزال عندي في ضمير الغيب؟!! وكيف يقال إني أخفيت ما لم يظهر لي بعد؟! وأما السر في عدم اطلاعى على نسخة الميمنى التي اجتلبها الأستاذ رشاد عبد المطلب من الهند فقد أفصح عنه الشيخ نفسه بقوله في هذا المقال: «وقد تكرم فأعارنى نسخة من النسخ التي طبعها الأستاذ الميمنى» لذلك لم تقع إلى هذه النسخة التي احتجزها الأستاذ الجاسر ويئست من الاطلاع عليها إلا يوم 11 شوال من سنتنا هذه، كما أسلفت القول. \n1. هذا يطابق تمام المطابقة ما ذكرته في نشرتى الأولى ص 6 س 5 - 6 من المقدمة ولكن يأبى الأستاذ إلا أن يتلمس سواقط التهم. \n2. قد استعنت بالمنطق واستعان جمع غفير من أصدقائي ليجدوا نتيجة حتمية لهذا تتعلق بشخصى، فأعيتهم هذه النتائج. والواقع أن النسخة المصورة وردت مع بعثة الهند في حقائبها بالطائرة، وأما الكتب ومنها كتب الأستاذ رشاد الخاصة فوردت بطريق البحر بعد شهرين. \n3. ولكنهم لا يقرءون فيها كل شيء، وقد تفوتهم قراءة عدد بأكمله، وهذا ما حدث لي، فإني مع شديد الأسف لم أقرأ للأستاذ هذا النقد، وسأحاول أن أستفيد بقراءته إن شاء اللّه.",
    "book_id": "992",
    "new_page_number": 17
  },
  {
    "serial_number": "6266309",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 387,
    "volume_number": 1,
    "text": "هذا الأمر - تجاهل الناشر لما يقوم به من سبقه في سبيل تحقيق ما يقوم بنشره - مما أخذ على الأستاذ السقا وأخذ على بعض العلماء الجامعيين. وكنا نود أن يتنزه عنه الأستاذ عبد السلام هارون (1) . قال الأستاذ عبد السلام في مقدمة الرسالة: «أصل هذه النسخة فريدة في مكتبات العالم، وهو مخطوط في دار الكتب السعيدية بحيدر أباد في مجموعة برقم 355 حديث وتاريخها يرجع إلى سنة 876 والنسخة في ست ورقات، (أي في اثنتي عشرة صفحة)». كذا قال الأستاذ ولكننا نجد الأستاذ الميمنى حينما وصف الرسالة قال: «يوجد في الخزانة السعيدية في حيدر أباد مجموعة فيها 27 رسالة في الأحاديث والرجال. أولها خلق أفعال العباد للبخاري، ووافق الفراغ من كتابتها 18 جمادى الأولى سنة 786 وثبت على طرة الخاتمة: بلغ مقابلة على الأصل المنقول منه في مجالس آخرها في ليلة يسفر صباحها عن يوم الخميس من ذي الحجة الحرام سنة 787 كاتبه محمد بن علي. ولكنه مع هذه الدعوى الفارغة آية في التصحيف والتحريف. ورقم كتاب عرام فيها 16 فيما بين ص 151 - 159 أي إنه وقع في تسع صفحات فحسب». هذا ما قاله الأستاذ الميمنى، وهو يخالف وصف الأستاذ عبد السلام في تاريخ النسخ، وفي عدد الصفحات، فأيهما أصح قولا؟ الظاهر أن الميمنى هو المصيب (2) ، وأن الأستاذ عبد السلام نقل تاريخ النسخ عن نسخة سليمان الصنيع، وهو نقلها عن نسخة أصلها نسخة الخربوطلى التي جاء فيها التاريخ كما ذكر الأستاذ هارون، غير أن الشيخ نصيف لما بعثها إلى الهند لنقابل على الأصل كان مما صحح هذا الموضع، صححه",
    "foot_note": "1. نطلب من اللّه للأستاذ الجاسر غفرانا فيما رمانا به من سوء، ونتلو في ذلك قوله جل وعز: «وأن تعفوا أقرب للتقوى». \n2. قد يكون ذلك فيما يتعلق بتاريخ النسخ، فإن مصورتى خلو منها، واعتمدت على ما تأدى إلى من نسخة الشيخ سليمان الصنيع. أما فيما يتعلق بعدد الصفحات، فهو تجن محض من الأستاذ، فإن النسخة بيدي أقلبها مرارا. وقد حرصت في هذه النشرة أن أبين أوائل هذه الصفحات (الاثنتى عشرة) لا التسع كما نقل الشيخ عن العلامة الميمنى.",
    "book_id": "992",
    "new_page_number": 18
  },
  {
    "serial_number": "6266310",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 388,
    "volume_number": 1,
    "text": "الأستاذ عبد الرحمن اليماني كما جاء في نسخة الأستاذ الميمنى، يضاف إلى ذلك أن الأنموذج الذي نقله الأستاذ مصورا في نسخته ليس فيه شيء من تاريخ النسخ مع أنه آخر الرسالة. فالظاهر أن الذين صوروها صوّروها وحدها وهي خالية من التاريخ فاعتمد الأستاذ عبد السلام على ما جاء في نسخة الأستاذ الصنيع، وهو غلط. وبعد أن أورد الأستاذ أحمد الجاسر هذه النقدات في مقالين بمجلة المجمع قال في خاتمة قوله: «هذا ما رأيت إيراده مما لاحظته على هذه الرسالة التي قام بتحقيقها السيد عبد السلام محمد هارون الأستاذ المساعد بجامعة القاهرة، ولا أريد أن أغمطه حقه أو أقلل من عمله، فهو أجل من أن ينكر فضله. وأنا أربأ بنفسي عن الاتصاف بصفة سيئة، ولكنني أردت المشاركة في إبراز هذه الرسالة إبرازا بجعل النفع بها تاما. وقد قام الأستاذ - في هذا السبيل - قياما مشكورا فرجع إلى 32 كتابا من المراجع العامة، ووضع للرسالة فهارس شاملة لأسماء المواضع وللأعلام وللقبائل، وللنبات، وللحيوان، وللقوافى، وللغة، وزينها بكثير من الحواشى المفيدة، وشكل أسماء المواضع، فجاء عمله في هذه الرسالة - كعمله في غيرها من الكتب الكثيرة التي حققها - مفيدا نافعا». هذا وليس يفوتني أن أكرر الثناء والشكر للأستاذ العلامة الجليل، ألهمنا اللّه وإياه التوفيق والسداد.",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 19
  },
  {
    "serial_number": "6266311",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 389,
    "volume_number": 1,
    "text": "كتاب أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه رواية السيرافي بإسناده إلى عرّام بن الأصبغ السّلمى",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 20
  },
  {
    "serial_number": "6266312",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 391,
    "volume_number": 1,
    "text": "صورة للأسطر الأولى من نسخة الأصل صورة للأسطر الأخيرة من نسخة الأصل",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 21
  },
  {
    "serial_number": "6266313",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 395,
    "volume_number": 1,
    "text": "بسم الله الرحمن الرحيم رب يسر بخير آمين قال أبو سعيد الحسن بن عبد الله السيرافي (1) : أخبرنا أبو محمد عبيد الله ابن عبد الرحمن السكري (2) قراءة عليه حدثنا عبد الله بن عمرو بن عبد الرحمن الوراق المعروف بابن أبي سعد (3) ، حدثنا عبد الرحمن بن محمد بن عبد الملك أبو الأشعث قال: أملي على عرام بن الأصبغ السلمى قال:",
    "foot_note": "1. هو الحسن بن عبد اللّه بن المرزبان أبو سعيد القاضي السيرافى النحوي، أصله من سيراف، سكن الجانب الشرقي ببغداد وولى القضاء بها، وكان أبوه مجوسيا أسلم، واسمه بهزاذ، فسماه أبو سعيد عبد اللّه، وكان من أعلم الناس بنحو البصريين، وينتحل في الفقه مذهب أهل العراق، قرأ على أبى بكر بن مجاهد القرآن، وعلى أبى بكر بن دريد اللغة، ودرسا عليه جميعا النحو. وقرأ على أبى بكر بن السراج وعلى أبى بكر المبرمان النحو، وقرأ عليه أحدهما القراءات ودرس الآخر عليه الحساب. وكان زاهدا لا يأكل إلا من كسب يده ولا يخرج من بيته إلى مجلس الحكم والتدريس في كل يوم إلا بعد أن ينسخ عشر ورقات يأخذ أجرها عشرة دراهم. وله شرح كتاب سيبويه، وكتاب أخبار النحاة، وكتاب الإقناع في النحو، وكتاب جزيرة العرب. ولد قبل 290 وتوفى سنة 368. تاريخ بغداد (7: 341 - 342) وبغية الوعاة 221 ومعجم الأدباء (8: - 145 - 232) والبلدان (5: 193) ونزهة الألباء 379. \n2. هو عبيد اللّه بن عبد الرحمن بن محمد بن عيسى، أبو محمد السكرى. سمع زكريا بن يحيى المنقري صاحب الأصمعي، ومحمد بن الجارود الوراق، وإبراهيم بن الوليد الجشاش، و (عبد اللّه ابن أبي سعد الوراق)، وعبد اللّه بن مسلم بن قتيبة. وروى عنه الجعابي وأبو عمر بن حيويه. وأحمد بن إبراهيم بن شاذان، وأبو الحسن الدارقطني. وكان ثقة جليلا. توفى سنة 323. تاريخ بغداد 5499. وفي الأصل: «عبيد اللّه بن عبد اللّه»، تحريف. \n3. في الأصل: «أبي سعيد»، محرف. وهو عبد اللّه بن عمرو بن عبد الرحمن بن بشر بن هلال. أبو محمد الأنصاري الوراق، المعروف بابن أبي سعيد، بلخى الأصل، سكن بغداد وحدث بها عن الحسين بن محمد المروزي، وعفان بن مسلم، وسليمان بن حرب، وهوذة ابن خليفة. وسليمان بن داود الهاشمي وغيرهم، وروى عنه ابن أبي الدنيا، وعبد اللّه بن محمد البغوي، و (عبيد اللّه بن عبد الرحمن السكرى)، والحسين بن القاسم الكوكبى، والحسين بن إسماعيل المحاملي وغيرهم. وكان ثقة صاحب أخبار وآداب وملح. ولد سنة 197 وتوفى سنة 274. تاريخ بغداد 5144.",
    "book_id": "992",
    "new_page_number": 22
  },
  {
    "serial_number": "6266314",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 396,
    "volume_number": 1,
    "text": "أسماء جبال تهامة وسكانها وما فيها من القرى، وما ينبت عليها من الأشجار، وما فيها من المياه أولها (رضوى) من ينبع على يوم، ومن المدينة على سبع مراحل ميامنة طريق المدينة، ومياسره طريق البريراء (1) لمن كان مصعدا إلى مكة، وعلى ليلتين من البحر. وبحذائها (2) (عزور (3) ) وبينه وبين رضوى طريق المعرقة (4) تختصره (5) العرب إلى الشام، وإلى مكة وإلى المدينة، بين الجبلين قدر شوط فرس. وهما جبلان شاهقان منيعان لا يرومهما أحد، نباتهما الشوحط والقرظ والرنف (6) ، وهو شجر يشبه الضهياء. والضهياء: شجر يشبه العناب تأكله الإبل والغنم، لا ثمر له. وللضهياء ثمر يشبه العفص لا يؤكل، وليس له طعم ولا ريح.",
    "foot_note": "1. البكري 655: «البر»، تحريف. \n2. وقع في نسخة الميمنى: «بحذائه» محرفا عما في الأصل. \n3. بفتح أوله وسكون الزاي، وأصل معنى العزور السّيئ الخلق. وفيه يقول عمر بن أبي ربيعة: أشارت بأن الحي قد حان منهم \n…. هبوب ولكن موعد لك عزور ويقول كثير: تواهق بالحجاج من بطن نخلة \n…. ومن عزور والخبت خبت طفيل \n4. ضبطها ياقوت بضم الميم وسكون العين وكسر الراء، ثم قال: وقد روى بالتشديد للراء والتخفيف، وهو الوجه، كأنه الطريق الذي يأخذ نحو العراق. أما البكري فقد ضبطها بفتح الميم والراء. وهذا الطريق سلكته غير قريش حين كانت وقعة بدر. \n5. اختصار الطريق: سلوك أقربه. \n6. بسكون النون. قال أبو حنيفة: «من شجر الجبال ينضم ورقه إلى قضبانه إذا جاء الليل، وينتشر بالنهار».",
    "book_id": "992",
    "new_page_number": 23
  },
  {
    "serial_number": "6266315",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 397,
    "volume_number": 1,
    "text": "وفي الجبلين جميعاً مياه أوشال - والوشل: ماء يخرج من شاهقه لا يطورها أحد (1) ولا يعرف منفجرها. وليس شيء من تلك الأوشال يجاوز الشقة (2) . وأنشد في الرنف (3) يصف جبلا: مرانعه رنف فملقى سياله … مدافع أوشال يدبّ معينها (4) ويسكن ذراهما وأحوازهما (5) نهد وجهينة، في الوبر خاصة دون المدر، ولهم هناك يسار ظاهر. ويصب الجبلان في وادي (غيقة)، وغيقة يتصب (6) في البحر، ولها مسك (7) وهي مواضع (8) تمسك الماء، واحدها مساك. ومن عن يمين رضوى لمن كان منحدراً من المدينة إلى البحر، على ليلة من رضوى (9) (ينبع)، وبها منبر وهي قرية كبيرة غنّاء، سكانها الأنصار وجهينة",
    "foot_note": "1. لا يطورها: لا يحوم حولها ولا يدنو منها. ووقع في نسخة الميمنى «من شواهقه» محرقا عما في الأصل. \n2. البكري: «بكسر أوله وتشديد ثانيه»، وعنده 327: «فأما البثنة، بإسكان ثانيه وفتح النون، على وزن فعلة، فأرض تلقاء سويقة بالمدينة، اعتملها عبد اللّه بن حسن بن علي بن أبي طالب بمال امرأته هند بنت أبي عبيدة بن عبد اللّه بن زمعة وأجرى عيونها، وهي البثنات، وكان قبل أن ينكحها مقلاتا، فلما عمرت البثنات قال لها: ما خطرت من البثنة فهو لك. فمشت طول الخيف في عرض ثلاثة أسطر من النخل. فهو حق ابنها موسى منه الذي يقال له الشقة». \n3. في الأصل: «أنشدني الرمث». وجعلها الميمنى في نسخته: «وأنشد في الرمث» وكلاهما تحريف. وقد سبق ذكر الرنف في ص 396. \n4. السيال كسحاب: شجر له شوك أبيض، وهو من العضاه. والمدافع: المجارى، واحدها مدفع بفتح الميم. وفي الأصل: «يدافع». \n5. الذرى بالفتح: الكن والظل. والأحواز: النواحي، جمع حوزة، ومثله هضبة وأهضاب وذوطة وأذواط. وفي الأصل: «أجوارهما». وانظر الهمداني 117، 120. \n6. كذا كتبت في الأصل لتقرأ بالتاء والياء معا. \n7. في الأصل: «مساك»، محرف. \n8. في الأصل: «وهو موضع». \n9. زاد ياقوت عن عرام: «من المدينة على سبع مراحل، وهي لبنى حسن بن علي».",
    "book_id": "992",
    "new_page_number": 24
  },
  {
    "serial_number": "6266316",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 398,
    "volume_number": 1,
    "text": "وليث أيضاً، وفيها عيون عذاب غزيرة، وواديها (يليل) يصبّ في غيقة. (والصّفراء (1) ) قرية كثيرة النخل والمزارع وماؤها عيون كلها، و [هي] فوق ينبع مما يلي المدينة، وماؤها يجري إلى ينبع، وهي لجهينة والأنصار ولبني فهر ونهد، ورضوى منها من ناحية مغيب الشمس، وحواليها قنان - واحدها قنة - وضعاضع صغار - واحدها ضعضاع. والقنان والضعاضع جبال صغار لا تسمّى. وفي يليل هذه عين كبيرة تخرج من جوف رمل من أعذب ما يكون من العيون وأكثرها ماء، تجرى في رمل فلا تمكن الزّارعين عليها إلّا في مواضع يسيرة (2) من أحناء الرمل، فيها نخيل، وتتخذ البقول والبطيخ، وتسمى هذه العين (البحير (3) ). و (الجار (4) ) على شاطئ البحر، ترفأ إليه السفن من أرض الحبشة ومصر، ومن البحرين والصّين. وبها منبر، وهي قرية كبيرة آهلة، شرب أهلها من البحير. وبالجار قصور كثيرة، ونصف الجار في جزيرة من البحر، [ونصفها على الساحل. وبحذاء الجار جزيرة في البحر (5) ] تكون ميلاً في ميل، لا يعبر إليها",
    "foot_note": "1. ويقال لها أيضا «الصفيراء». قال عاسل بن غزية: ثم انصببنا جبال الصفر معرضة \n…. عن اليسار وعن أيماننا جدد أراد جبال الصفراء. فلم يستقم له الوزن فجمعها وما يليها. البكري 836. \n2. في الأصل: «كثيرة»، صوابه من البكري 836 وياقوت في رسم (البحير، يليل). \n3. وكذا في ياقوت. وعند البكري 826: «البحيرة». \n4. أصل «الجار» ما قرب من المنازل من الساحل، كما في اللسان، وقال ياقوت: مدينة على ساحل بحر القلزم، بينها وبين المدينة يوم وليلة، وبينها وبين أيلة نحو من عشر مراحل، وإلى ساحل الجحفة نحو ثلاث مراحل. في الأصل: «والخباو». \n5. هذه التكملة الضرورية من ياقوت والبكري في رسم (الجار). ولم يتنبه العلامة الميمنى إلى هذه التكملة.",
    "book_id": "992",
    "new_page_number": 25
  },
  {
    "serial_number": "6266317",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 399,
    "volume_number": 1,
    "text": "إلا (1) في سفن، وهي مرفأ (2) الحبشة خاصة، [يقال لها (3) ] (غراف)، وسكانها تجار كنحو (4) أهل الجار، يؤتون بالماء من على فرسخين. ووادي يليل يصب في البحر (5) ثم من عدوة غيقة اليسرى مما يلي (6) المدينة عن يمين المصعد إلى مكة من المدينة، وعن يسار المصعد من الشام إلى مكة جبلان يقال لهما (ثافل الأكبر) و (ثافل الأصغر) وهما لضمرة (7) خاصة. وهم أصحاب حلال (8) ورعية (9) ويسار، وبينهما ثنية لا تكون رمية سهم، وبينهما وبين رضوى وعزور ليلتان. نباتهما العرعر، والقرظ، والظيان، والأيدع، والبشام. وللظيان ساق غليظة. وهو شاك - أي غليظ الشوك - ويحتطب. وله سنفة كسنفة العشرق والسّنفة: ما تدلّى من الثمر وخرج عن أغصانه. والعشرق: ورق يشبه الحندقوقا منتنة الرّيح.",
    "foot_note": "1. هذه الكلمة ثابتة في الأصل، وظنها الميمنى ساقطة منه فأثبتها بين معقفين. \n2. في الأصل: «بريه» صوابه من البكري. وعند ياقوت: «مرسى». \n3. التكملة من ياقوت والبكري. \n4. في الأصل: «البحر» صوابه من ياقوت في (الجار، فرات). وعبارة البكري: «وكذلك سكان الجار». \n5. قال البكري: «هذا قول السكوني، والصحيح أن يليل يصب في غيقة، وغيقة تصب في البحر». \n6. هذه الكلمة ساقطة من نسخة الميمنى. \n7. ضمرة بن بكر بن عبد مناف بن كنانة بن خزيمة بن مدركة، كما ذكر ياقوت في (ثافل). وقال في اشتقاقه: «والثفل في اللغة: ما ثفل من كل شيء». وضبطه البكري بكسر الفاء وفتحها. \n8. الحلال: جمع حلة، بالكسر، وهي جماعة بيوت الناس، لأنها تحل. قال كراع: هي مائة بيت. \n9. الرعية، بالكسر: اسم من الرعى، كما في اللسان عن اللحياني. وفي الأصل: «ودعة» وعند ياقوت: «ورغبة» والبكري: «ورعى»، وأثبت ما تقتضيه مقابلة القراءات.",
    "book_id": "992",
    "new_page_number": 26
  },
  {
    "serial_number": "6266318",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 400,
    "volume_number": 1,
    "text": "والأيدع: شجر يشبه الدّلب (1) . إلّا أنّ أغصانه أشد تقاربا من أغصان الدلب، لها وردة حمراء ليست تجد طيب الريح (2) وليس لها ثمر، نهى رسول الله صلى الله عليه وسلم عن كسر شيء من أغصانها وعن السدر والتنضب والشبهان (3) لأن هؤلاء جميعاً ذوات ظلال يسكن الناس فيها (4) من البرد والحر. وللتنضب (5) ثمر يقال له الهمقع، يشبه المشمش (6) يؤكل طيباً. وللسرح (7) ثمر يقال له الآء (8) يشبه الموز وأطيب منه، كثير الحمل جداً.",
    "foot_note": "1. أبو حنيفة: الدلب: شجر يعظم ويتسع ولا نور له ولا ثمر، وهو مفرض الورق واسعه شبيه بورق الكرم، واحدته دلبة. قال ياقوت: واللغويون غير عرام بن الأصبغ مختلفون في الأيدع، فمنهم من قال إنه الزعفران، محتجا بقول رؤبة: • كما اتقى محرم حج أيدعا \n…. والبعض يقول: إنه دم الأخوين، ومنهم من قال إنه البقم، والصواب عندنا قول عرام، لأنه بدوي من تلك البلاد، وهو أعرف بشجر بلاده. ونعم الشاهد على قول عرام قول كثير حيث قال: كأن حمول القوم حين تحملوا \n…. صريمة نخل أو صريمة أيدع \n2. ياقوت: «ليس بطيب الريح». \n3. هذه الكلمة ساقطة من ياقوت. وهو بفتح الشين والباء وضمها: ضرب من العضاه. \n4. ياقوت: «دونها». \n5. في الأصل: «وللسدر»، تحريف. والمعروف في ثمر السدر أنه النبق، وأما «الهمقع» بضم الهاء وفتح الميم مخففة ومشددة أيضا فهو ثمر التنضب، الواحدة همقعة، كما في اللسان والمخصص (11: 188). بل قال كراع: إن الهمقع هو التنضب بعينه. ولم يذكر ياقوت هذه العبارة، وذكرها البكري في (أرثد). \n6. شك ابن دريد في صحة عربيته. وهو بكسر الميمين وفتحهما وضمهما، كما في تاج العروس. وذكر داود الأنطاكي المتوفى سنة 1008 أنه يعمل منه ما يسمى «قمر الدين». \n7. هذا استطراد منه، وإلا فإنه لم يسبق له ذكر. والسرح: جمع سرحة، وهو شجر كبار عظام يحل الناس تحتها في الصيف ويبتنون البيوت. \n8. في الأصل: «اللسكاى». والمعروف في ثمر السرح أنه «الآء»، الواحدة «آءة». وفي المخصص (11: 189): وللسرح عنب يسمى الآء واحدته آءة، يأكله الناس ويرتبون منه الرب. وله أول شيء برمة يخرج فيها هذا الآء، وهو يشبه الزيتون. ولا تناقض بين تشبيه عرام له بالزيتون وتشبيه ابن سيده له بالموز، فقد يكون أحد الشبهين للشكل، والآخر للطعم.",
    "book_id": "992",
    "new_page_number": 27
  },
  {
    "serial_number": "6266319",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 401,
    "volume_number": 1,
    "text": "وفي ثافل الأكبر عدة آبار في بطن واد يقال له (يرثد). يقال للأبار (الدباب)، وهو ماء عذب كثير غير منزوف، أناشيط (1) قدر قامة قامة. وفي ثافل الأصغر ماء في دوار في جوفة يقال له (القاحة (2) ) وهما بئران عذبتان غزيرتان. وهما جبلان كبيران شامخان، وكل جبال نهامة تنبت الغضور وبينها وبين رضوى وعزور سبع مراحل (3) ، وبين هذه الجبال جبال صغار وقرادد (4) وينسب إلى كل جبل ما يليه. ولمن صدر من المدينة مصعدا أوّل جبل يلقاء من عن يساره (ورقان (5) ) وهو جبل أسود عظيم كأعظم ما يكون من الجبال، بنقاد من سيالة إلى المتعشى (6) بين العرج والرويثة، ويقال للمتعشّى: الجىّ (7) وفي ورقان أنواع (8) الشجر المثمر كله [وغير المثمر (9) ]، وفيه القرظ",
    "foot_note": "1. جمع أنشاط. يقال بئر أنشاط، أي قريبة القعر، تخرج الدلو منها بجذبة واحدة. \n2. معنى القاحة والباحة واحد، وهما وسط الدار، قال ياقوت: «وقد ذكر فيه القاحة بالفاء والجيم». ولها ذكر في كتب السيرة في «حجة الوداع». انظر إمتاع الأسماع 512. كما ذكرت في طريق الهجرة. انظر السيرة 333 جوتنجن. \n3. جمع قردد، وهو ما ارتفع من الأرض وغلظ. \n4. وقع في نشرتى الأولى: «وعزور وينبع مراحل»، وهو خطا منى في قراءة النسخة، وقد قرأها الميمنى صحيحة كما أثبت هنا، وذكرها الشيخ حمد في تصحيحاته. وأشار إلى أنها كذلك في معجم البكري، رسم (ثافل). \n5. بفتح أوله وكسر ثانيه، كما ضبطه البكري وياقوت، قال ياقوت: ويروى بسكون الراء، وأنشد الجميل: يا خليلي إن بثنة بانت \n…. يوم ورقان بالفؤاد سليبا قلت: ولا أحاله إلا من ضرائر الشعر. \n6. لم يرسم له ياقوت ولا البكري، ولكن ذكراه في رسم (ورقان). \n7. رسم له ياقوت، ولم يرسم له البكري، وإنما رسم لجي بفتح الجيم، وهي مدينة إصبهان. \n8. سقطت هذه الكلمة من نسخة الميمنى. \n9. التكملة من ياقوت والبكري والسمهودي 2: 390. ولم يثبتها العلامة الميمنى.",
    "book_id": "992",
    "new_page_number": 28
  },
  {
    "serial_number": "6266320",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 402,
    "volume_number": 1,
    "text": "والسماق (1) والرمان والخزم (2) . وأهل الحجاز يسمون السماق «الضمخ (3) » وأهل نجد (4) يسمونه «العرتن» واحدته عرتنة (5) . والخزم: شجر يشبه ورقه ورق البرديّ، وله ساق كساق النّخلة يتّخذ منه الأرشية الجياد. وفيه أوشال وعيون وقلات. سكانه أوس من مزينة، أهل عمود ويسار، وهم قوم صدق. وبسفحه من عن يمين (سيالة (6) ) ثم (الروحاء (7) ) ثم (الرويثة (8) ) ثم (الجىّ). وبعلو (9) بينه وبين قدس الأبيض ثنية بل عقبة (10) يقال لها (ركوبة)",
    "foot_note": "1. قال داود: شجر يقارب الرمان طولا إلا أن ورقه مزغب لطيف. وقال أبو حنيفة: له ثمر حامض عناقيد فيها حب صغار يطبخ، قال: ولا أعلمه ينبت بشئ من أرض العرب إلا ما كان بالشام. لكن نص عرام ينقض قول أبي حنيفة. ومن أعمال حلب جبل عظيم يسمى «جبل السماق» لكثرة ما ينبت فيه منه. \n2. أبو حنيفة: الخزم: شجر مثل شجر الدوم سواء، وله أفنان وبسر صغار، يسود إذا أينع، مر عفصى، لا يأكله الناس ولكن الغربان حريصة عليه تنتابه. وانظر ما سيأتي من تفسير عرام. \n3. في الأصل: «الضبح» تحريف، صوابه عند البكري. \n4. البكري: «وأهل الجند». \n5. في الأصل: «عرتونة»، وإنما تكون هذه واحدة للعرتون كزرجون، وهي إحدى لغات كثيرة في العرتن ذكرت في اللسان والقاموس. \n6. ومسجدها: أحد ثلاثة مساجد بنيت على عهد رسول اللّه صلى الله عليه وسلم، والثاني مسجد الحرة، والثالث مسجد الشجرة، وأما غيرها من المساجد فهي مواضع صلواته صلى الله عليه وسلم، اتخذت بعده مساجد. \n7. فيها يقول عروة بن حزام، (الأمالي 3: 158): ألا فاحملانى بارك اللّه فيكما \n…. إلى حاضر الروحاء ثم دعاني \n8. تصغير الروثة، وهي واحدة روث الدواب، أو روثة الأنف، وهي طرفه \n9. قرأها العلامة الميمنى «يفلق»، ورسمها في الأصل لا يساعد في ذلك. وعند السمهودي 2: 390: «يفصل». \n10. الثنية: طريق العقبة. قال أبو منصور: العقاب: جبال طوال بعرض الطريق فالطريق تأخذ فيها. وكل عقبة مسلوكة ثنية، وجمعها ثنايا.",
    "book_id": "992",
    "new_page_number": 29
  },
  {
    "serial_number": "6266321",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 403,
    "volume_number": 1,
    "text": "و (قدس (1) ) هذا جبل شامخ ينقاد إلى المتعشّى بين العرج والسّقيا، ثم يقطع (2) بينه وبين قدس الأسود عقبة يقال لها (حمت). ونبات القدسين جميعاً العرعر والقرظ، والشوحط، والشقب (3) : شجر له أساريع كأنها الشطب التي في السيف (4) ، يتخذ منها القسى. والقدسان جميعاً لمزينة، وأموالهم ماشية من الشاة (5) والبعير، أهل عمود، وفيها أوشال كثيرة. ويقابلهما (6) من غير (7) الطريق المصعد جبلان يقال لهما (نهبان): نهب الأسفل، ونهب الأعلى، وهما لمزينة، ولبنى ليث فيهما شقص، ونباتهما العرعر والإثرار (8) . وقد يتخذ من الإثرار القطران كما يتخذ من العرعر؛ وفيهما القرظ. وهما مرتفعان شاهقان كبيران. وفي نهب الأعلى ماء في دوار من الأرض، بئر واحدة كبيرة غزيرة الماء، عليها مباطخ (9) وبقول ونخيلات (10) يقال لها (ذو خيمى (11) ) وفيه أوشال.",
    "foot_note": "1. قال الأنباري: قدس مؤنثة لا تجرى - أي لا تصرف - اسم للجبل وما حوله. لكن جرى عرام هنا على صرفه كما سيأتي. وجرى البكري أيضا على صرفه في رسم (آرة). \n2. في الأصل: «سعطع» بالإهمال. \n3. بالتحريك وبالكسر، وجعلها الميمنى «السكب»، وهو سهو منه. \n4. الأسروع: الشكير، وهو ما ينبت حول الشجرة من أصلها. والشطبة: عمود السيف الناشز في متنه. \n5. كذا في الأصل، وجعلها الميمنى «الشاء» \n6. في الأصل: «يقابلها». \n7. وكذا قرأها العلامة الميمنى مع إهمالها في الأصل. ويرى الشيخ حمد أن صوابها «يمين». \n8. سيأتي تفسيره في ص 408. \n9. جمع مبطخة، لموضع البطيخ. \n10. جعلها الميمنى «نخلات» ولا ضرورة لهذا التغيير. \n11. وكذا عند ياقوت في رسم «نهبان» والزمخشري في كتاب الجبال 166 - 167 وعند البكري في رسمه وفي (قدس 1052)، وكذا الهمداني في صفة جزيرة العرب 176 «ذو خيم». لكن عند البكري في رسم (العرج): «المنبجس».",
    "book_id": "992",
    "new_page_number": 30
  },
  {
    "serial_number": "6266322",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 404,
    "volume_number": 1,
    "text": "وفي نهب الأسفل أوشان (1) ، ويفرق بينهما وبين قدس وورقان الطريق، وفيه (العرج). ووادي العرج يقال له (مسيحة (2) )، نباته المرخ والأراك والثّمام. ومن عن يسار الطريق مقابلا قدسا (3) الأسود جبل من أشمخ ما يكون، يقال له (آرة)، وهو جبل أحمر تخر (4) من جوانبه عيون، على كلّ عين قرية. فمنها قرية غناء كبيرة يقال لها (الفرع (5) ) وهي لقريش والأنصار ومزينة. ومنها (أم العيال (6) ) قرية صدقة فاطمة بنت رسول الله صلى الله عليه وسلم (7) . وعليها قرية يقال لها (المضيق (8) ). ومنها قرية يقال لها (المحضة (9) )، ومنها قرية يقال لها (الوبرة (10) )، ومنها قرية يقال لها (خضرة (11) )، ومنها قرية",
    "foot_note": "1. ظنها الميمنى ساقطة من الأصل، وهي ثابتة فيه. \n2. وكذا عند البكري في «قدس» نقلا عن السكوني. وفي الأصل: «فسيحة» تحريف. وذكر ياقوت في (سميحة) ثلاث لغات، تقال بالتصغير والتكبير، وبتقديم الميم كما هنا. \n3. وكذا ورد النقل عنه في ياقوت في رسم «آرة». وانظر ما سبق في ص 403. \n4. كذا في الأصل والسمهودي 2: 239. وعند ياقوت: «تخرج» والبكري: «تنفجر». وكنت قرأتها في نشرتى الأولى «تخرج». \n5. يقال بضمة وبضمتين، كما ذكر ياقوت. \n6. البكري: «أرض بالفرع لجعفر بن طلحة بن عمرو بن عبيد اللّه بن عثمان بن كعب، وكان طلحة جميلا وسيما، فلزم علاج عين أم العيال ولها قدر عظيم، وأقام بها وأصابه الوباء، فقدم المدينة وقد تغير، فرآه أنس بن مالك فقال: هذا الذي عمر ماله وأخرب بدنه». وانظر ياقوت (1: 336). \n7. نحوه ما ورد عند البكري 1329 من أن «الجثجاثة: صدقة عبد اللّه بن حمزة». وما ورد في 743 «وكثير منها - أي العيون - صدقات للحسن بن زيد». انظر صورة من صور التصدق بالضياع عند البكري 658. \n8. ذكر ياقوت أن بنى عامر ورئيسهم علقمة بن علاثة أغاروا على زيد الخيل، فالتقوا بالمضيق، فأسرهم زيد الخيل عن آخرهم، وكان فيهم الحطيئة، فشكا إليه الضائقة فمن عليه. \n9. من قولهم محض الشئ، أي خالصه، كما ذكر ياقوت. \n10. سميت باسم الحيوان، وهو دويبة غبراء على قدر السنور حسنة العينين شديدة الحياء، تكون بالغور. \n11. كذا ضبطت عند ياقوت والبكري في رسمها، وذكرها البكري أيضا في (قدس 1051) وفي الأصل: «حضرة» بالحاء المهملة، تحريف.",
    "book_id": "992",
    "new_page_number": 31
  },
  {
    "serial_number": "6266323",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 405,
    "volume_number": 1,
    "text": "يقال لها (الفغوة (1) ) تكتنف آرة من جميع جوانبه. وفي كل هذه القرى نخيل وزروع، وهي من السقيا على ثلاث مراحل من عن يسارها مطلع الشمس، وواديها يصب في (الأبواء)، ثم في (ودان) وهي قرية (2) من أمهات القرى لضمرة وكنانة وغفار وفهر قريش، ثم في (الطّريفة)، والطّريفة قرية ليست بالكبيرة على شاطئ البحر. واسم وادي آرة (حقل (3) ) وقرية يقال لها (وبعان (4) ). و (خلص آرة (5) ) واد به قرى وأجزاع (6) ونخل، وقد قال فيه الشاعر (7) :",
    "foot_note": "1. هي من الفغوة، بمعنى الزهرة. \n2. سقطت هذه الكلمة من نشرة الميمنى، وهي ثابتة في الأصل. \n3. عند البكري في رسمه وفي (قدس 1052): «حقيل». وكنت أثبتها في نشرتى الأولى «حقيل» والتصحيح للشيخ حمد مطابقا ما في الأصل ومعجم البلدان 3: 306 والسمهودي في وفاء الوفا 2: 292 قال: «أما حقيل ففي نجد. وبون شاسع بين الموضعين». \n4. رسم لها ياقوت والبكري، وهو بفتح الواو وكسر الباء. وأخطأ البكري إذ رسم لها مرة أخرى (ونعان) بفتح الواو والنون، وأحال إلى مواضع ذكرت فيها على الصواب. \n5. يقول فيها النصيب، كما روى البكري: وكانت إذ تحل أراك خلص \n…. إلى أجزاع بيشة والرغام \n6. جمع جزع بالكسر، وهو جانب الوادي ومنقطعة، قيل لا يسمى جزعا حتى تكون له سعة تنبت الشجر وغيره. \n7. هو أبو المزاحم، كما ذكر البكري في 449 - 450. والأبيات عند ياقوت (خلص، وبعان) والبكري 450، 1052. وكتب الشيخ حمد هنا تعليقا نفيسا، وهذا نصه: لعل مما يفيد القراء أن ننقل شيئا من خبر قائلها عن كتاب (التعليقات والنوادر لأبى على الهجري - نسخة دار الكتب المصرية) قال: وأنشدني لعزلان الثمامي، من ثمامة بن كعب بن جذيمة بن خفاف: خليلىّ صبّانى ورحلي وناقتي \n…. على ملح الريّان ثم دعانيا فإن أنتما لم تفعلا ومررتما \n…. على حائط الزّيدى فاستودعانيا أسائل عن عمق وعن حسن حاله \n…. ولولا ابنة الزيدي قلّ سؤاليا عمق الزروع قرب الفرع، وعمق المضيق بيليل قرب بدر. وقال: الزيديون من بنى عمران -",
    "book_id": "992",
    "new_page_number": 32
  },
  {
    "serial_number": "6266324",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 406,
    "volume_number": 1,
    "text": "فإن بخلص فالبريراء فالحشا … فوكد إلى النّقعاء من وبعان (1)",
    "foot_note": "1. - من مزينة ثم من بنى عثمان. والدهنا: قلت بين مر عنيب وبين السائرة. وله: ألممّا بعمق ذي الزّروع فسلّما \n…. وإن كان عن قصد المطى يجور فإنّ بعمق ذي الزروع لبدّنا \n…. من اسلم في تكليمهن أجور ولا تعجزا عن حاجة لأخيكما \n…. وإن كان فيها غلظة وفجور فما ضرّ صرم الأسلميات لو بدت \n…. لنا يوم عمق أذرع ونحور وفي عرس قنّان علىّ أليّة \n…. وفي الحنذيات الملاح نذور وله في نساء مزنيات: فإن بوكد فالبريراء فالحشا \n…. فخلص إلى الرنقاء من وبعان وكد: طرف أسود وراء مر بشوكان. والبريراء: أكيمة صغيرة. والحشا: بلد بين مر وشوكان، وخلص آرة. والرنقاء هاهنا: قاع. وبعان بالحرة. أوانس من حيّا عداء كليهما \n…. طوامح بالأزواج غير غوان جننّ جنونا من بعول كأنها \n…. قرود تنازى في رياط يمان فمرّا فقولا طالبان لحاجة \n…. وعودا فقولا نحن منصرفان فظفروا به في الدهنا - وهي قلتة عميقة - فربطوا في رجله رحى ثم رموا به فيها فهلك. قال: هذا ما نقلته من كتاب الهجري، أوردته بطوله لاشتماله على شيء مما يتعلق بقائل تلك الأبيات. ولكن أهو أبو المزاحم الذي نسب البكري الأبيات إليه؟ الظاهر أنه هو: فصاحب التاج أنشد أحدها في مادة (وبع) ونسبها لأبى المزاحم السعدي. والأصبهاني روى في الأغانى ج 11 ص 79 بيتين لأبى المزاحم، هما. أعيّرتمونى أن دعتني أخاهم \n…. سليم وأعطتني بأيمانها سعد ويفهم منهما أن المزاحم هذا سعدى حالف سليما فعد منهم: والهجري ذكر أن صاحب الأبيات ثمامى من ثمامة بن كعب بن جذيمة بن خفاف. ومعروف أن خفافا بطن من سليم. أما معرفة عصر هذا الشاعر فتعلم من معاصرته لأبى وجزة السعدي الشاعر. وأبو وجزة هذا تابعي، أي من الشعراء الإسلاميين. والهجري الذي روى أبيات الرسالة من أهل القرن الثاني والثالث الهجريين». \n1. صدره عند البكري: «إن بأجزاع»، وفي الأصل: «فولد» تحريف صوابه في ياقوت في موضعيه. وروى البكري «نوكز» و «فرقد». و «النقعاء» رواية الأصل وياقوت في رسم (وبعان)، وهو موضع خلف المدينة، وعند البكري 1052 «البقعاء» بالباء، وهو من أرض ركبة. وعنده في 450 «النقعين».",
    "book_id": "992",
    "new_page_number": 33
  },
  {
    "serial_number": "6266325",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 407,
    "volume_number": 1,
    "text": "جواريَ من حيَّ عداء كأنَّها … مها الرَّمل ذي الأزواج غير عوانِ (1) جننَّ جنوناً من بعولٍ كأنَّها … قرودٌ، تباري في رياطِ يمانِ (2) ثم يتصل [بخلص آرة (3) ] (ذره (4) )، وهي جبال كثيرة متصلة ضعاضع (5) ليست بشوامخ، في ذراها (6) المزارع والقرى؛ وهي لبنى الحارث ابن بهثة بن سليم، وزروعها أعذاء. ويسمون الأعذاء العثرى: وهو الذي لا يسقى. وفيها مدر وأكثرها عمود، ولهم عيون [ماء (7) ] في صخور لا يمكنهم أن يجروها (8) إلى حيث ينتفعون به (9) . ولهم من الشجر العفار، والقرظ، والطلح، والسدر بها كثير، والنشم، والتّألب (10) .",
    "foot_note": "1. عداء تكون مصدرا كالمعاداة، ووصف به هذا الحي، وتكون ممدود «العدى» بمعنى الأعداء، مدها للشعر. وعند البكري 1052: «حي عداء»، تثنية الحي. وعند ياقوت في (وبعان): «حسنى غذاء» تحريف. ووصف الرمل بأنه ذو أزواج، يعنى أزواج الوحش من البقر والظباء ونحوها. والعوانى: جمع عان وعانية، وهو الأسير. \n2. كلمة «تبارى» غير معجمة في الأصل مع وضوح حروفها، وقراءتها من ياقوت (وبعان). وفي ياقوت (خلص): «تنادى». \n3. التكملة من ياقوت (ذرة) عن عرام. ولم يثبتها العلامة الميمنى. \n4. بفتح أوله وتخفيف ثانيه، كما عند ياقوت. ورسم لها البكري «ذروة» بفتح أوله وسكون ثانيه مع زيادة الواو، ونقل فيها نص السكوني. \n5. سبق تفسيرها في ص 398. \n6. سبق تفسير «الذرى» في ص 397. وفي الأصل وكذا نسخة الميمنى: «دوراها» بدل «في ذراها»، صوابه في ياقوت. \n7. التكملة من ياقوت والبكري. \n8. وكذا عند ياقوت. وعند البكري: «إجراؤها». \n9. سقطت هذه الكلمة من نشرتنا الأولى. \n10. تذكر في المعاجم في (ألب) و (تألب). قال ابن سيده: والتألب من عتق العيدان التي تتخذ منها القسي، ومنابته جبال اليمن، وله عناقيد كعناقيد البطم، فإذا أدرك وجف اعتصر للمصابيح، وهو أجود لها من الزيت. وتقع السرفة في التألبة فتعريها من ورقها. المخصص (11: 142).",
    "book_id": "992",
    "new_page_number": 34
  },
  {
    "serial_number": "6266326",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 408,
    "volume_number": 1,
    "text": "وقد يعمل من النّشم القسىّ والسهام؛ وهو خيطان لا ورق له (1) . والإثرار (2) له ورق يشبه ورق الصعتر وشوك نحو شوك الرمان، ويقدح ناره (3) إذا كان يابساً فيقتدح سريعاً. والعفار ورده بيض طيبة الريح كأنها السّوسن (4) . ويطيف بذرة قرية من القرى يقال لها (جبلة) في غربيه (5) ، و (السّتارة) قرية تتصل بجبلة، وواديهما واحد يقال له (لحف (6) ) وبه عيون. ويزعمون أن جبلة أول قرية اتّخذت بتهامة. وبجيلة حصون منكرة مبنية بالصخر لا يرومها أحد. ومن شرقي ذرة قرية يقال لها (القعر) وقرية يقال لها (الشرع (7) ) وهما شرقيتان، في كل واحدة من هذه القرى مزارع ونخيل على عيون. وهما على واد يقال له (رخيم)، وبأسفله قرية يقال لها (ضرعاء) بها قصور (8) ومنبر وحصون،",
    "foot_note": "1. لم يزد ابن سيده في المخصص (11: 142) في تحلية النشم على أنه من عتق العيدان. وفي اللسان: شجر جبلى تتخذ منه القسي، وهو من عتق العيدان. و (خيطان) هنا جمع خوط، بالضم لا خيط بالفتح. والخوط: الغصن الناعم. وأنشد في اللسان (خوط): ألا حبذا صوت الغضى حين أحرست \n…. بخيطانه بعد المنام جنوب وظنها العلامة الميمنى خطأ فجعلها «عيدان» بدل «خيطان»، وهو سهو منه. \n2. بكسر الهمزة كما في القاموس واللسان. وفي القاموس أنه يسمى (الأنبرباريس) وفي اللسان أنه يسمى بالفارسية (الزريك) صوابه (زرشك) كما في تذكرة داود في رسم (أمباريس) ومعجم استينجاس 615. \n3. الكلمة مهملة في الأصل. وقد قرأها الميمنى «تارة» وليست كذلك. \n4. قال داود: هو باليونانية «إيرسا»، معناه قوس قزح، لاختلاف ألوانه في الزهر. \n5. في غربيه، سقطت من نشرة الميمنى. \n6. بفتح اللام كما نص ياقوت في رسمها. \n7. قال ياقوت؛ مأخوذ من شرع الإهاب، إذا شق ولم يزقق ولم يرجل. وهو أوسع ضروب السلخ. \n8. في الأصل: «قرية بها لها صرعا يضور»، وصوابه في ياقوت برسم «ضرعاء».",
    "book_id": "992",
    "new_page_number": 35
  },
  {
    "serial_number": "6266327",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 409,
    "volume_number": 1,
    "text": "يشرك بني الحارث فيها هذيل (1) وغاضرة بن صعصعة (2) . ثم يتصل [بها] (شمنصير)، وهو جبل ململم (3) لم يعله أحد قط، ولا درى ما على ذروته؛ بأعلاه القرود، ويقال: إن أكثر نباته النبع والشوحط والمياه حواليه ينابيع (4) عليها النخيل والحماط (5) . وفي كل جبال تهامة الشقاح (6) نبت في حردها (7) وأسافلها - والحرود (8) : الجنوب. والحماط: التين. والشقاح: الريباس (9) . ويطيف بشمنصير من القرى قرية كبيرة يقال لها (رهاط (10) )، وهي بواد يسمّى (غران (11) ) وأنشد:",
    "foot_note": "1. ياقوت: «يشترك بين الحارث فيها هذيل»، وهذا تحريف. وبنو الحارث هؤلاء هم بنو الحارث بن بهثة بن سليم، كما سبق في ص 407. \n2. غاضرة: حي من بنى غالب بن صعصعة بن معاوية بن بكر بن هوازن. تاج العروس 3: 450. وقد وقعت في نشرتى الأولى «عامر بن صعصعة» خطأ في القراءة. وهي على الصواب في نشرة الميمنى. \n3. الململم: المستدير المجموع بعضه إلى بعض. \n4. والمياه حوله ينابيع، سقطت من نشرة الميمنى. \n5. الحماط: شجر التين الجبلي. وفي الأصل «الحماض» هنا وفي الموضع التالي. والصواب ما أثبت. \n6. في الأصل هنا وفيما سيأتي «الشقح» تحريف. وقد فسره فيما بعد بأنه «الريباس». والشقاح، كرمان: نبت الكبر، كما في اللسان. وفي المعتمد لابن رسولا الغساني 282: «والكبر الذي يكون في البلد الكثير الحرارة بمنزلة الكبر الذي يكون في تهامة». والريباس كلمة فارسية، قال استينجاس في معجمه 601 في تفسيرها:  ASourherb  أي عشب حريف. وهو منطبق على الكبر والشقاح. \n7. الحرود: حروف الجبل. كما في القاموس (حرد). وفي الأصل هنا: «حروزها» وفيما يأتي «الحرور»، صوابه ما أثبت. \n8. وأسافلها والحرود الجنوب، سقطت جميعها من نسخة الميمنى. \n9. انظر الحاشية رقم 6. \n10. بضم الراء، قال ابن الكلبي: «اتخذت هذيل سواعا ربا برهاط». \n11. عند البكري في (شمنصير): «غراب»، تحريف. وقال في (غران): «فعال من الغرين، والغرين والغريل هو الطين ينضب عنه الماء فيجف في أسفل الغدير».",
    "book_id": "992",
    "new_page_number": 36
  },
  {
    "serial_number": "6266328",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 410,
    "volume_number": 1,
    "text": "فإن غراناً بطنُ وادٍ أحبُّه … لساكنهِ عهدٌ عليّ وثيق (1) وبغربيه قرية يقال لها (الحديبية (2) ) ليست بالكبيرة، وبحذائها جبيل يقال له (ضعاضع) وعنده حبس كبير يجتمع عنده الماء. والحبس: حجارة مجتمعة يوضع بعضها على بعض. قال الشاعر: وإنّ التفاتى نحو حبس (ضعاضع) … وإقبالَ عيني في الظُّبا لطويلُ (3) فهؤلاء القريات لسعد وبني مسروح، وهم الذين نشأ رسول الله صلى الله عليه وسلم فيهم، ولهذيل فيها شيء، ولفهم أيضاً. ومياههم بثور، وهي أحساء وعيون ليست بآبار (4) . ومن الحديبية إلى المدينة تسع مراحل، وإلى مكة مرحلة وميل أو ميلان. ومن عن يمين آرة الطريق للمصعد (الحشا (5) )، وهو جبل (الأبواء)، وهو بواد يقال له (البعق) واد بكنفته (6) اليسرى [واد] يقال له (7) (شسّ) وهو بلد مهيمة موبأة (8) ، لا تكون بها الإبل، يأخذها الهيام عن نقوع بها",
    "foot_note": "1. أحبه، هو ما في البكري. وفي الأصل: «حبه» مع الإهمال. وعند ياقوت «جنة». و «عهد» هي في ياقوت والبكري: «عقد». \n2. بتخفيف الياء وتشديدها. سميت بشجرة حدباء كانت في ذلك الموضع. وفي الحديث أنها بئر. وبعض الحديبية في الحل وبعضها في الحرم. \n3. ياقوت: «عيني الظبا» بتثنية العين. والظبا: واد بتهامة. وفي الأصل: «عيني في الصبى»، وعند البكري: «عيني الصبا»، كلاهما محرف. \n4. في الأصل: «ليست بها» صوابه من البكري 810. وانظر ما سيأتي من الكلام على البثور قبل الكلام على «حد الحجاز». \n5. البكري: «والحشا لخزاعة وضمرة». \n6. الكنف والكنفة: ناحية الشئ. وقال الشيخ حمد: «ولكنها في الأصل كما علمت من النسختين المقابلتين عليه: بكفته». وأؤكد للشيخ أن هذا علم خاطئ، وأن بين الكاف والفاء في الأصل نونا ظاهرة معجمة. \n7. في الأصل: «وله»، والتكملة التي أثبتها قبل من البكري 449 تقتضى ما أثبت. \n8. موباة، بفتح الميم: أراد كثيرة الوباء، ولم ينص على هذه الصيغة في المعاجم، وفي الأصل: «بوباه»، والوجه ما أثبت من ياقوت في (شمس).",
    "book_id": "992",
    "new_page_number": 37
  },
  {
    "serial_number": "6266329",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 411,
    "volume_number": 1,
    "text": "ساكرة لا تجرى (1) - والهيام: حمى الإبل - وهو جبل مرتفع شامخ ليس به شيء من نبات الأرض غير الخزم والبشام. وهو لخزاعة وضمرة. وقال الشاعر (2) في البعق: كأنَّكّ مردوعٌ بشسًّ مطرَّدٌ … يقارفهُ من عقدة البعقِ هيمها (3) و (الأبواء) منه على نصف ميل. ثم (هرشى) وهو في أرض مستوية، وهي هضبة ململمة لا تنبت شيئاً. أسفل منها (ودان) على ميلين مما يلي مغيب الشمس، يقطعها المصعدون من حجاج المدينة وينصبّون منها منصرفين إلى مكة (4) . ويتّصل بها مما يلي مغيب الشّمس من عن يمينها بينها وبين البحر خبت - والخبت: الرمل الذي لا ينبت غير الأرطي، وهو حطب، وقد يدبغ [به] أسقية اللبن خاصة - وفيها متوسطاً للخبت جبيل أسود شديد السواد يقال له (طفيل). ثم ينقطع عنك (5) الجبال من عن يمنة ويسرة. وعلى الطريق من ثنية هرشي بينها وبين الحجفة ثلاثة أودية مسمّيات:",
    "foot_note": "1. ساكرة بالراء، بمعنى ساكنة، وفي اللسان: «أبو زيد، الساكر: الذي لا يجرى، وسكر سكورا، وسكر البحر: ركد. أنشد ابن الأعرابي في صفة بحر: • يقيئ زعب الحر حين يسكر \n…. وعند البكري 449 وياقوت (5: 262): «ساكنة». \n2. هو كثير، كما عند البكري 796 وياقوت في (شس). ورواه البكري أيضا في 449. وأنشده ياقوت في (شس، بعق). وقبله: وقال خليلي يوم رحنا وفتحت \n…. من الصدر أشراج وفضت ختومها أصابتك نبل الحاجبية إنها \n…. إذا ما رمت لا يستبل كليمها \n3. المردوع: المنكوس في مرضه. يقارفه: يدانيه. والعقدة: الموضع الشجير. \n4. في الأصل: «من مكة»، صوابه في ياقوت (هرشى). \n5. في الأصل: «عند».",
    "book_id": "992",
    "new_page_number": 38
  },
  {
    "serial_number": "6266330",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 412,
    "volume_number": 1,
    "text": "منها (غزال (1) ) وهو واد يأتيك من ناحية شمنصير وذرة. وفيها ماء آبار، وهو لخزاعة خاصة، وهم سكانه أهل عمود. و (دوران (2) ) وهو واد يأتيك أيضاً من شمنصير وذرة، [وبه] بئران معلومتان يقال لإحداهما (رحبة (3) ) والأخرى (سكوبة) وهو لخزاعة أيضاً. والثالث (كلية (4) ) وهو واد يأتيك أيضاً من شمنصير وذرة. وكل هذه الأودية تنبت الأراك والمرخ والدوم - وهو المقل - والنخل. وليس هناك جبال. وبكليّة على ظهر الطريق ماء آبار، يقال للآبار كلية، وبهن يسمى الوادي. وبأعلى كلية هذا أجبال ثلاثة صغار منفردات من الجبال يقال لهنّ (شنائك (5) )، وهي لخزاعة.",
    "foot_note": "1. وفيه قول كثير، وأنشده ياقوت: قلن عسفان ثم رحن سراعا \n…. طالعات عشية من غزال \n2. في الأصل: «دوران» صوابه في ياقوت. وأنشد لكثير: نادتك والعيس سراع بنا \n…. مهبط ذي دوران فالقاع يقال فيه أيضا «ذو دوران» كما في هذا الشعر، وكما عند البكري 1352. وكلمة «ذو» تزاد كثيرا في أسماء البلدان، كما قالوا: ذو أثيل، وذو جسم، وذو العرجا، وذات العلندى، وذات الإصاد. \n3. وكذا عند ياقوت في (دوران). \n4. بالتصغير، وكانت مسكن نصيب، وفيها يقول: خليلي إن حلت كلية فالربا \n…. فذا أمج فالشعب ذا الماء والحمض \n5. وكذا عند ياقوت في رسمه، قال: «كأنه جمع شنوكة بما حوله. قال نضر: شنائك: ثلاثة أجبل صغار منفردات من الجبال بين قديد والجحفة من ديار خزاعة. وقيل شنوكتان شعبتان يدفعان في الروحاء بين مكة والمدينة». وفي صفة جزيرة العرب 181: «وشنوكتان يدفعان في الروحاء». وقال ياقوت في رسم (شنوكة): «شوكة: جبل، وهو علم مرتجل». وأنشد لكثير: كذين صفاء الود يوم شنوكة \n…. وأدركني من عهدهن رهون وجعلها البكري «سنابك» ورسمها وفي رسم (هرشى)، وقال: «سنابك على لفظ جمع سنبك: جبيلات مجتمعة، مذكور في رسم هرشى».",
    "book_id": "992",
    "new_page_number": 39
  },
  {
    "serial_number": "6266331",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 413,
    "volume_number": 1,
    "text": "ودون الجحفة على ميل (غدير خمّ (1) )، وواديه يصب في البحر، لا ينبت غير المرخ والثّمام والأراك والعشر. وغدير خمّ هذا من نحو مطلع الشمس لا يفارقه ماء أبداً من ماء المطر، وبه أناس من خزاعة وكنانة غير كثير. ثم (الشراة (2) )، وهو جبل مرتفع شامخ في السماء تأويه القرود، وينبت النبع والشوحط والقرظ، وهو لبني ليث خاصة، ولبني ظفر من بني سليم وهو من دون عسفان من عن يسارها، وفيه عقبة تذهب إلى ناحية الحجاز لمن سلك عسفان، يقال لها (الخريطة) مصعدة مرتفعة جداً. والخريطة التي تلي الشراة جبل جلد [صلد (3) ] لا ينبت شيئاً. ثم بطلع من الشّراة على (ساية) وهو واد بين حاميتين (4) وهما حرتان سوداوان، وبه قرى كثيرة مسمّاة، وطرق كثيرة من نواح كثيرة. فأعلاها قرية يقال لها (الفارع) بها نخل كثير، وسكانها من كل أفناء الناس (5) ، ومياهها عيون تجري تحت الأرض، فقر كلها. والفقر والقنا (6) واحد، وواحد الفقر فقير.",
    "foot_note": "1. ذكر البكري أن الذي احتفره «عبد شمس» كما احتفر أيضا «زما». وفيهما يقول: حفرت خما وحفرت زما \n…. حتى ترى المجد لنا قد تما وقال الفاكهي في كتاب مكة: «وكان الناس يأتون خما في الجاهلية والإسلام في الدهر الأول، يتنزهون به ويكونون فيه». وعنده خطب رسول اللّه صلى الله عليه وسلم وقال في علي عليه السلام: «من كنت مولاه فعلى مولاه»، شروح سقط الزند 389. \n2. بفتح الشين المعجمة وآخره هاء، كما في الأصل وياقوت. وعند البكري: «شراء» وقال: «ممدود لا يجرى لأنه اسم أرض. هكذا قول أبى عبيدة. وقال الأصمعي مكسور الآخر مثل حذام وقطام». \n3. التكملة من البكري. والجلد بالتحريك: الصلب. والصلد بالفتح: الذي لا ينبت. \n4. في اللسان: «الحوامى: عظام الحجارة وثقالها، والواحدة حامية». \n5. أفناء الناس: أخلاطهم، جمع فنو بالكسر، ويوزن فتى. \n6. جمع قناة التي تحفر للماء، وتجمع أيضا على قنى، فعول.",
    "book_id": "992",
    "new_page_number": 40
  },
  {
    "serial_number": "6266332",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 414,
    "volume_number": 1,
    "text": "ثم أسفل منها (مهايع (1) )، وهي قرية كبيرة غناء. بها ناس كثير، وبها منبر، ووالي ساية (2) من قبل صاحب المدينة، وفيها نخل ومزارع وموز ورمان وعنب. وأصلها لولد على بن أبي طالب رضي الله عنه، وفيها من أفناء الناس، وتجار من كل بلد. ثم خيف يقال له (خيف سلام (3) ) والخيف: ما كان مجنباً عن طريق الماء يميناً وشمالاً متسعاً، وفيه منبر وناس كثير من خزاعة. ومياهها فقر أيضاً، وباديتها قليلة، وهي جشم وخزاعة وهذيل. وسلام (4) هذا رجل من أغنياء هذا البلد من الأنصار. وأسفل من ذلك (خيف ذي القبر)، وليس به منبر وإن كان آهلا، وبه نخل كثير وموز ورمان، وسكانه بنو مسروح وسعد وكنانة (5) ، وتجار ألفاق (6) ، وماؤه فقر وعيون تخرج من ضفّتى الوادي كلتيهما. وبقبر احمد بن الرضا (7) سمي",
    "foot_note": "1. قال ياقوت: «كأنه جمع مهيع، وهو الطريق الواسع. \n2. قرية غناء: جمة الأهل والبليان والعشب. \n3. قرأتها في النشرة الأولى: «ووال ينتابه» وهو خطأ نبه على صوابه الشيخ حمد مطابقا لقراءة الميمنى في نسخته. \n4. ويقال أيضا بتخفيف اللام في قول، ذكره ياقوت في رسم (لوية). \n5. سقطت الواو قبل «كنانة» في نشرة الميمنى، والصواب إثباتها كما في الأصل. \n6. أي مختلفون، جمع لفق بالكسر، وأصله أحد لفقى الملاءة، وهما شقتاها. ورسمت الكلمة مهملة الحرف الأخير في الأصل مع ميل به إلى التقعير. \n7. الرضا: لقب علي بن موسى بن جعفر بن محمد بن علي بن الحسين بن علي بن أبي طالب الهاشمي، أبو الحسن. روى عنه ابنه محمد، وأبو عثمان المازني النحوي، والمأمون بن الرشيد وغيرهم، استشهد بطوس سنة 203. تهذيب التهذيب. وذكر ابن قتيبة في المعارف 169 أن المأمون بعث إلى علي بن موسى الرضا فحمله إلى خراسان فبايع له بولاية العهد بعده، وأمر الناس بلباس الخضرة. وذكر محمد بن علي بن حمزة العلوي أنه ليس للرضا من ولد من ذكر أو أنثى إلا محمد بن علي بن موسى، وقبره ببغداد بمقابر قريش. فيكون ما ذكره عرام هنا خطأ. البكري 787. وانظر ترجمة (محمد بن الرضا) في تاريخ بغداد 997.",
    "book_id": "992",
    "new_page_number": 41
  },
  {
    "serial_number": "6266333",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 415,
    "volume_number": 1,
    "text": "(خيف ذي القبر)، وهو مشهور به وأسفل منه (خيف النعم (1) ) به منبر، وأهله غاضرة وخزاعة وتجار بعد ذلك وناس. وبه نخيل ومزارع، وهو إلى والي عسفان، ومياهه عيون خرارة كثيرة. ثم (عسفان)، وهو على ظهر الطريق لخزاعة خاصة، بها منبر ونخيل ومزارع كثيرة. ثم [إن فصلت من عسفان لقيت (2) ] البحر، وتذهب عنك الجبال والقرى، إلا أودية مسماة بينك وبين مر الظهران، يقال لواد منها مسيحة (3) وواد يقال له (مدركة (4) ) وهما واديان كبيران بهما مياه كثيرة ونخيل، منها ماء يقال له (الحديبية) بأسفله، يصبان من رؤوس الحرة مستطيلين إلى البحر. ثم (مر الظهران (5) ). ومر هي القرية، والظهران الوادي، وفيه عيون كثيرة ونخيل وجميز، وهي لأسلم، وهذيل، وغاضرة. ثم تخرج منه في (بحرين (6) )، ثم تؤم مكة منحدراً من ثنية يقال لها",
    "foot_note": "1. وكذا عند ياقوت والقاموس (خيف). وعند البكري 787 «خيف النعمان». \n2. التكملة من ياقوت في رسم (مسيحة، المدركة). \n3. رسم لها ياقوت، وأما البكري فقد ذكرها عرضا في 226، 1025. وضبطت خطأ في الموضع الأخير. وأنشد البكري وياقوت لأبى جندب الهذلي: إلى أي نساق وقد بلغنا \n…. ظماء من مسيحة ماء بثر \n4. في الأصل «يقال أمدركه» تحريف. وقد رسم ياقوت للمدركة وضبطها بضم الميم وفتح الراء. ولم تذكر عند البكري لا رسما ولا عرضا. \n5. وذكر ياقوت أنه يقال «مر الظهران» وقال كثير عزة: سميت مرا لمرارتها. وقال أبو غسان: سميت بذلك لأن في بطن الوادي بين مر ونخلة كتابا بعرق من الأرض أبيض هجاء (مر) إلا أن الميم غير موصولة بالراء. البكري وياقوت. قال البكري: وببطن مر تخزعت خزاعة عن إخوتها، فبقيت بمكة وصارت إخوتها إلى الشام أيام سيل العرم، قال حسان: فلما هبطنا بطن مر تخزعت \n…. خزاعة عنا في الحلول الكراكر والبيت نسبه ياقوت إلى عون بن أيوب الأنصاري. \n6. كذا وردت مهملة بهذا الرسم. وقرأها الميمنى «طريق» وخط الأصل لا يسمح بذلك:",
    "book_id": "992",
    "new_page_number": 42
  },
  {
    "serial_number": "6266334",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 416,
    "volume_number": 1,
    "text": "(الجفجف (1) ) وبنجد في حد مكة وادٍ (2) يقال له (وادي تربة (3) ) ينصب إلى (بستان ابن عامر (4) ) واسفل تربة لبني هلال. وحواليه من الجبال (الشراة (5) ) و (يسوم) و (قرقد (6) ) و (معدن البرام (7) ) وجبلان يقال لهما (شوانان (8) )",
    "foot_note": "1. بفتح الجيمين. قال ياقوت: «وهو في اللغة القاع المستدبر الواسع». \n2. ياقوت: «وتنحدر في حد مكة في واد». وكنت آثرت عبارة ياقوت في نشرتى الأولى. وقال الشيخ حمد تعليقا على عبارة ياقوت: ولكننا حينما نعلم ببعد وادى تربة عن مكة نستطيع أن ندرك الخلل هنا». \n3. بضم ففتح، ومثلها في أسماء البلدان «عرنة» بمكة. \n4. قال الأصمعي وأبو عبيدة وغيرهما: بستان ابن عامر إنما هو لعمر بن عبيد اللّه بن معمر بن عثمان بن عمرو بن كعب بن سعد بن تيم بن مرة بن كعب بن لؤي بن غالب، ولكن الناس غلطوا فقالوا بستان ابن عامر وبستان بنى عامر، وإنما هو بستان ابن معمر. وقوم يقولون: نسب إلى حضرمي بن عامر، وآخرون يقولون: نسب إلى عبد اللّه بن عامر بن كريز. وكل ذلك ظن وترجيم: وقال البطليوسى في الاقتضاب: بستان ابن معمر غير بستان ابن عامر، فأما بستان ابن معمر فهو الذي يعرف ببطن نخلة، وابن معمر هو عمر بن عبيد اللّه بن معمر التيمي. وأما بستان ابن عامر فهو موضع آخر قريب من الجحفة، وابن عامر هذا هو عبيد اللّه بن عامر بن كريز. عن ياقوت. \n5. ياقوت: الحجاز جبال تحجز بين تهامة ونجد، يقال لأعلاها السراة كما يقال لظهر الدابة السراة. والسراة: جبال تمتد من اليمن حتى أطراف بوادي الشام. \n6. وجدت تعليقا للشيخ حمد بخطه على نسخة الأستاذ رشاد عبد المطلب من نشرة الميمنى هذا نصه: قرقد جبل تدعه وأنت متوجه إلى الطائف بعد أن تجوز قرية الزيمة على يسارك، ويسميه أهل تلك الجهة قردد، تحريفا». \n7. وكذا في صفة جزيرة العرب 121 ومعجم البلدان (7: 35، 56) وعند ياقوت (في رسم معدن البرم) والزمخشري في كتاب الجبال 155 «البرم» بوزن قفل. وأنشد ياقوت للقحيف: لقد نزلت في معدن البركة نزلة \n…. فلأيا بلأى من أضاخ استقلت وأنشد في اللسان لأبى صخر الهذلي: ولو أن ما حملت حمله \n…. شعفات رضوى أو ذرى برم وقال الزمخشري: «وضاخ سوق بها بناء وجماعة ناس لبنى عميلة، وهي معدن البرم». و «وضاخ» التي ذكرها الزمخشري لغة في «أضاح». انظر الزمخشري 5 ومعجم البلدان (أضاخ). وسيأتي قبل الكلام على (الطائف) بلفظ «البرم». \n8. ذكره البكري في رسم (السين المهملة)، 765 وعرضا بالسين المهملة أيضا في 788. وذكره الزمخشري 88 في السين المهملة، أما ياقوت فقد ذكره في الشين المعجمة مرة، وأخرى في السين المهملة، واستظهر أن يكون تصحيفا. وعند الهمداني 172 «شوان» بالمعجمة.",
    "book_id": "992",
    "new_page_number": 43
  },
  {
    "serial_number": "6266335",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 417,
    "volume_number": 1,
    "text": "وأحدهما شوان. وهذه الجبال كلّها لغامد، ولخثعم ولسلول، ولسواءة بن عامر، ولعنزة. وكل هذه الجبال تنبت القرظ، وهي جبال متقاودة بينها فتوق. وقال الشاعر يصف غيثاً: أنجدَ غوريٌّ وحنَّ متهمهُ واستنَّ بينَ ريقَّيهِ حنتمه (1) وقلت أطراف السَّراة مطعمهُ وفي جبال السراة الأعناب، وقصب السكر، والقرظ، والإسحل وفي كلّ هذه الجبال نبات وشجر من الغرب والبشام، إلا يسوم وقرقد، فإنهما لا ينبتان غير النّبع والشّوحط، ولا يكاد أحد يرتقيهما إلا بعد جهد، وإليهما تأوى القرود، وإفسادها على أصحاب قصب السكر (2) كثير. وفي هذه الجبال أوشال عذاب وعيون، غير قرقد ويسوم فليس فيها إلا ما يجتمع في القلات (3) من مياه الأمطار، بحيث لا ينال ولا يعرف مكانه. وقال الشاعر في يسوم وقرقد: سمعتُ وأصحابي تحثُّ ركابهم … بنا بين ركنٍ من يسومَ وقرقد (4) فقلت لأصحابي قفوا لا أبا لكم … صدورَ المطايا إنَّ ذا صوتُ معبدِ (5) والطريق من بستان ابن عامر إلى مكة على (قفل). وقفل: الثنية التي",
    "foot_note": "1. استن: مضى مسرعا. والريق: أول الشيء. وريق المطر: أول شؤبوبه. والختم: سحاب. وفي الأصل: «عنتمة» صوابه في ياقوت (السراة). \n2. ياقوت: «قصب السكر الذي ينبت في جبال السراة». \n3. القلات: جمع قلت بالفتح؛ وهي كالنقرة في الجبل يستنقع فيها الماء. \n4. البكري 788: «تخب ركابهم .. من يسوم وبدبد». \n5. ياقوت في رسم (قرقد): «إنه صوت معبد».",
    "book_id": "992",
    "new_page_number": 44
  },
  {
    "serial_number": "6266336",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 418,
    "volume_number": 1,
    "text": "تطلعك على (قرن المنازل) حيال الطائف، تلهزك (1) من عن يسارك وأنت تؤمّ مكة، متقاودة، وهي جبال حمر شوامخ، أكثر نباتها القرظ. ومن جبال مكة (أبو قبيس (2) ). ومنها (الصفا) و (الجبل الأحمر (3) ) وجبل أسود مرتفع يقال له (الهيلاء) يقطع منه الحجارة للبناء والأرحاء. و (المروة) جبل إلى الحمرة ما هو (4) . و (ثبير (5) ) جبل شامخ، يقابله (حراء) وهو جبل شامخ أرفع من ثبير، في أعلاه قلة شاهقة زلوج (6) . وذكروا أن رسول الله صلى الله عليه وسلم ارتقى ذروته ومعه نفر من الصحابة فتحرك فقال له رسول الله صلى الله عليه وسلم: «أسكن حراء فما عليك إلا نبيٌ أو صديق أو شهيد (7) ». [وليس بهما نبات ولا في جميع جبال مكة إلا شيء يسير من",
    "foot_note": "1. أصل اللهز الدفع والضرب. واللاهز: الجبل يلهز الطريق ويضربه، وكذلك الأكمة تضرب الطريق. \n2. ساق ياقوت في (1: 94) أقوالا كثيرة في علة تسميته. \n3. ذكره ياقوت في رسم (الأحمر). \n4. هذا تعبير نادر، و «ما» فيه زائدة، أي «إلى الحمرة هو». ومثله ما ورد في مشارق الأنوار للقاضي عياض ج 1 ص 324 من قوله في حديث تميم الداري عن الدجال. «لا، بل من قبل المشرق ما هو» قال: «ماهنا صلة وليست بنافية، أي من قبل المشرق هو». \n5. وفي مكة أثبرة أخرى، ثبير الزنج كانوا يلعبون عنده، وثبير الخضراء، وثبير النصع وهو جبل المزدلفة، وثبير الأحدب. عن ياقوت. \n6. الزلوج: الملساء يزلج من يرتقيها. \n7. انظر معجم البلدان (حراء). وفي معجم البكري 432: «أثبت حراء فإنما عليك نبي أو صديق أو شهيد». والذي في صحيح البخاري في فضائل أصحاب النبي صلى الله عليه وسلم، عن أنس بن مالك رضى اللّه عنه أن النبي صلى الله عليه وسلم صعد أحدا وأبو بكر وعثمان وعمر، فرجف بهم فقال: أثبت أحد، فإنما عليك نبي وصديق وشهيدان». وجاء في فتح الباري (7: 33) تعليقا عليه: «هو الجبل المعروف بالمدينة، ووقع في رواية لمسلم ولأبى يعلى من وجه آخر عن سعيد: حراء. والأول أصح. ولولا اتحاد المخرج لجوزت تعدد القصة، ثم ظهر لي أن الاختلاف فيه من سعيد؛ فإني وجدته في مسند الحارث بن أبي أسامة عن روح بن عبادة عن سعيد، فقال فيه: أحد أو حراء، بالشك. وقد أخرجه أحمد من حديث بريدة بلفظ: حراء، وإسناده صحيح، فقوى احتمال تعدد القصة. وتقدم في أواخر الوقف من حديث عثمان نحوه، وفيه حراء. وأخرج مسلم من حديث أبي هريرة -",
    "book_id": "992",
    "new_page_number": 45
  },
  {
    "serial_number": "6266337",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 419,
    "volume_number": 1,
    "text": "الضهياء يكون في الجبل الشامخ (1) ]، وليس في شيء منها ماء. ثم جبال (عرفات) تتصل بها جبال الطائف، وفيها مياه كثيرة أوشال، وكظائم فقر (2) ، منها (3) (المشاش) وهو الذي يخرج بعرفات ويتصل إلى مكة. [ومن قعيقعان إلى مكة (4) ] اثنا عشر ميلا على طريق الحرف (5) إلى اليمن. و (قعيقعان): قرية فيها مياه وزروع ونخيل وفواكه، وهي اليمانية (6) . وبين مكة والطائف قرية يقال [لها] (راسب) لخثعم، و (الجونة (7) ): قرية للأنصار، والمعدن (معدن البرم (8) )، وهي كثيرة النخيل والزرع، والمياه مياه آبار،",
    "foot_note": "1. - ما يؤيد تعدد القصة، فذكر أنه كان على حراء ومعه المذكورون هنا، وزاد معهم غيرهم. واللّه علم». \n1. التكملة من ياقوت في رسم (حراء). ولم يثبتها الميمنى. وانظر للضهياء ما سبق في ص 396. \n2. فقر: جمع فقير، وقد سبق تفسيره لعرام وقرأها الميمنى «يفر» محرفة، وفسرها بقوله «يزيد»، حسبها من، الوفر، وهما. \n3. في الأصل: «كضائم» تحريف. والكظائم: جمع كظامة بالكسر، وهي قناة في باطن الأرض يجرى فيها الماء. وقال الأصمعي: هي آبار متناسقة تحفر ويباعد ما بينها، ثم يخرق ما بين كل بئرين بقناة تؤدى الماء من الأولى إلى التي تليها تحت الأرض، فتجتمع مياهها جارية، ثم تخرج عند منتهاها فتسيح على وجه الأرض. والفقر سبق تفسيرها في ص 413. والنص محرف عند ياقوت في رسم (المشاش). \n4. التكملة من ياقوت في (قعيقعان). ولم يثبتها الميمنى. \n5. كذا. وعند ياقوت «الحوف» بالواو. \n6. وكذا في نقل ياقوت:، يعنى الفواكه اليمانية. \n7. كذا أثبتها ياقوت في رسمها وقال: «قرية بين مكة والطائف». ورسمت في الأصل «الجوية» معجمة الحروف، وقرأها الميمنى «الجوبة». قال الشيخ حمد: «وهي فيما أرى الحوية بالحاء المهملة المفتوحة فواو مكسورة فياء مثناة تحتية مشددة فتاء التأنيث: قرية من أشهر قرى الطائف لا تزال معروفة بهذا الاسم وإن لم يرد ذكرها في المعاجم القديمة كغيرها من كثير من مواضع بلاد العرب». لكن تقييد ياقوت لها، وكونها بين مكة والطائف لا في الطائف نفسها، يعارض ما توهمه الشيخ. \n8. سبق الكلام عليه في حواشي ص 416.",
    "book_id": "992",
    "new_page_number": 46
  },
  {
    "serial_number": "6266338",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 420,
    "volume_number": 1,
    "text": "يسقون زروعهم بالزرانيق (1) . و (الطائف (2) ) ذات مزارع ونخيل وموز وأعناب وسائر الفواكه، وبها مياه جارية وأودية تنصب منها إلى تبالة. وجل أهل الطائف ثقيف وحمير، وقومٌ من قريش، وغوث من اليمن (3) ، وهي من أمهات (4) القرى. و (مطار (5) ): قرية من قراها كثيرة الزّرع والموز. و (تبالة) أكبر منها،",
    "foot_note": "1. جمع زرنوق بالضم أو الفتح. والزرنوقان: حائطان يبنيان على رأس البئر من جانبيها فتوضع عليهما النعامة، وهي خشبة تعرض عليهما ثم تعلق فيها البكرة يجرى فيها حبل الدلو فيستقى به. وقد زرنق زرنقة، أي سقى بالزرنوق .. ويقال أيضا في الفعل منه «تزرنق». وفي حديث على: «لا أدع الحج ولو تزرنقت»، أي ولو خدمت زرانيق الآبار فسقيت لأجمع نفقة الحج. \n2. ذكر ياقوت تعليلات كثيرة لتسميتها. وقال البكري: وإنما سميت بالحائط الذي بنوا حولها وأطافوه بها تحصينا. وكان اسمها وج. قال أمية بن أبي الصلت: نحن بنينا طائفا حصينا \n…. يقارع الأبطال عن بنينا ومصيفها معروف من قديم الزمان، قال النميري في زينب بنت يوسف أخت الحجاج، يصف نعمتها: تشتو بمكة نعمة \n…. ومصيفها بالطائف \n3. «وغوث من اليمن» لم ترد فيما نقل ياقوت عن عرام (6: 11). وفي اليمن أغواث، أحدها غوث بن أنمار بن أراش بن عمرو بن لحيان بن عمرو بن مالك بن زيد ابن كهلان. والآخر غوث بن طيئ بن أدد بن زيد بن يشجب بن عريب بن زيد بن كهلان. وكذلك الغوث بن نبت بن مالك بن زيد بن كهلان. والغوث بن أدد بن زيد بن كهلان. نهاية الأرب (2: 296، 310) والمعارف 53 والصحاح والتاج واللسان (غوث). \n4. في الأصل (أميات) وإنما تجمع الأم، على (أمات) و (أمهات) ويغلب الجمع الأول في ما لا يعقل. لكن المعروف في مثل هذا التعبير (أمهات)، وقد سبق للمؤلف نفسه عند الكلام في (ودان) ص 405. \n5. البكري. «قال أبو حنيفة: أخبرني أبو إسحاق البكري أن بمطار أبد الدهر نخلا مرطبا ونخلا يصرم، ونخلا مبسرا ونخلا يلقح». وقد ضبطها هو وياقوت بضم الميم. وانظر الهمداني 121، 241.",
    "book_id": "992",
    "new_page_number": 47
  },
  {
    "serial_number": "6266339",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 421,
    "volume_number": 1,
    "text": "بينهما ليلتان. وبالطائف منبر، وبتبالة منبر. وأهلها سلول، وعقيل، وغامد، وعامر بن ربيعة، وقيس كبة (1) . وفي حد تبالة قرية يقال لها (رنية (2) )، وقرية يقال لها (بيشة (3) )، و (تثليث) و (يبمبم (4) ) و (العقيق، عقيق تمرة (5) ) وكلها لعقيل، مياهها بثور (6) . والبثر يشبه الأحساء يجري تحت الحصى على مقدار ذراع وذراعين ودون الذراع، وربما أثارته الدواب بحوافرها.",
    "foot_note": "1. قيس كبة: قبيلة من بجيلة، كما في اللسان (2: 192). وفي معجم ما استعجم 61: «وكانت قيس كبة - وكبة فرس له - ابن الغوث بن أنمار، في بنى جعفر بن كلاب» \n2. رسم لها ياقوت والبكري، وهي بفتح الراء، ثم عاد ياقوت ورسم لها في (زبية) بفتح الزاي المعجمة، وقال: «كذا هو مضبوط في كتاب عرام». \n3. وقد حذف الأحوص منها الهاء فقال: تحل بخاخ أو بنعف سويقة \n…. ورحلي ببيش أو تهامة أو نجد وهي غير المأسدة الق تضاف إليها السباع، فتلك بيشة السماوة التي يقول فيها مزرد: لأوفى بها شم كأن أباهم \n…. ببيشة ضرغام غليظ السواعد هذا ما ذكره البكري، أما ياقوت فجعل المأسدة بيشة تهامة لا بيشة السماوة. وكذا صنع الشيخ محمد بن بليهد في صحيح الأخبار (1: 176) وقال: «وفي هذا العهد يقيم بها قبيلتان، وهما بنو سلول وبنو معاوية، وهما فيها مدينتان، مدينة بنى سلول يقال لها الروشن، ومدينة بنى معاوية يقال لها نمران». \n4. ذكر هذا الموضع والموضعين قبله حميد بن ثور الهلالي في قوله: إذا شئت غنتنى بأجزاع بيشة \n…. أو النخل من تثليث أو من يبمبما \n5. يقال لكل مسيل ماء شقه السيل في الأرض فأنهره ووسعه: (عقيق). وفي بلاد العرب أعقة كثيرة، منها هذا العقيق، ومنها عقيق اليمامة، ومنها عقيق المدينة وهو مشهور، سمى بذلك لأنه عق عن حرتها أي قطع، ومنها العقيق الذي ببطن وادى ذي الحليفة، ومنها عقيق القنان، تجرى فيه سيول قلل نجد وجباله. وفي العراق عقيق البصرة. \n6. انظر ما سبق من الكلام على البثور في ص 410 س 7.",
    "book_id": "992",
    "new_page_number": 48
  },
  {
    "serial_number": "6266340",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 423,
    "volume_number": 1,
    "text": "حد الحجاز",
    "foot_note": "None",
    "book_id": "992",
    "new_page_number": 49
  },
  {
    "serial_number": "6266341",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 424,
    "volume_number": 1,
    "text": "حد الحجاز قال عرام: حد الحجاز من (معدن النقرة (1) ) إلى المدينة، فنصف المدينة حجازي ونصفها تهامي (2) . ومن القرى الحجازية (بطن نخل)، وبحذاء بطن نخل جبل يقال له (الأسود) نصفه نجدي ونصفه حجازي، وهو جبل شامخ، ولا ينبت غير الكلا (3) ، نحو الصليان (4) ، والغضور، والغرز (5) . ثم (الطرف (6) ) لمن أم المدينة، يكنفه ثلاثة جبال: أحدها (ظلم) وهو جبل أسود شامخ لا ينبت شيئاً، و (حزم بني عوال) وهما جميعاً لغطفان (7) . وفي عوال آبار منها (بئر آلية)، اسم آلية الشاة، و (بئر هرمة)",
    "foot_note": "1. ياقوت: النقرة، بفتح النون وسكون القاف، ورواه الأزهري بفتح النون وكسر القاف. وفي اللسان: «ابن الأعرابي: كل أرض متصوبة في هبطة فهي النقرة، ومنها سميت نقرة بطريق مكة، التي يقال لها معدن النقرة». قال ياقوت: وهذا هو المعتمد عليه في اسم هذه البقعة. \n2. وذكر ابن أبي شبة أن المدينة حجازية. وأما مكة فهي تهامية، والطائف حجازية. \n3. في الأصل: «غيرا كلا»، صوابه من ياقوت. وحذف لام التعريف يدور كثيرا في خط كاتب الأصل. \n4. بكسر الصاد وتشديد اللام المكسورة وتخفيف الياء. وفيه المثل: «جذها جذ العير الصليانة». انظر اللسان (صلل). \n5. هذه الكلمة لم يثبتها ياقوت عن عرام في رسم (الأسود). ورسم الغين في الأصل بشبه الخاء فلذا قرأتها في النشرة الأولى «الخرز» ثم وجدت الميمنى قد صححها: «الغرف». قال الشيخ حمد: صواب الكلمة الغرز بالغين لا بالخاء، وهي كذلك في الأصل. والغرز. نوع من النبات شبيه بالثمام موصوف في معاجم اللغة ومعروف في بلاد العرب. \n6. الطرف، بالتحريك كما ضبط ياقوت في رسمه. \n7. لم يذكر الجبل الثالث، وقد نبه على ذلك الأخ المحقق الشيخ سليمان الصنيع. قال: «والثالث اللعباء ذكره ياقوت في معجمه عن ابن موسى». انظر رسم (عوال) في معجم البلدان. وقال الشيخ حمد تعليقا على هذا الذي كتبته: «أقول: قد نبه على هذا السمهودي في وفاء الوفاء ج 2 ص 347 قبل الأستاذ الصنيع».",
    "book_id": "992",
    "new_page_number": 50
  },
  {
    "serial_number": "6266342",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 425,
    "volume_number": 1,
    "text": "و (بئر عمير)، و (بئر السدرة (1) ) وليس بهؤلاء ماء ينتفع به (2) . و (السد) ماء سماء أمر رسول الله صلى الله عليه وسلم بسده. ومنها (القرقرة (3) ) ماء سماء، لا تنقطع هذه المياه لكثرة ما يجتمع فيها، ومن السد قناة إلى (قبا). ويحيط بالمدينة من الجبال (عير): جبلان أحمران من عن يمينك وأنت ببطن العقيق (4) تريد مكة (5) : ومن عن يسارك (شوران (6) )، وهو جبل يطل على السد، كبير مرتفع. وفي قبلى المدينة جبل يقال [له] (الصّارى) واحد (7) ، ليس على هذه",
    "foot_note": "1. عند البكري 1326: «حفيرة السدرة». \n2. العبارة واضحة في الأصل مع إهمال الهمزة الأخيرة في «هؤلاء» و «ماء». وجعلها الميمنى: «وليس بها ما ينتفع [به]». \n3. في الأصل: «وهو القرقر»، وصوابه «القرقرة»، وهي التي يقال لها «قرقرة الكدر». \n4. هذا عقيق المدينة. \n5. قال ياقوت: «وذكر لي بعض أهل الحجاز أن بالمدينة جبلين يقال لهما: عير الوارد، والآخر عير الصادر، وهما متقاربان. وهذا موافق لقول عرام». \n6. شوران بفتح الشين. ومما ورد فيه من الأخبار أن (البغوم)، صاحبة ريحان الخضري، نذرت أن تمشى من شوران حتى تدخل من أبواب المسجد كلها مزمومة بزمام من ذهب، فقال بعض الشعراء: يا ليتني كنت فيهم يوم صبحهم \n…. من نقب شوران ذو قرطين مزموم تمشى على نجش تدمى أناملها \n…. وحولها القبطريات العياهيم فبات أهل نقيع الدار يفعمهم \n…. مسك ذكى ويمشى بينهم ريم \n7. أي ليس جبلين كما أن عيرا جبلان. قال ياقوت: «والصاري بلغة تجار المصريين هو شراع السفينة. قال الجوهري: الصاري الملاح». وقول ياقوت إنها لغة تجار المصريين و، فإن هذا المعنى يعرفه العرب قديما. وفي حديث ابن الزبير: «فأمر بصوار فنصبت حول الكعبة». وأنا أرى اشتقاقه من صرى يصرى، إذا علا. ويقولون: صرت الناقة عنقها، إذا رفعته من ثقل الوقر. وأنشد: • والعيس بين خاضع وصارى *",
    "book_id": "992",
    "new_page_number": 51
  },
  {
    "serial_number": "6266343",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 426,
    "volume_number": 1,
    "text": "نبت ولا ماء، غير شوران، فإن فيه مياه سماء كثيرة يقال لها البجرات (1) ، و «كرم (2) » و «عين» وأمعاوهم ما يكون السنن (3) وفي كلها سمك أسود مقدار الذراع وما دون ذلك، أطيب سمك يكون. وجبل حذاء شوران هذا يقال له (ميطان (4) ) به ماء بئر يقال لها (ضفة (5) ) وليس به شيء من النبات، وهو لسليم ومزينة. وبحذائه جبل يقال له (سن (6) ) وجبال شواهق كبار يقال لها (الحلاء (7) )، واحدها حلاءة (8)",
    "foot_note": "1. ياقوت: «بالتحريك وقيل: البجيرات بالتصغير». وهي عند البكري 906 (البحرات) بالحاء المهملة، وكذا في وفاء الوفاء 2: 331. \n2. انظر رسمه عند البكري. \n3. كذا وردت هذه العبارة في الأصل، ومن الواضح أن السياق سرد أسماء لعيون. وقد علق عليها الشيخ حمد تعليقا عجيبا، قال حفظه اللّه: «للأستاذ العذر في جهل بعض المواضع التي لم يسر فيها ولم يجد من النصوص ما يوضح مواقعها توضيحا تاما، ولكن ما عذره في جهل الكلمات اللغوية - وهو اللغوي الذي عاتى نشر بعض المعجمات اللغوية - ونعنى بالكلمات ما نجده متداولا في معجمات اللغة المطبوعة؟ في ص 55 - من النشرة الأولى - ما هذا نصه: (وامعاوهم ما يكون السنن) وعلق الأستاذ قائلا: كذا وردت هذه العبارة في الأصل. ولو رجع إلى كتب اللغة لوجد أن الأمعاء هي أمكنة تجتمع فيها المياه وتبقى مدة طويلة» (كذا. ولست أدرى أي المعاجم المطبوعة ورد فيها هذا النص الغريب الذي ساقه الشيخ). ثم قال الشيخ: «وإذن فالجملة هي (وأمعاء وهو ماء يكون السنين)!؟ وهكذا وردت هذه الجملة فيما نقله السمهودي في وفاء الوفاء ج 2 ص 331 عن عرام». وأترك التعليق على هذا التعليق للقارئ المنصف. \n4. ضبطه ياقوت بفتح الميم، والبكري بكسرها. وفيه يقول معن بن أوس المزنى: كأن لم يكن يا أم حقة قبل ذا \n…. بميطان مصطاف لنا ومرابع \n5. في الأصل: «ضعة»، صوابها من معجم البكري في رسمه وفي (ظلم) أيضا. \n6. وهذا يطابق ما في ياقوت من قوله في رسمه: «والسن أيضا: جبل بالمدينة قرب أحد». وقال أيضا في (الحلاءة): «وقال عرام: يقابل ميطان من جبال المدينة جبل يقال له السن». لكن عند البكري 819، 906 «شى»، بكسر الشين. \n7. بفتح الحاء وكسرها، كما ذكر ياقوت، وهي عند البكري 389، 906: «الجلاه» بكسر أوله على لفظ جمع جلهة). وقال الفيروزآبادي: «وبالكسر واحدة الحلاء، لجبال قرب ميطان تنحت منها الأرحية»، وضبط في اللسان بالفتح. \n8. أنشد الزمخشري في كتاب الجبال 50 لابن الرقاع: -",
    "book_id": "992",
    "new_page_number": 52
  },
  {
    "serial_number": "6266344",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 427,
    "volume_number": 1,
    "text": "لا تنبت شيئاً ولا ينتفع بها، إلا ما يقطع للأرحاء والبناء، ينقل إلى المدينة وما حواليها. ثمّ إلى (الرّحضية (1) ) قرية للأنصار وبني سليم، من نجد (2) ، وبها آبار عليها زروع كثيرة ونخيل. وحذاءها قرية أو أرض يقال لها (الحجر (3) )، وبها مياه عيون وآبار لبني سليم. وحذاءها جبيل ليس بالشامخ، يقال له (قنة الحجر (4) ). وهناك واد عال يقال له (ذو رولان (5) ) لبني سليم، به قرى كثيرة تنبت النخيل، منها (قلهي (6) ) وهي قرية كبيرة، و (تقتد (7) ) قرية أيضاً. وبينهما جبل يقال له (أديمة). وبأعلى هذا الوادي رياض تسمى (الفلاج) جامعة للناس أيام الربيع، وفيها مسك كثيرة (8) يكتفون به صيفهم وربيعهم إذا",
    "foot_note": "1. - كانت تحل ذا ما الغيث صبحها \n…. بطن الحلاءة فالأمرار فالسررا \n1. كذا ضبطها ياقوت. أما البكري فقد جعلها «الرحيضة» بهيئة مصغر (الرحضة). انظر 645، 874، 908. \n2. وكذا في ياقوت (القنة). البكري: «وهي من نجد». \n3. بكسر الحاء، لكن ضبطت عند البكري (الحجر) بالتحريك، وهو خطأ. \n4. فيها يقول الشاعر: ألا ليت شعري هل تغيّرَ بعدنا \n…. أروم فآرامٌ فشابةُ فالحضر وهل تركت أبليَ سوادَ جبالها \n…. وهل زالَ بعدي عن قنينته الحجر \n5. في الأصل: «دورلان» تحريف، وصوابه من ياقوت في رسمه والزمخشري 69. ويقال أيضا (ذو ورلان) بكسر الواو كما عند البكري 1378، 907. والورلان: جمع ورل، بالتحريك، وهو دابة على خلقة الضب إلا أنه أعظم منه. \n6. بفتح اللام، ياقوت والبكري 1093. قال البكري في اشتقاقه: قال الأصمعي: والعرب تقول: غدير قلهى، أي مملوء. \n7. بفتح التاء الثانية وضمها، كما ذكر ياقوت؛ والضم للزمخشري فيما نقل ياقوت عنه، والبكري 317. \n8. في الأصل: «مساك كثيرة»، تحريف صوابه من ياقوت في (تقتد)، وجاء في ياقوت (الفلاج): «مساك كبير» وهو إنما يريد الجمع، لأنه سيسرد فيما بعد أسماء غدران كثيرة، وقد سبق تفسير (المساك) في ص 397 س 7.",
    "book_id": "992",
    "new_page_number": 53
  },
  {
    "serial_number": "6266345",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 428,
    "volume_number": 1,
    "text": "أمطروا. وليس بها آبار ولا عيون. ومنها غدير يقال له (المختبي (1) ) لأنه بين عضاه وسدر وسلم وخلاف (2) ، وإنما يؤتى من طرفيه دون جنبيه، لأن له حرفاً لا يقدر عليه أحد (3) . ومنها قلت (4) يقال له (ذات القرنين) لأنه بين جبلين صغيرين، وإنما ينزع الماء منه نزعاً بالدلاء إذا انخفضت (5) قليلاً. ومنها غدير يقال له (غدير السدرة) من أنقاها ماء، وليس حواليه شجر. ثم تمضي مصعداً نحو مكة فتميل إلى واد يقال له (عريفطان معن (6) ) ليس به ماء ولا رعى. وحذاءه جبال يقال لها (أبلى (7) )، وحذاءه قنة يقال لها (السودة (8) ) لبني خفاف من بنى سليم، وماؤهم",
    "foot_note": "1. عند البكري 907، 1187: «المجني»، والصواب ما هنا كما يفهم من التعليل، وهو المطابق لما عند ياقوت في (الفلاج). \n2. الخلاف: شجر الصفصاف، ويسمى «السوجر» أيضا، وأصنافه كثيرة، كلها خوار ضعيف. قال الأسود: كأنك صقب من خلاف يرى له \n…. رواء وتأتيه الخئورة من عل \n3. ذكر الشيخ حمد تعليقا أن في وفاء الوفاء 2: 369 نقلا عن عرام: «لأن له حرفين لا يقدر عليه من جهتهما». \n4. سبق تفسير (القلت) في ص 417. \n5. جعلتها في نشرتى الأولى «انخفض» اعتمادا على ياقوت في (القرنين): أما الميمنى فجعلها «انخفضت» تصحيحا لما في الأصل وهو «انخفظت». قال الشيخ الفاضل مصححا معلقا: «وأقول: إن الصواب - فيما أرى - ما جاء في الأصل (يعنى صواب الأصل، وهو «انخفضت» لا «انخفظت»، فالماء كما يفهم من كلام عرام بين جبلين صغيرين، فوارده يحتاج إلى أن ينخفض قليلا لكي يصل إليه فينزعه بالدلو». \n6. في الأصل: «معرن» بالإهمال، صوابها من ياقوت في (عريفطان، أبلى). وقرأها الميمنى «عريفطان معرفة» وهو سهو في القراءة والتحقيق. \n7. أبلى هذه بالقصر، وهي غير (أبلى) ككرسى، وهو جبل معروف عند أجأ وسلمى. وقرأها الميمنى سهوا: «جبل يقال له أبلى». \n8. كذا ضبطت في معجم البلدان. وهي عند البكري 99، 815 (الشورة) بفتح الشين.",
    "book_id": "992",
    "new_page_number": 54
  },
  {
    "serial_number": "6266346",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 429,
    "volume_number": 1,
    "text": "(الصّعبية (1) ) وهي آبار ينزع عليها، وهو ماء عذب وأرض واسعة. وكانت بها عين يقال لها (النازية (2) ) بين بني خفاف وبين الأنصار، فتضاربوا (3) فسدوها، وهي عين ماؤها عذب كثير، وقد قتل ناس بذلك السبب كثير، وطلبها سلطان البلد مراراً بالثمن (4) الكثير فأبوا ذلك. وفي أبلى مياه منها (بئر معونة) و (ذو ساعدة (5) ) و (جماجم) أو (حماحم) شك (6) - و (الوسباء) وهذه لبني سليم، وهي قنان متصلة بعضها إلى بعض، قال فيها الشاعر: ألا ليت شعري هل تغيّرَ بعدنا … أروم فآرامٌ فشابةُ والحضر (7) وهل تركت أبليَ سوادَ جبالها … [وهل زالَ بعدي عن قنينته الحجر] (8)",
    "foot_note": "1. في الأصل: «الصعيدة»، صوابه من ياقوت في رسمها ورسم (السورة) وكذا القاموس (صعب) حيث يقول: «والصعبية: ماء لبنى خفاف». \n2. قال البكري: «على لفظ فاعلة من نزا ينزو». ونزا ينزو: طفر ووثب. \n3. قال الشيخ الفاضل تعليقا: «في وفاء الوفاء ج 2 ص 380: فتضاروا، وفي ياقوت: فتضادوا، بالدال تصحيف. والأستاذ اختار كلمة تضاربوا كالأستاذ الميمنى، ولكني أرى فتضاروا أصوب». وأقول: إن كتابة الأصل تحتمل قراءتي وقراءته، فقد رسمت الكلمة «تضاربوا» ولكن وضع فوق الراء في الأصل ما يشبه الشدة وفوق الباء ضمة. ولا ريب أن التضارب ومعناه التنازع والاختلاف أدنى إلى قوة العبارة من «المضارة» بمعنى تبادل الصرر. \n4. كلمة «بالثمن» ثابتة في الأصل. ولا أدرى كيف فاتت العلامة الميمنى فأثبتها زائدة على الأصل معتمدا على معجم ياقوت رسم (الصعبية) ومعجم ما استعجم ص 60 وذكر مع ذلك أن «الأصل بياض» مع ثبوتها واضحة في الأصل. \n5. ساعدة، هي في الأصل علم من أعلام الأسد. \n6. رسمت هذه الكلمة في الأصل رسما رديئا بحيث يظنها القارئ من عبث القلم. لذلك لم أثبتها في النشرة الأولى، ولكني وجدت بعد عثورى هذه المرة على نشرة العلامة الميمنى أنه استطاع قراءتها وقال تعليقا عليها: «كذا بالشك من السكوني في معجم ياقوت ومعجم ما استعجم 60، 22244». \n7. ياقوت في رسم (أبلى): «فالحضر». \n8. التكملة من ياقوت. وفي الأصل: «وهل تركت ليلى».",
    "book_id": "992",
    "new_page_number": 55
  },
  {
    "serial_number": "6266347",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 430,
    "volume_number": 1,
    "text": "[وحذاء أبلى جبل يقال له (ذو الموقعة (1) ) من شرقيها، وهو جبل (2) ] معدن بني سليم، يكون فيه الأروى (3) كثيراً، وفي أسفل من شرقيه بئر يقال [لها] (الشقيقة (4) ). وحذاءه من عن يمينه من قبل القبلة جبل يقال له (برثم) وجبل يقال له (تعار)، وهما جبلان عاليان لا ينبتان، فيهما النّمران (5) كثيرة. وفي أصل برثم ماء يقال له (ذنبان العيص (6) )، وليس قرب تعار ماء. و [الخرب]: جبل بينه وبين القبلة، لا ينبت شيئاً ثابتاً (7) . قال الشاعر: بليتُ ولا تبلي تعارُ ولا أرى … يرمرمَ إلاّ ثابتاً يتجدد (8) ولا الخرب الداني كأنَّ قلاله … بخات عليهنّ الأجلّة هجّد (9)",
    "foot_note": "1. هي عند البكري (الموقعة) في رسمها وفي ص 199. \n2. وهذه التكملة أيضا من ياقوت في رسم (الموقعة). \n3. بدله عند ياقوت نقلا عن عرام (اللازورد)، والوجه ما في الأصل والبكري 99. واللازورد: حجر من الأحجار الكريمة. وقال داود في تذكرته: معدن مشهور يتولد مستقلا بجبال أرمينية وفارس، ويوجد في وجوه المعادن، وأخلصه الكائن في الذهب. وأجوده الصافي الرزين الشفاف الضارب زرقته إلى خضرة ما وحمرة. \n4. وفيه يقول ابن مقبل: فحياض ذي بقر فحزم شقيقة \n…. قفر وقد يغنين غير قفار وجعلها ياقوت بلفظ (الشفيقة) في رسمها. \n5. في الأصل: «النمر كثير» وصوابه من ياقوت في (برثم) و (تعار): النمران جمع نمر، ومثله ذئب وذؤبان. \n6. وكذا عند ياقوت. وعند البكري 616، 814: «ذنابة العيص». \n7. وقعت محرفة في النشرة الأولى: «نابتا» تحريفا مطبعيا. \n8. كلمة (ثابتا) ليست واضحة في الأصل. وإثباتها من معجم ياقوت في (يرمرم). \n9. قلال: جمع قلة، وهي قمة الجبل. والبخاتي: جمع بختى ككرسى، وهي جمال طوال الأعناق. والأجلة: جمع جلال، والجلال، بالكسر: هو غطاء كل شيء، وهو أيضا جمع جل الدابة الذي تلبسه لتصان به. وهجد: جمع هاجد وهاجدة، وفي الأصل: «جهد» صوابه من ياقوت (يرمرم، الخرب). وقد روى البكري 99 البيتين برواية مخالفة.",
    "book_id": "992",
    "new_page_number": 56
  },
  {
    "serial_number": "6266348",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 431,
    "volume_number": 1,
    "text": "ويجاوز عين (النازية (1) ) فيرد مياها (2) يقال لها (الهدبيّة (3) ) وهي ثلاثة آبار ليس عليهن مزارع ولا نخل ولا شجر، وهي بقاع كبير (4) يكون ثلاثة فراسخ في طول ما شاء الله (5) ، وهي لبني خفاف بين حرتين سوداوين، وليس ماؤهن بالعذب، وأكثر ما عندها من النّبات الحمض. ثم ينتهى إلى (السّوارقية (6) ) على ثلاثة أميال منها، قرية غناء كثيرة الأهل، فيها منبر ومسجد جماعة (7) وسوق كبيرة تأتيها التجار من الأقطار، لبني سليم خاصة. ولكل [من (8) ] بني سليم منها شيء، وفي مائها بعض ملوحة. ويستعذبون (9) من آبار في واد يقال له (سوارق)، وواد يقال له (الأبطن (10) ) ماء خفيفاً عذباً. ولهم مزارع ونخيل كثيرة وفواكه، من موز وتين، ورمان، وعنب، وسفرجل، وخوخ، ويقال له الفرسك (11) . ولهم",
    "foot_note": "1. كلمة النازية لم يظهر في الأصل منها إلا (النا). \n2. في الأصل (مياه)، وصوابه في البكري، وعند ياقوت (الهدبية): «ماءة». \n3. في الأصل: «العدمة» صوابه من ياقوت والبكري 99. \n4. القاع: أرض واسعة سهلة مطمئنة مستوية لا حزونة فيها ولا ارتفاع، تنفرج عنها الجبال والآكام. وعند ياقوت: «بقاع كبيرة»، جمع بقعة، وكذا عند البكري 99: «في بقاع واسعة». \n5. في الأصل: «ما سال منه»، صوابه من ياقوت والبكري. \n6. بضم السين وفتحها. ويقال أيضا: «السويرقية»، بلفظ التصغير. \n7. ياقوت عن عرام: «جامع». \n8. التكملة من ياقوت. \n9. الاستعذاب: استقاء الماء العذب. وفي الحديث أنه «كان يستعذب له الماء من بيوت السقيا»، أي يحضر له منها الماء العذب. \n10. كذا ضبط بضم الطاء في ياقوت (السوارقية) والبكري (أبلى). \n11. وقيل فاكهة مثل الخوخ في القدر. وقال الجوهري: «ضرب من الخوخ ليس يتفلق عن نواه» وقيل: هو التين. قال شمر: «سمعت حميرية فصيحة سألتها عن بلادها، فقالت: النخل قل، ولكن عيشتنا امقمح، امفرسك، امحماط. طوب - أي طيب - فقلت لها: ما الفرسك؟ قالت: هو أمتين عندكم». ولفظ الفرسك ورد في الفارسية بمعنى الخوخ:  APeach.  استينجاس 618.",
    "book_id": "992",
    "new_page_number": 57
  },
  {
    "serial_number": "6266349",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 432,
    "volume_number": 1,
    "text": "خيل وإبل وشاء كثير، وهم بادية (1) إلا من ولد بها فإنهم تانون (2) فيها، والآخرون بادون حواليها، ويميرون طريق الحجاز ونجد في طريقي الحاج. والحد (ضرية) وإليها ينتهي حدهم على سبع مراحل، ولهم قرى من حواليهم، منها قرية يقال لها (القيّا) ماؤها مأج (3) ملح نحو ماء السّوارقية، وبينهما ثلاثة فراسخ. وبها سكان كثير ونخيل ومزارع وشجر. وقال الشاعر: ما أطيبَ المذق بماء القيَّا (4) … وقد أكلتُ بعده برنيَّا (5) وقرية يقال لها (الملحاء (6) ) وهي ببطن واد يقال له (قوران) يصب من الحرة (7) ، فيه مياه وآبار كثيرة عذاب طيبة، ونخل وشجر. وحواليها هضبات (ذي مجر (8) )، قال فيهن الشاعر: • بذي مجرٍ أسقيت صوب الغوادى (9) …",
    "foot_note": "1. في الأصل «ثلاثة»؟؟؟ بدون إعجام، صوابه من ياقوت. على أن العبارة قبله محرفة عنده، إذ هي «وشاء وكبراؤهم بادية». \n2. كذا في الأصل. وكنت قرأتها في النشرة الأولى «ثابتون». قال الشيخ الفاضل حمد: إن معنى «تانون» ماكثون، من تنأ، وسهلت الهمزة. نبه على هذا الأستاذ الشيخ عبد الرحمن المعلمى اليماني. \n3. المأج: الملح. ياقوت: «أجاج». وجعلها الميمنى «أجاج» ولم ينبه على الأصل، مع أن ما في الأصل صحيح. \n4. المذق: اللبن الممذوق بالماء، أي الممزوج به. البكري: «بماء قيا». \n5. البكري: «قبله» بدل «بعده». والبرنى: ضرب من التمر أصفر مدور، \n6. قال البكري: 100 «سميت بالملحاة بطن من حيدان». \n7. هي حرة سليم التي تسمى حرة النار. \n8. ضبطه ياقوت بفتح الميم وسكون الجيم، وجعل تحريكه في الشعر بعد للضرورة أما البكري فضبطه بالتحريك. \n9. ياقوت: «غوادى».",
    "book_id": "992",
    "new_page_number": 58
  },
  {
    "serial_number": "6266350",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 433,
    "volume_number": 1,
    "text": "وذو مجر: غدير كبير في بطن وادي قوران هذا. وبأعلاه ماء يقال له (لقف (1) ) ماء آبار كثيرة، عذب، ليس عليها مزارع ولا نخل، لغلظ موضعها وخشونته. وفوق ذلك ماء يقال له (شس (2) ) ماء آبار عذاب. وفوق ذلك بئر يقال لها (ذات الغار) عذبة كثيرة الماء تسقي بواديهم. قال الشاعر - وهو عذيرة بن قطاب (3) السلمى: لقد رعتموني يوم ذي الغار روعة … بأخبار سوء دونهنّ مشيبي نعيتم فتى قيس بن عيلان غدوةَ … وفارسها تنعونه لحبيب (4) وحذاءها جبل يقال له (أقراح (5) ) شامخ مرتفع أجرد لا ينبت شيئاً، كثير النمور والأراوى. ثم تمضي من الملحاء فتنتهي إلى جبل يقال له (مغار (6) ) في جوفه",
    "foot_note": "1. بدله عند البكري 100: «ليث». ووقعت في النشرة الأولى «القفا»، سهواء. \n2. أصل معنى الشس الأرض الصلبة التي كأنها حجر واحد، والجمع شساس وشسوس. \n3. ياقوت وكذا ابن تغرى بردى: «غزيرة بن قطاب». وعند البكري 100. «قال ابن قطاب». وعند الطبري: «عزيزة». وغزيرة بن قطاب السلمى، كان مقدم سلم في ثورتهم على السلطان في خلافة الواثق، فكان يحمل ويرتجز ويقول: لا بد من زحم وإن ضاق الباب \n…. إني أنا غزيرة بن قطاب للموت خير للفتى من العاب وظل يقاتل إلى أن قتل وصلب. وذلك في سنة 230. النجوم الزاهرة (2: 257 - 258) والطبري (11: 12 - 14). \n4. لم يروه ياقوت. وعند البكري: «عقوة» بدل «غدوة». لحبيب أي تنعونه لمحب له. وعند البكري: «لحبيبى»، وتوجه على أن التقدير: لهو حبيبي. \n5. لم يرسم له ياقوت، ورسم له البكري وتكلم عليه في «أبلى». \n6. عند البكري 100: «معان».",
    "book_id": "992",
    "new_page_number": 59
  },
  {
    "serial_number": "6266351",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 434,
    "volume_number": 1,
    "text": "أحساء، منها حسى يقال له (الهدار (1) ) يفور بماء كثير وهو في سبخ (2) بحذائه حاميتان (3) سوداوان في جوف إحداهما ماءة ملحة (4) يقال لها (الرفدة (5) )، وواديها يسمى (عريفطان)، وعليها نخيلات وآجام يستظل فيهن المار، وواحدها أجم (6) ، وهي شبيهة بالقصور، وحواليها حموض (7) وهي لبني سليم. وهي على طريق (زبيدة) يدعوه بنو سليم (منفا زبيدة (8) ). وحذاءها جبل يقال له (شواحط) كثير النمور كثير الأراوى. وفيه الأوشال تنبت الغضور والثغام. وبحذائه واد يقال له (برك) كثير النبات من السلم والعرفط وأصناف الشجر، وبه ماء يقال له (البويرة (9) ) وهي عذبة طيبة من (بئر شك) وهي",
    "foot_note": "1. الكلمة غير واضحة في الأصل فهي «المدار» مهملة، وإثباتها من ياقوت في (مغار، الهدار) والبكري 101 وكذا رسم (الهدار). والهدار أيضا: من نواحي اليمامة كان بها مولد مسيلمة الكذاب. قال ياقوت: «يجوز أن يكون من الهدر، وهو إبطال الدم، أو من هدر البعير، إذا شقشق بجرته». \n2. السبخ، بالتحريك: المكان يسبخ فينبت فيه الملح وتسوخ الأقدام. \n3. سبق تفسير «الحامية» في ص 413. \n4. ياقوت عن عرام: «مليحة». والمليحة والملحة بمعنى واحد. \n5. هكذا ضبطها البكري بالحروف في رسمها، ولم يضبطها ياقوت. وضبطت في القاموس بفتح الراء. \n6. الأجم، بضمتين: الحصن، وبضم وضمتين: كل بيت مربع مسطح. وأنشدوا في لك قول امرئ القيس: وتيماء لم يترك بها جذع نخلة \n…. ولا أطما إلا مشيدا بجندل \n7. في الأصل: «حموس» بالمهملة، صوابه بالضاد المعجمة. والحموض: جمع حمض، كما في القاموس. والحمض، بالفتح: ما ملح وأمر من النبات. \n8. كذا في الأصل. وفي معجم ياقوت: «منقا زبيدة». انظر رسم (مغار). وقرأها الميمنى «مغفا»، سهوا. \n9. قال ياقوت: «تصغير البئر التي يستقى منها الماء».",
    "book_id": "992",
    "new_page_number": 60
  },
  {
    "serial_number": "6266352",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 435,
    "volume_number": 1,
    "text": "الغيقة الشّجوة (1) لكنّها لا تنزف. وهنالك (برثم) وهو جبل شامخ كثير النّمور والأروى، قليل النبات إلا ما كان من ثغام وغضور وما أشبهه. وحذاءه واد يقال له (بيضان (2) ) به مياه آبار كثيرة، وأشجار كثيرة، يزرع على هذه الآبار الحنطة والشعير والقت (3) . وحذاءه واد يقال له (الصحن)، قال فيه الشاعر: جلبنا من جنوب الصَّحنِ جرداً … عتاقاً شزّبا نسل النسل (4) فوافينا بها يومي حنينٍ … نبيَّ الله حدَّا غير هزلِ به ماء يقال له (الهباءة)، وهي أفواه آبار كثيرة مخرقة الأسافل، يفرغ بعضها في بعض من موضع الماء عذبة طيبة (5) ، يزرع عليها الحنطة والشعير وما أشبهه. وماء آخر، بئر واحدة، يقال لها (الرساس (6) ) كثيرة الماء لا يزرع (7) عليها لضيق موضعها.",
    "foot_note": "1. كذا وردت «بئر شك وهي الغيقة الشجوة». ومما هو جدير بالذكر أن «شجوة» واد بتهامة، و «غيقة» بين مكة والمدينة. \n2. رسم له البكري، ولم يرسم له ياقوت. \n3. الكلمة مهملة في الأصل. والقت: الفصفصة والرطبة، وهي التي تسمى «البرسيم» في لسان المصريين. انظر تذكرة داود. \n4. الجرد: جمع أجرد وجرداء، وهو الفرس القصير الشعر. والنسل: مصدر نسل ينسل، بمعنى أسرع. ياقوت: «سرها نسلا لنسل». البكري: «سيرها نسلا لنسل» وشزبا: جمع شازب، وهو الضامر. وفي الأصل: «سربا؟؟؟» بالإهمال. وللشيخ حمد الفضل في هذا التصحيح الذي فاتنى في النشرة الأولى. \n5. ياقوت «بعضها في بعض الماء الطيب العذب». \n6. كذا ضبطه البكري في رسمه، وذكره أيضا في «شواحط» ولم يرسم له ياقوت. وفي الأصل: «ارساس» وكثيرا ما يهمل كاتب النسخة لام التعريف. \n7. البكري في (شواحط): «لا يزدرع».",
    "book_id": "992",
    "new_page_number": 61
  },
  {
    "serial_number": "6266353",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 436,
    "volume_number": 1,
    "text": "وبأسفل بيضان هذا موضع يقال له (العيص) به ماء، يقال له (ذنبان العيص (1) ). والعيص: ما كثرت أشجاره من السلم والضال، يقال له عيص وخيس (2) . وحذاءه جبل يقال له (الحراس (3) ) أسود ليس به نبات حسن، وفي أصله أضاة (4) ، يقال لها الحواق (5) تمسك الماء من السماء كثيراً، وهو كله لبني سليم. وحذاء ذلك قرية يقال لها (صفينة (6) ) بها مزارع ونخل (7) كثير، كل ذلك على الآبار. ولها جبل يقال له (الستار). وهي على طريق (زبيدة (8) ) يعدل إليها الحاج إذا عطشوا. وحذاءها مياه أخرى يقال لها (النّجير)، [وبحذائها ماءة يقال لها (النجارة) بئر واحدة (9) ]، وكلاهما فيه ملوحة وليس بالشّديد (10) .",
    "foot_note": "1. انظر ما سبق في حواشي ص 430. \n2. الخيس والخيسة: الشجر الكثير الملتف. وفي الأصل: «حبس» تحريف. \n3. ذكره البكري في رسمه، وفي (الستار)، وفي (شواحط). وفي إحدى نسخ أصله: «الحراض»، ولم يرسم له ياقوت، بل لم يذكره، بتتبع فهارس وستنفلد، \n4. الأضاة: الغدير، والماء المستنقع من سيل أو غيره، والجمع أضوات وأضا. \n5. في الأصل: «الحقائق» مهملة النقط. صوابه من البكري في رسمه وفي (شواحط) والزمخشري 49 والقاموس (حوق). وهو ككتاب وغراب، كما ذكر البكري وصاحب القاموس. \n6. رسم لها ياقوت ولم يرسم البكري لها ولم يذكرها. وهي كالعيبة يكون فيها متاع الرجل وأداته. \n7. وقعت في نسخة الميمنى: «ونخيل» محرفة عما في الأصل. \n8. ياقوت: «الزبيدية». \n9. التكملة من ياقوت في رسم (النجير)، ومما سيأتي. وعند البكري 721 و 336، «الثجار» و «الثجير». ولم يرسم لهما ياقوت في الثاء، بل جعلهما «النجارة» و «النجير» بالنون، في رسمهما وفي «نجل». \n10. كذا في الأصل وله وجه. وعند ياقوت: «وليست بالشديدة».",
    "book_id": "992",
    "new_page_number": 62
  },
  {
    "serial_number": "6266354",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 437,
    "volume_number": 1,
    "text": "وأسفل منهما بصحراء مستوية عمودان طويلان (1) لا يرقاهما أحد إلا أن يكون طائرا، يقال لأحدهما (عمود البان)، و (البان (2) ): موضع، والآخر (عمود السفح)، وهو من عن يمين الطريق المصعد من الكوفة (3) على ميل من (أفيعية) و (أفاعية (4) ) هضبة كبيرة شامخة، وإنّما اسم القرية (ذو النخل (5) )، وهي مرحلة من مراحل الطريق، وبها ملح، ويستعذب لها من النجارة والنجير (6) هاتين، ومن ماء يقال له (ذو محبلة (7) ). وعن يسارها ماءة يقال لها (الصبحية (8) ) وهي بئر واحدة ليس عليها مزارع،",
    "foot_note": "1. وكذا وردت العبارة مطابقة في ياقوت (البان، وعمود) عن عرام. وعند البكري 721 ولم يصرح بالنقل: «وأسفل منهما هضبتان طويلتان». وهذا تفسير للعمودين، أي إنهما هضبتان عاليتان يشبه كل منها عمود البيت. وإطلاق (العمود) على الهضبة لم تعرفه معاجم اللغة. \n2. البان بلفظ ذلك النبات المعروف عند ياقوت. وعند البكري في رسمه وفي (الستار): «ألبان» كأنه جمع لبن. \n3. عند البكري 722: «من الكوفة إلى مكة». \n4. ضبطه البكري بضم الهمزة ثم قال: «هكذا روى عن عمارة بن عقيل. وغيره يرويه أفاعية بفتح الهمزة، وكلا المثالين موجودان في الأسماء والصفات، وضم الهمزة في أفاعية أثبت، وهو الذي اختاره أبو حاتم وغيره». \n5. كذا في الأصل. وأنشد البكري 314 لجميل: وقد حال أشباه المقطم دونها \n…. وذو النخل من وادى قطاة وتعنق وعند ياقوت: «ذو النجل» بالجيم، وكذا عند الزمخشري 67. \n6. سبق تفسير الاستعذاب في ص 431. كما سبق الكلام على (النجارة) و (النجير) في الصفحة السابقة. \n7. رسم لها ياقوت، وذكرها أيضا في (نجل)، ولم يذكرها البكري. وفي الأصل: «مجيلة». وظنها الميمنى «ذو نخيلة». \n8. رسم لها البكري، ولم يرسم لها ياقوت ولم يذكرها في معجمه، بتتبع فهرس وستنفلد.",
    "book_id": "992",
    "new_page_number": 63
  },
  {
    "serial_number": "6266355",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 438,
    "volume_number": 1,
    "text": "ويستعذب منها لأهل أفاعية. وحذاءها هضبة كبيرة يقال لها (خطمة (1) )، ولابة (2) - وهي حرشفة (3) حرة سوداء لا تنبت شيئاً - يقال لها (منيحة (4) )، وهي لجسر وبني سليم. وقرية يقال لها (مران) قرية غناء كبيرة، كثيرة العيون والآبار والنخيل والمزارع، وهي على طريق البصرة لبني هلال وجسر (5) ، ولبني ماعز (6) ، وبها حصن ومنبر، وبها ناس كثير. وفيها يقول الشاعر (7) : أبعدَ الطَّوالِ الشمَّ من آل ماعزٍ يرجَّى بمرَّانَ القرى ابن سبيل (8)",
    "foot_note": "1. الذي عند البكري 722: «حدمة» بالضم وبضمتين. \n2. اللابة: الحرة، والجمع لأب ولوب. \n3. الحرشفة: الأرض الغليظة. \n4. في الأصل: «سحه» بالإهمال، وإثباتها من البكري 722. \n5. سقطت هذه الكلمة من النشرة الأولى. \n6. ياقوت في رسم (مران): «وجزء لبنى ماعز». \n7. قال الشيخ الفاضل: لم يخرج الأستاذ البيتين لواردين في (مران) وهما من قصيدة من عيون المراثى تقع في 18 بيتا أوردها الهجري كاملة وذكر قائلها والمرثى بها قال: وأنشدني أبو كليب حمر بن الأشهب، من بنى عامر بن ربيعة، للتميمى، في ماعز بن مالك البكائي، وهي تامة هاهنا: أتاني نعى للأغر ابن مالك \n…. فبت وليلى بالعراق طويل فبت أعزى النفس أن يشمت العدى \n…. وفي النفس من وجد عليه غليل وقد أورد أبو تمام في الحماسة بعضها. قلت: انظر أيضا شرح المرزوقي ص 1062 - 1063. \n8. في الأصل: «حي بمران القرى»، صوابه من ياقوت.",
    "book_id": "992",
    "new_page_number": 64
  },
  {
    "serial_number": "6266356",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 439,
    "volume_number": 1,
    "text": "مررنا على مرَّان ليلاً فلم نعج … على أهل آجامٍ به ونخيلِ (1) ومن خلفه قرية يقال لها (قباء (2) ) كبيرة عامرة لجسر ومحارب وعامر ابن ربيعة من هوازن، بها مزارع كثيرة على آبار، ونخيل ليس بكثير. وبحذائها جبل يقال له (هكران)، وجبل يقال [له] (عن). قال الشاعر: • أعيان هكرانَ الخداريَّات (3) … وهو قليل النبات، في أصله ماء يقال له (الصنو (4) ). وعن هذا في جوفه مياه وأوشال. قال فيه الشاعر: فقالوا هلاليُّونَ جئنا منَ أرضنا … إلى حاجةٍ جبَّنا لها اللَّيلَ مدرعا (5) وقالوا خرجنا ملْ قفا وجنوبهِ … وعنَّ فهمَّ القلبُ أن يتصدَّعا (6) و (القفا (7) ): جبل لبني هلال حذاء عن هذا. وحذاءه جبل آخر",
    "foot_note": "1. ياقوت: «آجام بها». \n2. قباء هذه هي التي في الطريق من مكة إلى البصرة. وهي غير قباء المدينة. \n3. أعيان، بالنون في أصل النسخة، ويطابقه ما رواه ياقوت من عرام في (هكران). وعند البكري 722: «أعيار» جمع عير. والخدارى بضم الخاء: الأسود، يوصف به السحاب، والعقاب، والبعير، والشعر. \n4. لم يرسم لها البكري ولا ياقوت، وذكرها الأول في (الستار) والآخر في (هكران). \n5. أي دخلنا في جوفه كما يدخل اللابس في مدرعه. والمدرع كمنبر: جبة مشقوقة المقدم. \n6. هذه الرواية تطابق رواية ياقوت في (عن). ورواية البكري، «في الفقا». \n7. رسم له البكري، وقال: «على لفظ قفا الإنسان». ولم يرسم ياقوت.",
    "book_id": "992",
    "new_page_number": 65
  },
  {
    "serial_number": "6266357",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 440,
    "volume_number": 1,
    "text": "يقال له (بس (1) )، وفي أصله ماء يقال له (بقعاء (2) ) لبني هلال، بئر كثيرة الماء، ليس عليها زرع. وحذاءها أخرى يقال لها (الخدود (3) ). وعكاظ منها على دعوة (4) . و (عكاظ) صحراء مستوية ليس لها جبل ولا علم (5) إلا ما كان من الأنصاب التي كانت في الجاهلية. وبها الدماء من دماء البدن كالأرحاء (6) العظام. وحذاءها عين يقال لها (خليص) للعمريين (7) . وخليص هذا رجل",
    "foot_note": "1. وضع في الأصل علامة إهمال فوق السين توشك أن تكون ثلاث نقط، فظننتها «بيش». وقد نبه الشيخ الفاضل على هذا الصواب. \n2. البكري: «نقعاء». وعند ياقوت بالباء، كما هنا. وقال: «نقعاء بين الحجاز وركبة، وهي من أرض ركبة». \n3. ياقوت: «الخدود: مخلاف من مخاليف الطائف». وعند البكري: «الجرو». \n4. البكري: «على دعوة وأكثر قليلا». \n5. حقق الشيخ محمد بن بليهد موضع سوق عكاظ اليوم في بحث مسهب في نهاية الجزء الثاني من كتابه «صحيح الاخبار»، ولكنه نقل عن عرام نصا غريبا لست أدرى من أين نقله، وهو قوله «هو في أرض مستوية ليس بها جبال. وإذا كنت في عكاظ طلعت عليك الشمس على حرة سوداء، وبها عبيلات بيض، كان العرب يطيفون بها في جاهليتهم وينحرون عندها». \n6. في الأصل: «كالأدخال»، وفي إحدى نسخ البكري: «كالأرحال»، والوجه ما أثبت من أصول البكري. انظر رسم (عكاظ). \n7. وكذا عند البكري 960. وكلمة (العمريين) ضبطت في معجم البكري بضم ففتح، وفي صفة جزيرة العرب للهمداني 120: «ويسكن شرقي الطائف قوم من ولد عمرو ابن العاص».",
    "book_id": "992",
    "new_page_number": 66
  },
  {
    "serial_number": "6266358",
    "category_id": "28",
    "category": "البلدان والرحلات",
    "book_title": "أسماء جبال تهامة وسكانها وما فيها من القرى وما ينبت عليها من الأشجار وما فيها من المياه",
    "edition": "الثانية، 1393 هـ‍ - 1972 م",
    "publisher": "شركة مكتبة ومطبعة مصطفى البابي الحلبي وأولاده بمصر",
    "page_number": 441,
    "volume_number": 1,
    "text": "وهو ببلاد تسمى (ركبة (1) ). قال الشاعر: أقول لركبٍ ذاتَ يومٍ [لقيتهم] … يزجَّون أنضاءً حوافيَ ظلّعا (2) من أنتم فإنّا قد هوينا مجيئكم … وأن تّخبرونا حالَ ركبة أجمعا (3) تم كتاب أسماء جبال مكة والمدينة وما يتصل بها، بحمد الله وعونه وحسن توفيقه، وصلى الله على سيدنا محمد كلما ذكره الذاكرون، وسها عن ذكره الغافلون.",
    "foot_note": "1. ركبة بلفظ الركبة التي في الرجل. وهي بين مكة والطائف. وفي اللسان: «بين غمرة وذات عرق». ويقال: إن ركبة أرفع الأراضي كلها، ويقال: إنها التي قال فيها ابن نوح: «سآوى إلى جبل يعصمني من الماء». وفي فضائل مكة للهمداني أن عمر بن الخطاب قال: أن أخطئ سبعين خطيئة بركبة أحب إلى من أن أخطئ خطيئة واحدة بمكة. وروى مالك في الموطأ أن عمر بن الخطاب قال: «لبيت بركبة أحب إلى من عشرة أبيات بالشام»: قال مالك: «يريد لطول الأعمار والبقاء، ولشدة الوباء بالشام». \n2. لم أجد مرجعا لتحقيق هذين البيتين على طول التنقيب. وكلمة «ليقتهم» ليست في الأصل، وبمثلها يلتئم الكلام. والتزجية: السوق. والأنضاء: جمع نضو، بالكسر، وهو البعير المهزول. والحوافى: التي حفيت أقدامها من السير. والظالع: الذي به الظلع، وهو غمز شبيه بالعرج. \n3. ورد صدر البيت في الأصل بهذه الصورة: • من اسم ىاىا قد هوينا مجيكم • وأثبته كذلك في النشرة الأولى. وبعد اطلاعى هذه المرة على نشرة الميمنى وجدته قرأها هذه القراءة القريبة. فله الفضل. والحمد للّه على ما أنعم.",
    "book_id": "992",
    "new_page_number": 67
  }
]