[
  {
    "text": "الإقناع في حجية الإجماع\nالمؤلف: عبد العزيز بن ريس الريس\nسنة الوفاة: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "الإقناع في حجية الإجماع",
    "category_id": "11",
    "category": "أصول الفقه",
    "new_page_number": 1
  },
  {
    "text": "sn: 3939\nbook_title: الإقناع في حجية الإجماع\nbook_link: https://shamela.ws/book/267\nbook_id: 267\nauthor_name: عبد العزيز بن ريس الريس\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/3093\nauthor_ID: 3093\neditor: Null\npublisher: مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة\nedition: الأولى، 1440 ه\npages: 85\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: أصول الفقه\ncategory_id: 11",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "الإقناع في حجية الإجماع",
    "category_id": "11",
    "category": "أصول الفقه",
    "new_page_number": 2
  },
  {
    "serial_number": "3425118",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 0,
    "volume_number": 1,
    "text": "القسم: أصول الفقه الكتاب : الإقناع في حجية الإجماع المؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالكتاب : الإقناع في حجية الإجماع المؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالمؤلف : د . عبد العزيز بن ريس الريس الناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالناشر : مركز سطور للبحث العلمي ، دار الإمام مسلم للنشر والتوزيع - المدينة المنورة الطبعة : الأولى ، 1440 هـ عدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nالطبعة : الأولى ، 1440 هـ عدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nعدد الصفحات : 85 [ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\n[ ترقيم الكتاب موافق للمطبوع ] تاريخ النشر بالشاملة : 30 رمضان 1442\nتاريخ النشر بالشاملة : 30 رمضان 1442",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 3
  },
  {
    "serial_number": "3425119",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 5,
    "volume_number": 1,
    "text": "مقدمة بسم الله الرحمن الرحيم سلام عليكم ورحمة الله وبركاته أما بعد: فهذا تفريغ (1) لدرس \"حجية الإجماع وكشف بعض الشبهات\"، الذي ألقيتُه ليلة الرابع والعشرين من شهر جمادى الآخرة لعام ثمان وثلاثين وأربعمائة وألف من هجرة النَّبِيّ - صلى الله عليه وعلى آله وصحبه وسلم -. وتظهر أهمية هذا الدرس في حرص أهل البدع قديمًا وحديثًا في رد دليلٌ الإجماع أو إضعافه، وفي المقابل إهمال كثير من طلاب العلم لهذا الدليل المهم عمليًا. لذا قمت بمراجعة المادة المفرَّغة وتنقيحها لتخرج في هذه الرسالة المكونة من مقدمة، وتمهيدٍ، وفصلين، وخاتمة وسميتها \"الإقناع في حجية الإجماع\"، وهي على النحو التالي: - المقدمة: وهي التي بين يديك. - التمهيد: أهمية الإجماع، وبعض أشياء. - الفصل الأول: مسائل متعلقة بالإجماع، وبه ثلاث عشرة مسألة: - المسألة الأولى: تعريف الإجماع.",
    "foot_note": "1. قام بتفريغه بعض الإخوة الأفاضل، ووثقوه، ونسقوا الأصل وزادوا فيه وغيروا في الأسلوب بما يقربه لكتاب مؤلف بدل كونه مفرغًا، ووضعوا له فهرسًا كشافًا، فقمتُ بمراجعته فألفيتُه طيبًا، فجزاهم الله خيرًا وبارك فيهم.",
    "book_id": "267",
    "new_page_number": 4
  },
  {
    "serial_number": "3425120",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 6,
    "volume_number": 1,
    "text": "- المسألة الثانية: أدلة الإجماع. - المسألة الثالث: موقف أهل البدع من الإجماع. - المسألة الرابعة: قسما الإجماع. - المسألة الخامسة: الإجماع السكوتي. - المسألة السادسة: حتمية استناد الإجماع على نص. - المسألة السابعة: حجية الإجماع قبل الخلاف وبعده. - المسألة الثامنة: ضابط القول الشاذ. - المسألة التاسعة: حجية إجماع أهل كل فن في فنِّهم. - المسألة العاشرة: شرطية انقراض العصر في الإجماع. - المسألة الحادية العشرة: لا يجوز في الشريعة إحداث قول جديد. - المسألة الثانية عشرة: طريقة معرفة الإجماع. - المسألة الثالثة عشرة: الإجماع دليلٌ كاشف. - الفصل الثاني: إشكالات على دليلٌ الإجماع، وبه أربع وعشرون شبهةً وتوجيهها: - الشبهة الأولى: رد الإجماع بزعم أن رسول الله صلى الله عليه وسلم سلفه. - الشبهة الثانية: رد الإجماع بزعم أن الصحابي راوي الحديث سلفه. - الشبهة الثالثة: رد الإجماع بزاعم أنَّه ليس من المجمعين. - الشبهة الرابعة: رد الإجماع بحجة ثبوت خرم إجماعات مدعاة. - الشبهة الخامسة: رد الإجماع لمخالفة بعض العلماء إجماعات الصحابة. - الشبهة السادسة: رد الإجماع بحجة وجود كثير من الفقهاء المتأخرين لا يعتد بالإجماع السكوتي.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 5
  },
  {
    "serial_number": "3425121",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 7,
    "volume_number": 1,
    "text": "- الشبهة السابعة: رد الإجماع لما نسب للشافعي: «ما ليس فيه خلاف فليس إجماعًا». - الشبهة الثامنة: رد الإجماع بحجة أن السنة حجة في ذاتها ولا تحتاج إلىعمل. - الشبهة التاسعة: رد الإجماع بحجة أن الإجماع الذي يحتج به الإمام أحمد وشيخ الإسلام ابن تيمية هو إجماع الصحابة. - الشبهة العاشرة: الإجماع الذي هو حجة هو المعلوم من الدين بالضرورة دون غيره. - الشبهة الحادية عشرة: عدم العلم بالمخالف لا يدل على الإجماع. - الشبهة الثانية عشرة: لا يصح الاستدلال بالإجماع في مخالفة الدليل، لئلا نوافق أهل البدع. - الشبهة الثالثة عشرة: رد الإجماع بحجة الإجماع الذي لا يقطع به هو من الظن. - الشبهة الرابعة عشرة: إذا صح الحديث وجب العمل به ولو لم يعلم من عمل به؛ لأنه حجة بلا خلاف. - الشبهة الخامسة عشرة: ترك الحديث لعدم العلم بالمخالف عليه المتأخرون دون المتقدمين. - الشبهة السادسة عشرة: إذا وجد نص لم يُعمل به فلابد وأن هناك من عمل به، ولا يلزم أن ينقل قول من عمل به. - الشبهة السابعة عشرة: مخالفة من قوله ليس حجة مما حكي عليه الإجماع أعذر من مخالفة من قوله حجة وهو الكتاب والسنة، فكيف تترك الحجة وهو الكتاب والسنة إلى من قوله ليس حجة؟",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 6
  },
  {
    "serial_number": "3425122",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 8,
    "volume_number": 1,
    "text": "- الشبهة الثامنة عشرة: أن طائفة من أهل العلم قالوا أقوالاً لم يسبقوا إليها فدل هذا على جواز إحداث قول جديد. - الشبهة التاسعة عشرة: رد الإجماع بحجة قول إسحاق ابن راهويه في مسألة: … ما ظننت أن أحدًا يوافقني. - الشبهة العشرون: درج العلماء على تقديم الكتاب والسنة على الإجماع، وعليه إذا تعارض النص والإجماع قُدِّم النص. - الشبهة الحادية والعشرون: لا إجماع في علوم الآلة لأنه لا نصوص فيها ولا إجماع إلا وهو مستند على نص. - الشبهة الثانية والعشرون: حقيقة مخالفة التابعي للصحابي إحداث قول جديد. - الشبهة الثالثة والعشرون: تقديم الكتاب والسنة على الإجماع الظني دون القطعي. - الشبهة الرابعة والعشرون: رد الإجماع بحجة أن النووي قال: إن النص يعمل به ولو لم يعمل به أحد. - الخاتمة. والله أسأل أن يتقبل هذه الرسالة، وأن يجعلها نافعةً لخلقه، مقبولةً عنده سبحانه. والسلام عليكم ورحمة الله وبركاته. د. عبد العزيز بن ريس الريس المشرف على موقع الإسلام العتيق 18/ 4/ 1439 هـ",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 7
  },
  {
    "serial_number": "3425123",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 9,
    "volume_number": 1,
    "text": "تمهيد قبل الولوج في لُبِّ هذا البحث ينبغي أن نعلم أن دليل الإجماع من أهم الأدلة عند علماء أهل السُّنة، «وعليه مَدَارُ مُعظمِ الأحكَامِ في الفَرْقِ والجَمْعِ، وإليه استنادُ المقاييسِ والعِبَرِ، وبه اعتضَادُ الاستِنبَاطِ في طُرُقِ الفِكَرِ» (1) . وتتجلى تلك الأهمية للإجماع عند النظر إلى كثير من أدلة الكتاب والسنة التي إذا أوردت في كثير من المسائل يعترض عليها كثير من المخالفين؛ بأنها ليست قطيعة في دلالتها بل تحتمل كذا وكذا … ويأخذون في تنويع المشارب وتعديد المذاهب؛ لذا كان من  أنفع ما يحفظ عقيدة ومنهج أهل السنة: هو فهم السلف في الإفهام والتفهيم، والأخذ والرد، والنفي والإثبات، والتأصيل والتقعيد … وما إلى ذلك. وفهم السلف: صورة من صور الإجماع؛ لذا ضبط الإجماع مهم للغاية وكذا الاعتناء به؛ حتى يُحفظ معتقد أهل السنة ويُصان عن تلك الهالة المسماة «قطعي وظني الدلالة»، تلك الهالة التي قَلَبَتِ الإسلامَ رأسًا على عقب وظهرًا لبطنٍ، حيث يردُّ أولئك المتكلمون كثيرًا من الأدلة الظاهرة الواضحة بزعمهم أنها ليست قطعيةً في دلالتها أو أنَّها ظنيَّةٌ في ثبوتيَّتِها. وليس معنى هذا أننا ننكر ما اصطُلح عليه بـ «قطعي الدلالة وظني الدلالة»، وإنما هو إيراد في مقام الرد على المتكلمين الذين ردوا الأدلة بحجة أنها ظنية في دلالتها أو ظنية في ثبوتها، - فمثلًا - يرد المتكلمون خبر الآحاد بحجة أنه ليس قطعيًا في ثبوته، فإذا أتيتَ لهم بالقطعي في ثبوته كالخبر المتواتر من السنة النبوية أو من القرآن: أثارَ أولئك القوم زوبعتَهم ليشككوا في دلالته، ومن ثَمَّ يرفضون الاحتجاج به … وهكذا هو دأبهم.",
    "foot_note": "1. انظر: «غياث الأمم» لأبي المعالي الجويني (ص:45).",
    "book_id": "267",
    "new_page_number": 8
  },
  {
    "serial_number": "3425124",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 10,
    "volume_number": 1,
    "text": "فتقسيم الأدلة إلى قطعي وظني من حيث هو تقسيم لا إشكال فيه؛ إذ هو واقع ماله من دافع، ولا يصح أن يرد وإنما الواجب أن لا يستعمل هذا التقسيمُ استعمالا إبليسيًّا في رد الأدلة ورفضها. إذا تبين هذا فلتعلمْ أن من أهم ما يضبط هذا الأمر هو الإجماع؛ لأن مزية دليل الإجماع أنه قاطع في دلالته، كما نص على هذا الغزالي في «المستصفى» (1) ، وابن قدامة في «روضة الناظر» (2) ونقله الزركشي في «البحر المحيط» (3) والشوكاني في «إرشاد الفحول» (4) عن الصيرفي وابن برهان والأصفهاني بل صرح الأصفهاني أنه المشهور. ومعنى أنه قاطع في دلالته أمران: الأمر الأول: أن دلالته لا تحتمل أكثر من وجه. الأمر الثاني: أنه لا يصح أن ينسخ؛ لأن الإجماع لم يكن إلا بعد وفاة النبي صلى الله عليه وسلم، فإذن لا يمكن أن ينسخ، بل العكس صحيح على الصحيح، فإنَّ الإجماع يدل على نسخ الأدلة؛ لأنه مستند على نص وليس هو الناسخ في نفسه (5) .",
    "foot_note": "1. انظر: «المستصفى» للغزالي ص 142 وما بعدها. \n2. انظر: «روضة الناظر» لابن قدامه (1/ 378) وما بعدها. \n3. انظر: «البحر المحيط» للزركشي (6/ 388). \n4. انظر: «إرشاد الفحول» للشوكاني (1/ 209). \n5. انظر في هذا: «المستصفى» للغزالي (1/ 101)، و «المحصول» للرازي (3/ 354)، و «الإحكام في أصول الأحكام» للآمدي (3/ 160 - 162)، و «البحر المحيط» للزركشي (5/ 284 - 289)، و «شرح مختصر الروضة» للطوفي (2/ 330 - 332) وغيرها.",
    "book_id": "267",
    "new_page_number": 9
  },
  {
    "serial_number": "3425125",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 11,
    "volume_number": 1,
    "text": "الفصل الأول مسائل متعلقة بالإجماع  المسألة الأولى: تعريف الإجماع لا ينبغي المبالغة في التعاريف كما هو مسلك المتكلمين الذين بالغوا في التعاريف والحدود، بحيث إنه لا يأتي أحدهم بحد إلا ويعترض عليه الآخر، بحجة أنه ليس جامعا أو ليس مانعا أو أن ألفاظه مترادفة إلى غير ذلك (1) . وإنما المقصود من التعريف تقريب المعرف، والمقصود من الحد تقريب المحدود، أما الحد الحقيقي فهذا لا وجود له، كما بينه شيخ الإسلام رحمه الله في «مجموع الفتاوى» (2) ، فالمقصود إذن من التعريف هو معرفة المحدود. وما كان السلف الأولون من فقهاء أهل الحديث، كمالك والشافعي وأحمد وغيرهم، يعتنون بهذه التعاريف، لذا لا تجدها في كتبهم، ولا تجدهم يعتنون بها فضلاً عن أن يبالغوا فيها، كما بينه شيخ الإسلام ابن تيمية رحمه الله تعالى في رده على المناطقة في «مجموع الفتاوى» (3) . فمعنى الإجماع من حيث الجملة: «أنه اتفاق مجتهدي الأمة على مسألة شرعية بعد وفاة النبي صلى الله عليه وسلم». وذلك أن البحث جار في المسائل الشرعية وجار في المجتهدين، والإجماع إنما يكون حجة بعد وفاة النبي صلى الله عليه وسلم.",
    "foot_note": "1. كما في: «الإحكام في أصول الأحكام» للآمدي (1/ 195 - 196)، و «البحر المحيط» للزركشي (6/ 379 - 382) وغيرهما. \n2. انظر: «مجموع الفتاوى» لشيخ الإسلام ابن تيمية (9/ 85 - 86). \n3. انظر المصدر السابق.",
    "book_id": "267",
    "new_page_number": 10
  },
  {
    "serial_number": "3425126",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 12,
    "volume_number": 1,
    "text": "وما وقع في حياته صلى الله عليه وسلم فإنه حجة لسببين: الأول: إما أنه اطلع عليه، فهو إقرار منه صلى الله عليه وسلم. الثاني: أو أن الله لم ينكره، فهذا إقرار من الله، فهو حجة على الصحيح. بل عزا ابن حجر حجيته إلى جماهير أهل العلم في كتابه «النكت على مقدمة ابن الصلاح» (1) . ومن الأدلة على ذلك: ما أخرج مسلم من حديث جابر قَالَ: «كُنَّا نَعْزِلُ (2) ، وَالْقُرْآنُ يَنْزِلُ» (3) . استدل على جواز العزل بأن الله لم ينكره، قال سفيان ابن عيينة: لو كان منهيا عنه لنهى عنه القرآن (4) . إذن الإجماع: «اتفاق مجتهدي الأمة على مسألة شرعية بعد وفاة رسول الله صلى الله عليه وسلم». وقال بعض المتكلمين كأبي بكر الباقلاني (5) والآمدي (6) في «أصول الأحكام» أن قول العوام يعتد به في الإجماع وفاقاً وخلافاً، بمعنى إذا خالف العامة لم يصح الإجماع. وهذا فيه نظر كبير بل هو خطأ؛ وذلك أن العوام في مسائل الشريعة تبع لأهل العلم، فإذا أجمع أهل العلم فالعوام تبع لهم ولا يصح للعامي أن يخالف. ذكره",
    "foot_note": "1. انظر «النكت على مقدمة ابن الصلاح» لابن حجر (2/ 515) وما بعدها. \n2. العَزْلُ: هو عَزْلُ الرَّجُلِ الماءَ عن جاريتِه إذا جَامَعَهَا لِئَلَّا تَحمِل. انظر: «لسان العرب» لابن منظور (11/ 441) \n3. أخرجه البخاري (5208)، ومسلم (1440). \n4. أخرجه مسلم (2/ 1065) رقم (1440). \n5. انظر: «المحصول» للرازي (4/ 196)، و «شرح مختصر الروضة» للطوفي (3/ 31). \n6. انظر: «الإحكام في أصول الأحكام» للآمدي (1/ 228).",
    "book_id": "267",
    "new_page_number": 11
  },
  {
    "serial_number": "3425127",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 13,
    "volume_number": 1,
    "text": "أبو الخطاب الحنبلي في «التمهيد» (1) . * * *  المسألة الثانية: أدلة الإجماع تنوَّعت الأدلة وتضافرت على حجية الإجماع، وإليك بعضها: الدليل الأول: قوله تعالى: {وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ مَا تَوَلَّى وَنُصْلِهِ جَهَنَّمَ وَسَاءَتْ مَصِيرًا} [النساء: 115]. استدل بهذه الآية جمع من الأصوليين كالآمدي في كتابه «أصول الإحكام» (2) ، وابن قدامة في «الروضة» (3) ، وشيخ الإسلام ابن تيمية كما في «مجموع الفتاوى» (4) ، بل أكثر من كَتبَ في الأصول إذا أورد مسألة الإجماع أتى بهذه الآية (5) ، وقد نسب هذا الاستدلال للشافعي بعضهم (6) ، ونازع آخرون في هذا الاستدلال (7) .",
    "foot_note": "1. انظر: «التمهيد في أصول الفقه» لأبي الخطاب (3/ 251). \n2. انظر: «الإحكام في أصول الأحكام» للآمدي (1/ 228). \n3. انظر: «روضة الناظر» لابن قدامة (1/ 380 - 381). \n4. انظر: «مجموع الفتاوى» لابن تيمية (19/ 178)، و (19/ 192). \n5. انظر: «المعتمد» لأبي الحسين (2/ 7)، و «التمهيد في أصول الفقه» لأبي الخطاب (3/ 251)، و «المحصول» للرازي (4/ 35 - 36)، و «التحبير شرح التحرير» للمرداوي (4/ 1531 - 1532)، و «الكوكب المنير» لابن النجار (2/ 215) وغيرهم. \n6. انظر: «أحكام القرآن» للشافعي (1/ 39)، وانظر قصة استدلاله في «سير أعلام النبلاء» للذهبي (10/ 83 - 84). وممن نسبه له: الآمدي في «الإحكام في أصول الأحكام» (1/ 200)، والغزالي في «المستصفى» (1/ 138)، وابن تيمية في «مجموع الفتاوى» (19/ 178) وغيرهم. \n7. انظر: «المستصفى» للغزالي (1/ 138).",
    "book_id": "267",
    "new_page_number": 12
  },
  {
    "serial_number": "3425128",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 14,
    "volume_number": 1,
    "text": "وجه الدلالة من هذه الآية: أن الله رتب العقوبة على ترك سبيل المؤمنين، فدل هذا على أن اتباع سبيل المؤمنين واجب، فإذن إذا كان المؤمنون من أهل العلم من المجتهدين على قول في هذه المسألة فإن قولهم حجة وهذا هو المقصود. الدليل الثاني: قوله سبحانه: {فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ذَلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا} [النساء: 59]. استدل بهذه الآية أبو الحسين (1) ، والآمدي (2) ، وشيخ الإسلام ابن تيمية كما في «مجموع الفتاوى» (3) وغيرهم. ووجه الدلالة: أنه يعمل مباشرة بما لم يحصل فيه نزاع بخلاف ما حصل فيه نزاع فإنه يرد للكتاب والسنة. الدليل الثالث: قوله تعالى {كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ} [آل عمران: 110] استدل بهذه الآية أبو الحسين (4) ، والآمدي (5) ، والطوفي (6) ، وشيخ الإسلام ابن تيمية (7) وغيرهم. ووجه الدلالة: أن الأمة إذا أجمعت على قول فإن هذا القول خير؛ لأنها أمرت به، ولو لم يكن خيرًا لوجد في الأمة من ينكر ذلك، ولا يمكن أن يُنقل لنا القول المرجوح والخطأ دون القول الراجح.",
    "foot_note": "1. انظر: «المعتمد» لأبي الحسين (2/ 15). \n2. انظر: «الإحكام في أصول الأحكام» للآمدي (1/ 218). \n3. انظر: «مجموع الفتاوى» لابن تيمية (1/ 9)، و (19/ 67)، و (19/ 91). \n4. انظر: «المعتمد» لأبي الحسين (2/ 6). \n5. انظر: «الإحكام في أصول الأحكام» للآمدي (1/ 214). \n6. انظر: «شرح مختصر الروضة» للطوفي (3/ 17). \n7. انظر: «مجموع الفتاوى» لابن تيمية (19/ 176).",
    "book_id": "267",
    "new_page_number": 13
  },
  {
    "serial_number": "3425129",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 15,
    "volume_number": 1,
    "text": "الدليل الرابع: قوله تعالى {وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا} [البقرة: 143]. والمراد بالوسط أي العدل والخيار، فإذا أجمع العلماء على قول فهذا هو القول الحق وهو الخيار الذي يحبه الله، وقد استدل بهذه الآية أبو الحسين (1) ، والآمدي (2) ، والطوفي (3) ، وشيخ الإسلام ابن تيمية (4) وغيرهم. الدليل الخامس: أخرج الشيخان من حديث معاوية بن أبي سفيان رضي الله عنهما قال: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: «لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَائِمَةً بِأَمْرِ اللهِ، لَا يَضُرُّهُمْ مَنْ خَذَلَهُمْ أَوْ خَالَفَهُمْ، حَتَّى يَأْتِيَ أَمْرُ اللهِ وَهُمْ ظَاهِرُونَ عَلَى النَّاسِ» (5) . وأخرجه الشيخان من حديث المغيرة بن شعبة (6) ، ومسلم من حديث جابر (7) ، وثوبان (8) ، وسعد بن أبي وقاص (9) ، وغيرهم من صحابة (10) رسول الله صلى الله عليه وسلم. وجه الدلالة من هذا الحديث: أن الأمة إذا أجمعت على قولٍ فحتمًا ولا بد أن يكون من بينها تلك الطائفة المنصورة التي لا تكون إلا على الحق؛ فبهذا يتبين أن هذا القول حقٌ، وهذا هو المراد إذ يدل على حجية الإجماع.",
    "foot_note": "1. انظر: «المعتمد» لأبي الحسين (2/ 4). \n2. انظر: «الإحكام في أصول الأحكام» للآمدي (1/ 211). \n3. انظر: «شرح مختصر الروضة» للطوفي (3/ 15). \n4. انظر: «مجموع الفتاوى» لابن تيمية (19/ 177). \n5. أخرجه البخاري (3641)، ومسلم (1037/ 174) - واللفظ له -. \n6. أخرجه البخاري (7311)، ومسلم (1921). \n7. أخرجه ومسلم (156)، و (1923). \n8. أخرجه ومسلم (1920). \n9. أخرجه ومسلم (1925). \n10. مثل عقبة بن عامر كما عند مسلم (1924)، وأبو هريرة كما عند ابن ماجه (7)، وقرة بن إياس كما عند الترمذي (2192)، وابن ماجه (6).",
    "book_id": "267",
    "new_page_number": 14
  },
  {
    "serial_number": "3425130",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 16,
    "volume_number": 1,
    "text": "ولنفرض أن الأمة في وقت أجمعت على قول معين فقطعًا هذا القول هو الراجح وهو الذي يحبه الله؛ لأن من بين المجمعين تلك الطائفة المنصورة. الدليل السادس: ثبت عند أحمد وغيره عن ابن مسعود رضي الله عنه أنه قال: « … ، فَمَا رَأَى الْمُسْلِمُونَ حَسَنًا، فَهُوَ عِنْدَ اللَّهِ حَسَنٌ، وَمَا رَأَوْا سَيِّئًا فَهُوَ عِنْدَ اللَّهِ سَيِّئٌ» (1) . هذا دليل على حجية الإجماع كما أفاده ابن حزم (2) ، وابن القيم في «الفروسية» (3) ، والشاطبي في «الاعتصام» (4) ، وغيرهم من أهل العلم. ورواه الخطيب البغدادي (5) مرفوعًا عن أنس رضي الله عنه، لكنه لا يصح من حديث أنس، كما بينه ابن حزم (6) ، وابن القيم في كتابه «الفروسية» (7) ، وابن عبد الهادي فيما نقله عنه العجلوني (8) ، والعلامة الألباني (9) . الدليل السابع: ثبت عند ابن أبي عاصم عن أبي مسعود البدري أنه قال: «عليكم بالجماعة، فإن الله لا يجمع أمة محمد صلى الله عليه وسلم على ضلالة» (10)",
    "foot_note": "1. أخرجه أحمد (3600)، والبزار (1816)، وابن الأعرابي في «المعجم» (861)، والطبراني في «المعجم الكبير» (9/ 112)، والحاكم (4465) وصححه، وغيرهم. \n2. انظر: «الإحكام في أصول الأحكام» لابن حزم (6/ 18 - 19). \n3. انظر: «الفروسية» لابن القيم (ص:299). \n4. انظر: «الاعتصام» للشاطبي (3/ 46، 325). \n5. أخرجه الخطيب البغدادي في «تاريخ بغداد» (5/ 270). \n6. انظر: «الإحكام في أصول الأحكام» لابن حزم (6/ 18). \n7. انظر: «الفروسية» لابن القيم (ص:298). \n8. انظر: «كشف الخفاء» للعجلوني (2/ 221). \n9. انظر: «السلسلة الضعيفة» للألباني (532). \n10. أخرجه ابن أبي عاصم في «السنة» (85)، وابن أبي شيبة (37615)، واللالكائي في «شرح أصول الاعتقاد» (1/ 122)، والحاكم (8545) وصححه.",
    "book_id": "267",
    "new_page_number": 15
  },
  {
    "serial_number": "3425131",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 17,
    "volume_number": 1,
    "text": "هذا نص في حجية الإجماع وقد جاء مرفوعًا (1) ، والأصح -والله أعلم-أنه لا يصح مرفوعًا، وإنما يصح من كلام أبي مسعود البدري رضي الله عنه، … إلى غير ذلك من الأدلة. * تنبيه: استدل بعض الأصوليين بأدلة لا دلالة فيها على حجية الإجماع، ومن ذلك: 1 - أنهم استدلوا بالأدلة التي تدل على أن لزوم الجماعة واجب وأن من خرج عن الجماعة ومات مات ميتة جاهلية. كالذي أخرجه مسلم عن أبي هريرة رضي الله عنه، أن النبي صلى الله عليه وسلم قال: «مَنْ خَرَجَ مِنَ الطَّاعَةِ، وَفَارَقَ الْجَمَاعَةَ فَمَاتَ، مَاتَ مِيتَةً جَاهِلِيَّةً» (2) . وأخرج أحمد وأبو داود من حديث أبي ذر رضي الله عنه، أن النبي صلى الله عليه وسلم قال: «مَنْ فَارَقَ الْجَمَاعَةَ شِبْرًا فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ» (3) . والأظهر والله أعلم أن الاستدلال بمثل هذا لا يصح، لأن المراد بالجماعة في هذا الحديث جماعة الأبدان وهو السمع والطاعة للحاكم في غير معصية الله، وليس المراد به اجتماع الأمة وإنما المراد به جماعة الأبدان. فقد ذكر الخطابي رحمه الله في كتابه «العزلة»: أن الفرقة نوعان فرقة أبدان وفرقة أديان، وفي المقابل الاجتماع يكون نوعين، اجتماع على الأبدان واجتماع على الأديان (4) .",
    "foot_note": "1. كما عند أبي داود (4253) من حديث أبي مالك الأشعري، وابن ماجه (3950) من حديث أنس وغيرهم. \n2. أخرجه مسلم (1848/ 53) من حديث أبي هريرة. \n3. أخرجه أحمد (21560)، وأبو داود (4758)، وصحَّح الألباني في «صحيح سنن أبي داود» (4758) طبعة المعارف. وأخرجه من حديث أبي مالك الأشعري أحمدُ (22910)، والترمذي (2863) وقال: حسن صحيح. وصحَّح الألباني في «صحيح سنن الترمذي» (2863) طبعة المعارف. \n4. انظر: «العزلة» للخطابي (ص:8).",
    "book_id": "267",
    "new_page_number": 16
  },
  {
    "serial_number": "3425132",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 18,
    "volume_number": 1,
    "text": "فالمراد بالجماعة في هذا الحديث جماعة الأبدان، أي الاجتماع على الحاكم في السمع الطاعة في غير معصية الله، ففرق بين هذا و بين إجماع الأمة على مسألة شريعة.  المسألة الثالثة  موقف أهل البدع من الإجماع أهل البدع - من حيث الجملة - مع الإجماع طائفتان: الطائفة الأولى: أنكرت الإجماع وقالت إن الإجماع ليس حجة، و أول من أنكر الإجماع واشتهر بذلك هو النظَّام المعتزلي كما عزاه إليه ابن قدامة في «روضة الناظر» (1) ونسبه إليه جماعة (2) ، وذكر شيخ الإسلام ابن تيمية (3) أن المعتزلة والشيعة خالفوا في حجية الإجماع. فإذن كل من أنكر حجية الإجماع فسلفه هو النظَّام المعتزلي، فإنه أول من خالف في حجية الإجماع (4) . والطائفة الثانية: صعَّبت وجود الإجماع ولم تصرح بإنكاره، فلسان مقالها يقول: نقر بالإجماع. ولسان حالها يقول: لا يوجد إجماع. ومثال ذلك: 1 - طائفة قالوا: لا يكون الإجماع إجماعًا حتى يجتمع العامة مع أهل العلم.",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 379). \n2. كـ: أبي الحسين في «المعتمد» (2/ 4)، والغزالي في «المستصفى» (1/ 137)، والآمدي في «الإحكام» (1/ 200)، والزركشي في «البحر المحيط» (6/ 384) وغيرهم. \n3. انظر: «مجموع الفتاوى» لابن تيمية (11/ 341). \n4. قال أبو المعالي الجويني في «البرهان في أصول الفقه» (1/ 261): أول من باح بِرَدِّه النظَّام، ثم تابعه طوائف من الروافض.",
    "book_id": "267",
    "new_page_number": 17
  },
  {
    "serial_number": "3425133",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 19,
    "volume_number": 1,
    "text": "وقد تقدم نسبة هذا القول إلى الباقلاني والآمدي، وحقيقة هذا القول أنه لا يوجد إجماع لصعوبة تحقق ذلك. فقد قال ابن قدامة: «وهذا القول يرجع إلى إبطال الإجماع؛ إذ لا يتصور قول الأمة كلهم في حادثة واحدة. وإن تصوّر: فمن الذي ينقل قول جميعهم، مع كثرتهم وتفرقهم في البوادي والأمصار والقرى؟!» (1) . 2 - وطائفة قالوا: إن الإجماع السكوتي ليس حجة، وسيأتي - إن شاء الله - بحث الإجماع السكوتي. ومعناه: أن يتكلم طائفة من أهل العلم ويشتهر هذا القول ولا ينكره آخرون. فقالت هذه الطائفة: إن هذا الإجماع ليس حجة. وهذا القول إذا دققتَ فيه وجدتَه رجع إلى قول المتكلمين، كما سيأتي بيانه - إن شاء الله -؛ إذ لازم القول بأن الإجماع السكوتي ليس حجة أن لا يوجد إجماع يحتج به. قال أبو بكر الجصاص في كتابه «الفصول في الأصول» ما ملخصه: ولازم إنكار الاحتجاج بالإجماع السكوتي أن لا يوجد إجماع (2) . وصدق رحمه الله.",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 391). \n2. انظر: «الفصول في الأصول» للجصاص (3/ 290). حيث قال: « \n…. ، فوجب بهذا أن يكون سكوتهم بعد ظهور القول وانتشاره: دلالة على الموافقة. ولو لم يصح الإجماع من هذا الوجه، لما صح إجماع أبدا، إذ غير ممكن أن يضاف شيء من الأشياء بقول إلى جميع الأمة: على أنها قد قالته ولفظت به، وإنما يعتمدون فيه على ظهور القول فيهم، من غير مخالف لهم».",
    "book_id": "267",
    "new_page_number": 18
  },
  {
    "serial_number": "3425134",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 20,
    "volume_number": 1,
    "text": "وذكر نحو هذا ابن قدامة في «روضة الناظر» (1) ، بل وقال في «المغني» لما ذكر مسألة ونقل فيها قول بعض الصحابة دون مخالف: لا سبيل إلى نقل قول جميع الصحابة في مسألة، ولا إلى نقل قول العشرة، ولا يوجد الإجماع إلا القول المنتشر (2) . ف ينبغي لأهل السنة أن لا يغتروا بأقوال أهل البدع، وأن يكونوا متبصرين . وممن خالف في حجية الإجماع أو ضيق كثيرًا الظاهرية، وسيأتي الكلام - إن شاء الله تعالى - على الظاهرية ومذهبهم في ذلك.  إيرادٌ وردُّه فإن قيل: ماذا يقال في قول الإمام أحمد: «من ادعى الإجماع فهو كاذب»؟ فيقال: الجواب من وجهين: الوجه الأول: أن الإمام أحمد قطعًا لم يردْ إنكار الإجماع، بدليل أن الإمام أحمد نفسه استدل بالإجماع في مسائل كثيرة، منها: 1 - قول الإمام أحمد: «أجمعوا على أن التكبير - أي المقيد -، يبتدئ من غداة يوم عرفة» (3) . 2 - وقوله: «أجمعوا على أن أولاد المسلمين في الجنة» (4) .",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 437)، حيث قال: « \n…. ، أنه لو لم يكن هذا إجماعًا: لتعذر وجود الإجماع؛ إذ لم ينقل إلينا في مسألة قول كل علماء العصر مصرحًا به». \n2. انظر: «المغني» لابن قدامة (2/ 310) بمعناه. \n3. انظر: «العدة في أصول الفقه» (4/ 1061)، و «المغني» لابن قدامة (2/ 292)، و «فتح الباري» لابن رجب (9/ 22،24). \n4. انظر: «أحكام أهل الملل» للخلال (1/ 11) بلفظ: «ليس فيه خلاف»، و «المغني» لابن قدامة (4/ 37) بلفظ: «ليس فيه اختلاف».",
    "book_id": "267",
    "new_page_number": 19
  },
  {
    "serial_number": "3425135",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 21,
    "volume_number": 1,
    "text": "3 - وقوله: «أجمع أهل العلم على أن بيع الدين بالدين لا يجوز» (1) . 4 - وقوله: «إجماع العلماء والأئمة المتقدمين على أن القرآن كلام اللَّه غير مخلوق، هذا الدين الذي أدركت عليه الشيوخ، وأدرك الشيوخ من كان قبلهم على هذا» (2) . 5 - وقوله: «أجمعوا على أن من تذكر صلاة حضر في سفر فإنه يصلي صلاة حضر» (3) . 6 - وقوله في قوله تعالى {وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ} [الأعراف: 204]: «أجمع الناس أن هذِه الآية في الصلاة» (4) . 7 - وقوله: «أجمعوا على أن الدم نجس» (5) . 8 - وقوله: «لم يختلف الناس أن الرجل إذا أسلم أنه على نكاحه» (6) . وغير ذلك من المسائل التي نقل فيها الإمام أحمد الإجماع وعدم الخلاف، فالمقصود أن الإجماعات عن الإمام أحمد ليست قليلة، فكيف ينكر الإجماع وهو نفسه استدل بالإجماع؟! الوجه الثاني: أن أصحاب الإمام أحمد لم يفهموا إنكار الإمام أحمد للإجماع؛ لذا انقسموا طوائف في توجيه كلامه كالتالي:",
    "foot_note": "1. انظر: «المغني» لابن قدامة (4/ 51). \n2. انظر: «طبقات الحنابلة» لابن أبي يعلى (1/ 172). \n3. انظر: «المغني» لابن قدامة (2/ 208)، بلفظ: «أما المقيم إذا ذكرها في السفر، فذاك بالإجماع يصلي أربعا». \n4. انظر: «مسائل أبي داود» (48). \n5. انظر: «شرح العمدة» لابن تيمية (1/ 105)، و «إغاثة اللهفان» لابن القيم (1/ 151). \n6. انظر: «أحكام أهل الملل» للخلال (509)، و (507).",
    "book_id": "267",
    "new_page_number": 20
  },
  {
    "serial_number": "3425136",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 22,
    "volume_number": 1,
    "text": "1 - فمنهم من حمله على الورع، كأبي يعلى في «العدة» (1) . 2 - ومنهم من حمله على الإجماع الذي يحكيه أهل البدع وليسوا أهلا لحكاية الإجماع، هذا القول الآخر الذي ذكره أبو يعلى في «العدة» (2) . وقريب منه ما ذكر شيخ الإسلام ابن تيمية رحمه الله تعالى في «بيان الدليل في بطلان التحليل» (3) ، وقريب منه ما ذكره ابن القيم في «إعلام الموقعين» (4) . 3 - وأيضًا لابن تيمية توجيه ثالث كما في «المسودة» قال: إن كلام الإمام احمد محمول على الإجماع بعد القرون المفضلة (5) . * وأظهر هذه التوجيهات أن كلام الإمام أحمد - رحمه الله تعالى - هو في حق من ليس أهلاً لحكاية الإجماع كأهل البدع وكأهل الرأي الذين يردون النصوص بالإجماعات، وهم ليسوا أهلاً لحكاية الإجماع؛ لذا قال الإمام أحمد: في تتمة الكلام هذه دعوى بشر والأصم … إلخ، أي دعوى أهل البدع. وقد بين ابن تيمية رحمه الله تعالى في «التسعينية»، أن أهل البدع كثيراً ما يحكون إجماعات في مسائل عقدية وهم مخطئون في ذلك، فقال رحمه الله: « … ، وهذا الإجماع نظير غيره من الإجماعات الباطلة المدعاة في الكلام وغيره -وما أكثرها-، فمن تدبر وجد عامة المقالات الفاسدة يبنونها على مقدمات لا تثبت إلّا بإجماع مدعى أو قياس، وكلاهما عند التحقيق يكون باطلًا» (6) .",
    "foot_note": "1. انظر: «العدة في أصول الفقه» لأبي يعلى (4/ 1060). \n2. انظر: «العدة في أصول الفقه» لأبي يعلى (4/ 1060). \n3. انظر: «بيان الدليل في بطلان التحليل» لابن تيمية (1/ 327). \n4. انظر: «إعلام الموقعين» لابن القيم (2/ 53 - 54)، و (3/ 558 - 559). \n5. انظر: «المسودة» لابن تيمية (ص:316). \n6. انظر: «التسعينية» لابن تيمية (2/ 492).",
    "book_id": "267",
    "new_page_number": 21
  },
  {
    "serial_number": "3425137",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 23,
    "volume_number": 1,
    "text": "المسألة الرابعة قسما الإجماع ينقسم الإجماع قسمين: القسم الأول: الإجماع القطعي. والقسم الثاني: الإجماع الظني. وينقسيم الإجماع إلى قطعي وظني في ثبوته لا في دلالته؛ لأن الإجماع في دلالته لا يخرج عن كونه قاطعًا وقطعيًا - كما تقدم - وإنما البحث في ثبوته. فالإجماع في ثبوته ينقسم قطعيًا وظنيًا، ذكر هذا ابن قدامة في «روضة الناظر» (1) ، وابن تيمية كما في «مجموع الفتاوى» (2) ، والزركشي في «البحر المحيط» (3) ، وغيرهم من أهل العلم. وضابط الإجماع القطعي: - والله أعلم -: هو ما كان مبنياً على نص ظاهرٍ وتوارد العلماء عليه، كإيجاب الصلاة والزكاة ونحوِ ذلك، فإذا وجد نص ظاهر توارد العلماء عليه فمثل هذا يقال إنه إجماع قطعي، وهذا مستفاد من كلام شيخ الإسلام (4) رحمه الله تعالى والزركشي (5) وقد صرح به شيخنا العلامة ابن عثيمين (6) رحمه الله تعالى. أما الإجماع الظني: فهو خلاف ذلك مما رجع إلى استقراء أهل العلم (7) .",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 440 - 441). \n2. انظر: «مجموع الفتاوى» لابن تيمية (19/ 267 - 268). \n3. انظر: «البحر المحيط» للزركشي (6/ 414 - 415). \n4. انظر: «مجموع الفتاوى» لابن تيمية (19/ 267 - 268). \n5. انظر: «البحر المحيط» للزركشي (6/ 499). \n6. انظر: «الأصول من علم الأصول» لابن عثيمين (ص:65 - 66). \n7. انظر: «مجموع الفتاوى» لابن تيمية (19/ 267)، و «الأصول من علم الأصول» لابن عثيمين (ص:65 - 66).",
    "book_id": "267",
    "new_page_number": 22
  },
  {
    "serial_number": "3425138",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 24,
    "volume_number": 1,
    "text": "سؤال وجواب هل يُحكم بكفر منكر الإجماع؟ وللجواب عن هذا السؤال لابد من التفرقة بين من أنكر الإجماع القطعي، وبين من أنكر الإجماع الظني. فالأول: يُحكم بكفره؛ لأنه ينكر النصوص الظاهرة كإيجاب الزكاة والصلاة. والثاني: لا يكفر مثله. ذكر هذا شيخ الإسلام ابن تيمية كما في «مجموع الفتاوى» (1) ، الزركشي في «البحر المحيط» (2) . تنبيه: ومما ينبغي أن يعلم: أن الإجماع الظني على مراتب فليس على مرتبة واحدة، فيما نقله الزركشي (3) . وصدق رحمه فليس الإجماع الذي يتوارد العلماء على حكايته كالإجماع الذي لا يحكيه إلا عالم واحد فهو يتفاوت في قوته.  المسألة الخامسة الإجماع السكوتي وهذه المسألة من المسائل المهمة التي ينبغي ضبطها ضبطًا علميًا؛ لكثرة الشبهات والإشكالات التي تَرِدُ عليها، وسيأتي بحث ذلك -إن شاء الله-. فالمراد بالإجماع السكوتي: أن ينطق طائفة من أهل العلم ويسكت الباقون. وبعضهم يقول: تتكلم طائفة من أهل العلم ويشتهر قولهم ولا يخالفهم",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (19/ 270). \n2. انظر: «البحر المحيط» للزركشي (6/ 496) وما بعدها. \n3. انظر: «البحر المحيط» للزركشي (6/ 389).",
    "book_id": "267",
    "new_page_number": 23
  },
  {
    "serial_number": "3425139",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 25,
    "volume_number": 1,
    "text": "آخرون (1) . والعلماء مع الإجماع السكوتي على قولين: 1 - منهم من يجعل الإجماع السكوتي خاصاً بالصحابة. 2 - ومنهم من يعممه للصحابة ومن بعدهم. قد ذكر القولين العلائي في «إجمال الإصابة في حجية قول الصحابة» (2) . والقول بحجية الإجماع السكوتي هو الصحيح لا محالة (3) . بل إن القول بعدم حجيته هو كالقول بأن الإجماع ليس حجة؛ لأنه لا يوجد إجماع إلا الإجماع السكوتي، فلا يوجد إجماع منطوق كما تقدم في كلام الجصاص (4)",
    "foot_note": "1. انظر تعريفات الإجماع السكوتي في: «الإحكام» للآمدي (1/ 252)، و «إجمال الإصابة في أقوال الصحابة» للعلائي (ص:20)، و «البحر المحيط» للزركشي (6/ 456)، و «شرح مختصر الروضة» للطوفي (3/ 78) وغيرهم. \n2. انظر: «إجمال الإصابة في أقوال الصحابة» للعلائي (ص:20) وما بعدها، وانظر «البحر المحيط» للزركشي (6/ 465 - 467). \n3. وبه قال: أحمد بن حنبل، وجمهور الحنفية، والمالكية، والشافعية. وقال ابن برهان: وإليه ذهب كافة العلماء. «إجمال الإصابة في أقوال الصحابة» للعلائي (ص:20)، و «البحر المحيط» للزركشي (6/ 457). \n4. وقال الجصاص أيضًا كما في «الفصول في الأصول» للجصاص (3/ 285 - 286): «ثم لا يخلو من ينعقد به الإجماع: من أن يكون وجود إجماعه معتبرا، بأن نعرف قول كل واحد منهم بعينه، أو أن يظهر القول من بعضهم، وينتشر في كافتهم من غير إظهار خلاف من الباقين عليهم، ولا نكير على القائلين به، وغير جائز أن تكون صحة الإجماع موقوفة على وجود القول في المسألة من كل واحد منهم، بوفاق الآخرين؛ لأن ذلك لو كان شرط الإجماع لما صح إجماع أبدا، إذ لا يمكن لأحد من الناس أن يحكي في شيء من الأشياء قول كل أحد من أهل عصر انعقد إجماعهم على شيء، إن شئت من الصدر الأول، وإن شئت ممن بعدهم. فلما ثبت عندنا صحة إجماع الأمة بما قدمنا من الدلائل وامتنع وجود الإجماع بإثبات قول كل أحد من الصحابة والتابعين في مسألة، علمنا: أن هذا ليس بشرط».",
    "book_id": "267",
    "new_page_number": 24
  },
  {
    "serial_number": "3425140",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 26,
    "volume_number": 1,
    "text": "وابن قدامة (1) . إيراد ورده فإن قال قائل: اشتهر عند بعض أهل العلم أن الشافعي خالف في حجية الإجماع السكوتي حيث قال: «لا ينسب إلى ساكت قول» (2) . فدل هذا على أن الشافعي لا يرى الإجماع السكوتي حجة. يقال: قد خالف في نسبة هذا إلى الشافعي جمع من أهل العلم، وممن خالف في ذلك محقق المذهب الشافعي وإمامه أبو حامد الإسفراييني، وأبو حامد الشيرازي، والنووي رحمه الله تعالى، فقد نصوا على أن الشافعي يرى الإجماع السكوتي حجة في القديم وفي الجديد، وذكروا أمثلة للشافعي رحمه الله تعالى تدل على أن الإجماع السكوتي حجة (3) . بل ذكر ابن برهان: أن القول بحجية الإجماع السكوتي هو الذي عليه الأئمة (4) . وصدق -رحمه الله تعالى- فإن أول من خالف في حجيته هم المتكلمون. أما أئمة الإسلام فهم متواردون على أن الإجماع السكوتي حجة وذلك أنهم لما قالوا الإجماع حجة واحتجوا به عمليًا في مسائل كثيرة فهم يرون بهذا أن الإجماع السكوتي حجة. والأظهر -والله أعلم- أن الإجماع السكوتي لا يخص بالصحابة كما هو صنيع العلماء والمتوارد من صنيعهم، بل في الصحابة ومن بعدهم، كما سيأتي بيان هذا إن شاء الله تعالى.",
    "foot_note": "1. انظر: «روصة الناظر» لابن قدامة (1/ 391). \n2. انظر نسبة هذا القول للشافعي في: «التبصرة في أصول الفقه» للشيرازي (ص: 517)، و «البرهان في أصول الفقه» لإمام الحرمين (1/ 271) وغيرهما. \n3. انظر: «البحر المحيط» للزركشي (6/ 457) نقلًا عن «شرح الوسيط» للنووي. \n4. انظر: «البحر المحيط» للزركشي (6/ 457).",
    "book_id": "267",
    "new_page_number": 25
  },
  {
    "serial_number": "3425141",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 27,
    "volume_number": 1,
    "text": "بل إن الصحابة قد يختلفون على قولين، فينعقد الإجماع بعد ذلك فيعمل العلماء بهذا الإجماع. وهذا مما يدل على أن الإجماع السكوتي ليس خاصًا بالصحابة. ومن أمثلة ذلك: أن الصحابة اختلفوا في الذي جامع -أي أولج- بلا إنزال؟ هل يجب عليه الغسل أم لا؟ فيه قولان للصحابة (1) ، لكن انعقد الإجماع بعد ذلك ونص عليه ابن المنذر (2) وابن عبد البر (3) وغيرهم من أهل العلم وسيأتي -إن شاء الله- ذكر أمثلة أخرى. فالمقصود أن الإجماع السكوتي ليس خاصًا بالصحابة بل هو مطرد في أهل العلم، فإذا ذكر عالم مسألة واشتهر عنه فإنه حجة. ويظهر لي - والله أعلم - أن تقييد الأمر بالاشتهار وعدم الاشتهار ليس عمليًا، فمجرد أن يذكر عالمٌ قولًا ولا يعرف عن غيره إنكار فهو حجة، وذلك لأمرين: الأول: أنه لو كان منكراً فلا بد أن يوجد في الأمة من ينكره، ولا يمكن أن الله ينقل لنا القول المرجوح دون الراجح، فقد ذكر ابن القيم في كتابه «إعلام الموقعين» (4) أن القول المرجوح خطأ من وجه، فلا ينقل مرجوح دون الراجح.",
    "foot_note": "1. انظرهما في: «الأوسط» لابن المنذر (2/ 76) وما بعدها، و «التمهيد» لابن عبد البر (23/ 100) وما بعدها. \n2. انظر: «الأوسط» (2/ 81)، و «الإجماع» (24) وكلاهما لابن المنذر. \n3. انظر: «التمهيد» لابن عبد البر (23/ 105). لكنه قال: «على هذا القول جمهور أهل الفتوى بالحجاز والعراق والشام ومصر وإليه ذهب مالك والشافعي وأبو حنيفة وأصحابهم والليث بن سعد والأوزاعي والثوري وأحمد بن حنبل وإسحاق وأبو ثور وأبو عبيد والطبري». \n4. انظر: «إعلام الموقعين» لابن القيم (5/ 569) (6/ 37).",
    "book_id": "267",
    "new_page_number": 26
  },
  {
    "serial_number": "3425142",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 28,
    "volume_number": 1,
    "text": "الثاني: أننا مأمورن باتباع سبيل المؤمنين، والذي يعرف من سبيل المؤمنين في هذه المسألة هو قول هذا الرجل سواء كان صحابياً أو تابعياً أو من بعده ولا يعرف عن غيره مخالفته، ونحن مأمورون باتباع سبيل المؤمنين، فإذن يجب اتباع هذا القول لأنه سبيل المؤمنين في هذه المسألة فيما نعلم. إذن الإجماع السكوتي حجة على أي صورة كانت وهذا هو الشائع عمليًا عند العلماء فقد تواردوا على قول ابن عباس الذي أخرجه مالك في الموطأ: «من ترك نسكًا أو نسيه فليهرق دمًا» (1) ، وعملوا به؛ لأن ابن عباس قال به ولم يعارضه أحد من أهل العلم وفقهاء الإسلام المشهورين بل احتجوا به، والأمثلة على ذلك كثيرة. * * *  المسألة السادسة حتمية استناد الإجماع على نص لا بد أن يكون الإجماع مستندًا على نص فلا يمكن للإجماع أن يكون حجة إلا أن يستند على نص وما من إجماع إلا وهو مستند على نص، فمتى ما قيل بصحة هذا الإجماع فقطعاً هو مستند على نص، والدليل على هذا أدلة: الدليل الأول: قوله تعالى {فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ} [النساء: 59]، فإذن عند التنازع نرده إلى الله وإلى الرسول، وعند الاتفاق نعمل به؛ لأنه مما دل عليه كلام الله وكلام رسوله صلى الله عليه وسلم، ذكر هذا ابن تيمية كما في «مجموع الفتاوى» (2) . الدليل الثاني: قوله تعالى: {وَمَنْ يُشَاقِقِ الرَّسُولَ مِنْ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدَى وَيَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ} [النساء: 115]، فجعل سبيل المؤمنين موافقاً لما جاء به الرسول، فإذن كل إجماع فهو مستند على نص.",
    "foot_note": "1. انظر: «الموطأ - رواية يحيى الليثي» للإمام مالك (1/ 419) رقم (240) طبعة إحياء التراث. \n2. انظر: «مجموع الفتاوى» لابن تيمية (19/ 91).",
    "book_id": "267",
    "new_page_number": 27
  },
  {
    "serial_number": "3425143",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 29,
    "volume_number": 1,
    "text": "الدليل الثالث: أنه لم يخالف في ذلك إلا من شذ كما بين ذلك الآمدي (1) ، فيكفي أن يعلم أن المخالف في ذلك ممن شذوا. الدليل الرابع: أن العلماء لما قالوا في مسألة بقول فإما قالوه بالرأي المجرد أو برأي مستند إلى دليل وقطعاً أنه الثاني، فلما كان الثاني فدل هذا على أن ما أجمعوا عليه فهو مستند على نص قطعا، لكن لا يشترط أن يُعرف هذا المستند ولا يتوقف الاستدلال عليه، بل يتم الاستدلال مباشرة بمجرد معرفة الإجماع في مسألةٍ ما. سؤال وجواب هل يجب أن يوجد في الأمة من يعرف مستند الإجماع؟ لشيخ الإسلام كلامٌ يدل على هذا، وإن كان كلامه فيما وقفتُ عليه ليس صريحا، فأصرح ما وقفت عليه في كتابه «الجواب الصحيح» (2) ، علمًا أن له كلامًا صريحًا في مسألة النسخ بالإجماع وأنه لا بد أن يعرف مستند الإجماع الذي ينسخ النص (3) . وقال ابن تيمية: وابن جرير وطائفة يقولون: لا ينعقد الإجماع إلا عن نص نقلوه عن الرسول مع قولهم بصحة القياس. ونحن لا نشترط أن يكونوا كلهم علموا النص فنقلوه بالمعنى كما تنقل الأخبار لكن استقرأنا موارد الإجماع فوجدناها كلها منصوصة وكثير من العلماء لم يعلم النص وقد وافق الجماعة كما أنه قد يحتج بقياس وفيها إجماع لم يعلمه فيوافق الإجماع (4)",
    "foot_note": "1. انظر: «الإحكام» للآمدي (1/ 261). \n2. انظر: «الجواب الصحيح لمن بدل دين المسيح» لابن تيمية (1/ 361 - 362). \n3. انظر: «مجموع الفتاوى» لابن تيمية (28/ 112). \n4. مجموع الفتاوى (19/ 196)",
    "book_id": "267",
    "new_page_number": 28
  },
  {
    "serial_number": "3425144",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 30,
    "volume_number": 1,
    "text": "و المهم أنه إذا قيل لا بد أن يكون في الأمة من يعرف مستند الإجماع. فإنه يقال: هذا لا ينفعنا عملياً؛ لأننا عملياً متى ما رأينا الإجماع احتججنا به سواء علمنا المستند أو لم نعلم وسواء علمنا في الأمة من يعرف مستنده أم لا؛ وذلك أن الشريعة بينت أن الإجماع حجة ولم تشترط معرفة المستند إذن كل دليل يدل على أن الإجماع حجة فهو دليل على عدم اشتراط معرفة المستند.  المسألة السابعة حجية الإجماع قبل الخلاف وبعده والمراد من هذه المسألة: بيان أنَّ الإجماع حجة سواءٌ انعقد الإجماع بعد خلاف، أو حدثَ خلاف بعد إجماع. فأما الإجماع الذي حدث بعده خلاف فلا شك أنه حجة والمخالفون يجب عليهم أن يرجعوا إلي الإجماع، ويدل لذلك كل دليل يدل على أن الإجماع حجة، فمن خالف الإجماع القديم فقطعاً أن خلافه خطأ؛ لأنه خالف الحق وهو ما أجمع عليه أهل العلم. وهذا له نظائر وأمثلة حتى قال ابن القيم رحمه الله كما في «مختصر الصواعق»: لهذا مئتا مثال (1) . أي: أنه قد حصل إجماع قديم ثم حصل خلاف، وهذا من الفقه الدقيق، الذي ينبغي لطالب العلم أن يدقق فيه، فإنه يوجد مسائل غير قليلة يحكى فيها خلاف وإذا دقق في الأمر تبين أن الخلاف بعد إجماع سابق، فلذا يرد الخلاف بالإجماع السابق.",
    "foot_note": "1. انظر: «مختصر الصواعق» لابن القيم (ص:276). بلفظ: « \n…. ، وأبلغ من هذه حكاية الإجماع كثيرا على ما الإجماع القديم على خلافه، وهذا كثير جدا وإنما يعلمه أهل العلم، ولو تتبعناه لزاد على مائتي موضع».",
    "book_id": "267",
    "new_page_number": 29
  },
  {
    "serial_number": "3425145",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 31,
    "volume_number": 1,
    "text": "وكذلك ينعقد الإجماع بعد خلاف، بمعنى أن يكون في المسألة قولان ثم يجمع العلماء على أحد هذين القولين، وهذا الإجماع حجة، ويدل على أنه حجة كل دليل يدل على أن الإجماع حجة، فلما أجمع العلماء على أحد القولين فقد كشف لنا إجماعهم الراجح من هذين القولين وبيَّن لنا أن القول الأول هو الصحيح دون القول الثاني (1) . ومما أنبه إليه أن أبا يعلى في «العدة» (2) ، نسب للإمام أحمد رواية أنه لا يرى أن الإجماع بعد الخلاف حجة. لكن في هذه النسبة، وفما اعتمد عليه نظر؛ لذلك لم يوافقه أبو الخطاب الحنبلي (3) -وهو تلميذ أبي يعلى - في أن يجعل هذا القول رواية عن الإمام أحمد، ومثله ابن قدامة في «روضة الناظر» (4) . وصنيع أهل السنة العملي: يدل على أنه حجة، فأهل السنة استدلوا بحرمة الخروج على السلطان بإجماع أهل العلم، مع أنه قد حصل خلاف بين التابعين لكن انعقد الإجماع بعد ذلك. وثمة أمثلة لهذه المسألة، منها: المثال الأول: مسألة الخروج على السلطان كان في المسألة خلاف بين التابعين ثم انعقد الإجماع بعد ذلك قال ابن تيمية في «منهاج السنة»: استقر قول أهل السنة على عدم الخروج على السلطان (5) .",
    "foot_note": "1. انظر في هذا: «المعتمد» لأبي الحسين (2/ 38)، و «الإحكام» للآمدي (1/ 275)، و «البحر المحيط» للزركشي (6/ 504)، و «شرح مختصر الروضة» للطوفي (3/ 95) وغيرهم. \n2. انظر: «العدة» لأبي يعلى (4/ 1105). \n3. انظر: «التمهيد في أصول الفقه» لأبي الخطاب (3/ 298). \n4. انظر: «روضة الناظر» لابن قدامة (1/ 428 - 429). \n5. انظر: «منهاج السنة» لابن تيمية (4/ 529).",
    "book_id": "267",
    "new_page_number": 30
  },
  {
    "serial_number": "3425146",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 32,
    "volume_number": 1,
    "text": "وحكى الإمام أحمد في «أصول السنة» (1) ، وعلي بن المديني (2) ، والرازيان في «رسالتهما في الاعتقاد» (3) ، وابن أبي زيد القيرواني (4) والمزني (5) وجمع كبير من أئمة السنة إجماعَ أهل السنة على ذلك بل نصوا على أن من خالف فهو مبتدع، فهذا يدل على أنهم يرون أن المسألة إجماعية ولو أنه حصل خلاف قبل ذلك في عهد التابعين. المثال الثاني: أن الصحابة اختلفوا في ربا الفضل. ذهب ابن عباس (6) إلى أنه ليس من الربا وتبعه بعض أصحابه، لكن انعقد الإجماع بعد ذلك (7) . المثال الثالث: لحوم الحمر الأهلية فقد حصل خلاف بين الصحابة في حرمتها (8) ، ثم انعقد الإجماع على حرمتها (9) . المثال الرابع: وجوب الغسل لمن جامع بلا إنزال، وقد تقدم أن في المسألة خلافًا ثم انعقد الإجماع.",
    "foot_note": "1. انظر: «أصول السنة» للإمام أحمد (ص:46). \n2. انظر: «شرح أصول اعتقاد أهل السنة» لللالكائي (1/ 189) رقم (318) في فصل اعتقاد علي ابن المديني. \n3. انظر: «شرح أصول اعتقاد أهل السنة» لللالكائي (1/ 199) رقم (321)، و (1/ 204) رقم (323) في فصل اعتقاد الرازيَين. \n4. انظر: «مقدمة رسالة القيرواني» (ص:61)، ط دار العاصمة. \n5. انظر: «شرح السنة» للمزني (ص:84). \n6. انظر: «الأوسط» لابن المنذر (10/ 181). \n7. انظر الإجماع في: «الأوسط» لابن المنذر (10/ 180). \n8. انظر الخلاف في: «التمهيد» لابن عبد البر (10/ 123)، ونقله في «المغني» (9/ 409) وأقره. \n9. انظر الأجماع في: «الأوسط» لابن المنذر (2/ 428)، وفي «التمهيد» لابن عبد البر (10/ 123).",
    "book_id": "267",
    "new_page_number": 31
  },
  {
    "serial_number": "3425147",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 33,
    "volume_number": 1,
    "text": "والأمثلة على هذه ليست قليلة، والدليل على أنه حجة هو كل دليل يدل على أن الإجماع حجة؛ وذلك أن الإجماع يكشف القول الراجح من القول المرجوح. أما من خالف في ذلك من المتكلمين وبعض الأصوليين الذين تأثروا بالمتكلمين لما قالوا: إن الأقوال لا تموت بقول قائليها. فقولهم مرجوح لما تقدم ذكره. * * *  المسألة الثامنة ضابط القول الشاذ كثيرا ما يقع ناظراك في كلام أهل العلم على قولهم: «إن هذا القول شاذ»، فما ضابط ذلك القول الشاذ؟ فيقال وبالله - تعالى - التوفيق: ضابط القول الشاذ - والله أعلم - هو: القول المخالف للإجماع. فإذا انعقد الإجماع على مسألة ثم حدث قول فإن هذا القول شاذ. وهذا الذي ذكرته مستفاد من صنيع ابن قدامة في «روضة الناظر» (1) . وقد حصل توسع عند كثير من أهل العلم في وصف قول بأنه شاذ حتى إذا اشتهر في أهل البلد قول وخالفه أحد قالوا: إن قوله شاذ بحجة أنه خالف أهل البلد أو الشائع والمنتشر. وهذا خطأ، فقد يكون القول الذي اشتهر عند أهل البلد ليس عليه إلا المذهب الذي شاع عند أهل البلد، كأن يشيع عندهم المذهب الحنبلي فيتبنى هذا القول أصحاب أهل البلد؛ لأنهم حنابلة وهذا القول من أفراد المذهب الحنبلي فإذا خالفهم أحد لدليل يراه متبعا في ذلك الحنفية والمالكية والشافعية وصف قوله",
    "foot_note": "1. انظر: «روضة الناظر» لابن قدامة (1/ 410)، ولفظه: «والشذوذ يتحقق بالمخالفة بعد الوفاق».",
    "book_id": "267",
    "new_page_number": 32
  },
  {
    "serial_number": "3425148",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 34,
    "volume_number": 1,
    "text": "بأنه شاذ وهذا خطأ، ولا ينبغي أن يتوسع في استعمال الشاذ بل يجب أن يضبط بضابطه وهو كل قول مخالف للإجماع. سؤال وجواب قد يجري خلاف بين الصحابة والتابعين ثم ينعقد الإجماع على أحد الأقوال فهل يقال بأن قول الصحابي الأول الذي خالف أو التابعي يعد شاذًّا؟ وجواب هذا أن يقال: إنه قبل انعقاد الاجماع كان الخلاف سائغا؛ لأن الإجماع لم ينعقد فلا يوصف بأنه شاذ، أما بعد انعقاد الإجماع فإن قوله يوصف بالشذوذ؛ لأنه تبنى قولاً مخالفاً للإجماع وقد استعمل هذا ابن عبد البر في مسائل. * * *  المسألة التاسعة حجية إجماع أهل كل فن في فنِّهم وهذا مما ذكره الرازي في «المحصول» (1) ، وابن قدامة في «روضة الناظر» (2) ، وشيخ الإسلام ابن تيمية رحمه الله تعالى كما في «مجموع الفتاوى» (3) ، والزركشي في «البحر المحيط» (4) ، وابن القيم كما في «مختصر الصواعق» (5) ، وغيرهم. وقال أبو حاتم في «المراسيل»: واتفاق أهل الحديث على شيء يكون حجة (6) .",
    "foot_note": "1. انظر: «المحصول» للرازي (4/ 198). \n2. انظر: «روضة الناظر» لابن قدامة (1/ 392 - 393). \n3. انظر: «مجموع الفتاوى» لابن تيمية (18/ 49، و 51) والمنهاج (8/ 418، 419). \n4. انظر: «البحر المحيط» للزركشي (6/ 415). \n5. انظر: «مختصر الصواعق» لابن القيم (ص: 563). \n6. انظر: «المراسيل» لابن أبي حاتم (ص:192).",
    "book_id": "267",
    "new_page_number": 33
  },
  {
    "serial_number": "3425149",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 35,
    "volume_number": 1,
    "text": "فإذا أجمع أهل الحديث على قول فهو حجة، وإذا أجمع أهل الفقه على قول فهو حجة، بل إذا أجمع أهل اللغة على قول فهو حجة عند أهل اللغة، فإذن  إجماع أهل كل فن حجة . ومن الإجماعات في اللغة: أن الأزهري حكى إجماع أهل اللغة على أن الإيمان لغة التصديق (1) ، والمراد في اللغة لا في الشرع. وهذا حجة؛ لأن إجماع أهل كل فن حجة، ومن خالف فهو محجوج بهذا الإجماع. وأما في الشرع فهو: قول وعمل واعتقاد يزيد بالطاعة وينقص بالمعصية (2) . إيرادٌ ودره فإن قيل: تقدم أن الإجماع حجة في الشرع؛ لأن الشرع محفوظ فكيف يطرد هذا في اللغة؟ يقال: لأن اللغة وسيلة لفهم الشرع؛ لذا ذكر المعلمي رحمه الله: أن اللغة محفوظة بحفظ القرآن، قال سبحانه: {إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ} [الحجر: 9]، قال: ومن ذلك أن لغة العرب محفوظة لأن بها يفهم القرآن (3) .",
    "foot_note": "1. انظر: «تهذيب اللغة» للأزهري (15/ 368). بلفظ: «واتفق أهل العلم من اللغويين وغيرهم أن (الإيمان) معناه: التصديق». \n2. قال شيخ الإسلام ابن تيمية في «مجموع الفتاوى» (3/ 151): «ومن أصول أهل السنة أن الدين والإيمان قول وعمل: قول القلب واللسان، وعمل القلب واللسان والجوارح وأن الإيمان يزيد بالطاعة وينقص بالمعصية». وقال-ناقلًا كلام ابن عبد البر مقرًا له- (7/ 330): «أجمع أهل الفقه والحديث على أن الإيمان قول وعمل ولا عمل إلا بنية والإيمان عندهم يزيد بالطاعة وينقص بالمعصية والطاعات كلها عندهم إيمان \n…. ». \n3. انظر: «التنكيل» للمعلمي اليماني (1/ 234).",
    "book_id": "267",
    "new_page_number": 34
  },
  {
    "serial_number": "3425150",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 36,
    "volume_number": 1,
    "text": "مسألة لا يعتد بقول المتكلمين سواء في الفقه أو في أصول الفقه وفي العقيدة من باب أولى؛ لأن المتكلمين ليسوا أهل علم. قال ابن عبد البر: «أجمع أهل الفقه والآثار من جميع الأمصار أن أهل الكلام أهل بدع وزيغ ولا يعدون عند الجميع في طبقات الفقهاء، وإنما العلماء أهل الأثر والتفقه فيه ويتفاضلون فيه بالإتقان والميز والفهم» (1) . فإذا خالف المتكلمون في مسألة فإنه لا يحتج بخلافهم وقد بين هذا الإمام ابن القيم رحمه الله تعالى (2) . فإذن إذا حصل إجماع لأهل السنة في مسألة عقدية؛ فإنه لا يحتج بمخالفة المتكلمين، أما إذا كان المتكلم فقيها فيعتد بقوله في الفقه؛ لأنه فقيه لا لأنه متكلم، لكن عملياً لو أن هذا الرجل خالف في مسألة وانفرد بها فإن قوله محدث؛ لأن مذهب المتكلمين متأخر فيكون محجوجاً بالإجماع الذي قبله. * * *  المسألة العاشرة شرطية انقراض العصر في الإجماع ثمة طائفة اشترطوا لصحة الإجماع أن ينقرض العصر فلو أن العلماء في عصر الصحابة أجمعوا على قول، فإن هذا الإجماع لا يعتد به حتى ينتهي هذا العصر وينقرض مجتهدوه، فإذا انقرض مجتهدوه ولم يرجع أحد منهم عن قوله فإن الإجماع يكون صحيحاً، لكن لو اجتمعوا على قول ثم أحد الصحابة المتأخرين",
    "foot_note": "1. انظر: «جامع بيان العلم وفضله» لابن عبد البر (2/ 942). \n2. كما في: «مختصر الصواعق» لابن القيم (ص: 563).",
    "book_id": "267",
    "new_page_number": 35
  },
  {
    "serial_number": "3425151",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 37,
    "volume_number": 1,
    "text": "وفاة كأنس أو جابر رجعوا فإن هذا الإجماع لا يعتد به (1) . وهذا القول من جهة الدليل مرجوح ولا يعول عليه؛ لأن الأدلة واضحة في حجية الإجماع ولم تشترط انقراض العصر، وتقدم ذكر الأدلة، فمتى ما تحقق الإجماع صار حجة ولو تحقق لحظة لعموم الأدلة. ويؤيد ذلك أنهم إذا اجتمعوا ولو لحظة فإن من بينهم الفرقة الناجية، وقول الفرقة الناجية حق على ما تقدم تقريره. إذن اشتراط انقراض العصر لا دليل عليه، بل الأدلة على خلافه، وما استدل به القائلون باشتراط انقرض العصر فمردود عليهم، وإليك بيان بعضه: 1 - نسب ذلك أبو يعلى (2) إلى الإمام أحمد وبناه على ما رواه البيهقي وغيره أن علي بن أبي طالب رضي الله عنه رجع عن قوله بحرمة بيع أمهات الأولاد وقال عبيدة السلماني التابعي المعروف: «إن رأيك مع رأي عمر أحب إلي من رأيك وحدك» (3) . فوجه الدلالة: أنه صح لعلي أن يخالف الإجماع فإنه لما اتفق قوله وقول عمر صارت المسألة إجماعًا فصح له أن يخالف ذلك؛ لأن عليًّا يرى أن الإجماع",
    "foot_note": "1. انظر في هذا: «المعتمد» لأبي الحسين (2/ 41) وما بعدها، و (2/ 70)، و «العدة في أصول الفقه» لأبي يعلى (4/ 1095) وما بعدها، و «التمهيد في أصول الفقه» لأبي الخطاب (3/ 346) وما بعدها، و «الإحكام» للآمدي (1/ 256 - 261)، و «المحصول» للرازي (4/ 147)، و «البحر المحيط» للزركشي (6/ 478) وغيرها. \n2. انظر: «العدة في أصول الفقه» لأبي يعلى (4/ 1095). \n3. أخرجه عبد الرزاق في «المصنف» (13224)، وابن أبي شيبة في «المصنف» (6/ 436)، والبيهقي في «السنن الكبرى» (10/ 343، و 438)، وابن عبد البر في «بيان جامع العلم وفضله» (1616) وغيرهم، وصححه الألباني في «السلسلة الصحيحة» (5/ 416).",
    "book_id": "267",
    "new_page_number": 36
  },
  {
    "serial_number": "3425152",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 38,
    "volume_number": 1,
    "text": "لا يكون حجة إلا بعد انقراض العصر والعصر لم ينقرض؛ لأن عليًّا لم يمت. والاعتماد على مثل هذا فيه نظر كبير، لذا لم يوافق أبا يعلى على هذا أبو الخطاب في «التمهيد» (1) ، وذلك أن اجتماع عمر وعلي ليس إجماعًا بل هو اجتماع اثنين. والمراد بالإجماع: أن يجمع العلماء بأن ينطق جماعة ولا يخالفهم الآخرون، أما أن يتفق علي وعمر على قول ثم يرجع أحدهما فليس هذا إجماعًا. ومن جهة أخرى: ذكر أبو الخطاب (2) وغيره أن كلام عمر مع علي كان من باب المشورة. فالمقصود: أن قول عمر وعلي ليس إجماعًا، والإجماع الذي يبحث هو اتفاق مجتهدي الأمة، أما أن يقول اثنان قولًا ثم يرجع أحدهما عن قوله فإن هذا لا يعد إجماعًا؛ لذا نسبته إلى أحمد فيه نظر. بل أول من قرر هذا الشرط صريحا، هو القاضي أبو علي الجبائي المعتزلي كما في «المعتمد» (3) ، وتبناه كذلك أبو الحسين البصري المعتزلي صاحب المعتمد؛ ولم ينسب العلائي (4) هذا القول إلا لأبي علي الجبائي المعتزلي، فدل هذا على أنهما لا يريان أنه قد قال بهذا القول مثل الإمام أحمد ولا سيما أن النسبة إلى أحمد باستنباط أبي يعلى فيه نظر كما تقدم تقريره. فالمهم أن يعلم أن هذا القول ليس عليه الأولون وإنما تبناه طائفة من المعتزلة ثم تبناه بعض المتأخرين من الأصوليين.",
    "foot_note": "1. انظر: «التمهيد في أصول الفقه» لأبي الخطاب (3/ 353). \n2. انظر: «التمهيد في أصول الفقه» لأبي الخطاب (3/ 353)، بلفظ: «وأما خبر علي، فالصحيح منه أنه قال: كان رأيي ورأي أمير المؤمنين عمر \n…. ». \n3. انظر: «المعتمد» لأبي الحسين (2/ 70). \n4. انظر: «إجمال الإصابة في أقوال الصحابة» للعلائي (ص:20).",
    "book_id": "267",
    "new_page_number": 37
  },
  {
    "serial_number": "3425153",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 39,
    "volume_number": 1,
    "text": "2 - استدلوا بما أخرجه البخاري ومسلم، عَنْ أَنَسِ بْنِ مَالِكٍ: «أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ، فَجَلَدَهُ بِجَرِيدَتَيْنِ نَحْوَ أَرْبَعِينَ»، قَالَ: وَفَعَلَهُ أَبُو بَكْرٍ، فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ، فَقَالَ عَبْدُ الرَّحْمَنِ: أَخَفَّ الْحُدُودِ ثَمَانِينَ، «فَأَمَرَ بِهِ عُمَرُ» (1) . ووجه الدلالة: أنه لما كان جلد الشارب أربعين هو المعمول به على عهد أبي بكر وشيء من خلافة عمر فاعتُبِر هذا إجماعًا، ثم خالف عمر، وعلة ذلك عدم انقراض العصر. وقد أجاب ابن القيم (2) على هذا أنه من باب التعزير الذي يختلف بالنظر إلى المصالح باختلاف الزمان والمكان، فعمر رأى أن يشدد في شرب الخمر لانتشاره، فهذا من باب التعزير ولا علاقة له بصحة مخالفة الإجماع إذا لم ينقرض العصر. إذا تبين هذا فلتعلم أنَّ القول باشتراط انقراض العصر ليس صحيحًا لما يلي: أولا: أول من عُرِف عنهم هذا الشرط هم المتكلمون. ثانياً: مخالفة هذا الشرط للدليل. ثالثاً: ما اعتمدوا عليه لا دلالة فيه كما تقدم. رابعًا -وأخيراً -: القول باشتراط انقراض العصر إذا دقق فيه فإنه غير منضبط كما أشار لهذا الروياني (3) فيما نقله عنه الزركشي في «البحر المحيط» (4) ، فقد ذكر كلاماً مفاده أنه ليس منضبطاً ثم أراد أن يذكر له ضابطاً وفيه إشكال لأنه إن أرجع إلى زمن معين فإن المجتهدين قد يبقون بعد هذا الزمن فيوجد مجتهدون جدد.",
    "foot_note": "1. أخرجه البخاري (6773)، ومسلم (1706/ 35) - واللفظ له -. \n2. انظر: «زاد المعاد» لابن القيم (5/ 44). \n3. انظر: «بحر المذهب» للروياني (11/ 130 - 131). \n4. انظر: «البحر المحيط» للزركشي (6/ 490 - 491).",
    "book_id": "267",
    "new_page_number": 38
  },
  {
    "serial_number": "3425154",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 40,
    "volume_number": 1,
    "text": "ففي عصر الصحابة نشأ مجتهدون جدد من التابعين كسعيد بن المسيب فإذن يلزم على هذا أن ينتظر حتى ينتهي عصر سعيد و قد يخرج مجتهدون أخر فينتظرون وهكذا … إلخ. وإن قيل: إن المراد أن يموت جميع المجتهدين في عصر الصحابة؟ قلنا: هذا إن تُصوِّرَ في عصر الصحابة، فصعب تصوره فيمن بعدهم، من الناحية الواقعية العملية، بل مقتضاه رد كثير من الإجماعات؛ لأنه يصح أن يقول قائلهم: هل أثبتم انقراض العصر حتى يُحتج بهذا الإجماع؟ ويكفي في ضعف هذا الشرط أمران: الأول: أنه لا دليل عليه، وأن أول من قال به هم المعتزلة كما تقدم بيانه. الثاني: أن الدليل على خلافه. * * *  المسألة الحادية عشرة لا يجوز في الشريعة إحداث قول جديد (1) إذا اختلف العلماء على قولين فلا يصح لأحد أن يحدث قولاً ثالثاً جديداً، وإذا اختلفت الأمة على أربعة أقوال فلا يصح لأحد أن يحدث قولاً خامساً، وإذا لم يكن للأمة إلا قول واحد فلا يصح لأحد أن يحدث قولاً ثانياً ومن فعل ذلك فقد خالف الإجماع من جهة أن الأمة لما اختلفت على قولين أجمعت أن الحق في أحد هذين القولين، ومن جهة أخرى فقد وقع في الإحداث، والإحداث منهي عنه",
    "foot_note": "1. انظر في هذا: «المعتمد» لأبي الحسين (2/ 44) وما بعدها، و (2/ 70)، و «العدة في أصول الفقه» لأبي يعلى (4/ 1113 - 1115)، و «التمهيد في أصول الفقه» لأبي الخطاب (3/ 310 - 314)، و «الإحكام» للآمدي (1/ 268 - 272)، و «المحصول» للرازي (4/ 127 - 130)، و «البحر المحيط» للزركشي (6/ 516) وما بعدها وغيرها.",
    "book_id": "267",
    "new_page_number": 39
  },
  {
    "serial_number": "3425155",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 41,
    "volume_number": 1,
    "text": "في الشرع. واستدل ابن تيمية (1) رحمه الله على منع الإحداث بعموم حديث عَائِشَةَ رضي الله عنها، قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: «مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ، فَهُوَ رَدٌّ» (2) . ومن ذلك إذا اختلف الصحابة على قولين فلا يجوز أن يحدث قول ثالث فقد سئل الإمام أحمد عن رجل يقول: إذا اختلف الصحابة على قولين فنخرج عن قوليهم، قال: هذا قولٌ خبيثٌ، هذا قول أهل البدع (3) ؛ فإذن لا يجوز إحداث قول جديد، وهذا الذي عليه العلماء الأولون، ونسب إلى بعض الحنفية (4) جوازه وفي النسبة نظر، وإنما الذين يرون جواز إحداث قول جديد هم الظاهرية (5) ، كداود الظاهري ومن بعده لذا صار مذهبه مذهبا مبتدعا، ولأجله قال شيخ الإسلام ابن تيمية في المجلد الخامس من «منهاج السنة»: وكل قول تفردت به الظاهرية فهو خطأ (6) . وقد أشار للمعنى وهو أنهم متأخرون. ووضح هذا أكثر ابن رجب في «فتح الباري» (7) وبين أن الظاهرية يرون جواز إحداث قول جديد فهم بذلك خالفوا السلف السابقين وأشار لهذا أيضًا في «فضل علم السلف على الخلف» (8) .",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (1/ 334)، و (11/ 613)، و (22/ 188 - 189). \n2. أخرجه البخاري (2697)، ومسلم (1718). \n3. انظر: المسودة ص 315 و العدة لأبي يعلى (4/ 1059). \n4. كما في: «الإحكام» للآمدي (1/ 268)، و «البحر المحيط» للزركشي (6/ 517 - 518) وغيرهما. \n5. كما في: «المعتمد» لأبي الحسين (2/ 44)، و (2/ 70)، و «الإحكام» للآمدي (1/ 268)، و «المحصول» للرازي (4/ 127)، و «البحر المحيط» للزركشي (6/ 518) وغيرهم. \n6. انظر: «منهاج السنة» لابن تيمية (5/ 178). \n7. انظر: «فتح الباري» لابن رجب (4/ 242). \n8. انظر: «فضل علم السلف على الخلف» لابن رجب (ص:67). دار الصميعي - الطبعة الثانية.",
    "book_id": "267",
    "new_page_number": 40
  },
  {
    "serial_number": "3425156",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 42,
    "volume_number": 1,
    "text": "فمذهب الظاهرية مبتدع في الفقه وفي العقيدة، لأن عند داود الظاهري أخطاء عقدية والسلف قد شددوا على داود في مذهبه الفقهي ومذهبه العقدي كما يعرف هذا بالرجوع إلى ترجمة داود لابن أبي حاتم في «الجرح والتعديل»، والترجمة ساقطة من كتاب «الجرح والتعديل» المطبوع لكنها موجوده في «لسان الميزان» للحافظ ابن حجر (1) . والذي يهمنا فيما نحن بصدده هو مذهبه الفقهي. وسبب ضلاله في الفقه يرجع إلى أمور ذكر ابن القيم أربعة منها (2) وزاد ابن رجب خامسًا وهو جواز إحداث قول جديد فهم يخالفون ما عليه السلف الأولون، ثم ذكر ابن رجب (3) أنه من الخطأ أن يقال إن مذهب الظاهرية هو مذهب أهل الحديث كما شاع وانتشر في هذه العصور المتأخرة. ومما ذكر الشاطبي في موضعين من «الاعتصام» أن العلماء لا زالوا على تبديع الظاهرية (4) . وممن بدعهم أيضًا ابن العربي المالكي (5) وغيرهم من أهل العلم. وقد اشتهر عن المالكية المغاربة الشدة على الظاهرية؛ لأن ابن حزم كان من أهل المغرب وهو الذي أشهر هذا المذهب وأذاعه مما أدى إلى اشتداد مواجهة المالكية ومعارضتهم له.",
    "foot_note": "1. انظر: «لسان الميزان» لابن حجر (2/ 422 - 424). \n2. انظر: «إعلام الموقعين» لابن القيم (3/ 98 - 107). \n3. انظر: «فضل علم السلف على الخلف» لابن رجب (ص 67) \n4. انظر: «الاعتصام» للشاطبي (2/ 457)، و (3/ 198). \n5. انظر: «سير أعلام النبلاء» للذهبي (18/ 188 - 190) حيث اشتد ابن العربي على الظاهرية وابن حزم، وتعقبه الذهبي في ذلك.",
    "book_id": "267",
    "new_page_number": 41
  },
  {
    "serial_number": "3425157",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 43,
    "volume_number": 1,
    "text": "مسألة التلفيق بين الأقوال ومعنى التلفيق: أن يختلف العلماء على قولين ويلفق قولٌ ثالث لا يعارض القولين من كل وجه بل يوافق كل واحد منهما من وجه أما إذا عارض القولين من كل وجه فإنه مردود وهو من إحداث قول جديد. وقد ذهب إلى جواز التلفيق جمع من أهل العلم المتأخرين وأكثرهم من المتكلمين كالرازي (1) والآمدي (2) والطوفي (3) وابن بدران في «حاشيته على روضة الناظر» (4) ، ونسب الزركشي (5) هذا إلى الشافعي لكن النسبة فيها نظر ولا تصح، وإنما اشتهر بهذا المتكلمون وبعض المتأخرين من أهل الفقه. ويشترط في التلفيق أن لا يصادم الأقوال السابقة كلها من كل وجه بل يأخذ من كل قول شيئا أما لو صادمها لم يصح. ومن أمثلة المصادمة التي لا يصلح فيها التلفيق: ما ذكره ابن بدران في «حاشيته على روضة الناظر» وهو أن العلماء اختلفوا على قولين في قود الأب في ولده: أ- منهم من قال - وهم الجمهور - أن الأب لا يقاد بولده. ب- وذهب مالك إلى أنه يقاد به إذا كان متعمداً قد تعمد قتله فإنه يقاد فيه بخلاف إذا لم يتعمد (6) .",
    "foot_note": "1. انظر: «المحصول» للرازي (4/ 128). \n2. انظر: «الإحكام» للآمدي (1/ 269). \n3. انظر: «شرح مختصر الروضة» للطوفي (3/ 93 - 94). \n4. انظر: «حاشيته ابن بدران على روضة الناظر» (1/ 312). \n5. انظر: «البحر المحيط» للزركشيي (6/ 518 - 519). \n6. انظر: «حاشيته ابن بدران على روضة الناظر» (1/ 312).",
    "book_id": "267",
    "new_page_number": 42
  },
  {
    "serial_number": "3425158",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 44,
    "volume_number": 1,
    "text": "فلو قال أحد بقول ثالث وهو أنه: يقاد الأب مطلقاً لكان قوله مخالفا للقولين السابقين فهو مخالف للجمهور لأن الجمهور لا يرون أنه يقاد، ويخالف قول مالك لأن مالك لا يرى غير المتعمد يقاد، فمثل هذا لا يسمى تلفيقا. ومن أمثلة التلفيق الصحيح: المثال الأول: اختلف العلماء في تحديد وقت المسح على الخفين على قولين هما: القول الأول: ذهب مالك في أحد قوليه إلى أنه لا يحدد بوقت سواء كان بسفر أو حضر (1) ، وهذا القول نسب إلى ربيعة وآخرين (2) . والقول الثاني: قول الجمهور (3) أن المسافر يحدد بثلاثة أيام وأن المقيم بيوم وليلة على مقتضى حديث علي الذي أخرجه مسلم (4) . فلو قال قائل: يحدد للمسافر بثلاثة أيام وللمقيم بيوم وليلة إلا إذا كان في سفر مضطر وقد جد به المسير؛ فإنه لا يحدد. فمثل هذا قول ملفق وافق الجمهور إلا في حال اضطرار، ووافق القول الذين لا يقولون بالتحديد في حال الاختيار. المثال الثاني: أن الصحابة رضي الله عنهم وأرضاهم - اختلفوا على قولين في استقبال القبلة واستدبارها عند قضاء الحاجة (5) :",
    "foot_note": "1. انظر: «الأوسط» لابن المنذر (2/ 86)، و «التمهيد» لابن عبد البر (11/ 151 - 152). \n2. انظر: «الأوسط» لابن المنذر (2/ 87). \n3. انظر: «التمهيد» لابن عبد البر (11/ 152)، و «المغني» لابن قدامه (1/ 209). \n4. أخرجه مسلم (276). \n5. انظر الأقوال في: «المجموع» (2/ 81)، و «شرح مسلم» (3/ 154)، و «شرح أبي داود» (ص: 106) ثلاثتهم للنووي، و «المغني» (1/ 209) وغيرها.",
    "book_id": "267",
    "new_page_number": 43
  },
  {
    "serial_number": "3425159",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 45,
    "volume_number": 1,
    "text": "القول الأول: أن القبلة لا تستقبل ولا تستدبر عند قضاء الحاجة لا في البنيان ولا في الصحراء وهذا قول أبي أيوب الأنصاري أخرجه البخاري ومسلم (1) . القول الثاني: أن القبلة تستقبل وتستدبر لكن في البنيان دون الفضاء أو الصحراء وهذا قول ابن عمر رواه الدار قطني (2) وجماعة. فلو قال قائل: إنها تستدبر لكن لا تستقبل لصار قوله قولاً ملفقاً بالنظر إلى أقوال الصحابة لا أقوال أهل العلم؛ لأنه حصل خلاف بين أهل العلم بعد ذلك. المثال الثالث: أن الصحابة اختلفوا على قولين في صلاة الرواتب في السفر: القول الأول: أن صلاة الرواتب في السفر تصلى مطلقاً وهذا قول جمهور الصحابة كجابر رضي الله عنه (3) ، وعزاه الحسن البصري إلى الصحابة (4) . والقول الثاني: أنها لا تصلى وهذا قول ابن عمر رضي الله عنه، وفي رواية لابن عمر أنها تصلى رواتب الليل دون رواتب النهار فإنها لا تصلى أي للمسافر (5) . فهذان قولان معروفان للصحابة. فلو قال قائل: إن المسافر لا يصلي شيئا من الرواتب إلا ركعتي الفجر لكان قوله ملفقاً ومحدثا بالنسبة إلى أقوال الصحابة رضي الله عنهم. فائدة: جمهور أهل العلم من أصحاب المذاهب الأربعة على أن المسافر يصلي الرواتب ليلاً ونهاراً هذا مذهب الحنفية والمالكية والشافعية والحنابلة لكن خالف بعض الحنفية والحنابلة المتأخرين.",
    "foot_note": "1. أخرجه البخاري (394)، ومسلم (264). \n2. أخرجه الدارقطني (1/ 92) رقم (161)، وقال عقبه: هذا صحيح كلهم ثقات. \n3. انظر: «الأوسط» لابن المنذر (5/ 248). \n4. انظر: «الأوسط» لابن المنذر (5/ 248)، و (5/ 250). \n5. انظر: «الأوسط» لابن المنذر (5/ 247 - 248).",
    "book_id": "267",
    "new_page_number": 44
  },
  {
    "serial_number": "3425160",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 46,
    "volume_number": 1,
    "text": "أما القول المشهور عند المذاهب الأربعة أن المسافر يصلي الرواتب ليلاً ونهاراً (1) . فالمقصود: أن من استثنى راتبة الفجر فإن قوله قول ملفق. وما جاء عن ابن عمر من استثناء راتبة الفجر فإنه لا يصح إسناده (2) . ولم يصح حديث أن النبي صلى الله عليه وسلم كان يداوم في السفر على ركعتي الفجر والوتر. والذي عليه العلماء والفقهاء الأولون أن التلفيق لا يصح وإنما عرف بهذا المتكلمون والمتأخرون كما تقدم ذكره، ويردون على التلفيق بما يلي: الرد الأول: أنه إنما عرف به المتأخرون من المتكلمين وغيرهم. الرد الثاني: أنه لما اختلف الصحابة أو من بعدهم على قولين فالطائفة المنصورة على أحد هذين القولين وهي قد تبنت الحق كله فعلى هذا التلفيق ترك لبعض الحق. الرد الثالث: أن الذي لفق خرج بقول مرجوح قطعًا لأنه أخذ من هذا جزءًا وأخذ من هذا جزءًا فلابد أنه أخذ من القول المرجوح جزءًا وكوَّن قولًا مجموعًا من قولين مرجوحين دون القول الثالث الراجح. الرد الرابع: أن كل دليل في النهي عن الإحداث هو رد على القول بالتلفيق. وأخيراً: رأيت بعض أهل العلم ينسب إلى بعض العلماء القول بالتلفيق بناءً على أن فعله يدل على ذلك في مسائل، كما نسبوا هذا القول لشيخ الإسلام ابن تيمية، ولم أقف على شيء في كتبه يدل على أنه يرى القول الملفق، ولم أر شيئا من كلام تلميذه ابن القيم يدل على أن ابن القيم نفسه أو أن شيخه يرى التلفيق بين",
    "foot_note": "1. انظر ذلك في: «بدائع الصنائع» للكاساني (1/ 93)، و «تبيين الحقائق» (1/ 211) للزيلعي، و «المجموع» للنووي (4/ 400 - 401)، و «الإنصاف» للمرداوي (2/ 322). \n2. أخرجه ابن أبي شيبة في المصنف (1/ 342) والأثر ضعيف لمخالفة رواية الأكثرين عنه.",
    "book_id": "267",
    "new_page_number": 45
  },
  {
    "serial_number": "3425161",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 47,
    "volume_number": 1,
    "text": "الأقوال، ولم أر أحداً ممن تكلم عن القول الملفق فيما مضى ينسب هذا إلى ابن تيمية نقلاً عن قوله، وإنما عمدة من ينسب هذا لشيخ الإسلام من بعض المعاصرين أن ابن تيمية قرر أقوالًا ملفقة. فيقال: إن هناك فرقًا بين تأصيل العالم و تنزيله هذا التأصيل على الأمثلة والوقائع. فقد يخطئ العالم و يحدث قولاً جديداً فلا يدل هذا على أنه يرى إحداث قول جديد. بل قد يحتج بحديث ضعيف قد بين ضعفه في موضع آخر فذهل عن هذا فاحتج به فهل يقال إنه يرى جواز الاستدلال بالأحاديث الضعيفة في الأحكام؟ كلا، لذا قال عطاء فيما روى ابن عبد البر في «جامع بيان العلم وفضله»: وأضعف العلم أيضا علم النظر أن يقول الرجل: رأيت فلانا يفعل كذا ولعله قد فعله ساهيًا (1) . لذا لا يعتمد على تنزيل العالم فقد يخطئ في التنزيل و في العمل وإنما العمدة على تأصيله. * * *  المسألة الثانية عشرة طريقة معرفة الإجماع يعرف الإجماع إذا حكاه عالم ذو استقراء، فإذا حكى عالم ذو استقراء إجماعا فالأصل صحة إجماعه إلا إذا تبين خرمه، والأمر سهل في هذا. لذا حكى ابن المنذر - وابن المنذر صاحب منزلة عالية في الاستقراء ومعرفة الأقوال -، وأولى من ابن المنذر محمد بن نصر الخزاعي، وأولى منه الإمام أحمد",
    "foot_note": "1. انظر: «جامع بيان العلم وفضله» لابن عبد البر (1448).",
    "book_id": "267",
    "new_page_number": 46
  },
  {
    "serial_number": "3425162",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 48,
    "volume_number": 1,
    "text": "والشافعي وإسحاق ابن راهويه، إذا حكى أحد هؤلاء الأئمة أو غيرهم إجماعًا فإن الأصل صحة الإجماع إلا إذا تبين أنه مخروم، فإذا تبين أنه مخروم فيسقط الإجماع، كما أنه إذا احتج أحد هؤلاء العلماء أو غيرهم بحديث من سنة النبي صلى الله عليه وسلم فالأصل أن الحديث صحيح لكن لو تبين أنه ضعيف فإنه يرد لكن الأصل أنه صحيح، كما إذا صرح أحد هؤلاء العلماء بصحة حديث وهذا أولى من الاحتجاج فالأصل صحته لكن لو تبين أنه ضعيف فينتقل من هذا الأصل لما ظهر للناظر والمجتهد، ومثل هذا إذا حكى إجماعا فالأصل أن الإجماع صحيح لكن لو تبين أن الإجماع مخروم فيسقط الإجماع ويسقط الاستدلال به. إلا أنه لا ينبغي أن يتعجل في زعم خرم الإجماع، فقد يكون الإجماع سابقاً والخلاف حادثًا، فقد يحكي النووي إجماعًا وهو يريد إجماع الصحابة والتابعين وخالف أناس في القرن الرابع، فينبغي أن يتأمل في مثل هذا فقد يكون الذي خالف محجوجًا بالإجماع السابق، فلا يصح أن يتعجل لكن إذا قدر أنه ثبت خرم الإجماع فيسقط الإجماع، ولابد أن يضع الناظر أمام عينيه عند بحث مثل هذا أن لا يكون الإجماع سابقاً ثم حدث خلاف بعد، وفي المقابل أن لا يكون في المسألة خلاف ثم انعقد الإجماع بعدُ كالتكبير أربعاً على الجنائز، فقد حكى ابن عبد البر (1) والنووي (2)",
    "foot_note": "1. انظر: «التمهيد» لابن عبد البر (6/ 334). حيث قال: «اختلف السلف في عدد التكبير على الجنازة ثم اتفقوا على أربع تكبيرات وما خالف ذلك شذوذ يشبه البدعة والحدث». \n2. انظر: «المجموع» للنووي (5/ 230). حيث قال: «التكبيرات الأربع أركان لا تصح هذه الصلاة إلا بهن وهذا مجمع عليه وقد كان لبعض الصحابة وغيرهم خلاف في أن التكبير المشروع خمس أم أربع أم غير ذلك ثم انقرض ذلك الخلاف وأجمعت الأمة الآن على أنه أربع تكبيرات بلا زيادة ولا نقص».",
    "book_id": "267",
    "new_page_number": 47
  },
  {
    "serial_number": "3425163",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 49,
    "volume_number": 1,
    "text": "إجماعًا وذكروا أن أقوال أهل العلم بعد ذلك استقرت على أنه لا يزاد في الجنازة على أربع وقد كان بين الصحابة خلاف في هذا. فالمقصود أنه يتأمل في أمثال هذه المسائل ولا يتعجل، لكن لو تبين للناظر أن الإجماع مخروم فإنه يقال بخرمه، وفي المقابل لا يتعجل؛ فإن الأصل فيما يحكيه عالم ذو استقرا كما تقدم ذكرهم كالنووي أو ابن قدامة أو غيرهم صحة الإجماع، وبرهان هذا البحث والنظر فإنه عند البحث غالباً يتضح صحة قولهم. لكن بعضهم يخرم الإجماع بمخالفة ابن حزم الظاهري أو مخالفة داود الظاهري وهذا خطأ كما سيأتي التمثيل على هذا إن شاء الله تعالى، حتى رأيت أحدهم كتب بحثاً وقال قد ذكر في المسألة إجماعًا لفلان وفلان إلا أن هذا الإجماع لا يصح؛ لأن ابن حزم خالفه. وهذا عجيب كيف يعول على ابن حزم في نقض إجماع سابق؟! وابن حزم محجوج بالإجماع ومثل هذا ينبغي التنبه إليه (1) . ومما يحسن التنبيه إليه أن ثمة علماء يحكون إجماعًا ويريدون الأكثر ولا يعتدون بمخالفة القلة، ومن هؤلاء: 1 - ابن جرير الطبري (2) : فقد اشتهر عند أهل العلم أن ابن جرير الطبري إذا حكى إجماعًا فإنه لا يعتد بمخالفة القلة كالواحد والاثنين وغيرهم فمثل هذا لا يعتد بإجماعه إذ لم يحكِ الإجماع إلا هو.",
    "foot_note": "1. قال ابن رجب في «فتح الباري» (4/ 242): «فإن شذ أحد من أهل الظاهر جريًا على عادتهم، ولم يبال بخرق إجماع المسلمين، كان محجوباً بالإجماع قبله». وقال في (6/ 105): «خالف فِيهِ شذوذ من متأخري الظاهرية، لا يعبأ بخلافهم الإجماع القديم». \n2. انظر: «الإحكام» للآمدي (1/ 235)، و «شرح مختصر الروضة» للطوفي (3/ 53). وقال شيخ الإسلام ابن تيمية في «الرد على السبكي في مسألة تعليق الطلاق» لابن تيمية (1/ 597): «وأما ابن جرير الطبري فالإجماع عنده قول الجمهور؛ فلا يحتج بنقله» باختصار.",
    "book_id": "267",
    "new_page_number": 48
  },
  {
    "serial_number": "3425164",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 50,
    "volume_number": 1,
    "text": "2 - وابن عبد البر رحمه الله تعالى: أحياناً يحكي الإجماع ويريد الجمهور (1) ، وأحياناً يحكي الإجماع ويريد الإجماع الحقيقي (2) ، وهذا يعرف بالسابق واللاحق من كلامه فإنه إذا قال أجمع العلماء على ذلك ومن خالف فقد شذ كعطاء أو غيره فهو يريد بهذا الإجماع وأحياناً يريد بالإجماع أي إجماع الأكثر. فإذن ينظر في الإجماع الذي يحكيه ابن عبد البر تارةً يحكي الإجماع بمعناه المعروف وتارة يحكيه ويريد به الجمهور. أما الإمام ابن المنذر فقد عول عليه المتأخرون في حكاية الإجماع والخلاف كما يقول شيخ الإسلام ابن تيمية في «مجموع الفتاوى» (3) . فمن الخطأ أن يقال: إن ابن المنذر إذا حكى إجماعًا أراد الأكثر، وذلك أنه يقول: أجمع العلماء إلا فلانًا (4) ، فلما خالف الواحد بيَّنه ولو كان الإجماع عنده بمعنى الأكثر لما احتاج أن يبين مخالفة الواحد أو الاثنين. * * *  المسألة الثالثة عشرة الإجماع دليل كاشف ينبغي أن يعلم أن دليل الإجماع دليل كاشف فليس الإجماع حجة في ذاته بل للنص الذي استند عليه كما تقدم بيانه، فهو إذن كاشف بأن هناك دليلا يدل على هذه المسألة. فليس دليلًا في نفسه ككلام الله وكلام رسوله صلى الله عليه وسلم وهذا مفيد للغاية.",
    "foot_note": "1. كما في: «الاستذكار» (1/ 314)، و (2/ 15). \n2. كما في: «الاستذكار» (7/ 478). \n3. انظر: «مجموع الفتاوى» لابن تيمية (21/ 559). \n4. كما في: «الأوسط» (1/ 411).",
    "book_id": "267",
    "new_page_number": 49
  },
  {
    "serial_number": "3425165",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 51,
    "volume_number": 1,
    "text": "وفي هذا جواب قول القائل: إن الله يقول {يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ} [النساء: 59] ولم يقل ارجعوا إلى الإجماع. فيقال: إن الرجوع للإجماع هو طاعة لله وطاعة لرسوله صلى الله عليه وسلم؛ لأنه كاشف لقول الله ولقول رسوله صلى الله عليه وسلم. وقد صرح جمع من الأصوليين بأن الإجماع كاشف كصفي الدين الهندي (1) والزركشي (2) وغيرهم. فلا يلزم أن يكون المستند الذي يستند عليه الإجماع نصًا صريحاً، بل قد يكون مفهوما بأي نوع من المفاهيم التي هي حجة في الدين؛ لأنه لا دليل على أن مستند الإجماع لا يكون إلا نصاً صريحاً. وبهذا ينتهي الكلام على مسائل الإجماع.",
    "foot_note": "1. انظر: «الفائق في أصول الفقه» للصفي الهندي (2/ 52، و 111). \n2. انظر: «البحر المحيط» للزركشي (6/ 485).",
    "book_id": "267",
    "new_page_number": 50
  },
  {
    "serial_number": "3425166",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 52,
    "volume_number": 1,
    "text": "الفصل الثاني شبهات وإشكالات على دليل الإجماع الإشكالات والاعتراضات على دليل الإجماع عمليًا كثيرة من بعض أهل السنة (1) ، وهذه كل الاشكالات التي حضرتني ولا أراعي في ذكرها ترتيبًا معينًا، بل بحسب ما تواردها على الذهن.  الشبهة الأولى رد الإجماع في مسألة مع عدم وجود السلف إلا زعمه أن رسول الله صلى الله عليه وسلم هو السلف ، كاستدلال بعضهم على حرمة إفراد يوم السبت بالصوم بحديث الصماء بنت بسرة: «لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا فِيمَا افْتُرِضَ عَلَيْكُمْ» (2) ولما قيل له: إن الإمام ابن تيمية (3) حكى الإجماع أنه لم يقل أحد بحرمة إفراد يوم السبت بالصيام أي: بوجوب أن يصام معه يوم آخر. قال هذا الإجماع لا يسلم به … إلخ، ويكفي أن سلفي في هذه المسألة رسول الله صلى الله عليه وسلم. وكشف هذه الشبهة أن يقال: هذا خطأ قطعًا؛ لأن هذا استدلال بمورد النزاع، وذلك أن المخالف لا يسلم أن هذا هو المفهوم من الحديث أي: لا يسلم أن هذا المفهوم من كلام رسول الله صلى الله عليه وسلم، فالخلاف راجع إلى فهم كلام رسول الله صلى الله عليه وسلم فلا",
    "foot_note": "1. فليس البحث مع النظام والمعتزلة الذين ينكرون دليل الإجماع. \n2. أخرجه أحمد (27075)، والدارمي (1790)، وأبو داود (2421)، والترمذي (744) وغيرهم، وصححه الألباني في «صحيح سنن أبي داود» (2421) طبعة المعارف. \n3. انظر: «شرح العمدة لابن تيمية كتاب الصيام» (2/ 653).",
    "book_id": "267",
    "new_page_number": 51
  },
  {
    "serial_number": "3425167",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 53,
    "volume_number": 1,
    "text": "يصح لأحد من الطرفين أن يستدل بمورد النزاع. فإذا قال سلفي هو كلام رسول الله صلى الله عليه وسلم. إذن هو صادر البحث واستدل بمورد النزاع والبحث جارٍ في هذا الفهم هل هو صحيح أم لا؟ والإمام ابن تيمية يحكي الإجماع على أن هذا الفهم لم يُفْهَمْ، وهو يقول: أنا فهمت هذا الفهم، فالخلاف راجع إلى الفهم فلا يصح أن يقال: إن سلفي رسول الله صلى الله عليه وسلم؛ لأن البحث جارٍ في فهم كلام رسول الله صلى الله عليه وسلم. * * *  الشبهة الثانية لما ذُكِر لبعضهم إجماعٌ وقيل لا سلف في قول كذا وكذا أو في هذه المسألة . قال: بلى إن هناك سلفاً وهو الصحابي الذي يروي الحديث فالكلام فيه كالكلام في الإشكال السابق. وكشف هذه الشبهة أن يقال: هذا استدلال بمورد النزاع فلا يسلم أن هذا فهم الصحابي، والبحث بيننا هل هذا هو مراد رسول الله صلى الله عليه وسلم وفهم الصحابي له أم لا؟ لا سيما وأنه لا يلزم من رواية الصحابي لشيء أن يتبناه أو يقول به. بل قد يدعه؛ لأنه منسوخ، فالأحاديث المنسوخة الكثيرة التي رواها الصحابة بعد وفاة النبي صلى الله عليه وسلم قد رووها وهم يعلمون أنها منسوخة، ففرق بين باب الرواية وباب الدراية، فلا يلزم من رواية الصحابي لحديثٍ ما أنه قد تبناه، بل قد يروي حديثاً وهو يعلم أنه منسوخ أو يعلم أنه مخصص … إلخ.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 52
  },
  {
    "serial_number": "3425168",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 54,
    "volume_number": 1,
    "text": "الشبهة الثالثة أن بعضهم لما قيل له: إن في المسألة إجماعًا . قال: هذا غير صحيح، كيف يكون في المسألة إجماعٌ وأنا أخالف، فمخالفتي نقضٌ للإجماع؟ وكشف هذه الشبهة أن يقال: أولًا: لازم هذا القول أنه لا إجماع إلا إلى قبيل قيام الساعة حتى نتأكدَ أن أحدا من أهل العلم لم يخالف إلى قبيل قيام الساعة وهذا لازم باطل وإذا بطل اللازم بطل الملزم. ثانياً: الأدلة التي بينت أن الإجماع حجة لم تقيده بزمن كما تقدم بحثه في انقراض العصر فمتى ما انعقد الإجماع صار حجة. * * *  الشبهة الرابعة قال بعضهم: إنه قد ادعي الإجماع في مسائل وتبين أنه مخروم فكيف يعول على هذه الإجماعات ؟ وكشف هذه الشبهة أن يقال: هذا حق؛ ولكن الأصل صحة الإجماع للأدلة التي تقدم ذكرها. فإذا تبين خرمه فلا يقال: إنه إجماع، كما أنه إذا صحح بعض أهل العلم حديثاً يحتج به؛ ثم تبين بعدُ أنه ضعيف فإننا نترك تصحيحه لهذا الحديث بعينه، ولكن دون أن نقول: إنه لا يعول على تصحيح هذا العالم. فأكثر العلماء الذين صححوا وضعفوا قد يتبين لغيرهم من المجتهدين خلاف",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 53
  },
  {
    "serial_number": "3425169",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 55,
    "volume_number": 1,
    "text": "قولهم، فلا يصح لهذا المجتهد أن يقول: بما أنه تبين لي أن العلامة الألباني أخطأ في حديث أو حديثين أنَّه لا يعول على تصحيحه، بل يقال إنه إمام في الحديث والتصحيح والتضعيف فإذا تبين أن قوله مرجوح في حديث أو حديثين أو عشرة فهذا لا ينقص من مكانته ويبقى الأصل وهو الاحتجاج بتصحيحه وتضعيفه، وهكذا الحال في غيره من العلماء. فإذن الأصل أنه إذا حكى أحد الإجماع فهو صحيح، لكن إذا تبين إنه مخروم فيقال إن هذا الإجماع لا يعول عليه، كما إذا صحح أحد من أهل العلم حديثاً فتبين أن تصحيحه ليس صحيحاً فيقال هذا التصحيح لا يعول عليه ولا يصح، مع بقاء منزلته وقبول أحكامه في التصحيح والتضعيف مالم يتبين خلاف حكمه. * * *  الشبهة الخامسة حُكيت إجماعات للصحابة ثم حصل خلاف ، وكثير من أهل العلم لم يعتد بهذه الإجماعات فهذا يدل على أن الإجماع غير منضبط؛ لأن كثيرًا من العلماء لم يعتد بهذا الإجماع. ومن جهة أخرى: يدل على أن مخالفة الإجماع القديم لا يعد شاذًّا. وتقدم بيان أن ضابط القول الشاذ: هو مخالف الإجماع. وكشف هذه الشبهة أن يقال: إذا ثبت لدى الناظر والمجتهد إجماع للصحابة فهو دليل تبين له وخفي على غيره فيجب عليه أن يعمل به، كما إذا تبين للمجتهد صحة حديث أو وقف على دليل لم يقف عليه غيره من كثير من المجتهدين فإنه يجب أن يعمل بهذا الدليل، وليس له أن يدع الدليل والحديث؛ لأن جمعًا من المجتهدين لم يعملوا بهذا الحديث وهذا الدليل.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 54
  },
  {
    "serial_number": "3425170",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 56,
    "volume_number": 1,
    "text": "فليس من شرط الدليل حتى يكون حجة في الشريعة أن يعلم ويعمل به، وأن يعلم به جميع المجتهدين، فكما يُتصور أنْ يخفى على كثير من المجتهدين الكثير من الأدلة والأحاديث النبوية عن رسول الله صلى الله عليه وسلم فمثل ذلك يقال في دليل الإجماع الذي خفي على كثير من المجتهدين إلا أنه يقال: إن ظهور الإجماع ليس على مرتبة واحدة: 1 - فمن الإجماع ما هو ظاهر لأهل العلم كلهم كالإجماع القطعي الذي تقدم ذكره. 2 - ومن الإجماع الظني ما يكون ظاهراً للعلماء. 3 - ومنه ما يكون ظاهراً لأكثر أهل العلم. 4 - ومنه ما قد يخفى على كثير من أهل العلم. وهكذا؛ لكن إذا تبين للمجتهد أن في المسألة إجماعًا فهو حجة يتمسك به، كما إذا تبين له أن في المسألة حديثاً صحيحاً فإنه حجة يتمسك به ويكون معولًا له في ترجيح القول الذي يقول به. ولا يلزم لصحة الدليل أن يعمل به جميع الأمة، ومثل هذا ما حصل فيه إجماع من لدن الصحابة رضي الله عنهم قد يكون أحياناً من الصحابة والتابعين فتبين لبعض المجتهدين فإنهم يعملون به ولا يدل هذا على أن الإجماع ليس حجة، كما يقال هذا في السنة النبوية إذا ظهرت لبعض المجتهدين دون أكثر المجتهدين فلا يقال إن هذا السنة ليست حجة من جهة وصف القول بأنه شاذ، فإن مثل هذا الإجماع الذي اشتهر مخالفته عند العلماء يصح دليلاً لكن لا يصح أن يقال فيمن خالفه إنه قد وقع في قول شاذ، وذلك اتباعاً لفهم أهل العلم، فإن أهل العلم لم يفهموا ذلك في مثل الإجماعات التي قد تخفى والتي اشتهر بين أهل العلم ذكر الخلاف في هذه المسألة، بل من ظهر له الإجماع يعمل به،",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 55
  },
  {
    "serial_number": "3425171",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 57,
    "volume_number": 1,
    "text": "وفي المقابل لا يصف القول بأنه شاذ؛ لأن الإجماع خفي وليس ظاهراً، بخلاف الإجماع الظاهر الذي اشتهر عن أهل العلم موافقة هذا الإجماع والقول به أو عدم مخالفته ثم وجد من خالفه فإنه يقال إن قوله شاذاً؛ لأن العلماء لا يوردون في كتب الفقه والخلاف العالي الخلاف في هذه المسالة فليس العلماء في أمثال هذه المسائل كالشافعي والإمام أحمد والمروزي والطحاوي وابن عبد البر وغيرهم يحكون أن في المسألة خلافاً بل يقررون على أن في المسألة إجماعًا.  الشبهة السادسة يوجد كثير من الفقهاء المتأخرين من لا يعتد بالإجماع السكوتي بحجة أنه تكلم طائفة ولم يتكلم الباقون ، وإنما غاية ما في الأمر أن الباقين سكتوا، وتقدم بيان الكلام في هذه المسألة، لكن أنبه على أمرين: الأمر الأول: أن العلماء إذا حكوا الإجماع السكوتي وتطاول الزمان على حكايته ولم يخالف أحد فإن هذا الإجماع السكوتي حجة بالإجماع، ذكر هذا التلمساني (1) والزركشي (2) وجماعة من أهل العلم، وهذا يستفاد منه في كثير من الإجماعات التي يريد كثير من المتأخرين أو من تأثر بالمتكلمين أن يسقطها. ومن أمثلة ذلك: تحريم الغناء المصحوب بآلات اللهو. فائدة: توارد العلماء من قرون على حكاية الإجماع على حرمة الغناء المصحوب بآلات اللهو فعارض بعض المتأخرين وقال: إنه ليس في المسألة إجماع بحجة أن غاية ما فيها الإجماع السكوتي، والإجماع السكوتي ليس حجة.",
    "foot_note": "1. انظر: «شرح المعالم في أصول الفقه» للتلمساني (2/ 122). \n2. انظر: «البحر المحيط» للزركشي (6/ 472).",
    "book_id": "267",
    "new_page_number": 56
  },
  {
    "serial_number": "3425172",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 58,
    "volume_number": 1,
    "text": "فيقال: إنه لو سلم بعدم حجية الإجماع السكوتي فإن مثل هذا لا يقال في الإجماع السكوتي على حرمة الغناء المصحوب بالمعازف؛ لأنه مما تطاول الزمن على ذكر أهل العلم له، ولم يخالفوه فمثله حجة بالإجماع. الأمر الثاني: مما يعلم يقيناً أن الشافعي لا يريد بذلك رد الإجماع السكوتي وذلك أن الإمام الشافعي نفسه أصَّل الإجماع وأنه حجة وقال: والإجماع حجة على كل شيء؛ لأنه لا يمكن فيه الخطأ (1) . وهذا لا يوجد إلا في الإجماع السكوتي. ويؤكد ذلك أن الشافعي نفسه احتج بالإجماع عمليا فقد ذهب إلى أن العبد والصبي إذا حجا فأعتق أو بلغ بعد ذلك فإن هذا لا يجزئه عن حجة الإسلام حكى على ذلك الإجماع في «الأم» (2) ، ومثل هذا غاية ما فيه الإجماع السكوتي والأمثلة على هذا كثيرة عن الشافعي وغيره. إذن قول الشافعي قطعاً لا يحمل على إنكار الإجماع السكوتي؛ لأنه يقرر الإجماع. تنبيه: ذكر العلائي (3) ثم الزركشي (4) أن من أصحاب الشافعي من حمل قوله: (لا ينسب إلى ساكت قول) على غير إجماع الصحابة لكن فيه نظر؛ لأن الشافعي حكى الإجماع في مسائل كثيرة وأصله ولم يبين أنه خاص بإجماع الصحابة. ومن الشافعية من حمل هذا على الإجماع السكوتي الذي لم يتطاول الزمن على ذكره (5) ؛ لأن ما تطاول الزمن على ذكره فإنه حجة بالإجماع كما تقدم.",
    "foot_note": "1. انظر: «العلم» للشافعي ص 22. \n2. انظر: «الأم» للشافعي (2/ 120). \n3. انظر: «إجمال الإصابة» للعلائي (ص:24). \n4. انظر: «البحر المحيط» للزركشي (6/ 459). \n5. انظر: «إجمال الإصابة» للعلائي (ص:24)، و «البحر المحيط» للزركشي (6/ 459).",
    "book_id": "267",
    "new_page_number": 57
  },
  {
    "serial_number": "3425173",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 59,
    "volume_number": 1,
    "text": "فيقال: وإن كان الشافعي قطعاً يحتج بهذا النوع من الإجماع لكن حصر قوله في مثل هذا يحتاج إلي بينة ودليل، ولو كان كذلك لقرر هذا في «الرسالة»، فإنه تكلم في «الرسالة» على حجية الإجماع، ولم يشترط تطاول الزمن على ذكره، ولو كان هذا شرطاً عنده لبينه بوضوح في «الرسالة» أو غيره من كتبه لاسيما وهو مما أصل فيه حجية دليل الإجماع (1) ، ومما يقطع به يقينًا أن مثل هذا الكلام من الشافعي لا يصح أن يستند عليه لرد كل إجماع سكوتي، وإن كان قد يستند عليه الشافعي رحمه الله في رد إجماع لا يراه صحيحًا، وإذا قيل له: إنه قد قال بهذا القول فلان وفلان … فالشافعي يرى بقرائن أن غير هؤلاء لم يتكلموا في هذه المسألة، وعدم كلامهم لا يدل على إقرار من تكلم لقرائن، أما أن يجعل هذا الكلام من الشافعي أصلاً في رد الإجماع السكوتي فلا يصح بحال - والله اعلم -. * * *  الشبهة السابعة قال الشافعي رحمه الله تعالى: «ما ليس فيه خلاف فليس إجماعًا» . نقل هذه العبارة ابن حزم (2) رحمه الله وسيأتي الكلام عليها؛ لكن ظاهر هذه العبارة أن المسألة التي يقال لا خلاف فيها فليست إجماعًا وهذه على ظاهرها قوية في الدلالة على أن قول العالم لا أعلم فيه خلافا أو ليس فيه خلاف … إلخ أنه لا يفيد الإجماع. وكشف هذه الشبهة من أوجه: الوجه الأول: أن الذي نقل هذه العبارة هو ابن حزم في كتابه «الإحكام في أصول الأحكام» وفي غيره، ولم أر أحدًا سبق ابن حزم إلى نقل هذه العبارة عن",
    "foot_note": "1. انظر: «الرسالة» للشافعي (ص:471 - 475). \n2. انظر: «الإحكام في أصول الأحكام» لابن حزم (4/ 188).",
    "book_id": "267",
    "new_page_number": 58
  },
  {
    "serial_number": "3425174",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 60,
    "volume_number": 1,
    "text": "الإمام الشافعي، وابن حزم قد نسبها إلى كتاب «الرسالة»، وهي ليست موجودة في كتاب «الرسالة» الذي بين أيدينا، بل إنني لم أر الشافعية ينقلون هذا القول وينسبونه إلى الشافعي، وإنما رأيت الزركشي في «البحر المحيط» (1) نقل هذا القول ونسبه إلى ابن حزم، ومن بعد ابن حزم إذا نقل هذه الكلمة عن الشافعي إما أنه يذكر الواسطة وهو ابن حزم، أو يأتي بنص عبارة ابن حزم، فالعمدة في نقل هذا القول هو ابن حزم، ومن البعيد للغاية أن يكون هذا النص للإمام الشافعي رحمه الله تعالى ويغفل عنه أهل العلم، والشافعي له منزلته الكبيرة عند العلماء وله أصحابه الذين نصروا أقواله ومذهبه، فلو كانت المقولة ثابتة عن الإمام الشافعي رحمه الله تعالى لرأيت أصحابه يتواردون عليها، بل لرأيت العلماء يذكرون مثل هذه المقالة؛ لأن للشافعي رحمه الله تعالى مكانته العظيمة عند العلماء. الوجه الثاني: أن الإمام الشافعي رحمه الله نفسه قد احتج في مسائل غير قليلة بنفي الخلاف، فقال رحمه الله تعالى في كتاب «الأم»: «ولا أعلم اختلافا في أن ليس في الذهب صدقة حتى يبلغ عشرين مثقالاً فإذا بلغت عشرين مثقالاً ففيها الزكاة» (2) . وقال أيضًا: «والعاقلة في الحر والعبد مالا أعلم فيه خلافا» (3) . وقال في كتابه «اختلاف الحديث»: «لأن الكتاب ثم السنة ثم مالا أعلم فيه خلافاً يدل على أن المتمتع بالعمرة إلى الحج … إلخ» (4) . وقال أيضًا في كتابه «الأم»: «قال عن الحسن عن رجل من أصحاب النبي صلى الله عليه وسلم إذا أنكح الوليان فالأول أحق - … إلخ ثم مما ذكر الشافعي رحمه الله تعالى أنه قال - فنكاح الأول",
    "foot_note": "1. انظر: «البحر المحيط» للزركشي (6/ 488). \n2. انظر: «الأم» للشافعي (2/ 43). \n3. انظر: «الأم» للشافعي (3/ 262). \n4. انظر: «اختلاف الحديث» للشافعي (8/ 679).",
    "book_id": "267",
    "new_page_number": 59
  },
  {
    "serial_number": "3425175",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 61,
    "volume_number": 1,
    "text": "ثابت؛ لأنه ولي موكل ومن نكحها بعده فقد بطل نكاحه هذا قول عوام الفقهاء لا أعرف بينهم فيه خلافًا، ولا أدري اسمع الحسن منه أم لا» (1) . يعني هو لم يعتمد على الخبر المروي الضعيف على هذا الرجل، وإنما اعتمد على أنه ليس في المسألة خلافٌ. فالشافعي نفسه يحتج بنفي الخلاف. الوجه الثالث: أن قول العالم «لا أعلم خلافاً أو لا خلاف بين العلماء» إلى آخر تلك العبارات إنما تدل على الإجماع؛ لأن معنى الإجماع يتساوى مع معنى قولهم أن العلماء لم يختلفوا. أي أنهم مجمعون، إلا أنها ليست في درجة جزم العالم إذا قال أجمعوا بخلاف إذا قال لا أعلم فيه خلافاً أو ليس بين العلماء خلاف، وقول لا أعلم أقل درجة من قول ليس في المسألة خلاف، وأقل منهما جمعياً قوله هذا قول كل من أحفظ عن أهل العلم … إلخ، وقد أشار إلى هذا المعنى شيخ الإسلام ابن تيمية (2) وسيأتي الكلام في هذه إن شاء الله تعالى. الوجه الرابع: أن المسألة التي يقول فيها عالم من العلماء ليس فيها خلاف أو لا أعلم فيها خلافاً … إلخ. يقال: سبيل المؤمنين فيما يحكيه هذا العالم باستقرائه هو كذا وكذا، ونحن مأمورون باتباع سبيل المؤمنين، فإذن لا يصح أن نخرج عن هذا الذي ذكره العالم إلا إذا ثبت لدينا أن ما حكاه مخروم وأن سبيل المؤمنين في هذه المسألة ليس ما ذكره هذا العالم، ونحن مأمورون باتباع سبيل المؤمنين من باب الظن الغالب، يعني ما علمنا أنه سبيل المؤمنين فنتبعه من باب الظن الغالب ولو كان أقل درجات الظن الغالب.",
    "foot_note": "1. انظر: «الأم» للشافعي (5/ 192). \n2. انظر: «الرد على السبكي في مسألة تعليق الطلاق» لابن تيمية (1/ 598 - 599).",
    "book_id": "267",
    "new_page_number": 60
  },
  {
    "serial_number": "3425176",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 62,
    "volume_number": 1,
    "text": "الشبهة الثامنة أن السنة حجة في ذاتها ولا تحتاج إلى عمل . وهذه التأصيل سواءً بعبارة السنة أو الحديث أو الخبر … إلخ، هو في ظاهره يدل على أن الدليل حجة في نفسه ولا يحتاج أن يعمل به أحد حتى يحتج به. وكشف هذه الشبهة من أوجه: الوجه الأول: أن نحوًا من هذا الكلام قد قرره الإمام الشافعي رحمه الله، فقد ذكر في كتابه «الرسالة» ما يتعلق بحكم الحاكم (ولي الأمر) ثم ذكر مسألة تتعلق بما نحن بصدده، فقال رحمه الله تعالى: «لما كان معروفاً والله أعلم عند عمر أن النبي صلى الله عليه وسلم قضى في اليد بخمسين وكانت اليد خمسة أطراف مختلفة الجمال والمنافع نزلها منازلها فحكم لكل واحد من الأطراف بقدره من دية الكف فهذا قياس على الخبر. فلما وجدنا كتاب آل عمرو بن حزم فيه أن رسول الله صلى الله عليه وسلم وفي كل أصبع مما هنالك عشرة من الإبل صاروا إليه ولم يقبلوا كتاب آل عمرو بن حزم والله أعلم حتى يثبت لهم أنه كتاب رسول الله صلى الله عليه وسلم وفي الحديث دلالتان أحدهما قبول الخبر وهذا لا إشكال فيه، والآخر أن يقبل الخبر في الوقت الذي يثبت فيه وإن لم يمض عمل من الأئمة بمثل الخبر الذي قبلوا» (1) . فهو يريد بالأئمة الحكام الذين يحكمون في أمثال هذه المسائل. ثم قال: «ودلالة على أنه مضى أيضًا عمل من أحد من الأئمة ثم وجد خبراً عن النبي صلى الله عليه وسلم يخالف عمله لترك عمله لخبر رسول الله صلى الله عليه وسلم -وأيضًا هذا شاهد قوي",
    "foot_note": "1. انظر: «الرسالة» للشافعي (ص:420).",
    "book_id": "267",
    "new_page_number": 61
  },
  {
    "serial_number": "3425177",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 63,
    "volume_number": 1,
    "text": "على هذه الشبهة المذكورة- ودلالة على أن حديث رسول الله صلى الله عليه وسلم يثبت بنفسه لا بعمل غيره بعده … » (1) . إذن الوجه الأول: سياق كلام الشافعي رحمه الله يتعلق بالحاكم إذا حكم بالقضايا فإنه لا يتكلم عن جميع العلماء وإنما يتكلم عن حكم حاكم، حكم عمر بحكم فحكم قبله أو من بعده من الحكام بحكم فهو لا يتكلم عن إجماع العلماء على ترك العمل بالخبر وإنما يتكلم عن حكم حاكم حكم بخبر قد يكون هناك من يوافق أو من يخالف، لكنه قطعاً يخالف حاكماً قبله أو لا يعلم أن حاكماً قبله حكم بهذا، وهذا لا يعني أنه لا يوجد أحدٌ من أهل العلم يقول بهذا القول. الوجه الثاني: أن الشافعي رحمه الله تعالى يقرر أنه يصح نسخ الخبر بالإجماع فإذا أجمع العلماء على أن هذا الخبر منسوخ فإنه يترك النص إلى الإجماع. قال الزركشي في «البحر المحيط»: «إجماع الصحابة كنسخ رمضان صوم يوم عاشوراء، ونسخ الزكاة سائر الحقوق في المال، ذكره ابن السمعاني أيضًا، وكذا حديث: «من غل صدقته فإنا آخذوها وشطر ماله» (2) ، واتفق الصحابة على ترك استعمالهم هذا فدل عدولهم عنه على نسخه. وقد نص الشافعي على ذلك أيضًا فيما نقله البيهقي في المدخل فقال: ولا يستدل على الناسخ والمنسوخ إلا بخبر عن الرسول صلى الله عليه وسلم آخر مؤقت يدل على أن أحدهما بعد الآخر أو بقول من سمع الحديث أو العامة - يعني إجماع أهل العلم -» (3) . ثم استطرد الزركشي في بيان كلام العلماء.",
    "foot_note": "1. انظر: «الرسالة» للشافعي (ص:420). \n2. أخرجه أحمد (20041)، والدارمي (1719)، وأبو داود (1575)، والنسائي (5/ 15)، وحسنه الألباني في «صحيح سنن أبي داود» (1575) طبعة المعارف. \n3. انظر: «البحر المحيط» للزركشي (5/ 319).",
    "book_id": "267",
    "new_page_number": 62
  },
  {
    "serial_number": "3425178",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 64,
    "volume_number": 1,
    "text": "المقصود: أن الإمام الشافعي اعتمد على الإجماع في النسخ فترك دليلاً لأجل أن العلماء أجمعوا على تركه لأنه منسوخ. الجواب الثالث: أن قول القائل الحديث أو الخبر أو الآية حجة في نفسها وليست محتاجة إلى غيرها فهذا حق فليست الآية محتاجة للاحتجاج بها إلى غيرها، ومثل ذلك يقال في حديث رسول الله صلى الله عليه وسلم فهو حجة في نفسه، ولكن فرق بين هذا وبين أن يقال قد ثبت أن هذا لم يعمل به أحد فهذا مانع من العمل، فالأصل أن يعمل بالخبر وهو حجة في نفسه وليس بحاجة إلى غيره، لكن إن تبين أن هناك مانعًا يمنع من العمل به كأن يكون منسوخًا أو يجمع العلماء على تركه فهذا أمر آخر، ففرق بين أن يكون حجة في نفسه وهو كذلك وبين ترك الحجة لسبب آخر كأن تكون هذه الآية أو الحديث منسوخًا أو قد أجمع العلماء على تركه فلا تلازم بينهما. * * *  الشبهة التاسعة قرر بعض أهل العلم أن الإجماع الذي يحتج به الإمام أحمد وشيخ الإسلام ابن تيمية هو إجماع الصحابة . والجواب على هذا كالتالي: الوجه الأول: أنه لا دليل على حصر الإجماع في كلام الإمام أحمد أو ابن تيمية على الصحابة ومن ادعى ذلك فيلزمه النقل. الوجه الثاني: أن الإمام ابن تيمية نفسه نص في المجلد الحادي عشر في الصفحة الواحدة والأربعين بعد الثلاث مئة أن الإجماع الذي ينضبط … إلخ قال: هو إجماع",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 63
  },
  {
    "serial_number": "3425179",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 65,
    "volume_number": 1,
    "text": "الصحابة غالباً (1) . فعبر بالغالب فالتعبير بالغالب شيء واطراد ذلك دائماً شيء آخر ولا شك أن الإجماع الذي ينضبط في الغالب هو إجماع الصحابة لكن هذا شيء والاحتجاج بغير إجماع الصحابة شيء آخر. الوجه الثالث: أن الإمام أحمد ينص في مسائله أن الصحابة أجمعوا على كذا ولم يختلف الصحابة على كذا فلما أراد أن يخصص الأمر بالصحابة نص على ذلك، وفي مواضع يقول أجمع المسلمون أو أجمع العلماء أو لم يختلف العلماء … إلى غير ذلك، فدل على أن الإمام أحمد لا يخص الإجماع بإجماع الصحابة. ومثل هذا شيخ الإسلام ابن تيمية رحمه الله تعالى فإنه يذكر الإجماع في مواضع ويريد به إجماع الصحابة، وتارة ينص على إجماع الصحابة، وفي مواضع يطلق ولا يخص الأمر بالصحابة، فدل على أنه لا يخصص الإجماع بإجماع الصحابة. الوجه الرابع: أن الإمام أحمد في أقل الحيض قال: يوم وليلة، ثم قال: وأعلى ما في الباب قول عطاء (2) . وعطاء قطعًا ليس حجة في نفسه وإنما لأنه صورة من صور الإجماع فهو سبيل المؤمنين في هذه المسألة، وتقدم الكلام على أن قول السلف صورة من صور الإجماع وسبيل المؤمنين دليل من أدلة الإجماع. وأيضًا مما ذكر شيخ الإسلام رحمه الله تعالى: أن اتفاق أئمة المذاهب الأربعة ليس حجة",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (11/ 341). حيث قال: «الإجماع وهو متفق عليه بين عامة المسلمين من الفقهاء والصوفية وأهل الحديث والكلام وغيرهم في الجملة وأنكره بعض أهل البدع من المعتزلة والشيعة لكن المعلوم منه هو ما كان عليه الصحابة وأما ما بعد ذلك فتعذر العلم به غالبا». \n2. انظر: «مسائل أبي داود» (152)، و «مسائل ابن هانئ» (148).",
    "book_id": "267",
    "new_page_number": 64
  },
  {
    "serial_number": "3425180",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 66,
    "volume_number": 1,
    "text": "بالإجماع (1) . فهو لا يريد بذلك إجماع الصحابة؛ لأن المذاهب الأربعة جاءت بعد الصحابة. * * *  الشبهة العاشرة قال بعضهم الإجماع الذي هو حجة هو المعلوم من الدين بالضرورة دون غيره ، وعليه يحمل كلام الإمام أحمد لما قال: من ادعى الإجماع فهو كاذب. وكشف هذه الشبهة من أوجه: الوجه الأول: أن الأدلة جاءت بحجية الإجماع متى ما تصور ولم تخص ذلك بالمعلوم من الدين بالضرورة ولا غيره أي لم تخص ذلك بالإجماع الضروري ولا الظني بل هي شاملة لجميع أنواع الإجماع فمتى وقع الإجماع فهو حجة. الوجه الثاني: أن الإمامين الشافعي وأحمد حكوا إجماعات في مسائل ليست من الإجماع الضروري ولا من المعلوم من الدين بالضرورة، ومن أمثلة ذلك: قال الإمام الشافعي في كتابه «الأم»: «لم يختلف المسلمون عليه فيما وصفت في الذين لم يبلغوا الحلم والمماليك لو حجوا وأن ليست على واحد منهم فريضة الحج» (2) . يعني يقرر أن حجهم صحيح لكنه لا يكفي عن الفريضة ويحكي على هذا الإجماع.",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (20/ 10). حيث قال: «وأما أقوال بعض الأئمة كالفقهاء الأربعة وغيرهم؛ فليس حجة لازمة ولا إجماعا باتفاق المسلمين». \n2. انظر: «الأم» للشافعي (2/ 120).",
    "book_id": "267",
    "new_page_number": 65
  },
  {
    "serial_number": "3425181",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 67,
    "volume_number": 1,
    "text": "ويقول أيضًا: «لأن عليه دلائل منها قول رسول الله صلى الله عليه وسلم: (لا يقتل مؤمن بكافر) والإجماع أن لا يقتل المرء بابنه إذا قتله» (1) . فهذا ليس من الإجماع الضروري ولا من المعلوم من الدين بالضرورة. وقال أيضًا: «الإجماع على أن لا يقتل الرجل بعبده -وهذا كذلك- ولا بمستأمن بدار حرب ولا بإمرة في دار حرب ولا صبي» (2) . هذه المسائل كلها ليست من المعلوم من الدين بالضرورة، وهناك نقولات عن الإمام أحمد مثلها. ومن ذلك ما نقله شيخ الإسلام ابن تيمية في شرح العمدة (3) ، وابن القيم في إغاثة اللهفان (4) عن الإمام أحمد رحمه الله تعالى أنه قال: «لا يختلف المسلمون على أن الدم نجس». وهذا ليس من المعلوم من الدين بالضرورة. ومن ذلك أيضًا قوله: «أجمعوا على أن التكبير - أي المقيد -، يبتدئ من غداة يوم عرفة» (5) . وكذلك قوله: «أجمعوا على أن أولاد المسلمين في الجنة» (6) . وقوله: «أجمع أهل العلم على أن بيع الدين بالدين لا يجوز» (7) .",
    "foot_note": "1. انظر: «الأم» للشافعي (6/ 26). \n2. انظر: «الأم» للشافعي (6/ 26). \n3. انظر: «شرح العمدة» لابن تيمية (1/ 105). \n4. انظر: «إغاثة اللهفان» لابن القيم (1/ 273). \n5. انظر: «مسائل الكوسج» (1453)، و «المغني» لابن قدامة (2/ 292)، و «فتح الباري» لابن رجب (9/ 22،24). \n6. انظر: «أحكام أهل الملل» للخلال (1/ 66) بلفظ: «ليس فيه خلاف»، و «المغني» لابن قدامة (9/ 365) بلفظ: «ليس فيه اختلاف». \n7. انظر: «المغني» لابن قدامة (4/ 37).",
    "book_id": "267",
    "new_page_number": 66
  },
  {
    "serial_number": "3425182",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 68,
    "volume_number": 1,
    "text": "وقوله في قوله تعالى {وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ} [الأعراف: 204]: «أجمع الناس أن هذِه الآية في الصلاة» (1) ، وهذا ليس من المعلوم من الدين بالضرورة. إلى غير ذلك من المسائل الكثيرة التي تكلم فيها الإمام أحمد رحمه الله تعالى وهي ليست من المعلوم من الدين بالضرورة ومع ذلك احتجوا بها. فحصر الإجماع عند الإمام أحمد أو الشافعي بأنه من المعلوم من الدين بالضرورة غلط يخالفه صنيعهم وقبل ذلك يخالفه التأصيل الشرعي، فإن الشريعة جعلت الإجماع حجة متى ما وجد. * * *  الشبهة الحادية عشرة قال بعضهم: عدم العلم بالمخالف لا يدل على الإجماع . وكشف هذه الشبهة من أوجه: الوجه الأول: أن مفهوم الإجماع أن ينطق طائفة ولا يخالفهم الآخرون هذا هو حقيقة الإجماع كما تقدم بيانه، وهذا موجود في عدم العلم بالمخالف كما تقدم بيانه أيضًا. الوجه الثاني: أن صنيع الإمامين الشافعي وأحمد وغيرهما أنهم يحتجون بعدم العلم بالمخالف، وتقدم ذكر شيء من ذلك. ولابن تيمية رحمه الله تأصيل بديع في مثل هذا، فمما قرره أن المسائل التي لا يعلم فيها خلاف حجةٌ ولا يصح لأحد أن يحدث قولاً جديداً إلا أن يعلم أن له سلفاً، حيث قال رحمه الله في «مجموع الفتاوى»: «وأما الظني فهو الإجماع الإقراري والاستقرائي:",
    "foot_note": "1. انظر: «مسائل أبي داود» (223).",
    "book_id": "267",
    "new_page_number": 67
  },
  {
    "serial_number": "3425183",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 69,
    "volume_number": 1,
    "text": "بأن يستقرئ أقوال العلماء فلا يجد في ذلك خلافا أو يشتهر القول في القرآن ولا يعلم أحدا أنكره فهذا الإجماع وإن جاز الاحتجاج به … » إلى أخر كلامه (1) . فقد جعل هذا الاستقرائي. وقال في رده على السبكي في مسألة في تعليق الطلاق: «فأنواع الإجماع التي يمكن الاستدلال بها ثلاثة: إجماع إحاطي، وإجماع إقراري، وإجماع استقرائي: فالأول: ما يحيط علمًا بأن الصحابة أو التابعين كانوا عليه، مثل ما علمنا أنه من دين الرسول صلى الله عليه وسلم الظاهر المعروف الذي لا ينكره إلا من هو كافر به. والثاني: أن يشتهر القول أو العمل في السلف فلا ينكره منكر؛ فهذا إجماع إقراري، فإن الأمة لا تجتمع على الإقرار على باطل، بل كما أن الرسول صلى الله عليه وسلم معصوم في قوله وفعله وإقراره، فكذلك الأمة معصومة في قولها وفعلها وإقرارها، وهذا كجعل عمر بن الخطاب رضي الله عنه الأرض المفتوحة عنوة فيما بين المسلمين، وغير ذلك. وإذا قيل في مثل ذلك: قد يكون بعضهم أنكرها. قيل: لا يسقط الفرض بإنكار الخطأ إلا إذا ظهر الإنكار، ولو أنكر ذلك منكر لكان مما تتوافر الدواعي على نقله؛ كما نقلوا نزاع ابن عباس رضي الله عنهما في العول والعمريتين، ونزاع ابن الزبير رضي الله عنهما في ميراث المبتوتة، وأمثال ذلك. وأما الثالث: فهو الإجماع الاستقرائي، وهو أن يتتبع العالم ما أمكنه من أقوال العلماء فلا يجد أحدًا خالف في ذلك» (2) . فقد جعل الإجماع أقساماً ثلاثة ويجعل الجميع حجة لكن له تعامل معها إذا خالفت نصاً.",
    "foot_note": "1. انظر: «مجموع الفتاوى» لابن تيمية (19/ 267). \n2. انظر: «الرد على السبكي في مسألة تعليق الطلاق» لابن تيمية (1/ 611).",
    "book_id": "267",
    "new_page_number": 68
  },
  {
    "serial_number": "3425184",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 70,
    "volume_number": 1,
    "text": "ومن كلامه المفيد أيضًا ما قاله في كتابه «رفع الملام عن الأئمة الأعلام»: «لا يمكن العالم أن يبتدئ قولا لم يعلم به قائلا؛ مع علمه بأن الناس قد قالوا خلافه، حتى إن منهم من يعلق القول فيقول: \"إن كان في المسألة إجماع فهو أحق ما يتبع، وإلا فالقول عندي كذا وكذا\". وذلك مثل من يقول: \"لا أعلم أحدا أجاز شهادة العبد\" وقبولها محفوظ عن علي وأنس وشريح وغيرهم. ويقول آخر: \"أجمعوا على أن المعتق بعضه لا يرث\" … » (1) ثم ذكر من خالف في ذلك. وهذا تأصيل عظيم. ومما ذكر شيخ الإسلام رحمه الله تعالى في رده على السبكي: «أن قول العالم لا أعلم فيه خلافاً يفيد الإجماع ولكنه أقل من قوله أجمعوا» (2) . وهذا حق. ومما يفيد الإجماع لكنه أقل مما قبله: «أن أقل من ذلك أن يقول: أجمع كل من نحفظ عنه» (3) . وهذا أيضًا يفيد الإجماع ولكنه أقل فكلها مراتب تدل على الإجماع ولكنها متفاوتة، ويكفي أن تفيد إجماعاً من باب غلبة الظن، ولو كان أقل درجات غلبة الظن. ومما يقوي غلبة الظن في مثل هذا ويجعل النفس تطمئن للعمل به أن يقال: المسألة التي يعرف أن عشرة من العلماء قالوا فيها بالحرمة مثلًا، وأراد أحد أن يخالفهم، ولا يعلم له سلفًا في مخالفتهم، فقوله خطأ لأنه محدث ومخالف لسبيل المؤمنين فيما يعلم، إذن لابد من الرجوع إلى قول الذين لم يعلم أن لهم مخالفًا، وأيضًا أي مسألة لم يحك عالم ذو استقراء فيها الإجماع يحتمل أن تكون",
    "foot_note": "1. انظر: «رفع الملام عن الأئمة الأعلام» لابن تيمية (ص: 32). \n2. انظر: «الرد على السبكي في مسألة تعليق الطلاق» لابن تيمية (1/ 598 - 599). \n3. انظر: «الرد على السبكي في مسألة تعليق الطلاق» لابن تيمية (1/ 598 - 599).",
    "book_id": "267",
    "new_page_number": 69
  },
  {
    "serial_number": "3425185",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 71,
    "volume_number": 1,
    "text": "إجماعية وأن تكون خلافية، ويغلب جانب الإجماعية بحكاية هذا العالم الإجماع فيكون إجماعًا من باب الظن الغالب. * * *  الشبهة الثانية عشرة ذكر شيخ الإسلام ابن تيمية رحمه الله في التسعينية (1) وغيرها أنّ عامة أهل البدع يخالفون الأدلة بحجة الإجماع ويكون إجماعهم مخروماً غير صحيح ، فإذاً لا يصح الاستدلال بالإجماع في مخالفة الدليل، لئلا نوافق أهل البدع. وكشف هذه الشبهة من أوجه: الوجه الأول: لا شك أن هناك إجماعات مخرومة بيد أنَّ ذلك ليس مسوغًا لرد الإجماعات كلها، بل يبقى الإجماع حجة حتى يثبت أنه مخروم، كالحديث النبوي فلا شك أن ثمة أحاديث ضعيفة، لكن ليس هذا مسوغًا لرد الأحاديث الصحيحة، بل يقال: ما ثبت أنه صحيح فيحتج به حتى يتبين خلاف ذلك. الوجه الثاني: إن هناك مسائل حكي فيها الإجماع فزعم قوم خرمه، وتبين خطأ زعمه، ومن أمثلة ذلك: أن غير واحد من أهل العلم كالطحاوي (2) والقاضي عياض (3) وابن جرير (4) :",
    "foot_note": "1. انظر: «التسعينية» لابن تيمية (2/ 492). \n2. نقله عنه القاضي عياض في «الشفا» (2/ 62). وقال الطحاوي في «أحكام القرآن» (1/ 181): «الشافعي رحمه الله ذهب إلى أن الصلاة على النبي صلى الله عليه وسلم مفروضة على الناس بعقب التشهد في أواخر صلاتهم، وأن صلواتهم لا تجزيهم دون ذلك، وقد خالفه في ذلك من سواه من أهل العلم». \n3. انظر: «الشفا» للقاضي عياض (2/ 61). \n4. كابن جرير الطبري، نقله عنه القاضي عياض في «الشفا» (2/ 62).",
    "book_id": "267",
    "new_page_number": 70
  },
  {
    "serial_number": "3425186",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 72,
    "volume_number": 1,
    "text": "حكوا الإجماع على أن الصلاة على النبي صلى الله عليه وسلم ليست واجبة في التشهد الأخير. فحاول بعض أهل العلم أن يبين أن هذا الإجماع مخروم فنقل ذلك عن أبي مسعود البدري وعن ابن مسعود الهذلي وعن أبي جعفر الباقر (1) . ثم تبين أن نقله عن ابن مسعود وهمٌ (2) ، وإنما هو من قول أبي مسعود البدري، وإسناد أبي مسعود البدري ضعيف كما بينه البيهقي (3) وغيره. فلم يبق إلا النقل عن أبي جعفر الباقر الذي قال بعضهم فيه: إنه محفوظ. إلا أن إسناد أبي جعفر لا يصح؛ فيه حجاج بن أرطأة وهو معروف بضعفه (4) . والبيهقي مع أنه شافعي لما ساق إسناد أبي جعفر لم يسقه إلا من طريق ابن أرطاة، ومعلوم أن البيهقي يسعى إلى نصرة المذهب الشافعي- وقد ذكر عنه ابن تيمية في «الرد على البكري» أنه يذكر ما للشافعية دون ما عليهم (5) -، فلو كان عنده من طريق صحيح لبينه، وهو أراد أن ينصر قول الشافعية في هذه المسالة، وأراد أن ينسب هذا القول لأبي جعفر الباقر، ولم ينسبه إلا من طريق ضعيف. ونسبه إلى الشعبي (6) بلا إسناد ولو كان عند البيهقي إسناد صحيح لما",
    "foot_note": "1. انظر تلك النقولات: في «السنن الكبرى» للبيهقي (2/ 379)،. وفي «جلاء الأفهام» (ص: 333) \n2. قال البيهقي في «السنن الكبرى» (2/ 379) عقب رواية ابن مسعود: «كذا قال عبد الله بن مسعود رضى الله عنه والله أعلم». قال ابن القيم في «جلاء الأفهام» (ص:57): «فإن يحيى بن السباق وشيخه - وكلاهما من رجال الإسناد - غير معروفين بعدالة ولا جرح». \n3. انظر: «السنن الكبرى» للبيهقي (2/ 379)، حيث قال: «تفرد به جابر الجعفي، وهو ضعيف». وقال في «معرفة السنن والآثار» (3/ 69): «وجابر هذا هو الجعفي وهو ضعيف». \n4. وممن ضعفه ابن سعد. انظر «الطبقات الكبرى» لابن سعد (6/ 359) \n5. انظر: «رد ابن تيمية على البكري» (1/ 78). \n6. انظر: «السنن الكبرى» للبيهقي (2/ 379).",
    "book_id": "267",
    "new_page_number": 71
  },
  {
    "serial_number": "3425187",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 73,
    "volume_number": 1,
    "text": "تركه، فهذا يدل أنه لا ينبغي أن يندفع مع كل من أراد أن يخرم إجماعًا، بل لابد أن يتأكد من خرمه، ويتأكد من صحة الأسانيد إلى من ينسب إليهم المخالفة. * * *  الشبهة الثالثة عشرة قال بعضهم الإجماع الذي لا يقطع به هو من الظن ، وبعبارة أخرى: الإجماع الذي لا يقطع بعدم المخالف هو من الظن، فكيف يترك الدليل إلى الظن؟ وكشف هذه الشبهة من أوجه: الوجه الأول: ينبغي أن يعلم أن الإجماع بنوعيه سواءً كان قطعياً أو ظنياً، أن قوته في كونه قاطعاً في دلالته كما تقدم بيانه. فإذا تعارض في نظر المجتهد الإجماع الظني في ثبوته مع حديث أو آية فقد تعارض دليل قطعيٌ في دلالته -وهو الإجماع- مع نص قد يحتمل أكثر من وجه وقد يكون محتملًا فيظن أنه غير محتمل، لكن مما يقطع به أن دلالة الإجماع قطعية إذن إذا تعارض في الظاهر، فلا بد أن يراجع الناظر نفسه؛ لأن الإجماع لا يمكن أن يقدح فيه من جهة دلالته وإنما يقدح فيه من جهة ثبوته، والبحث الآن في الدلالة، والنص المخالف للإجماع في الظاهر قد يقال إنه محتمل لأكثر من معنى، فمن حيث الأصل يقدم الإجماع؛ لأن معنى أن العلماء أجمعوا على هذا: أي أن أفهام العلماء اجتمعت على أن هذا الحكم حرام أو أن هذا الحكم مستحب إلى آخره .. فلا يصح رده إلا أن يقال إنه مخروم. أما من جهة الدلالة فهو قاطع كما تقدم، فعلى هذا إذا تعارض نصٌ مع إجماع - ولو كان الإجماع ظنياً في ثبوته فإنه يُقدم؛ لأن دلالته لا تكون إلا قطعية بخلاف النص.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 72
  },
  {
    "serial_number": "3425188",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 74,
    "volume_number": 1,
    "text": "الوجه الثاني: غالب ما يظن من النصوص أنه معارض للإجماع فحقيقة الحال أن الإجماع مخصص أو مقيد أو مبين، ومن ذلك أن بعض العلماء ظن أن قول الصحابة بأن الصوم الذي يصام عن الولي هو صوم النذر دون غيره أن هذا مخالف لما روت عائشة عن رسول الله صلى الله عليه وسلم أنه قال: «مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ». متفق عليه (1) . ولو تعامل مع قول الصحابة كعائشة وابن عباس الذي لم يخالف بأنه إجماع وأن هذا النص يحتمل أكثر من معنى لخصص هذا العام بفتاوى الصحابة ولم يحتج أن يجعل أقوالهم متعارضة مع النص؛ لذا ذهب بعض الشافعية كالنووي (2) وغيرهم إلى رد هذه الآثار بناءً على أنه ظنها تخالف النص، والأولى أن يعمل بالحجتين لا أن يرد أحدهما ويجعل قول الصحابة الذي لم يخالف مخصصًا لظاهر النص، كما هو قول الليث بن سعد (3) ، وأحمد في رواية (4) ، وابن القيم (5) ، والألباني (6) . * * *  الشبهة الرابعة عشرة قال بعضهم إذا صح الحديث وجب العمل به ولو لم يعلم من عمل به؛ لأنه حجة بلا خلاف . وكشف هذه الشبهة أن يقال:",
    "foot_note": "1. أخرجه البخاري (1952)، ومسلم (1147). \n2. انظر: «المجموع» للنووي (6/ 369)، و «شرح مسلم» للنووي (8/ 25). \n3. انظر: «شرح مسلم» للنووي (8/ 25). \n4. انظر: «شرح مسلم» للنووي (8/ 25)، و «الإنصاف» للمرداوي (7/ 506 - 507). \n5. انظر: «تهذيب السنن» (3/ 278 - 282)، و «الروح» (ص 120) وكلاهما لابن القيم. \n6. انظر: «السلسلة الصحيحة» للألباني (4/ 591).",
    "book_id": "267",
    "new_page_number": 73
  },
  {
    "serial_number": "3425189",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 75,
    "volume_number": 1,
    "text": "لا شك إذا صح الحديث فهو حجة في ذاته ولا يحتاج للاحتجاج به إلى أن ينظر من عمل به كما تقدم، لكن هذا شيء وترك العمل به لعارض كأن يكون منسوخاً، أو مجمعًا على تركه - مثلاً - شيءٌ آخر، وبحثنا في الثاني لا في الأول. وقد فهم هذا أهل العلم بل نسبه بعضهم إلى السلف، وممن فهم ذلك الإمام الترمذي وهو من أئمة السنة ومن أئمة السلف فإنه لما أنهى جامعه قال: «كل ما في هذا الجامع قد عمل العلماء به إلا أنه حديثين أجمع العلماء على عدم العمل بهما» (1) . فقد ارتضى الترمذي هذا التأصيل، وليس الترمذي من المتأخرين إنما هو من المتقدمين، ومع ذلك ارتضاه، وإن كان نوزع في ظنه أن العلماء مجمعون على ترك العمل بالحديثين، وبعضهم مصر على أن قول الترمذي صحيح ومن خالفه فمخالفته غير صحيحة. والمقصود أن الترمذي يقر هذا التأصيل بعيدًا عن المثالين الذين ذكرهما. ومن الكلمات العظيمة في هذا ما قاله ابن رجب في كتابه «بيان فضل علم السلف على الخلف»: «فأما الأئمة وفقهاء أهل الحديث فإنهم يتبعون الحديث الصحيح حيث كان إذا كان معمولًا به عند الصحابة ومن بعدهم أو عند طائفة منهم فأما ما اتفقوا على تركه فلا يجوز العمل به؛ لأنهم ما تركوه إلا عن علم أنه لا يعمل به قال عمر بن عبدالعزيز: خذوا من الرأي ما يوافق ما كان قبلكم فإنهم كانوا أعلم منكم … » (2) ، إلخ كلامه رحمه الله تعالى. فهذا صريح من ابن رجب وهو ينقله عن أهل العلم أن العلماء اذا تركوا العمل بالحديث فإنه لا يعمل بهذا الحديث وهو يعزوه الى السلف، وصنيع",
    "foot_note": "1. انظر: «سير أعلام النبلاء» (13/ 274)، و «تذكرة الحفاظ» (2/ 154) وكلاهما للذهبي، بلفظ قريب. \n2. انظر: «بيان فضل علم السلف على الخلف» (ص:50 - 51).",
    "book_id": "267",
    "new_page_number": 74
  },
  {
    "serial_number": "3425190",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 76,
    "volume_number": 1,
    "text": "الترمذي شاهد على هذا. * * *  الشبهة الخامسة عشرة قال بعضهم: ترك الحديث لعدم العلم بالمخالف عليه المتأخرون دون الشافعي و أحمد . وكشف هذه الشبهة من أوجه: الوجه الأول: تقدم أن الإمام الشافعي رحمه الله يقرر ترك العمل بالحديث إذا كان منسوخًا. الوجه الثاني: تقدم صنيع الترمذي وما ذكره ابن رجب عن أهل العلم فإنهم تركوا العمل بالحديث إذا لم يُعمل به، فلا يصح نسبة ذلك إلى المتأخرين دون المتقدمين؛ لأن الترمذي متقدم وابن رجب يعزوه إلى المتقدمين. * * *  الشبهة السادسة عشرة قال بعضهم: إذا وجد نص لم يُعمل به فلابد وأن هناك من عمل به، ولا يلزم أن ينقل قول من عمل به (1) ؛ لأن هناك قطعاً من عمل به، فلا يصح أن يقال: أن العلماء إذا أجمعوا على ترك العمل بالحديث؛ لأن هذا لا يتصور. وكشف هذه الشبهة من أوجه: الوجه الأول: أنه إذا وجد من عمل به من العلماء فلا بد أن ينقل لنا من عمل به حتى لا يظن أن في المسألة إجماعًا والإجماع حجة. الوجه الثاني: تقدم كلام الشافعي في النسخ وأنه-رحمه الله تعالى- ترك حديثاً؛ لأن العلماء",
    "foot_note": "1. أي: بمجرد وجود النص ولو لم يقف أهل العلم على من عمل به.",
    "book_id": "267",
    "new_page_number": 75
  },
  {
    "serial_number": "3425191",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 77,
    "volume_number": 1,
    "text": "أجمعوا على نسخه، فهو لا يقر بهذا اللازم. والوجه الثالث: أنه لا دليل على هذه الدعوى ومن أراد أن يدعيها فيلزمه الدليل. * * *  الشبهة السابعة عشرة قال بعضهم: مخالفة من قوله ليس حجة مما حكي عليه الإجماع أعذر من مخالفة من قوله حجة وهو الكتاب والسنة ، فكيف تترك الحجة وهو الكتاب والسنة إلى من قوله ليس حجة؟ وكشف هذه الشبهة من أوجه: الوجه الأول: أن الإجماع حجة فإذا تبين أن العلماء مجمعون على ترك حديث فالمخالف للإجماع مخالف لحجة شرعية يأثم بذلك، وفرق بين مخالفة أفراد أهل العلم ومخالفة إجماعهم، فكما أن القرآن والسنة حجة فكذلك الإجماع حجة، فكما أنه لا يعذر بتركه الكتاب والسنة بلا مبرر ولا مسوغ شرعي كذلك لا يعذر بتركه الإجماع. الوجه الثاني: أن مثل هذا إنما يقال إذا تعارض نص من كتاب أو سنة مع إجماع، والواقع أنه لا تعارض بينهما؛ لأن الإجماع قاطع لابد أن يقدم إما بتخصيص أو بتقييد أو بتبيين أو أن يقال بالنسخ كما صرح بذلك الإمام الشافعي رحمه الله تعالى وصرح به غيرهم من أهل العلم. * * *  الشبهة الثامنة عشرة قال بعضهم: إن طائفة من أهل العلم قالوا أقوالاً لم يسبقوا إليها فدل هذا على جواز إحداث قول جديد . وكشف هذه الشبهة من أوجه:",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 76
  },
  {
    "serial_number": "3425192",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 78,
    "volume_number": 1,
    "text": "الوجه الأول: إن هناك فرقًا بين تأصيل العالم وعمله فقد يخطئ ويظن أن له سلفاً، فلا يؤخذ من عمله تأصيل إذا خالف تأصيله، وإنما يقال: أخطأ في تنزيل هذا الأصل على الفرع لا أن ينقض الأصل. فلو قال عالم: إن الأمر يقتضي الوجوب. ولم يقل بالوجوب في مسألة فيها أمر وليس هناك صارف، فلا يقال: إن له قولاً آخر في دلالة الأمر على الوجوب، بل يقال أخطأ في تنزيل هذا الأصل على هذا الفرع. الوجه الثاني: أن مقتضى هذا القول جواز إحداث قول جديد، وهذه طامة والبحث معه مختلف عن البحث مع البقية؛ لأن من يجوز إحداث قول جديد حقيقة قوله أن الإجماع ليس حجة؛ لأن أي إجماع يجوز أن يخالف بإحداث قول جديد لذا كل دليل يدل على أن الإجماع حجة ردٌّ على هذا. ويقال أيضًا: كل دليل يدل على أن المحدثات ممنوعات في الشرع كقول النبي صلى الله عليه وسلم: «مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ فِيهِ، فَهُوَ رَدٌّ» (1) ، ردٌّ عليه وتقدم بيان هذا. * * *  الشبهة التاسعة عشرة قال بعضهم: قال الإمام إسحاق بن راهويه في «مسائل إسحاق بن منصور»: قيل لإسحاق بن راهويه: إن أخاك أحمد بن حنبل أجاب فيها بمثل جوابك فقال: ما ظننت أن أحدًا يوافقني (2) . فهذا يدل على أن إسحاق بن راهويه يرى إحداث قول جديد؛ لأنه قال في مسألة لا يظن أن أحدا يوافقه عليها.",
    "foot_note": "1. أخرجه البخاري (2697)، ومسلم (1718). \n2. انظر: «مسائل إسحاق بن منصور» (5/ 2075)، بلفظ: «ظننت أنّ أحداً لا يتابعني عليه». واللفظ أعلاه انظره في «المحلى» لابن حزم (5/ 247).",
    "book_id": "267",
    "new_page_number": 77
  },
  {
    "serial_number": "3425193",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 79,
    "volume_number": 1,
    "text": "وكشف هذه الشبهة: أن هذا غير صحيح؛ وذلك أنه كان لا يظن أحدًا من معاصريه، أو من العلماء المشهورين في زمانه لا أنه يرى نفسه أحدث هذا القول. وبأسلوب آخر يقال: كلام إسحاق يحتمل أنه يجوز إحداث قول جديد ويحتمل أنه لا يظن أحدًا من العلماء المعاصرين له يوافقه في هذا القول، وقطعاً يحمل على الثاني دون الأول؛ لأنه ليس إسحاق ولا غيره من أئمة السنة يرون جواز إحداث قول جديد ولو رأوا ذلك لنقل عنهم ولنسبه أهل العلم لهم. * * *  الشبهة العشرون قال بعضهم: درج العلماء على تقديم الكتاب والسنة على الإجماع ويجعلون الإجماع آخر مراتب الأدلة ، فيقول: دل على هذا الكتاب والسنة والإجماع، إذن إذا تعارض الإجماع والحديث أو الإجماع والآية تقدم الآية أو الحديث. يقال: أما تقديم الكتاب والسنة على الإجماع من جهة الترتيب فلا شك في هذا، وليس البحث في مثل هذا بل البحث فيمن يظن من النصوص أنه مخالف للإجماع هل يقدم هذا الظن أو يقدم الإجماع الذي هو قطعي في دلالته. وبطريقة أخرى يقال: إنه إذا ظن مجتهد أن هذا النص يدل على كذا فمهما علت مكانته فإنه ما بين أن يقطع أو يظن، وقطعه وظنه محتمل للخطأ فإذا ظن أن النص مخالف للإجماع فقطعاً الإجماع مقدم على ظنه لأن الإجماع قاطع، وهذا بخلاف فهمه فهو يحتمل الخطأ، فيقدم المعصوم القاطع على الفهم الظني المحتمل. ولو ضبط هذا لانكشفت مسائل كثيرة؛ لأن كثيرًا ممن يريد رد الإجماع في ظاهر النصوص يفترض التعارض والواقع لا تعارض.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 78
  },
  {
    "serial_number": "3425194",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 80,
    "volume_number": 1,
    "text": "الشبهة الحادية والعشرون قال بعضهم: لا إجماع في علوم الآلة لأنه لا نصوص فيها ولا إجماع إلا وهو مستند على نص . ولكشف هذه الشبهة ينبغي أن يعلم أن علوم الآلة نوعان: النوع الأول: علوم آلة ترجع إلى المتكلمين وأقوالهم وما كان كذلك فالمقترض أن لا يبحث بحثًا شرعيًا، ويشمل هذا النزع علوم الآلة التي ترجع إلى اللغة فالحجة فيها إلى كلام أهل اللغة. النوع الثاني: علوم آلة مستندة على بحث شرعي فلا بد أن يرجع فيها إلى أدلة شرعية. ففي أصول الفقه الأمر يقتضي الوجوب، والإجماع حجة، والنهي يقتضي التحريم … إلخ، هذه من علوم الآلة وهي مجمع عليها، أجمع الصحابة على أن الأمر يقتضي الوجوب (1) ، وأجمعوا على أن النهي يقتضي التحريم (2) . إذن هذا النوع الثاني المتعلق بالشرعيات من علوم الآلة لا بد أن له أدلة شرعية ما بين إجماع أو غيره ومن ذلك أدلة تنوزع في دلالتها. * * *  الشبهة الثانية والعشرون قال بعضهم: حقيقة مخالفة التابعي للصحابي إحداث قول جديد، فهل يعني هذا أن التابعي يرى إحداث قول جديد ؟",
    "foot_note": "1. انظر: «الإحكام» للآمدي (2/ 148)، و «روضة الناظر» لابن قدامة (1/ 556). \n2. انظر: «الإحكام» للآمدي (2/ 190).",
    "book_id": "267",
    "new_page_number": 79
  },
  {
    "serial_number": "3425195",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 81,
    "volume_number": 1,
    "text": "وكشف هذه الشبهة: أن هناك فرقا بين تأصيل العالم وعمله، فقد يَظنُ التابعي أن له سلفاً من الصحابة وبناءً على هذا أحدث قولاً جديداً، وقد لا يكون التابعي يعلم أن هناك صحابياً خالفه فقال باجتهاده، فلا يلزم من أن التابعي إذا خالف الصحابي أن يكون ممن يرى جواز إحداث قول جديد. * * *  الشبهة الثالثة والعشرون قال بعضهم: يعمل بالإجماع وعدم العلم بالمخالف ولا إشكال في ذلك ، وإنما الإشكال في جزئية واحدة وهي إذا عارض دليلًا من كتاب وسنة فيقدم الكتاب والسنة على هذا الإجماع، وقطعاً هذا لا يكون في الإجماع القطعي وإنما يكون في الإجماع الظني. وكشف هذه الشبهة من أوجه: الوجه الأول: أنه إذا أقر بأن الإجماع حجة فإذن ينبغي أن يتعامل مع النص والإجماع بأنهما حجتان تعارضا فالجمع بينهما أولى من إلغاء أحدهما، والإجماع قاطع في دلالته والنص لا يلزم أن يكون كذلك حتى لو ظن ذلك المجتهد. أما الإجماع لأنه قاطع فتقدّم دلالة الإجماع إما بتخصيص عام أو تقييد مطلق أو تبين مجمل أو الإجماع على ترك النص لأنه منسوخ. الوجه الثاني: إذا أجمع العلماء على أن هذا النص منسوخ ينبغي أن يعلم أن الناسخ ليس الإجماع في نفسه وإنما ما استند عليه الإجماع وهو النص الآخر، فحقيقة الأمر إذا اختلف إجماع مع نص فالخلاف بين نصين إلا أن دليل الإجماع فيه مزية زيادة على كونه مستندًا على نص أنه قطعي في دلالته. الوجه الثالث: لو التُزم هذا التأصيل وهو أن الإجماع حجة إلا إذا عارض",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 80
  },
  {
    "serial_number": "3425196",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 82,
    "volume_number": 1,
    "text": "الظني منه نصًا لصار الخلاف قليلاً مع من يرى تقديم النص على الإجماع لكن إذا دقق في صنيع أصحاب هذا التأصيل اتضح أنهم يتوسعون حتى في المسائل الأخرى التي ليس فيها نص وإنما عمومات وغير ذلك مما يفزعون إليها ويردون الإجماعات بسببها، ثم لو قبل قولهم تنزلاً فإنه لا يكاد يوجد، ولو وجد فيقال: رد الإجماع الظني لأنه مخالف للنص ظنٌ محتمل للخطأ والصواب، أما دلالة الإجماع قاطعة حتى ولو كان ظنيًا في ثبوته فإنه ليس محتملًا في دلالته، فيقدم دلالة المقطوع على دلالة المحتمل المظنون، ويوجه النص بما يناسبه من تقيد أو تخصيص أو تبيين أو نسخ أو إجماع على ترك العمل به. * * *  الشبهة الرابعة والعشرون ذكر بعضهم أن النووي رحمه الله تعالى ذكر في شرحه على مسلم أن النص يعمل به ولو لم يعمل به أحد ، ذكر هذا عند كلامه على صيام ستة من شوال فقال رحمه الله تعالى في «شرحه على مسلم»: «ودليل الشافعي - أي الذين قالوا بصيام ستة من شوال - وموافقيه هذا الحديث الصحيح الصريح وإذا ثبتت السنة لا تترك لترك بعض الناس أو أكثرهم أو كلهم لها» (1) ، هذا الشاهد. وكشف هذه الشبهة من أوجه: الوجه الأول: أن صنيع النووي نفسه على خلاف ذلك، فالنووي رحمه الله تعالى وافق الترمذي (2) على عدم قتل شارب الخمر في الرابعة واعتمد الإجماع (3) وقرر في أكثر من موضع في «شرح على مسلم» وكتابه «المجموع» على أن الإجماع ينسخ.",
    "foot_note": "1. انظر: «شرح مسلم» للنووي (8/ 56). \n2. انظر: «جامع الترمذي» (4/ 48) عقب حديث (1444). \n3. انظر: «شرح مسلم» للنووي (11/ 217).",
    "book_id": "267",
    "new_page_number": 81
  },
  {
    "serial_number": "3425197",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 83,
    "volume_number": 1,
    "text": "بل وذكر ما هو أشد من ذلك وهو: «أنه قد جاء عن النبي صلى الله عليه وسلم وعن الصحابة أكثر من أربع تكبيرات على الجنازة» ومع ذلك قال: «لكن الإجماع انعقد على أنه لا يكبر إلا أربعا» (1) . فجعل جميع التكبيرات التي ثبتت عن النبي صلى الله عليه وسلم الزائدة على أربع منسوخة بالإجماع وأن السنة التكبير أربعًا فحسب. الوجه الثاني: صنيع النووي الكثير على خلاف ذلك، لذلك من يتبنى أمثال هذه المسائل تراهم لا يعولون على النووي، ويشددون في الكلام عليه. الوجه الثالث: أن عبارة النووي مشكلة فينبغي أن يتوقف فيها أو تحمل على معنى يستقيم مع باقي كلامه؛ لأنه في «شرحه مسلم» نفسه وفي كتابه «المجموع» وفي غيرهما قرر على أن الإجماع ناسخ وذكر أكثر من نص ترك العمل به؛ لأن العلماء قد أجمعوا على تركه. الوجه الرابع: لنفترض جدلاً أن النووي رحمه الله تعالى ذهب إلى هذا القول، فيقال إنه أخطأ وإن قول غيره مقدم على قوله لما تقدم ذكره في الأوجه السابقة. وأخيرًا هذه هي أشهر الشبه والإشكالات التي تذكر من بعض أهل السنة في رد الإجماع أو رد الاستدلال به في مواضع أو إضعافه أو قبوله في حالات دون أخرى بلا برهان مستقيم.",
    "foot_note": "1. انظر: «المجموع» للنووي «المجموع» (5/ 230). وقد تقدم.",
    "book_id": "267",
    "new_page_number": 82
  },
  {
    "serial_number": "3425198",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 84,
    "volume_number": 1,
    "text": "الخاتمة أهم النتائج المستخلصة من هذه الرسالة ما يلي: 1 - أهمية دليل الإجماع، ومزيته على غيره من الأدلة. 2 - عدم المبالغة في التعاريف والحدود، وأن المبالغة فيها طريقة المتكلمين. 3 - الأدلة على حجية الإجماع، والأدلة التي استدل بها بعض الأصوليين على حجية الإجماع ولا دلالة فيها. 4 - موقف أهل البدع من دليل الإجماع. 5 - لازم القول أن الإجماع السكوتي ليس حجة. 6 - الإمام أحمد لا ينكر الإجماع، وقوله:\" من ادعى الإجماع \" يريد به .. 7 - الإجماع نوعان قطعي وظني، وضابطهما. 8 - الكلام على معنى الإجماع السكوتي وحكم الاحتجاج به. 9 - توجيه قول الشافعي: لا ينسب إلى ساكت قول. 10 - يشترط في الإجماع أن يستند على نص، ولا يشترط معرفة هذا النص. 11 - الإجماع حجة سواء سبق بخلاف أو لحقه خلاف، والجواب على رواية أحمد أنه لا يرى الإجماع بعد الخلاف. 12 - أمثلة على الإجماع بعد خلاف. 13 - ضابط القول الشاذ، والاستعمالات الخطأ له. 14 - إجماع أهل كل فن حجة. 15 - لا يعتد بإجماع أهل الكلام بالإجماع. 16 - لا يشترط انقراض العصر، ومعنى اشتراط انقراض العصر.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 83
  },
  {
    "serial_number": "3425199",
    "category_id": "11",
    "category": "أصول الفقه",
    "book_title": "الإقناع في حجية الإجماع",
    "edition": "الأولى، 1440 هـ",
    "publisher": "مركز سطور للبحث العلمي، دار الإمام مسلم للنشر والتوزيع- المدينة المنورة",
    "page_number": 85,
    "volume_number": 1,
    "text": "17 - لا يجوز إحداث قول جديد. 18 - مذهب الظاهرية مذهب مبتدع. 19 - حرمة التلفيق ومعناه وأمثلته. 20 - الأصل صحة الإجماع المحكي من ذي استقراء، وطريقة معرفة الإجماع. 21 - الذين حكوا الإجماع وأرادوا الأكثر. 22 - دليل الإجماع كاشف. 23 - كشف شبهة خرق الإجماع بزعم أن الرسول صلى الله عليه وسلم سلفه 24 - كشف شبهة لا يحتج بالإجماع لأن هناك إجماعًا مخرومًا 25 - ليس الإجماع على درجة واحدة بل درجات متفاوتة. 26 - تطاول الزمن على حكاية الإجماع السكوتي يجعله حجة بالإجماع. 27 - كشف شبهة نفي الخلاف ليس إجماعًا. 28 - معنى أن السنة حجة في ذاتها. 29 - ليس الإجماع الذي احتج به أحمد وابن تيمية خاصًا بإجماع الصحابة. 30 - ليس الإجماع خاصًا بالضرورة. 31 - أنواع الإجماعات ثلاثة. 32 - يصح الاستدلال بالإجماع في مخالفة الدليل. 33 - كشف شبهة لا يترك حديث لعدم العلم بمن يعمل به. 34 - أن بعض العلماء قالوا أقوالًا وليس لهم سلف. 35 - الإجماع في علوم الآلة. 36 - كشف شبهة لا يعمل بالإجماع إذا خالف دليلًا. 37 - إجماع العلماء على نسخ حديث حجة.",
    "foot_note": "None",
    "book_id": "267",
    "new_page_number": 84
  }
]