[
  {
    "text": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration)\nAuthor: عبد الهادي بن عوض العمري\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 1
  },
  {
    "text": "sn: 746\nbook_title: مختصر المختصر في بيان عقيدة أهل السنة والأثر\nbook_link: https://shamela.ws/book/599\nbook_id: 599\nauthor_name: عبد الهادي بن عوض العمري\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/2532\nauthor_ID: 2532\neditor: Null\npublisher: Null\nedition: الأولى، 1441 هـ - 2019 م\npages: 67\nvolumes: Null\npagination: [كتاب إلكتروني]\ncategory: العقيدة\ncategory_id: 1",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration)",
    "category_id": "1",
    "category": "Creed",
    "new_page_number": 2
  },
  {
    "serial_number": "112040",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration)",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Aqeedah (Creed). Book: Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration). Author: Dr. Abdul Hadi bin Awad Al-Amri. Edition: First, 1441 AH - 2019 AD. Number of pages: 67 [E-book]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442 AH. \nBook: Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar. Author: Dr. Abdul Hadi bin Awad Al-Amri. Edition: First, 1441 AH - 2019 AD. Number of pages: 67 [E-book]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442 AH. \nAuthor: Dr. Abdul Hadi bin Awad Al-Amri. Edition: First, 1441 AH - 2019 AD. Number of pages: 67 [E-book]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442 AH. \nNumber of pages: 67 [E-book]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442 AH. \n[E-book]. Publication date on Shamela: 28 Dhu al-Qa'dah 1442 AH. \nPublication date on Shamela: 28 Dhu al-Qa'dah 1442 AH.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 3
  },
  {
    "serial_number": "112041",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration). Authored by Dr. Abdul Hadi bin Awad Al-Amri, Member of the Saudi Scientific Association for Creed, Religions, Sects, and Schools of Thought at the Islamic University of Madinah. First Edition 1441 AH - 2019 AD.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 4
  },
  {
    "serial_number": "112042",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 5
  },
  {
    "serial_number": "112043",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful. Introduction: \"Praise be to Allah who has placed in every time a group of people of knowledge who call those who have gone astray to guidance, and endure harm from them. They revive the dead with the Book of Allah, and give sight to the blind with the Light of Allah. How many a victim of Iblis have they revived! And how many a lost wanderer have they guided! How excellent is their effect on people, and how ugly is the effect of people on them! They remove from the Book of Allah the distortions of the extremists, the fabrications of the falsifiers, and the interpretations of the ignorant, those who have tied the banners of innovation and unleashed the reins of tribulation. They differ concerning the Book, oppose the Book, and agree on separating from the Book. They speak against Allah, about Allah, and about the Book of Allah without knowledge. They speak with ambiguous speech, and deceive the ignorant people with what they confuse them with. We seek refuge in Allah from the tribulations of those who lead astray.\" (1) And peace and blessings be upon the Imam of the pious, the leader of the radiant ones, our Prophet Muhammad, and upon all his family and companions. To proceed: Our Prophet Muhammad (peace be upon him) persevered in establishing the Creed (Aqeedah) since he was informed with {Read} and sent with {The Muddaththir}. But after his transfer to the Highest Companion and after the passing of the era of the Rightly Guided Caliphate...",
    "foot_note": "1. Sermon of Imam Ahmad in his book: Al-Radd 'ala al-Zanadiqah wal-Jahmiyyah, p. 6.",
    "book_id": "599",
    "new_page_number": 6
  },
  {
    "serial_number": "112044",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "...sects opposing what he (peace be upon him) and his companions were upon appeared, to the extent that the guidance of their Prophet and righteous predecessors became confused for many people; due to the actions of misleading leaders and ignorant fools. Thus, it became incumbent upon everyone who wants salvation for himself and safety for his religion to know what clears that confusion from himself; so that the truth becomes clear to him and he acts upon guidance and light. From here began the idea of these brief papers to clarify the creed of Ahl al-Sunnah wal-Jama'ah (The People of Sunnah and the Community) and their straight methodology, and distinguishing it from what the opposers have confused and the falsifiers have adopted. After I wrote its topics and reviewed its material, the choice fell on naming those papers \"Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar\" (Summary of the Summary in Clarifying the Creed of the People of Sunnah and Narration). It came in an introduction, two chapters, and a conclusion, then a bibliography, and an index of topics. Introduction: A preface before the research. Chapter One: Defining Ahl al-Sunnah wal-Jama'ah. It contains five sections: Section One: Definition of Ahl al-Sunnah linguistically and terminologically. Section Two: Definition of Al-Sunnah linguistically and terminologically. Section Three: Definition of Al-Jama'ah linguistically and terminologically. Section Four: Emergence of the term Ahl al-Sunnah wal-Jama'ah. Section Five: Evidences for naming them Ahl al-Sunnah wal-Jama'ah.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 7
  },
  {
    "serial_number": "112045",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "Chapter Two: Traits of Ahl al-Sunnah wal-Jama'ah. It contains three sections: Section One: The names by which Ahl al-Sunnah are known to distinguish them from others. Section Two: Characteristics of Ahl al-Sunnah wal-Jama'ah. Section Three: Sources of reception for Ahl al-Sunnah wal-Jama'ah. Conclusion: It contains a summary of the most important results of the research. I ask Allah Almighty to benefit the writer and reader with this research, and to make it purely for His Noble Face.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 8
  },
  {
    "serial_number": "112046",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "Chapter One: Defining Ahl al-Sunnah wal-Jama'ah. It contains five sections: Section One: Definition of Ahl al-Sunnah linguistically and terminologically. Section Two: Definition of Al-Sunnah linguistically and terminologically. Section Three: Definition of Al-Jama'ah linguistically and terminologically. Section Four: Emergence of the term Ahl al-Sunnah wal-Jama'ah. Section Five: Evidences for naming them Ahl al-Sunnah wal-Jama'ah.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 9
  },
  {
    "serial_number": "112047",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "Section One: Definition of Ahl al-Sunnah. The \"Ahl\" (People/Family) of a thing are the people most specific to it. It is used in abstract and tangible contexts. Linguistically, it is said: Ahl al-Rajul (The man's family): the people most specific to him; Ahl al-Bayt (People of the House): its inhabitants; Ahl al-Amr (People of the Matter): its rulers; and Ahl al-Madhhab (People of the Doctrine): those who practice it (1). If the term \"Ahl al-Sunnah\" is used, it refers to one of two meanings: First Meaning: A general meaning, which includes everyone except the Rawafid (Shia) (2), from the sects ascribed to Islam. So it is said that those ascribed to Islam are two divisions: Ahl al-Sunnah and Shia. As Sheikh al-Islam (Ibn Taymiyyah), may Allah have mercy on him, clarified: \"It is the meaning famous among the general public, for they do not know an opposite to the Sunni except the Rafidi. So if one of them says: 'I am Sunni,' its meaning according to them is only: 'I am not Rafidi.'\" (3).",
    "foot_note": "1. Maqayis al-Lughah, by Ibn Faris 1/150, and Lisan al-Arab, by Ibn Manzur 11/29, entry (Ahl). \n2. See: Maqalat al-Islamiyyin 1/89, Minhaj al-Sunnah al-Nabawiyyah 2/96, and Usul Madhhab al-Shia al-Imamiyyah 1/108. \n3. Mujmal al-I'tiqad, by Ibn Taymiyyah within Majmu' al-Fatawa 3/356, and Minhaj al-Sunnah al-Nabawiyyah 1/121.",
    "book_id": "599",
    "new_page_number": 10
  },
  {
    "serial_number": "112048",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "This meaning has been narrated from some of the predecessors (Salaf). Sufyan al-Thawri, may Allah have mercy on him, was asked: 'O Abu Abdullah, what is conformity with the Sunnah?' He said: \"The Quran is the Speech of Allah, uncreated; from Him it began and to Him it returns. Whoever says other than this is a disbeliever. Faith is speech, action, and intention; it increases and decreases; increases with obedience and decreases with disobedience. Speech is not valid except with action, speech and action are not valid except with intention, and speech, action, and intention are not valid except with conformity to the Sunnah.\" Shu'ayb said: So I said to him: 'O Abu Abdullah, and what is conformity with the Sunnah?' He said: \"Giving precedence to the two Sheikhs, Abu Bakr and Umar, may Allah be pleased with them both.\" (1). Second Meaning: A specific meaning, which is what opposes the innovators and people of desires. It is the most used meaning, and upon it are the books of Jarh and Ta'dil (Criticism and Praise) (2). Abu Hatim al-Razi, may Allah have mercy on him, said regarding what Imam Malik, may Allah have mercy on him, was described with, that he combined the Sunnah and Hadith. He answered, may Allah have mercy on him: \"I heard Ahmad bin Sinan al-Wasiti say: I heard Abd al-Rahman bin Mahdi say: Sufyan al-Thawri is an Imam in Hadith, but not an Imam in Sunnah. Al-Awza'i is an Imam in Sunnah, but not an Imam in Hadith. And Malik is an Imam in both of them.\" (3).",
    "foot_note": "1. Narrated by Al-Lalaka'i in Sharh Usul al-I'tiqad 1/152. \n2. Majmu' al-Fatawa 2/7-8. \n3. See: Majma' al-Ahbab wa Tadhkirat Uli al-Albab, Muhammad bin al-Hasan bin Abdullah al-Husayni al-Wasiti 3/330.",
    "book_id": "599",
    "new_page_number": 11
  },
  {
    "serial_number": "112049",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "Section Two: Definition of Al-Sunnah linguistically and terminologically. Al-Sunnah in the language: Derived from 'Sanna al-shay' (He initiated/paved the way for something): if he sent it. Ibn Faris said: \"The (letter) Sin and Nun are a single consistent root, which is the flow of a thing and its consistency with ease. The origin is their saying: 'Sanantu al-ma'a 'ala wajhi asunnuhu sannan' (I poured water on my face pouring it): if I sent it forth (poured it).\" (1). It is the path (Tariqah) and biography (Sirah) (2). Al-Azhari said: Al-Sunnah: The praiseworthy straight path. Therefore, it is said: So-and-so is from Ahl al-Sunnah, meaning: from the people of the praiseworthy straight path (3). As for the terminology of the Hadith scholars (Muhaddithin), it is: What has been transmitted from the Prophet (peace be upon him) of speech, action, approval, physical characteristic, moral characteristic, or biography, whether it was before the mission or after it (4). In the terminology of the Usulis (Scholars of Principles of Jurisprudence), Al-Sunnah is applied \"to what has come transmitted from the Prophet...",
    "foot_note": "1. Maqayis al-Lughah, Ibn Faris 3/60. \n2. See: Al-Nihayah, Ibn al-Athir 2/409. \n3. See: Tahdhib al-Lughah, Al-Azhari, 12/72. \n4. See: Tawjih al-Nazar ila Usul al-Athar, Tahir al-Dimashqi, p. 3, and Al-Yawaqit wal-Durar fi Sharh Nukhbat Ahl al-Fikr, Ibn Hajar 2/193.",
    "book_id": "599",
    "new_page_number": 12
  },
  {
    "serial_number": "112050",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "...- peace be upon him specifically, from what was not stated in the Noble Book (Quran), but rather was stated from his side, peace be upon him, whether it was an explanation of what is in the Book or not. It is also applied to what came from the Prophet, peace be upon him, of speech, action, or approval.\" (1). Al-Sunnah is used in opposition to Bid'ah (Innovation). Al-Shatibi, may Allah have mercy on him, said: \"It - i.e., the title of Sunnah - is used in opposition to Bid'ah. It is said: So-and-so is upon Sunnah if he acts in accordance with what the Prophet, peace be upon him, was upon, whether that is stated in the Book or not. And it is said: So-and-so is upon Bid'ah: if he acts contrary to that.\" (2). Ibn Rajab, may Allah have mercy on him, said: \"Al-Sunnah: It is the traveled path. This includes adhering to what the Prophet, peace be upon him, and his Rightly Guided Caliphs were upon in beliefs, actions, and sayings. This is the complete Sunnah. For this reason, the predecessors of old did not use Sunnah except for what encompasses all of that. That was narrated from Al-Hasan, Al-Awza'i, and Al-Fudayl bin Iyad.\" (3).",
    "foot_note": "1. Al-Muwafaqat, by Al-Shatibi 4/3. \n2. Ibid 4/4. \n3. Jami' al-Ulum wal-Hikam, p. 262.",
    "book_id": "599",
    "new_page_number": 13
  },
  {
    "serial_number": "112051",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "Section Three: Definition of Al-Jama'ah linguistically and terminologically. Al-Jama'ah (The Group/Community) in the language, from (Jama'a - to gather). It says in Al-Sahah: \"Al-Jam': A source (masdar) emphasized by 'jama'tu al-shay' (I gathered the thing). It may be a name for a group of people. The plural is Jumu'...\" (1). In Lisan al-Arab: \"Al-Jam': A name for a group of people. And Al-Jam' is a source emphasized by 'jama'tu al-shay'. And Al-Jam': The gathered ones, its plural: Jumu'. And Al-Jama'ah and Al-Jami' and Al-Majma' are like Al-Jam'.\" (2). Terminologically: It is adhering to the truth even if you were alone (3). Imam Al-Barbahari, may Allah have mercy on him, said in his definition of Al-Jama'ah:",
    "foot_note": "1. Al-Sahah, by Al-Jawhari 3/1198. \n2. Lisan al-Arab, by Ibn Manzur 2/200. \n3. Zaid bin Amr bin Nufayl died before the Messenger of Allah, peace be upon him, was sent. The Messenger of Allah, peace be upon him, said: 'He will be resurrected on the Day of Resurrection as a nation (Ummah) alone.' Narrated by Ahmad in his Musnad 1/189, no. 1642, Al-Nasa'i in Al-Kubra, no. 8131, Abu Ya'la in his Musnad 4/42, no. 2047, Al-Hakim in his Mustadrak 3/239, no. 4956, and Al-Tabarani in his Mu'jam 1/151, no. 350. Al-Haythami said: It contains Mujalid, and this is among what is praised of Mujalid's hadith, and the rest of its narrators are narrators of the Sahih, and its chain is Hasan. See: Majma' al-Zawa'id 9/416-417.",
    "book_id": "599",
    "new_page_number": 14
  },
  {
    "serial_number": "112052",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "\"And Al-Jama'ah is what the companions of the Messenger of Allah, peace be upon him, agreed upon during the caliphate of Abu Bakr, Umar, and Uthman, may Allah be pleased with them.\" (1). He also said: \"The foundation upon which we built the Jama'ah are the companions of Muhammad, peace be upon him, may Allah have mercy on them all; they are Ahl al-Sunnah wal-Jama'ah.\" (2). The scholar Abd al-Rahman bin Isma'il, known as Abu Shamah, said: \"Where the command to stick to the Jama'ah comes, what is meant by it is adhering to the truth and its followers, even if those holding onto the truth are few and the opposers are many; because the truth is what the first Jama'ah from the Prophet, peace be upon him, and his companions, may Allah be pleased with them, was upon. No consideration is given to the large number of people of falsehood after them.\" (3). Qadi Ibn Abi al-Izz al-Hanafi said: \"And Al-Jama'ah is the community of Muslims, and they are the Companions, may Allah be pleased with them, and those who follow them in goodness until the Day of Judgment.\" (4). We notice that there is a strong relationship between the term Sunnah and the term Jama'ah. Ibn Abbas, may Allah be pleased with them both, said regarding the saying of Allah Almighty: \"{On the Day when some faces will turn white and some faces will turn black}\"...",
    "foot_note": "1. Sharh al-Sunnah, Imam Al-Barbahari, p. 105. \n2. Ibid, p. 21. \n3. Al-Ba'ith 'ala Inkar al-Bida' wal-Hawadith, p. 34. \n4. Sharh al-Aqidah al-Tahawiyyah 1/326.",
    "book_id": "599",
    "new_page_number": 15
  },
  {
    "serial_number": "112053",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "...(1) \"As for those whose faces will turn white, they are Ahl al-Sunnah wal-Jama'ah.\" (2). Sheikh al-Islam Ibn Taymiyyah, may Allah have mercy on him, said: \"Bid'ah (Innovation) is associated with Firqah (Division), just as Sunnah is associated with Jama'ah (Unity/Group). So it is said: Ahl al-Sunnah wal-Jama'ah; just as it is said: Ahl al-Bid'ah wal-Firqah.\" (3).",
    "foot_note": "1. Surah Al-Imran, Verse 106. \n2. Sharh Usul I'tiqad Ahl al-Sunnah 1/72. \n3. Al-Istiqamah, Ibn Taymiyyah 1/42.",
    "book_id": "599",
    "new_page_number": 16
  },
  {
    "serial_number": "112054",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "Section Four: Emergence of the term Ahl al-Sunnah wal-Jama'ah. The history of using this term goes back to early Islam, the era of Prophethood and the virtuous generations. Ibn Abbas, may Allah be pleased with them both, said regarding His saying Almighty: {On the Day when some faces will turn white and some faces will turn black} (1): \"As for those whose faces will turn white, they are Ahl al-Sunnah wal-Jama'ah and the people of knowledge. And as for those whose faces will turn black, they are the people of Bid'ah and misguidance.\" (2). Sheikh Dr. Muhammad al-Khumayyis - may Allah preserve him - said: \"The term Ahl al-Sunnah wal-Jama'ah is an old term. It means: Those adhering to the Sunnah of the Prophet, peace be upon him, and his Companions, may Allah be pleased with them, and their followers; those adhering to what the community of Muslims was upon in the first era. This term was derived from the Hadiths that encourage following the Sunnah and adhering to it, and the command to stick to the Jama'ah and abandon division and difference. Of that is his saying, peace be upon him: 'The Jews and Christians split into seventy-one or seventy-two sects, all of them in the Fire. And my Ummah will split into seventy-three sects, all of them in the Fire, except one, and it is the Jama'ah.' (3). This is the origin of the naming. This term was used...",
    "foot_note": "1. Surah Al-Imran, Verse 106. \n2. Sharh Usul I'tiqad Ahl al-Sunnah 1/72. \n3. Narrated by Ahmad in Al-Musnad 4/102, Al-Tabarani 19/377, Al-Hakim 1/218, Abu Dawood 4/198, Ibn Abi Asim in Al-Sunnah 1/7, and authenticated by Al-Albani in Al-Silsilah Al-Sahihah 1/404.",
    "book_id": "599",
    "new_page_number": 17
  },
  {
    "serial_number": "112055",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "...among the Salaf when they recorded what they transmitted of the beliefs of Ahl al-Sunnah, like Imam Ahmad, his son Abdullah, Ibn Abi Asim, Al-Khallal, and others. Ahl al-Sunnah were named so because they are the ones adopting the Sunnah of the Messenger of Allah, peace be upon him, acting by it and its requirements, following the saying of the Messenger of Allah, peace be upon him: 'Stick to my Sunnah' (1). As for their naming (as Jama'ah); it is because they united upon the truth and adopted it.\" (2). This title was applied to many of the Imams of the Salaf, and I will mention some of them by way of example, not limitation. Ayyub al-Sakhtiyani said: \"Indeed, I am informed of the death of a man from Ahl al-Sunnah, and it is as if I lose some of my limbs.\" He also said: \"Indeed, it is from the happiness of the youth and the non-Arab that Allah guides them to a scholar from Ahl al-Sunnah.\" (3). Ibn Jarir al-Tabari, may Allah have mercy on him, said: \"As for the correct saying regarding the believers seeing...",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad 4/126, Abu Dawood 5/13, Al-Tirmidhi and said: This is a Hasan Sahih Hadith, and Al-Tirmidhi with Tuhfat al-Ahwadhi 7/438. Al-Albani said: Its chain is Sahih, and quoted its authentication from Al-Diya' al-Maqdisi, Mishkat al-Masabih 1/58, no. 165. \n2. Al-Tawdihat al-Jaliyyah 'ala Sharh al-Tahawiyyah 1/33. \n3. Al-Tawdihat al-Jaliyyah 1/60-61.",
    "book_id": "599",
    "new_page_number": 18
  },
  {
    "serial_number": "112056",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "...their Lord, Mighty and Majestic, on the Day of Resurrection, which is our religion by which we worship Allah, and upon which we found Ahl al-Sunnah wal-Jama'ah, it is that the people of Paradise will see Him according to what the reports from the Messenger, peace be upon him, have authenticated.\" (1). Abu Ja'far Ahmad bin Muhammad al-Tahawi also mentioned this by saying: \"This is a mention of the clarification of the creed of Ahl al-Sunnah wal-Jama'ah.\" (2).",
    "foot_note": "1. Sarih al-Sunnah, Ibn Jarir, p. 20. \n2. Aqidat Ahl al-Sunnah wal-Jama'ah, p. 5.",
    "book_id": "599",
    "new_page_number": 19
  },
  {
    "serial_number": "112057",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Section Five: Evidences for naming them Ahl al-Sunnah wal-Jama'ah. As for naming Ahl al-Sunnah wal-Jama'ah by this name, it is established by textual evidences. First: From the Quran. The Almighty said: {And hold firmly to the rope of Allah all together and do not become divided} (1). Sheikh Al-Sa'di, may Allah have mercy on him, said: This verse urges holding onto the rope of Allah which He delivered to them, and made a means between Him and them, which is His religion and His Book, and uniting upon that and not dividing, and that they persist in that until death (2). And His Almighty saying: {Indeed, those who have divided their religion and became sects - you are not [associated] with them in anything. Their affair is only [left] to Allah; then He will inform them about what they used to do} (3). Sheikh Al-Sa'di, may Allah have mercy on him, said: \"The noble verse indicated that the religion commands unity and coalition and forbids division and difference regarding the people of religion and all its fundamental and subsidiary issues.\" (4).",
    "foot_note": "1. Surah Al-Imran, Verse 103. \n2. See: Taysir al-Karim al-Rahman 1/231. \n3. Surah Al-An'am, Verse 159. \n4. Taysir al-Karim al-Rahman 1/528.",
    "book_id": "599",
    "new_page_number": 20
  },
  {
    "serial_number": "112058",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "And the Almighty said: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination} (1). The indication of the verse is that Allah Almighty combined opposing the Messenger, peace be upon him, and contradicting the way of the believers in the threat. If following other than the way of the believers were permissible, He would not have combined it with the prohibited. Following other than their way occurs by contradicting their sayings or actions (2). And the Almighty said: {And follow the way of those who turn back to Me [in repentance]} (3). Sheikh Al-Sa'di, may Allah have mercy on him, said in explaining the inference from the verse: \"They are the believers in Allah, His angels, and His messengers, those submitting to their Lord, turning back to Him. Following their way is to tread their path in turning back to Allah, Mighty and Majestic.\" (4). Second: From the Sunnah. From Mu'awiyah bin Abi Sufyan, may Allah be pleased with him, that he said: The Messenger of Allah, peace be upon him, said: \"Indeed the People of the Book split in their religion into seventy-two sects. And indeed this Ummah will split into seventy-three sects - meaning desires - all of them in the Fire except one, and it is: The Jama'ah.",
    "foot_note": "1. Surah Al-Nisa, Verse 115. \n2. Anwar al-Tanzil, by Al-Baydawi 1/243-244. \n3. Surah Luqman, Verse 15. \n4. Tafsir al-Karim al-Rahman 3/1351.",
    "book_id": "599",
    "new_page_number": 21
  },
  {
    "serial_number": "112059",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "And indeed there will emerge in my Ummah people with whom those desires will flow just as rabies (Al-Kalab) (1) flows with its companion; no vein or joint remains of him except it enters it.\" (2). In this is a comparison by the Prophet, peace be upon him, of the state of the deviators from the people of innovation in the domination of those desires over them, and their going into every destructive valley, and in the spread of that misguidance from them to others calling them to it, then their aversion to knowledge, and refusal to accept it until they perish in ignorance - to the state of the one with rabies, and the spread of that disease in his veins and joints, and the occurrence of resemblance to madness from him, then its transmission to others by him biting them, and his aversion to water and refusal of it until he dies of thirst (3). And he, peace be upon him, said to Hudhayfah bin al-Yaman, may Allah be pleased with him: \"Stick to the Jama'ah of Muslims and their Imam.\" (4).",
    "foot_note": "1. A disease that afflicts a human from the bite of a rabid dog, causing him to resemble madness. He does not bite anyone except they become rabid, and bad symptoms appear in him, and he refuses drinking water until he dies of thirst. See: Al-Nihayah Ibn al-Athir, 4/195. \n2. Narrated by Ahmad 4/102, and Abu Dawood 5/5-6. The hadith is authentic with its supporting evidences; Al-Hakim authenticated it in Al-Mustadrak and Al-Dhahabi agreed. See: Al-Mustadrak with Al-Talkhis 1/128. Al-Albani said in Zilal al-Jannah fi Takhrij al-Sunnah: \"A Sahih Hadith with what is before it and after it.\" See: Al-Sunnah, by Ibn Abi Asim with Zilal al-Jannah. \n3. See: Sharh al-Tibi 'ala Mishkat al-Masabih, Chapter of Holding Fast to the Book and the Sunnah 2/641. \n4. Narrated by Al-Bukhari, Book of Virtues, Chapter of Signs of Prophethood in Islam 2/529-530.",
    "book_id": "599",
    "new_page_number": 22
  },
  {
    "serial_number": "112060",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "His saying: \"Stick to the Jama'ah of Muslims,\" from it the term: Ahl al-Sunnah wal-Jama'ah was taken, and that is because the truth is mostly within the Jama'ah of Muslims (1). In the Two Sahihs from Anas, may Allah be pleased with him, in the story of the three who came to the houses of the Prophet, peace be upon him. One of them said: I will pray the night forever. The other said: I will fast the epoch and not break fast. The other said: I will isolate myself from women and not marry. The Messenger of Allah, peace be upon him, said to them: \"As for me, by Allah, I am the most fearful of Allah among you and the most pious to Him, but I fast and break fast, I pray and sleep, and I marry women. So whoever turns away from my Sunnah is not of me.\" (2). This is evidence that what is prescribed is moderation in acts of obedience; because exhausting oneself in them and being severe upon oneself leads to abandoning everything. Religion is ease, and no one overburdens the religion except it overcomes him. The pure Sharia is built on ease and lack of repulsion. His saying: \"So whoever turns away from my Sunnah is not of me,\" Sunnah meant here is: The path (Tariqah). And Raghabah (turning away) is: Aversion. He, peace be upon him, meant that the one leaving his straight guidance, inclining towards monasticism, has exited from following (Ittiba') to innovating (Ibtida') (3).",
    "foot_note": "1. See: Fath al-Bari on Sahih al-Bukhari, Chapter of Signs of Prophethood in Islam 4/455. \n2. Narrated by Al-Bukhari, Book of Marriage, Chapter of Encouragement to Marry, 3/354. \n3. See: Nayl al-Awtar 6/123.",
    "book_id": "599",
    "new_page_number": 23
  },
  {
    "serial_number": "112061",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "There are principles; whoever adheres to them is from Ahl al-Sunnah wal-Jama'ah. It was said to Sahl ibn Abdullah al-Tustari: When does a man know that he is upon the Sunnah and the Jama'ah? He said: If he knows from himself ten qualities: He does not leave the Jama'ah, does not curse the Companions of the Prophet (peace be upon him), does not revolt against this Ummah with the sword, does not belie the Decree (Qadar), does not doubt in faith, does not argue in religion, does not leave praying over whoever repents from the people of the Qiblah for a sin, does not leave wiping over the leather socks (Khuffayn), and does not leave the Friday prayer behind every ruler, unjust or just (1). Imam Ahmad, may Allah have mercy on him, said: \"The foundations of the Sunnah with us are: Holding fast to what the Companions of the Messenger of Allah (peace be upon him) were upon...\" (2), then he mentioned a set of beliefs of the Salaf. Ibn Hazm, may Allah have mercy on him, says: \"Ahl al-Sunnah whom we mention are the people of truth, and whoever is other than them are the people of innovation. They are the Companions, may Allah be pleased with them, and whoever followed their path from the best of the Tabi'in, then the people of Hadith and those who followed them from the jurists generation after generation until this day of ours, and whoever followed them from the common people in the east of the earth and its west, may Allah have mercy on them.\" (3). Al-Asbahani said after his speech about the people of desires: \"As for the people of truth, they made...",
    "foot_note": "1. Sharh Usul I'tiqad Ahl al-Sunnah wal-Jama'ah 1/138. \n2. Ibid 1/155-156. \n3. Al-Fisal fi al-Milal wal-Nihal 2/271.",
    "book_id": "599",
    "new_page_number": 24
  },
  {
    "serial_number": "112062",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "...the Book and the Sunnah their Imam, and sought religion from them. Whatever occurred to them from their rationality and thoughts, they presented it to the Book and the Sunnah. If they found it agreeing with them, they accepted it, and thanked Allah where He showed them that and guided them to it. And if they found it contradicting them, they left what occurred to them, and turned to the Book and the Sunnah, and returned the accusation to themselves.\" (1). Al-Sijzi, may Allah have mercy on him, said: \"So Ahl al-Sunnah: They are those steadfast on believing what the righteous predecessors, may Allah have mercy on them, transmitted to them from the Messenger, peace be upon him; because they, may Allah be pleased with them, are Imams, and we have been commanded to follow their traces and follow their sunnah. This is clearer than needing to establish proof for it. Taking the Sunnah and believing it is something regarding which there is no doubt in its obligation.\" (2). Imam Al-Barbahari, may Allah have mercy on him, has a statement describing Ahl al-Sunnah, saying: \"Know that Islam is the Sunnah, and the Sunnah is Islam, and one of them does not stand except by the other. So from the Sunnah is sticking to the Jama'ah. Whoever desires other than the Jama'ah and separates from it has removed the noose (3) of Islam from his neck and was misguided, misleading.\" (4).",
    "foot_note": "1. Al-Hujjah fi Bayan al-Mahajjah wa Aqidat Ahl al-Sunnah, Al-Asbahani 2/238. \n2. Risalat al-Imam al-Sijzi fi al-Radd 'ala man Ankara al-Harf wal-Sawt, p. 99. \n3. Al-Ribq (Noose) with Kasra: A rope with several loops with which small livestock are tied from their necks or hand so they do not suckle. See: Taj al-Arus 25/329. \n4. Sharh al-Sunnah, p. 21.",
    "book_id": "599",
    "new_page_number": 25
  },
  {
    "serial_number": "112063",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "In his specification of the criterion for the person of Sunnah, he said: \"The root of seventy-two desires: four desires. From these four desires, the seventy-two desires branched out: The Qadariyyah, the Murji'ah, the Shia, and the Khawarij. So whoever gives precedence to Abu Bakr, Umar, Uthman, and Ali over the Companions of the Messenger of Allah (peace be upon him) and does not speak of the rest except with good and prays for them, has exited from Shiism, its beginning and its end. And whoever says: Faith is speech and action, increases and decreases, has exited from Irja', its beginning and its end. And whoever says: Prayer behind every righteous and wicked person, and Jihad with every Caliph, and does not see revolting against the Sultan with the sword, and prays for their rectification, has exited from the saying of the Khawarij, its beginning and its end. And whoever says: Decrees are all from Allah, Glory be to Him, their good and their bad, He misguides whom He wills and guides whom He wills, has exited from the saying of the Qadariyyah, its beginning and its end, and he is a person of Sunnah.\" (1). Sheikh al-Islam, may Allah have mercy on him, described them as being intermediate in all chapters of the Sunnah; \"because they adhere to the Book of Allah and the Sunnah of the Messenger of Allah, peace be upon him, and what the first forerunners from the Muhajireen and Ansar and those who followed them in goodness until the Day of Judgment agreed upon.\" (2). He also said: \"So whoever speaks by the Book, the Sunnah, and the Consensus is from Ahl al-Sunnah wal-Jama'ah.\" (3).",
    "foot_note": "1. Sharh al-Sunnah, p. 57. \n2. Majmu' al-Fatawa 3/375. \n3. Ibid 3/346.",
    "book_id": "599",
    "new_page_number": 26
  },
  {
    "serial_number": "112064",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "So whoever is safe from innovations and adheres to the guidance of the Prophet, peace be upon him, is from Ahl al-Sunnah wal-Jama'ah. Sheikh Abd al-Rahman al-Sa'di, may Allah have mercy on him, said: \"So the pure Ahl al-Sunnah are those safe from innovations, who adhered to what the Prophet, peace be upon him, and his companions were upon in all fundamentals: the fundamentals of Tawhid, Message, Decree, issues of Faith, and others. Others like Khawarij, Mu'tazila, Jahmiyyah, Qadariyyah, Rafidah, Murji'ah, and those branching from them are all from the people of creedal innovations.\" (1). Sheikh Bakr Abu Zaid, may Allah have mercy on him, described them saying: \"Ahl al-Sunnah wal-Jama'ah who proceeded on the methodology of Prophethood, and did not separate from it even for a moment, neither in name nor in form. They have no person they belong to except the methodology of Prophethood (The Book and the Sunnah), since the origin does not need a special mark to distinguish it. Rather, what needs a specific name is what exits from this origin, from those groups that split from the origin.\" (2).",
    "foot_note": "1. Al-Fatawa al-Sa'diyyah, by Sheikh Abd al-Rahman al-Nasir al-Sa'di, pp. 63-64. \n2. Hukm al-Intima' ila al-Firaq wal-Ahzab wal-Jama'at al-Islamiyyah, p. 28.",
    "book_id": "599",
    "new_page_number": 27
  },
  {
    "serial_number": "112065",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "Chapter Two: Traits of Ahl al-Sunnah wal-Jama'ah. It contains three sections: Section One: The names by which Ahl al-Sunnah were known to distinguish them from others. Section Two: Characteristics of Ahl al-Sunnah wal-Jama'ah. Section Three: Sources of reception for Ahl al-Sunnah wal-Jama'ah.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 28
  },
  {
    "serial_number": "112066",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "Section One: The names by which Ahl al-Sunnah were known to distinguish them from others. The Companions, may Allah be pleased with them, used to name themselves with what Allah Glory be to Him named them, complying with the saying of Allah Almighty: {And I have been commanded to be the first of the Muslims} (1). Rather, the Salaf used to warn against naming oneself with other than Islam and Sunnah. Maymun bin Mihran said: \"Beware of every name named with other than Islam.\" (2). But when innovations appeared and sects of misguidance multiplied, and every owner of an innovation began calling to his innovation while ascribing themselves outwardly to Islam, it became necessary for the people of truth adhering to the guidance of the Prophet, peace be upon him, to be known by names distinguishing them from the people of desires and innovations. Whoever contemplates the names of Ahl al-Sunnah finds them indicative of Islam, and they do not ascribe themselves to personalities like the people of innovations, such as the Jahmiyyah ascribed to Al-Jahm, and the Zaydiyyah ascribed to Zaid bin Ali bin Al-Husayn, ... and others. The names of Ahl al-Sunnah are derived from Islam, and I will mention some of their names. 1 - Al-Firqah Al-Najiyah (The Saved Sect). This title was taken from the saying of the Prophet, peace be upon him, when the Companions, may Allah be pleased with them, asked him saying: O Messenger of Allah, who is the Saved Sect? The Messenger of Allah, peace be upon him, said: \"Indeed my Ummah will split into seventy...",
    "foot_note": "1. Surah Al-Zumar, Verse 12. \n2. Al-Ibanah Al-Sughra, Ibn Battah, p. 137, and Al-Kubra 1/342, 354.",
    "book_id": "599",
    "new_page_number": 29
  },
  {
    "serial_number": "112067",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "...two sects, all of them in the Fire except one, and it is the Jama'ah.\" (1). Sheikh al-Islam says in his answer to a question about the Hadith of the splitting of the Ummah: \"Praise be to Allah. The Hadith is famous in the Sunan and Masanid such as Sunan Abu Dawood, Al-Tirmidhi, Al-Nasa'i, and others. In a narration they said: O Messenger of Allah, who is the Saved Sect? He said: 'Whoever is upon the like of what I and my companions are upon.' And in a narration he said: 'It is the Jama'ah; the Hand of Allah is over the Jama'ah.' (2). In any case, the naming, whether taken from the explicit text of the Hadith or its concept, is a legitimate naming. Al-Baghdadi dedicated a chapter in his book titled (Clarification of the descriptions of the Saved Sect, verifying salvation for it, and clarifying its virtues). (3). Sheikh Hafiz Hakami, may Allah have mercy on him, says: \"The Truthful and Believed One informed that the Saved Sect are those who are upon the like of what he and his companions were upon. This description is only fitting for its bearers and memorizers who submit to it and adhere to it; I mean by that the Imams of Hadith and the brilliant scholars of Sunnah.\" (4).",
    "foot_note": "1. Narrated by Ibn Majah 2/1322, no. 3993, Ibn Jarir in his Tafsir 4/32, and Abu Ya'la 7/32, no. 3938. \n2. Majmu' al-Fatawa 3/345. \n3. Al-Farq bayn al-Firaq, p. 313. \n4. Ma'arij al-Qabul 2/159.",
    "book_id": "599",
    "new_page_number": 30
  },
  {
    "serial_number": "112068",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "2 - Al-Ta'ifah Al-Mansurah (The Victorious Group). This is indicated by the saying of the Prophet, peace be upon him: \"A group of my Ummah will not cease to be victorious, unharmed by those who forsake them until the Hour is established.\" (1). And he, peace be upon him, said: \"A group of my Ummah will not cease to be manifest (dominant) until the command of Allah comes while they are manifest.\" (2). 3 - Ahl al-Hadith wal-Athar (The People of Hadith and Narration). They were named so for their occupation with the Hadith of the Messenger of Allah, peace be upon him, and the traditions (Athar) of his Companions, may Allah be pleased with them. Imam Ahmad said: The religion of the Prophet Muhammad is reports (Akhbar)... What an excellent mount for the youth are traditions (Athar). Do not desire away from the Hadith and its people... For opinion is night and Hadith is day. (3) Al-Saffarini, may Allah have mercy on him, said: Know, may you be guided, that the report has come... From the Followed Prophet, the best of humans.",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad 4/436, and Al-Tirmidhi and said: A Hasan Sahih Hadith. The Hadith was authenticated by Al-Albani in Al-Silsilah Al-Sahihah 4/619. \n2. Narrated by Al-Bukhari in his Sahih, Book of Holding Fast to the Book and Sunnah, Chapter of the saying of the Prophet (peace be upon him) (A group will not cease) Fath al-Bari 13/239, and Muslim in his Sahih, Book of Leadership 3/1523. \n3. Jami' Bayan al-Ilm wa Fadlihi wa Ma Yanbaghi fi Riwayatihi wa Hamlihi, Ibn Abd al-Barr 2/43.",
    "book_id": "599",
    "new_page_number": 31
  },
  {
    "serial_number": "112069",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidat Ahl al-Sunnah wal-Athar",
    "edition": "First, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "That this Ummah will split... Into seventy-something beliefs. And the rightful Is what was upon the methodology of the Chosen Prophet... And his companions without deviation or harshness. And this text is not decisively considered... Regarding a sect except for Ahl al-Athar (The People of Narration). (1) He also said: \"... Those who take their creed from the Book of Allah Almighty or the Sunnah of His Prophet, peace be upon him, or what is established and authentic from the righteous predecessors from the Companions, may Allah be pleased with them, and the Tabi'in.\" (2). In that, they combine narration of Hadith, believing in it, and acting upon it. Ibn Taymiyyah, may Allah have mercy on him, said: \"And we do not mean by Ahl al-Hadith: Those restricted to hearing it, writing it, or narrating it. Rather, we mean by them: Everyone who was most entitled to memorizing it, knowing it, understanding it: outwardly and inwardly, and following it: inwardly and outwardly. Likewise are the People of the Quran. The lowest characteristic in these is: love of the Quran and Hadith, searching for them and their meanings, and acting upon what they knew of their requirements...\" (3). He also said: \"So they are the most knowledgeable of people regarding his sayings, peace be upon him, and his states, and the greatest of them in distinguishing...",
    "foot_note": "1. Lawami' al-Anwar al-Bahiyyah 1/74, 76. \n2. Lawami' al-Anwar al-Bahiyyah 1/64. For further reading see: Al-Radd 'ala man Ankara al-Harf wal-Sawt, Al-Sijzi p. 175, 177-178, and Dar' Ta'arud al-Aql wal-Naql 6/266. \n3. Majmu' al-Fatawa 4/95.",
    "book_id": "599",
    "new_page_number": 32
  },
  {
    "serial_number": "112070",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "between their authentic and weak [narrations], and their Imams in jurisprudence regarding it, and the people of knowledge regarding its meanings, and following it in belief, action, love, and allegiance to those who align with it, and hatred and enmity towards those who oppose it\" (1).\n\n4 - The Jama'ah (The Group)\nThe Messenger of Allah (peace and blessings be upon him) said: \"Indeed, the People of the Book divided into seventy-two sects, and this Ummah will divide into seventy-three sects, all of them in the Fire except one, and that is: The Jama'ah. And there will emerge among my Ummah peoples whom those desires will infect just as rabies infects its victim; there remains no vein nor joint but it enters it...\" (2).\nIbn Abi al-Izz said: \"The Jama'ah is the group of Muslims, and they are the Companions (may Allah be pleased with them) and those who follow them in goodness until the Day of Judgment\" (3).",
    "foot_note": "1. Majmoo' al-Fatawa 3/347.\n2. Recorded by Ahmad 4/102, Abu Dawood 5/5-6, Hadith no. 4597, Al-Darimi 2/314, Al-Marwazi in Al-Sunnah 15, and Ibn Abi Asim in Al-Sunnah. Al-Hakim authenticated it in Al-Mustadrak 1/128. Al-Albani said in Zilal al-Jannah fi Takhrij al-Sunnah: \"A Sahih (authentic) hadith due to what precedes it and follows it.\" See: Al-Sunnah by Ibn Abi Asim with Zilal al-Jannah, p. 33.\n3. Sharh al-Aqidah al-Tahawiyyah 3/326.",
    "book_id": "599",
    "new_page_number": 33
  },
  {
    "serial_number": "112071",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "The Second Topic: Characteristics of Ahl al-Sunnah wal-Jama'ah\nAhl al-Sunnah have many characteristics that distinguish them from the people of desires and innovations, including:\n\nFirst: Ahl al-Sunnah do not declare each other innovators merely due to an error in Ijtihad (juridical reasoning).\nThis issue is among the great issues established by Ahl al-Sunnah wal-Jama'ah, in which they differed from the people of innovation like the Kharijites, the Mu'tazilah, and those who followed their path. The evidences for this are abundant from the two Revelations (Quran and Sunnah) and the speech of the scholars.\nFirst: From the Quran\nAllah the Almighty says: {Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.\"} (1).\nAnd Allah (Glorified and Exalted be He) commanded Taqwa (piety) according to one's ability. He said: {So fear Allah as much as you are able} (2).",
    "foot_note": "1. Surah Al-Baqarah, Verse 286.\n2. Surah At-Taghabun, Verse 16.",
    "book_id": "599",
    "new_page_number": 34
  },
  {
    "serial_number": "112072",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) edited this issue, saying: \"These texts indicate that He does not burden a soul with what it is incapable of, contrary to the Jahmiyyah (Compulsionists), and they indicate that He does not hold the mistaken and the forgetful accountable, contrary to the Qadariyyah and the Mu'tazilah. This is the decisive speech in this chapter. Thus, the Mujtahid who seeks evidence—whether an Imam, ruler, scholar, debater, mufti, etc.—if he strives and seeks evidence and fears Allah (Glorified and Exalted be He) as much as he is able, this is what Allah (Glorified and Exalted be He) has burdened him with. He is obedient to Allah (Glorified and Exalted be He), deserving of reward if he fears Him as much as he is able, and Allah will never punish him, contrary to the Jahmiyyah (Compulsionists)\" (1).\nSecond: From the Sunnah\nThe Hadith of Hudhayfah (may Allah be pleased with him) in what he narrated from the Prophet (peace and blessings be upon him) that he said: \"A man, when death approached him and he despaired of life, advised his family: 'When I die, gather a lot of firewood for me, then kindle a fire until it consumes my flesh and reaches my bones. Then take them and grind them, then scatter me in the sea on a hot—or windy—day (2).' So Allah (Glorified and Exalted be He) gathered him and said: 'Why did you do that?' He said: 'I feared You.' So He forgave him\" (3).",
    "foot_note": "1. Majmoo' al-Fatawa 19/216-217.\n2. Yawm Rah: Meaning windy. It is said a 'Rah' day and a 'Rahah' night: when the wind is strong in them. Al-Nihayah, Ibn al-Athir 2/237.\n3. Recorded by Al-Bukhari, Book of Stories of the Prophets, Chapter: What was mentioned about the Children of Israel 2/419.",
    "book_id": "599",
    "new_page_number": 35
  },
  {
    "serial_number": "112073",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "Al-Khattabi said when explaining this Hadith: \"This may be viewed as problematic, and it might be said: How can he be forgiven when he denied the Resurrection and the Ability to revive the dead? The answer is: He did not deny the Resurrection; rather, he was ignorant and thought that if this was done to him, he would not be brought back and thus not punished. His faith became apparent through his confession that he only did that out of fear of Allah\" (1).\nSimilarly, Khalid bin Dhakwan reported from Ar-Rubay' bint Mu'awwidh (may Allah be pleased with them) that she said: \"The Prophet (peace and blessings be upon him) came and entered when I was consummated (married), and he sat on my bed as you are sitting now. Young girls of ours began playing the Duff (drum) and eulogizing those of my fathers who were killed on the Day of Badr. Then one of them said: 'And among us is a Prophet who knows what is in tomorrow.' He said: 'Leave this, and say what you were saying [before]'\" (2). So the Prophet (peace and blessings be upon him) excused the young girl who attributed knowledge of the Unseen to him.\nThis does not mean not alerting scholars to errors or advising them. Rather, advice should come from a scholar well-grounded in knowledge, whose intent and purpose is to clarify the truth while respecting the opponent. The speech should focus on the statement rather than the speaker, for he should not be personally attacked unless there is a need for that. And Allah knows best.",
    "foot_note": "1. Fath al-Bari 6/522.\n2. Recorded by Al-Bukhari, Book of Marriage, Chapter: Beating the Duff in Marriage and the Wedding Feast 3/374.",
    "book_id": "599",
    "new_page_number": 36
  },
  {
    "serial_number": "112074",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "Second: Ahl al-Sunnah think well [of others] and hate the people of innovation according to the extent of innovation they possess.\nIndeed, Allah (Glorified and Exalted be He) did not make the rulings of this world based on secrets (inner states), but rather on outward appearances, with inner states following them. As for the rulings of the Hereafter, they are based on inner states, with outward appearances following them. So if a Muslim displays soundness of belief while acting in accordance with it, he is judged to be from Ahl al-Sunnah, and it is not for us to dig into what is in his heart.\nAbu Sa'id al-Khudri (may Allah be pleased with him) mentioned the story of the man who questioned the Prophet (peace and blessings be upon him) regarding Zakat and said to him: 'O Messenger of Allah, fear Allah...' [It mentions] that Khalid bin al-Walid (may Allah be pleased with him) asked permission from the Prophet (peace and blessings be upon him) to strike his neck. The Prophet (peace and blessings be upon him) said: \"Perhaps he prays.\" Khalid said: \"And how many who pray say with their tongue what is not in their heart?\" The Messenger of Allah (peace and blessings be upon him) said: \"I have not been commanded to dig into the hearts of people nor to slit open their bellies\" (1).\nTherefore, it is obligatory for everyone who advises himself not to treat people based on other than what appears from them, in compliance with the action of the Prophet (peace and blessings be upon him) and following the example of his Companions (may Allah be pleased with them) who made this a principle in their dealings with others.",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Maghazi, Chapter: Sending of Ali bin Abi Talib and Khalid bin al-Walid to Yemen, 3/162-163.",
    "book_id": "599",
    "new_page_number": 37
  },
  {
    "serial_number": "112075",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "And in the Hadith of Umar bin Al-Khattab (may Allah be pleased with him), he used to say: \"Indeed, people used to be judged by Revelation during the time of the Messenger of Allah (peace and blessings be upon him), but the Revelation has ceased. Now we only judge you by what becomes apparent to us from your deeds. So whoever shows us good, we secure him and bring him close, and we have nothing to do with his inner secret; Allah will hold his inner secret to account. And whoever shows us evil, we do not secure him nor believe him, even if he says his inner secret is good\" (1).\nOn the other hand, Ahl al-Sunnah hate the people of innovation according to the extent of innovation they have. This is a principle among them derived from the issue of Faith (Iman): that if part of Faith goes, not all of it goes. In this, they differed from the people of innovation like the Jahmiyyah, Murji'ah, Kharijites, and Mu'tazilah.\nSheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) established this issue by saying: \"If good and evil, immorality and obedience, sin, Sunnah, and innovation are combined in a single man, he deserves allegiance according to the amount of good within him, and he deserves enmity and punishment according to the amount of evil within him. Thus, the causes for honoring and humiliating convene in a single person; he gathers this and that, like the poor thief: his hand is cut off for his theft, but he is given from the treasury what suffices his need. This is the principle upon which Ahl al-Sunnah wal-Jama'ah agreed, and the Kharijites, Mu'tazilah, and those who agreed with them opposed them on it. They did not consider people as neither deserving",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Witnesses, Chapter: Trustworthy Witnesses, 2/264.",
    "book_id": "599",
    "new_page_number": 38
  },
  {
    "serial_number": "112076",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "of reward only, nor deserving of punishment only. And Ahl al-Sunnah say: Indeed, Allah (Glorified and Exalted be He) punishes in the Fire those He punishes from the people of major sins, then He brings them out of it through the intercession of those He permits to intercede, by the grace of His mercy, as the Sunnah from the Prophet (peace and blessings be upon him) has abundantly stated\" (1).\n\nThird: The agreement of Ahl al-Sunnah wal-Jama'ah on issues of belief, no matter how far apart their lands are.\nAl-Asbahani (may Allah have mercy on him) said: \"Among the things indicating that the People of Hadith are the people of truth is that if you were to peruse all their books authored from their first to their last, their old and their new, despite the difference in their countries and times, and the distance between their lands, with each one living in a different region; you would find them in the clarification of belief following a single method and a single style. They run on a path they do not deviate from, nor do they incline away from it. Their saying in that is one, and their narration is one. You do not see any difference or division among them in anything, however small. Rather, if you gathered all that flowed on their tongues and what they narrated from their predecessors, you would find it as if it came from a single heart and flowed on a single tongue. Is there any evidence for the truth clearer than this?\" (2).\n\nFourth: Ahl al-Sunnah do not declare their opponents disbelievers (Takfir) without evidence.\nSheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) mentioned this in more than one place in his books in",
    "foot_note": "1. Majmoo' al-Fatawa 28/209-210.\n2. Al-Hujjah fi Bayan al-Mahajjah 2/239.",
    "book_id": "599",
    "new_page_number": 39
  },
  {
    "serial_number": "112077",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "response to those who argued for the Takfir (excommunication) of those who interpret [texts incorrectly]: \"This saying is not known from any of the Companions, nor the Tabi'in who followed them in goodness, nor from any of the Imams of the Muslims. Rather, it is fundamentally from the sayings of the people of innovation who invent an innovation and declare those who oppose them to be disbelievers, such as the Kharijites, the Mu'tazilah, and the Jahmiyyah\" (1).\nHe also said: \"The Kharijites declare the People of the Jama'ah to be disbelievers, and likewise the Mu'tazilah declare those who oppose them to be disbelievers, and likewise the Rafidah; and whoever does not declare Takfir, declares [others] corrupt (Fasiq). Likewise, most of the people of desires invent an opinion and declare those who oppose them to be disbelievers. But Ahl al-Sunnah follow the truth from their Lord which the Messenger (peace and blessings be upon him) brought, and they do not declare those who oppose them in it to be disbelievers. Rather, they are the most knowledgeable of the truth and the most merciful to creation\" (2).\nSheikh Abdul Latif bin Abdul Rahman Al-Sheikh (may Allah have mercy on them), when asked about someone who declared some of his opponents to be disbelievers, said: \"The answer is that I do not know of any legal basis or satisfactory proof that contradicts what the Imams of knowledge from Ahl al-Sunnah wal-Jama'ah are upon. This method is the method of the people of innovation and misguidance\" (3).",
    "foot_note": "1. Minhaj al-Sunnah al-Nabawiyyah 5/239-240.\n2. Ibid 5/158.\n3. Majmoo' al-Rasa'il wa al-Masa'il al-Najdiyyah 3/20.",
    "book_id": "599",
    "new_page_number": 40
  },
  {
    "serial_number": "112078",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "Fifth: Their love for Ahl al-Sunnah\nOne of the signs of Ahl al-Sunnah is their love for the Imams of the Sunnah, its scholars, its helpers, and its allies. Allah (Glorified and Exalted be He) has adorned the hearts of Ahl al-Sunnah and illuminated them with their love for the scholars of Ahl al-Sunnah wal-Jama'ah.\nAl-Hakim Abu Abdullah Al-Hafiz—may Allah grant him and us abode in Paradise—said: Muhammad bin Ibrahim bin Al-Fadl told us, Ahmad bin Salamah told us, Abu Raja' Qutaybah bin Sa'id read to us his Book of Iman, and at the end of it was: \"If you see a man loving Sufyan Al-Thawri, Malik bin Anas, Al-Awza'i, Shu'bah, Ibn Al-Mubarak, Abu Al-Ahwas, Sharik, Waki', Yahya bin Sa'id, and Abdul Rahman bin Mahdi, then know that he is a person of Sunnah\" (1).\n\nSixth: They mandate obedience to the Sultan and forbid rebelling against him\nAllah Almighty says: {O you who have believed, obey Allah and obey the Messenger and those in authority among you} (2).\nThis verse is explicit regarding the obligation of obeying the ruler and not rebelling against him. Reports have been authenticated from the Messenger of Allah (peace and blessings be upon him) commanding obedience to Imams and governors in matters that constitute obedience to Allah Almighty and serve the interest of Muslims (3).",
    "foot_note": "1. See: Aqidah Ahl al-Salaf wa Ashab al-Hadith, Al-Sabuni, p. 307.\n2. Surah An-Nisa, Verse 59.\n3. See: Tafsir al-Tabari 8/205.",
    "book_id": "599",
    "new_page_number": 41
  },
  {
    "serial_number": "112079",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "The Sunnah of the Prophet (peace and blessings be upon him) came clarifying, detailing, and interpreting this command. On the authority of Abu Hurairah (may Allah be pleased with him), from the Prophet (peace and blessings be upon him) that he said: \"Whoever obeys me has obeyed Allah, and whoever disobeys me has disobeyed Allah. And whoever obeys the Emir (leader) has obeyed me, and whoever disobeys the Emir has disobeyed me\" (1).\nRebelling against the Sultan is dangerous and results in great corruption. Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: \"Perhaps there is hardly a group known to have rebelled against a holder of authority except that in their rebellion there was corruption greater than the corruption they removed\" (2).\nSheikh Ibn Uthaymeen (may Allah have mercy on him) said: \"Obedience to the ruler is obligatory even if he is among the most corrupt of Allah's servants (Mighty and Majestic is He). This is due to the generality of the evidences indicating the obligation of obeying those in authority, and having patience with them even if we see from them what we dislike in their religion, their justice, and their selfishness. We listen and obey, fulfilling the right that Allah (Mighty and Majestic is He) obligated upon us, and we ask Allah for the right that is ours. This is how the Prophet (peace and blessings be upon him) commanded, and this is how the Predecessors (Salaf) of this Ummah proceeded\" (3).",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Jihad and Siyar, Chapter: Fighting is done from behind the Imam and he is used as a shield 2/347.\n2. Minhaj al-Sunnah al-Nabawiyyah 3/391.\n3. Al-Sharh al-Mumti' 8/18.",
    "book_id": "599",
    "new_page_number": 42
  },
  {
    "serial_number": "112080",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "Rebellion against the ruler is not limited to weapons only; rather, every speech that leads to inciting the subjects against the Imam is rebellion.\nSheikh Saleh Al-Fawzan—may Allah preserve him—said: \"Rebellion against the Imam is not limited to weapons. Rather, speaking against the ruler and reviling him is rebellion and incitement against him, and a cause of tribulation (Fitnah) and evil. Speech is no less dangerous than weapons... Thus, rebellion against the Imam can be by weapons, it can be by speech, and it can be by belief. Even if one does not speak, if he believes that rebelling against the ruler is permissible, he has shared with the Kharijites in their doctrine\" (1).",
    "foot_note": "1. Mawqif al-Muslim min al-Fitan wa al-Muzaharat, p. 20.",
    "book_id": "599",
    "new_page_number": 43
  },
  {
    "serial_number": "112081",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "The Third Topic: Sources of Reception [of Knowledge] for Ahl al-Sunnah wal-Jama'ah\nThe sources of reception for Ahl al-Sunnah wal-Jama'ah are divided into two parts:\n1 - Primary Sources: These are the Book (Quran), the Sunnah, and Ijma (Consensus).\n2 - Secondary Sources: This is the Sound Intellect—Sound Fitrah (natural disposition)—which follows the Quran and Sunnah.\nTherefore, it becomes clear that the fundamental sources for Ahl al-Sunnah wal-Jama'ah are the Quran, the Sunnah, and the Consensus built upon them (1).\n\nThe First Source: The Quran\nAhl al-Sunnah wal-Jama'ah relied on the Book of Allah (Mighty and Majestic is He) and made it a fundamental and primary source in deriving belief and deducing evidence. No issue arises in creed or otherwise that has evidence in the Quran except that they cite it first and prioritize it over others. What aided them in this is that Allah (Mighty and Majestic is He) made its understanding easy; there is no defect in its style, nor strangeness in its expression such that a person of sound taste would be repelled by it. Hence, knowledge of its objectives was accessible to all humans, not exclusive to one over another; rather, everyone has a share in understanding it and realizing Allah's intent in it...",
    "foot_note": "1. See: Al-Fatawa 3/296.",
    "book_id": "599",
    "new_page_number": 44
  },
  {
    "serial_number": "112082",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "...Thus, the invalidity of the claim of the innovators and their lies, and their assertion of a contradiction between transmitted (textual) evidence and rational evidence, becomes apparent (1).\n\nThe Second Source: The Sunnah\nThe Predecessors (Salaf), may Allah have mercy on them, make the Speech of Allah and the speech of His Messenger (peace and blessings be upon him) the foundation that is relied upon, and to which is referred whatever people dispute about. Whatever agrees with them is truth, and whatever opposes them is falsehood (2).\nIbn Hazm (may Allah have mercy on him) says: \"No Muslim who affirms Monotheism (Tawhid) has been heard to refer, during a dispute, to other than the Quran and the report from the Messenger of Allah (peace and blessings be upon him), nor to refuse what is found in them. If he does that after the proof is established against him, he is a defiantly disobedient person (Fasiq). As for the one who does it considering it lawful to leave their command and obligating obedience to someone other than them, he is a disbeliever\" (3).\nIbn Abi al-Izz (may Allah have mercy on him) said: \"Therefore, the obligation is complete submission to the Messenger (peace and blessings be upon him), compliance with his command, and receiving his report with acceptance and belief, without opposing it with a false imagination that he calls reasonable (intellectual), or burdening it with a doubt or skepticism, or prioritizing the opinions of men and the refuse of their minds over it. So he singles him out with arbitration, submission, compliance, and yielding\" (4). Thus, the Sunnah according to the Salaf",
    "foot_note": "1. See: Al-Madkhal li-Dirasat al-Aqidah, Al-Barikan, p. 18.\n2. See: Dar' Ta'arud al-'Aql wa al-Naql, Ibn Taymiyyah 1/277.\n3. Al-Ihkam fi Usul al-Ahkam, Ibn Hazm, p. 988.\n4. Sharh al-Aqidah al-Tahawiyyah, Investigation by Al-Turki 1/288.",
    "book_id": "599",
    "new_page_number": 45
  },
  {
    "serial_number": "112083",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "is revelation that never contradicts the Quran, as the Almighty said: {Nor does he speak from [his own] inclination. It is not but a revelation revealed} (1). It interprets the Quran, clarifies it, and details what is generalized of its rulings (2).\nIbn al-Qayyim (may Allah have mercy on him) said: \"We say a general statement upon which we call Allah Almighty and His angels to witness: that there is nothing in the Hadith of the Messenger of Allah (peace and blessings be upon him) that contradicts the Quran, nor does it contradict sound reason. Rather, his speech is a clarification of the Quran, an interpretation of it, and a detailing of what it generalized\" (3). And he (may Allah have mercy on him) said: \"The origin of every fitnah (trial/discord) is only from prioritizing opinion over legislation (Shari'ah) and desire over intellect\" (4).\n\nThe Third Source: Al-Ijma' (Consensus)\nLinguistically, it refers to two things:\n1 - Gathering, joining, and agreement. Ibn Faris said: \"Jim, Mim, and 'Ayn are a single root indicating the joining of a thing. It is said: I gathered the thing, a gathering... and Jam' of Makkah (5) is named so due to the gathering of people in it, and likewise Yawm al-Jumu'ah (Friday). And I agreed (ajma'tu) on the matter an agreement (ijma'an), and I resolved upon it (ajma'tuhu)\" (6).",
    "foot_note": "1. Surah An-Najm, Verse 4.\n2. See: Al-Ihkam, by Ibn Hazm 1/98-100.\n3. Mukhtasar al-Sawa'iq al-Mursalah 'ala al-Jahmiyyah wa al-Mu'attilah, Ibn al-Qayyim al-Jawziyyah 2/441.\n4. Ighathat al-Lahfan fi Masa'id al-Shaytan, Ibn al-Qayyim 2/167.\n5. Referring to Muzdalifah.\n6. Maqayis al-Lughah 1/479-480.",
    "book_id": "599",
    "new_page_number": 46
  },
  {
    "serial_number": "112084",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "2 - Determination on a matter. Al-Jawhari quoted Al-Kisa'i: \"It is said: 'Ajma'tu al-amr' and 'Ajma'tu 'ala al-amr' (I resolved on the matter): if you determined upon it. And the matter is 'Mujma'' (agreed/resolved upon). And it is said: 'Ajmi' amraka' (Resolve your affair) and do not leave it scattered\" (1).\nTechnically: It is the agreement of the Mujtahids (jurists capable of independent reasoning) of the Ummah after the death of the Messenger (peace and blessings be upon him) in any given era on any given matter (2).\nExcluded by our saying (agreement of the Mujtahids of the Ummah) is: the agreement of the laypeople, for there is no consideration for their agreement or disagreement; the agreement of *some* Mujtahids; and the agreement of previous nations. Our saying: (after the death of the Messenger, peace and blessings be upon him) is a necessary restriction, because consensus does not convene during his time (peace and blessings be upon him). Our saying: (in any given era) is to remove the illusion of anyone imagining that the intended Mujtahids are those who exist until the Day of Judgment; this illusion is invalid, as it leads to the impossibility of conceiving Consensus. Whoever is among the people of Ijtihad at the time the issue arose and the discussion appeared regarding it, is from the people of that era; whoever reaches this [level] after its occurrence is not from the people of that era (3).\nConsensus is a proof according to the majority (Jumhur), contrary to Al-Nazzam, the Shia, and the Kharijites (4). The establishment of proof for the authority of Consensus is from the Quran, the Sunnah, and Reason:",
    "foot_note": "1. Al-Sihah 3/1199, Tahdhib al-Lughah 1/253, Al-Mahsul by Al-Razi 4/19, Lisan al-Arab 8/53.\n2. See: Rawdat al-Nazir wa Jannat al-Munazir 1/376, and Sharh Mukhtasar al-Rawdah 3/5.\n3. See: Al-Bahr al-Muhit fi Usul al-Fiqh 6/379.\n4. See: Minhaj al-Sunnah al-Nabawiyyah 8/340.",
    "book_id": "599",
    "new_page_number": 47
  },
  {
    "serial_number": "112085",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "The Almighty said: {And thus we have made you a just community that you will be witnesses over the people} (1). Sheikh al-Islam Ibn Taymiyyah (may Allah have mercy on him) said: \"Since the Lord (Mighty and Majestic) has made them witnesses, they do not testify to falsehood. So if they testify that Allah commanded something, He has indeed commanded it; and if they testify that Allah forbade something, He has indeed forbidden it\" (2).\nAnd the Almighty said: {You are the best nation produced [as an example] for mankind} (3).\nAnd the Almighty said: {And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination} (4).\nThese two verses obligate following the way of the believers and establish the threat for opposing them. The mode of inference is that Allah (Glorified and Exalted be He) combined opposing the Messenger (peace and blessings be upon him) and following other than the believers' way in the threat. If following other than the believers' way were permissible, He would not have combined it with the prohibited. Following other than their way occurs by opposing their sayings and actions (5).",
    "foot_note": "1. Surah Al-Baqarah, Verse 143.\n2. Al-Fatawa 19/177-178.\n3. Surah Al-Imran, Verse 110.\n4. Surah An-Nisa, Verse 115.\n5. See: Al-Ibhaj Sharh al-Minhaj, Ya'la bin Abdul Kafi and his son 2/353, and Miftah al-Jannah fi al-Ihtijaj bi al-Sunnah, Al-Suyuti, p. 24-25.",
    "book_id": "599",
    "new_page_number": 48
  },
  {
    "serial_number": "112086",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "As for the Sunnah, narrations from the Messenger of Allah (peace and blessings be upon him) have corroborated each other with different wordings but agreeing in meaning regarding the infallibility of this Ummah from error. Indeed, it has been reported via Mutawatir (mass transmission) from him (peace and blessings be upon him) that he said: \"A group of my Ummah will not cease to be manifest upon the truth until the Hour is established\" (1).\nAnd he (peace and blessings be upon him) informed that \"Allah will not gather this Ummah on misguidance\" (2).\nAs for the evidence from reason regarding the authority of Consensus: It is established definitively that our Prophet (peace and blessings be upon him) is the Seal of the Prophets and that his Shari'ah (Law) is permanent until the establishment of the Hour. Then, incidents occurred for which there is no decisive text from the Book of Allah or the Sunnah of His Prophet (peace and blessings be upon him), but the Ummah agreed on their ruling. If it were said that their consensus is not a proof, and that the truth has departed from them, or that they agreed upon error, it would imply that his Shari'ah is not permanent, and this leads to its interruption and its lack of remaining and continuity (3).",
    "foot_note": "1. Recorded by Al-Bukhari, Book of Holding Fast, Chapter: The Saying of the Prophet: A group of my Ummah will not cease... 13/250.\n2. Recorded by Al-Tirmidhi, Book of Tribulations, Chapter: What came regarding adherence to the Jama'ah, No. (2167), 4/466, and he said: This is a Gharib (strange) Hadith from this aspect. The Hadith has supporting evidence in Al-Mustadrak by Al-Hakim, 1/115-116. Ibn Abi Asim recorded it in Al-Sunnah No. (80, 83-84-85), 39, 41-42. Al-Suyuti authenticated it in Al-Jami' al-Saghir, 1/278, No. 1818, and said: A Hasan Hadith.\n3. See: Al-Mustasfa min 'Ilm al-Usul 1/175-176, Rawdat al-Nazir wa Jannat al-Munazir 1/341-342.",
    "book_id": "599",
    "new_page_number": 49
  },
  {
    "serial_number": "112087",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "Conclusion\nThe most important results of this research can be summarized as follows:\n1 - If the term \"Ahl al-Sunnah\" is used absolutely, it refers to one of two meanings:\na. A general meaning: Includes all sects attributing themselves to Islam except the Rafidah.\nb. A specific meaning: It corresponds to the opposite of the innovators and people of desires; this is the most common usage and upon which books of Jarh (criticism) and Ta'dil (praise) are based.\n2 - The Sunnah in the terminology of the Muhaddithin (Hadith scholars) is: What has been transmitted from the Prophet (peace and blessings be upon him) of saying, action, approval, physical description, moral character, or biography, whether it was before the Mission or after it.\n3 - The Sunnah in the terminology of the Usuliyyin (Legal Theorists) is: \"What came transmitted from the Prophet (peace and blessings be upon him) specifically, of that which is not stated in the Mighty Book, but rather was stated from his side (peace and blessings be upon him), whether it was an explanation of what is in the Book or not. It applies to what came from the Prophet (peace and blessings be upon him) of saying, action, or approval.\"\n4 - The Sunnah is used as the opposite of Bid'ah (Innovation).\n5 - The Jama'ah is: Adherence to the truth even if you are alone. It is as Imam Al-Barbahari (may Allah have mercy on him) said: \"What the Companions of the Messenger of Allah (peace and blessings be upon him) united upon during the caliphate of Abu Bakr, Umar, and Uthman (may Allah be pleased with them).\"",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 50
  },
  {
    "serial_number": "112088",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "6 - The history of using the term (Ahl al-Sunnah wal-Jama'ah) dates back to the dawn of Islam, the era of Prophethood, and the favored centuries. Ibn Abbas (may Allah be pleased with them) said regarding the Almighty's saying: {On the Day [some] faces will turn white and [some] faces will turn black}: \"As for those whose faces turn white, they are Ahl al-Sunnah wal-Jama'ah and the people of knowledge. And as for those whose faces turn black, they are the people of innovation and misguidance.\"\n7 - Established legal texts indicate naming Ahl al-Sunnah wal-Jama'ah with this name.\n8 - The Companions (may Allah be pleased with them) used to name themselves with what Allah (Glorified and Exalted be He) named them, complying with the Almighty's saying: {And I have been commanded to be the first of the Muslims}. Indeed, the Predecessors used to warn against naming oneself with other than Islam and the Sunnah. However, when innovations appeared, sects of misguidance multiplied, and every innovator began inviting to his innovation while outwardly attributing themselves to Islam, it became necessary for the people of truth holding fast to the guidance of the Prophet (peace and blessings be upon him) to be known by names distinguishing them from the people of desires and innovations. So they named themselves with names indicating Islam, which are: The Saved Sect, The Victorious Group, The People of Hadith and Athar, and The Jama'ah.\n9 - Ahl al-Sunnah wal-Jama'ah have many characteristics distinguishing them from the people of desires and innovations, including:\n- They do not declare each other innovators merely due to an error in reasoning (Ijtihad).",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 51
  },
  {
    "serial_number": "112089",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "- They think well [of others] and hate the people of innovation according to the extent of innovation they possess.\n- Their agreement on issues of belief no matter how far apart their lands are.\n- They do not declare their opponents disbelievers without evidence.\n- Their love for the people of Sunnah.\n- They mandate obedience to the Sultan and forbid rebelling against him.\n10 - The sources of reception [of knowledge] for Ahl al-Sunnah wal-Jama'ah are the Quran, the Sunnah, and the Consensus (Ijma).\nAnd may Allah send peace and blessings upon our Prophet Muhammad and upon his family and companions all.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 52
  },
  {
    "serial_number": "112090",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "Bibliography and References\n- The Holy Quran.\n(Alif)\n1 - Al-Ihkam, by Ibn Hazm, Investigation: Muhammad Ahmad Abdul Aziz, Maktabat Atif, 1st Ed, 1398 AH.\n2 - Al-Istiqamah, Ahmad bin Abdul Halim bin Taymiyyah Al-Harrani Abu Al-Abbas, Investigation: Dr. Muhammad Rashad Salim, Imam Muhammad bin Saud University, 1st Ed, 1403 AH.\n3 - Usul Madhhab al-Shi'ah al-Imamiyyah al-Ithna 'Ashariyyah: 'Ard wa Naqd (Principles of the Twelver Imamiyyah Shiite Sect: Exposition and Critique), Nasser bin Abdullah bin Ali Al-Qaffari, Dar Al-Rida, 4th Ed, 1431 AH.\n4 - I'lam al-Muwaqqi'in 'an Rabb al-'Alamin, Muhammad bin Abi Bakr Ayyub Al-Zar'i Abu Abdullah, Investigation: Taha Abdul Raouf Sa'd, Dar Al-Jil - Beirut, 1973 AD.\n5 - Ighathat al-Lahfan 'an Masa'id al-Shaytan, Ibn al-Qayyim, Shams al-Din Ibn al-Qayyim al-Jawziyyah, Takhrij by the hadith scholar Muhammad Nasir al-Din al-Albani, Dar Ibn al-Jawzi, 2nd Ed, 1427 AH.\n6 - Anwar al-Tanzil wa Asrar al-Ta'wil, by Abu al-Khayr Abdullah bin Umar al-Baydawi, Mustafa al-Babi al-Halabi Press, Egypt, 2nd Ed, 1388 AH, 1968 AD.\n(Ba)\n7 - Al-Ba'ith 'ala Inkar al-Bida' wa al-Hawadith, Abu Shamah, Shihab al-Din Abd",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 53
  },
  {
    "serial_number": "112091",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "Al-Rahman bin Ismail bin Ibrahim Al-Dimashqi, known as Abu Shamah (d. 665 AH), Investigation: Uthman Ahmad Anbar, Dar Al-Huda, Cairo, 1st Ed, 1398 AH, 1978 AD.\n(Ta)\n8 - Taj al-Arus min Jawahir al-Qamus, Muhammad Murtada Al-Husayni Al-Zubaidi, Dar Al-Hidayah, Investigation: Group of investigators, Kuwait Press, 2nd Ed, 1408 AH.\n9 - Tahdhib al-Lughah, by Abu Mansour Muhammad bin Ahmad Al-Azhari (d. 370 AH), Investigation of Prof. Ahmad Abdul Azim Al-Barduni and Prof. Muhammad Ali Al-Bijawi, Al-Dar Al-Misriyyah lil-Ta'lif.\n10 - Tawjih al-Nazar ila Usul al-Athar, by Sheikh Tahir bin Salih Al-Dimashqi, Al-Maktabah Al-Ilmiyyah, Medina.\n11 - Al-Tawdihat al-Jaliyyah 'ala Sharh al-Aqidah al-Tahawiyyah, Dr. Muhammad bin Abdul Rahman Al-Khamis, Dar Ibn Al-Jawzi, 1st Ed, 1429 AH.\n12 - Taysir al-Karim al-Rahman fi Tafsir Kalam al-Mannan = Tafsir al-Sa'di, by Sheikh Abdul Rahman bin Nasir Al-Sa'di, Dar Ibn Al-Jawzi, 3rd Ed, 1433 AH.\n(Jim)\n13 - Jami' Bayan al-'Ilm wa Fadlihi wa Ma Yanbaghi fi Riwayatihi wa Hamlihi, by the Scholar Imam Abu Umar Yusuf bin Abd al-Barr al-Namari al-Qurtubi (d. 463 AH), Dar",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 54
  },
  {
    "serial_number": "112092",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "Al-Kutub Al-Islamiyyah, 2nd Ed, 408 AH.\n(Ha)\n14 - Al-Hujjah fi Bayan al-Mahajjah wa Sharh Aqidah Ahl al-Sunnah, by Hafiz Qawam al-Sunnah Abu al-Qasim Ismail bin Muhammad bin al-Fadl al-Asbahani, Investigation: Dr. Muhammad bin Rabi' al-Madkhali (Vol 1), and Sheikh Muhammad bin Mahmoud Abu Rahim (Vol 2), Dar Al-Rayah, 1st Ed, 1411 AH.\n15 - Hukm al-Intima' ila al-Firaq wa al-Ahzab wa al-Jama'at al-Islamiyyah, Sheikh Bakr bin Abdullah Abu Zaid, Matabi' al-Dir'iyyah, 1st Ed, 1410 AH.\n(Dal)\n16 - Dar' Ta'arud al-'Aql wa al-Naql, Ahmad bin Abdul Halim bin Taymiyyah Al-Harrani Abu Al-Abbas, Investigation: Muhammad Rashad Salim, Dar Al-Kunuz Al-Adabiyyah, Riyadh, 1391 AH.\n(Ra)\n17 - Risalat al-Imam Abi Nasr al-Sijzi ila Ahl Zabid fi al-Radd 'ala man Ankara al-Harf wa al-Sawt, Investigation: Muhammad Karim Ba Abdullah, Dar Al-Rayah, 1st Ed, 1404 AH.\n18 - Raf' al-Malam 'an al-A'immah al-A'lam, by Sheikh al-Islam Abu Al-Abbas Ahmad bin Abdul Halim Ibn Taymiyyah (d. 728 AH), Mu'assasat Makkah for Printing and Information, and publications of the Islamic University, 5th Ed, 1396 AH.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 55
  },
  {
    "serial_number": "112093",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "19 - Rawdat al-Nazir wa Jannat al-Munazir fi Usul al-Fiqh 'ala Madhhab al-Imam Ahmad bin Hanbal, by Sheikh Muwaffaq al-Din Abdullah bin Ahmad bin Qudamah (d. 620 AH), Maktabat Al-Ma'arif, Riyadh, 2nd Ed, 1404 AH.\n(Shin)\n20 - Sharh al-Sunnah, by Abu Muhammad bin Al-Hasan bin Ali bin Khalaf Al-Barbahari, Investigation: Dr. Muhammad bin Sa'id bin Salim Al-Qahtani, Dar Ibn Al-Qayyim, 1st Ed, 1408 AH.\n21 - Sharh Usul I'tiqad Ahl al-Sunnah wal-Jama'ah, Abu Al-Qasim Hibatullah bin Al-Hasan bin Mansur Al-Tabari Al-Razi Al-Lalaka'i, Investigation: Ahmad bin Sa'd bin Hamdan Al-Ghamdi, Dar Taybah, Saudi Arabia, 8th Ed, 1423 AH, 2003 AD.\n22 - Al-Sharh wa al-Ibanah 'ala Usul al-Sunnah wa al-Diyanah wa Mujanabat al-Mukhalifin wa Mubayanat Ahl al-Ahwa' al-Mariqin, by Ubaydullah Muhammad bin Battah Al-Ukbari (d. 387 AH), Investigation: Rida Na'san Mu'ti, Al-Maktabah Al-Faysaliyyah in Makkah Al-Mukarramah.\n(Sad)\n23 - Sahih al-Bukhari, Imam Al-Hafiz Abu Abdullah Muhammad bin Ismail Al-Bukhari (d. 256 AH), printed with Fath al-Bari by Ibn Hajar Al-Asqalani, numbering by Muhammad Fuad Abdul Baqi and correction by Muhibb al-Din al-Khatib, Dar Al-Ma'rifah, Beirut.\n24 - Sahih Sunan Ibn Majah, Muhammad Nasir al-Din al-Albani, Arab Bureau of Education for the Gulf States, 1st Ed, 1407 AH.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 56
  },
  {
    "serial_number": "112094",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "25 - Sahih Muslim, by Imam Abu Al-Husayn Muslim bin Al-Hajjaj Al-Qushayri Al-Naysaburi (d. 261 AH), Investigation: Muhammad Fuad Abdul Baqi, The Islamic Library, Istanbul, Turkey.\n(Ayn)\n26 - Aqidah al-Salaf wa Ashab al-Hadith, by Imam Abu Uthman Ismail Al-Sabuni (d. 449 AH), printed within Majmu' al-Rasa'il al-Muniriyyah, published by Al-Muniriyyah Printing Administration, owned by Muhammad Munir Abdu, 1970 AD.\n27 - Al-Aqidah al-Tahawiyyah, by Abu Ja'far Ahmad bin Muhammad bin Salamah Al-Azdi Al-Tahawi (d. 321 AH), printed with Sharh al-Aqidah al-Tahawiyyah by Ibn Abi al-Izz, Investigation: Bashir Muhammad Uyun, published by Maktabat Dar Al-Bayan, 1st Ed, 1405 AH.\n(Fa)\n28 - Al-Fatawa al-Sa'diyyah, by Sheikh Abdul Rahman bin Nasir Al-Sa'di, Maktabat Al-Ma'arif, Riyadh, 2nd Ed.\n29 - Al-Farq bayna al-Firaq wa Bayan al-Firqah al-Najiyah, Abdul Qahir bin Tahir bin Muhammad Al-Baghdadi Abu Mansour, Dar Al-Afaq Al-Jadidah, Beirut.\n30 - Al-Fisal fi al-Milal wa al-Ahwa' wa al-Nihal, by Imam Abu Muhammad bin Ali bin Ahmad known as Ibn Hazm Al-Andalusi, Investigation: Dr. Muhammad Ibrahim Nasr and Dr. Abdul Rahman Umayrah, Dar Al-Jil, Beirut, 1405 AH.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 57
  },
  {
    "serial_number": "112095",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "(Lam)\n31 - Lisan al-Arab, Muhammad bin Mukarram bin Ali, Abu Al-Fadl, Jamal al-Din Ibn Manzur Al-Ansari Al-Ruwayfi'i Al-Afriqi (d. 711 AH), Dar Sader, Beirut, 3rd Ed, 1414 AH.\n(Mim)\n32 - Majmoo' Fatawa Sheikh al-Islam Ibn Taymiyyah, Collection and Arrangement: Abdul Rahman bin Muhammad bin Qasim and his son Muhammad, 1st Ed, 1398 AH.\n33 - Mukhtasar al-Sawa'iq al-Mursalah 'ala al-Jahmiyyah wa al-Mu'attilah, by Ibn al-Qayyim al-Jawziyyah, Abridgment: Muhammad Al-Mawsili, Maktabat Al-Riyadh Al-Hadithah, and another edition, Investigation: Sayyid Ibrahim, Dar Al-Hadith, Cairo, 2nd Ed, 1407 AH, 1987 AD.\n34 - Madarij al-Salikin bayna Manazil Iyyaka Na'budu wa Iyyaka Nasta'in, Muhammad bin Abi Bakr Ayyub Al-Zar'i Abu Abdullah, Investigation: Muhammad Hamid Al-Faqi, Dar Al-Kitab Al-Arabi, Beirut, 2nd Ed, 1393 AH, 1973 AD.\n35 - Al-Madkhal li-Dirasat al-Aqidah al-Islamiyyah, Dr. Ibrahim Muhammad Al-Barikan, Dar Al-Sunnah, Al-Khobar, 2nd Ed, 1414 AH, 1993 AD.\n36 - Al-Mustasfa fi 'Ilm al-Usul, by Abu Hamid Al-Ghazali, Amiri Edition, and another edition, Dar Ihya' Al-Turath Al-Arabi, Beirut.\n37 - Ma'arij al-Qabul bi-Sharh Sullam al-Wusul ila 'Ilm al-Usul, Hafiz bin",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 58
  },
  {
    "serial_number": "112096",
    "category_id": "1",
    "category": "Creed",
    "book_title": "Mukhtasar al-Mukhtasar fi Bayan Aqidah Ahl al-Sunnah wa al-Athar",
    "edition": "First Edition, 1441 AH - 2019 AD",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "Ahmad Hakami, Investigation: Umar bin Mahmoud Abu Umar, Dar Ibn Al-Qayyim, Dammam, 1st Ed, 1410 AH, 1990 AD.\n38 - Maqayis al-Lughah, by Abu Al-Husayn Ahmad bin Faris bin Zakariya (d. 390 AH), Investigation: Abdul Salam Muhammad Harun, 2nd Ed, Mustafa Al-Babi Al-Halabi Printing and Publishing Company.\n39 - Minhaj al-Sunnah al-Nabawiyyah, Ahmad bin Abdul Halim bin Taymiyyah Al-Harrani Abu Al-Abbas, Investigation: Dr. Muhammad Rashad Salim, Mu'assasat Qurtubah, 1st Ed, 1406 AH.\n40 - Al-Muwafaqat fi Usul al-Fiqh, Ibrahim bin Musa Al-Lakhmi Al-Gharnati Al-Maliki, Dar Al-Ma'rifah, Beirut, Investigation: Abdullah Draz.",
    "foot_note": "None",
    "book_id": "599",
    "new_page_number": 59
  }
]